{
    "Symbol": "MFSL",
    "ISIN": "INE180A01020",
    "News": [
        {
            "Title": "Max Financial's Subsidiary Shifts Office to Haryana",
            "Summary": "Max Financial Services announces its material subsidiary Axis Max Life Insurance will relocate registered office from Punjab to Gurugram, Haryana effective February 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770907576388,
            "Source": "stocks"
        },
        {
            "Title": "Max Financial Services Schedules Q3 FY26 Earnings Call",
            "Summary": "Max Financial Services Limited announces earnings conference call for February 12, 2026 at 9:00 AM IST to discuss Q3 & 9M FY26 financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770284559865,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Financial Gets Merger Approval with Axis Max Life",
            "Summary": "Max Financial Services receives regulatory green light for potential merger with Axis Max Life Insurance, marking significant development in insurance sector consolidation.",
            "Sentiment": "positive",
            "PublishDate": 1769605285689,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Financial Services Block Trade Worth ₹33.44 Crores",
            "Summary": "Max Financial Services witnessed a significant NSE block trade worth ₹33.44 crores involving 207,569 shares at ₹1610.90 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769577497793,
            "Source": "co_actions_results"
        },
        {
            "Title": "Max Financial Services Gets ESG Rating of 73/100",
            "Summary": "Max Financial Services receives an ESG rating of 73 on a 0-100 scale from SES ESG Research, reflecting the company's performance on environmental, social and governance parameters.",
            "Sentiment": "positive",
            "PublishDate": 1767598513942,
            "Source": "stocks"
        },
        {
            "Title": "Max Financial Services Board Meet on Feb 11, 2026",
            "Summary": "Max Financial Services announces board meeting on February 11, 2026, to approve Q3 FY26 financial results. Trading window closed from January 1-February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766730490460,
            "Source": "co_actions_results"
        },
        {
            "Title": "Government May Allow Insurance-Non-Insurance Firm Mergers, Potentially Enabling Max Financial-Axis Max Life Deal",
            "Summary": "The government is likely to permit mergers between insurance and non-insurance companies, which could facilitate regulatory approval for such transactions. This potential policy change may specifically enable the merger of Max Financial into Axis Max Life Insurance, affecting stakeholders in both entities.",
            "Sentiment": "positive",
            "PublishDate": 1763975441914,
            "Source": "stock"
        },
        {
            "Title": "Max Financial Services Seeks Shareholder Approval for Pradeep Pant's Independent Director Appointment",
            "Summary": "Max Financial Services has issued a postal ballot notice seeking shareholder approval to appoint Pradeep Pant as Independent Director for five years from January 1, 2026 to December 31, 2030, with remuneration up to Rs. 20 lakh per annum. The e-voting period runs from November 22, 2025 to December 21, 2025, with results to be declared on December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763707817061,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Ventures to Sell 0.46% Stake in Max Financial Services via Block Deal Worth ₹270 Crores",
            "Summary": "Max Ventures plans to divest up to 0.46% of its shareholding in Max Financial Services through block deals, setting a floor price of ₹1,675.5 per share. The transaction is structured with a total offer size of ₹270 crores, representing a significant stake sale by the parent entity.",
            "Sentiment": "neutral",
            "PublishDate": 1763642876766,
            "Source": "order&deals"
        },
        {
            "Title": "Max Financial Services Reports 18% Growth in H1 FY26 Despite GST Impact",
            "Summary": "Max Financial Services achieved 18% individual adjusted first year premium growth in H1 FY26, outperforming private sector growth of 8% and industry growth of 2%, while maintaining market share expansion to 10.1%. The company reported embedded value of INR 26,895 crore with 15% year-on-year growth, though faced a 300-350 basis points margin impact from GST changes which it aims to offset through distribution negotiations and cost optimization.",
            "Sentiment": "positive",
            "PublishDate": 1763465699268,
            "Source": "earnings"
        },
        {
            "Title": "Max Financial Management Reaffirms 15-17% Growth Outlook",
            "Summary": "Max Financial's management has confirmed their growth outlook of 15-17% for the fiscal year during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762920750961,
            "Source": "stock"
        },
        {
            "Title": "Max Financial Services Reports Strong Performance with VNB and Premiums Exceeding Estimates",
            "Summary": "Max Financial Services delivered results that significantly outperformed analyst expectations across key metrics. The company reported Value of New Business (VNB) of 9.74 billion rupees, surpassing estimates of 5.59 billion rupees. VNB margin reached 27%, above the estimated 23.17%. New business premium totaled 38.9 billion rupees versus estimates of 34.63 billion rupees. Total Annualized Premium Equivalent (APE) came in at 41.7 billion rupees, substantially higher than the estimated 24.12 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762915838320,
            "Source": "earnings"
        },
        {
            "Title": "Max Financial Services Appoints Pradeep Pant as Independent Director",
            "Summary": "Max Financial Services Limited's Board of Directors approved the appointment of Mr. Pradeep Pant (DIN: 00677064) as an Additional Director (Non-Executive Independent Director) for a five-year term effective January 1, 2026, through December 31, 2030. The appointment is subject to shareholder approval. Mr. Pant brings over 37 years of FMCG industry experience, having served as Executive Vice President and President of Asia Pacific and Eastern Europe, Middle East and Africa for Mondelez International until 2013. He previously held leadership positions at Fonterra Brands, The Gillette Company, Nestle, J Walter Thompson, and the Tata group. Mr. Pant holds a Master of Management Studies degree from Jamnalal Bajaj Institute of Management Studies, Bombay University, and a BA Honours degree in Economics from Shri Ram College of Commerce, Delhi University. He is not related to any other Director of the Company and is not debarred from holding the office of director by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1762910402101,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max Financial Services Reports Quarterly Results; Subsidiary Raises Rs 800 Crores Through NCDs",
            "Summary": "Max Financial Services Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved these results in a meeting held on November 11, 2025. During the quarter, the company's subsidiary Axis Max Life Insurance Limited raised Rs 800 crores by issuing unsecured, subordinated, rated, redeemable, taxable, non-cumulative, non-convertible debentures with a coupon rate of 7.95%. These NCDs were allotted on September 24, 2025, and are redeemable after 10 years with an option for early redemption after one year. The company continues to face uncertainty regarding a show cause notice from SEBI alleging non-compliances with certain regulatory provisions, with no impact given in the current financial results pending the outcome.",
            "Sentiment": "neutral",
            "PublishDate": 1762907391855,
            "Source": "earnings"
        },
        {
            "Title": "MFSL Reports Strong Growth with Individual APE Rising 18% to ₹3,891 Crores",
            "Summary": "MFSL achieved Individual Annual Premium Equivalent (APE) of ₹3,891 crores, marking an 18% year-over-year increase, with market share reaching 10.1%. The company's Value of New Business (VNB) grew 27% to ₹974 crores, maintaining a margin of 23.3%. The insurer strengthened its financial position with solvency ratio improving to 208% and embedded value reaching ₹26,895 crores. MFSL is pursuing product diversification across protection, health, and annuities segments while expanding through new distribution partnerships and digital channels to sustain premium growth.",
            "Sentiment": "positive",
            "PublishDate": 1762871942541,
            "Source": "earnings"
        },
        {
            "Title": "Max Financial Services Reports Sharp Decline in Quarterly Profit and Revenue",
            "Summary": "Max Financial Services reported a consolidated net profit of 41 million rupees for the second quarter, representing a significant decrease from 1.12 billion rupees in the same period last year. The company's revenue also declined to 97.9 billion rupees compared to 134 billion rupees year-over-year. The results show substantial drops in both profitability and top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1762868354845,
            "Source": "earnings"
        },
        {
            "Title": "Max Financial Services Sees Rs. 56.81 Crore Block Trade on NSE",
            "Summary": "Max Financial Services executed a block trade worth Rs. 56.81 crores on the National Stock Exchange. The transaction involved approximately 372,258 shares traded at Rs. 1,526.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761796679836,
            "Source": "order&deals"
        },
        {
            "Title": "Axis Max Life Insurance Appoints Rajkamal Vempati as Non-Executive Director",
            "Summary": "Axis Max Life Insurance, a material subsidiary of Max Financial Services Limited, has appointed Ms. Rajkamal Vempati as an additional director in a non-executive capacity, effective October 1, 2025. She will hold the office until the next Annual General Meeting. Ms. Vempati is nominated by Axis Bank as its representative on the Board, replacing Mr. Arjun Chowdhry whose nomination withdrawal and resignation was disclosed on September 2, 2025. Ms. Vempati serves as Group Executive & Head of Human Resources at Axis Bank and is a member of the Management Committee. She holds a science degree from Himachal Pradesh University and an MBA from XLRI Jamshedpur. Her appointment will be regularized by shareholders at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1759334368020,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max Financial Services Appoints Siddhi Suneja as Company Secretary and Compliance Officer",
            "Summary": "Max Financial Services Limited appointed Ms. Siddhi Suneja as Company Secretary & Compliance Officer, effective October 1, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Suneja, who holds ICSI Membership No. A57747, has been associated with Axis Max Life Insurance Limited for eight years. She will also serve as Nodal Officer for investor claims verification and coordination with the Investor Education and Protection Fund Authority. Suneja has been involved in various capital raising transactions, including Axis infusion and debt raises in 2021 and 2025, and played a key role in organizational structural changes. She is a Commerce and Law graduate and member of the Institute of Company Secretaries of India.",
            "Sentiment": "positive",
            "PublishDate": 1759217837620,
            "Source": "corporate_governance"
        },
        {
            "Title": "Axis Max Life Insurance Raises INR 800.125 Crore Through Debenture Allotment",
            "Summary": "Axis Max Life Insurance Limited, a subsidiary of Max Financial Services Limited, allotted 80,000 debentures with a face value of INR 1,00,000 each through private placement to identified investors. The company raised INR 800.125 crore, including a premium of INR 12.5 lakh, against the issue size of INR 800 crore face value. The debentures carry a coupon rate of 7.95% per annum and have a 10-year tenure with maturity on September 24, 2035, subject to call options. This follows a previous allotment of 50,000 debentures worth INR 500 crore in February, completing the company's approved capital raising initiative of INR 1,300 crore. The debentures are unsecured, subordinated, and will be listed on the National Stock Exchange of India Limited upon final approval.",
            "Sentiment": "positive",
            "PublishDate": 1758731497307,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Financial Services Announces GST Exemption for Individual Life Insurance Policies",
            "Summary": "Max Financial Services Limited disclosed that the GST council approved exemption of individual life insurance policies from GST effective September 22, 2025. The company expects the impact on its material subsidiary Axis Max Life Insurance Limited's embedded value to be less than 1%. Max Financial believes this change will improve affordability for consumers in the pure protection business and help reduce the protection gap. The company is preparing its systems and processes for the transition.",
            "Sentiment": "positive",
            "PublishDate": 1757044351409,
            "Source": "stock"
        },
        {
            "Title": "Max Financial Services Reports 32% Growth in Value of New Business for Q1 FY26",
            "Summary": "Max Financial Services reported strong quarterly results with individual adjusted first-year premium growing 23% and value of new business increasing 32% to INR335 crore. The company's new business margin expanded from 17.5% to 20.1%. Consolidated revenue grew 18% to INR6,194 crore while profit after tax stood at INR86 crore. The company launched Smart VIBE product, reducing ULIP share from 43% to 36%. Embedded value reached INR26,478 crore, up 20%. Managing Director Prashant Tripathy announced he will step down on September 30, with Sumit Madan taking over as CEO from October 1. The company maintained its margin guidance of 24-25% for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755172763612,
            "Source": "earnings"
        },
        {
            "Title": "Max Financial Services Releases Quarterly Financial Results",
            "Summary": "Max Financial Services Limited published its unaudited financial results for the quarter ended June 30, 2025. The Board of Directors approved the results at their meeting held on August 7, 2025. The company made both standalone and consolidated results available on stock exchange websites (NSE and BSE) and its company website, with a Quick Response code provided for easy access. The results were also published in newspapers with the QR code and weblink included.",
            "Sentiment": "neutral",
            "PublishDate": 1754740220648,
            "Source": "earnings"
        },
        {
            "Title": "Max Financial Targets ₹1,000 Crore Annual Profit and ₹1.6 Lakh Crore AUM by FY27",
            "Summary": "Max Financial has outlined its growth strategy focusing on protection products, non-participating policies, digital-led bancassurance, and its partnership with Axis. The company aims to achieve ₹1,000 crore in annual profit and consolidated assets under management of ₹1.6 lakh crore by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1754577971794,
            "Source": "stock"
        },
        {
            "Title": "Max Financial Services Reports Strong Q1 FY26 Results with 18% Revenue Growth and Key Corporate Changes",
            "Summary": "Max Financial Services Limited reported quarterly results showing MFSL revenue excluding investment income at Rs 6,194 crore, growing 18% during the period. Consolidated Profit After Tax reached Rs 86 crore. The company's insurance subsidiary Axis Max Life Insurance demonstrated strong performance with Individual Adjusted first year Premium at Rs 1,553 crore, growing 23% versus private industry growth of 8%. Private market share expanded to 10.0% from 8.8% in the previous year period. Value of New Business grew 32% to Rs 335 crore with New Business Margin improving to 20.1% from 17.5%. The Board of Directors approved shifting the company's registered office from Punjab to Haryana, appointed M/s. Sanjay Grover and Associates as new Secretarial Auditors for five years effective April 1, 2025, and accepted the resignation of Company Secretary and Compliance Officer Piyush Soni, effective September 30, 2025. The company maintained leadership position in overall e-commerce with rank #1 in online protection and online savings, while successfully onboarding 15 new distribution partners during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754577560766,
            "Source": "earnings"
        },
        {
            "Title": "Max Financial Services Reports 47% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Max Financial Services reported a consolidated net profit of 696 million rupees for Q1, down from 1.3 billion rupees in the same quarter last year, representing a 47% year-over-year decline. However, the company's revenue increased to 128.2 billion rupees compared to 117.9 billion rupees in the previous year's corresponding quarter, showing an 8.7% growth.",
            "Sentiment": "negative",
            "PublishDate": 1754575220175,
            "Source": "earnings"
        },
        {
            "Title": "IRDAI Decides Against Limiting Bancassurance Through Parent Banks for MAX Financial",
            "Summary": "The Insurance Regulatory and Development Authority of India (IRDAI) has decided not to impose restrictions on bancassurance operations conducted through parent banks for MAX Financial. This regulatory decision allows the company to continue its bancassurance distribution model without limitations.",
            "Sentiment": "positive",
            "PublishDate": 1754027445395,
            "Source": "stock"
        },
        {
            "Title": "Max Financial Receives Regulatory Approval for Promoter Reclassification",
            "Summary": "Max Financial has obtained regulatory approval for promoter reclassification. The company states this development will enable increased strategic flexibility, improve professional governance, and enhance institutional participation.",
            "Sentiment": "positive",
            "PublishDate": 1753808295904,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max Financial Services Receives Stock Exchange Approval for Promoter Reclassification",
            "Summary": "Max Financial Services Limited has received no-objection letters from both BSE and National Stock Exchange of India Limited on July 29, 2025, approving the reclassification of Ms. Neelu Analjit Singh from 'Promoter and Promoter Group' category to 'Public' category of shareholders. The company had originally applied for this reclassification on April 16, 2025. Both exchanges granted approval under Regulation 31A of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015. The company is required to ensure compliance with subsequent relevant disclosures of material events related to this reclassification.",
            "Sentiment": "neutral",
            "PublishDate": 1753806839118,
            "Source": "corporate_action"
        },
        {
            "Title": "Max Financial: GST May Be Removed From Term Life And Senior Health Insurance",
            "Summary": "Max Financial has indicated that GST could potentially be eliminated on term life insurance and senior health insurance products. This development relates to possible tax policy changes affecting these specific insurance categories.",
            "Sentiment": "positive",
            "PublishDate": 1753175542935,
            "Source": "stock"
        },
        {
            "Title": "Axis Bank Set to Become Promoter in Max Life Insurance Through Additional Stake Purchase",
            "Summary": "Axis Bank is positioned to become a promoter in Max Life Insurance following plans to acquire additional stake in the company. The bank is expected to approach the Reserve Bank of India (RBI) for approval to acquire another 10% stake in Axis Max Life after resolving its current case with SEBI. This regulatory approval process will be initiated once the ongoing SEBI matter is settled.",
            "Sentiment": "neutral",
            "PublishDate": 1753170214240,
            "Source": "order&deals"
        },
        {
            "Title": "IRDAI Panel Recommends Against Merging Insurers with Non-Insurers",
            "Summary": "An IRDAI panel has suggested that merging insurance companies with non-insurance entities should not be permitted. This recommendation could potentially impact Max Financial, although the specific implications for the company are not detailed in the provided news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752731339000,
            "Source": "default"
        },
        {
            "Title": "Axis Max Life Insurance: Data Breach Claim Under Investigation",
            "Summary": "Axis Max Life Insurance received an anonymous tip claiming unauthorized access to customer data. The company has initiated an information security assessment and investigation. Q4 FY25 results show 6% YoY growth in total APE to ₹3,039 crore and 8% YoY increase in VNB to ₹882 crore. VNB margin improved to 29.02%.",
            "Sentiment": "neutral",
            "PublishDate": 1751464022000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Axis Max Life Insurance Investigates Potential Data Breach",
            "Summary": "Axis Max Life Insurance, a subsidiary of Max Financial Services, has received an anonymous message indicating unauthorized access to customer data. The company is responding by conducting an information security assessment and reviewing data logs. Additionally, they have initiated an in-depth investigation with the assistance of security experts to address the potential data breach.",
            "Sentiment": "negative",
            "PublishDate": 1751461445000,
            "Source": "default"
        },
        {
            "Title": "Max Financial Services Schedules Q1 Results Review",
            "Summary": "Max Financial Services has announced that it will review its Q1 results on August 7. No further details about the financial performance or expectations were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750914992000,
            "Source": "default"
        },
        {
            "Title": "Max Financial Services: Citi Initiates 'Buy' Rating with ₹1,840 Target",
            "Summary": "Citi initiated coverage on Max Financial Services Ltd. with a 'Buy' rating and a price target of ₹1,840, implying a 16% upside. The stock has risen 45% in 2025. Citi cites balanced product mix, diversified distribution channels, and growing confidence in Axis Bank's stability post-rebranding as positives. However, regulatory headwinds and taxation implications contribute to a 20% holding company discount.",
            "Sentiment": "positive",
            "PublishDate": 1750132374000,
            "Source": "normal_news"
        },
        {
            "Title": "Max Financial Services: Sumit Madan Appointed as New MD and CEO of Axis Max Life Insurance",
            "Summary": "Sumit Madan will succeed Prashant Tripathy as MD and CEO of Axis Max Life Insurance, effective October 1, 2025. Madan, currently Chief Distribution Officer, brings 25 years of experience in banking and financial services. The appointment is subject to shareholder and IRDAI approval, with a five-year term until September 30, 2030.",
            "Sentiment": "positive",
            "PublishDate": 1749563155000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max Financial Services Ltd: Block Trade of 408,599 Shares",
            "Summary": "A block trade of approximately 408,599 shares of Max Financial Services Ltd occurred on the National Stock Exchange (NSE). The trade was valued at Rs. 61.62 crores, with shares priced at Rs. 1508.00 each.",
            "Sentiment": "neutral",
            "PublishDate": 1749186285000,
            "Source": "block_details"
        },
        {
            "Title": "Max Financial Services: CEO of Insurance Arm Announces Early Retirement",
            "Summary": "Prashant Tripathy, MD & CEO of Max Life Insurance, plans to retire by September 2025. Jefferies maintains 'buy' rating with ₹1,700 target price, suggesting 13% upside. Company seeks internal succession. Shares down 3% on news.",
            "Sentiment": "neutral",
            "PublishDate": 1748492828000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Block Trade of Max Financial Services Ltd. Shares on NSE",
            "Summary": "A block trade of approximately 500,628 shares of Max Financial Services Ltd. occurred on the National Stock Exchange (NSE) for Rs. 73.42 crores. The shares were traded at a price of Rs. 1466.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747988465000,
            "Source": "block_details"
        },
        {
            "Title": "Max Financial Services Reports Q4 FY23 Results",
            "Summary": "Max Financial Services announced its Q4 FY23 financial results. The company reported a consolidated net profit of 313 million rupees, compared to a loss of 440.5 million rupees in the same quarter last year and a profit of 560 million rupees in the previous quarter. Revenue for Q4 stood at 123.75 billion rupees, down from 148.9 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747181856000,
            "Source": "default"
        },
        {
            "Title": "Max Financial Services: Q4 Results Show Strong Growth in Retail APE and VNB",
            "Summary": "Max Financial Services reported Q4 FY25 results with total APE up 6% YoY to ₹3,039 crore. Retail APE grew 11% YoY to ₹2,977 crore. VNB increased 8% to ₹882 crore, beating estimates. VNB margin improved to 29.02%. FY25 saw 18% overall APE growth, 26% proprietary channel APE growth, and 13% increase in gross written premium to ₹33,223 crore. AUM grew 16% to ₹1.75 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1747156426000,
            "Source": "earnings"
        },
        {
            "Title": "Max Financial Services Reports Q4 Profit, Revenue Decline",
            "Summary": "Max Financial Services reported a consolidated net profit of 313 million rupees in Q4, compared to a loss of 440.5 million rupees in the same quarter last year. However, the company's revenue decreased to 123.75 billion rupees from 148.9 billion rupees year-over-year. Sequentially, the profit improved from 560 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747147328000,
            "Source": "result"
        },
        {
            "Title": "MAX FINANCIAL SERVICES LTD. Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving MAX FINANCIAL SERVICES LTD. Approximately 621,696 shares were traded at a price of Rs. 1200.00 per share, resulting in a total transaction value of Rs. 74.60 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1744866760000,
            "Source": "block_details"
        },
        {
            "Title": "Max Financial Services: New CFO Appointed Effective May 1",
            "Summary": "Max Financial Services Ltd. has appointed Nishant Kumar Gehlawat as the new CFO, effective May 1. Gehlawat, with nearly two decades at the company, replaces Amrit Pal Singh, who will step down on April 30 but retain his CFO role at Axis Max Life Insurance Ltd. Gehlawat has extensive experience in finance, corporate development, treasury, and investor relations, having played key roles in major corporate transactions for Max Group.",
            "Sentiment": "positive",
            "PublishDate": 1744712180000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Max Financial Services Ltd: Major Block Deal of ₹569 Crore",
            "Summary": "51.16 lakh shares (1.5% equity) of Max Financial Services Ltd changed hands in a pre-open block deal at ₹1,112 per share, totaling ₹569 crore. Promoters of Max Ventures were reportedly looking to sell a 1.6% stake. The company's Q3 net profit declined 62.3% YoY to ₹56 crore, while NII increased 61.2% to ₹122.8 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1743046569000,
            "Source": "block_deals"
        },
        {
            "Title": "Max Ventures Investment Holding to Sell Stake in Max Financial",
            "Summary": "Max Ventures Investment Holding is reportedly planning to sell up to 1.59% stake in Max Financial through block deals. The offer price is set at ₹1,117.6 per share, with the total block deal size estimated at 611.6 crore rupees. This information comes from sources cited by CNBCTV18.",
            "Sentiment": "neutral",
            "PublishDate": 1743034304000,
            "Source": "block_deals"
        },
        {
            "Title": "Max Ventures Investment Holding to Sell Stake in Max Financial",
            "Summary": "Max Ventures Investment Holding is planning to sell up to 1.59% stake in Max Financial Services through block deals. The offer price is set at ₹1,117.6 per share, with the total block deal size estimated at 611.6 crore rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1743007660000,
            "Source": "block_deals"
        },
        {
            "Title": "Max Financial Services Schedules Board Meeting for Q4 Results",
            "Summary": "Max Financial Services has announced a board meeting scheduled for May 13 to consider and approve the financial results for the fourth quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1742882942000,
            "Source": "corporate_action"
        },
        {
            "Title": "Block Trade of Max Financial Services Ltd. Shares on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Max Financial Services Ltd. Approximately 1,184,205 shares were traded at a price of Rs. 1013.85 per share, totaling Rs. 120.06 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1741165482000,
            "Source": "block_deals"
        }
    ]
}