{
    "Symbol": "MGEL",
    "ISIN": "INE0APB01032",
    "News": [
        {
            "Title": "Mangalam Global Seeks Stock Exchange Nod for Promoter Reclassification",
            "Summary": "Mangalam Global Enterprise Limited has submitted application to BSE and NSE seeking no-objection for reclassification of promoter group member Ms. Radhika Bansal to public category under SEBI LODR Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769178100262,
            "Source": "stocks"
        },
        {
            "Title": "Mangalam Global Forms Organic Products Subsidiary",
            "Summary": "Mangalam Global Enterprise Limited incorporates subsidiary Mangalam Vanasya Organic Private Limited with ₹10 lakh capital for organic products manufacturing and trading business.",
            "Sentiment": "positive",
            "PublishDate": 1769173361501,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Global Enterprise Announces ESOP 2026 Postal Ballot",
            "Summary": "Mangalam Global Enterprise Limited issues postal ballot notice for Employee Stock Option Plan 2026 with remote e-voting from January 22 to February 20, 2026, seeking approval for 33 lakh stock options.",
            "Sentiment": "positive",
            "PublishDate": 1768998285316,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Global Enterprise Q3FY26 Results Announced",
            "Summary": "Mangalam Global Enterprise Limited announced Q3FY26 financial results with revenue from operations at ₹62,004.80 lakhs standalone and ₹75,615.96 lakhs consolidated for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768309037277,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Global Enterprise Q3 EBITDA Rises 14.3%",
            "Summary": "Mangalam Global Enterprise reported Q3 EBITDA of ₹128.00 million, up 14.3% YoY from ₹112.00 million, though EBITDA margin compressed to 1.69% from 2.22% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1768308352387,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Global Enterprise Q3 Profit Jumps 44%",
            "Summary": "Mangalam Global Enterprise reported strong Q3 performance with net profit rising 44% to ₹85 million and revenue surging 52% to ₹7.60 billion compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768308111819,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Global to Open 100 NEAT EVERYDAY Stores",
            "Summary": "Mangalam Global Enterprise announces ambitious retail expansion plan to open 100 new stores under wellness brand NEAT EVERYDAY by March 2028, citing strong market acceptance.",
            "Sentiment": "positive",
            "PublishDate": 1768287075359,
            "Source": "stocks"
        },
        {
            "Title": "Mangalam Global Sets Up Dubai Trading Subsidiary",
            "Summary": "Mangalam Global Enterprise Limited incorporates wholly owned subsidiary MANGALAM GLOBAL GENERAL TRADING FZE in Dubai with AED 3.67 million capital for general trading operations.",
            "Sentiment": "positive",
            "PublishDate": 1768230799105,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Global Board Meet Set for Jan 13, 2026",
            "Summary": "Mangalam Global Enterprise schedules board meeting to review Q3FY26 results and approve new Employee Stock Option Plan 2026. Trading window remains closed until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1767781859021,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Global Enterprise Approves Incorporation of Organic Products Subsidiary",
            "Summary": "Mangalam Global Enterprise's board approved the incorporation of subsidiary company 'Mangalam Vanasya Organic Private Limited' for manufacturing and trading organic products, food products, ayurvedic healthcare products, and cereals. The company will subscribe to 55,000 equity shares worth Rs. 5,50,000 for a 55% shareholding in the proposed subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1764073845983,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Global Enterprise Incorporates Wholly Owned Subsidiary for Oleo Specialty Products",
            "Summary": "Mangalam Global Enterprise Limited has incorporated Mangalam Oleo Specialty Products Private Limited as a wholly owned subsidiary with authorized and paid-up capital of Rs. 1,00,000. The subsidiary will focus on manufacturing and trading of oleo specialty products including vegetable oils, animal fats, and their derivatives through processing, refining, and related operations.",
            "Sentiment": "positive",
            "PublishDate": 1763470944100,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Global Enterprise Reports 24% Revenue Growth in Q2",
            "Summary": "Mangalam Global Enterprise reported quarterly revenue of 7 billion rupees compared to 5.63 billion rupees in the same period last year, representing a year-over-year increase of approximately 24%.",
            "Sentiment": "positive",
            "PublishDate": 1760506358685,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Global Enterprise Reports 218% Jump in Q2 Net Profit Despite Lower EBITDA",
            "Summary": "Mangalam Global Enterprise reported a net profit of 178 million rupees in Q2, marking a significant increase from 56 million rupees in the same period last year. The company recorded an exceptional gain of 193 million rupees during the quarter. However, profit before tax declined to 86 million rupees from 96 million rupees year-over-year. EBITDA decreased to 115 million rupees from 144 million rupees, while EBITDA margin compressed to 1.62% from 2.57% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1760505887322,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Global Enterprise Reports 65% Revenue Growth in Q1 with Strong Profitability",
            "Summary": "Mangalam Global Enterprise Limited reported standalone revenue from operations of Rs. 79,340.55 lakhs for the quarter ended June 30, 2025, representing a 26% increase from the previous quarter and 26% growth year-over-year. Net profit after tax reached Rs. 587.58 lakhs compared to Rs. 506.94 lakhs in the same quarter last year. On a consolidated basis, revenue from operations stood at Rs. 85,854.36 lakhs with net profit of Rs. 643.22 lakhs. The company invested USD 400,000 (Rs. 352.32 lakhs) in its Singapore subsidiary Mangalam Global (Singapore) Pte. Ltd. to increase sales and revenue. The company operates primarily in agro-based commodities and has two wholly-owned subsidiaries. SEBI has issued show-cause notices regarding financial statements for FY 2019-22, and the company has filed preliminary responses along with settlement applications. The board completed a stock split from Rs. 2 face value to Rs. 1 face value per share in March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753964583489,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Global Enterprise Schedules Board Meeting for July 31, 2025 to Approve Quarterly Financial Results",
            "Summary": "Mangalam Global Enterprise Limited will hold a Board of Directors meeting on July 31, 2025, at its registered office in Ahmedabad. The board will consider and approve standalone and consolidated unaudited financial results for the quarter ended June 30, 2025, along with limited review reports. The company has closed its trading window for insiders effective July 1, 2025, which will remain closed until 48 hours after the financial results are declared. The meeting will also address other business matters.",
            "Sentiment": "neutral",
            "PublishDate": 1753268772617,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalam Global Enterprise Opens First 'NEAT EVERYDAY' Retail Store in Indore",
            "Summary": "Mangalam Global Enterprise Limited opened its first retail store under the wellness brand 'NEAT EVERYDAY' in Indore, Madhya Pradesh. The store is located at C21 Mall on A.B. Road and represents a significant milestone in the company's retail growth strategy. The NEAT EVERYDAY brand focuses on high-quality nutraceutical and wellness vegan healthcare products designed for daily consumer needs. This launch is part of the company's forward integration strategy, leveraging their existing processing capacity at their Jotana, Gujarat facility where nutra oils are produced in-house to ensure quality consistency and supply chain efficiency. The company expects incremental sales to be earnings accretive due to higher margins associated with these products, and noted that NEAT products have achieved strong market acceptance and favorable consumer response.",
            "Sentiment": "positive",
            "PublishDate": 1753162087569,
            "Source": "stock"
        }
    ]
}