{
    "Symbol": "MGL",
    "ISIN": "INE002S01010",
    "News": [
        {
            "Title": "MGL Q3FY26 Results: Revenue Up 11.6% YoY, Declares ₹12 Dividend",
            "Summary": "Mahanagar Gas reports Q3FY26 revenue of ₹2,265.97 crore, up 11.6% YoY. Net profit at ₹201.97 crore, down 9.5% YoY. Board declares interim dividend of ₹12 per share with February 13, 2026 record date.",
            "Sentiment": "neutral",
            "PublishDate": 1770482660570,
            "Source": "co_actions_results"
        },
        {
            "Title": "MGL Board Meet on Feb 7 for Q3FY26 Results & Dividend",
            "Summary": "Mahanagar Gas Limited has scheduled its board meeting for February 07, 2026, to approve Q3FY26 financial results and consider interim dividend declaration for shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1769669132449,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahanagar Gas Shows Double Bottom Pattern Reversal",
            "Summary": "Mahanagar Gas Ltd forms double bottom pattern on 2-hour chart, signaling potential near-term bullish reversal with breakout above neckline at ₹1,060 support level amid technical indicator confirmation.",
            "Sentiment": "positive",
            "PublishDate": 1768917968737,
            "Source": "stocks"
        },
        {
            "Title": "MGL Announces Full Restoration of GAIL Gas Supply to Mumbai by November 18 Afternoon",
            "Summary": "Mahanagar Gas Limited announced that GAIL's gas supply to Mumbai and its suburbs will be fully restored by the afternoon of November 18, 2025. The restoration will benefit gas consumers across Mumbai and suburban areas who were affected by the supply disruption.",
            "Sentiment": "negative",
            "PublishDate": 1763524096360,
            "Source": "stock"
        },
        {
            "Title": "Mahanagar Gas Appoints Two New Directors Following Shareholder Approval",
            "Summary": "Mahanagar Gas Limited shareholders approved the appointment of Ajay Sinha as Deputy Managing Director for 5 years and Pankaj Kuchhal as Independent Director for 3 years, both effective from August 23, 2025. The appointments bring over three decades of Oil & Gas industry experience in Sinha and 38 years of downstream sector expertise in Kuchhal to strengthen the company's leadership team.",
            "Sentiment": "positive",
            "PublishDate": 1763472448021,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas Focuses on Volume Growth, Plans Major CNG Station Expansion",
            "Summary": "Mahanagar Gas has announced its strategic shift to prioritize volume growth over maintaining margins. The company plans to establish a new CNG station featuring 55-56 dispensing arms, with completion targeted for March-April.",
            "Sentiment": "positive",
            "PublishDate": 1761882257299,
            "Source": "stock"
        },
        {
            "Title": "Mahanagar Gas Reports 41% Decline in Q2 Net Profit to 1.9B Rupees",
            "Summary": "Mahanagar Gas reported Q2 net profit of 1.9 billion rupees, down from 3.2 billion rupees in the previous quarter, missing analyst estimates of 2.63 billion rupees. Revenue declined slightly to 22.6 billion rupees from 22.8 billion rupees quarter-on-quarter. EBITDA fell to 3.4 billion rupees from 4.85 billion rupees, below estimates of 3.79 billion rupees. EBITDA margin compressed to 14.99% from 22.47% in the previous quarter, significantly lower than the estimated 19.2%.",
            "Sentiment": "negative",
            "PublishDate": 1761740672689,
            "Source": "earnings"
        },
        {
            "Title": "MGL Schedules Quarterly Results Review for October 29",
            "Summary": "MGL has announced it will review its quarterly results on October 29. The company has set this date for the review of its financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1761129379947,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Seeks Shareholder Approval for Two Director Appointments via Postal Ballot",
            "Summary": "Mahanagar Gas Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Ajay Sinha as Whole-Time Director designated as Deputy Managing Director and Mr. Pankaj Kuchhal as an Independent Director. Both appointments are effective from August 23, 2025. Mr. Sinha, nominated by GAIL (India) Limited, will serve a 5-year term until August 22, 2030, with a current salary structure of Rs. 2,44,520 per month basic salary plus allowances totaling Rs. 2,80,417.20 per month. Mr. Kuchhal will serve a 3-year term as Independent Director until August 22, 2028. The e-voting period runs from October 19 to November 17, 2025, with results to be declared by November 19, 2025. The cut-off date for eligible voting members is October 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760611627556,
            "Source": "corporate_action"
        },
        {
            "Title": "Fire at ONGC Uran Plant Disrupts Gas Supply; MGL Prioritizes PNG Over CNG in Mumbai",
            "Summary": "A fire broke out at ONGC's Uran gas processing plant around 3 pm and was extinguished after two hours with no injuries reported. The incident impacted Mahanagar Gas Limited's gas supply to its city gate station at Wadala. MGL is prioritizing uninterrupted supply to domestic PNG consumers while warning that CNG availability may be affected across Mumbai due to low pipeline pressure. The company has urged industrial and commercial customers to switch to alternative fuels. Full restoration of gas supplies is expected once ONGC resumes normal operations.",
            "Sentiment": "negative",
            "PublishDate": 1757395457701,
            "Source": "stock"
        },
        {
            "Title": "MGL Faces Rs. 54.33 Cr GST Liability with Interest and Penalty for 2017-2022 Period",
            "Summary": "MGL received a GST appeal order confirming a liability of Rs. 54.33 crores plus interest and 100% penalty for the period from July 2017 to March 2022. The company plans to appeal this decision to the GST Appellate Tribunal. Based on its legal assessment, MGL expects no economic outflow from this matter.",
            "Sentiment": "negative",
            "PublishDate": 1756214947594,
            "Source": "stock"
        },
        {
            "Title": "Mahanagar Gas Appoints Ajay Sinha as Deputy MD and Pankaj Kuchhal as Independent Director",
            "Summary": "Mahanagar Gas Limited's Board of Directors approved two key appointments effective August 23, 2025. Ajay Sinha has been appointed as Deputy Managing Director for five years until August 22, 2030, bringing over three decades of Oil and Gas industry experience. He is an Electrical Engineer from University of Roorkee with an MBA from IIT Delhi, and previously served as Head of Marketing at GAIL Gas Limited. Pankaj Kuchhal has been appointed as Non-Executive Independent Director for three years until August 22, 2028. He brings 38 years of downstream Oil & Gas experience and previously served as CEO of IHB Limited. Both appointments are subject to shareholder approval. Neither appointee is related to existing directors or debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1755876137602,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahanagar Gas Completes Merger with Subsidiary Unison Enviro, Increases Authorized Capital to Rs 2,800 Crore",
            "Summary": "Mahanagar Gas Limited (MGL) completed the amalgamation of its wholly owned subsidiary Unison Enviro Private Limited (UEPL) on August 16, 2025. The merger scheme was sanctioned by the National Company Law Tribunal, Mumbai Bench, and the certified copy was filed with the Registrar of Companies. Following the amalgamation, UEPL has been dissolved and merged into MGL. As part of the merger, MGL's authorized share capital has been increased to Rs 2,800 crore, divided into 28 crore shares of Rs 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1755328938868,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas Sets August 14 Record Date for Rs. 18 Final Dividend",
            "Summary": "Mahanagar Gas Limited has fixed August 14, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 18 per equity share for financial year 2024-25. The dividend represents 180% of the face value of Rs. 10 per share and is subject to shareholder approval at the Annual General Meeting scheduled for August 22, 2025. The Board of Directors recommended this dividend at their meeting held on May 6, 2025. If approved, the dividend will be paid within 30 days from the AGM date, subject to applicable tax deductions, to shareholders whose names appear in the register as of the record date.",
            "Sentiment": "positive",
            "PublishDate": 1753983225069,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas Q1 FY26 Results: 9.6% Volume Growth, EBITDA Rises 28% to ₹485 Crores",
            "Summary": "Mahanagar Gas Limited reported quarterly results with overall average gas sales increasing 9.61% to 4.229 mmscmd from 3.858 mmscmd in the corresponding quarter last year. CNG sales volume grew 7.54% to 2.981 mmscmd, while industrial and commercial sales surged 26.09% to 0.679 mmscmd. EBITDA from operations jumped 28% to ₹485 crores compared to the previous quarter's ₹378 crores. Net profit after tax increased 29% to ₹324 crores from ₹252 crores in the previous quarter. The company added 16,348 domestic household connections, bringing total connectivity to 2.85 million households, and laid 79.08 kilometers of pipeline. CNG vehicle registrations increased by 20,332 during the quarter, reaching over 1.1 million vehicles. The NCLT approved the amalgamation scheme of subsidiary UEPL with MGL, with the merger expected to be effective by August 15. The company plans CAPEX of ₹1,100-1,300 crores for the next two years and targets adding 80 new CNG stations this year.",
            "Sentiment": "positive",
            "PublishDate": 1753885630493,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Expects Improved Profit Margins on Lower Gas Prices",
            "Summary": "Mahanagar Gas anticipates better profit margins driven by lower gas prices and potentially higher Brent prices compared to Q1. The company reported notable improvement in EBITDA margins during its earnings call update.",
            "Sentiment": "positive",
            "PublishDate": 1753328221693,
            "Source": "stock"
        },
        {
            "Title": "Mahanagar Gas Projects Strong Volume Growth Across Business Segments",
            "Summary": "Mahanagar Gas expects 30% annual volume growth for UEPL over the next 2-3 years. The company also projects growth of 15-30% for GA3. These growth projections were shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1753327692444,
            "Source": "stock"
        },
        {
            "Title": "Mahanagar Gas Receives NCLT Approval for Subsidiary Amalgamation",
            "Summary": "Mahanagar Gas Limited has received the certified true copy of the order from the National Company Law Tribunal, Mumbai Bench, approving the amalgamation of its wholly owned subsidiary, Unison Enviro Private Limited, with itself. The NCLT had pronounced the order on July 09, 2025, and the company received the certified copy on July 23, 2025. The scheme will become effective upon filing the order with the Registrar of Companies, Maharashtra at Mumbai by both the transferor and transferee companies. This follows previous disclosures made by the company on October 24, 2024, November 11, 2024, and July 09, 2025 regarding the amalgamation scheme.",
            "Sentiment": "positive",
            "PublishDate": 1753277219165,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas Reports 24% Revenue Growth in Q1 FY26 Results",
            "Summary": "Mahanagar Gas Limited reported revenues of ₹1,975.92 crore for the quarter ended June 30, 2025, representing a 24.30% year-over-year increase from ₹1,589.63 crore in the same period last year. The company's profit after tax grew 13.98% to ₹324.32 crore compared to ₹284.53 crore in Q1 FY25. EBITDA increased 15.98% to ₹485.36 crore, though EBITDA margins declined to 24.56% from 26.33% in the previous year. Earnings per share rose 14% to ₹32.83. The company operates over 7,539 km of pipeline infrastructure with 385 CNG stations, serving 1.13 million CNG vehicles and 2.85 million PNG household connections. Sales volume composition shows CNG accounting for 70.50% of total sales, followed by domestic PNG at 13.45%. The company held an investor presentation on July 23, 2025, to discuss these quarterly results and operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1753265326369,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Reports Strong Quarterly Performance with Revenue and Profit Growth",
            "Summary": "Mahanagar Gas delivered quarterly revenue of 21.6 billion rupees, up from 20.4 billion rupees in the previous quarter and exceeding analyst estimates of 18.29 billion rupees. The company's standalone net profit reached 3.2 billion rupees, compared to 2.5 billion rupees in the prior quarter and surpassing expectations of 2.74 billion rupees. Both revenue and profit metrics showed sequential growth and outperformed market forecasts.",
            "Sentiment": "positive",
            "PublishDate": 1753172206797,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Ltd: NCLT Approves Amalgamation with Unison Enviro",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the proposed Scheme of Amalgamation between Mahanagar Gas Ltd (MGL) and its wholly owned subsidiary, Unison Enviro Private Ltd. The Mumbai Bench of NCLT passed the order on July 9, sanctioning the merger. The scheme will become effective upon filing the certified copy of the order with the Registrar of Companies by both entities.",
            "Sentiment": "positive",
            "PublishDate": 1752118680000,
            "Source": "corporate_action"
        },
        {
            "Title": "MGL Expected to Face Negative Impact from PNGRB's New Draft Regulations",
            "Summary": "Analysts predict that Mahanagar Gas Limited (MGL) is likely to experience a negative impact of ₹0.5 per SCM due to new draft regulations proposed by the Petroleum and Natural Gas Regulatory Board (PNGRB). The specific details of these regulations are not provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1751609105000,
            "Source": "default"
        },
        {
            "Title": "Mahanagar Gas: Introduces WhatsApp-Based Meter Reading Service",
            "Summary": "Mahanagar Gas has launched a new service allowing domestic PNG customers to send meter readings via WhatsApp for bill generation. Customers can send a photo of their meter showing the reading and meter number to MGL's official WhatsApp account.",
            "Sentiment": "positive",
            "PublishDate": 1751478304000,
            "Source": "normal_news"
        },
        {
            "Title": "Mahanagar Gas Ltd: Shares Rise 6% Despite Mixed Analyst Views",
            "Summary": "Mahanagar Gas Ltd (MGL) shares gained 5.7% despite mixed analyst ratings. The company projects over 10% volume CAGR for 2-3 years, focuses on CNG infrastructure expansion, and is open to M&A opportunities. Analysts cite potential margin pressure due to increasing gas costs and changes in sourcing mix.",
            "Sentiment": "neutral",
            "PublishDate": 1749456230000,
            "Source": "normal_news"
        },
        {
            "Title": "Mahanagar Gas Reports Strong Q4 Results, Declares Dividend",
            "Summary": "Mahanagar Gas has reported a Q4 net profit of 2.5 billion rupees, up from 2.25 billion rupees in the previous quarter, exceeding estimates of 2.11 billion rupees. Revenue for the quarter stood at 20.4 billion rupees, an increase from 19.3 billion rupees year-over-year, and above the estimated 17.84 billion rupees. The company has also declared a dividend of 18 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746576803000,
            "Source": "default"
        },
        {
            "Title": "Mahanagar Gas Ltd: Q4 Profit Surges, Beats Estimates, Declares ₹18 Dividend",
            "Summary": "Mahanagar Gas Ltd reported Q4 net profit of ₹252.2 crore, up 11.9% QoQ. Revenue rose to ₹1,865 crore, EBITDA grew 20.5% to ₹378.4 crore. Operating margin improved to 20.3%. Board recommends final dividend of ₹18 per share, totaling ₹30 for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1746541808000,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Mahanagar Gas has announced a dividend of 18 rupees per equity share. The company's Q4 EBITDA increased to 3.8 billion rupees from 3.14 billion rupees quarter-over-quarter, exceeding estimates of 3.21 billion. EBITDA margin improved to 18.59% from 16.28% in the previous quarter. Q4 net profit rose to 2.5 billion rupees from 2.25 billion rupees, surpassing expectations of 2.11 billion. Revenue for Q4 reached 20.4 billion rupees, up from 19.3 billion rupees year-over-year, also beating estimates of 17.84 billion.",
            "Sentiment": "positive",
            "PublishDate": 1746539661000,
            "Source": "result"
        },
        {
            "Title": "Mahanagar Gas Ltd: Q4 Results Date Set, Dividend Decision Pending",
            "Summary": "Mahanagar Gas Ltd. will announce Q4 and FY 2024-25 results on May 6, 2025. The board will consider a final dividend. An earnings call is scheduled for May 7, 2025. Trading window for designated persons is closed until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1746360278000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas to Consider Q4 Results on May 6",
            "Summary": "Mahanagar Gas Limited has announced that it will consider its fourth quarter (Q4) financial results on May 6. This indicates the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745930537000,
            "Source": "default"
        },
        {
            "Title": "Mahanagar Gas Faces Reduced APM Gas Allocation",
            "Summary": "Mahanagar Gas Limited has announced an 18% reduction in their APM (Administered Pricing Mechanism) gas allocation, effective from April 16. The company has replaced the reduced APM volume with New Well Gas. This reduction in APM gas allocation is expected to negatively impact the company's profitability.",
            "Sentiment": "negative",
            "PublishDate": 1744719457000,
            "Source": "corporate_action"
        },
        {
            "Title": "MGL to Replace Gas Supply with More Expensive Source",
            "Summary": "Mahanagar Gas Limited (MGL) is planning to replace its current gas supply with gas from new wells. This new source of gas is reported to be more expensive than the existing APM (Administered Pricing Mechanism) gas.",
            "Sentiment": "negative",
            "PublishDate": 1744346210000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas Ltd: CNG Price Hike in Mumbai Metropolitan Region",
            "Summary": "Mahanagar Gas Ltd (MGL) increased CNG prices by ₹1.50 to ₹79.50 per kg in the Mumbai Metropolitan Region. PNG prices also rose by ₹1 per unit to ₹49 per kg. This follows a 4% hike in APM gas prices by the government on April 1. MGL's stock fell 5% following the announcement.",
            "Sentiment": "negative",
            "PublishDate": 1744192744000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas: 13% Volume Growth Expected in FY25",
            "Summary": "Mahanagar Gas Ltd. expects 13% volume growth in FY25, with 11% already achieved in the first nine months. The company aims for double-digit growth over the next three years. EBITDA guidance adjusted to Rs 9-11 per cubic meter. MGL plans to offer incentives for CNG vehicle adoption and expand its infrastructure with 85 new stations added last year.",
            "Sentiment": "positive",
            "PublishDate": 1741448494000,
            "Source": "normal_news"
        },
        {
            "Title": "Mahanagar Gas: BMC's Clean Fuel Mandate Boosts Shares",
            "Summary": "Mahanagar Gas Ltd shares rose 2% after BMC announced a July 8, 2025 deadline for Mumbai businesses to switch to CNG or PNG. The company's domestic gas allocation at APM prices increased by 26% from January 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1739859165000,
            "Source": "normal_news"
        },
        {
            "Title": "Mahanagar Gas Ltd: Stock Breaks Out from Rectangle Pattern After 30% Decline",
            "Summary": "Mahanagar Gas Ltd (MGL) stock has broken out from a rectangle pattern on daily charts, reclaiming its 50-DMA. The stock is down 30% from its highs but may see a technical bounce towards Rs 1,500. It hit a high of Rs 1,988 on September 25, 2024, but failed to maintain that level.",
            "Sentiment": "neutral",
            "PublishDate": 1738625400000,
            "Source": "normal_news"
        },
        {
            "Title": "Mahanagar Gas Completes Investment in International Battery Company India",
            "Summary": "Mahanagar Gas has completed its investment in International Battery Company India Pvt Ltd (IBC India), acquiring a 44% stake in the company. The total investment amounted to 353.6 million rupees. IBC India is involved in the manufacturing, promotion, and distribution of battery cells.",
            "Sentiment": "positive",
            "PublishDate": 1738591969000,
            "Source": "corporate_action"
        },
        {
            "Title": "MGL Projects 10% Growth Rate and Significant CNG Sales Increase",
            "Summary": "Mahanagar Gas Limited (MGL) expects to maintain a 10% growth rate for the next one to two years, driven by a 46% increase in CNG sales across India. The company anticipates adding approximately 1 lakh in volume during Q4, marking a substantial improvement compared to the previous year's performance.",
            "Sentiment": "positive",
            "PublishDate": 1738208279000,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas: Q3 Profit Drops 30.25% Despite Revenue Growth",
            "Summary": "Mahanagar Gas reported Q3 FY25 results with revenue up 17.85% YoY to ₹2031.51 crore, but profit down 30.25% to ₹221.24 crore. Operating income decreased 38.56% YoY. EPS fell to ₹22.39, down 30.27% YoY. Analysts' consensus recommendation is Hold.",
            "Sentiment": "negative",
            "PublishDate": 1738130657000,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Reports Q3 Financial Results and Dividend",
            "Summary": "Mahanagar Gas announced its Q3 financial results, reporting a net profit of 2.25 billion rupees, down from 2.8 billion rupees in the previous quarter. Revenue increased to 19.3 billion rupees from 18.8 billion rupees quarter-over-quarter. The company also declared a dividend of 12 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1738109823000,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Ltd: Q3 Profit Drops 30% Amid APM Allocation Cut",
            "Summary": "Mahanagar Gas Ltd reported a 30% decrease in Q3 net profit to Rs 221 crore due to reduced APM gas allocation. Revenue increased 17.8% to Rs 2031.51 crore. The company declared an interim dividend of Rs 12 per share. APM allocation for CNG has been increased to 51% from 37% effective January 16, 2025, which is expected to positively impact the next quarter.",
            "Sentiment": "negative",
            "PublishDate": 1738076476000,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Declares Dividend of 12 Rupees Per Share",
            "Summary": "Mahanagar Gas Limited has announced a dividend of 12 rupees per share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1738071284000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Mahanagar Gas Limited has reported a decrease in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 3.14 billion rupees from 4 billion rupees in the previous quarter. Additionally, the EBITDA margin declined to 16.28% from 21.23% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1738071201000,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Reports Q3 Financial Results",
            "Summary": "Mahanagar Gas Limited has announced its financial results for the third quarter. The company reported a net profit of 2.25 billion rupees, down from 2.8 billion rupees in the previous quarter. However, revenue increased to 19.3 billion rupees from 18.8 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738071149000,
            "Source": "earnings"
        },
        {
            "Title": "Mahanagar Gas Ltd: Board to Consider Interim Dividend on Jan. 28",
            "Summary": "Mahanagar Gas Ltd. will hold a board meeting on Jan. 28, 2025, to consider an interim dividend and approve Q3 FY2025 financial results. The record date for dividend eligibility is set for Jan. 31, 2025. Separately, the company received a Rs 54.33 crore tax demand order, which it plans to appeal.",
            "Sentiment": "neutral",
            "PublishDate": 1737380937000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas Board Meeting Scheduled for Q3 Results",
            "Summary": "Mahanagar Gas Limited has announced a board meeting scheduled for January 28 to consider and approve the company's financial results for the third quarter. This meeting is a standard corporate procedure for publicly traded companies to review and disclose their quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1737375791000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahanagar Gas Ltd: Morgan Stanley's Buy Rating May Not Offset Bearish Trend",
            "Summary": "Morgan Stanley initiated coverage on Mahanagar Gas Ltd with an 'overweight' rating and a target price of Rs 1,606, representing a 25% upside. Despite this, the stock remains in bearish territory after falling 45% from its 52-week high. The stock rose over 4% in early trade following the announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1736830218000,
            "Source": "normal_news"
        },
        {
            "Title": "Mahanagar Gas Receives Increased Domestic Gas Allocation at Higher Price",
            "Summary": "Mahanagar Gas has been informed by GAIL (India), the nodal agency for domestic gas allocation, that their domestic gas allocation at APM price will increase by 26% effective January 16, 2025. This change will result in an increase in CNG allocation from 37% to 51%.",
            "Sentiment": "neutral",
            "PublishDate": 1736433324000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas Ltd: CNG Price Hike Amid Reduced Gas Allocation",
            "Summary": "Mahanagar Gas Ltd (MGL) raised CNG prices by ₹1 per kg in Mumbai, following a ₹2 hike in November. The new price is ₹78 per kg. This comes after a 40% reduction in Administered Price Mechanism (APM) gas allocation, forcing companies to source more expensive market-priced gas. Morgan Stanley expects further price hikes to maintain profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1735283304000,
            "Source": "normal_news"
        },
        {
            "Title": "Mahanagar Gas Implements Second CNG Price Increase",
            "Summary": "Mahanagar Gas has raised CNG prices by Rs 1/kg, following a Rs 2/kg increase in November 2024. This is part of a trend where city gas companies are implementing calibrated price hikes for CNG.",
            "Sentiment": "neutral",
            "PublishDate": 1735271969000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Gas Ltd Block Trade: 182,004 Shares Sold for Rs. 23.48 Crores",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) involving Mahanagar Gas Ltd. Approximately 182,004 shares of the company were traded at a price of Rs. 1289.90 per share, resulting in a total transaction value of Rs. 23.48 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734325988000,
            "Source": "block_deals"
        }
    ]
}