{
    "Symbol": "MHLXMIRU",
    "ISIN": "INE112D01035",
    "News": [
        {
            "Title": "Mahalaxmi Rubtech Appoints Kaluram Gurjar as CFO",
            "Summary": "Mahalaxmi Rubtech Limited has appointed Mr. Kaluram Birdaram Gurjar as Chief Financial Officer and Key Managerial Personnel with immediate effect from December 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766757921374,
            "Source": "stocks"
        },
        {
            "Title": "Mahalaxmi Rubtech Appoints CS Karan Rajivbhai Parekh as Company Secretary and Compliance Officer",
            "Summary": "Mahalaxmi Rubtech Limited's Board of Directors appointed CS Karan Rajivbhai Parekh as Company Secretary and Compliance Officer with effect from November 20, 2025. The appointment fills a key managerial position under the Companies Act, 2013 and SEBI regulations, with Parekh bringing experience in corporate compliance, statutory filings, and governance support.",
            "Sentiment": "positive",
            "PublishDate": 1763642239046,
            "Source": "corporate_governance"
        },
        {
            "Title": "MahaLaxmi RubTech Limited Publishes Q2 and Half-Year Financial Results",
            "Summary": "MahaLaxmi RubTech Limited published its unaudited financial results for the quarter and half-year ended September 30, 2025, in The Indian Express and The Financial Express newspapers on November 15, 2025. The company informed BSE and NSE about the publication of these results in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763195281764,
            "Source": "earnings"
        },
        {
            "Title": "Mahalaxmi Rubtech Reports Q2 FY26 Financial Results",
            "Summary": "Mahalaxmi Rubtech Limited's Board approved unaudited financial results for Q2 and half-year ended September 30, 2025, with independent auditor review completed by Jain Chowdhary & Co. The company operates in offset printing blankets and technical coated fabrics with single reportable segment, confirming no subsidiary or associate companies as of September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763057883624,
            "Source": "earnings"
        },
        {
            "Title": "Mahalaxmi Fabric Mills Reports Quarterly Results and Insurance Settlement from Factory Fire",
            "Summary": "Mahalaxmi Fabric Mills Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company received final assessment and settlement of insurance claims for fixed assets including building, plant and machinery, and furniture fixtures equipment during the quarter, which has been presented as an exceptional item in the profit and loss statement. This relates to a fire that occurred at the company's factory premises on November 24, 2024, causing significant damage to fixed assets and inventories. The company has commenced reconstruction and restoration activities, including construction of a new factory building and installation of plant machinery, expecting to resume production operations in due course. The final assessment and receipt of claims relating to stocks is still awaited. The company operates in the traditional textiles segment and the results were reviewed by the audit committee and approved by the board of directors on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763016324952,
            "Source": "earnings"
        },
        {
            "Title": "Mahalaxmi Rubtech Limited Company Secretary Resigns for Career Growth",
            "Summary": "CS Kalpana Kumari has resigned from her position as Company Secretary and Compliance Officer at Mahalaxmi Rubtech Limited. She tendered her resignation on November 1, 2025, with the resignation taking effect from November 15, 2025. The resignation is attributed to better career opportunities and prospects for future growth. Kumari holds ICSI membership number A51657 and served as a Key Managerial Person for the company. The company has informed both BSE Limited and National Stock Exchange of India about this personnel change.",
            "Sentiment": "neutral",
            "PublishDate": 1762000355893,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahalaxmi Rubtech CFO Rajendra Ratanchand Mehta Resigns to Pursue New Opportunities",
            "Summary": "Rajendra Ratanchand Mehta has resigned from his position as Chief Financial Officer of Mahalaxmi Rubtech Limited. He submitted his resignation on October 9, 2025, with the resignation taking effect from November 30, 2025. Mehta cited his decision to embark upon a new journey and pursue better opportunities as the reason for his departure. In his resignation letter, he confirmed there are no material reasons for his resignation other than those stated and committed to ensuring a proper transition and handover of his duties.",
            "Sentiment": "neutral",
            "PublishDate": 1760100017285,
            "Source": "corporate_governance"
        },
        {
            "Title": "Multiple Companies Publish Q1 FY2026 Financial Results",
            "Summary": "Several companies published their unaudited financial results for the quarter ended June 30, 2025. Mahalaxmi Rubtech Limited announced publication of its quarterly results in The Indian Express and The Financial Express newspapers on August 14, 2025, with results reviewed by the audit committee and approved by the board. Vadilal Chemicals Limited reported total income from operations of 206 lakhs and net profit for the period of 30 lakhs. Arman Financial Services Limited published extract of standalone/consolidated unaudited financial results. Callista Industries Limited had their quarterly results reviewed by the audit committee and approved by the board of directors in meetings held on August 12, 2025. Apollo Investments Limited's board approved unaudited standalone financial results in a meeting held on August 14, 2025. Multiple other companies including Autoline Industries Limited, Ucal Limited, and Mohit Industries Limited also published their quarterly financial results for the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1755172557976,
            "Source": "earnings"
        },
        {
            "Title": "Mahalaxmi Rubtech Reports 36% Jump in Q1 Profit to ₹443.92 Lakhs",
            "Summary": "Mahalaxmi Rubtech Limited reported a profit of ₹443.92 lakhs for the quarter ended June 30, 2025, compared to ₹325.90 lakhs in the same period last year. Revenue from operations increased to ₹2,505.46 lakhs from ₹2,060.11 lakhs year-on-year. Basic earnings per share rose to ₹4.18 from ₹3.07 in the corresponding quarter. Total comprehensive income reached ₹450.82 lakhs versus ₹328.77 lakhs in the previous year. The company operates in offset printing blankets and technical coated fabrics with a single reportable segment. The board meeting was held on August 12, 2025, where directors approved the unaudited financial results along with the independent auditor's limited review report.",
            "Sentiment": "positive",
            "PublishDate": 1755017703598,
            "Source": "earnings"
        }
    ]
}