{
    "Symbol": "MHRIL",
    "ISIN": "INE998I01010",
    "News": [
        {
            "Title": "Mahindra Holidays Allots 4,081 Shares Under ESOP",
            "Summary": "Mahindra Holidays & Resorts India Limited allotted 4,081 equity shares under its ESOP Scheme 2020, increasing paid-up capital to Rs. 2,02,04,34,020 from Rs. 2,02,03,93,210.",
            "Sentiment": "neutral",
            "PublishDate": 1770639815036,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Holidays Amends Fair Disclosure Code",
            "Summary": "Mahindra Holidays & Resorts India Limited's Board approves amendments to its Code of Practices and Procedures for Fair Disclosure to align with updated SEBI regulations on insider trading.",
            "Sentiment": "neutral",
            "PublishDate": 1769677854412,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Holidays Reports Strong Q3 FY26 Performance",
            "Summary": "Mahindra Holidays posted standalone revenue of ₹37,945.99 lakhs in Q3 FY26, up from ₹35,993.30 lakhs in Q3 FY25. Net profit reached ₹5,493.29 lakhs versus ₹5,072.75 lakhs year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1769676340632,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC MF Reduces Mahindra Holidays Stake to 3.05%",
            "Summary": "HDFC Mutual Fund disclosed a significant reduction in its shareholding of Mahindra Holidays & Resorts India Ltd from 5.13% to 3.05%, representing a decrease of 2.08% through open market transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1769515056535,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Holidays Gets 74.7 ESG Score from SES ESG",
            "Summary": "Mahindra Holidays & Resorts India Limited receives an Environmental, Social and Governance score of 74.7 from SEBI-registered ESG rating provider SES ESG Research Private Limited based on FY 2024-25 data.",
            "Sentiment": "positive",
            "PublishDate": 1768826612637,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Holidays Q3FY26 Earnings Call on Jan 29",
            "Summary": "Mahindra Holidays & Resorts India Limited announces earnings conference call scheduled for January 29, 2026 at 5:30 PM IST to discuss Q3FY26 financial performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768303053841,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahindra Holidays Wins ₹363 Cr GST Case",
            "Summary": "Mahindra Holidays & Resorts India receives favourable order from Tamil Nadu tax authorities, dropping GST demand of ₹363.08 crores for FY2018-19 proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1766582589419,
            "Source": "stocks"
        },
        {
            "Title": "Mahindra Holidays Unveils Strategy to Triple Revenue and Quadruple PAT by F30",
            "Summary": "Mahindra Holidays announced a comprehensive strategy to become India's No.1 leisure hospitality player, targeting 3x growth in keys and revenue, and 4x growth in PAT from F20 to F30. The company plans to rebrand ClubMahindra to ClubM with 10,000 keys and launch luxury brand Mahindra Signature Resorts with 2,000 keys, introducing new membership plan Keystone and investing INR 500-600 crores this year.",
            "Sentiment": "positive",
            "PublishDate": 1764326574017,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Holidays Plans ₹1,000 Crore Investment in New Resort Business",
            "Summary": "Mahindra Holidays announced plans to invest ₹1,000 crore in a new leisure hospitality business called 'Mahindra Signature Resorts'. The investment represents the company's expansion into a new segment within the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1763602483805,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Holidays Allots 19,348 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Mahindra Holidays & Resorts India Limited allotted 19,348 equity shares of Rs. 10 each to employees under its Employee Stock Options Scheme-2020. The company's issued and paid-up equity share capital increased from Rs. 2,02,01,69,730 to Rs. 2,02,03,63,210, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763384292035,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Holidays Reports 18% EBITDA Growth Despite Weather Challenges in Q2 FY26",
            "Summary": "Mahindra Holidays & Resorts India Limited delivered strong quarterly results with total income of INR 381 crores, up 3% year-on-year. EBITDA grew 18% to INR 141 crores with margins improving to 37%. PAT increased 10% to INR 52 crores. The company maintained healthy occupancy of 73.4% despite losing an estimated 10,000 nights due to weather-related cancellations in Himachal and Uttarakhand clusters. Resort revenue reached INR 84 crores, marking 8% growth. The company added a new resort in Mahabaleshwar and completed 4 expansion projects, adding 209 keys while exiting 261 keys as part of quality optimization. Member additions stood at 1,432 with Average Unit Realization (AUR) surging 85% to INR 9.3 lakhs. Member-to-room ratio improved to 53 from 55 in the same quarter last year. The company remains on track to achieve its target of 10,000 keys by FY30 and plans to add about 1,000 keys at gross level in the second half. Cash position improved 6% to INR 1,532 crores. Management indicated upcoming strategic announcements beyond vacation ownership model.",
            "Sentiment": "positive",
            "PublishDate": 1762450398052,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays Plans Portfolio Expansion and Digital Growth Strategy",
            "Summary": "Mahindra Holidays has outlined plans to strengthen its domestic and European timeshare portfolio through new resort additions and digital-led member acquisition strategies. The company aims to enhance occupancy rates and targets sustained Average Room Rate (ARR) growth by increasing premium inventory and leveraging cross-market synergies between its operations.",
            "Sentiment": "positive",
            "PublishDate": 1761922519457,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Holidays Reports 47% YoY Growth in Consolidated PAT for Q2 FY26",
            "Summary": "Mahindra Holidays & Resorts India Ltd reported consolidated PAT growth of 47% year-over-year for the quarter ended September 30, 2025. The company's consolidated total income reached Rs 749.5 crore compared to Rs 706.2 crore in the previous year, while consolidated EBITDA grew 16.4% to Rs 184.9 crore. On standalone basis, EBITDA increased 17.6% to Rs 140.5 crore. The company expanded its operations by adding one new resort in Mahabaleshwar, Maharashtra, and expanded four existing resorts across Kandaghat, Dindi, Patkot, and Jaipur. Resort revenue grew 8% year-over-year to Rs 84 crore with occupancy at 73.4% across an expanded inventory base of 5,742 keys spanning 118 resorts. Membership sales value reached Rs 134 crore with average unit realization at Rs 9.3 lakh, marking a 485% year-over-year increase. The company added 1,432 new members, bringing cumulative membership to 304,000. Cash position strengthened 45% year-over-year to Rs 1,532 crore, while deferred revenue stands at Rs 5,747 crore. Managing Director Manoj Bhat noted strong performance despite weather challenges in Himachal and Uttarakhand clusters, highlighting continued growth in resort revenue and membership upgrades through their premiumization strategy.",
            "Sentiment": "positive",
            "PublishDate": 1761921273504,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays Reports Strong Q2 Performance with Higher EBITDA and Margins",
            "Summary": "Mahindra Holidays & Resorts India reported Q2 EBITDA of 1.5 billion rupees, representing growth from 1.23 billion rupees in the same period last year. The company's EBITDA margin improved to 21.29% compared to 18.4% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1761912906227,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays Reports 30% Jump in Quarterly Net Profit to 179M Rupees",
            "Summary": "Mahindra Holidays & Resorts India reported consolidated net profit of 179 million rupees compared to 138 million rupees in the same quarter last year, representing a year-on-year increase. The company's quarterly revenue grew to 7.2 billion rupees from 6.7 billion rupees in the corresponding period of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761912454498,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays & Resorts Receives GST Show-Cause Notices Worth ₹6.53 Crore",
            "Summary": "Mahindra Holidays & Resorts has received GST show-cause notices totaling ₹6.53 crore covering the period from FY21 to FY24. The notices relate to GST compliance matters for the hospitality company.",
            "Sentiment": "negative",
            "PublishDate": 1758351193958,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Holidays Appoints Vineet Bhardwaj as Chief Technology Officer",
            "Summary": "Mahindra Holidays & Resorts India Limited appointed Vineet Bhardwaj as Chief Technology Officer and Senior Management Personnel, effective September 1, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Bhardwaj brings over 24 years of experience in digital and information technology leadership, with expertise in IT governance, cybersecurity, and digital transformation. He is a qualified Chartered Accountant and Company Secretary, having previously held leadership positions at Gas Authority of India, Marico Ltd., RGMS, Aegis Ltd., and most recently served as Chief Digital & Information Officer at Godrej Properties Limited. He is not related to any Director of the Company.",
            "Sentiment": "positive",
            "PublishDate": 1756360350695,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Holidays Reports 69% Jump in Standalone Profit for Q1 FY26",
            "Summary": "Mahindra Holidays & Resorts India Limited reported strong quarterly results with standalone profits up 69% and PAT margin expanding by 680 basis points. Consolidated PAT grew 18% to INR 7.2 crores despite a forex impact of INR 28 crores due to Euro-INR movement. The company maintained resort occupancy at 85%-plus levels and added 1,524 new members with an average unit realization of INR 8.3 lakhs, up 69% year-on-year. Resort revenue grew in double digits to INR 114 crores. The company remains committed to its target of adding 1,000 rooms by March 2026, with current inventory at 5,800 keys. Member additions through digital channels and referrals now account for 65% of total additions. The Holiday Club Resort Operations (HCRO) business showed improved performance but continues to face challenges from geopolitical tensions and Finnish economic conditions. Management indicated they are developing a new business model focused on capital efficiency and enhanced member experience.",
            "Sentiment": "positive",
            "PublishDate": 1753961665866,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays Receives GST Demand Notice Worth ₹33.29 Crore from Tamil Nadu Tax Authority",
            "Summary": "Mahindra Holidays & Resorts India Limited received a Show Cause Notice from the State Tax Officer in Chennai, Tamil Nadu, demanding ₹33,28,74,524 including interest and penalties under TNGST Act, 2017 and CGST Act, 2017 for FY 2021-22. The demand relates to adjustments in turnover, supply difference, trade payable, disposal of assets, and addition of assets. The company stated it does not expect the notice to have any material financial impact based on its assessment and legal counsel's advice. The company is pursuing appropriate legal remedies before the relevant authority.",
            "Sentiment": "neutral",
            "PublishDate": 1753517365837,
            "Source": "stock"
        },
        {
            "Title": "Mahindra Holidays Re-appoints Diwakar Gupta as Independent Director, Names New Secretarial Auditors",
            "Summary": "Mahindra Holidays & Resorts India Limited shareholders approved two key appointments at their 29th Annual General Meeting held on July 23, 2025. Mr. Diwakar Gupta was re-appointed as Independent Director for a second term from December 1, 2025 to July 24, 2028. Gupta brings over 50 years of banking experience, having served as Managing Director and Chief Financial Officer of State Bank of India until 2013, and held various roles including CEO of SBI Cards and positions with Asian Development Bank. Additionally, shareholders approved the appointment of M/s. Siroya and BA Associates as Secretarial Auditors for a five-year term starting from financial year 2025-26. The firm, led by Mr. Mukesh Siroya with over 24 years of practice, was established in 2019 and serves clients across finance, insurance, hospitality, and manufacturing sectors.",
            "Sentiment": "positive",
            "PublishDate": 1753293709048,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Holidays Reports Strong Q1 Performance with 73% Jump in Standalone Profit; Announces Leadership Changes",
            "Summary": "Mahindra Holidays & Resorts India Limited reported unaudited financial results for the quarter ended June 30, 2025. Standalone profit after tax increased to ₹782.25 crores compared to ₹452.04 crores in the same quarter last year, representing a 73% growth. Revenue from operations rose to ₹3,686.60 crores from ₹3,509.68 crores year-over-year. On a consolidated basis, profit after tax reached ₹808.17 crores versus ₹589.26 crores in the previous year quarter. The company announced key management changes with Mr. Dhanraj Mulki retiring as Company Secretary effective October 31, 2025, due to superannuation. Ms. Mansi Laheri will join as Company Secretary (Designate) from August 1, 2025, and assume full responsibilities from November 1, 2025. Ms. Laheri brings 17 years of experience in legal, secretarial and compliance functions. The company operates through two main segments: Club Mahindra (MHRIL) and Holiday Club Resorts OY (HCRO). Additionally, Holiday Club Resorts OY executed a Share Purchase Agreement to acquire 100% stake in Keskinainen Kiinteist Oy Salla Star, Finland on July 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753262499198,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays Reports Strong Q1 Growth with Revenue Rising to 7 Billion Rupees",
            "Summary": "Mahindra Holidays & Resorts India reported Q1 revenue of 7 billion rupees, up from 6.5 billion rupees in the same period last year. The company's consolidated net profit increased to 79 million rupees from 59 million rupees year-over-year. EBITDA grew to 1.22 billion rupees compared to 1.05 billion rupees previously, while EBITDA margin improved to 17.46% from 16.14% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1753260868524,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays & Resorts India: Finnish Subsidiary Acquires Salla Star Property for ₹2.35 Crore",
            "Summary": "Holiday Club Resorts Oy, a Finnish subsidiary of Mahindra Holidays & Resorts India Ltd, has acquired 100% stake in Keskinäinen Kiinteistö Oy Salla Star (KKOSS) for ₹2.35 crore. The acquisition, completed on July 3, 2025, gives HCR full control over property it had been leasing since 2012.",
            "Sentiment": "positive",
            "PublishDate": 1751552580000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Holidays Unit Acquires Full Stake in Finnish Property Company",
            "Summary": "A subsidiary of Mahindra Holidays And Resorts India has purchased 100% stake in Keskinäinen Kiinteistö Oy Salla Star for 23.5 million rupees. The acquired company appears to be a property entity based in Finland.",
            "Sentiment": "neutral",
            "PublishDate": 1751544682000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Holidays & Resorts India Ltd: Ambitious Expansion Plan to Add 850 Rooms in FY26",
            "Summary": "Mahindra Holidays plans to add 850 rooms in FY26, aiming for 10,000 rooms by 2030. Current portfolio is 5,800 rooms, expected to reach 6,500-6,600 by FY26 end. FY26 capex could potentially double from FY25's ₹300 crore. Domestic resort revenues grew 12% in Q3 and 14% in Q4 of FY25. Company projects stable occupancy of 83-85% for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1746337236000,
            "Source": "corporate_action"
        },
        {
            "Title": "Club Mahindra Expands Resort Portfolio in India and Abroad",
            "Summary": "Mahindra Holidays' Club Mahindra has added new resorts in Andhra Pradesh, Abu Dhabi, and Vietnam, expanding its presence both domestically and internationally. This move strengthens the company's offering and reach in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1745997121000,
            "Source": "default"
        },
        {
            "Title": "Mahindra Holidays & Resorts India Reports Q4 Financial Results",
            "Summary": "Mahindra Holidays & Resorts India has released its Q4 financial results. The company reported an EBITDA of 2.04 billion rupees, up from 1.87 billion rupees year-over-year. The EBITDA margin improved to 26.24% from 23.42% in the same period last year. However, revenue slightly decreased to 7.79 billion rupees from 8 billion rupees year-over-year. The consolidated net profit for Q4 was 730.8 million rupees, down from 824 million rupees year-over-year but up from 348.4 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745582437000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Holidays & Resorts India Ltd: Q4 Profit Dips Despite Margin Expansion",
            "Summary": "Mahindra Holidays & Resorts India Ltd reported an 11.4% YoY decrease in Q4 net profit to ₹73 crore, with revenue falling 2.7% to ₹778.8 crore. EBITDA margin expanded to 26.3%. The company added 520 keys in FY25, reaching 5,847 total keys. Q4 resort revenue grew 14% YoY to ₹107 crore with 85% occupancy. Average unit realization surged 82% to ₹7.72 lakh.",
            "Sentiment": "neutral",
            "PublishDate": 1745582127000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays & Resorts India: Rs 17.5 Crore GST Demand Over Turnover Mismatch",
            "Summary": "Mahindra Holidays & Resorts India Ltd received a Rs 17.59 crore demand order from GST authorities in Chennai for FY 2020-21. The demand includes interest of Rs 6.12 crore and a penalty of Rs 1.11 crore. The order cites mismatch in turnover, input tax credit reversal issues, and other discrepancies. The company plans to appeal the order and doesn't expect a material financial impact.",
            "Sentiment": "neutral",
            "PublishDate": 1740840480000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahindra Holidays & Resorts India: 1,000 Room Expansion by March 2026",
            "Summary": "Mahindra Holidays & Resorts India Ltd plans to add 1,000 rooms by March 2026, increasing capacity by 17-18%. The company will add 15 new destinations in the next five quarters. Current occupancy is at 84.2%, slightly better than last year. The company aims to reach 10,000 rooms by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1738491533000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Holidays and Resorts India Ltd: Q3 Profit Surges 208%, Shares Rally 11%",
            "Summary": "Mahindra Holidays reported a 208% YoY increase in Q3 FY25 consolidated net profit to ₹35.42 crore. Revenue rose 7% to ₹678 crore, while EBITDA grew 38.6% to ₹146 crore. The company added 206 keys and launched a new resort in Uttarakhand. Shares surged 11% in response.",
            "Sentiment": "positive",
            "PublishDate": 1738317283000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays & Resorts India Reports Q3 Revenue Growth",
            "Summary": "Mahindra Holidays & Resorts India has reported a revenue of 6.8 billion rupees for the third quarter, compared to 6.3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738313901000,
            "Source": "earnings"
        },
        {
            "Title": "Mahindra Holidays & Resorts India Reports Strong Q3 EBITDA Growth",
            "Summary": "Mahindra Holidays & Resorts India has reported a significant increase in its Q3 EBITDA, rising to 1.45 billion rupees from 1.05 billion rupees year-over-year. The company's EBITDA margin also improved, reaching 21.5% compared to 16.56% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738313829000,
            "Source": "earnings"
        },
        {
            "Title": "Club Mahindra: Plans to Double Rajasthan Resorts and Employment",
            "Summary": "Anand Mahindra announced at the Rising Rajasthan Global Investment Summit that Club Mahindra will double its resort presence in Rajasthan from the current six. This expansion is expected to double employment opportunities in the region over the next five years, building on the 5,000 direct jobs already created.",
            "Sentiment": "positive",
            "PublishDate": 1733726831000,
            "Source": "corporate_action"
        },
        {
            "Title": "Club Mahindra Expands Kandaghat Property with Over 100 New Keys",
            "Summary": "Mahindra Holidays' Club Mahindra has expanded its property in Kandaghat by adding more than 100 new keys (rooms or accommodations). This expansion increases the capacity of the Kandaghat resort, potentially allowing for more guests and enhancing the company's presence in the area.",
            "Sentiment": "positive",
            "PublishDate": 1733293147000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra Holidays & Resort: Q2 Profit Drops 46% on Forex Impact",
            "Summary": "Mahindra Holidays & Resort India Ltd reported a 46.4% decline in Q2 FY25 consolidated profit at Rs 11.48 crore, mainly due to adverse foreign exchange fluctuations. Revenue increased to Rs 670.75 crore. Excluding forex impact, PAT grew 36% YoY to Rs 27 crore. The company added 219 keys and three managed resorts during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729879631000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Holidays & Resorts India Reports Q2 Financial Results",
            "Summary": "Mahindra Holidays & Resorts India has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 1.23 billion rupees, compared to 1.35 billion rupees in the same quarter last year. The EBITDA margin has decreased from 20.69% to 18.40% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729846233000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Holidays & Resorts India Reports Q2 Revenue Growth",
            "Summary": "Mahindra Holidays & Resorts India has reported a revenue of 6.7 billion rupees for the second quarter, showing a slight increase from 6.5 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729846212000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Holidays & Resorts India Reports Q2 Profit Decline",
            "Summary": "Mahindra Holidays & Resorts India has reported a consolidated net profit of 138 million rupees for the second quarter, down from 213 million rupees in the same period last year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1729846183000,
            "Source": "result"
        },
        {
            "Title": "Mahindra Holidays & Resorts Expands in Gujarat with New Resort",
            "Summary": "Mahindra Holidays & Resorts has expanded its resort portfolio in Gujarat by launching Club Mahindra Pavagadh. This new addition strengthens the company's presence in the state and enhances its offerings to customers in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1729667956000,
            "Source": "corporate_action"
        }
    ]
}