{
    "Symbol": "MICEL",
    "ISIN": "INE287C01037",
    "News": [
        {
            "Title": "MIC Electronics Wins ₹4.45 Cr Railway Order",
            "Summary": "MIC Electronics Limited secured a ₹4.45 crore order from Howrah Division, Eastern Railway Zone for Coach and Train Indication Boards across eight stations, to be executed within 6 months.",
            "Sentiment": "positive",
            "PublishDate": 1770826753442,
            "Source": "co_actions_results"
        },
        {
            "Title": "MIC Electronics Wins ₹1.46 Cr Railway Contract",
            "Summary": "MIC Electronics Limited secured a Letter of Acceptance from Firozpur Division, Northern Railway Zone for Coach Guidance and PA system contract worth ₹1,45,75,627.69 to be executed within 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1770699874867,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mic Electronics Secures First Railway Order",
            "Summary": "Mic Electronics receives inaugural order for public address and passenger information systems from Railway Coach Factory, marking entry into railway sector with commercial supplies beginning.",
            "Sentiment": "positive",
            "PublishDate": 1770101368172,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mic Electronics Secures Major ₹114 Crore Order",
            "Summary": "Mic Electronics has announced receiving a significant order worth ₹114 crore, marking a substantial business development for the electronics company.",
            "Sentiment": "positive",
            "PublishDate": 1769577188176,
            "Source": "co_actions_results"
        },
        {
            "Title": "MIC Electronics Secures ₹1.05 Cr Railway Order",
            "Summary": "MIC Electronics Limited receives variation order worth ₹1.05 crores from Central Railway Zone for telecom assets and passenger amenities at 7 stations under Amrit Bharat Scheme.",
            "Sentiment": "positive",
            "PublishDate": 1766382343026,
            "Source": "co_actions_results"
        },
        {
            "Title": "MIC Electronics Receives First Order for Railway AC Controller After Product Approval",
            "Summary": "MIC Electronics Limited has received its first order from Northeast Frontier Railway for the Microprocessor Controller for Roof-Mounted AC Package Unit for LHB and Double-Decker Coaches, following product approval announced in October 2025. This order marks the beginning of commercial supplies for this new product category, representing a significant milestone for the company's railway electronics business.",
            "Sentiment": "positive",
            "PublishDate": 1765257329393,
            "Source": "stock"
        },
        {
            "Title": "MIC Electronics Approves ₹250 Crore QIP and $15 Million FCCB Fundraising Plans",
            "Summary": "MIC Electronics Limited shareholders approved two special resolutions at an extraordinary general meeting to raise funds up to ₹250 crores through Qualified Institutions Placement (QIP) and up to $15 million via Foreign Currency Convertible Bonds (FCCBs). Both resolutions passed with over 99% approval through combined remote e-voting and physical voting, enabling the company to access capital markets for growth funding.",
            "Sentiment": "positive",
            "PublishDate": 1764586957925,
            "Source": "corporate_action"
        },
        {
            "Title": "MIC Electronics Secures ₹1.5 Crore Railway Contract for Passenger Information Systems",
            "Summary": "MIC Electronics Limited received a Letter of Acceptance from Vijayawada Railway Division for providing IP-based Integrated Passenger Information Systems at ANV and YLM Railway Stations worth ₹1,49,88,884.77. The domestic contract involves design, supply, installation, testing and commissioning with a 12-month execution timeline from agreement date.",
            "Sentiment": "positive",
            "PublishDate": 1764565339869,
            "Source": "order&deals"
        },
        {
            "Title": "RRK Enterprise Reduces Stake in MIC Electronics by 2.90%",
            "Summary": "RRK Enterprise Private Limited, a promoter of MIC Electronics Limited, sold 70,00,000 equity shares (2.90% stake) in the secondary market between September 24, 2025 to November 14, 2025. The transaction reduced RRK Enterprise's shareholding from 52.17% to 49.27%, bringing the promoter group's holding below the majority threshold.",
            "Sentiment": "neutral",
            "PublishDate": 1763364982768,
            "Source": "corporate_action"
        },
        {
            "Title": "MIC Electronics Schedules EGM to Raise ₹250 Crores via QIP and $15 Million via FCCBs",
            "Summary": "MIC Electronics Limited has scheduled an Extra-Ordinary General Meeting for December 1, 2025, to seek shareholder approval for two fundraising proposals. The first resolution seeks approval to raise up to ₹250 crores through Qualified Institutions Placement (QIP) to Qualified Institutional Buyers in one or more tranches. The second resolution proposes raising funds up to $15 million through Foreign Currency Convertible Bonds (FCCBs) on a private placement basis. The funds will be utilized for acquisitions of domestic/foreign business units, debt repayment, working capital requirements, cash margin for non-fund based working capital, investments in subsidiaries, capital expenditure, and general corporate purposes. The cut-off date for determining eligible members is November 25, 2025, with remote e-voting available from November 28-30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762510575835,
            "Source": "corporate_action"
        },
        {
            "Title": "MIC Electronics Plans to Raise Up to 2.5 Billion Rupees Through QIP and $15 Million via FCCBs",
            "Summary": "MIC Electronics has announced plans to raise capital through two instruments: up to 2.5 billion rupees via a Qualified Institutional Placement (QIP) and up to $15 million through Foreign Currency Convertible Bonds (FCCBs). The fundraising initiative involves both domestic institutional investors through the QIP route and foreign currency denominated convertible securities.",
            "Sentiment": "positive",
            "PublishDate": 1762329548689,
            "Source": "stock"
        },
        {
            "Title": "MIC Electronics Limited Schedules Board Meeting to Consider Fund Raising Proposal",
            "Summary": "MIC Electronics Limited has scheduled a board meeting for November 5, 2025, to consider and approve a proposal for raising funds through various modes including Qualified Institutions Placement (QIP), Foreign Currency Convertible Bonds (FCCBs), or other permissible methods. The fund raising may be conducted in one or more tranches to eligible investors, subject to required approvals including shareholders and regulatory authorities. The board will also consider seeking necessary shareholder approvals and appointing intermediaries such as merchant bankers, legal advisors, and other agencies for the fund raising process.",
            "Sentiment": "neutral",
            "PublishDate": 1762091930028,
            "Source": "corporate_action"
        },
        {
            "Title": "Mic Electronics Partners with ChipEx Technologies for Custom Semiconductor Development",
            "Summary": "Mic Electronics has entered into an agreement with ChipEx Technologies to jointly develop custom semiconductor solutions. The partnership aims to improve product uniqueness and ensure long-term supply stability for Mic Electronics.",
            "Sentiment": "positive",
            "PublishDate": 1761546144333,
            "Source": "order&deals"
        },
        {
            "Title": "MIC Electronics Receives Railway Orders Worth Rs 1.16 Crore for Station Development Works",
            "Summary": "MIC Electronics Limited has received two Letter of Variations (LOA) for railway infrastructure projects totaling Rs 1,15,64,160. The first order from South East Central Railway is worth Rs 82,56,066 for signalling and telecom works at four stations under the Amrit Bharat Station Scheme in Nagpur Division. The second order from Northern Railway is valued at Rs 33,08,094 for passenger amenities and telecom expansion at 16 stations in Delhi division. Both orders were received through direct tender participation on October 25 and 26, 2025. The company confirmed that promoter groups have no interest in the awarding entities and the orders do not constitute related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1761542918327,
            "Source": "order&deals"
        },
        {
            "Title": "MIC Electronics Completes INR 53.8 Cr Investment in Dubai-Based Step-Down Subsidiary",
            "Summary": "MIC Electronics Limited has completed an investment of INR 53.8 crore through its wholly-owned subsidiary SOA Electronics Trading LLC, Dubai, to acquire 99% stake in Cellular Galaxy Electronics LLC, Dubai. The step-down subsidiary, incorporated on August 17, 2023, operates in electrical and electronic appliances trading with a share capital of AED 22.49 million and reported turnover of AED 37.34 million for the year ended December 31, 2024. The acquisition was completed on October 23, 2025, with cash consideration at arm's length pricing. The target company is engaged in trading of antennas, watches, photographic equipment, video game consoles, computer accessories, mobile phones and related electronic products. Dubai regulatory authorities have issued the requisite approvals for the investment.",
            "Sentiment": "positive",
            "PublishDate": 1761290811741,
            "Source": "order&deals"
        },
        {
            "Title": "MIC Electronics Receives RDSO Approval for Railway AC Controller Prototype",
            "Summary": "MIC Electronics Limited received prototype testing approval from the Research Designs and Standards Organization (RDSO), Ministry of Railways, for a microprocessor controller used in roof-mounted AC package units for LHB coaches and double-decker coaches. The approval was granted for request ID 25111 and item ID 3100369.",
            "Sentiment": "positive",
            "PublishDate": 1760936135022,
            "Source": "stock"
        },
        {
            "Title": "MIC Electronics Reports Q2 FY26 Results with Consolidated Revenue of Rs 3,841.89 Lakhs",
            "Summary": "MIC Electronics Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of Rs 3,788.93 lakhs for Q2 FY26, compared to Rs 2,745.67 lakhs in the corresponding quarter of the previous year. Total consolidated income reached Rs 3,841.89 lakhs versus Rs 2,768.38 lakhs in Q2 FY25. The company posted a consolidated profit of Rs 216.80 lakhs for the quarter, slightly lower than Rs 212.59 lakhs in the same period last year. For the half-year period, consolidated revenue stood at Rs 4,950.14 lakhs compared to Rs 3,817.13 lakhs in the previous year, with profit at Rs 383.50 lakhs versus Rs 409.11 lakhs. The company operates through four business segments: LED Products, Medical and other appliances, Automobiles, and Electrical & Electronics spare parts trading. Earnings per share remained at Rs 0.09 for the quarter. The results were reviewed by the Audit Committee and approved by the Board of Directors on October 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760525523272,
            "Source": "earnings"
        },
        {
            "Title": "MIC Electronics Secures Railway Orders Worth Rs. 1.76 Crore",
            "Summary": "MIC Electronics Limited received two Letters of Acceptance totaling Rs. 1,76,20,864.50. The first order from Sambalpur Division involves shifting Coach Indication Board Systems and Auto Announcement Systems at eight Amrit Bharat stations, valued at Rs. 1,19,73,573.30 with a 6-month execution timeline. The second order from Integral Coach Factory, Chennai covers supply of LED Emergency Lights worth Rs. 56,47,291.20 to be completed in 9 months. Both orders are from Indian Railways through direct tender participation. The promoter group has no interest in the awarding entities, and the transactions do not involve related parties.",
            "Sentiment": "positive",
            "PublishDate": 1757914894661,
            "Source": "order&deals"
        },
        {
            "Title": "Mic Electronics Partners with Top2 Pte to Explore Taiwanese Semiconductor Manufacturing",
            "Summary": "Mic Electronics has signed an agreement with Top2 Pte to find a Taiwanese semiconductor partner. The company aims to explore semiconductor partnerships in Taiwan with a production goal of 25,000 to 30,000 wafers per month.",
            "Sentiment": "positive",
            "PublishDate": 1757488502938,
            "Source": "stock"
        },
        {
            "Title": "MIC Electronics Secures Railway Contracts Worth Rs 1.73 Crore from South Central and Northern Railways",
            "Summary": "MIC Electronics Limited received Letters of Acceptance for three railway projects totaling Rs 1,73,04,860. The first project from South Central Railway worth Rs 53,67,040 involves providing coach guidance boards and replacing platform announcement systems at 20 stations. Two projects from Northern Railway, valued at Rs 43,89,560 and Rs 75,48,260 respectively, cover passenger amenities and information system expansion under the Amrit Bharat station scheme across 16 stations in Delhi division. All orders are from domestic entities through direct tender participation. The first project has a 12-month execution timeline, while execution periods for the other two projects are not specified. None of the orders involve related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1756116745401,
            "Source": "order&deals"
        },
        {
            "Title": "RRK Enterprise Sells 52.67 Lakh Shares in MIC Electronics, Reduces Stake to 54.26%",
            "Summary": "RRK Enterprise Private Limited, a promoter of MIC Electronics Limited, sold 52,67,239 equity shares through open market transactions between June 26, 2025 and August 13, 2025. The sale reduced RRK Enterprise's shareholding from 56.45% to 54.26% in MIC Electronics. The shares were sold in the secondary market, with MIC Electronics having a total equity share capital of Rs. 48,20,23,120 divided into 24,10,11,560 equity shares of Rs. 2 each. The transaction was disclosed by Kaushik Yalamanchili, Director of RRK Enterprise Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755492345581,
            "Source": "corporate_action"
        },
        {
            "Title": "MIC Electronics Receives BIS Certificates for Visual Display Units and LED Street Lighting Products",
            "Summary": "MIC Electronics Limited has obtained BIS Certificates from the Bureau of Indian Standards for two product categories. The certificates cover Visual Display Units and Video Monitors complying with IS 13252(PART 1):2010/ IEC 60950-1:2005 standards, and LED Luminaires for Road and Street Lighting meeting IS 10322 (PART 5/SEC 3):2012 specifications. These certifications indicate the company's products meet specific Indian Standards requirements.",
            "Sentiment": "positive",
            "PublishDate": 1754986659627,
            "Source": "stock"
        },
        {
            "Title": "MIC Electronics Executes MOU with Singapore's NEO SEMI for Acquisition Deal",
            "Summary": "MIC Electronics Limited has executed a preliminary Memorandum of Understanding on July 28, 2025, with NEO SEMI SG PTE LIMITED of Singapore for a proposed acquisition of the Singapore-based company. This follows an earlier announcement made by MIC Electronics on July 25, 2025, regarding the acquisition proposal.",
            "Sentiment": "positive",
            "PublishDate": 1753766338156,
            "Source": "order&deals"
        },
        {
            "Title": "MIC Electronics Receives Board Approval to Explore Acquisition of Singapore-Based Neo Semi SG",
            "Summary": "MIC Electronics Limited's Board of Directors granted in-principle approval to explore acquiring equity shares in Neo Semi SG Pte. Ltd. (NSPL), a Singapore-based company specializing in semiconductor technology, IoT solutions, and electronics refurbishment. The proposed acquisition aims to diversify MIC Electronics' portfolio into high-tech sectors including semiconductors, green energy, and digital service infrastructure. NSPL operates through partnerships with a Silicon Valley semiconductor chip design company, an energy management firm offering IoT-based solutions, and India's largest electronics refurbishment and reverse logistics company. The transaction remains subject to independent valuation by SEBI-registered valuers, comprehensive due diligence, finalization of transaction structure, and regulatory approvals. The Board authorized the Managing Director to negotiate and appoint intermediaries for valuation and due diligence processes. The current Memorandum of Understanding between the companies is preliminary and non-binding.",
            "Sentiment": "positive",
            "PublishDate": 1753447931062,
            "Source": "order&deals"
        },
        {
            "Title": "MIC Electronics Schedules Board Meeting to Discuss Singapore Company Acquisition",
            "Summary": "MIC Electronics Limited has scheduled a Board of Directors meeting for July 25, 2025, to discuss and approve a proposal for acquiring a Singapore-based company. The board will also consider preliminary memorandum of understanding, agreements and related documentation for the acquisition. The company has implemented a trading window closure for all designated persons and their immediate relatives from the board meeting notice until 48 hours after the outcome is declared to stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1753177730097,
            "Source": "order&deals"
        },
        {
            "Title": "Mic Electronics Secures Railway Display Contract and BIS Certification",
            "Summary": "Mic Electronics has secured a two-year maintenance contract for 10 indoor and 5 outdoor display boards at Vijayawada Railway Station from Vijayawada Division. Additionally, the company has obtained BIS (Bureau of Indian Standards) certification for Automatic Data Processing Machines.",
            "Sentiment": "positive",
            "PublishDate": 1752649713000,
            "Source": "default"
        },
        {
            "Title": "Mic Electronics Reports Q1 Results: Profit Down, Revenue Up",
            "Summary": "Mic Electronics has reported its Q1 financial results. The company's profit decreased to 17 million rupees from 19.6 million rupees in the same quarter last year. However, revenue increased to 116 million rupees from 107 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1751613080000,
            "Source": "result"
        },
        {
            "Title": "MIC Electronics Reports Q4 Financial Results",
            "Summary": "MIC Electronics has released its Q4 financial results. The company's EBITDA increased to 84 million rupees from 54 million rupees year-over-year. However, the EBITDA margin decreased to 18.65% from 23.58% in the same period. Revenue grew to 448 million rupees from 230 million rupees year-over-year. The company's net profit before tax rose to 68 million rupees from 55 million rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747905589000,
            "Source": "result"
        },
        {
            "Title": "MIC Electronics: Small-Cap Stock Gains Despite Flat Market Trend",
            "Summary": "MIC Electronics Limited, a small-cap stock trading under ₹100, saw its share price increase by 1.4% to ₹59.33 despite a flat trend in the broader market. The company recently received ISO 45001:2018 and ISO 14001:2015 certifications for its Environmental Management System.",
            "Sentiment": "positive",
            "PublishDate": 1745908620000,
            "Source": "normal_news"
        },
        {
            "Title": "MIC Electronics Receives ISO Certification for EV Chargers and Controllers",
            "Summary": "MIC Electronics has obtained ISO certification from the United Registrar of Systems. The certification covers the company's activities related to EV chargers and microprocessor-based controllers for roof-mounted AC systems, among other products.",
            "Sentiment": "positive",
            "PublishDate": 1745834379000,
            "Source": "default"
        },
        {
            "Title": "Mic Electronics: Q3 FY25 Profit Dips 19.93% YoY Amid Revenue Decline",
            "Summary": "Mic Electronics reported Q3 FY25 results with profit at ₹2.17 crore, down 19.93% YoY. Revenue decreased by 32.82% YoY to ₹11.75 crore. Operating income increased 35.56% YoY despite a 6.15% QoQ decline. EPS fell to ₹0.09, a 25% YoY decrease.",
            "Sentiment": "negative",
            "PublishDate": 1739566410000,
            "Source": "earnings"
        },
        {
            "Title": "MIC Electronics: Approval Granted for Emergency Lighting System Supply",
            "Summary": "MIC Electronics received approval to supply and install Emergency Lighting Systems for EOG Type LHB AC and NAC Coaches. The stock initially dropped 5% but recovered slightly after the announcement. The company will release Q4 2024 financial results today.",
            "Sentiment": "positive",
            "PublishDate": 1739339871000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mic Electronics Completes 510 Million Rupee Investment in Soa Electronics Trading LLC",
            "Summary": "Mic Electronics has announced the completion of its investment in Soa Electronics Trading LLC. The investment is valued at 510 million rupees, marking a significant corporate action for the company.",
            "Sentiment": "positive",
            "PublishDate": 1735603268000,
            "Source": "corporate_action"
        },
        {
            "Title": "MIC Electronics: Small-Cap Stock Surges 150% YTD, Hits Upper Circuit",
            "Summary": "MIC Electronics stock hit 5% upper circuit, trading at ₹86.76. Company received approval for GPS-based systems and LED boards for railway coaches. Q2 FY25 saw 57.75% increase in net sales to ₹11.20 crore, but net profit declined 74.63% to ₹2.11 crore. EBITDA grew 55.24% to ₹3.85 crore. Company established a new wholly-owned subsidiary, MICK Digital India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1735015940000,
            "Source": "normal_news"
        },
        {
            "Title": "Mic Electronics Receives CCA Approval for GPS-Based PAPIS and LED Destination Boards",
            "Summary": "Mic Electronics has obtained approval from the Centre for Construction Approvals (CCA) for GPS location-based Passenger Address and Passenger Information Systems (PAPIS) and LED destination boards. These systems are designed for use in Integral Coach Factory (ICF) and Linke Hofmann Busch (LHB) coaches, which are types of railway passenger coaches used in India.",
            "Sentiment": "positive",
            "PublishDate": 1734998957000,
            "Source": "corporate_action"
        },
        {
            "Title": "MIC Electronics: Small-Cap Stock Surges 150% YTD, Analyst Predicts Further Upside",
            "Summary": "MIC Electronics Ltd, a small-cap stock, has gained 150% year-to-date. Anand Rathi Research forecasts an additional 10% upside, setting a one-month target price of ₹90. The stock is currently trading around ₹84, down from September highs of ₹114-115. Analysts remain bullish, citing technical indicators suggesting potential bullish momentum.",
            "Sentiment": "positive",
            "PublishDate": 1732865901000,
            "Source": "normal_news"
        },
        {
            "Title": "MIC Electronics: Small-Cap Stock Surges on Railway Order and Q2 Results",
            "Summary": "MIC Electronics shares rose 3.67% after Q2 results and recent railway contracts. Q2 net sales increased 57.75% YoY to Rs 11.20 crore, while net profit fell 74.63% to Rs 2.11 crore. The company won orders from Indian Railways for display systems and is pursuing growth through acquisitions in related fields.",
            "Sentiment": "positive",
            "PublishDate": 1732006986000,
            "Source": "result"
        },
        {
            "Title": "MIC Electronics: Incorporates Wholly Owned Subsidiary for Digital and Battery Tech",
            "Summary": "MIC Electronics Limited has incorporated MICK Digital India Limited as a wholly owned subsidiary on November 8, 2024, by subscribing to 50,000 equity shares at Rs. 10 each, totaling Rs. 5,00,000. The new subsidiary will focus on manufacturing and dealing in smart meters, digital technologies, and various battery and energy storage solutions.",
            "Sentiment": "positive",
            "PublishDate": 1731238578000,
            "Source": "corporate_action"
        },
        {
            "Title": "MIC Electronics: Stock Surges 185% YTD, Announces Strategic Initiatives",
            "Summary": "MIC Electronics stock rose 4.66% to Rs 98.50. The company's board recommended appointing a new Independent Director and resolved to explore strategic acquisitions. MIC Electronics recently secured a Rs 1.21 Crore order from Eastern Railway. Q1FY25 results showed 53% increase in net sales and 59% rise in net profit year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729072218000,
            "Source": "normal_news"
        },
        {
            "Title": "MIC Electronics: Board Approves New Chairman and Expansion Plans",
            "Summary": "MIC Electronics' board appointed P.V. Ramesh as Additional Director and Non-Executive Chairman for 5 years. The company also approved plans to acquire businesses in allied sectors and received a ₹1.21 crore order from Eastern Railway.",
            "Sentiment": "positive",
            "PublishDate": 1729061466000,
            "Source": "corporate_action"
        },
        {
            "Title": "MIC Electronics: Shares Surge 4% on Railway Contract Wins",
            "Summary": "<p>MIC Electronics shares <span class='positive'>rose 4%</span> to Rs 99.50 following recent <span class='positive'>contract wins</span> from Indian Railways. The company <span class='positive'>secured</span> a Rs 1.33 crore contract from Western Railway and a Rs 2.54 crore order from Northern Railway for passenger information systems. <b>Q1FY25 net income</b> <span class='positive'>increased 52.22%</span> year-over-year to Rs 10.93 crore.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728453621000,
            "Source": "normal_news"
        }
    ]
}