{
    "Symbol": "MIDHANI",
    "ISIN": "INE099Z01011",
    "News": [
        {
            "Title": "Mishra Dhatu Nigam Wins ₹158 Crore Contract",
            "Summary": "Mishra Dhatu Nigam Limited has secured a significant contract worth ₹158 crore, marking a major business development for the defense metallurgy specialist.",
            "Sentiment": "positive",
            "PublishDate": 1770218947891,
            "Source": "co_actions_results"
        },
        {
            "Title": "MIDHANI Secures ₹121.75 Cr Order, Total Order Book Reaches ₹2,520 Cr",
            "Summary": "Mishra Dhatu Nigam Limited announces new order worth ₹121.75 crores, bringing total open order position to approximately ₹2,520 crores as per regulatory filing dated December 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766073887153,
            "Source": "co_actions_results"
        },
        {
            "Title": "MIDHANI Fined Rs 2.36 Lakh by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "BSE and NSE imposed fines of Rs 1.18 lakh each on MIDHANI for non-compliance with board composition regulations for the quarter ended September 30, 2025. The company plans to request fine waiver citing that director appointments are controlled by the President of India through Ministry of Defence, making compliance impossible under current structure.",
            "Sentiment": "negative",
            "PublishDate": 1764397920078,
            "Source": "corporate_governance"
        },
        {
            "Title": "MIDHANI Reports Q2 FY26 Results with Revenue Decline but Maintains Strong Order Book",
            "Summary": "Mishra Dhatu Nigam Limited (MIDHANI) reported Q2 FY26 turnover of INR 209.73 crores versus INR 262.12 crores in the previous year, while maintaining profit after tax at INR 12.77 crores and a robust order book of INR 1,869 crores. The company signed strategic MOUs for a metal bank initiative and ABHED bulletproof jacket technology, targeting INR 1,300 crores revenue for FY26 with expected growth driven by superalloys and titanium alloys business.",
            "Sentiment": "neutral",
            "PublishDate": 1763554540826,
            "Source": "earnings"
        },
        {
            "Title": "Mishra Dhatu Nigam Sets FY26 Revenue Target at INR 1,300 Crores Despite H1 Degrowth",
            "Summary": "Mishra Dhatu Nigam targets INR 1,300 crores revenue for FY26 with expected EBITDA margins of around 23%, maintaining confidence despite H1 degrowth. The company expects at least 10% annual growth long-term and aims to maintain an order book of at least INR 2,000 crores by April 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763202446575,
            "Source": "stock"
        },
        {
            "Title": "MIDHANI Reports 20% Decline in Quarterly Revenue and 46% Drop in Profit for Q2 FY2025-26",
            "Summary": "Mishra Dhatu Nigam Limited (MIDHANI) recorded turnover of Rs 209.73 crores in Q2 FY2025-26 compared to Rs 262.12 crores in the same period last year, while profit after tax fell to Rs 12.77 crores from Rs 23.55 crores. The defence PSU's half-yearly performance also showed revenue decline to Rs 380.22 crores from Rs 425.57 crores, though it maintains an order book position of Rs 1,869 crores as of October 1, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763065836840,
            "Source": "earnings"
        },
        {
            "Title": "Mishra Dhatu Nigam Secures Rs. 306 Cr Order, Total Open Orders Reach Rs. 2,212 Cr",
            "Summary": "Mishra Dhatu Nigam Limited (MIDHANI) has secured a new order worth Rs. 306 crore. Following this order, the company's total open order position stands at approximately Rs. 2,212 crore. MIDHANI is a Government of India enterprise with its registered office in Hyderabad, Telangana.",
            "Sentiment": "positive",
            "PublishDate": 1760441230029,
            "Source": "order&deals"
        },
        {
            "Title": "MIDHANI Appoints Shri Padavittan Babu as Director (Production & Marketing) for Five-Year Term",
            "Summary": "Mishra Dhatu Nigam Limited (MIDHANI) announced the appointment of Shri Padavittan Babu as Director (Production & Marketing) for a five-year term. The appointment was conveyed by the Department of Defence Production, Ministry of Defence. Babu, who holds the position of General Manager (Technical Services) with DIN 11233808, will receive compensation in the pay scale of Rs. 1,60,000 - 2,90,000 (IDA). The term will commence from the date he assumes charge of the position. The company stated that additional disclosure information will be provided after Babu officially takes charge.",
            "Sentiment": "neutral",
            "PublishDate": 1759548326651,
            "Source": "corporate_governance"
        },
        {
            "Title": "Midhani Extends Chairman's Additional Charge as Director for One Month",
            "Summary": "Mishra Dhatu Nigam Limited announced that Dr. S.V.S. Narayana Murty, Chairman & Managing Director, has received approval from the Department of Defence Production, Ministry of Defence for an extension of his additional charge as Director (Production & Marketing). The extension is effective from October 1, 2025, for one month or until a regular incumbent joins the position, whichever occurs first.",
            "Sentiment": "neutral",
            "PublishDate": 1758199116835,
            "Source": "corporate_governance"
        },
        {
            "Title": "MIDHANI Secures Rs. 136 Crore New Order, Total Open Orders Reach Rs. 1,983 Crore",
            "Summary": "Mishra Dhatu Nigam Limited (MIDHANI) has secured a new order worth Rs. 136 crore. Following this order, the company's total open order position stands at approximately Rs. 1,983 crore. The company communicated this development to BSE Limited and National Stock Exchange of India Limited through its Company Secretary & Compliance Officer Paul Antony.",
            "Sentiment": "positive",
            "PublishDate": 1757937695341,
            "Source": "stock"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Strong Q1 Performance with 150% Jump in Net Profit",
            "Summary": "Mishra Dhatu Nigam Limited delivered robust quarterly results with turnover reaching Rs. 170.5 crores, marking 4.31% growth over the previous year. The company achieved significant profitability improvements with EBITDA growing 32.86% to Rs. 41.28 crores, profit before tax surging 112.5% to Rs. 19 crores, and profit after tax jumping 150.49% to Rs. 12.8 crores. Value of production increased 14.47% to Rs. 241.29 crores. The company maintains a strong order book of Rs. 1,827 crores and expects additional orders worth Rs. 701 crores in Q2. Management targets revenue of Rs. 1,300-1,500 crores for the fiscal year, with EBITDA margins expected to remain between 23-25%. The order book comprises 80% defense-related orders including Rs. 761 crores from aerospace, Rs. 156 crores from army, and Rs. 420 crores from naval sectors. The company operates with 40% utilization of its wide plate mill and is establishing powder manufacturing facilities for additive manufacturing applications.",
            "Sentiment": "positive",
            "PublishDate": 1755927095092,
            "Source": "earnings"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Strong Q1 Performance with Net Profit Rising 145%",
            "Summary": "Mishra Dhatu Nigam delivered strong Q1 results with consolidated net profit increasing to 130 million rupees from 53 million rupees year-over-year. Revenue grew to 1.7 billion rupees compared to 1.6 billion rupees in the same period last year. The company's EBITDA rose significantly to 351 million rupees from 233 million rupees year-over-year, while EBITDA margin expanded to 19.99% from 14.26% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755089241486,
            "Source": "earnings"
        },
        {
            "Title": "Mishra Dhatu Nigam Schedules Q1FY26 Results Conference Call for August 18",
            "Summary": "Mishra Dhatu Nigam Limited has scheduled a conference call for analysts and investors on August 18, 2025 at 14:00 IST to discuss Q1FY26 results and business updates. The board meeting is set for August 13, 2025 to approve the financial results for the quarter ended June 30, 2025. The conference call will be represented by Dr. S. V. S. Narayana Murty, Chairman & Managing Director, and Mrs. Madhubala Kalluri, Director (Finance). The company has provided universal access numbers and toll-free numbers for various countries including Singapore, Hong Kong, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1755004715786,
            "Source": "earnings"
        },
        {
            "Title": "MIDHANI Appoints Ms. Madhubala Kalluri as Director (Finance)",
            "Summary": "Mishra Dhatu Nigam Limited (MIDHANI) appointed Ms. Madhubala Kalluri as Director (Finance) effective July 21, 2025. Her appointment will continue until her superannuation on August 31, 2027, or until further orders from the Ministry of Defence. Kalluri will receive a pay scale of Rs. 1,60,000 - 2,90,000 (IDA). She previously served as General Manager (Finance) at MIDHANI and has over 32 years of experience in the company, having joined as Accounts Officer in 1993. She holds a postgraduate degree in Commerce from Andhra University and is a Fellow Member of The Institute of Cost Accountants of India. Her appointment ends the additional charge held by Dr. S. V. S. Narayana Murty, who was temporarily handling the Director (Finance) role.",
            "Sentiment": "positive",
            "PublishDate": 1753101810587,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mishra Dhatu Nigam to Supply Superalloy Worth 6,000 Crore to HAL",
            "Summary": "Mishra Dhatu Nigam will provide superalloy valued at 6,000 crore to Hindustan Aeronautics Limited (HAL). The company's current market capitalization is 7,600 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752553226000,
            "Source": "default"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Q4 Financial Results",
            "Summary": "Mishra Dhatu Nigam has reported its Q4 consolidated net profit at 562 million rupees, compared to 463 million rupees year-over-year and 255 million rupees quarter-over-quarter. The company's Q4 revenue stood at 4.1 billion rupees, up from 3.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748477312000,
            "Source": "default"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Q4 Profit and Revenue Growth",
            "Summary": "Mishra Dhatu Nigam has reported its latest quarterly results. The company's consolidated net profit for Q4 increased to 562 million rupees, up from 463 million rupees year-over-year and 255 million rupees quarter-over-quarter. Revenue for Q4 rose to 4.1 billion rupees, compared to 3.9 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748434777000,
            "Source": "result"
        },
        {
            "Title": "Mishra Dhatu Nigam: Q4 FY2024-25 Results Date Announced",
            "Summary": "Mishra Dhatu Nigam Ltd. will release Q4 and FY2024-25 financial results on May 28, 2025. Trading window for insiders closed from April 1 until 48 hours post-result declaration. Q3FY25 saw revenue decline but significant profit increase.",
            "Sentiment": "neutral",
            "PublishDate": 1748249237000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mishra Dhatu Nigam: New CMD Appointment Sparks 8% Stock Rally",
            "Summary": "Mishra Dhatu Nigam shares surged 8% following the appointment of Dr. S.V.S. Narayana Murty as Chairman & Managing Director, effective April 28, 2025. The appointment, announced on April 15, 2025, is valid until December 31, 2029, or until further orders.",
            "Sentiment": "positive",
            "PublishDate": 1745828626000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Stable Sales and Record Exports for FY 2024-25",
            "Summary": "Mishra Dhatu Nigam has reported sales of Rs. 1070 crore for the financial year 2024-25, which is slightly lower compared to Rs. 1072.67 crore in the previous fiscal year. However, the company has achieved its highest ever exports, amounting to Rs. 94 crore.",
            "Sentiment": "positive",
            "PublishDate": 1743489222000,
            "Source": "result"
        },
        {
            "Title": "Mishra Dhatu Nigam: Shares Surge 6% Ahead of Interim Dividend Record Date",
            "Summary": "Mishra Dhatu Nigam's stock rose nearly 6% to ₹303.90 on March 24, ahead of the March 25 record date for a ₹0.75 per share interim dividend. The company approved this 7.5% dividend for FY 2024-25 on March 19. The stock will trade ex-dividend from March 26.",
            "Sentiment": "positive",
            "PublishDate": 1742789942000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mishra Dhatu Nigam: Board Declares 7.5% Interim Dividend",
            "Summary": "Mishra Dhatu Nigam's board approved an interim dividend of ₹0.75 per share (7.5% of face value) for FY 2024-25. The record date is set for March 25, 2025. The stock price rose 8.40% to ₹284.60 on the BSE following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1742439664000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mishra Dhatu Nigam: Declares ₹0.75 Interim Dividend for FY25",
            "Summary": "Mishra Dhatu Nigam Ltd (MIDHANI) announced an interim dividend of ₹0.75 per share for FY 2024-25. The record date is set for March 25, 2025. The company expects to surpass last year's turnover, with a current order book of ₹2,000 crore. MIDHANI anticipates higher production orders in FY26, particularly from Naval and Aerospace sectors.",
            "Sentiment": "positive",
            "PublishDate": 1742383458000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mishra Dhatu Nigam: Stock Surges 7% Ahead of Dividend Decision",
            "Summary": "Mishra Dhatu Nigam's stock price jumped over 7% as the board meets to consider an interim dividend for FY25. The company has set March 25 as the record date for dividend entitlement.",
            "Sentiment": "positive",
            "PublishDate": 1742358396000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mishra Dhatu Nigam Board to Consider Interim Dividend for FY 2024-25",
            "Summary": "Mishra Dhatu Nigam Limited has announced a board meeting scheduled for March 20. The primary agenda of this meeting is to consider a proposal for the declaration of an interim dividend for the fiscal year 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1741775055000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mishra Dhatu Nigam Developing New Alloys for Aerospace, Energy, and Defense",
            "Summary": "Mishra Dhatu Nigam is developing various new alloys, including Ultra AUS and Advanced Ultra Supercritical Alloys, for applications in aerospace, energy, and naval sectors. The company is also working on alloys for the army, specifically for gun barrels. This development indicates the company's focus on innovation and expansion in high-tech materials for critical industries.",
            "Sentiment": "positive",
            "PublishDate": 1738898809000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mishra Dhatu Nigam Anticipates Increased Orders from Pratt & Whitney",
            "Summary": "Mishra Dhatu Nigam expects to double its current order numbers from Pratt & Whitney if they successfully execute the present order by the end of the financial year. The company anticipates receiving additional orders upon successful completion of its current orders.",
            "Sentiment": "positive",
            "PublishDate": 1738898746000,
            "Source": "order&deals"
        },
        {
            "Title": "Mishra Dhatu Nigam Aims to Maintain or Improve EBITDA Margins",
            "Summary": "Mishra Dhatu Nigam (MIDHANI) has expressed its intention to maintain and potentially improve its EBITDA margins. The company expects these margins to continue at their current level or possibly increase, as stated during a recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1738898647000,
            "Source": "earnings"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Strong Order Book and Margin Improvement",
            "Summary": "Mishra Dhatu Nigam has reported a positive outlook with strong orders, particularly in the aerospace and naval sectors. The company expects to see improved margins due to increased performance, which is attributed to the development of new grades and improved yields over time.",
            "Sentiment": "positive",
            "PublishDate": 1738898611000,
            "Source": "earnings"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Mishra Dhatu Nigam has reported a substantial year-over-year improvement in its financial performance for the third quarter. The company's EBITDA increased from 359 million rupees to 525 million rupees. Additionally, the EBITDA margin expanded significantly from 14.24% to 22.04%.",
            "Sentiment": "positive",
            "PublishDate": 1738654139000,
            "Source": "earnings"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Significant Profit Increase in Q3",
            "Summary": "Mishra Dhatu Nigam has reported a substantial increase in net profit for the third quarter, rising to 255 million rupees from 128 million rupees in the same period last year. However, the company's revenue slightly decreased to 2.4 billion rupees from 2.52 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738654080000,
            "Source": "earnings"
        },
        {
            "Title": "Mishra Dhatu Nigam: Pratt & Whitney Supply Deal Expected Within Two Months",
            "Summary": "Mishra Dhatu Nigam Ltd. (MIDHANI) is in talks with Pratt & Whitney to finalize a global supply deal for engine components within two months. The deal size is yet to be determined. MIDHANI aims to secure a long-term contract, building on its past supply relationship with the aircraft engine maker.",
            "Sentiment": "positive",
            "PublishDate": 1734761941000,
            "Source": "order&deals"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Improved Q2 Financial Performance",
            "Summary": "Mishra Dhatu Nigam has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 490 million rupees from 363 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 18.68% from 15.96% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731503197000,
            "Source": "result"
        },
        {
            "Title": "Mishra Dhatu Nigam Reports Significant Profit Growth in Q2",
            "Summary": "Mishra Dhatu Nigam has reported a substantial increase in its consolidated net profit for the second quarter. The company's net profit rose to 238 million rupees, up from 139 million rupees year-over-year and 53 million rupees quarter-over-quarter. Additionally, the company's revenue for Q2 increased to 2.6 billion rupees from 2.27 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731503157000,
            "Source": "result"
        }
    ]
}