{
    "Symbol": "MIDWESTLTD",
    "ISIN": "INE0XAD01024",
    "News": [
        {
            "Title": "Midwest Limited Reports No IPO Fund Deviations in Q3",
            "Summary": "Midwest Limited confirms no deviations in IPO proceeds utilization for Q3 FY26, with ₹2,500.00 million raised in October 2025 being used as per original allocation across various projects.",
            "Sentiment": "neutral",
            "PublishDate": 1770913833828,
            "Source": "stocks"
        },
        {
            "Title": "Midwest Limited Reports Strong Q3 & 9MFY26 Results",
            "Summary": "Midwest Limited delivered impressive 9MFY26 performance with revenue growing 9% YoY to ₹429.81 crores, EBITDA rising 19% to ₹116.05 crores, and adjusted PAT increasing 18% to ₹69.45 crores, while securing new quarry lease.",
            "Sentiment": "positive",
            "PublishDate": 1770893296403,
            "Source": "co_actions_results"
        },
        {
            "Title": "Midwest Limited Sets Up Subsidiary in Sierra Leone",
            "Summary": "Midwest Limited's board approved incorporation of a wholly-owned subsidiary in Sierra Leone on January 7, 2026, to explore HMS reserves and apply for mineral rights in the West African nation.",
            "Sentiment": "positive",
            "PublishDate": 1767789088656,
            "Source": "co_actions_results"
        },
        {
            "Title": "Midwest Limited Share Transfer via Gift Deed",
            "Summary": "Kollareddy Ranganayakamma to acquire 14,08,851 equity shares (3.90%) from promoter Rama Raghava Reddy Kollareddy through inter-se transfer by gift on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765808286917,
            "Source": "co_actions_results"
        },
        {
            "Title": "Midwest Limited Reports Strong Q2 FY26 Results with 52% EBITDA Growth in Maiden Earnings Call",
            "Summary": "Midwest Limited delivered exceptional quarterly performance with EBITDA growing 52% and PAT increasing 80% year-on-year, driven by improved capacity utilization and operational efficiencies that pushed EBITDA margins above 29%. The company, India's largest producer of Black Galaxy granite, successfully raised INR 250 crores through IPO for Phase 2 quartz facility expansion and is diversifying into heavy mineral sands and rare earth materials with operations expected by FY2027.",
            "Sentiment": "positive",
            "PublishDate": 1763558898785,
            "Source": "earnings"
        },
        {
            "Title": "Midwest Limited Reports Strong H1 FY26 Performance with 8% Revenue Growth and New Quartz Plant Commissioning",
            "Summary": "Midwest Limited achieved significant growth with revenue, EBITDA, and PAT increasing by 8%, 16%, and 17% respectively in H1 FY26, while commissioning Phase I of its 303,600 MTPA quartz processing plant in September 2025. The company, India's largest Black Galaxy granite producer, also secured four exploration licenses in Sri Lanka for heavy mineral sands and rare earth minerals, strengthening its diversification strategy.",
            "Sentiment": "positive",
            "PublishDate": 1763109692380,
            "Source": "earnings"
        },
        {
            "Title": "Midwest Reports Strong Q2 Performance with 52% Jump in EBITDA",
            "Summary": "Midwest delivered robust quarterly results with EBITDA rising to 430 million rupees from 283 million rupees year-over-year. The company's EBITDA margin expanded significantly to 27.10% compared to 20.04% in the same period last year. Consolidated net profit nearly doubled to 278 million rupees from 149 million rupees year-over-year. Revenue grew to 1.6 billion rupees from 1.4 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762963007532,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Upgrades Credit Rating of Midwest Limited's Subsidiary Andhra Pradesh Granite",
            "Summary": "CRISIL Ratings upgraded the credit rating of Andhra Pradesh Granite (Midwest) Private Limited, a subsidiary of Midwest Limited. The long-term rating was upgraded to CRISIL A-/Stable from CRISIL BBB+/Positive, while the short-term rating improved to CRISIL A2+ from CRISIL A2. Total bank loan facilities rated amount to Rs. 73.21 crores. The upgrade reflects strong support from the parent company, extensive promoter experience in the granite industry, healthy business performance, and strong financial risk profile. The company reported revenue of Rs. 256.84 crores with operating margins above 25%. However, the business faces challenges including product concentration risk as Black Galaxy granite is the sole revenue contributor, intense competition from alternative products, and vulnerability to foreign exchange fluctuations.",
            "Sentiment": "positive",
            "PublishDate": 1762935476371,
            "Source": "corporate_action"
        }
    ]
}