{
    "Symbol": "MINDACORP",
    "ISIN": "INE842C01021",
    "News": [
        {
            "Title": "Minda Corporation seeks shareholder nod for ESOP amendments",
            "Summary": "Minda Corporation Limited has issued a postal ballot notice seeking shareholder approval for amendments to its Employee Stock Option Scheme 2017 and introduction of a new ESOP 2025 scheme with 32,18,517 options.",
            "Sentiment": "neutral",
            "PublishDate": 1770882839968,
            "Source": "co_actions_results"
        },
        {
            "Title": "Minda Corporation Q3 Net Profit Jumps 32% YoY",
            "Summary": "Minda Corporation reported consolidated net profit of 857 million rupees in Q3, marking significant growth from 648 million rupees in the same quarter last year, representing a 32% year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1770282525917,
            "Source": "co_actions_results"
        },
        {
            "Title": "Minda Corporation Board Meet Set for Feb 5, 2026",
            "Summary": "Minda Corporation has scheduled its board meeting for February 5, 2026, to review Q3FY26 results, consider interim dividend, and approve amendments to employee stock option schemes.",
            "Sentiment": "neutral",
            "PublishDate": 1769085501460,
            "Source": "co_actions_results"
        },
        {
            "Title": "Minda Corp Subsidiary Faces ₹17.26 Cr GST Penalty",
            "Summary": "Minda Instruments Limited, material subsidiary of Minda Corporation, received GST penalty order of ₹17.26 crores from Maharashtra tax authorities for FY 2021-22 classification issues.",
            "Sentiment": "negative",
            "PublishDate": 1767683674664,
            "Source": "stocks"
        },
        {
            "Title": "Minda Corporation Issues ₹100 Cr Commercial Paper",
            "Summary": "Minda Corporation Limited has issued and allotted commercial paper worth ₹100 crores with a discount rate of 6.35% p.a., maturing on March 19, 2026. The paper is listed on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1766402883790,
            "Source": "co_actions_results"
        },
        {
            "Title": "Minda Corporation Grants Employee Stock Options",
            "Summary": "Minda Corporation's board approves ESOP grants worth ₹9 crores total, including 57,388 options effective December 20, 2025, with exercise price at face value of ₹2 per option.",
            "Sentiment": "positive",
            "PublishDate": 1766216348635,
            "Source": "co_actions_results"
        },
        {
            "Title": "Minda Corporation ESG Rating Improves to 68.4 in FY25",
            "Summary": "Minda Corporation's ESG rating increased to 68.4 in FY2025 from 66.6 in FY2024, as assessed by SESESG Research. The company clarified it did not engage the rating agency for this independent evaluation.",
            "Sentiment": "positive",
            "PublishDate": 1765452335203,
            "Source": "stocks"
        },
        {
            "Title": "Minda Corporation Issues Final Notice for Unclaimed Dividend Transfer to IEPF",
            "Summary": "Minda Corporation Limited has notified shareholders about the mandatory transfer of unclaimed dividends from FY 2018-19 (Interim) and related equity shares to the Investor Education and Protection Fund (IEPF) by March 09, 2026. Shareholders who have not encashed their dividends for seven consecutive years must claim them by March 08, 2026, or forfeit their shares and dividends to the IEPF without further notice.",
            "Sentiment": "neutral",
            "PublishDate": 1765277971677,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Appoints Supratik Roy as CEO-Emerging Business",
            "Summary": "Minda Corporation Limited has appointed Mr. Supratik Roy as CEO-Emerging Business effective December 01, 2025. Roy brings extensive automotive industry experience across major OEMs and deep understanding of EV component ecosystem including localization from Japan and Southeast Asia to India.",
            "Sentiment": "positive",
            "PublishDate": 1764592969291,
            "Source": "corporate_governance"
        },
        {
            "Title": "Minda Corporation CFO Vinod Raheja to Step Down in November 2025",
            "Summary": "Vinod Raheja will step down from his position as Group CFO of Minda Corporation starting November 14, 2025. This leadership change will affect the company's financial management structure and requires identification of a successor for the key executive role.",
            "Sentiment": "neutral",
            "PublishDate": 1763125201933,
            "Source": "corporate_governance"
        },
        {
            "Title": "Minda Corporation Reports Record Q2 Revenue of Rs 1,535 Crores, Up 19% YoY",
            "Summary": "Minda Corporation achieved its highest ever quarterly revenue of Rs 1,535 crores in Q2 FY26, marking a 19% year-on-year growth. The company reported record EBITDA of Rs 178 crores with an 11.6% margin, while profit after tax reached Rs 85 crores, up 14% YoY. The performance was driven by sustained demand across vehicle segments, increased market share, and strong traction in EV and premium product categories. The company secured significant new orders including its first sunroof order from a leading OEM with production starting Q1 FY27, high-voltage EV wiring harness orders, and TFT cluster wins. Flash Electronics, their associate company, reported revenue of Rs 446 crores with 16.1% EBITDA margin. Minda registered a lifetime order book of Rs 2,000 crores for the quarter and over Rs 3,600 crores for H1 FY26. The company maintains revenue growth guidance of 20-25% annually and targets greater than 12.5% EBITDA margin by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1762852401894,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Reports Strong Q2 Growth with Revenue Up 18.6% and Net Profit Rising 13.9%",
            "Summary": "Minda Corporation delivered robust quarterly performance with revenue increasing to 15.3 billion rupees from 12.9 billion rupees year-over-year. The company's EBITDA grew to 1.78 billion rupees compared to 1.46 billion rupees in the same period last year, while EBITDA margin improved to 11.6% from 11.36%. Consolidated net profit rose to 846 million rupees from 743 million rupees year-over-year, reflecting strong operational performance across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1762418142323,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Issues INR 100 Crore Commercial Paper with 7% Discount Rate",
            "Summary": "Minda Corporation Limited issued and allotted commercial paper worth INR 100 crores on October 16, 2025. The commercial paper has a face value of INR 5,00,000 per security, carries a discount rate of 7.00% per annum, and is set for redemption on March 6, 2026. The securities have been listed on the National Stock Exchange of India on the same date of issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1760609816341,
            "Source": "stock"
        },
        {
            "Title": "Minda Corporation Raises INR 100 Crores Through Commercial Paper Issuance",
            "Summary": "Minda Corporation Limited issued and allotted commercial paper worth INR 100 crores on October 15, 2025. The commercial paper carries a face value of INR 5,00,000 per security with a discount rate of 7.00% per annum and is scheduled for redemption on March 3, 2026. The securities have been listed on the National Stock Exchange of India on the same date as issuance. The ISIN for the commercial paper is INE842C14180.",
            "Sentiment": "neutral",
            "PublishDate": 1760530004857,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Shares Investor Presentation for September 2025 Meet, Highlights Growth Strategy and EV Portfolio Expansion",
            "Summary": "Minda Corporation Limited shared an investor presentation for their Investor Meet 2025 scheduled for September 23, 2025, in Pune. The company reported consolidated revenue of ₹5,056 crores for FY25 with group revenue of ₹7,472 crores. The presentation outlined ambitious targets for FY30 including revenue growth to ₹17,500+ crores (3.5x increase), EBITDA margin improvement to over 12.5%, and debt reduction to 0.3x from current 0.6x. The company operates through 6 business verticals across 32 global manufacturing plants with 18,000+ workforce. Key growth drivers include expanding EV portfolio, export focus targeting ₹1,500 crores by FY30 from current ₹420 crores, and planned capital expenditure of ₹2,000 crores over next 5 years. The company has acquired 49% stake in Flash Electronics, which generated ₹1,537 crores revenue in FY25 with 23% from EV products. Strategic partnerships include joint ventures with HCMF Taiwan for sunroof systems targeting ₹500 crores revenue by 2030, and Toyodenso Japan for switches expecting ₹650 crores by 2030. The presentation highlighted strong financial performance with revenue growing over 2x in last 5 years and profit after tax increasing 2.5x, while maintaining EBITDA margins at 11.4% in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1758622541707,
            "Source": "stock"
        },
        {
            "Title": "Minda Corporation Raises INR 100 Crores Through Commercial Paper Issuance",
            "Summary": "Minda Corporation Limited issued and allotted Commercial Paper worth INR 100 crores on September 15, 2025. The securities carry a face value of INR 5,00,000 per unit and offer a discount rate of 6.30% per annum. The Commercial Paper is scheduled for redemption on December 12, 2025, providing a tenure of approximately three months. The instrument has been assigned ISIN INE842C14164 and has been listed on the National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1757939401802,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Redeems Rs. 100 Crore Commercial Papers",
            "Summary": "Minda Corporation Limited has redeemed commercial papers worth Rs. 100 crores. The commercial papers, with ISIN INE842C14156, were issued on June 27, 2025 and redeemed on September 09, 2025 after making the payment. The company informed stock exchanges BSE and NSE about the redemption completion.",
            "Sentiment": "neutral",
            "PublishDate": 1757410953662,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Sets Record Dates for Three Commercial Paper Redemptions in September 2025",
            "Summary": "Minda Corporation Ltd has announced record dates for the redemption of three Commercial Paper issuances scheduled for September 2025. The first Commercial Paper (ISIN: INE842C14131) has a maturity date of September 19, 2025, with a record date of September 18, 2025. The second Commercial Paper (ISIN: INE842C14149) matures on September 12, 2025, with a record date of September 11, 2025. The third Commercial Paper (ISIN: INE842C14156) has a maturity date of September 9, 2025, and a record date of September 8, 2025. The announcement was made by Company Secretary Pardeep Mann to the National Stock Exchange of India and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1756281110162,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Reports Record Q1 Revenue of Rs. 1,386 Crores, Up 16.2% YoY",
            "Summary": "Minda Corporation achieved its highest ever quarterly revenue of Rs. 1,386 crores in Q1 FY2026, representing a 16.2% year-on-year growth. The automotive component manufacturer also recorded its highest quarterly EBITDA of Rs. 156 crores, up 19% YoY, with EBITDA margin improving to 11.3%. PAT remained stable at Rs. 65 crores compared to Rs. 64 crores in the previous year. The company's Information and Connected Systems segment grew 19% to Rs. 736 crores, while Mechatronics and Aftermarket segment increased 13% to Rs. 650 crores. Key developments include a joint venture with Toyodenso Corporation for advanced automotive switches with Rs. 150 crores initial investment, and a strategic partnership with Qualcomm for smart cockpit solutions. The company maintains a strong order book of over Rs. 1,300 crores, with more than 30% from new energy vehicles. Management expects gradual automotive sector recovery supported by the festive season and improved rural incomes. Flash Electronics, an associate company, reported revenue of Rs. 376 crores, up 14% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1755507816099,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Reports Record Revenue of Rs 1,386 Crore in Q1 FY26",
            "Summary": "Minda Corporation Limited announced its highest ever consolidated revenue of Rs 1,386 crore for the quarter ended June 30, 2025, representing a 16.2% year-on-year growth. The company achieved an EBITDA of Rs 156 crore with an operating margin of 11.3%, up 23 basis points year-on-year. Profit after tax reached Rs 65 crore with a margin of 4.7%. The company entered into a joint venture agreement with Toyodenso for manufacturing automotive switches, with Minda holding a 60% stake. The new facility will be established in Noida and is expected to commence operations in the second half of FY 2026-27. Additionally, Minda collaborated with Qualcomm to co-develop smart cockpit solutions powered by Snapdragon Cockpit Platform. Chairman Ashok Minda attributed the strong performance to resilient demand across key vehicle segments and operational excellence.",
            "Sentiment": "positive",
            "PublishDate": 1754991886741,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Reports Growth in Q1 Financial Results",
            "Summary": "Minda Corporation reported quarterly consolidated net profit of 653 million rupees compared to 642 million rupees in the same period last year. Revenue increased to 13.8 billion rupees from 11.9 billion rupees year-over-year. EBITDA rose to 1.56 billion rupees from 1.32 billion rupees, while EBITDA margin improved to 11.3% from 11.1% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754989740289,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Partners with Qualcomm for Smart Cockpit Solutions Development",
            "Summary": "Minda Corporation has entered into a partnership with Qualcomm to develop smart cockpit solutions. The collaboration focuses on creating advanced automotive technology solutions for vehicle interiors.",
            "Sentiment": "positive",
            "PublishDate": 1753250594551,
            "Source": "order&deals"
        },
        {
            "Title": "Minda Corp Issues Commercial Paper Worth 100 Crores",
            "Summary": "Minda Corp has issued commercial paper worth 100 crores. Commercial paper is a short-term debt instrument used by companies for immediate financing needs.",
            "Sentiment": "neutral",
            "PublishDate": 1751028727000,
            "Source": "default"
        },
        {
            "Title": "Minda Corporation Ltd: Multibagger Stock Surges Over 600% in Five Years",
            "Summary": "Minda Corporation Ltd's stock has rallied over 600% in the last five years, with a 4.53% year-to-date return. Analysts maintain a bullish outlook with a target price of Rs 590.17. The company reported a 12% increase in FY25 consolidated profit to Rs 255.3 crore, with revenue up 8.7% to Rs 5,056.2 crore. Minda Corp achieved its highest-ever EBITDA margin of 11.4% and secured lifetime orders worth over Rs 8,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750992449000,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corp: Forms Joint Venture with Japanese Firm Toyodenso",
            "Summary": "Minda Corp signed a JV agreement with Toyodenso Co. Ltd., Japan on June 11, 2025, to manufacture and sell advanced automotive switches in India. Minda Corp will hold 60% stake, Toyodenso 40%. The JV board will have 3 directors, 2 nominated by Minda Corp and 1 by Toyodenso.",
            "Sentiment": "positive",
            "PublishDate": 1749627498000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Forms Joint Venture with Toyodenso",
            "Summary": "Minda Corporation has entered into a joint venture agreement with Toyodenso Co. Ltd. The news briefly mentions the partnership between the two companies but provides no further details about the nature, scope, or terms of the joint venture.",
            "Sentiment": "positive",
            "PublishDate": 1749625073000,
            "Source": "default"
        },
        {
            "Title": "Minda Corp: Q4 Profit Drops 27% Despite Revenue Growth",
            "Summary": "Minda Corp reported a 26.5% decrease in Q4 FY2025 consolidated net profit to Rs 52 crore, while revenue increased by 8.7% to Rs 1,321 crore. EBITDA rose 10.3% to Rs 152.9 crore with margin expansion. The company announced reappointments of key executives, including Ashok Minda as chairperson and group CEO.",
            "Sentiment": "neutral",
            "PublishDate": 1748342411000,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Reports Q4 EBITDA Growth",
            "Summary": "Minda Corporation has reported its Q4 EBITDA at 1.53 billion rupees, compared to 1.39 billion rupees in the same quarter last year, showing a year-over-year increase. The company's Q4 EBITDA margin improved to 11.6% from 11.4% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748339066000,
            "Source": "result"
        },
        {
            "Title": "Minda Corporation Reports Q4 Financial Results",
            "Summary": "Minda Corporation has announced its financial results for the fourth quarter. The company reported revenue of 13.2 billion rupees, compared to 12.15 billion rupees in the same quarter last year, representing a year-over-year increase. However, the consolidated net profit for Q4 decreased to 520 million rupees from 707.5 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748339019000,
            "Source": "result"
        },
        {
            "Title": "Minda Corporation Appoints New CEO for Die Casting Division",
            "Summary": "Minda Corporation has announced the appointment of Hitendra Mishra as the new CEO of its Die Casting Division. This leadership change is expected to bring fresh perspectives and potentially impact the division's operations and strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1746188678000,
            "Source": "default"
        },
        {
            "Title": "Minda Corporation Issues Commercial Paper Worth 1 Billion Rupees",
            "Summary": "Minda Corporation has issued commercial paper valued at 1 billion rupees. Commercial paper is a short-term, unsecured debt instrument typically used by companies for immediate financing needs.",
            "Sentiment": "neutral",
            "PublishDate": 1742559909000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Issues Commercial Paper Worth 1.50 Billion Rupees",
            "Summary": "Minda Corporation, an automotive component manufacturer, has issued commercial paper valued at 1.50 billion Indian rupees. Commercial paper is a short-term debt instrument used by companies to raise funds for immediate financial needs.",
            "Sentiment": "neutral",
            "PublishDate": 1742342745000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Issues Commercial Paper Worth 1.50 Billion Rupees",
            "Summary": "Minda Corporation has issued commercial paper with a value of 1.50 billion Indian rupees. Commercial paper is a short-term, unsecured debt instrument typically used by corporations for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1742300342000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation: Q3 Profit Rises 25% to Rs 65 Crore",
            "Summary": "Minda Corporation reported a 25% year-on-year increase in Q3 net profit to Rs 65 crore. Operating revenue grew to Rs 1,253 crore. The board approved an interim dividend of Rs 0.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1738929907000,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Reports Q3 Revenue Growth",
            "Summary": "Minda Corporation, an automotive component manufacturer, has reported a revenue of 12.5 billion rupees for the third quarter, compared to 11.66 billion rupees in the same period last year. This represents a year-over-year increase in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1738832555000,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Reports Improved Q3 EBITDA and Margin",
            "Summary": "Minda Corporation has announced its Q3 financial results, showing an increase in EBITDA to 1.44 billion rupees from 1.3 billion rupees year-over-year. The company's EBITDA margin also improved to 11.46% from 11.10% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738832531000,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Reports 23.4% Increase in Q3 Consolidated Net Profit",
            "Summary": "Minda Corporation, an automotive components manufacturer, has reported a consolidated net profit of 648 million rupees for the third quarter, compared to 525 million rupees in the same period last year. This represents a year-over-year increase of 23.4% in net profit.",
            "Sentiment": "positive",
            "PublishDate": 1738832484000,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Invests 150 Million Rupees in Green Mobility Subsidiary",
            "Summary": "Minda Corporation has made a significant investment of 150 million rupees in its subsidiary, Spark Minda Green Mobility Systems. This investment demonstrates the company's commitment to expanding its presence in the green mobility sector.",
            "Sentiment": "positive",
            "PublishDate": 1738663838000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation to Consider Q3 Results on February 6",
            "Summary": "Minda Corporation has announced that it will consider its third quarter (Q3) financial results on February 6. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738242486000,
            "Source": "earnings"
        },
        {
            "Title": "Minda Corporation Acquires 49% Stake in Flash Electronics (India)",
            "Summary": "Minda Corporation has successfully completed the acquisition of a 49% stake in Flash Electronics (India). This strategic move represents a significant corporate action that could potentially strengthen Minda Corporation's market position and expand its business capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1737118962000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation: Aims to Create India's Largest EV Platform with Flash Electronics Acquisition",
            "Summary": "Minda Corporation is acquiring Flash Electronics to create India's largest electric vehicle (EV) platform. This strategic move positions Minda Corporation at the forefront of the EV market in India.",
            "Sentiment": "positive",
            "PublishDate": 1737018111000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation's FLASH Division Boasts Global Manufacturing Presence",
            "Summary": "Minda Corporation's FLASH division has established a strong global manufacturing footprint with 8 plants located across India, Germany, and Hungary. The division is supported by a robust workforce of over 2,500 employees, indicating significant operational scale and international presence.",
            "Sentiment": "positive",
            "PublishDate": 1736915660000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation to Acquire 49% Stake in Flash Electronics",
            "Summary": "Minda Corporation has announced plans to acquire a 49% stake in Flash Electronics for 1,372 crore rupees. This strategic investment represents a significant corporate action that could potentially strengthen Minda Corporation's position in the automotive electronics sector.",
            "Sentiment": "positive",
            "PublishDate": 1736915615000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Issues Commercial Paper Worth 2 Billion Rupees",
            "Summary": "Minda Corporation, an automotive component manufacturer, has issued commercial paper worth 2 billion rupees (approximately $24 million USD). Commercial paper is a short-term debt instrument used by companies to raise funds for immediate financial needs.",
            "Sentiment": "neutral",
            "PublishDate": 1735518151000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Issues Commercial Paper Worth 2 Billion Rupees",
            "Summary": "Minda Corporation has issued commercial paper valued at 2 billion rupees. Commercial paper is a short-term, unsecured debt instrument typically used by corporations for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1735302171000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Forms Joint Venture with HCMF for Automotive Sunroof Solutions",
            "Summary": "Minda Corporation has established a 50:50 joint venture with HCMF, creating Minda-HCMF Technologies Pvt Ltd. The new entity will focus on manufacturing automotive sunroof solutions and closure technology products.",
            "Sentiment": "positive",
            "PublishDate": 1734431248000,
            "Source": "corporate_action"
        },
        {
            "Title": "Minda Corporation Reports Improved Q2 EBITDA and Margin",
            "Summary": "Minda Corporation has announced its Q2 financial results. The company's EBITDA increased to 1.46 billion rupees from 1.3 billion rupees year-over-year. The EBITDA margin also improved to 11.36% from 10.98% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731403835000,
            "Source": "result"
        },
        {
            "Title": "Minda Corporation Reports Q2 Revenue Growth",
            "Summary": "Minda Corporation has announced its Q2 revenue results. The company reported revenue of 12.9 billion rupees, compared to 11.9 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731403784000,
            "Source": "result"
        },
        {
            "Title": "Minda Corporation Reports 26% Increase in Q2 Net Profit",
            "Summary": "Minda Corporation, an automotive component manufacturer, has reported a consolidated net profit of 743 million rupees for the second quarter, up from 588 million rupees in the same period last year. This represents a year-over-year increase of approximately 26%.",
            "Sentiment": "positive",
            "PublishDate": 1731403752000,
            "Source": "result"
        }
    ]
}