{
    "Symbol": "MINDTECK",
    "ISIN": "INE110B01017",
    "News": [
        {
            "Title": "Mindteck Q3FY26 Results: Net Profit Falls 34% YoY",
            "Summary": "Mindteck (India) Limited reported Q3FY26 standalone net profit of Rs 217 lakhs, down 34% from Rs 329 lakhs in Q3FY25. Revenue grew 7.1% YoY to Rs 3,843 lakhs despite exceptional charges.",
            "Sentiment": "negative",
            "PublishDate": 1770393472075,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mindteck Appoints Karim Dhanani as CEO",
            "Summary": "Mindteck (India) Limited appointed Mr. Karim Dhanani as Chief Executive Officer for a three-year term effective February 06, 2026, subject to employment visa and shareholder approvals.",
            "Sentiment": "positive",
            "PublishDate": 1770374050031,
            "Source": "stocks"
        },
        {
            "Title": "Mindteck Seeks Shareholder Approval for Director Appointment",
            "Summary": "Mindteck (India) Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Javed Gaya as Non-Executive Director through e-voting from February 02 to March 03, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769940414588,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mindteck VP Sales Jigar Vasani Resigns",
            "Summary": "Mindteck (India) Limited announces resignation of Vice President - Sales Jigar Vasani, effective February 28, 2026, to pursue interests outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1767349472021,
            "Source": "stocks"
        },
        {
            "Title": "Mindteck India Appoints Javed Gaya as Non-Executive Chairman",
            "Summary": "Mindteck (India) Limited has appointed Mr. Javed Gaya (DIN: 01481518) as Additional Director and Non-Executive Chairman effective December 05, 2025. Gaya is a lawyer with extensive experience in civil law, cross-border transactions, and has worked with MNCs across construction, oil and gas, and pharmaceutical sectors.",
            "Sentiment": "positive",
            "PublishDate": 1764940822499,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mindteck Chairman Managing Director Yusuf Lanewala Resigns Due to Personal Reasons",
            "Summary": "Yusuf Lanewala resigned from his position as Chairman Managing Director and Director of Mindteck (India) Limited, with his last working day being November 15, 2025. The resignation was attributed to personal reasons, affecting the company's top leadership structure as it seeks new management direction.",
            "Sentiment": "neutral",
            "PublishDate": 1763205091215,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mindteck Reports Mixed Q2 Results with Consolidated Revenue at Rs 101.63 Crore",
            "Summary": "Mindteck (India) Limited reported quarterly results for the period ended September 30, 2025. Consolidated revenue remained flat at Rs 101.63 crore compared to Rs 101.30 crore in the previous quarter, while declining from Rs 108.23 crore in the corresponding quarter last year. Consolidated net profit decreased to Rs 7.56 crore from Rs 8.75 crore in the previous quarter but remained stable compared to Rs 7.57 crore in the same quarter last year. For the six-month period, consolidated revenue declined to Rs 202.93 crore from Rs 216.38 crore in the previous year, while profit increased 16.9% to Rs 16.31 crore from Rs 13.95 crore. The company recorded exceptional items of Rs 1.91 crore during the quarter. Standalone operations showed improvement with quarterly revenue rising to Rs 39.15 crore and net profit increasing to Rs 5.38 crore. Chairman and Managing Director Yusuf Lanewala noted leadership transitions with the departure of the CEO and CSO, while highlighting the company's focus on enhancing profitability and operational discipline.",
            "Sentiment": "neutral",
            "PublishDate": 1762949244641,
            "Source": "earnings"
        },
        {
            "Title": "Mindteck India Shareholders Approve Appointment of Yusuf Lanewala as Chairman and Managing Director",
            "Summary": "Mindteck (India) Limited announced that shareholders approved the appointment and remuneration of Mr. Yusuf Lanewala (DIN: 01770426) as Chairman and Managing Director through a postal ballot and e-voting process concluded on September 19, 2025. The special resolution received overwhelming support with 99.9873% of votes in favor, representing 2,33,99,247 votes, while only 2,976 votes (0.0127%) were cast against. A total of 152 shareholders participated in the voting process, with 2,34,02,223 total votes polled. The company had 32,781 shareholders on the record date of August 15, 2025. Scrutinizer Gopalakrishnaraj H H confirmed the resolution secured the requisite majority and recommended it be considered passed. The voting was conducted entirely through electronic means, with the postal ballot notice sent via email to registered shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1758286967692,
            "Source": "corporate_action"
        },
        {
            "Title": "Mindteck (India) Limited Initiates Postal Ballot for Chairman and Managing Director Appointment",
            "Summary": "Mindteck (India) Limited has issued a postal ballot notice to shareholders for e-voting from August 21 to September 19, 2025, with results to be declared by September 23, 2025. The special resolution seeks approval for the appointment and remuneration of Mr. Yusuf Lanewala (DIN: 01770426) as Chairman and Managing Director for one year from August 8, 2025 to August 7, 2026. The proposed annual remuneration is Rs. 1.50 crore as fixed pay, along with savings and retirement benefits, insurance, and other benefits as per company policy. Mr. Lanewala, aged 71, has over 40 years of IT industry experience and was previously appointed as Non-Executive Chairman in April 2017. The company has appointed Mr. Gopalakrishnaraj H.H. as scrutinizer for the postal ballot process, with Central Depository Services (India) Limited providing e-voting facilities. The cut-off date for eligible shareholders is August 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755610489753,
            "Source": "corporate_action"
        },
        {
            "Title": "Mindteck Appoints Yusuf Lanewala as Managing Director and Chairman",
            "Summary": "Mindteck Ltd appointed Mr. Yusuf Lanewala as Managing Director and Chairman, subject to shareholder approval. The appointment was approved during a Board meeting on August 7, 2025, effective from August 8, 2025, for a one-year term. Lanewala, who holds DIN 01770426, was previously the Non-Executive Chairman of the company. He brings 35 years of global IT industry experience, having previously served as Managing Director and CEO for Mindteck (India) Limited and CEO for Malomatia QSC in Qatar. The company also revised its Nomination and Remuneration Committee composition, effective August 8, 2025, with Mr. Guhan Subramaniam as Chairperson and four other members including Mr. Meenaz Dhanani, Mr. Subhash Dhar, Ms. Keyuri Singh, and Mr. Satish Menon. The Board additionally reviewed unaudited financial results for the quarter ended June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754561649203,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mindteck (India) Limited Reports Quarterly Results for Quarter Ended June 30, 2025",
            "Summary": "Mindteck (India) Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 3,515 lakhs compared to Rs. 4,144 lakhs in the same quarter last year, representing a decline. Profit for the quarter was Rs. 466 lakhs versus Rs. 386 lakhs in the previous year quarter. Basic earnings per share stood at Rs. 1.46 compared to Rs. 1.22 in the corresponding quarter. On a consolidated basis, revenue from operations was Rs. 10,130 lakhs against Rs. 10,815 lakhs in the same quarter last year. Consolidated profit reached Rs. 875 lakhs compared to Rs. 638 lakhs in the previous year quarter, with basic earnings per share of Rs. 2.74 versus Rs. 2.03. The company operates across geographical segments including USA, India, and rest of the world. During the quarter, 40,000 ESOPs were exercised under the Employee Stock Option Scheme 2014. The Board appointed Yusuf Lanewala as Managing Director effective August 08, 2025, who will serve as Chairman and Managing Director.",
            "Sentiment": "neutral",
            "PublishDate": 1754560726532,
            "Source": "earnings"
        },
        {
            "Title": "Mindteck India Reports 36% Jump in Q1 Net Profit Despite Revenue Decline",
            "Summary": "Mindteck India reported quarterly net profit of 87 million rupees compared to 63.8 million rupees in the same period last year, marking a 36% increase. However, revenue declined to 1 billion rupees from 1.08 billion rupees year-over-year. The company's EBITDA improved to 96 million rupees from 90 million rupees, while EBITDA margin expanded to 9.5% from 8.32% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754559890134,
            "Source": "earnings"
        },
        {
            "Title": "Mindteck (India) Reports Improved Q4 EBITDA and Margin",
            "Summary": "Mindteck (India) has reported its Q4 financial results. The company's EBITDA increased to 86 million rupees, up from 75.3 million rupees in the same quarter of the previous year. The EBITDA margin also improved, rising to 8.24% from 7.69% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748005455000,
            "Source": "result"
        },
        {
            "Title": "Mindteck (India) Reports Q4 Financial Results",
            "Summary": "Mindteck (India) has announced its Q4 financial results. The company's consolidated net profit for the quarter was 68 million rupees, compared to 65 million rupees year-over-year and 79 million rupees quarter-over-quarter. Revenue for Q4 was 1.04 billion rupees, up from 979 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748005407000,
            "Source": "result"
        },
        {
            "Title": "Mindteck (India) Reports Q3 EBITDA Growth",
            "Summary": "Mindteck (India) has reported its Q3 financial results. The company's EBITDA increased to 91 million rupees from 85 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 8.75% from 8.92% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738746037000,
            "Source": "earnings"
        },
        {
            "Title": "Mindteck (India) Reports Increased Q3 Profit and Revenue",
            "Summary": "Mindteck (India) has announced its Q3 financial results, showing improvements in both profit and revenue. The company's consolidated net profit rose to 79 million rupees, up from 72 million rupees in the same quarter last year. Revenue also increased to 1 billion rupees, compared to 957 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738745984000,
            "Source": "earnings"
        },
        {
            "Title": "Mindteck (India) Reports Q2 Financial Results",
            "Summary": "Mindteck (India) has announced its Q2 financial results. The company's consolidated net profit increased to 76 million rupees from 74 million rupees year-over-year. Revenue also saw growth, rising to 1.1 billion rupees from 985 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731402997000,
            "Source": "result"
        },
        {
            "Title": "Mindteck: 1:4 Bonus Share Issue Approved, Record Date Set",
            "Summary": "<p><span class='positive'>Mindteck</span> has received <span class='positive'>approval</span> from <b>BSE</b> and <b>NSE</b> for a <span class='positive'>1:4 bonus share issue</span>. The <span class='neutral'>record date</span> is set for <b>September 20, 2024</b>. <span class='neutral'>Shareholders</span> will receive <span class='positive'>one new fully paid-up equity share</span> for every <span class='neutral'>four existing shares</span> held.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728322956000,
            "Source": "corporate_action"
        }
    ]
}