{
    "Symbol": "MIRCELECTR",
    "ISIN": "INE831A01028",
    "News": [
        {
            "Title": "MIRC Electronics Reports Q3 FY26 Loss of ₹1,311 Lakhs",
            "Summary": "MIRC Electronics Limited posted a net loss of ₹1,311 lakhs for Q3 FY26 ended December 31, 2025, compared to ₹527 lakhs loss in Q3 FY25. Revenue increased to ₹21,204 lakhs from ₹16,681 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770823167883,
            "Source": "co_actions_results"
        },
        {
            "Title": "MIRC Electronics Appoints Gunjan Srivastava as CEO",
            "Summary": "MIRC Electronics Limited announces the appointment of Mr. Gunjan Srivastava as Chief Executive Officer effective 1st February, 2026, bringing over 33 years of global leadership experience.",
            "Sentiment": "positive",
            "PublishDate": 1769791354789,
            "Source": "stocks"
        },
        {
            "Title": "MIRC Electronics' Statutory Auditor ASA Associates LLP Resigns Due to Information Delays",
            "Summary": "ASA Associates LLP resigned as statutory auditor of MIRC Electronics Limited with immediate effect on November 14, 2025, citing persistent delays in receiving information and explanations from management that made the engagement commercially unviable. The auditor firm was originally appointed for a 5-year term from July 2023 to 2028, and the company's Audit Committee and Board will recommend new statutory auditors for shareholder approval.",
            "Sentiment": "negative",
            "PublishDate": 1763188488500,
            "Source": "corporate_governance"
        },
        {
            "Title": "MIRC Electronics Submits Missing Limited Review Report for Q2 FY2025 Results",
            "Summary": "MIRC Electronics filed a missing Limited Review Report for its unaudited financial results for the quarter and half-year ended September 30, 2025, after the document was inadvertently omitted from the original submission made on November 12, 2025. The company completed a rights issue of Rs. 4,948 lakhs and issued Rs. 6,000 lakhs worth of non-convertible debentures during the quarter, with additional preferential share allotment of Rs. 14,952 lakhs approved in October 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763109795566,
            "Source": "earnings"
        },
        {
            "Title": "MIRC Electronics Reports Q2 Net Loss of 17.8M Rupees Despite Revenue Growth",
            "Summary": "MIRC Electronics reported a net loss of 17.8 million rupees in Q2, compared to a profit of 13.5 million rupees in the same period last year. The company's revenue increased to 1.63 billion rupees from 1.51 billion rupees year-over-year, showing growth in top-line performance despite the shift to losses at the bottom line.",
            "Sentiment": "negative",
            "PublishDate": 1762965536876,
            "Source": "earnings"
        },
        {
            "Title": "MIRC Electronics Passes Special Resolution for Preferential Equity Share Issue",
            "Summary": "MIRC Electronics Limited conducted an Extra-Ordinary General Meeting on September 6, 2025, via video conferencing to vote on a special resolution regarding the issue of equity shares on a preferential basis. The resolution received overwhelming shareholder support, with 99.99% of valid votes cast in favor. A total of 196 members participated in the voting process, which included both remote e-voting (September 3-5, 2025) and e-voting during the meeting. Scrutinizer Mahesh M. Darji confirmed that the resolution secured the requisite majority and recommended it be considered passed. The voting results showed 150,117,580 votes in favor against only 1,052 votes against the proposal.",
            "Sentiment": "positive",
            "PublishDate": 1757336821159,
            "Source": "corporate_action"
        },
        {
            "Title": "MIRC Electronics Raises ₹149.5 Crore Through Preferential Share Issue",
            "Summary": "MIRC Electronics announced a preferential share issue worth ₹149.5 crore, allotting 8.89 crore shares at ₹16.81 each to four investors. Authum Investment & Infrastructure will receive the largest allocation of 7.83 crore shares, followed by Vikram Kotak (HUF) with 74.5 lakh shares, Jamish Investment with 24 lakh shares, and APT Real Estates with 7.99 lakh shares. The four investors will collectively hold approximately 24% of the company post-allotment. The shares opened with gains of up to 5% following the announcement. This fundraising follows recent capital-raising activities including a rights issue of 4.94 crore shares at ₹10 each and board approval for NCDs worth up to ₹60 crore. The stock has gained 6% year-to-date despite closing 3.27% lower on Wednesday at ₹26.",
            "Sentiment": "positive",
            "PublishDate": 1755143908637,
            "Source": "corporate_action"
        },
        {
            "Title": "MIRC Electronics Reports Widened Net Loss and Revenue Decline in Q1",
            "Summary": "MIRC Electronics reported a net loss of 125 million rupees in Q1 compared to a loss of 4.4 million rupees in the same period last year. The company's revenue fell to 1.4 billion rupees from 2.27 billion rupees year-over-year, representing a significant decline in both profitability and top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1755093068944,
            "Source": "earnings"
        },
        {
            "Title": "MIRC Electronics: Promoter Group Entities Increase Stakes Through Rights Issue",
            "Summary": "Gulu Mirchandani, as Trustee of the GLM Family Trust, and Gulita Securities Limited have disclosed share acquisitions in MIRC Electronics Limited through a rights issue dated August 6, 2025. The GLM Family Trust acquired 11,503,797 shares (4.98% of pre-rights capital), increasing its holding from 53,684,390 shares to 65,188,187 shares. Gulita Securities Limited acquired 5,834,436 shares (2.53% of pre-rights capital), raising its holding from 27,227,372 shares to 33,061,808 shares. Both entities belong to the promoter group. The company's equity share capital expanded from 23,09,52,619 shares to 28,04,42,464 shares following the rights issue. Post-acquisition, both entities maintain their percentage holdings at 23.24% and 11.79% respectively of the enlarged share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1754646688453,
            "Source": "corporate_action"
        },
        {
            "Title": "MIRC Electronics Raises Rs 30 Crore Through Debenture Allotment to Neo Income Plus Fund",
            "Summary": "MIRC Electronics Limited allotted 3,000 non-convertible debentures with a face value of Rs 1 lakh each, totaling Rs 30 crore, to Neo Income Plus Fund through private placement. The debentures are fully paid, unlisted, senior, secured, and redeemable with a 36-month tenure, maturing on July 22, 2028. The securities carry a first pari passu charge on company assets to the extent provided to the State Bank of India-led consortium. Interest is calculated on an annual basis and payable monthly. The allotment was approved by the company's Finance Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1753196965741,
            "Source": "corporate_action"
        },
        {
            "Title": "MIRC Electronics Reports Q4 Financial Results",
            "Summary": "MIRC Electronics has reported its Q4 financial results. The company's revenue for Q4 was 2 billion rupees, compared to 2.97 billion rupees in the same quarter last year. The company reported a loss before tax (LBT) of 10.5 million rupees, an improvement from a loss of 511.1 million rupees in the previous year. The standalone net profit for Q4 was 11.8 million rupees, compared to a loss of 511 million rupees year-over-year and a loss of 52.7 million rupees quarter-over-quarter. The company also reported an exceptional item of 22.3 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1747751361000,
            "Source": "result"
        },
        {
            "Title": "MIRC Electronics Selected for PLI Scheme in White Goods",
            "Summary": "MIRC Electronics has been selected under the Production Linked Incentive (PLI) Scheme for White Goods, specifically for air conditioners and LED lights. The company has committed to an investment of Rs. 51.50 crore under this scheme. MIRC Electronics currently has a market capitalization of Rs. 524 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737356587000,
            "Source": "corporate_action"
        },
        {
            "Title": "MIRC Electronics Reports Improved Q2 EBITDA",
            "Summary": "MIRC Electronics has reported a significant turnaround in its Q2 EBITDA performance. The company achieved an EBITDA gain of 56.6 million rupees, compared to a loss of 31.5 million rupees in the same quarter last year. The Q2 EBITDA margin stood at 3.74%.",
            "Sentiment": "positive",
            "PublishDate": 1730293968000,
            "Source": "result"
        },
        {
            "Title": "MIRC Electronics Reports Q2 Revenue Decline",
            "Summary": "MIRC Electronics has reported a revenue of 1.5 billion rupees for the second quarter, down from 1.93 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730293953000,
            "Source": "result"
        },
        {
            "Title": "MIRC Electronics Reports Profit in Q2 FY2024",
            "Summary": "MIRC Electronics has reported a net profit of 13.5 million rupees in the second quarter, showing a significant improvement from a loss of 64.3 million rupees in the same quarter last year. The company also saw a quarter-on-quarter increase in profit from 4.4 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730293940000,
            "Source": "result"
        }
    ]
}