{
    "Symbol": "MIRZAINT",
    "ISIN": "INE771A01026",
    "News": [
        {
            "Title": "Mirza International Q3FY26 Loss Widens to ₹783.42 Lakh",
            "Summary": "Mirza International reported standalone net loss of ₹783.42 lakh for Q3FY26 vs ₹736.62 lakh loss in Q3FY25. Revenue declined 6.03% YoY to ₹10727.02 lakh amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1770458343159,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mirza International Gets ESOP Approval for 2.5 Cr Shares",
            "Summary": "Mirza International receives in-principle approval from NSE and BSE to issue up to 25,00,000 equity shares of ₹2.00 each under MIL Employees Stock Option Scheme 2025, subject to regulatory compliance conditions.",
            "Sentiment": "positive",
            "PublishDate": 1767772593645,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mirza International Director Nirmal Sahijwani Resigns",
            "Summary": "Mirza International announces resignation of Whole-time Director Nirmal Sahijwani effective February 1, 2026, citing personal reasons in regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1766406229778,
            "Source": "stocks"
        },
        {
            "Title": "Mirza International Promoter Acquires Additional 46,071 Equity Shares",
            "Summary": "Tasneef Ahmad Mirza, promoter of Mirza International Limited, acquired 46,071 equity shares (0.03%) through market purchase on December 5, 2025. The acquisition increased his shareholding from 22.84% to 22.87%, while total promoter group holding rose to 72.48% of the company's paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765193826676,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirza International Promoter Tasneef Ahmad Mirza Acquires Additional 1.42 Lakh Shares",
            "Summary": "Tasneef Ahmad Mirza, promoter of Mirza International Limited, acquired 1,42,000 equity shares (0.10% stake) through market purchases on December 3 and 4, 2025. Following this acquisition, his shareholding increased from 22.74% to 22.84%, while the total promoter group holding stands at 72.45% of the company's paid-up share capital.",
            "Sentiment": "positive",
            "PublishDate": 1765004783420,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirza International Promoter Acquires Additional 1.92 Lakh Shares Through Market Purchase",
            "Summary": "Tasneef Ahmad Mirza, promoter of Mirza International Limited, acquired 1,92,590 equity shares (0.14% stake) through market purchases on December 1-2, 2025. The acquisition increased his shareholding from 22.60% to 22.74%, while total promoter group holding rose to 72.35% of the company's paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764821552323,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirza International Promoter Tasneef Ahmad Mirza Acquires Additional 1.57 Lakh Shares",
            "Summary": "Tasneef Ahmad Mirza, promoter of Mirza International Limited, acquired 1,57,528 equity shares (0.11% stake) through market purchases on November 25-26, 2025. His shareholding increased from 22.48% to 22.60%, while total promoter group holding rose to 72.21% of the company's paid-up share capital.",
            "Sentiment": "positive",
            "PublishDate": 1764310394795,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirza International Promoter Acquires Additional 44,000 Shares",
            "Summary": "Tasneef Ahmad Mirza, promoter of Mirza International Limited, acquired 44,000 equity shares (0.03% stake) worth Rs. 2 each through market purchase on November 24, 2025. The acquisition increased his shareholding from 22.45% to 22.48%, with total promoter group holding at 72.09% of the company's paid-up share capital.",
            "Sentiment": "positive",
            "PublishDate": 1764069474750,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirza International Promoter Tasneef Ahmad Mirza Acquires Additional 2.5 Lakh Shares",
            "Summary": "Tasneef Ahmad Mirza, promoter of Mirza International Limited, acquired 2,50,622 equity shares (0.18% stake) through market purchases on November 17 and 18, 2025. His shareholding increased from 22.12% to 22.30%, while total promoter group holding rose to 71.91% of the company's paid-up share capital.",
            "Sentiment": "positive",
            "PublishDate": 1763553066528,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirza International Promoter Tasneef Ahmad Mirza Acquires Additional 5 Lakh Shares",
            "Summary": "Tasneef Ahmad Mirza, promoter of Mirza International Limited, acquired 5,00,000 equity shares (0.36% stake) worth Rs. 2 each through market purchase on November 14, 2025. Following this acquisition, his shareholding increased from 21.76% to 22.12%, while the total promoter group holding stands at 71.73% of the company's paid-up share capital.",
            "Sentiment": "positive",
            "PublishDate": 1763370450875,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirza International Appoints New Internal Auditor for FY2025-26",
            "Summary": "Mirza International Limited's Board of Directors approved the appointment of Mr. Prakhar Pratap Singh as Internal Auditor for financial year 2025-26, replacing Ms. Prachi Mishra who resigned from her employment with the company. Mr. Singh heads Finance Accounts at Unit-2, Unnao and has over two decades of experience in Finance Accounts. He currently provides independent assurance for organizations' risk management, governance and control processes. Ms. Prachi Mishra, who served as AGM-Accounts and Internal Auditor, tendered her resignation from the company. The Board meeting was held on November 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762593073261,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mirza International Reports Decline in Q2 Financial Performance",
            "Summary": "Mirza International reported quarterly results showing a decline across key financial metrics. Net profit dropped to 21.5 million rupees from 59 million rupees in the same period last year. Revenue decreased to 1.65 billion rupees compared to 2.02 billion rupees year-over-year. EBITDA fell to 126.7 million rupees from 168.8 million rupees, while EBITDA margin compressed to 7.69% from 8.37% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762592583037,
            "Source": "earnings"
        },
        {
            "Title": "Mirza International Reports Mixed Financial Results for Quarter Ended September 2025",
            "Summary": "Mirza International Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved the standalone and consolidated financial results at their meeting held on November 8, 2025. The company operates in two main segments: Footwear (Domestic/Export Sale) and Tannery (Domestic/Export Sale). The results include operations of wholly owned subsidiaries RTS Fashion Limited, Genesis Brands Private Limited, and Genesis Brands Inc. USA. The Board has also approved a Scheme of Amalgamation of RTS Fashion Limited with Mirza International Limited, subject to necessary approvals. The company has adopted IndAS 116 for lease assets, which impacted rent expenses, depreciation, and finance costs. Statutory auditors conducted a limited review and expressed an unmodified report on the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762592149611,
            "Source": "earnings"
        },
        {
            "Title": "Mirza International Promoter Tauseef Ahmad Mirza Acquires Additional 130,000 Shares",
            "Summary": "Tauseef Ahmad Mirza, a promoter of Mirza International Limited, acquired 130,000 equity shares representing 0.09% of the company through market purchase on September 26, 2025. The acquisition increased his shareholding from 3,02,96,604 shares (21.92%) to 3,04,26,604 shares (22.02%). The shares were purchased at Rs. 2 each. Following the transaction, the total promoter and promoter group shareholding stands at 9,86,29,282 equity shares, representing 71.37% of the company's total paid-up share capital of 13,82,01,900 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758967927224,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirza International Surges 30% in Two Sessions, Turns Positive for 2025",
            "Summary": "Mirza International's shares gained 13% on Wednesday following a 15% advance on Tuesday, bringing the total two-day rally to over 30%. The footwear stock has turned positive on a year-to-date basis after recent underperformance. Trading volumes surged significantly, with over 30 lakh shares changing hands on Wednesday compared to the 20-day average of around 70,000 shares. The rally occurred after Mirza's demerged entity Redtape confirmed Income Tax department searches, though Redtape stated it fully cooperated and business continues as usual. The stock crossed its 50 and 200-day moving averages and is approaching its 52-week high of ₹48, currently trading at ₹42.61. Footwear stocks may benefit from reduced GST rates, with footwear up to ₹2,500 now taxed at 5% instead of 12%.",
            "Sentiment": "positive",
            "PublishDate": 1758088474329,
            "Source": "stock"
        },
        {
            "Title": "Mirza International Undergoes Income Tax Department Search and Seizure Operation",
            "Summary": "Mirza International underwent a search and seizure operation conducted by the Income Tax Department from September 11 to 16, 2025. The company stated that its operations remained unaffected during this period and that it provided full cooperation to the officials throughout the process.",
            "Sentiment": "neutral",
            "PublishDate": 1757998007123,
            "Source": "stock"
        },
        {
            "Title": "Mirza International Reports Strong Q1 FY26 Results with Exceptional Items Boosting Profit",
            "Summary": "Mirza International Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 14,142.04 lakhs, up from Rs. 13,712.07 lakhs in the same quarter last year. Standalone profit for the period reached Rs. 1,766.76 lakhs compared to Rs. 109.67 lakhs in the previous year quarter, significantly boosted by exceptional items worth Rs. 1,861.44 lakhs. Basic earnings per share improved to Rs. 1.28 from Rs. 0.08 in the corresponding quarter. On a consolidated basis, revenue from operations was Rs. 14,210.55 lakhs versus Rs. 14,351.15 lakhs in the prior year quarter, with consolidated profit at Rs. 1,780.84 lakhs compared to Rs. 64.19 lakhs previously. The company operates through two main segments: Footwear (domestic and export) and Tannery operations. The Board also approved a scheme of amalgamation of RTS Fashion Limited with Mirza International Limited, subject to necessary approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754128390038,
            "Source": "earnings"
        },
        {
            "Title": "Mirza International Acquires Full Ownership of Genesis Brands Inc in USA",
            "Summary": "Mirza International has acquired complete ownership of Genesis Brands Inc, a company based in the United States. This acquisition represents a significant corporate action for Mirza International, expanding its presence in the American market.",
            "Sentiment": "positive",
            "PublishDate": 1751897903000,
            "Source": "default"
        },
        {
            "Title": "NCLT Approves Merger of T N S Hotels with Mirza International",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the amalgamation of T N S Hotels with Mirza International. This merger represents a significant corporate action for Mirza International, potentially impacting its business structure and operations.",
            "Sentiment": "positive",
            "PublishDate": 1740096605000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Merger of T N S Hotels with Mirza International",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the amalgamation of T N S Hotels with Mirza International. This corporate action represents a significant development for Mirza International, potentially impacting its business structure and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1740051136000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mirza International Reports Q3 Financial Results",
            "Summary": "Mirza International has reported a consolidated net loss of 56.9 million rupees in Q3, compared to a profit of 44 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter, where the company posted a profit of 59 million rupees. The company's Q3 revenue declined to 1.14 billion rupees from 1.4 billion rupees in the year-ago period.",
            "Sentiment": "negative",
            "PublishDate": 1738284219000,
            "Source": "earnings"
        },
        {
            "Title": "Mirza International Reports Significant Decline in Q3 EBITDA",
            "Summary": "Mirza International has reported a substantial decrease in its Q3 EBITDA, which fell to 36.6 million rupees from 169.8 million rupees year-over-year. The company's EBITDA margin also declined sharply, dropping to 3.20% from 11.98% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738249918000,
            "Source": "earnings"
        },
        {
            "Title": "Mirza International Reports Q3 Revenue Decline",
            "Summary": "Mirza International, an Indian company, has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 1.14 billion rupees, down from 1.4 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738249910000,
            "Source": "earnings"
        },
        {
            "Title": "Mirza International Reports Q3 Net Loss",
            "Summary": "Mirza International has reported a consolidated net loss of 56.9 million rupees for the third quarter. This marks a significant decline from the profit of 44 million rupees reported in the same quarter of the previous year. However, it's an improvement from the previous quarter, where the company had reported a profit of 59 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1738249902000,
            "Source": "earnings"
        },
        {
            "Title": "Mirza International Reports Improved Q2 Financial Performance",
            "Summary": "Mirza International has reported a significant increase in its Q2 consolidated EBITDA, rising to 169 million rupees from 120 million rupees year-over-year. The company's EBITDA margin also improved, reaching 8.38% compared to 5.77% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730193860000,
            "Source": "result"
        },
        {
            "Title": "Mirza International Reports Q2 Revenue Decline",
            "Summary": "Mirza International has reported a revenue of 2 billion rupees for the second quarter, compared to 2.1 billion rupees in the same period last year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730193681000,
            "Source": "result"
        },
        {
            "Title": "Mirza International Reports Increased Q2 Profit",
            "Summary": "Mirza International has reported a consolidated net profit of 59 million rupees for the second quarter, compared to 40 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730193654000,
            "Source": "result"
        }
    ]
}