{
    "Symbol": "MKPL",
    "ISIN": "INE964W01021",
    "News": [
        {
            "Title": "MK Proteins Board Meet Set for Feb 13 to Review Q3 Results",
            "Summary": "MK Proteins Limited has scheduled a board meeting on February 13, 2026, to consider and approve unaudited financial results for the quarter ended December 31, 2025, with trading window to reopen 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770291008814,
            "Source": "co_actions_results"
        },
        {
            "Title": "M.K. Proteins Reports Quarterly Financial Results for September 2025",
            "Summary": "M.K. Proteins Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025, with diluted earnings per share of 0.02 for the quarter. The vegetable refined oil manufacturer maintains a paid-up equity share capital of Rs. 3753.72 lacs and reported total assets of Rs. 8001.90 lacs as of September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763122578052,
            "Source": "earnings"
        },
        {
            "Title": "M K Proteins Appoints Deepak Khetarpal as Independent Director for Five-Year Term",
            "Summary": "M K Proteins Limited announced the appointment of Mr. Deepak Khetarpal as an Independent Director for a five-year term, effective August 23, 2025, as approved by shareholders at the 13th Annual General Meeting held on September 19, 2025. Khetarpal is a Qualified Cost and Works Accountant (CMA) with expertise in costing, finance, business management, accounting, and income tax. He is not related to any existing directors on the board and does not hold directorship in any other listed entities. The appointment was made in the category of Non-Executive Independent Director, and Khetarpal is not debarred from holding director positions by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1758368763164,
            "Source": "corporate_governance"
        },
        {
            "Title": "M K Proteins Appoints Deepak Khetarpal as Independent Director, Sets AGM Date",
            "Summary": "M K Proteins Limited appointed Mr. Deepak Khetarpal as an Additional Director (Non-Executive, Independent) on the Board, subject to shareholder approval at the upcoming Annual General Meeting. The appointment is effective from August 23, 2025, for a period of five years. Mr. Khetarpal is a Qualified Cost and Works Accountant (CMA) with expertise in Costing, Finance, Business Management, Accounting, and Income Tax. He is not related to any existing directors and holds no other directorships in listed entities. The company also approved the notice for its 13th Annual General Meeting scheduled for September 19, 2025, at 11:30 AM through video conferencing. The Register of Members and Share Transfer Books will remain closed from September 13 to September 19, 2025, for the AGM purpose.",
            "Sentiment": "neutral",
            "PublishDate": 1755951562039,
            "Source": "corporate_governance"
        },
        {
            "Title": "M.K. Proteins Limited Reports Q1 Results and Announces Auditor Changes",
            "Summary": "M.K. Proteins Limited approved unaudited financial results for the quarter ended June 30, 2025, showing revenue of ₹11,494.60 lacs compared to ₹5,733.30 lacs in the same quarter last year. Net profit increased to ₹351.32 lacs from ₹248.13 lacs year-on-year. The company announced the resignation of statutory auditors KRA & Co. effective August 12, 2025, with no concerns raised for their departure. The board appointed Subhash Sajal & Associates as replacement statutory auditors until the 13th Annual General Meeting, subject to shareholder approval within three months. Additionally, J.P. Jagdev & Co. was appointed as secretarial auditors for a five-year term from 2025-26 to 2029-30, pending member approval at the upcoming AGM. The company operates in vegetable refined oil manufacturing with no separate reportable segments.",
            "Sentiment": "positive",
            "PublishDate": 1755000155198,
            "Source": "earnings"
        },
        {
            "Title": "M K Proteins Limited's Statutory Auditors KRA & Co. Resign Effective August 12, 2025",
            "Summary": "M/s KRA & Co., Chartered Accountants, have resigned as statutory auditors of M K Proteins Limited. The resignation becomes effective from the close of business hours of the board meeting scheduled for August 12, 2025, after submitting the Limited Review Report for the quarter ended June 30, 2025. The company's Audit Committee and Board of Directors will address the resignation at their upcoming meeting on August 12, 2025, and will recommend the appointment of new statutory auditors for shareholders' approval. M K Proteins Limited is listed on BSE (scrip code: 543919) and NSE (symbol: MKPL).",
            "Sentiment": "neutral",
            "PublishDate": 1754392300770,
            "Source": "corporate_governance"
        }
    ]
}