{
    "Symbol": "MMFL",
    "ISIN": "INE227C01017",
    "News": [
        {
            "Title": "MM Forgings Board Meet Set for Feb 13 for Q3FY26 Results",
            "Summary": "MM Forgings Limited has scheduled a board meeting on February 13, 2026, to approve Q3FY26 unaudited financial results. Trading window closed from January 1 to February 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770196226631,
            "Source": "co_actions_results"
        },
        {
            "Title": "MM Forgings Reports Q2 FY26 Results with Revenue Drop to INR 758 Crores Due to US Market Slowdown",
            "Summary": "MM Forgings achieved INR 758 crores turnover in Q2 FY26 versus INR 793 crores in the previous year, with EBITDA declining to INR 142 crores from INR 162 crores due to inventory buildup at US customers and Class VIII truck market slowdown. The company expects recovery from November onwards as US customers restart purchases, targeting INR 750-800 crores revenue in H2 FY26, while commissioning a 16,500 ton press by March that could add INR 300 crores annual revenue from FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1763711704354,
            "Source": "earnings"
        },
        {
            "Title": "MM Forgings Limited Publishes Quarterly Financial Results for September 2025",
            "Summary": "MM Forgings Limited submitted its unaudited financial results for the quarter ended September 30, 2025, to NSE and BSE exchanges. The company published these results in Makkal Kural and Business Line newspapers on November 15, 2025, as per SEBI LODR regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763369756257,
            "Source": "earnings"
        },
        {
            "Title": "MM Forgings Reports Modest Growth Moderation in H1FY26 Amid Global Economic Headwinds",
            "Summary": "MM Forgings Limited reported standalone revenue of ₹726.50 crores and operating EBITDA of ₹125.69 crores (17.3% margin) for H1FY26, experiencing market-driven growth moderation due to global economic volatility and softened automotive export performance. The company's consolidated turnover reached ₹758.29 crores with domestic sales contributing 38.6% of overall sales, while management remains focused on operational efficiency and cost optimization to strengthen long-term growth trajectory.",
            "Sentiment": "neutral",
            "PublishDate": 1763175532364,
            "Source": "earnings"
        },
        {
            "Title": "M M Forgings Reports 48% Decline in Q2 Net Profit to 166M Rupees",
            "Summary": "M M Forgings reported Q2 consolidated net profit of 166 million rupees, down 48% from 319 million rupees in the same quarter last year, while revenue declined 3.3% to 3.78 billion rupees. The company's EBITDA dropped to 665 million rupees from 769 million rupees year-over-year, with EBITDA margin contracting to 17.61% from 19.69%.",
            "Sentiment": "negative",
            "PublishDate": 1763132924813,
            "Source": "earnings"
        },
        {
            "Title": "MM Forgings Reports 6% Revenue Decline in Q1 FY2026 Amid Market Headwinds",
            "Summary": "MM Forgings Limited reported total income of INR 358 crores for Q1 FY2026, down 6% from INR 375 crores in the previous year. EBITDA fell to INR 72 crores from INR 78 crores, while PAT dropped to INR 22 crores from INR 32 crores. The company maintained an EBITDA margin of 18% excluding other income. Revenue breakdown shows 60% domestic and 40% exports, with commercial vehicles comprising 80% of business. Production increased to 18,000 tons from 17,300 tons quarter-on-quarter, but sales declined to 17,780 tons from around 20,000 tons. The company operates at 60% capacity utilization for both forging and machining. Management reduced full-year capex target to INR 150-200 crores from INR 300 crores, focusing on consolidation and cost control. Key challenges include US market headwinds with declining freight volumes, potential 25% US tariffs on imports, and rising raw material and power costs. Management expects the next 6-9 months to remain at previous year levels with potential improvement in the following 6-12 months.",
            "Sentiment": "negative",
            "PublishDate": 1755150773185,
            "Source": "earnings"
        },
        {
            "Title": "MM Forgings Targets 40% Export Revenue Through Diversification Strategy",
            "Summary": "MM Forgings has outlined its long-term growth strategy focusing on achieving 40% of revenue from exports. The company plans to diversify across commercial vehicle (CV), passenger vehicle (PV), and off-highway segments. The strategy includes emphasis on cost savings and capacity utilization to manage global tariff changes and demand fluctuations.",
            "Sentiment": "positive",
            "PublishDate": 1754493379422,
            "Source": "stock"
        },
        {
            "Title": "M M Forgings Reports Q1FY26 Results with Revenue of ₹341.37 Crores",
            "Summary": "M M Forgings Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹341.37 crores compared to ₹364.37 crores in the same quarter last year. Profit after tax declined to ₹22.34 crores from ₹32.43 crores year-over-year. On a consolidated basis, revenue was ₹354.21 crores versus ₹378.04 crores in Q1FY25, with consolidated PAT at ₹19.19 crores compared to ₹30.11 crores previously. Export sales contributed ₹137 crores, representing 40.2% of overall sales. The company's Chairman noted challenging global economic conditions and subdued demand in the Indian automotive industry during the quarter, while maintaining cautious optimism about long-term growth prospects.",
            "Sentiment": "negative",
            "PublishDate": 1754479783459,
            "Source": "earnings"
        },
        {
            "Title": "MM Forgings: Potential $5 Million Sales Impact from US Emissions Policy Shift",
            "Summary": "MM Forgings estimates a potential $5 million sales hit if US EPA rolls back auto emissions requirements. The company views this as a temporary setback, expecting long-term shift towards greener standards. Chairman Vidyashankar Krishnan sees possible pre-buy boost in 2026 if norms proceed, or evened-out demand if delayed. MM Forgings plans to gain market share in stable European heavy truck industry.",
            "Sentiment": "neutral",
            "PublishDate": 1742280711000,
            "Source": "normal_news"
        },
        {
            "Title": "M.M.FORGINGS Reports Q3 EBITDA and Margin Results",
            "Summary": "M.M.FORGINGS has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 was 733 million rupees, compared to 755 million rupees in the same quarter last year. Despite a slight decrease in EBITDA, the company's EBITDA margin improved to 20.22% from 19.52% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738591436000,
            "Source": "earnings"
        },
        {
            "Title": "M.M.Forgings Reports Decline in Q3 Profit and Revenue",
            "Summary": "M.M.Forgings has reported a decrease in both net profit and revenue for the third quarter. The company's net profit fell to 317 million rupees from 372 million rupees in the same period last year. Revenue also declined to 3.63 billion rupees from 3.87 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738591430000,
            "Source": "earnings"
        },
        {
            "Title": "MM Forgings Reports Q2 EBITDA and Margin Growth",
            "Summary": "MM Forgings has announced its Q2 financial results. The company's EBITDA increased to 769 million rupees, up from 745 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 19.69% from 19.19% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729952140000,
            "Source": "result"
        },
        {
            "Title": "MM Forgings Reports Q2 Financial Results",
            "Summary": "MM Forgings has announced its Q2 consolidated financial results. The company reported a net profit of 319 million rupees, down from 349 million rupees in the same quarter last year. Revenue for Q2 increased slightly to 3.9 billion rupees from 3.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729951953000,
            "Source": "result"
        }
    ]
}