{
    "Symbol": "MMTC",
    "ISIN": "INE123F01029",
    "News": [
        {
            "Title": "MMTC Appoints Jatinderjit Singh Mann as Marketing Director",
            "Summary": "MMTC Limited announces appointment of Shri Jatinderjit Singh Mann as Director (Marketing) effective 12.02.2026, bringing engineering expertise and NTPC experience to the government enterprise's leadership team.",
            "Sentiment": "positive",
            "PublishDate": 1770895133394,
            "Source": "stocks"
        },
        {
            "Title": "MMTC Appoints Asit Gopal as Government Nominee Director",
            "Summary": "MMTC Limited announces the appointment of Shri Asit Gopal as Government Nominee Director on January 27, 2026, replacing Ms Arti Bhatnagar as per government order from Department of Commerce.",
            "Sentiment": "neutral",
            "PublishDate": 1769511104438,
            "Source": "stocks"
        },
        {
            "Title": "MMTC-PAMP to launch silver recycling pilot in 3 months",
            "Summary": "MMTC-PAMP plans silver recycling pilot within three months amid supply constraints. Company to upgrade equipment at existing stores as silver prices surge 130-140% globally.",
            "Sentiment": "positive",
            "PublishDate": 1769326636396,
            "Source": "stocks"
        },
        {
            "Title": "MMTC Shares Surge 9% on Bullion Price Rally",
            "Summary": "MMTC Ltd shares jumped 9.28% to ₹69.45 as gold and silver prices hit new highs. Silver reached a lifetime high of ₹2,86,790 per kg while gold climbed to ₹1,43,650 per 10 grams, boosting bullion-linked stocks.",
            "Sentiment": "positive",
            "PublishDate": 1768370432948,
            "Source": "stocks"
        },
        {
            "Title": "MMTC Stock Forms Bearish Triple Top Pattern",
            "Summary": "MMTC Limited shares broke below ₹65.60 support after forming a triple top pattern, with technical indicators confirming bearish momentum despite 17.20% monthly gains.",
            "Sentiment": "negative",
            "PublishDate": 1768182853855,
            "Source": "stocks"
        },
        {
            "Title": "MMTC shares fall 5% as gold, silver prices retreat",
            "Summary": "MMTC Ltd shares declined 4.88% to ₹67.21 as gold and silver prices cooled off from record highs, impacting bullion-linked companies amid profit-taking and year-end volatility.",
            "Sentiment": "negative",
            "PublishDate": 1767073316308,
            "Source": "stocks"
        },
        {
            "Title": "MMTC shares rally 10% on record gold, silver prices",
            "Summary": "MMTC Limited shares jumped 10.50% to ₹71.25, extending seven-day winning streak with 31% gains. Rally driven by record-high gold and silver prices boosting bullion trading sentiment.",
            "Sentiment": "positive",
            "PublishDate": 1766987447017,
            "Source": "stocks"
        },
        {
            "Title": "MMTC clarifies no significant events behind volume spurt",
            "Summary": "MMTC Limited responds to stock exchange inquiry about trading volume surge, confirming no undisclosed material events affecting stock prices under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765439766072,
            "Source": "stocks"
        },
        {
            "Title": "MMTC Reports Quarterly Loss Amid Anglo Coal Case Settlement and NINL Escrow Receipt",
            "Summary": "MMTC Limited posted a net loss of Rs 135.59 crore for the quarter ended September 30, 2025, while making an additional provision of Rs 33.76 crore for the Anglo Coal case where Delhi High Court ordered release of Rs 1000 crore to Anglo. The company received Rs 411.76 crore principal and Rs 25.75 crore interest from NINL divestment escrow account after the three-year warranty period expired on July 4, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763057831355,
            "Source": "earnings"
        },
        {
            "Title": "MMTC Limited Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "MMTC Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, along with the auditors' report on these results. The board meeting was held on August 7, 2025, commencing at 12:00 P.M. and concluding at 3:00 P.M. The financial results and auditors' reports have been made available on the company's website. The company has informed both the National Stock Exchange of India and Bombay Stock Exchange about this development.",
            "Sentiment": "neutral",
            "PublishDate": 1754913141687,
            "Source": "earnings"
        },
        {
            "Title": "MMTC Limited Approves Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "MMTC Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, along with the auditors' report on these results. The board meeting was held on August 7, 2025, commencing at 12:00 P.M. and concluding at 3:00 P.M. The company has disseminated these results on its website and informed the National Stock Exchange of India and Bombay Stock Exchange about the outcome.",
            "Sentiment": "neutral",
            "PublishDate": 1754562847566,
            "Source": "earnings"
        },
        {
            "Title": "MMTC Reports 35% Jump in Quarterly Net Profit to 443 Million Rupees",
            "Summary": "MMTC posted a consolidated net profit of 443 million rupees in its latest quarterly results, representing a year-on-year increase from 327 million rupees in the same period last year. The metals trading company's profit growth reflects improved financial performance compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754560800389,
            "Source": "earnings"
        },
        {
            "Title": "Platinum Prices Surge to Highest Level Since 2014",
            "Summary": "Platinum prices have reached their highest level since 2014 due to growing supply concerns. MMTC, a company mentioned in the news, is likely related to this development in the platinum market.",
            "Sentiment": "positive",
            "PublishDate": 1750925882000,
            "Source": "default"
        },
        {
            "Title": "MMTC Ltd: Q4 Profit Plummets 96.8%, Share Price Drops 10%",
            "Summary": "MMTC Ltd's Q4 FY2025 net profit fell 96.8% to Rs 2.23 crore, with revenue down 64% to Rs 23 lakh. Full-year profit declined 54.9% to Rs 86.63 crore. Share price fell nearly 10% to Rs 77.30, breaking a three-day rally.",
            "Sentiment": "negative",
            "PublishDate": 1748845087000,
            "Source": "earnings"
        },
        {
            "Title": "MMTC Ltd: Stock Surges 54% in May Despite Weak Q4 Results",
            "Summary": "MMTC Ltd shares continued their rally, rising 9% in morning trade despite reporting a 96.8% decline in Q4 net profit and 64% drop in revenue. The stock has gained 54.33% in May, defying weak financial results and market expectations.",
            "Sentiment": "positive",
            "PublishDate": 1748586583000,
            "Source": "earnings"
        }
    ]
}