{
    "Symbol": "MOBIKWIK",
    "ISIN": "INE0HLU01028",
    "News": [
        {
            "Title": "MobiKwik Files Q3FY26 IPO Proceeds Monitoring Report",
            "Summary": "One MobiKwik Systems submitted its Q3FY26 monitoring agency report showing Rs. 224.29 crore of IPO proceeds remain unutilized out of Rs. 572 crore raised, with no deviations from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1770200988346,
            "Source": "co_actions_results"
        },
        {
            "Title": "One Mobikwik Eyes H2 FY26 Profitability Target",
            "Summary": "One Mobikwik Systems expresses confidence in achieving profitability during the second half of fiscal year 2026, marking a significant milestone for the fintech company.",
            "Sentiment": "positive",
            "PublishDate": 1770101794799,
            "Source": "stocks"
        },
        {
            "Title": "One MobiKwik Q3 Profit Jumps to ₹40M from Loss",
            "Summary": "One MobiKwik Systems reported consolidated net profit of ₹40 million in Q3 compared to loss of ₹553 million in same quarter previous year, marking significant turnaround.",
            "Sentiment": "positive",
            "PublishDate": 1770101701989,
            "Source": "co_actions_results"
        },
        {
            "Title": "MobiKwik Q3FY26 Results Call Set for February 3",
            "Summary": "One MobiKwik Systems has scheduled its Q3FY26 earnings call for February 3, 2026, at 4:00 PM IST to discuss unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769172853914,
            "Source": "co_actions_results"
        },
        {
            "Title": "MobiKwik Appoints New Independent Director via Postal Ballot",
            "Summary": "One MobiKwik Systems successfully appointed Mr. Radhakrishna Nair as Non-Executive Independent Director through postal ballot with 99.98% approval from shareholders on January 21, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769006055492,
            "Source": "co_actions_results"
        },
        {
            "Title": "MobiKwik Grants 1.62 Lakh Stock Options to Employees",
            "Summary": "One MobiKwik Systems approves grant of 1,62,000 stock options under ESOP 2014 plan to eligible employees at face value of ₹2 per share through Nomination Remuneration Committee resolution.",
            "Sentiment": "positive",
            "PublishDate": 1766497248716,
            "Source": "co_actions_results"
        },
        {
            "Title": "MobiKwik Seeks Shareholder Approval for New Director",
            "Summary": "One MobiKwik Systems seeks member approval via postal ballot for appointing Radhakrishnan Nair as Independent Director with ₹17.00 lakh annual remuneration. E-voting runs Dec 23-Jan 21.",
            "Sentiment": "neutral",
            "PublishDate": 1766398743973,
            "Source": "stocks"
        },
        {
            "Title": "MobiKwik Appoints Navdeep Singh Suri as Board Chair",
            "Summary": "One MobiKwik Systems has appointed Navdeep Singh Suri as Board Chairman, reflecting the company's commitment to stronger governance and long-term institutional maturity in the fintech sector.",
            "Sentiment": "positive",
            "PublishDate": 1766017106963,
            "Source": "stocks"
        },
        {
            "Title": "MobiKwik Appoints Navdeep Singh Suri as Board Chairman",
            "Summary": "One MobiKwik Systems appoints former diplomat Navdeep Singh Suri as Board Chairman, replacing co-founder Upasana Taku to strengthen governance and ensure independent oversight.",
            "Sentiment": "positive",
            "PublishDate": 1765954562111,
            "Source": "stocks"
        },
        {
            "Title": "MobiKwik Q2 FY26 Results: Revenue Stable at ₹2,793 Cr",
            "Summary": "One MobiKwik Systems reports Q2 FY26 revenue of ₹2,793.3 crores with 53% YoY payment GMV growth, improved EBITDA of ₹63.8 crores loss, and strong UPI transaction surge of 38% QoQ reaching 138.26 million.",
            "Sentiment": "positive",
            "PublishDate": 1765801350016,
            "Source": "stocks"
        },
        {
            "Title": "MobiKwik Joins Top 3 Fastest-Growing UPI Apps in Q2FY26",
            "Summary": "One MobiKwik Systems achieves remarkable 3X yearly growth in UPI transactions for October 2025, with 38% QoQ transaction growth and 28% GMV increase, securing position among India's top three fastest-growing UPI applications.",
            "Sentiment": "positive",
            "PublishDate": 1765430415383,
            "Source": "stocks"
        },
        {
            "Title": "One Mobikwik Systems CFO Projects Positive EBITDA and Profit Turnaround",
            "Summary": "One Mobikwik Systems' CFO anticipates the company will achieve positive EBITDA in Q3. The CFO also projects the company could reach positive profit after tax in either Q3 or Q4.",
            "Sentiment": "positive",
            "PublishDate": 1764825603094,
            "Source": "stock"
        },
        {
            "Title": "One Mobikwik Systems Plans 10 Million Rupee Investment in Mobikwik Financial Services",
            "Summary": "One Mobikwik Systems has announced plans to invest 10 million rupees in Mobikwik Financial Services. The investment represents a capital allocation decision by One Mobikwik Systems to strengthen its financial services subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1763127866347,
            "Source": "stock"
        },
        {
            "Title": "MobiKwik Launches Instant Forex Purchase Service in Partnership with NBBL",
            "Summary": "MobiKwik announced the launch of foreign exchange payment services on its mobile app in partnership with NPCI Bharat BillPay Limited (NBBL). The company becomes one of the first fintech firms to bring digital foreign exchange services to mobile platforms. The service allows users to book, top up forex cards instantly using net banking or UPI with same-day fulfillment, and remit money abroad. Currently supporting USD transactions for individual users, the platform offers competitive rates and is fully regulated by RBI and NBBL. The first live transaction was conducted at the Global Fintech Festival in Mumbai on October 7, 2025, in the presence of RBI Deputy Governor T. Rabi Sankar. MobiKwik serves 183.5 million registered users and 4.71 million merchants, holding a 19% market share of PPI wallet gross transaction value as of September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762858857925,
            "Source": "stock"
        },
        {
            "Title": "Mobikwik CFO Highlights Regulatory Challenges and Innovation in India's Fintech Sector",
            "Summary": "Mobikwik co-founder and CFO Upasana Taku spoke at the SBI Banking & Economics Conclave about the challenges facing India's fintech industry. She noted that fintechs in India face regulation from early business stages, unlike other markets where oversight follows product maturity. Mobikwik has evolved from a wallet business to financial product distribution, requiring multiple licenses from SEBI, IRDAI, and RBI. The company has become one of the top three fastest-growing UPI apps in recent months despite competition from global players. Taku discussed India's central bank digital rupee as fundamentally different from private cryptocurrencies, enabling peer-to-peer and offline transactions. Mobikwik is experimenting with voice-based payment technology called 'Say to Pay' for multiple Indian languages and has developed AI-based collection bots. She emphasized that cybersecurity and risk management now require more attention in the fintech sector, citing fraudulent activities as significant threats to consumer money.",
            "Sentiment": "neutral",
            "PublishDate": 1762448990437,
            "Source": "stock"
        },
        {
            "Title": "MobiKwik Reports 80% EBITDA Improvement in Q2 FY2026 Despite Remaining Loss-Making",
            "Summary": "MobiKwik delivered quarterly results showing total income steady at ₹279 crores with significant operational improvements. The company achieved an 80% improvement in EBITDA to -₹6.4 crores, representing a ₹25 crore upswing from -₹31 crores in the previous quarter. Direct costs decreased 10% and contribution margin reached 34%, while fixed costs fell 5.7% quarter-over-quarter. The company faced a fraud incident on September 12 due to a technical bug, recovering 70% of losses with provisions made for the balance. MobiKwik has become one of the top three fastest-growing UPI apps in India. In lending business, disbursals grew with direct costs significantly reducing from 7.3% to 4.4% as percentage of disbursal. Payment business delivered gross profit of ₹61 crores with margins improving from 27.9% to 29.4%. Pure UPI accounts for 40% of GMV while wallet and bill payments comprise the remaining 60%. The company operates 80% disbursals under DLG model and 20% distribution, maintaining about 3% profit from lending business.",
            "Sentiment": "positive",
            "PublishDate": 1762434093414,
            "Source": "earnings"
        },
        {
            "Title": "MobiKwik Reports No Deviations in IPO Fund Utilization Despite Technical Security Issues",
            "Summary": "One MobiKwik Systems Limited's monitoring agency CARE Ratings reported no deviations from IPO fund utilization objectives for the quarter ended September 30, 2025. The company raised Rs. 572 crore through its IPO held from December 11-13, 2024. Out of the total proceeds, Rs. 261.96 crore remains unutilized and is parked in fixed deposits. The company has utilized funds across designated areas including Rs. 64.54 crore for financial services growth, Rs. 87.75 crore for payment services, Rs. 49.73 crore for R&D in AI and technology, Rs. 5.12 crore for payment devices, and Rs. 68.23 crore for general corporate purposes. However, the company faced a technical security breach on September 11-12, 2025, leading to unauthorized payouts and fraudulent transactions estimated at Rs. 40 crore. The company has secured around 71% of the impacted amount with the remaining 29% provided for in financial results. Additionally, the company's Vice President Data-Shared Services and Chief Operating Officer-Operations resigned in October 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762271302371,
            "Source": "stock"
        },
        {
            "Title": "MobiKwik Reports Strong Q2 Performance with 80% EBITDA Growth and Record Payment Volumes",
            "Summary": "One MobiKwik Systems Limited reported significant improvement in quarterly results with EBITDA growing 80% quarter-on-quarter to negative ₹64 crore from negative ₹312 crore in Q1. The company achieved record payment GMV of ₹432 billion, representing 53% year-on-year growth and 13% quarter-on-quarter increase. UPI transactions showed explosive 3.5x year-on-year growth with the company ranking among top 3 fastest growing UPI apps in India. Total revenue remained stable at ₹2,793 crore with contribution margin expanding to 34.4% from 27.5% in the previous quarter. The payments business maintained gross margins of 29.4% while financial services gross margins improved significantly to 41.8% from 13.3%. The company onboarded 3.3 million new users during the quarter, reaching 183.5 million registered users. MobiKwik launched new products including FX Retail platform in partnership with NBBL and RBI, and became among the first fintechs to fully roll out Digital Rupee transactions. The company also received SEBI approval for stock broking services through its Zaakpay platform.",
            "Sentiment": "positive",
            "PublishDate": 1762240242451,
            "Source": "earnings"
        },
        {
            "Title": "MobiKwik Reports INR 286 Million Loss in Q2 FY2025, Files FIR Over INR 404 Million Fraud",
            "Summary": "One MobiKwik Systems Limited reported a consolidated net loss of INR 286 million for the quarter ended September 30, 2025, compared to a loss of INR 36 million in the same period last year. Revenue from operations declined to INR 2,702 million from INR 2,906 million year-over-year. The company filed a First Information Report on September 13, 2025, alleging that merchants in Haryana's Nuh and Mewat regions exploited a technical bug to fraudulently claim INR 403.59 million in unauthorized settlements. MobiKwik has recovered INR 219.27 million and secured an additional INR 66.02 million through court orders, while providing for the remaining INR 118.30 million under exceptional items. The company's EBITDA was negative INR 64 million compared to positive INR 68 million in the previous year. For the half-year period, consolidated revenue decreased to INR 5,416 million from INR 6,329 million, with net loss widening to INR 705 million from INR 102 million.",
            "Sentiment": "negative",
            "PublishDate": 1762236445247,
            "Source": "earnings"
        },
        {
            "Title": "MobiKwik Schedules Board Meeting for Q2 FY2026 Results on November 4, 2025",
            "Summary": "One MobiKwik Systems Limited has announced a Board of Directors meeting scheduled for November 4, 2025, to consider and approve unaudited financial results for the quarter and half year ended September 30, 2025. The company's trading window will remain closed until November 6, 2025, which is 48 hours after the declaration of financial results to stock exchanges. An earnings call for analysts and investors is scheduled for the same day at 16:00 hours IST to discuss the company's financial results. The call will be conducted virtually with registration details provided on the company's investor relations website.",
            "Sentiment": "neutral",
            "PublishDate": 1761844395487,
            "Source": "corporate_action"
        },
        {
            "Title": "MobiKwik COO Mohit Narain Resigns Due to Health Reasons",
            "Summary": "Mohit Narain, Chief Operating Officer - Operations (Payments) at One MobiKwik Systems Limited, has resigned from his position effective October 24, 2025. Narain cited health reasons for his departure, stating he was advised to take full rest and focus on recovery. In his resignation letter to Managing Director and CEO Bipin Preet Singh, Narain expressed gratitude for the opportunities and support received during his tenure at the fintech company.",
            "Sentiment": "neutral",
            "PublishDate": 1761324512265,
            "Source": "corporate_governance"
        },
        {
            "Title": "MobiKwik Considers Applying for NBFC License After Rs 10 Crore Investment",
            "Summary": "MobiKwik is considering applying for an NBFC license with RBI after investing Rs 9.99 crore in its subsidiary Mobikwik Financial Services Pvt in October. Co-founder Upasana Taku stated the company incorporated the subsidiary with minimum required capital and may file for the license. The NBFC aims to operate in leasing and hire purchase deals for assets including machinery, equipment, vehicles, and real estate. MobiKwik clarified it does not plan to become a direct lender but wants to better understand users and facilitate matchmaking with lending partners. The company reported a consolidated loss of Rs 42 crore for the June quarter, with revenue declining 21% year-on-year to Rs 271 crore. Financial services revenue dropped significantly from Rs 171 crore to Rs 58 crore due to industry moderation in unsecured lending, strategic shift away from buy-now-pay-later products, and new accounting treatments. The payments business revenue grew 24% to Rs 213 crore. MobiKwik expects EBITDA breakeven in the second half of fiscal 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1760338449714,
            "Source": "stock"
        },
        {
            "Title": "MobiKwik Targets Profitability Return in Second Half of FY26",
            "Summary": "MobiKwik Co-founder and CFO Upasana Taku announced the company expects to return to profitability in the second half of FY26. The digital financial services platform was profitable for six consecutive quarters before going public but faced setbacks due to headwinds in the unsecured lending space. The company showed improvement from Q4FY25 to Q1FY26, reducing negative EBITDA from ₹45 crore to ₹31 crore. MobiKwik's payments business recorded three times growth last year, while credit distribution is recovering with 30-32% growth in disbursals in recent quarters. The company has secured payment aggregator and broking licenses and launched new products including the RuPay credit card on UPI called First Card and AI-powered financial analysis tool Lens.AI. MobiKwik is focusing on expanding its financial products portfolio targeting Tier-2 and Tier-3 markets.",
            "Sentiment": "positive",
            "PublishDate": 1759935526457,
            "Source": "stock"
        },
        {
            "Title": "MobiKwik Resolves Technical Glitch in Haryana, Freezes 2,000 Merchant Accounts",
            "Summary": "MobiKwik experienced a technical glitch in Haryana and took action by freezing 2,000 merchant accounts. The company has resolved the technical issue and confirmed that there was no user loss or cybersecurity breach related to the incident.",
            "Sentiment": "neutral",
            "PublishDate": 1758204546754,
            "Source": "stock"
        },
        {
            "Title": "MobiKwik Loses ₹40 Crore in Security Breach, Six Arrested",
            "Summary": "MobiKwik suffered a security breach on September 11-12 that resulted in ₹40 crore being stolen through a technical vulnerability following a software update. The flaw allowed users to process transactions exceeding wallet balances and bypass authentication with incorrect UPI PINs, leading to over five lakh fraudulent transfers across 2,500 bank accounts. The breach was discovered on September 13 during a routine audit. Police have arrested six individuals and frozen ₹8 crore across 2,500 accounts, while MobiKwik recovered ₹14 crore, leaving a net impact of ₹26 crore. Authorities suspect insider involvement due to the operation's scale and sophistication. MobiKwik previously faced a similar ₹19 crore fraud in 2017. The company is working with banks and law enforcement to recover remaining funds. One MobiKwik Systems shares traded up 0.3% at ₹299.01, gaining 32.5% over the past month.",
            "Sentiment": "negative",
            "PublishDate": 1758179692898,
            "Source": "stock"
        },
        {
            "Title": "One MobiKwik Reports ₹26 Crore Fraud Loss from Unauthorized Settlements in Haryana",
            "Summary": "One MobiKwik has reported fraudulent unauthorized settlements involving merchants and users in Haryana. The company estimates the financial impact of this fraud at ₹26 crores. The fraudulent activities involved unauthorized settlement transactions within the state.",
            "Sentiment": "negative",
            "PublishDate": 1758039218682,
            "Source": "stock"
        },
        {
            "Title": "One Mobikwik Systems Partners to Launch Chat-Based Bus Ticketing Service in Odisha",
            "Summary": "One Mobikwik Systems has partnered with Zaapay, Crut, and ONDC to launch a chat-based bus ticketing service in Odisha. The service targets 24 million commuters and aims to process 36 million rides annually. The platform is currently operational in nine cities, including Bhubaneswar and Cuttack.",
            "Sentiment": "positive",
            "PublishDate": 1756893330295,
            "Source": "stock"
        },
        {
            "Title": "One MobiKwik Shares Rise 36% in Three Sessions, Trading 8% Above IPO Price",
            "Summary": "One Mobikwik Systems shares gained 6% on Wednesday, marking the third consecutive session of gains with a total rally of 36% over three days. The stock now trades 8% above its IPO price of ₹278 per share. Trading volume reached 3.6 crore shares compared to the 20-day average of 25 lakh shares. Abu Dhabi Investment Authority exited its 2.1% stake through block deals on Monday, selling 16.44 lakh shares at ₹238.45 per share for a total value of ₹39.21 crore. Other major shareholders include Peak XV Partners (9.92%), Cisco Systems (1.54%), and American Express Travel Related Services (1.34%). Small retail shareholders hold a 28.1% stake in the company. Despite recent gains, the stock remains 57% below its post-listing high of ₹698.",
            "Sentiment": "positive",
            "PublishDate": 1756884614363,
            "Source": "stock"
        },
        {
            "Title": "ADIA Exits One MobiKwik Systems, Sells 2.1% Stake for Rs 39 Crore",
            "Summary": "Abu Dhabi Investment Authority (ADIA) divested its entire 2.10% stake in One MobiKwik Systems for Rs 39 crore through an open market transaction. ADIA sold over 16.44 lakh equity shares at an average price of Rs 238.45 per share. BofA Securities Europe SA and SI Investments Broking Pvt Ltd purchased a combined 9 lakh shares (1.15% stake) for Rs 22.12 crore at prices ranging from Rs 243.61-248.42 per share. One MobiKwik Systems shares closed 8.12% higher at Rs 237.74. The Gurugram-based fintech company reported a consolidated loss of Rs 41.9 crore in the June quarter, widening from Rs 6.6 crore in the same period last year. Revenue from operations declined 20.7% to Rs 271.3 crore from Rs 342.2 crore in Q1 FY25, though losses narrowed sequentially from Rs 56 crore in Q4 FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1756742215748,
            "Source": "order&deals"
        },
        {
            "Title": "MobiKwik Shares Jump 12% Despite Widening Losses in June Quarter",
            "Summary": "One MobiKwik Systems shares surged 12% on high trading volumes of 2.2 crore shares, breaking a six-day decline. The fintech company reported a consolidated loss of ₹41.9 crore in the June quarter, widening from ₹6.6 crore in the same period last year. Revenue from operations declined 20.7% to ₹271 crore from ₹342.2 crore in Q1 FY25. Sequential performance showed losses narrowing from ₹56 crore in Q4 FY25 and revenue increasing 1.3%. The stock remains 65% below its post-listing high of ₹698.30 reached on December 26, 2024. MobiKwik's IPO was oversubscribed nearly 120 times, raising ₹572 crore through fresh share issuance. Dolat Capital Markets maintains a 'Buy' rating on the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1756717667146,
            "Source": "stock"
        },
        {
            "Title": "One MobikWik Files Legal Action in Delhi High Court Over Unreleased Escrow Funds",
            "Summary": "One MobikWik has filed legal action in the Delhi High Court regarding unreleased funds from escrow accounts, with a hearing scheduled for August 21. Additionally, MobikWik vendors are threatening legal action over delayed payments totaling ₹42 crores.",
            "Sentiment": "negative",
            "PublishDate": 1755679151688,
            "Source": "stock"
        },
        {
            "Title": "MobiKwik Targets Profitability by Second Half of FY26 After Quarterly Loss Reduction",
            "Summary": "One MobiKwik Systems aims to achieve profitability by the second half of FY26, according to Co-founder and CFO Upasana Taku. The fintech company reduced its EBITDA loss from Rs 45 crore in Q4FY25 to Rs 31 crore in Q1FY26, covering Rs 15 crore in one quarter. The company maintained stable fixed costs between Rs 104-108 crore for five quarters and optimized direct costs by 5-6% from Q4FY25 to Q1FY26. Customer acquisition costs remain at Rs 40, which the company considers among the lowest in India's fintech sector, with plans to maintain it in the Rs 30-40 range. The payments business grew 53% year-on-year in Q1FY26, with Gross Merchandise Value increasing 16% quarter-on-quarter. Loan disbursals for ZIP EMI and personal loan products grew 31% quarterly but declined 21% year-on-year. Taku expects this to be a recovery year before returning to 30-50% annual growth rates.",
            "Sentiment": "positive",
            "PublishDate": 1754465723995,
            "Source": "stock"
        },
        {
            "Title": "MobiKwik Reports 53% Payment GMV Growth, Targets EBITDA Breakeven by Q3-Q4 FY26",
            "Summary": "One MobiKwik Systems Limited reported strong Q1 FY26 results with payment GMV reaching ₹384 billion, marking 53% year-on-year growth and achieving lifetime-high numbers. The company's payments business maintained a 15 basis points net margin with 28% contribution margin. UPI transactions now represent 35% of total GMV, up from 30% last year, growing 85% annually. The lending business showed recovery with 30% growth in disbursals, following similar growth in the previous quarter. Management expects lending gross margins to improve from current 14% to 40% by H2 FY26 as the portfolio seasons. The company reported EBITDA loss of ₹31 crores, representing a ₹15 crore improvement from Q4 FY25. With ₹475 crores cash on balance sheet from IPO proceeds, MobiKwik targets EBITDA breakeven by Q3 or Q4 of current financial year. The company operates under FLDG model for lending with 3-5% guarantee provided to partners and maintains take rates of 8-8.5% in the lending segment.",
            "Sentiment": "positive",
            "PublishDate": 1754307442039,
            "Source": "earnings"
        },
        {
            "Title": "MobiKwik Q1 Loss Widens to Rs 42 Crore as Financial Services Revenue Drops",
            "Summary": "One MobiKwik Systems reported a consolidated loss of Rs 41.9 crore for the June quarter, significantly higher than Rs 6.6 crore loss in the same period last year. Revenue from operations declined 20.7% to Rs 271.3 crore from Rs 342.2 crore. The company's financial services business saw revenue drop from Rs 170 crore to Rs 58 crore year-on-year due to industry-wide moderation in unsecured personal lending, strategic shift away from BNPL products, and new accounting treatments. However, payments business revenue grew 24% to Rs 213.1 crore. EBITDA loss was Rs 31.2 crore compared to positive Rs 22 crore in the previous year. The company achieved highest-ever quarterly payments GMV of Rs 38,388.2 crore and expects EBITDA breakeven in the second half of fiscal 2026. MobiKwik has utilized Rs 214 crore of its Rs 530.5 crore IPO proceeds for business growth and technology investments.",
            "Sentiment": "negative",
            "PublishDate": 1754065562669,
            "Source": "earnings"
        },
        {
            "Title": "MobiKwik Reports 53% YoY Payments GMV Growth and 32% EBITDA Improvement in Q1 FY26",
            "Summary": "One MobiKwik Systems Limited reported quarterly results showing payments GMV of ₹384 billion, up 53% year-over-year and 16% quarter-over-quarter. The company achieved a lifetime high payments gross margin of 28% compared to 16% in the same quarter last year. ZIP EMI disbursals grew 31% to ₹693 crores with improved take rates of 8.41%. Total income reached ₹2,816 million with contribution margin growing 22% quarter-over-quarter to ₹774 million. EBITDA improved 32% quarter-over-quarter to negative ₹312 million. The user base expanded to 180.2 million registered users and 4.64 million merchants. The company maintained its position as India's #1 PPI wallet and secured a stock broking license during the quarter. Fixed costs remained stable at ₹108.6 crores. Management expects lending business recovery in H2 FY26 and aims for EBITDA breakeven through improved margins and cost control.",
            "Sentiment": "positive",
            "PublishDate": 1753985036740,
            "Source": "earnings"
        },
        {
            "Title": "MobiKwik Reports 53% YoY Growth in Payments GMV, EBITDA Improves 32% QoQ in Q1 FY26",
            "Summary": "One MobiKwik Systems Limited reported strong quarterly results with payments GMV reaching INR 384 billion, marking 53% year-over-year and 16% quarter-over-quarter growth. The company achieved its highest-ever quarterly payments gross margin of 27.9%, up from 16.1% in the previous year. User base expanded to 180.2 million registered users with 3.8 million new additions, while merchant base grew to 4.64 million. EBITDA improved 32% quarter-over-quarter to INR 312 million, driven by cost optimization across payment gateway expenses and lending-related costs. Financial services revenue showed recovery with ZIP EMI disbursals growing 31% quarter-over-quarter to INR 6.9 billion. The company secured a stock broking license during the quarter, adding to its payment gateway license obtained previously. Total income remained relatively flat at INR 2.8 billion, while contribution margin expanded to 27.5% from 22.8% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753984310026,
            "Source": "earnings"
        },
        {
            "Title": "MobiKwik Reports 53% YoY Payments GMV Growth and 32% EBITDA Improvement in Q1 FY26",
            "Summary": "MobiKwik Systems Limited reported quarterly results showing payments GMV of INR 384 billion, up 53% year-over-year and 16% quarter-over-quarter. The company achieved a lifetime high payments gross margin of 27.9% and EBITDA improved 32% quarter-over-quarter to INR 312 million. Revenue from operations was INR 2,714 million with total income of INR 2,816 million. The registered user base grew to 180.2 million users and merchant base reached 4.64 million. However, the company reported a net loss of INR 419 million for the quarter. The board approved appointments of new statutory and secretarial auditors, carry-forward of IPO proceeds utilization from FY25 to FY26, and preparations for the annual general meeting. Financial services revenue was INR 583 million with ZIP EMI disbursals of INR 6,931 million.",
            "Sentiment": "positive",
            "PublishDate": 1753981371965,
            "Source": "earnings"
        },
        {
            "Title": "Net 1 Applied Technologies Netherlands B.V. Exits One Mobikwik Systems with Complete 8% Stake Sale",
            "Summary": "Net 1 Applied Technologies Netherlands B.V. sold its entire 8% stake in One Mobikwik Systems Limited, disposing of 62,15,620 shares through open market transactions on June 26, 2025. The transaction reduced Net 1's shareholding from 8% to zero. One Mobikwik Systems has a total equity share capital of 7,76,86,313 shares and is listed on BSE Limited and National Stock Exchange of India Limited. Net 1 Applied Technologies Netherlands B.V. is not part of the promoter or promoter group of One Mobikwik Systems.",
            "Sentiment": "neutral",
            "PublishDate": 1753099430295,
            "Source": "stock"
        },
        {
            "Title": "One MobiKwik Systems: Stock Rebounds 11% but Faces Resistance at Rs 300",
            "Summary": "MobiKwik shares have rebounded 11% over the past week after a 61% decline from peak. Analysts suggest the stock may face resistance at Rs 300 level. Q4 FY25 results show widened net loss of Rs 56.03 crore despite 2.3x jump in payments GMV. Technical indicators show mixed signals, with RSI nearing 60 and price above short-term moving averages.",
            "Sentiment": "neutral",
            "PublishDate": 1752724467000,
            "Source": "normal_news"
        },
        {
            "Title": "MobiKwik: Subsidiary Secures SEBI Approval for Stockbroking",
            "Summary": "MobiKwik's subsidiary, MobiKwik Securities Broking Pvt Ltd, received SEBI approval to operate as a stockbroker and clearing member. This strategic move allows the company to conduct equity trades and strengthens its position in the wealth distribution space. MobiKwik's shares rose 2.53% on the NSE following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1751537125000,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Grants Mobikwik Securities Broker and Clearing Member Certification",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued a certificate to Mobikwik Securities, allowing it to operate as both a stock broker and clearing member. This development expands Mobikwik's capabilities in the financial services sector.",
            "Sentiment": "positive",
            "PublishDate": 1751535207000,
            "Source": "default"
        },
        {
            "Title": "MobiKwik: Saurabh Dwivedi Promoted to Chief Technology Officer",
            "Summary": "MobiKwik has elevated Saurabh Dwivedi from SVP-Engineering to Chief Technology Officer. Dwivedi will lead engineering across multiple divisions and focus on AI implementation. Dhruv Wadhera has been promoted to Senior Vice President for Offline Payments.",
            "Sentiment": "positive",
            "PublishDate": 1751295023000,
            "Source": "corporate_governance"
        },
        {
            "Title": "One Mobikwik Systems Ltd: Share Price Recovers After Block Deals",
            "Summary": "One Mobikwik Systems Ltd. shares recovered after an initial 6% decline following multiple block deals. 68.5 lakh shares were traded at Rs 231-261, totaling Rs 168 crore. The company recently granted 3,27,688 stock options to employees at face value.",
            "Sentiment": "neutral",
            "PublishDate": 1750915615000,
            "Source": "block_deals"
        },
        {
            "Title": "One MobiKwik Systems Ltd: Large Block Deal Expected as Net1 Likely to Exit",
            "Summary": "Net1 Applied Technologies Netherlands BV is expected to sell its entire 8% stake in One MobiKwik Systems Ltd via block deals. MobiKwik's stock remains below its IPO price, having corrected over 60% from its post-listing high. The company recently reported widened net losses for Q4, with revenue rising 2.6% year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1750906505000,
            "Source": "block_deals"
        },
        {
            "Title": "Mobikwik: Net1 to Sell 8% Stake via Block Deal",
            "Summary": "Net1 Applied Technologies Netherlands BV plans to sell an 8% stake in One Mobikwik Systems Ltd through a block deal. The shares will be offered at a 0% to 8.4% discount to the current market price. This comes after Mobikwik's recent entry into stockbroking and its stock performance since IPO.",
            "Sentiment": "neutral",
            "PublishDate": 1750874322000,
            "Source": "block_deals"
        },
        {
            "Title": "One MobiKwik Systems Ltd: Shares Fall 6% Below IPO Price as Lock-in Period Ends",
            "Summary": "MobiKwik shares declined 6% as the six-month lock-in period for shareholders ended, making 3.8 crore shares eligible for trading. The stock is now trading 5.62% lower at ₹254.80, 9% below its IPO price of ₹279. The company recently reported a net loss of ₹3.6 crore for the September quarter, with revenue increasing 43% to ₹291 crore.",
            "Sentiment": "negative",
            "PublishDate": 1750224529000,
            "Source": "corporate_action"
        },
        {
            "Title": "MobiKwik: New UPI and Credit Card Products to Drive Growth",
            "Summary": "MobiKwik is launching two new products: Pocket UPI for smarter everyday UPI payments and First Card, a RuPay credit card for daily UPI transactions accessible without a CIBIL score. The credit card will be secured by a fixed deposit. The company added 20 million customers in FY25 but faced challenges in credit distribution due to macroeconomic conditions. Despite a Rs 121.5-crore loss in FY25, MobiKwik maintains high contribution margins in payments and financial services.",
            "Sentiment": "positive",
            "PublishDate": 1747884090000,
            "Source": "normal_news"
        },
        {
            "Title": "One Mobikwik: Q4 Financial Services Revenue Declines, BNPL Business Scales Down",
            "Summary": "One Mobikwik's Q4 financial services revenue decreased 23% QoQ and 64.6% YoY due to scaling down of small ticket BNPL business. BNPL's gross merchandise value fell 50% QoQ. However, longer tenure ZIP EMI showed 32.5% QoQ growth in GMV.",
            "Sentiment": "negative",
            "PublishDate": 1747805956000,
            "Source": "earnings"
        },
        {
            "Title": "One MobiKwik Systems: Q4 Loss Widens to Rs 56 Crore, Stock Falls 6%",
            "Summary": "One MobiKwik Systems reported a Q4 FY25 net loss of Rs 56.03 crore, up from Rs 67 lakh last year. Revenue grew 2.6% YoY to Rs 278 crore. Payments GMV increased 2.3x YoY, but EBITDA loss reached Rs 45.8 crore. The stock fell 6.3% to Rs 262 in intraday trade.",
            "Sentiment": "negative",
            "PublishDate": 1747719735000,
            "Source": "earnings"
        },
        {
            "Title": "ONE MOBIKWIK SYSTEMS Reports Increased Q4 EBITDA and Net Losses",
            "Summary": "ONE MOBIKWIK SYSTEMS reported its Q4 financial results. The company's EBITDA loss increased to 457 million rupees from 6 million rupees in the same quarter last year. The consolidated net loss also rose to 560 million rupees from 6 million rupees year-over-year. However, revenue slightly increased to 2.68 billion rupees from 2.65 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747708147000,
            "Source": "result"
        }
    ]
}