{
    "Symbol": "MODISONLTD",
    "ISIN": "INE737D01021",
    "News": [
        {
            "Title": "Modison Limited Reports Fire at Gujarat Plant",
            "Summary": "Fire incident at Modison's Vapi manufacturing facility causes temporary operational disruption. Company assessing damage extent while insurance claims process begins.",
            "Sentiment": "negative",
            "PublishDate": 1770477282653,
            "Source": "stocks"
        },
        {
            "Title": "Modison Metals Q3 Net Profit Surges 246% YoY",
            "Summary": "Modison Metals reports strong Q3 performance with net profit jumping to 201 million rupees from 58 million rupees year-on-year, while revenue grows to 1.4 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1770029675270,
            "Source": "co_actions_results"
        },
        {
            "Title": "Modison Limited Submits Q3FY26 RTA Certificate",
            "Summary": "Modison Limited filed RTA certificate for Q3FY26 under SEBI regulations, with 1,000 shares dematerialised during the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767341986850,
            "Source": "stocks"
        },
        {
            "Title": "Modison Limited Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirmed Modison Limited's existing credit ratings and assigned ratings to new facilities worth ₹25.00 crores from CitiBank, bringing total rated facilities to ₹157.50 crores.",
            "Sentiment": "positive",
            "PublishDate": 1766571699610,
            "Source": "stocks"
        },
        {
            "Title": "Modison Limited Receives Order Dropping GST Proceedings Under DRC-01",
            "Summary": "Modison Limited received an order from the Deputy Commissioner of Gujarat dropping proceedings initiated under DRC-01, following a previous GST demand of Rs. 11,67,229 for financial year 2021-22. The company states no violation was identified by the authority and no penalty or restriction has been imposed, with no expected impact on its financial or operational activities.",
            "Sentiment": "positive",
            "PublishDate": 1764939661865,
            "Source": "stock"
        },
        {
            "Title": "Modison Limited Declares 250% Interim Dividend for Financial Year 2025-26",
            "Summary": "Modison Limited has declared an interim dividend of 250% (Rs. 2.50 per equity share of Rs. 1.00 each) for financial year 2025-26, with record date fixed as December 08, 2025. The dividend payment will be made on or after December 09, 2025, to all beneficial owners and members holding shares in electronic and physical form respectively.",
            "Sentiment": "positive",
            "PublishDate": 1764660851257,
            "Source": "corporate_action"
        },
        {
            "Title": "Modison Limited Closes Trading Window for Interim Dividend Declaration",
            "Summary": "Modison Limited has closed its trading window from November 27, 2025, ahead of the proposed interim dividend declaration for financial year 2025-26. The trading window will remain closed until 48 hours after the record date for interim dividend payment, which will be approved by the Board of Directors at their December 2, 2025 meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1764159449528,
            "Source": "corporate_action"
        },
        {
            "Title": "Modison Limited Faces Rs 3.74 Lakh Penalty and Recovery Demand from Mumbai Customs",
            "Summary": "Modison Limited received an order from Assistant Commissioner of Customs confirming a demand of Rs 2,23,697 for ineligible drawback recovery along with applicable interest, and imposing a penalty of Rs 1,50,000 for violations under the Customs Act. The company plans to file an appeal with appropriate authorities within prescribed timelines and expects no relevant impact on its financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1763721298142,
            "Source": "stock"
        },
        {
            "Title": "Modison Limited Reports Strong Q2 Results and Approves Land Sale to Promoter Group Entity",
            "Summary": "Modison Limited's board approved unaudited financial results for the quarter and half year ended September 30, 2025, showing quarterly revenue of Rs 14,516.21 lakhs and profit after tax of Rs 1,166.01 lakhs. The company also approved the sale of 28,320 sq. meter industrial land in Silvassa to promoter group entity Modison Chemtech Private Limited, which will not impact business operations as no activities are conducted on the property.",
            "Sentiment": "positive",
            "PublishDate": 1763116676251,
            "Source": "earnings"
        },
        {
            "Title": "Modison Limited Completes Board Transition with New Independent Director Appointment",
            "Summary": "Modison Limited announced the completion of Ashok Shantilal Jatia's second term as Non-Executive Independent Director effective November 1, 2025. Following his departure, Jatia ceased to be Chairman of the Audit Committee, Nomination Remuneration Committee, and Stakeholders Relationship Committee, as well as a member of the Corporate Social Responsibility Committee and Finance Committee. The company simultaneously appointed Nandkishore Bafna as Non-Executive Independent Director for a five-year term from November 1, 2025, to October 31, 2030. Bafna's appointment was approved by shareholders through remote e-voting on October 25, 2025, with voting results submitted to stock exchanges on October 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762006467949,
            "Source": "corporate_governance"
        },
        {
            "Title": "Modison Limited Shareholders Approve Appointment of Independent Director Through Postal Ballot",
            "Summary": "Modison Limited announced that shareholders have approved the appointment of Mr. Nandkishore Bafna as Non-Executive Independent Director through a postal ballot process. The e-voting was conducted from September 26 to October 25, 2025, with 21,776 total shareholders on record date of September 19, 2025. Out of 32,450,000 total shares, 17,626,152 votes were polled representing 54.32% participation. The resolution received overwhelming support with 17,625,222 votes in favor (99.99%) and only 930 votes against (0.01%). The promoter and promoter group, holding 16,910,884 shares, voted 99.55% of their holdings entirely in favor. Public non-institutions contributed 791,641 votes with 99.88% supporting the resolution. The scrutinizer Ragini Chokshi confirmed the resolution passed with requisite majority, and voting results are available on the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1761562936337,
            "Source": "corporate_action"
        },
        {
            "Title": "Modison Limited Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Modison Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Nandkishore Bafna (DIN: 00019372) as Non-Executive Independent Director. The 86-year-old chartered accountant would serve a five-year term from November 1, 2025, to October 31, 2030. E-voting is scheduled from September 26, 2025, to October 25, 2025, through NSDL's platform. Mr. Bafna is a Partner at Lodha & Co. LLP with over 45 years of experience in assurance and corporate finance advisory services. He holds top honors as a rank-holding graduate in Law and Commerce and has served on various ICAI committees. The appointment requires special resolution approval due to his age exceeding regulatory limits. Results will be announced by October 27, 2025. Ms. Ragini Chokshi has been appointed as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1758720190707,
            "Source": "corporate_governance"
        },
        {
            "Title": "Modison Limited Reports Q1 FY2026 Results and Appoints New Independent Director",
            "Summary": "Modison Limited announced unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹13,413.57 lakhs compared to ₹11,647.99 lakhs in the same quarter last year. Net profit increased to ₹480.06 lakhs from ₹114.67 lakhs year-over-year. Basic earnings per share stood at ₹1.48 versus ₹0.35 in the previous year quarter. The company also appointed Mr. Nandkishore Bafna as Additional Director in the role of Non-Executive Independent Director, effective November 1, 2025, for a five-year term, subject to shareholder approval. This appointment fills the vacancy arising from the completion of Mr. Ashok Shantilal Jatia's second term as Independent Director. Additionally, Modison divested its entire stake in wholly owned subsidiary Modison Hitech Private Limited, effective June 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755184419034,
            "Source": "earnings"
        },
        {
            "Title": "Modison Limited Sets Record Date for 200% Dividend Subject to AGM Approval",
            "Summary": "Modison Limited has set September 2, 2025 as the record date for determining shareholder eligibility for a 200% dividend (Rs. 2 per equity share of Rs. 1 each) for financial year 2024-25. The dividend requires approval at the company's 42nd Annual General Meeting scheduled for September 9, 2025 at 11:30 a.m. via video conference. If approved, dividend payments will commence September 12, 2025, subject to applicable tax deductions. The same date also serves as the cut-off date for determining voting eligibility at the AGM. The Board of Directors has recommended this dividend proposal for shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754128334784,
            "Source": "corporate_action"
        },
        {
            "Title": "Modison: Q3 Profit Surges 42.4% YoY, Revenue Up 12.47%",
            "Summary": "Modison reported Q3 FY25 results with profit rising 42.4% YoY to ₹5.81 crore and revenue increasing 12.47% YoY to ₹121.21 crore. EPS grew 30.66% YoY to ₹1.79. However, QoQ performance showed declines in both revenue and profit.",
            "Sentiment": "positive",
            "PublishDate": 1739653103000,
            "Source": "earnings"
        },
        {
            "Title": "Modison Reports Improved Q3 EBITDA and Margin",
            "Summary": "Modison has reported a significant increase in its Q3 EBITDA, rising from 85 million rupees to 112 million rupees year-over-year. The company's EBITDA margin also improved, increasing from 7.92% to 9.22% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739437759000,
            "Source": "earnings"
        },
        {
            "Title": "Modison Reports Increased Q3 Profit and Revenue",
            "Summary": "Modison has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 58 million rupees from 41 million rupees in the same quarter last year. Revenue also saw a rise, reaching 1.2 billion rupees compared to 1.07 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739437706000,
            "Source": "earnings"
        },
        {
            "Title": "Modison Reports Significant EBITDA Growth in Q2",
            "Summary": "Modison has announced its Q2 financial results, showing substantial year-over-year improvement. The company's EBITDA increased from 55 million rupees to 101 million rupees. Additionally, the EBITDA margin expanded from 5.66% to 8.29% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731489159000,
            "Source": "result"
        },
        {
            "Title": "Modison Reports Q2 Revenue Growth",
            "Summary": "Modison has reported a revenue of 1.2 billion rupees for the second quarter, compared to 972 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731489106000,
            "Source": "result"
        },
        {
            "Title": "Modison Reports Increased Q2 Consolidated Net Profit",
            "Summary": "Modison has reported a consolidated net profit of 82 million rupees for the second quarter, compared to 56 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731489048000,
            "Source": "result"
        }
    ]
}