{
    "Symbol": "MODIRUBBER",
    "ISIN": "INE832A01018",
    "News": [
        {
            "Title": "Modi Rubber JV Gujarat Guardian Plans Expansion",
            "Summary": "Modi Rubber's joint venture Gujarat Guardian Limited approves expansion to add second float line and wet coater at Gujarat facility, funded through internal accruals and borrowings.",
            "Sentiment": "positive",
            "PublishDate": 1769687335416,
            "Source": "stocks"
        },
        {
            "Title": "Modi Rubber sells 6 Bangalore office units for ₹3.47 cr",
            "Summary": "Modi Rubber Limited announced the sale of six office units at Barton Centre, Bangalore to Nawka Granites Private Limited for ₹3.47 crores, approved by the Board of Directors on January 21st, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768999589152,
            "Source": "co_actions_results"
        },
        {
            "Title": "Modi Rubber clarifies no price sensitive events",
            "Summary": "Modi Rubber Limited confirms to BSE that no price sensitive information or insider trading occurred during recent price movement, with no promoter involvement in share transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1766995006208,
            "Source": "stocks"
        },
        {
            "Title": "Modi Rubber Limited Reports Net Loss of Rs 439.17 Lacs in Q2 FY2026",
            "Summary": "Modi Rubber Limited posted a standalone net loss of Rs 439.17 lacs for the quarter ended September 30, 2025, compared to a profit of Rs 1,353.15 lacs in the same quarter last year. On a consolidated basis, the company reported a net profit of Rs 456.15 lacs for the quarter, with total income reaching Rs 1,107.36 lacs driven by other operating revenue and income from joint ventures and associates.",
            "Sentiment": "negative",
            "PublishDate": 1763131486269,
            "Source": "earnings"
        },
        {
            "Title": "Modi Rubber Limited Approves Q1 2025 Financial Results and Sets 52nd AGM Date",
            "Summary": "Modi Rubber Limited's Board of Directors met on August 12, 2025, and approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, along with a limited review report. The Board reviewed financial statements of eight subsidiary and joint venture companies including Spin Investment Limited, Superior Investment Limited, Asahi Modi Materials Private Limited, Gujarat Guardian Limited, Modi Marco Aldany Private Limited, IQ Modi Power Pvt Ltd, Vinura Beverages Pvt Ltd, and Uniglobe Modi Travels Pvt Ltd. The Board also approved the statement of investment and related party transactions for April 1 to June 30, 2025. Additionally, they approved the Director Report, Corporate Governance Report, Management Discussion and Analysis Report, and compliance certificate from the CEO and CFO for financial year 2024-25. The company scheduled its 52nd Annual General Meeting for September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755002342648,
            "Source": "corporate_action"
        }
    ]
}