{
    "Symbol": "MODIS",
    "ISIN": "INE0L0L01012",
    "News": [
        {
            "Title": "Modis Navnirman Begins Rashmi Icon Construction",
            "Summary": "Modis Navnirman Limited commenced construction of Rashmi Icon, a 200+ unit residential project in Malad West, Mumbai with Bhoomi Poojan ceremony on February 6, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770651788942,
            "Source": "stocks"
        },
        {
            "Title": "Aegis Investment Fund reduces stake in MODIS NAVNIRMAN",
            "Summary": "Aegis Investment Fund PCC sold 32,000 shares in MODIS NAVNIRMAN LIMITED through open market transactions, reducing its shareholding from 7.80% to 7.63% as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769756281017,
            "Source": "co_actions_results"
        },
        {
            "Title": "Modi's Navnirman wins ₹250 cr redevelopment mandate",
            "Summary": "Modi's Navnirman Limited secures unanimous approval for BOI Staff Sheetal Co-operative Housing Society redevelopment project in Mumbai's Borivali West with GDV of ₹250.00 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767273445646,
            "Source": "co_actions_results"
        },
        {
            "Title": "Modis Navnirman Reports 128% Revenue Growth in H1 FY26, Achieves Full-Year FY25 Profit in Six Months",
            "Summary": "Modis Navnirman Limited achieved revenue of 83.39 crores with 128% year-on-year growth, EBITDA of 16.04 crores (up 164%), and PAT of 12 crores (up 165%) in H1 FY26, matching its entire FY25 profit in just six months. The Mumbai-based redevelopment-focused real estate company successfully merged its subsidiary, handed over a 90-unit project in Borivali, and is progressing toward BSE-NSE main board migration while maintaining debt-free status.",
            "Sentiment": "positive",
            "PublishDate": 1763209683504,
            "Source": "earnings"
        },
        {
            "Title": "Modis Navnirman Limited Migrates from SME Platform to Main Board of BSE and NSE",
            "Summary": "Modis Navnirman Limited, a Mumbai-based real estate redevelopment company, successfully migrated from the SME Platform to the Main Board of both BSE and NSE effective November 14, 2025. The migration of 1,95,91,200 fully paid-up equity shares of ₹10 each opens new avenues for enhanced visibility, liquidity, and access to a wider base of institutional and retail investors.",
            "Sentiment": "positive",
            "PublishDate": 1763068066191,
            "Source": "stock"
        },
        {
            "Title": "Modis Navnirman Reports Strong H1 Performance with Net Profit Rising to 120M Rupees",
            "Summary": "Modis Navnirman reported net profit of 120 million rupees for H1, compared to 45 million rupees in the same period last year. The company's H1 revenue reached 839 million rupees, up from 366 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762257793272,
            "Source": "earnings"
        },
        {
            "Title": "Modis Navnirman Limited Completes Merger with Subsidiary Shree Modis Navnirman Private Limited",
            "Summary": "Modis Navnirman Limited (BSE: 543539) has successfully completed a fast-track merger with its wholly-owned subsidiary, Shree Modis Navnirman Private Limited. The merger received approval from over 90% of shareholders and represents India's second fast-track merger and the first listed fast-track merger in Mumbai's real estate segment. The consolidation is expected to strengthen the company's balance sheet, enhance operational efficiencies, streamline business processes, enable better resource utilization, and create cost synergies. Mahek Modi, Whole Time Director and CFO, stated that the merger positions the company to accelerate growth and strengthen its foothold in Mumbai's real estate market. Modis Navnirman operates as a redevelopment real estate player in Mumbai, founded by Dinesh C. Modi in 2010.",
            "Sentiment": "positive",
            "PublishDate": 1760695450783,
            "Source": "corporate_action"
        },
        {
            "Title": "Modis Navnirman Reports Strong FY25 Performance with 49.76% Revenue Growth",
            "Summary": "Modis Navnirman Limited submitted its investor presentation for fiscal year 2024-25, reporting revenue of Rs. 86.54 crore, representing 49.76% year-over-year growth. The company achieved EBITDA of Rs. 16.75 crore with a margin of 19.35%, up 358 basis points year-over-year. Profit after tax reached Rs. 12.25 crore, marking 83.08% year-over-year growth. The Mumbai-based real estate developer sold approximately 40,000 square feet across 60 units, generating sales value of Rs. 86.52 crore. Collections totaled Rs. 115.27 crore, up 96% year-over-year. The company launched three projects during FY25, focusing on society redevelopment and mid-income housing in Mumbai's suburban markets including Malad, Kandivali, and Borivali. Modis Navnirman operates through an asset-light, partnership-driven model specializing in MHADA, SRA, and society redevelopment projects. The company has delivered over 5.90 lakh square feet and has 7.40 lakh square feet ongoing, with 10+ lakh square feet upcoming across 20 premium residential projects.",
            "Sentiment": "positive",
            "PublishDate": 1757923044253,
            "Source": "stock"
        },
        {
            "Title": "Modi's Navnirman Limited Reports Strong Financial Growth with 53% Revenue Increase",
            "Summary": "Modi's Navnirman Limited submitted revised audited financial results for FY2025, showing significant growth across key metrics. Total revenue increased 53% to Rs. 8,856.73 lakhs from Rs. 5,790.45 lakhs in the previous year. Net profit rose 83% to Rs. 1,225.16 lakhs from Rs. 669.18 lakhs, while profit before tax increased 82% to Rs. 1,649.37 lakhs from Rs. 906.40 lakhs. The company's earnings per share improved to Rs. 6.25 from Rs. 3.51, and net profit margin expanded to 13.8% from 11.6%. Total assets grew to Rs. 15,914.02 lakhs from Rs. 11,269.00 lakhs, with inventory significantly increasing to Rs. 14,669.78 lakhs from Rs. 8,360.69 lakhs. The company issued 5,00,000 equity shares at Rs. 210 per share through warrant conversion and reported no material fraud during the year.",
            "Sentiment": "positive",
            "PublishDate": 1755610100442,
            "Source": "earnings"
        },
        {
            "Title": "Modi's Navnirman Limited Completes Postal Ballot Voting for Subsidiary Merger Scheme",
            "Summary": "Modi's Navnirman Limited concluded its postal ballot voting process on August 15, 2025, at 5:00 p.m. (IST). The voting was conducted to obtain shareholder approval for a special resolution regarding the approval of a scheme of arrangement between the company and its wholly owned subsidiary, Shree Modi's Navnirman Private Limited. The voting period ran from July 17, 2025, to August 15, 2025, with National Securities Depository Limited providing remote e-voting services. JNG & Co. LLP was appointed as the scrutinizer for the process. The voting results will be declared by August 19, 2025, at 5:00 p.m. (IST), and will be submitted to stock exchanges and displayed on relevant websites.",
            "Sentiment": "neutral",
            "PublishDate": 1755262218653,
            "Source": "corporate_action"
        },
        {
            "Title": "Modis Navnirman Submits Application to Migrate from BSE SME to Main Boards of BSE and NSE",
            "Summary": "Modis Navnirman Limited has submitted its application to migrate from the BSE SME Platform to the Main Board of BSE and for simultaneous listing on the Main Board of NSE. The Mumbai-based real estate company, which focuses on redevelopment projects, completed the necessary documentation and compliance requirements for both exchanges. The company aims to enhance its market presence, access a broader investor base, and provide increased opportunities to engage with institutional investors. Mahek Modi, Whole Time Director and CFO, stated that the migration represents a significant milestone in the company's growth journey and reflects consistent performance and governance. Founded in 2010 by Dinesh C. Modi, the company positions itself as one of the fastest growing real estate players in Mumbai's redevelopment space.",
            "Sentiment": "positive",
            "PublishDate": 1753277281209,
            "Source": "stock"
        },
        {
            "Title": "Modi's Navnirman Plans Merger and Main Board Transition",
            "Summary": "Modi's Navnirman Ltd has announced plans to merge with its wholly-owned subsidiary, Modi's Navnirman Infra Private Limited. The company also intends to transition from the BSE SME platform to the main boards of both BSE and NSE. This strategic move aims to enhance the company's market presence and provide better liquidity for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1749562812000,
            "Source": "default"
        },
        {
            "Title": "Modis Navnirman to Consider Migration from BSE SME to Main Boards",
            "Summary": "Modis Navnirman has scheduled a board meeting on June 6 to consider and approve the migration of the company from the BSE SME Exchange to the main boards of both BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1748870158000,
            "Source": "default"
        }
    ]
}