{
    "Symbol": "MODINATUR",
    "ISIN": "INE537F01012",
    "News": [
        {
            "Title": "Modi Naturals Limited Receives NSE Listing Approval for 1.33 Crore Equity Shares",
            "Summary": "Modi Naturals Limited has received listing and trading approval from NSE for 1,33,06,397 equity shares of face value Re. 10/- each on the Main Board. The company's equity shares will be listed and traded on NSE with effect from December 11, 2025, under the symbol MODINATUR, marking an important milestone for enhancing market presence and investor outreach.",
            "Sentiment": "positive",
            "PublishDate": 1765335170384,
            "Source": "stock"
        },
        {
            "Title": "Modi Naturals Reports 32.8% PAT Growth in Q2FY26, Expands Ethanol Capacity to 310 KLPD",
            "Summary": "Modi Naturals achieved 32.8% PAT growth to INR 10.1 crores in Q2FY26 despite GST transition impacts on consumer division, with EBITDA rising 14.9% to INR 15.3 crores. The company secured INR 400 crores ethanol orders from OMCs and expects its expanded 180 KLPD ethanol facility to commence operations by December 2025, increasing total capacity to 310 KLPD.",
            "Sentiment": "positive",
            "PublishDate": 1763636508319,
            "Source": "earnings"
        },
        {
            "Title": "Modi Naturals Reports 302.57 Crore Profit in Q2 FY26 Results",
            "Summary": "Modi Naturals Limited announced unaudited financial results for the quarter and half year ended September 30, 2025, showing consolidated profit after tax of Rs. 302.57 crore for the quarter. The company's board approved both standalone and consolidated financial statements, with the subsidiary Modi Biotech Private Limited contributing Rs. 744.51 crore in net profit and generating additional cash flow of Rs. 66.35 lakh from GST input credit set-offs.",
            "Sentiment": "positive",
            "PublishDate": 1763142196287,
            "Source": "earnings"
        },
        {
            "Title": "Modi Naturals Limited Schedules 51st AGM and Approves Re-appointment of Key Executives",
            "Summary": "Modi Naturals Limited's Board of Directors approved holding the 51st Annual General Meeting on September 30, 2025, via video conferencing. The Board approved re-appointments of three key executives for three-year terms, subject to shareholder approval: Anil Modi as Chairman cum Managing Director (effective January 1, 2026), Akshay Modi as Joint Managing Director (effective December 15, 2025), and Aditi Gupta as Whole Time Director (effective August 13, 2025). The company also re-appointed M/s Sarat Jain & Associates as Internal Auditors and M/s Manisha & Associates as Cost Auditors for FY 2025-26, while appointing M/s Deepak Bansal & Associates as Secretarial Auditors for a five-year term from FY 2025-26 to 2029-30.",
            "Sentiment": "neutral",
            "PublishDate": 1757054178713,
            "Source": "corporate_action"
        },
        {
            "Title": "Modi Naturals Reports 5% Revenue Growth and Appoints New CFO",
            "Summary": "Modi Naturals Limited reported consolidated revenue of Rs 155.0 crore for the quarter ended June 30, 2025, representing 5% year-on-year growth. The company's EBITDA increased 33.1% to Rs 17.7 crore, while profit after tax grew 40.6% to Rs 10.5 crore compared to the same period last year. The Board appointed Mr. Pradeep Kapoor as Chief Financial Officer effective August 13, 2025. Kapoor brings over 25 years of finance and accounts experience with expertise in manufacturing, financial management, and corporate strategy. The company's Consumer Division showed healthy growth in edible oils and launched Hing under the Oleev Kitchen brand, entering the spices category. The Bulk Division achieved positive EBITDA of Rs 0.8 crore versus a loss of Rs 1.2 crore in the previous year. The Ethanol business improved EBITDA margins to 17.1% from 12.1%, with Phase 2 expansion of 180 KLPD progressing and trial production targeted for Q3 FY26. The company invested Rs 3.9 crore in marketing initiatives and implemented a new ERP system during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755083989640,
            "Source": "earnings"
        },
        {
            "Title": "Modi Naturals CFO Pradeep Kapoor Resigns Due to Other Commitments",
            "Summary": "Modi Naturals Limited announced the resignation of Mr. Pradeep Kapoor from the position of Chief Financial Officer, effective July 29, 2025, due to other commitments and pre-occupations. Kapoor served as CFO and Key Managerial Personnel of the company. The resignation letter confirms there are no material reasons for his departure beyond those stated. The company has disclosed this information in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753781922998,
            "Source": "corporate_governance"
        },
        {
            "Title": "Modi Naturals Reports Strong Q4 Financial Results",
            "Summary": "Modi Naturals has reported significant year-over-year improvements in its quarterly financial results. The company's Q4 EBITDA increased to 161 million rupees from 55.7 million rupees in the previous year. The EBITDA margin improved to 8.48% from 4.65%. Revenue grew to 1.9 billion rupees from 1.2 billion rupees. Consolidated net profit rose to 81.6 million rupees, up from 13 million rupees year-over-year and 78.2 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748446448000,
            "Source": "result"
        },
        {
            "Title": "Modi Naturals Reports Profitable Q3 with Significant Revenue Growth",
            "Summary": "Modi Naturals has announced its Q3 financial results, showing a turnaround from loss to profit. The company reported a consolidated net profit of 78 million rupees, compared to a loss of 42 million rupees in the same quarter last year. This also represents an improvement from the previous quarter's profit of 76 million rupees. Revenue for Q3 increased substantially to 1.79 billion rupees, up from 1 billion rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738109804000,
            "Source": "earnings"
        },
        {
            "Title": "Modi Naturals Reports Significant EBITDA Improvement in Q3",
            "Summary": "Modi Naturals has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a gain of 133 million rupees, compared to a loss of 13 million rupees in the same quarter of the previous year. This represents a year-over-year turnaround from loss to profit. Additionally, the company's EBITDA margin for Q3 stood at 7.42%, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738075515000,
            "Source": "earnings"
        },
        {
            "Title": "Modi Naturals Reports Profit in Q3 FY2024, Revenue Surges",
            "Summary": "Modi Naturals has reported a consolidated net profit of 78 million rupees in the third quarter, compared to a loss of 42 million rupees in the same period last year. The company's revenue increased significantly to 1.79 billion rupees from 1 billion rupees year-over-year. Sequentially, the net profit improved from 76 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738075414000,
            "Source": "earnings"
        },
        {
            "Title": "Modi Naturals Reports Significant Q2 EBITDA Growth",
            "Summary": "Modi Naturals has reported a substantial increase in its Q2 EBITDA, rising to 133 million rupees from 23 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 9.10% compared to 2.48% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729858959000,
            "Source": "result"
        },
        {
            "Title": "Modi Naturals Reports Significant Profit Growth in Q2",
            "Summary": "Modi Naturals has reported a substantial increase in its Q2 consolidated net profit, rising to 76 million rupees from 7.5 million rupees year-over-year. The company's revenue also saw significant growth, reaching 1.5 billion rupees compared to 918.5 million rupees in the same quarter last year. Quarter-on-quarter, the net profit increased from 75 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729858866000,
            "Source": "result"
        }
    ]
}