{
    "Symbol": "MODTHREAD",
    "ISIN": "INE794W01014",
    "News": [
        {
            "Title": "Modern Threads Appoints New Executive Director",
            "Summary": "Modern Threads (India) Limited appoints Prabodh Kumar Nahar as Executive Director while Ram Awatar Kabra resigns due to health issues, effective January 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767790974197,
            "Source": "stocks"
        },
        {
            "Title": "Modern Threads Reports Net Profit of Rs 262.74 Lakhs for Half-Year with Qualified Auditor Opinion",
            "Summary": "Modern Threads (India) Limited reported net profit of Rs 262.74 lakhs for the half-year ended September 30, 2025, with revenue from operations at Rs 14,753.81 lakhs. The company's auditors issued a qualified opinion citing unprovided interest of Rs 1,065.85 lakhs on cumulative redeemable preference shares and unconfirmed trade balances.",
            "Sentiment": "neutral",
            "PublishDate": 1763123712073,
            "Source": "earnings"
        },
        {
            "Title": "Modern Threads Reports 21.5% Revenue Growth But Net Profit Drops 97% in Q1 Results",
            "Summary": "Modern Threads (India) Limited reported total income of Rs. 7161.39 lakhs for Q1 FY2026, marking a 21.5% increase from Rs. 5893.28 lakhs in the previous year. Revenue from operations grew 20.3% to Rs. 6986.41 lakhs. However, net profit after tax declined significantly to Rs. 0.63 lakhs from Rs. 18.38 lakhs in Q1 FY2025. EBITDA margin contracted to 0.4% from 1.4% year-over-year. Management attributed the strong revenue growth to improving domestic demand in their textile business but noted profitability pressure from elevated input costs. The company is focusing on improving operational efficiencies, enhancing product mix with value-added offerings, implementing cost optimization measures, and exploring new export markets. Management expects revenue growth momentum to continue but remains cautious about margin outlook due to input cost pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1755337768797,
            "Source": "earnings"
        },
        {
            "Title": "Modern Threads (India) Reports Quarterly Results with Auditor Qualifications on Preference Share Dividends",
            "Summary": "Modern Threads (India) Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 6,986.41 lakhs and net profit after tax of Rs 0.63 lakhs, with earnings per share of Rs 0.0018. The auditors issued a qualified conclusion citing two main issues: the company has not provided for interest on cumulative redeemable preference shares amounting to Rs 9.01 lakhs for the quarter (cumulative Rs 1,056.75 lakhs), as it is in the process of settlement of remaining redeemable preference share capital. Additionally, balances of trade payables and receivables are subject to confirmation and consequential adjustments. The company incorporated a wholly owned subsidiary, Modern Woollens UK Ltd, which is yet to commence operations. The Board meeting was held on August 14, 2025, and the results will be available on the company website.",
            "Sentiment": "neutral",
            "PublishDate": 1755171142806,
            "Source": "earnings"
        }
    ]
}