{
    "Symbol": "MOHITIND",
    "ISIN": "INE954E01012",
    "News": [
        {
            "Title": "Mohit Industries Revises Rights Issue Size to Rs. 15 Cr",
            "Summary": "Mohit Industries Limited's Rights Issue Committee has revised the proposed rights issue size downward from Rs. 25 crores to Rs. 15 crores, while maintaining all other terms and conditions unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1770231102138,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mohit Industries Reports Loss and Announces Rs 25 Crore Rights Issue",
            "Summary": "Mohit Industries Limited reported a net loss of Rs 77.92 lakhs for the quarter ended September 30, 2025, and approved a rights issue to raise up to Rs 25 crores through equity shares to existing shareholders. The Board constituted a Rights Issue Committee to determine issue terms including size, price, entitlement ratio, and record date, subject to regulatory approvals.",
            "Sentiment": "negative",
            "PublishDate": 1763112230924,
            "Source": "corporate_action"
        },
        {
            "Title": "Mohit Industries Submits Revised Limited Review Report for Q1 FY2026 Results",
            "Summary": "Mohit Industries Limited submitted a revised Limited Review Report for its consolidated unaudited financial results for the quarter ended June 30, 2025, following a format-related request from BSE Limited. The company reported a standalone net loss of Rs 43.22 lacs compared to Rs 40.32 lacs loss in the same quarter last year. Revenue from operations increased to Rs 3,224.49 lacs from Rs 2,117.56 lacs year-over-year. The consolidated results showed a net loss of Rs 42.83 lacs versus Rs 40.89 lacs in the previous year quarter. The auditor noted a qualification regarding the company's accounting treatment of post-employment benefits, which deviates from Ind AS-19 standards. The company operates primarily in the textile segment and has associate companies including Mohit Overseas Limited (49.25% stake) and Mohit Yams Limited (49.48% stake). All other financial data remains unchanged from the previously submitted results dated August 12, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1758542535280,
            "Source": "earnings"
        },
        {
            "Title": "Mohit Industries Reports Loss in Q1 Results, Revenue Rises to ₹322.4 Crore",
            "Summary": "Mohit Industries Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported a standalone loss of ₹43.22 lacs compared to ₹40.32 lacs loss in the same quarter last year. Revenue from operations increased to ₹3,224.49 lacs from ₹2,117.56 lacs year-over-year. Total expenses rose to ₹3,332.25 lacs from ₹2,171.66 lacs. The consolidated results showed similar performance with a loss of ₹42.83 lacs. The company operates in the textile segment and has two associate companies - Mohit Overseas Limited (49.25% stake) and Mohit Yarns Limited (49.48% stake). Auditors noted a qualification regarding the company's accounting treatment of post-employment benefits, which deviates from Indian Accounting Standards.",
            "Sentiment": "negative",
            "PublishDate": 1754997599705,
            "Source": "earnings"
        }
    ]
}