{
    "Symbol": "MOIL",
    "ISIN": "INE490G01020",
    "News": [
        {
            "Title": "MOIL Attends Systematix India Annual Conference",
            "Summary": "MOIL Limited participated in MANTHAN-Systematix India Annual Conference 2026 in Mumbai on February 09, 2026, with no unpublished price sensitive information shared during the investor meet.",
            "Sentiment": "neutral",
            "PublishDate": 1770736412251,
            "Source": "stocks"
        },
        {
            "Title": "MOIL announces price hike for manganese ore grades",
            "Summary": "MOIL Limited revises prices for different grades of manganese ore for February 2026, with most ferro and chemical grades seeing 5% increase while some grades maintain January pricing.",
            "Sentiment": "positive",
            "PublishDate": 1769955551555,
            "Source": "stocks"
        },
        {
            "Title": "MOIL Gets Ministry Approval for MPSMCL Joint Venture",
            "Summary": "MOIL Limited receives Ministry of Steel approval for joint venture formation with Madhya Pradesh State Mining Corporation Limited for manganese ore mining operations in Madhya Pradesh state.",
            "Sentiment": "positive",
            "PublishDate": 1769866813168,
            "Source": "co_actions_results"
        },
        {
            "Title": "MOIL Q3 FY26 Results: Revenue ₹359.91 Cr, Profit ₹52.92 Cr",
            "Summary": "MOIL Limited reported Q3 FY26 revenue of ₹359.91 crores and net profit of ₹52.92 crores. Board declared second interim dividend of ₹3.53 per share with record date February 5, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769759610428,
            "Source": "co_actions_results"
        },
        {
            "Title": "MOIL Board Meeting Set for January 30 to Review Q3 Results",
            "Summary": "MOIL Limited has scheduled a board meeting on January 30, 2026, to consider Q3FY26 unaudited financial results and declare a second interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768895926756,
            "Source": "co_actions_results"
        },
        {
            "Title": "MOIL Appoints Vishwanath Suresh as Chairman-cum-MD",
            "Summary": "MOIL Limited announces appointment of Shri Vishwanath Suresh as Chairman-cum-Managing Director effective January 07, 2026, with shares closing down 0.97% at ₹376.85 on the appointment day.",
            "Sentiment": "neutral",
            "PublishDate": 1767793795149,
            "Source": "stocks"
        },
        {
            "Title": "MOIL Reports 477,000 Tonnes Manganese Ore Production",
            "Summary": "MOIL Limited achieved manganese ore production of 477,000 tonnes during the third quarter of FY26, demonstrating operational performance in the mining sector.",
            "Sentiment": "neutral",
            "PublishDate": 1767618310595,
            "Source": "stocks"
        },
        {
            "Title": "MOIL Records Best-Ever Q3 & 9-Month Production in FY26",
            "Summary": "MOIL achieved record manganese ore production of 4.77 lakh tonnes in Q3 FY26, up 3.7% YoY. Nine-month production reached 14.21 lakh tonnes, marking 6.8% growth. Stock closed 2.05% lower at ₹367.50.",
            "Sentiment": "positive",
            "PublishDate": 1767618280391,
            "Source": "co_actions_results"
        },
        {
            "Title": "MOIL revises manganese ore prices for January 2025",
            "Summary": "MOIL Ltd. announced revised pricing for various manganese ore grades and products effective January 1, 2025, with ferro grades increased by 3% and SMGR fines up 5%, while some lower-grade products saw reductions.",
            "Sentiment": "neutral",
            "PublishDate": 1767322329070,
            "Source": "stocks"
        },
        {
            "Title": "MOIL revises manganese ore prices for January 2026",
            "Summary": "MOIL Limited announces price revisions for manganese ore grades effective January 2026, with ferro grades increased by 3% and metal mandi fines up 10%, while some SMGR grades see reductions.",
            "Sentiment": "neutral",
            "PublishDate": 1767264071945,
            "Source": "stocks"
        },
        {
            "Title": "MOIL CMD Ajit Kumar Saxena Retires on Superannuation",
            "Summary": "MOIL Limited announces cessation of Chairman-cum-Managing Director Ajit Kumar Saxena due to superannuation effective January 1, 2026, following his retirement on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767246812876,
            "Source": "stocks"
        },
        {
            "Title": "MOIL Achieves Best-Ever November Production and Sales Performance",
            "Summary": "MOIL Limited recorded its highest-ever November performance with 1.65 lakh metric tonnes of manganese ore production (1% YoY growth) and 1.37 lakh metric tonnes in sales (3% YoY growth). The company's cumulative production for April-November 2025-26 reached 12.69 lakh metric tonnes, marking an 8% increase over the same period of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1764746324274,
            "Source": "stock"
        },
        {
            "Title": "Moil Increases Prices for Ferro and Chemical Grades by 3%",
            "Summary": "Moil has raised prices by 3% for ferro grades with manganese content of 44% and above, along with all chemical grades. The price increase affects the company's key product categories in the manganese ore business.",
            "Sentiment": "positive",
            "PublishDate": 1764633532823,
            "Source": "stock"
        },
        {
            "Title": "MOIL Limited Faces Rs 190.31 Lakh Tax Demand After Appeals Commissioner Upholds Service Tax Order",
            "Summary": "MOIL Limited received an order from Commissioner (Appeals), CGST Central Excise, Bhopal upholding a service tax demand of Rs 55.67 lakhs plus interest and penalty on royalty, DMF and NMET for manganese ore consumed at Ferro Manganese Plant, Balaghat. The total amount due stands at Rs 190.31 lakhs with Rs 4.18 lakhs pre-deposited, and the company plans to file further appeals against the order.",
            "Sentiment": "negative",
            "PublishDate": 1763729403878,
            "Source": "stock"
        },
        {
            "Title": "MOIL Limited Promotes Manoj Kumar to General Manager (Mines)",
            "Summary": "MOIL Limited announced the promotion of Manoj Kumar to General Manager (Mines) position effective November 15, 2025, as per the company's service rules. The appointment represents a senior management change at the government enterprise, with Kumar bringing qualifications in mining engineering, MBA in HR & Marketing, and M.Tech in Mining.",
            "Sentiment": "positive",
            "PublishDate": 1763204720315,
            "Source": "corporate_governance"
        },
        {
            "Title": "MOIL Limited Reports 15% Revenue Growth and Declares Rs 1.80 Interim Dividend",
            "Summary": "MOIL Limited reported revenue from operations of Rs 696.11 crores for the half year ended September 30, 2025, compared to Rs 784.73 crores in the previous year. Net profit for the half year reached Rs 121.94 crores versus Rs 202.31 crores last year. The company's Board of Directors approved an interim dividend of Rs 1.80 per equity share of face value Rs 10 each for the financial year ending March 31, 2025. The record date for dividend payment is November 15, 2025, with payment scheduled for December 9, 2025. The mining products segment generated Rs 651.45 crores in revenue during the half year, while manufactured products contributed Rs 50.33 crores and power segment added Rs 11.62 crores. Total assets stood at Rs 3,303.86 crores as of September 30, 2025. The company resolved all 3 investor complaints received during the quarter and has no pending complaints.",
            "Sentiment": "neutral",
            "PublishDate": 1762849357151,
            "Source": "earnings"
        },
        {
            "Title": "MOIL Reports Strong Q2 Performance with 41% Jump in Net Profit and Declares Rs 1.8 Dividend",
            "Summary": "MOIL declared a dividend of Rs 1.8 per share. The company reported Q2 EBITDA of Rs 995 million compared to Rs 792 million year-over-year, representing a 25.6% increase. EBITDA margin improved to 28.59% from 27.1% in the same period last year. Q2 standalone net profit surged to Rs 704 million from Rs 500 million year-over-year, marking a 40.8% growth.",
            "Sentiment": "positive",
            "PublishDate": 1762848834127,
            "Source": "corporate_action"
        },
        {
            "Title": "MOIL Achieves Record October Manganese Ore Production of 1.60 Lakh Tonnes",
            "Summary": "MOIL reported record manganese ore production of 1.60 lakh tonnes in October, representing a 9.1% increase year-over-year. For the first seven months of FY'26, the company's production reached 11.04 lakh tonnes, marking an 8.5% year-over-year rise. The company also achieved its highest core drilling performance at 57,275 meters.",
            "Sentiment": "positive",
            "PublishDate": 1762255125522,
            "Source": "stock"
        },
        {
            "Title": "MOIL Reports Record September Production and 10.3% Q2 Growth",
            "Summary": "MOIL Limited achieved record-breaking operational performance in September 2025 and Q2 FY'26. The company registered its best-ever September production of 1.52 lakh tonnes, marking a 3.8% growth compared to September 2024. Exploratory core drilling reached 5,314 meters in September, showing significant growth of 46%. For Q2 FY'26, MOIL delivered its best-ever quarterly production of 4.42 lakh tonnes, up 10.3% year-over-year. Sales increased to 3.53 lakh tonnes, achieving 18.6% growth. Q2 exploratory core drilling reached 21,035 meters, growing 4.1% compared to the same period last year. CMD Ajit Kumar Saxena highlighted the company's commitment to operational excellence and long-term sustainability, emphasizing continued exploration efforts to maintain leadership in the manganese sector.",
            "Sentiment": "positive",
            "PublishDate": 1759497309559,
            "Source": "stock"
        },
        {
            "Title": "MOIL Limited Promotes Two Senior Executives to General Manager Positions",
            "Summary": "MOIL Limited announced the promotion of two senior executives to General Manager positions. Shri Vikashranjan Parida was appointed as General Manager (Technical) and Shri Rajesh Bhattacharya as General Manager (Production & Diversification), both effective from 01.07.2025. Parida holds qualifications including B.E.(Mining), 1st Class MMCC, and MBA-HR, while Bhattacharya has B.E.(M.M), 1st Class MMCC, and MBA. Both promotions were made as per MOIL's service rules. The company communicated these senior management changes to stock exchanges on 03.10.2025.",
            "Sentiment": "positive",
            "PublishDate": 1759477004485,
            "Source": "corporate_governance"
        },
        {
            "Title": "MOIL Ltd Announces Mixed Manganese Ore Price Changes Effective October 1, 2025",
            "Summary": "MOIL Ltd has announced price adjustments for its manganese ore products starting October 1, 2025. Ferro Grade prices will increase by 6.4%, while SMGR and Fines Grades will see a 5.2% price rise. In contrast, EMD Basic prices will decrease by ₹10,000 per metric ton. The price changes reflect a mixed approach across different manganese ore product categories.",
            "Sentiment": "neutral",
            "PublishDate": 1759311078985,
            "Source": "stock"
        },
        {
            "Title": "MOIL Commences Manganese Ore Exports as State Trading Enterprise",
            "Summary": "MOIL Limited has started exporting manganese ore as a State Trading Enterprise (STE) after being appointed by the Government of India for this role. The company dispatched its first shipment of 54,600 tonnes of manganese ore fines from Visakhapatnam to Indonesia on August 22, 2025. MOIL established the export mechanism in FY'24-25 following Trade Policy requirements that route all manganese ore exports from India through the company. The STE designation covers manganese ore below 46% Mn grade, with MOIL exporting low-grade ore (25% Mn) through back-to-back arrangements with domestic suppliers. The initiative addresses India's surplus of low-grade manganese ore fines that exceed domestic demand, aiming to enhance India's global presence and boost foreign earnings. CMD Ajit Kumar Saxena congratulated the team on this milestone achievement.",
            "Sentiment": "positive",
            "PublishDate": 1758115669312,
            "Source": "stock"
        },
        {
            "Title": "MOIL Reports Record August Production Growth of 17% Year-over-Year",
            "Summary": "MOIL achieved record production levels in August with a 17% year-over-year increase. The company's sales also showed strong performance, surging 25.6% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1756827321569,
            "Source": "stock"
        },
        {
            "Title": "MOIL Reports Manganese Ore Production of 1.45 Lakh Tonnes in July 2025, Up 11.4%",
            "Summary": "MOIL achieved manganese ore production of 1.45 lakh tonnes in July 2025, representing a growth of 11.4%. The production figures indicate operational expansion for the manganese ore mining company.",
            "Sentiment": "positive",
            "PublishDate": 1754480908959,
            "Source": "stock"
        },
        {
            "Title": "MOIL Reports Record July Production Despite Weather Challenges",
            "Summary": "MOIL Limited achieved its highest-ever July production of 1.45 lakh tonnes of manganese ore in July 2025, representing 11.4% growth compared to the same period last year, despite adverse weather conditions. For the April-July 2025 period, the company recorded production of 6.47 lakh tonnes (7.8% year-on-year growth), sales of 5.01 lakh tonnes (10.7% higher than previous year), and exploratory drilling of 43,215 meters (11.4% increase). The company maintained strong operational momentum throughout the period despite heavy rainfall challenges.",
            "Sentiment": "positive",
            "PublishDate": 1754231682662,
            "Source": "stock"
        },
        {
            "Title": "MOIL Increases Ferro Grade Manganese Ore Prices by 3%",
            "Summary": "MOIL has announced a 3% price increase across all ferro grades of manganese ore. This pricing adjustment affects the company's entire ferro grade manganese ore product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1754035214769,
            "Source": "stock"
        },
        {
            "Title": "MOIL Reports Significant Decline in Q1 Financial Performance",
            "Summary": "MOIL reported Q1 revenue of 3.4 billion rupees, down from 4.9 billion rupees in the same period last year. The company's EBITDA fell to 788 million rupees compared to 2.1 billion rupees year-over-year, with EBITDA margin declining to 22.64% from 43.36%. Net profit also decreased substantially to 515 million rupees from 1.5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753865986430,
            "Source": "earnings"
        },
        {
            "Title": "Government Plans Stake Sale in MOIL With Up To 10% Dilution",
            "Summary": "The government plans a controlled stake sale in MOIL as part of efforts to unlock value in Central Public Sector Enterprises (CPSE). The divestment aims for up to 10% dilution of government holdings in the mining company.",
            "Sentiment": "neutral",
            "PublishDate": 1753431314977,
            "Source": "stock"
        },
        {
            "Title": "MOIL Achieves Record Q1 Performance in Exploratory Drilling and Production",
            "Summary": "MOIL has reported significant achievements in its Q1 performance. The company achieved a record exploratory core drilling of 34,900 meters, which is a 16.2% increase compared to the same period last year. Additionally, MOIL reported record production of 5.02 lakh tonnes in Q1.",
            "Sentiment": "positive",
            "PublishDate": 1751520029000,
            "Source": "default"
        },
        {
            "Title": "MOIL Increases Manganese Ore Prices Across Grades",
            "Summary": "MOIL has announced price increases for its manganese ore products. All ferro grades of manganese ore with manganese content of 44% and above, as well as those below 44%, have been increased by 2%. Additionally, the prices of all chemical grades have also been raised by 2%.",
            "Sentiment": "positive",
            "PublishDate": 1751415238000,
            "Source": "default"
        },
        {
            "Title": "MOIL Ltd: Manganese Ore Prices Increased by 2%",
            "Summary": "MOIL Ltd, India's largest manganese ore producer, has raised prices by 2% for ferro grades manganese ore (below 44%, at 44%, and above 44% manganese content) and all chemical grades, effective July 1. Prices for silico manganese grades remain unchanged.",
            "Sentiment": "positive",
            "PublishDate": 1751378169000,
            "Source": "corporate_action"
        },
        {
            "Title": "MOIL Announces 2% Price Increase for Chemical Grades",
            "Summary": "MOIL has announced a 2% price increase for all its chemical grade products. The company has not provided any additional details or context for this price hike in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751373406000,
            "Source": "default"
        },
        {
            "Title": "MOIL Announces Price Increase for Manganese Ore",
            "Summary": "MOIL has announced a 2% price increase for all ferro grades of manganese ore. The price hike applies to manganese ore with manganese content below 44% as well as ore with 44% manganese content and higher.",
            "Sentiment": "positive",
            "PublishDate": 1751373356000,
            "Source": "default"
        },
        {
            "Title": "MOIL Reports Increase in Exploratory Drilling and Manganese Ore Production",
            "Summary": "MOIL has reported a 17.5% increase in exploratory core drilling, reaching 13,352 meters compared to the same period last year. Additionally, the company achieved manganese ore production of 1.71 lakh tonnes in May 2025, representing an 18% growth.",
            "Sentiment": "positive",
            "PublishDate": 1748942857000,
            "Source": "default"
        },
        {
            "Title": "MOIL Decreases Prices of High-Grade Manganese Ore",
            "Summary": "MOIL has announced a 5% price reduction for all ferro grades of manganese ore with manganese content of 44% and above.",
            "Sentiment": "negative",
            "PublishDate": 1748835033000,
            "Source": "default"
        },
        {
            "Title": "MOIL Revises Manganese Ore Prices for May",
            "Summary": "MOIL has announced price adjustments for various grades of manganese ore and other products. Ferro grades of manganese ore with manganese content below 44% have seen a 10% price decrease for May. Similarly, ferro grades with 44% manganese content have experienced a 5% price reduction.",
            "Sentiment": "neutral",
            "PublishDate": 1746144521000,
            "Source": "default"
        },
        {
            "Title": "MOIL Revises Manganese Ore Prices for May",
            "Summary": "MOIL has announced price adjustments for various grades of manganese ore and other products. Ferro grades of manganese ore with manganese content below 44% have seen a 10% price decrease for May. Additionally, ferro grades with 44% manganese content have experienced a 5% price reduction.",
            "Sentiment": "negative",
            "PublishDate": 1746109043000,
            "Source": "default"
        },
        {
            "Title": "MOIL Ltd: Q4 Profit Jumps 27%, Declares Dividend",
            "Summary": "MOIL Ltd reported a 27% YoY increase in Q4 consolidated net profit to ₹115.7 crore. Revenue rose 4.2% to ₹433.4 crore. EBITDA grew 8.7% to ₹139.4 crore with margin expansion. The board recommended a final dividend of ₹1.61 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1746023382000,
            "Source": "earnings"
        },
        {
            "Title": "MOIL Reports Q4 Results and Dividend Announcement",
            "Summary": "MOIL has announced its Q4 financial results and a dividend recommendation. The company's Q4 net profit increased to 1.15 billion rupees from 911.5 million rupees year-over-year. Revenue rose to 4.3 billion rupees from 4.16 billion rupees. EBITDA improved to 1.39 billion rupees with a margin of 32.19%. Additionally, MOIL recommended a dividend of 1.61 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746021191000,
            "Source": "result"
        },
        {
            "Title": "MOIL Reports Significant Production and Exploration Increases",
            "Summary": "MOIL has announced a substantial increase in its ferro manganese production, reaching 12,000 MT, which represents an 18% year-over-year growth. Additionally, the company achieved a record in exploratory core drilling, completing 107,530 meters, marking a 22% increase compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1743596764000,
            "Source": "result"
        },
        {
            "Title": "MOIL Achieves Record Manganese Ore Production and Sales",
            "Summary": "MOIL has reported significant achievements in its operations, with manganese ore production reaching a record 18.02 lakh tonnes, marking a 2.7% year-over-year increase. Additionally, the company's manganese ore sales hit a record 15.87 lakh tonnes, representing a 3.3% growth compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1743596756000,
            "Source": "result"
        },
        {
            "Title": "MOIL Increases Prices of Manganese Ore",
            "Summary": "MOIL has announced a price increase for its manganese ore products. Ferro grades of manganese ore with 44% or higher manganese content will see a 3% price increase. Manganese ore grades with less than 44% manganese content will have a smaller price increase of 0.5%.",
            "Sentiment": "positive",
            "PublishDate": 1743516952000,
            "Source": "corporate_action"
        },
        {
            "Title": "MOIL Increases Prices of Chemical Grade Products",
            "Summary": "MOIL (Manganese Ore India Limited) has announced a price increase of 6.5% for all its chemical grade products.",
            "Sentiment": "positive",
            "PublishDate": 1740809427000,
            "Source": "corporate_action"
        },
        {
            "Title": "MOIL Increases Prices of Ferro Grade Manganese Ore",
            "Summary": "MOIL (Manganese Ore India Limited) has announced a price increase for certain grades of manganese ore. Specifically, the company has raised prices by 6.5% for all ferro grades of manganese ore with manganese content below 44%.",
            "Sentiment": "positive",
            "PublishDate": 1740809294000,
            "Source": "corporate_action"
        },
        {
            "Title": "MOIL Increases Prices of High-Grade Manganese Ore",
            "Summary": "MOIL has announced a 10% price increase for all ferro grades of manganese ore with manganese content of 44% and above.",
            "Sentiment": "positive",
            "PublishDate": 1740809134000,
            "Source": "corporate_action"
        },
        {
            "Title": "MOIL Declares Interim Dividend of Rs 4.02 Per Share",
            "Summary": "MOIL (Manganese Ore India Limited) has announced an interim dividend of Rs 4.02 per share for its shareholders. This corporate action represents a distribution of profits to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1739283469000,
            "Source": "corporate_action"
        },
        {
            "Title": "MOIL Reports Mixed Q3 Financial Results",
            "Summary": "MOIL, a mining company, has reported its Q3 financial results. The company's EBITDA increased to 952 million rupees from 894.4 million rupees in the same quarter last year, showing a year-over-year growth. However, the EBITDA margin decreased to 25.94% from 29.20% in the corresponding period last year, indicating a decline in profitability ratio.",
            "Sentiment": "neutral",
            "PublishDate": 1739283462000,
            "Source": "earnings"
        },
        {
            "Title": "MOIL Reports Increased Q3 Profit and Revenue",
            "Summary": "MOIL, a mining company, has announced its financial results for the third quarter. The company's net profit rose to 637 million rupees from 541 million rupees in the same period last year. Revenue also increased to 3.67 billion rupees from 3.06 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739283457000,
            "Source": "earnings"
        },
        {
            "Title": "MOIL Increases Prices of High-Grade Manganese Ore",
            "Summary": "MOIL has announced a price increase of 3.5% for all ferro grades of manganese ore with manganese content of 44% and above.",
            "Sentiment": "positive",
            "PublishDate": 1738551272000,
            "Source": "corporate_action"
        },
        {
            "Title": "MOIL Increases Prices for Ferro Grade Manganese Ore",
            "Summary": "MOIL has announced a price increase of 8.2% for all ferro grades of manganese ore with manganese content below 44%. This price adjustment affects a specific category of manganese ore products offered by the company.",
            "Sentiment": "positive",
            "PublishDate": 1738551258000,
            "Source": "corporate_action"
        }
    ]
}