{
    "Symbol": "MOL",
    "ISIN": "INE0CT101020",
    "News": [
        {
            "Title": "Meghmani Organics Q3 FY26 Results Show Mixed Performance",
            "Summary": "Meghmani Organics reported Q3 FY26 standalone revenue of Rs. 485 crores with EBITDA of Rs. 51 crores. Crop Protection segment maintained strong margins at 15.3% while Titanium Dioxide operations were shut down due to market pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1770482739706,
            "Source": "co_actions_results"
        },
        {
            "Title": "Meghmani Organics Q3FY26 Results Show Mixed Performance",
            "Summary": "Meghmani Organics reported standalone net profit of ₹2,229.76 lakhs for Q3FY26, while consolidated results showed a net loss of ₹352.83 lakhs. Revenue from operations declined to ₹48,493.62 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1769849698759,
            "Source": "co_actions_results"
        },
        {
            "Title": "Meghmani Organics signs 3.30 MW renewable energy deal",
            "Summary": "Meghmani Organics Limited executed renewable energy supply agreement with Pro-Zeal Green Power Fifteen Private Limited for 3.30 MW Wind-Solar Hybrid Power project in Gujarat, investing ₹3.63 crores for 26% stake.",
            "Sentiment": "positive",
            "PublishDate": 1768286229297,
            "Source": "co_actions_results"
        },
        {
            "Title": "Meghmani Organics Invests ₹3.63 Cr in Hybrid Power",
            "Summary": "Meghmani Organics announces ₹3.63 crore investment for 26% stake in Pro-Zeal Green Power's 3.30 MW wind-solar hybrid project, with completion expected in 6-9 months.",
            "Sentiment": "positive",
            "PublishDate": 1768285928659,
            "Source": "stocks"
        },
        {
            "Title": "Meghmani Organics Establishes New Subsidiary in Brazil",
            "Summary": "Meghmani Organics has formed a new subsidiary company in Brazil. This expansion move affects the company's international operations and market presence in the South American region.",
            "Sentiment": "positive",
            "PublishDate": 1763559921855,
            "Source": "corporate_action"
        },
        {
            "Title": "Meghmani Organics Q2FY26 Results: Crop Protection Drives Growth Despite Titanium Dioxide Losses",
            "Summary": "Meghmani Organics reported Q2FY26 standalone revenue of INR 558 crores with EBITDA of INR 70 crores, up 5% and 71% year-on-year respectively, driven by improved product mix in crop protection segment which achieved 17% EBITDA margins. The company continues facing challenges in Titanium Dioxide segment due to Chinese dumping and rising raw material costs, with management working on strategies to reduce losses while maintaining bullish outlook on crop nutrition segment for future growth.",
            "Sentiment": "neutral",
            "PublishDate": 1763380148310,
            "Source": "earnings"
        },
        {
            "Title": "Meghmani Organics Reports Strong Q2 Turnaround with 115.5 Million Rupees Net Profit",
            "Summary": "Meghmani Organics delivered a significant turnaround in its Q2 performance, posting a consolidated net profit of 115.5 million rupees compared to a loss of 92.6 million rupees in the same period last year. The company's revenue grew to 5.72 billion rupees from 5.44 billion rupees year-over-year. EBITDA increased substantially to 520.9 million rupees from 305.6 million rupees, while EBITDA margin improved to 9.02% from 5.62% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762733566691,
            "Source": "earnings"
        },
        {
            "Title": "Meghmani Organics Reports Strong Q2 Performance with 94% Jump in Net Profit",
            "Summary": "Meghmani Organics Limited reported net profit of Rs 4,292.33 lakhs for the quarter ended September 30, 2025, compared to Rs 2,214.77 lakhs in the previous quarter. Revenue from operations increased to Rs 55,766.28 lakhs from Rs 53,262.57 lakhs in the corresponding quarter last year. For the half-year period, net profit reached Rs 6,342.98 lakhs versus Rs 227.02 lakhs in the previous year. The company operates in two main segments - Pigments and Agrochemicals, with Agrochemicals contributing Rs 44,263.96 lakhs and Pigments Rs 11,602.32 lakhs in quarterly revenue. The Board of Directors approved these unaudited financial results in their meeting held on November 8, 2025. On consolidated basis, the company reported net profit of Rs 4,485.32 lakhs for the quarter and Rs 2,423.88 lakhs for the half-year.",
            "Sentiment": "positive",
            "PublishDate": 1762589231948,
            "Source": "earnings"
        },
        {
            "Title": "Meghmani Organics Schedules Q2FY26 Earnings Call for November 12, 2025",
            "Summary": "Meghmani Organics Limited has scheduled its Q2FY26 earnings call for Wednesday, November 12, 2025 at 3:00 PM IST. The call will be hosted by Arihant Capital Markets Ltd and will feature Chairman and Managing Director Ankit Patel, Chief Financial Officer Gurjant Singh Chahal, and Investor Relations representative Nishant Vyas. The company has informed stock exchanges NSE and BSE about the scheduled earnings discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1762246868250,
            "Source": "earnings"
        },
        {
            "Title": "Meghmani Organics Reports Strong Q1 FY26 Results with 44% Revenue Growth and Six-Fold EBITDA Jump",
            "Summary": "Meghmani Organics Limited delivered robust quarterly results with standalone revenue growing 44% year-on-year to INR 593 crores and EBITDA increasing nearly six-fold to approximately INR 81 crores from INR 14 crores in the corresponding quarter previous year. The company reported profit after tax of INR 40 crores against a loss of INR 6.3 crores in the same quarter last year. Crop protection segment constituted 77% of total revenue at INR 458 crores, up 68% year-on-year, while pigment segment contributed 23% with revenue of INR 135 crores. The crop protection segment achieved 17.3% EBITDA margin with production of 10,600 metric tons and 78% capacity utilization. Management attributed the strong performance to improved product mix, stabilizing raw material prices, and improving demand as global channel inventory reached reasonable levels. The company repaid approximately INR 38 crores of debt during the quarter and expects continued double-digit growth trajectory over the next three years, driven by new product registrations across multiple international markets including Brazil, US, and Argentina.",
            "Sentiment": "positive",
            "PublishDate": 1754313990279,
            "Source": "earnings"
        },
        {
            "Title": "Meghmani Organics Plans Multi-Segment Expansion Across Agrochemicals, Pigments, and TiO₂",
            "Summary": "Meghmani Organics is pursuing a growth strategy involving capital expenditure across multiple business segments including agrochemicals, pigments, and titanium dioxide (TiO₂). The company's expansion plans focus on global scale operations, margin-enhancing projects, and import substitution initiatives across these three key segments.",
            "Sentiment": "positive",
            "PublishDate": 1753887941446,
            "Source": "stock"
        },
        {
            "Title": "Meghmani Organics Reports Strong Q1 Turnaround with 47% Revenue Growth",
            "Summary": "Meghmani Organics delivered strong quarterly results with revenue rising to 6.1 billion rupees from 4.14 billion rupees year-over-year. The company turned profitable with a consolidated net profit of 127 million rupees compared to a loss of 168 million rupees in the same period last year. EBITDA surged to 669 million rupees from 59 million rupees, while EBITDA margin expanded significantly to 10.9% from 1.42% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753863510981,
            "Source": "earnings"
        },
        {
            "Title": "Meghmani Organics Schedules Q1 FY26 Earnings Call for July 31, 2025",
            "Summary": "Meghmani Organics Limited has scheduled an earnings call for July 31, 2025, at 11:00 AM IST to discuss Q1 FY26 financial results. The call will be represented by Chairman and Managing Director Ankit Patel, Chief Financial Officer Gurjant Singh Chahal, and Investor Relations representative Nishant Vyas. Arihant Capital Markets Ltd is facilitating the conference call, which will include both domestic and international dial-in options for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753437954872,
            "Source": "earnings"
        },
        {
            "Title": "Meghmani Organics Forecasts Strong Growth in Crop Protection Segment",
            "Summary": "Meghmani Organics expects a margin of 15% to 16% for its crop protection segment in the current financial year. The company also anticipates achieving a top line of Rs 1,000 crore from its new multipurpose plant by FY '27 or '28, as revealed in a recent concall update.",
            "Sentiment": "positive",
            "PublishDate": 1747106769000,
            "Source": "default"
        },
        {
            "Title": "India Imposes Anti-Dumping Duty on Chinese Titanium Dioxide",
            "Summary": "The Indian government has imposed a five-year anti-dumping duty on titanium dioxide imports from China. This measure aims to protect the domestic industry, including companies like Meghmani Organics, from injury caused by dumped goods. The duty is expected to level the playing field for Indian manufacturers in the titanium dioxide market.",
            "Sentiment": "positive",
            "PublishDate": 1747021394000,
            "Source": "default"
        },
        {
            "Title": "Meghmani Organics Reports Q4 Profit Amid Revenue Growth",
            "Summary": "Meghmani Organics reported a consolidated net profit of 198 million rupees in Q4, compared to a loss of 180 million rupees in the same quarter last year. However, it's a decrease from the previous quarter's loss of 44 million rupees. The company's revenue increased to 5.5 billion rupees from 4.1 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747008676000,
            "Source": "default"
        },
        {
            "Title": "Meghmani Organics Reports Significant Q4 EBITDA Growth",
            "Summary": "Meghmani Organics announced its Q4 financial results, showing a substantial year-over-year increase in EBITDA from 20 million rupees to 655 million rupees. The company's EBITDA margin also improved significantly, rising from 0.49% to 11.83% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746871730000,
            "Source": "result"
        },
        {
            "Title": "Meghmani Organics Reports Q4 Profit Amid Revenue Growth",
            "Summary": "Meghmani Organics reported a consolidated net profit of 198 million rupees in Q4, compared to a loss of 180 million rupees in the same quarter last year. However, it's a decrease from the previous quarter's loss of 44 million rupees. The company's revenue increased to 5.5 billion rupees from 4.1 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746871474000,
            "Source": "result"
        },
        {
            "Title": "Meghmani Organics to Consider Q4 Results on May 10",
            "Summary": "Meghmani Organics has announced that it will consider its fourth quarter (Q4) financial results on May 10. This indicates the company is preparing to release its latest earnings report, which will provide insight into its financial performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746020945000,
            "Source": "default"
        },
        {
            "Title": "Meghmani Organics Reports Q2 Financial Results",
            "Summary": "Meghmani Organics Limited has reported its Q2 financial results. The company's consolidated net loss has reduced to 92 million rupees, compared to a loss of 153 million rupees in the same quarter last year. However, this represents an increased loss from the previous quarter's 167 million rupees. Revenue for Q2 has significantly improved to 5.43 billion rupees, up from 3.78 million rupees year-over-year and 4.13 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730075011000,
            "Source": "result"
        }
    ]
}