{
    "Symbol": "MOLDTECH",
    "ISIN": "INE835B01035",
    "News": [
        {
            "Title": "Mold-Tek Q3 FY26 Revenue Jumps 56.75% to ₹52.67 Cr",
            "Summary": "Mold-Tek Technologies reports strong Q3 FY26 results with consolidated revenue rising 56.75% YoY to ₹5,266.70 lakhs and PAT surging 617.54% to ₹388.85 lakhs, driven by improved US project execution.",
            "Sentiment": "positive",
            "PublishDate": 1770887316138,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mold-Tek Technologies Acquires US-Based Beryl Project Engineering for $2.7 Million",
            "Summary": "Mold-Tek Technologies acquired Beryl Project Engineering, a 40-member Florida-based company with $5.6 million revenue and $0.5 million profit, for $2.7 million to expand into residential building permits and approvals services. The acquisition adds residential activities to Mold-Tek's existing commercial and industrial building services, with consolidation starting November 1 and expected Q3 contribution from the new entity.",
            "Sentiment": "positive",
            "PublishDate": 1763464974048,
            "Source": "stock"
        },
        {
            "Title": "Mold-Tek Technologies Reports Strong Q2 Recovery with 20.85% Revenue Growth and 372% PAT Jump",
            "Summary": "Mold-Tek Technologies delivered consolidated revenue of ₹4,023.10 lakhs in Q2 FY25-26, up 20.85% from Q1, with profit after tax surging 372.49% to ₹323.52 lakhs driven by improved U.S. project execution and operational efficiency gains. The company also granted 6,00,000 employee stock options at ₹160 per option and completed acquisition of Florida-based Beryl Project Engineering LLC through its U.S. subsidiary, expected to contribute around USD 7 million in revenues for FY26-27.",
            "Sentiment": "negative",
            "PublishDate": 1763112180462,
            "Source": "earnings"
        },
        {
            "Title": "Mold-Tek Technologies Acquires 100% Stake in Florida-Based Beryl Project Engineering LLC",
            "Summary": "Mold-Tek Technologies Limited has executed an Equity Purchase Agreement through its wholly-owned subsidiary Beryl Engineering Inc. to acquire 100% stake in Beryl Project Engineering LLC. The agreement was signed on October 31, 2025. Beryl Project Engineering LLC is a Florida-based engineering services company with annual revenue of around USD 5.6 million and approximately 40 employees. The company specializes in structural engineering and design for residential, commercial and renovation projects, and offers property inspections, reserve studies, structural integrity assessments, expert witness services, permit certifications, and wind mitigation services. The acquisition aims to expand Mold-Tek's presence in the U.S. residential and engineering markets, optimize project delivery costs through utilization of Mold-Tek India's design and drafting teams, and enable cross-leveraging of technical capabilities. Upon completion, Beryl Project Engineering LLC will become a wholly-owned subsidiary of Beryl Engineering Inc. and step-down subsidiary of Mold-Tek Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1762006462030,
            "Source": "order&deals"
        },
        {
            "Title": "Mold-Tek Technologies Completes Investment in Beryl Engineering Inc., Making it Wholly-Owned Subsidiary",
            "Summary": "Mold-Tek Technologies Limited has completed its investment in Beryl Engineering Inc. by subscribing to 10,000 shares of USD 10 each and has received the share certificate. Following this investment completion, Beryl Engineering Inc. has become a wholly-owned subsidiary of Mold-Tek Technologies. The company had previously disclosed details about this investment on October 16, 2025, and has now informed stock exchanges BSE and NSE about the completion of the transaction.",
            "Sentiment": "positive",
            "PublishDate": 1762003163788,
            "Source": "corporate_action"
        },
        {
            "Title": "Mold-Tek Technologies to Acquire 100% Stake in Beryl Engineering Inc. for USD 100,000",
            "Summary": "Mold-Tek Technologies Limited's Board approved an investment of up to USD 100,000 to acquire 100% equity in Beryl Engineering Inc., a newly incorporated engineering services company in Florida, USA. The acquisition will make Beryl Engineering a wholly-owned subsidiary. The Board also approved providing a loan of up to USD 4 million to Beryl Engineering for strategic expansions and working capital requirements. Beryl Engineering was incorporated on October 9, 2025, and has not yet commenced operations. The share allotment is expected to be completed by Q3 of FY 2025-26. The investment will be made through cash consideration via subscription to equity shares at par value in one or more tranches. This acquisition represents Mold-Tek's strategic expansion into global engineering services.",
            "Sentiment": "positive",
            "PublishDate": 1760604834780,
            "Source": "order&deals"
        },
        {
            "Title": "Mold-Tek Technologies Publishes Q1 FY2026 Financial Results in Newspapers",
            "Summary": "Mold-Tek Technologies Limited published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The results were published in Financial Express (English) and Nava Telangana (Telugu) newspapers on August 8, 2024, in compliance with SEBI listing regulations. The company has also uploaded these advertisements on its website at www.moldtekengineering.com. The publication was communicated to both NSE and BSE exchanges by Chairman & Managing Director J. Lakshmana Rao.",
            "Sentiment": "neutral",
            "PublishDate": 1754639183427,
            "Source": "earnings"
        },
        {
            "Title": "Mold-Tek Technologies Reports Q1 FY26 Turnaround with ₹68.47 Lakhs PAT, Recommends ₹1 Final Dividend",
            "Summary": "Mold-Tek Technologies Limited reported consolidated revenue of ₹3,329.12 lakhs for Q1 FY2025-26, up 11.43% from the previous quarter. The company turned profitable with a PAT of ₹68.47 lakhs compared to a loss of ₹156.05 lakhs in Q4 FY2024-25. However, revenue declined 15.27% year-over-year from ₹3,928.88 lakhs in Q1 FY2024-25. The Board recommended a final dividend of ₹1.00 per equity share for FY2024-25, subject to shareholder approval. The company appointed Mr. Prateek Kumar Tiwari as Company Secretary and Compliance Officer effective August 8, 2025, and recommended Mr. Ashish Kumar Gaggar as Secretarial Auditor for five years. Management cited prolonged stagnation in the U.S. construction sector due to political uncertainties as impacting revenues compared to the previous year, while expressing optimism about recovery signs and order volume buildup.",
            "Sentiment": "positive",
            "PublishDate": 1754560552254,
            "Source": "corporate_action"
        },
        {
            "Title": "Mold-Tek Technologies Company Secretary Thakur Vikram Singh Resigns",
            "Summary": "Mold-Tek Technologies Limited announced that Mr. Thakur Vikram Singh has resigned from his position as Company Secretary and Compliance Officer, effective July 31, 2025. Singh cited personal commitments and desire to explore new professional avenues as reasons for his departure, confirming there are no other material reasons for his resignation. He will also cease to be a Key Managerial Personnel under the Companies Act, 2013. The company has notified BSE and NSE about this change in compliance with listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753970114550,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mold-Tek Technologies Forms MoU with Affordable Robotic & Automation",
            "Summary": "Mold-Tek Technologies Ltd has entered into a Memorandum of Understanding (MoU) with Affordable Robotic & Automation. The purpose of this partnership is to offer engineering design and automation services.",
            "Sentiment": "positive",
            "PublishDate": 1749721785000,
            "Source": "default"
        },
        {
            "Title": "Mold-Tek Technologies Reports Q4 Net Loss",
            "Summary": "Mold-Tek Technologies reported a consolidated net loss of 16 million rupees in Q4, compared to a profit of 64.2 million rupees in the same quarter last year. However, it showed a profit of 5 million rupees compared to the previous quarter. The company's Q4 revenue decreased to 299 million rupees from 422.4 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748530748000,
            "Source": "result"
        },
        {
            "Title": "Mold-Tek Technologies Signs MOU with Interarch Building Solutions for Pre-Engineered Metal Building Projects",
            "Summary": "Mold-Tek Technologies has entered into a Memorandum of Understanding (MOU) with Interarch Building Solutions. The agreement focuses on collaboration for pre-engineered metal building projects. As part of the deal, Interarch will pay Mold-Tek Technologies a 5% commission on export orders.",
            "Sentiment": "positive",
            "PublishDate": 1743493496000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mold-Tek Technologies Reports Q2 Financial Results",
            "Summary": "Mold-Tek Technologies has released its Q2 financial results. The company's EBITDA for Q2 is 123 million rupees, compared to 124 million rupees in the same quarter last year. The EBITDA margin for Q2 is 28.64%, down from 30.89% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730975617000,
            "Source": "result"
        },
        {
            "Title": "Mold-Tek Technologies Reports Q2 Revenue Growth",
            "Summary": "Mold-Tek Technologies has announced its Q2 revenue of 430.8 million rupees, showing an increase from 401 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730975608000,
            "Source": "result"
        },
        {
            "Title": "Mold-Tek Technologies Reports Q2 Consolidated Net Profit",
            "Summary": "Mold-Tek Technologies announced its Q2 consolidated net profit of 80 million rupees, showing a slight year-over-year decrease from 81.3 million rupees. However, it represents a significant quarter-over-quarter increase from 51.8 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730975598000,
            "Source": "result"
        }
    ]
}