{
    "Symbol": "MOLDTKPAC",
    "ISIN": "INE893J01029",
    "News": [
        {
            "Title": "Multiple Companies Release Q3FY26 Financial Results",
            "Summary": "Several listed companies including Mold-Tek Packaging, Sun Pharma Advanced Research, Euro Pratik Sales, Apollo Micro Systems, and Kaveri Seed published their unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770781715783,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mold-Tek Packaging Board Meet on Feb 09 for Q3FY26",
            "Summary": "Mold-Tek Packaging Limited has scheduled a board meeting on February 09, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770220207916,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mold-Tek Packaging Receives IT Demand Notice",
            "Summary": "Mold-Tek Packaging Limited disclosed receiving a demand notice from Income Tax Department for additional tax of Rs. 4,83,92,880 for assessment year 2022-23. Company states no financial impact expected.",
            "Sentiment": "neutral",
            "PublishDate": 1769176562730,
            "Source": "stocks"
        },
        {
            "Title": "Mold-Tek Packaging Partners With UK's Vibe Generation Holdings For Caps & Closures Manufacturing",
            "Summary": "Mold-Tek Packaging has formed an agreement with Vibe Generation Holdings (UK) to manufacture precise caps and closures, with anticipated revenue of $25-30 million over the next five years. The partnership aims to expand into high-profit product areas, potentially enhancing the company's profitability and market reach in specialized packaging solutions.",
            "Sentiment": "positive",
            "PublishDate": 1764669100666,
            "Source": "order&deals"
        },
        {
            "Title": "Mold-Tek Packaging Reports 9.65% Sales Growth in Q2FY26 Despite Seasonal Challenges",
            "Summary": "Mold-Tek Packaging Limited reported quarterly results with 9.65% sales value growth and 7% volume growth compared to the previous year's second quarter. EBITDA increased by 8.37% despite capacity utilization dropping from 74% in Q1 to 63% in Q2. The company achieved EBITDA margin of Rs. 40.6 per kg in H1 versus Rs. 36.73 last year, representing 10.5% growth. Pharma packaging sales surged 45% quarter-on-quarter from Rs. 7.42 crores in Q1 to Rs. 10.8 crores in Q2. Paint segment growth was muted at 3.36% due to heavy rainfall affecting demand, while food and FMCG segment grew 19%. The company maintains guidance of 12% volume growth and expects double-digit growth in Q4. Operations at the new Panipat facility have commenced with initial sales of Rs. 40 lakhs in October. Management cited GST implementation and extended monsoon as factors impacting Q2 performance but expressed confidence in recovery for the second half.",
            "Sentiment": "positive",
            "PublishDate": 1762283861013,
            "Source": "earnings"
        },
        {
            "Title": "Mold-Tek Packaging Reports Strong Q2 Performance with Revenue Growth to 2.09B Rupees",
            "Summary": "Mold-Tek Packaging delivered robust quarterly results with revenue increasing to 2.09 billion rupees from 1.9 billion rupees year-over-year. The company's EBITDA grew to 391 million rupees compared to 336 million rupees in the same period last year, while EBITDA margin expanded to 18.65% from 17.55%. Net profit also showed improvement, rising to 155 million rupees from 141 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761729553064,
            "Source": "earnings"
        },
        {
            "Title": "Mold-Tek Packaging Reports Strong Q1 Performance with 22% Revenue Growth and Expanding Pharma Business",
            "Summary": "Mold-Tek Packaging delivered robust quarterly results with revenue growth of 22% and EBITDA margin improving to 19.7% from 18% in the previous year. Net profit increased by 35% and EBITDA per kg grew by 29%. The paint segment drove significant growth, primarily supported by Aditya Birla Grasim (ABG), while the pharma segment achieved breakeven and grew 11% over Q4. Food & FMCG segment recorded 16% growth despite early monsoons affecting ice cream and yogurt consumption. The company processed 11,400 tons across segments: paints (5,600 tons), lubricants (2,400 tons), Food & FMCG (3,200 tons), and pharma (190 tons). Per kg sales revenue increased from INR198 to INR211. Management targets INR35 crores revenue for pharma segment in the current financial year, up from INR8-9 crores last year. The company is expanding capacity with Panipat thin wall food production starting in August and additional pharma capacity investments of INR80-90 crores planned. Multiple pharma companies including Laurus Labs and Pulse have approved facilities and started commercial orders. The company expects overall volume of 43,000-45,000 tons for the full year with 12-15% value growth.",
            "Sentiment": "positive",
            "PublishDate": 1754044396622,
            "Source": "earnings"
        },
        {
            "Title": "Mold-Tek Packaging Reports Strong Q1 Results with 36% Jump in Net Profit",
            "Summary": "Mold-Tek Packaging reported Q1 net profit of 224 million rupees, representing a significant increase from 165 million rupees in the same period last year. The company's EBITDA rose to 468 million rupees compared to 357 million rupees year-over-year. EBITDA margin improved to 19.45% from 18.16% in the previous year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1753690345969,
            "Source": "earnings"
        },
        {
            "Title": "Mold-Tek Packaging Schedules Q1FY26 Results Conference Call for July 28",
            "Summary": "Mold-Tek Packaging Limited has scheduled a conference call on July 28, 2025, at 4:00 PM IST to discuss the company's Q1FY26 financial results with investors. The call will be hosted by J Lakshmana Rao, Chairman and Managing Director, in collaboration with Emkay Global Financial Services. The company has provided multiple dial-in numbers for domestic and international participants, with pre-registration available to avoid wait times.",
            "Sentiment": "neutral",
            "PublishDate": 1753275256483,
            "Source": "earnings"
        },
        {
            "Title": "Mold-Tek Packaging Schedules Board Meeting for Q1 FY2026 Results and Final Dividend Recommendation",
            "Summary": "Mold-Tek Packaging Limited has scheduled a Board of Directors meeting for July 28, 2025 to consider and approve unaudited financial results for the first quarter ended June 30, 2025, and to recommend final dividend for the financial year ended March 31, 2025. The company's trading window closed on July 1, 2025 and will remain closed until July 30, 2025, which is 48 hours after the declaration of quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1753099470626,
            "Source": "corporate_action"
        },
        {
            "Title": "Mold-Tek Packaging: Nirmal Bang Maintains 'Buy' Rating",
            "Summary": "Mold-Tek Packaging is increasing the use of Recycled Content Plastic in response to industry mandates, particularly from paint and lube companies. This move is part of the company's sustainability agenda.",
            "Sentiment": "positive",
            "PublishDate": 1752057670000,
            "Source": "normal_news"
        },
        {
            "Title": "Mold-Tek Packaging Declares Dividend",
            "Summary": "Mold-Tek Packaging has announced a dividend of 2 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747648182000,
            "Source": "result"
        },
        {
            "Title": "Mold-Tek Packaging Reports Q4 Financial Results",
            "Summary": "Mold-Tek Packaging has released its Q4 financial results. The company's EBITDA increased to 383 million rupees from 355 million rupees year-over-year. However, the EBITDA margin decreased to 18.90% from 20.07% in the same period. Revenue grew to 2.03 billion rupees from 1.77 billion rupees year-over-year. The company's standalone net profit declined to 163 million rupees from 179.7 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747648103000,
            "Source": "result"
        },
        {
            "Title": "Mold-Tek Packaging Reports Q3 EBITDA Growth",
            "Summary": "Mold-Tek Packaging announced its Q3 financial results. The company's EBITDA increased to 340 million rupees from 304 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 17.82% from 18.34% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738928918000,
            "Source": "earnings"
        },
        {
            "Title": "Mold-Tek Packaging Reports Q3 Financial Results",
            "Summary": "Mold-Tek Packaging has released its Q3 financial results. The company reported a net profit of 136 million rupees, compared to 142 million rupees in the same quarter last year. Revenue for Q3 increased to 1.91 billion rupees from 1.65 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738928912000,
            "Source": "earnings"
        },
        {
            "Title": "Mold-Tek Packaging: Q2 Results Show Subdued Performance",
            "Summary": "Mold-Tek Packaging's Q2 earnings were impacted by lower volume growth, according to an IDBI Capital review. The report suggests that the company's performance was below expectations due to reduced sales volumes.",
            "Sentiment": "negative",
            "PublishDate": 1731074386000,
            "Source": "result"
        },
        {
            "Title": "Mold-Tek Packaging Q2 Financial Results",
            "Summary": "Mold-Tek Packaging reported its Q2 financial results. The company's EBITDA increased to 336 million rupees from 321 million rupees year-over-year. However, the EBITDA margin decreased to 17.55% from 18.86% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730965950000,
            "Source": "result"
        },
        {
            "Title": "Mold-Tek Packaging Reports Q2 Revenue Growth",
            "Summary": "Mold-Tek Packaging has announced its Q2 revenue of 1.9 billion rupees, compared to 1.7 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730965846000,
            "Source": "result"
        },
        {
            "Title": "Mold-Tek Packaging Reports Q2 Net Profit Decline",
            "Summary": "Mold-Tek Packaging has reported a net profit of 141 million rupees for the second quarter, down from 157 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730965826000,
            "Source": "result"
        }
    ]
}