{
    "Symbol": "MONARCH",
    "ISIN": "INE903D01011",
    "News": [
        {
            "Title": "Monarch Networth Capital Q3FY26 Results Announced",
            "Summary": "Monarch Networth Capital reported Q3FY26 net profit of ₹45.39 cr vs ₹39.34 cr YoY. Revenue from operations grew to ₹91.74 cr from ₹76.08 cr in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1769077276164,
            "Source": "co_actions_results"
        },
        {
            "Title": "Monarch Networth Capital Auditor Firm Constitution Change",
            "Summary": "Monarch Networth Capital Limited announces statutory auditor M S K A & Associates has converted to LLP structure, continuing as auditor with no engagement changes.",
            "Sentiment": "neutral",
            "PublishDate": 1768580510350,
            "Source": "stocks"
        },
        {
            "Title": "Monarch Network Capital invests ₹59 cr in subsidiary",
            "Summary": "Monarch Network Capital Limited approves ₹59 crore investment in wholly-owned subsidiary Monarch Network Asset Management through rights issue of 1 crore equity shares at ₹59 per share.",
            "Sentiment": "positive",
            "PublishDate": 1768212332724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Monarch Networth Capital Launches Maiden PMS Scheme",
            "Summary": "Monarch Networth Capital Limited announces launch of its first Portfolio Management Services scheme, expanding asset management offerings beyond its existing AIFs managing over ₹1,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765888710053,
            "Source": "stocks"
        },
        {
            "Title": "Monarch Infrapark Private Limited Increases Stake in Monarch Networth Capital",
            "Summary": "Monarch Infrapark Private Limited, a promoter group entity, acquired additional shares in Monarch Networth Capital Ltd through open market transactions, increasing its holding from 5.35% to 5.41%. The acquisitions involved purchasing 25,000 shares and 21,406 shares in separate transactions, with the company's total equity share capital remaining at 79,268,338 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765176135896,
            "Source": "corporate_action"
        },
        {
            "Title": "Monarch Infrapark Acquires Additional Shares in Monarch Networth Capital",
            "Summary": "Monarch Infrapark Private Limited acquired 8,404 shares of Monarch Networth Capital Ltd through open market transactions, increasing its shareholding from 5.34% to 5.35%. The acquisition was completed on December 3, 2025, with the acquirer being part of the promoter group of the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1764911712642,
            "Source": "corporate_action"
        },
        {
            "Title": "Monarch Infrapark Increases Stake in Monarch Networth Capital to 5.32%",
            "Summary": "Monarch Infrapark Private Limited acquired 14,160 shares of Monarch Networth Capital Ltd through open market transactions on November 27, 2025, increasing its shareholding from 5.31% to 5.32%. The acquisition represents a 0.017% increase in voting rights for the promoter group entity in the target company.",
            "Sentiment": "neutral",
            "PublishDate": 1764330755540,
            "Source": "corporate_action"
        },
        {
            "Title": "Monarch Networth Capital Reports Strong Q2 Performance with 67% Jump in Net Profit",
            "Summary": "Monarch Networth Capital Limited posted net profit of Rs 42.15 crore for Q2 ended September 30, 2025, compared to Rs 42.75 crore in the previous quarter, with total revenue reaching Rs 79.98 crore. The company paid a final dividend of Re 1 per share and incorporated two wholly owned subsidiaries for asset management and trustee services during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763128859277,
            "Source": "earnings"
        },
        {
            "Title": "Monarch Networth Capital's Subsidiary Receives SEBI Registration for India Growth Fund as Category I FPI",
            "Summary": "Monarch Networth Capital Limited announced that its subsidiary, Monarch Networth Capital IFSC Private Limited, has received a Certificate of Registration from SEBI for the Monarch India Growth Fund as a Category I Foreign Portfolio Investor. The fund has been registered under Category I and Appropriately Regulated Fund with registration number INIGFP103925. Monarch Networth Capital IFSC Private Limited will act as the Fund Management Entity for the fund.",
            "Sentiment": "positive",
            "PublishDate": 1758805019293,
            "Source": "stock"
        },
        {
            "Title": "Monarch Networth Capital Establishes Wholly Owned Subsidiary for Investment Fund Trustee Services",
            "Summary": "Monarch Networth Capital has incorporated a wholly owned subsidiary named 'Monarch Networth Trustee Pvt. Ltd.' The new subsidiary will serve as a trustee for investment funds.",
            "Sentiment": "positive",
            "PublishDate": 1758804015417,
            "Source": "stock"
        },
        {
            "Title": "Monarch Networth Capital Invests ₹10 Crores for 0.56% Stake in NCDEX",
            "Summary": "Monarch Networth Capital Limited signed a Share Subscription Agreement on September 24, 2025, to invest ₹10.00 crores in National Commodity & Derivatives Exchange Limited (NCDEX). The investment involves subscribing to 506,740 equity shares at ₹197.34 per share, representing 0.56% of NCDEX's post-issue paid-up share capital. NCDEX is a commodity exchange incorporated in 2003 with a net worth of ₹615.94 crores and turnover of ₹24.48 crores in FY 2024-25. The investment is for strategic purposes to strengthen Monarch's presence in the financial services ecosystem and will be completed within 60 business days. The transaction is not a related party deal and requires cash consideration.",
            "Sentiment": "positive",
            "PublishDate": 1758785809203,
            "Source": "order&deals"
        },
        {
            "Title": "Monarch Networth Capital Receives IFSCA Approval for New Category III Investment Scheme",
            "Summary": "Monarch Networth Capital Limited received approval from the International Financial Services Centres Authority (IFSCA) for a new Category III Scheme called 'Monarch India Growth Fund'. The approval was granted through a letter dated September 18, 2025. The company's subsidiary, Monarch Networth Capital IFSC Private Limited, will serve as the Fund Management Entity for this scheme. The company disclosed this development to stock exchanges BSE and NSE under regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1758287002028,
            "Source": "stock"
        },
        {
            "Title": "Monarch Networth Capital Completes Rs. 40 Crore Acquisition of 1.82% Stake in Metropolitan Stock Exchange",
            "Summary": "Monarch Networth Capital Limited has completed its acquisition of 20 crore equity shares in Metropolitan Stock Exchange of India Limited for Rs. 40 crores. The shares were purchased at Rs. 2 per share with a face value of Rs. 1 each, representing a 1.82% stake in the target company. The company received confirmation of the completed transaction on August 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755596885435,
            "Source": "order&deals"
        },
        {
            "Title": "Monarch Infrapark Increases Stake in Monarch Networth Capital to 5.20%",
            "Summary": "Monarch Infrapark Private Limited, a promoter entity, acquired 62,766 shares of Monarch Networth Capital Ltd through open market transactions. The acquisition increased their shareholding from 5.12% to 5.20% of the company's voting rights. The shares were acquired on August 1, 2025, representing 0.08% of the total voting capital. Monarch Networth Capital's total equity share capital remains at 7,92,37,338 shares, and the company is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1754293917431,
            "Source": "corporate_action"
        },
        {
            "Title": "Monarch Infrapark Increases Stake in Monarch Networth Capital to 5.12%",
            "Summary": "Monarch Infrapark Private Limited, a promoter group entity, acquired additional shares in Monarch Networth Capital Limited through open market transactions. The acquisition involved 37,244 shares carrying voting rights on July 29, 2025. Following this transaction, Monarch Infrapark's shareholding increased from 40,17,620 shares (5.07%) to 40,54,864 shares (5.12%) of the total equity share capital. The target company's total equity share capital remains at 7,92,37,338 shares. The disclosure was submitted under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1753930903893,
            "Source": "corporate_action"
        },
        {
            "Title": "SEBI Grants Approval to Monarch Networth Capital for Mutual Fund Establishment",
            "Summary": "Monarch Networth Capital has received regulatory approval from SEBI to establish a mutual fund. This approval allows the company to enter the mutual fund business and offer investment products to investors.",
            "Sentiment": "positive",
            "PublishDate": 1753273667563,
            "Source": "mutualfunds"
        },
        {
            "Title": "Monarch Networth Capital Reports Strong Q1 Results, Approves Director Re-appointments",
            "Summary": "Monarch Networth Capital Limited announced its unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The company reported standalone net profit of Rs 4,423.51 lakhs compared to Rs 3,710.93 lakhs in the same quarter last year. Total revenue from operations increased to Rs 9,739.96 lakhs from Rs 8,148.17 lakhs year-over-year. On a consolidated basis, net profit rose to Rs 4,525.09 lakhs from Rs 4,005.58 lakhs in the previous year quarter. The board also approved the re-appointment of Mr. Ashok Daulatraj Bafna as Whole Time Director and Ms. Avni Chouhan as Independent Director for 5-year terms starting August 20, 2025, subject to shareholder approval. Basic earnings per share stood at Rs 5.63 for standalone and Rs 5.76 for consolidated results.",
            "Sentiment": "positive",
            "PublishDate": 1753266493667,
            "Source": "earnings"
        },
        {
            "Title": "Monarch Networth Capital IFSC Receives RFME License",
            "Summary": "Monarch Networth Capital IFSC has been granted a Registered Fund Management Entity (Retail) license by the International Financial Services Centres Authority (IFSCA) in GIFT City. This license allows the company to operate as a registered fund management entity for retail investors in the GIFT City international financial services center.",
            "Sentiment": "positive",
            "PublishDate": 1745988535000,
            "Source": "default"
        },
        {
            "Title": "Monarch Networth Capital: Settles Stock Broker Rule Violation with SEBI",
            "Summary": "Monarch Networth Capital Ltd settled a case with SEBI for alleged violation of stock brokers' rules by paying Rs 11.37 lakh. The case stemmed from an investigation into trading activities of Atlantaa Ltd scrip from August to November 2022, where certain entities were accused of manipulating the stock through misleading YouTube videos.",
            "Sentiment": "neutral",
            "PublishDate": 1740138239000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Monarch Networth Capital Reports Q3 Financial Results",
            "Summary": "Monarch Networth Capital has announced its financial results for the third quarter. The company reported a net profit of 393 million rupees, up from 376 million rupees in the same quarter last year, representing a year-over-year increase. However, revenue for Q3 decreased to 761 million rupees from 820 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738920409000,
            "Source": "earnings"
        },
        {
            "Title": "Monarch Networth Capital: Q2 PAT Surges 19%, Announces Bonus Issue",
            "Summary": "Monarch Networth Capital reported a 19% YoY increase in Q2 PAT to Rs 44 crore, with total income up 33% to Rs 104 crore. The company raised Rs 300 crore in equity capital and announced a 1:1 bonus share issue.",
            "Sentiment": "positive",
            "PublishDate": 1731509017000,
            "Source": "result"
        },
        {
            "Title": "Monarch Networth Capital Reports Q2 EBITDA Growth",
            "Summary": "Monarch Networth Capital announced its Q2 financial results. The company's EBITDA increased to 650 million rupees from 507 million rupees year-over-year. However, the EBITDA margin decreased to 63.22% from 67.40% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731318551000,
            "Source": "result"
        },
        {
            "Title": "Monarch Networth Capital Reports Q2 Revenue Growth",
            "Summary": "Monarch Networth Capital announced its second quarter revenue of 1.03 billion rupees, showing a significant increase from 753 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731318516000,
            "Source": "result"
        },
        {
            "Title": "Monarch Networth Capital Reports Q2 Profit Increase",
            "Summary": "Monarch Networth Capital has reported a net profit of 427 million rupees for the second quarter, up from 347 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731318458000,
            "Source": "result"
        }
    ]
}