{
    "Symbol": "MONEYBOXX",
    "ISIN": "INE296Q01012",
    "News": [
        {
            "Title": "Moneyboxx Finance Q3FY26 Results Call on Feb 13",
            "Summary": "Moneyboxx Finance Limited has scheduled a conference call for February 13, 2026 at 2:00 PM IST to discuss its Q3FY26 financial results for quarter ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770623180509,
            "Source": "co_actions_results"
        },
        {
            "Title": "Moneyboxx Finance Opens New Regional Office in Jaipur",
            "Summary": "Moneyboxx Finance Limited has established a new regional office in Jaipur, Rajasthan, expanding its operational presence in the state as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1768483096779,
            "Source": "stocks"
        },
        {
            "Title": "Moneyboxx Finance Plans ₹43.32 Cr Preferential Issue",
            "Summary": "Moneyboxx Finance board approves preferential issue of 57 lakh equity shares at ₹76 per share, raising ₹43.32 crores from promoters and non-promoter investors. EGM scheduled for February 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768307832480,
            "Source": "co_actions_results"
        },
        {
            "Title": "Moneyboxx Finance Board Approves ₹43.32 Cr Preferential Issue",
            "Summary": "Moneyboxx Finance Limited board approved preferential issue of 57 lakh equity shares at ₹76 per share, raising ₹43.32 crores from promoters and non-promoter investors. EGM scheduled for February 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768307539007,
            "Source": "co_actions_results"
        },
        {
            "Title": "Moneyboxx Finance Board to Discuss Fundraising",
            "Summary": "Moneyboxx Finance has scheduled a board meeting for January 9th to discuss fundraising plans, marking a significant corporate development for the financial services company.",
            "Sentiment": "neutral",
            "PublishDate": 1767705082655,
            "Source": "stocks"
        },
        {
            "Title": "Moneyboxx Finance Announces 1:1 Bonus Share Issue with December 15 Record Date",
            "Summary": "Moneyboxx Finance Limited's members have approved a 1:1 bonus share issue, granting one new fully paid-up equity share of Rs. 10 for every existing share held. The company has set December 15, 2025 as the record date for eligibility, with allotment on December 16 and trading to commence December 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765276452185,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Increases Authorized Share Capital to Rs 100 Crores",
            "Summary": "Moneyboxx Finance shareholders approved via postal ballot on December 4, 2025, an increase in authorized share capital from Rs 40 crores to Rs 100 crores, expanding from 4 crore to 10 crore equity shares of Rs 10 each. The approval also included consequential amendments to the company's Memorandum of Association to reflect the enhanced capital structure.",
            "Sentiment": "positive",
            "PublishDate": 1764924232619,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Allots ₹25 Crore Non-Convertible Debentures to Four Investors",
            "Summary": "Moneyboxx Finance Limited's Working Committee approved the allotment of 25,000 listed, senior, secured, transferable, redeemable, non-convertible debentures on private placement basis at face value of ₹10,000 per debenture. The debentures were allocated to four investors - Aspero Markets Private Limited, Manba Finance Limited, Stable Broking Private Limited, and Stable-Alpha Technologies Private Limited - raising a total amount of ₹25,00,00,000.",
            "Sentiment": "positive",
            "PublishDate": 1764322632503,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Wins Gold at LACP's 2025 Spotlight Awards, Achieves Global Top 40 Ranking",
            "Summary": "Moneyboxx Finance Limited won Gold Awards in two categories at LACP's 2025 Spotlight Awards for its Integrated Annual Report FY25, competing against entries from nearly twenty countries across four continents. The NBFC's Integrated Report earned an overall score of 98 out of 100, placing it in the Top 40 globally and marking the second consecutive year of recognition for the company's reporting excellence.",
            "Sentiment": "positive",
            "PublishDate": 1763444107714,
            "Source": "stock"
        },
        {
            "Title": "Moneyboxx Finance Reports No Deviation in Preferential Issue Fund Utilization for September Quarter",
            "Summary": "Moneyboxx Finance Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing proper utilization of funds raised through its preferential issue. The company raised Rs 175.80 crore through the preferential issue, revised down from the original Rs 271.48 crore due to undersubscription of equity shares and convertible warrants. The funds were allocated for onward lending purposes (Rs 165.80 crore) and general corporate purposes (Rs 10.00 crore). As of the quarter end, Rs 89.02 crore was utilized for lending purposes and Rs 2.06 crore for general corporate purposes, leaving Rs 84.72 crore unutilized. The monitoring agency Crisil Ratings Limited reported no deviation from the stated objects of the issue. The company issued warrants at Rs 302.20 per share, while the current market price stands at Rs 167.56 as of October 24, 2025, indicating potential risk of non-exercise of conversion rights. Warrant holders have 18 months from allotment date to convert warrants into equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762255525359,
            "Source": "stock"
        },
        {
            "Title": "Moneyboxx Finance Reports 16% AUM Growth, Shifts Focus to Secured Lending in Q2 FY26",
            "Summary": "Moneyboxx Finance reported Assets Under Management (AUM) growth of 16% year-on-year to INR 892 crores in Q2 FY26, up from INR 769 crores in Q2 FY25. The company recorded disbursements of INR 115 crores, up 23% from the previous quarter. Total income grew 10% year-on-year to INR 55 crores, while profit after tax declined to INR 0.3 crores from INR 2.3 crores in the previous year. The company is strategically shifting toward secured lending, with secured disbursements accounting for 69% of total disbursements in Q2 FY26, up from 43% in the same quarter last year. Secured loan book now represents 55% of total AUM, compared to 32% in Q2 of the previous year. The company targets 70% secured lending share by March 2026. Gross NPA improved to 3.26% from over 7% in Q1, largely due to an ARC transaction. The company has reduced livestock-based disbursements from 64% in Q1 FY25 to 37% in Q2 FY26. Loans with average ticket size of INR 5-10 lakhs have grown fivefold to 60% from 19% in terms of disbursement. The Board approved a 1:1 bonus share issue. The company operates 163 branches across 12 states and maintains a liquidity buffer of INR 97 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762255047421,
            "Source": "earnings"
        },
        {
            "Title": "Moneyboxx Finance Raises INR 478 Crore in Term Debt Since January 2025",
            "Summary": "Moneyboxx Finance Limited has raised INR 478 crore in term debt since January 2025 from various sources including NCDs (INR 277 crore), bank term loans (INR 124 crore), and financial institution term loans (INR 77 crore). The company's GNPA ratio improved significantly from 7.28% as of June 2025 to 3.26% as of September 2025 following an ARC transaction and enhanced collection efforts. The company maintains relationships with 30 lending institutions comprising 11 banks and 19 financial entities. As of September 30, 2025, Moneyboxx Finance reported a CRAR of 27.1%, net worth of INR 262 crore, debt-to-equity ratio of 2.41, and liquidity of INR 97 crore. The company has a debt pipeline exceeding INR 500 crore under discussion for the second half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762237418306,
            "Source": "stock"
        },
        {
            "Title": "Moneyboxx Finance Announces Postal Ballot for Authorized Share Capital Increase and 1:1 Bonus Share Issue",
            "Summary": "Moneyboxx Finance Limited has issued a postal ballot notice seeking shareholder approval for two resolutions. The company proposes to increase its authorized share capital from Rs. 40 crores to Rs. 100 crores, comprising 10 crore equity shares of Rs. 10 each. Additionally, the company seeks approval for issuing bonus shares in a 1:1 ratio by capitalizing Rs. 37.50 crores from the securities premium account. The bonus issue will provide one new fully paid equity share for every existing share held. The e-voting period runs from November 5, 2025, to December 4, 2025, with results to be declared by December 8, 2025. The cut-off date for determining eligible shareholders is October 31, 2025. The company's securities premium account balance was Rs. 203.46 crores as of March 31, 2025. Outstanding convertible warrants and employee stock options totaling approximately 48 lakh securities will also be eligible for bonus shares upon conversion.",
            "Sentiment": "positive",
            "PublishDate": 1762168891247,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Reports Business Transformation to Secured Lending with 55% Secured Book Share",
            "Summary": "Moneyboxx Finance Limited has successfully transformed its business model toward secured lending, with secured disbursements reaching 69% in quarterly results compared to 43% in the same period last year. The company's secured book now comprises 55% of its Assets Under Management (AUM) of ₹892 crore as of September 2025, up from 32% in September 2024, with a target of reaching 70% by March 2026. The NBFC operates 163 branches across 12 states and has raised equity capital of ₹175.8 crore, of which ₹91.1 crore has been received with the balance of ₹84.7 crore to be received by March 2026. The company reported a Capital Adequacy Ratio of 27.1% and reduced Gross NPA to 3.26% from 7.28% following an ARC transaction. Total income increased to ₹55.06 crore with profit after tax of ₹0.28 crore. The company is focusing on the upper tier of micro-enterprises with average ticket sizes of ₹5-10 lakhs and customers with 650+ bureau scores, while reducing its livestock segment exposure to 37% from 61% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761853956286,
            "Source": "stock"
        },
        {
            "Title": "Moneyboxx Finance Targets AUM Growth Beyond ₹1,200-1,300 Cr by FY26",
            "Summary": "Moneyboxx Finance plans to expand its Assets Under Management (AUM) beyond ₹1,200-1,300 crore by FY26. The company's growth strategy includes maintaining a 70% secured portfolio, establishing a network of over 200 branches across 12 states, and implementing AI-based credit underwriting systems. The firm aims to keep Gross Non-Performing Assets (GNPA) below 3% while focusing on upper-tier MSME borrowers. Moneyboxx Finance targets sustainable growth of over 30% and strong capital efficiency through FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761834737854,
            "Source": "stock"
        },
        {
            "Title": "Moneyboxx Finance Approves 1:1 Bonus Issue Amid Mixed Q2 Results",
            "Summary": "Moneyboxx Finance has approved a bonus share issue at a 1:1 ratio. The company reported Q2 net profit of 3 million rupees compared to 20 million rupees in the same period last year, representing an 85% decline. However, Q2 revenue increased to 550 million rupees from 495 million rupees year-over-year, showing 11% growth.",
            "Sentiment": "neutral",
            "PublishDate": 1761826321480,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Board to Consider Bonus Issue Proposal Along with Quarterly Results",
            "Summary": "Moneyboxx Finance Limited announced that its Board of Directors meeting scheduled for October 30, 2025, will consider a proposal for bonus issue in addition to approving unaudited financial results for the quarter and half-year ended September 30, 2025. The bonus issue proposal is subject to regulatory and statutory approvals as required under applicable laws. If approved by the Board, the company would seek shareholder approval for the proposal.",
            "Sentiment": "positive",
            "PublishDate": 1761548378001,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Reschedules Q2 FY26 Earnings Call to October 31",
            "Summary": "Moneyboxx Finance Limited has postponed its earnings conference call for Q2 FY26 financial results from October 28, 2025 to October 31, 2025 at 2:00 PM IST. The conference call will be hosted for analysts and investors, with company participants including Co-Founders and Co-CEOs Mayur Modi and Deepak Aggarwal, along with Finance Controller Viral Sheth. The company has provided dial-in numbers for participation and encourages pre-registration to avoid wait times.",
            "Sentiment": "neutral",
            "PublishDate": 1761389728515,
            "Source": "earnings"
        },
        {
            "Title": "Moneyboxx Finance Lists on National Stock Exchange as 2,881st Company",
            "Summary": "Moneyboxx Finance Limited, a non-banking financial company focused on micro-entrepreneurs and financial inclusion, listed its shares on the National Stock Exchange on October 15, 2025. The NBFC becomes the 2,881st company to list on NSE. Moneyboxx operates 163 branches across 12 states, providing small business loans ranging from INR 1 to 25 lakh to micro enterprises in semi-urban and rural India. The company focuses on empowering women entrepreneurs and underserved communities in segments like livestock, kirana stores, retail trading, and small manufacturing. Co-founders Deepak Aggarwal and Mayur Modi emphasized that the NSE listing provides broader market access, enhanced visibility, and stronger price discovery while supporting their mission of responsible credit access. The listing ceremony included NSE Chief Manager Jaswant Jain and other company officials.",
            "Sentiment": "positive",
            "PublishDate": 1760542647450,
            "Source": "stock"
        },
        {
            "Title": "Moneyboxx Finance Approves INR 40 Crore Non-Convertible Debenture Issuance",
            "Summary": "Moneyboxx Finance Limited's Working Committee approved the issuance of 40,000 non-convertible debentures worth INR 40 crore through private placement to identified investors. The debentures have a face value of INR 10,000 each and include a green shoe option of INR 15 crore. The securities carry a 10.25% annual interest rate with a 24-month tenure, maturing on October 16, 2027. The debentures will be listed on BSE Limited and are secured by a first-ranking charge over the company's identified receivables with a security cover of 1.10 times the outstanding principal plus accrued interest. Principal repayment is structured with 50% due at the end of the 21st month and the balance on maturity.",
            "Sentiment": "neutral",
            "PublishDate": 1760191804501,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Partners With Water.org To Expand WASH Financing For Small Enterprises",
            "Summary": "Moneyboxx Finance Ltd has entered into a partnership with Water.org to enhance Water, Sanitation, and Hygiene (WASH) financing in India. The collaboration focuses on creating affordable financing options specifically for micro and small enterprises. Under the partnership, Water.org will provide technical support in product development and training to strengthen the financing solutions.",
            "Sentiment": "positive",
            "PublishDate": 1759903821470,
            "Source": "order&deals"
        },
        {
            "Title": "Moneyboxx Finance Transfers ₹60.90 Crore Stressed Assets to ARC, Improves Asset Quality Metrics",
            "Summary": "Moneyboxx Finance executed a transaction to transfer non-performing assets and written-off accounts worth ₹60.90 crores to an Asset Reconstruction Company trust, with Security Receipts issued in a 15:85 ratio effective from June 30, 2025. The transaction resulted in significant improvements: 90+ PAR decreased from 7.89% to 3.36%, GNPA dropped from 7.28% to 1.11%, and collection efficiency improved from 89.3% to 93.6%. The company expects 40-50% recovery from the ARC pool. Moneyboxx has been strategically shifting toward secured lending, with secured book increasing from 6% in March 2023 to 49% in June 2025, targeting 65% by March 2026. The company maintains strong capitalization with CRAR of 28.4% and has raised ₹494 crores in term debt during FY25 and ₹127 crores in Q1 FY26. The microfinance industry faced challenges with new MFI guardrails capping unsecured borrowing at ₹2 lakh per customer, causing sector-wide asset quality deterioration.",
            "Sentiment": "positive",
            "PublishDate": 1757336778396,
            "Source": "stock"
        },
        {
            "Title": "Moneyboxx Finance Board Approves INR 1,000 Crore NCD Issuance and Sets AGM Date",
            "Summary": "Moneyboxx Finance Limited's Board of Directors approved the issuance of Non-Convertible Debentures up to INR 1,000 crore through private placement, subject to shareholder approval at the upcoming Annual General Meeting. The Board recommended appointing M/s Shashank Pashine & Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. The company scheduled its 31st AGM for September 26, 2025, via video conferencing, with September 19, 2025 set as the cutoff date for voting eligibility. The Board also acknowledged a BSE communication regarding a INR 5,000 fine imposed under listing regulations and emphasized establishing systems to prevent future occurrences.",
            "Sentiment": "neutral",
            "PublishDate": 1755522492598,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Schedules Board Meeting to Consider Rs 1,000 Crore NCD Issuance",
            "Summary": "Moneyboxx Finance Limited has scheduled a Board of Directors meeting on August 18, 2025 to consider and approve the issuance of non-convertible debentures (NCDs) up to Rs. 1,000 Crore. The NCDs may be secured or unsecured, redeemable, taxable or tax-free, and cumulative or non-cumulative. The proposal is subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1755005364225,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Appoints Vivek Meharwal as Chief Business Officer",
            "Summary": "Moneyboxx Finance Limited appointed Mr. Vivek Meharwal as Chief Business Officer effective August 01, 2025. He will be categorized as Senior Management Personnel. Meharwal brings over 21 years of experience in the lending industry across various products including affordable home loans, loan against property, structured finance, education infrastructure loans, business loans, and lending to financial institutions. He holds an MBA with specialization in Marketing. In his most recent role, he served as Chief Business Officer at Altum Credo Home Finance, responsible for sales and product management of affordable home loans across India. He previously worked at Avanse Financial Services, Religare, GE Money, and ICICI Home Finance. The company expects his contributions to accelerate growth of their secured loan portfolio and enhance operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1754050499034,
            "Source": "corporate_governance"
        },
        {
            "Title": "Moneyboxx Finance Reports 23% AUM Growth to ₹918 Crores Despite Rising NPAs in Q1 FY26",
            "Summary": "Moneyboxx Finance achieved 23% year-on-year growth in assets under management, reaching ₹918 crores in Q1 FY26, up from ₹746 crores in Q1 FY25. The company's total income grew 29% to ₹59 crores, while net interest income increased 26% to ₹39 crores. However, profit after tax declined significantly to ₹24 lakhs from ₹4.30 crores in the same quarter last year, primarily due to higher credit costs. Gross NPAs rose to 7.28% and net NPAs to 3.78%. The company is strategically shifting toward secured lending, with secured disbursements accounting for 64% of total disbursements in Q1 FY26, up from 36% in Q1 FY25. Moneyboxx reduced livestock-based disbursements from 64% to 47% and increased focus on higher ticket loans, with loans in the ₹5-10 lakh range growing from 5% to over 20% of disbursements. The company launched a new Salaried LAP product and proprietary cattle AI solution. With 163 branches across 12 states and backing from 32 lenders including 11 banks, Moneyboxx targets ₹1,400 crores AUM for the full year.",
            "Sentiment": "neutral",
            "PublishDate": 1754049519084,
            "Source": "earnings"
        },
        {
            "Title": "Moneyboxx Finance Reports Mixed Q1 FY26 Results with 23% AUM Growth Despite Asset Quality Challenges",
            "Summary": "Moneyboxx Finance submitted its quarterly results showing AUM growth of 23% year-on-year to ₹918 crore, driven by successful transformation to secured lending with 64% of disbursements now secured versus 36% in the previous year. The company expanded its secured book to 49% of AUM from 27% last year, targeting 70% by March 2026. However, profitability declined significantly with PAT dropping 94% to ₹0.24 crore from ₹4.30 crore, while total income grew 29% to ₹59.12 crore. Asset quality deteriorated with gross NPA rising to 7.28% from 1.59% and net NPA increasing to 3.78% from 0.80%. The company maintains strong capitalization with CRAR of 28.4% and liquidity of ₹165 crore. Moneyboxx operates 163 branches across 12 states, focusing on MSME lending in semi-urban and rural India with average ticket sizes of ₹3.9 lakhs for secured and ₹1.8 lakhs for unsecured loans.",
            "Sentiment": "neutral",
            "PublishDate": 1753524350408,
            "Source": "earnings"
        },
        {
            "Title": "Moneyboxx Finance Schedules Conference Call for Q1 FY26 Results Discussion",
            "Summary": "Moneyboxx Finance Limited will host a conference call on July 28, 2025, at 2:00 PM IST to discuss financial results for the quarter ended June 30, 2025. The call is open to analysts and investors, with company executives including Co-Founder and Co-CEO Mayur Modi, Co-Founder and Co-CFO Deepak Aggarwal, and Finance Controller Viral Sheth participating. The Board of Directors meeting to approve the quarterly results is scheduled for July 26, 2025. Audio recording and transcript will be made available on the company website.",
            "Sentiment": "neutral",
            "PublishDate": 1753275172089,
            "Source": "earnings"
        },
        {
            "Title": "Moneyboxx Finance Schedules Board Meeting for July 26 to Approve Quarterly Results",
            "Summary": "Moneyboxx Finance Limited has scheduled a Board of Directors meeting for July 26, 2025 to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company has closed its trading window for insiders from July 1, 2025 until 48 hours after the results declaration. The information will be hosted on the company's website at www.moneyboxxfinance.com.",
            "Sentiment": "neutral",
            "PublishDate": 1753274115090,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Applies for NSE Listing",
            "Summary": "Moneyboxx Finance has officially submitted an application to the National Stock Exchange (NSE) on June 12, seeking in-principle approval for the listing of its equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1749774458000,
            "Source": "default"
        },
        {
            "Title": "Moneyboxx Finance Applies for NSE Listing",
            "Summary": "Moneyboxx Finance has officially submitted an application to the National Stock Exchange (NSE) on June 12, seeking in-principle approval for the listing of its equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1749739255000,
            "Source": "default"
        },
        {
            "Title": "Moneyboxx Finance Reports AUM Growth and Collection Normalization Forecast",
            "Summary": "Moneyboxx Finance has announced that its Assets Under Management (AUM) as of March 2025 stands at approximately 9.29 billion rupees. The company also expects its collections to normalize in the first quarter of the fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1744083371000,
            "Source": "result"
        },
        {
            "Title": "Moneyboxx Finance: 56% AUM Surge and Pan-India Expansion",
            "Summary": "Moneyboxx Finance reported a 56% increase in AUM to Rs 837 crore by December 2024. The company expanded operations to 160 branches across 12 states, including new southern states. Secured loans now account for 38% of AUM. The company raised Rs 175.8 crore in equity, boosting its net worth to Rs 264.5 crore and improving CRAR to 35.76%.",
            "Sentiment": "positive",
            "PublishDate": 1740415547000,
            "Source": "earnings"
        },
        {
            "Title": "Moneyboxx Finance Reports Mixed Q3 Results",
            "Summary": "Moneyboxx Finance has released its Q3 financial results, showing a significant decrease in net profit but a substantial increase in revenue. The company's net profit for Q3 fell to 2 million rupees, down from 20 million rupees in the same quarter last year. However, revenue saw a notable rise to 517 million rupees, up from 335 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739196209000,
            "Source": "earnings"
        },
        {
            "Title": "Moneyboxx Finance Reports Liquidity Buffer of 932 Million Rupees",
            "Summary": "Moneyboxx Finance has announced that its liquidity buffer as of December 31, 2024, stands at 932 million rupees. This information provides insight into the company's financial health and its ability to meet short-term obligations.",
            "Sentiment": "positive",
            "PublishDate": 1737117073000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Moneyboxx Finance Secures INR 1.32 Billion in Debt Capital, Adds New Lending Partners",
            "Summary": "Moneyboxx Finance has successfully onboarded three new lending partners and raised INR 1.32 billion in debt capital during the third quarter of fiscal year 2025. This development indicates the company's ability to attract new financial partnerships and secure significant funding, which could potentially support its growth and lending operations.",
            "Sentiment": "positive",
            "PublishDate": 1736831944000,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance to Consider Non-Convertible Debentures Issuance",
            "Summary": "Moneyboxx Finance Limited has announced a board meeting scheduled for January 15 to consider the issuance of non-convertible debentures. This meeting suggests the company is exploring options for raising capital through debt instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1736507673000,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Expands Agroforestry Initiative in Haryana",
            "Summary": "Moneyboxx Finance has extended its agroforestry program to Jind, Haryana, as part of its beyond-lending initiatives. This expansion aims to significantly increase borrowers' income while positively impacting climate change. The initiative demonstrates the company's commitment to sustainable practices and supporting its customers beyond traditional financial services.",
            "Sentiment": "positive",
            "PublishDate": 1729057722000,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance Secures ₹400 Million in Term Loans",
            "Summary": "<p><span class=\"positive\">Moneyboxx Finance</span> has successfully <span class=\"positive\">raised</span> <b>₹400 million</b> (approximately $4.8 million USD) through <span class=\"neutral\">term loans</span>. This <span class=\"positive\">funding</span> will likely be used to <span class=\"positive\">support</span> the company's <span class=\"neutral\">operations</span> and <span class=\"positive\">growth initiatives</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728625348000,
            "Source": "corporate_action"
        },
        {
            "Title": "Moneyboxx Finance: Expands to South India, Targets 156 Branches by October",
            "Summary": "<p><span class='positive'>Moneyboxx Finance Limited</span> <span class='positive'>expanded</span> to <b>141 branches</b>, entering <span class='neutral'>South India</span> with <b>18 new branches</b> in four states. The company aims to reach <b>156 branches</b> across 12 states by October 2024, supported by a recent <span class='positive'>equity raise</span> of <b>₹176 crore</b>. Moneyboxx targets an <span class='positive'>AUM</span> of over <b>₹1,300 crore</b> by March 2025.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727689190000,
            "Source": "normal_news"
        }
    ]
}