{
    "Symbol": "MONOLITH",
    "ISIN": "INE1DV401010",
    "News": [
        {
            "Title": "Monolithisch Q3 Net Profit Jumps 56% to ₹61M",
            "Summary": "Monolithisch India reported consolidated net profit of ₹61 million in Q3, marking a significant 56% year-on-year growth from ₹39 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769513897184,
            "Source": "co_actions_results"
        },
        {
            "Title": "Monolithisch India: SME Stock Doubles in 6 Months",
            "Summary": "NSE SME-listed Monolithisch India's shares surged 97% from listing price to ₹478, driven by 81% revenue CAGR and strong operational efficiency in ramming mass manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1768373391965,
            "Source": "stocks"
        },
        {
            "Title": "Monolithisch India Completes MIGPL Acquisition, Expands Capacity to 2,63,600 Tonnes",
            "Summary": "Monolithisch India Limited has completed its acquisition of Mineral India Global Private Limited (MIGPL) across all five planned tranches, making MIGPL a wholly owned subsidiary following shareholder approval on November 8, 2025. The acquisition expands Monolithisch's total installed capacity to 2,63,600 tonnes per annum in the ramming mass and refractory materials sector, strengthening its manufacturing footprint and customer base across Chhattisgarh and central India.",
            "Sentiment": "positive",
            "PublishDate": 1763113956672,
            "Source": "order&deals"
        },
        {
            "Title": "Mukul Agrawal Increases Stake in Monolithisch India to 2.76%, Exits Raghav Productivity Enhancers",
            "Summary": "Investor Mukul Agrawal increased his shareholding in Monolithisch India from 2.30% to 2.76% as part of a portfolio realignment. The refractory solutions company has delivered nearly 200% returns in 44 days since its NSE SME listing on June 19. Monolithisch shares closed 1.3% lower at Rs 452, trading below short-term moving averages while above 10-day and 50-day averages. Simultaneously, Agrawal fully exited his position in Raghav Productivity Enhancers Ltd, a manufacturer of silica ramming mass for steel and foundry industries. RPEL shares traded 0.3% lower at Rs 717.10 with neutral technical indicators.",
            "Sentiment": "neutral",
            "PublishDate": 1760098239800,
            "Source": "stock"
        },
        {
            "Title": "Monolithisch India Targets 30% Market Share in Premixed Ramming Mass Sector",
            "Summary": "Monolithisch India Ltd aims to capture 25-30% of the premixed ramming mass market within the next couple of years, up from its current 8-9% market share. Managing Director Harsh Tekriwal expects the market to grow from 2 lakh tonnes monthly to 4-5 lakh tonnes monthly over the next 2-3 years. The company is expanding capacity to 5.74 lakh tonnes per annum within one year, having recently commissioned the first phase at its Purulia plant, bringing installed capacity to 206,000 TPA. Revenue increased from Rs 68 crore in 2023-24 to Rs 97 crore in 2024-25. The company went public in June and raised Rs 82.02 crore through its IPO for machinery upgrades, a greenfield project, and working capital. Premixed ramming mass is used for lining induction furnaces in the secondary steel sector, which Tekriwal describes as booming due to economic advantages and improving product quality.",
            "Sentiment": "positive",
            "PublishDate": 1758448432054,
            "Source": "stock"
        },
        {
            "Title": "Monolithisch India to Expand Purulia Plant Capacity to 206,000 TPA",
            "Summary": "Monolithisch India announced the opening of Capex-I at its Purulia plant on October 2, 2025. The expansion will increase the plant's capacity to 206,000 tonnes per annum (TPA) to address growing demand for ramming mass products.",
            "Sentiment": "positive",
            "PublishDate": 1758094059178,
            "Source": "stock"
        },
        {
            "Title": "Mukul Agrawal's Monolithisch India Surges 200% in 44 Days, Portfolio Gains Continue",
            "Summary": "Mukul Agrawal's recent investment Monolithisch India has delivered nearly 200% returns in 44 days since its listing on June 19. The stock debuted on NSE's SME platform following its June IPO and ranks as the second-best performer in Agrawal's portfolio. Two other June quarter additions, Yatharth Hospital and Tatva Chintan Pharma Chem, have gained 67% and 53% respectively. Agrawal holds stakes of 2.3% in Monolithisch, 1.1% in Yatharth, and 1.3% in Tatva Chintan. His portfolio consists of 64 stocks with a net worth exceeding Rs 7,506 crore, growing over 10% since June. Five other June picks have returned between 8% and 16%. During the quarter, Agrawal increased his stake in Prakash Industries to 1.7% and reduced holdings in five stocks while potentially exiting two others. Of his 64 holdings, 18 have delivered negative returns of up to 30%.",
            "Sentiment": "positive",
            "PublishDate": 1756710997388,
            "Source": "stock"
        }
    ]
}