{
    "Symbol": "MONTECARLO",
    "ISIN": "INE950M01013",
    "News": [
        {
            "Title": "Monte Carlo Fashions Q3 Net Profit Rises 12.3%",
            "Summary": "Monte Carlo Fashions reported Q3 standalone net profit of ₹1.07 billion compared to ₹953 million in the same quarter last year, marking a year-on-year growth of 12.3%.",
            "Sentiment": "positive",
            "PublishDate": 1769591569684,
            "Source": "co_actions_results"
        },
        {
            "Title": "Monte Carlo Board Meet Set for Jan 28 Q3FY26 Results",
            "Summary": "Monte Carlo Fashions Limited has scheduled a board meeting on January 28, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768913129691,
            "Source": "co_actions_results"
        },
        {
            "Title": "Monte Carlo Forms Solar Energy Subsidiary",
            "Summary": "Monte Carlo Fashions establishes MCFL Energy Projects Private Limited, a new subsidiary focused on solar power initiatives, marking the company's entry into renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1768893384360,
            "Source": "stocks"
        },
        {
            "Title": "Monte Carlo Fashions Board Approves Solar Subsidiary",
            "Summary": "Monte Carlo Fashions board approves incorporation of wholly owned subsidiary MCFL Energy Projects Private Limited to execute 35 MW solar projects worth ₹147 crores under PM KUSUM-C scheme.",
            "Sentiment": "positive",
            "PublishDate": 1766499935134,
            "Source": "stocks"
        },
        {
            "Title": "Monte Carlo Fashions Wins ₹147 Cr Solar Project",
            "Summary": "Monte Carlo Fashions Limited secured multiple Letters of Award from MPUVNL for 35 MW solar power plants worth approximately ₹147.00 crores under PM-KUSUM scheme in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1766497101490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Monte Carlo Fashions Reports Strong Q2 Performance with 13% Revenue Growth and Margin Expansion",
            "Summary": "Monte Carlo Fashions achieved INR 249 crores revenue in Q2 with 13% year-on-year growth, while EBITDA surged 47% to INR 42 crores with margins expanding to 16.73% from 12.88%. The company expects strong winter season performance and plans to revise guidance upward in Q3, driven by healthy demand across categories and reduced channel inventory levels.",
            "Sentiment": "positive",
            "PublishDate": 1763453949715,
            "Source": "earnings"
        },
        {
            "Title": "Monte Carlo Fashions Plans Retail Expansion and New Product Lines",
            "Summary": "Monte Carlo Fashions is expanding its retail footprint to over 400 exclusive stores. The company is launching new athleisure and denim product lines while focusing on premiumization and digital sales growth. The company expects strong festive and winter-led growth and aims to improve EBITDA margins and generate sustainable cash flows through these strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762963270563,
            "Source": "stock"
        },
        {
            "Title": "Monte Carlo Fashions Reports Loss in Q2 Results for Quarter Ended September 2025",
            "Summary": "Monte Carlo Fashions Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported a standalone loss after tax of ₹63 crores for the quarter, compared to a loss of ₹80 crores in the previous quarter. Revenue from operations was ₹13,853 lakhs for the quarter. On a consolidated basis, the company reported a loss after tax of ₹90 crores for the quarter. The company's inventories increased to ₹64,692 lakhs from ₹50,318 lakhs. Short-term borrowings increased significantly to ₹51,314 lakhs from ₹29,373 lakhs. The Board of Directors approved the unaudited financial results in their meeting held on November 12, 2025. The results were reviewed by statutory auditors Deloitte Haskins & Sells.",
            "Sentiment": "negative",
            "PublishDate": 1762941965500,
            "Source": "earnings"
        },
        {
            "Title": "Monte Carlo Fashions Reports Strong Q2 Performance with Net Profit Doubling Year-over-Year",
            "Summary": "Monte Carlo Fashions reported significant growth in its Q2 results. Net profit increased to 162 million rupees compared to 80.1 million rupees in the same quarter last year. EBITDA rose to 415 million rupees from 283.6 million rupees year-over-year. The company's EBITDA margin improved to 16.7% from 12.91% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762940900969,
            "Source": "earnings"
        },
        {
            "Title": "Monte Carlo Fashions Reports 10% Revenue Growth Despite Losses in Q1 FY26",
            "Summary": "Monte Carlo Fashions Limited reported revenue of INR 139 crores in Q1 FY26, marking a 10% year-over-year increase. However, the company posted an EBITDA loss of INR 6 crores and a net loss of INR 16 crores. The online segment showed significant growth, particularly through the company's website, while the Rock It brand maintained growth momentum and footwear sales doubled. The company opened 3 new Cloak & Decker stores, bringing the total to 15, and plans to reach 35 stores by year-end. Management maintains current guidance of 10-11% revenue growth and 19% margins but expressed confidence in revising guidance upwards after Q2 FY26. The company expects strong performance in upcoming quarters driven by positive factors including good monsoon, early Diwali, strong wedding season, and reduced interest rates. Strategic initiatives include expansion in Western and Southern regions, partnerships with quick delivery platforms, and digital transformation collaboration with Salesforce.",
            "Sentiment": "positive",
            "PublishDate": 1754907575466,
            "Source": "earnings"
        },
        {
            "Title": "Monte Carlo Fashions Shares Audio Recording Link for Q1 FY26 Earnings Call",
            "Summary": "Monte Carlo Fashions Limited provided a link to the audio recording of their earnings conference call held on August 7, 2025 at 11:00 a.m. IST to discuss Q1 FY26 results. The company shared the recording link (https://www.montecarlocorporate.com/Pdfs/100345591754558134.mp3) with stock exchanges NSE and BSE. The communication was signed by Ankur Gauba, Company Secretary & Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1754563059635,
            "Source": "earnings"
        },
        {
            "Title": "Monte Carlo Plans National Expansion with 40-45 New Stores, Reports 115% Growth in Footwear Sales",
            "Summary": "Monte Carlo is planning national growth through the opening of 40-45 new exclusive brand outlets (EBOs), with a major focus on expansion in West and South India. The company reported a 115% increase in footwear sales and is experiencing growth in its home textiles segment. Monte Carlo is implementing digital upgrades through Salesforce and forming fast commerce partnerships to enhance its omnichannel strategy.",
            "Sentiment": "positive",
            "PublishDate": 1754490799063,
            "Source": "stock"
        },
        {
            "Title": "Monte Carlo Fashions Reports Wider Q1 Loss Despite Revenue Growth",
            "Summary": "Monte Carlo Fashions reported a net loss of 163 million rupees in Q1, compared to a loss of 133 million rupees in the same period last year. The company's revenue increased to 1.39 billion rupees from 1.26 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754482925928,
            "Source": "earnings"
        },
        {
            "Title": "Monte Carlo Fashions Recommends Dividend",
            "Summary": "Monte Carlo Fashions has recommended a dividend of 20 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748264803000,
            "Source": "result"
        },
        {
            "Title": "Monte Carlo Fashions Reports Q4 Financial Results",
            "Summary": "Monte Carlo Fashions has reported its Q4 financial results. The company's EBITDA improved to a gain of 60 million rupees, compared to a loss of 98.5 million rupees in the same quarter last year. The Q4 EBITDA margin was 2.89%. The company reported a standalone net loss of 103 million rupees, an improvement from the loss of 189.6 million rupees in the previous year's corresponding quarter. However, this represents a decline from a profit of 953 million rupees in the previous quarter. Q4 revenue was reported at 2.06 billion rupees, slightly down from 2.07 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748264755000,
            "Source": "result"
        },
        {
            "Title": "Monte Carlo Fashions Reports Strong Q3 Financial Performance",
            "Summary": "Monte Carlo Fashions has announced its Q3 financial results, showing significant improvements in key metrics. The company's EBITDA increased to 1.55 billion rupees from 1.22 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 28.22% from 24.17% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739263237000,
            "Source": "earnings"
        },
        {
            "Title": "Monte Carlo Fashions Reports Q3 Revenue Growth",
            "Summary": "Monte Carlo Fashions has announced its financial results for the third quarter. The company reported revenue of 5.4 billion rupees, compared to 5.04 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739263229000,
            "Source": "earnings"
        },
        {
            "Title": "Monte Carlo Fashions Reports 25% Increase in Q3 Consolidated Net Profit",
            "Summary": "Monte Carlo Fashions has announced its financial results for the third quarter. The company's consolidated net profit rose to 967 million rupees, up from 772 million rupees in the same period last year, representing a year-over-year increase of approximately 25%.",
            "Sentiment": "positive",
            "PublishDate": 1739263160000,
            "Source": "earnings"
        },
        {
            "Title": "Monte Carlo Fashions Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Monte Carlo Fashions has reported a decrease in its Q2 EBITDA to 283.6 million rupees, down from 342 million rupees in the same quarter last year. The company's EBITDA margin also declined to 12.91% from 16.09% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731581861000,
            "Source": "result"
        },
        {
            "Title": "Monte Carlo Fashions Reports Q2 Revenue Growth",
            "Summary": "Monte Carlo Fashions, an Indian clothing company, has reported its second quarter revenue for the current fiscal year. The company's revenue reached 2.2 billion rupees, showing an increase from 2.12 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731581718000,
            "Source": "result"
        },
        {
            "Title": "Monte Carlo Fashions Reports Q2 Net Profit Decline",
            "Summary": "Monte Carlo Fashions has reported a net profit of 80.1 million rupees for the second quarter, down from 134 million rupees in the same period last year. This represents a year-over-year decrease in profit. Additionally, the company reported a loss of 133 million rupees compared to the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731581680000,
            "Source": "result"
        }
    ]
}