{
    "Symbol": "MORARJEE",
    "ISIN": "INE161G01027",
    "News": [
        {
            "Title": "Morarjee Textiles Reports Rs 3,467 Lakhs Loss for Half Year Ended September 2020",
            "Summary": "Morarjee Textiles Limited reported a net loss after tax of Rs 3,467 lakhs for the half year ended September 30, 2020, compared to Rs 868 lakhs loss in the same period last year. Revenue from operations declined to Rs 5,551 lakhs from Rs 18,472 lakhs year-on-year. The company faced significant challenges due to COVID-19 lockdown affecting production and sales for almost two months, resulting in very low demand. During the quarter, an export performance bank guarantee of USD 16.15 million (Rs 11,891 lakhs) was invoked due to non-payment of service fees and interest. The company has been unable to redeem preference shares worth Rs 10 crores due in November 2019. Management expressed confidence in arranging sufficient liquidity and has approached NCLT for re-issuance of preference shares for 20 years. Basic and diluted earnings per share stood at negative Rs 9.54 for the half year.",
            "Sentiment": "negative",
            "PublishDate": 1761795471629,
            "Source": "earnings"
        },
        {
            "Title": "Morarjee Textiles Holds Twenty Eighth Committee of Creditors Meeting Under Insolvency Process",
            "Summary": "Morarjee Textiles Limited held its Twenty Eighth Meeting of Committee of Creditors on September 12, 2025, at 2:00 p.m. as part of its ongoing Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code 2016. The company's affairs, business and assets are being managed by Mr. Ravi Sethia, who was appointed as interim resolution professional by the National Company Law Tribunal, Mumbai on February 9, 2024, and later confirmed as Resolution Professional by the Committee of Creditors on May 22, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1758722578002,
            "Source": "corporate_action"
        }
    ]
}