{
    "Symbol": "MOREPENLAB",
    "ISIN": "INE083A01026",
    "News": [
        {
            "Title": "Morepen Labs Q3FY26 Net Profit Rises 3% YoY to ₹2750 Cr",
            "Summary": "Morepen Laboratories reported consolidated net profit of ₹2750.93 crores for Q3FY26, up 3% YoY. Revenue increased 7% to ₹48416 crores with strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770733900140,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morepen Labs Reports Share Transfer Status Under SEBI",
            "Summary": "Morepen Laboratories submitted status report on physical share transfer re-lodgement requests under SEBI's special window. One request received during January 1-6, 2026 period was rejected.",
            "Sentiment": "neutral",
            "PublishDate": 1769607584372,
            "Source": "stocks"
        },
        {
            "Title": "Morepen Labs gets HC stay on ₹117.94 cr GST notice",
            "Summary": "Himachal Pradesh High Court grants stay on GST show-cause notice alleging excess refund claims of ₹117.94 crore by Morepen Laboratories, with no immediate impact on operations.",
            "Sentiment": "positive",
            "PublishDate": 1767935541009,
            "Source": "stocks"
        },
        {
            "Title": "Morepen Lab Gets Court Stay on ₹118 Cr Tax Demand",
            "Summary": "Morepen Laboratories secures judicial relief as court grants stay on significant tax demand of ₹118 crores, providing temporary respite from regulatory proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1767924653963,
            "Source": "stocks"
        },
        {
            "Title": "Morepen Lab Gets Relief from ₹1.18 Billion Tax Demand",
            "Summary": "Court provides significant relief to Morepen Laboratories by halting a substantial tax demand of ₹1.18 billion, offering temporary respite from regulatory pressure.",
            "Sentiment": "positive",
            "PublishDate": 1767881509521,
            "Source": "stocks"
        },
        {
            "Title": "Morepen Labs Gets High Court Stay on GST Notice",
            "Summary": "Morepen Laboratories Limited receives favorable High Court order staying GST Show Cause Notice worth ₹117.94 crores, eliminating immediate financial impact on operations.",
            "Sentiment": "positive",
            "PublishDate": 1767880924824,
            "Source": "stocks"
        },
        {
            "Title": "Morepen Laboratories Receives GST Notice Over ₹117.94 Crore Excess Refund Claim",
            "Summary": "Morepen Laboratories received a notice from GST authorities regarding an alleged excess GST refund claim of ₹117.94 crore, with allegations of violating CGST Act and rules. The pharmaceutical company plans to submit required documents and seek legal advice to address the matter.",
            "Sentiment": "negative",
            "PublishDate": 1764832419731,
            "Source": "stock"
        },
        {
            "Title": "Morepen Laboratories Plans ₹350 Cr Investment in USFDA-Compliant Facilities",
            "Summary": "Morepen Laboratories announced expansion plans in chronic therapies and API exports, investing ₹350 crore in new USFDA-compliant facilities at Baddi and Parwanoo while strengthening its position in cardiovascular and antidiabetic APIs. The company is targeting double-digit revenue CAGR with 20% margin profile by FY28 and foraying into peptide-based drug ingredients and nutraceuticals for export markets.",
            "Sentiment": "positive",
            "PublishDate": 1763137062360,
            "Source": "stock"
        },
        {
            "Title": "Morepen Laboratories Reports No Deviation in Rs 200 Crore QIP Fund Utilization",
            "Summary": "Care Ratings Limited submitted its quarterly monitoring report for Morepen Laboratories' Rs 200 crore QIP proceeds for the quarter ended September 30, 2025, confirming no deviation from stated objectives. The funds are being utilized for manufacturing facility modernization at Baddi and Masukhana plants and working capital requirements, with timeline extensions approved by the QIP committee due to ongoing civil and infrastructure work.",
            "Sentiment": "neutral",
            "PublishDate": 1763117502810,
            "Source": "stock"
        },
        {
            "Title": "Morepen Laboratories Reports Strong Quarterly Results with Exceptional Gains from Subsidiary Divestment",
            "Summary": "Morepen Laboratories posted consolidated net profit of Rs. 4,087.46 lakhs for the quarter ended September 30, 2025, boosted by exceptional gains of Rs. 2,582.54 lakhs from selling its stake in Dr. Morepen Limited and loss of control accounting. The company's shareholding in Dr. Morepen Limited reduced from 80% to 19.96% on July 31, 2025, resulting in it ceasing to be a subsidiary, while the Board approved a final dividend of Rs. 0.20 per equity share paid in September 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763115711991,
            "Source": "earnings"
        },
        {
            "Title": "Morepen Laboratories Secures Rs 50 Crore Unsecured Term Loan from Kookmin Bank",
            "Summary": "Morepen Laboratories Limited's Finance Committee approved an unsecured term loan facility of Rs 50 crore from Kookmin Bank for general corporate purposes. The 3-year loan carries an interest rate of prevailing repo rate plus 2.20% per annum, with quarterly principal repayments starting after a 1-year moratorium from first drawdown. The facility is backed by a personal guarantee from Mr. Sushil Suri, Promoter and Chairman Managing Director. The company's total outstanding loan amount stands at Rs 138.87 crore, including vehicle loans of Rs 7.05 crore and accrued interest as of November 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762782775196,
            "Source": "stock"
        },
        {
            "Title": "Morepen Laboratories Reports Zero Physical Share Transfer Requests in September 2025",
            "Summary": "Morepen Laboratories Limited submitted a status report showing no physical share transfer requests were received, processed, approved, or rejected during September 2025 under a special 6-month window for re-lodgement of physical share transfers. The report was prepared by the company's Registrar and Transfer Agent, MAS Services Limited, and covers the period from September 1 to September 30, 2025. All metrics including number of requests received, processed, approved, rejected, and average processing time were reported as nil or not applicable.",
            "Sentiment": "neutral",
            "PublishDate": 1760363730010,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Medipath Forms 50:50 Joint Venture with UAE's Bimedical FZE for Medical Device Manufacturing",
            "Summary": "Morepen Medipath has established a 50:50 joint venture partnership with UAE-based Bimedical FZE. The joint venture will focus on manufacturing medical devices.",
            "Sentiment": "positive",
            "PublishDate": 1757340600833,
            "Source": "order&deals"
        },
        {
            "Title": "Morepen Laboratories Conducts 40th AGM, Approves Dividend and Key Appointments",
            "Summary": "Morepen Laboratories Limited held its 40th Annual General Meeting on September 6, 2025, via video conferencing, chaired by Sushil Suri, Chairman and Managing Director. The company addressed 11 agenda items including adoption of audited financial statements for the year ended March 31, 2025, and declaration of a final dividend of ₹0.20 per equity share with face value of ₹2 each. Key resolutions included the reappointment of Sanjay Suri as director, ratification of cost auditor remuneration for M/s. Vijender Sharma & Co., and appointment of M/s. PD and Associates as secretarial auditor for five years. Special business items covered the re-appointment of Dr. Savita as Independent Director, Sanjay Suri's re-appointment as Whole-Time Director, and extension of time for transferring the Medical Devices Business to subsidiary Morepen Medipath Limited. The meeting also approved salary arrangements for relatives of key management personnel and conversion of loans into shares or convertible instruments. Electronic voting was conducted with Mr. Praveen Dua appointed as scrutinizer, and the meeting concluded at 2:19 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1757159792547,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Incorporates New Step-Down Subsidiary in Medical Devices Sector",
            "Summary": "Morepen Laboratories Limited announced the incorporation of Sigmacheck Health Private Limited, a new step-down subsidiary in the medical devices industry. The Ministry of Corporate Affairs approved the incorporation on August 13, 2025, with Corporate Identification Number U32509DL2025PTC453175. Sigmacheck Health is a wholly owned subsidiary of Morepen Medipath Limited and operates with an authorized and paid-up capital of ₹1,00,000 divided into 10,000 equity shares of ₹10 each. Morepen Laboratories holds an indirect 60% stake in the new subsidiary through Morepen Medipath Limited. The company stated the subsidiary was formed to cater to growing demands in the medical devices sector. The consideration was paid in cash, with Morepen Medipath Limited subscribing to all 10,000 equity shares for ₹1,00,000.",
            "Sentiment": "positive",
            "PublishDate": 1755081353547,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Reports Q1 2025 Results, Sets Dividend Record Date, and Approves Leadership Changes",
            "Summary": "Morepen Laboratories announced its unaudited financial results for Q1 2025, showing consolidated net profit of Rs 1,074.83 lakhs compared to Rs 3,616.79 lakhs in the same quarter last year. Standalone net profit was Rs 806.12 lakhs versus Rs 3,504.96 lakhs in Q1 2024. The company set August 30, 2025 as the record date for final dividend distribution for FY 2025, pending shareholder approval at the 40th AGM. The board approved the re-appointment of Sanjay Suri as Whole-Time Director for three years from August 13, 2025 to August 12, 2028, and appointed M/s. PD and Associates as Secretarial Auditor for five years from FY 2025-26 to 2029-30. The company also approved extension of time for transferring its Medical Devices Business to subsidiary Morepen Medipath Limited. Additionally, the company's shareholding in Dr. Morepen Limited decreased from 80% to 19.94% following equity transactions. The 40th AGM is scheduled for September 6, 2025 via video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1754472477855,
            "Source": "earnings"
        },
        {
            "Title": "Morepen Laboratories Reports Decline in Q1 Financial Performance",
            "Summary": "Morepen Laboratories reported Q1 revenue of 4.2 billion rupees, down from 4.55 billion rupees in the same period last year. The company's consolidated net profit fell significantly to 114 million rupees compared to 362 million rupees year-over-year. EBITDA declined to 242 million rupees from 516 million rupees, while EBITDA margin compressed to 5.68% from 11.34% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754471995596,
            "Source": "earnings"
        },
        {
            "Title": "Morepen Laboratories Sells Subsidiary Stake for ₹30.65 Crore, Shareholding Drops to 19.94%",
            "Summary": "Morepen Laboratories Limited sold 1.53 crore equity shares of its subsidiary Dr. Morepen Limited (DML) to related party entities for ₹30.65 crore. The transaction reduced Morepen's shareholding in DML from 80% to 49.91%, causing DML to cease being a subsidiary. The company stated it wants to focus on its core Active Pharmaceutical Ingredient (API) business, as DML's over-the-counter business has not meaningfully contributed to performance over two decades. Additionally, DML executed an agreement to acquire 100% equity of Groom Town Private Limited for ₹153.01 crore through fresh equity issuance of 7.64 crore shares. This acquisition will further reduce Morepen's stake in DML to 19.94%. Groom Town operates aspirational consumer and personal-care brands with distribution across e-commerce platforms including Blinkit, Zepto, Amazon, and Flipkart. Both transactions were valued by independent registered valuers.",
            "Sentiment": "neutral",
            "PublishDate": 1753979863504,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Forms New Step-Down Subsidiary SIGMACHECK HEALTH for Medical Devices",
            "Summary": "Morepen Laboratories Limited announced the formation of a new step-down subsidiary named SIGMACHECK HEALTH PRIVATE LIMITED through its subsidiary Morepen Medipath Limited. The new entity will focus on medical devices to meet growing market demands. Morepen Medipath Limited will subscribe to 10,000 shares of Rs. 10 each for a total investment of Rs. 1,00,000. Morepen Laboratories will indirectly hold 60% equity in the new subsidiary through Morepen Medipath Limited. The subsidiary will be incorporated in India, with the exact incorporation date to be communicated later.",
            "Sentiment": "positive",
            "PublishDate": 1753440800900,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Lab Establishes Dubai-Based Subsidiary for Medical Device Expansion",
            "Summary": "Morepen Lab has launched a subsidiary based in Dubai as part of its strategy to expand its medical device business globally. The move represents the company's efforts to strengthen its international presence in the medical device sector.",
            "Sentiment": "positive",
            "PublishDate": 1753197045009,
            "Source": "stock"
        },
        {
            "Title": "Morepen Laboratories Incorporates Medical Equipment Trading Subsidiary in Dubai",
            "Summary": "Morepen Laboratories Limited has incorporated a new step-down subsidiary called MOREPEN MEDICAL EQUIPMENT TRADING L.L.C in Dubai, UAE on July 22, 2025. The entity is wholly owned by Morepen Medipath Limited (formerly Morepen Medtech Limited) and operates as a step-down subsidiary of Morepen Laboratories. The subsidiary has an authorized capital of AED 100,000 consisting of 100 shares of AED 1,000 each. Morepen Laboratories indirectly holds 60% shareholding through its subsidiary. The new entity will focus on sales and marketing of medical devices in international markets including Dubai and other regions. The consideration for the acquisition was made in cash, with Morepen Medipath Limited subscribing to all 100 shares for the full authorized capital amount.",
            "Sentiment": "positive",
            "PublishDate": 1753194463740,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Reduces Stake in Morepen Medipath",
            "Summary": "Morepen Laboratories has decreased its ownership stake in Morepen Medipath Ltd to 60% following a new share issuance. The news suggests a dilution of Morepen Laboratories' ownership in its subsidiary due to additional shares being issued.",
            "Sentiment": "neutral",
            "PublishDate": 1751301308000,
            "Source": "default"
        },
        {
            "Title": "Morepen Laboratories: Q4 Profit Drops 31%, Plans Dubai Subsidiary",
            "Summary": "Morepen Laboratories reported a 31% YoY decline in Q4 net profit to Rs 20 crore. Total income rose to Rs 470 crore. FY25 net profit increased to Rs 118 crore. Board approved Rs 0.20 per share dividend and plans for a new subsidiary in Dubai.",
            "Sentiment": "neutral",
            "PublishDate": 1747055437000,
            "Source": "result"
        },
        {
            "Title": "Morepen Laboratories Amends Business Transfer Agreement",
            "Summary": "Morepen Laboratories has executed an addendum to its existing Business Transfer Agreement with Morepen Medipath. This suggests a modification or update to the terms of their previous business arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1747047162000,
            "Source": "default"
        },
        {
            "Title": "Morepen Laboratories Reports Q4 Financial Results",
            "Summary": "Morepen Laboratories announced its Q4 financial results. The company's EBITDA decreased to 423 million rupees from 483.8 million rupees year-over-year, with EBITDA margin dropping to 9.07% from 11.44%. Consolidated net profit fell to 203 million rupees from 287.4 million rupees year-over-year, but increased from 267 million rupees quarter-over-quarter. Revenue grew to 4.7 billion rupees from 4.23 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747046895000,
            "Source": "result"
        },
        {
            "Title": "Morepen Laboratories to Consider Q4 Results on May 12",
            "Summary": "Morepen Laboratories has announced that it will consider and approve its financial results for the fourth quarter on May 12. This is a standard procedure for publicly traded companies to review and release their quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1746451575000,
            "Source": "default"
        },
        {
            "Title": "Morepen Laboratories: CDSCO Approves Studies for Fatty Liver Drug Resmetirom",
            "Summary": "Morepen Laboratories received CDSCO approval to conduct bioequivalence studies for Resmetirom, a drug treating non-alcoholic steatohepatitis (NASH). The company plans to start clinical trials and is considering out-licensing opportunities. The global NASH treatment market is expected to grow from $2.5 billion in 2024 to over $16 billion by 2032.",
            "Sentiment": "positive",
            "PublishDate": 1745916406000,
            "Source": "normal_news"
        },
        {
            "Title": "Morepen Laboratories: Receives Approval for Resmetirom Bioequivalence Studies",
            "Summary": "Morepen Laboratories has obtained CDSCO approval to conduct bioequivalence studies for Resmetirom tablets, a potential NASH treatment, in 60mg, 80mg, and 100mg dosages. This positions Morepen among the first Indian pharma companies ready for the drug's global launch. The global NASH treatment market is projected to grow from $2.5 billion in 2024 to over $16 billion by 2032.",
            "Sentiment": "positive",
            "PublishDate": 1745902014000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Labs to Launch New Fatty Liver Drug Resmetirom",
            "Summary": "Morepen Laboratories has announced plans to introduce Resmetirom, a novel medication for the treatment of fatty liver disease. This move represents a significant expansion of the company's pharmaceutical portfolio and could potentially address a growing health concern.",
            "Sentiment": "positive",
            "PublishDate": 1745897653000,
            "Source": "default"
        },
        {
            "Title": "Morepen Laboratories to Establish Subsidiary in Dubai",
            "Summary": "Morepen Laboratories has announced plans to incorporate a new subsidiary in Dubai. This move suggests the company is expanding its operations internationally, potentially to tap into new markets or strengthen its presence in the Middle East region.",
            "Sentiment": "positive",
            "PublishDate": 1745885369000,
            "Source": "default"
        },
        {
            "Title": "Morepen Laboratories to Establish Subsidiary in Dubai",
            "Summary": "Morepen Laboratories has announced plans to incorporate a new subsidiary company in Dubai. This strategic move suggests the company is expanding its international presence and potentially exploring new business opportunities in the Middle East region.",
            "Sentiment": "positive",
            "PublishDate": 1745843962000,
            "Source": "default"
        },
        {
            "Title": "Morepen Laboratories: Formulation Business Targets ₹1,000 Crore in Five Years",
            "Summary": "Morepen Laboratories aims to grow its formulation business from ₹325 crore to ₹1,000 crore in five years through market penetration, expanded field force, and a growing product portfolio. The company launched four new products in the domestic market and is a leading API exporter for six global molecules.",
            "Sentiment": "positive",
            "PublishDate": 1745506523000,
            "Source": "normal_news"
        },
        {
            "Title": "Morepen Labs Targets Rs 1,000 Crore in Formulation Business",
            "Summary": "Morepen Laboratories has launched four new RX products in April 2025, reinforcing its R&D-driven growth strategy. The company, with a current formulation business size of approximately Rs 325 crore, is now accelerating towards a Rs 1,000 crore target over the next five years.",
            "Sentiment": "positive",
            "PublishDate": 1745476753000,
            "Source": "default"
        },
        {
            "Title": "Morepen Laboratories: Ambitious Rs 5,000 Crore Revenue Target Set for FY30",
            "Summary": "Morepen Laboratories aims to reach Rs 5,000 crore revenue by FY30 with 15-16% EBITDA margins. The company plans to expand its finished dosage segment, targeting Rs 1,000 crore by FY30. It has hired 1,000 new employees to support growth. The API business is expected to grow at 8-10% CAGR, while medical devices have shown 15% CAGR.",
            "Sentiment": "positive",
            "PublishDate": 1745048579000,
            "Source": "normal_news"
        },
        {
            "Title": "Morepen Laboratories Targets Significant Growth in Formulation Business",
            "Summary": "Morepen Laboratories has announced ambitious growth plans for its formulation business. The company's current formulation business is valued at approximately Rs. 325 crore. Morepen Labs aims to expand this segment to reach Rs. 1,000 crore in finished dosages business within the next five years.",
            "Sentiment": "positive",
            "PublishDate": 1744342826000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories to Expand Salesforce by 1,000+ Professionals",
            "Summary": "Morepen Laboratories has announced plans to significantly expand its salesforce over the next three years. The company aims to add more than 1,000 professionals to its sales team during this period. For the upcoming fiscal year (FY26), Morepen expects to onboard over 200 new team members, marking a substantial increase in its sales workforce.",
            "Sentiment": "positive",
            "PublishDate": 1744342310000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Secures Approval for Loratadine Export to China",
            "Summary": "Morepen Laboratories has obtained approval to export Loratadine, an antihistamine medication, to China. This development opens up a new market opportunity for the company in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1743478463000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Executes Business Transfer Agreement with Morepen Medtech",
            "Summary": "Morepen Laboratories has entered into a Business Transfer Agreement with its subsidiary, Morepen Medtech. This agreement likely involves the transfer of certain business operations or assets between the parent company and its unit, potentially as part of a restructuring or strategic realignment of the company's operations.",
            "Sentiment": "neutral",
            "PublishDate": 1742342667000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Executes Business Transfer Agreement with Subsidiary",
            "Summary": "Morepen Laboratories has entered into a business transfer agreement with its subsidiary, Morepen Medtech. This corporate action involves the transfer of business operations between the parent company and its unit, potentially impacting the company's structure or operations.",
            "Sentiment": "neutral",
            "PublishDate": 1742305301000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Launches Empamore for Diabetes, Heart Failure, and Kidney Disease",
            "Summary": "Morepen Laboratories has introduced a new product called Empamore, designed to address diabetes, heart failure, and kidney disease. This launch represents a significant expansion of the company's pharmaceutical offerings in the treatment of chronic conditions.",
            "Sentiment": "positive",
            "PublishDate": 1742256098000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Ltd: Launches Affordable Diabetes Drug Empamore",
            "Summary": "Morepen Laboratories Ltd has introduced Empamore, a new cost-effective treatment for Type 2 diabetes, heart failure, and chronic kidney disease. The drug contains empagliflozin and is available in multiple formulations. It's manufactured at USFDA-approved facilities and is priced nearly 90% lower than existing brands.",
            "Sentiment": "positive",
            "PublishDate": 1742227142000,
            "Source": "normal_news"
        },
        {
            "Title": "Morepen Laboratories Launches Empamore for Diabetes, Heart Failure, and Kidney Disease",
            "Summary": "Morepen Laboratories has introduced a new product called Empamore, designed to address diabetes, heart failure, and kidney disease. This launch represents an expansion of the company's product portfolio in the healthcare sector, potentially targeting a significant patient population affected by these chronic conditions.",
            "Sentiment": "positive",
            "PublishDate": 1742217770000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Morepen Laboratories experienced a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 361 million rupees from 506 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 7.98% from 11.37% year-over-year, indicating a substantial reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738831042000,
            "Source": "earnings"
        },
        {
            "Title": "Morepen Laboratories Reports Q3 Revenue Growth",
            "Summary": "Morepen Laboratories has announced its financial results for the third quarter. The company reported revenue of 4.5 billion rupees, compared to 4.44 billion rupees in the same period last year, indicating a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1738831019000,
            "Source": "earnings"
        },
        {
            "Title": "Morepen Laboratories Reports Q3 Net Profit Decline",
            "Summary": "Morepen Laboratories announced its Q3 consolidated net profit of 267 million rupees, down from 320 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1738830999000,
            "Source": "earnings"
        },
        {
            "Title": "Morepen Laboratories Approves Hiving Off Medical Devices Business",
            "Summary": "Morepen Laboratories has approved the hiving off of its medical devices business to Morepen Medtech. This corporate restructuring will be executed through a slump sale, which is expected to be completed by September 30, 2025. The move suggests a strategic decision to separate and potentially focus on the medical devices segment as a distinct entity.",
            "Sentiment": "neutral",
            "PublishDate": 1736900096000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories to Hive Off Medical Devices Business",
            "Summary": "Morepen Laboratories has approved the hiving off of its medical devices business to Morepen Medtech through a slump sale. The transaction is expected to be completed by September 30, 2025. This strategic move suggests a restructuring of the company's operations, potentially to focus on core competencies or to unlock value in the medical devices segment.",
            "Sentiment": "neutral",
            "PublishDate": 1736862206000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories to Incorporate New Subsidiary",
            "Summary": "Morepen Laboratories has announced plans to incorporate a new subsidiary company. This corporate action indicates potential expansion or restructuring of the company's operations. However, specific details about the purpose or nature of the new subsidiary are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1735518099000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morepen Laboratories to Incorporate New Subsidiary",
            "Summary": "Morepen Laboratories has announced plans to incorporate a new subsidiary company. This corporate action indicates potential expansion or restructuring of the company's operations.",
            "Sentiment": "neutral",
            "PublishDate": 1735311346000,
            "Source": "corporate_action"
        },
        {
            "Title": "Dr Morepen: Targets Rs 500 Crore Revenue from Wellness Business",
            "Summary": "Dr Morepen, a subsidiary of Morepen Laboratories Ltd., aims to generate Rs 500 crore revenue from its new wellness category in 3-4 years. The company launched LightLife, a weight management program, expecting Rs 30 crore revenue in the first year. CEO Varun Suri anticipates 55% margins in this segment, with potential for international expansion.",
            "Sentiment": "positive",
            "PublishDate": 1734150372000,
            "Source": "normal_news"
        }
    ]
}