{
    "Symbol": "MOSCHIP",
    "ISIN": "INE935B01025",
    "News": [
        {
            "Title": "MosChip Partners with Kerala Blasters FC as Tech Partner",
            "Summary": "MosChip Technologies announces partnership with Kerala Blasters FC as Official Technology Partner for 2025-26 season, focusing on athlete performance and wellbeing technology integration.",
            "Sentiment": "positive",
            "PublishDate": 1770623457827,
            "Source": "stocks"
        },
        {
            "Title": "MosChip Q3FY26 Results: Revenue Up 18.26% YoY",
            "Summary": "MosChip Technologies reported consolidated revenue of ₹15,068.44 lakhs for Q3FY26, up 18.26% YoY. Net profit declined to ₹433.60 lakhs due to ₹581.86 lakhs exceptional item from new Labour Codes.",
            "Sentiment": "neutral",
            "PublishDate": 1769856046125,
            "Source": "co_actions_results"
        },
        {
            "Title": "MosChip Technologies Postal Ballot Results",
            "Summary": "MosChip Technologies announces successful completion of postal ballot with all three special resolutions passed, including appointment of two independent directors and revision of MD remuneration terms.",
            "Sentiment": "positive",
            "PublishDate": 1769001252086,
            "Source": "stocks"
        },
        {
            "Title": "MosChip Delivers Custom SoC to ISRO for Satellite Nav",
            "Summary": "MosChip Technologies successfully completed turnkey ASIC program delivering custom SoC in 28nm technology to ISRO's Space Applications Centre for India's satellite navigation program.",
            "Sentiment": "positive",
            "PublishDate": 1768804639678,
            "Source": "stocks"
        },
        {
            "Title": "MosChip Board Approves Postal Ballot for Key Appointments",
            "Summary": "MosChip Technologies board approved postal ballot from December 22, 2025 to January 20, 2026 for independent director appointments and MD remuneration revision. Also granted 1,24,384 ESOPs to employees.",
            "Sentiment": "positive",
            "PublishDate": 1765979509985,
            "Source": "stocks"
        },
        {
            "Title": "MosChip Partners with EMASS on Ultra-Low-Power Edge AI Chip Implementation",
            "Summary": "MosChip Technologies provided silicon implementation services for EMASS's ECS-DoT Edge AI System-on-Chip, contributing to physical design flows, tape-out coordination, packaging, and validation activities in 22nm technology. The RISC-V-based SoC targets up to 93% faster processing and 90% lower energy use for applications in wearables, drones, industrial IoT, and edge sensors.",
            "Sentiment": "positive",
            "PublishDate": 1764839760619,
            "Source": "stock"
        },
        {
            "Title": "MosChip Technologies Allots 3.14 Lakh Equity Shares Under ESOP Schemes",
            "Summary": "MosChip Technologies' Nomination and Remuneration Committee approved allotment of 3,14,536 equity shares of Rs. 2 face value each to eligible employees upon exercise of stock options under various ESOP schemes. The allotment increases the company's total equity shares from 19,23,78,311 to 19,26,92,847 shares, with new shares ranking pari-passu with existing shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764229977075,
            "Source": "corporate_action"
        },
        {
            "Title": "Moschip Technologies to Launch ProductXcelerate™ Blueprints at Embedded World North America",
            "Summary": "Moschip Technologies plans to introduce ProductXcelerate™ Blueprints at the Embedded World North America event. The blueprints integrate hardware, software, digital technologies, and artificial intelligence to accelerate product development processes for original equipment manufacturers (OEMs).",
            "Sentiment": "positive",
            "PublishDate": 1761798847100,
            "Source": "stock"
        },
        {
            "Title": "MosChip Technologies Resubmits Q2 FY26 Financial Results with Missing Cash Flow Statement",
            "Summary": "MosChip Technologies Limited resubmitted its unaudited financial results for the quarter ended September 30, 2025, after initially omitting the Consolidated Cash Flow Statement due to a scanning issue. The company reported consolidated revenue from operations of Rs 14,694.34 lakhs for the quarter, up from Rs 12,562.55 lakhs in the same period last year. Net profit after tax increased to Rs 1,215.26 lakhs compared to Rs 973.15 lakhs in the previous year quarter. For the half-year period, consolidated revenue reached Rs 28,253.02 lakhs versus Rs 20,597.67 lakhs last year, with net profit rising to Rs 2,305.06 lakhs from Rs 1,371.41 lakhs. The Board of Directors approved these results on October 24, 2025, and statutory auditors issued an unmodified review report.",
            "Sentiment": "positive",
            "PublishDate": 1761547853627,
            "Source": "earnings"
        },
        {
            "Title": "MosChip Technologies Shares Drop 9% Despite AgenticSky AI Platform Launch",
            "Summary": "MosChip Technologies shares fell 9.2% to Rs 257.75 on BSE despite launching AgenticSky, an AI platform designed to accelerate development of adaptive, AI-driven products. The platform includes reusable cores for visual intelligence, human-machine interaction, device optimization, and wearable applications, supported by a four-layer framework. The company claims AgenticSky can reduce development cycles by up to 40% and targets industries including healthcare, industrial automation, and consumer electronics. MosChip positions the platform as enabling products to operate autonomously while building user trust through contextual interactions.",
            "Sentiment": "negative",
            "PublishDate": 1759991549401,
            "Source": "stock"
        },
        {
            "Title": "MosChip Technologies Recovers 0.97% Despite MSCI Index Deletion and High Volatility Concerns",
            "Summary": "MosChip Technologies Limited shares gained 0.97% to ₹239.40, trading between ₹222.00 and ₹243.87. The stock opened at ₹235.00 against previous close of ₹237.10, with over 177.63 lakh shares worth ₹418.74 crore traded by 1.20 PM. MSCI announced the deletion of MosChip from the MSCI India Small Cap Index effective May 30, 2025, as part of quarterly rebalancing affecting 22 stocks. Both BSE and NSE placed the company under Additional Surveillance Measure framework due to high volatility. The stock had surged 63% over seven sessions before sharp corrections. MosChip shows annualized volatility of 70.69% and trades with 50% margin rates. The 52-week high of ₹268.75 was recorded on September 8, while the low stands at ₹129.98 from April 7. Recent rally was attributed to optimism around India's semiconductor mission, though MSCI deletion could trigger selling pressure from passive funds. Deliverable quantity represents just 25.48% of traded volume, indicating speculative trading activity.",
            "Sentiment": "neutral",
            "PublishDate": 1757491792028,
            "Source": "stock"
        },
        {
            "Title": "MosChip Technologies Drops 10% After 59% Rally in Seven Sessions",
            "Summary": "MosChip Technologies shares fell 10% to Rs 236.20, reversing part of a seven-session rally that had lifted the stock nearly 60% to a record high of Rs 268.75. The surge was driven by Prime Minister Modi's remarks at the Semicon India 2025 Summit about India capturing a significant share of the $1 trillion global semiconductor market. Trading volumes exceeded 1 crore shares compared to the 20-day average of 10 lakh shares. Technical analysts note the stock is in overbought territory with RSI at 85.5-87.90, trading above key moving averages but facing resistance at Rs 272-286. The company trades at a trailing P/E of around 125x and P/B of roughly 15x. Promoters hold 44.28% while retail investors own 37.1%, with no institutional or mutual fund ownership. Analysts suggest the current valuation reflects policy optimism rather than near-term fundamentals, with support levels identified at Rs 230-235.",
            "Sentiment": "neutral",
            "PublishDate": 1757399043543,
            "Source": "stock"
        },
        {
            "Title": "Moschip Technologies Hits All-Time High, Surges Over 50% in Week on Semiconductor Mission 2.0 Optimism",
            "Summary": "Moschip Technologies Ltd. reached an all-time high of Rs. 268.75 in early Monday trading, continuing a remarkable rally that has seen the stock surge over 50% since September 1. The shares have gained 30% over the past year. The rally is driven by positive sentiment surrounding India's Semiconductor Mission 2.0 and its potential impact on sector companies. Similar momentum has been seen in Kaynes Technologies and CG Power following Prime Minister Narendra Modi's Semicon India 2025 address. Moschip, which describes itself as India's largest independent semiconductor and systems design services company, offers end-to-end chip design solutions and serves global and domestic clients including technology OEMs, auto companies, consumer device manufacturers and government bodies. The company has a presence in the United States and brings technical expertise in chip design, an area the Indian government considers foundational for indigenous semiconductor capability. The stock's Relative Strength Index of 83.97 suggests it may be in overbought territory.",
            "Sentiment": "positive",
            "PublishDate": 1757310372992,
            "Source": "stock"
        },
        {
            "Title": "Moschip Technologies Hits Record High on India Semiconductor Mission 2.0 Plans",
            "Summary": "Moschip Technologies Ltd. shares reached a record high of Rs 228.87, surging 18.78% as India plans to launch Semiconductor Mission 2.0. The Ministry of Electronics and Information Technology is developing the second version of the national semiconductor mission, following the first version launched in 2021. Prime Minister Narendra Modi stated at Semicon 2025 that India will capture a major share of the semiconductor market and the government will build a supportive ecosystem for the sector. Moschip Technologies provides engineering solutions including systems and product designs, artificial intelligence, and machine learning services across India and the US. The stock gained 36.51% over five consecutive sessions and has risen 13.88% since its February 5 listing. Trading volume reached 33 times its 30-day average, with the relative strength index at 81.93 indicating overbought conditions.",
            "Sentiment": "positive",
            "PublishDate": 1756967631233,
            "Source": "stock"
        },
        {
            "Title": "MosChip Technologies Reports Strong Q1 Growth with 66% Revenue Jump and Leadership Changes",
            "Summary": "MosChip Technologies Limited reported consolidated total income of ₹13,616.10 lakhs for the quarter ended June 30, 2025, compared to ₹8,185.19 lakhs in the same quarter last year. Net profit after tax increased to ₹1,089.80 lakhs from ₹398.26 lakhs year-over-year. The company's Silicon Engineering Solutions segment generated revenue of ₹10,272.42 lakhs while Product Engineering Solutions contributed ₹3,286.26 lakhs. Basic earnings per share improved to ₹0.57 from ₹0.21 in the previous year quarter. The Board approved the resignation of Non-executive Director Mr. Naveed Ahmed Sherwani effective June 6, 2025. Additionally, the company granted 17,09,100 Employee Stock Options to eligible employees and allotted 91,908 equity shares upon exercise of existing stock options. The financial results were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1753877548139,
            "Source": "earnings"
        },
        {
            "Title": "Moschip Tech Reports Significant Growth in Q4 Financial Results",
            "Summary": "Moschip Tech has announced its Q4 consolidated financial results, showing substantial year-over-year improvements. The company's net profit increased to 87 million rupees, up from 9 million rupees in the same quarter last year and 111 million rupees in the previous quarter. Revenue grew to 1.35 billion rupees from 754 million rupees year-over-year. EBITDA rose to 143 million rupees from 74 million rupees, with the EBITDA margin improving to 10.65% from 9.79% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747873016000,
            "Source": "default"
        },
        {
            "Title": "MosChip Technologies Reports Strong Q4 Financial Results",
            "Summary": "MosChip Technologies has announced its Q4 financial results. The company's EBITDA increased to 143 million rupees from 74 million rupees year-over-year. The EBITDA margin improved to 10.65% from 9.79% in the same period. Consolidated net profit rose to 87 million rupees, up from 9 million rupees year-over-year and 111 million rupees quarter-over-quarter. Revenue for Q4 reached 1.35 billion rupees, compared to 754 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747840347000,
            "Source": "result"
        },
        {
            "Title": "MosChip Technologies: Launches GenAIoT Platform for Smart Product Development",
            "Summary": "MosChip Technologies introduced the MosChip DigitalSky GenAIoT platform, a comprehensive digital solutions suite for accelerating intelligent product development across multiple industries. The platform integrates IoT, AI, automation, and security features to reduce development time and improve efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1741239813000,
            "Source": "normal_news"
        },
        {
            "Title": "MosChip Technologies Launches MosChip DigitalSky GenAIoT Platform",
            "Summary": "MosChip Technologies has introduced a new platform called MosChip DigitalSky GenAIoT, designed to accelerate the development of next-generation connected and intelligent products. This platform aims to enhance the creation of advanced IoT and AI-enabled devices.",
            "Sentiment": "positive",
            "PublishDate": 1741223351000,
            "Source": "corporate_action"
        },
        {
            "Title": "Moschip Technologies to List on NSE",
            "Summary": "Moschip Technologies, a semiconductor and Internet of Things (IoT) company, is set to list on the National Stock Exchange (NSE) on February 5. This listing represents a significant corporate action that will increase the company's visibility and potentially improve its liquidity in the stock market.",
            "Sentiment": "positive",
            "PublishDate": 1738627780000,
            "Source": "corporate_action"
        },
        {
            "Title": "MosChip Technologies to List on NSE",
            "Summary": "MosChip Technologies is set to list on the National Stock Exchange (NSE) on February 5. This listing represents a significant corporate action for the company, potentially increasing its visibility and trading liquidity in the Indian stock market.",
            "Sentiment": "positive",
            "PublishDate": 1738592431000,
            "Source": "corporate_action"
        },
        {
            "Title": "MosChip Technologies Reports Significant EBITDA Growth in Q3",
            "Summary": "MosChip Technologies has reported a substantial year-over-year increase in its Q3 EBITDA, rising from 88 million rupees to 171 million rupees. The company's EBITDA margin also improved, increasing from 9.82% to 13.53% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738228002000,
            "Source": "earnings"
        },
        {
            "Title": "MosChip Technologies Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "MosChip Technologies has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 111 million rupees, up from 22 million rupees in the same quarter last year. Revenue also saw a significant rise, reaching 1.26 billion rupees compared to 896 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738227872000,
            "Source": "earnings"
        },
        {
            "Title": "MosChip Technologies to Consider Q3 Results on January 30",
            "Summary": "MosChip Technologies Limited has announced that it will consider its financial results for the third quarter on January 30. This indicates that the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1737552455000,
            "Source": "earnings"
        },
        {
            "Title": "MosChip Technologies Reports Q2 EBITDA Growth",
            "Summary": "MosChip Technologies has reported its Q2 financial results. The company's EBITDA increased to 157 million rupees, up from 102 million rupees in the same quarter last year. However, the EBITDA margin decreased to 12.53% from 14.22% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729755761000,
            "Source": "result"
        },
        {
            "Title": "MosChip Technologies Reports Strong Q2 Revenue Growth",
            "Summary": "MosChip Technologies has announced its Q2 revenue results, reporting 1.25 billion rupees compared to 718 million rupees in the same quarter last year. This represents a significant year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1729755717000,
            "Source": "result"
        },
        {
            "Title": "MosChip Technologies Reports Strong Q2 Profit Growth",
            "Summary": "MosChip Technologies has reported a significant increase in consolidated net profit for the second quarter. The company's net profit rose to 97 million rupees, up from 36 million rupees in the same period last year, representing a year-over-year growth of approximately 169%.",
            "Sentiment": "positive",
            "PublishDate": 1729755681000,
            "Source": "result"
        },
        {
            "Title": "MosChip Technologies Joins Renesas RZ Partner Ecosystem",
            "Summary": "MosChip Technologies has become an AI/ML design partner in the Renesas RZ Partner Ecosystem. This partnership suggests MosChip will collaborate with Renesas to develop AI and machine learning solutions for the RZ microprocessor series.",
            "Sentiment": "positive",
            "PublishDate": 1729560838000,
            "Source": "corporate_action"
        },
        {
            "Title": "MosChip: Launches DigitalSky Suite for Enterprise Transformation",
            "Summary": "<p><span class=\"neutral\">MosChip Technologies</span> introduces <span class=\"positive\">MosChip DigitalSky</span>, a suite of <b>digital solutions</b> designed to <span class=\"positive\">transform</span> global enterprises by <b>connecting Products, IT, and Operations</b> with embedded intelligence. The suite aims to <span class=\"positive\">enhance productivity, operational effectiveness, and stakeholder experience</span> across various business functions.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728027600000,
            "Source": "normal_news"
        }
    ]
}