{
    "Symbol": "MOTHERSON",
    "ISIN": "INE775A01035",
    "News": [
        {
            "Title": "Motherson Q3FY26 Revenue Jumps 13.5% to ₹31,409 Cr",
            "Summary": "Samvardhana Motherson International reported strong Q3FY26 results with revenue rising 13.5% YoY to ₹31,409.39 crores. Net profit grew 8.9% to ₹1,072.27 crores despite exceptional expenses of ₹46.48 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770712641795,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Begins Tender Offer for Yutaka Giken",
            "Summary": "Samvardhana Motherson International announces commencement of tender offer for 81% stake acquisition in Japanese auto parts maker Yutaka Giken Co., Ltd. starting February 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770372062391,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Plans Tender Offer for Yutaka Giken",
            "Summary": "Samvardhana Motherson International announces plans to launch a tender offer for Japanese automotive component manufacturer Yutaka Giken in early February, marking a strategic expansion move.",
            "Sentiment": "positive",
            "PublishDate": 1769759683424,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Q3FY26 Earnings Call Set for Feb 10",
            "Summary": "Samvardhana Motherson International schedules earnings conference call for February 10, 2026, to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769174149788,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Issues ₹250 Cr Commercial Paper",
            "Summary": "Samvardhana Motherson International Limited has successfully issued commercial paper worth ₹250 crores with 6.35% interest rate and 50-day tenure, listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769008809439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Dissolves Hong Kong Subsidiary Atsumitec",
            "Summary": "Samvardhana Motherson International announces dissolution of indirect subsidiary Atsumitec (HK) Co. Limited, which had HKD 0.53 million revenue in FY25 and was not carrying any business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768827383963,
            "Source": "stocks"
        },
        {
            "Title": "Volkswagen Projects Rising EV Sales with New Models",
            "Summary": "Volkswagen anticipates increased electric vehicle sales this year as the German automaker prepares to launch a range of affordable plug-in models to expand its EV portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768294724983,
            "Source": "stocks"
        },
        {
            "Title": "Motherson Forms JV with Egtronics for Clean Mobility",
            "Summary": "Samvardhana Motherson International finalizes joint venture with Egtronics, securing 51% ownership stake to strengthen its position in clean mobility electronics segment.",
            "Sentiment": "positive",
            "PublishDate": 1767836535404,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Gets ECMS Incentives for ₹1,900 Cr Investment",
            "Summary": "Samvardhana Motherson International's subsidiary secures government incentives under Electronics Components Manufacturing Scheme for ₹1,900 crore investment in Tamil Nadu facility, creating 5,000+ jobs.",
            "Sentiment": "positive",
            "PublishDate": 1767594704603,
            "Source": "stocks"
        },
        {
            "Title": "GAM Opposes Motherson's Honda Unit Acquisition Deal",
            "Summary": "Swiss asset manager GAM has expressed disapproval of Samvardhana Motherson International's proposed acquisition of a Honda unit, according to Wall Street Journal reports.",
            "Sentiment": "negative",
            "PublishDate": 1766992651558,
            "Source": "co_actions_results"
        },
        {
            "Title": "Kotak Maintains Sell Rating on Motherson at ₹95",
            "Summary": "Kotak Securities maintains sell rating on Samvardhana Motherson International with ₹95 price target, citing weak global automotive trends and high valuation concerns.",
            "Sentiment": "negative",
            "PublishDate": 1766462461744,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Issues Buy Call on Samvardhana Motherson",
            "Summary": "Nomura Securities has issued a buy recommendation for Samvardhana Motherson International with a target price of ₹125.00, indicating positive analyst sentiment for the auto ancillary stock.",
            "Sentiment": "positive",
            "PublishDate": 1766461686501,
            "Source": "stocks"
        },
        {
            "Title": "Motherson Board Approves €207M Nexans Autoelectric Deal",
            "Summary": "Samvardhana Motherson International's board approved acquisition of Nexans Autoelectric business for €207 million enterprise value, expected to close by Q1 FY27 subject to regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1766394713351,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Subsidiary Faces ₹37.63L GST Penalty",
            "Summary": "Samvardhana Motherson's wholly-owned subsidiary SMR Automotive Systems India receives penalty order from Tamil Nadu Commercial Tax Officer for GST compliance issues including IGST/ITC and export documentation.",
            "Sentiment": "negative",
            "PublishDate": 1765718299303,
            "Source": "stocks"
        },
        {
            "Title": "Motherson Completes Acquisition of Remaining Stake",
            "Summary": "Samvardhana Motherson International Limited has completed the acquisition of the remaining 10% stake in Motherson Lumen Systems South Africa Pty Ltd on December 10, 2025, making it an indirect wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1765386435222,
            "Source": "co_actions_results"
        },
        {
            "Title": "Samvardhana Motherson to Acquire Remaining 10% Stake in Motherson Lumen SA",
            "Summary": "Samvardhana Motherson announced its plan to acquire the remaining 10% stake in Motherson Lumen SA. This acquisition will give the company full ownership of the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1764862111821,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson Completes Acquisition of Rubbertec Group Business and Assets",
            "Summary": "Samvardhana Motherson International Limited has completed the acquisition of Rubbertec Group's business and assets through its indirect subsidiary Motherson Elastomers Pty Ltd on December 3, 2025. The acquisition was structured as a going concern succession deal, with all conditions precedent now fulfilled.",
            "Sentiment": "positive",
            "PublishDate": 1764765599029,
            "Source": "order&deals"
        },
        {
            "Title": "Motherson Subsidiary Saddles Receives Rs 16.05 Lakh ESI Penalty for Pre-Acquisition Period",
            "Summary": "Saddles International Automotive Aviation Interiors, a subsidiary of Samvardhana Motherson International Limited, received a penalty of Rs 16,05,343 from ESIC Pune for delayed deposit of employer-employee contributions during September 2020 to January 2022. The violation occurred before Saddles became Motherson's subsidiary in July 2023, with no financial impact expected as it is covered by seller indemnity.",
            "Sentiment": "neutral",
            "PublishDate": 1763803670471,
            "Source": "stock"
        },
        {
            "Title": "Motherson Subsidiary Faces EUR 56,319 Penalty for Delayed VAT and Payroll Tax Payments in Germany",
            "Summary": "Motherson Sequencing and Assembly Services Global Group GmbH, an indirect wholly owned subsidiary of Samvardhana Motherson International Limited, received a penalty of EUR 56,319 (approximately INR 57.69 lakh) from German tax authorities for delayed payment of VAT and payroll taxes for September 2025. The company stated there is no material impact on financial or operational activities of the subsidiary or the parent company.",
            "Sentiment": "negative",
            "PublishDate": 1763729763218,
            "Source": "stock"
        },
        {
            "Title": "Motherson Sumi Wiring India Sees Rs. 34.16 Crore Block Trade on NSE",
            "Summary": "Motherson Sumi Wiring India Ltd. witnessed a block trade worth Rs. 34.16 crores involving approximately 7,102,643 shares at Rs. 48.09 per share on the NSE. The transaction represents a significant bulk deal activity for the automotive wiring harness manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1763701163690,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson Reports Strong Q2 FY26 Results with 8.5% Revenue Growth",
            "Summary": "Samvardhana Motherson International Limited delivered revenues of Rs. 30,173 crores, EBITDA of Rs. 2,719 crores and normalized PAT of Rs. 856 crores for Q2 FY26, achieving 8.5% year-on-year growth and double-digit growth in normalized EBITDA and PAT. The company's order book stands at Rs. 87.2 billion as of September 2025, with strong momentum in aerospace (37% H1 growth) and consumer electronics businesses (36% quarter-on-quarter growth), while transformative measures in European operations show improvement with polymer business profitability rising from 6.4% to 7.4%.",
            "Sentiment": "positive",
            "PublishDate": 1763645710624,
            "Source": "earnings"
        },
        {
            "Title": "Motherson Subsidiary Faces EUR 55,394 Penalty for Delayed Tax Payments in Germany",
            "Summary": "Finanzamt Karlsruhe imposed a penalty of EUR 55,394 (approximately INR 56.85 lakh) on Motherson Sequencing and Assembly Services GmbH for delayed payment of VAT and payroll taxes for September 2025. The company states there is no material impact on financial or operational activities of the subsidiary or parent company Samvardhana Motherson International Limited.",
            "Sentiment": "negative",
            "PublishDate": 1763531321416,
            "Source": "stock"
        },
        {
            "Title": "Samvardhana Motherson Posts 8.5% Revenue Growth to Rs 30,173 Crores in Q2FY26",
            "Summary": "Samvardhana Motherson International Limited reported consolidated revenue of Rs 30,173 crores for Q2FY26, marking 8.5% year-on-year growth. EBITDA increased 8.9% to Rs 2,719 crores while profit after tax (concern share) grew 15% to Rs 856 crores. The company maintained a stable net leverage ratio of 1.1x despite continued growth investments. Two new greenfield operations were operationalized during the quarter, with 10 more greenfields at various completion stages. The company announced three acquisitions: Yutaka Giken in Japan strengthening Honda partnership, Rubbertec in Australia for elastomer capabilities, and RiderDome in Singapore for advanced rider assistance systems. Booked business stands at USD 87.2 billion to be executed over 5-6 years. The board approved acquisition of Onega Solar Power Limited through subsidiary Motherson New Energy Limited for Rs 13.19 million to develop a 15 MWp solar project in Uttar Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1763029068075,
            "Source": "earnings"
        },
        {
            "Title": "Samvardhana Motherson International Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Samvardhana Motherson International reported quarterly net profit of 8.3 billion rupees, down from 8.8 billion rupees year-over-year but above analyst estimates of 7.5 billion rupees. The company's EBITDA increased to 26.1 billion rupees from 24.5 billion rupees year-over-year, surpassing estimates of 25.4 billion rupees. EBITDA margin improved to 8.7% from 8.31% year-over-year, beating the estimated 8.5%. Revenue grew to 299 billion rupees from 278 billion rupees year-over-year, closely matching estimates of 298 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1763026525307,
            "Source": "earnings"
        },
        {
            "Title": "Samvardhana Motherson Q2 Results Preview: Analysts Expect 15% Profit Drop Despite Revenue Growth",
            "Summary": "Samvardhana Motherson International Ltd. shares traded 0.5% higher ahead of its September quarter results announcement. Analysts polled by CNBC-TV18 expect net profit to decline 15% year-on-year to ₹750 crore, while EBITDA is projected to increase 4% to ₹2,536 crore. Revenue is anticipated to grow 7% to ₹29,800 crore, driven by wiring harness, integrated assemblies, and vision systems. However, EBITDA margin is expected to contract by 30 basis points to 8.5% from 8.8% previously, primarily due to pressure on margins in the modules and polymers businesses. The stock has gained only 3% year-to-date and was trading at ₹106.61.",
            "Sentiment": "neutral",
            "PublishDate": 1763016981193,
            "Source": "earnings"
        },
        {
            "Title": "Samvardhana Motherson Issues INR 250 Crore Commercial Paper with 5.95% Interest Rate",
            "Summary": "Samvardhana Motherson International Limited has issued commercial paper worth INR 250 crores, comprising 5,000 papers with a face value of Rs. 5 lakh each. The commercial paper was issued on November 6, 2025, and will mature on December 17, 2025, carrying an interest rate of 5.95% charged upfront. The papers are listed on BSE Limited under ISIN INE775A14798 with a credit rating of ICRA A1+ IND A1. The issue price is Rs. 4,96,680.50 per paper, and ICICI Bank Limited serves as the issuing and paying agent. Trading will occur in dematerialized form with a standard denomination of Rs. 5 lakhs and multiples thereof.",
            "Sentiment": "neutral",
            "PublishDate": 1762568247160,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson International Sets Up Employee Stock Option Trust",
            "Summary": "Samvardhana Motherson International Limited has established the Motherson ESOP Trust, an irrevocable employee welfare trust for administering the company's Employee Stock Option Scheme 2025. The trust deed was executed on September 30, 2025, with an initial corpus of Rs. 10,000. The trust will be managed by two trustees - Arjun Puri and Gautam Mukherjee. The trust is authorized to acquire company shares through primary issuance or secondary acquisition and transfer them to eligible employees upon option exercise. The trust has been set up in compliance with SEBI regulations for share-based employee benefits and will facilitate the company's equity-based compensation plans to attract, retain and incentivize employees.",
            "Sentiment": "positive",
            "PublishDate": 1762541341245,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson Faces GST Penalty of ₹38.82 Lakh on Guarantee Commission",
            "Summary": "Samvardhana Motherson International Limited received a penalty order of ₹38.82 lakh from the Joint Commissioner (ST), GST Appeals, Chennai for alleged non-payment of Goods & Service Tax on guarantee commission disclosed in consolidated financial statements for financial year 2021-22. The penalty relates to corporate guarantees provided by the company to its wholly owned subsidiaries. The company states it had already discharged the applicable GST under Uttar Pradesh GST registration at the place of guarantee issuance and maintains there is no material impact on its financial or operational activities. The company plans to file an appeal against the order within the statutory timeline.",
            "Sentiment": "negative",
            "PublishDate": 1762374831062,
            "Source": "stock"
        },
        {
            "Title": "Samvardhana Motherson Incorporates New Packaging Subsidiary in Hungary Through Joint Venture",
            "Summary": "Samvardhana Motherson International Limited has incorporated a new subsidiary called Motherson Sanko Sustainable Packaging Products EU in Hungary on November 3, 2025. The subsidiary was established through Motherson Global Investments B.V., a step-down wholly owned subsidiary, as part of a joint venture agreement with Sanko Co. Ltd., Japan that was previously announced in February 2025. The new entity will engage in designing, developing, marketing, manufacturing and distributing plastic packaging materials and moulded products related to material handling solutions, including pallets, crates and containers. The subsidiary has a total subscribed capital of Euro 10,000, with consideration paid in cash by both shareholders according to their respective shareholding ratios.",
            "Sentiment": "positive",
            "PublishDate": 1762330015422,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson Completes Initial $0.5 Million Investment in Singapore's Rider Dome",
            "Summary": "Samvardhana Motherson International Limited has completed an initial investment of $0.5 million in Rider Dome Pte. Ltd., a Singapore-incorporated company, through its wholly owned subsidiary MSSL (S) Pte Ltd. The investment comprises $0.2 million in primary equity for a 10% stake and $0.3 million in 12% optionally convertible secured notes. This represents part of a total primary capital commitment of $2 million to be deployed in multiple milestone-linked tranches. Rider Dome has allotted the 10% equity stake and 12% optionally convertible secured notes to MSSL-Singapore on October 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761841090927,
            "Source": "stock"
        },
        {
            "Title": "Samvardhana Motherson International Appoints Gandharv Tongia As Group CFO",
            "Summary": "Samvardhana Motherson International Ltd announced the appointment of Gandharv Tongia as Group Chief Financial Officer Designate. Tongia's formal appointment as Group CFO will begin on November 15, 2025. He will undergo a handover period from Kunal Malani, who is being elevated to President-Group Strategy & Transformation to drive Vision 2030 efforts. Tongia will join the Motherson Leadership Team and report to the Board. He brings over two decades of experience, having worked at Big 4 Audit firms and Polycab India Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1761815753124,
            "Source": "corporate_governance"
        },
        {
            "Title": "Samvardhana Motherson International Releases Pledged Shares Worth 2.60% Stake",
            "Summary": "Samvardhana Motherson International Limited released 8.20 crore pledged shares of Motherson Sumi Systems Limited on January 25, 2022, representing 2.60% of total share capital. The shares were pledged to IDBI Trusteeship Services Limited on behalf of BNP Paribas SA and MUFG Securities EMEA PLC. The company stated there was no acquisition or sale of shares involved in this release. This disclosure comes after Samvardhana Motherson International merged with Motherson Sumi Systems Limited effective January 21, 2022, following approval from the National Company Law Tribunal.",
            "Sentiment": "neutral",
            "PublishDate": 1761796097530,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson International Appoints Hemant Barge as Chief Procurement Officer",
            "Summary": "Samvardhana Motherson International has appointed Hemant Barge as Chief Procurement Officer. Barge brings over 30 years of experience from Tata Motors to his new role at the company.",
            "Sentiment": "positive",
            "PublishDate": 1761750686413,
            "Source": "corporate_governance"
        },
        {
            "Title": "Samvardhana Motherson International Approves AU$5 Million Acquisition of Rubbertic Group",
            "Summary": "Samvardhana Motherson International has approved the acquisition of Rubbertic Group's business and assets for AU$5 million. The transaction is expected to be completed by Q3 FY 25-26.",
            "Sentiment": "positive",
            "PublishDate": 1761745140843,
            "Source": "order&deals"
        },
        {
            "Title": "Samvardhana Motherson Shares Under Pressure as Top Client Volkswagen Warns of Production Disruptions",
            "Summary": "Samvardhana Motherson International shares are in focus after Volkswagen AG, its largest client contributing 9% of revenue in financial year 2025, warned of potential production stoppages due to supply chain issues. The disruption stems from a dispute over Chinese-owned chipmaker Nexperia, which has created semiconductor supply constraints for European automakers after the Dutch government seized control citing security concerns and Beijing restricted chip exports in response. Volkswagen indicated production hasn't been affected yet but cautioned disruptions could occur short-term. Additionally, BMW, another major client accounting for 5% of Samvardhana Motherson's revenue, issued a profit warning reducing its automotive EBIT margin guidance to 5-6% from 5-7% and cutting free cash flow projections from over €5 billion to over €2.5 billion due to weak Chinese sales and higher costs. Samvardhana Motherson has implemented a mandate ensuring no single client exceeds 10% of total revenue as part of its five-year plan. The company's shares closed 0.5% lower at ₹105.25, up only 1.5% year-to-date but down 6% in the past month.",
            "Sentiment": "negative",
            "PublishDate": 1761186796213,
            "Source": "stock"
        },
        {
            "Title": "Motherson's Argentina Subsidiary Faces $3.7 Million Tax Penalty for VAT Compliance Issues",
            "Summary": "Motherson SAS Automotive Modules and Services Argentina S.A., a wholly owned subsidiary of Samvardhana Motherson International Limited, received a penalty of ARS 56,436,886.20 (approximately INR 3,665,406) from Argentina's tax authority ARCA. The penalty relates to improper VAT input claims and deductions made between 2019-2023 against non-compliant supplier invoices. The violations occurred before Motherson's acquisition of the business, which was completed on July 31, 2023. The company states there is no material impact on financial or operational activities and plans to pursue indemnity provisions with the seller, subject to limitation periods.",
            "Sentiment": "negative",
            "PublishDate": 1760623950164,
            "Source": "stock"
        },
        {
            "Title": "Samvardhana Motherson Submits NCLT Application for Share Capital Reduction in Subsidiary MTSL",
            "Summary": "Samvardhana Motherson International Limited (SAMIL) provided an update on its subsidiary Motherson Technology Services Limited's (MTSL) share capital reduction scheme. MTSL submitted an application on October 15, 2025, to the National Company Law Tribunal Mumbai Bench under Section 66 of the Companies Act 2013 for approval of the share capital reduction. SAMIL currently holds 92.96% equity shareholding in MTSL. Upon completion of the scheme, MTSL and its subsidiaries will become wholly-owned subsidiaries of SAMIL. The company had previously disclosed this scheme on August 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760608543715,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson Schedules Q2 Results Review for November 13",
            "Summary": "Samvardhana Motherson has announced it will review its Q2 results on November 13. The company has set this date for the quarterly results review.",
            "Sentiment": "neutral",
            "PublishDate": 1760426569537,
            "Source": "earnings"
        },
        {
            "Title": "Samvardhana Motherson's Slovakia Subsidiary Merges, Ceases Operations",
            "Summary": "SMP Automotive Solutions Slovakia s.r.o., an indirect subsidiary of Samvardhana Motherson International Limited, merged with Motherson SAS Automotive Systems and Technologies Slovakia s.r.o. on October 8, 2025. Following the merger completion, SMP Slovakia was deregistered from the Commercial Register and ceased to exist. Both entities were indirect wholly owned subsidiaries of Samvardhana Motherson International Limited. SMP Slovakia contributed INR 705 million in turnover (0.06% of total) and INR 72 million in net worth during the last financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1760111520623,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson International Raises INR 500 Crores Through Commercial Paper Issuance",
            "Summary": "Samvardhana Motherson International Limited issued commercial paper worth INR 500 crores with a 90-day tenure and 5.90% interest rate. The unsecured debt instrument was issued on October 9, 2025, and will mature on January 7, 2026. The commercial paper consists of 10,000 units with a face value of Rs. 5,00,000 each and has been listed on BSE Limited. The instrument was issued to Kotak Mahindra Bank Limited on a private placement basis with an issue price of Rs. 4,92,830.50 per unit. The commercial paper carries credit ratings of ICRA A1+ and IND A1+, with ICICI Bank Limited serving as the issuing and paying agent.",
            "Sentiment": "neutral",
            "PublishDate": 1760107626406,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson Shares Drop 1.73% After BMW Issues Profit Warning",
            "Summary": "Samvardhana Motherson International Ltd shares declined nearly 2% following a profit warning from BMW, which accounts for approximately 5% of the company's revenue. BMW reduced its volume expectations for the Chinese market and lowered its automotive EBIT margin guidance to 5-6% from the previous 5-7% target. The automaker also cut its automotive free cash flow projection from above €5 billion to above €2.5 billion. These revisions stem from weak sales in China, higher tariff costs, and dealer support payments due to reduced commissions on local financial products. BMW postponed expected customs duty reimbursements totaling a high three-digit million figure from 2025 to the following year. Western automakers including BMW, Audi, and Porsche face intensifying competition from local Chinese EV manufacturers like BYD and Xiaomi, resulting in declining unit sales. BMW expects its next-generation EVs, including the newly launched iX3 SUV from its Neue Klasse line, to support future sales.",
            "Sentiment": "negative",
            "PublishDate": 1759914958912,
            "Source": "stock"
        },
        {
            "Title": "Tesla Plans Cheaper Model Y Launch to Drive Sales Growth",
            "Summary": "Tesla is planning to launch a more affordable version of its Model Y vehicle as part of efforts to increase sales. The initiative appears to involve Indian automotive component suppliers including Samvardhana Motherson, Sona BLW, and Varroc Engineering in this strategic move.",
            "Sentiment": "positive",
            "PublishDate": 1759811408118,
            "Source": "sectoral"
        },
        {
            "Title": "Samvardhana Motherson International Delays Stake Acquisition Timeline to Q3 FY26",
            "Summary": "Samvardhana Motherson International has updated the timeline for its 28.15% stake acquisition in HR Dhauliganga. The company now expects the acquisition to be completed in Q3 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1758890836774,
            "Source": "order&deals"
        },
        {
            "Title": "Samvardhana Motherson Affected by 25% US Tariffs on Truck Imports",
            "Summary": "The USA has imposed 25% tariffs on truck imports from other countries. This development affects Samvardhana Motherson as the company supplies parts to Daimler Trucks.",
            "Sentiment": "negative",
            "PublishDate": 1758859385143,
            "Source": "stock"
        },
        {
            "Title": "Samvardhana Motherson Appoints Former SBI Chairman Dinesh Kumar Khara as Independent Director",
            "Summary": "Samvardhana Motherson International Limited appointed Mr. Dinesh Kumar Khara as Additional Director and Non-Executive Independent Director for a five-year term from September 25, 2025 to September 24, 2030. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation and is subject to shareholder approval. Khara brings nearly 40 years of banking experience and served as Chairman of State Bank of India from October 2020 to August 2024. He previously held various senior positions at SBI including Managing Director roles and was MD & CEO of SBI Funds Management Private Limited. Khara is not related to any existing directors of the company and is not debarred from holding directorship positions.",
            "Sentiment": "positive",
            "PublishDate": 1758799092261,
            "Source": "corporate_governance"
        },
        {
            "Title": "Samvardhana Motherson Subsidiary Faces INR 10.2 Lakh Tax Penalty from Tamil Nadu Authorities",
            "Summary": "Motherson Auto Solutions Limited, a wholly owned subsidiary of Samvardhana Motherson International Limited, received a penalty order of INR 10,20,166 from the Assistant Commissioner, Chengalpattu, Tamil Nadu. The penalty was imposed under section 73(9) read with section 17(5) of the TNGST Act, 2017, related to eligibility of input tax credit availed during FY 2021-22. The company received the order on September 15, 2025, and stated there is no material impact on financials or operations. The subsidiary plans to file an appeal against the penalty order.",
            "Sentiment": "negative",
            "PublishDate": 1758028770122,
            "Source": "stock"
        },
        {
            "Title": "Samvardhana Motherson Incorporates Wholly Owned Subsidiary for Joint Venture with Taiwan's Macauto Industrial",
            "Summary": "Samvardhana Motherson International Limited (SAMIL) incorporated a wholly owned subsidiary named Motherson Macauto Solutions Limited on September 12, 2025, to advance its Joint Venture Agreement with Macauto Industrial Co., Ltd., a Taiwan Stock Exchange-listed company. The subsidiary was established with an initial paid-up equity share capital of INR 5 lakh through cash consideration. SAMIL currently holds 100% shareholding, but according to the joint venture agreement, the equity will be restructured with SAMIL holding 50% plus 1 share and Macauto Industrial holding 50% minus 1 share. The new entity will engage in designing, developing, manufacturing, assembly and servicing automotive components including door, window and roof sunshade systems, luggage cover systems, and wind deflectors for automotive applications.",
            "Sentiment": "positive",
            "PublishDate": 1757761603788,
            "Source": "corporate_action"
        },
        {
            "Title": "Samvardhana Motherson Releases Transcript of Institutional Investor Meet 2025",
            "Summary": "Samvardhana Motherson International Limited has made available the transcript of its Institutional Investor Meet 2025 held on September 5, 2025 in Mumbai. The company had previously disclosed the meet through announcements dated July 29, September 5, and September 6, 2025. The transcript is now accessible on the company's website at www.motherson.com, alongside the presentation and audio-video recording of the meet. The document was signed by Company Secretary Alok Goel on September 12, 2025. The meet featured extensive management participation including Chairman Vivek Chaand Sehgal, Vice Chairman Laksh Vaaman Sehgal, and various division heads from across the global operations.",
            "Sentiment": "neutral",
            "PublishDate": 1757687235449,
            "Source": "stock"
        },
        {
            "Title": "Samvardhana Motherson Completes Acquisition of 25% Stake in Two Turkish Subsidiaries",
            "Summary": "Samvardhana Motherson International Limited has completed the acquisition of the remaining 25% stake in two Turkish subsidiaries: SMR Plast Met Molds And Tools Turkey Kalip Imalat Anonim Şirketi and SMR Plast Met Automotive Tec Turkey Plastik Imalat Anonim Şirketi. The acquisition was completed on September 9, 2025, through its wholly owned indirect subsidiary, Motherson SAS Turkey Otomotiv Servis Ticaret Limited Sirketi. The company had previously disclosed its intention to acquire these stakes in June 2025, and the transaction was completed after receiving necessary approvals and satisfying conditions precedent.",
            "Sentiment": "positive",
            "PublishDate": 1757424494871,
            "Source": "order&deals"
        },
        {
            "Title": "Samvardhana Motherson Unveils Vision 2030 with $108 Billion Revenue Target Despite Missing Previous Plan Goals",
            "Summary": "Samvardhana Motherson International unveiled its Vision 2030 plan targeting gross revenue of $108 billion by FY30, representing a 33% CAGR from $25.7 billion in FY25. The company plans to achieve 75% of incremental revenue through acquisitions and aims for 40% consolidated Return of Capital Employed versus 18% in FY25. The plan emphasizes expansion beyond automotive into non-auto segments including aerospace, consumer electronics, logistics, health & medical, and IT. Non-auto revenues contributed Rs 5,800 crore (5% of total revenues) in FY25. The company targets progression from integrated assemblies to full vehicle assembly by 2030 and plans to maintain dividend payout ratio up to 40%. However, the company missed targets across metrics in its previous 2020-2025 five-year plan cycle. Brokerages remain positive with Jefferies maintaining 'Buy' rating at Rs 110 target price, while Investec holds at Rs 95. The stock jumped over 4% intraday following the announcement, trading 3.92% higher at Rs 98.31.",
            "Sentiment": "positive",
            "PublishDate": 1757316320478,
            "Source": "stock"
        }
    ]
}