{
    "Symbol": "MOTISONS",
    "ISIN": "INE0FRK01020",
    "News": [
        {
            "Title": "Motisons Jewellers Q3FY26 Net Profit Surges 69.5%",
            "Summary": "Motisons Jewellers reports strong Q3FY26 performance with net profit rising 69.5% to ₹2,594.11 lakhs. Revenue grew 20.1% to ₹17,456.13 lakhs, driven by robust jewellery sales across traditional and contemporary designs.",
            "Sentiment": "positive",
            "PublishDate": 1770719618295,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motisons Jewellers Reports No Deviation in Preferential Issue Fund Utilization",
            "Summary": "Motisons Jewellers Limited confirmed compliance with SEBI regulations, stating no deviation in the utilization of proceeds from its Preferential Issue compared to stated objectives. The company utilized Rs. 42.50 crores across issue-related expenses (Rs. 0.11 crores), debt repayment (Rs. 13.00 crores), and working capital requirements (Rs. 29.39 crores) with no fund movement during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763130103078,
            "Source": "corporate_action"
        },
        {
            "Title": "Motisons Jewellers Reports Net Loss of Rs 803.04 Lakhs in Q2 FY2025",
            "Summary": "Motisons Jewellers Limited posted a net loss of Rs 803.04 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 1,039.55 lakhs in the same quarter last year, despite revenue from operations of Rs 8,704.65 lakhs. The jewellery retailer, which deals in gold, diamonds, and Kundan products, saw its half-year net profit decline to Rs 1,672.75 lakhs from Rs 2,369.96 lakhs in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1763108385152,
            "Source": "earnings"
        },
        {
            "Title": "Motisons Jewellers Reports Mixed Q1 Results with Higher Profitability Despite Revenue Decline",
            "Summary": "Motisons Jewellers announced its Q1 financial results showing improved profitability metrics alongside a slight revenue decline. The company's EBITDA increased to 127 million rupees from 107 million rupees year-over-year, while EBITDA margin expanded to 14.7% from 12.1%. Net profit rose to 80 million rupees compared to 63 million rupees in the previous year. However, revenue decreased to 870 million rupees from 887 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754383204825,
            "Source": "earnings"
        },
        {
            "Title": "Motisons Jewellers Reports Q4 Financial Results",
            "Summary": "Motisons Jewellers has released its Q4 financial results. The company reported an EBITDA of 174 million rupees, compared to 176.5 million rupees in the same quarter last year. The EBITDA margin was 14.64%, down from 15.13% year-over-year. Revenue increased to 1.2 billion rupees from 1.16 billion rupees in the previous year. The company's net profit for Q4 stood at 111 million rupees, up from 107.9 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747820349000,
            "Source": "result"
        },
        {
            "Title": "Motisons Jewellers: Stock Plummets 49% from Recent High",
            "Summary": "Motisons Jewellers stock has fallen 49% from its recent high of ₹33.80 to ₹17 per share. The company faces challenges due to rising gold prices impacting jewellery sales. Despite the recent crash, the stock remains 218% above its IPO price. Q3 FY25 results show revenue of ₹145 crore and PAT of ₹15 crore, up from ₹123 crore and ₹11 crore respectively in Q3 FY24.",
            "Sentiment": "negative",
            "PublishDate": 1743497067000,
            "Source": "normal_news"
        },
        {
            "Title": "Motisons Jewellers Reports Q3 EBITDA Growth",
            "Summary": "Motisons Jewellers announced its Q3 financial results. The company's EBITDA increased to 229 million rupees from 200 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 15.75% from 16.22% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738922956000,
            "Source": "earnings"
        },
        {
            "Title": "Motisons Jewellers Reports Strong Q3 Financial Results",
            "Summary": "Motisons Jewellers has announced its financial results for the third quarter. The company's net profit increased to 153 million rupees, up from 108 million rupees in the same period last year. Revenue also saw growth, reaching 1.45 billion rupees compared to 1.2 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738922943000,
            "Source": "earnings"
        },
        {
            "Title": "Motisons Jewellers to Consider Q3 Results",
            "Summary": "Motisons Jewellers has announced that it will consider its third quarter (Q3) financial results on February 7. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738677280000,
            "Source": "earnings"
        }
    ]
}