{
    "Symbol": "MOTILALOFS",
    "ISIN": "INE338I01027",
    "News": [
        {
            "Title": "Motilal Oswal Q3FY26 Earnings Call Recording Live",
            "Summary": "Motilal Oswal Financial Services makes Q3/9M FY2025-26 earnings conference call audio recording available on company website following investor discussion held January 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769594242551,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal grants 4.37L ESOPs to employees",
            "Summary": "Motilal Oswal Financial Services granted 4,37,063 employee stock options under ESOP Scheme-X on January 27, 2026, as approved by the Nomination and Remuneration Committee.",
            "Sentiment": "positive",
            "PublishDate": 1769517623312,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal MF launches Financial Services Fund NFO",
            "Summary": "Motilal Oswal Mutual Fund announces new Financial Services Fund with NFO opening January 27-February 10, targeting long-term capital appreciation through equity investments in banking, insurance, and fintech sectors.",
            "Sentiment": "positive",
            "PublishDate": 1769074307588,
            "Source": "mutualfunds"
        },
        {
            "Title": "Niket Shah Moves to MD Role at Motilal Oswal",
            "Summary": "Niket Shah transitions from CIO at Motilal Oswal AMC to Managing Director of Principal Investments as part of 200+ role movements across the Group this financial year.",
            "Sentiment": "positive",
            "PublishDate": 1768975815665,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Board Meet Set for Jan 27 on Q3 Results",
            "Summary": "Motilal Oswal Financial Services has scheduled its board meeting for January 27, 2026, to review Q3FY26 unaudited financial results and consider interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768927703715,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal sees 8% Nifty 50 PAT growth in Q3",
            "Summary": "Motilal Oswal expects Nifty 50 companies to report 8% PAT growth and 11% revenue growth in Q3 FY26, driven by GST 2.0 cuts and festive demand boost across sectors.",
            "Sentiment": "positive",
            "PublishDate": 1767934837092,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Bullish on Capital Goods, Defence Stocks",
            "Summary": "Motilal Oswal expects healthy execution growth for capital goods companies driven by strong order inflows. The brokerage remains selective on domestic private sector picks while highlighting opportunities across multiple sectors.",
            "Sentiment": "positive",
            "PublishDate": 1767586484850,
            "Source": "stocks"
        },
        {
            "Title": "MOFSL picks 5 stocks for Budget 2026 demand revival",
            "Summary": "Motilal Oswal identifies TVS Motor, UPL, BDL, M&M Financial, and Dalmia Bharat as top picks ahead of Budget 2026-27, expecting policy focus on domestic demand, private investment, and infrastructure spending.",
            "Sentiment": "positive",
            "PublishDate": 1766742557972,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Financial Services Plans 3 Billion Rupee Debenture Issue",
            "Summary": "Motilal Oswal Financial Services has announced plans to issue debentures worth 3 billion rupees. This debt fundraising initiative will provide the financial services company with additional capital for its operations and growth activities.",
            "Sentiment": "positive",
            "PublishDate": 1764688087327,
            "Source": "corporate_action"
        },
        {
            "Title": "Motilal Oswal Financial Services Seeks Shareholder Approval for Board Appointments via Postal Ballot",
            "Summary": "Motilal Oswal Financial Services has issued a postal ballot notice seeking member approval for appointing six directors, including Pratik Oswal and Vaibhav Agrawal as Non-Executive Directors with remuneration packages. The e-voting period runs from December 1, 2025 to December 30, 2025, with results to be announced by January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764335869380,
            "Source": "corporate_governance"
        },
        {
            "Title": "Motilal Oswal Financial Services Plans NCD Issuance on December 2nd",
            "Summary": "Motilal Oswal Financial Services announced plans to raise funds through the issuance of Non-Convertible Debentures (NCDs) scheduled for December 2nd. The fundraising initiative will provide the financial services company with additional capital for its business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764253721508,
            "Source": "corporate_action"
        },
        {
            "Title": "Motilal Oswal Financial Services Allots 2,72,379 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Motilal Oswal Financial Services' Finance Committee approved the allotment of 2,72,379 equity shares to option grantees who exercised their stock options across four ESOP schemes (VI, VIII, IX, and X). The newly allotted shares will rank equally with existing equity shares in all respects, with ESOP Scheme IX accounting for the largest portion at 2,17,879 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763648394721,
            "Source": "corporate_action"
        },
        {
            "Title": "Motilal Oswal Reports 2% Operating PAT Growth in Q2FY26, Credit Rating Upgraded to AA",
            "Summary": "Motilal Oswal Financial Services reported operating profit after tax growth of 2% to ₹554 crores in quarterly results. The company's customer base expanded to 14.5 million comprising 9.4 million unique mutual fund folios and 5.1 million unique broking accounts, with Assets under Advice crossing ₹6.7 lakh crores. Annual Recurring Revenue now represents 61% of total net revenues. The Asset Management and Private Wealth businesses grew 36% year-on-year, marking the fourth consecutive quarter of strong growth. AMC business gained market share with mutual fund AUM market share increasing to 2.6% and net flow market share at 8.2%. The company completed first close of ₹6,900 crores for its fifth Private Equity fund IBEF V. Investment Banking executed 39 deals worth ₹49,000 crores in the first half, ranking first in IPO, QIP, and Rights Issues. Long-term credit rating was upgraded to AA with stable outlook, the highest rating granted to any non-bank domestic capital market player in India. The Board expanded from 10 to 14 members with new appointments including independent directors.",
            "Sentiment": "positive",
            "PublishDate": 1762542055134,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Family Trust Transfers 1.8 Crore Shares to Pratik Motilal Oswal",
            "Summary": "Motilal Oswal Family Trust distributed 1,80,15,275 equity shares of Motilal Oswal Financial Services Limited to Pratik Motilal Oswal through an off-market inter-se transfer on November 3, 2025. The transaction increased Pratik Motilal Oswal's shareholding from 1.48% to 4.48% of total share capital, while the Trust's holding decreased from 23.68% to 20.68%. The combined holding of the promoter group and persons acting in concert remains unchanged at 33.54% of total share capital. The company's equity share capital stands at 60,05,09,232 shares of Re. 1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1762400920845,
            "Source": "corporate_action"
        },
        {
            "Title": "Motilal Oswal Reports 55% AUM Growth and Record Operating Profit Despite Market Volatility",
            "Summary": "Motilal Oswal Financial Services delivered strong quarterly results with AUM growing 55-56% year-over-year, significantly outperforming the flat Nifty market. The company recorded an all-time high operating profit of ₹554 crore, representing 30% YoY growth in core business profitability. Asset management and private wealth divisions drove growth with ₹14,000 crore net inflows and 1.7 million new SIPs added. Flow market share increased to 8.3% while AUM market share reached 2.6%. Private wealth saw ₹7,500 crore net inflows, nearly tripling year-over-year. The housing finance segment posted 24% AUM growth and 50% increase in quarterly disbursements to ₹500 crore, with gross NPAs at 1.4% and net NPAs at 0.8%. The company experienced a treasury mark-to-market loss of ₹270 crore and 24% decline in brokerage revenue due to regulatory changes. Cost of funds decreased 20-25 basis points year-over-year, with spreads improving to 5.3% and net interest margins stable at 7%. Brokerage now contributes only 30% of total revenue as the business mix diversifies.",
            "Sentiment": "positive",
            "PublishDate": 1762141884977,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Financial Services Expects Higher Profit Growth in Second Half of FY26",
            "Summary": "Motilal Oswal Financial Services announced during a conference call that the company anticipates greater profit growth in the second half of FY26 compared to the first half of the same fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1761893701721,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Reports Quarterly Results and Appoints Four New Directors",
            "Summary": "Motilal Oswal Financial Services Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company raised Rs. 500 crores through private placement of Non-Convertible Debentures during the quarter, with funds fully utilized as per offer documents. The Board appointed four new directors: Mr. Pratik Oswal and Mr. Vaibhav Agrawal as Non-Executive Directors from the promoter group, and Mr. Joseph Conrad Agnelo DSouza and Mr. Ashok Kumar P Kothari as Independent Directors for a 3-year term starting November 1, 2025. Additionally, Mr. Sandeep Walunj, Group Chief Marketing Officer, resigned effective October 31, 2025, citing personal reasons. The company's long-term credit rating was upgraded by ICRA from AA (Positive outlook) to AA+ (Stable outlook) on October 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761848998648,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Financial Services Reports Highest-Ever Operating PAT of Rs 554 Cr in Q2FY26",
            "Summary": "Motilal Oswal Financial Services Limited (MOFSL) achieved its highest-ever operating PAT of Rs 554 Cr in Q2FY26, with 11% growth in H1FY26 to Rs 1,088 Cr. The company's operating PAT grew 31% CAGR over the last decade. Asset Management PAT grew 46% YoY to Rs 180 Cr with total AUM at Rs 1.77 lakh Cr, up 46% YoY. Private Wealth Management PAT increased 23% YoY to Rs 110 Cr with AUM up 19% YoY to Rs 21.87 lakh Cr. eWealth Management PAT declined 24% to Rs 170 Cr. Capital Markets PAT grew 24% YoY to Rs 90 Cr, ranking first across IPOs, QIPs, and Rights Issues in H1. Housing Finance PAT grew 27% to Rs 34 Cr with disbursement growth of 48% YoY. Net worth grew nearly 10x from Mar 15 to Sept 25 to Rs 12,871 Cr. ICRA upgraded the company's long-term rating to AA+ (Stable) from AA (positive). MOFSL ranked 99th on FY25 profits and 171st on market capitalization among listed Indian companies.",
            "Sentiment": "positive",
            "PublishDate": 1761835188727,
            "Source": "earnings"
        },
        {
            "Title": "MOFSL Targets 20-22% PAT Growth, ₹6 Trillion AUA by FY27",
            "Summary": "MOFSL has provided guidance for 20-22% compounded PAT growth through FY27. The company expects its Assets Under Administration (AUA) to surpass ₹6 trillion, while fee-based revenue share is projected to rise to 80%. The firm plans continued expansion in AMC, private wealth, and alternative investments. Over the past decade, MOFSL achieved 24% CAGR in net worth and 39% CAGR in AUA. The company's strategy focuses on deepening retail and institutional participation through FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761834677481,
            "Source": "stock"
        },
        {
            "Title": "Motilal Oswal Financial Services Announces Resignation of Group Chief Marketing Officer",
            "Summary": "Motilal Oswal Financial Services announced the resignation of Sandeep Walunj, who served as Group Chief Marketing Officer and Senior Management Personnel. The company has disclosed this leadership change affecting its senior management structure.",
            "Sentiment": "neutral",
            "PublishDate": 1761827010950,
            "Source": "corporate_governance"
        },
        {
            "Title": "Motilal Oswal Financial Services Raises ₹5 Billion via NCD Placement Amid Q2 Profit Decline",
            "Summary": "Motilal Oswal Financial Services raised ₹5 billion through private placement of Non-Convertible Debentures (NCDs). The company reported Q2 consolidated net profit of ₹3.62 billion compared to ₹11.2 billion in the same period last year, representing a significant decline. Q2 revenue stood at ₹18.49 billion versus ₹28.4 billion year-over-year. EBITDA for the quarter was ₹8.4 billion compared to ₹18.1 billion previously, with EBITDA margin at 45.42% versus 63.92% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1761825925855,
            "Source": "stock"
        },
        {
            "Title": "Motilal Oswal Shares Drop Nearly 8% Following SEBI Brokerage Fee Reduction Proposal",
            "Summary": "Motilal Oswal Financial Services shares fell nearly 8% following SEBI's draft regulations proposing significant cuts to brokerage fees paid by mutual funds. The regulator proposed reducing brokerage fees on cash market transactions to 2 basis points from 12 basis points, and derivatives market fees to 1 basis point from 5 basis points. Market analysts expect small and mid-sized brokers to be particularly impacted by these changes. Pratik Gupta of Kotak Institutional Equities suggested free market forces should prevail, while Ashish Somaiyaa of Whiteoak Capital AMC estimated a total impact of 10-12 basis points if implemented. Despite the decline to ₹1,009.2, the stock remains up over 10% for the month and positive year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1761726879503,
            "Source": "stock"
        },
        {
            "Title": "Motilal Oswal Financial Services Incorporates Wholly-Owned Subsidiary in GIFT City",
            "Summary": "Motilal Oswal Financial Services Limited has incorporated a wholly-owned subsidiary named Motilal Oswal Asset Management (IFSC) Limited in the International Financial Services Centre, GIFT City, Gujarat. The subsidiary was incorporated on October 18, 2025, and will engage in establishing, sponsoring and managing retail schemes, investment funds including alternative investment funds, and providing investment advisory, distribution, referral services and portfolio management services to investment funds, fund managers, institutional investors and other eligible persons. The company will seek approval from the International Financial Services Centres Authority, GIFT City. The subsidiary represents 100% subscription to equity share capital in cash at face value.",
            "Sentiment": "positive",
            "PublishDate": 1760793948177,
            "Source": "corporate_action"
        },
        {
            "Title": "Motilal Oswal Shares Surge 4% Following ICRA Credit Rating Upgrade to AA+",
            "Summary": "Motilal Oswal Financial Services shares rallied 4% on Monday, October 13, 2025, reaching an intraday high of ₹1,010 on NSE. ICRA Limited upgraded the company's credit rating from [ICRA] AA (Positive) to [ICRA] AA+ (Stable), citing strong market position, ability to harness sector momentum, and strengthening franchise across capital market businesses. The upgrade applies to the entire Motilal Oswal Group on a consolidated basis, including subsidiaries like Home Finance, Finvest, Wealth, and Broking & Distribution. MD & CEO Vishal Oswal stated the upgrade reflects the strength of their franchise and resilient business model, highlighting their twin-engine structure and seven integrated businesses spanning wealth management, institutional equities, investment banking, asset management, alternates, private wealth, and home finance. The stock has gained 6% over the past month and jumped 58% over the last six months.",
            "Sentiment": "positive",
            "PublishDate": 1760359586669,
            "Source": "stock"
        },
        {
            "Title": "Motilal Oswal PE Signs Exclusivity Agreement to Acquire Medical Diagnostics Firm Sensa Core",
            "Summary": "Motilal Oswal PE has entered into an exclusivity pact to acquire Sensa Core, a Hyderabad-based medical diagnostics company. The firm is valued between ₹2,200-2,400 crore, with promoters holding an 89% stake in the business.",
            "Sentiment": "positive",
            "PublishDate": 1759456941623,
            "Source": "order&deals"
        },
        {
            "Title": "Motilal Oswal PE Signs Exclusive Agreement to Acquire Sensa Core in ₹2,200-2,400 Crore Deal",
            "Summary": "Motilal Oswal Private Equity has entered into an exclusive agreement to acquire Sensa Core, which is valued at ₹2,200-2,400 crore. The promoters currently hold an 89% stake in Sensa Core.",
            "Sentiment": "positive",
            "PublishDate": 1759319920069,
            "Source": "order&deals"
        },
        {
            "Title": "Motilal Oswal Financial Services Invests ₹110 Crore in IL Jin Electronics",
            "Summary": "Motilal Oswal Financial Services has signed a deal to invest ₹110 crore in IL Jin Electronics. The investment is positioned as a long-term strategic move for the financial services company.",
            "Sentiment": "positive",
            "PublishDate": 1758852378170,
            "Source": "order&deals"
        },
        {
            "Title": "Motilal Oswal Subsidiary Acquires Stakes in Kusumgar Limited for ₹100 Crore",
            "Summary": "A wholly owned subsidiary of Motilal Oswal Financial Services Limited has acquired 10,95,890 Compulsorily Convertible Preference Shares and 16,43,836 Equity Shares of Kusumgar Limited for approximately ₹100 crore in cash. Kusumgar Limited is a textile company engaged in manufacturing woven, coated and laminated synthetic engineered fabrics, focusing on polyamides and polyester filaments. The company reported turnover of ₹779 crore in FY 2025, ₹467.91 crore in FY 2024, and ₹301.65 crore in FY 2023. The acquisition is part of Motilal Oswal's treasury investment book, aimed at generating sustainable long-term returns. This is not a related party transaction and was conducted at arm's length, with no promoter or promoter group interest in the target entity. The acquisition is expected to be completed within 7 days and requires no governmental or regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1758724015787,
            "Source": "order&deals"
        },
        {
            "Title": "Motilal Oswal Settles SEBI Front-Running Case for Rs 34.85 Lakh",
            "Summary": "Motilal Oswal Financial Services settled proceedings with SEBI regarding alleged lapses related to suspected front-running of trades involving a large client. The company paid Rs 34.85 lakh in settlement expenses to resolve the matter. SEBI's investigation examined whether trades of a big client were front-run by the Chaturvedi Group during January 1, 2022 to December 8, 2023. The regulator alleged that Motilal Oswal failed to maintain proper records of client order instructions and attempted to create supporting documents after trade execution. The company stated the matter involved one of its authorized partners, Om Securities, and that they opted for settlement without admitting or denying the findings. SEBI issued a show cause notice in February 2025, and the settlement terms were approved after Motilal Oswal filed a revised application in March. The proceedings are now disposed of, though SEBI retains the right to act if settlement terms are breached.",
            "Sentiment": "negative",
            "PublishDate": 1758214414115,
            "Source": "corporate_governance"
        },
        {
            "Title": "Motilal Oswal Projects Nifty 50 EPS Growth to Rise to 9% in FY26 from 1% in FY25",
            "Summary": "Motilal Oswal Financial Services describes corporate earnings in the April-June quarter as modest but resilient, largely in line with estimates. The brokerage projects Nifty 50 EPS growth to increase to around 9% in fiscal year 2026, compared to 1% in FY25, supported by expected macro environment improvements from fiscal and monetary measures. The Nifty 50 trades at 22.2x FY26E earnings, near its LPA of 20.7x. The firm's model portfolio maintains a large-cap bias at 70% weight while increasing mid-cap allocation to 22% from 16% due to better earnings delivery. Aggregate earnings of MOFSL Universe companies grew 11% year-on-year versus the estimated 9% rise. This marks the fifth consecutive quarter of single-digit net profit growth for Nifty 50, which delivered 8% growth against the estimated 5%. Five companies - Bharti Airtel, Reliance Industries, SBI, HDFC Bank, and ICICI Bank - contributed 77% of the incremental earnings growth. The beat-miss ratio was balanced with 37% of companies exceeding estimates while 36% reported misses at net profit level.",
            "Sentiment": "positive",
            "PublishDate": 1755358158305,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Financial Services Acquires ₹400 Crore Stake in Quick Commerce Platform Zepto",
            "Summary": "Motilal Oswal Financial Services Limited has acquired 7,54,97,341 Compulsorily Convertible Preference Shares in Zepto Private Limited for ₹400 crore. Zepto is an Indian quick commerce platform that provides 10-minute grocery delivery services, founded in 2021 by Aadit Palicha and Kaivalya Vohra. The company operates across multiple Indian cities offering fresh produce and daily essentials. Zepto's turnover has grown significantly from ₹140.70 crore in FY 2022 to ₹4,454.52 crore in FY 2024. The acquisition is part of Motilal Oswal's treasury investment strategy aimed at generating long-term returns. The transaction is structured as a cash deal and is expected to complete within 15 days. While the acquisition is not a related party transaction, Motilal Oswal's promoter group holds existing preference shares in Zepto.",
            "Sentiment": "positive",
            "PublishDate": 1755013610708,
            "Source": "order&deals"
        },
        {
            "Title": "Motilal Oswal Reports Strong Q1 FY26 Performance with 28% YoY Growth in Assets Under Advice",
            "Summary": "Motilal Oswal Financial Services crossed 13.6 million customers milestone, comprising 8.6 million+ mutual fund portfolios and 5 million+ broking accounts. Assets under advice grew 28% YoY to ₹6.5 lakh crores. Annual recurring revenues reached 52% of net revenue, while fee-based revenue contribution increased to 44%. Net worth rose 28% YoY to ₹12,537 crores with ROE at 48%. The company crossed ₹1.5 lakh crores equity AUM milestone in asset management, with 92% of AUM outperforming benchmarks. Investment banking business reported highest-ever quarterly revenues with 89% YoY growth, ranking 3rd in IPO executions. Housing finance AUM crossed ₹5,000 crores, up 22% YoY. The company launched its fifth private equity fund targeting ₹8,000 crores and completed 80% of target fundraise in under 2 months. Management expects continued strong performance across all business segments driven by increasing market share and trail-based revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754045227476,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Financial Services Approves Rs 500 Crore NCD Issuance",
            "Summary": "Motilal Oswal Financial Services Limited's Finance Committee approved the issuance of 50,000 Non-Convertible Debentures worth Rs 500 crore on a private placement basis. The NCDs have a face value of Rs 1 lakh each, carry an interest rate of 8.50% per annum, and have a tenure of 2 years. The debentures are fully paid, secured, rated, redeemable, listed, and senior bonds that will be listed on BSE Limited. The NCDs are secured by a first ranking pari passu charge on all present and future receivables of the company, maintaining a minimum security cover of 1.00 times the outstanding principal amounts. The Finance Committee meeting was held on July 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753857435034,
            "Source": "corporate_action"
        },
        {
            "Title": "Motilal Oswal Financial Services Plans NCD Fundraising",
            "Summary": "Motilal Oswal Financial Services has announced plans to raise funds through the issuance of Non-Convertible Debentures (NCDs). The company is looking to utilize this debt instrument as a means of capital raising.",
            "Sentiment": "neutral",
            "PublishDate": 1753441262238,
            "Source": "stock"
        },
        {
            "Title": "Motilal Oswal Financial Services Schedules Finance Committee Meeting to Consider Non-Convertible Debentures Issuance",
            "Summary": "Motilal Oswal Financial Services Limited has scheduled a Finance Committee meeting for July 30, 2025, to consider and approve fund raising through the issuance of Non-Convertible Debentures on a private placement basis. The debentures may be issued in one or more tranches. The company notified both BSE and NSE about the upcoming committee meeting through a formal communication signed by Company Secretary Kailash Purohit.",
            "Sentiment": "neutral",
            "PublishDate": 1753439754508,
            "Source": "corporate_action"
        },
        {
            "Title": "Motilal Oswal Financial Services Reports 72% Growth in Assets Under Management",
            "Summary": "Motilal Oswal Financial Services experienced a 72% year-over-year increase in its assets under management, indicating significant business expansion in its wealth and asset management operations.",
            "Sentiment": "positive",
            "PublishDate": 1753343971274,
            "Source": "stock"
        },
        {
            "Title": "Motilal Oswal Financial Services Reports Q1 FY26 Results and Appoints New CISO",
            "Summary": "Motilal Oswal Financial Services Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated net profit of Rs. 2,50,818 lakhs and standalone net profit of Rs. 52,214 lakhs. Basic earnings per share stood at Rs. 19.39 for consolidated results and Rs. 8.69 for standalone results. The board also approved the appointment of Mr. Suresh Sharma as Chief Information Security Officer and Senior Management Personnel effective July 24, 2025. Mr. Sharma brings over 20 years of cybersecurity experience and previously served as CISO at PayU Payments. Additionally, the company allotted 1,96,854 equity shares to employees under various stock option schemes during the quarter. A wholly owned subsidiary, Motilal Oswal International Wealth Management Limited, received final approval from Dubai Financial Services Authority on July 17, 2025 to commence operations.",
            "Sentiment": "positive",
            "PublishDate": 1753343495517,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Financial Services Reports Strong Q1 Growth with 31% Jump in Net Profit",
            "Summary": "Motilal Oswal Financial Services reported consolidated net profit of 11.6 billion rupees for Q1, representing a significant increase from 8.82 billion rupees in the same period last year. The company's revenue also grew to 27.4 billion rupees compared to 23.12 billion rupees year-over-year, indicating strong business performance across its financial services operations.",
            "Sentiment": "positive",
            "PublishDate": 1753343029741,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Asset Management Crosses ₹1.5 Lakh Crore AUM Milestone",
            "Summary": "Motilal Oswal Asset Management has surpassed ₹1.5 lakh crores in Assets Under Management (AUM). This achievement solidifies the company's position as a growth-oriented fund house in the asset management industry.",
            "Sentiment": "positive",
            "PublishDate": 1751458891000,
            "Source": "default"
        },
        {
            "Title": "Motilal Oswal Financial Services: Enters Private Credit Market with New Hire",
            "Summary": "Motilal Oswal Financial Services is entering the private credit market. Rakshat Kapoor, former CIO at Modulus Alternatives, will lead the venture. The company plans to raise $250 million through its first private credit fund in the next 4-6 months. The fund will invest in mid to large companies seeking growth capital.",
            "Sentiment": "positive",
            "PublishDate": 1749555436000,
            "Source": "corporate_action"
        },
        {
            "Title": "Motilal Oswal Financial Services Appoints New Head and Plans Private Credit Fund",
            "Summary": "Motilal Oswal Financial Services has appointed Rakhat Kapoor as the new head of the company. The firm is planning to enter the private credit market and aims to raise $250 million through its initial private credit fund in the next four to six months. This fund will target mid- to large-sized corporations that need growth capital.",
            "Sentiment": "positive",
            "PublishDate": 1749543148000,
            "Source": "default"
        },
        {
            "Title": "Motilal Oswal Financial Services: Sebi Imposes Rs 3 Lakh Fine for Stock Broker Violations",
            "Summary": "Sebi fined Motilal Oswal Financial Services Rs 3 lakh for violating stock brokers' norms. Violations include unauthorized trading terminals, improper user operations, and failure to report fund-based activities between Authorized Persons and clients. The company has 45 days to pay the penalty.",
            "Sentiment": "negative",
            "PublishDate": 1749471025000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Motilal Oswal Financial Services: Shares Plunge 13% After First Quarterly Loss in 5 Years",
            "Summary": "Motilal Oswal Financial Services reported a Q4 FY25 net loss of Rs 63.2 crore, its first quarterly loss since FY20. The loss was primarily due to a Rs 430 crore fair value change loss. Despite this, the company's wealth management and asset management businesses showed growth. The board approved a Rs 3,000 crore NCD issuance and the company incorporated a new subsidiary in Dubai.",
            "Sentiment": "negative",
            "PublishDate": 1745817614000,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Financial Services: Q4 Net Loss of Rs 64.8 Crore, Revenue Drops 45% YoY",
            "Summary": "Motilal Oswal reported a Q4FY25 consolidated net loss of Rs 64.8 crore, compared to a profit of Rs 723 crore in the previous year. Revenue fell 44.7% YoY to Rs 1190.26 crore. Despite this, the company's FY25 operating PAT increased 31% YoY to Rs 2,016 crore. Asset and wealth management segments showed strong growth, while housing finance declined. The company's client base exceeded 12 million, and assets under advice grew 33% YoY to over Rs 5.5 lakh crore.",
            "Sentiment": "neutral",
            "PublishDate": 1745575022000,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Financial Services Reports Q4 Loss",
            "Summary": "Motilal Oswal Financial Services announced its Q4 financial results, reporting a revenue of 11.9 billion rupees, down from 21.5 billion rupees year-over-year. The company also reported a consolidated net loss of 648 million rupees, compared to a profit of 7 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1745572080000,
            "Source": "result"
        },
        {
            "Title": "Motilal Oswal Financial Services: Stock Plunges Ahead of Q4 Results",
            "Summary": "Motilal Oswal Financial Services shares drop up to 7%, becoming the top loser on Nifty 500 index before Q4 earnings announcement. The company's Q3 saw lower revenue and halved net profit compared to Q2. Management previously attributed reduced volumes to F&O regulation changes and market correction, expecting a rebound after a few quarters.",
            "Sentiment": "negative",
            "PublishDate": 1745566755000,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Private Wealth: Targeting 20-25% Growth in Wealth Management",
            "Summary": "Motilal Oswal Private Wealth aims for 20-25% growth, outpacing the industry's 14-15%. The company sees opportunities in the shift from unorganized to organized wealth management, with only 20% of India's financial savings currently managed through assisted wealth platforms. The firm earns 55-60 basis points in fees and benefits from increased capital flow through IPOs, stake sales, and ESOPs.",
            "Sentiment": "positive",
            "PublishDate": 1745307944000,
            "Source": "normal_news"
        },
        {
            "Title": "Motilal Oswal Alternates: Acquires Majority Stake in Megafine Pharma for ₹460 Crore",
            "Summary": "Motilal Oswal Alternates has acquired a majority stake in Megafine Pharma, an export-focused bulk drug maker, for ₹460 crore. The investment aims to strengthen R&D and manufacturing capabilities, with plans for further inorganic growth opportunities. Megafine specializes in niche active pharmaceutical ingredients (APIs) and has FDA-approved facilities in Nashik and Vapi.",
            "Sentiment": "positive",
            "PublishDate": 1740499423000,
            "Source": "corporate_action"
        },
        {
            "Title": "Motilal Oswal Financial Services: Sebi Imposes Rs 7 Lakh Penalty for Stock Broking Violations",
            "Summary": "Sebi has imposed a Rs 7 lakh penalty on Motilal Oswal Financial Services for violating stock broking norms during an inspection period from April 1, 2021, to June 30, 2022.",
            "Sentiment": "negative",
            "PublishDate": 1738237003000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Motilal Oswal Financial Services Reports Q3 FY24 Results",
            "Summary": "Motilal Oswal Financial Services announced its Q3 financial results. The consolidated net profit decreased to 5.64 billion rupees from 6.6 billion rupees year-over-year, but increased from 11.2 billion rupees quarter-over-quarter. Revenue rose to 19.98 billion rupees from 17.8 billion rupees year-over-year. The company's Gross Non-Performing Assets (GNPA) slightly increased to 1.4% from 1.3% in the previous quarter, while Net Non-Performing Assets (NNPA) rose to 0.8% from 0.7%. The company declared an interim dividend of 5 rupees per share and withdrew its scheme of arrangement between itself, Glide Tech, and MOWL.",
            "Sentiment": "neutral",
            "PublishDate": 1738109873000,
            "Source": "earnings"
        }
    ]
}