{
    "Symbol": "MOTOGENFIN",
    "ISIN": "INE861B01023",
    "News": [
        {
            "Title": "Motor General Finance Limited Sells Delhi Property to Haldiram Marketing for Rs. 183 Crores",
            "Summary": "Motor General Finance Limited's Board approved an agreement to sell land and building at A-30, Mohan Co-operative Industrial Estate, Mathura Road, New Delhi to Haldiram Marketing Private Limited for approximately Rs. 183 crores net of stamp duty. The transaction is expected to be completed on or before April 30, 2026, with the buyer not belonging to the promoter group.",
            "Sentiment": "positive",
            "PublishDate": 1764238638816,
            "Source": "stock"
        },
        {
            "Title": "Motor & General Finance Reports Mixed Results for Q2 FY2026, Sells Associate Company Stake",
            "Summary": "Motor & General Finance Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. On standalone basis, the company reported a net loss of Rs. 205.57 lakhs for the quarter compared to a profit of Rs. 24.76 lakhs in the previous quarter. However, on consolidated basis, the company showed a net profit of Rs. 110.63 lakhs for the quarter versus Rs. 23.01 lakhs in the previous quarter. Revenue from operations remained relatively stable at Rs. 168.04 lakhs. The company sold its equity shareholding in associate company Jayabharat Credit Limited based on independent valuation, resulting in a loss of Rs. 248.95 lakhs on standalone basis but a gain of Rs. 54.31 lakhs on consolidated basis. Due to this sale, Jayabharat Credit Limited ceased to be an associate company. Other income for the quarter included Rs. 42.00 lakhs as enhancement compensation received. The company operates primarily in lease/renting/sale of immovable property business. Trading window remains closed until November 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762944850505,
            "Source": "earnings"
        },
        {
            "Title": "Motor & General Finance Limited Submits Q1 FY2026 Financial Results to Stock Exchanges",
            "Summary": "Motor & General Finance Limited submitted its standalone and consolidated unaudited financial results for the quarter ended June 30, 2025 to the Bombay Stock Exchange and National Stock Exchange of India. The results were prepared under IND-AS rules and published in The Financial Express (English) and Jansata (Hindi) newspapers on August 12, 2025. The company trades under stock code 501343 on BSE and Motogenfin on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1755073046735,
            "Source": "earnings"
        },
        {
            "Title": "Motor & General Finance Reports Q1 FY2026 Results with 25% Decline in Net Profit",
            "Summary": "The Motor & General Finance Limited reported quarterly results for the period ended June 30, 2025. On a standalone basis, the company posted a net profit of ₹24.74 lakhs, down from ₹32.89 lakhs in the same quarter last year. Total income decreased to ₹236.33 lakhs from ₹244.36 lakhs year-over-year. Revenue from operations remained flat at ₹178.61 lakhs compared to ₹174.29 lakhs in the previous quarter. On a consolidated basis, net profit declined to ₹23.01 lakhs from ₹31.11 lakhs in the corresponding quarter last year. The company operates primarily in lease, renting, and sale of immovable property. Earnings per share on both standalone and consolidated basis stood at ₹0.06. The results were approved by the Board of Directors and received an unmodified opinion from statutory auditors, though provisions for diminution in long-term investments will be considered in the annual audited accounts.",
            "Sentiment": "negative",
            "PublishDate": 1754909953892,
            "Source": "earnings"
        }
    ]
}