{
    "Symbol": "MPHASIS",
    "ISIN": "INE356A01018",
    "News": [
        {
            "Title": "Mphasis Allots 110,719 Shares Under ESOP and RSU Plans",
            "Summary": "Mphasis Limited allotted 110,719 shares on February 4, 2026, comprising 104,942 shares under ESOP 2016 and 5,777 shares under RSU Plan 2021, following ESOP Compensation Committee approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770185502474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mphasis CEO warns against price cuts in AI era",
            "Summary": "Nitin Rakesh cautions IT firms against aggressive discounting as AI adoption accelerates, emphasizing need to rebuild service delivery models rather than just cutting costs.",
            "Sentiment": "neutral",
            "PublishDate": 1769215246594,
            "Source": "stocks"
        },
        {
            "Title": "Mphasis CEO Highlights AI Growth in Key Sectors",
            "Summary": "Mphasis Co-CEO identifies banking, airlines, and healthcare as primary sectors driving artificial intelligence deal opportunities for the IT services company.",
            "Sentiment": "positive",
            "PublishDate": 1769151302937,
            "Source": "stocks"
        },
        {
            "Title": "Mphasis Eyes Strong Q4 FY26 Growth in Concall",
            "Summary": "Mphasis management projects Q4 FY26 as the strongest sequential growth quarter, targeting greater than 2x industry growth rate according to company guidance shared during earnings call.",
            "Sentiment": "positive",
            "PublishDate": 1769138981873,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mphasis Q3 FY26 Results: Revenue Up 12.4% YoY",
            "Summary": "Mphasis Limited reported Q3 FY26 consolidated revenue of ₹40,025.79 million, up 12.4% YoY and 2.6% QoQ. Net profit reached ₹4,421.85 million with EPS at ₹23.22. Company secured new TCV wins worth $428 million.",
            "Sentiment": "positive",
            "PublishDate": 1769079378628,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC MF crosses 5% stake in Mphasis via open market",
            "Summary": "HDFC Mutual Fund's shareholding in Mphasis Limited increased to 5.01% as of January 16, 2026, crossing the regulatory threshold requiring disclosure under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768908796771,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mphasis Grants 10,000 Stock Options Under ESOP 2016",
            "Summary": "Mphasis Limited grants 10,000 stock options to identified employee under ESOP 2016 with exercise price of ₹2,800 per option, vesting over 5 years in equal proportions.",
            "Sentiment": "positive",
            "PublishDate": 1768830815611,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mphasis Appoints Punit Sood as Independent Director",
            "Summary": "Mphasis has appointed Mr. Punit Sood as an Independent Director for five years effective December 11, 2025, while Ms. Jan Kathleen Hier concludes her tenure as Independent Director and Chairperson on December 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765378447341,
            "Source": "stocks"
        },
        {
            "Title": "Mphasis Grants 5,000 Stock Options Under ESOP 2016 Plan",
            "Summary": "Mphasis ESOP Compensation Committee approved the grant of 5,000 stock options to an identified employee under the Employee Stock Option Plan 2016, with an exercise price of ₹2,700 per option. The options vest over 5 years in equal proportion and are exercisable within 60 months from respective vesting dates, with shares to be administered through Mphasis Employees Equity Reward Trust.",
            "Sentiment": "neutral",
            "PublishDate": 1764865705957,
            "Source": "corporate_action"
        },
        {
            "Title": "Mphasis Partners with Five Startups Through Sparkle Innovation Program to Accelerate Enterprise Solutions",
            "Summary": "Mphasis has partnered with five startups from Nasscom's InnoTrek program - EdgeableAI, PerpetuuitiTechnosoft, QuoQo, and SuperBrynAI - to co-create enterprise-grade solutions in areas including Edge AI, IT resilience, automation, and voice-based AI operations. The collaboration provides startups with technical mentorship, go-to-market strategy refinement, and access to global enterprise clients through Mphasis's Sparkle Innovation Program.",
            "Sentiment": "positive",
            "PublishDate": 1764761527411,
            "Source": "stock"
        },
        {
            "Title": "Mphasis Allots 102,556 Shares Under Employee Stock Plans",
            "Summary": "Mphasis allotted 15,922 shares under ESOP 2016 and 86,634 shares under RSU Plan 2021 following ESOP Compensation Committee approval on 26 November 2025. The company will utilize employee benefit trusts to manage exercise prices and applicable taxes through share deductions and loan repayments.",
            "Sentiment": "neutral",
            "PublishDate": 1764263000027,
            "Source": "corporate_action"
        },
        {
            "Title": "Mphasis Receives ESG Score of 73 from S&P Global Corporate Sustainability Assessment",
            "Summary": "Mphasis has been awarded an ESG score of 73 out of 100 by S&P Global in its Corporate Sustainability Assessment Scorecard for 2025. The company outperformed industry averages across all three categories with Environmental score of 62 (vs 37 average), Social score of 77 (vs 36 average), and Governance score of 78 (vs 42 average).",
            "Sentiment": "positive",
            "PublishDate": 1764002560562,
            "Source": "stock"
        },
        {
            "Title": "Deutsche Bank Releases Encumbrance on 1.8 Crore Mphasis Shares",
            "Summary": "Deutsche Bank Group released encumbrance on 1,80,00,000 Mphasis shares (9.46% stake) on November 18, 2025, reducing their encumbered shareholding from 40.10% to 30.64%. The release was connected to BCP Topco's sale of shares and relates to a USD 1.1 billion facility agreement involving multiple international lenders.",
            "Sentiment": "neutral",
            "PublishDate": 1763634627120,
            "Source": "corporate_action"
        },
        {
            "Title": "Kotak Mahindra Mutual Fund Increases Stake in Mphasis to 9.28%",
            "Summary": "Kotak Mahindra Mutual Fund acquired 32,55,495 equity shares of Mphasis Limited through open market purchases, increasing its holding from 7.57% to 9.28% of the company's total share capital. The acquisition was completed on November 18, 2025, and disclosed under SEBI substantial acquisition regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763634180487,
            "Source": "corporate_action"
        },
        {
            "Title": "Mphasis Promoter BCP Topco IX May Sell Up To 18 Million Shares",
            "Summary": "Mphasis promoter BCP Topco IX PTE announced it may offer up to 18 million shares for sale, with the decision dependent on prevailing market conditions. The potential share sale by the promoter entity could impact Mphasis' shareholding structure and provide liquidity to existing investors.",
            "Sentiment": "neutral",
            "PublishDate": 1763437946343,
            "Source": "stock"
        },
        {
            "Title": "Mphasis Sees Large Block Trades Worth Rs. 332.19 Crores on NSE",
            "Summary": "Mphasis witnessed two significant block trades on NSE totaling Rs. 332.19 crores, involving 1,257,174 shares at prices of Rs. 2659.70 and Rs. 2637.80 per share. The trades indicate substantial institutional activity in the IT services company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763437631500,
            "Source": "order&deals"
        },
        {
            "Title": "Mphasis Grants 25,000 Stock Options and 7,500 Restricted Stock Units to Employees",
            "Summary": "Mphasis has approved the grant of employee stock benefits through its ESOP Compensation Committee. The company granted 25,000 stock options under the Employee Stock Option Plan 2016 at an exercise price of ₹2,700 per option, with a 5-year vesting period in equal proportions and a 60-month exercise window. Additionally, 7,500 Restricted Stock Units were granted under the RSU Plan 2021 at ₹10 per RSU, vesting over 5 years in the ratio 10:10:20:30:30. The RSU plan includes automatic exercise provisions, particularly for US employees subject to Internal Revenue Code requirements. Both plans will be administered through employee trusts - the Mphasis Employees Equity Reward Trust for stock options and the Mphasis Employees Benefit Trust for RSUs. Each option and RSU entitles holders to one equity share of the company.",
            "Sentiment": "positive",
            "PublishDate": 1762453069490,
            "Source": "corporate_action"
        },
        {
            "Title": "Mphasis Reports Record Revenue of $445M in Q2, Launches AI Platform NeoIP",
            "Summary": "Mphasis delivered its highest quarterly revenue of $445 million in Q2, growing 2% sequentially and 6% year-over-year in constant currency. The company won $528 million in Total Contract Value (TCV) for the second consecutive quarter, including six large deals with one exceeding $100 million from a new BFS client. Direct business contributed 97.5% to overall revenue, with BFS vertical growing 13.8% year-over-year despite ATM business ramp-down. The company launched MphasisNeoIP, an AI platform integrating multiple solutions for enterprise transformation. Pipeline reached record levels, growing 97% year-over-year with 69% being AI-led. EBIT margin remained stable at 15.3%, while EPS grew 10.2% year-over-year to INR 24.7. First half TCV wins of approximately $1.3 billion exceeded full year FY25 TCV wins, with last 12 months TCV reaching over $2 billion. The company expects growth to be greater than 2x industry growth and will target EBIT margin in the 14.75% to 15.75% band.",
            "Sentiment": "positive",
            "PublishDate": 1762357074300,
            "Source": "earnings"
        },
        {
            "Title": "Mphasis Allots 155,762 Shares Under Employee Stock Plans",
            "Summary": "Mphasis allotted shares to employees through its stock compensation programs. The ESOP Compensation Committee approved the allotment of 14,403 shares under the Employee Stock Options Plan 2016 and 141,359 shares under the Restricted Stock Units Plan 2021. For employees using the Cashless Scheme, the Mphasis Employees Equity Reward Trust will deduct appropriate shares to cover exercise prices and applicable taxes, with proceeds used to repay company loans and taxes. Similarly, the Mphasis Employees Benefit Trust will handle deductions for RSU Plan participants to cover costs and taxes.",
            "Sentiment": "neutral",
            "PublishDate": 1761997221444,
            "Source": "corporate_action"
        },
        {
            "Title": "Mphasis Anticipates Banking Sector Growth and Improved Logistics Margins",
            "Summary": "Mphasis anticipates growth in the banking and financial services sector from October to March. The company sees increased demand for AI-driven contracts from the banking sector. Logistics operations were affected in July to September primarily due to investments. The company expects a significant increase in logistics operations margin from October to December. Furloughs from October to March may differ from last year.",
            "Sentiment": "positive",
            "PublishDate": 1761882241414,
            "Source": "stock"
        },
        {
            "Title": "Mphasis Targets 14.75%-15.75% EBIT Margin, Plans Growth Above Industry Average",
            "Summary": "Mphasis plans to convert its pipeline to total contract value and subsequently to revenue. The company is targeting an EBIT margin range of 14.75% to 15.75%. Mphasis expects to achieve growth more than twice the industry average, citing strong performance in the first half and successful conversion of TCV wins into revenue.",
            "Sentiment": "positive",
            "PublishDate": 1761879777075,
            "Source": "stock"
        },
        {
            "Title": "Mphasis Reports Strong Q2 FY26 Results with 11.4% YoY Revenue Growth and 10.2% EPS Increase",
            "Summary": "Mphasis Limited announced its quarterly results for the period ended September 30, 2025. The company reported gross revenue growth of 5.3% quarter-over-quarter and 11.4% year-over-year. Revenue from operations reached ₹39,019.11 million compared to ₹35,361.46 million in the same quarter last year. Net profit increased to ₹4,690.74 million, representing a 6.2% quarterly growth and 10.8% annual growth. Earnings per share grew 10.2% year-over-year to ₹24.7. The company secured new Total Contract Value wins of USD 528 million in direct business, with 87% attributed to new-generation services. Operating margin was reported at 15.3%. Key business segments showed varied performance, with Banking and Financial Services generating ₹20,161.42 million in revenue. The company completed several strategic acquisitions during the period and received multiple industry recognitions.",
            "Sentiment": "positive",
            "PublishDate": 1761857690673,
            "Source": "earnings"
        },
        {
            "Title": "Mphasis Achieves ISO/IEC 42001:2023 Certification for AI Management Systems",
            "Summary": "Mphasis has received ISO/IEC 42001:2023 certification for its AI management systems. This certification relates to the company's artificial intelligence management capabilities and processes.",
            "Sentiment": "positive",
            "PublishDate": 1761622481390,
            "Source": "stock"
        },
        {
            "Title": "Mphasis Launches NeolP™ AI Platform for Enterprise Transformation",
            "Summary": "Mphasis announced the launch of NeolP™, an AI platform designed for continuous enterprise transformation. The platform integrates multiple Mphasis.ai solutions and utilizes Ontosphere, an ontology-powered knowledge graph. Early client deployments show up to 60% efficiency gains in development and modernization, 50% reduction in incident resolution time, and measurable margin improvements. NeolP™ includes solutions across four categories: Modernization, Application Development, ITOps, and BusinessOps, delivered through specialized AI agents and frameworks. The platform connects with third-party AI agents through Model Context Protocol and Agent2Agent standards. Mphasis has transformed its AppStore into an AI-powered marketplace for employees to access NeolP™ solutions. The platform sets the foundation for Mphasis' Quantum initiative, which will introduce quantum computing and AI solutions.",
            "Sentiment": "positive",
            "PublishDate": 1761536145074,
            "Source": "stock"
        },
        {
            "Title": "Mphasis Schedules Board Meeting for October 31 to Review Q2 Results",
            "Summary": "Mphasis has scheduled a board meeting for October 31 to review its Q2 results. The meeting will focus on examining the company's quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1758801632415,
            "Source": "earnings"
        },
        {
            "Title": "Mphasis Says U.S. H-1B Visa Fee Increase Will Not Significantly Impact Operations",
            "Summary": "Mphasis announced that the new U.S. H-1B visa fee of $100,000 per petition will not significantly affect its financials or operations. The company had approximately 130 new H-1B filings in calendar year 2025, receiving 78 approvals. Mphasis attributes its resilience to low H-1B filing volume, reduced visa reliance through local hiring, acquisitions, and partnerships, and its focus on AI-led deals. The company stated it is fully staffed for existing client requirements and will continue operating in business-as-usual mode.",
            "Sentiment": "positive",
            "PublishDate": 1758483235866,
            "Source": "stock"
        },
        {
            "Title": "Mphasis CEO Reports Billion-Dollar Deal Surge as Enterprise AI Adoption Accelerates",
            "Summary": "Mphasis CEO Nitin Rakesh reported that enterprise customers are moving beyond AI experimentation toward scaling initiatives, creating opportunities for large transformational deals. The company closed nearly a billion dollars in Total Contract Value deals over the last two quarters, representing a significantly higher run rate. Rakesh noted that clients with existing AI infrastructure are seeking scale, while others need partners to build capabilities. He observed that recession fears affecting the industry for three years are receding, with potential rate cuts creating a softer environment that could benefit macro-dependent business segments. The CEO highlighted a foundational shift in the IT industry away from the traditional linear correlation between revenue and headcount growth, suggesting the historical 1:1 ratio could drop to 0.7 or 0.6 as companies pivot from people-based efforts to bundled technology solutions.",
            "Sentiment": "positive",
            "PublishDate": 1757065273141,
            "Source": "stock"
        },
        {
            "Title": "Flagstar Names Mphasis as Technology Modernization Partner for Data Center Transformation",
            "Summary": "Mphasis has been selected by Flagstar as its technology modernization partner to enhance the bank's data center infrastructure. The partnership focuses on four key areas: enhancing customer-centric culture through improved performance, scalability, and security; supporting ongoing transformation by streamlining service delivery; realizing cost efficiencies by leveraging modern data center capabilities and retiring legacy infrastructure; and strengthening risk management through innovation and enhanced data protection. The modernization involves building secure, agile, and scalable technology infrastructure with a modular, scalable design that enables faster innovation and better response to customer and market needs. The collaboration represents a strategic investment in operational resilience and positions Flagstar for a hybrid cloud future while setting a benchmark in banking infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1754029312302,
            "Source": "order&deals"
        },
        {
            "Title": "Mphasis Reports Record $760M Quarterly Deal Wins with 68% AI-Led Components",
            "Summary": "Mphasis achieved its highest-ever quarterly Total Contract Value (TCV) wins of $760 million, with 68% being AI-led deals. The company reported revenue of $437 million, reflecting 1.0% quarter-over-quarter and 6.5% year-over-year growth in constant currency terms. Four large deals were secured, including three deals worth $100+ million and one $50+ million deal. The Banking, Financial Services (BFS), Insurance, and Technology, Media & Telecom (TMT) verticals drove growth, with Insurance growing over 20% sequentially and 27.5% year-over-year. Direct business contributed 97% of overall revenue. The company's deal pipeline grew 16% quarter-over-quarter and 84% year-over-year, with BFS pipeline up 47% and non-BFS up 108% year-over-year. EBIT margin remained stable at 15.3%. For FY26, Mphasis expects to achieve approximately 2x industry growth with target EBIT operating margins between 14.75% to 15.75%.",
            "Sentiment": "positive",
            "PublishDate": 1753785853670,
            "Source": "earnings"
        },
        {
            "Title": "Mphasis Targets 14.75%-15.75% EBIT Margin in FY26 Driven by AI Solutions",
            "Summary": "Mphasis is experiencing strong demand for AI-led solutions as enterprises focus on efficiency-driven investments. The company aims to achieve 14.75% to 15.75% EBIT margin in FY26, supported by AI adoption. CEO Nitin Rakesh stated that enterprises are prioritizing AI strategies to achieve 20-25% efficiency gains while reducing headcount dependency. The company reported its highest Total Contract Value wins of $760 million in Q1FY26, with 68% being AI-driven. CFO Aravind Viswanathan noted that AI serves as both a scaling opportunity and margin lever. Rakesh emphasized that companies have moved from blanket IT budgets to rigorous program-by-program approval processes focused on return on investment. The CEO highlighted the shift from people-based IT services to tech solutions-based services that bundle AI capabilities. Mphasis shares traded 0.83% lower at Rs 2,631.6 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1753585634709,
            "Source": "stock"
        },
        {
            "Title": "Mphasis Reports Q1 FY26 Results with Revenue of ₹3,138 Crore and PAT of ₹405 Crore",
            "Summary": "Mphasis Limited announced consolidated financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹31,376.82 million (₹3,137.68 crore) and profit after tax of ₹4,046.55 million (₹404.65 crore). The company published newspaper advertisements regarding these financial results in Business Standard and Samyuktha Karnataka newspapers. The results were prepared in accordance with Indian Accounting Standards and have been reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1753536939356,
            "Source": "earnings"
        },
        {
            "Title": "Mphasis Reports Record $760 Million TCV Wins and 84% Pipeline Growth in Q1",
            "Summary": "Mphasis delivered quarterly results showing revenue of $437 million, up 8.1% year-over-year in constant currency. The company achieved record Total Contract Value (TCV) wins of $760 million, including four large deals with three exceeding $100 million and one over $50 million. The deal pipeline grew 84% year-over-year and 16% quarter-over-quarter, with 68% of the pipeline being AI-led. Banking & Financial Services revenue grew 21.8% year-over-year to $230 million, Insurance grew 20.4% to $60 million, and Technology, Media & Telecom increased 20.0% to $79 million. Operating margins remained stable at 15.3%. The company expects to grow approximately 2X industry growth rate, targeting operating margins within 14.75%-15.75%. Earnings per share was INR 23.2, and operating cash flow reached $52 million.",
            "Sentiment": "positive",
            "PublishDate": 1753383059886,
            "Source": "earnings"
        },
        {
            "Title": "Mphasis Reports Q1 FY26 Results with 9.2% YoY Revenue Growth and Record TCV Wins",
            "Summary": "Mphasis Limited reported quarterly results with consolidated revenue from operations of ₹37,324.89 million, representing 0.4% quarter-over-quarter growth and 9.2% year-over-year growth. The company achieved profit after tax of ₹4,417.03 million, declining 1.1% quarter-over-quarter but growing 9.2% year-over-year. Direct revenue grew 1.1% quarter-over-quarter and 10.9% year-over-year on reported basis. The company recorded its highest-ever quarterly Total Contract Value (TCV) wins of USD 760 million in Direct business, with 82% in new-generation services and 68% being AI-led. Operating margin stood at 15.3%. Earnings per share was ₹23.22, declining 1.2% quarter-over-quarter but growing 8.5% year-over-year. The Board approved a final dividend of ₹57 per equity share for the previous financial year. Banking and Financial Services segment contributed ₹19,679.28 million in revenue, while other segments included Logistics and Transportation (₹2,170.93 million), Technology Media and Telecom (₹6,757.20 million), and Insurance (₹5,105.00 million).",
            "Sentiment": "positive",
            "PublishDate": 1753382009935,
            "Source": "earnings"
        },
        {
            "Title": "Mphasis Reports Strong FY25 Performance with $1.27 Billion TCV Wins and 9.5% Net Profit Growth",
            "Summary": "Mphasis Limited delivered strong financial results in FY25, achieving TCV wins of USD 1.27 billion and a 9.5% increase in net profit to ₹17,021 million. The company recorded its highest quarterly growth in 12 quarters and highest-ever quarterly and full-year EPS. Over 55% of the company's deal pipeline is now AI-led, with 85% of last quarter's deal wins powered by next-generation technology adoption. The company has expanded its AI-led offerings through proprietary platforms Mphasis NeoZeta™, Mphasis NeoCrux™ and Mphasis NeoSaBa™. Strategic developments include opening new Centers of Excellence in Buenos Aires for Financial Services and London for Quantum Technologies, launching a Cyber Fusion Center in Bangalore, and forming partnerships with Sixfold and SecPod. Mphasis won the NASSCOM AI Gamechangers Award 2023-24 in Healthcare & Pharma category and received a U.S. patent for quantum systems processing. The company improved its S&P Global DJSI Corporate Sustainability Assessment score to 74 out of 100. The Board recommended a final dividend of ₹57 per equity share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1753341662224,
            "Source": "corporate_action"
        },
        {
            "Title": "Mphasis Subsidiary Invests $4 Million in AI Company Aokah Inc.",
            "Summary": "A subsidiary of Mphasis has invested $4 million to acquire a 26% stake in Aokah Inc., an artificial intelligence-focused company. This investment represents a strategic move by Mphasis into the AI sector.",
            "Sentiment": "positive",
            "PublishDate": 1752149785000,
            "Source": "default"
        },
        {
            "Title": "Mphasis' Income Tax Demand Reduced by Half",
            "Summary": "Mphasis, an IT services company, has seen a significant reduction in its income tax demand. The original demand of ₹1,164.77 crore has been cut down to ₹582.7 crore, effectively halving the amount owed to tax authorities.",
            "Sentiment": "positive",
            "PublishDate": 1752048446000,
            "Source": "default"
        },
        {
            "Title": "Mphasis to Review Q1 Results on July 24th",
            "Summary": "Mphasis, an IT services company, has scheduled a review of its first quarter (Q1) financial results on July 24th. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1750941098000,
            "Source": "default"
        },
        {
            "Title": "Mphasis Collaborates with Sixfold to Enhance Insurance Underwriting",
            "Summary": "Mphasis has announced a strategic collaboration with Sixfold, aimed at improving insurance underwriting capabilities. The partnership is expected to enhance Mphasis's offerings in the insurance sector, potentially leading to improved services for their clients in this area.",
            "Sentiment": "positive",
            "PublishDate": 1750073967000,
            "Source": "default"
        },
        {
            "Title": "Mphasis: Clarifies Ongoing Service Provider Relationship with FedEx",
            "Summary": "Mphasis has clarified that it continues to be a service provider in the FedEx ecosystem, countering a recent report suggesting the loss of FedEx business. The company maintains its previously shared outlook and assessment. Mphasis reported a 2.6% quarterly revenue growth in US Dollar terms and $390 million in deal wins for the March quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748918509000,
            "Source": "normal_news"
        },
        {
            "Title": "Mphasis Clarifies Relationship with FedEx",
            "Summary": "Mphasis has issued a clarification regarding a news article about losing a FedEx contract. The company states that it remains a 'service provider' within the FedEx ecosystem. Mphasis also reaffirms its revenue outlook, suggesting that the relationship with FedEx continues to be significant for the company's business.",
            "Sentiment": "neutral",
            "PublishDate": 1748916675000,
            "Source": "default"
        },
        {
            "Title": "Mphasis Shares Drop on FedEx Contract Termination Concerns",
            "Summary": "Mphasis shares experienced a decline of nearly 3% due to concerns that their business could be negatively affected by reports of FedEx terminating a business deal.",
            "Sentiment": "negative",
            "PublishDate": 1748847060000,
            "Source": "normal_news"
        },
        {
            "Title": "Mphasis Ltd: Shares Tumble on Reported Loss of Major Client FedEx",
            "Summary": "Mphasis shares fell 5% following reports that FedEx, its third-largest client accounting for 8% of revenue, will end their agreement by year-end. FedEx has reportedly chosen Accenture for most of its IT work. Mphasis has not confirmed the news.",
            "Sentiment": "negative",
            "PublishDate": 1748839726000,
            "Source": "normal_news"
        },
        {
            "Title": "Mphasis Announces Target Operating Margin and Strategic Focus",
            "Summary": "Mphasis has set its target operating (EBIT) margin within the range of 14.75% to 15.75%. The company is concentrating on converting its pipeline to Total Contract Value (TCV) and subsequently transforming TCV into revenue.",
            "Sentiment": "positive",
            "PublishDate": 1745552463000,
            "Source": "default"
        },
        {
            "Title": "Mphasis Ltd.: Strong Q4 Growth and Record Deal Wins",
            "Summary": "Mphasis reported 2.6% sequential revenue growth in Q4, its highest in three years. Deal wins reached $390 million, a seven-quarter high, with 59% being AI-led. BFSI and TMT verticals showed strong growth. The company targets EBIT margins of 14.75-15.75% and expects to outpace industry growth.",
            "Sentiment": "positive",
            "PublishDate": 1745550456000,
            "Source": "earnings"
        },
        {
            "Title": "Mphasis Q4 EBIT Slightly Below Estimates",
            "Summary": "Mphasis reported Q4 EBIT of 5.67 billion rupees, up from 5.46 billion rupees in the previous quarter but below the estimated 5.73 billion rupees. The Q4 EBIT margin was 15.3%, slightly down from 15.32% in the previous quarter and below the estimated 15.4%.",
            "Sentiment": "neutral",
            "PublishDate": 1745549502000,
            "Source": "result"
        },
        {
            "Title": "Mphasis Reports Q4 Financial Results",
            "Summary": "Mphasis, an IT services company, has announced its Q4 financial results. The company reported revenue of 37.1 billion rupees, compared to 35.61 billion rupees in the previous quarter. This figure was slightly below the estimated 37.15 billion rupees. The consolidated net profit for Q4 was 4.46 billion rupees, up from 4.28 billion rupees in the previous quarter and slightly above the estimated 4.44 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1745549333000,
            "Source": "result"
        },
        {
            "Title": "Mphasis Secures U.S. Patent for Quantum Prediction System",
            "Summary": "Mphasis, an IT services and solutions provider, has been granted a U.S. patent for its quantum prediction system. This technological advancement demonstrates the company's innovative capabilities in quantum computing applications, potentially enhancing its competitive edge in the IT industry.",
            "Sentiment": "positive",
            "PublishDate": 1744184444000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mphasis: IT Firm Receives ₹232.37 Crore Tax Notice for Foreign Payments",
            "Summary": "Mphasis has received a ₹232.37 crore tax demand from the Income Tax Department for FY 2018-19 and 2019-20 regarding payments to foreign subsidiaries. The company plans to challenge the order, believing it has a strong case. No penalties imposed. Mphasis shares closed down 5.90% at ₹2,234.00.",
            "Sentiment": "negative",
            "PublishDate": 1743763598000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mphasis to Consider Q4 Results on April 24",
            "Summary": "Mphasis Limited has announced that it will consider its fourth quarter financial results on April 24. This is a routine corporate announcement regarding the company's upcoming earnings release.",
            "Sentiment": "neutral",
            "PublishDate": 1742990596000,
            "Source": "earnings"
        },
        {
            "Title": "Mphasis to Offer Vulnerability Management Services via SecPod's SanerNow CVEM",
            "Summary": "Mphasis, an IT services and solutions provider, has announced that it will offer vulnerability management services using SecPod's SanerNow CVEM (Continuous Vulnerability and Exposure Management) platform. This partnership aims to enhance Mphasis' cybersecurity offerings to its clients.",
            "Sentiment": "positive",
            "PublishDate": 1741587030000,
            "Source": "corporate_action"
        }
    ]
}