{
    "Symbol": "MPSLTD",
    "ISIN": "INE943D01017",
    "News": [
        {
            "Title": "MPS Limited Shareholders Approve Director Re-appointment",
            "Summary": "MPS Limited shareholders approved the re-appointment of Mr. Suhas Khullar as Independent Director and registered office relocation through postal ballot with overwhelming majority support.",
            "Sentiment": "positive",
            "PublishDate": 1770635983749,
            "Source": "stocks"
        },
        {
            "Title": "MPS Invests $16.5M in Unbound Medicine",
            "Summary": "MPS announces strategic $16.5 million investment in Unbound Medicine through mixed debt and equity structure to accelerate growth in North American healthcare technology market.",
            "Sentiment": "positive",
            "PublishDate": 1770256084217,
            "Source": "co_actions_results"
        },
        {
            "Title": "MPS Pharmaa Reports Q3FY26 Loss of ₹22.03 Lakh",
            "Summary": "MPS Pharmaa Limited posted net loss of ₹22.03 lakh for Q3FY26 versus ₹17.46 lakh loss in Q3FY25. Nine-month loss widened to ₹66.06 lakh with no operational income.",
            "Sentiment": "negative",
            "PublishDate": 1770115402894,
            "Source": "co_actions_results"
        },
        {
            "Title": "MPS Limited Q3FY26 Earnings Call on Feb 2, 2026",
            "Summary": "MPS Limited announces earnings conference call scheduled for February 02, 2026 at 05:00 P.M. IST to discuss Q3FY26 and nine months financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769616210893,
            "Source": "co_actions_results"
        },
        {
            "Title": "Taurian MPS Secures ₹34 Crore Order",
            "Summary": "Taurian MPS has announced securing a significant order worth ₹34 crores, marking a notable business development for the company in its operational portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768231133223,
            "Source": "co_actions_results"
        },
        {
            "Title": "Taurian MPS shares surge 5% on ₹34 crore orders",
            "Summary": "Taurian MPS Limited secured fresh orders worth ₹34.02 crore from domestic and international customers at EXCON Exhibition in Bengaluru, boosting shares by 5% to ₹244 per share.",
            "Sentiment": "positive",
            "PublishDate": 1768218539429,
            "Source": "co_actions_results"
        },
        {
            "Title": "MPS Infotecnics Non-Executive Director Resigns",
            "Summary": "MPS Infotecnics Ltd announces resignation of Non-Executive Director Mr. Peeyush Kumar Aggarwal effective December 26, 2025, citing pre-occupation and health issues as reasons for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1767186781964,
            "Source": "stocks"
        },
        {
            "Title": "MPS Limited Appoints Radha Papinani as General Counsel",
            "Summary": "MPS Limited announces the appointment of Mrs. Papinani Radha Rani as General Counsel and Senior Management Personnel, effective December 29, 2025, bringing over three decades of legal expertise.",
            "Sentiment": "positive",
            "PublishDate": 1767002845992,
            "Source": "stocks"
        },
        {
            "Title": "MPS Limited Initiates Postal Ballot Process for Key Resolutions",
            "Summary": "MPS Limited has initiated postal ballot process through remote e-voting for director re-appointment and office relocation, with voting period from January 8 to February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766578032040,
            "Source": "stocks"
        },
        {
            "Title": "MPS Limited Grants 28,906 ESOPs Under 2023 Scheme",
            "Summary": "MPS Limited's Nomination and Remuneration Committee approved the grant of 28,906 employee stock options under ESOS 2023 at ₹1,996.90 per share with 4-year equal vesting and 5-year exercise period.",
            "Sentiment": "positive",
            "PublishDate": 1766403855657,
            "Source": "co_actions_results"
        },
        {
            "Title": "MPS Infotecnics Gets Court Relief in SEBI Dispute",
            "Summary": "Delhi High Court disposed of MPS Infotecnics' writ petition against SEBI and market intermediaries regarding custodial charges, directing respondents to consider it as representation.",
            "Sentiment": "positive",
            "PublishDate": 1765869071750,
            "Source": "stocks"
        },
        {
            "Title": "MPS Limited CPO Geetika Hans Resigns Due to Personal Reasons",
            "Summary": "MPS Limited announces resignation of Chief People Officer Geetika Hans effective December 15, 2025, citing personal commitments as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1765794424509,
            "Source": "stocks"
        },
        {
            "Title": "MPS Limited Reports Strong Q2 FY26 Results with 9.42% Revenue Growth and Margin Expansion",
            "Summary": "MPS Limited achieved revenue of INR 194.44 crores in Q2 FY26, up 9.42% year-on-year, with EBITDA improving 13.03% to INR 60.47 crores and margins expanding to 31.10%. The company completed acquisition of remaining 35% stake in Liberate Group and consolidated corporate learning operations under MPS Interactive, while maintaining debt-free status with INR 117 crores cash.",
            "Sentiment": "positive",
            "PublishDate": 1763570865409,
            "Source": "earnings"
        },
        {
            "Title": "MPS Limited Reports Q2 FY26 Financial Results with Exceptional Items from Restructuring",
            "Summary": "MPS Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved the standalone and consolidated financial results at their meeting on November 12, 2025. The company operates through two main segments: Research Solutions and Education Solutions. During the period, MPS recognized exceptional items totaling INR 1,573 lakhs related to restructuring activities, including the acquisition of the Liberate Group and American Journal Experts business restructuring costs. The company's subsidiary MPS Interactive Systems Limited completed 100% acquisition of the Liberate Group on October 28, 2025. Walker Chandiok & Co LLP conducted limited reviews of both standalone and consolidated results. The results include operations across multiple international subsidiaries and will be published in newspapers as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762925183402,
            "Source": "earnings"
        },
        {
            "Title": "MPS Reports Revenue Growth to 1.9 Billion Rupees in Q2",
            "Summary": "MPS reported quarterly revenue of 1.9 billion rupees compared to 1.7 billion rupees in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1762924629220,
            "Source": "earnings"
        },
        {
            "Title": "MPS Reports 57% Jump in Q2 Net Profit to 554 Million Rupees",
            "Summary": "MPS reported quarterly net profit of 554 million rupees compared to 352.4 million rupees in the same period last year. The company's EBITDA increased to 605 million rupees from 535 million rupees year-over-year. EBITDA margin improved to 31.10% from 30.11% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762924142503,
            "Source": "earnings"
        },
        {
            "Title": "MPS Limited Schedules Q2 and H1 FY26 Earnings Conference Call",
            "Summary": "MPS Limited has announced an earnings conference call to discuss its unaudited financial results for the second quarter and half year ended September 30, 2025. The call is scheduled for Wednesday, November 12, 2025, at 4:30 PM IST. Chairman and CEO Rahul Arora along with the senior management team will address the call. The company has provided multiple dial-in numbers for participants including India national toll-free and international toll-free numbers for USA, UK, Singapore, and Hong Kong. Participants can also join through a Diamond Pass registration link for no wait time access.",
            "Sentiment": "neutral",
            "PublishDate": 1762536372600,
            "Source": "earnings"
        },
        {
            "Title": "MPS Completes 100% Acquisition of Liberate Group to Expand Learning Solutions in APAC",
            "Summary": "MPS has completed the purchase of a full 100% stake in Liberate Group. The acquisition is aimed at enhancing the company's global learning solutions offerings and expanding its presence in the Asia-Pacific region.",
            "Sentiment": "positive",
            "PublishDate": 1761657758640,
            "Source": "order&deals"
        },
        {
            "Title": "MPS Interactive Systems Increases Stake in Australian Learning Companies to 82.5%",
            "Summary": "MPS Interactive Systems Limited, a material subsidiary of MPS Limited, completed the acquisition of an additional 17.50% stake in Liberate Learning Pty Ltd and App-eLearn Pty Ltd, increasing its shareholding from 65.00% to 82.50% in these Australian entities. The acquisition was made through cash consideration, with shares purchased at AUD 255.80 per share for Liberate Learning and AUD 0.03 per share for App-eLearn. The companies plan to acquire the remaining 17.50% shareholding in these two entities and the 35% shareholding in Liberate eLearning Pty Ltd in the near term. Liberate Group operates in the corporate learning industry, providing digital and blended learning solutions, and reported revenue of INR 42.09 crores for the financial year ended June 30, 2025. The acquisition aligns with MPS Interactive Systems' strategy to strengthen its presence in the corporate learning market, particularly in the APAC region.",
            "Sentiment": "positive",
            "PublishDate": 1760716891734,
            "Source": "order&deals"
        },
        {
            "Title": "MPS Interactive Systems Secures INR 87.36 Crore Investment from Australian Tech Leader Rodney Charles Beach",
            "Summary": "MPS Interactive Systems Limited, a subsidiary of MPS Limited, entered into a Share Subscription and Shareholders Agreement with Rodney Charles Beach on October 10, 2025. Beach will invest INR 87,362,000 to acquire equity shares with a face value of INR 10 each through preferential allotment. The transaction is subject to regulatory approvals and compliance with the Companies Act, 2013. Following the investment, MPSi will cease to be a wholly owned subsidiary of MPS Limited, though MPS will retain over 95% ownership. Beach, founder of Australia's Liberate Group with over 30 years of experience in learning and education technology, will assume the role of President at MPSi. The agreement grants Beach customary tag-along and drag-along rights, while MPS retains the right to issue new shares subject to value appreciation. Beach has no special rights regarding director nomination, pre-emptive subscription rights, or capital structure restrictions. The investment aligns with MPS Limited's strategy to accelerate its corporate learning initiatives and global expansion in AI-powered learning solutions.",
            "Sentiment": "positive",
            "PublishDate": 1760121441893,
            "Source": "order&deals"
        },
        {
            "Title": "MPS Infotech Receives SEBI Notice Regarding Compliance Instructions",
            "Summary": "MPS Infotech has received a notice from the Securities and Exchange Board of India (SEBI) directing the company to follow specific instructions. The nature and details of the instructions were not specified in the available information.",
            "Sentiment": "negative",
            "PublishDate": 1754476077769,
            "Source": "corporate_governance"
        },
        {
            "Title": "MPS Limited Reports 3.9% Revenue Growth in Q1 FY26 with 22.51% EBITDA Increase",
            "Summary": "MPS Limited reported revenue growth of 3.9% year-over-year in Q1 FY26, while EBITDA grew 22.51%. The company's headcount increased from 3,007 to 3,263 employees and Days Sales Outstanding (DSO) was brought down to 45 days. The Education Solutions segment showed strong performance with 56.64% revenue growth and 36% EBITDA margin, driven entirely by organic growth. Research Solutions experienced a small revenue decline due to intentional rightsizing of AJE operations, which now operates at USD 12 million annual run rate compared to USD 18 million previously, but achieved 23% EBITDA margin. Corporate Learning segment saw revenue decline of 32% as part of a planned turnaround strategy. The company has restructured its segment reporting to market-based approach covering Research Solutions, Education Solutions, and Corporate Learning. North America revenue recovered to 51% of total revenue from 48% in Q4 FY25. The Board approved amalgamation of ADI BPO Services Limited with MPS Limited to simplify shareholding structure. Management expects multiple acquisition deals in FY26 and remains confident about Vision 2027 targets.",
            "Sentiment": "neutral",
            "PublishDate": 1753434183841,
            "Source": "earnings"
        },
        {
            "Title": "MPS Ltd: Q1 Revenue Growth Disappoints, Shares Plummet 16%",
            "Summary": "MPS Ltd's Q1 revenue grew only 2.9% YoY to ₹186.3 crore, with core Research Solutions business declining. Net profit rose 40% to ₹35 crore. The company approved merger with ADI BPO Services Ltd and restructuring of MPS Europa AG. Shares fell 16.5% post-results.",
            "Sentiment": "negative",
            "PublishDate": 1752827017000,
            "Source": "earnings"
        },
        {
            "Title": "MPS Reports Improved Q1 Financial Results",
            "Summary": "MPS has announced its Q1 financial results. The company's EBITDA increased to 503 million rupees from 410 million rupees in the same quarter last year. The EBITDA margin improved to 27% from 22.71% year-over-year. Additionally, MPS reported a consolidated net profit of 352 million rupees, up from 259 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752822527000,
            "Source": "result"
        },
        {
            "Title": "MPS Reports Q4 Results and Recommends Dividend",
            "Summary": "MPS has announced its quarterly results and recommended a dividend. The company's Q4 consolidated net profit increased to 471 million rupees from 287.1 million rupees year-over-year. Revenue rose to 1.8 billion rupees from 1.49 billion rupees in the same period. EBITDA for Q4 was 560 million rupees, up from 427.6 million rupees year-over-year, with the EBITDA margin improving to 30.76% from 28.62%. The company has recommended a dividend of 50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747400367000,
            "Source": "result"
        },
        {
            "Title": "MPS Limited to Consider Fund Raising Proposals",
            "Summary": "MPS Limited has scheduled a board meeting on February 28 to evaluate various fund raising proposals. The company will consider raising funds through equity shares, convertible preference shares, warrants, and qualified institutional placement (QIP).",
            "Sentiment": "neutral",
            "PublishDate": 1740403039000,
            "Source": "corporate_action"
        },
        {
            "Title": "MPS Launches DigiCorePro Workflow Solution",
            "Summary": "MPS is introducing a new workflow solution called DigiCorePro. This next-generation tool is designed to streamline and unify previously fragmented workflows, with the aim of enhancing overall system efficiency and productivity.",
            "Sentiment": "positive",
            "PublishDate": 1737689299000,
            "Source": "corporate_action"
        },
        {
            "Title": "MPS Ltd Confirms Long-Term Revenue Target of Rs 1,500 Crore by FY 2028",
            "Summary": "MPS Ltd has reaffirmed its long-term revenue target of Rs 1,500 crore by fiscal year 2028, known as Vision 2027. The company expects to maintain similar profit margins during this growth period. MPS has provided a three-year guidance, with FY 2025 serving as the halfway mark towards achieving this goal.",
            "Sentiment": "positive",
            "PublishDate": 1737689174000,
            "Source": "corporate_action"
        },
        {
            "Title": "MPS Reports Increased Q3 EBITDA, Slight Decline in EBITDA Margin",
            "Summary": "MPS has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 603 million rupees, up from 446 million rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 32.38% from 33.36% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737617609000,
            "Source": "earnings"
        },
        {
            "Title": "MPS Reports Q3 Revenue Increase",
            "Summary": "MPS Limited has announced its third-quarter revenue results. The company reported revenue of 1.86 billion rupees, compared to 1.33 billion rupees in the same quarter of the previous year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737617609000,
            "Source": "earnings"
        },
        {
            "Title": "MPS Reports Increase in Q3 Consolidated Net Profit",
            "Summary": "MPS Limited has announced its financial results for the third quarter, reporting a consolidated net profit of 407 million rupees. This represents a significant increase from the 297.3 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1737617516000,
            "Source": "earnings"
        },
        {
            "Title": "MPS Reports Increased Q2 EBITDA, Slight Margin Decline",
            "Summary": "MPS has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 535 million rupees, up from 405.6 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 30.11% from 31.30% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730219918000,
            "Source": "result"
        },
        {
            "Title": "MPS Reports Q2 Revenue Growth",
            "Summary": "MPS has announced its Q2 revenue of 1.78 billion rupees, showing a significant increase from 1.3 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730219905000,
            "Source": "result"
        },
        {
            "Title": "MPS Reports 36.92% Revenue Increase in Q2",
            "Summary": "MPS has announced a significant revenue growth of 36.92% for the second quarter compared to the previous period. This substantial increase indicates strong performance and potential market expansion for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730219891000,
            "Source": "result"
        },
        {
            "Title": "MPS Reports Increase in Q2 Consolidated Net Profit",
            "Summary": "MPS Limited has announced its Q2 consolidated net profit of 352.4 million rupees, showing an increase from 300 million rupees year-over-year and 259 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730219781000,
            "Source": "result"
        }
    ]
}