{
    "Symbol": "MRF",
    "ISIN": "INE883A01011",
    "News": [
        {
            "Title": "MRF Files Security Cover Certificate for Debentures",
            "Summary": "MRF Limited submitted security cover certificate to NSE and BSE for unsecured non-convertible debentures as per SEBI circular dated May 19, 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1770393230952,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRF Declares Dividend of Rs 3 Per Share",
            "Summary": "Leading tyre manufacturer MRF has announced a dividend payment of Rs 3 per share for its shareholders, reflecting the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1770362972039,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRF Q3 Net Profit Surges 119% to ₹6.8B",
            "Summary": "MRF Limited reported consolidated net profit of ₹6.8 billion in Q3, marking a significant 119% year-on-year growth from ₹3.1 billion in the corresponding quarter of previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770362839201,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRF Board Meet on Feb 6 for Q3FY26 Results & Dividend",
            "Summary": "MRF Limited announces board meeting on February 6, 2026 to consider Q3FY26 unaudited financial results and second interim dividend declaration with record date set for February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769512494950,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRF Q2 Earnings: Profit Jumps 11.7% as Brokerages Split on Outlook",
            "Summary": "MRF reported quarterly profit growth of 11.7% to Rs 526 crore with revenue rising 7.2% to Rs 7,379 crore, while EBITDA margin expanded to 15.3% and the company announced Rs 3 per share interim dividend. Brokerages remain divided with Kotak maintaining 'sell' citing rich valuations despite raising target to Rs 1,27,500, while CLSA upgraded target to Rs 1,78,536 on 'outperform' rating expecting margin benefits from falling input costs.",
            "Sentiment": "positive",
            "PublishDate": 1763344177659,
            "Source": "earnings"
        },
        {
            "Title": "MRF Reports 7% Revenue Growth and 12% Net Profit Jump in Q2, Declares 30% Interim Dividend",
            "Summary": "MRF's consolidated total income increased 7% to Rs 7,487 crores for the quarter ended September 30, 2025, with net profit rising 12% to Rs 526 crores compared to Rs 471 crores in the same period last year. The company declared an interim dividend of Rs 3 per share (30%) and attributed the improved performance to softening raw material prices, strong OE sales growth, and good export performance despite temporary GST reduction impact on replacement sales.",
            "Sentiment": "positive",
            "PublishDate": 1763115667203,
            "Source": "earnings"
        },
        {
            "Title": "MRF Signs Power Supply Deal and Plans 26% Equity Investment in Serentica Renewables India",
            "Summary": "MRF has entered into a power supply agreement with Serentica Renewables India and plans to acquire up to 26% equity stake in the company for ₹99 crores. The investment is aimed at boosting renewable energy supply for MRF's operations.",
            "Sentiment": "positive",
            "PublishDate": 1760000372525,
            "Source": "order&deals"
        },
        {
            "Title": "MRF Limited Reports Illegal Strike at Chennai Manufacturing Plant",
            "Summary": "MRF Limited disclosed that some workmen at its Tiruvottiyur manufacturing plant in Chennai, Tamil Nadu have gone on an illegal strike. The strike relates to payment of annual insurance premium as advance and opposition to hiring trainees under the National Apprentice Promotion Scheme (NAPS), Prime Ministers Internship Scheme (PMIS) and Naan Mudhalvan Scheme. The Tiruvottiyur facility is one of ten factories the company operates across India. Operations are partially continuing with non-striking workers, and the company is taking steps to restore normalcy. MRF stated that the strike's impact does not exceed financial thresholds requiring disclosure under SEBI regulations.",
            "Sentiment": "negative",
            "PublishDate": 1758608422651,
            "Source": "stock"
        },
        {
            "Title": "MRF Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "MRF reported Q1 consolidated net profit of 5 billion rupees, down from 5.7 billion rupees in the same quarter last year. Revenue increased to 76.75 billion rupees from 72 billion rupees year-over-year. EBITDA declined to 10.7 billion rupees from 11.6 billion rupees, while EBITDA margin compressed to 13.96% from 16.11% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754982266960,
            "Source": "earnings"
        },
        {
            "Title": "MRF Ltd: Record Date Set for FY25 Final Dividend",
            "Summary": "MRF Ltd has fixed July 18, 2025, as the record date for its final dividend of Rs 229 per share for FY25. The dividend will be paid on or after August 18, 2025. The company's 64th AGM is scheduled for August 7, 2025, via video conferencing. The total dividend for FY25, including two interim dividends, amounts to Rs 235 per share.",
            "Sentiment": "positive",
            "PublishDate": 1751615209000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRF: Q4 Profit Surges 31%, Announces Record Dividend",
            "Summary": "MRF Ltd reported a 31.2% increase in Q4 profit to ₹498 crore, with revenue growing 11.7% YoY to ₹6,944 crore. EBITDA reached ₹1,043 crore, exceeding estimates. The company declared its highest-ever final dividend of ₹229 per share, bringing the total FY2025 dividend to ₹235.",
            "Sentiment": "positive",
            "PublishDate": 1746603068000,
            "Source": "earnings"
        },
        {
            "Title": "MRF Reports Strong Q4 Results and Declares Dividend",
            "Summary": "MRF announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 10.8 billion rupees from 9.11 billion, with EBITDA margin rising to 15.25% from 14.35%. Revenue grew to 71 billion rupees from 63.5 billion. Consolidated net profit rose to 5.1 billion rupees from 3.96 billion. Additionally, MRF declared a dividend of 229 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746602495000,
            "Source": "result"
        },
        {
            "Title": "MRF Ltd: Q4 FY25 Results and Dividend Announcement Scheduled for May 7",
            "Summary": "MRF Ltd will announce Q4 and FY25 results on May 7, 2025. The board will consider final dividend declaration. Trading window closed from April 1 to May 9, 2025. Q3 FY25 saw 34.5% YoY drop in net profit to Rs 330.27 crore, while revenue rose 13.6% to Rs 7,000.82 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1746437458000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRF to Consider Q4 Results on May 7",
            "Summary": "MRF Limited has announced that it will consider its fourth quarter financial results on May 7. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746016378000,
            "Source": "default"
        },
        {
            "Title": "MRF: Arun Mammen Elected ATMA Chairman",
            "Summary": "Arun Mammen, Vice Chairman and MD of MRF Ltd, has been elected as the new Chairman of the Automotive Tyre Manufacturers' Association (ATMA). Hiroshi Yoshizane of Bridgestone India becomes Vice Chairman. Mammen aims to enhance the Indian tyre industry's global competitiveness.",
            "Sentiment": "positive",
            "PublishDate": 1741799799000,
            "Source": "corporate_governance"
        },
        {
            "Title": "MRF Ltd: Announces Second Interim Dividend, Ex-Dividend Date Set",
            "Summary": "MRF Ltd has declared a second interim dividend of Rs.3 per equity share (30%) for the financial year ending March 31, 2025. The record date is set for February 14, 2025, with dividend payment to occur on or after February 25. Today is the last day to purchase shares to be eligible for this dividend.",
            "Sentiment": "positive",
            "PublishDate": 1739415739000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRF Reports Decline in Q3 EBITDA and Margin",
            "Summary": "MRF, a leading tire manufacturer, has reported a decrease in its Q3 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) and EBITDA margin compared to the same period last year. The company's Q3 EBITDA fell to 8.35 billion rupees from 10.54 billion rupees year-over-year. Additionally, the EBITDA margin declined to 11.93% from 17.12% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738825643000,
            "Source": "earnings"
        },
        {
            "Title": "MRF Reports Q3 Revenue Growth",
            "Summary": "MRF, a leading tire manufacturer, has announced its third-quarter revenue results. The company reported revenue of 70 billion rupees, compared to 61.6 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738825619000,
            "Source": "earnings"
        },
        {
            "Title": "MRF Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "MRF, a leading tire manufacturer, has reported a consolidated net profit of 3.1 billion rupees for the third quarter, marking a significant decrease from 5.08 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738825587000,
            "Source": "earnings"
        },
        {
            "Title": "MRF Ltd: Q3 Results and Dividend Declaration Scheduled for February 6",
            "Summary": "MRF Ltd will announce Q3 FY2025 results on February 6, 2025. The board will also consider declaring a second interim dividend, with a record date of February 14, 2025 if approved. The company previously declared an interim dividend of Rs 3 per share in November 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1738728344000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRF to Consider Q3 Results on February 6",
            "Summary": "MRF (Madras Rubber Factory) Limited has announced that it will consider its third quarter (Q3) financial results on February 6. This indicates that the company is preparing to review and potentially approve its financial performance for the latest quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738152017000,
            "Source": "earnings"
        },
        {
            "Title": "MRF: Rs 3 Interim Dividend Declared, Q2 Profit Down 20%",
            "Summary": "MRF announced an interim dividend of Rs 3 per share, with a record date of November 19, 2024. Q2 FY2025 standalone net profit declined 20% YoY to Rs 455 crore, while revenue rose 11% to Rs 6,760 crore. EBITDA fell 14% to Rs 974 crore, with margins at 14.4%.",
            "Sentiment": "neutral",
            "PublishDate": 1731056036000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRF Reports Decline in Q2 EBITDA and Margin",
            "Summary": "MRF, an Indian tire manufacturer, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased from 11.3 billion rupees in the previous year to 10.1 billion rupees in the current quarter. Additionally, the EBITDA margin fell from 18.54% to 14.7% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731048840000,
            "Source": "result"
        },
        {
            "Title": "MRF Reports Decline in Q2 Consolidated Net Profit",
            "Summary": "MRF, a leading tire manufacturer, reported a consolidated net profit of 4.7 billion rupees for the second quarter, down from 5.9 billion rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1731048800000,
            "Source": "result"
        },
        {
            "Title": "MRF: Board to Consider Interim Dividend on Nov. 8",
            "Summary": "MRF Ltd. will consider declaring an interim dividend on Nov. 8, with a record date of Nov. 19 if approved. The board will also review Q2 FY2025 financial results. Additionally, MRF plans to acquire 26% stake in Clean Max Omni Pvt for Rs 7.26 crore to enhance renewable power supply.",
            "Sentiment": "neutral",
            "PublishDate": 1729683650000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRF to Acquire up to 26% Stake in Clean Max Omni",
            "Summary": "MRF, a leading tire manufacturer, has announced its intention to acquire up to 26% of the paid-up equity of Clean Max Omni. This move suggests MRF is expanding its investments in the renewable energy sector, as Clean Max Omni is likely involved in clean energy solutions.",
            "Sentiment": "positive",
            "PublishDate": 1729572865000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRF Signs Captive Power Purchase Agreement with Clean Max Omni",
            "Summary": "MRF has entered into a Captive Power Purchase Agreement with Clean Max Omni. The deal is valued at 72.6 million (currency not specified, likely Indian Rupees).",
            "Sentiment": "positive",
            "PublishDate": 1729572791000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRF Ltd: Stock Drops for Fifth Consecutive Session",
            "Summary": "MRF Ltd's stock price decreased by 1.02% to Rs 129,687.8 on the NSE. The company has seen a 4.09% decline in the last month, underperforming both the NIFTY and Nifty Auto index. Trading volume is lower than the monthly average.",
            "Sentiment": "negative",
            "PublishDate": 1729065900000,
            "Source": "normal_news"
        }
    ]
}