{
    "Symbol": "MRPL",
    "ISIN": "INE103A01014",
    "News": [
        {
            "Title": "MRPL Completes Physical Share Transfer Process",
            "Summary": "Mangalore Refinery completes re-lodgement of 200 physical shares worth ₹10 each from IEPF demat account following SEBI compliance requirements with no objections received.",
            "Sentiment": "neutral",
            "PublishDate": 1769679771261,
            "Source": "stocks"
        },
        {
            "Title": "MRPL Targets Debt Reduction from ₹9,290 Crore",
            "Summary": "Mangalore Refinery & Petroleum expects strong Q4 FY26 performance and aims to further reduce its current debt of ₹9,290 crore in the next quarter, subject to favorable market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1768879891615,
            "Source": "stocks"
        },
        {
            "Title": "MRPL Shares Q3FY26 Results Conference Call Recording",
            "Summary": "Mangalore Refinery and Petrochemicals Limited makes available audio and video recordings of its January 19, 2026 conference call discussing Q3FY26 unaudited financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768828693300,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRPL Eyes Venezuelan Oil Acquisition Opportunities",
            "Summary": "Mangalore Refinery & Petroleum management expresses interest in acquiring oil from Venezuela during recent conference call discussions with stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1768803661104,
            "Source": "stocks"
        },
        {
            "Title": "MRPL Plans 5x Retail Outlet Expansion in 5 Years",
            "Summary": "Mangalore Refinery & Petroleum announces ambitious plan to increase retail fuel outlets five times over the next five years during recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1768803013449,
            "Source": "stocks"
        },
        {
            "Title": "MRPL Freight Rates Drop Below Q2 Levels in Concall",
            "Summary": "Mangalore Refinery & Petroleum management reports freight rates have declined below Q2 levels but remain above Q1 levels during recent conference call discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1768802592944,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRPL Shifts to 40% Middle East Crude Post-Russia Exit",
            "Summary": "MRPL reveals new sourcing strategy with 40% Middle East crude and remaining via tendering process after stopping Russian crude imports, ensuring supply stability despite geopolitical conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1768801380965,
            "Source": "stocks"
        },
        {
            "Title": "MRPL Plans 1% Blended Jet Fuel Production by 2027",
            "Summary": "Mangalore Refinery & Petroleum executives announce plans to commence production of 1% blended jet fuel starting from 2027, marking the company's entry into sustainable aviation fuel segment.",
            "Sentiment": "positive",
            "PublishDate": 1768801335345,
            "Source": "stocks"
        },
        {
            "Title": "MRPL Q3 FY26 Revenue Jumps 16% to ₹29,720 Crore",
            "Summary": "Mangalore Refinery reports strong Q3 FY26 results with revenue of ₹29,720 crore and net profit of ₹1,445 crore. Debt-equity ratio improved to 0.63 from 0.79 in previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768387359179,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRPL Q3FY26 Net Profit Surges 375% to ₹1,445 Crores",
            "Summary": "Mangalore Refinery reports exceptional Q3FY26 performance with net profit jumping 375% YoY to ₹1,445.16 crores. Revenue increased 16% to ₹29,720 crores with strong operating margins.",
            "Sentiment": "positive",
            "PublishDate": 1768385374074,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRPL Stock Jumps 12% After Strong Q3 Results",
            "Summary": "MRPL shares surge 12% following Q3 results with net profit jumping to ₹1,451 crore and EBITDA margin expanding to 11.3%, reflecting strong operational performance in the December quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768384358087,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRPL Schedules Q3FY26 Earnings Call for January 19",
            "Summary": "Mangalore Refinery and Petrochemicals Limited has announced an earnings conference call on January 19, 2026, at 11:00 AM IST to discuss its Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768299159836,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRPL Schedules Q3FY26 Earnings Call for January 19",
            "Summary": "Mangalore Refinery and Petrochemicals Limited announces earnings call on January 19, 2026 at 11:00 AM IST to discuss Q3FY26 unaudited financial results under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768296194263,
            "Source": "co_actions_results"
        },
        {
            "Title": "MRPL Receives Rs 10.86 Lakh Fine from BSE and NSE for Board Composition Non-Compliance",
            "Summary": "Mangalore Refinery and Petrochemicals Limited received notices from BSE and NSE for non-compliance with board composition regulations during the quarter ended September 30, 2025, resulting in fines of Rs 5,42,800 each from both exchanges. The company has requested waiver of the fine citing that as a Central Public Sector Enterprise, director nominations are made by the Ministry of Petroleum and Natural Gas.",
            "Sentiment": "negative",
            "PublishDate": 1764401331197,
            "Source": "corporate_governance"
        },
        {
            "Title": "MRPL Decides Against Russian Oil Purchases Due to Sanctions Risk",
            "Summary": "MRPL announced it will not purchase Russian oil due to associated risks. An executive emphasized the importance of avoiding sanctions violations in Russian oil transactions. Indian banks are requesting complete transaction records from producers to sellers for such deals.",
            "Sentiment": "neutral",
            "PublishDate": 1761726765370,
            "Source": "stock"
        },
        {
            "Title": "MRPL Reports Strong Q2 Performance with 639 Crore PAT, Throughput Recovers to 4.4 MMT",
            "Summary": "Mangalore Refinery and Petrochemicals Limited reported quarterly results with revenue of 25,953 crores, EBITDA of 1,565 crores, and PAT of 639 crores. The company processed 4.4 MMT of crude and other feedstocks, recovering from 3.5 MMT in Q1 after completing turnaround maintenance. Fuel and loss stood at 10.42%, expected to normalize to around 10% for the remaining fiscal year. The company operates 185 retail outlets across Karnataka, Kerala and Tamil Nadu, targeting 250 by year-end. Russian crude comprises 30-40% of sourcing basket, with management expressing confidence in continued economic sourcing despite geopolitical concerns. Export sales account for approximately 40% of total turnover. The company expects Q3 throughput to exceed 4.43 MMT and anticipates strong performance with improved product cracks in October.",
            "Sentiment": "positive",
            "PublishDate": 1761290742079,
            "Source": "earnings"
        },
        {
            "Title": "MRPL Plans Retail Expansion and Provides Operational Guidance",
            "Summary": "MRPL aims to exceed 250 retail outlets by year-end and plans to add 100-130 outlets annually going forward. The company's typical annual capital expenditure guidance stands at approximately INR 1,500 crores, excluding potential Phase 4 expansion. MRPL expects fuel costs and losses to stabilize around 10% for the remaining fiscal year. The company anticipates Q3 crude processing to surpass 4.43 million metric tonnes and expects positive performance due to stronger Gross Refining Margins (GRMs) in October.",
            "Sentiment": "positive",
            "PublishDate": 1760672612511,
            "Source": "stock"
        },
        {
            "Title": "MRPL Explores Discounted Alternative Oil Options",
            "Summary": "MRPL has begun exploring discounted alternative oil options according to a company executive statement.",
            "Sentiment": "positive",
            "PublishDate": 1760595018949,
            "Source": "stock"
        },
        {
            "Title": "Mangalore Refinery & Petrochemicals Sees Rs. 158.57 Crore Block Trade on NSE",
            "Summary": "Mangalore Refinery & Petrochemicals Ltd. witnessed a block trade worth Rs. 158.57 crores on the National Stock Exchange. The transaction involved approximately 10,402,441 shares at a price of Rs. 152.44 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1760587152383,
            "Source": "order&deals"
        },
        {
            "Title": "MRPL Reports Strong Q2 Turnaround with ₹639 Crore Profit After Previous Quarter Loss",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) reported a net profit of ₹638.67 crore for the quarter ended September 30, 2025, marking a significant recovery from a loss of ₹271.97 crore in the previous quarter. Revenue from operations increased to ₹25,952.94 crore compared to ₹20,988.03 crore in the preceding quarter. For the half-year period, the company achieved a net profit of ₹366.70 crore versus a loss of ₹616.75 crore in the same period last year. The company's total debt decreased to ₹10,552.33 crore from ₹12,866.61 crore as of March 2025. Earnings per share improved to ₹3.64 for the quarter from a loss of ₹1.55 per share in the previous quarter. The debt-equity ratio improved to 0.79 times. Cash and cash equivalents increased substantially to ₹807.66 crore from ₹10.10 crore at the beginning of the year.",
            "Sentiment": "positive",
            "PublishDate": 1760543882115,
            "Source": "earnings"
        },
        {
            "Title": "MRPL Stops Purchasing Russian Crude Oil From Spot Market",
            "Summary": "MRPL has ceased purchasing Russian crude oil from the spot market. The company has made this operational change regarding its crude oil procurement strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1754018283276,
            "Source": "stock"
        },
        {
            "Title": "MRPL Reports Q1 FY26 Loss of Rs 272 Crores Due to Plant Turnaround and Inventory Impact",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) reported a net loss of Rs 272 crores for Q1 FY26, primarily due to planned plant turnaround and inventory losses from crude price volatility. Revenue fell to Rs 20,983 crores with EBITDA at Rs 218 crores. The company processed 3.52 million metric tonnes of crude, lower than previous year due to the shutdown. Management indicated that without the turnaround, GRM would have been around $8 per barrel. All units are now operational and the company expects Q2 throughput above 4.3 MMT with improved margins. The refinery operates 170 retail outlets and plans to add 100 more during the year. Gross debt stands at Rs 13,608 crores with net worth of Rs 12,657 crores, resulting in debt-equity ratio of 1.08x.",
            "Sentiment": "negative",
            "PublishDate": 1753337302298,
            "Source": "earnings"
        },
        {
            "Title": "MRPL Shares Surge 6.4% as YES Securities Raises Price Target on Improved Refining Margin Outlook",
            "Summary": "Mangalore Refinery and Petrochemicals Ltd (MRPL) shares climbed 6.4% to Rs 154, extending a two-day rally to 10.6% amid improved investor sentiment. YES Securities maintained its 'buy' rating and raised the price target to Rs 180 from Rs 160, valuing the stock at 1.9 times estimated FY27 price-to-book value. MRPL reported a consolidated net loss of Rs 271.97 crore for Q1FY26, reversing from a Rs 73.22 crore profit in the same period last year, with revenue declining to Rs 20,988.03 crore from Rs 27,289.40 crore year-on-year. The weak performance was attributed to a 45-day Phase-II shutdown extended by severe rainfall, lower plant utilization, and limited feedstock availability. Gross refining margin fell to $3.88 per barrel, below the brokerage's $7.3 forecast and previous quarter's $6.23. YES Securities expects better Q2 performance due to improved refining spreads, elevated diesel cracks, and geopolitical risk premiums. The company benefits from sourcing over a third of crude from Russia at discounted rates. Long-term growth is expected from petrochemicals expansion and retailing, with current net debt-to-equity at 0.99x.",
            "Sentiment": "positive",
            "PublishDate": 1753264828452,
            "Source": "stock"
        },
        {
            "Title": "MRPL Provides Audio Recording Access for Q1 FY2026 Earnings Conference Call",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has made available the audio recording of its conference call with analysts and investors discussing un-audited financial results for the quarter ended June 30, 2025. The conference call was held on July 21, 2025, and the company has provided a direct link for accessing the audio recording on its website. MRPL is a subsidiary of Oil and Natural Gas Corporation Limited and operates as a government enterprise under Schedule 'A'.",
            "Sentiment": "neutral",
            "PublishDate": 1753155466605,
            "Source": "earnings"
        },
        {
            "Title": "MRPL Sets Retail Sales Target of 300-325 TKL for FY26, Plans Rs. 1,000 Cr Capital Expenditure",
            "Summary": "MRPL has set retail sales volume targets of 300-325 thousand kiloliters (TKL) for FY26, with plans to increase this to 500 TKL in FY27. The company anticipates total annual capital expenditure of approximately Rs. 1,000 crore for FY26, which includes shutdown costs.",
            "Sentiment": "positive",
            "PublishDate": 1753154980111,
            "Source": "stock"
        },
        {
            "Title": "MRPL Projects Q2 FY26 Throughput Above 4.3 Million MT, Plans 100 New Retail Outlets",
            "Summary": "MRPL expects its Q2 FY26 throughput to exceed 4.3 million metric tonnes with increased gross refining margins (GRMs) recorded in July. The company targets high single-digit GRMs for Q2 FY26. MRPL plans to open approximately 100 new retail outlets during the current financial year, aiming to reach a total of 300 outlets.",
            "Sentiment": "positive",
            "PublishDate": 1753154615325,
            "Source": "stock"
        },
        {
            "Title": "MRPL Executive Updates on Russian Oil Operations and Diesel Sales Strategy",
            "Summary": "MRPL executives provided updates on the company's oil operations and sales strategy. The company announced it will sell diesel to traders through a tender process. Executives stated they do not anticipate issues with importing Russian oil in July and expect higher diesel cracks due to EU sanctions. The company reported that discounts on Russian oil purchases have been reduced and confirmed they are evaluating the impact of new EU sanctions on Russian oil.",
            "Sentiment": "neutral",
            "PublishDate": 1753096336181,
            "Source": "stock"
        },
        {
            "Title": "MRPL Reports Reduced Net Loss and Lower Revenue in Q1 Results",
            "Summary": "MRPL reported a net loss of 2.7 billion rupees in Q1, an improvement from the previous year's loss of 3.63 billion rupees. However, the company's revenue declined to 210 billion rupees compared to 276 billion rupees in the same quarter last year, representing a significant decrease in top-line performance.",
            "Sentiment": "neutral",
            "PublishDate": 1753057624517,
            "Source": "earnings"
        },
        {
            "Title": "MRPL Reports Reduced Net Loss Despite Revenue Decline in Q1",
            "Summary": "MRPL reported a net loss of 2.7 billion rupees in Q1, an improvement from the previous year's loss of 3.63 billion rupees. However, revenue declined to 210 billion rupees compared to 276 billion rupees in the same period last year. The company's EBITDA dropped significantly to 1.8 billion rupees from 11.3 billion rupees in the previous quarter, with EBITDA margin falling to 0.85% from 4.09% quarter-on-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1752846633616,
            "Source": "earnings"
        },
        {
            "Title": "Mangalore Refinery and Petrochemicals Ltd: Q4 Net Profit Plunges 68%",
            "Summary": "MRPL reported a 68% decline in Q4 net profit to ₹363 crore, down from ₹1,136 crore year-over-year. Revenue decreased 2.9% to ₹24,596 crore. EBITDA fell 51.7% to ₹1,130 crore, with margins contracting to 4.6% from 9.2%.",
            "Sentiment": "negative",
            "PublishDate": 1745667093000,
            "Source": "earnings"
        },
        {
            "Title": "MRPL Reports Improved Q4 EBITDA and Margin",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has reported its Q4 financial results. The company's EBITDA increased to 11.3 billion rupees from 10.3 billion rupees in the previous quarter. The EBITDA margin also improved slightly to 4.09% from 4.03% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745660903000,
            "Source": "result"
        },
        {
            "Title": "MRPL Reports Increase in Q4 Net Profit and Revenue",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has announced its Q4 financial results. The company's net profit increased to 3.63 billion rupees, up from 3 billion rupees in the previous quarter. Revenue also saw a rise, reaching 276 billion rupees compared to 256 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745660481000,
            "Source": "result"
        },
        {
            "Title": "Mangalore Refinery and Petrochemicals to Consider Q4 Results on April 26",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has announced that it will consider its fourth quarter financial results on April 26. This announcement indicates that the company's board of directors will meet to review and approve the financial statements for the quarter ending March 31, 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1744806070000,
            "Source": "default"
        },
        {
            "Title": "MRPL Achieves Record-Breaking Crude Processing Throughput",
            "Summary": "Mangalore Refinery and Petrochemical Limited (MRPL) has reached a significant milestone by achieving its highest-ever crude processing throughput, exceeding 18 million metric tonnes per annum (MMTPA). This accomplishment demonstrates the company's operational efficiency and capacity utilization in its refining operations.",
            "Sentiment": "positive",
            "PublishDate": 1743499821000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRPL, ONGC, and SOCAR Sign MoU for Energy Cooperation",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL), Oil and Natural Gas Corporation (ONGC), and the State Oil Company of Azerbaijan Republic (SOCAR) have signed a tripartite Memorandum of Understanding (MoU) at India Energy Week 2025. The agreement aims to strengthen energy cooperation through mutual supply and trade of crude oil, liquefied natural gas (LNG), and petroleum products.",
            "Sentiment": "positive",
            "PublishDate": 1739621195000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalore Refinery & Petrochemicals: Q3 Profit Drops 21%, Revenue Declines",
            "Summary": "Mangalore Refinery & Petrochemicals reported Q3 FY25 results with profit falling 21.11% YoY to ₹309.3 crore. Revenue decreased 9.8% YoY to ₹25,600.78 crore. QoQ profit improved 144.38%, despite an 11.06% revenue decline. EPS fell 21.43% YoY to ₹1.76. Analysts' consensus recommendation is to Sell.",
            "Sentiment": "negative",
            "PublishDate": 1737437825000,
            "Source": "earnings"
        },
        {
            "Title": "Mangalore Refinery and Petrochemicals Limited: Acquires Shares in Mangalore SEZ",
            "Summary": "MRPL's Board approves acquisition of 1,34,80,000 equity shares of Mangalore SEZ Ltd. from IL&FS for Rs 656.6 million in cash.",
            "Sentiment": "neutral",
            "PublishDate": 1737437234000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mangalore Refinery and Petrochemicals Ltd: Q3 Net Profit Drops 21% YoY",
            "Summary": "MRPL reported a 21% decrease in Q3 FY25 net profit to Rs 309 crore, down from Rs 392 crore a year ago. Revenue fell to Rs 25,601 crore from Rs 28,364 crore. Gross refining margin improved to USD 6.21 per barrel. The company achieved highest crude processing at 4.54 million tonnes and record production of ATF and benzene.",
            "Sentiment": "neutral",
            "PublishDate": 1737377813000,
            "Source": "earnings"
        },
        {
            "Title": "Mangalore Refinery and Petrochemicals Ltd: Significant Stake Increase in MSEZ Approved",
            "Summary": "MRPL's board approved increasing its stake in Mangalore SEZ Ltd from 0.96% to 27.92% by acquiring 1,34,80,000 equity shares from IL&FS at a revised cost of ₹65.66 crore. The acquisition is expected to be completed within one year.",
            "Sentiment": "positive",
            "PublishDate": 1737366557000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRPL Reports Significant EBITDA Improvement in Q3",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a gain of 10.3 billion rupees, compared to a loss of 4.74 billion rupees in the previous quarter. This represents a quarter-on-quarter turnaround. Additionally, MRPL's EBITDA margin for Q3 stood at 4.03%.",
            "Sentiment": "positive",
            "PublishDate": 1737357598000,
            "Source": "earnings"
        },
        {
            "Title": "MRPL Reports Quarterly Revenue Decline",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has reported a quarter-on-quarter decline in revenue. The company's Q3 revenue stood at 257 billion rupees, down from 288 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1737357521000,
            "Source": "earnings"
        },
        {
            "Title": "MRPL Reports Q3 Net Profit of 3 Billion Rupees",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has reported a net profit of 3 billion rupees for the third quarter, marking a significant turnaround from a loss of 6.8 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737357488000,
            "Source": "earnings"
        },
        {
            "Title": "MRPL Initiates First Toluene Shipment",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has commenced its first shipment of toluene, marking a significant milestone in its petrochemical operations. This event indicates MRPL's expansion into new product lines and potentially signals growth in its petrochemical business segment.",
            "Sentiment": "positive",
            "PublishDate": 1737073236000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRPL Flags Off First Toluene Parcel",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has announced the dispatch of its first toluene parcel. Toluene is an important aromatic compound used in various industries. This milestone signifies MRPL's expansion into petrochemical products and diversification of its product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1737031277000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRPL Launches Toluene Production Facility",
            "Summary": "The Minister of Petroleum and Natural Gas, Hardeep Singh Puri, launched MRPL's new toluene product during a visit to the refinery. MRPL's toluene facility has an annual production capacity of 40 TMT, contributing to India's self-reliance and global competitiveness in the petrochemical sector. The minister also held discussions with MRPL's senior officials during his visit.",
            "Sentiment": "positive",
            "PublishDate": 1736727588000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRPL Signs Lease Agreement with ISPRL for Crude Oil Storage",
            "Summary": "Mangalore Refinery And Petrochemicals Limited (MRPL) has entered into a lease agreement with Indian Strategic Petroleum Reserves Limited (ISPRL) for the storage of crude oil. This agreement allows MRPL to utilize ISPRL's storage facilities, potentially enhancing the company's crude oil storage capacity and operational flexibility.",
            "Sentiment": "positive",
            "PublishDate": 1736382161000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRPL Signs Lease Agreement with ISPRL for Crude Oil Storage",
            "Summary": "Mangalore Refinery and Petrochemicals Limited (MRPL) has entered into a lease agreement with Indian Strategic Petroleum Reserves Limited (ISPRL) for the storage of crude oil. This agreement allows MRPL to utilize ISPRL's storage facilities, potentially enhancing its crude oil storage capacity and operational flexibility.",
            "Sentiment": "neutral",
            "PublishDate": 1736341869000,
            "Source": "corporate_action"
        },
        {
            "Title": "MRPL: Q2 Loss of ₹684 Crore Despite 29% Revenue Increase",
            "Summary": "MRPL reported a Q2 FY2025 loss of ₹683.6 crore, compared to a profit of ₹1,059 crore in Q2 FY2024. Revenue increased 29% to ₹24,967.9 crore. EBITDA showed a loss of ₹473.8 crore versus a gain of ₹2,138.3 crore in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1729248924000,
            "Source": "result"
        }
    ]
}