{
    "Symbol": "MSPL",
    "ISIN": "INE752G01015",
    "News": [
        {
            "Title": "MSP Steel Promoter Group Acquires 1.41 Cr Shares",
            "Summary": "MSP Steel & Power's promoter group acquired 1.41 crore shares through open market purchases from November to December 2025, increasing total shareholding from 35.24% to 37.74%.",
            "Sentiment": "positive",
            "PublishDate": 1767018371003,
            "Source": "co_actions_results"
        },
        {
            "Title": "MSP Steel EGM Voting Results: Special Resolution Passed",
            "Summary": "MSP Steel & Power's EGM on December 12, 2025 successfully passed special resolution for convertible warrant issue with 99.9996% approval from 104 valid folios representing 35.59 crore shares.",
            "Sentiment": "positive",
            "PublishDate": 1765379513492,
            "Source": "co_actions_results"
        },
        {
            "Title": "MSP Steel Power Promoter Group Entity Acquires 11.17 Lakh Equity Shares",
            "Summary": "Shree Vinay Finvest Private Limited, a promoter group entity of MSP Steel Power Limited, purchased 11,17,500 equity shares through open market transactions on December 3 and 4, 2025. The company submitted the mandatory disclosure under SEBI insider trading regulations to stock exchanges NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1765192200756,
            "Source": "corporate_action"
        },
        {
            "Title": "MSP Steel Power Promoter Group Entities Purchase 18.93 Lakh Equity Shares",
            "Summary": "Two promoter group entities of MSP Steel Power Limited acquired a total of 18,93,400 equity shares through open market purchases between November 28 and December 1, 2025. Jaik Leasing Commercial Investment Limited purchased 5,35,800 shares while Shree Vinay Finvest Private Limited acquired 12,57,600 shares, increasing their respective shareholdings in the company.",
            "Sentiment": "positive",
            "PublishDate": 1764830144446,
            "Source": "corporate_action"
        },
        {
            "Title": "MSP Steel Power Promoter Group Entities Purchase 13.11 Lakh Equity Shares",
            "Summary": "Two promoter group entities of MSP Steel Power Limited acquired a total of 13,10,982 equity shares through open market purchases on November 25-27, 2025. Shree Vinay Finvest Private Limited purchased 5,43,600 shares while Jaik Leasing Commercial Investment Limited bought 7,67,382 shares, with both transactions executed on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1764591107929,
            "Source": "corporate_action"
        },
        {
            "Title": "MSP Steel Power Promoter Group Entities Acquire Additional Equity Stakes",
            "Summary": "Two promoter group entities of MSP Steel Power Limited purchased equity shares through open market transactions - Shree Vinay Finvest acquired 11,35,000 shares on November 20-21, 2025, while Jaik Leasing Commercial Investment bought 5,78,700 shares on November 24, 2025. The acquisitions increased Jaik Leasing's shareholding from 5.58% to 5.69%, with both transactions disclosed under SEBI insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1764137687126,
            "Source": "corporate_action"
        },
        {
            "Title": "MSP Steel Power Limited Schedules EGM to Issue 2.8 Crore Convertible Warrants Worth Rs 98 Crores",
            "Summary": "MSP Steel Power Limited will hold an Extraordinary General Meeting on December 12, 2025, to approve the issuance of 2,80,00,000 convertible warrants at Rs 35 per warrant to promoter group entity M.A. Hire Purchase Private Limited. The preferential allotment worth Rs 98 crores aims to meet additional working capital requirements, increase promoter shareholding, repay existing loans, and fund capital expenditure for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763383887523,
            "Source": "corporate_action"
        },
        {
            "Title": "MSP Steel & Power Reports Widened Quarterly Net Loss Despite Revenue Growth",
            "Summary": "MSP Steel & Power reported a quarterly net loss of 747.7 million rupees compared to a loss of 95 million rupees in the same period last year, representing a significant deterioration in profitability. The company's revenue increased to 6.77 billion rupees from 6.56 billion rupees year-over-year, indicating operational challenges despite higher sales.",
            "Sentiment": "negative",
            "PublishDate": 1763138784041,
            "Source": "earnings"
        },
        {
            "Title": "MSP Steel & Power Receives Lender Approval for Right of Recompense Payment to Exit Corporate Debt Restructuring",
            "Summary": "MSP Steel & Power Limited has received approval from key lenders including State Bank of India, Bank of Baroda, and Indian Overseas Bank for payment of Right of Recompense (RoR), enabling the company to exit its Corporate Debt Restructuring framework. The company's borrowings were initially restructured under a CDR package led by State Bank of India during FY 2014-2015, and later restructured under the Scheme for Sustainable Structuring of Stressed Assets in FY 2017-2018. A consultant appointed by the consortium calculated the RoR amount, and upon payment, the company's RoR obligation will be fully discharged. The Board of Directors approved the RoR payment on September 15, 2025, with approvals from remaining lenders expected shortly. The company states this exit will mark a significant milestone in its turnaround journey and create opportunities for growth and expansion.",
            "Sentiment": "positive",
            "PublishDate": 1757926830441,
            "Source": "corporate_action"
        },
        {
            "Title": "MSP Steel & Power Submits Q1 FY2026 Results and Appoints Multiple Auditors",
            "Summary": "MSP Steel & Power Limited submitted its unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The Board meeting held on July 30, 2025, approved these results along with the Limited Review Report. The company reported no defaults on loans and debt securities for the quarter. Additionally, the Board made several key appointments: M/s. S K Agrawal and Co Chartered Accountants LLP as Internal Auditor for financial year 2025-2026, Mr. Sambhu Banerjee as Cost Auditor for 2025-2026 (subject to shareholder ratification), and M/s. Bajaj Todi & Associates as Secretarial Auditor for a five-year term from 2025-2026 to 2029-2030. The Board also reviewed existing corporate policies during the 45-minute meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753880823350,
            "Source": "earnings"
        },
        {
            "Title": "MSP Steel & Power Reports Mixed Q1 Results with Higher Profit Margins Despite Revenue Decline",
            "Summary": "MSP Steel & Power reported Q1 EBITDA of 449 million rupees compared to 433 million rupees in the same period last year. The company's EBITDA margin improved to 6.32% from 5.60% year-over-year. Net profit increased significantly to 178 million rupees from 68 million rupees in the previous year's corresponding quarter. However, revenue declined to 7.1 billion rupees from 7.72 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1753880389375,
            "Source": "earnings"
        }
    ]
}