{
    "Symbol": "MSTCLTD",
    "ISIN": "INE255X01014",
    "News": [
        {
            "Title": "MSTC Limited Reports Strong Q3FY26 Results",
            "Summary": "MSTC Limited delivered robust Q3FY26 performance with net profit of ₹5,241.34 lakhs and declared interim dividend of 76% (₹7.60 per share). Revenue from operations grew to ₹8,842.72 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770816776820,
            "Source": "co_actions_results"
        },
        {
            "Title": "MSTC Board Meet on Feb 11 for Q3FY26 Results",
            "Summary": "MSTC Limited schedules board meeting on February 11, 2026 to consider Q3FY26 financial results and interim dividend declaration. Trading window closed from January 1 to February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769605520586,
            "Source": "co_actions_results"
        },
        {
            "Title": "MSTC Limited Fined Rs. 10.85 Lakh by NSE and BSE for Board Composition Non-Compliance",
            "Summary": "MSTC Limited received fines of Rs. 5,42,800 each from NSE and BSE for non-compliance with board composition requirements under SEBI regulations for the quarter ended September 30, 2025. The Mini Ratna PSU has requested waiver of the fines, citing that director appointments are controlled by the Government of India through the Ministry of Steel, and the company has no role in the appointment process.",
            "Sentiment": "negative",
            "PublishDate": 1764403105153,
            "Source": "corporate_governance"
        },
        {
            "Title": "MSTC Limited Reports 12.81% Growth in Q2 FY26 PBT, Expands Digital Platform Portfolio",
            "Summary": "MSTC Limited achieved PBT of ₹125.79 crores in H1 FY26 versus ₹111.50 crores in H1 FY25, driven by 18.47% growth in e-commerce revenue to ₹146.28 crores. The company secured new contracts including EPR certificate trading platform from CPCB, gold bullion import allocation platform from DGFT, and signed 30-year agreement with Syama Prasad Mookerjee Port for e-commerce services.",
            "Sentiment": "positive",
            "PublishDate": 1763539178781,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Limited Faces Stock Exchange Fines for Board Composition Non-Compliance",
            "Summary": "MSTC Limited received fines from NSE and BSE for non-compliance with SEBI listing regulations during the quarter ended June 30, 2025. The violations included failure to appoint a woman independent director and non-compliance with the constitution of audit committee, nomination and remuneration committee, stakeholder relationship committee, and risk management committee. The company's board noted that three independent directors were appointed by the administrative Ministry during June 2025, and the company is now complying with requirements for a woman independent director and various committee compositions, though one independent director vacancy remains. MSTC emphasized that as a Government Company, the power to appoint Independent Directors is vested with the President of India through the administrative Ministry, not the Board or Company itself. The Board has requested the Ministry of Steel to expedite appointment of the required number of Independent Directors and asked stock exchanges to waive the fines, citing that director appointments are beyond the company's control.",
            "Sentiment": "negative",
            "PublishDate": 1762968208854,
            "Source": "corporate_governance"
        },
        {
            "Title": "MSTC Limited Reports Strong Q2 Performance, Announces Closure of Procurement Business Segment",
            "Summary": "MSTC Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of ₹8,500.60 lakhs for the quarter and ₹16,243.22 lakhs for the half year. Net profit for the quarter stood at ₹4,914.90 lakhs with earnings per share of ₹6.98. The Board also approved closure of the procurement business under the Bank Guarantee backed business model in the Marketing segment, which contributed ₹1,715.08 lakhs in turnover (5.52% of total turnover) during the last financial year. The closure is expected to be completed by the second quarter of FY 2026-27, with the reason cited as consolidation of business to focus on core business segments. The company continues to deal with ongoing legal proceedings related to Standard Chartered Bank borrowings of ₹14,361.97 lakhs from 2008-09 export transactions.",
            "Sentiment": "positive",
            "PublishDate": 1762960154249,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Reports 14.7% Growth in Q2 Net Profit to 475 Million Rupees",
            "Summary": "MSTC reported consolidated net profit of 475 million rupees for Q2, compared to 414 million rupees in the same period last year. Revenue increased to 850 million rupees from 719 million rupees year-over-year. EBITDA rose to 515 million rupees versus 455 million rupees, while EBITDA margin improved to 60.62% from 58.72%.",
            "Sentiment": "positive",
            "PublishDate": 1762951571697,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Limited Nominated to Conduct Gold Tariff Rate Quota E-Auctions",
            "Summary": "MSTC Limited has been nominated by the Director General of Foreign Trade, Government of India, as the consultancy/service agency to conduct e-auctions of Gold Tariff Rate Quota (TRQ) on a single source basis. The company will provide online administration services for allocation of TRQ for import of gold bullions and other commodities. Revenue will come from transaction fees paid by each bidder before bid submission in each e-tender. The agreement remains valid until either party terminates it. MSTC stated the consideration or size of the contract cannot be quantified at this stage as revenue depends on the number of e-auctions conducted and bidders participating. The company expects fair volume of business from this arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1762326361715,
            "Source": "stock"
        },
        {
            "Title": "MSTC Signs Agreement with Karnataka State Excise Department for Liquor License E-Auctions",
            "Summary": "MSTC has entered into a selling agency agreement with Karnataka's State Excise Department to conduct electronic auctions of liquor shop licenses. This partnership positions MSTC as the platform provider for the state's liquor retail licensing process through digital auction mechanisms.",
            "Sentiment": "positive",
            "PublishDate": 1761721619327,
            "Source": "stock"
        },
        {
            "Title": "MSTC Recommended by CPCB for EPR Certificate Trading Platform Development",
            "Summary": "The Central Pollution Control Board (CPCB) has recommended MSTC for the development and operation of an Electronic Trading Platform (ETP) for Extended Producer Responsibility (EPR) certificates. This platform will facilitate trading of EPR certificates, which are part of environmental compliance requirements for producers.",
            "Sentiment": "positive",
            "PublishDate": 1757895022563,
            "Source": "stock"
        },
        {
            "Title": "MSTC Limited Recommended for Electronic Trading Platform Development by Central Pollution Control Board",
            "Summary": "MSTC Limited has been recommended by the Tender Committee of Central Pollution Control Board (CPCB) for developing and operating an Electronic Trading Platform for Extended Producer Responsibility (EPR) Certificates. The company will be responsible for designing, developing, and operating the National EPR Certificate Trading Platform in compliance with CPCB's functional and regulatory guidelines. The revenue model will be based on commission from the volume of EPR Certificates traded on the platform. The consideration amount could not be quantified at this stage, and the engagement period will be determined by Letter of Award terms and conditions. MSTC confirmed that its promoter groups have no interest in the awarding entity and the contract does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1757679156783,
            "Source": "order&deals"
        },
        {
            "Title": "Government Issues Draft Vehicle Scrapping Rules, Opens 30-Day Public Consultation",
            "Summary": "The government has released a new draft notification outlining vehicle scrapping rules and is seeking public suggestions within a 30-day period. The development relates to MSTC, which operates in the vehicle scrapping sector.",
            "Sentiment": "neutral",
            "PublishDate": 1755510099220,
            "Source": "sectoral"
        },
        {
            "Title": "MSTC Expands Business Beyond E-Auctions into Green Steel and Recycling Projects",
            "Summary": "MSTC is leveraging its leadership position in e-auctions and scrap trading to diversify into new business areas including e-marketplaces, recycling, and green steel projects. The company is utilizing government partnerships and technology integration as key strategies to maintain margin growth across its expanding operations.",
            "Sentiment": "positive",
            "PublishDate": 1755102910363,
            "Source": "stock"
        },
        {
            "Title": "MSTC Limited Reports 9.5% Revenue Growth in Q1 FY2026, Appoints New Secretarial Auditor",
            "Summary": "MSTC Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported total income of ₹9,365.88 lakhs compared to ₹8,600.61 lakhs in the same quarter last year, representing a 9% increase. Net profit after tax stood at ₹4,432.31 lakhs versus ₹4,045.66 lakhs in the previous year quarter. The E-commerce segment contributed ₹8,956.85 lakhs in revenue while Marketing segment generated ₹402.05 lakhs. Earnings per share increased to ₹6.30 from ₹5.75 in the corresponding quarter. The Board also approved the appointment of M/s. Basu and Associates as Secretarial Auditor for a five-year term from FY 2025-26 to 2029-30, subject to shareholder approval. The company continues to face ongoing legal proceedings with Standard Chartered Bank regarding borrowings of ₹14,361.97 lakhs related to a 2008-09 gold jewelry export transaction dispute.",
            "Sentiment": "positive",
            "PublishDate": 1755091833532,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Limited Schedules Conference Call to Discuss Q1FY26 Financial Results",
            "Summary": "MSTC Limited will hold a conference call with investors and analysts on August 14, 2025 at 11:30 AM IST to discuss the company's financial performance for the quarter ended June 30, 2025. The call will be attended by key management including Chairman & Managing Director Shri Manobendra Ghoshal, Director (Commercial) Smt. Bhanu Kumar, Director (Finance) Shri Subrata Sarkar, and Company Secretary Shri Ajay Kumar Rai. The conference call is being organized by Equirus Securities and will provide dial-in access through multiple numbers including international toll-free options for USA, UK, Singapore, and Hong Kong participants.",
            "Sentiment": "neutral",
            "PublishDate": 1754564063437,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Ltd: Q4 Revenue Up, Profit Down 70% Amid Subsidiary Sale",
            "Summary": "MSTC Ltd reported Q4FY25 results with revenue up 9.9% to ₹89 crore, but net profit down 70% to ₹75.5 crore. EBITDA grew 11.7% to ₹54.6 crore. The company sold its subsidiary FSNL for ₹320 crore, resulting in exceptional income. Annual e-commerce transactions reached ₹89,823 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748529380000,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Reports Significant Improvement in Q4 Financial Performance",
            "Summary": "MSTC has reported a substantial improvement in its financial performance for the fourth quarter. The company's EBITDA turned positive, reaching 545 million rupees compared to a loss of 507 million rupees in the same quarter last year. The EBITDA margin for Q4 stood at 61.29%. MSTC's consolidated net profit for Q4 increased to 755 million rupees, up from 183 million rupees year-over-year, but down from 2.5 billion rupees quarter-over-quarter. The company's revenue for Q4 rose to 889 million rupees from 819 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748523473000,
            "Source": "result"
        },
        {
            "Title": "MSTC Faces 1.78 Billion Rupee Tax Demand from Income Tax Department",
            "Summary": "MSTC, a public sector company, has reported that the Income Tax Department has issued a demand for 1.78 billion rupees. This significant tax demand could potentially impact the company's financial position and may require further clarification or legal action.",
            "Sentiment": "negative",
            "PublishDate": 1744802888000,
            "Source": "default"
        },
        {
            "Title": "MSTC Ltd: Declares Third Interim Dividend of ₹4.50 for FY25",
            "Summary": "MSTC Ltd has declared a third interim dividend of ₹4.50 per equity share for FY 2024-25. The record date is set for April 2025, with dividend payment within 30 days of declaration. The company reported a 506.04% YoY increase in Q3 FY25 net profit, reaching ₹250.9 crore, with an exceptional gain of ₹275.5 crore.",
            "Sentiment": "positive",
            "PublishDate": 1742986218000,
            "Source": "corporate_action"
        },
        {
            "Title": "MSTC Secures Two-Year E-Auction Services Contract from Coal India",
            "Summary": "MSTC Limited has received a work order from Coal India for providing e-auction services. The contract duration is set for two years. This agreement signifies a continued business relationship between MSTC and Coal India, with MSTC offering its digital auction platform for Coal India's operations.",
            "Sentiment": "positive",
            "PublishDate": 1742561329000,
            "Source": "order&deals"
        },
        {
            "Title": "MSTC to Consider 3rd Interim Dividend for FY 2024-25",
            "Summary": "MSTC Limited has announced a board meeting scheduled for March 26 to consider and potentially declare a third interim dividend for the financial year 2024-25. The company's decision on the dividend, if any, will be made during this meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1742387610000,
            "Source": "corporate_action"
        },
        {
            "Title": "MSTC Secures E-Auction Service Provider Contract from Coal India Limited",
            "Summary": "MSTC has been awarded a work order by Coal India Limited to serve as an e-auction service provider. The contract involves conducting e-auctions for coal and coal products of Coal India Limited and its subsidiary companies. The engagement is set for a duration of two years.",
            "Sentiment": "positive",
            "PublishDate": 1741610440000,
            "Source": "order&deals"
        },
        {
            "Title": "Telangana Government Selects MSTC for E-Auction and E-Procurement Services",
            "Summary": "The Government of Telangana has issued an order to all its offices to use MSTC's e-auction and e-procurement services for a period of two years. This decision indicates a significant contract win for MSTC, potentially boosting its revenue and market presence in the public sector.",
            "Sentiment": "positive",
            "PublishDate": 1741180962000,
            "Source": "order&deals"
        },
        {
            "Title": "MSTC Ltd: E-commerce Firm Receives ₹105.55 Crore Income Tax Demand",
            "Summary": "MSTC Ltd has received a ₹105.55 crore demand notice from the Income Tax Department for assessment year 2019-20. The company plans to challenge the assessment and file an appeal. MSTC reported a 506.04% YoY increase in Q3 net profit at ₹250.9 crore, with revenue up 12.8% to ₹81.1 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1740752725000,
            "Source": "normal_news"
        },
        {
            "Title": "MSTC Faces 1.06 Billion Rupee Tax Demand from Income Tax Department",
            "Summary": "MSTC, a public sector company, has reported that the Income Tax Department has issued a demand for 1.06 billion rupees. This significant tax liability could potentially impact the company's financial position and may require further clarification or action from MSTC.",
            "Sentiment": "negative",
            "PublishDate": 1740748137000,
            "Source": "corporate_governance"
        },
        {
            "Title": "MSTC Ltd: Q3 Net Profit Soars 506% to ₹251 Crore on Exceptional Gain",
            "Summary": "MSTC Ltd reported a 506% YoY increase in Q3 net profit to ₹250.9 crore, driven by an exceptional gain of ₹275.5 crore. Revenue rose 12.8% to ₹81.1 crore. The company declared a second interim dividend of 320% (₹32 per share) for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1739299150442,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Reports Q3 Profit Before Tax of 618 Million Rupees",
            "Summary": "MSTC has reported a Profit Before Tax (PBT) of 618 million rupees for the third quarter, compared to 589 million rupees in the same period last year. Additionally, the company has disclosed an exceptional item of 2.75 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739199223000,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Declares Second Interim Dividend of Rs 32 Per Share",
            "Summary": "MSTC Limited has announced a second interim dividend of Rs 32 per share for its shareholders. This corporate action demonstrates the company's financial performance and its commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1739199206000,
            "Source": "corporate_action"
        },
        {
            "Title": "MSTC Reports Mixed Q3 Results with Lower EBITDA but Improved Margin",
            "Summary": "MSTC, a public sector company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 488 million rupees from 646 million rupees in the same quarter last year. However, the EBITDA margin improved significantly, rising to 60.11% from 34.93% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739199200000,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "MSTC has announced its Q3 financial results, showing a substantial increase in both profit and revenue compared to the same period last year. The company's consolidated net profit rose to 2.51 billion rupees, up from 370 million rupees in the previous year. Revenue also saw growth, reaching 811 million rupees compared to 708 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739199195000,
            "Source": "earnings"
        },
        {
            "Title": "MSTC to Consider Q3 Results on February 10",
            "Summary": "MSTC Limited has announced that it will consider and approve its financial results for the third quarter on February 10. This indicates the company is preparing to disclose its performance for the latest fiscal period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738065454000,
            "Source": "earnings"
        },
        {
            "Title": "MSTC Schedules Investor Meetings",
            "Summary": "MSTC has announced two upcoming investor meetings. The company will meet with Ramesh Damani on December 9 and Modifi Investment Services Private Limited on December 16.",
            "Sentiment": "neutral",
            "PublishDate": 1733376934000,
            "Source": "corporate_governance"
        },
        {
            "Title": "MSTC Ltd Reports Q2 Financial Results and Dividend Declaration",
            "Summary": "MSTC Ltd announced its Q2 consolidated net profit of 414 million rupees, up from 392 million rupees year-over-year but down from 471 million rupees quarter-over-quarter. Q2 revenue stood at 719 million rupees, an increase from 690 million rupees year-over-year but a decrease from 811 million rupees quarter-over-quarter. The company's board has approved a dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1731284227000,
            "Source": "result"
        },
        {
            "Title": "MSTC: Strategic Disinvestment of FSNL to Japanese Firm Finalized",
            "Summary": "MSTC signed a share purchase agreement with Konoike Transport Co. Ltd. for the strategic disinvestment of Ferro Scrap Nigam Ltd. (FSNL) for Rs 320 crore. The transaction, approved by the government last month, is now in its concluding stage. Konoike's bid exceeded the government's reserve price of Rs 262 crore.",
            "Sentiment": "positive",
            "PublishDate": 1729793685000,
            "Source": "corporate_action"
        },
        {
            "Title": "MSTC: ValueQuest India Moat Acquires 1.17% Stake, Shares Surge 17%",
            "Summary": "<p>ValueQuest India Moat Fund acquired a <span class='positive'>1.17%</span> stake in <b>MSTC</b>, causing the stock to <span class='positive'>rise 16.98%</span> to Rs 738 intraday. <b>MSTC</b>, a <span class='positive'>Mini Ratna Category-1 CPSE</span>, provides <span class='neutral'>e-commerce services</span>. The company's market cap is Rs <span class='neutral'>5,026.56 crore</span>, with the government holding <span class='neutral'>64.75%</span> stake.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728467229000,
            "Source": "block_deals"
        },
        {
            "Title": "ValueQuest Acquires 1.17% Stake in MSTC",
            "Summary": "<p><span class=\"positive\">ValueQuest</span>, an investment firm, has appeared in the <span class=\"neutral\">shareholding pattern</span> of <span class=\"positive\">MSTC Limited</span> with a <b>1.17% stake</b>. This indicates a <span class=\"positive\">significant investment</span> by ValueQuest in the <span class=\"neutral\">state-owned</span> <span class=\"positive\">e-commerce company</span> MSTC.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728457180000,
            "Source": "normal_news"
        }
    ]
}