{
    "Symbol": "MSUMI",
    "ISIN": "INE0FS801015",
    "News": [
        {
            "Title": "Motherson Sumi Wiring Q3 Net Profit Rises 6.4% YoY",
            "Summary": "Motherson Sumi Wiring reported Q3 net profit of ₹1.49 billion, up 6.4% from ₹1.40 billion last year, though falling short of analyst estimates of ₹1.80 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1769767326275,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Sumi Wiring Seeks Shareholder Approval for ESOP 2025",
            "Summary": "Motherson Sumi Wiring India Limited announces postal ballot for Employee Stock Option Scheme 2025 covering 1,55,00,000 options and remuneration revision for Whole Time Director Anurag Gahlot.",
            "Sentiment": "positive",
            "PublishDate": 1769608969000,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Sumi Wiring Board Meet Set for Jan 30, 2026",
            "Summary": "Motherson Sumi Wiring India Limited has scheduled its board meeting for January 30, 2026, to consider and approve Q3 FY26 unaudited financial results under Regulation 29.",
            "Sentiment": "neutral",
            "PublishDate": 1767779179402,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Sumi Wiring Approves ESOP 2025 Scheme",
            "Summary": "Motherson Sumi Wiring India Limited board approves Employee Stock Option Scheme 2025 with 1.55 crore options, subject to shareholder approval. Implementation through employee welfare trust.",
            "Sentiment": "positive",
            "PublishDate": 1766125906248,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motherson Sumi Wiring India Reports Best Ever Quarterly Performance with Rs 2,762 Crores Revenue",
            "Summary": "Motherson Sumi Wiring India Limited delivered its best ever quarterly performance with revenues of Rs 2,762 crores, with new Greenfields contributing approximately Rs 190 crores. EBITDA for the quarter stood at Rs 280 crores, representing 12% growth year-on-year. The company's Greenfield utilization reached 36%, an improvement from previous quarters. However, Greenfield operations reported losses of Rs 46 crores in the current quarter compared to Rs 31 crores in the previous quarter, though management indicated the situation is improving when adjusted for certain recoveries. The company's EV share increased to 7% from 5% in the previous quarter. Copper prices increased 5% quarter-on-quarter and 13% year-on-year, impacting raw material costs with a quarterly lag in customer compensation. Staff costs have stabilized at Rs 475-480 crores range. The company has budgeted CAPEX of around Rs 210 crores for the current year.",
            "Sentiment": "positive",
            "PublishDate": 1762781489468,
            "Source": "earnings"
        },
        {
            "Title": "Motherson Sumi Wiring India Reports 18.5% Revenue Growth in Q2 FY2026",
            "Summary": "Motherson Sumi Wiring India Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs 2,761.86 crores compared to Rs 2,325.64 crores in the same quarter last year, marking an 18.8% increase. For the half-year period, revenue reached Rs 5,255.89 crores versus Rs 4,510.48 crores in the previous year. Net profit for the quarter was Rs 165.24 crores compared to Rs 152.08 crores in the corresponding quarter last year. The company's earnings per share stood at Rs 0.25 for the quarter. The Board of Directors approved these results in their meeting held on November 5, 2025. The company had previously issued bonus shares in the ratio of 1:2, increasing its paid-up share capital to Rs 663.17 crores from Rs 442.11 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762334972523,
            "Source": "earnings"
        },
        {
            "Title": "Motherson Sumi Wiring India Makes Institutional Investor Meet Presentation Available Online",
            "Summary": "Motherson Sumi Wiring India Limited held an Institutional Investor Meet 2025 on September 5, 2025, in Mumbai. The company has made the presentation from this investor meet available on their website. The filing was submitted to BSE and NSE under SEBI regulations. The company trades on BSE with scrip code 543498 and on NSE with scrip code MSUMI.",
            "Sentiment": "neutral",
            "PublishDate": 1757067520247,
            "Source": "stock"
        },
        {
            "Title": "Motherson Sumi Wiring India Reports Strong Q1 FY26 Results with Rs 2,494 Crores Revenue",
            "Summary": "Motherson Sumi Wiring India Limited delivered revenue of Rs 2,494 crores in Q1 FY26, with new Greenfield facilities contributing approximately Rs 156 crores. EBITDA reached Rs 244 crores, marking 15% year-on-year growth. The company outpaced industry performance due to favorable volume and content mix, supported by presence across majority of new OEM model launches. One additional Greenfield facility became operational during the quarter, with production lines in Navagam and Pune now in ramp-up mode. However, some customer plant deferrals have impacted the timeline for optimal utilization of new facilities. Staff costs increased due to hiring and training for expansion units. The company expects CAPEX of around Rs 200 crores for FY26. Management noted that EV content value is approximately 1.5-1.7 times higher than ICE models in passenger vehicles. All three Greenfield plants are now operational, though some projects face delays due to rare earth and magnet import issues.",
            "Sentiment": "positive",
            "PublishDate": 1754309239860,
            "Source": "earnings"
        },
        {
            "Title": "Motherson Sumi Wiring Reports 4% Drop in Net Profit Despite 14% Revenue Growth",
            "Summary": "Motherson Sumi Wiring India reported a 3.8% decline in net profit to Rs 143.1 crore in the June quarter, down from Rs 148.87 crore in the same period last year. The profit decline was attributed to higher expenses, which increased to Rs 2,305.26 crore from Rs 1,991.46 crore year-on-year. However, the company achieved strong revenue growth of 14% to Rs 2,494.03 crore, significantly outpacing the industry's 3% growth rate. Chairman Vivek Chaand Sehgal highlighted the company's competitiveness and strong customer relationships, enabling presence in key existing and new model launches. He noted that while a greenfield project is ramping up slower than expected due to market dynamics, the company remains on track with strategic expansion plans to support future OEM requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753722543978,
            "Source": "earnings"
        },
        {
            "Title": "Motherson Sumi Wiring India Reports Mixed Q1 Results with Higher EBITDA but Lower Margins",
            "Summary": "Motherson Sumi Wiring India reported Q1 EBITDA of 2.44 billion rupees compared to 2.38 billion rupees in the same period last year, representing an increase. However, the company's EBITDA margin declined to 9.8% from 10.9% year-over-year, indicating compressed profitability despite higher absolute earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1753695320630,
            "Source": "earnings"
        },
        {
            "Title": "Motherson Sumi Wiring India Announces Board Changes with New Japanese Nominee Director",
            "Summary": "Motherson Sumi Wiring India Limited announced changes to its Board of Directors effective July 24, 2025. Mr. Norikatsu Ishida, nominee director of Sumitomo Wiring Systems Limited, Japan, resigned from the Board. Simultaneously, Mr. Soichiro Namba was appointed as an Additional Director, also representing Sumitomo Wiring Systems Limited, Japan. The change occurred due to a change of nomination by Sumitomo Wiring Systems Limited. Mr. Namba brings over 30 years of experience in sales and international business operations with Sumitomo Electric Industries and Sumitomo Wiring Systems, including more than 10 years of international experience in Belgium and Germany. He is a graduate of Keio University, Tokyo, and is not related to any other directors of the company. His appointment as Director will be subject to approval at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753357208412,
            "Source": "corporate_governance"
        },
        {
            "Title": "Motherson Sumi Wiring India Approves 1:2 Bonus Share Issue",
            "Summary": "Motherson Sumi Wiring India has approved the issuance of bonus shares in the ratio of 1:2. This means shareholders will receive one additional share for every two shares they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1748538720000,
            "Source": "default"
        },
        {
            "Title": "Motherson Sumi Wiring: Rs 2,000 Crore Revenue Expected from New Plants",
            "Summary": "Motherson Sumi Wiring India Ltd. anticipates generating Rs 2,000 crore in revenue from three new plants, with earnings expected in H2 of FY26. The company is prepared to handle customer-suggested volumes for FY26, with two new plants set to begin operations in Q1 and Q2 of that year. Currently supplying to 9 out of 10 major companies in India, Motherson Sumi focuses on customer relationships rather than market share.",
            "Sentiment": "positive",
            "PublishDate": 1747103241000,
            "Source": "normal_news"
        },
        {
            "Title": "Motherson Sumi Wiring: EV-Driven Growth and Margin Improvement Expected in FY26",
            "Summary": "Motherson Sumi Wiring anticipates 20% growth in FY26 from new greenfield plants, with increased EV contribution. EBITDA margins expected to improve as greenfield costs normalize. Company aims to maintain or exceed 42% RoCE. Localisation efforts targeting up to 50% content per model.",
            "Sentiment": "positive",
            "PublishDate": 1747047898000,
            "Source": "normal_news"
        },
        {
            "Title": "Motherson Sumi Wiring: Q4 Profit Falls 13.85% Amid Rising Costs",
            "Summary": "Motherson Sumi Wiring India Ltd. reported a 13.85% decrease in Q4 net profit to Rs 164.93 crore, down from Rs 191.44 crore year-over-year. Revenue increased to Rs 2,509.52 crore, but higher expenses and raw material costs impacted profitability. For FY2025, profit declined to Rs 605.86 crore from Rs 638.3 crore in FY2024.",
            "Sentiment": "negative",
            "PublishDate": 1746809082000,
            "Source": "earnings"
        },
        {
            "Title": "Motherson Sumi Wiring India Reports Q4 Financial Results",
            "Summary": "Motherson Sumi Wiring India has released its Q4 financial results. The company's revenue increased to 25.09 billion rupees from 22.3 billion rupees year-over-year. However, EBITDA decreased to 2.71 billion rupees from 2.91 billion rupees year-over-year. The EBITDA margin also declined to 10.80% from 13.03% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746782530000,
            "Source": "result"
        },
        {
            "Title": "Motherson Sumi Wiring India Reports Q4 Net Profit Decline",
            "Summary": "Motherson Sumi Wiring India has reported a net profit of 1.65 billion rupees for the fourth quarter, down from 1.9 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1746782409000,
            "Source": "result"
        },
        {
            "Title": "Motherson: Secures Tier 1 Supplier Contract with Airbus Commercial Aircraft",
            "Summary": "Motherson's subsidiary CIM Tools India has signed a multi-year contract to supply aerospace components directly to Airbus Commercial Aircraft's final assembly lines. Production will commence from Motherson's Bengaluru facility.",
            "Sentiment": "positive",
            "PublishDate": 1741105327000,
            "Source": "order&deals"
        },
        {
            "Title": "Motherson Sumi Wiring India: ICICI Prudential MF Increases Stake",
            "Summary": "ICICI Prudential Mutual Fund has acquired additional shares of Motherson Sumi Wiring India through open market transactions, raising its stake to over 5% in the auto ancillary company.",
            "Sentiment": "positive",
            "PublishDate": 1740384589000,
            "Source": "block_deals"
        },
        {
            "Title": "Motherson Sumi Wiring India Ltd: Q3 Profit Dips 17%, Revenue Rises 9%",
            "Summary": "Motherson Sumi Wiring India reported a 16.6% YoY decline in Q3 net profit to ₹140 crore. Revenue increased 8.8% to ₹2,300.3 crore. EBITDA fell 9.3% to ₹237.7 crore with margin narrowing to 10.3%. The company is setting up three greenfield plants for EV and ICE vehicle projects, maintaining profitability despite expansion costs. It remains debt-free.",
            "Sentiment": "neutral",
            "PublishDate": 1738845213000,
            "Source": "earnings"
        },
        {
            "Title": "Motherson Sumi Wiring India: On Track for 40% ROCE in FY25",
            "Summary": "COO Anurag Gahlot confirms the company is on track to achieve its 40% return on capital employed target for the current fiscal year. Q2 results show a 2.6% YoY increase in net profit to Rs 152 crore and a 10.3% YoY rise in revenue to Rs 2,326 crore. The company is focusing on operational efficiencies and expanding through digitization and automation despite challenges in the labor-intensive wiring harness industry.",
            "Sentiment": "positive",
            "PublishDate": 1731383794000,
            "Source": "normal_news"
        },
        {
            "Title": "Motherson Sumi Wiring India Reports Q2 Revenue Growth",
            "Summary": "Motherson Sumi Wiring India has reported a revenue of 23 billion rupees for the second quarter, compared to 21.05 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731059600000,
            "Source": "result"
        },
        {
            "Title": "Motherson Sumi Wiring India Reports Q2 Financial Results",
            "Summary": "Motherson Sumi Wiring India has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 2.5 billion rupees, compared to 2.53 billion rupees in the same quarter last year. The EBITDA margin decreased to 10.71% from 12.02% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731059592000,
            "Source": "result"
        },
        {
            "Title": "Motherson Sumi Wiring India Reports Q2 Net Profit Decline",
            "Summary": "Motherson Sumi Wiring India has reported a net profit of 1.52 billion rupees for the second quarter, down from 1.6 billion rupees in the same period last year. This represents a year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1731059561000,
            "Source": "result"
        },
        {
            "Title": "Motherson Sumi Wiring Schedules Q2 Results Board Meeting",
            "Summary": "<p>Motherson Sumi Wiring has announced a <span class='neutral'>board meeting</span> scheduled for <b>November 8</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728566168000,
            "Source": "result"
        }
    ]
}