{
    "Symbol": "MTARTECH",
    "ISIN": "INE864I01014",
    "News": [
        {
            "Title": "MTAR Technologies Reports Insider Trading Violation",
            "Summary": "MTAR Technologies disclosed violation of insider trading policy by Deputy General Manager, who conducted unauthorized trades worth ₹73,224 profit in 2021. Company directed profit disgorgement to SEBI fund.",
            "Sentiment": "negative",
            "PublishDate": 1770458406361,
            "Source": "stocks"
        },
        {
            "Title": "MTAR Technologies Eyes ₹2800 Crore Order Book Target",
            "Summary": "MTAR Technologies management projects order book to reach ₹2800 crore by year-end, indicating strong business pipeline and growth prospects for the precision engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1769752612868,
            "Source": "stocks"
        },
        {
            "Title": "MTAR Technologies Q3 FY26 Revenue Surges 59.3% YoY",
            "Summary": "MTAR Technologies reports record quarterly revenue of Rs. 278 Cr in Q3 FY26, up 59.3% YoY. EBITDA grows 92.5% to Rs. 64 Cr while PAT jumps 117.3% to Rs. 34.7 Cr, driven by strong performance across clean energy and aerospace sectors.",
            "Sentiment": "positive",
            "PublishDate": 1769704042959,
            "Source": "co_actions_results"
        },
        {
            "Title": "MTAR Technologies Appoints New Company Secretary",
            "Summary": "MTAR Technologies Limited has appointed Ms. Priyanka Agarwal as Company Secretary and Compliance Officer effective February 2, 2026, replacing Ms. Naina Singh who resigned on January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769695656696,
            "Source": "stocks"
        },
        {
            "Title": "MTAR Technologies Q3FY26 Earnings Call on Jan 30",
            "Summary": "MTAR Technologies has scheduled its Q3FY26 earnings conference call for January 30, 2026, at 11:00 AM IST to discuss operational and financial performance for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769497297800,
            "Source": "stocks"
        },
        {
            "Title": "MTAR Tech gains after BofA buys ₹54.9 cr stake",
            "Summary": "MTAR Technologies shares rose 1.34% after BofA Securities Europe acquired a 0.66% stake worth ₹54.9 crores through bulk deal, reflecting institutional confidence in the precision engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1768216164254,
            "Source": "co_actions_results"
        },
        {
            "Title": "BofA buys MTAR Technologies shares worth ₹55 cr",
            "Summary": "Bank of America acquired over 2 lakh shares of MTAR Technologies at 6% premium through bulk deal. Stock hits fresh 52-week high of ₹2,740.45, rallying 60% in 12 months despite weak Q2 results.",
            "Sentiment": "positive",
            "PublishDate": 1767977324687,
            "Source": "co_actions_results"
        },
        {
            "Title": "BofA buys 0.66% MTAR Tech stake for ₹54.9 crore",
            "Summary": "BofA Securities Europe acquired 0.66% stake in MTAR Technologies for ₹54.9 crore on January 9, while SocGen and Marshall Wace exchanged ₹51 crore worth Tata Capital shares in bulk deals.",
            "Sentiment": "positive",
            "PublishDate": 1767975883515,
            "Source": "co_actions_results"
        },
        {
            "Title": "MTAR Technologies Gets Medium ESG Rating for FY25",
            "Summary": "MTAR Technologies Limited receives Medium category ESG rating from SES ESG Research Private Limited for FY25, independently assessed based on publicly available information.",
            "Sentiment": "neutral",
            "PublishDate": 1767779409075,
            "Source": "stocks"
        },
        {
            "Title": "MTAR Tech Promoter Pledges 1L Shares with HDFC Bank",
            "Summary": "MTAR Technologies promoter Mrs. Saranya Loka Reddy has pledged 1,00,000 equity shares (0.33% stake) with HDFC Bank Limited on December 29, 2025, as security for loan availed by Northeast Broking Services Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767330264124,
            "Source": "co_actions_results"
        },
        {
            "Title": "MTAR Technologies Wins ₹310 Cr Nuclear Orders",
            "Summary": "MTAR Technologies secures additional orders worth ₹310 crores for civil nuclear power industry, bringing total Kaiga 5 & 6 reactor orders to ₹504 crores with deliveries until February 2030.",
            "Sentiment": "positive",
            "PublishDate": 1766029957236,
            "Source": "co_actions_results"
        },
        {
            "Title": "MTAR Technologies Secures $41.17M Revised Order",
            "Summary": "MTAR Technologies receives revised purchase order worth $41.17 million (₹370.56 crores) with new order component of $10.29 million (₹92.64 crores) from existing customer, expected execution in Q2 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1765783989312,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mtar Tech Secures ₹194 Crore Order",
            "Summary": "Mtar Tech has won a new order valued at ₹194 crore. This order win represents a significant business development for the company's revenue pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1765151613676,
            "Source": "order&deals"
        },
        {
            "Title": "MTAR Technologies Secures Rs 194 Crore Order from Civil Nuclear Power Sector",
            "Summary": "MTAR Technologies Limited received orders worth Rs 194 crores from Megha Engineering Infrastructures Ltd for supply of end fittings and associated components in the civil nuclear power sector, to be executed by April 2028. The orders are part of Rs 504 crores of confirmed orders from Kaiga 5&6 reactors, with the company expecting to receive balance orders soon.",
            "Sentiment": "positive",
            "PublishDate": 1765000908864,
            "Source": "order&deals"
        },
        {
            "Title": "MTAR Technologies Company Secretary Naina Singh Resigns",
            "Summary": "Naina Singh has resigned from her position as Company Secretary and Compliance Officer of MTAR Technologies Limited, with her resignation taking effect on January 20, 2026. Singh cited pursuit of better career opportunities as the reason for her departure from the aerospace and defense equipment manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1764326035374,
            "Source": "corporate_governance"
        },
        {
            "Title": "MTAR Technologies Promoter Releases 1.08 Lakh Pledged Shares",
            "Summary": "Mrs. Saranya Loka Reddy, a promoter of MTAR Technologies, released 1,08,000 equity shares pledged with Aditya Birla Capital Limited on November 26, 2025, citing loan repayment as the reason. The release reduced her pledged shareholding from 5,08,000 shares (1.65% of total share capital) to 4,00,000 shares (1.30% of total share capital).",
            "Sentiment": "positive",
            "PublishDate": 1764324462956,
            "Source": "corporate_action"
        },
        {
            "Title": "MTAR Technologies Promoter Releases 2 Lakh Pledged Shares",
            "Summary": "Promoter Kavitha Reddy Gangapatnam released 2,00,000 equity shares pledged with 360 One Distribution Services Limited on November 25, 2025. The release reduces the promoter's encumbrance obligations and was disclosed to stock exchanges under SEBI takeover regulations.",
            "Sentiment": "positive",
            "PublishDate": 1764072819486,
            "Source": "corporate_action"
        },
        {
            "Title": "MTAR Technologies Reports Strong Order Book Growth, Expects Revenue Surge in H2 FY26",
            "Summary": "MTAR Technologies recorded revenues of INR 135 crores in Q2 with 12.5% EBITDA, while order book jumped to INR 1,296 crores from INR 930 crores in Q1, expecting to reach INR 2,800 crores by year-end. The company revised revenue guidance upward to 30-35% growth for FY26 and anticipates 2x sales in second half driven by clean energy expansion and expected nuclear orders worth INR 500 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763068082617,
            "Source": "earnings"
        },
        {
            "Title": "MTAR Technologies Secures ₹271.75 Crore Orders from International Client",
            "Summary": "MTAR Technologies has secured orders worth ₹271.75 crores from an existing international client. The orders are scheduled to be completed by Q2 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1762934617576,
            "Source": "order&deals"
        },
        {
            "Title": "MTAR Technologies Reports Order Book of ₹1,296.6 Crore with ₹497.7 Crore New Orders in Q2 FY26",
            "Summary": "MTAR Technologies Ltd reported an order book of ₹1,296.6 crore as of September 30, 2025. The company secured ₹497.7 crore in new orders during Q2 FY26, spanning clean energy, aerospace, and defence sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762397266826,
            "Source": "stock"
        },
        {
            "Title": "MTAR Technologies Reports Quarterly Results and Approves Subsidiary Merger Scheme",
            "Summary": "MTAR Technologies Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The Board of Directors approved the un-audited standalone and consolidated financial results along with limited review reports. Additionally, the Board approved a scheme of amalgamation for merging two wholly-owned subsidiaries - GeePee Aerospace and Defence Private Limited and Magnatar Aero Systems Private Limited - into the parent company, subject to necessary regulatory approvals including from the National Company Law Tribunal. The merger aims to achieve greater integration, financial strength, simplified group structure, and reduced administrative costs. No cash or share consideration will be involved in the merger process, and the shareholding pattern of MTAR Technologies will remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1762380318200,
            "Source": "earnings"
        },
        {
            "Title": "MTAR Technologies Reports Rs 135.6 Cr Revenue in Q2, Expects Strong H2 Performance",
            "Summary": "MTAR Technologies announced unaudited consolidated financial results for Q2 FY26. Revenue from operations stood at Rs 135.6 crores compared to Rs 156.6 crores in Q1 FY26. EBITDA declined to Rs 17.0 crores from Rs 28.4 crores in the previous quarter. Profit before tax dropped to Rs 5.7 crores from Rs 14.8 crores, while profit after tax decreased to Rs 4.2 crores from Rs 10.8 crores in Q1 FY26. Managing Director Parvat Srinivas Reddy stated the company expects revenue to nearly double in the second half of FY26 compared to the first half. The company anticipates 30%-35% year-on-year revenue growth in FY26 compared to FY25, exceeding earlier guidance of 25%, driven by additional order inflows. MTAR reaffirmed its EBITDA margin guidance of around 21% supported by stronger margins in H2 due to operating leverage and higher capacity utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1762367382333,
            "Source": "earnings"
        },
        {
            "Title": "MTAR Tech Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "MTAR Tech reported quarterly net profit of 45.9 million rupees compared to 188 million rupees in the same period last year. Revenue fell to 1.35 billion rupees from 1.9 billion rupees year-over-year. EBITDA decreased to 170 million rupees from 366 million rupees, while EBITDA margin contracted to 12.54% from 19.23% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762349041706,
            "Source": "earnings"
        },
        {
            "Title": "MTAR Technologies Secures ₹27.17 Crore Order from International Client",
            "Summary": "MTAR Technologies has secured orders worth ₹27.17 crores from an international client. The orders are scheduled for completion by Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761902885662,
            "Source": "stock"
        },
        {
            "Title": "MTAR Technologies Schedules Q2 FY26 Earnings Conference Call for November 6",
            "Summary": "MTAR Technologies Limited has scheduled an earnings conference call to discuss its operational and financial performance for the second quarter ended September 30, 2025. The call is set for Thursday, November 6, 2025, at 11:00 AM IST. Key participants will include Managing Director Srinivas Reddy, Chief Financial Officer Gunneswara Rao Pusarla, and Head of Strategy & Investor Relations Srilekha Jasthi. The company has provided dial-in numbers for domestic and international participants and requires pre-registration for the call.",
            "Sentiment": "neutral",
            "PublishDate": 1761897199151,
            "Source": "corporate_action"
        },
        {
            "Title": "MTAR Technologies Secures ₹263.54 Crore Orders from International Client",
            "Summary": "MTAR Technologies has received orders worth ₹263.54 crores from an international client. The deliveries for these orders are scheduled to take place from Q3 FY26 to Q2 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761825936221,
            "Source": "order&deals"
        },
        {
            "Title": "MTAR Technologies Secures Rs. 67.16 Crore Orders from International Customer",
            "Summary": "MTAR Technologies Limited received orders worth Rs. 67.16 crores (USD 7.6 million) from an existing international customer. The orders are part of the company's regular business operations and must be executed by June 2026. The company has not disclosed the customer's name due to confidentiality reasons. The orders do not involve any related party transactions, and the promoter group has no interest in the entity that awarded the contracts.",
            "Sentiment": "positive",
            "PublishDate": 1760528948637,
            "Source": "stock"
        },
        {
            "Title": "MTAR Tech Shares Surge 13% to 52-Week High on Brookfield's $5 Billion Investment in Key Client Bloom Energy",
            "Summary": "MTAR Technologies shares jumped 12.5% to reach a 52-week high of ₹2,125, marking the biggest single-day gain since February 2025. The surge followed news that Brookfield invested $5 billion in Bloom Energy, a key client of MTAR Tech, to develop fuel cells for AI data centers. MTAR Tech serves as a strategic supplier to Bloom Energy, providing power units, sheet metal assemblies, and enclosures for solid oxide fuel cell and electrolyser programs. The company is the sole supplier of Bloom Energy's electrolyser units and handles 50-60% of Bloom Energy's hotbox requirements. Clean energy fuel cells contributed 62% or ₹420 crore of MTAR Tech's revenue in financial year 2025. Trading volume reached 23.4 lakh shares compared to the 20-day average of 1.6 lakh shares. The stock has gained 25.2% in the past month and 52.9% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1760424034132,
            "Source": "stock"
        },
        {
            "Title": "MTAR Tech Partners with Adani Defence for AMCA Development Contract Bid",
            "Summary": "MTAR Tech has formed a partnership with Adani Defence to compete for an AMCA (Advanced Medium Combat Aircraft) development contract. The collaboration brings together both companies to pursue this defense sector opportunity.",
            "Sentiment": "positive",
            "PublishDate": 1760325280524,
            "Source": "order&deals"
        },
        {
            "Title": "MTAR Technologies Promoter Encumbers 125,000 Equity Shares with Bajaj Financial Securities",
            "Summary": "Mrs. Akepati Manogna Reddy, a promoter of MTAR Technologies Limited, encumbered 125,000 equity shares representing 0.41% of the company with Bajaj Financial Securities Limited on September 24, 2025. The encumbrance was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1758977443697,
            "Source": "stock"
        },
        {
            "Title": "MTAR Tech In Ongoing Discussions For Kyga 5&6 Pressurized Heavy Water Reactors",
            "Summary": "MTAR Tech continues to be engaged in discussions regarding the Kyga 5&6 Pressurized Heavy Water Reactors project. The company remains in active talks related to this nuclear reactor initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1757567111751,
            "Source": "stock"
        },
        {
            "Title": "MTAR Tech Expects Clean Energy Revenue to More Than Double and Anticipates Large Nuclear Division Order",
            "Summary": "MTAR Tech anticipates its revenue from clean energy will more than double next year. The company also expects to receive a large order from its nuclear division.",
            "Sentiment": "positive",
            "PublishDate": 1757566720385,
            "Source": "stock"
        },
        {
            "Title": "MTAR Technologies Secures Rs. 386 Crores Orders from Bloom Energy in Clean Energy Sector",
            "Summary": "MTAR Technologies Limited has received orders worth Rs. 386.06 crores (USD 43.87 million) from Bloom Energy Corporation in the clean energy fuel cells segment. The orders will be executed in two phases: Rs. 204.86 crores by March 2026 and Rs. 181.20 crores by June 2026. These are orders from an existing international customer and represent continuation of regular business in the clean energy sector. The company's Managing Director, Parvat Srinivas Reddy, stated that MTAR continues to strengthen its presence in the clean energy fuel cells segment through its product portfolio, timely execution, and cost competitiveness, with expectations of further orders in this segment.",
            "Sentiment": "positive",
            "PublishDate": 1757472191193,
            "Source": "order&deals"
        },
        {
            "Title": "MTAR Technologies Issues Corrigendum for 26th AGM, Adds Missing Auditor Re-appointment Details",
            "Summary": "MTAR Technologies Limited issued a corrigendum to its 26th Annual General Meeting notice scheduled for September 18, 2025, adding an explanatory statement for the re-appointment of statutory auditors M/s. S.R. Batliboi & Associates LLP that was inadvertently omitted from the original notice. The AGM will be held through video conferencing at 11:00 AM and includes ordinary business items such as adoption of financial statements for the year ended March 31, 2025, and director re-appointments. Special business items include re-appointment of statutory auditors for a second term of four years at Rs. 72 lakh annual fee, continuation of independent director Mr. Venkatasamy Gnana Sekaran beyond 75 years, re-appointment of whole-time directors Mr. Akepati Praveen Kumar Reddy at Rs. 96 lakh plus 30% variable pay and Mr. Anushman Reddy at Rs. 144 lakh plus 30% variable pay, ratification of cost auditor remuneration at Rs. 4 lakh, and appointment of secretarial auditors M/s. S.S. Reddy & Associates for five years at Rs. 2.4 lakh annual fee.",
            "Sentiment": "neutral",
            "PublishDate": 1757070650976,
            "Source": "corporate_action"
        },
        {
            "Title": "MTAR Technologies Reports 22% Revenue Growth in Q1 FY26, Expects INR 1,000 Crore Nuclear Orders",
            "Summary": "MTAR Technologies reported revenue from operations of INR 156.6 crores in Q1 FY26, representing 22.1% year-on-year growth. EBITDA increased 70.9% to INR 28.4 crores, while profit after tax grew 144.2% to INR 10.8 crores. The company maintains its FY26 guidance of 25% revenue growth and 21% EBITDA margin. Clean Energy segment delivered approximately INR 105 crores in revenue, with Bloom Energy providing the highest-ever forecast for upcoming fiscal year post-tariff announcements. The company expects to receive approximately INR 1,000 crores in nuclear orders within 3-6 months from Kaiga-5 and 6 projects and reactor refurbishment projects across multiple states. Aerospace and defence segment delivered INR 25 crores with expected 80% growth in FY26. The company signed a long-term agreement with Weatherford for oil and gas sector and is setting up dedicated facilities. Working capital days increased to 267 days from 229 days due to delayed receivables from conflict-affected regions, though the company targets reducing this to 200 days by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1755063146572,
            "Source": "earnings"
        },
        {
            "Title": "MTAR Technologies Targets 21% EBITDA Margin in FY26 with Strong Order Book Growth",
            "Summary": "MTAR Technologies expects to achieve a 21% EBITDA margin in FY26, supported by a strong order book projected to reach Rs 1,500-2,000 crore by year-end, according to Managing Director Parvat Srinivas Reddy. The precision engineering firm is targeting 25% revenue growth in FY26 and 30% growth thereafter. The company plans to execute approximately Rs 800 crore from its current Rs 930-crore order book this financial year and expects orders worth over Rs 1,000 crore from its nuclear business within three to six months. MTAR is building capacity for its new oil and gas segment while maintaining sufficient capacity in existing aerospace and defence segments. The company's shares closed 2.48% lower at Rs 1,550.9 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1754763858486,
            "Source": "stock"
        },
        {
            "Title": "MTAR Technologies Reports 22% Revenue Growth in Q1 FY26, Order Book Reaches Rs 930 Crores",
            "Summary": "MTAR Technologies delivered revenue of Rs 156.6 crores in Q1 FY26, marking a 22.1% year-on-year increase from Rs 128.3 crores in Q1 FY25. The company's order book stands at Rs 930.2 crores as of June 30, 2025, after receiving Rs 105.3 crores in new orders during the quarter across clean energy, aerospace & defence, and other sectors. EBITDA grew 70.9% to Rs 28.4 crores with margins improving to 18.1% from 12.9% in the previous year. Profit after tax increased 144.2% to Rs 10.8 crores compared to Rs 4.4 crores in Q1 FY25. The company's diversified portfolio includes civil nuclear power (47.6%), aerospace & defence (30.0%), fuel cells and hydel (16.6%), and products & others (5.8%). MTAR has commenced batch production for aerospace clients including GKN Aerospace, Rafael, Elbit, IAI and Thales, and entered long-term agreements with IAI and Weatherford. Working capital days increased to 267 days from 247 days in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754415378930,
            "Source": "stock"
        },
        {
            "Title": "MTAR Technologies Announces Multiple Director and Auditor Re-appointments",
            "Summary": "MTAR Technologies Limited announced several key re-appointments requiring shareholder approval. The company re-appointed S.R. Batliboi & Associates LLP as Statutory Auditors for a second term of 4 years from the 26th AGM until the 30th AGM in FY 2028-29. Directors P. Srinivas Reddy and Akepati Praveen Kumar Reddy were re-appointed as Directors retiring by rotation. The company approved continuation of Venkatasamy Gnana Sekaran as Non-Executive and Independent Director beyond age 75. Additionally, Akepati Praveen Kumar Reddy was re-appointed as Whole Time Director for 3 years at Rs. 144 lakhs annually plus 30% variable pay, and Anushman Reddy was re-appointed as Whole Time Director for 3 years at Rs. 96 lakhs annually plus 30% variable pay. Both Whole Time Director appointments are effective from August 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754388671952,
            "Source": "corporate_governance"
        },
        {
            "Title": "MTAR Tech Reports Strong Q1 Performance with 147% Jump in Net Profit",
            "Summary": "MTAR Tech delivered robust quarterly results with net profit surging to 112 million rupees from 45.4 million rupees in the same period last year. The company's revenue grew to 1.56 billion rupees compared to 1.28 billion rupees year-over-year. EBITDA increased significantly to 284 million rupees from 165 million rupees, while EBITDA margin expanded to 18.17% from 12.82% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754384832864,
            "Source": "earnings"
        },
        {
            "Title": "MTAR Technologies: Secures 10-Year Contract with Weatherford Products",
            "Summary": "MTAR Technologies has entered a 10-year contract with Weatherford Products GMBH for Whipstock assemblies and other critical products. Expected execution: ₹10 crore in FY26, ₹90 crore YoY from FY27. New facility in Adibatla to be operational by June 2026. Company's FY25 revenue grew 16.4% to ₹676 crore, below guidance. EBITDA increased 7.2% to ₹120.9 crore, margins fell to 17.9%.",
            "Sentiment": "positive",
            "PublishDate": 1750317345000,
            "Source": "order&deals"
        },
        {
            "Title": "MTAR Technologies Signs ₹90 Crore Annual Contract with Weatherford Products GmbH",
            "Summary": "MTAR Technologies has entered into a 10-year contract with Weatherford Products GmbH. The contract is valued at ₹90 crore annually. No further details about the nature of the contract or specific products involved were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750314502000,
            "Source": "default"
        },
        {
            "Title": "MTAR Technologies: Secures ₹19.2 Crore in New Orders",
            "Summary": "MTAR Technologies has received three orders totaling ₹19.2 crore from existing customers in clean energy and aerospace sectors. The largest order, worth ₹13.84 crore, is from Bloom Energy Corporation. The company's Q4 FY25 showed strong performance with 28% revenue growth and tripled net profit, despite full-year results falling short of guidance.",
            "Sentiment": "positive",
            "PublishDate": 1749450069000,
            "Source": "order&deals"
        },
        {
            "Title": "MTAR Tech Secures New Contract Worth ₹19.2 Crores",
            "Summary": "MTAR Tech has obtained a new contract valued at ₹19.2 crores. No further details about the contract or its nature were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749440409000,
            "Source": "default"
        },
        {
            "Title": "MTAR Technologies Provides Guidance for FY26",
            "Summary": "MTAR Technologies has provided guidance for FY26, projecting an EBITDA margin of 21% compared to 17.9% in FY25. The company also expects a revenue growth of 25% in FY26, up from 17% in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747994587000,
            "Source": "default"
        },
        {
            "Title": "MTAR Technologies: Q4 Results Fall Short of FY25 Guidance",
            "Summary": "MTAR Technologies reported FY25 revenue of ₹676 crore, below guidance of ₹725 crore. EBITDA margins fell to 17.9%, missing 21% target. Q4 saw revenue growth of 28% and tripled net profit. Order book at ₹979.4 crore, lower than ₹1,500 crore guidance. Company expects margin improvement as prototype orders scale up.",
            "Sentiment": "neutral",
            "PublishDate": 1747957436000,
            "Source": "earnings"
        },
        {
            "Title": "MTAR Tech Reports Q4 Financial Results",
            "Summary": "MTAR Tech has announced its financial results for the fourth quarter. The company's net profit for Q4 stood at 141 million rupees, compared to 50.68 million rupees in the same quarter last year (YoY) and 163 million rupees in the previous quarter (QoQ). Revenue for Q4 was reported at 1.8 billion rupees, up from 1.4 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747955858000,
            "Source": "default"
        },
        {
            "Title": "MTAR Tech Reports Improved Q4 Financial Results",
            "Summary": "MTAR Tech has announced its Q4 financial results. The company's EBITDA increased to 342 million rupees from 181.4 million rupees year-over-year. The EBITDA margin improved to 18.68% from 12.69% in the same period last year. Net profit rose to 141 million rupees from 50.68 million rupees year-over-year and 163 million rupees quarter-over-quarter. Revenue for Q4 reached 1.8 billion rupees, up from 1.4 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747925584000,
            "Source": "result"
        },
        {
            "Title": "MTAR Technologies: Secures ₹34 Crore in Clean Energy and Aerospace Orders",
            "Summary": "MTAR Tech has won orders worth ₹34 crore from international entities. A ₹21 crore order from Bloom Energy Corporation in clean energy, due by September, and a ₹12.98 crore order from Rafael Advanced Defense Systems in aerospace, to be completed by March 2026. The company's Q3 FY25 results show a 52.9% increase in net profit and 47.3% rise in revenue year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747196006000,
            "Source": "order&deals"
        },
        {
            "Title": "MTAR Technologies Secures Orders Worth Rs 34 Crore in Clean Energy and Aerospace Sectors",
            "Summary": "MTAR Technologies has announced that it has received orders valued at Rs 34 crore in the clean energy and aerospace sectors. This development indicates the company's continued growth and expansion in these key industries.",
            "Sentiment": "positive",
            "PublishDate": 1747193356000,
            "Source": "default"
        },
        {
            "Title": "MTAR Technologies: Targets 30% Annual Revenue Growth for Next Three Years",
            "Summary": "MTAR Technologies aims for 30% year-on-year revenue growth over the next three years, with Ebitda margins expected between 24-28%. The company anticipates executing nuclear segment orders worth Rs 800-1,000 crore in the next 3-3.5 years. MTAR expects more predictable, linear quarterly growth moving forward. The company has strong receivables and operating cash flows, with no plans for equity fundraising next year.",
            "Sentiment": "positive",
            "PublishDate": 1743229740000,
            "Source": "normal_news"
        }
    ]
}