{
    "Symbol": "MTEDUCARE",
    "ISIN": "INE472M01018",
    "News": [
        {
            "Title": "MT Educare Files SDD Compliance Certificate for Q3FY26",
            "Summary": "MT Educare Limited, currently under CIRP, has submitted its Structured Digital Database compliance certificate for Q3FY26 to stock exchanges, confirming adherence to SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768563946915,
            "Source": "stocks"
        },
        {
            "Title": "MT Educare Subsidiary Lakshya Forrum Receives GST Demand Order of INR 4.76 Lakh",
            "Summary": "Lakshya Forrum for Competitions Private Limited, a subsidiary of MT Educare Limited, received a GST demand order from Patiala Range-IV authorities for INR 4,76,829 covering tax, interest and penalty for financial year 2021-22. The company, currently under Corporate Insolvency Resolution Process since December 2022, has until March 8, 2026 to make the payment with financial impact limited to the demanded amount.",
            "Sentiment": "negative",
            "PublishDate": 1765281694644,
            "Source": "stock"
        },
        {
            "Title": "MT Educare Discloses Default on Principal and Interest Payments Under Insolvency Process",
            "Summary": "MT Educare Limited disclosed defaults on term loan and overdraft repayments totaling INR 12.14 crores, along with invoked corporate guarantees of INR 16.69 crores. The company has been under Corporate Insolvency Resolution Process since December 16, 2022, with Arihant Nenawati serving as Resolution Professional.",
            "Sentiment": "negative",
            "PublishDate": 1764581606817,
            "Source": "stock"
        },
        {
            "Title": "MT Educare Reports Quarterly Loss Under Corporate Insolvency Process",
            "Summary": "MT Educare Limited, operating under Corporate Insolvency Resolution Process since December 2022, reported standalone net loss of Rs. 451.81 lakhs for Q2 FY2025-26 and Rs. 410.84 lakhs for the half-year ended September 30, 2025. The company's auditors issued a disclaimer of conclusion citing multiple concerns including unresolved creditor claims, asset valuation issues, and material uncertainty about the company's ability to continue as a going concern.",
            "Sentiment": "negative",
            "PublishDate": 1763175657872,
            "Source": "earnings"
        },
        {
            "Title": "MT Educare Discloses Default on Rs 32.33 Crore Principal and Interest Payments",
            "Summary": "MT Educare Limited has disclosed defaults on repayment of principal and interest amounts totaling Rs 32.33 crores. The defaults include a term loan of Rs 7.16 crores at 11.65% interest and an overdraft of Rs 4.98 crores at 11.20% interest, both secured. The company has been under Corporate Insolvency Resolution Process since December 16, 2022, following an NCLT order. Additionally, there are invoked corporate guarantees against the company, including Rs 16.69 crores secured amount from Prudence ARC for Sri Gayatri Education Society and Lakshya Forum for Competitions Private Limited. The company's total financial indebtedness from banks and financial institutions stands at Rs 32.33 crores. Arihant Nenawati serves as the Resolution Professional, having been appointed in January 2024, replacing the previous Interim Resolution Professional.",
            "Sentiment": "negative",
            "PublishDate": 1761897182329,
            "Source": "corporate_governance"
        },
        {
            "Title": "MT Educare Limited Publishes Q1 FY2026 Unaudited Financial Results While Under Insolvency Process",
            "Summary": "MT Educare Limited published its unaudited financial results for the first quarter ended June 30, 2025 in Financial Express and Pratah Kaal newspapers on August 15, 2025. The company is operating under Corporate Insolvency Resolution Process (CIRP) supervised by Resolution Professional Arihant Nenawati. The CIRP was initiated on December 16, 2022 following an NCLT Mumbai order. The quarterly results were approved in a board meeting held on August 13, 2025. The company reported total revenue of ₹438.76 lakhs for the quarter compared to ₹784.60 lakhs in the same period last year. Net loss after tax stood at ₹190.35 lakhs versus ₹358.75 lakhs loss in the previous year quarter. Basic earnings per share was negative ₹0.26 compared to negative ₹0.50 in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755500574675,
            "Source": "earnings"
        },
        {
            "Title": "MT Educare Reports Q1 FY26 Loss of Rs 190 Crore Under Corporate Insolvency Process",
            "Summary": "MT Educare Limited reported unaudited financial results for Q1 FY26 ended June 30, 2025, showing a standalone net loss of Rs 190.35 crore compared to Rs 358.75 crore loss in the same quarter last year. Revenue from operations declined to Rs 378.58 crore from Rs 616.83 crore year-on-year. The company operates under Corporate Insolvency Resolution Process since December 16, 2022, with Resolution Professional Arihant Nenawati managing affairs. The board approved holding the 19th Annual General Meeting on September 24, 2025, and recommended re-appointment of various auditors. Statutory auditors issued a disclaimer of conclusion citing multiple concerns including unreconciled creditor claims of Rs 22,919.13 crore received during CIRP, asset valuation uncertainties, and going concern issues. The company's accumulated losses and negative net worth raise material uncertainty about its ability to continue operations.",
            "Sentiment": "negative",
            "PublishDate": 1755086267157,
            "Source": "earnings"
        }
    ]
}