{
    "Symbol": "MTNL",
    "ISIN": "INE153A01019",
    "News": [
        {
            "Title": "MTNL Reports ₹9,116 Cr Bank Default as of Jan 2026",
            "Summary": "Mahanagar Telephone Nigam Limited disclosed defaults on principal and interest payments totaling ₹9,115.65 crore across seven major banks, with total financial indebtedness reaching ₹36,026 crore.",
            "Sentiment": "negative",
            "PublishDate": 1770795733238,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Faces Rs 6 Lakh TRAI Penalty for QoS Violation",
            "Summary": "MTNL receives Rs 6,00,000 penalty from TRAI for failing to publish geospatial coverage maps on website, violating Quality of Service regulations for July 2025 wireless services.",
            "Sentiment": "negative",
            "PublishDate": 1770381477218,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Faces Rs 8 Lakh TRAI Penalty for QoS Violations",
            "Summary": "MTNL receives Rs 8,00,000 penalty from TRAI for failing to meet Quality of Service benchmarks in wireless access services for June 2025, including call setup success rate violations in Delhi and Mumbai circles.",
            "Sentiment": "negative",
            "PublishDate": 1770212874993,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Faces Rs 11 Lakh TRAI Penalty for Compliance Violations",
            "Summary": "Mahanagar Telephone Nigam Limited receives TRAI penalty of Rs 11,00,000 for failing to submit compliance reports and contravening quality of service standards for April 2025.",
            "Sentiment": "negative",
            "PublishDate": 1769509037814,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Appoints Sunil Kumar Ranjan as Government Director",
            "Summary": "Mahanagar Telephone Nigam Limited confirms appointment of Shri Sunil Kumar Ranjan as Government Nominee Director effective January 13, 2026, for three-year term.",
            "Sentiment": "neutral",
            "PublishDate": 1768989511050,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Bank Borrowings Hit ₹90.36 Billion by Dec 2025",
            "Summary": "Mahanagar Telephone Nigam Limited reports total bank borrowings reaching ₹90.36 billion as of December 31, 2025, reflecting the telecom company's current debt position.",
            "Sentiment": "neutral",
            "PublishDate": 1768471410724,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Reports December 2025 Share Transfer Activity",
            "Summary": "Mahanagar Telephone Nigam Limited processed one physical share transfer request under SEBI's special window during December 2025, completing the approval within 9 days.",
            "Sentiment": "neutral",
            "PublishDate": 1768388811498,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Appoints New Government Nominee Director",
            "Summary": "Mahanagar Telephone Nigam Limited announces cessation of Shivendu Gupta and appointment of Sunil Kumar Ranjan as Government Nominee Director effective January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768304927508,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Unable to Fund Bank of India Escrow Account",
            "Summary": "Mahanagar Telephone Nigam Limited faces financial constraints as it could not fund its escrow account in Bank of India with adequate amount due to insufficient funds.",
            "Sentiment": "negative",
            "PublishDate": 1768176776092,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Fails to Deposit Adequate Funds in BOI Escrow",
            "Summary": "Mahanagar Telephone Nigam Limited (MTNL) has failed to deposit sufficient funds in its escrow account maintained at Bank of India, indicating potential financial compliance issues for the state-owned telecom company.",
            "Sentiment": "negative",
            "PublishDate": 1767962493297,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Extends Director HR Additional Charge Till March",
            "Summary": "Mahanagar Telephone Nigam Limited announces three-month extension of additional charge for Director (HR & EB) post assigned to Dr Kalyan Sagar Nippani from January 1 to March 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767336545232,
            "Source": "stocks"
        },
        {
            "Title": "Govt Plans More Financial Support for BSNL",
            "Summary": "Government reportedly considering additional financial assistance for BSNL, as mentioned in ET Now coverage related to MTNL developments.",
            "Sentiment": "neutral",
            "PublishDate": 1766560923920,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Gets Credit Rating Update from CARE Ratings",
            "Summary": "CARE Ratings reaffirmed MTNL's credit-enhanced debt ratings at CARE AAA (CE) Stable while maintaining standalone rating at CARE D, backed by Government of India guarantee.",
            "Sentiment": "neutral",
            "PublishDate": 1766034935707,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Board Approves ₹350.72 Cr BKC Property Sale",
            "Summary": "Mahanagar Telephone Nigam's board has approved the sale of its Bandra Kurla Complex residential property to NABARD for ₹350.72 crores through government-to-government transfer under asset monetization program.",
            "Sentiment": "positive",
            "PublishDate": 1765795566563,
            "Source": "co_actions_results"
        },
        {
            "Title": "MTNL Unable to Fund Bond Interest Payments",
            "Summary": "Mahanagar Telephone Nigam Ltd faces financial constraints as the company announces its inability to provide funds for bond interest payments, highlighting ongoing liquidity challenges.",
            "Sentiment": "negative",
            "PublishDate": 1765452058088,
            "Source": "stocks"
        },
        {
            "Title": "MTNL Bonds Remain on Watch Negative Despite Recent Payment Compliance",
            "Summary": "CRISIL continues its AAA(CE)/Watch Negative rating on MTNL's Rs 6,500 crore bonds and Rs 20 crore NCDs, noting adherence to structured payment mechanism since September 2024 after earlier breaches. The rating agency awaits confirmation from MTNL on processes to ensure future compliance, with sustained adherence being a trigger to resolve the watch status.",
            "Sentiment": "positive",
            "PublishDate": 1764390500156,
            "Source": "corporate_action"
        },
        {
            "Title": "MTNL Extends Additional Finance Director Charge for Rajiv Kumar",
            "Summary": "The Department of Telecommunications has extended Rajiv Kumar's additional charge as Director (Finance) at MTNL for three months from December 1, 2025 to February 28, 2026, subject to Cabinet approval. Kumar, who is Director (Finance) at BSNL, will continue serving both roles without additional remuneration until a regular incumbent is appointed.",
            "Sentiment": "neutral",
            "PublishDate": 1764324470613,
            "Source": "corporate_governance"
        },
        {
            "Title": "MTNL Unable to Fund Semi-Annual Interest Payment for 7.87% Bond Series VII-B Due to Insufficient Funds",
            "Summary": "MTNL failed to fund the required semi-annual interest payment of 7.87% for Bond Series VII-B (INE153A08113) due December 1, 2025, into the escrow account maintained with Bank of India, citing insufficient funds. The bonds are sovereign guaranteed by the Government of India, which becomes obligated to make payments if MTNL defaults under the Tri-Partite Agreement structure.",
            "Sentiment": "negative",
            "PublishDate": 1763721320652,
            "Source": "corporate_action"
        },
        {
            "Title": "MTNL Reports Rs 1,900 Crore Loss for H1 FY25, Defaults on Rs 3,057 Crore Bank Loans",
            "Summary": "MTNL posted a net loss of Rs 1,900.11 crores for the half-year ended September 30, 2025, with revenue declining to Rs 319.61 crores from Rs 525.52 crores in the previous year. The company has defaulted on bank loan repayments totaling Rs 3,057 crores (Rs 2,045 crores principal and Rs 1,012 crores interest) and transferred telecom operations in Delhi and Mumbai to BSNL under a service agreement.",
            "Sentiment": "negative",
            "PublishDate": 1763116558193,
            "Source": "earnings"
        },
        {
            "Title": "MTNL Funds Escrow Account for Bond Interest Payment Due November 15, 2025",
            "Summary": "Mahanagar Telephone Nigam Limited (MTNL) has funded its designated escrow account maintained with Bank of India for the payment of semi-annual interest on its 8.00% Bond Series VIIA. The interest payment, which is due on November 15, 2025, was funded on November 12, 2025. The company informed stock exchanges BSE and NSE about this funding arrangement for the bond series identified by ISIN INE153A08105.",
            "Sentiment": "neutral",
            "PublishDate": 1762988793600,
            "Source": "corporate_action"
        },
        {
            "Title": "MTNL CMD Additional Charge Extended for Six Months",
            "Summary": "The Appointments Committee of the Cabinet has approved the extension of additional charge of CMD, MTNL assigned to Shri A. Robert J. Ravi, CMD BSNL for a further period of six months effective from October 15, 2025. The extension will continue until assumption of charge by a regular incumbent or until further orders, whichever is earliest. During this period, Ravi will not be entitled to any additional remuneration. The approval also covers his additional charges as CMD of BSNL and BBNL.",
            "Sentiment": "neutral",
            "PublishDate": 1762440681187,
            "Source": "corporate_governance"
        },
        {
            "Title": "MTNL Funds Escrow Account for Bond Interest Payment Due November 7, 2025",
            "Summary": "Mahanagar Telephone Nigam Limited (MTNL) has funded its designated escrow account maintained with Bank of India for the payment of semi-annual interest on its 7.80% Bond Series VIIIC. The interest payment is due on November 7, 2025, and the funding was completed on November 4, 2025. The bond series carries the ISIN code INE153A08170.",
            "Sentiment": "neutral",
            "PublishDate": 1762301251417,
            "Source": "corporate_action"
        },
        {
            "Title": "MTNL Unable to Fund Semi-Annual Interest Payment for Bond Series VIIA Due to Insufficient Funds",
            "Summary": "Mahanagar Telephone Nigam Limited (MTNL) has informed stock exchanges that it cannot fund the semi-annual interest payment for its 8.00% Bond Series VIIA due on November 15, 2025. Under the Tri-Partite Agreement with the Department of Telecommunications and Beacon Trusteeship Limited, MTNL is required to deposit the interest amount into an escrow account at Bank of India 10 days before the due date. The company cited insufficient funds as the reason for non-compliance. MTNL noted that all its bonds carry sovereign guarantee from the Government of India, which can be invoked by the Debenture Trustee in case of payment defaults, obligating the government to make payments on MTNL's behalf.",
            "Sentiment": "negative",
            "PublishDate": 1762271292176,
            "Source": "corporate_action"
        },
        {
            "Title": "MTNL Secures Funding for Bond Interest Payment Due November 7, 2025",
            "Summary": "MTNL has secured funding for a bond interest payment that is due on November 7, 2025. The company has arranged the necessary funds to meet this upcoming debt obligation.",
            "Sentiment": "positive",
            "PublishDate": 1762257321442,
            "Source": "stock"
        },
        {
            "Title": "MTNL Unable to Fund Semi-Annual Interest Payment for Bond Series VIII-C Due to Insufficient Funds",
            "Summary": "Mahanagar Telephone Nigam Limited (MTNL) announced it could not fund the escrow account for the 4th semi-annual interest payment on its 7.80% Bond Series VIII-C, which is due on November 7, 2025. Under the Tri-Partite Agreement with the Department of Telecommunications and Beacon Trusteeship Limited, MTNL is required to deposit the interest amount 10 days before the due date. The company cited insufficient funds as the reason for non-compliance. MTNL's bonds carry sovereign guarantee from the Government of India, meaning if MTNL defaults on principal or interest payments, the government is obligated to make the payment after the guarantee is invoked by the debenture trustee.",
            "Sentiment": "negative",
            "PublishDate": 1761652397312,
            "Source": "corporate_action"
        },
        {
            "Title": "MTNL Defaults on Bank Payments as Total Debt Reaches ₹349.38 Billion",
            "Summary": "MTNL has failed to make principal and interest payments to banks. The company's total debt stood at ₹349.38 billion as of September 30.",
            "Sentiment": "negative",
            "PublishDate": 1761129775723,
            "Source": "stock"
        },
        {
            "Title": "MTNL Extends Additional CMD Charge to BSNL's A. Robert J. Ravi for Three Months",
            "Summary": "The Department of Telecommunications has extended the additional charge of CMD, MTNL to Shri A. Robert J. Ravi, CMD BSNL, for three months from 15.10.2025 to 14.01.2026, or until a regular appointment is made or further orders are issued. This extension is subject to the approval of the Appointments Committee of the Cabinet (ACC). The decision continues the arrangement where Ravi holds dual responsibilities as CMD of both BSNL and MTNL.",
            "Sentiment": "neutral",
            "PublishDate": 1760510081496,
            "Source": "corporate_governance"
        },
        {
            "Title": "BSNL Adds 1.39 Million New Mobile Subscribers in August",
            "Summary": "BSNL gained 1.39 million new mobile subscribers in August, as reported by MTNL. This represents subscriber growth for the state-owned telecom operator during the month.",
            "Sentiment": "positive",
            "PublishDate": 1759753773892,
            "Source": "stock"
        },
        {
            "Title": "MTNL Funds Escrow Account for 5th Semi-Annual Interest Payment on 7.75% Bond Series VII E",
            "Summary": "Mahanagar Telephone Nigam Limited (MTNL) has funded the designated escrow account for the 5th semi-annual interest payment on its 7.75% Bond Series VII E, due on September 24, 2025. The funding was completed on September 20, 2025. The escrow account is maintained with Bank of India for the bond series identified as INE153A08147.",
            "Sentiment": "neutral",
            "PublishDate": 1758357672571,
            "Source": "corporate_action"
        },
        {
            "Title": "NSE, BSE Fine MTNL Rs 6.73 Lakh Each for Board Composition Non-Compliance",
            "Summary": "Mahanagar Telephone Nigam Ltd (MTNL) has been penalized by stock exchanges NSE and BSE with fines of Rs 6.73 lakh each for non-compliance with SEBI board composition requirements. The violations include failure to appoint a woman director and non-compliance with constitution of audit committee, nomination and remuneration committee, stakeholder relationship committee, and risk management committee. MTNL stated that as a public sector undertaking, all board appointments are made by the Department of Telecommunications. The company reported that two independent directors, including one woman director, were appointed by DoT with effect from April 15, and the matter for appointing four more independent directors has been taken up with the government. MTNL is requesting both exchanges for waiver of the fines.",
            "Sentiment": "negative",
            "PublishDate": 1756704290283,
            "Source": "corporate_governance"
        },
        {
            "Title": "BSNL Plans Major Infrastructure Expansion with 300,000-400,000 New Towers",
            "Summary": "BSNL plans to issue a tender for 300,000 to 400,000 new towers as part of its infrastructure expansion strategy. The company also intends to introduce affordable plans designed to attract users from private telecom operators.",
            "Sentiment": "positive",
            "PublishDate": 1756183676095,
            "Source": "stock"
        },
        {
            "Title": "MTNL Secures Funding for Bond Interest Payment",
            "Summary": "MTNL has finalized funding arrangements to make interest payments on its 7.80% Bond Series VIID. The company has completed the necessary funding preparations for this bond obligation.",
            "Sentiment": "positive",
            "PublishDate": 1755768624999,
            "Source": "corporate_action"
        },
        {
            "Title": "MTNL Defaults on Bond Payment Due to Insufficient Funds",
            "Summary": "MTNL failed to repay its bond payment due on August 24, marking another default by the state-run telecom firm. The company was unable to fund the required amount into its escrow account maintained with Bank of India due to insufficient funds. The default relates to the fourth semi-annual interest payment of 7.61% on MTNL Bond Series VIIIB. Under the tri-partite agreement with the Department of Telecommunications and Beacon Trusteeship Ltd, MTNL was required to fund the escrow account 10 days before the due date. All MTNL bonds carry sovereign guarantee from the government, meaning the government of India is obligated to make payments in case of default when the guarantee is invoked by the debenture trustee.",
            "Sentiment": "negative",
            "PublishDate": 1755223456879,
            "Source": "stock"
        },
        {
            "Title": "Mahanagar Telephone Nigam Reports Wider Loss and Revenue Decline in Q1",
            "Summary": "Mahanagar Telephone Nigam reported a net loss of 9.4 billion rupees in Q1, compared to a loss of 7.7 billion rupees in the same period last year. The company's revenue fell significantly to 517 million rupees from 1.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755098108199,
            "Source": "earnings"
        },
        {
            "Title": "MTNL Submits Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "MTNL submitted its unaudited reviewed financial results for the quarter ended June 30, 2025, to NSE and BSE stock exchanges on August 13, 2025. The submission includes a limited review report from statutory auditors and follows integrated filing requirements. The financial results were prepared under Ind AS standards and approved by the Board of Directors during a meeting held on August 13, 2025, which lasted from 17:00 to 17:30 hours. The company noted that certain SEBI regulations regarding bonds do not apply to MTNL as its bonds are unsecured in nature. The results will also be published in newspapers and are available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1755097570064,
            "Source": "earnings"
        },
        {
            "Title": "MTNL Funds Escrow Account for 5th Semi-Annual Interest Payment on 7.78% Bond Series VIIC",
            "Summary": "Mahanagar Telephone Nigam Limited (MTNL) has funded the designated escrow account maintained at Bank of India for the payment of the 5th semi-annual interest on its 7.78% Bond Series VIIC (INE153A08121). The funding was completed on August 7, 2025, with the interest payment due on August 10, 2025. This action follows the company's previous communication dated July 31, 2025, regarding the same matter.",
            "Sentiment": "neutral",
            "PublishDate": 1754567752001,
            "Source": "corporate_action"
        },
        {
            "Title": "Centre Plans To Raise ₹4,500 Crore From MTNL Asset Sales",
            "Summary": "The Centre plans to raise ₹4,500 crore from MTNL through asset sales. The telecommunications company will divest assets as part of this fundraising initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1753954273943,
            "Source": "stock"
        },
        {
            "Title": "MTNL Extends Additional Charge Assignment for CMD Position to BSNL's A. Robert J. Ravi",
            "Summary": "The Appointments Committee of the Cabinet has approved extending the additional charge of CMD, MTNL to Shri A. Robert J. Ravi, who serves as CMD BSNL. The extension runs for three months from July 15, 2025 to October 14, 2025, or until further notice. This arrangement continues the dual leadership role where Ravi manages both BSNL and MTNL operations. The approval was conveyed through the Department of Telecommunications under the Ministry of Communications.",
            "Sentiment": "neutral",
            "PublishDate": 1753524703456,
            "Source": "corporate_governance"
        },
        {
            "Title": "MTNL Completes Funding of Escrow Account for Bond Interest Payments",
            "Summary": "Mahanagar Telephone Nigam (MTNL) has successfully completed the funding of an escrow account designated to cover bond interest payments. This action ensures that the company has set aside the necessary funds to meet its financial obligations to bondholders.",
            "Sentiment": "positive",
            "PublishDate": 1752744547000,
            "Source": "default"
        },
        {
            "Title": "MTNL: Defaults on ₹8,585 Crore Bank Loans",
            "Summary": "Mahanagar Telephone Nigam Limited (MTNL) has defaulted on loans worth ₹8,585 crore from seven public sector banks. The defaults occurred between August 2024 and February 2025. MTNL's total debt obligations reached ₹34,484 crore as of June 30, 2025. India has approved a non-auction route for monetising assets of state-run entities like MTNL for properties valued below ₹10 crore.",
            "Sentiment": "negative",
            "PublishDate": 1752668649000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mahanagar Telephone Nigam Ltd: Defaults on Rs 8,585 Crore Loan Repayment",
            "Summary": "MTNL has defaulted on Rs 8,584.9 crore in principal and interest payments to seven public sector banks as of June 2025. The company's total financial indebtedness now stands at Rs 34,484 crore. The government is simplifying the process of selling MTNL's assets to central and state entities to accelerate debt repayment.",
            "Sentiment": "negative",
            "PublishDate": 1752576656000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Government Allows Central Companies to Purchase MTNL Assets at Market Price",
            "Summary": "The Indian government has permitted central companies to purchase assets of MTNL (Mahanagar Telephone Nigam Limited) at market price without going through an auction process. This decision potentially simplifies asset acquisition for central companies and may impact MTNL's asset management strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1752483198000,
            "Source": "default"
        },
        {
            "Title": "MTNL: Government Streamlines Asset Sale Process for State and Central Buyers",
            "Summary": "The government has decided to bypass the auction process for selling MTNL assets to state and central government entities. These buyers will be offered assets at simple valuation to expedite sales. Initial valuation of some MTNL assets is estimated at Rs 6,000–7,000 crore. Out of 280 non-core assets identified across MTNL and BSNL, 220 are set for monetisation. Proceeds will be used to repay MTNL's debt.",
            "Sentiment": "positive",
            "PublishDate": 1751512414000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahanagar Telephone Nigam Ltd: Employees Protest Amid Integration Uncertainty",
            "Summary": "MTNL employees have launched phased protests demanding clarity on their future as MTNL services are integrated into BSNL. Unions have written to the Department of Telecommunications citing concerns over stalled HR benefits and uncertain employment outcomes. The government is considering re-employment options for 2,500-3,000 affected employees. Protests are ongoing at key telecom locations in Delhi and Mumbai.",
            "Sentiment": "negative",
            "PublishDate": 1751454224000,
            "Source": "corporate_governance"
        },
        {
            "Title": "MTNL Loses 471,000 Subscribers in May 2025",
            "Summary": "According to TRAI's Wireless Subscription Data for May 2025, MTNL (Mahanagar Telephone Nigam Limited) has lost 471,000 subscribers. This significant decrease in the company's subscriber base is reported by the Telecom Regulatory Authority of India (TRAI) in their latest wireless subscription data.",
            "Sentiment": "negative",
            "PublishDate": 1751254505000,
            "Source": "default"
        },
        {
            "Title": "Minister Commits to Revitalizing MTNL",
            "Summary": "The Minister of State for Communications has expressed a commitment to revitalize MTNL (Mahanagar Telephone Nigam Limited). Speaking to NDTV, the minister stated that all necessary actions will be taken to achieve this goal. No specific details about the revitalization plan or timeline were provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1749713941000,
            "Source": "default"
        },
        {
            "Title": "Cabinet Meeting to Discuss MTNL Asset Transfer",
            "Summary": "Today's cabinet meeting is scheduled to discuss the asset transfer of MTNL (Mahanagar Telephone Nigam Limited). No further details about the nature or extent of the asset transfer were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749710072000,
            "Source": "default"
        },
        {
            "Title": "MTNL: Government Committed to Revival, Expediting Asset Monetisation",
            "Summary": "Minister of State for Communications Dr CS Pemmasani affirms government's commitment to reviving MTNL. A committee of secretaries is working on identifying root causes and solutions. Asset monetisation timeline reduced to 6-8 months for land parcels over Rs 100 crore. MTNL faces Rs 33,500 crore debt, including Rs 8,300 crore owed to public sector banks. Government aims to build synergy between BSNL and MTNL while protecting stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1749706336000,
            "Source": "normal_news"
        },
        {
            "Title": "MTNL's Corporate Debt Restructuring Accepted by Financial Institutions, Excluding Haircuts",
            "Summary": "Financial institutions have agreed to accept corporate debt restructuring for MTNL (Mahanagar Telephone Nigam Limited). However, they have excluded the possibility of haircuts in the restructuring process. This indicates a willingness to renegotiate the terms of MTNL's debt but without reducing the principal amount owed.",
            "Sentiment": "neutral",
            "PublishDate": 1749698251000,
            "Source": "default"
        },
        {
            "Title": "Finance Ministry Seeks Monetisation Plans for MTNL Assets",
            "Summary": "The Finance Ministry has requested monetisation plans for MTNL (Mahanagar Telephone Nigam Limited). Approximately 50 assets have been identified for potential monetisation. The Finance Ministry has declined to provide capital infusion to repay MTNL's liabilities.",
            "Sentiment": "negative",
            "PublishDate": 1748577294000,
            "Source": "default"
        }
    ]
}