{
    "Symbol": "MUFIN",
    "ISIN": "INE08KJ01020",
    "News": [
        {
            "Title": "Mufin Green Finance Allots ₹100 Crore NCDs",
            "Summary": "Mufin Green Finance Limited successfully allotted 1,00,000 non-convertible debentures worth ₹100,00,00,000 through private placement with 10% coupon rate and 15-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1770795677513,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mufin Green Finance Clarifies EGM Warrant Terms",
            "Summary": "Mufin Green Finance Limited provides clarification on warrant conversion timeframe following its November 29, 2025 EGM for preferential equity issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1770720773133,
            "Source": "stocks"
        },
        {
            "Title": "Mufin Green Finance Board Meet on Feb 13, 2026",
            "Summary": "Mufin Green Finance Limited schedules board meeting for February 13, 2026 to consider Q3FY26 unaudited financial results, alteration in Articles of Association, and postal ballot matters.",
            "Sentiment": "neutral",
            "PublishDate": 1770659757666,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mufin Green Finance Board Meet on Feb 3 for Fund Raising",
            "Summary": "Mufin Green Finance Limited has scheduled a board meeting on February 03, 2026, to consider fund raising through issuance of non-convertible debentures on private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1769695974351,
            "Source": "stocks"
        },
        {
            "Title": "Mufin Green Finance Withdraws Rs 41.45 Crore Equity Issue",
            "Summary": "Mufin Green Finance Limited withdraws proposed preferential issue of 42,29,996 equity shares worth Rs 41.45 crore for consideration other than cash due to regulatory approval delays.",
            "Sentiment": "neutral",
            "PublishDate": 1769589133015,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mufin Green Finance Secures $12M Loan from Finnfund",
            "Summary": "Mufin Green Finance Limited has entered into a finance agreement with Finnish Fund for Industrial Cooperation Ltd for a loan facility of up to $12 million to support its onward lending business operations.",
            "Sentiment": "positive",
            "PublishDate": 1768805207129,
            "Source": "stocks"
        },
        {
            "Title": "Mufin Green Finance Secures $12M Finnish Deal",
            "Summary": "Mufin Green Finance announces strategic partnership with Finnish fund, securing up to $12 million in funding to support its green finance initiatives and business expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1768569937902,
            "Source": "stocks"
        },
        {
            "Title": "Mufin Green Finance secures $12M loan from Finland",
            "Summary": "Mufin Green Finance Limited has executed a finance agreement with Finnish Fund for Industrial Cooperation Ltd for a USD 12 million loan facility to support its onward lending business operations.",
            "Sentiment": "positive",
            "PublishDate": 1768563977652,
            "Source": "co_actions_results"
        },
        {
            "Title": "MuFin Green Finance Plans ₹1 Billion NCD Issue",
            "Summary": "MuFin Green Finance announces its plan to issue Non-Convertible Debentures (NCDs) worth up to ₹1 billion to raise capital for business expansion and growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1765897753022,
            "Source": "stocks"
        },
        {
            "Title": "Mufin Green Finance Approves ₹100 Crore Debenture Issue",
            "Summary": "Mufin Green Finance Limited's Management Committee has approved the issuance of secured, non-convertible debentures worth up to ₹100 crores on a private placement basis during its meeting held on December 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765897493637,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mufin Green Finance Allots Rs 90 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Mufin Green Finance Limited issued and allotted 9,000 secured, rated, listed, redeemable non-convertible debentures worth Rs 90 crore through private placement, each with a face value of Rs 1 lakh. The debentures carry an 11.75% per annum coupon rate with semi-annual frequency, tenure of 4 years 11 months 23 days, and maturity date of November 26, 2030.",
            "Sentiment": "positive",
            "PublishDate": 1764831135913,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Limited Shareholders Approve Five Resolutions in Extraordinary General Meeting",
            "Summary": "Mufin Green Finance Limited held an EGM on November 29, 2025, where shareholders approved five resolutions including issuance of share warrants to promoters, equity shares on preferential basis, and alteration of memorandum of association. All resolutions passed with over 99% approval rates, with 65 shareholders attending through video conferencing and 3,441,439 total votes cast across various categories.",
            "Sentiment": "positive",
            "PublishDate": 1764591676824,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Allots Rs 50 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Mufin Green Finance Limited has issued and allotted 1,500 secured, rated, listed, redeemable non-convertible debentures worth Rs 50 crore with a face value of Rs 1 lakh each through private placement. The debentures carry a coupon rate of 10.85% per annum with monthly interest and principal payments, maturing on December 26, 2026, with a tenure of 13 months.",
            "Sentiment": "positive",
            "PublishDate": 1764141917163,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Approves INR 50 Crore Debenture Issuance and Allots 2.76 Lakh Equity Shares Under ESOP",
            "Summary": "Mufin Green Finance's Management Committee approved the issuance of secured, non-convertible debentures worth up to INR 50 crore on a private placement basis and allotted 2,76,251 equity shares to employees under the ESOP 2023 scheme. The share allotment increased the company's paid-up share capital from Rs. 17.30 crore to Rs. 17.32 crore, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1763627747359,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Issues Corrigendum for EGM, Modifies Preferential Share Allotment Details",
            "Summary": "Mufin Green Finance Limited issued a corrigendum modifying its November 7, 2025 EGM notice for preferential allotment of up to 3.48 crore equity shares at Rs. 98 per share, with several proposed allottees being deleted and new ones added. The company plans to raise Rs. 341.44 crore through this preferential issue to non-promoter investors, with funds intended for onward lending and acquisition consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1763470958465,
            "Source": "corporate_action"
        },
        {
            "Title": "MUFIN Green Finance To Review Debenture Fundraising Proposal",
            "Summary": "MUFIN Green Finance has scheduled a review of its fundraising proposal through debentures for November 20. The review represents the company's initiative to raise capital through debt instruments for its financing operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763391337000,
            "Source": "stock"
        },
        {
            "Title": "Mufin Green Finance Fully Utilizes INR 121.81 Crores from Private Placement, Warrants Worth INR 18.44 Crores Forfeited",
            "Summary": "Mufin Green Finance Limited has fully utilized INR 121.81 crores raised through private placement for lending purposes and general corporate activities, with no deviations observed by monitoring agency Acuite Ratings. The company forfeited warrants worth INR 18.44 crores as they were not exercised within the stipulated timeframe, reducing the total raised amount from the originally proposed INR 140.25 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763141176198,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Reports Quarterly Results and Approves Changes to Preferential Issue Allottees",
            "Summary": "Mufin Green Finance Limited approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, showing a profit of Rs. 606.00 lakhs for the quarter. The Board also approved changes in the list of proposed allottees for its preferential equity share issue and decided to issue a corrigendum to the EGM notice scheduled for November 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763136469754,
            "Source": "earnings"
        },
        {
            "Title": "MUFIN Green Finance Reports 6.3% Growth in Net Profit for Q2",
            "Summary": "MUFIN Green Finance posted net profit of 60.6 million rupees in Q2 compared to 57 million rupees in the same quarter last year, marking a 6.3% year-on-year increase. The company's revenue grew significantly to 514 million rupees from 403 million rupees year-on-year, representing a 27.5% increase in quarterly revenue.",
            "Sentiment": "positive",
            "PublishDate": 1763122806123,
            "Source": "earnings"
        },
        {
            "Title": "Mufin Green Finance Approves Acquisition of Bimapay Finsure and Rs 490 Crore Fundraising",
            "Summary": "Mufin Green Finance Limited's board approved the acquisition of a 19.16% stake in Bimapay Finsure Private Limited through a share swap arrangement valued at Rs 41.33 crore. The company also approved issuing up to 3.48 crore equity shares at Rs 98 per share to raise Rs 341.44 crore from non-promoter investors, and 76.53 lakh warrants at Rs 98 each to promoter Hindon Mercantile Limited worth Rs 75 crore. Additionally, the board approved issuing non-convertible debentures worth up to Rs 90 crore and amendments to the company's main object clause for money changer and authorized dealer business. An extraordinary general meeting is scheduled for November 29, 2025, to seek shareholder approval. Bimapay Finsure operates in IT and IT-enabled services with a turnover of Rs 3.22 crore in 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1762468120752,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Allots Rs 50 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Mufin Green Finance Limited has issued and allotted 5,000 secured, rated, listed, redeemable non-convertible debentures through private placement. Each debenture has a face value of Rs 1,00,000, raising a total amount of Rs 50 crore. The debentures carry an 11% per annum coupon rate with monthly interest payments and have a tenure of 15 months, maturing on February 8, 2027. The principal repayment is structured in two installments: 50% on December 3, 2026, and the final 50% on February 3, 2027. The debentures are secured by hypothecation of receivables and book debts, and will be listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762187348173,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance to Sell Entire 65% Stake in Mufin Green Infra",
            "Summary": "Mufin Green Finance has agreed to sell its complete 65% ownership stake in Mufin Green Infra. This represents a full divestment from the subsidiary company.",
            "Sentiment": "neutral",
            "PublishDate": 1761744801418,
            "Source": "order&deals"
        },
        {
            "Title": "Mufin Green Finance Limited Approves INR 50 Crore Non-Convertible Debenture Issuance",
            "Summary": "Mufin Green Finance Limited's Management Committee approved the issuance of listed, secured, non-convertible debentures worth up to INR 50 crore on a private placement basis. The decision was made during a committee meeting held on October 23rd, 2025, which lasted from 10:00 a.m. to 10:30 a.m. The company has informed stock exchanges BSE and NSE about this approval as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761197016294,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Raises Rs. 50 Crore Through Non-Convertible Debentures",
            "Summary": "Mufin Green Finance Limited has issued and allotted 5,000 secured, rated, listed, redeemable, non-convertible debentures worth Rs. 50 crore through private placement. The debentures carry a face value of Rs. 1,00,000 each with a 15-month tenure and 11% annual coupon rate payable monthly. The allotment was completed on September 11, 2025, with maturity scheduled for December 11, 2026. The debentures are secured by hypothecation of receivables/book debts and will be listed on BSE Limited. Principal repayment is structured in two installments - 50% on October 11, 2026, and the remaining 50% on the maturity date.",
            "Sentiment": "positive",
            "PublishDate": 1757590340666,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Appoints New Auditors and Approves INR 50 Crore Debenture Issuance",
            "Summary": "Mufin Green Finance Limited's board approved several key decisions on August 28, 2025. The company appointed M/s. Gaur & Associates as statutory auditors to fill the casual vacancy caused by the resignation of M/s. Tattvam & Co., with the appointment subject to shareholder approval for a three-year term from the 9th to 12th Annual General Meeting. The board also approved the appointment of M/s. Abhay K & Associates as secretarial auditors for five years from FY 2025-26 to FY 2029-30. Additionally, the company approved the issuance of listed, secured, non-convertible debentures worth INR 50 crore on a private placement basis. The Annual General Meeting is scheduled for September 29, 2025. Gaur & Associates is an ICAI registered firm established in 1990, while Abhay K & Associates specializes in secretarial audits and regulatory services.",
            "Sentiment": "neutral",
            "PublishDate": 1756384384300,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Raises Rs 4.18 Crore Through Private Placement of Non-Convertible Debentures",
            "Summary": "Mufin Green Finance Limited has issued and allotted 418 secured, unrated, unlisted, redeemable, taxable, transferable, non-convertible debentures through private placement. The debentures have a face value of Rs 1,00,000 each, totaling Rs 4,18,00,000. The debentures carry a coupon rate of 12.80% per annum payable quarterly. The allotment date is August 18, 2025, with maturity on August 21, 2028. The issue was fully subscribed by a single investor, Monega Multi-Sector Microfinance & Impact Loan Fund. The debentures are secured by hypothecation of receivables/book debts.",
            "Sentiment": "neutral",
            "PublishDate": 1755604476326,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance's Statutory Auditors M/s. Tattvam & Co. Resign, New Auditor Appointment Pending",
            "Summary": "M/s. Tattvam & Co., Chartered Accountants, resigned as statutory auditors of Mufin Green Finance Limited, effective from the close of business hours on August 14, 2025. The company's Audit Committee and Board of Directors will address the resignation in upcoming meetings and recommend the appointment of new statutory auditors for shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755177926488,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mufin Green Finance Reports Quarterly Results for June 2025, Issues Debentures Worth Rs 27.2 Crore",
            "Summary": "Mufin Green Finance Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported total income of Rs 4,813.69 lakh and profit of Rs 410.55 lakh, with basic EPS of Rs 0.25. On consolidated basis, total income was Rs 4,904.64 lakh with profit of Rs 318.46 lakh and basic EPS of Rs 0.19. The company issued three tranches of secured non-convertible debentures in July 2025 totaling Rs 27.2 crore through private placement. During the quarter, the company allotted 94.65 lakh equity shares to warrant holders at Rs 55 per share. Acuité Ratings upgraded the company's credit rating from BBB+ (STABLE) to A- (STABLE) for certain borrowing categories. The company's main business involves financing and investing activities within India.",
            "Sentiment": "positive",
            "PublishDate": 1755175070704,
            "Source": "earnings"
        },
        {
            "Title": "Mufin Green Finance Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Mufin Green Finance reported quarterly net profit of 41 million rupees compared to 46 million rupees in the same period last year, representing a decline. However, the company's revenue increased to 480 million rupees from 370 million rupees year-over-year, showing growth in the top line despite lower profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1755172959723,
            "Source": "earnings"
        },
        {
            "Title": "Mufin Green Finance Raises Rs 10.45 Crore Through Private Placement of Non-Convertible Debentures",
            "Summary": "Mufin Green Finance Limited has issued and allotted 1,045 secured, unrated, unlisted, redeemable, taxable, transferable, non-convertible debentures through private placement. The total issue size is Rs. 10.45 crore, with a face value of Rs. 1,00,000 per debenture and a coupon rate of 12.80% per annum, payable quarterly. The debentures were allotted on July 30, 2025, with a maturity date of August 2, 2028. The issue was fully subscribed by a single investor, DWM SDGs Credit Fund. The debentures are secured by hypothecation of receivables/book debts and are not proposed to be listed on any stock exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1753874982533,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance Converts Warrants to Equity Shares",
            "Summary": "Mufin Green Finance has converted 46.4 lakh warrants into equity shares. This action represents a change in the company's capital structure, potentially affecting existing shareholders and the company's overall equity.",
            "Sentiment": "neutral",
            "PublishDate": 1750943336000,
            "Source": "default"
        },
        {
            "Title": "Mufin Green Finance Converts Warrants, Raises ₹14.95 Crore",
            "Summary": "Mufin Green Finance has converted 36.25 lakh warrants into equity shares. The company has secured ₹14.95 crore through a preferential allotment. This action represents a significant corporate financial move, potentially impacting the company's capital structure and shareholding pattern.",
            "Sentiment": "positive",
            "PublishDate": 1750429252000,
            "Source": "default"
        },
        {
            "Title": "Mufin Green Finance: NBFC Stock Rebounds 5% from Intraday Low",
            "Summary": "Mufin Green Finance stock opened at ₹82.31 on BSE, dropped to ₹80.26, then rebounded to ₹83.73. The company reported Q3FY25 results with net profit up 28% YoY to ₹5.85 crore and revenue up 79% YoY to ₹48.57 crore. The company has utilized ₹82.27 crore out of ₹105.19 crore raised for lending purposes in December 2023.",
            "Sentiment": "positive",
            "PublishDate": 1739428507000,
            "Source": "earnings"
        },
        {
            "Title": "MUFIN GREEN FINANCE Reports Strong Q3 Financial Results",
            "Summary": "MUFIN GREEN FINANCE has announced its financial results for the third quarter. The company's net profit increased to 61 million rupees, up from 46 million rupees in the same period last year. Revenue also saw significant growth, reaching 430 million rupees compared to 271 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739363161000,
            "Source": "earnings"
        },
        {
            "Title": "Mufin Green Finance: Share Price Rises Despite Capital Increase",
            "Summary": "Mufin Green Finance Ltd's stock gained 7% despite increasing its paid-up capital. The company converted 120,000 warrants into equity shares, raising the paid-up capital to ₹16,34,90,172 consisting of 16,34,90,172 equity shares of Re. 1 each.",
            "Sentiment": "positive",
            "PublishDate": 1738132255000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance: Secures $18 Million Loan from US Development Finance Corporation",
            "Summary": "Mufin Green Finance, India's largest EV ecosystem financier, has obtained an $18 million, 10-year loan from the US International Development Finance Corporation. The funding will support expansion of EV financing services across India, including various EV segments and solar financing. The company currently operates in 26 states and Union Territories with cumulative disbursements of ₹1,500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1735884063000,
            "Source": "corporate_action"
        },
        {
            "Title": "MUFIN Green Finance Sets 50 Billion Rupees Solar Financing Target by 2026",
            "Summary": "MUFIN Green Finance has announced a target to finance 50 billion rupees (approximately $600 million) worth of solar projects by the year 2026. This ambitious goal demonstrates the company's commitment to supporting renewable energy initiatives and expanding its presence in the green finance sector.",
            "Sentiment": "positive",
            "PublishDate": 1733211175000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance: Board Approves ₹15 Crore Fundraise via NCDs",
            "Summary": "Mufin Green Finance's board has approved raising up to ₹15 crore through private placement of non-convertible debentures. The stock, which has seen over 5,000% returns in 5 years, ended 2% higher on Friday following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1732958123000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance to Consider Fundraising via Non-Convertible Debentures",
            "Summary": "Mufin Green Finance has announced a board meeting scheduled for November 29 to consider raising funds through the issuance of non-convertible debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1732636542000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mufin Green Finance: EV Lender's Stock Surges 5% on Strong Q2 Results",
            "Summary": "Mufin Green Finance Ltd's stock rose 5% to Rs 112.09 after reporting impressive Q2 FY25 results. The company specializes in EV loans and has seen significant growth, with net sales up 111.3% and net profit increasing 34% year-over-year. FII ownership increased from 0.11% to 0.49% in Q1 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1732522223000,
            "Source": "earnings"
        },
        {
            "Title": "Mufin Green Finance: Q2 FY25 Results Show Strong Growth",
            "Summary": "Mufin Green Finance reported a 120% increase in net sales to Rs 46.21 crore and a 41% rise in net profit to Rs 5.67 crore for Q2 FY25. H1 FY25 saw net sales up 116% to Rs 83.19 crore and net profit up 35% to Rs 10.06 crore. The company raised Rs 30 crore through NCDs with an 11.75% interest rate.",
            "Sentiment": "positive",
            "PublishDate": 1731653773000,
            "Source": "result"
        },
        {
            "Title": "Mufin Green Finance: EV Lender's Stock Surges 19% on Growth Momentum",
            "Summary": "Mufin Green Finance's stock price rose 19.21% to Rs 120.20. The company specializes in EV loans and has shown strong financial performance with a 111.3% increase in net sales and 34% increase in net profit in Q1FY25. Recently, it issued Rs 22 crore worth of non-redeemable debentures to Incofin CVSO.",
            "Sentiment": "positive",
            "PublishDate": 1730278888000,
            "Source": "normal_news"
        }
    ]
}