{
    "Symbol": "MUFTI",
    "ISIN": "INE220Q01020",
    "News": [
        {
            "Title": "Credo Brands Marketing Schedules Q3FY26 Earnings Call",
            "Summary": "Credo Brands Marketing Limited announces investor/analyst conference call for February 10, 2026 at 2:00 PM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770115435701,
            "Source": "co_actions_results"
        },
        {
            "Title": "Credo Brands Marketing Reports Revenue Decline and Increased Marketing Spend in Q2 H1 FY26",
            "Summary": "Credo Brands Marketing reported revenue of INR 164 crores in Q2 FY26 versus INR 186 crores in Q2 FY25, with H1 FY26 revenue at INR 284 crores against INR 310 crores in H1 FY25, impacted by supply chain disruptions from Bangladesh and muted footfalls. The company increased marketing spend to 5% of revenue from 3.5% last year as part of its MUFTI 2.0 transformation strategy, opening 5 new premium flagship stores while maintaining EBITDA margins of approximately 28% and expects flattish growth for the current year.",
            "Sentiment": "negative",
            "PublishDate": 1763213132678,
            "Source": "earnings"
        },
        {
            "Title": "Credo Brands Plans 15-18% Annual Growth with 100+ New Stores in Tier 2-3 Cities",
            "Summary": "Credo Brands projects 15-18% annual growth driven by retail expansion across tier 2-3 cities. The company plans to open over 100 new stores in the next three years, focusing on premium casual and athleisure segments. The growth strategy includes leveraging e-commerce and omnichannel integration to increase customer reach. Credo Brands targets 20% margin expansion through cost efficiency measures and brand premiumization.",
            "Sentiment": "positive",
            "PublishDate": 1762528870801,
            "Source": "stock"
        },
        {
            "Title": "Credo Brands Marketing Reports Decline in Q2 Financial Performance",
            "Summary": "Credo Brands Marketing reported quarterly results showing a decline across key financial metrics. Net profit dropped to 189 million rupees from 265 million rupees in the same period last year. Revenue decreased to 1.6 billion rupees compared to 1.86 billion rupees year-over-year. EBITDA fell to 482 million rupees from 577 million rupees, while EBITDA margin compressed to 29.44% from 31.09% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762520573256,
            "Source": "earnings"
        },
        {
            "Title": "Credo Brands Marketing Reappoints Independent Director and Names New Secretarial Auditors",
            "Summary": "Credo Brands Marketing Limited shareholders approved key appointments at their 26th Annual General Meeting. Mr. Amer Jaleel was reappointed as Independent Director for a second five-year term starting November 2, 2025. Jaleel, who holds a B.Com degree and previously served as Chief Creative Officer at Lintas Group for 21 years before co-founding digital platform Curativity in 2023, is not related to any company directors. Additionally, M/s. Siroya and BA Associates was appointed as Secretarial Auditors for five years covering financial years 2025-26 to 2029-30. The firm is led by Mr. Mukesh Siroya, who has 26 years of professional experience and serves clients across multiple industries including finance, technology, and manufacturing.",
            "Sentiment": "neutral",
            "PublishDate": 1758550816640,
            "Source": "corporate_governance"
        },
        {
            "Title": "Credo Brands Marketing Reports Flat Revenue Growth, Plans Premium Store Expansion Strategy",
            "Summary": "Credo Brands Marketing Limited reported revenue of INR 119.9 crores for the quarter ended June 30, 2025, remaining steady compared to the previous year. The company achieved gross margins of 61.6%, an improvement of 290 basis points year-on-year, while EBITDA margins stood at 25.9% and profit after tax was INR 6.3 crores with a 5.3% margin. The company is implementing a transformation strategy for its Mufti brand, focusing on premiumization through new store designs and enhanced retail experiences. Management plans to open approximately 20 premium stores while closing underperforming locations, maintaining a flat overall store count. The company expects to increase advertising and marketing spend to 6-7% in FY26 and 8-10% in FY27, up from the current INR 5.4 crores in the quarter compared to INR 2.4 crores in the same quarter last year. Digital sales through the company's website have more than doubled year-on-year. Management anticipates flat to low single-digit growth for the full year, citing continued softness in discretionary spending, particularly in Tier 2 and Tier 3 markets, with fashion brands being hit harder than basic apparel brands.",
            "Sentiment": "neutral",
            "PublishDate": 1754635617296,
            "Source": "earnings"
        },
        {
            "Title": "CREDO Brands Targets ₹1,000 Crore Sales in 3 Years Through Premium Focus and Expansion",
            "Summary": "CREDO Brands has outlined an ambitious growth strategy to achieve ₹1,000 crore in sales over the next three years. The company plans to focus on premium products while expanding its presence in tier 2-3 cities. Key initiatives include launching women's wear and enhancing omni-channel capabilities. The retailer aims to double its exclusive brand outlets to over 600 stores. The company intends to maintain strong EBITDA margins through strategic format choices during this expansion phase.",
            "Sentiment": "positive",
            "PublishDate": 1753979077782,
            "Source": "stock"
        },
        {
            "Title": "Credo Brands Marketing Reports Decline in Q1 Profitability Despite Stable Revenue",
            "Summary": "Credo Brands Marketing reported quarterly results showing EBITDA of 310 million rupees compared to 334 million rupees in the same period last year. The EBITDA margin decreased to 25.85% from 26.96% year-over-year. Net profit fell significantly to 63 million rupees from 98 million rupees in the previous year. Revenue remained flat at 1.2 billion rupees compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1753973530110,
            "Source": "earnings"
        },
        {
            "Title": "Credo Brands Marketing Reports ₹63.03 Million Quarterly Profit, Proposes ₹3 Dividend",
            "Summary": "Credo Brands Marketing Limited reported a net profit of ₹63.03 million for the quarter ended June 30, 2025, compared to ₹97.70 million in the same quarter last year. Revenue from operations decreased to ₹1,199.39 million from ₹1,238.87 million year-over-year. The company has scheduled its 26th Annual General Meeting for September 22, 2025, via video conferencing and set September 10, 2025 as the record date for a proposed dividend of ₹3.00 per share. During the quarter, the company allotted 59,600 equity shares to employees under its stock option plan. The company's wholly-owned subsidiary KAPS Mercantile Private Limited was dissolved in the quarter, making these standalone financial results as the group no longer exists.",
            "Sentiment": "neutral",
            "PublishDate": 1753973491319,
            "Source": "corporate_action"
        },
        {
            "Title": "Credo Brands Marketing Reports Q4 Results and Dividend Recommendation",
            "Summary": "Credo Brands Marketing has announced its Q4 financial results and a dividend recommendation. The company's Q4 consolidated net profit increased to 138 million rupees, up from 71 million rupees year-over-year and 183 million rupees quarter-over-quarter. Q4 revenue rose to 1.5 billion rupees from 1.33 billion rupees year-over-year. EBITDA for Q4 grew to 411 million rupees from 309 million rupees year-over-year, with EBITDA margin improving to 26.83% from 23.24%. The company has recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747923164000,
            "Source": "result"
        },
        {
            "Title": "Credo Brands Marketing Reports Improved Q3 EBITDA and Margin",
            "Summary": "Credo Brands Marketing has reported a year-over-year increase in its Q3 EBITDA, rising from 426 million rupees to 477 million rupees. The company's EBITDA margin also improved, increasing from 28.38% to 30.68% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738329520000,
            "Source": "earnings"
        },
        {
            "Title": "Credo Brands Marketing Reports Q3 Financial Results",
            "Summary": "Credo Brands Marketing has announced its Q3 consolidated net profit of 183 million rupees, showing an increase from 156 million rupees year-over-year. However, it decreased from 265 million rupees quarter-over-quarter. The company's Q3 revenue stood at 1.55 billion rupees, slightly up from 1.5 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738329432000,
            "Source": "earnings"
        },
        {
            "Title": "Credo Brands Marketing Reports Q2 FY24 Financial Results",
            "Summary": "Credo Brands Marketing announced its Q2 financial results. The company reported a consolidated net profit of 265 million rupees, down from 280 million rupees in the same quarter last year. However, revenue increased to 1.86 billion rupees from 1.65 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730105714000,
            "Source": "result"
        }
    ]
}