{
    "Symbol": "MUKANDLTD",
    "ISIN": "INE304A01026",
    "News": [
        {
            "Title": "Mukand Limited Reports Q3 FY26 Financial Results",
            "Summary": "Mukand Limited announced Q3 FY26 results with revenue from operations at ₹1,300.18 crore and profit after tax of ₹17.21 crore. Board approved re-appointment of key directors.",
            "Sentiment": "positive",
            "PublishDate": 1770892495646,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mukand Board Meet Set for Feb 12 to Review Q3 Results",
            "Summary": "Mukand Limited has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closure effective from January 1-14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768202133693,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mukand Limited Reports Q2 FY26 Results with Land Sale Agreement Worth Rs 673 Crore",
            "Summary": "Mukand Limited announced its unaudited standalone and consolidated financial results for the quarter and six months ended September 30, 2025. The company's Board of Directors approved these results at a meeting held on November 12, 2025. Key highlights include the execution of an Agreement for Sale on July 23, 2025, for land parcels measuring approximately 17.77 acres in Thane District for a consideration of approximately Rs 673 crore, with an advance of Rs 110 crore already received from the purchaser. The transaction is subject to necessary government approvals and fulfillment of conditions precedent. Additionally, the National Company Law Tribunal approved a scheme of demerger of Stainless Steel Cold Finished Bars and Wires business of Mukand Sumi Metal Processing Limited into Mukand Ltd with effect from April 1, 2024. The company also completed a Business Transfer Agreement on October 18, 2025, for the transfer of part of its Industrial Machinery Division to wholly-owned subsidiary Mukand Heavy Engineering Limited. The results have been reviewed by auditors DHC Co., Chartered Accountants.",
            "Sentiment": "positive",
            "PublishDate": 1762965194151,
            "Source": "earnings"
        },
        {
            "Title": "Mukand Reports Decline in Q2 Financial Performance Across Key Metrics",
            "Summary": "Mukand reported quarterly revenue of 11.6 billion rupees, down from 12.6 billion rupees in the same period last year. The company's EBITDA decreased to 691 million rupees from 760 million rupees year-over-year, with EBITDA margin slightly declining to 5.96% from 6%. Consolidated net profit fell significantly to 99 million rupees compared to 253 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762938161049,
            "Source": "earnings"
        },
        {
            "Title": "Mukand Limited Transfers Industrial Machinery Business to Subsidiary via Slump Sale",
            "Summary": "Mukand Limited executed a Business Transfer Agreement with its wholly owned subsidiary Mukand Heavy Engineering Limited (MHEL) on October 18, 2025. The agreement involves transferring part of its Industrial Machinery Business through a slump sale on a going concern basis. The transferred business includes designing, manufacturing, erecting and commissioning EOT Cranes, other materials handling and process plant equipment activities. The purchase consideration will be paid through the issuance of equity shares by MHEL to Mukand at fair value on the closing date. The transaction is classified as a related party transaction conducted at arm's length. The company states the slump sale aims to provide focused attention on the transferred business, enhance growth opportunities, unlock growth potential and create operational synergies leading to economies of scale while maximizing stakeholder value.",
            "Sentiment": "positive",
            "PublishDate": 1760765987251,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukand Limited Reports Strong Q1 FY2026 Results with Net Profit Surging 435.8% QoQ",
            "Summary": "Mukand Limited reported robust quarterly results with total income from operations reaching Rs 1,102.39 crore, up 4.1% quarter-on-quarter but down 7.3% year-on-year. The company achieved significant profitability improvements with profit before tax growing 129.9% QoQ to Rs 44.11 crore and net profit after tax surging 435.8% QoQ to Rs 35.47 crore. EBITDA margin improved to 8.3% from 5.2% in the previous quarter, while earnings per share increased to Rs 2.45 from Rs 0.46. The company completed the demerger of stainless steel cold finished bars and wires business effective April 1, 2024, and signed an agreement to sell 17.77 acres of land for Rs 673 crore. Management highlighted the company's transformation from a debt-laden entity to a profitable growth trajectory, focusing on high-margin stainless steel production and leveraging its 1,400+ workforce.",
            "Sentiment": "positive",
            "PublishDate": 1754895175071,
            "Source": "earnings"
        },
        {
            "Title": "Mukand Limited Reports Q1 FY26 Results with 29% Jump in Standalone Profit",
            "Summary": "Mukand Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported a standalone profit after tax of Rs 35.47 crore compared to Rs 17.00 crore in the previous quarter, marking a significant increase. Revenue from operations stood at Rs 1,102.39 crore versus Rs 1,058.99 crore in the previous quarter. On a consolidated basis, profit after tax was Rs 29.03 crore compared to Rs 10.90 crore in the previous quarter, with revenue from operations at Rs 1,128.71 crore versus Rs 1,106.89 crore. The company executed a land sale agreement on July 23, 2025, for approximately Rs 673 crore and received an advance of Rs 110 crore. Additionally, the board approved the transfer of part of its Industrial Machinery Division to wholly-owned subsidiary Mukand Heavy Engineering Limited through a slump sale arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1754635060984,
            "Source": "earnings"
        },
        {
            "Title": "Mukand Reports Mixed Q1 Results with Higher Profit but Lower Revenue",
            "Summary": "Mukand reported quarterly consolidated net profit of 290 million rupees compared to 243 million rupees in the same period last year. However, revenue declined to 11.2 billion rupees from 12.6 billion rupees year-over-year. EBITDA fell to 480 million rupees from 708 million rupees, with EBITDA margin compressing to 4.17% from 5.63% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754634521447,
            "Source": "earnings"
        },
        {
            "Title": "Mukand Limited Signs Rs. 673 Crore Land Sale Agreement for 17.77 Acres in Thane",
            "Summary": "Mukand Limited has executed an agreement to sell approximately 17.77 acres of land parcels in Kalwe and Dighe, Thane district, for a consideration of Rs. 673 crore at Rs. 86,980 per square meter. The company has received an advance payment of Rs. 110 crore from the buyer, AGP DC INFRA PRIVATE LIMITED. The transaction is subject to necessary government approvals, permissions from Maharashtra authorities, Thane Collector, and Gram Panchayat, along with completion of due diligence by the purchaser. The sale is expected to be completed within 30 days of satisfying all conditions precedent. The company stated that this land sale will not impact its operations and does not constitute disposal of substantially the whole undertaking. The buyer is not related to the promoter or promoter group, making this a non-related party transaction. The purpose is to unlock value from land parcels without affecting company operations.",
            "Sentiment": "positive",
            "PublishDate": 1753275233897,
            "Source": "order&deals"
        },
        {
            "Title": "Mukand to Transfer Part of Industrial Machinery Business",
            "Summary": "Mukand Limited has announced plans to transfer a portion of its industrial machinery business to Mukand Heavy Engineering. No further details about the scope, timeline, or financial implications of this transfer were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1747396220000,
            "Source": "default"
        },
        {
            "Title": "Mukand Reports Q4 Results and Dividend Recommendation",
            "Summary": "Mukand has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit decreased to 109 million rupees from 291 million rupees year-over-year. Revenue for Q4 was 11.07 billion rupees, down from 12.39 billion rupees in the same period last year. EBITDA for Q4 stood at 651.3 million rupees, compared to 828.5 million rupees year-over-year, with EBITDA margin declining to 5.88% from 6.69%. The company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747396189000,
            "Source": "result"
        },
        {
            "Title": "Mukand Reports Improved Q3 EBITDA and Margin",
            "Summary": "Mukand Limited has reported an increase in its Q3 EBITDA to 720 million rupees, up from 622 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 5.71% from 5.29% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739178708000,
            "Source": "earnings"
        },
        {
            "Title": "Mukand Reports Q3 Consolidated Net Profit of 149 Million Rupees",
            "Summary": "Mukand Limited has announced its third quarter consolidated net profit of 149 million rupees, compared to 194 million rupees in the same period last year, indicating a year-over-year decrease in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1739178647000,
            "Source": "earnings"
        },
        {
            "Title": "Mukand Reports Q2 Revenue Decline",
            "Summary": "Mukand, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 12.6 billion rupees, showing a decrease from 13.76 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1731053485000,
            "Source": "result"
        },
        {
            "Title": "Mukand Reports Improved Q2 EBITDA and Margin",
            "Summary": "Mukand Limited has reported its Q2 financial results. The company's EBITDA increased to 770 million rupees from 705 million rupees year-over-year. Additionally, the EBITDA margin improved to 6.10% from 5.12% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731053473000,
            "Source": "result"
        },
        {
            "Title": "Mukand Reports Increased Q2 Consolidated Net Profit",
            "Summary": "Mukand Limited has reported a consolidated net profit of 258 million rupees for the second quarter, compared to 223 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731053425000,
            "Source": "result"
        }
    ]
}