{
    "Symbol": "MUKKA",
    "ISIN": "INE0CG401037",
    "News": [
        {
            "Title": "Mukka Proteins to Acquire Remaining 2% Stake in Subsidiary",
            "Summary": "Mukka Proteins Limited board approves acquisition of 2,000 equity shares in Haris Marine Products Private Limited for Rs. 19.64 lakh, making it a wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1770905586417,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mukka Proteins to Acquire Full Control of EPPL",
            "Summary": "Mukka Proteins Limited approves acquisition of additional 1,000 equity shares in Ento Proteins Private Limited for Rs. 32.30 lakhs, making EPPL a wholly owned subsidiary with 100% shareholding.",
            "Sentiment": "positive",
            "PublishDate": 1770901133796,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mukka Proteins Gets Verra Listing for BSF Project",
            "Summary": "Mukka Proteins' 300 TPD BSF waste processing project in Bengaluru gets Verra Registry listing under Project ID 5893, with capacity expansion approved up to 1,000 TPD for enhanced carbon credit generation.",
            "Sentiment": "positive",
            "PublishDate": 1769484437884,
            "Source": "stocks"
        },
        {
            "Title": "Mukka Proteins Forms LLP for Waste Treatment Business",
            "Summary": "Mukka Proteins Limited executed an LLP agreement with Msjathin Infra Private Limited and Mr. Hardik Gowda to incorporate MPL HRC Ecosolutions LLP for legacy leachate and bio waste treatment business with initial capital of ₹5.00 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1769087417110,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mukka Proteins Acquires Ocean Proteins for ₹10.45 Cr",
            "Summary": "Mukka Proteins Limited completed acquisition of 1,04,500 equity shares in Ocean Proteins Private Limited for ₹10.45 crores, making it a subsidiary with 51% shareholding effective December 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767176721735,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mukka Proteins Faces ₹7.67 Cr Customs Duty Order",
            "Summary": "Mukka Proteins Limited received Bond Enforcement Order from Customs, Mangaluru for ₹7.67 crores duty recovery over alleged non-compliance with export obligations under advance licence scheme.",
            "Sentiment": "negative",
            "PublishDate": 1767096379953,
            "Source": "stocks"
        },
        {
            "Title": "Mukka Proteins Forms New Waste Management Venture",
            "Summary": "Mukka Proteins board approves formation of MPL HRC Ecosolutions LLP, a new company focused on waste management initiatives to expand business operations.",
            "Sentiment": "positive",
            "PublishDate": 1765891638395,
            "Source": "stocks"
        },
        {
            "Title": "Mukka Proteins Acquires 68% Stake in United Gulf Fishery Products LLC",
            "Summary": "Mukka Proteins Limited entered into a Share Transfer Agreement on December 10, 2025, to acquire a 68% stake in United Gulf Fishery Products LLC for OMR 34,000 from shareholder Mr. Saif Salim Ahmed Al-Rawahi. The acquisition is subject to compliance with Foreign Exchange Management regulations and Reserve Bank of India requirements.",
            "Sentiment": "positive",
            "PublishDate": 1765367226524,
            "Source": "order&deals"
        },
        {
            "Title": "Mukka Proteins JV Wins ₹474.89 Crore Contract for Legacy Leachate Treatment in Bengaluru",
            "Summary": "Mukka Proteins Limited's joint venture with Hardik Gowda and MS Jathin Infra has secured a ₹474.89 crore contract from Bengaluru Solid Waste Management Limited for treating legacy leachate at Mittaganahalli and Kannur landfill sites, with Mukka holding a 76% stake in the JV. The 4-year project marks the company's strategic diversification from fish meal manufacturing into environmental solutions, requiring an estimated CAPEX of ₹100 crore with construction expected to take 6 months.",
            "Sentiment": "positive",
            "PublishDate": 1765014271972,
            "Source": "order&deals"
        },
        {
            "Title": "Mukka Proteins Joint Venture Secures 4.75 Billion Rupee Work Order",
            "Summary": "Mukka Proteins announced that its joint venture has received a work order valued at 4.75 billion rupees. This significant contract award affects the company and its joint venture partner, representing a substantial business opportunity for revenue generation.",
            "Sentiment": "positive",
            "PublishDate": 1764806781414,
            "Source": "order&deals"
        },
        {
            "Title": "Mukka Proteins Limited Receives Renewed Environmental Consent for Operations Until 2032",
            "Summary": "Mukka Proteins Limited announced that its subsidiary Haris Marine Products Private Limited and group entities Mangalore Fish Meal Oil Company and Ullal Fish Meal Oil Company have received renewed Consent For Operation (CFO-Air, Water) from Karnataka State Pollution Control Board. The renewed consent is valid from November 12, 2025 to September 30, 2032. The CFO is a mandatory approval under pollution control acts that permits the company to lawfully operate its industrial activities and discharge effluents and emissions within permitted limits. The approval confirms that the company's processes, effluent treatment systems and emission-control measures comply with environmental standards prescribed by the Pollution Control Board.",
            "Sentiment": "positive",
            "PublishDate": 1763028143850,
            "Source": "stock"
        },
        {
            "Title": "Mukka Proteins Acquires Majority Stake in Oman-Based Fishery Company",
            "Summary": "Mukka Proteins is purchasing a 68% stake in United Gulf Fishery Products LLC, an Oman-based company, for ₹1 crore. This acquisition gives Mukka Proteins majority control of the fishery products business.",
            "Sentiment": "positive",
            "PublishDate": 1762960910053,
            "Source": "order&deals"
        },
        {
            "Title": "Mukka Proteins Reports Strong Q2 Growth with Net Profit Rising to 69M Rupees",
            "Summary": "Mukka Proteins delivered strong quarterly results with consolidated net profit increasing to 69 million rupees from 15 million rupees year-over-year. Revenue grew significantly to 2.45 billion rupees compared to 1.5 billion rupees in the same period last year. EBITDA rose to 207 million rupees from 96 million rupees year-over-year, while EBITDA margin improved to 8.47% from 6.41% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762957254965,
            "Source": "earnings"
        },
        {
            "Title": "Mukka Proteins Receives Show Cause Notice from Customs Department for Export Incentive Recovery",
            "Summary": "Mukka Proteins Limited received a Show Cause Notice dated October 28, 2025, from the Office of the Commissioner of Customs, Mangaluru. The notice demands recovery of export incentives totaling ₹30,36,871, comprising Duty Drawback of ₹17,08,509 and RoDTEP of ₹13,28,362, along with applicable interest and penalty. The customs department alleges the company failed to furnish proof of realization of foreign exchange proceeds against certain exports. The company is reviewing the notice and will file a comprehensive response within the stipulated time. The company states there is no other impact on its financials or operations beyond the mentioned amount.",
            "Sentiment": "negative",
            "PublishDate": 1761996430316,
            "Source": "stock"
        },
        {
            "Title": "Mukka Proteins Limited Updates Corporate Identification Number Following Memorandum Changes",
            "Summary": "Mukka Proteins Limited has updated its Corporate Identification Number (CIN) from L05004KA2010PLC055771 to L10809KA2010PLC055771. The change follows alterations to the Object Clause of the company's Memorandum of Association. The updated CIN has been reflected in the Company Master Data of the Ministry of Corporate Affairs following the company's application to the Registrar of Companies, Bangalore. The company has informed NSE and BSE to update their records accordingly.",
            "Sentiment": "neutral",
            "PublishDate": 1760719664301,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins' GST Demand Reduced Significantly from ₹141.06 Crore to ₹27.16 Lakh",
            "Summary": "Mukka Proteins Limited received a Show Cause Notice from the Office of the Assistant Commissioner of State Tax, Porbandar, which substantially reduced the proposed GST demand from ₹141.06 crore to ₹27.16 lakh. The original demand was related to alleged discrepancies in GST returns for FY 2021-22. The company had filed a detailed reply on September 23, 2025, denying the allegations and stating that all tax liabilities had been duly discharged. The revised demand comprises SGST ₹3.04 lakh, CGST ₹3.04 lakh, IGST ₹5.35 lakh and Cess ₹15.74 lakh, along with applicable interest and penalty. The company believes the revised demand is also untenable and will contest it before authorities, maintaining that no material financial liability will arise from these proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1759476644019,
            "Source": "stock"
        },
        {
            "Title": "Mukka Proteins' GST Demand Reduced by 99% from ₹141.06 Crore to ₹27.16 Lakh",
            "Summary": "Mukka Proteins has received a significant reduction in its GST demand, which has been cut from ₹141.06 crore to ₹27.16 lakh. Despite this substantial decrease of over 99%, the company plans to challenge the updated demand amount.",
            "Sentiment": "positive",
            "PublishDate": 1759302366525,
            "Source": "stock"
        },
        {
            "Title": "Mukka Proteins Limited Expands Business Scope with New Ventures in Insect-Based Products, Waste Management, and Agriculture",
            "Summary": "Mukka Proteins Limited shareholders approved alterations to the company's Memorandum of Association at their 15th Annual General Meeting held on September 18, 2025. The amendments expand the company's business scope to include four new areas: manufacturing and dealing in insect-based ingredients for human consumption, animal feeds, and medical preparations; waste management services including treatment of plastic, metal, organic, and food waste with conversion to value-added products; production and distribution of humic acid, fulvic acid, organic fertilizers, and agricultural chemicals; and comprehensive agricultural operations including cultivation, processing, marketing, and trading of various agricultural products and commodities. The expanded scope also covers allied agri-services such as farm mechanization, agricultural consultancy, soil testing, and contract farming operations that can be conducted in India or internationally through subsidiaries, associates, or joint ventures.",
            "Sentiment": "positive",
            "PublishDate": 1758199555706,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins Receives ₹141.06 Crore GST Demand Notice for FY 2021-22",
            "Summary": "Mukka Proteins has received a GST demand notice worth ₹141.06 crore from the State Tax Officer in Porbandar for FY 2021-22. This represents a significant tax liability that the company will need to address.",
            "Sentiment": "negative",
            "PublishDate": 1758195603026,
            "Source": "stock"
        },
        {
            "Title": "Mukka Proteins Receives Tax Notices Worth 78.2 Million Rupees in Total Penalties",
            "Summary": "Mukka Proteins has received two tax notices with penalties totaling 78.2 million rupees. The first notice carries a penalty of 34.5 million rupees, while the second notice involves a penalty of 43.7 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1756131185330,
            "Source": "stock"
        },
        {
            "Title": "Mukka Proteins Secures Bengaluru Waste Management Contract for 300 TPD BSF Plant",
            "Summary": "Mukka Proteins Limited has been empanelled as an Authorised Waste Processor by Bengaluru Solid Waste Management Limited (BSWML). The company will manage 200-300 metric tonnes per day of wet waste, with planned expansion to 1,000 tonnes per day. The facility will use Black Soldier Fly (BSF) technology to convert city waste into insect protein for fish feed and pet food supplements, plus organic compost. The company's subsidiary Ento Proteins Private Limited operates a similar BSF facility in Mangaluru, which was recently praised by Prime Minister Narendra Modi. Mukka Proteins has proposed amendments to its Memorandum of Association to include insect-based products, comprehensive waste management solutions, and manufacturing of agricultural inputs. Managing Director K. Mohammed Haris described the Bengaluru project as a landmark achievement that allows the company to apply proven BSF technology on a metropolitan scale.",
            "Sentiment": "positive",
            "PublishDate": 1755162691882,
            "Source": "stock"
        },
        {
            "Title": "Mukka Proteins Approves Business Expansion, Corporate Guarantee and Delays Ocean Proteins Acquisition",
            "Summary": "Mukka Proteins Limited's Board of Directors approved alterations to the company's Memorandum of Association to expand business operations into four new areas: insect-based ingredients for human and animal consumption, waste management and treatment services, organic fertilizers and soil conditioners, and comprehensive agricultural products and services. The board also approved issuing a corporate guarantee of Rs. 1.35 crore to associate company Ocean Proteins Private Limited for its State Bank of India credit facilities, creating a contingent liability for Mukka Proteins. Additionally, the company announced a delay in acquiring 104,500 equity shares of Ocean Proteins Private Limited due to procedural issues, with the completion date extended from July 31, 2025 to December 31, 2025. All decisions were made during a board meeting on August 13, 2025, with the Memorandum changes requiring shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755100187438,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins Reports Mixed Q1 Results with EBITDA Growth but Lower Net Profit",
            "Summary": "Mukka Proteins reported Q1 EBITDA of 145 million rupees compared to 140 million rupees in the same period last year, with EBITDA margin improving to 8.49% from 8.12%. However, consolidated net profit declined significantly to 15 million rupees from 42 million rupees year-over-year. Revenue decreased slightly to 1.65 billion rupees from 1.67 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755093139282,
            "Source": "earnings"
        },
        {
            "Title": "Mukka Proteins Limited Acquires 70% Stake in Vietnam Subsidiary for 165.14 Million VND",
            "Summary": "Mukka Proteins Limited has entered into a Capital Contribution Transfer Agreement to acquire a 70% stake in Mukka Proteins Vietnam Co., Ltd. for 165,144,000 VND. The agreement was signed with TRẦN THỊ PHÚC, a shareholder of the Vietnamese entity. The acquisition will make Mukka Proteins Vietnam Co., Ltd. a subsidiary of Mukka Proteins Limited. The completion of this acquisition is subject to compliance with Foreign Exchange Management (Overseas Investment) Regulations, 2022. The transaction is not classified as a related party transaction, and the parties involved are not related to the promoter or promoter group.",
            "Sentiment": "positive",
            "PublishDate": 1754311204550,
            "Source": "order&deals"
        },
        {
            "Title": "Mukka Proteins Approves Rs 35.37 Crore Guarantee and Strategic Acquisitions Worth Rs 5.1 Crore",
            "Summary": "Mukka Proteins Limited's Board approved three strategic decisions on July 26, 2025. The company will provide a corporate guarantee of up to Rs 35.37 crores to its associate company Ocean Proteins Private Limited for securing credit facilities from Axis Bank Limited. The guarantee creates a contingent liability for Mukka Proteins and will be provided on an arm's length basis, with promoters having directorship interest in Ocean Proteins. Additionally, the company approved acquiring a 51% stake in Mukka Frozen Impex for up to Rs 5 crores through capital contributions, to be completed by October 31, 2025. Mukka Frozen Impex, incorporated on July 5, 2025, operates in trading, manufacturing and dealing in fish and marine products. The company also approved acquiring a 70% stake in Mukka Proteins Vietnam Co., Ltd. for up to Rs 10 lakhs, to be completed by December 31, 2025. The Vietnam entity, incorporated in February 2023, trades feed and ingredients for livestock, poultry and aquatic products, with a turnover of Rs 15.01 crores in December 2024. Both acquisitions are part of the company's strategic investment plans to expand its core business in the fish and marine products industry.",
            "Sentiment": "positive",
            "PublishDate": 1753532259447,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins Reports Mixed Q4 Results",
            "Summary": "Mukka Proteins announced its Q4 financial results. The company's consolidated net profit decreased to 136 million rupees, down from 272 million rupees year-over-year and 263 million rupees quarter-over-quarter. However, revenue increased to 3.8 billion rupees, up from 2.6 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747313717000,
            "Source": "result"
        },
        {
            "Title": "Mukka Proteins Acquires 51% Stake in GSM Marine Export",
            "Summary": "Mukka Proteins has announced a strategic acquisition of a 51% stake in GSM Marine Export. The acquisition is valued at 140 million rupees, marking a significant corporate action for the company.",
            "Sentiment": "positive",
            "PublishDate": 1742969634000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins to Acquire Majority Stake in Fabbco and Issue Corporate Guarantee",
            "Summary": "Mukka Proteins has announced plans to acquire a 51% stake in Fabbco, a company engaged in animal feed manufacturing and waste processing, for 60 million rupees. Additionally, Mukka Proteins has approved the issuance of a corporate guarantee to Shipwaves Online.",
            "Sentiment": "positive",
            "PublishDate": 1742947986000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins Approves Corporate Guarantee for Shipwaves Online",
            "Summary": "Mukka Proteins has approved the issuance of a corporate guarantee to Shipwaves Online. This decision indicates a financial commitment or support from Mukka Proteins to Shipwaves Online, potentially for securing loans or other financial arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1742902223000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins to Acquire 51% Stake in Fabbco for 60 Million Rupees",
            "Summary": "Mukka Proteins has announced its intention to acquire a 51% stake in Fabbco, a company engaged in animal feed manufacturing and waste processing. The acquisition is valued at 60 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1742902086000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins Secures Purchase Orders Worth 442.8 Million Rupees",
            "Summary": "Mukka Proteins has received purchase orders totaling 442.8 million rupees for the supply of fish meal and oil. This significant order demonstrates strong demand for the company's products and potentially indicates positive business performance.",
            "Sentiment": "positive",
            "PublishDate": 1741220813000,
            "Source": "order&deals"
        },
        {
            "Title": "Mukka Proteins Secures Purchase Orders Worth 442.8 Million Rupees",
            "Summary": "Mukka Proteins has received purchase orders totaling 442.8 million rupees for the supply of fish meal and oil. This significant order demonstrates strong demand for the company's products and could potentially boost its revenue and market position in the seafood processing industry.",
            "Sentiment": "positive",
            "PublishDate": 1741178876000,
            "Source": "order&deals"
        },
        {
            "Title": "Mukka Proteins Reports Mixed Q3 Financial Results",
            "Summary": "Mukka Proteins has announced its Q3 financial results. The company's consolidated net profit increased significantly to 263 million rupees, up from 104 million rupees in the same quarter last year. However, revenue decreased to 3 billion rupees from 5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739751475000,
            "Source": "earnings"
        },
        {
            "Title": "Mukka Proteins Reports Significant EBITDA Growth in Q3",
            "Summary": "Mukka Proteins has announced its Q3 financial results, showing a substantial increase in EBITDA. The company's EBITDA rose to 413 million rupees, up from 189 million rupees in the same quarter last year. Additionally, the EBITDA margin improved significantly, reaching 13.62% compared to 3.66% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739540094000,
            "Source": "earnings"
        },
        {
            "Title": "Mukka Proteins Reports Q3 Financial Results",
            "Summary": "Mukka Proteins announced its Q3 financial results. The company's consolidated net profit increased to 263 million rupees, up from 104 million rupees in the same quarter last year. However, revenue decreased to 3 billion rupees from 5 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739540084000,
            "Source": "earnings"
        },
        {
            "Title": "Mukka Proteins Divests Entire Stake in Bangladesh Subsidiary",
            "Summary": "Mukka Proteins has completed the disinvestment of its entire stake in MSFI (Bangladesh) Ltd for a consideration of USD 14,038.44.",
            "Sentiment": "neutral",
            "PublishDate": 1734435067000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins Reports Significant Drop in Q2 EBITDA",
            "Summary": "Mukka Proteins has reported a substantial decrease in its Q2 EBITDA, which fell to 96 million rupees from 380 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 6.43% from 11.45% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731597213000,
            "Source": "result"
        },
        {
            "Title": "Mukka Proteins Reports Significant Decline in Q2 Profits and Revenue",
            "Summary": "Mukka Proteins has reported a substantial decrease in its Q2 consolidated net profit, which fell to 15 million rupees from 287 million rupees year-over-year. The company also experienced a decline compared to the previous quarter, where the profit was 53 million rupees. Additionally, Q2 revenue dropped to 1.5 billion rupees from 3.3 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731597166000,
            "Source": "result"
        },
        {
            "Title": "Mukka Proteins Approves Share Issuance Worth 980 Million Rupees",
            "Summary": "Mukka Proteins has approved the issuance of shares valued at 980 million rupees (approximately $11.8 million USD). This decision indicates a significant corporate financial move, potentially aimed at raising capital for the company's operations or expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1729511545000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukka Proteins Schedules Board Meeting to Discuss Fundraising",
            "Summary": "<p><span class=\"neutral\">Mukka Proteins</span> has announced a <b>board meeting</b> on <span class=\"neutral\">October 21</span> to consider <span class=\"positive\">raising funds</span>. This indicates the company may be planning to <span class=\"positive\">secure additional capital</span> for its <span class=\"neutral\">operations</span> or <span class=\"positive\">expansion plans</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728909644000,
            "Source": "corporate_action"
        }
    ]
}