{
    "Symbol": "MUKTAARTS",
    "ISIN": "INE374B01019",
    "News": [
        {
            "Title": "Mukta Arts Invests ₹12.08 Lakh in Bahrain Subsidiary",
            "Summary": "Mukta Arts Limited has invested BHD 60,000 (₹12.08 lakh) in its Bahrain-based subsidiary Mukta A2 Multiplex W.L.L by subscribing to 600 equity shares on December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766078364026,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mukta Arts Reports Mixed Financial Performance for Quarter Ended September 2025",
            "Summary": "Mukta Arts Limited announced its financial results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported total revenue of Rs 272.28 lakhs for the quarter compared to Rs 609.21 lakhs in the same period last year. The company posted a net profit of Rs 73.65 lakhs for the quarter versus Rs 75.85 lakhs in the previous year. On a consolidated basis, total revenue reached Rs 1,735.70 lakhs for the quarter against Rs 3,673.61 lakhs in the corresponding quarter of the previous year. However, the consolidated entity reported a net loss of Rs 955.59 lakhs for the quarter compared to a loss of Rs 609.32 lakhs in the same period last year. The Board of Directors approved these results at their meeting held on November 12, 2025. The company continues to face ongoing litigation with Maharashtra Film Stage and Cultural Development Corporation regarding rent arrears and property matters.",
            "Sentiment": "negative",
            "PublishDate": 1762935592196,
            "Source": "earnings"
        },
        {
            "Title": "Mukta Arts Appoints Rajendra Doshi as Independent Director, Reports Mixed Q1 Results",
            "Summary": "Mukta Arts Limited appointed Rajendra Doshi as Additional Non-Executive Independent Director for 5 years effective August 12, 2025, subject to shareholder approval. The company also appointed Pratiksha Panchal as Nodal Officer for investor education matters and approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of Rs 261.24 lakhs and net profit of Rs 75.85 lakhs with earnings per share of Rs 0.34. However, on consolidated basis, revenue from operations was Rs 3,672.89 lakhs but the company posted a net loss of Rs 609.32 lakhs with loss per share of Rs 2.70. The board also reconstituted various committees including Audit, Nomination & Remuneration, and Stakeholders Relationship Committees effective September 27, 2025, with the new director being included as a member.",
            "Sentiment": "neutral",
            "PublishDate": 1754991077255,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukta Arts Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Mukta Arts Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mrs. Madhumati Ramchandra Lele as a Non-Executive Independent Director for a 5-year term from May 28, 2025 to May 27, 2030. The e-voting period runs from July 23, 2025 at 9:00 AM to August 21, 2025 at 5:00 PM. Mrs. Lele, who has over 40 years of senior management experience with companies including Reliance Jio, Tata Group, Vodafone Group, and luxury hotel chains like Taj and Oberoi Groups, was initially appointed as an Additional Director by the Board on May 28, 2025. She currently serves as President of the Cricket Club of India and is a Board Member of BCCI. The resolution requires a special resolution for approval, and M/s. KDA & Associates has been appointed as the scrutinizer for the e-voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1753101556035,
            "Source": "corporate_governance"
        }
    ]
}