{
    "Symbol": "MUNJALSHOW",
    "ISIN": "INE577A01027",
    "News": [
        {
            "Title": "Munjal Showa Q3 FY26 Results: 82% Profit Jump",
            "Summary": "Munjal Showa Limited reported strong Q3 FY26 results with net profit surging 82.41% to Rs. 1,090.72 lakhs and revenue growing 9.59% to Rs. 34,968.17 lakhs compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770456622788,
            "Source": "co_actions_results"
        },
        {
            "Title": "Munjal Showa Receives ₹33.28 Lakh GST Demand Order",
            "Summary": "Munjal Showa Limited received a GST demand order of ₹33.28 lakhs from Uttarakhand tax authorities for FY 2021-22. The company plans to challenge the order and expects no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1766492478131,
            "Source": "stocks"
        },
        {
            "Title": "Munjal Showa Limited Appoints New Company Secretary and Vice President Operations",
            "Summary": "Munjal Showa Limited's Board approved the appointment of Mr. Ravinder Sharma as Company Secretary & Compliance Officer and Mr. Vipin Yadav as Vice President-Operations, both effective November 14, 2025. The appointments strengthen the company's leadership team with experienced professionals in compliance and automotive manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1763113388507,
            "Source": "corporate_governance"
        },
        {
            "Title": "Munjal Showa Reports Mixed Q2 Performance with Higher Expenses Due to VRS Costs",
            "Summary": "Munjal Showa Limited posted quarterly results for the period ended September 30, 2025, with revenue from operations at Rs. 33,262.43 lakhs and profit after tax of Rs. 271.10 lakhs, while total expenses increased by Rs. 322.51 lakhs due to Voluntary Retirement Scheme separation costs. The auto components manufacturer's Board approved the results on November 14, 2025, with the company operating as a single reportable segment and having no subsidiaries or joint ventures.",
            "Sentiment": "positive",
            "PublishDate": 1763112389999,
            "Source": "earnings"
        },
        {
            "Title": "Neha Bansal Resigns as Company Secretary and Compliance Officer of Munjal Showa Limited",
            "Summary": "Neha Bansal has resigned from her position as Company Secretary and Compliance Officer of Munjal Showa Limited, effective August 23, 2025, citing personal reasons. Her resignation also results in her ceasing to hold positions as Key Managerial Personnel, Nodal Officer for IEPF Authority, and Chairperson of the Internal Committee for Prevention of Sexual Harassment. Bansal expressed gratitude for the professional growth and learning gained during her tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1755951554767,
            "Source": "corporate_governance"
        },
        {
            "Title": "Munjal Showa Reports Decline in Q1 Financial Performance",
            "Summary": "Munjal Showa reported quarterly revenue of 2.9 billion rupees, down from 3.1 billion rupees in the same period last year. The company's net profit fell to 83 million rupees from 119 million rupees year-over-year. EBITDA decreased significantly to 15 million rupees compared to 72 million rupees in the previous year, with EBITDA margin dropping to 0.55% from 2.32%.",
            "Sentiment": "negative",
            "PublishDate": 1754299002428,
            "Source": "earnings"
        },
        {
            "Title": "Munjal Showa Declares Dividend and Reports Q4 EBITDA",
            "Summary": "Munjal Showa has declared a dividend of 4.5 rupees per share. The company's Q4 EBITDA increased to 72 million rupees from 67 million rupees year-over-year. The Q4 EBITDA margin also improved slightly to 2.38% from 2.29% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748262154000,
            "Source": "result"
        },
        {
            "Title": "Munjal Showa Reports Q4 Financial Results",
            "Summary": "Munjal Showa has announced its Q4 financial results. The company reported a net profit of 89 million rupees, compared to 78.2 million rupees year-over-year and 60 million rupees quarter-over-quarter. Revenue for Q4 stood at 3 billion rupees, compared to 2.94 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748261961000,
            "Source": "result"
        },
        {
            "Title": "Munjal Showa Reports Significant Increase in Q3 EBITDA",
            "Summary": "Munjal Showa has reported a substantial year-over-year improvement in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 34 million rupees to 77 million rupees. Additionally, the EBITDA margin expanded from 1.13% to 2.43%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738829713000,
            "Source": "earnings"
        },
        {
            "Title": "Munjal Showa Reports Decline in Q3 Net Profit",
            "Summary": "Munjal Showa, an automotive component manufacturer, has reported its financial results for the third quarter. The company's net profit decreased to 60 million rupees from 86 million rupees in the same period last year. However, revenue showed a slight increase, rising to 3.2 billion rupees from 3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738829617000,
            "Source": "earnings"
        },
        {
            "Title": "Munjal Showa Reports Increased Q2 EBITDA Loss",
            "Summary": "Munjal Showa, an Indian automotive component manufacturer, reported an EBITDA loss of 52.4 million rupees in the second quarter, compared to a loss of 17.5 million rupees in the same period last year. This represents a significant increase in the company's losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731316782000,
            "Source": "result"
        },
        {
            "Title": "Munjal Showa Reports Q2 Revenue Growth",
            "Summary": "Munjal Showa, an Indian automotive components manufacturer, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 3.2 billion rupees, up from 2.9 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731316467000,
            "Source": "result"
        },
        {
            "Title": "Munjal Showa Reports Increased Q2 Net Profit",
            "Summary": "Munjal Showa, an Indian company, has reported a net profit of 21 million rupees for the second quarter, compared to 15 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731316423000,
            "Source": "result"
        }
    ]
}