{
    "Symbol": "MURUDCERA",
    "ISIN": "INE692B01014",
    "News": [
        {
            "Title": "Murudeshwar Ceramics Board Meet on Feb 13, 2026",
            "Summary": "Murudeshwar Ceramics Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769758329304,
            "Source": "co_actions_results"
        },
        {
            "Title": "Murudeshwar Ceramics Reports Quarterly Results for September 2025",
            "Summary": "Murudeshwar Ceramics Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the results during their meeting held on November 12, 2025. The company's standalone total assets stood at Rs. 58,404.24 lakhs as of September 30, 2025, compared to Rs. 56,927.70 lakhs as of March 31, 2025. Share capital remained unchanged at Rs. 6,054.53 lakhs. The results were reviewed by statutory auditors and approved by the Audit Committee. The consolidated results include the company's share of net profits from its associate RNS Power Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762936642049,
            "Source": "earnings"
        },
        {
            "Title": "Murudeshwar Ceramics Reports Quarterly Financial Results for June 2025",
            "Summary": "Murudeshwar Ceramics Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹46.15 crores and profit before tax of ₹1.95 crores for the quarter. The results include both standalone and consolidated financials, with the consolidated results incorporating the company's associate RNS Power Limited. Basic earnings per share from continuing operations stood at ₹0.32. The board meeting was held on August 13, 2025, and the results were reviewed by the Audit Committee. The company operates in ceramic and vitrified tiles manufacturing with segments including sale of products and services.",
            "Sentiment": "neutral",
            "PublishDate": 1755073077107,
            "Source": "earnings"
        },
        {
            "Title": "Murudeshwar Ceramics Announces 42nd AGM for August 25, 2025 with Dividend Declaration and Key Resolutions",
            "Summary": "Murudeshwar Ceramics Limited has scheduled its 42nd Annual General Meeting for Monday, August 25, 2025 at 3:00 PM at Hotel Naveen, Unkal Lake, Hubballi. The company has declared a final dividend of Rs. 0.50 per equity share (5%) for FY 2024-25. Key agenda items include adoption of audited financial statements, reappointment of directors, appointment of secretarial auditor for five years, and approval of material related party transactions with RNS Infrastructure Limited up to Rs. 100 crores. The company reported total income of Rs. 20,776.90 lakhs in FY 2024-25 compared to Rs. 19,075.22 lakhs in the previous year, with profit after tax of Rs. 968.73 lakhs versus Rs. 486.07 lakhs in FY 2023-24. The record date for dividend eligibility is August 14, 2025, with book closure from August 18-25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753168780402,
            "Source": "corporate_action"
        }
    ]
}