{
    "Symbol": "MUTHOOTCAP",
    "ISIN": "INE296G01013",
    "News": [
        {
            "Title": "Muthoot Capital Reports Zero Physical Share Transfers",
            "Summary": "Muthoot Capital Services filed regulatory report showing no physical share transfer requests received or processed during January 1-6, 2026 period under SEBI's special re-lodgement window.",
            "Sentiment": "neutral",
            "PublishDate": 1769181198383,
            "Source": "stocks"
        },
        {
            "Title": "Muthoot Capital Issues ₹50 Cr Commercial Paper",
            "Summary": "Muthoot Capital Services Limited has issued Commercial Paper worth ₹50 crores on January 21, 2026, with 8.77% discount rate and 99-day tenure, maturing April 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769023906806,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Capital Q3FY26 Investor Call on Jan 22",
            "Summary": "Muthoot Capital Services schedules investor presentation for Q3FY26 results on January 22, 2026. Company reports loan assets of ₹3,321.89 crores and total assets of ₹3,943.77 crores as of December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769020645674,
            "Source": "stocks"
        },
        {
            "Title": "Muthoot Capital Q3FY26 Results Show Mixed Performance",
            "Summary": "Muthoot Capital Services reported Q3FY26 net profit of ₹765.06 cr vs ₹1,255.56 cr in Q3FY25, while revenue from operations grew to ₹15,507.96 cr. Company appointed new Chief Internal Auditor.",
            "Sentiment": "neutral",
            "PublishDate": 1769016011663,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Capital Raises ₹57.44 Cr via Securitization",
            "Summary": "Muthoot Capital Services completed its fourth securitization transaction of FY 2025-26, raising ₹57.44 crores through assignment of two-wheeler loan receivables worth ₹59.22 crores on January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767254949271,
            "Source": "stocks"
        },
        {
            "Title": "Muthoot Capital Issues ₹25 Cr Commercial Paper",
            "Summary": "Muthoot Capital Services Limited issued commercial paper worth ₹25 crores on December 24, 2025, with 8.85% interest rate and 152-day maturity to Transport Corporation of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1766585108039,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Capital Gets BSE Listing Approval for ₹15 Cr CP",
            "Summary": "Muthoot Capital Services received BSE listing approval for its ₹15 crore commercial paper issued on December 16, 2025, with ISIN INE296G14602 and scrip code 730789.",
            "Sentiment": "positive",
            "PublishDate": 1765893987539,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Capital Gets BSE Listing Approval for ₹15 Cr CP",
            "Summary": "Muthoot Capital Services received BSE listing approval for its ₹15 crore commercial paper issued on December 12, 2025, with maturity date March 10, 2026 and ISIN INE296G14594.",
            "Sentiment": "positive",
            "PublishDate": 1765554454415,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Capital Services Chief Internal Auditor Resigns",
            "Summary": "Mr. Vuyyuru Vijaya Kumar resigned from his position as Chief Internal Auditor at Muthoot Capital Services Limited effective December 03, 2025, citing personal reasons and better career opportunities in Hyderabad. The resignation affects the company's internal audit function, with Kumar committing to ensure smooth handover of ongoing audits and responsibilities during the transition period.",
            "Sentiment": "neutral",
            "PublishDate": 1764769724689,
            "Source": "corporate_governance"
        },
        {
            "Title": "Muthoot Capital Services Appoints Suneet Nehru as National Head-Four Wheeler",
            "Summary": "Muthoot Capital Services Limited appointed Mr. Suneet Nehru as National Head-Four Wheeler effective November 24, 2025, through a Board circular resolution. Nehru brings over 21 years of experience in sales, marketing, and business development, having previously served as Divisional Manager at Mahindra Financial Services Limited.",
            "Sentiment": "positive",
            "PublishDate": 1763992945651,
            "Source": "corporate_governance"
        },
        {
            "Title": "Muthoot Capital Services Allots ₹150 Crore Green Bonds at 8.40% Coupon Rate",
            "Summary": "Muthoot Capital Services Limited allotted 15,000 rated, listed, senior, secured, redeemable, transferable, non-convertible certified Green Bonds worth ₹150 crores on a private placement basis. Each bond has a face value of ₹1,00,000 with an 8.40% annual coupon rate payable monthly. The bonds have a 6-year tenure from October 17, 2025 to October 17, 2031, and will be listed on NSE Limited. The debentures are secured by a first ranking pari passu floating charge over loan receivables with a security cover of 1.1 times the outstanding principal amount, along with charges over DSRA and Escrow Account. The allotment was approved by the company's Debenture Issue and Allotment Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1760679300669,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Reports Mixed Q2 Results with Profit Recovery Despite Higher Provisions",
            "Summary": "Muthoot Capital Services Limited reported a profit of ₹282.72 lakhs for the quarter ended September 30, 2025, recovering from a loss of ₹466.99 lakhs in the previous quarter. However, the company's half-year profit declined to ₹184.27 lakhs compared to ₹2,677.20 lakhs in the same period last year. Revenue from operations increased to ₹15,354.39 lakhs in Q2 from ₹14,531.77 lakhs in Q1, driven by higher interest income of ₹14,688.25 lakhs. The company faced significant challenges with impairment on financial instruments rising to ₹1,669.85 lakhs in Q2 compared to ₹2,667.60 lakhs in Q1. Finance costs increased to ₹8,138.60 lakhs from ₹7,509.22 lakhs quarter-on-quarter. The company reported 10 fraud incidents totaling ₹37.01 lakhs during the quarter, for which 100% provision was made. Gross NPA ratio improved to 6.46% while Net NPA ratio stood at 3.07%. The company raised ₹350 crores through non-convertible debentures and subordinated debt during the quarter. Earnings per share for the quarter was ₹1.72 compared to ₹9.71 in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760547051627,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Capital Services Completes ₹30 Crore Commercial Paper Redemption",
            "Summary": "Muthoot Capital Services Limited successfully redeemed its Commercial Paper with ISIN INE296G14503 on October 15, 2025, for ₹30 crore. The company confirmed payment to all beneficiaries through IndusInd Bank Limited, which served as the Issuing and Paying Agent. The redemption involved 600 securities held in NSDL accounts, with the record date set for October 14, 2025. IndusInd Bank certified that all necessary redemption payments were completed and requested NSDL to extinguish the commercial paper from investor accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1760525929581,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Promoters Create Non-Disposal Undertakings on Shareholdings for Debenture Issuance",
            "Summary": "Three promoters of Muthoot Capital Services Limited have created non-disposal undertakings on their shareholdings. Thomas John Muthoot encumbered 28,25,896 shares (17.18% of total share capital), Thomas George Muthoot encumbered 28,07,822 shares (17.07%), and Thomas Muthoot encumbered 27,05,524 shares (16.45%). The encumbrances were created in connection with a debenture trust deed for the company's issuance of 15,000 non-convertible debentures worth INR 150 crore, classified as green debt securities. Under the agreement, the promoters cannot dispose of their shareholdings in any manner that would reduce their collective stake below 51% of the company's shareholding. The debentures are partially guaranteed by GuarantCo Ltd, with Vardhman Trusteeship Private Limited serving as both debenture trustee and security trustee.",
            "Sentiment": "neutral",
            "PublishDate": 1760419749373,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Approves Rs 25 Crore Debenture Issue on Private Placement Basis",
            "Summary": "Muthoot Capital Services Limited's Debenture Issue and Allotment Committee approved the issue and allotment of unsecured, rated, subordinated listed, redeemable, non-convertible debentures worth up to Rs 25 crores on a private placement basis. The issue comprises 25,000 NCDs with a face value of Rs 10,000 each. The debentures will be listed on BSE Limited and carry a coupon rate of 10.75% per annum with monthly interest payments. The tenure is 65 months and 28 days, with a deemed allotment date of September 30, 2025, and maturity date of March 28, 2031. The principal will be repaid as a bullet payment at maturity.",
            "Sentiment": "neutral",
            "PublishDate": 1758776991648,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Completes ₹10 Crore Commercial Paper Redemption",
            "Summary": "Muthoot Capital Services Limited successfully redeemed its Commercial Paper worth ₹10 crore on September 23, 2025. The Commercial Paper with ISIN INE296G14560 matured as scheduled, with IndusInd Bank Limited serving as the Issuing and Paying Agent. The redemption involved 200 securities held in NSDL accounts, and all necessary payments were made to beneficiaries on the due date.",
            "Sentiment": "neutral",
            "PublishDate": 1758632949864,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Approves Director Continuation and Remuneration Changes at AGM",
            "Summary": "Muthoot Capital Services Limited announced the approval of two key business matters at its 31st Annual General Meeting held on September 19, 2025 through video conferencing. The company approved the continuation of Mr. Thomas Mathew as a Non-Executive Independent Director beyond age 75, and a variation in remuneration terms for Mrs. Tina Suzanne George, Whole-Time Director.",
            "Sentiment": "neutral",
            "PublishDate": 1758553040436,
            "Source": "corporate_governance"
        },
        {
            "Title": "Muthoot Capital Services Raises ₹20 Crores Through Commercial Paper Issuance",
            "Summary": "Muthoot Capital Services Limited issued Commercial Paper worth ₹20 crores with an 8.90% discount rate and 182-day tenure. The CP was allotted on September 16, 2025, with a maturity date of March 17, 2025, priced at 95.7508. The paper carries a CRISIL A1+ credit rating and was allotted to Rajarambapu Sahakari Bank Ltd. and Vasai Vikas Sahakari Bank Ltd. The issuance consists of 400 units with ISIN INE296G14586.",
            "Sentiment": "neutral",
            "PublishDate": 1758030936711,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Reports Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Muthoot Capital Services Limited published its unaudited financial results for the quarter ended June 30, 2025. The company reported total income from operations of ₹13,775.91 lakhs compared to ₹11,915.54 lakhs in the same quarter last year. Net profit before tax stood at ₹3,598.53 lakhs versus ₹3,110.18 lakhs in the previous year quarter. Net profit after tax was ₹2,871.08 lakhs compared to ₹2,651.63 lakhs in the corresponding quarter of the previous year. Total comprehensive income for the period was ₹3,961.08 lakhs. The company's paid-up ordinary share capital remained at ₹584.19 lakhs with a face value of ₹10 each. Basic and diluted earnings per share were ₹49.15 compared to ₹44.07 in the same quarter last year. The results were published in Business Standard and Mangalam newspapers as required by regulatory disclosure norms.",
            "Sentiment": "positive",
            "PublishDate": 1754553904238,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Capital Services Reports Loss in Q1, Appoints New Auditors",
            "Summary": "Muthoot Capital Services Limited reported a net loss of ₹466.99 lakhs for the quarter ended June 30, 2025, compared to a profit of ₹1,080.01 lakhs in the same quarter last year. Total revenue increased to ₹14,531.77 lakhs from ₹10,000.41 lakhs year-over-year. The company's expenses rose significantly, with impairment on financial instruments jumping to ₹2,667.60 lakhs from ₹486.09 lakhs in the previous year. The board approved the quarterly results and appointed M/s. K. Venkatachalam Aiyer & Co. as Tax Auditor for FY 2025-26. The company also recommended M/s. S. Sandeep & Associates as Secretarial Auditors, subject to shareholder approval. Additionally, the board recommended continuation of Mr. Thomas Mathew as Non-Executive Independent Director beyond age 75 and variation in remuneration terms for Whole-Time Director Ms. Tina Suzanne George. The company's 31st Annual General Meeting is scheduled for September 19, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754412770031,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Capital Services Raises ₹1.36 Billion Through Securitization",
            "Summary": "Muthoot Capital Services has successfully raised ₹1.36 billion through securitization. This funding mechanism allows the company to convert its assets into securities for capital raising purposes.",
            "Sentiment": "positive",
            "PublishDate": 1754053974068,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Capital Services Allots ₹100 Crore Non-Convertible Debentures at 10% Coupon Rate",
            "Summary": "Muthoot Capital Services Limited has allotted 10,000 Non-Convertible Debentures with a face value of ₹1,00,000 each, totaling ₹100 crores through private placement. The NCDs carry a 10.00% per annum coupon rate with monthly payments and have a 24-month tenure, maturing on July 29, 2027. The debentures are senior, secured, rated, listed, redeemable, taxable, and transferable, and will be listed on BSE Limited. The company has created a first ranking pari passu continuing charge over identified book debts and loan receivables, maintaining security cover of at least 1.1 times the redemption amount and accrued coupon. The allotment was approved by the Debenture Issue and Allotment Committee on July 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753777341105,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Raises ₹50 Crore Through Commercial Paper",
            "Summary": "Muthoot Capital Services has raised ₹50 crore through the issuance of commercial paper. Commercial paper is a short-term debt instrument used by companies to meet immediate funding requirements.",
            "Sentiment": "positive",
            "PublishDate": 1753371487491,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Capital Services Issues ₹50 Crore Commercial Paper with 8.50% Discount Rate",
            "Summary": "Muthoot Capital Services Limited issued Commercial Paper worth ₹50 crores on July 24, 2025. The commercial paper carries an 8.50% discount rate following FIMMDA convention, with a 60-day tenure maturing on September 22, 2025. The paper was issued at a price of 98.6220 and carries a CRISIL A1+ credit rating. The sole allottee is Visakhapatnam Steel Projects Employees Provident Fund, with 1,000 quantity units allocated.",
            "Sentiment": "neutral",
            "PublishDate": 1753370314881,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Approves ₹150 Crore Non-Convertible Debenture Issuance",
            "Summary": "Muthoot Capital Services Limited's Debenture Issue and Allotment Committee approved the issuance of Non-Convertible Debentures worth up to ₹150 crores through private placement. The debentures comprise 15,000 NCDs with a face value of ₹1,00,000 each, featuring a 24-month tenure and 10% annual coupon rate with monthly payments. The securities are senior, secured, rated, listed, and redeemable, with allotment scheduled for July 29, 2025, and maturity on July 29, 2027. The debentures will be listed on BSE Limited and are secured by a first ranking pari passu charge over the company's book debts and loan receivables, maintained at 1.1 times the redemption amount and accrued coupon.",
            "Sentiment": "neutral",
            "PublishDate": 1753355930618,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services: Approves ₹125 Crore NCD Issuance at 9.5% Coupon",
            "Summary": "Muthoot Capital Services approved issuance of ₹125 crore NCDs via private placement with 9.5% coupon rate, 24-month tenure, and maturity on July 15, 2027. The company reported ₹46.31 crore net profit for FY25 and ₹3,057.76 crore AUM as of March 31.",
            "Sentiment": "positive",
            "PublishDate": 1752069123000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Approves NCDs Issue Up to 1.25 Billion Rupees",
            "Summary": "Muthoot Capital Services has approved the issuance of Non-Convertible Debentures (NCDs) worth up to 1.25 billion rupees. This decision represents a significant corporate action that could potentially impact the company's financial structure and provide additional capital for its operations.",
            "Sentiment": "positive",
            "PublishDate": 1752065207000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Board Meeting Scheduled to Discuss Non-Convertible Debentures",
            "Summary": "Muthoot Capital has announced that its Board of Directors will convene for a meeting on July 9. The primary agenda for this meeting is to discuss the potential issuance of Non-Convertible Debentures (NCDs). This meeting suggests that the company may be considering raising funds through the issuance of debt securities.",
            "Sentiment": "neutral",
            "PublishDate": 1751553329000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services Approves NCD Issuance Up To 1 Billion Rupees",
            "Summary": "The Board of Directors of Muthoot Capital Services has approved the issuance of Non-Convertible Debentures (NCDs) for up to 1 billion rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital or refinancing existing debt.",
            "Sentiment": "positive",
            "PublishDate": 1750947481000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services Issues Commercial Paper",
            "Summary": "Muthoot Capital Services has issued commercial paper worth ₹200 million. Commercial paper is a short-term unsecured debt instrument typically used by companies for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1750862700000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services Issues Commercial Paper",
            "Summary": "Muthoot Capital Services has issued commercial paper valued at 250 million rupees. No further details about the terms, purpose, or duration of the commercial paper were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750690542000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services to Discuss Non-Convertible Debentures Issuance",
            "Summary": "Muthoot Capital Services has scheduled a meeting on June 26 to discuss the potential issuance of Non-Convertible Debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1750687511000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services to Issue Non-Convertible Debentures Worth ₹500 Million",
            "Summary": "Muthoot Capital Services has announced plans to issue Non-Convertible Debentures (NCDs) worth up to ₹500 million. The company intends to use the funds raised from this issuance for various financing purposes.",
            "Sentiment": "positive",
            "PublishDate": 1750056306000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services to Raise ₹500 Million via Private Placement of NCDs",
            "Summary": "Muthoot Capital Services has announced plans to raise up to ₹500 million through the issuance of Non-Convertible Debentures (NCDs) via a private placement. This move indicates the company's efforts to secure additional funding, potentially for business expansion or refinancing existing debt.",
            "Sentiment": "positive",
            "PublishDate": 1749622795000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services to Evaluate Non-Convertible Debenture Issuance",
            "Summary": "Muthoot Capital Services has announced that it will evaluate the issuance of Non-Convertible Debentures (NCDs) on June 11. This decision suggests the company is considering raising funds through debt securities.",
            "Sentiment": "neutral",
            "PublishDate": 1749221896000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services Board to Consider Private Placement of NCDs",
            "Summary": "Muthoot Capital Services has announced a board meeting scheduled for May 30. The primary agenda includes considering and approving the issuance of Non-Convertible Debentures (NCDs) on a private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1748356457000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services Issues 1 Billion Rupees Commercial Paper",
            "Summary": "Muthoot Capital Services has issued commercial paper worth 1 billion rupees. Commercial paper is a short-term unsecured promissory note issued by companies to raise funds for immediate financial needs. This issuance indicates that Muthoot Capital Services is seeking to bolster its short-term liquidity or fund operational requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1745281545000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services Issues Commercial Paper Worth 1 Billion Rupees",
            "Summary": "Muthoot Capital Services has announced the issuance of commercial paper valued at 1 billion rupees. Commercial paper is a short-term, unsecured debt instrument typically used by corporations for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1745246087000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services Issues Commercial Paper Worth 50 Million Rupees",
            "Summary": "Muthoot Capital Services has announced the issuance of commercial paper valued at 50 million rupees. Commercial paper is a short-term, unsecured debt instrument commonly used by corporations for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1744900908000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services to Consider NCD Issuance",
            "Summary": "Muthoot Capital Services has announced a board meeting scheduled for April 22 to consider and approve the issuance of Non-Convertible Debentures (NCDs) on a private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1744802381000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Capital Services Issues Commercial Papers Worth 650 Million Rupees",
            "Summary": "Muthoot Capital Services has announced the issuance of commercial papers aggregating to 650 million rupees. Commercial papers are short-term, unsecured debt instruments typically used by companies to meet short-term liabilities or working capital needs.",
            "Sentiment": "neutral",
            "PublishDate": 1742912970000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Issues Commercial Paper Worth 100 Million Rupees",
            "Summary": "Muthoot Capital Services has announced the issuance of commercial paper amounting to 100 million rupees. Commercial paper is a short-term debt instrument commonly used by corporations for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1742480807000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Issues 150 Million Rupees Commercial Paper",
            "Summary": "Muthoot Capital Services has issued commercial paper worth 150 million rupees. Commercial paper is a short-term, unsecured debt instrument typically used by corporations for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1741871343000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Achieves Rs 3000 Crore AUM Milestone",
            "Summary": "Muthoot Capital Services Limited has announced reaching a significant milestone of Rs 3000 crore in Assets Under Management (AUM). This achievement indicates substantial growth in the company's financial portfolio and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1741758157000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Issues 100 Million Rupee Commercial Paper",
            "Summary": "Muthoot Capital Services has issued commercial paper worth 100 million rupees. Commercial paper is a short-term debt instrument used by companies to raise funds for immediate financial needs.",
            "Sentiment": "neutral",
            "PublishDate": 1741651362000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Issues Commercial Paper Worth 100 Million Rupees",
            "Summary": "Muthoot Capital Services has announced the issuance of commercial paper valued at 100 million rupees. Commercial paper is a short-term, unsecured debt instrument commonly used by corporations for financing immediate cash flow needs.",
            "Sentiment": "neutral",
            "PublishDate": 1741616862000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Issues Commercial Paper Worth 200 Million Rupees",
            "Summary": "Muthoot Capital Services has issued commercial paper amounting to 200 million rupees. Commercial paper is a short-term, unsecured debt instrument typically used by corporations for financing short-term liabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1741361803000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Raises 987.5 Million Rupees Through Securitization",
            "Summary": "Muthoot Capital Services has successfully raised 987.5 million rupees through a securitization transaction. Securitization is a financial process where a company pools its assets (such as loans or receivables) and sells them as securities to investors. This move likely aims to improve the company's liquidity and potentially fund further business operations or expansion.",
            "Sentiment": "positive",
            "PublishDate": 1741047085000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Raises 987.5 Million Rupees Through Securitization",
            "Summary": "Muthoot Capital Services has successfully raised 987.5 million rupees through a securitization transaction. This financial move involves the company converting a pool of its assets (likely loans or receivables) into marketable securities, which are then sold to investors. Securitization is a common method for companies to raise capital and manage risk.",
            "Sentiment": "positive",
            "PublishDate": 1741009480000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Capital Services Completes Securitization Transaction",
            "Summary": "Muthoot Capital Services has successfully completed a securitization transaction, raising a total of 539.8 million rupees in two separate tranches. This financial move indicates the company's efforts to improve liquidity and potentially fund further business operations or expansion.",
            "Sentiment": "positive",
            "PublishDate": 1738339127000,
            "Source": "corporate_action"
        }
    ]
}