{
    "Symbol": "MUTHOOTFIN",
    "ISIN": "INE414G01012",
    "News": [
        {
            "Title": "Muthoot Finance Q3 FY26 Results Call on Feb 12",
            "Summary": "Muthoot Finance announces Q3 FY26 results conference call scheduled for February 12, 2026 at 5:00 PM IST, with senior management participation including MD George Alexander Muthoot.",
            "Sentiment": "neutral",
            "PublishDate": 1770476982800,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Finance Settles USD 600 Million Senior Notes",
            "Summary": "Muthoot Finance Limited announces settlement of USD 600 million 5.75% Senior Secured Notes due 2030 under its USD 4 billion Global Medium Term Note Programme, with listing on NSE IFSC Limited.",
            "Sentiment": "positive",
            "PublishDate": 1770297912916,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Finance schedules USD bond investor calls",
            "Summary": "Muthoot Finance announces investor calls on January 28, 2026 across Asia, EMEA and US for benchmark USD senior secured bond offering with 4.5 years tenor under its $4 billion GMTN Programme.",
            "Sentiment": "positive",
            "PublishDate": 1769577100361,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Finance Board Meet Set for Feb 12, 2026",
            "Summary": "Muthoot Finance Limited has scheduled a Board of Directors meeting on February 12, 2026, to consider and approve unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769509155183,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Finance injects equity into subsidiary",
            "Summary": "Muthoot Finance allots 3.25 lakh equity shares in Muthoot Money to strengthen capital base and fund growth initiatives. Subsidiary's turnover surged from ₹446.88 million to ₹4,299.43 million over three years.",
            "Sentiment": "positive",
            "PublishDate": 1767103434467,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Raises Muthoot Finance Target to ₹4,385",
            "Summary": "Morgan Stanley upgraded Muthoot Finance price target from ₹4,050 to ₹4,385, maintaining overweight rating on robust gold loan growth expectations and raised FY26-FY28 earnings estimates.",
            "Sentiment": "positive",
            "PublishDate": 1767066658806,
            "Source": "stocks"
        },
        {
            "Title": "Muthoot Finance hits record high on gold rally surge",
            "Summary": "Muthoot Finance shares surge 81% in 2025, marking best year since 2011 listing as global gold prices hit record highs. Company reports 90% profit growth with AUM reaching ₹1.24 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1766588152751,
            "Source": "stocks"
        },
        {
            "Title": "Muthoot Finance Reports 88% Surge in Standalone Profit, Upgrades Gold Loan Growth Guidance",
            "Summary": "Muthoot Finance delivered strong quarterly results with standalone profit after tax jumping 88% year-on-year to Rs. 4,391 crores for the half-year, while loan assets under management grew 47% to Rs. 1,32,305 crores. The company upgraded its gold loan growth guidance from 50% to 30%-35% for financial year 2026, citing favorable regulatory changes, higher gold prices, and tighter norms for unsecured credit as key growth drivers.",
            "Sentiment": "positive",
            "PublishDate": 1763468577491,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Finance Q2 Profit Jumps 88% to Rs 2,345 Crore on Strong Gold Loan Demand",
            "Summary": "Muthoot Finance reported an 88% surge in quarterly profit to Rs 2,345 crore driven by strong gold loan demand, with loan book expanding 42% to Rs 1,47,673 crore. The company upgraded its FY26 gold loan growth guidance to 30-35% from 15% and approved fundraising of up to Rs 35,000 crore via non-convertible debentures.",
            "Sentiment": "positive",
            "PublishDate": 1763119989272,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Finance Board Approves Rs 35,000 Crore Fundraising Through Non-Convertible Debentures",
            "Summary": "Muthoot Finance Limited's Board of Directors approved fundraising up to Rs 35,000 crores by issuing Redeemable Non-Convertible Debentures through private placement in multiple tranches. The debentures are proposed to be listed on BSE or NSE, with specific terms including coupon rates, maturity dates, and security details to be decided by the Board or its Committee at the time of allotment.",
            "Sentiment": "positive",
            "PublishDate": 1763054560952,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Finance Targets 15-17% AUM Growth Through Digital Expansion and Branch Network",
            "Summary": "Muthoot Finance outlined its growth strategy targeting consolidated AUM CAGR of 15-17% driven by gold loan and microfinance segments, while expanding branch network by 300+ locations. The company plans to launch digital gold and neo banking solutions alongside cost optimization initiatives and portfolio diversification efforts.",
            "Sentiment": "positive",
            "PublishDate": 1763051600766,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Approves Rs. 500 Crores Equity Infusion in Subsidiary Muthoot Money Limited",
            "Summary": "Muthoot Finance Limited's Board approved an additional equity infusion of Rs. 500 crores in its wholly-owned subsidiary Muthoot Money Limited, a Non-Banking Financial Company. The infusion aims to strengthen the capital base and improve capital adequacy ratio of the subsidiary, which reported turnover of Rs. 429.94 millions in 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1763049426403,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Finance Reports Banks Reducing Gold Loan Exposures Due to Price Volatility",
            "Summary": "Muthoot Finance has indicated that banks are reducing their gold loan exposures due to fluctuations in gold prices. This development affects the gold loan sector where price volatility is influencing lending institutions' risk management strategies.",
            "Sentiment": "neutral",
            "PublishDate": 1761192194080,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Completes $150 Million Senior Secured Notes Settlement Under Global Programme",
            "Summary": "Muthoot Finance Limited completed the settlement of USD 150 million 6.375% Senior Secured Notes due 2030, which will be consolidated with existing USD 600 million notes under their USD 4 billion Global Medium Term Note Programme. The notes carry a 6.375% coupon rate with an average maturity of 3.88 years and settlement date of October 14, 2025. The notes mature on March 2, 2030 with five amortization payments beginning March 2029. Interest payments are scheduled for March 2 and September 2 each year starting March 2026. The issue was priced at 101.75 with a 5.863% yield to average life. The notes are secured by first ranking pari passu charge over current assets, receivables including gold loan receivables. The notes are listed on NSE IFSC Limited and proceeds will be used for onward lending and activities permitted under ECB Guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1760680742326,
            "Source": "stock"
        },
        {
            "Title": "ED Questions Muthoot Group Managing Director in Money-Laundering Probe",
            "Summary": "The Enforcement Directorate interrogated George Alexander Muthoot, Managing Director of Kerala-based Muthoot Group, at their Kochi zonal office in connection with a money-laundering investigation related to an investor fraud case.",
            "Sentiment": "negative",
            "PublishDate": 1760153018538,
            "Source": "corporate_governance"
        },
        {
            "Title": "Muthoot Finance Raises $600 Million Through International Bond Markets",
            "Summary": "Muthoot Finance, India's largest gold loan NBFC, raised $600 million through an External Commercial Borrowing issuance. The proceeds will be used for lending activities to extend additional credit to customers across India. The bonds were priced at 6.375% with a 4.5-year tenor and carry ratings of BB+ by S&P and Ba1 by Moody's. Investor participation was geographically diverse, with 49% from the US, 36% from Asia, and 15% from EMEA. Fund and asset managers represented 91% of subscriptions. This marks the fifth drawdown under Muthoot's $2 billion Global Medium-Term Note Programme since May 2024, completing the full targeted amount. The issuance follows recent rating upgrades by S&P Global and Moody's. Deutsche Bank and Standard Chartered served as Joint Global Coordinators and Bookrunners.",
            "Sentiment": "positive",
            "PublishDate": 1757923137402,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Injects Rs. 2,000 Crore into Housing Finance Subsidiary",
            "Summary": "Muthoot Finance has completed a Rs. 2,000 crore equity infusion into its wholly-owned subsidiary Muthoot Homefin. The capital injection is aimed at strengthening the subsidiary's capital base.",
            "Sentiment": "positive",
            "PublishDate": 1757506623490,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Settles USD 600 Million Senior Secured Notes Due 2030",
            "Summary": "Muthoot Finance has settled USD 600 million worth of 6.375% Senior Secured Notes that were due in 2030. These notes were issued under the company's $2 billion Global Medium Term Note Programme.",
            "Sentiment": "neutral",
            "PublishDate": 1756896314249,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Injects ₹499.99 Crore into Subsidiary Muthoot Money",
            "Summary": "Muthoot Finance has infused ₹499.99 crore as equity into its subsidiary Muthoot Money. The capital injection is aimed at strengthening the subsidiary's capital base.",
            "Sentiment": "positive",
            "PublishDate": 1756390591096,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Prices USD 600 Million Notes at 6.375% Under Global Medium Term Note Programme",
            "Summary": "Muthoot Finance Limited has priced USD 600 million worth of 6.375% Fixed Rate Notes due 2030 under its USD 2 billion Global Medium Term Note Programme. The Finance Committee of the Board approved the pricing, tenure and terms on August 26, 2025. The notes will mature on March 2, 2030 with an average maturity of 4 years and will be issued at 99.996% of face value. The company will make five amortization payments starting March 2029, with interest payments scheduled for March 2 and September 2 each year. The notes are secured by a first ranking pari passu charge over current assets, receivables including gold loan receivables. Proceeds will be used for onward lending activities in compliance with RBI's External Commercial Borrowing Guidelines and Foreign Exchange Management Regulations. The notes are proposed to be listed on NSE IFSC Limited with closing and settlement expected on September 2, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756231253294,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Finance Injects ₹200 Crore into Housing Finance Unit for Multi-City Expansion",
            "Summary": "Muthoot Finance has infused ₹200 crore into its wholly-owned housing finance subsidiary, Muthoot Homefin (India) Ltd, to expand operations into more than 250 cities. The capital injection aims to scale the housing finance unit's assets under management more than fourfold over the next five years and strengthen its presence in affordable housing, particularly in tier-II and tier-III markets. Muthoot Homefin's disbursements have grown nearly six times in the last two years, while its assets under management doubled to ₹3,096 crore. The funds will be used to expand the lending portfolio, digital infrastructure, and workforce. Managing Director George Alexander Muthoot emphasized targeting tier-II and tier-III cities for housing growth, focusing on first-time home buyers and self-employed customers.",
            "Sentiment": "positive",
            "PublishDate": 1756120565145,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Plans USD Bond Offering Under Global Medium Term Note Programme",
            "Summary": "Muthoot Finance Limited announced plans for a potential USD-denominated senior secured bond offering under its Global Medium Term Note Programme, subject to market conditions. The company has appointed Deutsche Bank and Standard Chartered Bank as Joint Global Coordinators and Joint Bookrunners for the potential issuance. The benchmark sized 144A/Regulation S USD bond offering features a 4.5 years door-to-door tenor and 4 years weighted average life. The notes are expected to be rated BB+ by S&P, while Muthoot Finance holds ratings of Ba1/Stable by Moody's, BB+/Stable by S&P, and BB+/Stable by Fitch. A fixed income investor conference call was arranged for August 25, 2025. The proceeds will be used for onward lending and other activities permitted under ECB Guidelines in accordance with RBI approvals and applicable laws.",
            "Sentiment": "neutral",
            "PublishDate": 1756095685655,
            "Source": "stock"
        },
        {
            "Title": "Fitch Upgrades Muthoot Finance Long-Term Rating to 'BB+' with Stable Outlook",
            "Summary": "Fitch Ratings has upgraded Muthoot Finance's long-term rating to 'BB+' and assigned a stable outlook to the company.",
            "Sentiment": "positive",
            "PublishDate": 1755874311989,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Reports Record AUM of ₹1.2 Lakh Crores with 90% Jump in Standalone PAT",
            "Summary": "Muthoot Finance achieved record standalone assets under management of ₹1,20,031 crores driven by 40% year-on-year growth in gold loans. The company reported 90% year-on-year growth in standalone profit after tax to ₹2,046 crores for the quarter ended June 30, 2025. Gold loan AUM grew 10% quarter-on-quarter to ₹10,238 crores, while yield expanded 100 basis points quarter-on-quarter to 19.56% due to NPA recoveries and ARC collections. The company reduced NPAs by ₹700 crores quarter-on-quarter and opened 22 new branches during the period. Subsidiaries showed strong performance with Muthoot Home Finance AUM growing 41% year-on-year to ₹3,096 crores and Muthoot Money AUM surging 202% year-on-year to ₹5,000 crores. Management expressed optimism about sustaining growth through FY26, citing favorable new RBI guidelines that allow higher loan-to-value ratios of 85% for loans up to ₹2.5 lakhs. The company's market capitalization crossed ₹1 trillion during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755607166360,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Finance Projects 15% Loan Growth for FY26 Amid Strong Gold Loan Demand",
            "Summary": "Muthoot Finance expects 15% loan growth for FY26, driven by strong demand for gold loans, rising gold prices, and favorable regulatory changes. Managing Director George Alexander Muthoot noted that tighter unsecured credit availability from banks and NBFCs has pushed customers toward gold loans. The company has historically exceeded its 15% guidance, achieving 40% growth last year and 25% in the prior year. RBI's simplified norms for gold loans up to Rs 2.5 lakh have also supported growth. In Q1FY26, Muthoot Finance reported record quarterly consolidated net profit of Rs 1,974 crore, up 65% year-on-year. Consolidated loan AUM reached Rs 1,33,938 crore, rising 37% year-on-year, while gold loan AUM hit Rs 1,13,194 crore with 40% growth. Interest income increased 45% to Rs 6,288 crore. Shares closed 9.75% higher at Rs 2,754 on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1755314519489,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Finance Management Projects 15-20% Growth",
            "Summary": "Muthoot Finance management has projected growth of 15-20% ahead during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1755144511050,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Sees Two Large Block Trades Worth Rs. 245.39 Crores",
            "Summary": "Muthoot Finance witnessed two significant block trades on NSE. The first transaction involved 559,897 shares worth Rs. 154.58 crores at Rs. 2760.80 per share. The second block trade comprised 328,922 shares valued at Rs. 90.81 crores at the same price of Rs. 2760.80 per share. Combined, both transactions totaled approximately 888,819 shares worth Rs. 245.39 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1755143465634,
            "Source": "order&deals"
        },
        {
            "Title": "Muthoot Finance Plans Loan Book Growth Through Gold Loans and Digital Expansion",
            "Summary": "Muthoot Finance is targeting steady expansion of its loan book, focusing on gold loan demand and digital initiatives. The company is diversifying into microfinance and housing finance segments. The growth strategy is supported by strong asset quality and an extensive branch network, aimed at achieving sustainable profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1755101281916,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance Reports Record Q1 FY26 Results with 90% Jump in Standalone Profit",
            "Summary": "Muthoot Finance announced its highest-ever quarterly standalone profit of Rs 2,046 crores for Q1 FY26, marking a 90% year-on-year increase from Rs 1,079 crores in Q1 FY25. The company's standalone loan assets under management reached a record Rs 1,20,031 crores, up 42% year-on-year. Gold loan assets grew 40% to Rs 1,13,194 crores. Consolidated profit after tax increased 65% to Rs 1,974 crores, while consolidated loan assets under management rose 37% to Rs 1,33,938 crores. The board approved additional equity infusions of Rs 500 crores in Muthoot Money Limited and Rs 200 crores in Muthoot Homefin (India) Limited. The company's market capitalization crossed Rs 1 trillion during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755082436774,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Finance Sees Rs. 104.30 Crore Block Trade on NSE",
            "Summary": "Muthoot Finance Ltd. witnessed a block trade worth Rs. 104.30 crores on the National Stock Exchange. The transaction involved approximately 395,748 shares at a price of Rs. 2,635.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754291509409,
            "Source": "order&deals"
        },
        {
            "Title": "Muthoot Finance Appoints Thomas Kokkoth as Chief Risk Officer for Three Years",
            "Summary": "Muthoot Finance Limited has appointed Thomas Kokkoth as Chief Risk Officer for a three-year term beginning August 6, 2025. The appointment was approved by the Board of Directors on July 28, 2025. Kokkoth brings over 43 years of banking experience with Federal Bank Limited from January 1978 to November 2021, and has served as Internal Ombudsman at Muthoot Finance since May 2022. His experience includes 11 years in senior management roles, heading compliance risk assurance departments, managing asset portfolios, and leading regional offices. He has also completed training programs at institutions including IIM Ahmedabad and Reserve Bank of India.",
            "Sentiment": "positive",
            "PublishDate": 1753706493200,
            "Source": "corporate_governance"
        },
        {
            "Title": "Muthoot Finance Faces Rs 1.52 Crore GST Demand from Kerala Tax Department",
            "Summary": "Muthoot Finance received a tax demand order from the Kerala State GST Department totaling Rs 1.52 crore, comprising Rs 54 lakh in tax, Rs 44.22 lakh in interest, and Rs 54 lakh in penalties. The demand relates to allegations that corporate guarantees provided by the company to its subsidiary are taxable under GST Act. The tax authority rejected the company's objections regarding misclassification, valuation principle, and non-utilization of the guarantee. Muthoot Finance disputes the allegations and plans to file an appeal against the order. The company states there will be no material impact on its financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1753192032027,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Finance: Conservative Approach to New LTV Ratios",
            "Summary": "Muthoot Finance plans to maintain conservative loan-to-value (LTV) ratios despite RBI raising it to 85% for loans up to Rs 2.5 lakh. The company's actual LTV is currently 58%. They expect to implement new gold loan norms from April 1, 2026, and anticipate only a 50-basis-point increase in loan growth due to RBI's repo rate and CRR cut.",
            "Sentiment": "neutral",
            "PublishDate": 1749518177000,
            "Source": "normal_news"
        },
        {
            "Title": "Muthoot Finance Reports Majority of Loans Below ₹2.5 Lakhs",
            "Summary": "George Alexander of Muthoot Finance has stated that over 80% of their loans are below ₹2.5 lakhs. This information provides insight into the company's loan portfolio, suggesting a focus on smaller loan amounts.",
            "Sentiment": "neutral",
            "PublishDate": 1749446472000,
            "Source": "default"
        },
        {
            "Title": "RBI Eases Gold Loan Appraisal Requirements",
            "Summary": "The Reserve Bank of India (RBI) Governor has announced that credit appraisals will not be required for gold loans up to ₹2.5 lakhs. This decision is likely to impact gold loan providers such as Muthoot Finance.",
            "Sentiment": "positive",
            "PublishDate": 1749193358000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Finance: Shares Surge on Potential Gold Loan Exemption",
            "Summary": "Muthoot Finance shares rose 6.15% after the Finance Ministry suggested exempting gold loans under Rs 2 lakh from RBI's proposed guidelines. The ministry recommended deferring and softening the rules for small borrowers, with potential implementation from January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1748584960000,
            "Source": "normal_news"
        },
        {
            "Title": "Muthoot Finance: 60% of Gold Loan Book Up to Rs 3 Lakhs",
            "Summary": "According to a report on CNBC TV18, Muthoot Finance has revealed that 60% of its gold loan book consists of loans up to Rs 3 lakhs. This information provides insight into the company's loan portfolio composition, focusing on smaller loan amounts.",
            "Sentiment": "neutral",
            "PublishDate": 1748577921000,
            "Source": "default"
        },
        {
            "Title": "DFS Suggests Excluding Small Gold Loan Borrowers from Proposed Norms",
            "Summary": "The Department of Financial Services (DFS) has proposed that borrowers with gold loans below Rs 2 lakh may be exempted from the requirements of upcoming gold loan regulations. This suggestion specifically relates to the proposed directions for gold loan norms.",
            "Sentiment": "neutral",
            "PublishDate": 1748577286000,
            "Source": "default"
        },
        {
            "Title": "Tamil Nadu Finance Minister Urges RBI to Reconsider Gold Loan Restrictions",
            "Summary": "The Finance Minister of Tamil Nadu has called on the Reserve Bank of India (RBI) to reconsider newly imposed restrictions on gold loans. These restrictions appear to be affecting Muthoot Finance, a prominent gold loan company. The minister's intervention suggests that the new regulations may have significant implications for the gold loan sector in the state.",
            "Sentiment": "negative",
            "PublishDate": 1747901698000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Finance Maintains 15% YoY Growth Guidance",
            "Summary": "Muthoot Finance has announced that it is maintaining its year-over-year guidance of 15% growth. The company stated that this guidance may be subject to revision after the second quarter, as per the latest concall update.",
            "Sentiment": "positive",
            "PublishDate": 1747280013000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Finance: Analysts Divided on Stock Prospects Post-Earnings",
            "Summary": "Muthoot Finance reported Q4 results, maintaining 15% gold loan growth guidance for FY26. Analysts are split: Jefferies and Bernstein are bullish, citing asset quality and growth potential, while Morgan Stanley remains neutral, warning of gold price risks. The company sees increased market share and believes RBI guidelines target newer players.",
            "Sentiment": "neutral",
            "PublishDate": 1747277272000,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Finance Reports Strong Q4 FY25 Results",
            "Summary": "Muthoot Finance announced its Q4 FY25 financial results, showing significant year-over-year growth. Net profit increased to 15.1 billion rupees from 10.56 billion rupees in the previous year. Revenue rose to 48.54 billion rupees from 34.1 billion rupees. The company also reported improved asset quality, with Gross Non-Performing Assets (GNPA) decreasing to 1.17% in FY25 from 1.88% in FY24, and Net Non-Performing Assets (NNPA) reducing to 0.46% from 0.57% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1747267830000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Finance: Q4 Profit Soars 43% on Strong Gold Loan Demand",
            "Summary": "Muthoot Finance reported a 42.7% year-on-year increase in Q4 net profit to ₹1,508 crore, driven by high gold prices boosting loan demand. Standalone loan assets under management grew 43% to ₹1.09 lakh crore. Net Interest Income rose 36% to ₹2,904 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747225468000,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Finance Reports Strong FY25 Performance and FY26 Guidance",
            "Summary": "Muthoot Finance announced impressive financial results for FY25 and Q4. The company achieved its highest-ever gold loan AUM of Rs. 1,02,956 crores as of March 31, 2025, with a 41% year-over-year growth. Gross NPA improved to 1.17% in FY25 from 1.88% in FY24, while Net NPA decreased to 0.46% from 0.57%. Q4 revenue increased to 48.54 billion rupees from 34.1 billion year-over-year, and net profit rose to 15.1 billion rupees from 10.56 billion. The company also provided guidance for FY26, projecting a minimum AUM growth of 15%.",
            "Sentiment": "positive",
            "PublishDate": 1747224422000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Finance: Q4 Results Announcement Scheduled for May 14",
            "Summary": "Muthoot Finance Ltd. will announce Q4 and FY25 results on May 14. Board meeting scheduled to review and approve financial results. Trading window closed from March 31 until 48 hours post-result disclosure. Earnings call set for May 14 at 5 p.m. in Kochi.",
            "Sentiment": "neutral",
            "PublishDate": 1747109847000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Finance: Approves ₹26 Per Share Interim Dividend, Increases Borrowing Powers",
            "Summary": "Muthoot Finance approves an interim dividend of ₹26 per share for FY 2024-25. The record date is set for April 25, 2025. The company also recommends increasing its borrowing powers to ₹2 Lakh Crores and appoints George Joseph as an Independent Director.",
            "Sentiment": "positive",
            "PublishDate": 1745226701000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Finance: Board Approves ₹26 Interim Dividend for FY25",
            "Summary": "Muthoot Finance's board has approved an interim dividend of ₹26 per share for FY 2024-25, to be paid within 30 days. The record date is yet to be determined. Shares are trading 4.57% higher at ₹2,208.",
            "Sentiment": "positive",
            "PublishDate": 1745220263000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Finance Increases Borrowing Limit to Rs. 2 Trillion",
            "Summary": "Muthoot Finance has announced an increase in its borrowing limit to Rs. 2 trillion (2 lakh crore). This decision indicates the company's plans for potential expansion or increased lending activities. The higher borrowing limit provides Muthoot Finance with greater financial flexibility to support its business operations and growth strategies.",
            "Sentiment": "positive",
            "PublishDate": 1745219137000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Finance Approves Interim Dividend of Rs. 26",
            "Summary": "Muthoot Finance has approved the payment of an interim dividend of Rs. 26 per share to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1745219105000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Finance: Shares Plunge 8% as RBI Proposes Stricter Gold Loan Norms",
            "Summary": "Muthoot Finance shares dropped 8.13% to ₹1,965, a 3-month low, following RBI's draft guidelines for standardizing gold loan procedures. The new norms require uniform documentation, standardized gold evaluation, and transparent communication with borrowers. Despite the market reaction, some industry experts believe these changes could boost gold loan demand.",
            "Sentiment": "negative",
            "PublishDate": 1744347846000,
            "Source": "normal_news"
        }
    ]
}