{
    "Symbol": "MUTHOOTMF",
    "ISIN": "INE046W01019",
    "News": [
        {
            "Title": "Muthoot Microfin seeks ₹2000 crore debenture approval",
            "Summary": "Muthoot Microfin Limited issues postal ballot notice seeking shareholder approval for issuance of ₹2000 crores worth debentures through private placement. E-voting period runs from February 13 to March 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770897574298,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Microfin Q3FY26 Results Show Strong Recovery",
            "Summary": "Muthoot Microfin reports significant improvement in Q3FY26 with profit after tax surging 1543.97% YoY to ₹624.4 crore, driven by reduced impairment costs and improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1770652119045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Microfin Allots ₹100 Cr NCDs, Issues ₹40 Cr",
            "Summary": "Muthoot Microfin's committee approved allotment of 10,000 NCDs worth ₹100 crores in two series and issuance of 4,000 NCDs worth ₹40 crores through private placement on January 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769773128238,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Microfin Q3FY26 earnings call on Feb 10",
            "Summary": "Muthoot Microfin schedules investor conference call for February 10, 2026 at 09:30 AM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769601451997,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Microfin Approves ₹150 Cr NCD Issuance",
            "Summary": "Muthoot Microfin's committee approved issuance of Non-Convertible Debentures worth ₹150 crores through private placement, while cancelling a previously announced ₹150 crore tranche.",
            "Sentiment": "neutral",
            "PublishDate": 1768920859146,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Microfin Pays ₹40.08L EPF Penalty",
            "Summary": "Muthoot Microfin Limited settles EPF penalty of ₹40.08 lakhs for delayed provident fund remittances, primarily related to COVID-19 lockdown period advances to employees.",
            "Sentiment": "neutral",
            "PublishDate": 1767966463734,
            "Source": "stocks"
        },
        {
            "Title": "Muthoot Microfin CEO: Bad days for microfinance over",
            "Summary": "Sadaf Sayeed, CEO of Muthoot Microfin, declares microfinance sector recovery complete with 15% AUM growth expected in FY26, credit costs dropping below 4%, and increased bond market funding of ₹2,000 crore planned.",
            "Sentiment": "positive",
            "PublishDate": 1767954752444,
            "Source": "stocks"
        },
        {
            "Title": "Muthoot Microfin Allots ₹75 Cr NCDs at 9.70%",
            "Summary": "Muthoot Microfin Limited has successfully allotted 75,000 senior secured NCDs worth ₹75 crores with 9.70% annual coupon rate and 23-month maturity, completing Series B debentures issuance.",
            "Sentiment": "positive",
            "PublishDate": 1767687071195,
            "Source": "co_actions_results"
        },
        {
            "Title": "Muthoot Microfin Individual Loan AUM Crosses ₹1,000 Cr",
            "Summary": "Muthoot Microfin achieves major milestone with Individual Loan AUM crossing ₹1,000 crore while overall AUM surpasses ₹13,000 crore, reflecting diversified lending portfolio growth.",
            "Sentiment": "positive",
            "PublishDate": 1766981108980,
            "Source": "stocks"
        },
        {
            "Title": "Muthoot Microfin Corrects Debenture Issue Details, Approves Rs 450 Crore NCD Issuance",
            "Summary": "Muthoot Microfin issued a corrigendum to correct typographical errors in its earlier announcement regarding the outcome of its Debenture Issue and Allotment Committee meeting held on November 27, 2025. The committee approved the issuance of Non-Convertible Debentures worth Rs 450 crores on private placement basis, comprising two separate NCD issues - one for Rs 150 crores with face value of Rs 10,000 each and another for Rs 300 crores with face value of Rs 1,00,000 each.",
            "Sentiment": "neutral",
            "PublishDate": 1764755031787,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Allots Rs 750 Crore Non-Convertible Debentures",
            "Summary": "Muthoot Microfin Limited has allotted 75,000 senior secured non-convertible debentures worth Rs 750 crores with a face value of Rs 10,000 each on private placement basis. The Series A debentures carry a 9.70% annual coupon rate with monthly payment schedule and 24-month tenure maturing on December 03, 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1764751540528,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin to Raise Rs 450 Crores Through Non-Convertible Debentures",
            "Summary": "Muthoot Microfin Limited announced a Rs 450 crore capital raise through secured, rated, listed non-convertible debentures with coupon rates between 9.70% and 9.95% per annum. The funds will support onward lending, working capital needs, debt repayment/refinancing, and general corporate purposes, strengthening the company's medium-term capital base and lending capacity in the microfinance sector.",
            "Sentiment": "positive",
            "PublishDate": 1764306975719,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin to Consider NCD Fundraising on November 27",
            "Summary": "Muthoot Microfin will deliberate on raising funds through Non-Convertible Debenture (NCD) issuance during a meeting scheduled for November 27. The potential fundraising initiative could provide the microfinance company with additional capital for its operations and expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1763983803903,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Reports Strong Q2 Performance with 28% Disbursement Growth and Declining Credit Costs",
            "Summary": "Muthoot Microfin Limited reported significant improvement in quarterly results with disbursements growing 28.1% and credit costs declining to 3.6% from 9.4% in the previous financial year. The company's gross NPAs reduced from 4.85% to 4.61%, while net NPAs improved from 1.58% to 1.41%. Provision coverage increased to 70.4% from 68%. The company achieved quarterly profit of INR 30.5 crores compared to INR 6 crores in Q1, with total comprehensive income of INR 55.9 crores. Net interest margins reached 11.9%, up from 11.5% in the previous quarter. The company is diversifying its portfolio with Individual Loans (INR 468 crores portfolio), Micro LAP (INR 9 crores), and Gold Loans (INR 7 crores). AUM stands at INR 12,558 crores with 10% quarter-on-quarter growth. Cost of funds declined to 10.6% from 11.02%. CRISIL upgraded the company's outlook from stable to positive. The company maintains guidance of achieving 2% ROA and expects credit costs to decline further in coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1762897055580,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Microfin Raises ₹150 Crores Through Secured Debentures",
            "Summary": "Muthoot Microfin has allocated 15,000 secured debentures worth ₹150 crores. The debentures carry an annual interest rate of 9.90% and have maturity periods ranging from 24 to 36 months. This fundraising initiative provides the microfinance company with medium-term capital through debt instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1762842819851,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Microfin Reports Q2 FY26 Results with 28% QoQ Disbursement Growth",
            "Summary": "Muthoot Microfin Limited announced its quarterly results with disbursements growing 28.1% quarter-on-quarter to Rs. 2,273.9 crores in Q2 FY26. The company reported profit after tax of Rs. 30.5 crores for the quarter, up 393.6% sequentially. Gross loan portfolio reached Rs. 12,558.8 crores with 33.6 lakh active customers across 1,718 branches. Asset quality improved with gross NPA declining to 4.61% from 4.85% in the previous quarter, while net NPA stood at 1.41%. Net interest margin was 11.9%, up 43 basis points quarter-on-quarter. Capital adequacy ratio improved to 28.91%. The company launched gold loans and micro-LAP products as part of its diversification strategy. CRISIL revised outlook on long-term facilities to positive while reaffirming ratings at CRISIL A-. The board approved amendments to debenture trust deed clauses and registration under Credit Guarantee Fund for Micro Units.",
            "Sentiment": "positive",
            "PublishDate": 1762355151435,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Microfin Reports 50% Decline in Net Profit for Q2",
            "Summary": "Muthoot Microfin reported a net profit of 305 million rupees for Q2, representing a significant decrease from 616 million rupees in the same period last year. The company's revenue also declined to 5.76 billion rupees compared to 6.62 billion rupees year-over-year. Both key financial metrics showed downward trends for the microfinance company.",
            "Sentiment": "negative",
            "PublishDate": 1762349036840,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Microfin Allots ₹750 Crore Non-Convertible Debentures",
            "Summary": "Muthoot Microfin Limited has allotted 7,500 rated, unsubordinated, secured, listed, taxable, transferable, redeemable non-convertible debentures (NCDs) through private placement. Each debenture has a face value of ₹1 lakh, totaling an aggregate nominal value of ₹750 crores. The debentures carry a coupon rate of 9.80% per annum with monthly payment schedule and have a tenure of 24 months, maturing on November 4, 2027. The debentures are secured by a first ranking charge on identified receivables, with hypothecated securities maintained at 1.1 times the outstanding debenture amount. The allotment was approved by the company's Debenture Issue and Allotment Committee and falls within limits previously approved by the Board of Directors in May 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762248188361,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Issues Debentures Worth 3.75 Billion Rupees",
            "Summary": "Muthoot Microfin has issued two tranches of debentures totaling 3.75 billion rupees. The company issued 12,500 debentures valued at 1.25 billion rupees and 25,000 debentures worth 2.50 billion rupees. This debt issuance provides the microfinance company with additional capital for its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1761740300013,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Microfin Plans Rs 375-Crore Bond Issue to HNIs",
            "Summary": "Muthoot Microfin plans to raise Rs 375 crore through non-convertible debentures privately placed with high net worth individuals, with a likely coupon rate of 9.5%. This follows the company's recent $15 million fundraise from Swiss impact investor Blue Orchard. The bond issue is part of the microfinance company's resource diversification strategy as stability returns to the sector. The plan will be presented to the board on October 29. The Kerala-headquartered NBFC-MFI may also raise another $35 million through external commercial borrowing later this fiscal. The company has Rs 12,253 crore in assets under management and maintains a Rs 1,500 crore annual fundraising plan. CareEdge Global has rated the company's ECB as 'BB-/stable', indicating moderate default risk while noting comfortable capitalization and diversified resource profile.",
            "Sentiment": "positive",
            "PublishDate": 1761525071963,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Microfin to Explore NCD Fundraising on October 29",
            "Summary": "Muthoot Microfin announced it will explore raising funds through Non-Convertible Debenture (NCD) issuance on October 29. The company is considering this debt instrument as a potential funding mechanism.",
            "Sentiment": "neutral",
            "PublishDate": 1761309432573,
            "Source": "stock"
        },
        {
            "Title": "CareEdge Global Assigns 'BB-/Stable' Rating to Muthoot Microfin's $50 Million Dollar Bond Program",
            "Summary": "CareEdge Global has assigned a 'CareEdge BB-/Stable' rating to Muthoot Microfin Limited's USD 50 million external commercial borrowing program, comprising USD 15 million existing ECB and USD 35 million proposed ECB. The microfinance company has an asset under management of Rs 12,253 crore as of June 30, 2025. The rating reflects MML's established position as a leading microfinance company with ~25% CAGR growth over four years through FY25, comfortable capitalization with 27.9% capital adequacy ratio, and diversified resource profile. However, the rating factors in credit risks from deteriorating asset quality, with Gross Non-Performing Assets rising to 4.8% in March 2025, leading to losses in fiscal 2025. The company reported a net profit of Rs 6 crore in Q1 FY26 after implementing regulatory changes and prudent underwriting norms. MML operates through 1,726 branches across 20 states, with Muthoot Fincorp holding 50.2% equity stake. The stable outlook reflects expectations that MML's credit profile will continue being supported by its market position and expected parent company support.",
            "Sentiment": "neutral",
            "PublishDate": 1761230876791,
            "Source": "corporate_action"
        },
        {
            "Title": "ED Questions Muthoot Group MD in Money Laundering Case Linked to Investor Fraud",
            "Summary": "The Enforcement Directorate questioned George Alexander Muthoot, managing director of Kerala-based Muthoot Group, in a money-laundering case connected to investor fraud allegations. The ED filed a case under the Prevention of Money Laundering Act based on Kerala Police FIRs. The complaints allege that Muthoot Finance branch managers promised investors returns of 8-12% on fixed deposits and non-convertible debentures, but diverted funds to Srei Equipment Finance Limited, which was misrepresented as a sister concern of the group. Investors reportedly faced non-repayment of funds upon maturity. The ED summoned Muthoot to its office and recorded his statement in the case.",
            "Sentiment": "negative",
            "PublishDate": 1760118590104,
            "Source": "corporate_governance"
        },
        {
            "Title": "Muthoot Microfin Raises USD 15 Million Through Private Bond Placement",
            "Summary": "Muthoot Microfin has issued bonds worth USD 15 million through a private placement. The fundraising represents a capital raising initiative by the microfinance company.",
            "Sentiment": "positive",
            "PublishDate": 1760008369893,
            "Source": "stock"
        },
        {
            "Title": "Crisil Upgrades Muthoot Microfin Outlook to Positive, Maintains A+ Rating",
            "Summary": "Crisil Ratings upgraded the outlook on Muthoot Microfin's long-term bank facilities and non-convertible debentures to 'positive' from 'stable' while reaffirming the A+ rating. The upgrade follows a similar rating action on parent company Muthoot Fincorp. Despite ongoing asset quality stress, collections have shown stability since the fourth quarter of fiscal 2025, with collection efficiency remaining above 99% in the non-overdue bucket during fiscal 2026. The company maintains a provision cover of 69% as of June 30, 2025. Gross non-performing assets ratio remained flat at 4.8% as of June 30, 2025, compared to 2.3% in March 2024. Assets under management decreased to Rs 12,253 crore at the end of June from Rs 12,357 crore in March.",
            "Sentiment": "positive",
            "PublishDate": 1758902767593,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Microfin Schedules Committee Meeting to Consider Non-Convertible Debentures Issuance",
            "Summary": "Muthoot Microfin Limited has scheduled a meeting of its Debenture Issue and Allotment Committee for October 03, 2025. The committee will consider and approve fundraising through the issuance of Non-Convertible Debentures on a private placement basis. The company has informed both NSE and BSE about this scheduled meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1758888248808,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Allots ₹50 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Muthoot Microfin Limited has allotted 5,000 non-convertible debentures with a face value of ₹1,00,000 each, raising ₹50 crores through private placement. The debentures carry a 9.80% annual interest rate with monthly payment schedule and have a 36-month tenure, maturing on September 23, 2028. The issue includes a green shoe option of ₹20 crores and the debentures are secured by a first ranking charge of 1.10x over the company's receivables. The securities will be listed on BSE Limited. The allotment was approved by the Debenture Issue and Allotment Committee and falls within the limits previously approved by the Board of Directors in May 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758621747267,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Approves ₹75 Crore Non-Convertible Debenture Issuance",
            "Summary": "Muthoot Microfin Limited's Debenture Issue and Allotment Committee approved the issuance of up to 7,500 non-convertible debentures on private placement basis. Each debenture has a face value of ₹1,00,000, totaling ₹75 crore with a green shoe option of ₹45 crore. The debentures are listed, rated, senior, secured, transferable, and redeemable with a 36-month tenure from September 23, 2025 to September 23, 2028. They offer a 9.80% annual coupon rate with monthly payment schedule and will be listed on BSE Limited. The principal amount is secured by a first ranking exclusive charge of 1.10x over the company's receivables.",
            "Sentiment": "neutral",
            "PublishDate": 1758108240440,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Schedules Committee Meeting to Consider Non-Convertible Debentures Issuance",
            "Summary": "Muthoot Microfin Limited has scheduled a meeting of its Debenture Issue and Allotment Committee on September 17, 2025. The meeting will consider and approve fund raising through the issuance of Non-Convertible Debentures on a private placement basis. The company has informed both NSE and BSE about this scheduled committee meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1757674464803,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Allots ₹100 Crore Non-Convertible Debentures on Private Placement",
            "Summary": "Muthoot Microfin Limited has allotted 1,00,000 Non-Convertible Debentures with a face value of ₹10,000 each, raising ₹100 crores through private placement. The debentures are listed, rated, senior, secured, transferable, and redeemable. The allotment was approved by the company's Debenture Issue and Allotment Committee in a meeting held on September 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757664784852,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Approves $15 Million Bond and ₹150 Crore NCD Private Placement",
            "Summary": "Muthoot Microfin has approved a private placement of USD 15 million bonds and INR 150 crore non-convertible debentures (NCDs) structured across three tranches. The company has given approval for these debt fundraising instruments through private placement route.",
            "Sentiment": "neutral",
            "PublishDate": 1756899869120,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Plans to Raise Funds Through Non-Convertible Debentures",
            "Summary": "Muthoot Microfin has announced plans to raise funds by issuing non-convertible debentures through private placement. The company will use this debt instrument to mobilize capital from select investors.",
            "Sentiment": "positive",
            "PublishDate": 1756466303438,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Reports INR 8 Crore Profit in Q1 FY26, Launches Three New Product Lines",
            "Summary": "Muthoot Microfin reported a profit of INR 8 crores (including OCI) for the quarter ended June 30, 2025, marking the beginning of a turnaround after a challenging FY25. The company's Assets Under Management stood at INR 12,252 crores with disbursements of INR 1,775 crores covering 311,026 loans. Net Interest Margin improved to 11.5% from 10.9% in the previous quarter, while cost of funds decreased to 10.79% from 11.02%. The company launched three new product lines: Micro LAP (loans between INR 1-10 lakh), Gold Loans through co-lending with parent company, and Individual Loans for micro MSME financing. Gross NPA remained stable at 4.5% while Net NPA increased by 24 basis points to 1.58%. The company added 27 new branches, bringing the total network to 1,726 branches, and serves 34.1 lakh borrowers. Disbursements declined 19.4% year-on-year and 9.4% quarter-on-quarter. Management expects to increase monthly disbursements to INR 800-850 crores by end of Q2 and over INR 1,000 crores in H2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755596663869,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Microfin Raises ₹32.85 Crores Through Commercial Paper Issuance",
            "Summary": "Muthoot Microfin Limited allotted Commercial Paper worth ₹32.85 crores on August 13, 2025, with a one-year maturity period ending August 13, 2026. The commercial paper was issued at a discounted amount of ₹29,99,99,997 with a price of 91.3242 and carries a CRISIL A1+ credit rating. The issuance consists of 657 units with a 365-day tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1755088849575,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Reports Q1 Disbursement Decline, Expects Q2 Recovery with New Product Launch",
            "Summary": "Muthoot Microfin CEO Sadaf Sayeed reported Q1 loan disbursements of 175 crores to 311,000 borrowers, representing a 9.4% decline from Q4. The company attributes this to seasonal factors and new industry guardrails implemented by Mfin. The guardrails have reduced overleveraged customers (exposure above 2 lakh rupees) to 1% and customers with more than four loans to 4.7% from 10.8%. Collection efficiency improved to 93% company-wide, with 99.3% on-time repayment for new portfolios. Karnataka's collection efficiency recovered to 87% from a low of 73% during the crisis. The company utilized 132 crores from previous provisions to write off bad loans and maintains 97 crores in provisions. Muthoot Microfin launched three new products: Micro-LAP (1-7 lakh rupees), individual loans up to 5 lakh rupees, and gold loans, targeting 440,000 existing customers with credit scores above 730. The company expects significant Q2 improvement based on July disbursement trends.",
            "Sentiment": "positive",
            "PublishDate": 1755054215050,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Microfin Diversifies into Gold Loans and Secured Lending Products",
            "Summary": "Muthoot Microfin, with Rs 12,253 crore assets under management as of June, is expanding into secured lending by launching gold loans through a co-lending arrangement with parent company Muthoot Fincorp. The NBFC-MFI has also introduced micro loans against property and micro business loans. The company plans to leverage its existing branch network and 34 lakh customers for growth, targeting 440,000 customers with credit scores above 730 for cross-selling new products. Muthoot Microfin aims to build a Rs 1,500 crore portfolio for these three new product verticals by FY26 and grow overall AUM by 20% to Rs 14,500-14,700 crore. The lender reported a Rs 6.2 crore net profit for the first quarter, compared to Rs 113.2 crore in the previous year. The diversification comes as RBI lowered minimum qualifying asset criteria to 60%, allowing NBFC-MFIs to expand secured loan offerings.",
            "Sentiment": "positive",
            "PublishDate": 1755044323378,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Microfin Targets Double-Digit Growth in Gold Loans with ₹78,500 Crore AUM",
            "Summary": "Muthoot Microfin aims for double-digit growth in its gold loan business with assets under management of ₹78,500 crore. The company is expanding its non-gold lending portfolio and enhancing its digital strategy. Muthoot Microfin expects its strong asset quality and nationwide presence to drive high return on equity and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754923045134,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Microfin Reports Sharp Decline in Q1 Profit and Revenue",
            "Summary": "Muthoot Microfin reported a net profit of 62 million rupees in Q1, significantly down from 1.13 billion rupees in the same period last year. The company's revenue also declined to 5.6 billion rupees compared to 6.6 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754920993420,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Microfin Raises ₹45 Crore Through Commercial Paper Issuance",
            "Summary": "Muthoot Microfin has successfully raised ₹45 crore through the issuance of commercial paper. This fundraising activity represents the company's effort to secure short-term financing through the commercial paper market.",
            "Sentiment": "positive",
            "PublishDate": 1753970697240,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Microfin Raises ₹45 Crore Through Commercial Paper Issue",
            "Summary": "Muthoot Microfin Limited allotted Commercial Paper worth ₹45 crore on July 31, 2025. The CP was issued in three tranches of ₹25 crore, ₹15 crore, and ₹5 crore respectively, all with a 182-day tenure maturing on January 29, 2026. All tranches were priced at 95.9340 and carry a CRISIL A1+ credit rating. The total discounted amount across all tranches is ₹43.17 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1753965523051,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin Launches Operations in Assam",
            "Summary": "Muthoot Microfin has commenced operations in Assam as part of its expansion into Northeast India. The company is extending its microfinance services to the northeastern region of the country.",
            "Sentiment": "positive",
            "PublishDate": 1753785887742,
            "Source": "stock"
        },
        {
            "Title": "Muthoot Microfin Approves 15 Billion Rupee NCD Issue",
            "Summary": "Muthoot Microfin has approved the issuance of Non-Convertible Debentures (NCDs) totaling 15 billion rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital for business operations or expansion.",
            "Sentiment": "positive",
            "PublishDate": 1746722510000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Microfin: Massive Q4 Loss Amid Asset Quality Crisis",
            "Summary": "Muthoot Microfin reported a net loss of Rs 401 crore in Q4 FY25, compared to a profit of Rs 120 crore last year. The company faced a 10-fold increase in bad loan provisions and breached financial covenants related to borrowings. For the full year, it posted a net loss of Rs 223 crore. Gross NPA ratio rose to 4.84% from 2.29% a year ago.",
            "Sentiment": "negative",
            "PublishDate": 1746715075000,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Microfin Reports Q4 Net Loss of 4B Rupees",
            "Summary": "Muthoot Microfin experienced a significant increase in net loss for Q4, reporting 4B rupees compared to 1.2B rupees year-over-year. The loss also widened from 38M rupees in the previous quarter. Revenue declined to 5.5B rupees from 6.47B rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1746713981000,
            "Source": "result"
        },
        {
            "Title": "Muthoot Microfin Board Meeting Scheduled for Q4 Results and NCD Issuance",
            "Summary": "Muthoot Microfin has announced a board meeting on May 8 to consider Q4 results. The company will also consider issuing Non-Convertible Debentures (NCDs) up to 15 billion rupees for the fiscal year 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1745321535000,
            "Source": "default"
        },
        {
            "Title": "Muthoot Microfin Obtains E-KYC License for Improved Customer Onboarding",
            "Summary": "Muthoot Microfin has secured an e-KYC license, which will enable the company to streamline and enhance its customer onboarding process. This development is expected to make the customer registration procedure more efficient and seamless for the microfinance institution.",
            "Sentiment": "positive",
            "PublishDate": 1741149505000,
            "Source": "corporate_action"
        },
        {
            "Title": "Muthoot Microfin: Q3 Profit Plunges 97% on Higher Provisioning",
            "Summary": "Muthoot Microfin's Q3 net profit fell 97% to Rs 4 crore due to Rs 247 crore in provisioning costs. Total income rose 18% to Rs 681 crore, with net interest income up 23% to Rs 420 crore. Net interest margin improved to 13.3%. Gross loan portfolio grew 8.3% YoY to Rs 12,405 crore.",
            "Sentiment": "negative",
            "PublishDate": 1738860343000,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Microfin Reports Q3 Financial Results",
            "Summary": "Muthoot Microfin has announced its financial results for the third quarter. The company reported a net profit of 380 million rupees, which is a significant decrease from 1.25 billion rupees in the same quarter of the previous year. However, the company's revenue increased to 6.8 billion rupees from 5.8 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738851361000,
            "Source": "earnings"
        },
        {
            "Title": "Muthoot Microfin: Thomas Muthoot Steps Down as Managing Director",
            "Summary": "Thomas Muthoot resigns as MD of Muthoot Microfin but remains on board as non-executive director. Thomas Muthoot John appointed as whole-time director for five years. Thomas John Muthoot resigns as non-executive director.",
            "Sentiment": "neutral",
            "PublishDate": 1734623602000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Muthoot Microfin Reduces Lending Rates for Third Time in 2024",
            "Summary": "Muthoot Microfin has announced a reduction in its lending rates for the third time in 2024. The company has cut rates by 25 basis points on group loans and 125 basis points on third-party product loans. This move aims to improve access to affordable credit for its customers.",
            "Sentiment": "positive",
            "PublishDate": 1733357091000,
            "Source": "corporate_action"
        }
    ]
}