{
    "Symbol": "MVGJL",
    "ISIN": "INE0KNT01012",
    "News": [
        {
            "Title": "Manoj Vaibhav Gems Q3FY26 Profit Jumps 36.63% YoY",
            "Summary": "Manoj Vaibhav Gems reports Q3FY26 net profit of ₹34.50 crores, up 36.63% YoY. Revenue grows 37.63% to ₹684.80 crores. Board approves ₹32.29 crore warehouse asset purchase.",
            "Sentiment": "positive",
            "PublishDate": 1770727871422,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manoj Vaibhav Gems Opens New Store in Hyderabad",
            "Summary": "Manoj Vaibhav Gems 'N' Jewellers announces expansion with new jewellery store at Chandanagar, Hyderabad. Company has taken active steps towards operationalizing the outlet soon.",
            "Sentiment": "positive",
            "PublishDate": 1770222570264,
            "Source": "stocks"
        },
        {
            "Title": "Manoj Vaibhav Gems Board Meet on Feb 10 for Q3 Results",
            "Summary": "Manoj Vaibhav Gems 'N' Jewellers has scheduled board meeting on February 10, 2026 to consider Q3FY26 unaudited financial results. Trading window closed till February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770120202881,
            "Source": "co_actions_results"
        },
        {
            "Title": "Manoj Vaibhav Gems N Jewellers Reports Strong Q2 Growth with 19% Revenue Jump",
            "Summary": "Manoj Vaibhav Gems N Jewellers delivered robust quarterly performance with net profit rising to 317 million rupees from 267 million rupees year-over-year. Revenue grew significantly to 7.6 billion rupees compared to 6.4 billion rupees in the same period last year. The company's EBITDA increased to 550 million rupees from 443 million rupees, while EBITDA margin improved to 7.28% from 6.9% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762864169670,
            "Source": "earnings"
        },
        {
            "Title": "Manoj Vaibhav Gems 'N' Jewellers to Close Hyderabad Showroom in October 2025",
            "Summary": "Manoj Vaibhav Gems 'N' Jewellers Limited announced the closure of its showroom in A.S. Rao Nagar, Hyderabad, Telangana, effective October 16, 2025. The closure is part of the company's ongoing retail restructuring strategy following a comprehensive review aimed at optimizing its retail footprint and aligning with long-term business objectives. The company trades on NSE under symbol MVGJL and on BSE with scrip code 543995.",
            "Sentiment": "neutral",
            "PublishDate": 1756971544045,
            "Source": "stock"
        },
        {
            "Title": "Manoj Vaibhav Gems Reports Marginal EBITDA Growth in Q1",
            "Summary": "Manoj Vaibhav Gems reported Q1 EBITDA of 375 million rupees compared to 370 million rupees in the same period last year. The company's EBITDA margin was 6.83% versus 6.86% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754919002537,
            "Source": "earnings"
        },
        {
            "Title": "Vaibhav Jewellers Reports Q1 Results, Appoints New Joint MD and Independent Director",
            "Summary": "Manoj Vaibhav Gems 'N' Jewellers Limited approved its unaudited financial results for the quarter ended June 30, 2025, reporting revenue from operations of ₹548.94 crores compared to ₹539.06 crores in the same quarter last year. Net profit for the quarter stood at ₹20.59 crores versus ₹21.77 crores in the previous year. The company appointed Rakhal Gontla as Joint Managing Director after he resigned from his position as Chief Operating Officer. Gontla, who holds commerce and MBA degrees with over 9 years of experience in product planning and strategic leadership, is the son-in-law of the company's Chairperson & Managing Director. The board also appointed Jonnada Vaghira Kumari as an Independent Director for a two-year term. She is a Company Secretary with over 10 years of corporate experience and runs her own firm specializing in listed company compliances. Additionally, the company appointed P.S. Rao & Associates as Secretarial Auditors for five years and scheduled its 36th Annual General Meeting for September 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754918836925,
            "Source": "corporate_action"
        },
        {
            "Title": "Manoj Vaibhav Gems N Jewellers Reports Q4 Financial Results",
            "Summary": "Manoj Vaibhav Gems N Jewellers has reported its Q4 financial results. The company's revenue increased to 7 billion rupees from 5.5 billion rupees year-over-year. EBITDA rose to 456 million rupees from 367 million rupees in the same period last year. However, the EBITDA margin decreased slightly to 6.47% from 6.72%. The company's net profit for Q4 grew to 267 million rupees from 206 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748423648000,
            "Source": "result"
        },
        {
            "Title": "Manoj Vaibhav Gems Reports Improved Q3 EBITDA and Margin",
            "Summary": "Manoj Vaibhav Gems has reported its Q3 financial results. The company's EBITDA increased to 376 million rupees from 341 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 7.56% from 7.18% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738843650000,
            "Source": "earnings"
        },
        {
            "Title": "Manoj Vaibhav Gems Reports Q3 Profit and Revenue Growth",
            "Summary": "Manoj Vaibhav Gems has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 252 million rupees from 189 million rupees in the same quarter last year. Revenue also saw an uptick, rising to 4.98 billion rupees from 4.75 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738843646000,
            "Source": "earnings"
        },
        {
            "Title": "Manoj Vaibhav Gems N Jewellers Reports Q2 EBITDA Growth",
            "Summary": "Manoj Vaibhav Gems N Jewellers announced its Q2 financial results. The company's EBITDA increased to 443 million rupees from 421 million rupees year-over-year. The EBITDA margin also improved slightly to 6.90% from 6.80% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731491120000,
            "Source": "result"
        },
        {
            "Title": "Manoj Vaibhav Gems N Jewellers Reports Q2 Profit and Revenue Growth",
            "Summary": "Manoj Vaibhav Gems N Jewellers announced its Q2 financial results, showing a year-over-year increase in both net profit and revenue. The company's net profit rose to 267 million rupees from 222 million rupees in the same quarter last year. Revenue also increased to 6.4 billion rupees from 6.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731490979000,
            "Source": "result"
        }
    ]
}