{
    "Symbol": "MWL",
    "ISIN": "INE0JYY01011",
    "News": [
        {
            "Title": "Mangalam Worldwide hits all-time high on strong Q3 results",
            "Summary": "Mangalam Worldwide shares surged 7% to ₹295.95, reaching a fresh all-time high following impressive Q3 FY26 results showing 74% profit growth and 29% revenue increase, along with renewable energy expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1768834657206,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mangalam Worldwide Reports Strong Q2 Performance with 51% Jump in Net Profit",
            "Summary": "Mangalam Worldwide delivered strong quarterly results with net profit rising to 105 million rupees from 69.3 million rupees year-over-year. Revenue grew significantly to 3.17 billion rupees compared to 2.38 billion rupees in the same period last year. EBITDA increased to 208 million rupees from 126 million rupees, while EBITDA margin improved to 6.57% from 5.30% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1760919253221,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Worldwide Reports 51% Jump in Q2 Net Profit to 105M Rupees",
            "Summary": "Mangalam Worldwide posted a net profit of 105 million rupees in Q2, up from 69.3 million rupees in the same quarter last year. Revenue increased to 3.17 billion rupees from 2.38 billion rupees year-over-year. EBITDA rose to 208 million rupees compared to 126 million rupees in the previous year's quarter. The company's EBITDA margin improved to 6.57% from 5.30% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1760701042286,
            "Source": "earnings"
        },
        {
            "Title": "Mangalam Worldwide Migrates from SME Platform to NSE Mainboard",
            "Summary": "Stainless-steel manufacturer Mangalam Worldwide Ltd transitioned from the SME platform to the mainboard of NSE on Thursday. The migration involves 2,97,00,674 equity shares with a face value of Rs 10 each. Managing Director Chandragupt Prakash Mangal stated the transition reaffirms market confidence in their business fundamentals and growth strategy, and will enhance visibility and provide access to a wider investor base. The migration is expected to boost investor participation and aligns with the company's strategy to scale operations and expand exports. Established in 1995, Mangalam Worldwide is an integrated stainless-steel manufacturer producing billets, ingots, flats, angle bars, seamless pipes, tubes and U-tubes.",
            "Sentiment": "positive",
            "PublishDate": 1758181924898,
            "Source": "stock"
        },
        {
            "Title": "Mangalam Worldwide Reports 68% Profit Jump in Q1 Results",
            "Summary": "Stainless-steel manufacturer Mangalam Worldwide Ltd reported a 68% increase in profit after tax to Rs 10.13 crore for the April-June quarter of 2025-26. The company's total income rose 21% to Rs 279.41 crore compared to Rs 230.21 crore in the same period last year. Adjusted EBITDA increased 53.04% to Rs 19.72 crore from Rs 12.88 crore, with EBITDA margins above 7.1%. Chairman Vipin Prakash Mangal attributed the growth to improved efficiencies and rising demand for stainless steel across key markets. The Gujarat-based company operates as an integrated stainless steel manufacturer, covering operations from scrap melting to manufacturing seamless pipes and tubes.",
            "Sentiment": "positive",
            "PublishDate": 1754135497101,
            "Source": "earnings"
        }
    ]
}