{
    "Symbol": "NACLIND",
    "ISIN": "INE295D01020",
    "News": [
        {
            "Title": "NACL Industries Seeks Promoter Group Reclassification",
            "Summary": "NACL Industries Limited has submitted applications to BSE and NSE for reclassifying Algavista Greentech Private Limited from promoter group to public shareholder category under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770118941478,
            "Source": "stocks"
        },
        {
            "Title": "NACL Industries relocates offices in Hyderabad",
            "Summary": "NACL Industries Limited has shifted its registered and corporate offices to new locations in Hyderabad effective January 28, 2026, as per regulatory compliance under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769795768426,
            "Source": "stocks"
        },
        {
            "Title": "NACL Industries Q3 Loss Narrows to ₹102M from ₹362M",
            "Summary": "NACL Industries reported a consolidated net loss of ₹102 million in Q3, showing significant improvement from the ₹362 million loss recorded in the same quarter last year, marking a 71.82% reduction in losses.",
            "Sentiment": "positive",
            "PublishDate": 1769666950986,
            "Source": "co_actions_results"
        },
        {
            "Title": "NACL Industries Board Meet Set for Jan 29, 2026",
            "Summary": "NACL Industries Limited has scheduled its Board of Directors meeting for January 29, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1-31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769006174311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Coromandel Acquires 0.67% Stake in NACL Industries",
            "Summary": "Coromandel International acquired 1.88 crore equity shares in NACL Industries through rights issue subscription, increasing its holding to 53.73% from 53.06%.",
            "Sentiment": "neutral",
            "PublishDate": 1767435267893,
            "Source": "co_actions_results"
        },
        {
            "Title": "NACL Industries Receives Promoter Group Re-classification",
            "Summary": "Algavista Greentech Private Limited requests re-classification from promoter group to public category following change in shareholding structure of E.I.D.-Parry (India) Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1766069233639,
            "Source": "stocks"
        },
        {
            "Title": "NACL Industries Announces Rights Issue of ₹249.29 Crore at ₹76.70 Per Share",
            "Summary": "NACL Industries' Securities Rights Issue Committee approved the issuance of 3.25 crore equity shares through a rights offering at ₹76.70 per share, with a 5:31 entitlement ratio for existing shareholders. The rights issue opens on December 22, 2025, with record date set for December 12, 2025, and closes on December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765159343947,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Schedules Securities Issue Committee Meeting for Rights Issue Details",
            "Summary": "NACL Industries has scheduled a Securities Issue Committee meeting for December 08, 2025, to determine specific terms of its previously approved rights issue including price, entitlement ratio, and record date. The meeting will finalize various matters related to the equity share issuance, subject to regulatory approvals from stock exchanges and other authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1764780449099,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Shareholders Approve Director Appointment and Related Party Transactions via Postal Ballot",
            "Summary": "NACL Industries Limited shareholders approved three key resolutions through postal ballot voting concluded on November 30, 2025, including the appointment of Mr. Arun Alagappan as Director and commission payments to Non-Executive Directors for FY2025-26 to FY2029-2030. The company also secured approval for material related party transactions worth up to Rs 785 crores with holding company Coromandel International Limited, affecting corporate governance and operational arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1764594991146,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Approves Rs. 250 Crore Rights Issue and CFO Change",
            "Summary": "NACL Industries board approved raising up to Rs. 250 crores through a rights issue of equity shares, subject to regulatory approvals, and constituted a Securities Issue Committee to oversee the process. The company also appointed N. Shankar as new Chief Financial Officer replacing Anish Mathew who resigned due to personal reasons, and approved shifting its registered office within Hyderabad along with extending conversion time for Rs. 28 crore CCDs from subsidiary NACL Spec-Chem Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1764594693305,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Approves Rs. 250 Crore Rights Issue and CFO Change",
            "Summary": "NACL Industries board approved raising up to Rs. 250 crores through a rights issue of equity shares, subject to regulatory approvals, and constituted a Securities Issue Committee to oversee the process. The company also witnessed CFO transition as Anish Mathew resigned due to personal reasons and N. Shankar was appointed as the new Chief Financial Officer, both changes effective December 01, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764594392650,
            "Source": "corporate_action"
        },
        {
            "Title": "Nacl Industries Schedules Board Review of Fundraising Proposal for December 1",
            "Summary": "Nacl Industries has announced that the company will review a proposal for fundraising on December 1. The review indicates the company's consideration of potential capital raising activities that could impact shareholders and future business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764168093714,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Seeks Shareholder Approval for Director Appointment and Related Party Transactions Worth Rs 785 Crores",
            "Summary": "NACL Industries Limited has issued a postal ballot notice seeking shareholder approval for three key resolutions. The company proposes to appoint Mr. Arun Alagappan (DIN: 00291361) as Director, who was previously appointed as Additional Director on October 10, 2025. The second resolution seeks approval for payment of commission to Non-Executive Directors for five years from FY2025-26 to FY2029-2030, capped at 1% of net profits annually. The third resolution involves material related party transactions with holding company Coromandel International Limited worth up to Rs 785 crores, covering purchases, sales, inter-corporate services, lease arrangements, and other business transactions. The e-voting period runs from November 1, 2025 (9:00 AM) to November 30, 2025 (5:00 PM), with October 27, 2025 as the cut-off date for eligible shareholders. Mr. Alagappan serves as Executive Chairman of Coromandel International Limited and brings 28 years of experience across business leadership and financial management.",
            "Sentiment": "neutral",
            "PublishDate": 1761932114992,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Allots 86,667 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "NACL Industries Limited has allotted 86,667 equity shares of ₹1 each to employees under its ESOS-2020 scheme following the exercise of vested stock options. The Nomination and Remuneration Committee approved the allotment on October 24, 2025. The company's total equity share capital increased from 20,14,24,812 to 20,15,11,479 shares. The exercise price for different grantees ranged from ₹64 to ₹278, with a weighted average exercise price of ₹64.84. The newly issued shares carry equal rights with existing equity shares and are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761537316011,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Net Profit Drops 83% Despite Revenue Growth in Q2",
            "Summary": "NACL Industries Ltd. reported net profit of ₹3 crore for the September quarter, down 82.7% from ₹15 crore in the same period last year. Revenue increased 4% to ₹457 crore from ₹440.3 crore year-on-year. Operating profit (EBITDA) grew 10.4% to ₹44.7 crore with margins improving to 9.8% from 9.2% in the previous year. The company's shares closed 3.51% higher at ₹209 following the earnings announcement.",
            "Sentiment": "negative",
            "PublishDate": 1761302967766,
            "Source": "earnings"
        },
        {
            "Title": "NACL Industries Appoints Arun Alagappan as Additional Non-Executive Director",
            "Summary": "NACL Industries Limited appointed Mr. Arun Alagappan as an Additional Director (Non-Executive & Non-Independent) on the Board of Directors, effective October 10, 2025. The appointment was approved by the Board through a circular resolution and is subject to shareholder approval. Alagappan serves as Executive Chairman of Coromandel International Limited and holds a Commerce degree from University of Madras along with completion of the Owner President/Management Program from Harvard Business School. His career includes positions at GE Capital Services India, Murugappa Group companies including Parryware and Tube Investments of India Limited, and Cholamandalam Investment and Finance Company Limited where he served as Managing Director until February 2021. He currently holds directorships in Lakshmi Machine Works Limited and Thirumalai Chemicals Limited.",
            "Sentiment": "positive",
            "PublishDate": 1760095631839,
            "Source": "corporate_governance"
        },
        {
            "Title": "NACL Industries Shareholders Approve New Board Appointments and Leadership Changes via Postal Ballot",
            "Summary": "NACL Industries Limited shareholders approved nine resolutions through postal ballot voting concluded on September 17, 2025. Key appointments include Dr. Raghuram Devarakonda as Managing Director & CEO for three years with a monthly basic salary of Rs. 12,01,350, plus performance incentives up to 70% of annual basic pay. Three new independent directors were appointed: Mr. Suresh Subramanian, Mr. B Raghvendra Rao, and Mr. Sanjiv Lal, each for five-year terms. Additional directors Mr. Natarajan Srinivasan and Mr. S Sankarasubramanian were also appointed. The company appointed S.R. Batliboi & Associates LLP as statutory auditors and amended its Articles of Association. All resolutions passed with over 99.9% approval from 260 shareholders who participated in the remote e-voting process.",
            "Sentiment": "positive",
            "PublishDate": 1758289017742,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coromandel International Acquires Additional 5,435 Shares in NACL Industries Through Open Offer",
            "Summary": "Coromandel International Limited acquired 5,435 equity shares of NACL Industries Limited through an open offer that ran from August 22, 2025 to September 9, 2025. The acquisition represents 0.003% of NACL's voting share capital. Following the transaction completed on September 12, 2025, Coromandel's total holding in NACL increased from 10,69,07,146 shares to 10,69,12,581 shares, maintaining its 53.08% stake in the company. Coromandel is identified as a promoter of NACL Industries. The company voluntarily disclosed this acquisition despite it not meeting prescribed threshold limits under SEBI takeover regulations. NACL Industries' total equity share capital remains at 20,14,24,812 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758084838572,
            "Source": "order&deals"
        },
        {
            "Title": "NACL Industries Seeks Shareholder Approval for New Board Appointments Including Managing Director",
            "Summary": "NACL Industries Ltd has issued a postal ballot notice seeking shareholder approval for multiple board appointments. The company is proposing to appoint three new directors: Mr. Natarajan Srinivasan, Mr. S Sankarasubramanian, and Dr. Raghuram Devarakonda. Additionally, Dr. Raghuram Devarakonda is being proposed as Managing Director & CEO with a monthly basic salary of Rs. 12,01,350 and variable pay up to 70% of annual basic pay. The company is also seeking approval for three independent directors, appointment of new statutory auditors S.R. Batliboi & Associates LLP to replace resigned auditors B S R & Co, and amendments to Articles of Association following termination of a shareholders' agreement. The e-voting period runs from August 19 to September 17, 2025. The appointments follow Coromandel International Limited's acquisition of a controlling 53% stake in NACL Industries.",
            "Sentiment": "neutral",
            "PublishDate": 1755527722330,
            "Source": "corporate_governance"
        },
        {
            "Title": "Coromandel International Launches Open Offer to Acquire 26% Stake in NACL Industries for ₹402 Crores",
            "Summary": "Coromandel International Limited has initiated an open offer to acquire up to 5,24,62,320 equity shares (26% of voting share capital) of NACL Industries Limited at ₹76.70 per share, totaling ₹402.39 crores. The offer follows Coromandel's acquisition of 52.98% controlling stake through share purchase agreements completed on August 8, 2025. NACL Industries, engaged in crop protection and pesticide manufacturing, has become a subsidiary of Coromandel. The tendering period runs from August 22 to September 8, 2025. Competition Commission of India approved the transaction on July 1, 2025. The offer price represents the highest negotiated price under the acquisition agreements and complies with SEBI takeover regulations.",
            "Sentiment": "positive",
            "PublishDate": 1754992038585,
            "Source": "order&deals"
        },
        {
            "Title": "Coromandel International Acquires 53.13% Stake in NACL Industries, Becomes New Promoter",
            "Summary": "Coromandel International Limited has acquired 53.13% stake in NACL Industries through share purchase agreements, becoming the new promoter with control effective August 8, 2025. The acquisition involved purchasing 10,68,96,146 equity shares from previous promoters including KLR Products Limited, K. Lakshmi Raju, and Bright Town Investment Advisor Private Limited. Following the change in control, NACL Industries underwent significant board restructuring with appointment of six new directors including Dr. Raghuram Devarakonda as Managing Director and CEO, and resignation of ten existing directors. The company also changed its statutory auditors from B S R & Co. to S. R. Batliboi & Associates LLP due to independence concerns arising from the ownership change. Previous promoters have been reclassified to public shareholder category, and the company will seek shareholder approval through postal ballot for the new appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1754646667233,
            "Source": "corporate_action"
        },
        {
            "Title": "Coromandel International Acquires 53.13% Stake in NACL Industries, Becomes New Promoter",
            "Summary": "Coromandel International Limited has acquired a 53.13% stake (10,68,96,146 equity shares) in NACL Industries Limited on August 8, 2025, becoming the new promoter through multiple share purchase agreements dated March 12, 2025. The acquisition resulted in a complete board overhaul with 10 directors resigning and 6 new directors being appointed, including Dr. Raghuram Devarakonda as Managing Director and CEO. The company also changed its statutory auditors from B S R & Co. to S. R. Batliboi & Associates LLP due to independence concerns related to the ownership change. Former promoters KLR Products Limited, K. Lakshmi Raju, and Bright Town Investment Advisor Private Limited have been reclassified to public shareholder category. A postal ballot has been approved for shareholder approval of the new appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1754646091334,
            "Source": "order&deals"
        },
        {
            "Title": "SEBI Issues Final Comments on Coromandel International's Open Offer for 26% Stake in NACL Industries",
            "Summary": "SEBI has issued final comments on Coromandel International Limited's Draft Letter of Offer for an open offer to acquire up to 5,24,62,320 fully paid-up equity shares of NACL Industries Limited, representing 26% of the voting share capital. Each share has a face value of INR 1. Both companies disclosed this development to stock exchanges on August 5, 2025. Coromandel International stated it will take further steps as recommended by SEBI and as required under the open offer process pursuant to SEBI Takeover Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754413255325,
            "Source": "order&deals"
        },
        {
            "Title": "NACL Industries Reports Strong Q1 Turnaround with 130M Rupees Net Profit",
            "Summary": "NACL Industries delivered a significant turnaround in its quarterly results, reporting a consolidated net profit of 130 million rupees compared to a loss of 208 million rupees in the same period last year. The company's revenue grew to 4.5 billion rupees from 3.25 billion rupees year-over-year. EBITDA showed a remarkable improvement, posting a gain of 381 million rupees versus a loss of 37 million rupees in the previous year, with an EBITDA margin of 8.51%.",
            "Sentiment": "positive",
            "PublishDate": 1753702824830,
            "Source": "earnings"
        },
        {
            "Title": "NACL Industries to Consider Q4 Results on May 14",
            "Summary": "NACL Industries has announced that it will consider its fourth quarter financial results on May 14. This suggests the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746802641000,
            "Source": "default"
        },
        {
            "Title": "Nacl Industries Reports Q3 Financial Results",
            "Summary": "Nacl Industries has reported its Q3 financial results. The company experienced a consolidated net loss of 362 million rupees, compared to a loss of 159 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter, where the company reported a profit of 149 million rupees. The Q3 revenue stood at 2.7 billion rupees, down from 3.65 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739405801000,
            "Source": "earnings"
        },
        {
            "Title": "NACL Industries Reports Q3 Financial Results",
            "Summary": "NACL Industries has reported a consolidated net loss of 362 million rupees for the third quarter, compared to a loss of 159 million rupees in the same period last year. However, this represents a shift from a profit of 149 million rupees in the previous quarter. The company's revenue for Q3 stood at 2.7 billion rupees, down from 3.65 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739361061000,
            "Source": "earnings"
        },
        {
            "Title": "Nacl Industries Approves Issuance of Warrants and Shares",
            "Summary": "The board of Nacl Industries has approved the issuance of 6.9 million warrants and 1.7 million shares, both priced at 58 rupees each. This decision represents a significant corporate action that could impact the company's capital structure and shareholder equity.",
            "Sentiment": "neutral",
            "PublishDate": 1734048755000,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Approves Issuance of Warrants and Shares",
            "Summary": "NACL Industries' board has approved the issuance of 6.9 million warrants and 1.7 million shares, both priced at 58 rupees each. This decision represents a significant corporate action that could potentially impact the company's capital structure and shareholder value.",
            "Sentiment": "neutral",
            "PublishDate": 1734002957000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nacl Industries to Consider Fund Raising in Board Meeting",
            "Summary": "Nacl Industries has announced a board meeting scheduled for December 12 to discuss and potentially approve fund raising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1733788602000,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Board Meeting Scheduled to Consider Fund Raising",
            "Summary": "NACL Industries has announced a board meeting to be held on December 12 to discuss and consider potential fund raising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1733757314000,
            "Source": "corporate_action"
        },
        {
            "Title": "NACL Industries Reports Strong Q2 EBITDA Growth",
            "Summary": "NACL Industries has reported a significant increase in its Q2 EBITDA, rising from 305.6 million rupees in the previous year to 407.8 million rupees in the current quarter. The company's EBITDA margin also improved substantially, increasing from 5.27% to 9.26% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729786287000,
            "Source": "result"
        },
        {
            "Title": "NACL Industries Reports Q2 Revenue Decline",
            "Summary": "NACL Industries has reported a revenue of 4.4 billion rupees for the second quarter, down from 5.8 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729786279000,
            "Source": "result"
        },
        {
            "Title": "NACL Industries Reports Mixed Q2 Financial Results",
            "Summary": "NACL Industries has reported its Q2 consolidated net profit at 149 million rupees, showing a significant year-over-year increase from 40.8 million rupees. However, the company experienced a loss of 208 million rupees compared to the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729786272000,
            "Source": "result"
        }
    ]
}