{
    "Symbol": "NAGAFERT",
    "ISIN": "INE454M01024",
    "News": [
        {
            "Title": "Nagarjuna Fertilizers Issues Clarification on Asset Sale",
            "Summary": "Nagarjuna Fertilizers and Chemicals Limited provides regulatory clarification following asset sale completion and debt settlement of ₹1885.00 crores with ACRE in July 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1768828764654,
            "Source": "stocks"
        },
        {
            "Title": "Nagarjuna Fertilizers Reports Loss of Rs 502.36 Lakhs in Q2 FY26 Amid Discontinued Operations",
            "Summary": "Nagarjuna Fertilizers and Chemicals Limited posted a net loss of Rs 502.36 lakhs for the quarter ended September 30, 2025, with zero revenue from operations as the company operates on a non-going concern basis. The company faces current liabilities exceeding current assets by Rs 87,198.29 lakhs and has contingent liabilities of approximately Rs 1,115.80 crores under dispute in various legal forums.",
            "Sentiment": "negative",
            "PublishDate": 1763138204907,
            "Source": "earnings"
        },
        {
            "Title": "Nagarjuna Fertilizers Appoints Two Directors at 19th AGM, Approves Age Waiver for Senior Directors",
            "Summary": "Nagarjuna Fertilizers and Chemicals Limited shareholders approved two key director appointments at their 19th Annual General Meeting held on September 30, 2025. Mr. Uday Shankar Jha was appointed as a Non-executive Director, liable to retire by rotation. The company also received special approval for Mr. Jha's continuation as director beyond age 75, which he attained on June 16, 2025. Additionally, Mr. Rajendra Mohan Gonela was re-appointed as an Independent Director for a second consecutive five-year term from May 28, 2025 to May 27, 2030. Shareholders also approved Mr. Gonela's continuation beyond age 75, which he will reach on July 09, 2026. Both directors confirmed they are not debarred from holding director positions by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1759309313896,
            "Source": "corporate_governance"
        },
        {
            "Title": "KRIBHCO Sells 99,996 Shares in Nagarjuna Fertilizers, Reduces Stake to 0.59865%",
            "Summary": "Krishak Bharati Cooperative Limited (KRIBHCO), a promoter of Nagarjuna Fertilizers and Chemicals Limited, sold 99,996 shares representing 0.0167% of the company's paid-up capital on September 19, 2025. The transaction was conducted through open market sales. Following this sale, KRIBHCO's shareholding in Nagarjuna Fertilizers decreased to 35,80,327 shares, which represents 0.59865% of the company. Prior to the transaction, KRIBHCO held 36,80,323 shares or 0.61537% of the company. The company's total equity share capital remains at 59,80,65,003 shares. Nagarjuna Fertilizers is listed on both BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1759127891687,
            "Source": "corporate_action"
        },
        {
            "Title": "KRIBHCO Sells 99,996 Shares in Nagarjuna Fertilizers, Reduces Stake to 0.61537%",
            "Summary": "Krishak Bharati Cooperative Limited (KRIBHCO), a promoter of Nagarjuna Fertilizers and Chemicals Limited, sold 99,996 shares representing 0.0167% of the company's paid-up capital on September 15, 2025. The transaction was conducted through open market sale. Following this sale, KRIBHCO's shareholding in Nagarjuna Fertilizers decreased to 36,80,323 shares, which represents 0.61537% of the company. Prior to this transaction, KRIBHCO held 37,80,319 shares or 0.63209% of the company. The company's total share capital remains at 59,80,65,003 shares. Nagarjuna Fertilizers is listed on both BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758092867742,
            "Source": "corporate_action"
        },
        {
            "Title": "KRIBHCO Sells 74,997 Shares in Nagarjuna Fertilizers, Reduces Stake to 0.63%",
            "Summary": "Krishak Bharati Cooperative Limited (KRIBHCO), a promoter of Nagarjuna Fertilizers and Chemicals Limited, sold 74,997 shares representing 0.0125% of the company's paid-up capital on September 12, 2025. The transaction was conducted through open market sale. Following this divestment, KRIBHCO's shareholding in Nagarjuna Fertilizers decreased to 37,80,319 shares, equivalent to 0.63209% of the company. The company's total equity share capital remains at 59,80,65,003 shares. Nagarjuna Fertilizers disclosed this information under SEBI regulations regarding substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1757998788548,
            "Source": "corporate_action"
        },
        {
            "Title": "KRIBHCO Sells 99,996 Shares in Nagarjuna Fertilizers, Reduces Stake to 0.64%",
            "Summary": "Krishak Bharati Cooperative Limited (KRIBHCO), a promoter of Nagarjuna Fertilizers and Chemicals Limited, sold 99,996 shares representing 0.0167% of the company's paid-up capital on September 11, 2025. The transaction was conducted through open market sales. Following this sale, KRIBHCO's shareholding in Nagarjuna Fertilizers decreased to 38,55,316 shares, which represents 0.64463% of the company. The company's total equity share capital stands at 59,80,65,003 shares. KRIBHCO disclosed this transaction under SEBI regulations on September 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757930004383,
            "Source": "corporate_action"
        },
        {
            "Title": "KRIBHCO Sells 49,998 Shares in Nagarjuna Fertilizers, Reduces Stake to 0.66%",
            "Summary": "Krishak Bharati Cooperative Limited (KRIBHCO), a promoter of Nagarjuna Fertilizers and Chemicals Limited, sold 49,998 shares representing 0.0084% of the company's paid-up capital on September 10, 2025. The transaction was conducted through open market sale. Following this sale, KRIBHCO's shareholding in Nagarjuna Fertilizers decreased to 39,55,312 shares, representing 0.66135% of the company's total equity. Prior to the transaction, KRIBHCO held 40,05,310 shares or 0.66971% of the company. The company's total equity share capital remains at 59,80,65,003 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757654365966,
            "Source": "corporate_action"
        },
        {
            "Title": "KRIBHCO Reduces Stake in Nagarjuna Fertilizers Through Open Market Sale",
            "Summary": "Krishak Bharati Cooperative Limited (KRIBHCO), a promoter of Nagarjuna Fertilizers and Chemicals Limited, sold 49,998 shares representing 0.0084% of the company's paid-up capital through open market transactions on September 9, 2025. Following the sale, KRIBHCO's shareholding decreased to 40,05,310 shares, representing 0.66971% of the company. The company's total equity share capital remains at 59,80,65,003 shares. Nagarjuna Fertilizers is listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757591054188,
            "Source": "corporate_action"
        },
        {
            "Title": "KRIBHCO Sells 49,998 Shares in Nagarjuna Fertilizers, Reduces Stake to 0.69%",
            "Summary": "Krishak Bharati Cooperative Limited (KRIBHCO), a promoter of Nagarjuna Fertilizers and Chemicals Limited, sold 49,998 shares representing 0.0084% of the company through open market transactions on September 04, 2025. Following the sale, KRIBHCO's shareholding decreased to 41,55,304 shares, equivalent to 0.69479% of the company's paid-up capital. The transaction was disclosed under SEBI regulations governing substantial acquisition of shares and insider trading requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1757499499853,
            "Source": "stock"
        },
        {
            "Title": "KRIBHCO Sells 49,998 Shares in Nagarjuna Fertilizers, Reduces Stake to 0.70%",
            "Summary": "Krishak Bharati Cooperative Limited (KRIBHCO), a promoter of Nagarjuna Fertilizers and Chemicals Limited, sold 49,998 shares representing 0.0084% of the company's paid-up capital through open market transactions on September 02, 2025. Following this sale, KRIBHCO's shareholding decreased to 42,05,302 shares, equivalent to 0.70315% of the company. The transaction was disclosed under SEBI regulations for substantial acquisition of shares and takeovers. Nagarjuna Fertilizers' total equity share capital remains at 59,80,65,003 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757154016097,
            "Source": "corporate_action"
        },
        {
            "Title": "Nagarjuna Agri-Tech Expands Business Scope to Food & Beverage Sector, Increases Authorized Capital to ₹30 Crore",
            "Summary": "Nagarjuna Agri-Tech has received MCA approval for adopting a new Memorandum of Association. The company has expanded its object clause to include Food & Beverage, QSR (Quick Service Restaurant), and Cloud Kitchens businesses. Additionally, the company has increased its authorized share capital to ₹30 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756216639584,
            "Source": "corporate_action"
        },
        {
            "Title": "Nagarjuna Fertilizers Reports Loss in Q1 Results, Operations Remain Discontinued",
            "Summary": "Nagarjuna Fertilizers and Chemicals Limited reported a standalone net loss of Rs 625.79 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 2,45,319.93 lakhs in the same quarter last year. The company recorded no revenue from operations during the quarter as its business operations remain discontinued. Current liabilities exceed current assets by Rs 86,695.65 lakhs without considering energy and government claims. The company's plants stopped operating in June 2024 after Assets Care & Reconstruction Enterprise Ltd sold core assets under the SARFAESI Act. The company faces contingent liabilities of Rs 1,07,723.56 lakhs and continues to pursue various subsidy claims with the government. Agri Vestors Private Limited acquired a 45.44% stake from Amlika Mercantile Private Limited through a share purchase agreement, becoming the new promoter. The company's financials are prepared on a 'not a going concern' basis due to the absence of revenue-generating assets.",
            "Sentiment": "negative",
            "PublishDate": 1755162682693,
            "Source": "earnings"
        },
        {
            "Title": "Nagarjuna Fertilizers and Chemicals Limited: Promoters Reduce Stake Ahead of Major Acquisition",
            "Summary": "NFCL's promoter, Amlika Mercantile Private Limited (AMPL), sold 25 lakh shares (0.418% of paid-up capital) on March 21, 2025. AMPL's shareholding is now 46.27%. Agri Vestors Private Limited is set to acquire 45.44% stake from AMPL on March 28, 2025. The company's shares are currently trading at ₹5.02.",
            "Sentiment": "neutral",
            "PublishDate": 1742973135000,
            "Source": "corporate_action"
        }
    ]
}