{
    "Symbol": "NAGREEKCAP",
    "ISIN": "INE245I01016",
    "News": [
        {
            "Title": "Nagreeka Capital Reports Strong Q3FY26 Results",
            "Summary": "Nagreeka Capital & Infrastructure posts 25.46% jump in Q3FY26 net profit to ₹328.72 lakhs, driven by robust revenue growth and appoints new internal auditor for enhanced governance.",
            "Sentiment": "positive",
            "PublishDate": 1770816652370,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nagreeka Capital announces Company Secretary resignation",
            "Summary": "Nagreeka Capital & Infrastructure Ltd. announces resignation of Company Secretary & Compliance Officer Ms Bhawana effective January 22, 2026, citing personal reasons in regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1769090413108,
            "Source": "stocks"
        },
        {
            "Title": "Nagreeka Capital Infrastructure Reports Quarterly Results and Internal Auditor Change",
            "Summary": "Nagreeka Capital Infrastructure Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025, showing profit after tax of ₹288.04 lakhs for the quarter. The company's Board also approved the resignation of M/s HR Agarwal & Associates as Internal Auditors effective November 14, 2025, citing alignment with current internal audit requirements and business restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1763117390190,
            "Source": "earnings"
        },
        {
            "Title": "Nagreeka Capital Approves Director Designation Change and Appoints New Secretarial Auditor",
            "Summary": "Nagreeka Capital & Infrastructure Ltd's members approved the change of designation for Mr. Sushil Patwari from Non-Executive Non-Independent Director to Executive Director, effective October 1, 2025. The company also appointed M/s M&A Associates as Secretarial Auditor for a 5-year term from financial year 2025-26 to 2029-30. Mr. Patwari, who holds a B.Com degree and has over 36 years of business experience, is the brother of the company's Managing Director Mr. Sunil Ishwarlal Patwari. The decisions were made during a members' meeting held on September 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758633367090,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nagreeka Capital & Infrastructure Announces Board Changes Including Director Re-appointment and Term Completion",
            "Summary": "Nagreeka Capital & Infrastructure Limited announced multiple board changes during its members' meeting held on September 23, 2025. The company re-appointed Mr. Sushil Patwari, who retired by rotation and was eligible for re-appointment. Mrs. Surabhi Sanganeria completed her term as Independent Director effective September 27, 2025, and consequently ceased to be Chairman of the Audit Committee and Nomination & Remuneration Committee, as well as Member of the Stakeholders' Relationship Committee and Corporate Social Responsibility Committee. The company also regularized Mrs. Sarita Patwari as Non-Executive Non-Independent Women Director, who was initially appointed as Additional Director on August 12, 2025. Mrs. Sarita Patwari brings 19 years of business experience across various verticals and is related to the company's management through family connections.",
            "Sentiment": "neutral",
            "PublishDate": 1758625307717,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nagreeka Capital & Infrastructure Reports Quarterly Results and Board Changes",
            "Summary": "Nagreeka Capital & Infrastructure Limited reported unaudited financial results for the quarter ended June 30, 2025. The company posted a profit after tax of ₹358.57 lacs compared to ₹436.73 lacs in the same quarter last year. Total income decreased to ₹1,274.69 lacs from ₹2,209.68 lacs year-over-year. The board appointed Mrs. Sarita Patwari as an additional non-executive non-independent women director effective August 12, 2025, with regularization subject to shareholder approval on September 23, 2025. The board also proposed changing Mr. Sushil Patwari's designation from Non-Executive Director to Executive Director effective October 1, 2025, and approved remuneration for Managing Director Mr. Sunil Ishwarlal Patwari from October 1, 2025, both subject to shareholder approval at the Annual General Meeting scheduled for September 23, 2025. The company also adopted revised Related Party Transaction and Nomination and Remuneration policies.",
            "Sentiment": "neutral",
            "PublishDate": 1755015788578,
            "Source": "earnings"
        }
    ]
}