{
    "Symbol": "NAGREEKEXP",
    "ISIN": "INE123B01028",
    "News": [
        {
            "Title": "Nagreeka Exports Board Meet on Feb 12 for Q3 Results",
            "Summary": "Nagreeka Exports Limited has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770142668600,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nagreeka Exports Limited Approves Authorized Share Capital Increase from ₹35 Crore to ₹50 Crore",
            "Summary": "Nagreeka Exports Limited's Board approved increasing authorized share capital by ₹15 crore through addition of equity shares with face value of ₹5 each, subject to shareholder approval. The company scheduled an Extraordinary General Meeting for December 18, 2025, with December 11, 2025 as the cut-off date for voting entitlements.",
            "Sentiment": "positive",
            "PublishDate": 1763470651274,
            "Source": "corporate_action"
        },
        {
            "Title": "Nagreeka Exports Assigns Additional Strategic Roles to Three Senior Management Personnel",
            "Summary": "Nagreeka Exports Ltd announced changes in roles for three senior management personnel effective October 1, 2025. Mr. Sanjay Kuber Jamadade, the CEO with over 30 years of textile industry experience, will take on an additional role in Strategic Innovation in Textile Technician while retaining his current position. Mr. Vivek Khanna, President Marketing with over 35 years of export marketing experience in yarn and textiles, will assume additional responsibilities for Strategic Marketing Initiatives. Mr. Vijay Jajoo, Deputy General Manager – Purchase with 42 years of field experience and 26 years with the company, will take on Strategic Purchase Initiatives. The board also discussed a potential rights issue for fund raising but deferred detailed discussion to a future meeting.",
            "Sentiment": "positive",
            "PublishDate": 1759314159924,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nagreeka Exports Resumes Operations at Yavluj Spinning Plant",
            "Summary": "Nagreeka Exports Limited has resumed operations at its Yavluj Spinning Plant in Maharashtra effective August 13, 2025. The plant had been temporarily shut down due to operational issues, as previously communicated in February 2025. The company stated it is working towards achieving normalcy at the facility located in village Yavluj, taluka Panhala, District Kolhapur.",
            "Sentiment": "positive",
            "PublishDate": 1758202420977,
            "Source": "stock"
        },
        {
            "Title": "Nagreeka Exports Reports Q1 FY26 Results and Announces Board Changes",
            "Summary": "Nagreeka Exports Ltd approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of ₹9,030.55 lacs compared to ₹17,145.08 lacs in the same quarter last year. Net profit for the quarter was ₹91.96 lacs versus ₹137.80 lacs in the previous year quarter. The Board proposed re-appointment of three directors: Mr. Debabrata Das Choudhary as Whole Time Director effective May 25, 2026, and Mr. Tushar Jhunjhunwala and Mr. Pawan Kishore Harlalka as non-executive Independent Directors effective September 28, 2025 and October 1, 2025 respectively. The Board also proposed to waive remuneration for Executive Directors Mr. Sushil Patwari and Mr. Sunil Ishwarlal Patwari from October 1, 2025, and approved payment of remuneration to Mr. Pratyush Patwari as a related party transaction. The company's spinning plant had suspended operations from February 21, 2025, but has since lifted the suspension and is working towards normalcy.",
            "Sentiment": "neutral",
            "PublishDate": 1755100684782,
            "Source": "earnings"
        },
        {
            "Title": "Nagreeka Exports Resumes Operations at Yavluj Spinning Plant",
            "Summary": "Nagreeka Exports Limited has resumed operations at its Yavluj Spinning Plant in Maharashtra effective August 13, 2025. The plant had been temporarily shut down due to operational issues, as previously communicated in February 2025. The company stated it is working towards achieving normalcy at the facility located in village Yavluj, taluka Panhala, District Kolhapur.",
            "Sentiment": "positive",
            "PublishDate": 1755097088105,
            "Source": "stock"
        }
    ]
}