{
    "Symbol": "NAHARCAP",
    "ISIN": "INE049I01012",
    "News": [
        {
            "Title": "Nahar Capital Q3FY26 Net Profit Surges 227% YoY",
            "Summary": "Nahar Capital & Financial Services reported standalone net profit of ₹768.83 lakhs for Q3FY26, up 227% YoY. Total income reached ₹1410.08 lakhs with strong performance in investment activities.",
            "Sentiment": "positive",
            "PublishDate": 1770463439243,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nahar Capital Reports Strong Q2 Performance with Net Profit of Rs 1,142.64 Lakhs",
            "Summary": "Nahar Capital and Financial Services Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported a net profit of Rs 1,142.64 lakhs for the quarter, with earnings per share of Rs 6.82. For the half year period, net profit reached Rs 1,988.23 lakhs with EPS of Rs 11.87. Total income for the quarter was Rs 1,789.89 lakhs, primarily driven by interest income of Rs 378.36 lakhs, dividend income of Rs 7.88 lakhs, and rental income of Rs 73.52 lakhs. On a consolidated basis, the company reported net profit of Rs 2,038.44 lakhs for the quarter and Rs 3,186.56 lakhs for the half year. The Board of Directors approved these results in their meeting held on November 13, 2025. The company operates in two segments: Investment/Financial Activities and Real Estate Activities.",
            "Sentiment": "positive",
            "PublishDate": 1763034930570,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Capital Re-appoints Dr. Roshan Lal Behl as Independent Director for Second Five-Year Term",
            "Summary": "Nahar Capital and Financial Services Limited shareholders approved the re-appointment of Dr. Roshan Lal Behl as Independent Director at their 20th Annual General Meeting held on September 25, 2025. Dr. Behl will serve a second term of five consecutive years from September 30, 2025 to September 29, 2030. The 68-year-old director holds qualifications including M.Com, MBA in Financial Management, and Ph.D in Corporate Disclosure Practices of Indian Companies. He brings over 39 years of teaching experience, having retired as Principal from Sri Aurobindo College of Commerce and Management, Ludhiana. Dr. Behl previously served as Director of Ludhiana Stock Exchange from 2012 to 2014 and has served as Independent Director in various listed companies. He is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1758803398009,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nahar Capital Services Reports Strong Q1 2025 Results, Schedules 20th AGM for September",
            "Summary": "Nahar Capital and Financial Services Ltd approved unaudited financial results for Q1 2025 ended June 30, 2025. The non-banking financial company reported standalone net profit of Rs 845.59 lakhs compared to Rs 1100.32 lakhs in the same quarter last year. Consolidated net profit stood at Rs 1148.12 lakhs versus Rs 1168.18 lakhs in Q1 2024. Total income on standalone basis was Rs 1480.65 lakhs. The company operates in two segments - Investment/Financial Activity and Real Estate Activity. The Board scheduled the 20th Annual General Meeting for September 25, 2025 via video conferencing. Share transfer books will remain closed from September 6-10, 2025, with September 5, 2025 as record date for dividend payment. Remote e-voting will be available from September 22-24, 2025. The company has two associate companies - Nahar Spinning Mills Limited and Nahar Poly Films Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753962269489,
            "Source": "corporate_action"
        },
        {
            "Title": "Nahar Capital Reports Decline in Q1 Profit and Revenue",
            "Summary": "Nahar Capital & Financial Services reported consolidated net profit of 115 million rupees in Q1, down from 117 million rupees in the same period last year. The company's revenue also declined to 57 million rupees compared to 65.7 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753961723274,
            "Source": "earnings"
        },
        {
            "Title": "ICRA Reaffirms A1+ Credit Rating for Nahar Capital's Rs 25 Crore Commercial Paper Programme",
            "Summary": "ICRA Limited has reaffirmed the credit rating of [ICRA] A1+ for Nahar Capital and Financial Services Limited's proposed Short Term Debt/Commercial Paper Programme worth Rs. 25 crores. The A1+ rating indicates a very strong degree of safety regarding timely payment of financial obligations and carries the lowest credit risk for such instruments.",
            "Sentiment": "positive",
            "PublishDate": 1753268801278,
            "Source": "stock"
        }
    ]
}