{
    "Symbol": "NAHARPOLY",
    "ISIN": "INE308A01027",
    "News": [
        {
            "Title": "Nahar Poly Films Q3FY26 Profit Jumps 147% YoY",
            "Summary": "Nahar Poly Films reported strong Q3FY26 results with net profit rising 147% YoY to ₹1,628.96 lakhs. Revenue from operations declined marginally to ₹16,747.09 lakhs amid improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1770466457174,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nahar Polyfilms Reports Strong Q2 Performance with 22% Jump in Net Profit",
            "Summary": "Nahar Polyfilms delivered robust quarterly results with net profit rising to 173M rupees from 127M rupees year-over-year, while EBITDA increased to 278M rupees from 227M rupees. The company's EBITDA margin expanded significantly to 16.12% from 13.47% despite revenue remaining relatively flat at 1.7B rupees versus 1.69B rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1763047900842,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Poly Films Shareholders Approve Re-appointment of Executive Director for Three-Year Term",
            "Summary": "Nahar Poly Films Limited shareholders approved the re-appointment of Mr. Satish Kumar Sharma as Executive Director during their 37th Annual General Meeting held on September 25, 2025. The appointment is effective for three years from August 1, 2026 to July 31, 2029. Mr. Sharma, aged 72, holds an MBA and has over 51 years of experience as a Corporate Executive. The meeting was conducted through video conferencing. Mr. Sharma is not debarred from holding the director position by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1758802893750,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nahar Poly Films Approves ₹4.50 Billion Investment for Third BOPP Film Production Line",
            "Summary": "Nahar Poly Films has approved an expansion plan for a third BOPP (Biaxially Oriented Polypropylene) film production line requiring an investment of ₹4.50 billion. The company reported strong quarterly performance with EBITDA rising to ₹278 million from ₹149 million year-over-year, while EBITDA margin improved significantly to 14.12% from 8.86% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1753964612260,
            "Source": "stock"
        },
        {
            "Title": "Nahar Poly Films Sets Record Date for Rs. 1 Dividend Payment and AGM E-Voting Schedule",
            "Summary": "Nahar Poly Films Limited has set September 5, 2025 as the record date for dividend payment of Rs. 1.00 per equity share of Rs. 5 each for the financial year ended March 31, 2025. The company's share transfer books will remain closed from September 5 to September 10, 2025. The dividend payment is subject to approval at the Annual General Meeting. Remote e-voting will be available from September 22 (9:00 am) to September 24, 2025 (5:00 pm), with September 18, 2025 set as the cut-off date for determining eligible shareholders. The company has engaged Central Depository Services (India) Limited for AGM participation through video conferencing and e-voting facilities.",
            "Sentiment": "neutral",
            "PublishDate": 1753964528923,
            "Source": "corporate_action"
        },
        {
            "Title": "Nahar Poly Films Reports Strong Q1 Results, Approves Rs 450 Crore Expansion Plan",
            "Summary": "Nahar Poly Films announced its quarterly results for the quarter ended June 30, 2025, showing revenue from operations of Rs 19,675.48 lakhs compared to Rs 16,777.52 lakhs in the same quarter last year. The company reported a profit of Rs 1,490.00 lakhs for the quarter versus Rs 398.02 lakhs in the previous year quarter. The Board approved a major expansion proposal to add a third BOPP film production line with annual capacity of 36,000 MT, requiring an investment of approximately Rs 450 crores. The expansion is expected to be completed within 2-3 years and will be financed through term loans from banks and internal accruals. The company currently operates at full capacity utilization of its existing 60,000 MT per annum capacity. The Board also scheduled the 37th Annual General Meeting for September 25, 2025, and set September 5, 2025 as the record date for dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1753963585319,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Polyfilms Schedules Board Meeting to Approve Quarterly Results and Rs. 450 Crore Expansion Plan",
            "Summary": "Nahar Polyfilms Limited has scheduled a Board of Directors meeting for July 31, 2025, to approve standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The board will also consider an expansion plan involving the installation of a third BOPP films production line with an annual capacity of 36,000 MT. The project requires a capital investment of approximately Rs. 450 crores, which will be funded through term loans and internal accruals. The company's trading window remains closed from July 1, 2025, until 48 hours after the financial results declaration.",
            "Sentiment": "positive",
            "PublishDate": 1753265415989,
            "Source": "corporate_action"
        },
        {
            "Title": "Nahar Polyfilms Reports Q4 Profit and Recommends Dividend",
            "Summary": "Nahar Polyfilms reported a net profit of 131 million rupees in Q4, compared to a loss of 20 million rupees in the same quarter last year and a profit of 66 million rupees in the previous quarter. The company's Q4 revenue was 1.57 billion rupees, up from 1.53 billion rupees year-over-year. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748477316000,
            "Source": "default"
        },
        {
            "Title": "Nahar Polyfilms Reports Q4 Results and Recommends Dividend",
            "Summary": "Nahar Polyfilms has announced its Q4 results and a dividend recommendation. The company's Q4 EBITDA increased to 235 million rupees from 17 million rupees year-over-year, with EBITDA margin improving to 14.99% from 1.12%. Net profit for Q4 was 131 million rupees, compared to a loss of 20 million rupees in the same period last year and a profit of 66 million rupees in the previous quarter. Q4 revenue stood at 1.57 billion rupees, up from 1.53 billion rupees year-over-year. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748434390000,
            "Source": "result"
        },
        {
            "Title": "Nahar Polyfilms Reports Profit in Q3 FY2024",
            "Summary": "Nahar Polyfilms has reported a net profit of 66 million rupees in the third quarter, compared to a loss of 89 million rupees in the same period last year. The company's revenue increased to 1.73 billion rupees from 1.53 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738628056000,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Polyfilms Reports Significant EBITDA Improvement in Q3",
            "Summary": "Nahar Polyfilms has reported a substantial improvement in its Q3 EBITDA, moving from a loss of 2.5 million rupees in the previous year to a gain of 151 million rupees. The company's EBITDA margin for the quarter stands at 8.73%.",
            "Sentiment": "positive",
            "PublishDate": 1738587222000,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Polyfilms Reports Profit in Q3 FY2024",
            "Summary": "Nahar Polyfilms has reported a net profit of 66 million rupees in the third quarter, compared to a loss of 89 million rupees in the same period last year. The company's revenue increased to 1.73 billion rupees from 1.53 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738587214000,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Polyfilms Reports Strong Q2 Financial Results",
            "Summary": "Nahar Polyfilms has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 127 million rupees, up from 83.4 million rupees in the same quarter last year and 40 million rupees in the previous quarter. Revenue also saw a boost, reaching 1.69 billion rupees compared to 1.37 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731455866000,
            "Source": "result"
        },
        {
            "Title": "Anil Kumar Goel Acquires 1.13% Stake in Nahar Polyfilms",
            "Summary": "<p><span class='neutral'>Investor</span> <b>Anil Kumar Goel</b> has <span class='positive'>emerged</span> as a <span class='neutral'>shareholder</span> in <b>Nahar Polyfilms</b>, holding a <span class='neutral'>1.13% stake</span> in the company during the <span class='neutral'>second quarter</span> of the fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728465208000,
            "Source": "normal_news"
        }
    ]
}