{
    "Symbol": "NAHARSPING",
    "ISIN": "INE290A01027",
    "News": [
        {
            "Title": "Nahar Spinning Mills Q3FY26 Loss Widens to ₹1291.63 Lakhs",
            "Summary": "Nahar Spinning Mills reported a net loss of ₹1291.63 lakhs for Q3FY26 compared to a profit of ₹75.50 lakhs in Q3FY25. Revenue declined 13.48% YoY to ₹70255.82 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770461105066,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nahar Spinning Mills Reports Mixed Financial Results for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Nahar Spinning Mills Limited announced un-audited financial results showing a net loss of Rs. 464.39 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs. 1,600.23 lakhs in the previous year quarter. The company's revenue from operations declined to Rs. 159,854.91 lakhs from Rs. 159,854.91 lakhs, with management noting that recent tariff impositions by the United States Government on textile imports have direct and indirect impact on the company's profitability.",
            "Sentiment": "negative",
            "PublishDate": 1763054812833,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Spinning Mills Re-appoints Two Non-Executive Directors at Annual General Meeting",
            "Summary": "Nahar Spinning Mills Limited re-appointed Sh. Dinesh Gogna (DIN: 00498670) and Sh. Kamal Oswal (DIN: 00493213) as Non-Executive Directors at its 45th Annual General Meeting held on September 25, 2025. Both directors had retired by rotation and offered themselves for re-appointment. Shareholders approved their re-appointment during the meeting conducted through video conferencing. The company confirmed that neither director has been debarred from holding office by SEBI or any other authority.",
            "Sentiment": "neutral",
            "PublishDate": 1758887322157,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nahar Spinning Mills Re-appoints Dr. Roshan Lal Behl as Independent Director for Second Term",
            "Summary": "Nahar Spinning Mills has re-appointed Dr. Roshan Lal Behl as an Independent Director for a second term of 5 consecutive years, effective from September 30, 2025 to September 29, 2030. The re-appointment was approved by shareholders at the 45th Annual General Meeting held on September 25, 2025 through video conferencing. Dr. Behl, 68, holds M.Com, MBA (Financial Management) and Ph.D. qualifications with over 39 years of teaching experience. He previously served as Principal at Sri Aurobindo College of Commerce and Management, Ludhiana, and as Director of Ludhiana Stock Exchange from 2012 to 2014. His previous term as Independent Director was set to expire on September 29, 2025, prompting the Board's proposal for re-appointment in its July 31, 2025 meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1758803429172,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nahar Spinning Mills Approves Rs 350 Crore Modernization Plan with 11 MW Solar Installation",
            "Summary": "Nahar Spinning Mills' Board of Directors approved a modernization plan for its spinning units across various locations. The plan involves replacing old ring frame machinery with ultra-modern equipment to increase production efficiency by 9% and installing an 11 MW Solar PV System. The total investment is Rs 350 crores, comprising Rs 325 crores for spinning unit modernization and Rs 25 crores for the solar system. The project will be completed by FY 2027-28 and financed through internal accruals and bank term loans. The company operates with 573,408 spindles, 1,080 rotors, and 769 airjet spindles at 94.15% capacity utilization. The modernization aims to improve operational efficiency, product quality, reduce production costs, and enable diversification into quality-conscious markets in the U.S. and European Union.",
            "Sentiment": "positive",
            "PublishDate": 1753959231279,
            "Source": "stock"
        },
        {
            "Title": "Nahar Spinning Mills Reports Q1 FY2026 Results, Approves Rs 350 Crore Modernization Plan",
            "Summary": "Nahar Spinning Mills Limited reported quarterly results for the period ended June 30, 2025, with revenue from operations at Rs 819.28 crores compared to Rs 820.88 crores in the same quarter last year. The company posted a profit of Rs 15.96 crores for the quarter versus Rs 6.64 crores in the previous year. The board approved a modernization plan for spinning units worth approximately Rs 325 crores and an 11 MW solar PV system costing Rs 25 crores. The company declared a dividend of Rs 1.00 per equity share with September 5, 2025 as the record date. The 45th Annual General Meeting is scheduled for September 25, 2025 through video conferencing, with remote e-voting from September 22-24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753958325434,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Spinning Mills Reports 141% Jump in Q1 Net Profit to 160M Rupees",
            "Summary": "Nahar Spinning Mills reported Q1 net profit of 160 million rupees compared to 66.4 million rupees in the same period last year, marking a significant increase. Revenue remained relatively stable at 8.19 billion rupees versus 8.21 billion rupees year-over-year. The company's EBITDA improved to 579 million rupees from 525.2 million rupees, while EBITDA margin expanded to 7.07% from 6.4% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753957559543,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Spinning Mills Schedules Board Meeting to Approve Q2 Results and Rs. 350 Crore Capital Investment Plans",
            "Summary": "Nahar Spinning Mills has scheduled a Board of Directors meeting for July 31, 2025, to approve unaudited financial results for the quarter ended June 30, 2025. The board will also consider approving a modernization plan for the company's spinning units at various locations with a capital outlay of approximately Rs. 325 crores. Additionally, the company plans to install an 11 MW Solar PV System for its own consumption at a capital cost of Rs. 25 crores. The trading window for the company's securities remains closed from July 1, 2025, until 48 hours after the declaration of quarterly results.",
            "Sentiment": "positive",
            "PublishDate": 1753265403211,
            "Source": "corporate_action"
        },
        {
            "Title": "Nahar Spinning Mills Reports Q4 Profit and Recommends Dividend",
            "Summary": "Nahar Spinning Mills reported a net profit of 224 million rupees in Q4, compared to a loss of 3.72 million rupees in the same quarter last year. The company's revenue increased to 8.76 billion rupees from 8.15 billion rupees year-over-year. Sequentially, the profit rose from 7.6 million rupees in the previous quarter. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748477318000,
            "Source": "default"
        },
        {
            "Title": "Nahar Spinning Mills Reports Q4 Results and Dividend Recommendation",
            "Summary": "Nahar Spinning Mills has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 8.76 billion rupees from 8.15 billion rupees year-over-year. EBITDA for Q4 rose to 662.3 million rupees from 417.7 million rupees in the previous year, with the EBITDA margin improving to 7.56% from 5.12%. Additionally, the company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748432579000,
            "Source": "result"
        },
        {
            "Title": "Nahar Spinning Mills Reports Q4 Profit of 224M Rupees",
            "Summary": "Nahar Spinning Mills has reported a net profit of 224 million rupees in the latest quarter, compared to a loss of 3.72 million rupees in the same quarter of the previous year. The company also showed improvement from the previous quarter, with profit increasing from 7.6 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1748432549000,
            "Source": "result"
        },
        {
            "Title": "Nahar Spinning Mills Reports Profit in Q3 FY2024",
            "Summary": "Nahar Spinning Mills has reported a net profit of 7.6 million rupees in the third quarter, compared to a loss of 152 million rupees in the same period last year. The company's revenue increased to 8.12 billion rupees from 7.58 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738628104000,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Spinning Mills Reports Significant Increase in Q3 EBITDA",
            "Summary": "Nahar Spinning Mills has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 382 million rupees, up from 184 million rupees in the same quarter of the previous year. This represents a significant year-over-year growth. Additionally, the EBITDA margin improved to 4.7%, compared to 2.42% in the corresponding quarter last year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738581985000,
            "Source": "earnings"
        },
        {
            "Title": "Nahar Spinning Mills Reports Profit in Q3 FY2024",
            "Summary": "Nahar Spinning Mills has reported a net profit of 7.6 million rupees in the third quarter, compared to a loss of 152 million rupees in the same period last year. The company's revenue increased to 8.12 billion rupees from 7.58 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738581974000,
            "Source": "earnings"
        },
        {
            "Title": "Anil Kumar Goel Reduces Stake in Nahar Spinning Mills",
            "Summary": "<p><span class=\"neutral\">Investor</span> <b>Anil Kumar Goel</b> has <span class=\"negative\">reduced</span> his <span class=\"neutral\">stake</span> in <b>Nahar Spinning Mills</b> from <span class=\"neutral\">5.27%</span> to <span class=\"neutral\">5.12%</span> during the <span class=\"neutral\">second quarter</span> of the financial year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728380319000,
            "Source": "normal_news"
        }
    ]
}