{
    "Symbol": "NAM-INDIA",
    "ISIN": "INE298J01013",
    "News": [
        {
            "Title": "Nippon Life India AMC Files Q3FY26 IPO Monitoring Report",
            "Summary": "Nippon Life India Asset Management submitted its quarterly monitoring report for IPO proceeds utilization, showing Rs. 189.91 crores remaining unutilized with Rs. 0.70 crores spent during Q3FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1769689753156,
            "Source": "stocks"
        },
        {
            "Title": "Nippon Life India AMC Reports Record Q3 Profits",
            "Summary": "Nippon Life India Asset Management delivered highest-ever quarterly operating profit of ₹458 crore and PAT of ₹404 crore in Q3 FY26, up 37% YoY. MF QAAUM reached ₹7.01 trillion with market share rising to 8.65%.",
            "Sentiment": "positive",
            "PublishDate": 1769686464848,
            "Source": "co_actions_results"
        },
        {
            "Title": "India poised for cyclical earnings upswing: Morgan Stanley",
            "Summary": "Morgan Stanley's Jonathan Garner forecasts mid-to-high teens earnings growth for India over next two years, citing policy easing and capex revival as key drivers despite valuation concerns.",
            "Sentiment": "positive",
            "PublishDate": 1768815091609,
            "Source": "global"
        },
        {
            "Title": "India to Remove More Defence Investment Barriers - Reuters",
            "Summary": "Government plans to eliminate additional factors discouraging foreign investment in defence sector beyond the recent FDI limit increase to 74%.",
            "Sentiment": "positive",
            "PublishDate": 1768554178133,
            "Source": "stocks"
        },
        {
            "Title": "India's December Unemployment Rate Stands at 4.8%",
            "Summary": "India recorded an unemployment rate of 4.8% in December, reflecting the current state of the country's labor market conditions during the month.",
            "Sentiment": "neutral",
            "PublishDate": 1768473738940,
            "Source": "stocks"
        },
        {
            "Title": "India's Services Trade Shows Strong Performance in Dec",
            "Summary": "India recorded services exports of $35.50 billion and imports of $17.38 billion in December, highlighting the country's robust services trade performance.",
            "Sentiment": "positive",
            "PublishDate": 1768467135724,
            "Source": "stocks"
        },
        {
            "Title": "India's December Trade Deficit Reaches $25.05 Billion",
            "Summary": "India recorded a trade deficit of $25.05 billion in December, reflecting the gap between imports and exports during the month as the country continues to navigate global trade dynamics.",
            "Sentiment": "neutral",
            "PublishDate": 1768467107199,
            "Source": "stocks"
        },
        {
            "Title": "India's December Goods Imports Reach $63.55 Billion",
            "Summary": "India's goods imports for December totaled $63.55 billion, reflecting the country's ongoing trade activity and import demand during the month.",
            "Sentiment": "neutral",
            "PublishDate": 1768467079683,
            "Source": "stocks"
        },
        {
            "Title": "India's December Goods Exports Hit $38.5 Billion",
            "Summary": "India recorded goods exports worth $38.5 billion in December, reflecting the country's ongoing trade performance during the month.",
            "Sentiment": "neutral",
            "PublishDate": 1768466627518,
            "Source": "stocks"
        },
        {
            "Title": "India's Market Economy Remains Best Path Forward",
            "Summary": "Despite global shift toward state intervention amid Cold War II tensions, India should maintain market-oriented policies while leveraging strategic government support for optimal economic growth and competitiveness.",
            "Sentiment": "neutral",
            "PublishDate": 1768183562425,
            "Source": "stocks"
        },
        {
            "Title": "Nippon Life India AMC Approves New CEO Appointment",
            "Summary": "Nippon Life India Asset Management shareholders approve Sundeep Sikka's appointment as MD & CEO and ESOP plan amendments through postal ballot with over 98% support for both resolutions.",
            "Sentiment": "positive",
            "PublishDate": 1767975243216,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nippon Life India AMC Postal Ballot Results",
            "Summary": "Nippon Life India Asset Management announces successful postal ballot results with overwhelming shareholder approval for key resolutions including CEO appointment and ESOP amendments on January 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767974967636,
            "Source": "co_actions_results"
        },
        {
            "Title": "India cuts US Treasury holdings by 21% in 2025",
            "Summary": "India reduced US Treasury securities holdings by 21% to $190.7 billion by October 2025, marking first annual decline in four years as part of strategic reserve diversification amid global uncertainties.",
            "Sentiment": "neutral",
            "PublishDate": 1767967386043,
            "Source": "currency"
        },
        {
            "Title": "India Inc eyes best earnings growth in 2 years",
            "Summary": "India Inc expected to report 16% YoY profit growth in Q3, marking best earnings growth in two years. However, 9 companies may see over 50% profit decline, with IndusInd Bank facing steepest 92% fall.",
            "Sentiment": "neutral",
            "PublishDate": 1767938555701,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nippon Life India AMC Q3FY26 Earnings Call on Jan 29",
            "Summary": "Nippon Life India Asset Management announces investor conference call scheduled for January 29, 2026 at 5:00 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767782621433,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Imported €144 Billion Russian Oil Since Ukraine War",
            "Summary": "India emerges as second-largest buyer of Russian oil with €144 billion imports since February 2022, though recent US sanctions have reduced purchases from 40% to under 25% of total crude imports.",
            "Sentiment": "neutral",
            "PublishDate": 1767710618902,
            "Source": "global"
        },
        {
            "Title": "Nippon Life India AMC Manager Ajay Patel Retires",
            "Summary": "Nippon Life India Asset Management announces retirement of Mr. Ajay Patel as Manager and Key Managerial Personnel effective January 2, 2026, upon reaching superannuation age.",
            "Sentiment": "neutral",
            "PublishDate": 1767346010038,
            "Source": "stocks"
        },
        {
            "Title": "India's Growth Story: Key Sectors Set for FY27 Expansion",
            "Summary": "India's economy, now world's fifth-largest at $4.1 trillion GDP, expected to grow 7% annually in FY27. Government reforms including monetary easing, tax cuts, and regulatory changes position financials, metals, and cement sectors for strong growth.",
            "Sentiment": "positive",
            "PublishDate": 1766901988576,
            "Source": "stocks"
        },
        {
            "Title": "India Expands Trade Network With Seven New FTAs Since 2021",
            "Summary": "India has concluded negotiations on Free Trade Agreements with New Zealand, Oman, UK, and four other nations since 2021, creating new opportunities for exporters and professionals across multiple sectors.",
            "Sentiment": "positive",
            "PublishDate": 1766820196403,
            "Source": "stocks"
        },
        {
            "Title": "India Imposes 5-Year Anti-Dumping Duty on Steel Imports",
            "Summary": "India has implemented a five-year anti-dumping duty on specific steel imports from China to protect domestic steel manufacturers from unfair trade practices and price distortions.",
            "Sentiment": "neutral",
            "PublishDate": 1766075061002,
            "Source": "global"
        },
        {
            "Title": "India's Trade Deficit Hits $24.53B in November",
            "Summary": "India recorded merchandise exports of $38.13 billion and imports of $62.66 billion in November, resulting in a significant trade deficit of $24.53 billion for the month.",
            "Sentiment": "neutral",
            "PublishDate": 1765785261473,
            "Source": "stocks"
        },
        {
            "Title": "Nippon Life India AMC Seeks Shareholder Approval",
            "Summary": "Nippon Life India Asset Management seeks member approval for Sundeep Sikka's appointment as MD & CEO for five years from April 2026, and amendments to ESOP 2019 plan through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1765385708727,
            "Source": "stocks"
        },
        {
            "Title": "Nippon Life India Asset Management Allots 2.88 Lakh Equity Shares Under Employee Stock Plans",
            "Summary": "Nippon Life India Asset Management's Allotment Committee approved the allotment of 2,88,367 equity shares across four employee stock option and performance-linked schemes on November 20, 2025. The allotment increases the company's paid-up equity share capital to 63,69,92,837 shares of face value Rs. 10 each, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "negative",
            "PublishDate": 1763642734117,
            "Source": "corporate_governance"
        },
        {
            "Title": "DWS Group Acquires 40% Stake in Nippon Life India's Alternative Investment Fund Business",
            "Summary": "German asset manager DWS Group will acquire a 40% stake in Nippon Life India Asset Management's alternatives business to scale operations across alternatives, active and passive assets. The partnership includes plans to jointly launch passive products and establish global distribution arrangements for India-focused mutual fund strategies through DWS' international network.",
            "Sentiment": "positive",
            "PublishDate": 1763079566002,
            "Source": "order&deals"
        },
        {
            "Title": "Nippon Life India Asset Management Allots 57,654 Equity Shares Under Employee Stock Plans",
            "Summary": "Nippon Life India Asset Management Limited's Allotment Committee approved the allotment of 57,654 equity shares on November 12, 2025. The allotment includes 13,250 shares under the Employee Stock Option Plan 2017, 32,450 shares under the Employee Stock Option Plan 2019, 8,974 shares under the Employee Stock Option Scheme 2023, and 2,980 shares under the Performance Linked Stock Unit Scheme 2023. All shares have a face value of Rs. 10 each. Following this allotment, the company's paid-up equity share capital increased to 63,67,04,470 equity shares. The newly allotted shares will rank equally with existing equity shares in all respects.",
            "Sentiment": "neutral",
            "PublishDate": 1762932485969,
            "Source": "corporate_action"
        },
        {
            "Title": "Nippon Life India Asset Management Reports Record Operating Profit of INR 4.19bn in Q2 FY26",
            "Summary": "Nippon Life India Asset Management achieved its highest ever quarterly operating profit of INR 4.19 billion, marking a 15% year-over-year and 11% quarter-over-quarter increase. The company was the fastest growing AMC among top-10 AMCs in H1 FY26, with total AUM reaching INR 7.61 trillion. Market share increased to 8.51%, the highest since June 2019, while equity market share grew to 7.13%. Revenue stood at INR 6.58 billion, up 15% year-over-year. The company maintains the largest investor base in the mutual fund industry with 21.9 million unique investors. Monthly systematic book rose 16% year-over-year to INR 36.4 billion. The Board declared an interim dividend of INR 9.00 per share. ETF business continues strong performance with 19.77% market share and 50% share in industry ETF folios.",
            "Sentiment": "positive",
            "PublishDate": 1762180561707,
            "Source": "earnings"
        },
        {
            "Title": "Nippon Life India Asset Management Reports IPO Proceeds Monitoring for Quarter Ended September 2025",
            "Summary": "Nippon Life India Asset Management Limited submitted its monitoring agency report for IPO proceeds utilization for the quarter ended September 30, 2025. The company's initial public offering raised Rs. 1,542.24 crores, comprising Rs. 616.90 crores fresh issue and Rs. 925.34 crores offer for sale. HDFC Bank Limited served as the monitoring agency. The report shows Rs. 190.02 crores of unutilized IPO proceeds as of September 30, 2025, with Rs. 170 crores invested in HDFC Bank fixed deposits earning 6% returns and maturing March 30, 2026. The company has fully utilized funds for advertising, marketing and brand building activities (Rs. 72.08 crores), continuing interest in new mutual fund schemes (Rs. 100 crores), and inorganic growth initiatives (Rs. 165 crores). The monitoring agency confirmed no deviations from disclosed objects and declared no conflict of interest.",
            "Sentiment": "neutral",
            "PublishDate": 1761844789632,
            "Source": "corporate_action"
        },
        {
            "Title": "Nippon Life India Projects 15-17% AUM Growth Through FY27",
            "Summary": "Nippon Life India has projected a 15-17% compound annual growth rate (CAGR) for its assets under management (AUM) through FY27. The company plans to achieve this growth through rising retail systematic investment plan (SIP) flows and expansion of passive products. The firm expects to maintain operating margins above 38% and aims for double-digit profit growth with higher return on equity (ROE) visibility. The growth strategy includes focus on digital distribution channels and global mandates.",
            "Sentiment": "positive",
            "PublishDate": 1761835318316,
            "Source": "mutualfunds"
        },
        {
            "Title": "Nippon Life India Asset Management Reports Q2 Results, Declares Rs 9 Interim Dividend and Extends CEO Term",
            "Summary": "Nippon Life India Asset Management Limited reported quarterly results with profit after tax of Rs 3.45 billion, down 4% year-over-year, while operating profit reached Rs 4.19 billion, up 15% year-over-year. The Board approved an interim dividend of Rs 9 per equity share with record date November 6, 2025 and payment from November 14, 2025. The company appointed Sundeep Sikka as Managing Director and CEO for 5 years from April 22, 2026 to April 21, 2031. Mutual fund quarterly average assets under management stood at Rs 6.57 trillion, up 20% year-over-year, with market share increasing 22 basis points to 8.51%. The company manages assets worth Rs 7.61 trillion as of September 30, 2025. Systematic flows for the quarter were Rs 107.2 billion, up 19% year-over-year. The company is shifting its registered office within Mumbai from Peninsula Business Park to One Lodha Place, effective November 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761831571125,
            "Source": "corporate_action"
        },
        {
            "Title": "Nippon Life India AMC Reports Mixed Q2 Results with Revenue Growth Despite Profit Decline",
            "Summary": "Nippon Life India AMC reported consolidated net profit of 3.45 billion rupees in Q2, down from 3.6 billion rupees in the same period last year. Revenue increased to 6.58 billion rupees from 5.71 billion rupees year-over-year. EBITDA rose to 3.18 billion rupees compared to 2.48 billion rupees previously, while EBITDA margin improved to 48.36% from 43.39% in the prior year period.",
            "Sentiment": "neutral",
            "PublishDate": 1761819990954,
            "Source": "earnings"
        },
        {
            "Title": "Nippon Life India Asset Management Schedules Board Meeting for Q2 FY2026 Results and Interim Dividend Consideration",
            "Summary": "Nippon Life India Asset Management Limited will hold a Board of Directors meeting on October 30, 2025 to consider and approve unaudited financial results for the quarter and half year ending September 30, 2025. The board will also consider declaration of interim dividend. The company's trading window will be closed from October 1, 2025 to November 1, 2025 for directors, designated persons and connected persons under the company's trading policy.",
            "Sentiment": "neutral",
            "PublishDate": 1758889432605,
            "Source": "corporate_action"
        },
        {
            "Title": "Nippon Life India Asset Management Reports Record Quarterly Operating Profit of INR 3.78 Billion",
            "Summary": "Nippon Life India Asset Management achieved its highest ever quarterly operating profit of INR 3.78 billion and profit after tax of INR 3.96 billion for Q1 FY26. The company was the fastest growing AMC among top-10 AMCs on both quarterly and yearly basis. Revenue stood at INR 6.07 billion, up 20% year-on-year and 7% quarter-on-quarter. The company's market share increased to 8.49%, its highest since June 2019, with the largest increase in AUM market share in the industry on a quarterly basis. Total assets under management reached INR 7.44 trillion, including mutual funds, managed accounts, offshore funds and GIFT City. Mutual Fund QAAUM grew 27% year-on-year and 10% quarter-on-quarter to INR 6.13 trillion. The company maintains the largest investor base in the mutual fund industry with 21.2 million unique investors. Monthly systematic book rose 29% year-on-year to INR 33.2 billion for June 2025, with SIP market share at 10.07%. Digital purchase transactions increased 27% year-on-year to 3.57 million, contributing 75% of total new purchase transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753968431653,
            "Source": "earnings"
        },
        {
            "Title": "Nippon Life India Asset Management Uploads Earnings Call Audio Recording",
            "Summary": "Nippon Life India Asset Management Limited conducted an earnings call on July 28, 2025 to discuss financial results for the quarter ended June 30, 2025. The company has uploaded the audio recording of the earnings call to its website at the corporate transcripts section. The call was held as previously announced in the company's July 2, 2025 intimation to the stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753719539029,
            "Source": "earnings"
        },
        {
            "Title": "Nippon Life India AMC Reports 19% Jump in Net Profit to ₹396 Crore",
            "Summary": "Nippon Life India Asset Management Company reported a 19% increase in net profit to ₹396 crore in the June quarter, compared to ₹332 crore in the same period last year. Revenue grew 20% to ₹607 crore while other income rose 11% to ₹146 crore. Assets under management increased 27% to ₹6.13 lakh crore from ₹4.84 lakh crore. The company's unique investor base expanded 23% to 21 million investors. Equity and debt assets maintained their contribution at 47% and 15% respectively, while ETF contribution increased to 28% from 26%. The fund house registered double-digit equity net sales and SIP market share. Nippon India Alternative Investments received total commitments of ₹8,100 crore across four business lines including Public Equity, Real Estate, Private Credit and Venture Capital.",
            "Sentiment": "positive",
            "PublishDate": 1753715431984,
            "Source": "earnings"
        },
        {
            "Title": "Nippon Life India AMC Reports 20% Jump in Net Profit to ₹607 Crore",
            "Summary": "Nippon Life India Asset Management reported a 20.2% year-on-year increase in net profit to ₹607 crore for the quarter ended June 30, 2025, compared to ₹505 crore in the same period last year. Revenue from operations grew 19.3% to ₹396 crore. The company achieved 27% growth in mutual fund QAAUM to ₹6,13,000 crore, becoming the fastest-growing asset management company among top-10 players. Market share in mutual funds increased by 29 basis points to 8.49%, while equity market share expanded by 19 basis points to 7.04%. Systematic flows rose 30% to ₹9,770 crore. The company maintains the largest unique investor base at 21.2 million with 38.3% market share. Total assets under management stood at ₹8,670 crore. Retail assets contributed 29% to total AUM at ₹2,190 crore, above the industry average of 27%. HNI AUM increased 32% to ₹2,210 crore, while corporate AUM grew 24% to ₹3,050 crore. The company's shares closed at ₹789.00, down 2.61% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1753698684332,
            "Source": "earnings"
        },
        {
            "Title": "Nippon Life India AMC Reports Strong Q1 FY26 Performance with 27% AUM Growth",
            "Summary": "Nippon Life India AMC delivered robust quarterly results with Assets Under Management growing 27% year-over-year. The company's revenue increased to 6.06 billion rupees from 5.05 billion rupees in the previous year. Consolidated net profit rose to 3.96 billion rupees compared to 3.32 billion rupees year-over-year, representing strong profitability growth across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1753693502223,
            "Source": "mutualfunds"
        },
        {
            "Title": "95 Companies Including Infosys, Bajaj Finance, and Nestle to Report Quarterly Earnings This Week",
            "Summary": "95 companies are scheduled to announce their quarterly results this week as India's earnings season gains momentum. Major companies reporting include Infosys, Zomato, UltraTech Cement, Paytm, Bajaj Housing Finance, Bajaj Finance, Bajaj Finserv, Nestle India, Shriram Finance, Tata Chemicals, Dixon Technologies, IDFC First Bank, and Kotak Mahindra Bank. The earnings announcements are spread across the week from July 21st to July 26th, with notable companies like UltraTech Cement and Zomato reporting on July 21st, Paytm on July 22nd, Infosys and Dr. Reddy's on July 23rd, Bajaj Finance and Nestle India on July 24th, and Kotak Mahindra Bank on July 26th.",
            "Sentiment": "neutral",
            "PublishDate": 1752987796942,
            "Source": "earnings"
        },
        {
            "Title": "Nippon Life India to Announce Q1 Results",
            "Summary": "Nippon Life India has scheduled the announcement of its Q1 results for July 28.",
            "Sentiment": "neutral",
            "PublishDate": 1750938752000,
            "Source": "default"
        },
        {
            "Title": "Nippon Life India Asset Management: Q4 Profit Beats Estimates",
            "Summary": "Nippon Life's Q4 profit exceeded expectations due to tax reversal and other income. The company's market share for quarterly average AUM increased to 8.3%, with equity market share rising to 6.9%. ETF market share surged to 19.1%. Equity/ETFs share in MF AUM improved to 49.8%/27.6%, while debt/liquid share declined.",
            "Sentiment": "positive",
            "PublishDate": 1745894910000,
            "Source": "earnings"
        },
        {
            "Title": "Nippon Life India Asset Management: Q4 Profit Dips Despite Revenue Growth",
            "Summary": "Nippon Life India Asset Management reported an 8.9% YoY decline in Q4 net profit to ₹296 crore. However, total income rose 21.9% to ₹526.5 crore, and EBITDA increased 25.9% to ₹358.4 crore. EBITDA margin improved to 68% from 65.9% last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745849943000,
            "Source": "earnings"
        },
        {
            "Title": "Nippon Life India AMC Reports Q4 Financial Results",
            "Summary": "Nippon Life India Asset Management Company (AMC) has released its Q4 financial results. The company reported a consolidated net profit of 2.98 billion rupees, down from 3.4 billion rupees year-over-year and 2.95 billion rupees quarter-over-quarter. However, revenue increased to 5.7 billion rupees from 4.7 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745841463000,
            "Source": "result"
        },
        {
            "Title": "Nippon Life India Asset Management: Website and Mobile App Fully Restored After Cyberattack",
            "Summary": "Nippon Life India Asset Management Ltd. has fully restored its website and mobile application following a cyberattack on April 9. The company's core operating systems for fund management were restored within the next workday. The firm reported no significant impact on operations due to the incident.",
            "Sentiment": "positive",
            "PublishDate": 1745243569000,
            "Source": "normal_news"
        },
        {
            "Title": "Nippon Life India Asset Management Restores Services After Cyber Security Incident",
            "Summary": "Nippon Life India Asset Management has reported that its mobile application and website are now fully functional following a cyber security incident. The company initiated the restoration process and states that there has been no material impact on its operations due to the incident.",
            "Sentiment": "neutral",
            "PublishDate": 1745241895000,
            "Source": "default"
        },
        {
            "Title": "Nippon Life India Asset Management: Website Down Following Cyberattack",
            "Summary": "Nippon Life India Asset Management's website has been inaccessible since a cyberattack on April 9. The company is working with cybersecurity experts to investigate and resolve the issue. Investors can still access funds through alternative platforms.",
            "Sentiment": "negative",
            "PublishDate": 1744886943000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nippon Life India Asset Management to Consider Q4 Results on April 28",
            "Summary": "Nippon Life India Asset Management has announced that it will consider its fourth quarter (Q4) financial results on April 28. This announcement indicates that the company will review and potentially approve its financial performance for the last quarter of the fiscal year on that date.",
            "Sentiment": "neutral",
            "PublishDate": 1742991020000,
            "Source": "result"
        },
        {
            "Title": "Nippon Life India Asset Management Launches ETF Feeder Fund in GIFT City for Japanese Investors",
            "Summary": "Nippon Life India Asset Management has partnered with Nissay Asset Management of Japan to launch an ETF feeder fund in GIFT City. This first-of-its-kind fund aims to provide Japanese investors with access to the Indian capital market, offering them opportunities to participate in India's economic growth.",
            "Sentiment": "positive",
            "PublishDate": 1739233150000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nippon Life India Asset Management Launches Fund for Japanese Investors",
            "Summary": "Nippon Life India Asset Management has announced the launch of a new fund targeting Japanese investors. The fund aims to provide opportunities for Japanese investors to participate in India's economic growth story. This initiative will allow the company to source investments directly from Japanese investors, potentially opening up a new market for Indian assets.",
            "Sentiment": "positive",
            "PublishDate": 1739200499000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nippon Life India Asset Management Launches ETF Feeder Fund in GIFT City",
            "Summary": "Nippon Life India Asset Management has partnered with Nissay Asset Management of Japan to provide Japanese investors access to the Indian capital market. The company has launched an ETF feeder fund in GIFT City, which is described as the first of its kind.",
            "Sentiment": "positive",
            "PublishDate": 1739200492000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nippon Life India Asset Management: Launches Active Momentum Fund",
            "Summary": "Nippon Life India Asset Management announces the launch of Nippon India Active Momentum Fund, an open-ended equity scheme aiming for long-term capital appreciation. The NFO opens on February 10 and closes on February 24, with a minimum investment of ₹500. The fund will blend market wisdom and fundamental research factors, potentially employing additional risk mitigation strategies.",
            "Sentiment": "positive",
            "PublishDate": 1738850074000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nippon Life India Asset Management: Q3 Profit Rises 3.9% YoY",
            "Summary": "Nippon Life reported Q3 FY25 results with profit up 3.9% YoY to ₹295.36 crore and revenue up 38.88% to ₹587.89 crore. Operating income increased 49.93% YoY. EPS rose 2.23% to ₹4.58. Analysts' consensus recommendation is 'Buy'.",
            "Sentiment": "positive",
            "PublishDate": 1737696027000,
            "Source": "earnings"
        }
    ]
}