{
    "Symbol": "NARMADA",
    "ISIN": "INE117Z01011",
    "News": [
        {
            "Title": "Narmada Agrobase Reports Q2 FY26 Results with 13.22% EBITDA Margin",
            "Summary": "Narmada Agrobase Limited delivered total income of Rs. 1,228.16 lakhs in Q2 FY26 with EBITDA of Rs. 162.38 lakhs and PAT of Rs. 102.66 lakhs, reflecting net margin of 8.36%. The cattle feed and cotton seed manufacturer operates with balanced revenue mix of 52% cattle feed and 48% cotton seed, maintaining operations across Gujarat, Maharashtra and Madhya Pradesh markets.",
            "Sentiment": "positive",
            "PublishDate": 1764411519613,
            "Source": "earnings"
        },
        {
            "Title": "Narmada Agrobase Reports 19% Revenue Growth in Q2 FY26 Despite Margin Pressure",
            "Summary": "Narmada Agrobase Limited reported total income of ₹1,228.16 lakhs and net profit of ₹102.66 lakhs in Q2 FY26, with 19% YoY revenue growth driven by healthy volume expansion in cattle feed segment. The Gujarat-based manufacturer faced EBITDA margin pressure due to elevated raw material costs, particularly cottonseed and allied inputs, despite strong demand from dairy and poultry activities.",
            "Sentiment": "positive",
            "PublishDate": 1763207821036,
            "Source": "earnings"
        },
        {
            "Title": "Narmada Agrobase Reports Strong Q1 FY26 Results with 82% EBITDA Growth",
            "Summary": "Narmada Agrobase Limited reported total income of Rs. 11.41 crores in Q1 FY26. EBITDA increased 82% quarter-on-quarter to Rs. 1.65 crore with a margin of 14.47%. PAT grew 31% quarter-on-quarter to Rs. 1.02 crore with an 8.93% margin. The company operates in cattle feed and cotton seed products segments, with flagship brands including Gaay Chhaap, Narmada Super, and Churma. The company is expanding domestically to Maharashtra, Madhya Pradesh, North Rajasthan, and Punjab, while targeting international markets in Southeast Asia, Middle East and Africa. Management is in talks with companies in Vietnam and aims to achieve 15-20% revenue from exports within three years. Current capacity utilization stands at 50% with expectations to double by FY27. The company maintains a monthly production capacity of 4,000 tonnes and holds ISO 9001-2015 certification.",
            "Sentiment": "positive",
            "PublishDate": 1756367403004,
            "Source": "earnings"
        },
        {
            "Title": "Narmada Agrobase Schedules Q1FY26 Earnings Conference Call for August 22",
            "Summary": "Narmada Agrobase Limited has announced a conference call to discuss Q1FY26 earnings, scheduled for August 22, 2025 at 1:00 PM IST. The call will be hosted by Kirin Advisors with Chairman and Managing Director Neeraj Kumar Agrawal participating as the speaker from management. The company has provided dial-in numbers and registration details for participants, advising them to connect 10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1755520760333,
            "Source": "earnings"
        },
        {
            "Title": "Narmada Agrobase Reports Strong Q1 FY26 Results with EBITDA Margins Expanding 1140 Basis Points",
            "Summary": "Narmada Agrobase Limited, a manufacturer of cattle feed and agro-based byproducts, reported strong quarterly results with total income of ₹1,141.34 lakhs. The company's EBITDA margins expanded significantly by 1140 basis points quarter-on-quarter to 14.47%, while EBITDA increased 82.01% to ₹165.10 lakhs. Profit After Tax margins improved by 630 basis points to 8.93%, with PAT growing 30.98% to ₹101.90 lakhs. Chairman & Managing Director Neeraj Agrawal attributed the performance to the company's focus on delivering superior quality products and operational excellence. The Gujarat-based ISO certified company specializes in cottonseed-based cattle feed and is planning expansion into Asia-Pacific markets. In FY25, the company reported total revenue of ₹6,633.91 lakh, EBITDA of ₹623.82 lakh, and PAT of ₹408.79 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1754561818731,
            "Source": "earnings"
        },
        {
            "Title": "Narmada Agrobase Approves Quarterly Results and Reshuffles Board with Director Changes",
            "Summary": "Narmada Agrobase Limited held a board meeting on August 6, 2025, to approve unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of ₹1,108.19 lakhs and profit for the period of ₹77.89 lakhs, with earnings per share of ₹0.21. The board approved significant leadership changes including the resignation of two Independent Directors - Mr. Gaurav Dineshkumar and Mrs. Nidhi Dineshbhai Patel, both citing personal and unavoidable circumstances. To fill these positions, the company appointed Mr. Deepak Soni, a Chartered Accountant, and Mrs. Shweta Vivek Nathwani, who holds a Bachelor of Commerce degree, as Additional Independent Directors. The statutory auditors Jain Kedia & Sharma Chartered Accountants issued an unmodified limited review report on the financial results. The board also reconstituted its committees following the director changes.",
            "Sentiment": "neutral",
            "PublishDate": 1754486545815,
            "Source": "earnings"
        },
        {
            "Title": "Narmada Agrobase Schedules Board Meeting for Q1 FY2026 Results and Director Changes",
            "Summary": "Narmada Agrobase Limited will hold a board meeting on August 6, 2025, to approve unaudited financial results for the quarter ended June 30, 2025. The meeting will address the resignation of two independent directors - Gaurav Dineshkumar Agarwal and Nidhi Dineshbhai Patel - effective August 6, 2025. The company plans to appoint Deepak Soni and Shweta Vivek Nathwani as new independent directors on the same date. The board will also reconstitute company committees. The company's trading window remains closed from July 1, 2025, and will reopen on August 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753950064879,
            "Source": "corporate_action"
        },
        {
            "Title": "Narmada Agrobase: Penny Stock Surges 5% Post Q2 Results",
            "Summary": "Narmada Agrobase Ltd's stock price increased by 5% intraday, hitting the upper circuit, following the release of its Q2 results. This rise occurred despite overall market volatility.",
            "Sentiment": "positive",
            "PublishDate": 1731578771000,
            "Source": "result"
        }
    ]
}