{
    "Symbol": "NATCOPHARM",
    "ISIN": "INE987B01026",
    "News": [
        {
            "Title": "Natco Pharma Q3FY26 Results: Revenue ₹705.4 Cr",
            "Summary": "Natco Pharma reported consolidated revenue of ₹705.4 crore and net profit of ₹151.3 crore for Q3FY26. Board declared interim dividend of ₹1.50 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770909223348,
            "Source": "co_actions_results"
        },
        {
            "Title": "Natco Pharma Declares Rs 1.50 Interim Dividend",
            "Summary": "Natco Pharma announces third interim dividend of Rs 1.50 per equity share for FY 2025-26, with record date set for February 18, 2026 and payment starting February 26, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770894779558,
            "Source": "co_actions_results"
        },
        {
            "Title": "Natco Pharma Gets HC Nod for Semaglutide Manufacturing",
            "Summary": "High Court permits Natco Pharma to manufacture and export semaglutide to select nations, marking significant regulatory approval for the pharmaceutical company's diabetes drug production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1770186881237,
            "Source": "stocks"
        },
        {
            "Title": "Natco Pharma Gets FDA Tentative Approval for Generic",
            "Summary": "Natco Pharma receives tentative FDA approval for generic Erdafitinib tablets, targeting advanced urothelial carcinoma market with expected U.S. sales of $60 million.",
            "Sentiment": "positive",
            "PublishDate": 1770105436999,
            "Source": "stocks"
        },
        {
            "Title": "Natco Pharma Acquires Full Ownership of Indonesian Unit",
            "Summary": "Natco Pharma completes acquisition of remaining 49% stake in PT Natco Lotus Farma for IDR 14.08 billion (₹7.7 crores), achieving 100% ownership of its Indonesian subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1769757803431,
            "Source": "co_actions_results"
        },
        {
            "Title": "Natco Pharma Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Natco Pharma announces board meeting on February 12, 2026 to review Q3FY26 unaudited financial results and consider third interim dividend for FY26. Trading window closed from Jan 29-Feb 14.",
            "Sentiment": "neutral",
            "PublishDate": 1769596494720,
            "Source": "co_actions_results"
        },
        {
            "Title": "Natco Pharma Clarifies Novo Nordisk Patent Dispute",
            "Summary": "Natco Pharma responds to BSE query on Novo Nordisk semaglutide patent litigation, stating ongoing proceedings with no current material financial impact on company operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767682248801,
            "Source": "stocks"
        },
        {
            "Title": "Natco Pharma Appoints Amit Parekh as Executive VP Finance, Plans CFO Succession",
            "Summary": "Natco Pharma's Board approved the appointment of Amit Parekh as Executive Vice President-Finance and Accounts with effect from December 2, 2025. As part of structured succession planning, Parekh will succeed S.V.V.N. Appa Rao as Chief Financial Officer at the Board meeting scheduled for February 2026, subject to necessary approvals.",
            "Sentiment": "positive",
            "PublishDate": 1764659988947,
            "Source": "corporate_governance"
        },
        {
            "Title": "Natco Pharma Appoints Amit Parekh as Executive Vice President",
            "Summary": "Natco Pharma has appointed Amit Parekh as Executive Vice President, bringing over 20 years of pharmaceutical industry experience to the company. Parekh previously worked at Dr. Reddy's Laboratories, adding senior leadership expertise to Natco's management team.",
            "Sentiment": "positive",
            "PublishDate": 1764659434450,
            "Source": "corporate_governance"
        },
        {
            "Title": "Natco Pharma Gets Credit Rating Reaffirmation from ICRA with Enhanced Limits",
            "Summary": "ICRA Limited reaffirmed Natco Pharma's credit ratings at [ICRA]AA (Stable) for long-term and [ICRA]A1+ for short-term instruments, while enhancing total limits from Rs. 1,550 crore to Rs. 2,150 crore. The rating reflects the company's healthy financial profile, strong R&D capabilities in complex generics, and robust debt metrics, despite challenges from gRevlimid patent expiry expected in Q2 FY2026 and high product concentration risks.",
            "Sentiment": "positive",
            "PublishDate": 1764390486118,
            "Source": "corporate_action"
        },
        {
            "Title": "Natco Pharma Receives Seven Observations from US FDA Following Chennai API Unit Inspection",
            "Summary": "Natco Pharma concluded a US FDA inspection at its Chennai API manufacturing unit, receiving seven observations documented in Form-483. The regulatory findings could impact the company's ability to supply API products to US markets and may require corrective actions to address compliance issues.",
            "Sentiment": "negative",
            "PublishDate": 1763942756224,
            "Source": "stock"
        },
        {
            "Title": "NATCO Pharma Receives Seven Observations from US FDA Inspection at Chennai API Plant",
            "Summary": "NATCO Pharma announced that the US FDA concluded its inspection of the company's Active Pharmaceutical Ingredients manufacturing plant in Manali, Chennai, conducted from November 17-21, 2025, resulting in seven observations in Form-483. The company believes the observations are procedural in nature and remains confident in addressing them comprehensively while maintaining cGMP compliance for its global pharmaceutical operations.",
            "Sentiment": "negative",
            "PublishDate": 1763722371775,
            "Source": "stock"
        },
        {
            "Title": "Natco Pharma Reports Q2 FY26 Results with Rs 1,463 Crore Revenue, Expects Semaglutide Launch in March 2026",
            "Summary": "Natco Pharma recorded consolidated revenue of Rs 1,463 crores for Q2 FY26 with EBITDA of Rs 679.2 crores at 46.4% margin and net profit of Rs 517.9 crores, while declaring interim dividend of Rs 1.5 per share. The company expects to launch Semaglutide in India's first wave around March 2026 and anticipates reduced Lenalidomide revenue due to increased competition, providing guidance of Rs 750-800 crores quarterly revenue and Rs 135-150 crores PAT for upcoming quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1763637498869,
            "Source": "earnings"
        },
        {
            "Title": "Natco Pharma Provides Multi-Year Growth Guidance with Strong FY26 Projections",
            "Summary": "Natco Pharma expects 10-15% annual base business growth with potential 50-60% jumps during exclusivity launches, projecting FY26 PAT of INR 1,275-1,300 crores and quarterly revenue of INR 750-800 crores for Q3/Q4 FY26. The company anticipates FY27 to be slower with major launches planned for FY27-28 and FY29, providing investors with a clear roadmap for future performance expectations.",
            "Sentiment": "positive",
            "PublishDate": 1763216443973,
            "Source": "stock"
        },
        {
            "Title": "Natco Pharma Reports Q2FY26 Results with Revenue of INR 14,630 Million and EBITDA Margin of 46.4%",
            "Summary": "Natco Pharma delivered quarterly results with total revenue of INR 14,630 million, EBITDA of INR 6,792 million at 46.4% margin, and profit after tax of INR 5,179 million with earnings per share of INR 28.94. The pharmaceutical company maintains a strong product pipeline with over 20 FTFs including key solo products like Kyprolis, Ozempic, and Imbruvica, while continuing investments in NCE cell and gene therapy ventures totaling multiple million-dollar commitments.",
            "Sentiment": "positive",
            "PublishDate": 1763114808606,
            "Source": "earnings"
        },
        {
            "Title": "Natco Pharma Reports Flat Q2 Revenue at 13.6 Billion Rupees",
            "Summary": "Natco Pharma recorded quarterly revenue of 13.6 billion rupees compared to 13.7 billion rupees in the same period last year, showing a marginal decline. The pharmaceutical company's revenue performance remained largely stable with minimal year-over-year change affecting shareholders and investors.",
            "Sentiment": "negative",
            "PublishDate": 1763108948899,
            "Source": "earnings"
        },
        {
            "Title": "NATCO Pharma Completes Delisting of Adcock Ingram from Johannesburg Stock Exchange",
            "Summary": "NATCO Pharma Limited announced the successful completion of the delisting of Adcock Ingram Holdings Limited from the Johannesburg Stock Exchange as of November 11, 2025. NATCO Pharma acquired 35.75% of Adcock Ingram in a transaction valued at approximately US$226 million (ZAR 4 billion). In July 2025, NATCO offered ZAR 75 (US$4.36) per share to acquire Adcock Ingram's minority shareholders, which was approved in October 2025 with shareholder support. Adcock Ingram, established in 1891, is one of South Africa's oldest pharmaceutical companies and ranks 2nd in the private and public pharmaceutical market in South Africa. The company is known for trusted medication brands such as Panado, Myprodol, Epi-Max, Citro-soda and Allergex. NATCO Pharma CEO Rajeev Nannapaneni stated this acquisition represents a significant step in their strategic growth plan across the globe, aiming to preserve Adcock Ingram's legacy while enhancing its capabilities to serve healthcare needs across Africa and beyond.",
            "Sentiment": "positive",
            "PublishDate": 1762962531075,
            "Source": "order&deals"
        },
        {
            "Title": "Natco Pharma Reschedules Q2 FY26 Earnings Call to November 14",
            "Summary": "Natco Pharma has revised the timing of its earnings call with investors and analysts to discuss Q2 FY26 un-audited financial results. The call will now be held on November 14, 2025 at 4:00 PM IST instead of the previously scheduled 4:30 PM IST. The session will cover the company's financial results for the quarter and half-year ended September 30, 2025. The call will be hosted by Batlivala Karani Securities India Pvt. Ltd., with Natco Pharma represented by Vice-chairman and CEO Rajeev Nannapaneni and Executive Vice President-Crop Health Sciences Rajesh Chebiyam.",
            "Sentiment": "neutral",
            "PublishDate": 1762872637233,
            "Source": "earnings"
        },
        {
            "Title": "Natco Pharma Schedules Earnings Call for Q2 FY26 Financial Results",
            "Summary": "Natco Pharma Limited will host an earnings call with investors and analysts on November 14, 2025 at 4:30 PM IST to discuss the company's un-audited financial results for the quarter and half-year ended September 30, 2025. The conference call is being organized by Batlivala Karani Securities India Pvt. Ltd. Mr. Rajeev Nannapaneni, Vice-chairman and CEO, and Mr. Rajesh Chebiyam, Executive Vice President-Crop Health Sciences, will represent the company during the call. The company has provided dial-in numbers for multiple countries including India, Australia, USA, UK, and other international locations.",
            "Sentiment": "neutral",
            "PublishDate": 1762532454334,
            "Source": "earnings"
        },
        {
            "Title": "Natco Pharma Launches Generic Everolimus Tablets in Partnership with Breckenridge",
            "Summary": "Natco Pharma has launched Everolimus Tablets 1mg, which is a generic version of Zortress®. Breckenridge Pharmaceutical plans to launch the product quickly in the U.S. market.",
            "Sentiment": "positive",
            "PublishDate": 1761881782291,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Approves NATCO PHARMA's RISDIPLAM Drug Launch, Denies ROCHE's Opposition",
            "Summary": "The Supreme Court has granted NATCO PHARMA approval to introduce the RISDIPLAM drug. The court rejected ROCHE's request, which appears to have been an attempt to prevent NATCO PHARMA from launching this pharmaceutical product.",
            "Sentiment": "positive",
            "PublishDate": 1760683348620,
            "Source": "stock"
        },
        {
            "Title": "Roche Appeals High Court Decision Allowing Natco Pharma to Release Risdiplam Drug",
            "Summary": "Roche has filed an appeal against a High Court decision that permitted Natco Pharma to release the drug Risdiplam. The Supreme Court is scheduled to hear the case soon. This represents an ongoing legal dispute between the two pharmaceutical companies over the drug's market release.",
            "Sentiment": "neutral",
            "PublishDate": 1760422781603,
            "Source": "stock"
        },
        {
            "Title": "Natco Pharma Shareholders Approve Adcock Ingram Holdings Acquisition with 98.66% Vote",
            "Summary": "Natco Pharma Limited received overwhelming shareholder approval for its plan to acquire shares in Adcock Ingram Holdings Limited, with 98.66% of votes cast in favor of the proposal. The company indicated that final implementation dates will be announced soon.",
            "Sentiment": "positive",
            "PublishDate": 1760082076465,
            "Source": "order&deals"
        },
        {
            "Title": "Natco Pharma to Launch Risdiplam at Rs 15,900 After Delhi High Court Dismisses Roche's Appeal",
            "Summary": "Natco Pharma will introduce Risdiplam at a price of Rs 15,900. The Delhi High Court dismissed Roche's appeal against Natco Pharma regarding the launch of Risdiplam in India. This development affects Natco Pharma's shares and clears the path for the company's drug launch in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1760011765517,
            "Source": "stock"
        },
        {
            "Title": "NATCO Pharma Senior Vice President Dr. Santhan Gopalakrishnan Vaidyanathan to Superannuate",
            "Summary": "Dr. Santhan Gopalakrishnan Vaidyanathan, Senior Vice President - ARD at NATCO Pharma Limited, will superannuate from the company effective from the closure of business hours on September 30, 2025. The departure is due to superannuation from his role as Senior Vice President - ARD. NATCO Pharma disclosed this information under SEBI regulations for listing obligations and disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1759234829641,
            "Source": "corporate_governance"
        },
        {
            "Title": "Natco Pharma Board Approves Assessment for Agro Business Spin-off",
            "Summary": "Natco Pharma's board has approved an assessment to split its agro business into a separate company. The move is aimed at boosting the core pharma value and supporting long-term growth.",
            "Sentiment": "positive",
            "PublishDate": 1758777579237,
            "Source": "corporate_action"
        },
        {
            "Title": "Natco Pharma Receives USFDA Inspection Report with 'Voluntary Action Indicated' Classification for Hyderabad Facility",
            "Summary": "Natco Pharma received a USFDA establishment inspection report for its pharmaceutical division located in Kothur, Hyderabad. The facility has been classified as 'Voluntary Action Indicated' by the US Food and Drug Administration.",
            "Sentiment": "neutral",
            "PublishDate": 1758169504824,
            "Source": "stock"
        },
        {
            "Title": "Indian Patent Office Revokes Novartis Heart Drug Patent, Opens Market for Generic Competition",
            "Summary": "The Indian Patent Office has revoked the patent for Novartis' heart drug Vymada, clearing the path for generic pharmaceutical companies to manufacture and sell alternative versions of the medication. This decision directly impacts Natco Pharma and other generic drug manufacturers who can now enter this market segment without patent restrictions.",
            "Sentiment": "neutral",
            "PublishDate": 1758002275124,
            "Source": "stock"
        },
        {
            "Title": "NATCO Pharma Submits Disclosure from Smt. Satya Vani Nannapaneni Regarding Share Acquisition",
            "Summary": "NATCO Pharma Limited has submitted disclosures received from Smt. Satya Vani Nannapaneni to the Bombay Stock Exchange and National Stock Exchange. The disclosures relate to substantial acquisition of shares and insider trading regulations. The submission was made by Company Secretary Ch Venkat Ramesh on September 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757939395616,
            "Source": "corporate_action"
        },
        {
            "Title": "Natco Pharma Files Lawsuit Against Novo Nordisk Over Wegovy Patent Claims",
            "Summary": "Natco Pharma has filed a lawsuit against Novo Nordisk regarding patent claims related to Wegovy. The legal action involves a dispute over patent rights for the weight management medication.",
            "Sentiment": "neutral",
            "PublishDate": 1755746675320,
            "Source": "stock"
        },
        {
            "Title": "Natco Pharma Launches Bosentan Tablets in U.S. Market with 180-Day Exclusivity",
            "Summary": "Natco Pharma has introduced Bosentan tablets in the United States market. The company has secured 180-day exclusive marketing rights for this pharmaceutical product launch.",
            "Sentiment": "positive",
            "PublishDate": 1755667488637,
            "Source": "stock"
        },
        {
            "Title": "NATCO Pharma Reports Flat Revenue Growth in Q1 FY26, Warns of 20% Revenue Drop for Full Year",
            "Summary": "NATCO Pharma reported consolidated revenue of INR 1,390.6 crores in Q1 FY26, slightly down from INR 1,410.7 crores in the previous year. The company achieved an EBITDA of INR 632.7 crores with a 45.5% margin and net profit of INR 480.3 crores. The Board declared an interim dividend of INR 2 per equity share. The U.S. product portfolio faced pricing pressure, particularly for Revlimid, which is expected to decline after Q2 FY26. Management expects a 20% drop in revenue and 30% drop in profits for FY26. The company acquired a 35.75% stake in South Africa's Adcock Ingram for INR 2,000 crores to diversify away from the U.S. market. NATCO plans to file 7-8 new products in the U.S. this year and is investing in high-value R&D projects. The Kothur manufacturing facility inspection had multiple observations, with the company awaiting resolution. The crop health sciences segment showed good demand pickup and is nearing breakeven.",
            "Sentiment": "negative",
            "PublishDate": 1755604949190,
            "Source": "earnings"
        },
        {
            "Title": "Natco Pharma Targets Strong FY26 Growth with US Generic Pipeline and Cell Therapy Investments",
            "Summary": "Natco Pharma aims for strong growth in FY26 driven by its US generic pipeline, high-profit Para IV launches, and strategic investments in cell and gene therapy. The company holds net cash of ₹3,474 crore, which provides opportunities for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1755016066479,
            "Source": "stock"
        },
        {
            "Title": "Natco Pharma Reports Decline in Q1 Profitability Metrics",
            "Summary": "Natco Pharma reported Q1 results showing mixed performance compared to the previous year. Revenue declined slightly to 13.3 billion rupees from 13.6 billion rupees. EBITDA dropped significantly to 5.7 billion rupees from 8.05 billion rupees, while EBITDA margin compressed to 42.97% from 59.06%. Consolidated net profit decreased to 4.8 billion rupees from 6.7 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1754985824885,
            "Source": "earnings"
        },
        {
            "Title": "NATCO Pharma Appoints T.C. Mallikarjun as Vice President - QC at Kothur Division",
            "Summary": "NATCO Pharma Limited appointed Mr. T.C. Mallikarjun as Vice President – QC at their Pharma Division in Kothur, effective July 30, 2025. Mallikarjun brings experience from leading Indian pharmaceutical manufacturing industries and has expertise in handling regulatory inspections including USFDA, MHRA, TGA, and ANVISA. He also has experience in managing new products and exhibit validations. Prior to joining NATCO Pharma, he was associated with Aurobindo Pharma Limited, Hyderabad, as Senior General Manager - Head QC. The appointment terms are as per the company's policy.",
            "Sentiment": "positive",
            "PublishDate": 1753875535129,
            "Source": "corporate_governance"
        },
        {
            "Title": "NATCO Pharma Acquires 35.75% Stake in South African Healthcare Giant Adcock Ingram for ₹2,000 Crores",
            "Summary": "NATCO Pharma announced its acquisition of a 35.75% stake in Adcock Ingram Holdings Limited, one of South Africa's largest pharmaceutical and healthcare companies, for ₹2,000 crores at ZAR 75 per share. The transaction will delist Adcock Ingram as a private company, with Bidvest owning the remaining 64.25%. Adcock Ingram generated US$536 million in revenue last year and operates across prescription drugs (35%), OTC products (26%), hospital segment (21%), and consumer products (17%). The company owns three manufacturing plants near Johannesburg and has a 49% stake in an Indian joint venture. NATCO will consolidate 35.75% of Adcock's profits quarterly and gain one-third of board seats. The acquisition provides NATCO access to the African market and established brands, each generating over $10 million in revenue. NATCO plans to leverage its R&D pipeline and introduce products like Semaglutide to South Africa while exploring manufacturing synergies. The transaction is expected to close within 3-4 months, with NATCO retaining approximately ₹1,500 crores in cash post-acquisition. The combined entity will approach $1 billion in revenue, marking NATCO's largest investment to date.",
            "Sentiment": "positive",
            "PublishDate": 1753788435980,
            "Source": "order&deals"
        },
        {
            "Title": "Natco Pharma's API Unit Receives FDA Inspection Report with Voluntary Action Indicated",
            "Summary": "Natco Pharma's API manufacturing unit located in Mekaguda has received an Establishment Inspection Report from the U.S. FDA. The inspection resulted in one observation that has been classified as 'Voluntary Action Indicated,' which typically means the FDA identified issues that should be corrected but do not require immediate regulatory action.",
            "Sentiment": "neutral",
            "PublishDate": 1753346319929,
            "Source": "stock"
        },
        {
            "Title": "NATCO Pharma Uploads Audio Recording of Investors Call to Website",
            "Summary": "NATCO Pharma Limited has uploaded the audio recording of an investors call held on July 23, 2025 at 5:00 p.m. IST to their website. The recording is available at admin.natcopharma.co.in/wp-content/uploads/2025/07/Adcock-investor-call.mp3. The company informed BSE Ltd. and National Stock Exchange of India Ltd. about this upload through a letter dated July 24, 2025, signed by Company Secretary & Compliance Officer Ch. Venkat Ramesh.",
            "Sentiment": "neutral",
            "PublishDate": 1753335157576,
            "Source": "corporate_action"
        },
        {
            "Title": "NATCO Pharma Schedules Investor Call to Discuss Proposed Investment",
            "Summary": "NATCO Pharma Limited has scheduled an investor call on July 23, 2025, at 5:00 PM IST to discuss a proposed investment by the company. The call will be hosted for investors and analysts, with participation details provided through a designated link.",
            "Sentiment": "neutral",
            "PublishDate": 1753268794629,
            "Source": "stock"
        },
        {
            "Title": "NATCO Pharma Acquires 35.75% Stake in South African Pharmaceutical Company Adcock Ingram for ₹2000 Crores",
            "Summary": "NATCO Pharma Limited has approved the acquisition of a 35.75% stake in Adcock Ingram Holdings Limited, a South African pharmaceutical company, for approximately ₹2000 crores. The acquisition involves purchasing 51,643,319 shares at ZAR 75.00 per share through a cash offer to minority shareholders. Adcock Ingram, founded in 1890, operates across four segments: Prescription, Consumer, OTC and Hospitals, with revenue of ZAR 9.6 billion in the financial year ending June 2024. The company achieved EBITDA of ZAR 1.4 billion at a 14.6% margin and profit after tax of ZAR 814 million. Post-acquisition, Adcock Ingram will operate as a private company with Bidvest holding 64.25% and NATCO holding 35.75%. NATCO also plans to incorporate a wholly owned subsidiary in South Africa with investment up to ₹2100 crores and liquidate its subsidiary Time Cap Overseas Limited. The transaction is expected to complete by December 31, 2025, subject to regulatory approvals from RBI, South Africa's Takeover Regulation Panel, and South African Reserve Bank. Adcock Ingram will be delisted from the JSE if the transaction proceeds.",
            "Sentiment": "positive",
            "PublishDate": 1753268227306,
            "Source": "order&deals"
        },
        {
            "Title": "Natco Pharma in Advanced Talks to Acquire Majority Stake in South Africa's Adcock Holdings",
            "Summary": "Natco Pharma is in advanced discussions to acquire a majority stake in South Africa-based Adcock Holdings. Adcock Holdings' shares surged 10% ahead of a board meeting following the company's disclosure of potential deal discussions. Adcock Ingram, the operating company, provides generic and over-the-counter medicines across Africa and operates three manufacturing facilities in South Africa plus two in India through a joint venture. The company trades at a price-to-earnings ratio of 10 with a market capitalisation of approximately ₹4,500 crore. Natco Pharma has not yet responded to requests for comment. Natco Pharma shares traded 0.52% higher at ₹1,019.95.",
            "Sentiment": "positive",
            "PublishDate": 1753254736635,
            "Source": "order&deals"
        },
        {
            "Title": "Natco Pharma: FDA Issues Seven Observations at Hyderabad Facility",
            "Summary": "Natco Pharma's pharma division in Kothur, Hyderabad, received seven FDA observations under Form 483. The company is confident it will address these within the stipulated timeline. Separately, its API facility in Mekaguda, Hyderabad, also received one observation, deemed procedural in nature.",
            "Sentiment": "neutral",
            "PublishDate": 1750343670000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Natco Pharma's Kothur Facility Receives Seven Observations in US FDA Inspection",
            "Summary": "Natco Pharma has completed a US Food and Drug Administration (FDA) inspection at its Kothur Pharma Division. The inspection resulted in seven observations from the FDA. No further details about the nature of the observations or their potential impact were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750337248000,
            "Source": "default"
        },
        {
            "Title": "Natco Pharma's API Facility Passes U.S. FDA Inspection",
            "Summary": "Natco Pharma announced the successful completion of a U.S. FDA inspection at its API manufacturing facility in Mekaguda, Hyderabad. The inspection concluded with a single observation issued in Form 483.",
            "Sentiment": "positive",
            "PublishDate": 1750031815000,
            "Source": "default"
        },
        {
            "Title": "NATCO Pharma: USFDA Observation at Hyderabad API Facility",
            "Summary": "NATCO Pharma's API manufacturing facility in Mekaguda, Hyderabad received one procedural observation from USFDA after an inspection conducted from June 9-13, 2025. The company plans to address this comprehensively. Q4 FY2025 results showed slower growth with net profit up 5.3% YoY to Rs 407 crore, missing analyst estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1749819519000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NATCO Pharma's API Plant Passes U.S. FDA Inspection",
            "Summary": "NATCO Pharma's API manufacturing plant in Mekaguda, Hyderabad, has successfully completed a U.S. FDA inspection. The inspection resulted in only one observation listed on Form 483.",
            "Sentiment": "positive",
            "PublishDate": 1749811388000,
            "Source": "default"
        },
        {
            "Title": "NATCO Pharma Projects Revenue and Profit Decline for FY26",
            "Summary": "NATCO Pharma has announced projections for a significant decline in its financial performance for the fiscal year 2026. The company expects its topline revenue to decrease by 20% and profits to fall by 30% compared to current levels.",
            "Sentiment": "negative",
            "PublishDate": 1748491243000,
            "Source": "default"
        },
        {
            "Title": "Natco Pharma Reports Q4 Financial Results",
            "Summary": "Natco Pharma announced its Q4 consolidated net profit of 4.1 billion rupees, compared to 3.86 billion rupees year-over-year and 1.33 billion rupees quarter-over-quarter. The company's Q4 revenue stood at 12.2 billion rupees, up from 10.68 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748477325000,
            "Source": "default"
        },
        {
            "Title": "Natco Pharma: Q4 Profit Misses Estimates, FY26 Outlook Gloomy",
            "Summary": "Natco Pharma's Q4 FY25 net profit rose 5.3% to Rs 407 crore, missing estimates. Revenue increased 14.3% to Rs 1,221 crore. The company expects a 20% revenue decline and 30% profit drop in FY26 due to US market pressures and increased R&D expenses.",
            "Sentiment": "negative",
            "PublishDate": 1748439111000,
            "Source": "earnings"
        },
        {
            "Title": "NATCO PHARMA Reports Q4 Financial Results",
            "Summary": "NATCO PHARMA announced its Q4 financial results. The company's EBITDA increased to 5.48 billion rupees from 4.97 billion rupees year-over-year. EBITDA margin decreased to 44.89% from 46.55% year-over-year. Revenue rose to 12.2 billion rupees from 10.68 billion rupees year-over-year. Consolidated net profit increased to 4.1 billion rupees from 3.86 billion rupees year-over-year and 1.33 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748431006000,
            "Source": "result"
        }
    ]
}