{
    "Symbol": "NATCAPSUQ",
    "ISIN": "INE936B01015",
    "News": [
        {
            "Title": "Natural Capsules Gets High Court Relief on Plant Closure",
            "Summary": "Natural Capsules Limited receives Madras High Court order suspending drug controller's temporary plant closure directive, allowing resumption of Pondicherry manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1769768347750,
            "Source": "stocks"
        },
        {
            "Title": "Natural Capsules Plant Temporarily Closed by Regulators",
            "Summary": "Natural Capsules Limited's Pondicherry manufacturing facility faces temporary closure by Department of Drug Controller for supplying materials to customer with expired drug license.",
            "Sentiment": "negative",
            "PublishDate": 1766755208638,
            "Source": "stocks"
        },
        {
            "Title": "Natural Capsules Reports Net Loss of Rs 6.99 Crores in Q2 FY26 Amid US Tariff Challenges",
            "Summary": "Natural Capsules Limited reported quarterly revenue growth of 1.33% to Rs 45.80 crores but posted a net loss of Rs 6.99 crores with negative EBITDA margins of 1.93% due to US tariff impacts on HPMC capsule exports and technical challenges in API facility scale-up. The company revised its annual revenue guidance downward from Rs 270-280 crores to approximately Rs 225 crores, affecting investors and stakeholders relying on the capsule and API business segments.",
            "Sentiment": "negative",
            "PublishDate": 1763557245468,
            "Source": "earnings"
        },
        {
            "Title": "Natural Capsules Reports Q2H1 FY26 Results Amid US Tariff Challenges and API Production Delays",
            "Summary": "Natural Capsules Limited reported quarterly results with revenue of ₹45.80 Cr and PAT loss of ₹6.99 Cr, citing US tariffs on Indian exports impacting HPMC capacity expansion and demand. The company faces ongoing challenges in API production scale-up due to technical difficulties in fermentation processes, despite obtaining regulatory approvals from Pollution Control Board.",
            "Sentiment": "negative",
            "PublishDate": 1763091610386,
            "Source": "earnings"
        },
        {
            "Title": "Natural Capsules Reports Mixed Results with Standalone Profit but Consolidated Loss",
            "Summary": "Natural Capsules Limited reported standalone net profit of Rs 281.05 lakhs but consolidated net loss of Rs 869.90 lakhs for the quarter ended September 30, 2025, while deciding not to subscribe to subsidiary Natural Biogenex's rights issue due to cash flow constraints. The company's subsidiary Natural Biogenex commenced commercial operations in March 2025 but has yet to achieve full revenue potential, contributing to higher consolidated losses.",
            "Sentiment": "negative",
            "PublishDate": 1763055617242,
            "Source": "earnings"
        },
        {
            "Title": "Natural Capsules Limited Chief Operating Officer Retires Upon Superannuation",
            "Summary": "Natural Capsules Limited announced the retirement of Mr. MVN Kutty, Chief Operating Officer, due to superannuation. The retirement became effective at the close of business hours on September 30, 2025. The company disclosed this information to NSE and BSE exchanges through Company Secretary Pranjal Deshmukh.",
            "Sentiment": "neutral",
            "PublishDate": 1759235761808,
            "Source": "corporate_governance"
        },
        {
            "Title": "Natural Capsules Limited Shareholders Approve Key Board Changes at 32nd AGM",
            "Summary": "Natural Capsules Limited shareholders approved three key resolutions at their 32nd Annual General Meeting held on August 04, 2025. The company approved the continuation of Mr. Tekkar Yashwanth Prabhu as Non-Executive Independent Director beyond age 75 until his current term expires. Shareholders also approved the re-appointment of Mr. Sathyanarayana Mundra as Whole Time Director for 3 years effective September 20, 2025, with revised remuneration. Additionally, Mr. Parthasarathy was appointed as Secretarial Auditor for 5 consecutive years from financial year 2025-26 to 2029-30. Mr. Prabhu brings over 4 decades of banking experience having served in senior positions at Canara Bank, Union Bank of India, and Oriental Bank of Commerce. Mr. Parthasarathy is a practicing Company Secretary with 38 years of experience in company law matters.",
            "Sentiment": "neutral",
            "PublishDate": 1754417020294,
            "Source": "corporate_governance"
        },
        {
            "Title": "Natural Capsules Limited Reports Mixed Results with Standalone Profit but Consolidated Loss",
            "Summary": "Natural Capsules Limited's Board approved quarterly financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 4,424.29 lakhs and net profit of Rs 252.30 lakhs, with earnings per share of Rs 2.44. However, consolidated results showed revenue of Rs 4,520.31 lakhs but a net loss of Rs 558.05 lakhs, resulting in negative earnings per share of Rs 5.40. The consolidated loss was primarily attributed to the API segment, which reported a loss of Rs 698.55 lakhs before tax and interest. The company's subsidiary Natural Biogenex Private Limited commenced commercial operations on March 31, 2025, and is still achieving its full revenue potential. The Board also designated Mr. Sunil L Mundra as Managing Director for determining materiality of events and Ms. Pranjal Deshmukh as Company Secretary for disclosure submissions.",
            "Sentiment": "negative",
            "PublishDate": 1754314607558,
            "Source": "earnings"
        },
        {
            "Title": "Natural Capsules Receives NSE Approval for Listing",
            "Summary": "Natural Capsules Limited has received an approval letter from the National Stock Exchange (NSE) for listing its equity shares. The company's shares will be listed and admitted for trading on the NSE effective February 14.",
            "Sentiment": "positive",
            "PublishDate": 1739411586000,
            "Source": "corporate_action"
        }
    ]
}