{
    "Symbol": "NATHBIOGEN",
    "ISIN": "INE448G01010",
    "News": [
        {
            "Title": "Tapovan Paper Acquires 0.40% Stake in Nath Bio-Genes",
            "Summary": "Tapovan Paper and Board Mills Limited acquired 75,645 equity shares (0.40%) in Nath Bio-Genes through a scheme of amalgamation approved by NCLT Mumbai on November 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768307565729,
            "Source": "co_actions_results"
        },
        {
            "Title": "NathBio-Genes Reports 15.9% Revenue Growth to INR 3,199 Million in H1 FY26",
            "Summary": "NathBio-Genes achieved 15.9% year-on-year revenue growth reaching INR 3,199 million with PAT increasing 15.3% to INR 424 million, driven by strong performance in cotton (26.3% value growth) and vegetable seeds (25% growth). The company maintained steady growth despite erratic monsoons and illegal BT cotton spread, with cotton and paddy contributing 74% of revenue while expanding its product portfolio across maize, vegetable seeds, and plant nutrition solutions.",
            "Sentiment": "positive",
            "PublishDate": 1763466998026,
            "Source": "earnings"
        },
        {
            "Title": "NathBio-Genes Reports 23.5% Revenue Growth to Rs 398 Mn in Q2FY26",
            "Summary": "NathBio-Genes achieved revenue growth of 23.5% to Rs 398 million in quarterly results, driven by strong performance in cotton (6.3% growth to 1.11 million packets) and vegetable seeds (24.4% growth). The company's profit after tax increased 45.4% to Rs 42 million with gross margins expanding to 68% from 60% in the previous year, supported by diversification beyond cotton and growth in high-margin products.",
            "Sentiment": "neutral",
            "PublishDate": 1763097352871,
            "Source": "earnings"
        },
        {
            "Title": "NATH BIO-GENES Reports Q1 Financial Results",
            "Summary": "NATH BIO-GENES has reported its Q1 financial results. The company's net profit increased to 382 million rupees from 339 million rupees in the same period last year. Revenue for Q1 rose to 2.8 billion rupees from 2.44 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752233189000,
            "Source": "result"
        }
    ]
}