{
    "Symbol": "NATIONALUM",
    "ISIN": "INE139A01034",
    "News": [
        {
            "Title": "NALCO Reports Record Q3 FY26 Performance",
            "Summary": "National Aluminium Company achieves best-ever quarterly results with 13% revenue growth, 20% EBITDA margin increase, and 25% PBT growth in nine months ended December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770288849117,
            "Source": "co_actions_results"
        },
        {
            "Title": "NALCO Executive Director Retires After Superannuation",
            "Summary": "National Aluminium Company Limited announces superannuation of Executive Director (M&R) Shri Niranjan Samal effective January 31, 2026, marking a senior management change.",
            "Sentiment": "neutral",
            "PublishDate": 1769916893852,
            "Source": "stocks"
        },
        {
            "Title": "NALCO Q3FY26 Results Call on Jan 30, 2026",
            "Summary": "National Aluminium Company Limited announces earnings conference call scheduled for January 30, 2026 at 5:00 PM to discuss Q3FY26 financial results and business outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1769489714548,
            "Source": "co_actions_results"
        },
        {
            "Title": "NALCO Board to Consider 2nd Interim Dividend on Jan 30",
            "Summary": "National Aluminium Company Limited has scheduled a board meeting for January 30, 2026, to consider the payment of second interim dividend for FY2025-26 under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1769147729359,
            "Source": "co_actions_results"
        },
        {
            "Title": "NALCO Board Meet Set for Jan 30 to Review Q3FY26 Results",
            "Summary": "National Aluminium Company Limited has scheduled its board meeting for January 30, 2026, to consider unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768826665478,
            "Source": "co_actions_results"
        },
        {
            "Title": "NALCO Plans Entry Into Rare Earths & Critical Minerals",
            "Summary": "National Aluminium Company Limited explores diversification into rare earths, magnesium, and chromite as part of India's critical minerals strategy.",
            "Sentiment": "positive",
            "PublishDate": 1768797779049,
            "Source": "stocks"
        },
        {
            "Title": "GMDC, NALCO Surge on US Pax Silica Alliance News",
            "Summary": "GMDC and NALCO shares gained 3% and 2% respectively after US Ambassador indicated India's potential inclusion in the Pax Silica Alliance, boosting prospects for critical mineral supply chains.",
            "Sentiment": "positive",
            "PublishDate": 1768220970977,
            "Source": "stocks"
        },
        {
            "Title": "Nifty Metal tumbles; expert sees buying opportunity",
            "Summary": "Nifty Metal Index fell sharply due to profit booking and global commodity rebalancing. Aditya Welekar of Axis Securities views the dip as a potential buying opportunity despite elevated valuations.",
            "Sentiment": "neutral",
            "PublishDate": 1767853452531,
            "Source": "stocks"
        },
        {
            "Title": "NALCO Hits Fresh High on Aluminium Price Rally",
            "Summary": "NALCO shares surge 14% in 4 days to new 52-week high of ₹357.50, driven by global aluminium prices hitting 3-year highs and strong Q2 results showing 36.7% profit growth to ₹1,430 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767768203945,
            "Source": "stocks"
        },
        {
            "Title": "NALCO Hits Record High on Aluminum Price Surge",
            "Summary": "NALCO shares surged 7% to fresh record high of ₹352.00 as global aluminum prices crossed $3,082 per tonne. Stock gained 12% in 4 sessions driven by supply constraints and strong demand outlook.",
            "Sentiment": "positive",
            "PublishDate": 1767679992778,
            "Source": "stocks"
        },
        {
            "Title": "NALCO Appoints Anil Kumar Singh as Commercial Director",
            "Summary": "National Aluminium Company Limited announces appointment of Shri Anil Kumar Singh as Director (Commercial) on the Board effective January 5, 2026, with tenure until September 30, 2028.",
            "Sentiment": "neutral",
            "PublishDate": 1767619104625,
            "Source": "stocks"
        },
        {
            "Title": "Nalco Confirms ₹5032 Cr Dilip Buildcon Mining Contract",
            "Summary": "National Aluminium Company officially confirms awarding ₹5032 crore MDO contract to Dilip Buildcon for Pottangi Bauxite Mines development and operations with 25-year duration.",
            "Sentiment": "positive",
            "PublishDate": 1765375017745,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nalco Awards 25-Year Mining Contract to Dilip Buildcon at ₹423 Per Ton",
            "Summary": "Nalco has awarded a Mine Developer and Operator (MDO) contract to Dilip Buildcon for a 25-year period with base mining charges set at ₹423 per ton. This long-term contract affects both companies' operational strategies and provides Dilip Buildcon with extended revenue visibility in the mining sector.",
            "Sentiment": "positive",
            "PublishDate": 1765322855701,
            "Source": "corporate_action"
        },
        {
            "Title": "National Aluminium Company Fined Rs. 10.86 Lakh by BSE and NSE for Regulatory Non-Compliance",
            "Summary": "National Aluminium Company Limited received fines of Rs. 5,42,800 each from BSE and NSE for non-compliance with SEBI LODR Regulation 17(1) during the quarter ended September 30, 2025. The total financial impact on the company amounts to Rs. 10,85,600 including 18% GST, and the company is preparing to represent its position to the exchanges regarding the identified non-compliance.",
            "Sentiment": "negative",
            "PublishDate": 1764339864173,
            "Source": "corporate_governance"
        },
        {
            "Title": "NALCO Pays Record Dividend of Rs 988.88 Crore to Government of India for FY2024-25",
            "Summary": "National Aluminium Company Limited (NALCO) paid a record total dividend of Rs 1,928.46 crore for FY2024-25, with the Government of India receiving Rs 988.88 crore as its share - the highest-ever dividend paid by the company. The dividend cheque was handed over to Union Minister of Coal and Mines G. Kishan Reddy by NALCO's CMD Brijendra Pratap Singh. The Government of India currently holds 51.28% equity in NALCO. Since starting commercial operations in 1987, NALCO has consistently earned profits and declared dividends since 1992, paying a cumulative dividend of Rs 14,331 crore to date, of which Rs 9,556 crore has been remitted to the Government of India. Following strong performance in the first half of the current financial year and best-ever quarterly results in Q2 FY2025-26, NALCO has also declared an interim dividend of Rs 4 per equity share (80% on face value of Rs 5 each), amounting to Rs 734.65 crore for FY2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1762993230838,
            "Source": "corporate_action"
        },
        {
            "Title": "National Aluminium Company Announces Record Date for 1% Interim Dividend for FY 2025-26",
            "Summary": "National Aluminium Company Limited (NALCO) has published public notices in newspapers regarding the record date for 1% interim dividend for financial year 2025-26. The notice was published on November 8, 2025 in Dharitri (Odia newspaper), Navabharat and Business Standard (Hindi newspapers), and Business Standard (English newspaper). The company informed stock exchanges BSE and NSE about this newspaper publication through a regulatory filing dated November 11, 2025. NALCO's scrip code is 532234 on BSE and symbol is NATIONALUM on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1762910414213,
            "Source": "corporate_action"
        },
        {
            "Title": "NALCO Clarifies Volume Movement, Announces 1% Interim Dividend",
            "Summary": "National Aluminium Company Limited (NALCO) responded to BSE's inquiry regarding volume movement in its shares. The company stated it has made all material disclosures as required and has not withheld any information that could affect price or volume behavior. NALCO disclosed its unaudited financial results for the quarter and half year ended September 30, 2025 on November 7, 2025. The Board of Directors approved a 1% interim dividend of Rs. 4 per share (80% on face value of Rs. 5 each) for financial year 2025-26. The company attributed the increased trading volume to market-driven factors and confirmed its commitment to regulatory compliance and governance standards.",
            "Sentiment": "neutral",
            "PublishDate": 1762884173003,
            "Source": "stock"
        },
        {
            "Title": "Nalco Shares Surge 8% Following Strong Quarterly Performance",
            "Summary": "National Aluminium Company Ltd. (Nalco) shares jumped nearly 8% after reporting strong quarterly results. Net profit increased 36.7% year-on-year to ₹1,430 crore, while revenue grew 31.5% to ₹4,292 crore. EBITDA rose 24.8% to ₹1,932.9 crore with margins improving to 45% from 38.7% in the previous year. The company's board approved an interim dividend of ₹4 per equity share totaling ₹734.65 crore. Management expects LME aluminium prices to average around $2,670 per tonne in calendar year 2026. The alumina refinery expansion project is on track to increase capacity by 1 million tonnes per annum to 3.1 MTPA, with commissioning expected by June 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762751336756,
            "Source": "earnings"
        },
        {
            "Title": "NALCO Plans ₹7,000 Crore Investment Under Amrit Kal Vision 2047 for Expansion and Growth",
            "Summary": "NALCO has announced a ₹7,000 crore investment plan under Amrit Kal Vision 2047. The investment will focus on smelter expansion, alumina refinery upgrades, and renewable energy integration. The company is targeting robust growth driven by global aluminum demand recovery and strategic capital expenditure. NALCO aims to enhance its value-added product mix and backward integration to improve cost competitiveness. The company is also focusing on increasing its export share and achieving sustainable EBITDA growth.",
            "Sentiment": "positive",
            "PublishDate": 1762527805503,
            "Source": "stock"
        },
        {
            "Title": "National Aluminium Company Reports Strong Quarterly Results and Declares Interim Dividend",
            "Summary": "National Aluminium Company Limited (NALCO) reported unaudited financial results for the second quarter and half year ended September 30, 2025. The company's Board of Directors approved an interim dividend of Rs. 4 per share (80% on face value of Rs. 5 each) for financial year 2025-26, totaling Rs. 734.65 crore. The record date for dividend payment is November 14, 2025, with payment to be made by December 6, 2025. The company's standalone profit for the quarter was Rs. 1,433.17 crore, while consolidated profit was Rs. 1,429.94 crore. Revenue from operations stood at Rs. 4,292.34 crore for the quarter. The company continues to face challenges with two wind power plants in Rajasthan due to non-execution of Power Purchase Agreement, with the matter pending before the High Court of Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1762512659407,
            "Source": "earnings"
        },
        {
            "Title": "National Aluminium Receives IND AAA Credit Rating on Bank Loan Facilities",
            "Summary": "National Aluminium Co. Ltd. received a credit rating from India Ratings Research, a Fitch Group company, on its bank loan facilities. The rating agency assigned IND AAA/Stable/IND A1 rating to the company's bank loan facilities worth INR 13,750 million. The company informed stock exchanges BSE and NSE about this credit rating development.",
            "Sentiment": "positive",
            "PublishDate": 1762450767042,
            "Source": "corporate_action"
        },
        {
            "Title": "National Aluminium Company Board to Consider Interim Dividend for FY 2025-26",
            "Summary": "National Aluminium Company Limited has announced that its Board of Directors will meet on November 7, 2025, to consider declaring an interim dividend for the financial year 2025-26. The company issued this notice to BSE Limited and National Stock Exchange of India Limited, with the stock trading under scrip code 532234 on BSE and symbol NATIONALUM on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1761854910618,
            "Source": "corporate_action"
        },
        {
            "Title": "NALCO Contests ₹7.51 Lakh Penalties from NSE and BSE Over Board Composition Violations",
            "Summary": "National Aluminium Company Limited (NALCO) shares rose 0.93% to ₹238.30 as the company challenges regulatory penalties imposed by stock exchanges. NSE and BSE each fined NALCO ₹7.51 lakh for non-compliance with SEBI regulations regarding board composition during the quarter ended June 30, 2025. The penalties relate to violations of SEBI's Listing Obligations and Disclosure Requirements concerning adequate independent directors. NALCO argues that as a Central Public Sector Enterprise, director appointments are controlled by the President of India, not the company. The board resolved to seek penalty waivers and has submitted a waiver application while pursuing the matter with the Ministry of Mines for expedited appointment of required independent directors. The stock traded between ₹236.51 to ₹238.88 with volume of 56.46 lakh shares valued at ₹134.18 crore. NALCO's market capitalisation stands at ₹43,766.94 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1761565509721,
            "Source": "corporate_governance"
        },
        {
            "Title": "NALCO Faces Rs 15 Lakh Fine from Stock Exchanges for Board Composition Non-Compliance",
            "Summary": "National Aluminium Company Limited (NALCO) received fines totaling Rs 15.03 lakh from BSE and NSE for non-compliance with SEBI regulations regarding board and committee composition for the quarter ended June 30, 2025. Each exchange imposed a fine of Rs 7,51,660 including GST on a basic amount of Rs 6,37,000. The violations relate to Regulations 17(1) and 18(1) of SEBI LODR Regulations 2015. NALCO's board addressed the issue in their 359th meeting on September 25, 2025, and has requested waiver of penalties, citing that as a government enterprise, director appointments are controlled by the President of India through the Ministry of Mines. The company submitted a waiver application to BSE on September 18, 2025, and continues to seek early appointment of requisite independent directors to ensure compliance.",
            "Sentiment": "negative",
            "PublishDate": 1761324594169,
            "Source": "corporate_governance"
        },
        {
            "Title": "NALCO Holds 44th AGM, CMD Outlines Growth Strategy Focused on Innovation and Clean Energy",
            "Summary": "National Aluminium Company Limited (NALCO) conducted its 44th Annual General Meeting in Bhubaneswar. CMD Brijendra Pratap Singh addressed shareholders virtually, expressing gratitude for their continued support and highlighting the company's record-breaking financial and physical performance in FY 2024-25. Singh emphasized NALCO's commitment to operational efficiency, transparency, and global competitiveness. He noted that domestic aluminium demand is projected to grow at 7.6% CAGR till 2030, driven by electric vehicle adoption, infrastructure development, and renewable energy sector growth. The CMD stressed the need for accelerated technology adoption, cleaner energy transition, greater value addition, and enhanced resilience against global disruptions. Shareholders approved a final dividend of Rs.2.50 per equity share (50% on face value of Rs.5 each), amounting to Rs.459.16 crores for FY 2024-25, bringing total dividend payout to Rs.1928.46 crores.",
            "Sentiment": "positive",
            "PublishDate": 1758891193179,
            "Source": "corporate_action"
        },
        {
            "Title": "NALCO Organizes Roadshow for Angul Aluminium Park to Attract Investors in Odisha",
            "Summary": "National Aluminium Company Limited (NALCO) organized a roadshow for Angul Aluminium Park Pvt. Ltd. (AAPPL), a joint venture between IDCO and NALCO to develop an industrial park in Angul, Odisha. The event brought together government officials, industry leaders, and investors. NALCO will supply 50,000 tonnes of hot metal annually to downstream industries at the park. Odisha produces 72% of India's primary aluminium but has low downstream output, presenting growth opportunities. AAPPL spans 223 acres and is set to expand to over 600 acres, with three industries already attracted and four more in the pipeline. The roadshow drew over 100 participants including investors, entrepreneurs and industry associations, with presentations showcasing Odisha's investor-friendly policies and opportunities in the aluminium downstream sector.",
            "Sentiment": "positive",
            "PublishDate": 1758722556927,
            "Source": "stock"
        },
        {
            "Title": "Mazagon Dock, NALCO, Bharat Dynamics and MOIL Set to Trade Ex-Dividend",
            "Summary": "Four companies - Mazagon Dock Shipbuilders, National Aluminium Company (NALCO), Bharat Dynamics (BDL) and MOIL - will trade ex-dividend with a record date of September 19, 2025. Mazagon Dock announced a dividend of Rs 2.71 per share subject to AGM approval, with a current dividend yield of 1.28% at Rs 2,993 share price. NALCO declared Rs 2.50 per share dividend with a 4.69% yield at Rs 213.26 share price. Bharat Dynamics announced Rs 0.65 per share dividend with 0.30% yield at Rs 1,624 share price. MOIL set a dividend of Rs 1.61 per share with 1.14% yield at Rs 353.95 share price. Investors must purchase shares before the ex-dividend date to be eligible for dividend payments.",
            "Sentiment": "neutral",
            "PublishDate": 1758163954078,
            "Source": "corporate_action"
        },
        {
            "Title": "Nalco-MIDHANI Joint Venture Aluminium Alloy Project Deemed Commercially Unviable",
            "Summary": "A high-end aluminium alloy project in Andhra Pradesh, developed by joint venture Utkarsha Aluminium Dhatu Nigam Ltd between Nalco and MIDHANI, has been found commercially unviable. The proposed 60,000 tonnes per annum capacity project faces challenges due to lack of demand, low per capita aluminium consumption in India, and lower aluminium localisation in aerospace, defence, marine and automotive sectors. The joint venture was established in August 2019 to produce high-end aluminium alloys for defence, aerospace and automobile sectors to reduce import dependency. Both administrative ministries of mines and defence have reviewed the project scenarios and are discussing closure, with a final decision pending. The company had already acquired 110 acres of land in Nellore for the facility.",
            "Sentiment": "negative",
            "PublishDate": 1757847736780,
            "Source": "stock"
        },
        {
            "Title": "India Plans Lithium Exploration in Argentina and Refining Partnerships in Australia",
            "Summary": "India is expanding its critical minerals sourcing through lithium exploration in Argentina and potential refining partnerships in Australia. KABIL, a joint venture between NALCO, Hindustan Copper Limited, and Mineral Exploration & Consultancy Limited, is acquiring mines in Argentina and exploring equity partnerships in Australian lithium refining operations. Of the 5 mines allocated to KABIL in Argentina, the company is appointing a Project Management Consultant for exploration to determine lithium grade quality. NALCO's CMD BP Singh stated that US tariffs on Indian exports won't impact the company as none of its alumina chemicals go to the US, though aluminum prices have declined due to tariff-related pressures. NALCO is seeking opportunities in the UK's automotive and green energy sectors, citing limited smelting capacity there and opportunities from the India-UK Free Trade Agreement. The company is reducing its thermal power usage to comply with Carbon Border Adjustment Mechanism requirements, adding 200 MW wind power capacity and 300 MW additional green power, with plans to convert 30% of its power mix to green energy through long-term Power Purchase Agreements.",
            "Sentiment": "positive",
            "PublishDate": 1756405276284,
            "Source": "stock"
        },
        {
            "Title": "Nalco Explores Joint Venture With Coal India, NTPC for Rs 12,000-Crore Power Plant",
            "Summary": "National Aluminium Company Ltd. is exploring a joint venture partnership with Coal India and NTPC to secure coal supply for its proposed Rs 12,000-crore power plant in Angul, Odisha. The 1,080 MW power plant will support the company's smelter unit as part of its expansion plans. Nalco has allocated Rs 30,000 crore for expansion over five years, with Rs 18,000 crore for a new aluminium smelter and Rs 12,000 crore for the thermal power plant. CMD Brijendra Pratap Singh noted that US tariffs have increased alumina availability in the Indian market, creating price pressures domestically. The company is exploring UK markets for metal exports and aims to achieve Maharatna status by 2030, requiring turnover growth from the current Rs 17,000 crore to Rs 25,000 crore through the refinery and smelter additions.",
            "Sentiment": "positive",
            "PublishDate": 1756402954321,
            "Source": "order&deals"
        },
        {
            "Title": "Nalco Plans Rs 30,000 Crore Investment by 2030 to Double Production Capacity",
            "Summary": "National Aluminium Co. will invest Rs 30,000 crore in capital expenditure over the next four to five years, with projects expected to be completed by 2030. The state-owned company plans to expand across mining, refining, smelting and power capacity while diversifying into value-added products. A new bauxite mine will be added by June 2026, increasing mining capacity by 3.5 million tonnes annually, while alumina refining capacity will cross 3.1 MT by 2026. The largest investment of Rs 17,000-18,000 crore will go toward expanding smelting capacity from 460,000 tonnes per year to over 960,000 tonnes. An additional 1,000 MW power plant will be established with Rs 11,000 crore investment. Nalco aims to produce over 16,000 tonnes of wire rods annually and expand rolled products capacity from 30,000 to 40,000 tonnes per year, while venturing into foil production. The company is securing raw materials through joint ventures and participating in overseas projects through Khanij Bidesh India Ltd. to secure strategic minerals like lithium and cobalt. Alumina is being procured at $370-380 through spot tenders, with average expected at $400 this year, while aluminium prices range between Rs 2,500 and Rs 5,600.",
            "Sentiment": "positive",
            "PublishDate": 1756395079874,
            "Source": "stock"
        },
        {
            "Title": "NALCO Plans 300 Billion Rupee Investment and Australian Lithium Project Participation",
            "Summary": "NALCO's Chief Managing Director announced plans for equity participation in an Australian lithium project through KABIL. The company will invest 300 billion rupees in a new smelter and coal power plant while aiming to bid for key mineral mines in India. The CMD noted increased alumina availability in India due to new US tariffs, though this has created some pressure on domestic prices from the increased supply.",
            "Sentiment": "neutral",
            "PublishDate": 1756384919960,
            "Source": "stock"
        },
        {
            "Title": "NALCO CMD Announces Plans to Acquire New Bauxite and Coal Mines",
            "Summary": "NALCO's Chairman and Managing Director has announced the company's plans to acquire new bauxite and coal mines. The announcement indicates the company's expansion strategy in securing raw material resources for its operations.",
            "Sentiment": "positive",
            "PublishDate": 1756384414204,
            "Source": "stock"
        },
        {
            "Title": "National Aluminium Company Reports 77% Jump in Q1 Profit, Announces Rs 2.50 Final Dividend",
            "Summary": "National Aluminium Company Limited reported strong quarterly results with revenue growing 33% and profit after tax surging 77% compared to the same quarter last year. The company achieved production growth across all segments - bauxite up 6.6%, alumina hydrate up 35%, metal up 3%, and power up 6%. Alumina and metal sales also registered significant increases, with domestic sales hitting record highs for any Q1. The Board recommended a final dividend of Rs 2.50 per share. The company is operating its captive coal mines at 4 million ton capacity and expects to commission its 5th stream alumina refinery expansion by June 2026, targeting 5 lakh tons production in FY27. Management projects alumina production to reach 23 lakh tons this year, up from 20.7 lakh tons last year. The company maintains zero debt status and continues expansion plans including a brownfield smelter project.",
            "Sentiment": "positive",
            "PublishDate": 1755175123918,
            "Source": "earnings"
        },
        {
            "Title": "National Aluminium Co Announces Multiple Expansion Plans Including Aluminum Foil Entry and Capacity Increases",
            "Summary": "National Aluminium Co outlined several expansion initiatives during a conference call. The company plans to enter the aluminum foil segment with an investment of INR 150-200 crores and is targeting 10% higher targets across all areas compared to the previous year. Key capacity expansion plans include adding a new wire rod mill with 100,000 ton annual capacity, expected to complete in about 2 years, and installing an annealing furnace to increase rolled product capacity from 2,000 tons to 3,000 tons per month by March. The company is exploring special grade alumina and fused alumina as value-added products. For domestic alumina sales, the company targets 1-1.2 lakh tons this year versus 40,000 tons last year. For FY26, alumina production is targeted at 22.5-23 million tons, with exports planned at 41-42 shipments versus 36 last year. The company's new 5th stream alumina refinery aims for mechanical completion by March 2026, production start by June 2026, output of 5 lakh tons in FY27, and ramp-up to 10 lakh tons within 6 months.",
            "Sentiment": "positive",
            "PublishDate": 1754884390257,
            "Source": "stock"
        },
        {
            "Title": "National Aluminium Company Conducts Earnings Call for Q1 Results",
            "Summary": "National Aluminium Company Limited held an earnings conference call on August 8, 2025, to discuss the company's business and outlook following the release of unaudited financial results for the first quarter ended June 30, 2025. The call ran from 11:00 AM to 12:10 PM and its video recording has been made available online. The company confirmed that no unpublished price sensitive information was shared during the call. A transcript of the call will be provided separately within the timeframe specified by SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754662446359,
            "Source": "earnings"
        },
        {
            "Title": "National Aluminium Company Reports Strong Q1 Results, Recommends Rs 2.50 Final Dividend",
            "Summary": "National Aluminium Company Limited reported its unaudited financial results for the quarter ended June 30, 2025. The company posted a standalone profit of Rs 1,063.86 crore for the quarter, with revenue from operations at Rs 3,806.94 crore. On a consolidated basis, profit stood at Rs 1,049.48 crore. The Board recommended a final dividend of Rs 2.50 per share (50% on face value of Rs 5 each) for FY 2024-25, amounting to Rs 459.16 crore, subject to shareholder approval at the 44th AGM. This is in addition to interim dividends of Rs 8 per share already paid during the year. The company also appointed BSS & Associates as Cost Auditors for FY 2025-26. Earnings per share for the quarter were Rs 5.79 on standalone basis and Rs 5.71 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1754562973900,
            "Source": "earnings"
        },
        {
            "Title": "National Aluminium Co Reports Strong Q1 Performance with 78% Jump in Net Profit",
            "Summary": "National Aluminium Co delivered robust Q1 results with consolidated net profit rising to 10.5 billion rupees from 5.9 billion rupees year-over-year. Revenue increased to 38.1 billion rupees compared to 28.6 billion rupees in the same period last year. EBITDA grew significantly to 14.9 billion rupees from 9.34 billion rupees, while EBITDA margin expanded to 39.21% from 32.71% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754560809465,
            "Source": "earnings"
        },
        {
            "Title": "NALCO Appoints New Director of Finance",
            "Summary": "NALCO (National Aluminium Company Limited) has appointed Shri Abhay Kumar Behuria as its new Director of Finance. Behuria brings over 30 years of experience from SAIL (Steel Authority of India Limited), which is classified as a MAHARATNA company.",
            "Sentiment": "positive",
            "PublishDate": 1749633572000,
            "Source": "default"
        },
        {
            "Title": "National Aluminium in Talks for Joint Ventures on Smelter Expansion",
            "Summary": "National Aluminium Company (NALCO) is currently engaged in discussions with technology partners regarding potential joint ventures for their smelter expansion project. The focus of these talks is on addressing the power requirements associated with the expansion. This suggests that NALCO is exploring collaborative approaches to meet the energy needs of their planned smelter growth.",
            "Sentiment": "neutral",
            "PublishDate": 1749113848000,
            "Source": "default"
        },
        {
            "Title": "National Aluminium Announces Capex Target and Production Goal",
            "Summary": "National Aluminium Company has provided guidance on its capital expenditure (capex) target for 2026-27, which is approximately Rs 1700 crore. The company is also aiming to achieve a production target of 4 million tonnes this year, which matches its rated capacity. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1747971004000,
            "Source": "default"
        },
        {
            "Title": "National Aluminium Company: Q4 Profit Doubles to Rs 2,067 Crore",
            "Summary": "Nalco reported a twofold increase in Q4 net profit to Rs 2,067.23 crore, driven by higher aluminium prices and improved operational performance. Revenue jumped 47.2% YoY to Rs 5,267.8 crore. For FY25, net profit surged to Rs 5,267.94 crore with revenue rising to Rs 16,787.63 crore. The company achieved record bauxite excavation and domestic sales.",
            "Sentiment": "positive",
            "PublishDate": 1747883248000,
            "Source": "earnings"
        },
        {
            "Title": "National Aluminium Company Ltd: Q4 Profit Doubles, Revenue Surges 47%",
            "Summary": "Nalco's Q4 FY25 net profit nearly doubled to ₹2,067.23 crore, with revenue up 47.2% to ₹5,267.8 crore. FY25 profit increased to ₹5,267.94 crore, driven by strong aluminium prices and operational improvements. The company achieved record bauxite excavation and domestic sales for the year.",
            "Sentiment": "positive",
            "PublishDate": 1747839170000,
            "Source": "earnings"
        },
        {
            "Title": "National Aluminium Co Reports Significant Q4 Growth",
            "Summary": "National Aluminium Co has reported strong financial results for its fourth quarter. The company's EBITDA increased to 27.5 billion rupees from 11.08 billion rupees year-over-year, with EBITDA margin improving to 52.28% from 30.96%. Consolidated net profit rose to 20.7 billion rupees, up from 9.97 billion rupees year-over-year and 15.7 billion rupees quarter-over-quarter. Revenue for Q4 reached 52.7 billion rupees, compared to 35.79 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747834422000,
            "Source": "result"
        },
        {
            "Title": "National Aluminium Company Limited: Parliamentary Panel Criticizes Nalco for Slow Capex Spending",
            "Summary": "A parliamentary panel has criticized Nalco for spending less than 50% of its targeted Rs 2,000 crore capex in the first 10 months of FY 2024-25. As of January 2025, Nalco's capex stood at Rs 879 crore. The company is managing its planned outlay entirely through internal resources without government support.",
            "Sentiment": "negative",
            "PublishDate": 1743423784000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NALCO Added to FTSE All World Index with Estimated $14 Million Inflow",
            "Summary": "National Aluminium Company Limited (NALCO) has been added to the FTSE All World Index. This addition is expected to result in an inflow of approximately $14 million (1.2 billion rupees) into the stock.",
            "Sentiment": "positive",
            "PublishDate": 1742548560000,
            "Source": "corporate_action"
        },
        {
            "Title": "National Aluminium Company Limited: Q3 Results Show Strong Performance Driven by Alumina Prices",
            "Summary": "Nalco's Q3 performance significantly benefited from favorable alumina prices, which increased 107% YoY and 38% QoQ to $703/tonne. Systematix maintains a 'Buy' rating on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1739336666000,
            "Source": "earnings"
        },
        {
            "Title": "National Aluminium Company: US Tariffs to Impact Aluminium Prices and Exports",
            "Summary": "NALCO CMD expects aluminium prices to face pressure due to new US tariffs. The company anticipates LME aluminium prices at $2,575 this year and $2,600 next year. NALCO reported Q3FY25 revenue of ₹4,662 crore with ₹1,566 crore profit. A new 1 million-tonne refinery expansion is planned, with full capacity expected by FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1739260318000,
            "Source": "normal_news"
        },
        {
            "Title": "National Aluminium Co Reports Strong Q3 Results and Declares Dividend",
            "Summary": "National Aluminium Co has reported a significant increase in its Q3 consolidated net profit, rising to 15.66 billion rupees from 4.71 billion rupees year-over-year. The company's revenue also saw a substantial growth, reaching 46.6 billion rupees compared to 33.47 billion rupees in the same period last year. Additionally, the company has declared a second interim dividend of 4 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1739233283000,
            "Source": "earnings"
        },
        {
            "Title": "National Aluminium Company Focuses on Expansion Projects",
            "Summary": "National Aluminium Company (NALCO) is prioritizing the swift completion of various expansion activities. These include the 5th stream expansion of their refinery, operationalization of Pottangi mines, brownfield expansion of the smelter plant, and a planned expansion of their captive power plant (CPP). This information was shared in the company's investor presentation, highlighting NALCO's strategic focus on growth and increased production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1739201213000,
            "Source": "corporate_action"
        }
    ]
}