{
    "Symbol": "NAUKRI",
    "ISIN": "INE663F01032",
    "News": [
        {
            "Title": "Info Edge Board to Consider 2nd Interim Dividend",
            "Summary": "Info Edge (India) Limited has scheduled a board meeting for February 13, 2026, to consider declaring the second interim dividend for FY 2025-26. The trading window remains closed for designated persons.",
            "Sentiment": "positive",
            "PublishDate": 1770741686157,
            "Source": "co_actions_results"
        },
        {
            "Title": "Info Edge Schedules Q3FY26 Results Call on Feb 13",
            "Summary": "Info Edge (India) Limited announces conference call on February 13, 2026 at 4:00 PM IST to discuss Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770728702116,
            "Source": "co_actions_results"
        },
        {
            "Title": "Info Edge Releases Naukri JobSpeak Report for Jan 2026",
            "Summary": "Info Edge (India) Limited announces the availability of its monthly Naukri JobSpeak Index Report for January 2026, tracking Indian job market trends and hiring activities across multiple dimensions.",
            "Sentiment": "neutral",
            "PublishDate": 1769921929212,
            "Source": "stocks"
        },
        {
            "Title": "Info Edge Completes Whistle-Blower Investigation",
            "Summary": "Info Edge concludes independent investigation into 99acres business vertical complaint, finds no material financial impact, implements remedial actions.",
            "Sentiment": "neutral",
            "PublishDate": 1769521891371,
            "Source": "stocks"
        },
        {
            "Title": "Info Edge shares fall 2.51% amid volume surge",
            "Summary": "Info Edge India declined 2.51% to Rs 1,268.20, ranking among top Nifty Next 50 losers. Company reported strong Q2 FY26 revenue of Rs 805.45 crore, up from Rs 700.82 crore YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1769506722949,
            "Source": "stocks"
        },
        {
            "Title": "Info Edge Q3 PAT Expected to Rise 7.9% YoY to ₹280 cr",
            "Summary": "ICICI Securities forecasts Info Edge's Q3 FY25 net profit at ₹280 crore, up 7.9% YoY. Net sales projected to grow 15.7% YoY to ₹776.6 crore with EBITDA rising 10.4% YoY to ₹320 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769146433031,
            "Source": "co_actions_results"
        },
        {
            "Title": "Info Edge Subsidiary Invests ₹10 Crores in Aisle",
            "Summary": "Info Edge's subsidiary Jeevansathi approves ₹10 crore investment in dating platform Aisle Network through convertible debentures to meet working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1768819310717,
            "Source": "co_actions_results"
        },
        {
            "Title": "Info Edge Independent Director Resigns",
            "Summary": "Mr. Arindam Kumar Bhattacharya has resigned as Independent Director of Info Edge (India) Limited effective January 15, 2026, citing personal reasons. He also ceases to be member of Audit and Risk Management Committees.",
            "Sentiment": "neutral",
            "PublishDate": 1768467182348,
            "Source": "stocks"
        },
        {
            "Title": "White-Collar Hiring Jumps 13% In December; Fresher Recruitment Even Faster",
            "Summary": "White-collar hiring grew 13% in December with fresher recruitment jumping 18%, led by non-IT sectors like insurance (34%) and hospitality (29%), according to Naukri JobSpeak report.",
            "Sentiment": "positive",
            "PublishDate": 1767695583069,
            "Source": "stocks"
        },
        {
            "Title": "Info Edge Transfers Gramophone Stake to Unnati",
            "Summary": "Info Edge's subsidiary SIHL to transfer entire 50.94% stake in Gramophone to Unnati for ₹91.71 crores while investing additional ₹35 crores in Unnati through primary infusion.",
            "Sentiment": "neutral",
            "PublishDate": 1767453876265,
            "Source": "co_actions_results"
        },
        {
            "Title": "Info Edge Receives ESG Rating of 74 from NSE Sustainability for FY2024-25",
            "Summary": "NSE Sustainability Ratings Analytics Limited independently assigned an ESG rating of 74 to Info Edge (India) Limited for FY2024-25 based on the company's disclosures and publicly available data. The company clarified it did not engage NSE Sustainability for this rating, which was received on December 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765361147981,
            "Source": "stock"
        },
        {
            "Title": "Info Edge Increases PB Fintech Stake to 12.43% Following NCLT Amalgamation",
            "Summary": "Info Edge acquired an additional 6.47% stake in PB Fintech through an NCLT-approved amalgamation process, raising its total shareholding to 12.43%. The transaction strengthens Info Edge's position in PB Fintech and represents a significant ownership increase through the corporate restructuring mechanism.",
            "Sentiment": "positive",
            "PublishDate": 1765164419565,
            "Source": "order&deals"
        },
        {
            "Title": "Info Edge Announces ₹750 Million Investment Plan Across Portfolio Companies",
            "Summary": "Info Edge plans to invest ₹50 million in Smartweb Internet Services and ₹700 million in startup investments. The investment strategy demonstrates the company's continued focus on expanding its portfolio and supporting emerging businesses.",
            "Sentiment": "positive",
            "PublishDate": 1764155907390,
            "Source": "corporate_action"
        },
        {
            "Title": "Info Edge CFO Chintan Thakkar To Step Down From Executive Roles",
            "Summary": "Chintan Thakkar will step down from his positions as Whole-Time Director and Chief Financial Officer at Info Edge. The departure involves a key executive role at the company that operates job portal Naukri.com and other digital platforms.",
            "Sentiment": "neutral",
            "PublishDate": 1763565567457,
            "Source": "corporate_governance"
        },
        {
            "Title": "InfoEdge's Jeevansathi Acquires Remaining 3.65% Stake in Dating Platform Aisle for Rs. 5.50 Crores",
            "Summary": "Jeevansathi Internet Services, InfoEdge's wholly-owned subsidiary, acquired 1,279 equity shares of Aisle Network Private Limited for Rs. 5.50 crores, making Aisle a step-down wholly-owned subsidiary. The acquisition involves purchasing the remaining 3.65% stake along with termination of existing arrangements, consolidating InfoEdge's control over the dating platform that operates multiple apps including Aisle, Anbe, Arike, Neetho and Jalebi.",
            "Sentiment": "positive",
            "PublishDate": 1763109729003,
            "Source": "order&deals"
        },
        {
            "Title": "Info Edge Q2 Profit Surges 1,260% to Rs 316 Crore; Goldman Sachs and Nomura Maintain Buy Ratings",
            "Summary": "Info Edge reported a 1,260% year-on-year increase in consolidated Q2 net profit to Rs 316 crore, compared to Rs 23 crore in the previous year. The company, which operates Naukri.com, 99acres, Jeevansathi, and Shiksha, posted revenue from operations of Rs 805 crore, up 15% year-on-year. The quarter included exceptional gains of Rs 25 crore. Total billings reached Rs 729 crore, marking a 12% year-on-year increase. Goldman Sachs maintained its Buy rating with a target price of Rs 1,700, forecasting revenue growth of 15% and 17% for the next two fiscal years. Nomura also kept its Buy rating but reduced the target price to Rs 1,585 from Rs 1,600, expecting billing growth of 11-15% in the Naukri vertical. The stock trades at 25x EV/EBITDA and 32x P/E multiples, near six to seven-year lows. Info Edge shares are down over 20% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1763006707278,
            "Source": "earnings"
        },
        {
            "Title": "Info Edge Revises Growth Outlook Amid Market Uncertainty; Analysts Maintain Buy Ratings",
            "Summary": "Info Edge has adjusted its growth expectations for the coming quarters, citing market uncertainty. The company had originally targeted 15-17% growth this year based on Q4 FY25 performance, but faced an unexpected decline in Q1 FY26. Despite the revised outlook, analysts remain optimistic with HSBC setting a target price of Rs 1,670 and Nomura at Rs 1,585, both maintaining buy recommendations on the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1763005382545,
            "Source": "stock"
        },
        {
            "Title": "Info Edge Reports 14% Revenue Growth Despite Margin Contraction in September Quarter",
            "Summary": "Info Edge reported revenue growth of 14% to ₹746 crore compared to ₹656 crore in the same quarter last year. EBITDA increased 7.5% to ₹295 crore from ₹274.6 crore, though EBITDA margin contracted by 220 basis points to 39.6% from 41.8%. Net profit and one-time gain rose 6% to ₹350 crore from ₹331 crore. Following the earnings announcement, shares traded with gains of 0.87% at ₹1,352.70, though the stock remains down 23% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1762938350079,
            "Source": "earnings"
        },
        {
            "Title": "Info Edge Reports Q2 Revenue Growth and Declares Dividend",
            "Summary": "Info Edge reported quarterly revenue of 8 billion rupees, up from 7.9 billion rupees in the previous quarter. The company approved a dividend of 2.4 rupees per share. The recruitment business segment showed 11% growth in billings during the quarter, while cash generation increased by 13%.",
            "Sentiment": "positive",
            "PublishDate": 1762935711450,
            "Source": "earnings"
        },
        {
            "Title": "Info Edge Reports Q2 Net Profit Growth to 3.17 Billion Rupees",
            "Summary": "Info Edge reported Q2 consolidated net profit of 3.17 billion rupees, up from 3 billion rupees in the previous quarter. The company's Q2 EBITDA increased to 2.8 billion rupees from 2.64 billion rupees quarter-on-quarter. EBITDA margin improved to 34.75% compared to 33.44% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762934573170,
            "Source": "earnings"
        },
        {
            "Title": "InfoEdge Receives Improved ESG Rating of 74.4 for FY2024-25",
            "Summary": "InfoEdge (India) Limited received an ESG rating of 74.4 for FY2024-25 from SEBI-registered ESG ratings provider SESESG Research Private Limited, an improvement from the previous year's rating of 71.2 for FY2023-24. The company clarified that it did not engage SES for the ESG rating, and that SES independently prepared and issued the report based on the company's fiscal 2024 and 2025 disclosures and other publicly available data. InfoEdge received the communication from SES on November 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762839147647,
            "Source": "stock"
        },
        {
            "Title": "Info Edge Board Approves Partial Stake Sale in NoPaperForms Solutions for IPO",
            "Summary": "Info Edge (India) board has approved the sale of a portion of its stake in NoPaperForms Solutions Ltd. as part of the subsidiary's planned initial public offering. The decision enables NoPaperForms Solutions to proceed with its IPO plans while allowing Info Edge to partially monetize its investment in the company.",
            "Sentiment": "positive",
            "PublishDate": 1762439920067,
            "Source": "corporate_action"
        },
        {
            "Title": "Info Edge Plans 1 Billion Rupee Investment in Redstart Labs",
            "Summary": "Info Edge (India) has announced plans to invest 1 billion rupees in Redstart Labs. The investment represents a significant capital commitment by the company.",
            "Sentiment": "positive",
            "PublishDate": 1762171610376,
            "Source": "stock"
        },
        {
            "Title": "InfoEdge Announces Internal Reorganization with Senior Management Changes",
            "Summary": "InfoEdge (India) Limited has approved an internal reorganization within its recruitment vertical, effective November 3, 2025. The restructuring involves role changes for three senior management personnel and the cessation of two others. Jatin Thukral has been re-designated from Executive Vice President Head-Data Science to Chief Product Officer Naukri & Chief AI Scientist InfoEdge. Nimish Kulshrestha moves from Executive Vice President Product Development to Chief Business Officer for IIMJobs, Hirist & NaukriGulf. Shail Gaurav transitions from Executive Vice President Marketing to Chief Business Officer for Naukri360/FF & Head of B2C Marketing. Additionally, Rajesh Vashista Sindhwani and Harpuneet Singh Rekhi will cease their roles as Senior Management Personnel due to organizational structure changes. The company states this reorganization aims to enhance operational efficiency and align structure with strategic business objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1761890751419,
            "Source": "corporate_governance"
        },
        {
            "Title": "India's Employment Market Growth Expected to Accelerate to 4.4% in Second Half of 2025-26",
            "Summary": "India's employment market is projected to grow by 4.4% in the second half of 2025-26, representing an increase from the 2.8% growth rate recorded in the first half of the same period. This forecast indicates strengthening momentum in the country's job market.",
            "Sentiment": "positive",
            "PublishDate": 1760682021232,
            "Source": "stock"
        },
        {
            "Title": "Info Edge Reconstitutes Audit Committee and Stakeholders Relationship Committee",
            "Summary": "Info Edge (India) Limited has reconstituted its Audit Committee and Stakeholders Relationship Committee effective October 13, 2025. The Board of Directors approved the changes based on recommendations from the Nomination & Remuneration Committee. The Audit Committee now comprises Mr. Sanjiv Sachar as Chairman, with Mr. Arindam Kumar Bhattacharya and Mr. Ashish Gupta as members, all Independent Directors. The Stakeholders Relationship Committee is headed by Ms. Geeta Mathur as Chairperson, with Mr. Kapil Kapoor (Non-Executive Director) and Mr. Chintan Thakkar (Whole-time Director & Chief Financial Officer) as members.",
            "Sentiment": "neutral",
            "PublishDate": 1760426172880,
            "Source": "corporate_governance"
        },
        {
            "Title": "Info Edge Reports 12% Growth in Standalone Billings to ₹729 Crore in September Quarter",
            "Summary": "Info Edge (India) Ltd., parent company of Naukri.com, 99acres, Jeevansathi.com, and Shiksha, reported standalone billings of ₹729 crore for the September quarter, representing a 12% increase from ₹650.3 crore in the previous year. For the first half of financial year 2026, standalone billings reached ₹1,373.2 crore compared to ₹1,229.7 crore in the year-ago period. The recruitment solutions segment generated ₹545 crore in billings during the quarter versus ₹492 crore last year, while the 99acres real estate segment reported ₹122.4 crore compared to ₹107.4 crore previously. The 'others' category contributed ₹61.6 crore, up from ₹50.9 crore. Despite the business growth, Info Edge shares have declined 21.6% year-to-date and closed the previous session 1% lower at ₹1,369.2.",
            "Sentiment": "neutral",
            "PublishDate": 1759973906096,
            "Source": "earnings"
        },
        {
            "Title": "Info Edge Releases Naukri JobSpeak Index Report for September 2025",
            "Summary": "Info Edge (India) Limited has released its Naukri JobSpeak Index Report for September 2025 on the company's website. The monthly index tracks the state of the Indian job market and hiring activities based on new job listings and job-related searches by recruiters on Naukri.com's resume database. The report provides insights across multiple dimensions including industries, cities, functional areas, and experience bands.",
            "Sentiment": "neutral",
            "PublishDate": 1759291759585,
            "Source": "stock"
        },
        {
            "Title": "Info Edge Reports Strong Q2 FY'26 Performance with 10% Annual Growth",
            "Summary": "Info Edge (India) Ltd completed Q2 FY'26 with strong performance results. The company achieved 10% yearly growth in September.",
            "Sentiment": "positive",
            "PublishDate": 1759291395805,
            "Source": "earnings"
        },
        {
            "Title": "Info Edge to Invest ₹120 Million in Zwayam Digital",
            "Summary": "Info Edge (India) plans to invest ₹120 million in Zwayam Digital. The investment represents Info Edge's expansion into digital ventures through strategic funding.",
            "Sentiment": "positive",
            "PublishDate": 1759149657367,
            "Source": "order&deals"
        },
        {
            "Title": "Info Edge Named India's Most Successful Venture Investor with Rs 53,000 Crore Portfolio Value",
            "Summary": "Info Edge, parent company of Naukri.com, has been recognized as India's most successful venture investor. The company, led by Sanjeev Bikhchandani, invested Rs 3,959.16 crore across platforms over the last 15 years. Its investments in Zomato and Policybazaar between 2011 and 2015 are currently valued at around Rs 53,000 crore. Info Edge holds 12.40% in Zomato (worth Rs 38,350 crore) and 19.63% in Policybazaar (worth Rs 15,133 crore), having invested Rs 483.78 crore and Rs 591.40 crore respectively in these companies. The firm achieved an estimated 36% gross IRR across all investment vintages and has backed 111 companies to date. Info Edge operates its investment activity through four distinct phases since 2007, with recent investments made through SEBI-registered AIF vehicles including Info Edge Venture Fund, Info Edge Capital, and Capital 2B.",
            "Sentiment": "positive",
            "PublishDate": 1758961029223,
            "Source": "stock"
        },
        {
            "Title": "Info Edge India Block Trade Worth Rs. 82.20 Crores Executed on NSE",
            "Summary": "Info Edge (India) Ltd. witnessed a block trade on the National Stock Exchange involving approximately 603,677 shares at a price of Rs. 1,361.70 per share. The total transaction value amounted to Rs. 82.20 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1757996406119,
            "Source": "order&deals"
        },
        {
            "Title": "Info Edge Shares Under Scrutiny Following Whistleblower Complaint at 99acres Unit",
            "Summary": "Info Edge disclosed a whistleblower complaint alleging policy violations by employees at its real estate division, 99acres. The company has referred the matter to its Audit Committee and Board of Directors, appointing a specialist law firm to conduct an independent investigation. Info Edge stated there is no material impact on its financial statements currently. The stock closed at Rs 1,363.40, down 0.62% on Friday, and has declined 22% year-to-date and 13% over the past year. Technically, the stock trades below seven of eight key moving averages with bearish indicators. In quarterly results, consolidated net profit grew 27% year-on-year to Rs 296 crore while revenue increased 17% to Rs 791 crore, though sequential performance showed profit declining 36% from the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1757908166353,
            "Source": "corporate_governance"
        },
        {
            "Title": "Info Edge Receives Whistle-Blower Complaint Against 99acres Employees",
            "Summary": "Info Edge (India) Limited received a whistle-blower complaint alleging policy violations by employees in its 99acres business vertical. The company's Audit Committee and Board of Directors have mandated a specialist law firm to conduct an independent investigation into the matter. The assessment is currently ongoing, and the company reports no material impact on its financial statements. The complaint will be handled according to the company's established whistle-blower policy.",
            "Sentiment": "negative",
            "PublishDate": 1757761993112,
            "Source": "corporate_governance"
        },
        {
            "Title": "Infoedge's Jobspeak Reports White-Collar Hiring Decline in August",
            "Summary": "Infoedge's Jobspeak platform reported that white-collar hiring dropped to 3% in August, down from 7% in July. This represents a significant decline in hiring activity within the white-collar job segment during this period.",
            "Sentiment": "negative",
            "PublishDate": 1756717222323,
            "Source": "stock"
        },
        {
            "Title": "Infoedge Reports 7% Annual Hiring Growth in Q2 FY26",
            "Summary": "Infoedge's job report indicates a 7% year-over-year increase in hiring activity during the second quarter of FY26. The growth reflects expansion in employment opportunities tracked by the company.",
            "Sentiment": "positive",
            "PublishDate": 1756715584954,
            "Source": "stock"
        },
        {
            "Title": "Info Edge CFO Chintan Thakkar Resigns After 12 Years; Ambarish Raghuvanshi Named Interim CFO",
            "Summary": "Chintan Thakkar, Whole-time Director and Chief Financial Officer of Info Edge (India) Limited, has resigned to pursue another career opportunity. Thakkar will be relieved from his responsibilities on or before November 19, 2025, after nearly 12 years with the company. During his tenure, he played a pivotal role in driving strategic initiatives, capital market transactions, fund-raising and investor relations. The Board has appointed Ambarish Raghuvanshi as Interim Chief Financial Officer effective November 20, 2025. Raghuvanshi previously served as Info Edge's Whole-time Director and CFO from 2001 to 2014 and is a co-promoter of the company. Thakkar will join IAN Group as Group CEO and Senior Managing Partner at IAN Alpha Fund. The company is actively searching for a permanent replacement for the CFO position.",
            "Sentiment": "neutral",
            "PublishDate": 1755609707580,
            "Source": "corporate_governance"
        },
        {
            "Title": "Info Edge Q1 FY26 Results: Recruitment Billings Growth Moderates to 9% Amid Macro Headwinds",
            "Summary": "Info Edge reported quarterly results with standalone billings of Rs.644 crores (11% YoY growth) and revenue of Rs.736 crores (15% YoY growth). The recruitment business, which generates majority revenue, saw billings growth moderate to 9% at Rs.470 crores due to contract deferrals by clients and demand slowdown across certain sectors. IT services, BPM, BFSI, and infrastructure segments experienced low single-digit growth, while GCCs, technology companies, retail, healthcare, and manufacturing continued double-digit growth. Operating profit grew 10% to Rs.250 crores with 34% margins. Non-recruitment businesses showed improvement - 99acres billings grew 17%, Jeevansathi achieved breakeven with 36% billings growth, and Shiksha maintained profitability. The company holds cash reserves of Rs.4,828 crores. Management noted July showed better performance with 19% collection growth and 13% billing growth in recruitment, though expressed caution about future quarters given macroeconomic uncertainty. Marketing expenses increased across businesses as part of market share expansion strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1755174332897,
            "Source": "earnings"
        },
        {
            "Title": "Info Edge India Executes Rs. 96.15 Crore Block Trade on NSE",
            "Summary": "Info Edge (India) Ltd. completed a block trade worth Rs. 96.15 crores on the National Stock Exchange. The transaction involved approximately 716,966 shares at a price of Rs. 1,341.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755143475720,
            "Source": "order&deals"
        },
        {
            "Title": "Info Edge Reports 11.2% Billings Growth in Q1FY26 Despite Recruitment Slowdown",
            "Summary": "Info Edge (India) Limited reported quarterly results for the period ended June 30, 2025, showing standalone billings growth of 11.2% year-on-year to Rs 644.2 crore. Revenue from operations increased 15.3% to Rs 736.4 crore compared to Rs 638.9 crore in the corresponding quarter. The recruitment business grew 9.0% while non-recruitment portfolio (99acres, Jeevansathi, Shiksha) recorded combined growth of 17.6%. Operating profit reached Rs 250.2 crore with a margin of 34.0%. Net profit for the quarter was Rs 259.6 crore with earnings per share of Rs 4.01. The company maintained a strong cash balance of Rs 4,828 crore. Management noted that recruitment segment was impacted by geopolitical headwinds and sectoral slowdown towards quarter-end, while non-recruitment businesses continued progress with reduced cash losses. The Board recommended a final dividend of Rs 3.60 per equity share subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754642740097,
            "Source": "earnings"
        },
        {
            "Title": "Info Edge Q1 Revenue Rises to 7.9B Rupees, Net Profit Drops to 3B Rupees",
            "Summary": "Info Edge reported Q1 revenue of 7.9 billion rupees, up from 7.5 billion rupees in the previous quarter. EBITDA increased to 2.64 billion rupees from 2.48 billion rupees quarter-on-quarter, with EBITDA margin improving to 33.44% from 33.09%. However, consolidated net profit declined to 3 billion rupees compared to 4.63 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754642085936,
            "Source": "earnings"
        },
        {
            "Title": "Info Edge Subsidiary's Fund Secures Rs. 90.30 Crore Commitment from Greenland INR Holdings",
            "Summary": "IE Venture Investment Fund III, sponsored by Smartweb Internet Services Limited (a wholly-owned subsidiary of Info Edge), has signed a contribution agreement with Greenland INR Holdings LLC for Rs. 90.30 crore. This commitment represents 11.35% of the fund's total commitments secured so far. The fund operates as a scheme of Karkardooma Trust, which is registered as a Category II Alternative Investment Fund with SEBI. The commitment is subject to fulfillment of certain conditions precedent, including completion of documentation to the satisfaction of both parties.",
            "Sentiment": "positive",
            "PublishDate": 1753270963834,
            "Source": "stock"
        },
        {
            "Title": "Info Edge Gains 4% as Eternal Stake Reaches One-Third of Market Cap",
            "Summary": "Info Edge India shares rose nearly 4% following strong performance by Eternal Ltd., Zomato's parent company, during June quarterly results. Eternal shares surged 15% to all-time highs. Info Edge holds a 12.38% stake in Eternal worth over ₹37,100 crore, representing more than one-third of Info Edge's ₹94,000 crore market capitalization. Info Edge initially invested ₹4.7 crore for an 18.5% stake in Eternal in August 2010 during the seed round and held close to 19% at the time of Zomato's 2021 IPO. Info Edge shares traded at ₹1,457.9, though down 17% year-to-date in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753158998331,
            "Source": "stock"
        },
        {
            "Title": "InfoEdge to Sell Shopkirana E Trading Unit for $23 Million",
            "Summary": "InfoEdge has announced the sale of its unit Shopkirana E Trading to HiveLoop E Commerce for $23 million (₹198 crore). The transaction involves the divestment of a subsidiary or business unit of InfoEdge.",
            "Sentiment": "neutral",
            "PublishDate": 1752812994000,
            "Source": "default"
        },
        {
            "Title": "Info Edge to Invest Rs 25 Crore in Startup Investments Unit",
            "Summary": "Info Edge has decided to invest approximately Rs 25 crore in its startup investments unit. This investment indicates the company's commitment to supporting and expanding its startup portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1752567182000,
            "Source": "default"
        },
        {
            "Title": "Info Edge: Q1 Billings Up 11%, Stock Drops 5%",
            "Summary": "Info Edge reported Q1 FY26 standalone billings increased 11.23% to ₹644.2 crore. Recruitment billings rose 9% and real estate billings 16% year-over-year. The company's stock fell over 5% following the business update.",
            "Sentiment": "neutral",
            "PublishDate": 1751870490000,
            "Source": "result"
        },
        {
            "Title": "Info Edge Reports Increase in Q1FY26 Standalone Billings",
            "Summary": "Info Edge (India) has reported an increase in standalone billings for Q1FY26. The company's billings rose to ₹644 crore, up from ₹579 crore in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1751864808000,
            "Source": "default"
        },
        {
            "Title": "Hiring Activity Shows 11% Growth in June",
            "Summary": "According to Naukri, hiring activity demonstrated strong double-digit growth of 11% in June. The article does not provide additional details about the time frame for comparison, specific sectors, or any other contextual information.",
            "Sentiment": "positive",
            "PublishDate": 1751446173000,
            "Source": "default"
        },
        {
            "Title": "Info Edge: Q4 Revenue Up 13%, Macro Uncertainty Limits Upside",
            "Summary": "Info Edge reported Q4 FY25 revenue of Rs 6.9 billion, up 13.0% YoY. Overall billing increased 19.0% YoY to Rs 9.8 billion. Ebitda rose 4.9% YoY to Rs 2.6 billion, with margin at 37.7%. ICICI Securities maintains 'Hold' rating due to macro uncertainty.",
            "Sentiment": "neutral",
            "PublishDate": 1748415328000,
            "Source": "earnings"
        },
        {
            "Title": "Info Edge Focuses on Employer Branding and Jeevansathi Growth",
            "Summary": "Info Edge is working to strengthen its employer branding solutions across platforms including Naukri, IIMJobs, Hirist, and AmbitionBox. The company also aims to continue gaining market share in Jeevansathi, targeting a growth rate of 20-25% compared to the industry's 8-10% growth.",
            "Sentiment": "positive",
            "PublishDate": 1748402986000,
            "Source": "default"
        }
    ]
}