{
    "Symbol": "NAVA",
    "ISIN": "INE725A01030",
    "News": [
        {
            "Title": "NAVA Sugar Project Advances with Equipment Supply",
            "Summary": "Nava Bharat Ventures reports progress in its integrated sugar project with sugarcane plantation multiplication advancing and equipment supplies set to commence soon.",
            "Sentiment": "positive",
            "PublishDate": 1770280118309,
            "Source": "stocks"
        },
        {
            "Title": "Nava Limited Grants 1.55 Lakh RSUs to Employees",
            "Summary": "Nava Limited's Nomination & Remuneration Committee approved Grant-IV of 1,55,000 Restricted Stock Units under NAVA RSU 2023 plan to eligible employees at Rs.462 per RSU with four-year vesting schedule.",
            "Sentiment": "positive",
            "PublishDate": 1770278179086,
            "Source": "co_actions_results"
        },
        {
            "Title": "NAVA Limited Appoints New CFO, Announces Resignation",
            "Summary": "NAVA Limited's Board approves appointment of B. Srinivasa Rao as CFO effective March 04, 2026, while K.V.S. Vithal resigns from the position to pursue other opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1770277302082,
            "Source": "stocks"
        },
        {
            "Title": "NAVA Q3 Net Profit Drops to ₹2.2B from ₹2.5B YoY",
            "Summary": "Nava Bharat Ventures reports consolidated net profit of ₹2.2 billion in Q3, representing a decline from ₹2.5 billion in the same quarter of the previous year, marking a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1770276159918,
            "Source": "co_actions_results"
        },
        {
            "Title": "NAVA Board Meet Set for Q3FY26 Results on Feb 5",
            "Summary": "NAVA LIMITED schedules board meeting for February 05, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 01 to February 07, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769597389588,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nava to receive ₹450 crore from Singapore buyback",
            "Summary": "Nava Limited will receive $50 million (₹450 crore) as buyback proceeds from wholly owned Singapore subsidiary Nava Global, maintaining 100% ownership while unlocking capital for strategic priorities.",
            "Sentiment": "positive",
            "PublishDate": 1767606443494,
            "Source": "co_actions_results"
        },
        {
            "Title": "NAVA's Subsidiary NBEIL Gets Credit Rating Upgrade",
            "Summary": "CARE Ratings upgrades Nava Bharat Energy India Limited's long-term rating to A stable from A- stable and short-term rating to A1 from A2, while withdrawing supported rating.",
            "Sentiment": "positive",
            "PublishDate": 1767359413496,
            "Source": "stocks"
        },
        {
            "Title": "Nava Limited Promoter Group Transfers 14.06 Lakh Equity Shares Through Partition Deed",
            "Summary": "Trivikrama Prasad Pinnamaneni HUF, part of Nava Limited's promoter group, transferred 14,06,000 equity shares (0.50% stake) to a relative through an off-market partition deed transaction. The share transfer was completed on November 24, 2025, and disclosed to stock exchanges as per insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764135867301,
            "Source": "corporate_action"
        },
        {
            "Title": "Nava Limited Seeks Shareholder Approval for Re-designation of Ashwin Devineni as Vice Chairman of Singapore Subsidiary",
            "Summary": "Nava Limited has issued a postal ballot notice seeking shareholder approval for re-designating Managing Director Ashwin Devineni as Vice Chairman of wholly-owned subsidiary Nava Global Pte. Ltd., effective November 8, 2025, with unchanged remuneration of USD 2,203,235 per annum plus 5% commission on profits. The e-voting process runs from November 15 to December 14, 2025, with the re-designation aimed at transitioning from operational involvement to strategic oversight of international businesses.",
            "Sentiment": "neutral",
            "PublishDate": 1763173869161,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nava Limited Reports Q2FY26 Results, Declares 300% Interim Dividend",
            "Summary": "Nava Limited declared its highest-ever interim dividend of 300% following steady revenue growth driven by robust Metals segment performance and sustained Energy business momentum. The company successfully transitioned its Odisha captive power plant to an independent power plant and secured a 5-year PPA for 50 megawatts with Tamil Nadu at INR 5.95 per unit, while advancing its 100-megawatt solar project and 300-megawatt Maamba expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763041738466,
            "Source": "earnings"
        },
        {
            "Title": "Nava Limited Q2FY26 Results: Revenue Grows Despite Lower Margins",
            "Summary": "Nava Limited reported consolidated revenue growth in Q2FY26 driven by higher Ferroalloys sales of 32,760 MT compared to 19,337 MT in September 2024. The Energy division maintained revenue levels despite early monsoon and prolonged rains affecting power demand and tariffs. Consolidated profit before tax stood at ₹244.2 crores with profit after tax at ₹177.5 crores. The Ferroalloys division faced lower realizations in export markets. Maamba Energy received US$30.0 million during the quarter, reducing outstanding receivables to US$55.5 million. The company received dividends of US$10.0 million from Nava Global and ₹13.0 crores from Nava Bharat Energy India Limited. Key operational highlights include conversion of 60MW Odisha operations into Independent Power Plant, progress on MEL's Phase II 300MW expansion project, commencement of Maamba Solar's 100MW solar project construction, and advancement of integrated sugar project with sugarcane plantation multiplication.",
            "Sentiment": "neutral",
            "PublishDate": 1762527202151,
            "Source": "earnings"
        },
        {
            "Title": "Nava Limited Grants 2.8 Lakh Restricted Stock Units to Employees Under RSU Plan 2023",
            "Summary": "Nava Limited's Nomination Remuneration Committee approved the grant of 2,80,000 Restricted Stock Units (RSUs) to eligible employees under the NAVA-RESTRICTED STOCK UNIT PLAN 2023. Each RSU carries the right to one equity share of Re. 1 face value at an exercise price of Rs. 476.28 per RSU. The RSUs will vest over four years starting November 2026, with 20% vesting in the first two years, 25% in the third year, and 35% in the fourth year. All RSUs have a minimum vesting period of one year and must be exercised within 90 days of vesting. The company's board retains the right to modify the plan terms subject to applicable laws and regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762506787419,
            "Source": "corporate_action"
        },
        {
            "Title": "NAVA Limited Reports Strong Q2 Results with 300% Interim Dividend Declaration",
            "Summary": "NAVA Limited's Board approved unaudited financial results for the second quarter and half year ended September 30, 2025. The company declared an interim dividend of 300% (Rs. 3.00 per equity share of Re. 1 each) with November 14, 2025 as the record date. Key leadership changes include Mr. Ashwin Devineni's resignation from Managing Director position at subsidiary Nava Global Pte. Limited while continuing as director, and his re-designation as Vice-Chairman effective November 8, 2025, for the remainder of his term until March 31, 2029. The consolidated results show total income of Rs. 2,15,695.69 lakhs for the half year and profit of Rs. 77,790.72 lakhs from continuing operations. The company operates across ferro alloys, energy, and mining segments with 18 subsidiaries included in the consolidated statement.",
            "Sentiment": "positive",
            "PublishDate": 1762505106696,
            "Source": "earnings"
        },
        {
            "Title": "NAVA Reports 24% Decline in Q2 EBITDA to 3.15 Billion Rupees",
            "Summary": "NAVA's Q2 EBITDA decreased to 3.15 billion rupees from 4.14 billion rupees in the same quarter last year. The company's EBITDA margin also contracted to 32.71% compared to 45.94% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762502451321,
            "Source": "earnings"
        },
        {
            "Title": "NAVA Reports Mixed Quarterly Results with Revenue Growth and Profit Decline",
            "Summary": "NAVA reported quarterly revenue of 10 billion rupees, up from 9 billion rupees in the same period last year, representing an 11% year-over-year increase. However, the company's consolidated net profit declined significantly to 1.3 billion rupees from 2.5 billion rupees in the previous year, marking a 48% decrease.",
            "Sentiment": "mixed",
            "PublishDate": 1762502071412,
            "Source": "earnings"
        },
        {
            "Title": "Nava Limited Schedules Board Meeting to Consider Interim Dividend for FY 2025-26",
            "Summary": "Nava Limited has announced that its board meeting scheduled for November 7, 2025 will include consideration of an interim dividend on equity shares for Financial Year 2025-26. This is an additional agenda item to the previously announced board meeting dated October 24, 2025. The company trades on NSE under symbol NAVA and on BSE with scrip code 513023.",
            "Sentiment": "positive",
            "PublishDate": 1762168101267,
            "Source": "corporate_action"
        },
        {
            "Title": "Nava Limited Reports Record Quarterly Profit of Rs 490 Crore in Q1 FY26",
            "Summary": "Nava Limited delivered its highest ever quarterly profit of Rs 490 crore in Q1 FY26, representing a 61% quarter-on-quarter increase. Consolidated revenues reached Rs 1,213 crore, rising nearly 15% sequentially. The strong performance was driven by robust energy operations, higher realizations in metal businesses, and disciplined cost control. Maamba Energy Limited collected $75 million in arrears and declared its maiden dividend of $32.5 million. The company expects to receive the remaining $85 million in receivables before the end of the financial year. Tax exemption benefits will be reduced from FY26 onwards, with the company now subject to 15% tax rate (50% of standard rate) for the next three years. The MEL Phase II expansion of 300 MW and 100 MW solar project in Zambia are progressing on schedule for commissioning by August 2026 and July 2026 respectively. The company is also advancing a $200 million integrated sugar project in Zambia, expected to be completed by April 2028. Nava maintains its dividend policy of 25-30% of standalone profits and holds net cash of approximately Rs 1,400 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755521846067,
            "Source": "earnings"
        },
        {
            "Title": "Nava Limited Reports Highest-Ever Quarterly PBT with 31.8% Net Profit Growth",
            "Summary": "Nava Limited announced financial results for the quarter ended June 30, 2025, reporting its highest-ever quarterly profit before tax. Consolidated total income reached ₹1,232.6 crore, up 16.7% quarter-on-quarter but down 2.0% year-on-year. Net profit increased 31.8% quarter-on-quarter to ₹399.1 crore, though declined 10.5% year-on-year. The company's subsidiary Maamba Energy Limited received USD 75.0 million in arrears, reducing outstanding receivables to USD 85.5 million, and distributed its maiden dividend with Nava receiving USD 32.5 million. Ferro alloys sales volume rose to 33,130 MT from 25,116 MT year-on-year. Energy operations showed strong performance with MEL maintaining 95.2% plant load factor and Indian power plants averaging 86.6% PLF. The company received approvals to segregate two captive power plants as independent power producers. Avocado plantations are scheduled for first commercial harvest of approximately 250 MT in November/December 2025, while the sugar project capex is estimated at USD 200.0 million.",
            "Sentiment": "positive",
            "PublishDate": 1755158920104,
            "Source": "earnings"
        },
        {
            "Title": "NAVA Reports Mixed Q1 Results with Revenue Decline and Margin Improvement",
            "Summary": "NAVA reported Q1 revenue of 11.9 billion rupees, down from 12.2 billion rupees in the previous year. Consolidated net profit decreased to 3.08 billion rupees from 3.55 billion rupees year-over-year. EBITDA remained flat at 5.9 billion rupees compared to the same period last year. However, EBITDA margin improved to 49.31% from 48.26% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755155355559,
            "Source": "earnings"
        },
        {
            "Title": "Nava Limited Schedules Board Meeting for August 14 to Approve Quarterly Financial Results",
            "Summary": "Nava Limited has scheduled a Board of Directors meeting for August 14, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The results will include both consolidated and standalone financials. The company's trading window closed on July 1, 2025, and will remain closed until August 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754322542206,
            "Source": "corporate_action"
        },
        {
            "Title": "Nava Limited Sets August 7, 2025 as Record Date for Final Dividend",
            "Summary": "Nava Limited has fixed August 7, 2025 as the record date for determining shareholder eligibility for the final dividend for FY 2024-25. The dividend is subject to shareholder approval at the Annual General Meeting scheduled for August 14, 2025. If approved, the final dividend will be paid within the statutory time limit from the date of approval. The Board of Directors had previously recommended this final dividend in May 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753155502228,
            "Source": "corporate_action"
        },
        {
            "Title": "Nava Ltd: Board Recommends 600% Dividend for FY 2025",
            "Summary": "Nava Ltd's Board of Directors has recommended a final dividend of 600% (₹6 per equity share) for the financial year ended March 31, 2025, subject to shareholder approval at the upcoming AGM. The stock price opened at ₹472.45 and rose to ₹483.20 amid a broader market decline.",
            "Sentiment": "positive",
            "PublishDate": 1747388493000,
            "Source": "corporate_action"
        },
        {
            "Title": "NAVA Reports Q4 Results and Declares Dividend",
            "Summary": "NAVA has announced its Q4 financial results and a dividend declaration. The company's Q4 revenue increased to 10.2 billion rupees from 9.2 billion rupees year-over-year. Q4 EBITDA remained stable at 3.8 billion rupees, although the EBITDA margin decreased to 37.48% from 41.3% year-over-year. The consolidated net profit for Q4 rose to 2.34 billion rupees from 2.1 billion rupees year-over-year. Additionally, NAVA declared a dividend of 6 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747383277000,
            "Source": "result"
        },
        {
            "Title": "Nava Limited to Consider Q4 Results on May 16",
            "Summary": "Nava Limited has announced that it will consider and approve its financial results for the fourth quarter on May 16.",
            "Sentiment": "neutral",
            "PublishDate": 1746627563000,
            "Source": "default"
        },
        {
            "Title": "Nava's Zambian Subsidiary Granted Expanded Exploration License",
            "Summary": "Nava's Zambian subsidiary has been granted an extension to its large-scale exploration license by the Government of Zambia. The license area has been increased from 4,358.8 hectares to 7,566.2614 hectares, significantly expanding the company's exploration potential in the region.",
            "Sentiment": "positive",
            "PublishDate": 1741047125000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nava Resources' Zambian Subsidiary Granted Expanded Exploration License",
            "Summary": "Nava Resources' subsidiary in Zambia has been granted an extension to its large-scale exploration license by the Zambian government. The license area has been increased from 4,358.8 hectares to 7,566.2614 hectares, significantly expanding the company's exploration potential in the country.",
            "Sentiment": "positive",
            "PublishDate": 1741009143000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nava Ltd Approves Share Buyback at ₹500 Per Share",
            "Summary": "Nava Ltd has approved a share buyback program through a tender offer. The company will repurchase its own shares at a price of ₹500 per share. This corporate action aims to return value to shareholders and potentially boost the stock price.",
            "Sentiment": "positive",
            "PublishDate": 1739946581000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nava Limited Reports Improved Q3 EBITDA and Margin",
            "Summary": "Nava Limited has announced its Q3 financial results, showing an increase in EBITDA from 4.1 billion rupees to 4.5 billion rupees year-over-year. The company's EBITDA margin also improved significantly, rising from 44.11% to 53.39% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738915390000,
            "Source": "earnings"
        },
        {
            "Title": "Nava Limited Reports Q3 Revenue Decline",
            "Summary": "Nava Limited has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 8.4 billion rupees, down from 9.3 billion rupees in the same quarter of the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738915254000,
            "Source": "earnings"
        },
        {
            "Title": "Nava Limited Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Nava Limited has reported a consolidated net profit of 2.5 billion rupees for the third quarter, down from 3.3 billion rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738915187000,
            "Source": "earnings"
        }
    ]
}