{
    "Symbol": "NAVINFLUOR",
    "ISIN": "INE048G01026",
    "News": [
        {
            "Title": "Navin Fluorine schedules analyst meet for Feb 18, 2026",
            "Summary": "Navin Fluorine International Limited announces analyst/institutional investor meet on February 18, 2026 at 13:00 PM IST under Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770808529406,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navin Fluorine CHRO Pankaj Lochan Resigns",
            "Summary": "Navin Fluorine International's Chief Human Resource Officer Pankaj Lochan has resigned effective February 27, 2026, citing personal and professional plans. Company initiates search for replacement.",
            "Sentiment": "neutral",
            "PublishDate": 1770638391769,
            "Source": "stocks"
        },
        {
            "Title": "Navin Fluorine Q3FY26 profit surges 122% YoY",
            "Summary": "Navin Fluorine International reports consolidated net profit of ₹185.40 crores for Q3FY26, up 122% YoY, with revenue rising 47% to ₹892.37 crores despite exceptional charges.",
            "Sentiment": "positive",
            "PublishDate": 1770636993494,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navin Fluorine Starts 40,000 Tonnes HF Production",
            "Summary": "Navin Fluorine International commences commercial production at its new 40,000 tonnes per year hydrofluoric acid facility in Dahej, backed by ₹450 crores investment.",
            "Sentiment": "positive",
            "PublishDate": 1770369892701,
            "Source": "stocks"
        },
        {
            "Title": "Navin Fluorine schedules investor meet for Feb 11",
            "Summary": "Navin Fluorine International Limited announces analyst/investor meet at Nuvama India Conference 2026 on February 11, 2026, featuring one-on-one and group meetings with company officials.",
            "Sentiment": "neutral",
            "PublishDate": 1770116767953,
            "Source": "stocks"
        },
        {
            "Title": "Navin Fluorine Appoints Kartikeya Dube as Director",
            "Summary": "Navin Fluorine International shareholders approve appointment of Kartikeya Dube as Independent Director through postal ballot with 99.96% votes in favor. Dube brings 30+ years experience in business and finance.",
            "Sentiment": "positive",
            "PublishDate": 1769616335211,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navin Fluorine Gets ESG Rating of 66.7 from SES ESG",
            "Summary": "Navin Fluorine International receives an ESG rating score of 66.7 from SES ESG Research Private Limited based on publicly available data, without company engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1769245741891,
            "Source": "stocks"
        },
        {
            "Title": "Navin Fluorine Issues TDS Certificates for FY25 Dividend",
            "Summary": "Navin Fluorine International Limited notifies shareholders about TDS certificate availability for final dividend of ₹7.00 per share paid for FY2024-25, downloadable through KFinTech portal until July 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769173621636,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navin Fluorine Block Trade Worth ₹20.85 Crores",
            "Summary": "Navin Fluorine International executed a significant NSE block trade involving 34,099 shares at ₹6,115.00 per share, totaling ₹20.85 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768798316823,
            "Source": "co_actions_results"
        },
        {
            "Title": "HDFC Securities Maintains Buy on Navin Fluorine at ₹7,000",
            "Summary": "HDFC Securities has maintained its Buy rating on Navin Fluorine International with a target price of ₹7,000, indicating positive analyst sentiment for the specialty chemicals company.",
            "Sentiment": "positive",
            "PublishDate": 1767930919473,
            "Source": "stocks"
        },
        {
            "Title": "Navin Fluorine Starts CGMP-4 Plant Production",
            "Summary": "Navin Fluorine International commences commercial production at Phase 1 of its CGMP-4 manufacturing facility in Dewas, marking a significant operational milestone for the specialty chemicals company.",
            "Sentiment": "positive",
            "PublishDate": 1767187519010,
            "Source": "stocks"
        },
        {
            "Title": "Navin Fluorine Allots 2,850 Shares Under ESOP",
            "Summary": "Navin Fluorine International allotted 2,850 equity shares to employees under its 2017 stock option scheme on December 18, 2025, increasing paid-up share capital to ₹10.25 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766055105888,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navin Fluorine International Appoints Kartikeya Dube as Independent Director",
            "Summary": "Navin Fluorine International Limited appointed Kartikeya Dube as Additional Non-Executive Director and Independent Director for a 5-year term starting December 3, 2025, subject to member approval. Dube brings over 30 years of experience in business, finance, and governance, and serves as Chairman of bp Group of Companies, India.",
            "Sentiment": "positive",
            "PublishDate": 1764662841833,
            "Source": "corporate_governance"
        },
        {
            "Title": "LIC Reduces Stake in Navin Fluorine International Through Market Sale",
            "Summary": "Life Insurance Corporation of India sold 10,26,272 shares of Navin Fluorine International Limited through market sale, reducing its shareholding from 8.850% to 6.847%. The transaction occurred between March 28, 2024 and November 28, 2025, representing a 2.003% stake reduction in the specialty chemicals company.",
            "Sentiment": "neutral",
            "PublishDate": 1764598744090,
            "Source": "corporate_action"
        },
        {
            "Title": "Navin Fluorine Reports Strong Q2FY26 Results with 46% Revenue Growth",
            "Summary": "Navin Fluorine International achieved consolidated revenue of Rs. 758.4 crores in Q2FY26, up 46% year-on-year, with operating EBITDA margin expanding to 32.5% from 20.7%. The company announced new capex plans worth Rs. 75 crores for additional HFC capacity and expects peak revenue potential of Rs. 600-825 crores per annum from upcoming projects.",
            "Sentiment": "positive",
            "PublishDate": 1763381294241,
            "Source": "stock"
        },
        {
            "Title": "Navin Fluorine Reports Strong Q2 Performance with 46% Revenue Growth, Announces INR 311.5 Crore Capex",
            "Summary": "Navin Fluorine International Limited reported quarterly revenue of INR 758 crores, marking 46% year-on-year growth. Operating EBITDA reached INR 246 crores with margins at 32.5% versus 20.7% in the previous year. Profit after tax more than doubled to INR 148 crores from INR 59 crores. For the half-year, revenue grew 42% to INR 1,484 crores with EBITDA at INR 453 crores. The Board declared an interim dividend of INR 6.5 per share and approved two strategic capex projects totaling INR 311.5 crores. The first involves INR 236.5 crores for additional HFC capacity equivalent to 15,000 metric tonnes per annum of R32, expected to generate peak annual revenue of INR 600-825 crores. The second is a INR 75 crore debottlenecking of MPP capacity with potential revenue of INR 140-160 crores per annum. Both projects will be funded through internal accruals. All three business divisions - HPP, Specialty, and CDMO - reported good growth, with the company maintaining optimistic outlook for sustained momentum.",
            "Sentiment": "positive",
            "PublishDate": 1762313109701,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine Raises EBITDA Margin Guidance to 28-30% for FY26, Plans ₹1,000 Crore Capex",
            "Summary": "Navin Fluorine has revised its EBITDA margin expectations for FY26 to 28-30%, surpassing its initial guidance of 25%. The company has outlined a capital expenditure framework of approximately ₹1,000 crore for the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1761880934216,
            "Source": "stock"
        },
        {
            "Title": "Navin Fluorine Projects 42% Sales Growth and 118% EBITDA Jump for FY26",
            "Summary": "Navin Fluorine has projected 42% sales growth for FY26 alongside a 118% increase in EBITDA. The company plans ₹310 crore in capital expenditure for HFC and MPP debottlenecking activities targeting global innovators. The company expects margins above 30% driven by specialty chemicals, CDMO scale-up operations, and maintains order book visibility extending through FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761835242080,
            "Source": "stock"
        },
        {
            "Title": "Navin Fluorine Announces ₹6.5 Per Share Interim Dividend and ₹3.12 Billion Capital Investment",
            "Summary": "Navin Fluorine International recommended an interim dividend of ₹6.5 per share. The company approved ₹2.37 billion for additional HFC capacity expansion and ₹750 million for plant efficiency improvements at its Dahej facility.",
            "Sentiment": "positive",
            "PublishDate": 1761824854726,
            "Source": "corporate_action"
        },
        {
            "Title": "Navin Fluorine International Reports Strong Q2 Performance with Net Profit Rising to 1.48 Billion Rupees",
            "Summary": "Navin Fluorine International delivered robust Q2 results with consolidated net profit reaching 1.48 billion rupees compared to 588.2 million rupees in the same period last year. Revenue increased to 7.58 billion rupees from 5.18 billion rupees year-over-year. EBITDA grew significantly to 2.46 billion rupees versus 1.07 billion rupees in the previous year. The company's EBITDA margin expanded to 32.46% from 20.7% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1761821825984,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine Schedules Q2 Earnings Review for October 30",
            "Summary": "Navin Fluorine has scheduled to review its Q2 earnings on October 30. The company will be presenting its quarterly financial results on the specified date.",
            "Sentiment": "neutral",
            "PublishDate": 1758620817833,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine International Completes ₹160 Crore cGMP-4 Facility in Dewas",
            "Summary": "Navin Fluorine International has completed construction of its new cGMP-4 facility in Dewas, with an investment of nearly ₹160 crores. The facility is ready for commissioning and the company has started validation batches for a European partner.",
            "Sentiment": "positive",
            "PublishDate": 1756975667018,
            "Source": "stock"
        },
        {
            "Title": "Navin Fluorine Subsidiary Allots ₹200 Crore Preference Shares to Parent Company",
            "Summary": "Navin Fluorine's subsidiary NFASL has allotted ₹200 crore worth of preference shares to its parent company. The funds will be used for debt repayment and reducing consolidated leverage levels.",
            "Sentiment": "positive",
            "PublishDate": 1756207018015,
            "Source": "corporate_action"
        },
        {
            "Title": "Navin Fluorine International Announces Leadership Change in CDMO Business",
            "Summary": "Navin Fluorine International Limited announced leadership changes in its CDMO Business division. Rajendra Sahu resigned as CEO of CDMO Business to pursue career opportunities elsewhere, with his departure effective September 20, 2025. The company appointed Dr. Vijay Kaiwar as CEO Designate of CDMO Business, who will assume full CEO responsibilities on September 21, 2025. Dr. Kaiwar brings nearly 30 years of experience in CDMO and API businesses, with expertise in chemistry and biotechnology. He has held senior leadership positions at Anthem Biosciences, Sun Pharma, Aurobindo Pharma, Jubilant Organosys, and Atul Limited. His experience spans regulatory affairs and various technologies including small and large molecules, peptides, HPAPIs, ADCs, oligonucleotides, fermentation, and probiotics. Dr. Kaiwar holds a Ph.D. in Organic Chemistry from IICT Hyderabad and completed a Post-Doctoral Fellowship at King's College, London.",
            "Sentiment": "neutral",
            "PublishDate": 1756125448926,
            "Source": "corporate_governance"
        },
        {
            "Title": "Navin Fluorine International Acquires 26% Stake in Green Power SPV for ₹6.60 Crores",
            "Summary": "Navin Fluorine International Limited entered into agreements to acquire a 26% stake in Pro-Zeal Green Power Eleven Private Limited, a Special Purpose Vehicle, for up to ₹6.60 crores through equity shares and compulsory convertible debentures. The SPV will supply 6.60 MW of captive hybrid wind and solar power to Navin Fluorine's Surat unit under a 15-year power supply agreement. Pro-Zeal Green Power Eleven was incorporated on May 26, 2025, specifically for setting up the captive wind and solar power generation plant in Gujarat. The remaining 74% stake will be held by Prozeal Green Power Private Limited. The arrangement aims to achieve significant savings on power costs while advancing the company's sustainability objectives. The acquisition is expected to be completed within 11 months and does not involve any related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1754401517001,
            "Source": "stock"
        },
        {
            "Title": "Navin Fluorine Reports Strong Q1 FY26 Results with 39% Revenue Growth and 129% Profit Surge",
            "Summary": "Navin Fluorine International delivered robust quarterly results with revenue rising 39% to INR725 crores and net profit growing 129% to INR117 crores. Operating EBITDA more than doubled to INR207 crores, achieving a margin of 28.5%. The company successfully completed a INR750 crores QIP in July 2025, raising funds at INR4,680 per share. All three business divisions reported strong growth. The R32 project commercialized in March 2025 is running at optimal capacity, while the AHF project targets completion by end of Q2 FY26. The company plans to deliver supplies for 3 new molecules in Q2 FY26 and announced a strategic partnership with Chemours for manufacturing Opteon cooling fluid. Management expanded capex guidance to INR700-1,000 crores following the fund raise and expressed confidence in maintaining margins above 25%. The CDMO division secured strong order visibility with regulatory approvals for label extensions and scale-up orders from EU pharma majors.",
            "Sentiment": "positive",
            "PublishDate": 1754399397560,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine Reports Strong Q1FY26 Results with 39% Revenue Growth and 143% Operating Profit Surge",
            "Summary": "Navin Fluorine International Limited reported quarterly results showing revenue of Rs. 725.4 crores, marking a 39% year-on-year increase. Operating EBITDA reached Rs. 206.8 crores with a margin of 28.5%, up 935 basis points year-on-year. Operating profit before tax grew 143% to Rs. 141.2 crores. All three business verticals showed growth: High Performance Products (HPP) revenues increased 45% to Rs. 407 crores, Specialty Chemicals grew 35% to Rs. 219 crores, and CDMO segment rose 23% to Rs. 99 crores. The company's R32 plant achieved optimum utilization after March 2025 commercialization. HPP segment benefited from higher realizations and volumes with firm pricing for refrigerant gases. The company expects its Rs. 450 crore AHF capacity expansion at Dahej to commission by end of the second quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753877043447,
            "Source": "stock"
        },
        {
            "Title": "Navin Fluorine International Reports Strong Q1 Performance with Profit More Than Doubling",
            "Summary": "Navin Fluorine International reported consolidated net profit of 1.17 billion rupees in Q1, representing a significant increase from 512 million rupees in the same quarter last year. The company's revenue also grew substantially to 7.25 billion rupees compared to 5.24 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753872763365,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine Raises Rs 750 Crore Through QIP",
            "Summary": "Navin Fluorine has successfully secured Rs 750 crore through a Qualified Institutional Placement (QIP) at Rs 4,680 per share. The placement price is 2.46% below the minimum price set for the QIP.",
            "Sentiment": "positive",
            "PublishDate": 1752202036000,
            "Source": "default"
        },
        {
            "Title": "Navin Fluorine International: Launches Rs 750 Crore QIP, Sets Floor Price",
            "Summary": "Navin Fluorine International Ltd. has launched a qualified institutional placement (QIP) to raise up to Rs 750 crore. The floor price is set at Rs 4,798.28 per share, about 2% below the closing price. The company may offer up to 5% discount on the floor price. The board approved this fundraising on June 29, 2024, with shareholder approval on August 1, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1751904443000,
            "Source": "corporate_action"
        },
        {
            "Title": "Navin Fluorine International Ltd: Launches ₹750 Crore QIP at ₹4,798.28 Floor Price",
            "Summary": "Navin Fluorine International Ltd opened a qualified institutions placement (QIP) to raise up to ₹750 crore by issuing equity shares. The floor price is set at ₹4,798.28 per share, with a potential 5% discount. The QIP follows board and shareholder approvals in June and August 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1751900766000,
            "Source": "corporate_action"
        },
        {
            "Title": "Navin Fluorine International Ltd: Third Bullish Call as Avendus Sparks Initiates 'Buy'",
            "Summary": "Avendus Spark initiated coverage on Navin Fluorine with a 'Buy' rating and ₹4,800 price target. The company's transition to a cash flow-driven model is yielding positive results, with expected improvements in asset turnover and Return on Invested Capital. This follows recent positive notes from Jefferies and Morgan Stanley.",
            "Sentiment": "positive",
            "PublishDate": 1750216965000,
            "Source": "normal_news"
        },
        {
            "Title": "Navin Fluorine International Ltd: Analysts Project 17% Upside Amid Capex Monetization",
            "Summary": "Jefferies maintains 'buy' rating on Navin Fluorine with a price target of ₹5,280, citing potential for 35% EPS CAGR over FY25-27. The company is well-positioned to monetize its ₹2,000 crore capex through long-term contracts. New molecule qualification with Bayer expected by Q3 FY26. Stock gains 2.9% to ₹4,645.",
            "Sentiment": "positive",
            "PublishDate": 1750137543000,
            "Source": "normal_news"
        },
        {
            "Title": "Navin Fluorine: Q4 Results Lead to Downgrade and Target Price Cut",
            "Summary": "ICICI Securities downgrades Navin Fluorine to 'Hold' after Q4 FY25 results. Revenue up 16.4% YoY to Rs 7 billion. HPP segment revenue at Rs 3.3 billion, up 9.8% YoY. Domestic HPP revenue increased 30.7% YoY, while exports contracted 5.4% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1747026687000,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine International Reports Q4 Results and Announces Corporate Actions",
            "Summary": "Navin Fluorine International reported Q4 consolidated net profit of 949.8 million rupees, up from 703.7 million rupees year-over-year. Q4 revenue increased to 7 billion rupees from 6.02 billion rupees in the previous year. The company recommended a final dividend of 7 rupees per equity share and plans to raise up to 7.50 billion rupees through equity.",
            "Sentiment": "positive",
            "PublishDate": 1747008738000,
            "Source": "default"
        },
        {
            "Title": "Navin Fluorine Reports Strong Capacity Utilization and Future Plans",
            "Summary": "Navin Fluorine International Limited has announced optimal capacity utilization at its Dahej and Surat facilities, with strong order visibility extending into FY26. The company also plans to introduce two new molecules, with supplies expected to commence in Q1FY26.",
            "Sentiment": "positive",
            "PublishDate": 1746855662000,
            "Source": "default"
        },
        {
            "Title": "Navin Fluorine International: Q4 Profit Surges 35%, Meets Estimates",
            "Summary": "Navin Fluorine's Q4 FY25 consolidated net profit rose 35% to Rs 95 crore, meeting analyst estimates. Revenue increased 16% to Rs 713 crore, driven by strong CDMO segment growth. EBITDA margin improved to 26.7%. The company received new molecule orders for FY26 deliveries and maintains robust projections for its European CDMO agreement.",
            "Sentiment": "positive",
            "PublishDate": 1746799286000,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine International: Board Approves ₹750 Crore Fundraising Plan",
            "Summary": "Navin Fluorine's board has approved raising up to ₹750 crore through various equity or convertible securities. The proposal will be presented to shareholders at the AGM on July 31, 2025. The company reported a 35.7% YoY increase in Q4 net profit to ₹95 crore, with revenue growing 16.45% to ₹701 crore.",
            "Sentiment": "positive",
            "PublishDate": 1746794864000,
            "Source": "corporate_action"
        },
        {
            "Title": "Navin Fluorine International Limited: Q4 Profit Soars 35.7%, Declares ₹7/Share Dividend",
            "Summary": "Navin Fluorine reported a 35.7% increase in Q4 FY25 net profit to ₹95 crore. Revenue grew 16.45% to ₹701 crore, and EBITDA surged 62.2% to ₹178.6 crore. The company announced a final dividend of ₹7 per share for FY 2024-2025. Strong order visibility for FY26 is supported by multi-year contracts and strategic partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1746793388000,
            "Source": "result"
        },
        {
            "Title": "Navin Fluorine Partners with Chemours for AI Data Center Cooling",
            "Summary": "Navin Fluorine International Limited has entered into a partnership with Chemours to manufacture Opteon cooling fluids for the AI-driven data center market. The company has committed to invest $14 million in capital expenditure at its Surat facility for this project.",
            "Sentiment": "positive",
            "PublishDate": 1746585441000,
            "Source": "default"
        },
        {
            "Title": "Nuvama: Navin Fluorine to Continue Exporting Refrigerant Gases to USA",
            "Summary": "According to Nuvama, Navin Fluorine International Limited will continue to export refrigerant gases to the United States. The report highlights that the USA has a higher import dependence on refrigerant gases from China and India, suggesting a favorable market position for Navin Fluorine.",
            "Sentiment": "positive",
            "PublishDate": 1743668923000,
            "Source": "normal_news"
        },
        {
            "Title": "Navin Fluorine International's Surat Plant for HFC (R32) Begins Operations",
            "Summary": "Navin Fluorine International has announced that its Surat plant, dedicated to the manufacture and supply of HFC (R32), has commenced operations. HFC (R32) is a hydrofluorocarbon commonly used as a refrigerant. This development marks a significant milestone for the company's production capabilities in the fluorochemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1741651377000,
            "Source": "corporate_action"
        },
        {
            "Title": "Navin Fluorine International's Surat Plant Begins HFC (R32) Production",
            "Summary": "Navin Fluorine International has announced that its Surat plant, dedicated to the manufacture and supply of HFC (R32), has commenced operations. This marks a significant milestone in the company's production capabilities for hydrofluorocarbons.",
            "Sentiment": "positive",
            "PublishDate": 1741616666000,
            "Source": "corporate_action"
        },
        {
            "Title": "Navin Fluorine Reports Strong Export Growth",
            "Summary": "Navin Fluorine International Limited has reported significant growth in its export data. The company's exports have increased by 52% month-over-month and 53.6% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1741579613000,
            "Source": "result"
        },
        {
            "Title": "Navin Fluorine International Ltd: Stock Surges 10% on Strong Q3 Results, Analysts Upgrade",
            "Summary": "Navin Fluorine's shares jumped 10% after Q3 results beat estimates. UBS raised its price target to ₹4,850, the highest on Street. Jefferies upgraded to 'Buy' with a ₹4,600 target. The company expects strong CDMO business growth in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1738300237000,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine International Reports Q3 Financial Results",
            "Summary": "Navin Fluorine International has announced its Q3 consolidated financial results. The company reported a net profit of 836 million rupees, showing an increase from 780 million rupees year-over-year and 588.2 million rupees quarter-over-quarter. Revenue for Q3 stood at 6.06 billion rupees, up from 5.02 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738284328000,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine International Limited: Q3 EBITDA Doubles, Margins Expand",
            "Summary": "Navin Fluorine reported strong Q3 FY25 results with EBITDA nearly doubling to ₹147.3 crore. Net profit increased 7.2% YoY to ₹83.6 crore, while revenue grew 21.2% to ₹606 crore. Margins expanded significantly to 24.3% from 15.1% YoY. The company's shares closed 4.54% higher at ₹3,910 on BSE ahead of the earnings announcement.",
            "Sentiment": "positive",
            "PublishDate": 1738234414000,
            "Source": "earnings"
        },
        {
            "Title": "Navin Fluorine Reports No Price Increase for R32 in USA",
            "Summary": "Navin Fluorine has provided an update indicating that there is currently no sign of rising prices for R32 (difluoromethane) in the United States market. This information suggests stability in the pricing of this key fluorochemical product for the company in one of its important markets.",
            "Sentiment": "neutral",
            "PublishDate": 1738216727000,
            "Source": "normal_news"
        },
        {
            "Title": "Gujarat Fluorochem's R32 Capacity Expansion Poses Challenge for Navin Fluorine",
            "Summary": "Gujarat Fluorochemicals is planning a significant capacity addition in R32 (difluoromethane), a key refrigerant. This expansion could potentially lead to an oversupply in the market in the near to mid-term, which is seen as a negative development for Navin Fluorine, a competitor in the fluorochemicals industry.",
            "Sentiment": "negative",
            "PublishDate": 1738216611000,
            "Source": "corporate_action"
        },
        {
            "Title": "Navin Fluorine Reports Significant Decline in Monthly Exports",
            "Summary": "Navin Fluorine has experienced a substantial decrease in its monthly exports. The company's exports have fallen by 40% month-over-month and 49% year-over-year, indicating a significant downturn in its export performance.",
            "Sentiment": "negative",
            "PublishDate": 1736236041000,
            "Source": "result"
        }
    ]
}