{
    "Symbol": "NAVKARURB",
    "ISIN": "INE268H01044",
    "News": [
        {
            "Title": "Navkar Urbanstructure Board Meet on Feb 12, 2026",
            "Summary": "Navkar Urbanstructure Limited has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770300468188,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navkar Urbanstructure Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Navkar Urbanstructure Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board of Directors meeting was held on November 12, 2025, where they considered and approved the unaudited financial results along with the auditor's limited review report. The company reported total income of Rs. 86.42 lakhs for the quarter. The auditors noted that the company received an unsecured loan from Blessings Infra Developers LLP amounting to Rs. 2.25 crores outstanding as of September 30, 2025. The company operates in a single business segment and reported zero complaints received during the quarter ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762983233319,
            "Source": "earnings"
        },
        {
            "Title": "Navkar Urbanstructure Announces Postal Ballot to Increase Authorized Share Capital by Rs 50 Crore",
            "Summary": "Navkar Urbanstructure Limited has issued a postal ballot notice to seek shareholder approval for increasing its authorized share capital from Rs 113 crore to Rs 163 crore, representing an addition of Rs 50 crore through 50 crore new equity shares of Re 1 each. The company will also amend its Memorandum of Association and adopt a new set of MOA as per Companies Act 2013. The e-voting period runs from October 18, 2025 (9:00 AM) to November 17, 2025 (5:00 PM), with results to be declared by November 19, 2025. The cut-off date for voting eligibility is October 10, 2025. Mrs. Rupal Patel has been appointed as scrutinizer for the postal ballot process. The company states the capital increase is intended to meet funding requirements and facilitate future business needs.",
            "Sentiment": "neutral",
            "PublishDate": 1760707038172,
            "Source": "corporate_action"
        },
        {
            "Title": "Navkar Urbanstructure Increases Authorized Share Capital by Rs 50 Crore, Plans Rights Issue Re-evaluation",
            "Summary": "Navkar Urbanstructure Limited's Board of Directors approved an increase in authorized share capital from Rs 113 crore to Rs 163 crore, expanding the total number of shares from 113 crore to 163 crore shares with a face value of Re 1 each. The board will re-evaluate a proposal for fundraising through a rights issue of equity shares. The company approved a draft notice for postal ballot with e-voting scheduled from October 18, 2025 to November 17, 2025, replacing an Extraordinary General Meeting. The board meeting was held on October 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760535685299,
            "Source": "corporate_action"
        },
        {
            "Title": "Navkar Urban Infrastructure Sets Book Closure and Record Date for 33rd AGM and Final Dividend",
            "Summary": "Navkar Urban Infrastructure Limited has announced book closure from September 24, 2025 to September 30, 2025 for its 33rd Annual General Meeting and final dividend determination. The record date is set as September 23, 2025, meaning shareholders whose names appear in the register on this date will be entitled to receive any final dividend that may be sanctioned at the AGM. The 33rd Annual General Meeting will be held on September 30, 2025 at 11:30 a.m. through video conferencing. Remote e-voting will be available from September 27 to September 29, 2025. The final dividend pertains to the financial year 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1757685911206,
            "Source": "corporate_action"
        },
        {
            "Title": "Navkar Urbanstructure Announces Share Sub-Division from Rs. 2 to Rs. 1 Face Value",
            "Summary": "Navkar Urbanstructure Limited has announced a sub-division of its equity shares, reducing the face value from Rs. 2 per share to Rs. 1 per share. The sub-division will be effective from the record date of May 9, 2025. The company has received a new ISIN (INE268H01044) for the sub-divided shares, which has been activated by National Securities Depository Limited. A temporary ISIN (IN8268H01035) has also been assigned pending listing and trading approval. The company is awaiting an activation letter from Central Depository Services (India) Limited to complete the process.",
            "Sentiment": "neutral",
            "PublishDate": 1757132042539,
            "Source": "corporate_action"
        },
        {
            "Title": "Navkar Urbanstructure Reports Quarterly Profit of Rs 27.12 Lakhs",
            "Summary": "Navkar Urbanstructure Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported a net profit of Rs 27.12 lakhs compared to a loss of Rs 264.63 lakhs in the previous quarter and a profit of Rs 205.07 lakhs in the same quarter last year. Total revenue decreased to Rs 171.50 lakhs from Rs 358.86 lakhs in the previous quarter and Rs 398.06 lakhs in the corresponding quarter of the previous year. Revenue from operations was Rs 170.81 lakhs. Total expenses were Rs 144.38 lakhs. The company operates in a single segment and has paid-up equity share capital of Rs 1122.09 lakhs with a face value of Re 1.00 per share.",
            "Sentiment": "positive",
            "PublishDate": 1755076872501,
            "Source": "earnings"
        }
    ]
}