{
    "Symbol": "NAVKARCORP",
    "ISIN": "INE278M01019",
    "News": [
        {
            "Title": "Navkar Corp Shares JSW Infrastructure Feb 2026 Presentation",
            "Summary": "Navkar Corporation Limited shared JSW Infrastructure's February 2026 investor presentation under SEBI Regulation 30, highlighting Q3 FY26 operational performance and growth strategy updates.",
            "Sentiment": "neutral",
            "PublishDate": 1770192873341,
            "Source": "stocks"
        },
        {
            "Title": "Navkar Corporation Resolves GST Dispute for FY20",
            "Summary": "Navkar Corporation receives GST order from Gujarat department for FY 2019-20, with original demand of ₹50.54 lakh mostly dropped after paying ₹8,628 during proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1769163311655,
            "Source": "stocks"
        },
        {
            "Title": "Navkar Corp Makes JSW Infra Call Recording Available",
            "Summary": "Navkar Corporation Limited announces availability of audio recording from JSW Infrastructure Limited's investor conference call held on January 16, 2026, accessible on company website.",
            "Sentiment": "neutral",
            "PublishDate": 1768575613838,
            "Source": "stocks"
        },
        {
            "Title": "Navkar Corp Shares JSW Infrastructure Q3FY26 Results",
            "Summary": "Navkar Corporation Limited disclosed JSW Infrastructure's Q3FY26 results presentation under regulatory compliance, highlighting the ultimate holding company's performance updates.",
            "Sentiment": "neutral",
            "PublishDate": 1768571057089,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Q3 FY26 Results Show Strong Growth",
            "Summary": "JSW Infrastructure reported impressive Q3 FY26 results with operating EBITDA up 50% YoY to ₹640 crore and EBITDA margin expanding to 47.63%, driven by 8% increase in cargo volumes to 31.7 million tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1768568493632,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navkar Corp Q3: Profit surge drives 14% rally",
            "Summary": "Navkar Corporation swung to ₹9.40 crore profit in Q3 from ₹11.40 crore loss last year, with revenue jumping 44% to ₹186.00 crore. EBITDA margins tripled to 18% from 6%, driving shares up 14%.",
            "Sentiment": "positive",
            "PublishDate": 1768297877359,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navkar Corporation Q3FY26 Profit Jumps 936%",
            "Summary": "Navkar Corporation reported strong Q3FY26 results with revenue rising 43.6% to ₹18,584.74 lakhs and net profit surging to ₹936.23 lakhs from previous year loss.",
            "Sentiment": "positive",
            "PublishDate": 1768297174435,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navkar Corporation Q3FY26 Profit Jumps 936%",
            "Summary": "Navkar Corporation reported strong Q3FY26 results with revenue rising 43.5% to ₹18,584.74 lakhs and net profit surging to ₹936.23 lakhs from previous year loss.",
            "Sentiment": "positive",
            "PublishDate": 1768296482590,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navkar Corporation Q3 EBITDA Surges 359% YoY",
            "Summary": "Navkar Corporation reports remarkable Q3 performance with EBITDA jumping to ₹335 million from ₹73 million year-on-year, while EBITDA margin expands significantly to 18.00%.",
            "Sentiment": "positive",
            "PublishDate": 1768296291230,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navkar Corporation Q3 Revenue Jumps 44% to ₹186 Cr",
            "Summary": "Navkar Corporation reported strong Q3 performance with revenue rising 44% year-on-year to ₹186 crores compared to ₹129 crores in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1768296268403,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navkar Corporation Reports Strong Q3 Turnaround",
            "Summary": "Navkar Corporation posted a net profit of ₹94 million in Q3, marking a significant turnaround from the ₹114 million loss recorded in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768296218170,
            "Source": "co_actions_results"
        },
        {
            "Title": "JSW Infrastructure Q3FY26 Results Call on Jan 16",
            "Summary": "JSW Infrastructure Limited has scheduled a conference call on January 16, 2026, at 6:00 PM IST to discuss Q3FY26 financial results. Navkar Corporation Limited informed exchanges about this call by its ultimate holding company.",
            "Sentiment": "neutral",
            "PublishDate": 1767961950103,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navkar Corporation Gets ₹63.22 Cr Railway Approval",
            "Summary": "Navkar Corporation receives Central Railway approval for Gati Shakti Cargo Terminal project worth ₹63.22 crore. Construction to begin within 3 months and complete in 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1766123087994,
            "Source": "stocks"
        },
        {
            "Title": "Navkar Corporation Shares JSW Infrastructure's Investor Presentation Highlighting Growth Strategy and Strong Performance",
            "Summary": "Navkar Corporation Limited informed stock exchanges about the release of an investor presentation by its ultimate holding company JSW Infrastructure Limited, India's second largest private port operator with 177 mtpa capacity. The presentation outlines JSW Infrastructure's growth strategy to increase capacity to 400 mtpa by FY30, strong quarterly results with 28.9 MT cargo handled in Q2FY26, and expansion into logistics targeting ₹8,000 crore revenue by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1764592042278,
            "Source": "stock"
        },
        {
            "Title": "Navkar Corporation Shareholders Approve Material Related Party Transaction with JSW Steel Limited",
            "Summary": "Navkar Corporation Limited shareholders approved a material related party transaction with JSW Steel Limited through postal ballot voting conducted from October 19 to November 17, 2025. The ordinary resolution passed with 99.9925% votes in favor, with 59,702 total shareholders eligible to vote on the cut-off date of October 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763471481354,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Infrastructure Reports 23% Revenue Growth in H1 FY26, Announces Major Port Expansion Plans",
            "Summary": "JSW Infrastructure, India's second-largest private port operator with 177 mtpa capacity, reported total revenue of ₹2,686 crore in H1 FY26, up 23% year-on-year. The company handled 58.2 MT of cargo in H1 FY26, reflecting 4.4% growth. EBITDA increased 14% to ₹1,387 crore, while PAT grew 13% to ₹758 crore. The company maintains a strong balance sheet with net debt of ₹1,810 crore and cash balances of ₹3,088 crore. JSW Infrastructure has outlined ambitious expansion plans to increase capacity to 400 mtpa by FY30 and targets ₹8,000 crore revenue from logistics business. Key project updates include construction progress at Tuticorin (60% pile foundation completed), JNPA liquid terminal operations commencing in November 2025, and new concession agreements for Kolkata Container Terminal. The company signed a 30-year agreement with Kolkata Port Authority for 0.45 million TEUs capacity terminal. NavKar Corporation, part of the group, delivered strong performance with domestic cargo volumes up 46% and EXIM cargo up 20% in Q2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762071362288,
            "Source": "stock"
        },
        {
            "Title": "Navkar Corporation Seeks Shareholder Approval for Rs 725 Crore Related Party Transaction with JSW Steel",
            "Summary": "Navkar Corporation Limited has issued a postal ballot notice seeking shareholder approval for a material related party transaction with JSW Steel Limited. The transaction involves cargo handling, multimodal transportation, stockyard services, rail handling, and reimbursement of expenses. The proposed transaction values are Rs 150 crores for FY 2025-26, Rs 250 crores for FY 2026-27, and Rs 325 crores for FY 2027-28, totaling Rs 725 crores over three years (excluding taxes). JSW Steel became a related party after JSW Port Logistics Private Limited acquired 70.37% equity holding in Navkar Corporation through a share purchase agreement dated June 27, 2024. The e-voting period runs from October 19, 2025, to November 17, 2025. The Audit Committee and Board of Directors have approved the transaction, confirming it is conducted at arm's length basis and in the ordinary course of business. The transaction represents 31% of Navkar's annual turnover and leverages the company's existing infrastructure including stockyards at Panvel and Wadharva, and Private Freight Terminals at Panvel and Morbi.",
            "Sentiment": "neutral",
            "PublishDate": 1760791246610,
            "Source": "corporate_action"
        },
        {
            "Title": "JSW Infrastructure Reports 26% Revenue Growth in Q2 FY26, Cargo Handling Up 3% YoY",
            "Summary": "JSW Infrastructure announced its quarterly results through subsidiary Navkar Corporation Limited. The company handled 28.9 million tonnes of cargo in Q2 FY26, reflecting 3% year-over-year growth, and 58.2 million tonnes in H1 FY26, up 4% YoY. Total revenue reached ₹1,372 crore in Q2 FY26, up 26% YoY, while EBITDA grew 18% to ₹716 crore. For H1 FY26, total revenue was ₹2,686 crore (up 23% YoY) with EBITDA of ₹1,387 crore (up 14% YoY). PAT for Q2 declined 1% to ₹369 crore, while H1 PAT increased 13% to ₹758 crore. The company maintains a strong balance sheet with net debt of ₹1,810 crore and cash reserves of ₹3,088 crore. Navkar Corp showed strong performance with domestic cargo volumes up 46% in Q2 and EXIM cargo volumes up 20%. The company signed a 30-year concession agreement for Kolkata Container Terminal with 6.3 MTPA capacity and completed public hearings for Greenfield ports at Keni and Murbe. JSW Infrastructure received investment grade ratings from S&P Global and Fitch, along with several industry awards for sustainability and brand excellence.",
            "Sentiment": "positive",
            "PublishDate": 1760614578394,
            "Source": "earnings"
        },
        {
            "Title": "Navkar Corp Reports Strong Q2 Performance with Revenue Growth and Return to Profitability",
            "Summary": "Navkar Corp delivered improved financial results in Q2. Revenue increased to 1.6 billion rupees from 1.3 billion rupees year-over-year. EBITDA rose to 244 million rupees compared to 176 million rupees in the same period last year, with EBITDA margin expanding to 15.02% from 12.9%. The company returned to profitability with a net profit of 44 million rupees, reversing from a loss of 23 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760433916495,
            "Source": "earnings"
        },
        {
            "Title": "JSW Infrastructure Releases Investor Presentation Showing 177 MTPA Capacity and Growth Plans",
            "Summary": "Navkar Corporation Limited announced that its ultimate holding company JSW Infrastructure Limited has released a new investor presentation. JSW Infrastructure operates as India's second largest private port operator with 177 mtpa operational capacity across strategically located ports and terminals on India's west and east coasts. The company reported quarterly results showing total cargo handled of 29.4 MT (5% growth), with third-party customer share increasing to 52% from 50%. Operating revenue reached ₹1,224 crore (21% growth) and operating EBITDA was ₹581 crore (13% growth). The company plans to increase capacity to approximately 400 mtpa by FY30 through brownfield expansions, greenfield developments, and strategic acquisitions. Key ongoing projects include terminals at Tuticorin, JNPA liquid terminal, expansions at Dharamtar and Jaigarh ports, and new greenfield ports at Keni and Jatadhar. The logistics business through Navkar targets ₹8,000 crore revenue by FY30. JSW Infrastructure maintains strong financial metrics with net debt of ₹1,246 crore and cash balance of ₹4,360 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754490226090,
            "Source": "stock"
        },
        {
            "Title": "Navkar Corporation's Warehousing Operations Restored After Customs Penalty Payment",
            "Summary": "The Commissioner of Customs has revoked the suspension of warehousing operations at Navkar Corporation Limited's Open Bonded Area located in Ajivali Village, Raigad District. The company has been imposed a penalty of Rs. 1,50,000 under section 117 of the Customs Act, 1962. The order was dated August 01, 2025, and received by the company on August 04, 2025. With the revocation of suspension, the operational activities of the Open Bonded area will resume. This follows the company's earlier communication regarding the suspension in January 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754379218813,
            "Source": "stock"
        },
        {
            "Title": "JSW Infrastructure Reports 21% Revenue Growth in Q1 FY2026, Cargo Handling Up 5%",
            "Summary": "JSW Infrastructure announced quarterly results showing operating revenue of ₹1,224 crore, up 21% year-on-year, with total revenue reaching ₹1,314 crore (19% growth). The company handled 29.4 million tonnes of cargo, representing 5% growth, with third-party customer share increasing to 52% from 50% in the previous year. Operating EBITDA grew 13% to ₹581 crore, while profit after tax surged 31% to ₹390 crore. The company maintains a strong balance sheet with cash and bank balance of ₹4,360 crore and net debt of ₹1,246 crore. JSW Infrastructure received a Letter of Award from Syama Prasad Mookerjee Port Authority for container berth redevelopment at Kolkata and signed a binding MoU with Konkan Railway Corporation for railway siding development. The company also received recognition including Leadership Grade (A-) in CDP's 2024 Supplier Engagement Assessment and sustainability awards for its ports.",
            "Sentiment": "positive",
            "PublishDate": 1753191334989,
            "Source": "earnings"
        },
        {
            "Title": "Navkar Corporation: Q1 Profit Turnaround Drives 10% Stock Surge",
            "Summary": "Navkar Corporation reported a net profit of ₹2 crore in Q1 FY26, compared to a ₹13.1 crore loss in Q1 FY25. Revenue grew 17% YoY to ₹138 crore. EBITDA rose to ₹20 crore from ₹2 crore, with margin improving to 14.5% from 1.7%. The stock surged 10% following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1752744708000,
            "Source": "earnings"
        },
        {
            "Title": "Navkar Corp Reports Improved Q1 Financial Results",
            "Summary": "Navkar Corp has announced its Q1 financial results, showing significant improvements across key metrics. The company's EBITDA increased to 201 million rupees from 20 million rupees year-over-year, with the EBITDA margin rising to 14.58% from 1.75%. Revenue grew to 1.38 billion rupees from 1.18 billion rupees in the same period last year. Notably, the company reported a net profit of 24 million rupees, compared to a loss of 131 million rupees in the previous year's Q1.",
            "Sentiment": "positive",
            "PublishDate": 1752743104000,
            "Source": "result"
        },
        {
            "Title": "Navkar Corp Reports Q4 Net Loss of 185.3 Million Rupees",
            "Summary": "Navkar Corp has reported a net loss of 185.3 million rupees in Q4, compared to a profit of 73 million rupees in the same quarter last year. This represents a significant downturn in financial performance. The company's revenue also decreased to 1.04 billion rupees from 1.2 billion rupees year-over-year. Sequentially, the loss has widened from 114 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1745799404000,
            "Source": "default"
        },
        {
            "Title": "Navkar Corp Reports Q4 Financial Results",
            "Summary": "Navkar Corp has reported its Q4 financial results, showing a significant decline in performance. The company posted an EBITDA loss of 186 million rupees, compared to a profit of 193 million rupees in the same quarter last year. Revenue decreased to 1.04 billion rupees from 1.2 billion rupees year-over-year. The company reported a net loss of 185.3 million rupees, compared to a profit of 73 million rupees in the previous year and a loss of 114 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1745601017000,
            "Source": "result"
        },
        {
            "Title": "Navkar Corporation: Q3 FY25 Loss Narrows, Revenue Grows",
            "Summary": "Navkar Corporation reported Q3 FY25 results with revenue up 10.81% YoY to ₹129.47 crore. Loss reduced by 22.97% YoY to ₹11.4 crore. Operating income fell 542.62% YoY. EPS declined to ₹-0.76.",
            "Sentiment": "neutral",
            "PublishDate": 1738045132000,
            "Source": "earnings"
        },
        {
            "Title": "Navkar Corporation Reports Q3 Revenue Growth",
            "Summary": "Navkar Corporation has reported a revenue of 1.29 billion rupees for the third quarter, compared to 1.16 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737964670000,
            "Source": "earnings"
        },
        {
            "Title": "Navkar Corporation Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Navkar Corporation's third-quarter EBITDA decreased to 73 million rupees from 123 million rupees in the same period last year. The company's EBITDA margin also fell to 5.65% from 10.56% year-over-year, indicating a significant reduction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1737964645000,
            "Source": "earnings"
        },
        {
            "Title": "Navkar Corporation Reports Reduced Q3 Net Loss",
            "Summary": "Navkar Corporation has reported a net loss of 114 million rupees for the third quarter, showing an improvement from the 148 million rupee loss in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1737964617000,
            "Source": "earnings"
        },
        {
            "Title": "Navkar Corporation to Consider Q3 Results",
            "Summary": "Navkar Corporation has announced that it will consider its third quarter (Q3) financial results on January 27.",
            "Sentiment": "neutral",
            "PublishDate": 1737116257000,
            "Source": "result"
        },
        {
            "Title": "Navkar Corporation Receives Suspension Letters for Two Open Bonded Warehouses",
            "Summary": "Navkar Corporation has announced that it has received suspension letters for two of its open bonded warehouses. This development could potentially impact the company's operations and storage capabilities.",
            "Sentiment": "negative",
            "PublishDate": 1736295260000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Navkar Corporation Receives Suspension Letters for Two Open Bonded Warehouses",
            "Summary": "Navkar Corporation has announced the receipt of suspension letters for two of its open bonded warehouses. This development could potentially impact the company's operations and storage capabilities.",
            "Sentiment": "negative",
            "PublishDate": 1736260957000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Navkar Corporation: Q2 Revenue Surges 43% YoY, Stock Fluctuates",
            "Summary": "<p>Navkar Corporation reported a <span class='positive'>42.6% YoY increase</span> in Q2FY25 consolidated revenue to Rs 136.01 crore. Net profit <span class='neutral'>slightly increased</span> to Rs 2.2 crore. Total expenses <span class='negative'>rose 48.8%</span> to Rs 13674 crore. The stock <b>initially surged 4.68%</b> but later <span class='negative'>traded down 1.78%</span> at Rs 89.20.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728370541000,
            "Source": "result"
        },
        {
            "Title": "Navkar Corp Reports Q2 Loss of 23M Rupees",
            "Summary": "<p>Navkar Corp announced its <span class='neutral'>Q2 financial results</span>, reporting a <span class='negative'>net loss</span> of <b>23 million rupees</b> compared to a <span class='positive'>profit</span> of <b>21 million rupees</b> in the same quarter last year. <br/> The company's <span class='positive'>revenue increased</span> to <b>1.33 billion rupees</b> from <b>946 million rupees</b> year-over-year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728364404000,
            "Source": "result"
        }
    ]
}