{
    "Symbol": "NAVNETEDUL",
    "ISIN": "INE060A01024",
    "News": [
        {
            "Title": "Navneet Education Q3 Net Profit Surges to ₹1.7B",
            "Summary": "Navneet Education reports remarkable Q3 consolidated net profit growth to ₹1.7 billion from ₹143 million year-over-year, despite revenue declining to ₹2.5 billion from ₹2.8 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769776299432,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navneet Education Gets Credit Rating Reaffirmed",
            "Summary": "CARE Ratings reaffirmed Navneet Education's credit ratings at CARE AA; Stable/CARE A1+ for Rs. 450.00 crore bank facilities and CARE A1+ for Rs. 2.00 crore short-term facilities on January 28, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769606422816,
            "Source": "stocks"
        },
        {
            "Title": "Navneet Education Q3FY26 Earnings Call on Feb 2",
            "Summary": "Navneet Education Limited has scheduled its Q3FY26 earnings conference call for February 2, 2026, at 3:00 PM IST to discuss operational and financial performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1768991040572,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navneet Education Incorporates UAE Subsidiary",
            "Summary": "Navneet Education Limited has successfully incorporated its wholly owned subsidiary 'Navneet Global FZE' in UAE's Fujairah Free Zone, expanding its international presence with regulatory approval.",
            "Sentiment": "positive",
            "PublishDate": 1768826588095,
            "Source": "stocks"
        },
        {
            "Title": "Navneet Education Announces Composite Scheme",
            "Summary": "Navneet Education Limited proposes demerger of Indiannica Learning's publishing business and capital reduction under Companies Act 2013, with appointed date of April 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768284781692,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navneet Education Board Meet on Jan 30 for Q3FY26 Results",
            "Summary": "Navneet Education Limited has scheduled its board meeting for January 30, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1767941269023,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navneet Education Board Approves Demerger Scheme",
            "Summary": "Navneet Education's board approves composite scheme for demerger of publishing business from subsidiary ILPL, with ₹54.31 crore turnover representing 99.68% of ILPL's total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1767860885155,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navneet Education Plans UAE Subsidiary Expansion",
            "Summary": "Navneet Education seeks approval to establish a wholly owned subsidiary named 'Navneet Global FZE' in the United Arab Emirates as part of its international expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1765892957757,
            "Source": "stocks"
        },
        {
            "Title": "Navneet Education applies for UAE subsidiary incorporation",
            "Summary": "Navneet Education Limited has applied to Fujairah Free Zone Authority to incorporate a wholly owned subsidiary, Navneet Global FZE, in the UAE for manufacturing and trading stationery products.",
            "Sentiment": "positive",
            "PublishDate": 1765888633622,
            "Source": "co_actions_results"
        },
        {
            "Title": "Navneet Education Q2FY26 Results: Revenue Drops 9% to INR 246 Crores Amid Export Challenges",
            "Summary": "Navneet Education reported Q2FY26 revenue of INR 246 crores versus INR 271 crores last year, with publications segment growing 12% to INR 91 crores while export stationery declined 22% due to U.S. tariffs. EBITDA margin compressed to 4.9% from 7.5% in Q2FY25, though management expects improvement once trade conditions normalize and anticipates favorable tariff decisions by December end.",
            "Sentiment": "neutral",
            "PublishDate": 1763458012987,
            "Source": "earnings"
        },
        {
            "Title": "Navneet Education Guides for FY27 Turnaround with 12% Publication Growth",
            "Summary": "Navneet Education projects a turnaround in FY27, reporting 12% year-over-year growth in publications driven by early curriculum changes. The company anticipates a multi-year upswing as higher grade revisions commence. To counter U.S. tariff impact on exports, the company is developing new product lines. Domestic stationery volumes remain stable with margin recovery expected as paper prices stabilize. The company is also expanding its digital learning ecosystem content.",
            "Sentiment": "positive",
            "PublishDate": 1762788110361,
            "Source": "stock"
        },
        {
            "Title": "Navneet Education Declares ₹1.50 Interim Dividend Despite Widening Losses",
            "Summary": "Navneet Education announced an interim dividend of ₹1.50 per share. The company's quarterly results showed revenue of ₹2.5 billion compared to ₹2.7 billion in the same period last year. EBITDA declined to ₹10 million from ₹20 million year-on-year, with EBITDA margin falling to 0.40% from 0.74%. The consolidated net loss widened to ₹150 million from ₹50 million in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762780622854,
            "Source": "corporate_action"
        },
        {
            "Title": "Navneet Education Limited Establishes New Manufacturing Unit for Plastic Products in Gujarat",
            "Summary": "Navneet Education Limited has established a new manufacturing facility in Village Paria, Taluka Pardi, District Valsad, Gujarat. The unit will manufacture plastic moulding items, extrusion films and rolls, and blown films and rolls. The company has obtained the necessary factory license for production at this facility.",
            "Sentiment": "positive",
            "PublishDate": 1760437971972,
            "Source": "stock"
        },
        {
            "Title": "Navneet Education Sets Record Date for Rs. 1.50 Final Dividend Payment",
            "Summary": "Navneet Education Limited has set Monday, September 22, 2025, as the record date for payment of a final dividend of Rs. 1.50 (75%) per share. The dividend payment is subject to shareholder approval at the Annual General Meeting scheduled for Monday, September 29, 2025. If approved, the dividend will be paid to shareholders whose names are registered as on the record date, with payment to be completed by October 28, 2025. The dividend recommendation was made during a Board Meeting held on May 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756976659390,
            "Source": "corporate_action"
        },
        {
            "Title": "Navneet Education Reports Flat Q1 FY26 Revenue, Faces Export Challenges from US Tariff Uncertainty",
            "Summary": "Navneet Education Limited reported stable revenue for Q1 FY26, matching Q1 FY25 levels. The publication business remained flat due to minimal curriculum changes, with only Grade 1 changes in Maharashtra and a few subjects in Gujarat. Maharashtra Grade 1 textbooks arrived late, with revenue expected in Q2. The domestic stationery business declined 14% due to paper price reductions causing 9% lower realizations and 5% volume drop from unorganized sector competition. Export business grew 7% despite challenges, with 75% of exports going to the US. The company faces uncertainty from potential US tariffs, though no order cancellations have occurred. Management expects 15% growth in publication business next year with more than two grades changing in both Maharashtra and Gujarat. Digital activities have been consolidated into the standalone entity, impacting margins. The company is expanding non-paper stationery products and expects margins to improve by 2% in the publication segment.",
            "Sentiment": "neutral",
            "PublishDate": 1754981333730,
            "Source": "earnings"
        },
        {
            "Title": "Navneet Education Limited Makes Q1 FY26 Earnings Call Recording Available",
            "Summary": "Navneet Education Limited has made the audio recording of its Q1 FY26 earnings call available on its company website. The earnings call was held on August 8, 2025, to discuss the company's operational and financial performance. The recording can be accessed through the company's submissions page at https://navneet.com/submissions-under-regulation-30/. The company filed this notification with BSE and NSE exchanges under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1754720383643,
            "Source": "earnings"
        },
        {
            "Title": "Navneet Education Positions for Growth with Tech-Enhanced Content and Export Expansion",
            "Summary": "Navneet Education is preparing for growth in the curriculum-based publishing cycle. The company is focusing on tech-enhanced content development, export market expansion, and upgraded premium stationery products. This strategic positioning comes as paper price fluctuations are decreasing, potentially improving operational conditions for the education and stationery company.",
            "Sentiment": "positive",
            "PublishDate": 1754579114959,
            "Source": "stock"
        },
        {
            "Title": "Navneet Education Reports Quarterly Results for Quarter Ended June 30, 2025",
            "Summary": "Navneet Education Limited's Board approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company operates in two main segments: publishing content (including traditional books, digital products and related software) and stationery products, with other business including power generation by windmill and strategic investments in education. The results were reviewed by the audit committee and approved at a board meeting held on August 7, 2025. The statutory auditor expressed an unqualified opinion on both standalone and consolidated financial results. During the quarter, the company incorporated a wholly owned subsidiary 'Brick N Click Inc.' in the U.S.A on May 20, 2025. The company noted that due to the seasonal nature of its business, quarterly results are not representative of full-year operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754561827776,
            "Source": "earnings"
        },
        {
            "Title": "Navneet Education Reports Mixed Q1 Results with Revenue Decline but Strong Profit Growth",
            "Summary": "Navneet Education reported Q1 consolidated net profit of 1.6 billion rupees compared to 480 million rupees year-over-year, representing significant growth. However, revenue declined to 7.9 billion rupees from 8 billion rupees in the same period last year. Net profit before exceptional items remained relatively stable at 2.12 billion rupees versus 2.1 billion rupees year-over-year. EBITDA increased to 2.3 billion rupees from 760 million rupees, with EBITDA margin improving substantially to 28.59% from 17.51% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754559915870,
            "Source": "earnings"
        },
        {
            "Title": "Navneet Education Announces Q4 Results and Dividend",
            "Summary": "Navneet Education has declared a dividend of 1.5 rupees per share. The company reported Q4 revenue of 3.88 billion rupees, compared to 3.85 billion rupees in the same quarter last year. Navneet Education's Q4 net profit stood at 292 million rupees, a significant improvement from a loss of 175.7 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747646143000,
            "Source": "result"
        },
        {
            "Title": "Navneet Education to Establish E-commerce Subsidiary",
            "Summary": "Navneet Education has announced plans to incorporate a new subsidiary named 'Northstar Ventures'. This new unit will focus on e-commerce and trading operations, potentially expanding the company's digital presence and business capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1747300031000,
            "Source": "default"
        },
        {
            "Title": "Navneet Education Reports Q3 Loss, Includes Exceptional Item",
            "Summary": "Navneet Education has reported a loss before tax of 4.7 million rupees for the third quarter, compared to a loss of 129 million rupees in the same period last year. The company also disclosed an exceptional item of 255 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738747113000,
            "Source": "earnings"
        },
        {
            "Title": "Navneet Education Reports Significant Increase in Q3 EBITDA",
            "Summary": "Navneet Education has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 168 million rupees, compared to 40.3 million rupees in the same period last year. Additionally, the EBITDA margin expanded to 5.94% from 1.56% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738746884000,
            "Source": "earnings"
        },
        {
            "Title": "Navneet Education Reports Profit in Q3 FY24",
            "Summary": "Navneet Education has reported a consolidated net profit of 143 million rupees in the third quarter, compared to a loss of 48 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738746665000,
            "Source": "earnings"
        },
        {
            "Title": "Navneet Education: Share Price Surges on Budget's Regional Language Textbook Initiative",
            "Summary": "Navneet Education's share price increased by over 5% following Finance Minister Nirmala Sitharaman's announcement of regional language textbooks in the Union Budget 2025-26. The stock reached an intraday high of ₹147.80 per share on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1738392693000,
            "Source": "normal_news"
        },
        {
            "Title": "Navneet Education Sets Growth Targets for FY25",
            "Summary": "Navneet Education has announced its growth targets for the fiscal year 2025. The company aims to achieve a volume growth of 12-15% in domestic revenue. For its overall stationery business, Navneet is confident of reaching EBIT (Earnings Before Interest and Taxes) margins of 12-14% in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1731035899000,
            "Source": "corporate_action"
        },
        {
            "Title": "Navneet Education Reports Q2 EBITDA Improvement",
            "Summary": "Navneet Education's Q2 consolidated EBITDA improved to a gain of 25.5 million rupees, compared to a loss of 43 million rupees in the same quarter last year. The company's Q2 EBITDA margin was 1.15%.",
            "Sentiment": "positive",
            "PublishDate": 1730967834000,
            "Source": "result"
        }
    ]
}