{
    "Symbol": "NAZARA",
    "ISIN": "INE418L01047",
    "News": [
        {
            "Title": "Nazara Technologies faces INR 2.84 Cr GST demand",
            "Summary": "Nazara Technologies' GST appeal rejected by appellate authority, upholding tax demand of INR 2.84 crores and equal penalty for export proceeds non-receipt in FY18-19.",
            "Sentiment": "negative",
            "PublishDate": 1770376962198,
            "Source": "stocks"
        },
        {
            "Title": "Nazara Q3FY26: EBITDA Margin Jumps to 16.7%",
            "Summary": "Nazara Technologies reports Q3FY26 revenue of INR 406 crores with EBITDA of INR 67.8 crores, marking 29.4% YoY growth and margin expansion to 16.7%. Gaming segment shows strong performance with 25% EBITDA margin.",
            "Sentiment": "positive",
            "PublishDate": 1770142600547,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nazara Technologies Completes Rusk Media Acquisition",
            "Summary": "Nazara Technologies has completed the acquisition of Series A CCPS in Rusk Media Private Limited for INR 27.15 crore, increasing its stake to 7.18% in the company.",
            "Sentiment": "positive",
            "PublishDate": 1769795799285,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nazara Technologies Board Meet on Feb 3 for Q3FY26",
            "Summary": "Nazara Technologies has scheduled its board meeting for February 3, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769672485799,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nazara Q3 PAT Expected to Jump 86.2% YoY to ₹48.1 Cr",
            "Summary": "ICICI Securities forecasts Nazara Technologies' Q3 net profit to surge 86.2% YoY to ₹48.1 crores, while revenue may decline 23.3% to ₹410 crores. EBITDA expected to grow 23.3% YoY to ₹64.5 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769150042775,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nazara Technologies Extends Rusk Media Acquisition Timeline",
            "Summary": "Nazara Technologies announces extension of acquisition timeline for 5.23% stake in Rusk Media Private Limited through Series A CCPS purchase, with new deadline set for February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768392203180,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nazara Technologies Increases Stake in Nextwave to 87.44%",
            "Summary": "Nazara Technologies acquired additional 4.19% equity stake in subsidiary Next Wave Multimedia for ₹2.50 crores, increasing total holding from 83.25% to 87.44% as per share purchase agreement.",
            "Sentiment": "positive",
            "PublishDate": 1767118103435,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nazara Technologies Eyes Growth with AI Push & Global IPs",
            "Summary": "Nazara Technologies completes portfolio reset and targets 27.9% revenue CAGR through FY28, driven by AI-enabled gaming experiences and global IP acquisitions with improved EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1767102113290,
            "Source": "stocks"
        },
        {
            "Title": "SBI MF sells 1% Nazara stake for ₹108 crore on Monday",
            "Summary": "India's largest fund house SBI Mutual Fund sold 45 lakh shares of Nazara Technologies at ₹240.18 per share. The gaming stock surged 6% despite the institutional selling pressure.",
            "Sentiment": "neutral",
            "PublishDate": 1767025634399,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nazara Tech Outlines Ambitious Expansion Plans Across Gaming Portfolio",
            "Summary": "Nazara Tech plans to expand Funky Monkeys locations from 14-15 to 100 over the next few years, while subsidiary Nodwin targets becoming a billion-dollar company in 5-7 years. The gaming company aims for 20-25% annual growth with EBITDA margins of 20-25% and expects positive subscriber growth for Kiddopia by Q4.",
            "Sentiment": "positive",
            "PublishDate": 1763092643588,
            "Source": "stock"
        },
        {
            "Title": "Nazara Tech Reports Strong Q2 Performance with Net Profit Surge to 8.85B Rupees",
            "Summary": "Nazara Tech delivered robust quarterly results with consolidated net profit jumping to 8.85 billion rupees from 535 million in the previous quarter. Revenue grew to 5.26 billion rupees compared to 4.99 billion quarter-on-quarter. EBITDA increased to 598 million rupees from 474.4 million, while EBITDA margin improved to 11.36% from 9.51%. Other income saw a significant rise to 11.04 billion rupees versus 771 million in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762957078012,
            "Source": "earnings"
        },
        {
            "Title": "Nazara Technologies Launches New Brand Identity with 'Enter. Magic.' Tagline",
            "Summary": "Nazara Technologies has unveiled a new brand identity featuring the tagline 'Enter. Magic.' The rebranding reflects the company's 25-year journey in the gaming industry and represents its global gaming vision moving forward.",
            "Sentiment": "positive",
            "PublishDate": 1762351408422,
            "Source": "stock"
        },
        {
            "Title": "Nazara Technologies' Fusebox Games Partners with All3Media International for The Traitors Interactive Game Launch",
            "Summary": "Nazara Technologies announced that its subsidiary Fusebox Games has partnered with All3Media International to launch The Traitors: Interactive Game in 2026. The game will be available on iOS and Android platforms. Through this partnership, Fusebox Games has acquired worldwide interactive rights to The Traitors format.",
            "Sentiment": "positive",
            "PublishDate": 1759906335578,
            "Source": "stock"
        }
    ]
}