{
    "Symbol": "NBCC",
    "ISIN": "INE095N01031",
    "News": [
        {
            "Title": "NBCC Schedules Q3FY26 Results Call on Feb 16",
            "Summary": "NBCC (India) Limited has scheduled an earnings conference call for February 16, 2026, at 11:00 AM to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770827027800,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Wins Orders Worth Rs. 39.5 Cr from Multiple Clients",
            "Summary": "NBCC (India) Limited secures three new work orders totaling Rs. 39.5 crores, including PMC services for Ordnance Factory Chandigarh and Power Grid Corporation projects in ordinary course of business.",
            "Sentiment": "positive",
            "PublishDate": 1770361049910,
            "Source": "co_actions_results"
        },
        {
            "Title": "SC Upholds NCLAT Decision on NBCC Managing Supertech Projects",
            "Summary": "Supreme Court affirms NCLAT ruling allowing NBCC to manage 16 Supertech projects, providing clarity on the construction company's role in the troubled real estate developer's portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1770276832676,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Receives CGST Tax Demand Orders Worth ₹94.51 Crore",
            "Summary": "NBCC (India) Limited disclosed receiving CGST tax demand orders totaling ₹94.51 crore including penalty and interest for overseas projects and FY 2021-22 operations. Company plans to file appeals.",
            "Sentiment": "negative",
            "PublishDate": 1770211132366,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Secures ₹271.32 Crore Work Orders",
            "Summary": "NBCC (India) Ltd has secured new work orders worth ₹271.32 crores for regular business operations, including projects for ICMAI and Uttarakhand Fisheries Department.",
            "Sentiment": "positive",
            "PublishDate": 1770114619517,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Signs Deal with Kendriya Vidyalaya Sangathan",
            "Summary": "NBCC has entered into an agreement with Kendriya Vidyalaya Sangathan for construction and renovation projects across India, with project values to be determined individually.",
            "Sentiment": "positive",
            "PublishDate": 1770112303648,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Dubai Subsidiary Changes Business Focus",
            "Summary": "NBCC (India) Limited's Dubai subsidiary NBCC Overseas Real Estate LLC has changed its business object from buying and selling real estate to real estate development, receiving new commercial license on January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769609764529,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Wins ₹62.62 Crore Orders from NHPC & Odisha Govt",
            "Summary": "NBCC secured work orders worth ₹62.62 crore for construction projects with NHPC and renovation projects for Odisha government universities, strengthening its order book.",
            "Sentiment": "positive",
            "PublishDate": 1769508648210,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Receives CGST Tax Demand Orders Worth ₹94.51 Cr",
            "Summary": "NBCC (India) Limited disclosed receiving CGST tax demand orders totaling ₹94.51 crores including penalties and interest from tax authorities. The company plans to file appeals and expects no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1768887497036,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Wins ₹55 Cr IOB Regional Office Project",
            "Summary": "NBCC (India) Limited secures construction contract worth ₹55.02 crores from Indian Overseas Bank for planning, designing and execution of new regional office in Raipur.",
            "Sentiment": "positive",
            "PublishDate": 1768386701424,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC arm HSCC partners with BEL for healthcare sector",
            "Summary": "NBCC's subsidiary HSCC signs strategic MoU with Bharat Electronics for healthcare manufacturing and services collaboration, while NBCC secures ₹134.05 crore in new work orders from Odisha projects.",
            "Sentiment": "positive",
            "PublishDate": 1768215049491,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Subsidiary HSCC Signs Strategic MoU with BEL",
            "Summary": "HSCC (India) Limited, wholly owned subsidiary of NBCC, enters strategic collaboration with Bharat Electronics Limited for healthcare manufacturing and service ecosystem development.",
            "Sentiment": "positive",
            "PublishDate": 1768212614421,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC's HSCC Signs MoU with Bharat Electronics",
            "Summary": "HSCC (India), a subsidiary of NBCC, has entered into a strategic collaboration agreement with Bharat Electronics Limited for healthcare manufacturing, covering medical devices, IT solutions, and consultancy services.",
            "Sentiment": "positive",
            "PublishDate": 1768212060000,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Establishes Dubai Branch Office for Project Services",
            "Summary": "NBCC (India) Limited has established a branch office in Dubai Mainland to carry out project management services, expanding its international operations in the UAE market.",
            "Sentiment": "positive",
            "PublishDate": 1767963598357,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Secures ₹134.05 Cr Odisha Education Contracts",
            "Summary": "NBCC (India) Ltd wins two major education infrastructure contracts in Odisha worth ₹134.05 crore, including university construction and school development projects under government schemes.",
            "Sentiment": "positive",
            "PublishDate": 1767666923826,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Wins ₹134.05 Cr Orders in Odisha",
            "Summary": "NBCC (India) Limited secured two major work orders worth ₹134.05 crores in Odisha, including university construction and school development projects under government schemes.",
            "Sentiment": "positive",
            "PublishDate": 1767620205626,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Wins ₹220.31-Cr Orders; Q2 Net Profit Jumps 26%",
            "Summary": "Navratna PSU NBCC secured three domestic orders worth ₹220.31 crores from Canara Bank and Navodaya Vidyalaya Samiti, while Q2 consolidated net profit grew 26% to ₹153.50 crores with revenue rising 19% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1767182253175,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Auctions 417 Amrapali Flats for ₹1,045 Crore",
            "Summary": "State-owned NBCC successfully sold 417 residential units in Noida and Greater Noida through e-auction, generating ₹1,045.40 crore as part of Amrapali stalled projects completion initiative.",
            "Sentiment": "positive",
            "PublishDate": 1767108268970,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Completes E-Auction of 417 Homes Worth ₹1,045.40 Cr",
            "Summary": "NBCC successfully concludes e-auction for 417 residential units across Aspire Leisure Valley and Aspire Silicon City projects, generating total sales of ₹1,045.40 crores with 1% marketing fee.",
            "Sentiment": "positive",
            "PublishDate": 1767073881511,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Shares Surge 9% on Land Settlement & New Projects",
            "Summary": "NBCC shares gained 9% in two sessions after settling Delhi land dispute and securing Mumbai Port projects. Stock hit Rs 126 with strong technical breakout and expanded volumes.",
            "Sentiment": "positive",
            "PublishDate": 1766969492364,
            "Source": "stocks"
        },
        {
            "Title": "NBCC and Dalmia Bharat show bullish breakout signals",
            "Summary": "Technical analysts recommend buying NBCC at ₹122 with 11% upside potential and Dalmia Bharat at ₹2,160 with 7% gains expected, citing strong breakout patterns and positive momentum indicators.",
            "Sentiment": "positive",
            "PublishDate": 1766900590943,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Settles Delhi Land Dispute, Gets 21-Acre Plot",
            "Summary": "NBCC settles Delhi land dispute, gets 21.23 acres in Ghitorni for Rs 220 crore payment. Company plans mixed-use project with estimated revenue of Rs 8,500 crore and 4.45 lakh sq metre built-up area.",
            "Sentiment": "positive",
            "PublishDate": 1766757144009,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Expands to Dubai with ₹37 Crore Land Purchase",
            "Summary": "State-owned NBCC (India) Ltd acquires 14,777 sq ft prime land in Dubai for AED 15 million through its wholly-owned subsidiary NBCC Overseas Real Estate LLC to develop mixed-use project.",
            "Sentiment": "positive",
            "PublishDate": 1766590105271,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Signs MoU with Mumbai Port Authority for CGO Complex",
            "Summary": "NBCC (India) Limited signed a Memorandum of Understanding with Mumbai Port Authority on December 23, 2025, for developing CGO Complex on 25 acres at Mumbai Port's land on turnkey basis with 7% agency charge.",
            "Sentiment": "positive",
            "PublishDate": 1766574470065,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Acquires Dubai Land for AED 15 Million",
            "Summary": "NBCC (India) Ltd has acquired land in Dubai for AED 15 million, marking its entry into international real estate activities through its wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1766570439046,
            "Source": "stocks"
        },
        {
            "Title": "RVNL Appoints Saleem Ahmad as New CMD",
            "Summary": "Rail Vikas Nigam Limited announces appointment of Shri Saleem Ahmad as Chairman & Managing Director effective December 23, 2025, replacing Shri Sukhmal Chand Jain who ceased from the position.",
            "Sentiment": "neutral",
            "PublishDate": 1766497657368,
            "Source": "stocks"
        },
        {
            "Title": "NBCC Wins ₹179.37 Cr IIM Sambalpur PMC Contract",
            "Summary": "NBCC (India) Limited secured a Project Management Consultancy contract worth ₹179.37 crores from Indian Institute of Management, Sambalpur for Phase-II infrastructure development of permanent campus.",
            "Sentiment": "positive",
            "PublishDate": 1766123801052,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Secures ₹180 Crore Contract",
            "Summary": "NBCC (India) Limited has secured a new contract valued at ₹180 crores, marking another significant business win for the public sector construction company.",
            "Sentiment": "positive",
            "PublishDate": 1766123737950,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Wins ₹345 Cr Work Orders from IIT Mandi & Kandla SEZ",
            "Summary": "NBCC (India) Limited secured two major contracts worth ₹345.04 crores, including a ₹332.99 crore project management consultancy for IIT Mandi and a ₹12.05 crore maintenance contract for Kandla SEZ.",
            "Sentiment": "positive",
            "PublishDate": 1765881033206,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Secures ₹289.39 Cr Work Orders from NALCO & SAIL",
            "Summary": "NBCC (India) Limited announces two major work orders totaling ₹289.39 crores, including civil construction projects for NALCO worth ₹255.50 crores and desilting work for SAIL Bokaro valued at ₹33.89 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765455397824,
            "Source": "co_actions_results"
        },
        {
            "Title": "NBCC Sells 175 Residential Units in Greater Noida for ₹485.41 Crores",
            "Summary": "NBCC completed the sale of 175 residential units at its Aspire Leisure Valley project in Greater Noida for approximately ₹485.41 crores. The transaction represents a significant revenue generation for the state-owned construction company from its residential development portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1765151628475,
            "Source": "stock"
        },
        {
            "Title": "NBCC Sells 175 Homes in Greater Noida Project for ₹485.41 Crores",
            "Summary": "NBCC completed the sale of 175 residential units at its Aspire Leisure Valley project in Greater Noida, generating revenue of approximately ₹485.41 crores. The transaction represents a significant revenue milestone for the state-owned construction company from its residential development operations.",
            "Sentiment": "positive",
            "PublishDate": 1765014797878,
            "Source": "stock"
        },
        {
            "Title": "NBCC Secures Five New Project Management Contracts Worth Rs. 665.38 Crores",
            "Summary": "NBCC (India) Limited has been awarded five project management consultancy contracts totaling approximately Rs. 665.38 crores, with the largest being a Rs. 642.82 crore redevelopment project in Ghaziabad. The contracts span across redevelopment, renovation, and construction projects for various institutional clients including development authorities and professional institutes, representing regular business operations for the company.",
            "Sentiment": "positive",
            "PublishDate": 1764744965288,
            "Source": "stock"
        },
        {
            "Title": "LIC Increases Stake in NBCC India to 8.477% Through Market Purchases",
            "Summary": "Life Insurance Corporation of India acquired 30,24,672 shares of NBCC (India) Limited through market purchases, increasing its shareholding from 6.548% to 8.477%. The acquisition occurred between April 25, 2018 and November 24, 2025, with NBCC's equity share capital expanding from ₹180 crore to ₹270 crore during this period.",
            "Sentiment": "neutral",
            "PublishDate": 1764310005938,
            "Source": "corporate_action"
        },
        {
            "Title": "NBCC Secures Two Project Management Contracts Worth Rs 71.86 Crore",
            "Summary": "NBCC (India) Limited has been awarded two project management consultancy contracts totaling approximately Rs 71.86 crore from National Institute for Empowerment of Persons with Multiple Disabilities and National Horticulture Board. The contracts involve PMC services for construction of a new campus in Tamil Nadu (Rs 29.49 crore) and planning, designing and execution of International Potato Centre in Agra along with other miscellaneous works (Rs 42.37 crore).",
            "Sentiment": "positive",
            "PublishDate": 1763732220820,
            "Source": "order&deals"
        },
        {
            "Title": "NBCC Secures New Contracts Worth ₹718.6 Million",
            "Summary": "NBCC has secured new contracts with a total value of ₹718.6 million. The contract wins will contribute to the company's revenue pipeline and business growth.",
            "Sentiment": "positive",
            "PublishDate": 1763731175103,
            "Source": "stock"
        },
        {
            "Title": "NBCC Secures Work Order Worth 450.9 Million Rupees",
            "Summary": "NBCC has received a work order valued at 450.9 million rupees. This contract award will contribute to the company's revenue pipeline and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1763725827321,
            "Source": "stock"
        },
        {
            "Title": "NBCC Reports Strong Q2 Performance with 20% Revenue Growth and 40% Standalone PAT Jump",
            "Summary": "NBCC achieved consolidated revenue of INR 3,017 crores in Q2 FY26, marking 20% year-on-year growth, while standalone PAT surged 40% to INR 173 crores. The company secured new business worth INR 6,800 crores in Q2 and maintains a robust order book of INR 1,28,000 crores, targeting INR 14,000-15,000 crores revenue for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1763643926438,
            "Source": "stock"
        },
        {
            "Title": "NBCC Secures Rs 2,966 Crore Project Management Contract from NMRDA",
            "Summary": "NBCC (India) Limited has been awarded a Project Management Consultancy contract worth approximately Rs 2,966.10 crore by Nagpur Metropolitan Region Development Authority (NMRDA) for the development of Naveen Nagpur Phase-1. The contract represents a significant business win for the state-owned construction company in its ordinary course of operations.",
            "Sentiment": "positive",
            "PublishDate": 1763553840401,
            "Source": "order&deals"
        },
        {
            "Title": "NBCC Successfully Sells 609 Residential Units Worth Rs. 1069.43 Crores Through E-Auction",
            "Summary": "NBCC (India) Limited successfully sold 609 residential units at Aspire Leisure Valley and Aspire Centurian Park projects in Greater Noida through e-auction for approximately Rs. 1069.43 crores. The company will receive a marketing fee of 1% on the sale value, with the transaction being part of its normal business operations.",
            "Sentiment": "positive",
            "PublishDate": 1763535897643,
            "Source": "stock"
        },
        {
            "Title": "NBCC Issues TDS Guidelines for Interim Dividend Payment",
            "Summary": "NBCC (India) Limited has communicated tax deduction at source (TDS) requirements for its interim dividend for FY 2025-26, with record date set as November 19, 2025. Shareholders must submit requisite documents by November 20, 2025 to claim exemption from TDS on dividend payments as mandated under the Income Tax Act.",
            "Sentiment": "neutral",
            "PublishDate": 1763382739712,
            "Source": "corporate_action"
        },
        {
            "Title": "NBCC Secures ₹498.3 Crore Construction Order in Jharkhand, Stock Rises 1%",
            "Summary": "NBCC (India) Ltd. won a project management consultancy order worth ₹498.3 crore from Damodar Valley Corporation for constructing an integrated township at Chandrapura Thermal Power Station in Jharkhand. The company reported strong September quarter results with 26% growth in net profit to ₹153.5 crore and 19% revenue growth to ₹2,910.2 crore, while announcing a second interim dividend of ₹0.21 per share for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763366279018,
            "Source": "order&deals"
        },
        {
            "Title": "NBCC India Reports Quarterly Financial Results and Declares Interim Dividend",
            "Summary": "NBCC (India) Limited published its unaudited financial results for the quarter and half year ended September 30, 2025, showing total income from operations of ₹209,351.56 lakhs and net profit after tax of ₹17,254.98 lakhs for the quarter. The Board of Directors declared a second interim dividend of ₹0.21 per share for the financial year 2025-26 and the results were approved in their meeting held on November 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763124509537,
            "Source": "earnings"
        },
        {
            "Title": "NBCC Management Reaffirms Revenue Guidance of ₹14,000-15,000 Crore",
            "Summary": "NBCC management has reaffirmed their revenue guidance of ₹14,000-15,000 crore and expressed confidence in achieving this target. The company's management shared this update during a conference call, maintaining their financial projections for the year.",
            "Sentiment": "negative",
            "PublishDate": 1763104963481,
            "Source": "earnings"
        },
        {
            "Title": "NBCC Expects Rs 10,000-12,000 Crore in New Work Orders for H2",
            "Summary": "NBCC announced expectations to secure new work orders worth Rs 10,000-12,000 crore in the second half of the year during a conference call. The projected order intake represents the company's business pipeline and growth expectations for the remaining period.",
            "Sentiment": "positive",
            "PublishDate": 1763102525627,
            "Source": "stock"
        },
        {
            "Title": "NBCC India Guides Robust Growth with ₹55,000+ Cr Order Book and Diversification Strategy",
            "Summary": "NBCC (India) has provided guidance for robust growth backed by an order book exceeding ₹55,000 crores, with increased execution in redevelopment projects including Nauroji Nagar and Netaji Nagar. The company is diversifying into defence, railway infrastructure, and smart cities while targeting improved margins through technology integration and an asset-light expansion model.",
            "Sentiment": "positive",
            "PublishDate": 1763051957129,
            "Source": "stock"
        },
        {
            "Title": "NBCC India Secures Rs 340.17 Crore Construction Contract from Central University of Kashmir",
            "Summary": "NBCC (India) Limited has been awarded a Rs 340.17 crore contract for construction of Central University of Kashmir Phase-I works at Tulmulla Ganderbal Kashmir. The project involves project management consultancy services and represents business growth for the state-owned construction company in the education infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1763046699198,
            "Source": "stock"
        },
        {
            "Title": "NBCC India Reports 26% Jump in Q2 Net Profit to 1.54 Billion Rupees",
            "Summary": "NBCC India reported quarterly net profit of 1.54 billion rupees compared to 1.22 billion rupees in the same period last year. Revenue increased to 29 billion rupees from 24.4 billion rupees year-over-year. EBITDA rose to 1 billion rupees from 999 million rupees, though EBITDA margin declined to 3.46% from 4.06% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763023700724,
            "Source": "earnings"
        },
        {
            "Title": "NBCC India to Announce Q2 Results on November 13, Board to Consider Interim Dividend",
            "Summary": "NBCC India Ltd., a Navratna public sector undertaking under the Ministry of Housing and Urban Affairs, will announce its second quarter results on November 13. The Board of Directors will consider unaudited standalone and consolidated financial results for the quarter and half-year ended September 2025, along with a second interim dividend declaration. An earnings call is scheduled for November 14 at 12 p.m. IST. In the previous quarter, the construction company reported a 26% year-on-year rise in consolidated net profit to Rs 132.13 crore and 11.6% revenue growth to Rs 2,391.19 crore. NBCC shares have declined 1.05% in the past five trading sessions but gained 21.47% year-to-date, with a 52-week high of Rs 130.7 and low of Rs 70.8.",
            "Sentiment": "neutral",
            "PublishDate": 1762851564471,
            "Source": "earnings"
        },
        {
            "Title": "NBCC Signs Strategic MoU with UAE Real Estate Developer Pantheon Elysee",
            "Summary": "NBCC (India) Limited has signed a strategic Memorandum of Understanding with Pantheon Elysee Real Estate Development LLC, a real estate developer based in Dubai, UAE. The MoU covers execution of construction and development works for real estate projects in the United Arab Emirates. The collaboration will focus on joint development, project management, infrastructure development, and high-quality residential, hospitality, and mixed-use projects across the UAE. The company stated this MoU is in the normal course of business.",
            "Sentiment": "positive",
            "PublishDate": 1762759452620,
            "Source": "order&deals"
        }
    ]
}