{
    "Symbol": "NCC",
    "ISIN": "INE868B01028",
    "News": [
        {
            "Title": "NCC Reports Q3 FY26 Results with Exceptional Items",
            "Summary": "NCC Limited announced Q3 FY26 financial results for quarter ended December 31, 2025, reporting consolidated net profit of ₹122.46 crores and standalone net profit of ₹82.01 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1770312390097,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCC Reports 38% Decline in Q3 Net Profit",
            "Summary": "NCC Limited posted consolidated net profit of ₹1.2 billion in Q3, down 38% from ₹1.93 billion year-on-year. Revenue also declined 8.9% to ₹48.7 billion from ₹53.44 billion in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1770292996526,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCC Bags Orders Worth Rs 2456.89 Crore in January",
            "Summary": "NCC Limited secured five orders totaling Rs 2456.89 crore during January 2026, with Water Division contributing Rs 1922.26 crore, Transportation Division Rs 290.02 crore, and Electrical Division Rs 244.61 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769883353216,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCC Limited Gets NCLT Approval for Subsidiary Merger",
            "Summary": "The National Company Law Tribunal, Hyderabad has approved the scheme of amalgamation between NCC Infrastructure Holdings Limited and NCC Limited, with the appointed date as April 1, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1769866172827,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCC Limited Appoints Sumit Banerjee as Independent Director",
            "Summary": "NCC Limited shareholders approve appointment of Sri Sumit Banerjee as Independent Director through postal ballot with 99.97% votes in favor. The e-voting concluded on January 27, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769606901214,
            "Source": "stocks"
        },
        {
            "Title": "NCC Limited Q3FY26 Earnings Call on Feb 6, 2026",
            "Summary": "NCC Limited announces analyst/investor conference call scheduled for February 6, 2026 at 11:30 AM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769596705189,
            "Source": "stocks"
        },
        {
            "Title": "NCC bags four new orders worth ₹1,237 crore in December",
            "Summary": "NCC Limited secured four new orders totaling ₹1,237.24 crore during December, with Buildings Division contributing ₹704.67 crore and Transportation Division ₹532.57 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767180051593,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCC Appoints Sumit Banerjee as Independent Director",
            "Summary": "NCC Limited's Board approves appointment of Sumit Banerjee as Additional Non-Executive Independent Director for 5-year term starting January 1, 2026, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1765952773274,
            "Source": "stocks"
        },
        {
            "Title": "NCC Limited Adds New Member to Promoter Group Through Share Transfer",
            "Summary": "NCC Limited's Promoter and Wholetime Director Alluri Srimannarayana Raju transferred 4,36,157 equity shares as a gift to Sri Paavan Anish Varma Alluri on December 2, 2025. Sri Paavan Anish Varma Alluri has been classified as part of the Promoter Group, with his shareholding to be disclosed under the Promoter category from the quarter ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764756169220,
            "Source": "corporate_action"
        },
        {
            "Title": "NCC Limited Secures Additional Orders Worth ₹530.72 Crores Across Multiple Sectors",
            "Summary": "NCC Limited received additional orders valued at ₹530.72 crores spanning buildings, water, and transport sectors in November 2025. The diversified order book expansion across multiple infrastructure segments strengthens the company's project pipeline and revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1764555659901,
            "Source": "stock"
        },
        {
            "Title": "NCC Secures ₹20.63 Billion Contract for Gauhati Medical College Expansion",
            "Summary": "NCC has been awarded a construction contract valued at ₹20.63 billion for the expansion of Gauhati Medical College. This significant order win represents a substantial addition to the company's project portfolio in the healthcare infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1764115859298,
            "Source": "stock"
        },
        {
            "Title": "NCC Limited Withdraws FY26 Guidance Amid Revenue Decline and Payment Delays",
            "Summary": "NCC Limited reported a 12% decline in consolidated revenue to INR 4,585 crores in Q2 FY26 compared to INR 5,224 crores in the previous year. The company withdrew its FY26 guidance due to unprecedented rainfall, elongated payment cycles, and delayed project approvals. Order book stands at INR 71,957 crores with new orders worth INR 6,223 crores booked during the quarter. EBITDA margin was 8.66% on consolidated basis. The company faces payment delays primarily in water projects under Jal Jeevan Mission, with receivables of approximately INR 1,700 crores. Debt increased to INR 2,115 crores from INR 1,852 crores at quarter beginning. Management expects to provide updated guidance by March 2026.",
            "Sentiment": "negative",
            "PublishDate": 1762958275505,
            "Source": "earnings"
        },
        {
            "Title": "NCC Withdraws FY26 Guidance Citing Challenging Business Environment",
            "Summary": "NCC has withdrawn its guidance for FY26 due to a challenging external business environment and elongated payment cycles. The withdrawal was driven by three main factors: extended and aggressive monsoons affecting projects, delays in project permissions and disputes, and elongated client payment cycles. Management declined multiple analyst requests to provide even qualitative guidance for H2 FY26, consistently referring to the guidance withdrawal. The company expects to provide an update by March 2026.",
            "Sentiment": "negative",
            "PublishDate": 1762746111695,
            "Source": "stock"
        },
        {
            "Title": "NCC Limited Reports Mixed Q2 FY26 Results with 34% Revenue Growth but 16% EBITDA Decline",
            "Summary": "NCC Limited announced its quarterly results for the second quarter ended September 30, 2025. On a standalone basis, the company reported revenue of Rs 3,774 crore, marking a 34% year-on-year growth, while EBITDA declined 16% year-on-year to Rs 278 crore (7.45% of turnover). Net profit stood at Rs 101 crore (2.68% of revenue) with earnings per share of Rs 1.61. On a consolidated basis, revenue reached Rs 4,585 crore with a 12% year-on-year decline, EBITDA at Rs 155 crore (3.38% of revenue), and earnings per share of Rs 2.46. The company's order book stands at Rs 71,957 crore (37% year-on-year growth) with order inflow of Rs 6,223 crore (31% year-on-year growth). The company attributed execution slowdowns to prolonged monsoon affecting site access and productivity across key geographies. NCC operates across multiple verticals including buildings, transportation, water, electrical, mining, and railways. The company expects H2 to see normal ramp-up with several large sites expected to gain traction, consistent with historical patterns of stronger second half performance.",
            "Sentiment": "neutral",
            "PublishDate": 1762457240219,
            "Source": "earnings"
        },
        {
            "Title": "NCC Reports 37% Growth in Order Book to ₹71,957 Crores, Targets 7%+ Margins",
            "Summary": "NCC has achieved an order book of ₹71,957 crores, representing a 37% year-on-year increase. The company operates across multiple infrastructure segments including roads, water, railways, and buildings. NCC is focusing on diversified execution and ESG-driven projects while maintaining margins above 7%. The company leverages its 47+ years of engineering experience and pan-India presence. NCC plans to expand into smart infrastructure, green energy, and urban connectivity projects.",
            "Sentiment": "positive",
            "PublishDate": 1762442126300,
            "Source": "stock"
        },
        {
            "Title": "NCC Reports Q2 Revenue Decline to 45.4 Billion Rupees",
            "Summary": "NCC reported quarterly revenue of 45.4 billion rupees compared to 52 billion rupees in the same period last year, representing a year-over-year decline. The company clarified that the results pertain to NCC, not NHPC.",
            "Sentiment": "negative",
            "PublishDate": 1762421923110,
            "Source": "earnings"
        },
        {
            "Title": "NCC Reports Decline in Q2 Net Profit and EBITDA Despite Margin Improvement",
            "Summary": "NCC reported quarterly EBITDA of 3.9 billion rupees, down from 4.4 billion rupees in the same period last year. However, the company's EBITDA margin improved to 8.66% from 8.52% year-over-year. Consolidated net profit decreased to 1.5 billion rupees compared to 1.63 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762421472093,
            "Source": "earnings"
        },
        {
            "Title": "NCC Secures Orders Worth ₹7,539 Crore in October 2025",
            "Summary": "NCC received a major order valued at ₹6,828.94 crore along with four additional orders totaling ₹710 crore in October 2025. The additional orders comprise ₹590.9 crore for the Buildings Division and ₹119.1 crore for the Transportation Division. The combined value of all orders amounts to ₹7,538.94 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762128851383,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Secures Orders Worth ₹7,539 Crore in October 2025",
            "Summary": "NCC secured a major order worth ₹6,828.94 crore along with four additional orders totaling ₹710 crore in October 2025. The orders include ₹590.9 crore for the Buildings division and ₹119.1 crore for the Transportation division. The combined value of all orders amounts to ₹7,538.94 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761910135328,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Secures Major Contract Worth 68 Billion Rupees",
            "Summary": "NCC has won a significant order valued at 68 billion rupees. The contract represents a substantial business win for the company.",
            "Sentiment": "positive",
            "PublishDate": 1761523774323,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Limited Secures Rs 6,829 Crore Coal Mining Contract from Central Coalfields Limited",
            "Summary": "NCC Limited received a Letter of Acceptance from Central Coalfields Limited for extraction and transportation of overburden and coal at Amrapali OCP, Chandragupt Area in Jharkhand State. The contract involves hiring of HEMM for removal of 413.59 million cubic meters of overburden, extraction of 233.325 million tons of coal, and transportation to Shivpur siding and surface stock yard, along with wagon loading of 139.995 million tons of coal. The contract value is Rs 6,828.94 crore excluding GST, with an execution period of 7 years for production and 360 days for development, totaling 2,915 days. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1761373021431,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Limited Secures Rs 2,090.5 Crore Water Infrastructure Contract in Bihar",
            "Summary": "NCC Limited has received a major order worth approximately Rs 2,090.5 crore (excluding GST) from the Water Resources Department, Bihar for the construction of Barner Reservoir Scheme in Jamui district. The project involves construction of the Barnar reservoir, dam structures, irrigation channels, and other associated works. The construction timeline is set for 30 months with a defect liability period of 60 months. This is a domestic contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1757934450318,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Secures Water Division Contracts Worth ₹788.34 Crore from State Agencies",
            "Summary": "NCC has won water division contracts valued at ₹788.34 crore from state agencies in August 2025. The contracts are part of the company's water infrastructure business segment.",
            "Sentiment": "positive",
            "PublishDate": 1756630674298,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Secures ₹790 Crore Order",
            "Summary": "NCC has secured a new order valued at ₹790 crores.",
            "Sentiment": "positive",
            "PublishDate": 1756109938692,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Limited Secures 89.60% Creditor Approval for Scheme of Arrangement with Infrastructure Holdings Unit",
            "Summary": "NCC Limited held an adjourned meeting of secured creditors to approve a Scheme of Arrangement between NCC Infrastructure Holdings Limited and NCC Limited. The scheme was approved by 89.60% of creditors present, representing 92.25% of the total outstanding secured debt. Eighteen secured creditors attended the meeting, with seventeen voting in favor and one abstaining. The meeting was conducted under NCLT supervision with Mr. Md. Hidayathullah Shareef as Chairman. Major banks including State Bank of India, Canara Bank, Union Bank of India, and ICICI Bank were among the creditors who voted in favor. The total debt amount involved was Rs. 2,032.98 crores. Indian Overseas Bank abstained from voting. The meeting was originally scheduled for January 2025 but was adjourned three times before being held in August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755195469349,
            "Source": "corporate_action"
        },
        {
            "Title": "NCC Limited Reports 7% Revenue Decline in Q1 FY26, Maintains 9% EBITDA Margin Guidance",
            "Summary": "NCC Limited reported standalone revenue of INR 4,430 crores in Q1 FY26, down 7% from INR 4,747 crores in the corresponding quarter last year. The company maintained its EBITDA margin at 9.02% compared to 9.33% in the previous year, staying in line with annual guidance. The company holds a strong order book of INR 70,087 crores and secured new orders worth INR 3,658 crores during the quarter. Order inflows including L1 status reached INR 6,719 crores, representing 31% of the lower band guidance. The revenue decline was attributed to delays in SWSM project payments and the fact that major orders received in March are still in mobilization phase. Management expects revenue growth to pick up from Q3 onwards as new projects become operational. Net debt increased to INR 1,497 crores from INR 695 crores at the beginning of the year. The company maintains its order inflow guidance of INR 22,000-25,000 crores for FY26 and expects to achieve 9% EBITDA margins with potential for improvement.",
            "Sentiment": "neutral",
            "PublishDate": 1754991999191,
            "Source": "earnings"
        },
        {
            "Title": "NCC Shares Rise 4.6% Despite Weak Quarterly Results on Strong Order Inflows",
            "Summary": "NCC Ltd. shares ended a five-day decline, gaining 4.64% to Rs 220.8 despite posting weak quarterly results. The company secured new orders worth Rs 3,658 crore in the first quarter, representing 17% of its expected full-year order inflow of Rs 22,000-25,000 crore. Quarterly revenue declined 6.3% to Rs 5,179 crore, while net profit dropped 8% to Rs 192.14 crore, though margins improved slightly to 8.8% from 8.6%. The stock has declined 29.98% over 12 months and 20.41% year-to-date. Trading volume was 14 times the 30-day average. Of 15 analysts covering the stock, 10 maintain buy ratings, three hold, and two sell, with an average price target implying 23.4% upside.",
            "Sentiment": "neutral",
            "PublishDate": 1754458795818,
            "Source": "stock"
        },
        {
            "Title": "NCC Reports 33% Growth in Order Book to ₹70,087 Crore, Targets ₹22K-25K Crore New Orders for FY26",
            "Summary": "NCC has achieved a 33% yearly increase in its order book, reaching ₹70,087 crore. The company forecasts order inflows of ₹22,000-25,000 crore for FY26. NCC is focusing on buildings, transportation, water, and electrical sectors with emphasis on careful execution. The company maintains an AA- credit rating and has a strong bid pipeline along with ESG initiatives to support future growth.",
            "Sentiment": "positive",
            "PublishDate": 1754412341917,
            "Source": "stock"
        },
        {
            "Title": "NCC Limited Reports 6.7% Revenue Decline in Q1 FY26, Order Book Grows 30% to Rs 61,779 Crore",
            "Summary": "NCC Limited reported standalone revenue of Rs 4,430 crore for Q1 FY26, down 6.7% year-on-year. The company's standalone order book increased 30% to Rs 61,779 crore, while consolidated order book reached Rs 70,087 crore, up 33% year-on-year. EBITDA stood at Rs 395 crore (9.0% of revenue) and profit after tax was Rs 190 crore (4.3% of revenue). The company secured new orders worth Rs 3,658 crore in Q1 FY26, representing approximately 17% of its full-year order inflow guidance of Rs 22,000-25,000 crore. NCC maintained its AA- credit rating with stable outlook from India Ratings & Research. The company operates across multiple verticals including buildings, transportation, water & environment, irrigation, mining, railways, and electrical transmission & distribution.",
            "Sentiment": "neutral",
            "PublishDate": 1754411883688,
            "Source": "earnings"
        },
        {
            "Title": "NCC Reports Decline in Q1 Financial Performance Across Key Metrics",
            "Summary": "NCC reported consolidated net profit of 1.92 billion rupees in Q1, down from 2.1 billion rupees in the same period last year. Revenue decreased to 51.79 billion rupees from 55.3 billion rupees year-over-year. EBITDA fell significantly to 2.56 billion rupees compared to 4.77 billion rupees in the previous year, while EBITDA margin compressed to 4.95% from 8.65% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754393212109,
            "Source": "earnings"
        },
        {
            "Title": "NCC Announces Q1FY26 Results Date for August 5, Stock Down 22.62% Year-to-Date",
            "Summary": "NCC Ltd., a construction and infrastructure company, will announce its Q1FY26 results on August 5, 2025, with an earnings call scheduled for August 6. The company's trading window is closed from July 1 to August 7 for designated persons. In Q4FY25, NCC reported an 11% year-on-year increase in consolidated profit after tax to Rs 265.07 crore, while total income decreased 5.2% to Rs 6,189.36 crore. NCC shares have declined significantly, falling 22.62% year-to-date and 33.31% over the past year. The stock hit a 52-week high of Rs 362.60 in August 2024 and a 52-week low of Rs 170.05 in March 2025. Shares were trading at Rs 214.84, up 0.37% during Monday morning trading.",
            "Sentiment": "neutral",
            "PublishDate": 1754280519080,
            "Source": "earnings"
        },
        {
            "Title": "NCC Limited Sets August 14, 2025 as Record Date for Equity Dividend",
            "Summary": "NCC Limited has fixed August 14, 2025 as the record date for determining shareholders eligible for equity dividend for Financial Year 2024-25. The dividend was recommended by the Board of Directors at their meeting held on May 15, 2025, and is subject to approval at the Annual General Meeting scheduled for August 29, 2025. Shareholders on record as of the specified date will be eligible for the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1754048496416,
            "Source": "corporate_action"
        },
        {
            "Title": "NCC Secures Additional Orders Worth ₹791.54 Crore",
            "Summary": "NCC has secured additional orders valued at ₹791.54 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753965722072,
            "Source": "stock"
        },
        {
            "Title": "NCC Limited Secures Orders Worth Rs. 3,060 Crore from State Government Agencies in July 2025",
            "Summary": "NCC Limited received three orders totaling Rs. 3,060.54 crore during July 2025. The company secured one major order worth Rs. 2,269 crore and two additional orders totaling Rs. 791.54 crore. The additional orders include Rs. 461.39 crore for the Buildings Division and Rs. 330.15 crore for the Electrical Division. All orders were awarded by State Government agencies and received in the normal course of business. The company confirmed that promoters and group companies have no interest in the awarding entities, and the orders do not constitute related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753963564943,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Ltd: Secures Rs 2,269 Crore Mumbai Metro Contract",
            "Summary": "NCC Ltd has won a Rs 2,269 crore contract from MMRDA for Mumbai Metro Line 6 project. The work includes design, supply, installation, and commissioning of various systems. The project is to be completed in 24 months, followed by maintenance periods.",
            "Sentiment": "positive",
            "PublishDate": 1752467300000,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Secures Major Order Worth 22.69 Billion Rupees",
            "Summary": "NCC, a company, has won an order valued at 22.69 billion rupees. No additional details about the nature of the order, the client, or the timeline were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752451675000,
            "Source": "default"
        },
        {
            "Title": "NCC Ltd: Secures ₹2,269 Crore Mumbai Metro Contract",
            "Summary": "NCC Ltd has been awarded a ₹2,269 crore contract by MMRDA for Mumbai Metro Line 6. The project includes design, supply, and commissioning of rolling stock and systems. The contract has a 24-month construction period, followed by maintenance phases.",
            "Sentiment": "positive",
            "PublishDate": 1752237591000,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Secures Major Order Worth 22.69 Billion Rupees",
            "Summary": "NCC, a company, has announced that it has secured a new order valued at 22.69 billion rupees. No additional details about the order or the company's business sector were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752235947000,
            "Source": "default"
        },
        {
            "Title": "NCC Ltd: Secures Orders Worth Rs 1,690 Crore in June",
            "Summary": "NCC Ltd received orders totaling Rs 1,690.51 crore in June for its building division. The orders, from state government agencies and private companies, are to be completed within 4 to 24 months. The company's share price rose 2.79% to Rs 236.89 in response to the news.",
            "Sentiment": "positive",
            "PublishDate": 1751344221000,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Receives Orders Worth 16.9 Billion Rupees in June",
            "Summary": "NCC has announced that it received orders totaling 16.9 billion rupees in June. These orders were obtained from both government entities and private limited companies.",
            "Sentiment": "positive",
            "PublishDate": 1751328384000,
            "Source": "default"
        },
        {
            "Title": "NCC Ltd: Secures Rs 1,690 Crore in New Orders for June",
            "Summary": "NCC Ltd. received orders worth Rs 1,690.51 crore in June from state government agencies and private companies. The orders are for the building division and will be completed within 4 to 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1751286290000,
            "Source": "order&deals"
        },
        {
            "Title": "NCC Secures Orders Worth 16.9 Billion Rupees in June",
            "Summary": "NCC (the company) has reported receiving orders totaling 16.9 billion rupees in June. These orders were obtained from both government entities and private limited companies.",
            "Sentiment": "positive",
            "PublishDate": 1751283878000,
            "Source": "default"
        },
        {
            "Title": "NCC Ltd: Targets 10% Revenue Growth, Rs 22,000-25,000 Crore Orders in FY26",
            "Summary": "NCC Ltd expects order inflows of Rs 22,000-25,000 crore in FY26, targeting 10% revenue growth. The company plans capex of Rs 700-750 crore, including a tunnel boring machine purchase. Current order book stands at over Rs 71,000 crore. Debt is expected to increase by Rs 200-300 crore annually. Working capital challenges persist due to recent elections, but payments have begun flowing in April.",
            "Sentiment": "positive",
            "PublishDate": 1749171816000,
            "Source": "normal_news"
        },
        {
            "Title": "NBCC Ltd: Q4 Profit Jumps 29%, Declares Dividend",
            "Summary": "NBCC Ltd reported a 29.4% YoY increase in Q4 net profit to ₹176 crore. Revenue rose 16.2% to ₹4,642.5 crore. EBITDA grew 19.3% to ₹290 crore. The company declared a final dividend of ₹0.14 per share for FY2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1748531902000,
            "Source": "earnings"
        },
        {
            "Title": "NCC Achieves Revised Guidance with Record Order Book",
            "Summary": "NCC (National Construction Company) has reported achieving its revised guidance with the highest order book in its history, valued at 71,500 crores.",
            "Sentiment": "positive",
            "PublishDate": 1747816512000,
            "Source": "default"
        },
        {
            "Title": "NBCC Ltd: Share Price Hits Record High After Rs 1,468 Crore Sales",
            "Summary": "NBCC Ltd's shares rose nearly 5% to a record high after selling 446 residential units in Noida for Rs 1,468 crore. The company will receive a 1% marketing fee on the total sale value. This follows recent successful sales in Greater Noida projects.",
            "Sentiment": "positive",
            "PublishDate": 1747637135000,
            "Source": "normal_news"
        },
        {
            "Title": "NCC Provides Financial Guidance for FY '26",
            "Summary": "NCC has provided financial guidance for FY '26 during a concall update. The company expects order inflow to be between ₹22,000 crore and ₹25,000 crore. NCC anticipates a 10% revenue growth and projects an EBITDA margin between 9% to 9.25% for FY '26.",
            "Sentiment": "positive",
            "PublishDate": 1747624217000,
            "Source": "default"
        },
        {
            "Title": "NCC Reports Q4 Financial Results and Dividend Announcement",
            "Summary": "NCC has reported its Q4 consolidated net profit of 2.5 billion rupees, compared to 2.39 billion rupees year-over-year and 1.9 billion rupees quarter-over-quarter. The company's Q4 revenue stood at 61.3 billion rupees, down from 64.85 billion rupees in the same quarter last year. Additionally, NCC has recommended a dividend of 2.2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747354160000,
            "Source": "default"
        },
        {
            "Title": "NCC Ltd: Q4 Profit Up 6%, Declares Dividend, FY25 Orders at ₹32,888 Crore",
            "Summary": "NCC Ltd reported a 6% YoY increase in Q4 net profit to ₹253.8 crore. Revenue decreased 5.5% YoY to ₹6,120.9 crore. EBITDA rose 1.1% to ₹556.5 crore. FY25 order book stands at ₹71,568 crore consolidated. Board recommends dividend of ₹2.20 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747317803000,
            "Source": "earnings"
        },
        {
            "Title": "NCC Reports Q4 Results and Announces Dividend",
            "Summary": "NCC has announced its Q4 financial results and recommended a dividend. The company's Q4 consolidated net profit increased to 2.5 billion rupees from 2.39 billion rupees year-over-year. Revenue decreased to 61.3 billion rupees from 64.85 billion rupees year-over-year. EBITDA slightly improved to 5.6 billion rupees, with EBITDA margin increasing to 9.07% from 8.49% year-over-year. The company has recommended a dividend of 2.2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747313970000,
            "Source": "result"
        }
    ]
}