{
    "Symbol": "NCLIND",
    "ISIN": "INE732C01016",
    "News": [
        {
            "Title": "CLC Industries Reports Q3FY26 Loss of ₹492.72 Cr",
            "Summary": "CLC Industries Limited posted a net loss of ₹492.72 crores for Q3FY26, compared to a profit of ₹488.99 crores in Q3FY25. Revenue from operations increased to ₹3,167.77 crores.",
            "Sentiment": "negative",
            "PublishDate": 1769077594525,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCL Industries Appoints Dr. Durga Prasad as Independent Director",
            "Summary": "NCL Industries Limited has appointed Dr. Durga Prasad Subramanyam Anapindi as an Independent Director for a five-year term from January 22, 2026, to January 21, 2031, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1769067357697,
            "Source": "stocks"
        },
        {
            "Title": "NCL Industries Appoints New Directors via Postal Ballot",
            "Summary": "NCL Industries successfully completes postal ballot process, appointing K Ravi as Vice Chairman & MD, Gautam Kalidindi and Roopa Bhupatiraju as Non-Executive Directors with strong shareholder support.",
            "Sentiment": "positive",
            "PublishDate": 1768841660421,
            "Source": "stocks"
        },
        {
            "Title": "NCL Industries Q3: Cement output up 5%, other segments decline",
            "Summary": "NCL Industries reports 5% growth in cement production and dispatches for Q3 FY26, while cement boards and doors segments face significant declines during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1767796003455,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCL Industries Q3FY26 Production & Dispatch Update",
            "Summary": "NCL Industries reported 5% YoY growth in cement production and dispatches for Q3FY26, while cement boards and doors segments faced significant declines. Energy generation showed positive momentum.",
            "Sentiment": "neutral",
            "PublishDate": 1767792373478,
            "Source": "stocks"
        },
        {
            "Title": "NCL Homes Acquires Additional Shares in NCL Industries",
            "Summary": "NCL Homes Limited, a promoter group entity, acquired 275 additional shares of NCL Industries through open market purchase on December 11, 2025, increasing its total holding to 296,088 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1767623323602,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCL Industries Promoter Group Sells 1.2% Stake",
            "Summary": "NCL Holdings (A&S) Ltd, part of NCL Industries' promoter group, sold 541,984 shares representing 1.20% stake through inter-se transfer on December 31, 2025, reducing holding to 1.07%.",
            "Sentiment": "neutral",
            "PublishDate": 1767599282506,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCL Industries Independent Director Completes Term",
            "Summary": "NCL Industries announces completion of Mrs. Sudha Reddy's independent directorship term effective January 3, 2026, following regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767450146281,
            "Source": "stocks"
        },
        {
            "Title": "NCL Industries Promoters Acquire 4,244 Shares",
            "Summary": "NCL Industries promoter group members Kakatiya Industries and Kalidindi Ravi acquired 2,700 and 1,544 shares respectively through open market transactions on December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766732317610,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCL Industries Promoter Kalidindi Ravi Acquires Shares",
            "Summary": "Kalidindi Ravi, promoter of NCL Industries, acquired 2,000 equity shares through open market purchase on December 29, 2025, increasing his shareholding to 6.58% from 6.57%.",
            "Sentiment": "positive",
            "PublishDate": 1765782781593,
            "Source": "co_actions_results"
        },
        {
            "Title": "NCL Industries Reports Multiple Share Transactions by Promoter Group Members",
            "Summary": "NCL Industries disclosed share transactions involving promoter group entities including NCL Holdings selling 272,725 shares and individuals K. Gautam, Kalidindi Madhu HUF, and Divya Penumacha acquiring shares through inter-se transfers on December 5-6, 2025. The transactions were conducted off-market between promoter group members while maintaining the company's total equity share capital at Rs. 45,23,27,900 comprising 4,52,32,790 equity shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1765179529978,
            "Source": "corporate_action"
        },
        {
            "Title": "Kakatiya Industries Acquires Additional Shares in NCL Industries Through Open Market",
            "Summary": "Kakatiya Industries Private Limited, a promoter group entity, acquired shares of NCL Industries Limited through open market transactions on December 2-3, 2025. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers, with NCL Industries' equity share capital remaining at Rs. 45.23 crores comprising 4.52 crore equity shares of Rs. 10 each.",
            "Sentiment": "negative",
            "PublishDate": 1764909822852,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCL Industries Announces Major Leadership Restructuring with New Managing Director Appointment",
            "Summary": "NCL Industries' Managing Director Gautam Kalidindi and Executive Director Roopa Bhupatiraju resigned from executive positions effective December 2, 2025, citing personal reasons and commitments, while continuing as non-executive directors. K. Ravi has been appointed as Vice Chairman and Managing Director for a five-year term starting December 3, 2025, with all appointments subject to shareholder approval through postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1764748985314,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCL Industries Receives Regulatory Fines from NSE and BSE for Board Committee Compliance Issues",
            "Summary": "NCL Industries Limited received notices from NSE and BSE imposing fines of Rs. 3,39,840 each (inclusive of GST) for alleged non-compliance with SEBI regulation 17(1E) regarding board committee constitution. The company is filing waiver applications with both stock exchanges along with supporting documents in response to the notices dated November 28, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1764410141895,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCL Industries Promoter Group Sells Shares Through Open Market",
            "Summary": "NCL Industries' promoter group sold equity shares through open market transactions and disclosed the sale to stock exchanges as required under SEBI regulations. The company's equity share capital remains at Rs. 45.23 crores comprising 4,52,32,790 equity shares of Rs. 10 each before and after the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1764072868544,
            "Source": "corporate_action"
        },
        {
            "Title": "NCL Industries Reports Promoter Group Share Transactions Worth Rs. 45.23 Crore",
            "Summary": "NCL Industries disclosed multiple off-market share transactions on November 19, 2025, involving promoter group entities acquiring and selling shares totaling 44,517 and 59,866 shares respectively. The transactions were conducted between promoter group companies while maintaining the total equity share capital at Rs. 45,23,27,900 comprising 4,52,32,790 equity shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763725186725,
            "Source": "corporate_action"
        },
        {
            "Title": "NCL Industries Reports 55% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "NCL Industries' net profit fell to Rs 19.74 crore in Q2 from Rs 26.45 crore year-over-year, while revenue from operations rose to Rs 345.05 crore from Rs 330.38 crore. The company faced exceptional items totaling Rs 9.77 crore including mineral-bearing cess payments and joint venture investment diminution provisions.",
            "Sentiment": "positive",
            "PublishDate": 1763112111575,
            "Source": "earnings"
        },
        {
            "Title": "NCL Industries Expands Cement Production Capacity to 4.00 MTPA with New Andhra Pradesh Plant",
            "Summary": "NCL Industries has launched a new cement grinding plant with a capacity of 0.66 MTPA in Thallapalem, Andhra Pradesh. This expansion increases the company's total cement production capability from 3.30 MTPA to 4.00 MTPA, representing a significant boost to its manufacturing capacity.",
            "Sentiment": "positive",
            "PublishDate": 1762153534486,
            "Source": "stock"
        },
        {
            "Title": "NCL Industries Reports Mixed Q2 Production Results with Cement Up 8% but Door Production Down 98%",
            "Summary": "NCL Industries reported mixed production results for Q2. Cement production increased 8% to 640,435 MT with dispatches rising 7% to 639,528 MT. Energy production also grew 10% to 16.14 MU. However, several segments declined significantly: cement boards production fell 47% to 10,673 MT, RMC production dropped 18% to 66,185 CuM, and door production plummeted 98% to just 262 units.",
            "Sentiment": "neutral",
            "PublishDate": 1759907735961,
            "Source": "stock"
        },
        {
            "Title": "NCL Industries Promoter Group Members Execute Share Transactions Through Inter-se Transfer and Open Market",
            "Summary": "NCL Industries Limited disclosed two separate share transactions by its promoter group members. Kalidindi Ravi acquired 30,700 shares through inter-se transfer on September 26, 2025, increasing his holding from 2,897,979 shares (6.40%) to 2,928,679 shares (6.47%). Separately, Penmetsa Narasimha Raju sold 18,045 shares through open market transactions on September 26 and 29, 2025, reducing his holding from 443,545 shares (0.98%) to 425,500 shares (0.94%). The company's total equity share capital remains at Rs. 45.23 crore comprising 4.52 crore equity shares of Rs. 10 each. Both transactions were disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1759206785966,
            "Source": "corporate_action"
        },
        {
            "Title": "NCL Industries Appoints New Company Secretary Following Retirement",
            "Summary": "NCL Industries Limited announced leadership changes in its Company Secretary position. Mr. T. Arun Kumar retired due to superannuation effective October 1, 2025. Mrs. M. Divya Bharati was appointed as the new Company Secretary & Compliance Officer from the same date. Mrs. Bharati holds an LLM in Corporate Laws and is an Associate Member of the Institute of Company Secretaries of India with over 13 years of industry experience. She currently serves as Company Secretary of NCL Buildtek Ltd. The Board also reconstituted five committees including the Audit Committee, Nomination & Remuneration Committee, Stakeholders Relationship Committee, Risk Management Committee, and CSR Committee following these changes.",
            "Sentiment": "neutral",
            "PublishDate": 1758801063378,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCL Industries Announces Release of Pledged Equity Shares by Promoter",
            "Summary": "NCL Industries Limited disclosed the release of equity shares that were pledged by a promoter. The company submitted the required disclosure under SEBI regulations regarding substantial acquisition of shares and takeovers. The disclosure was filed with both BSE and NSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1758511544536,
            "Source": "corporate_action"
        },
        {
            "Title": "NCL Industries Promoter Group Acquires Additional Shares Through Off-Market Transactions",
            "Summary": "NCL Industries Limited disclosed share acquisitions by its promoter group entities through inter-se transfers on September 12, 2025. Kalidindi Ravi, a promoter group member, acquired 2,338 shares, increasing his holding from 2,895,641 shares (6.40%) to 2,897,979 shares (6.40%). Kakatiya Industries Private Ltd, another promoter group entity, acquired 4,676 shares, raising its stake from 86,766 shares (0.19%) to 91,442 shares (0.20%). The company's total equity share capital remains at Rs. 45.23 crore comprising 4.52 crore equity shares of Rs. 10 each. Both transactions were completed through inter-se transfers between promoter group entities.",
            "Sentiment": "neutral",
            "PublishDate": 1757936867756,
            "Source": "corporate_action"
        },
        {
            "Title": "NCL Industries Reports 59% Jump in Q1 Net Profit Despite Revenue Decline",
            "Summary": "NCL Industries reported consolidated net profit of 203 million rupees in Q1, marking a 59% increase from 128 million rupees in the same period last year. However, revenue declined to 3.4 billion rupees from 3.55 billion rupees year-over-year. The company's EBITDA grew significantly to 507 million rupees from 361 million rupees, while EBITDA margin expanded to 14.97% from 10.18% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754872120567,
            "Source": "earnings"
        },
        {
            "Title": "NCL Industries Reports Strong Q1 Results, Appoints New Independent Director as Chairperson",
            "Summary": "NCL Industries Limited approved its unaudited financial results for the quarter ended June 30, 2025, showing net profit of Rs. 20.21 crores compared to Rs. 12.94 crores in the same quarter last year. The company's revenue from operations stood at Rs. 338.47 crores. The board appointed Mrs. Renu Challu as additional Independent Director and elected her as Chairperson following the cessation of Dr. R. Kalidas and Lt. Gen (Retd) T A Dcunha's terms. Mr. NGVSG Prasad was reappointed as Executive Director & CFO for five years. The company scheduled its Annual General Meeting for September 25, 2025, through video conferencing. The board also approved the appointment of M/s A J Sharma & Associates as Secretarial Auditors for five years. Earnings per share increased to Rs. 4.47 from Rs. 2.86 in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1754667690837,
            "Source": "corporate_action"
        },
        {
            "Title": "NCL Industries Reports 59% Jump in Q1 Net Profit Despite Revenue Decline",
            "Summary": "NCL Industries reported consolidated net profit of 203 million rupees in Q1, up from 128 million rupees in the same period last year, representing a 59% increase. However, revenue declined to 3.4 billion rupees from 3.55 billion rupees year-over-year. The company's EBITDA improved significantly to 507 million rupees from 361 million rupees, while EBITDA margin expanded to 14.97% from 10.18% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754666586952,
            "Source": "earnings"
        },
        {
            "Title": "NCL Industries Promoter Group Releases Pledged Equity Shares",
            "Summary": "NCL Industries Limited disclosed the release of pledged equity shares by promoter group member Penmetsa Vara Lakshmi. The promoter released 175,000 shares (0.39% of total share capital) that were pledged as collateral security for a working capital loan with Aditya Birla Finance Limited. Following the release, Penmetsa Vara Lakshmi retains 1,000 encumbered shares (0.00% of total share capital) and holds a total of 176,355 shares (0.39% of total share capital) in the company.",
            "Sentiment": "positive",
            "PublishDate": 1753938265037,
            "Source": "corporate_action"
        },
        {
            "Title": "NCL Industries Reports Decline in Cement Production and Dispatches for Q1",
            "Summary": "NCL Industries has reported a decrease in both cement production and dispatches for the first quarter. Cement production fell by 5% year-over-year to 634,256 MT. Similarly, cement dispatches decreased by 4% year-over-year to 628,384 MT in the same period.",
            "Sentiment": "negative",
            "PublishDate": 1752106136000,
            "Source": "default"
        },
        {
            "Title": "NCL Industries Reports Decline in Cement Production and Dispatches for Q1",
            "Summary": "NCL Industries has reported a decrease in both cement production and dispatches for the first quarter. Cement production fell by 5% year-on-year to 634,256 MT, while cement dispatches decreased by 4% year-on-year to 628,384 MT in Q1.",
            "Sentiment": "negative",
            "PublishDate": 1752069486000,
            "Source": "default"
        },
        {
            "Title": "NCL Industries: Q4 Net Profit Plummets 71% Amid Revenue Decline",
            "Summary": "NCL Industries reported a 71% drop in Q4 FY2025 net profit to ₹7 crore. Revenue fell 8.5% to ₹382.9 crore. EBITDA declined 57.5% to ₹20.4 crore, with margins contracting to 5.33% from 11.47%.",
            "Sentiment": "negative",
            "PublishDate": 1748594773000,
            "Source": "earnings"
        },
        {
            "Title": "NCL Industries Reports Decline in Q4 Financial Performance",
            "Summary": "NCL Industries has reported its Q4 financial results. The company's EBITDA decreased to 209 million rupees from 488 million rupees year-over-year. The EBITDA margin fell to 5.45% from 11.67% in the same period last year. Revenue declined to 4.8 billion rupees from 5.4 billion rupees year-over-year. Net profit also decreased to 64 million rupees from 242 million rupees compared to the previous year's quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748591585000,
            "Source": "result"
        },
        {
            "Title": "NCL Industries Reports Increase in Cement Production and Sales for Q4 2025",
            "Summary": "NCL Industries has announced its cement production and sales figures for the fourth quarter of 2025. The company reported a cement production of 790,663 metric tons, representing an 8% year-over-year increase. Additionally, cement sales for the same period reached 794,096 metric tons, showing a 7% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1744677358000,
            "Source": "result"
        },
        {
            "Title": "NCL Industries Reports Increased Cement Production and Sales in Q4 2025",
            "Summary": "NCL Industries has announced its cement production and sales figures for the fourth quarter of 2025. The company reported a cement production of 790,663 MT, representing an 8% year-over-year increase. Cement sales for the same period reached 794,096 MT, showing a 7% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1744382676000,
            "Source": "result"
        },
        {
            "Title": "NCL Industries Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "NCL Industries has reported a significant decrease in its consolidated net profit for the third quarter, dropping to 30 million rupees from 250 million rupees year-over-year. The company's revenue also declined to 3.4 billion rupees from 4.3 billion rupees in the same period last year. Compared to the previous quarter, net profit showed a slight increase from 25 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739405734000,
            "Source": "earnings"
        },
        {
            "Title": "NCL Industries Reports Significant Decline in Q3 EBITDA",
            "Summary": "NCL Industries experienced a substantial decrease in its Q3 EBITDA, dropping from 569 million rupees to 193 million rupees year-over-year. The company's EBITDA margin also contracted significantly, falling from 13.14% to 5.65% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739374043000,
            "Source": "earnings"
        },
        {
            "Title": "NCL Industries Reports Significant Decline in Q3 Profit and Revenue",
            "Summary": "NCL Industries has reported a substantial decrease in its consolidated net profit for the third quarter, dropping to 30 million rupees from 250 million rupees year-over-year. The company's revenue also declined to 3.4 billion rupees from 4.3 billion rupees in the same period last year. Compared to the previous quarter, net profit showed a slight increase from 25 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739373946000,
            "Source": "earnings"
        },
        {
            "Title": "NCL Industries Reports 12% Decline in Cement Production for Q3",
            "Summary": "NCL Industries has announced a 12% decrease in cement production for the third quarter compared to the same period in the previous year. This decline in production could potentially impact the company's financial performance and market position in the cement industry.",
            "Sentiment": "negative",
            "PublishDate": 1736727717000,
            "Source": "earnings"
        },
        {
            "Title": "NCL Industries: Cement Production Drops, Doors Segment Surges in Q3",
            "Summary": "NCL Industries reported a 12% YoY decline in cement production to 6.61 lakh tonnes in Q3. Cement dispatches fell 11% YoY. Cement board production and dispatches decreased by 3% and 5% respectively. The doors segment showed strong growth with a 39% YoY increase in production and sales to 8,680 units.",
            "Sentiment": "neutral",
            "PublishDate": 1736512707000,
            "Source": "result"
        },
        {
            "Title": "NCL Industries Reports 12% Decline in Cement Production for Q3",
            "Summary": "NCL Industries has announced that its cement production decreased by 12% in the third quarter compared to the same period in the previous year. This decline in production could potentially impact the company's financial performance for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1736510644000,
            "Source": "earnings"
        },
        {
            "Title": "NCL Industries Reports Q2 Revenue Decline",
            "Summary": "NCL Industries has reported a revenue of 3.3 billion rupees for the second quarter, down from 3.9 billion rupees in the same quarter last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731055361000,
            "Source": "result"
        },
        {
            "Title": "NCL Industries Reports Decline in Q2 EBITDA and Margin",
            "Summary": "NCL Industries has reported a decrease in its second quarter EBITDA, which fell to 235 million rupees from 391 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 7.11% from 9.08% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731055352000,
            "Source": "result"
        },
        {
            "Title": "NCL Industries Reports Significant Drop in Q2 Net Profit",
            "Summary": "NCL Industries has reported a consolidated net profit of 25 million rupees for the second quarter, marking a substantial decrease from 136 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731055303000,
            "Source": "result"
        },
        {
            "Title": "NCL Industries Reports Decline in Cement Production and Dispatches",
            "Summary": "<p>NCL Industries has reported a <span class='negative'>10% year-over-year decrease</span> in both <b>cement production</b> and <b>dispatches</b> for the <span class='neutral'>September quarter</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728392288000,
            "Source": "result"
        }
    ]
}