{
    "Symbol": "NDL",
    "ISIN": "INE875G01048",
    "News": [
        {
            "Title": "Nandan Denim Q3FY26 Results: Revenue Falls 46%",
            "Summary": "Nandan Denim reported Q3FY26 revenue of ₹49,952.72 lakhs, down 46% YoY from ₹92,615.23 lakhs. Net profit declined 55% to ₹297.29 lakhs versus ₹658.00 lakhs in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1770903628712,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nandan Denim Gets Credit Ratings Reaffirmation",
            "Summary": "Nandan Denim Limited receives reaffirmation of credit ratings from Infomerics Ratings for bank facilities worth ₹339.74 crores, maintaining stable outlook across long-term and short-term instruments.",
            "Sentiment": "positive",
            "PublishDate": 1767003376071,
            "Source": "stocks"
        },
        {
            "Title": "Nandan Denim Receives Penalty Notices from BSE and NSE for Regulatory Non-Compliance",
            "Summary": "Nandan Denim Limited received penalty notices of Rs.84,000 (excluding GST) each from BSE and NSE for alleged violation of SEBI regulation 17(1A) related to director appointment documentation. The company clarified that a clerical error in board meeting outcome dated August 06, 2025 was rectified the same day and Mr. Ambalal C. Patel was properly appointed as Independent Director effective September 17, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1764404402248,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nandan Denim Reports Quarterly Financial Results for Quarter Ended September 30, 2025",
            "Summary": "Nandan Denim Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs. 78,468.97 lakhs for the quarter, compared to Rs. 85,025.08 lakhs in the same quarter of the previous year. Net profit for the quarter was Rs. 831.06 lakhs versus Rs. 1,626.88 lakhs in the corresponding quarter last year. For the half year, revenue from operations stood at Rs. 1,83,236.71 lakhs compared to Rs. 1,57,187.37 lakhs in the previous half year, with net profit of Rs. 2,313.39 lakhs against Rs. 3,344.85 lakhs last year. Basic earnings per share for the quarter was Rs. 0.057 compared to Rs. 0.113 in the same quarter last year. The company operates in the textiles segment and has a paid-up equity share capital of Rs. 14,414.73 lakhs with face value of Re. 1 per share.",
            "Sentiment": "negative",
            "PublishDate": 1763028970805,
            "Source": "earnings"
        },
        {
            "Title": "Nandan Denim's Independent Director Giraj Mohan Sharma Retires After Completing Two Terms",
            "Summary": "Giraj Mohan Sharma, Non-Executive Independent Director of Nandan Denim Limited, is retiring from the board effective September 28, 2025, after completing two terms of 5 years each. The company acknowledged his valuable contribution and guidance during his tenure as Independent Director. Shaktidan Gadhavi, Whole-Time Director, signed the disclosure notice.",
            "Sentiment": "neutral",
            "PublishDate": 1758971230883,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nandan Denim Appoints Two Independent Directors and New Secretarial Auditor, Reports Q1 FY2026 Results",
            "Summary": "Nandan Denim Limited's Board approved the appointment of Mr. Suresh Chatterjee and Mr. Ambalal Patel as Additional Directors in Independent Capacity for five-year terms, subject to shareholder approval. Mr. Chatterjee brings 25 years of finance experience in public financial institutions and private sector, while Mr. Patel has extensive background with Gujarat Industrial Investment Corporation Ltd. spanning over 30 years. The Board also appointed M/s. J.D. Khatnani & Associates as Secretarial Auditor for five consecutive years and approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 1,04,767.74 lakhs and total income of Rs. 1,04,921.48 lakhs for the quarter. Both director appointments are effective from August 06, 2025, and neither appointee has inter-se relations with existing Board members.",
            "Sentiment": "positive",
            "PublishDate": 1754468770723,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nandan Denim Approves Q1 Results and Appoints New Secretarial Auditor and Two Independent Directors",
            "Summary": "Nandan Denim Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 1,04,767.74 lakhs for the quarter. The Board appointed M/s. J.D. Khatnani & Associates as Secretarial Auditor for five consecutive years. Two new Independent Directors were appointed for five-year terms: Mr. Suresh Chatterjee, a finance professional with 25 years of experience in public financial institutions and private sector, and Mr. Ambalal Patel, who has extensive experience with Gujarat Industrial Investment Corporation Ltd. and has served as nominee director on various company boards. Both director appointments are subject to member approval. The company operates in the textiles segment and had previously completed a share subdivision from Rs 10 face value to Rs 1 face value shares.",
            "Sentiment": "neutral",
            "PublishDate": 1754468041637,
            "Source": "earnings"
        },
        {
            "Title": "Nandan Denim Reports Mixed Q1 Results with Revenue Growth but Margin Decline",
            "Summary": "Nandan Denim reported Q1 results showing revenue growth to 10.5 billion rupees from 7.20 billion rupees year-over-year. Net profit increased to 112 million rupees compared to 75 million rupees in the same period last year. However, EBITDA remained relatively flat at 324 million rupees versus 322 million rupees year-over-year, while EBITDA margin declined to 3.1% from 4.47% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754466955686,
            "Source": "earnings"
        },
        {
            "Title": "Nandan Denim Schedules Board Meeting for August 6, 2025 to Approve Quarterly Financial Results",
            "Summary": "Nandan Denim Limited has scheduled a Board of Directors meeting for August 6, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025. The company's trading window for securities has been closed since July 1, 2025 and will remain closed until 48 hours after the results are announced to stock exchanges. The meeting notification was signed by Shaktidan Gadhavi, Whole-Time Director, and communicated to BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753855538467,
            "Source": "corporate_action"
        },
        {
            "Title": "Nandan Denim Reports Mixed Q2 Financial Results",
            "Summary": "Nandan Denim has released its Q2 financial results. The company's EBITDA increased to 325.5 million rupees from 266.7 million rupees year-over-year. However, the EBITDA margin decreased to 3.83% from 6.44% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730102639000,
            "Source": "result"
        },
        {
            "Title": "Nandan Denim Reports Q2 Profit and Revenue Growth",
            "Summary": "Nandan Denim has announced its Q2 financial results. The company's net profit increased to 88 million rupees from 82 million rupees year-over-year. Revenue saw significant growth, reaching 8 billion rupees compared to 4.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730102535000,
            "Source": "result"
        }
    ]
}