{
    "Symbol": "NDLVENTURE",
    "ISIN": "INE353A01023",
    "News": [
        {
            "Title": "NDL Ventures Q3 FY26 Net Profit Surges 253.72%",
            "Summary": "NDL Ventures Limited reported net profit of ₹23.32 lakhs for Q3 FY26, marking a significant 253.72% YoY growth. Nine-month profit reached ₹75.85 lakhs, up 68.26% from previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768824022122,
            "Source": "co_actions_results"
        },
        {
            "Title": "NDL Ventures Approves Merger With Hinduja Leyland Finance",
            "Summary": "NDL Ventures has approved a merger with Hinduja Leyland Finance, with shareholders receiving 25 NDL shares for every 10 shares they currently hold. The merger is scheduled to become effective on April 1, 2026, consolidating the two financial entities.",
            "Sentiment": "positive",
            "PublishDate": 1764125004540,
            "Source": "corporate_action"
        },
        {
            "Title": "NDL Ventures Re-appoints Shah and Modi as Internal Auditor",
            "Summary": "NDL Ventures Limited's Board of Directors approved the re-appointment of M/s. Shah and Modi as the company's Internal Auditor on November 25, 2025, following completion of their existing tenure. The Mumbai-based accounting firm, founded in 1987, specializes in FEMA advisory, international taxation, transfer pricing, and internal audits.",
            "Sentiment": "neutral",
            "PublishDate": 1764087467939,
            "Source": "corporate_governance"
        },
        {
            "Title": "NDL Ventures Closes Trading Window Ahead of Board Meeting on Merger with Hinduja Leyland Finance",
            "Summary": "NDL Ventures Limited has closed its trading window from November 20, 2025, for all designated persons and their immediate relatives ahead of a board meeting scheduled for November 25, 2025. The board meeting will consider and approve a scheme of merger by absorption of Hinduja Leyland Finance Limited with NDL Ventures under the Companies Act 2013, with the trading window remaining closed until 48 hours after the outcome declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1763652207226,
            "Source": "corporate_action"
        },
        {
            "Title": "NDL Ventures Reports Quarterly Financial Results for September 2025",
            "Summary": "NDL Ventures Limited (formerly NXTDIGITAL Limited) announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved these results at their meeting held on October 24, 2025. The company's statutory auditors, S.K. Patodia & Associates LLP, issued an unmodified limited review report on the financial results. The company maintains a paid-up equity share capital of Rs. 3,367.17 lakhs with a face value of Rs. 10 per share. The results were prepared in accordance with Indian Accounting Standards and SEBI listing regulations. Additionally, the company received a No Objection Certificate from the Reserve Bank of India for its proposed merger scheme with Hinduja Leyland Finance Limited, which was communicated to stock exchanges on August 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761319806566,
            "Source": "earnings"
        },
        {
            "Title": "NDL Ventures Surges 61% on RBI Approval for NBFC Merger",
            "Summary": "NDL Ventures, the media arm of the Hinduja Group in India, has gained 61% over two days following news of RBI approval for a merger. The company received a no-objection certificate from the Reserve Bank of India to merge Hinduja Leyland Finance Ltd. (HLFL) with itself. The stock surge reflects investor optimism about the company's prospects of obtaining an NBFC licence through this merger.",
            "Sentiment": "positive",
            "PublishDate": 1755083084110,
            "Source": "stock"
        },
        {
            "Title": "NDL Ventures Receives RBI Approval for Hinduja Leyland Finance Merger",
            "Summary": "NDL Ventures Limited has received a No Objection Certificate from the Reserve Bank of India for the proposed merger of Hinduja Leyland Finance Limited into NDL Ventures Limited. The company will now proceed with subsequent steps to implement the merger scheme, including completion of statutory filings, obtaining remaining consents, and implementation as per approved terms.",
            "Sentiment": "positive",
            "PublishDate": 1754914100344,
            "Source": "order&deals"
        },
        {
            "Title": "NDL Ventures Sets August 22, 2025 as Record Date for Final Dividend and AGM Voting",
            "Summary": "NDL Ventures Limited has announced August 22, 2025 as the record date for determining shareholder eligibility for multiple purposes. Shareholders will be eligible for a final dividend of Re. 0.50 per equity share for FY 2024-25. The same record date will determine shareholders entitled to participate in the company's 40th Annual General Meeting through remote e-voting or voting at the meeting venue. The company, formerly known as NXTDIGITAL Limited, trades on BSE under scrip code 500189 and on NSE under the symbol NDLVENTURE.",
            "Sentiment": "neutral",
            "PublishDate": 1754407272414,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities Reports 15x Jump in Quarterly Net Profit to Rs 1,210 Lakhs",
            "Summary": "Prime Securities Limited reported consolidated net profit of Rs 1,210 lakhs for the quarter ended June 30, 2025, compared to Rs 80 lakhs in the same quarter last year, representing a significant increase. Total income from operations rose to Rs 4,691 lakhs from Rs 1,271 lakhs year-over-year. On standalone basis, the company posted net profit of Rs 814 lakhs versus Rs 78 lakhs in the previous year quarter, with total income increasing to Rs 1,602 lakhs from Rs 489 lakhs. Basic earnings per share on consolidated basis improved to Rs 3.62 from Rs 0.29 in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753376631978,
            "Source": "earnings"
        },
        {
            "Title": "NDL Ventures Appoints Rupal D. Jhaveri as Secretarial Auditor for Five-Year Term",
            "Summary": "NDL Ventures Limited's Board of Directors approved the appointment of M/s. Rupal D. Jhaveri, Practicing Company Secretary, as the company's Secretarial Auditor for five consecutive years from FY 2025-2026 to FY 2029-30. The appointment is subject to shareholder approval at the 40th Annual General Meeting scheduled for August 29, 2025. Rupal D. Jhaveri is a proprietorship firm of practicing company secretaries established in 2001, providing statutory compliance services under the Companies Act, Foreign Exchange Management Act, listing compliances, mergers and acquisitions, and IPOs for over 20 years with a diverse client base across India.",
            "Sentiment": "neutral",
            "PublishDate": 1753187443089,
            "Source": "corporate_governance"
        },
        {
            "Title": "NDL Ventures Re-appoints Amar Chintopanth as Whole-time Director for Two Years",
            "Summary": "NDL Ventures Limited's Board of Directors approved the re-appointment of Mr. Amar Chintopanth as Whole-time Director for a two-year term from September 04, 2025 to September 03, 2027. The decision was made based on the Nomination and Remuneration Committee's recommendation and is subject to shareholder approval at the company's 40th Annual General Meeting. Chintopanth, a Chartered Accountant with over 40 years of experience, has held leadership roles at organizations including ITC Classic Finance Ltd., Polaris Software Limited, and 3i Infotech Limited. He joined the Hinduja Group in 2014 and has handled operational, corporate, and supervisory roles. The re-appointment comes as his current two-year term expires.",
            "Sentiment": "positive",
            "PublishDate": 1753185669908,
            "Source": "corporate_governance"
        },
        {
            "Title": "NDL Ventures Board Approves Re-appointment of S K Patodia & Associates as Statutory Auditors for Second Five-Year Term",
            "Summary": "NDL Ventures Limited's Board of Directors approved the re-appointment of M/s. S K Patodia & Associates, LLP as Statutory Auditors for a second consecutive five-year term. The re-appointment follows the completion of their first term, which ends at the upcoming 40th Annual General Meeting scheduled for August 29, 2025. The new term will run from the conclusion of the 40th AGM until the conclusion of the 45th AGM, subject to shareholder approval. S K Patodia & Associates is a chartered accountancy firm with over 33 years of experience in audit assurance and taxation, operating with a team of qualified professionals.",
            "Sentiment": "neutral",
            "PublishDate": 1753184371330,
            "Source": "corporate_governance"
        },
        {
            "Title": "NDL Ventures: Q3 Profit Plummets 80.56% Year-over-Year",
            "Summary": "NDL Ventures reported Q3 FY25 results with profit at ₹0.07 crore, down 80.56% YoY. Revenue remained at ₹0 crore. EPS decreased to ₹0.02, a 80% YoY decline. Operating income fell by 15.05% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737695978000,
            "Source": "earnings"
        }
    ]
}