{
    "Symbol": "NDRAUTO",
    "ISIN": "INE07OG01012",
    "News": [
        {
            "Title": "NDR Auto Components Q3 FY25 Results Published",
            "Summary": "NDR Auto Components Limited published its unaudited financial results for the quarter and nine months ended December 31, 2025, in compliance with SEBI regulations. The results were published in Financial Express and Jansatta newspapers on February 05, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770271422145,
            "Source": "co_actions_results"
        },
        {
            "Title": "NDR Auto Components Board Meet Set for Feb 4, 2026",
            "Summary": "NDR Auto Components Limited has scheduled its board meeting for February 4, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1769662649148,
            "Source": "co_actions_results"
        },
        {
            "Title": "NDR Auto Components Files Q3 FY26 Compliance Certificate",
            "Summary": "NDR Auto Components Limited submitted its quarterly compliance certificate under SEBI regulations for Q3 FY26 ended December 31, 2025, confirming proper dematerialization processes.",
            "Sentiment": "neutral",
            "PublishDate": 1767764459261,
            "Source": "stocks"
        },
        {
            "Title": "NDR Auto Gets IT Orders Worth ₹47.52L Penalty",
            "Summary": "NDR Auto Components receives three Income Tax orders including ₹47.52 lakh penalty for AY 2021-22, while penalty proceedings for AY 2023-24 and 2024-25 dropped. Company plans appeal.",
            "Sentiment": "negative",
            "PublishDate": 1767608257820,
            "Source": "stocks"
        },
        {
            "Title": "NDR Auto Components Reports Strong Q2 FY26 Results, Signs Two Technology Transfer Agreements",
            "Summary": "NDR Auto Components delivered robust quarterly performance with total income of INR 200.76 crore (14.35% growth), EBITDA of INR 22.58 crore (20.77% growth), and PAT of INR 14.85 crore (24.29% growth). The company signed two Technology License Agreements for Seat Belt Reminder sensors with Fujikura Ltd (INR 7.43 crore investment) and physical latches for car seats with Fisher Dynamics (INR 17.43 crore investment), each expected to generate INR 30-40 crore annual revenue.",
            "Sentiment": "positive",
            "PublishDate": 1764044463907,
            "Source": "earnings"
        },
        {
            "Title": "NDR Auto Components Limited Submits Unaudited Financial Results for Quarter and Six Months Ended September 30, 2025",
            "Summary": "NDR Auto Components Limited has submitted its unaudited financial results for the quarter and six months ended September 30, 2025 to BSE Limited and National Stock Exchange of India. The results were published in newspapers on November 7, 2025, in Financial Express (English) and Jansatta (Hindi). The financial results were approved by the Board of Directors in their meeting held on November 6, 2025. The submission was made under Regulation 47 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1762493047748,
            "Source": "earnings"
        },
        {
            "Title": "NDR Auto Reports Q2 Revenue Growth to 2 Billion Rupees",
            "Summary": "NDR Auto reported quarterly revenue of 2 billion rupees compared to 1.7 billion rupees in the same period last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1762409171875,
            "Source": "earnings"
        },
        {
            "Title": "NDR Auto Reports Strong Q2 Results and Approves Two New Manufacturing Projects",
            "Summary": "NDR Auto reported quarterly consolidated net profit of 148 million rupees compared to 119 million rupees year-over-year. The company's EBITDA reached 246 million rupees versus 194 million rupees year-over-year, with EBITDA margin improving to 12.31% from 11.13%. The board approved two new manufacturing projects: production of seat belt reminder systems at their Gujarat facility in collaboration with Fujikura Ltd, and manufacturing of seating latches in Gurugram with Fisher Dynamics collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1762408121655,
            "Source": "stock"
        },
        {
            "Title": "NDR Auto Components Incorporates Joint Venture with Hayashi Telempu for Auto Component Manufacturing",
            "Summary": "NDR Auto Components Limited has incorporated a joint venture company named NDR Hayashi Automotive India Private Limited with Hayashi Telempu. The joint venture was incorporated on October 10, 2025, with an authorized and subscribed share capital of Rs. 20 crore each. NDR Auto Components holds a 50% shareholding by subscribing to 1 crore equity shares worth Rs. 10 crore. The joint venture will manufacture auto components including Ambient Light, Carpet, Dash Inner, Rear Shade, and Tonner Cover for OEMs in India and for export. The joint venture operates in the auto components industry and has its registered office in Delhi. The consideration for the investment was made in cash, and the joint venture has become a related party of NDR Auto Components.",
            "Sentiment": "positive",
            "PublishDate": 1760339180840,
            "Source": "order&deals"
        },
        {
            "Title": "Rohit Relan Family Trust to Acquire 73.13% Stake in NDR Auto Components Through SEBI-Exempted Inter-Family Transfer",
            "Summary": "Rohit Relan Family Trust plans to acquire 1,73,95,361 equity shares representing 73.13% of NDR Auto Components Limited on or after September 26, 2025. The acquisition involves transferring shares from existing promoters including Rohit Relan, Ritu Relan, Ayush Relan, Pranav Relan, and Rishabh Relan to the family trust without any consideration through gift deeds. SEBI granted exemption from open offer requirements under order WTM/KCV/CFD/02/2025-26 dated August 13, 2025, recognizing this as internal reorganization for succession planning within the promoter family. The trust's trustees and beneficiaries comprise family members and their lineal descendants. Post-acquisition, the promoter group shareholding will remain at 73.13% with public shareholding unchanged at 26.87%. NDR Auto Components, incorporated in March 2019, operates in the auto components sector with shares listed on BSE and NSE. The transaction requires no effective change in company control and maintains compliance with minimum public shareholding requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1758516923265,
            "Source": "corporate_action"
        },
        {
            "Title": "NDR Auto Components Reports 7.97% Revenue Growth in Q1 FY26, Plans Rs 27.29 Crore Investment for New KIA Facility",
            "Summary": "NDR Auto Components Limited reported total income of Rs 185.81 crore for Q1 FY26, representing a 7.97% year-on-year increase. The auto component manufacturer, which supplies to Maruti Suzuki and KIA, achieved EBITDA of Rs 20.46 crore (up 16.98% YoY) with an 11.01% margin and PAT of Rs 13.6 crore (up 17.87% YoY). The company has approved establishing a new metal frames and seat covers facility at Anantpur for KIA with an investment of Rs 27.29 crore over two years, expected to commence production in Q2 2026 with peak revenue potential of Rs 80-100 crore. New projects including KIA, sunshades and e-Vitara generated around Rs 10 crore in Q1, with potential quarterly revenue of Rs 40-60 crore. However, the company faced delays due to Maruti Suzuki deferring e-Vitara production, lower KIA uptake, and slower sunshade order ramp-up. Management expects normalization in the second half of the fiscal year and is exploring opportunities with Toyota expected to start in H2 FY29.",
            "Sentiment": "positive",
            "PublishDate": 1755599148220,
            "Source": "earnings"
        },
        {
            "Title": "NDR Auto Components Approves Rs 27.29 Crore Manufacturing Facility in Andhra Pradesh",
            "Summary": "NDR Auto Components Limited's Board approved quarterly financial results for the quarter ended June 30, 2025, with auditors providing a clean report without qualifications. The company approved setting up a new manufacturing facility in Anantapur, Andhra Pradesh, with an investment of Rs 27.29 crore over two financial years. The facility will produce frame structures (50,000 sets for 5-seater cars) and seat covers (78,000 sets for 7-seater cars), expected to be operational by August 2026. The Board also approved incorporating a wholly-owned subsidiary 'NDR Auto Components South Private Limited' with Rs 1 crore initial capital to operate the new facility. Additionally, the company entered into an office space agreement in New Delhi's Aerocity for Rs 11.25 crore, covering 7,500 sq ft with a term extending up to May 2066. A CSR Trust will be created jointly with associate company Bharat Seats Limited for corporate social responsibility activities.",
            "Sentiment": "positive",
            "PublishDate": 1754899016348,
            "Source": "stock"
        },
        {
            "Title": "NDR Auto Reports Strong Q1 Performance with Revenue Growth to 1.85B Rupees",
            "Summary": "NDR Auto delivered improved quarterly results with revenue rising to 1.85 billion rupees compared to 1.7 billion rupees in the same period last year. EBITDA increased to 223 million rupees from 187 million rupees year-over-year, while EBITDA margin expanded to 12.03% from 10.9%. Consolidated net profit grew to 136 million rupees versus 115 million rupees in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1754898039252,
            "Source": "earnings"
        },
        {
            "Title": "NDR Auto Reports Strong Q4 Results and Declares Dividend",
            "Summary": "NDR Auto announced its Q4 financial results, showing significant year-over-year improvements. Revenue increased to 1.92 billion rupees from 1.76 billion. EBITDA rose to 242 million rupees from 185 million, with EBITDA margin expanding to 12.59% from 10.5%. Consolidated net profit grew to 164 million rupees from 116 million. The company also declared a dividend of 2.75 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746777374000,
            "Source": "result"
        },
        {
            "Title": "NDR Auto Reports Q3 Revenue Growth",
            "Summary": "NDR Auto has announced its third-quarter revenue, which stands at 1.75 billion rupees. This represents a significant increase from the 1.4 billion rupees reported in the same quarter of the previous year, indicating year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1739264696000,
            "Source": "earnings"
        },
        {
            "Title": "NDR Auto Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "NDR Auto has announced its financial results for the third quarter, reporting a consolidated net profit of 134 million rupees. This represents a substantial year-over-year increase from the previous year's figure of 85 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739264569000,
            "Source": "earnings"
        },
        {
            "Title": "NDR Auto to Consider Q3 Results on February 11",
            "Summary": "NDR Auto has announced that it will consider its third quarter (Q3) financial results on February 11. This indicates the company is preparing to review and potentially approve its quarterly financial performance before public disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1738672599000,
            "Source": "earnings"
        },
        {
            "Title": "NDR Auto Reports Strong Q2 EBITDA Growth",
            "Summary": "NDR Auto has announced its Q2 financial results, showing significant improvement in EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA increased to 194 million rupees, up from 62 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 11.13% from 3.93% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730879292000,
            "Source": "result"
        },
        {
            "Title": "NDR Auto Reports Q2 Revenue Growth",
            "Summary": "NDR Auto has announced its second quarter revenue of 1.7 billion rupees, compared to 1.58 billion rupees in the same quarter last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730879186000,
            "Source": "result"
        },
        {
            "Title": "NDR Auto Reports Increased Q2 Consolidated Net Profit",
            "Summary": "NDR Auto has reported a consolidated net profit of 119 million rupees for the second quarter, up from 103 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730879160000,
            "Source": "result"
        },
        {
            "Title": "NDR Auto Components Acquires Land for Expansion",
            "Summary": "<p><span class=\"positive\">NDR Auto Components</span> has <span class=\"positive\">approved</span> the <b>acquisition</b> of <span class=\"neutral\">25 acres</span> of land for <span class=\"positive\">future expansion</span> at a cost of <span class=\"neutral\">Rs. 37.63 crore</span>. This move indicates the company's plans for <span class=\"positive\">growth</span> and <span class=\"positive\">increased production capacity</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728022415000,
            "Source": "corporate_action"
        }
    ]
}