{
    "Symbol": "NDTV",
    "ISIN": "INE155G01029",
    "News": [
        {
            "Title": "NDTV Updates Key Personnel Authorization Matrix",
            "Summary": "New Delhi Television Limited revises authorization for Key Managerial Personnel to determine materiality of events and make stock exchange disclosures under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769615124535,
            "Source": "stocks"
        },
        {
            "Title": "NDTV Reports Q3FY26 Loss Amid Revenue Growth",
            "Summary": "New Delhi Television Limited posted a consolidated net loss of ₹8,025 lakhs for Q3FY26, despite revenue from operations rising to ₹15,041 lakhs. The company completed a rights issue raising ₹39,649 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1769613617068,
            "Source": "co_actions_results"
        },
        {
            "Title": "NDTV Surrenders MIB Permission for Three HD Channels",
            "Summary": "New Delhi Television Limited voluntarily surrenders Ministry of Information & Broadcasting permission for three proposed HD news channels - NDTV INDIA HD, NDTV 24x7 HD, and NDTV PROFIT HD following strategic assessment.",
            "Sentiment": "neutral",
            "PublishDate": 1769016578011,
            "Source": "stocks"
        },
        {
            "Title": "Delhi HC Quashes I-T Notices Against NDTV Founders",
            "Summary": "Delhi High Court quashes 2016 Income Tax notices against NDTV founders Prannoy Roy and Radhika Roy related to RRPR Holding Pvt Ltd transactions, providing relief to the media company's leadership.",
            "Sentiment": "positive",
            "PublishDate": 1768800524588,
            "Source": "stocks"
        },
        {
            "Title": "NDTV Receives GST Scrutiny Notices Worth ₹33.94 Cr",
            "Summary": "New Delhi Television receives GST scrutiny notices for FY23-24 alleging excess ITC claims and short tax payments totaling ₹33.94 crore across two financial years.",
            "Sentiment": "negative",
            "PublishDate": 1767895216925,
            "Source": "stocks"
        },
        {
            "Title": "NDTV Board Meeting Set for January 28, 2026",
            "Summary": "New Delhi Television Limited announces board meeting on January 28, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 1-31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767708967576,
            "Source": "co_actions_results"
        },
        {
            "Title": "NDTV Re-files Compounding Applications with RBI",
            "Summary": "New Delhi Television Limited has re-filed its compounding applications with the Reserve Bank of India on December 15, 2025, following developments in Special Leave Petition proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1765814786199,
            "Source": "stocks"
        },
        {
            "Title": "NDTV Seeks Shareholder Approval for Independent Director Viral Doshi's Second Term",
            "Summary": "New Delhi Television Limited has issued a postal ballot notice for shareholders to vote on re-appointing Viral Jagdish Doshi as Independent Director for a second three-year term from January 24, 2026 to January 23, 2029. The remote e-voting process will run from November 27, 2025 to December 26, 2025, with the Board recommending approval based on his performance and valuable contributions during his current tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1764075556885,
            "Source": "corporate_action"
        },
        {
            "Title": "New Delhi Television Reports Wider Q2 Net Loss of 741M Rupees Despite Revenue Growth",
            "Summary": "New Delhi Television reported a consolidated net loss of 741 million rupees in Q2, compared to a loss of 528 million rupees in the same period last year. The company's revenue increased to 1.2 billion rupees from 1.1 billion rupees year-over-year. EBITDA loss widened to 569 million rupees versus a loss of 433 million rupees in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1761749956950,
            "Source": "earnings"
        },
        {
            "Title": "RRPR Holding Sells 3.35% Stake in New Delhi Television While Vishvapradhan Commercial Increases Holdings to 9.17%",
            "Summary": "RRPR Holding Private Limited, a promoter of New Delhi Television Limited, sold 3,10,81,525 shares representing 3.35% of the company's total share capital through a rights issue on October 10, 2025. Following the transaction, RRPR Holding's shareholding increased from 56.45% to 59.80% due to participation in the rights issue. Simultaneously, Vishvapradhan Commercial Private Limited, another promoter entity, acquired 50,71,346 shares (0.9%) through the same rights issue, raising its total shareholding from 8.27% to 9.22%. New Delhi Television's total equity share capital expanded from 6,44,71,267 shares to 11,28,24,717 shares following the rights issue. Both companies are listed on BSE Ltd and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760365317405,
            "Source": "corporate_action"
        },
        {
            "Title": "NDTV Raises ₹396.49 Crore Through Oversubscribed Rights Issue",
            "Summary": "NDTV successfully completed its rights issue, raising ₹396.49 crore with oversubscription of 1.11 times. The issue received applications for 5.36 crore shares against 4.83 crore shares offered. Following the allotment, NDTV's equity share capital increased from 6.45 crore shares to 11.28 crore shares. Promoters' shareholding rose from 64.71% to 69.02%, while public shareholding stands at 30.98%. The proceeds will be used to expand distribution footprint in India and internationally, invest in brand-building, reduce debt, and fund new intellectual properties and general corporate purposes. CEO Rahul Kanwal stated the oversubscription reflects shareholder confidence in NDTV's vision and will help strengthen platforms and broaden reach. SBI Capital Markets Limited acted as advisor, with Cyril Amarchand Mangaldas as legal counsel and Kfin Technologies Limited as registrar.",
            "Sentiment": "positive",
            "PublishDate": 1760171411823,
            "Source": "corporate_action"
        },
        {
            "Title": "NDTV Completes Amalgamation with Four Subsidiaries, Authorized Share Capital Increases to Rs 2,367 Crore",
            "Summary": "New Delhi Television Limited (NDTV) announced that its amalgamation scheme with four subsidiary companies - NDTV Networks Limited, NDTV Worldwide Limited, NDTV Media Limited and NDTV Labs Limited - became effective on October 1, 2025. The company filed the confirmation order with the Registrar of Companies on the same date. As a result of this merger, NDTV's authorized share capital will increase to Rs 2,36,77,00,000, divided into 59,19,25,000 equity shares of Rs 4 each. The scheme was previously sanctioned on September 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759341756102,
            "Source": "corporate_action"
        },
        {
            "Title": "NDTV Launches Live Entertainment Venture 'NDTV Good Times' with Celebrity Concerts",
            "Summary": "NDTV announced the launch of NDTV Good Times, a new live entertainment and cultural experiences platform. The venture will feature concerts by prominent artists including AR Rahman performing at Varanasi's Ganges ghats, Sonu Nigam presenting a Mohammed Rafi tribute at Dal Lake in Srinagar, and performances by Shankar-Ehsaan-Loy, Jubin Nautiyal, and Neha Kakkar across multiple cities. CEO Rahul Kanwal stated the initiative extends NDTV's storytelling commitment into live culture and experiences. The company has partnered with District as its ticketing partner and plans to leverage its broadcast, digital, and social media platforms to amplify these live experiences.",
            "Sentiment": "positive",
            "PublishDate": 1758638491418,
            "Source": "stock"
        },
        {
            "Title": "NDTV: Tax Authority Drops Proceedings Against Company",
            "Summary": "Tax authorities have dropped proceedings that were initiated against NDTV.",
            "Sentiment": "positive",
            "PublishDate": 1758500534629,
            "Source": "stock"
        },
        {
            "Title": "NDTV Acquires GoodTimes Channel Business for Up to Rs 18 Crore",
            "Summary": "NDTV's Board of Directors approved the acquisition of the GoodTimes Channel business undertaking from Lifestyle & Media Broadcasting Limited through a slump sale. The company executed a binding Term Sheet for the transaction valued at up to Rs 18 crore on a cash-free debt-free basis. The consideration includes cash and television advertising inventory. LMBL is a joint venture of NDTV, making this a related party transaction conducted on an arm's length basis with registered valuer assessment. The acquisition requires regulatory approval from the Ministry of Information and Broadcasting for the television channel license transfer. The transaction is expected to complete within approximately three months, subject to statutory approvals and customary conditions. NDTV stated the acquisition will strengthen its strategic positioning, diversify operational capabilities, and enhance long-term stakeholder value in the lifestyle-focused broadcasting segment.",
            "Sentiment": "positive",
            "PublishDate": 1758295679103,
            "Source": "order&deals"
        },
        {
            "Title": "NDTV: Tax Authority Ends Proceedings Against Company",
            "Summary": "Tax authorities have concluded proceedings against NDTV.",
            "Sentiment": "positive",
            "PublishDate": 1758280037919,
            "Source": "stock"
        },
        {
            "Title": "NDTV Launches Rs 400 Crore Rights Issue to Fund Expansion and Debt Reduction",
            "Summary": "New Delhi Television Ltd. opened its rights issue on September 22 to raise Rs 396.5 crore from eligible shareholders. The company will issue up to 48,353,450 equity shares at Rs 82 per share, with a ratio of three rights shares for every four shares held. The record date was September 12, and the issue closes on October 8, 2025. NDTV plans to use the funds for expanding distribution domestically and internationally, brand-building, developing new intellectual properties, reducing debt, and general corporate purposes. CEO Rahul Kanwal stated this will strengthen NDTV for its next growth phase and help explore new digital opportunities. NDTV operates as a division of AMG Media Networks Ltd., a wholly owned subsidiary of Adani Enterprises Ltd. The stock traded 0.8% lower at Rs 125.65 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1758101627246,
            "Source": "corporate_action"
        },
        {
            "Title": "NDTV Receives Regional Director Approval for Amalgamation Scheme",
            "Summary": "New Delhi Television Limited received a Confirmation Order from the Regional Director sanctioning the Scheme of Amalgamation between NDTV Networks Limited, NDTV Worldwide Limited, NDTV Media Limited, NDTV Labs Limited, and New Delhi Television Limited. The order was dated September 12, 2025, and came from the Regional Director, Northern Region, Ministry of Corporate Affairs, Delhi. The amalgamation scheme was previously approved by the Board of Directors of all involved companies under Sections 233 of the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1757772349646,
            "Source": "corporate_action"
        },
        {
            "Title": "NDTV Approves Rights Issue to Raise Up to ₹4 Billion",
            "Summary": "NDTV has approved the issuance of equity shares worth up to 4 billion rupees through a rights offering. This corporate action will allow existing shareholders to purchase additional shares in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1757340595642,
            "Source": "corporate_action"
        },
        {
            "Title": "JLR Hit by Cyber Attack; NDTV Approves ₹400 Crore Rights Issue; Adani Electricity Repurchases $44.6M Notes",
            "Summary": "Jaguar Land Rover experienced a cyber attack that disrupted vehicle production and retail activities. The company shut down systems to mitigate impact and stated no evidence of customer data theft while working to restart global applications. NDTV's board approved a ₹400 crore rights issue to strengthen its balance sheet and support growth initiatives including distribution expansion, brand-building, and debt reduction. Adani Electricity Mumbai repurchased $44.6 million of its $300 million senior secured notes using internal cash flows, reducing outstanding debt to $255.3 million. TCS expanded its partnership with Scandinavian insurer Tryg through a seven-year, €550 million digital transformation contract to standardize operations across Denmark, Sweden and Norway markets.",
            "Sentiment": "neutral",
            "PublishDate": 1756865808444,
            "Source": "stock"
        },
        {
            "Title": "NDTV Board to Meet on September 2 for Fundraising Discussions",
            "Summary": "NDTV has announced that its board of directors will convene on September 2 to discuss fundraising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1756386643495,
            "Source": "corporate_action"
        },
        {
            "Title": "NDTV Receives Stay on Income Tax Demand Recovery for Assessment Year 2008-09",
            "Summary": "New Delhi Television Limited has received a stay on the recovery of income tax demand for Assessment Year 2008-09 from the Principal Commissioner of Income Tax, pending the final disposal of their appeal before the Commissioner of Income Tax (Appeals). This follows the Supreme Court's dismissal of the company's Special Leave Petition against a Delhi High Court judgment, with liberty to raise contentions in reassessment proceedings under Section 148 of the Income-tax Act. The company had filed an appeal before the Commissioner of Income Tax (Appeals), which remains pending adjudication. The Assessing Officer had previously rejected the stay application against the demand raised under Section 147 of the Income-tax Act on June 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755017633218,
            "Source": "stock"
        },
        {
            "Title": "NDTV's Writ Petition Disposed by Delhi High Court Following CBI Case Closure",
            "Summary": "New Delhi Television Limited's Writ Petition challenging a CBI FIR has been disposed of by the Delhi High Court. The court's decision follows the acceptance of a closure report by the Rouse Avenue Court, which found no criminality or violations against any accused parties. The original CBI FIR was lodged on June 2, 2017 against the company and certain other persons. The CBI had filed a closure report which was accepted by the Rouse Avenue Court, and subsequently the Delhi High Court disposed of NDTV's Writ Petition on July 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753981358005,
            "Source": "stock"
        },
        {
            "Title": "NDTV Reports Net Loss of Rs 65.55 Crores for Quarter Ended June 30, 2025",
            "Summary": "New Delhi Television Limited reported quarterly results for the quarter ended June 30, 2025, showing a net loss of Rs 6,555 lakhs on standalone basis and Rs 7,031 lakhs on consolidated basis. Revenue from operations declined to Rs 5,040 lakhs standalone (Rs 10,765 lakhs consolidated) compared to Rs 8,095 lakhs standalone (Rs 12,705 lakhs consolidated) in the same quarter last year. Total expenses were Rs 12,392 lakhs standalone and Rs 18,267 lakhs consolidated. The company's earnings per share stood at negative Rs 10.17 for both basic and diluted calculations. NDTV operates primarily in television media and related operations. The company faces ongoing legal matters including SEBI proceedings, income tax demands of Rs 35,807 lakhs, and a CBI investigation related to foreign investments during 2004-2010.",
            "Sentiment": "negative",
            "PublishDate": 1753438846578,
            "Source": "earnings"
        },
        {
            "Title": "NDTV Schedules Board Meeting on July 25 to Approve Quarterly Financial Results",
            "Summary": "New Delhi Television Limited has scheduled a Board of Directors meeting for July 25, 2025, to consider and approve the Unaudited Financial Results (Standalone and Consolidated) for the quarter ended June 30, 2025. The company has notified both BSE Limited and National Stock Exchange of India Limited about this board meeting through its Company Secretary and Compliance Officer, Parinita Bhutani Duggal.",
            "Sentiment": "neutral",
            "PublishDate": 1753191263639,
            "Source": "corporate_action"
        },
        {
            "Title": "NDTV Expands into Live Events with 'NDTV Alive' Division",
            "Summary": "NDTV has announced plans to expand its presence in the media and entertainment sector to boost growth and revenue diversification. The company has launched a new division called 'NDTV Alive', which will focus on live events and experiences.",
            "Sentiment": "positive",
            "PublishDate": 1750764814000,
            "Source": "default"
        },
        {
            "Title": "NDTV Appoints Rahul Kanwal as CEO & Editor-in-Chief",
            "Summary": "New Delhi Television Limited (NDTV) has announced the appointment of Rahul Kanwal as the company's new Chief Executive Officer (CEO) and Editor-in-Chief. This leadership change represents a significant development in the management structure of the prominent Indian news organization.",
            "Sentiment": "neutral",
            "PublishDate": 1748264769000,
            "Source": "default"
        },
        {
            "Title": "New Delhi Television Ltd.: Shares Surge 40% in Eight Days, Hit Five-Month High",
            "Summary": "NDTV's shares rose over 40% in eight consecutive sessions, reaching a five-month high. The company reported 19% revenue growth in Q4 and 26% top-line growth for the full year. NDTV's digital vertical saw a 47% year-on-year increase in users across websites and apps.",
            "Sentiment": "positive",
            "PublishDate": 1747731022000,
            "Source": "earnings"
        },
        {
            "Title": "NDTV Reports Q4 Net Loss, Announces Amalgamation",
            "Summary": "New Delhi Television (NDTV) reported a consolidated net loss of 608.8 million rupees in Q4, compared to a loss of 84.6 million rupees year-over-year and 556.9 million rupees quarter-over-quarter. Q4 revenue increased to 1.27 billion rupees from 1.07 billion rupees in the previous year. The company also announced the amalgamation of several subsidiaries, including NDTV Networks, NDTV Worldwide, NDTV Media, and NDTV Labs, with the parent company.",
            "Sentiment": "negative",
            "PublishDate": 1745799441000,
            "Source": "default"
        },
        {
            "Title": "NDTV: Revenue Surges 26% in FY25 with Strategic Expansions",
            "Summary": "NDTV reported a 26% revenue growth for FY25, with Q4 showing a 19% increase. The company launched NDTV Marathi and NDTV World, expanded its digital presence, and hosted the inaugural NDTV World Summit. Despite these investments leading to a bottom-line loss, NDTV remains confident in future profitability.",
            "Sentiment": "positive",
            "PublishDate": 1745587800000,
            "Source": "earnings"
        },
        {
            "Title": "NDTV Reports Q4 Losses and Announces Amalgamation",
            "Summary": "New Delhi Television (NDTV) has reported significant losses for Q4. The company's EBITDA loss increased to 485.3 million rupees from 155.8 million rupees year-over-year. Revenue rose to 1.27 billion rupees from 1.07 billion rupees. The consolidated net loss widened to 608.8 million rupees, up from 84.6 million rupees in the previous year and 556.9 million rupees in the previous quarter. Additionally, NDTV announced the amalgamation of several subsidiaries, including NDTV Networks, NDTV Worldwide, NDTV Media, and NDTV Labs, with the parent company.",
            "Sentiment": "negative",
            "PublishDate": 1745582961000,
            "Source": "default"
        },
        {
            "Title": "NDTV Reports Increased Q3 Loss and Revenue Growth",
            "Summary": "New Delhi Television Ltd (NDTV) reported a consolidated net loss of 561 million rupees for the third quarter, compared to a loss of 101 million rupees in the same period last year. The loss also increased from 543 million rupees in the previous quarter. However, NDTV's revenue showed growth, reaching 1.3 billion rupees, up from 979 million rupees year-over-year and 1.1 billion rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1737936742000,
            "Source": "earnings"
        },
        {
            "Title": "CBI Closure Report Accepted by Court in NDTV Case",
            "Summary": "NDTV has announced that a court has accepted the Central Bureau of Investigation's (CBI) closure report regarding a case involving the company. According to NDTV, the court found no evidence of criminality against certain accused persons in the case. This development suggests a resolution to a legal matter that had been pending against NDTV.",
            "Sentiment": "positive",
            "PublishDate": 1737936676000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NDTV: Q3 Revenue Surges 34% Amid Global Expansion",
            "Summary": "NDTV reported a 34% year-on-year revenue growth in Q3, driven by higher advertising revenue and digital initiatives. The company launched NDTV World, a global news platform, and hosted the NDTV World Summit. While strategic investments impacted short-term profits, NDTV expects these efforts to drive future growth. The company also resumed participation in the BARC measurement system and received 38 awards at the News Television Awards 2024.",
            "Sentiment": "positive",
            "PublishDate": 1737802970000,
            "Source": "earnings"
        },
        {
            "Title": "CBI Closure Report Accepted by Court in NDTV Case",
            "Summary": "NDTV has reported that a court has accepted the Central Bureau of Investigation's (CBI) closure report in a case involving the company. According to NDTV, the court found no evidence of criminality against certain accused persons in the case. This development suggests a conclusion to a legal matter that had been pending against NDTV and some individuals associated with it.",
            "Sentiment": "positive",
            "PublishDate": 1737726992000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NDTV: CBI Closure Report Accepted in ICICI Bank Loan Case",
            "Summary": "A Delhi court accepted the CBI's closure report in the case of alleged irregularities by ICICI Bank in accepting loan repayment from NDTV. The court found no criminality or violation of the Banking Regulation Act. The CBI's six-year probe concluded there was no collusion, criminal conspiracy, or abuse of official position by any public servant or ICICI Bank officers.",
            "Sentiment": "positive",
            "PublishDate": 1737645701000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NDTV Board Approves Increasing Ownership in Subsidiaries",
            "Summary": "New Delhi Television (NDTV) has announced that its board has approved a plan to increase the company's ownership stake in its subsidiaries. This decision suggests a strategic move by NDTV to consolidate its control over its subsidiary operations, potentially aiming to streamline decision-making processes and enhance overall corporate efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1735214183000,
            "Source": "corporate_action"
        },
        {
            "Title": "NDTV Reports Q2 EBITDA Loss",
            "Summary": "New Delhi Television (NDTV) has reported a significant financial downturn in its second quarter results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a loss of 433 million rupees, compared to a gain of 47 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729674285000,
            "Source": "result"
        },
        {
            "Title": "NDTV Reports Q2 Revenue Growth",
            "Summary": "New Delhi Television (NDTV) has reported a revenue of 1.1 billion rupees for the second quarter, compared to 955 million rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729674217000,
            "Source": "result"
        },
        {
            "Title": "NDTV Reports Q2 Net Loss of 528 Million Rupees",
            "Summary": "New Delhi Television (NDTV) has reported a consolidated net loss of 528 million rupees for the second quarter, compared to a profit of 59 million rupees in the same period last year. This represents a significant financial downturn for the company year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729674193000,
            "Source": "result"
        }
    ]
}