{
    "Symbol": "NECCLTD",
    "ISIN": "INE553C01016",
    "News": [
        {
            "Title": "North Eastern Carrying Corp Q3 FY26 Results",
            "Summary": "North Eastern Carrying Corporation Limited reported revenue of ₹719.68 crores for Q3 FY26, with net profit after tax of ₹34.52 crores. EPS stood at ₹0.34 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1770617356352,
            "Source": "co_actions_results"
        },
        {
            "Title": "North Eastern Carrying Corporation Fined Rs 5.40 Lakh by NSE for Compliance Violation",
            "Summary": "NSE imposed a fine of Rs 5.40 lakh on North Eastern Carrying Corporation Limited for non-compliance with Schedule XIX regarding listing of securities and failure to apply for trading approval within the required timeframe. The company states there is no material impact on its financial or operational activities and is evaluating the fine to take necessary response steps.",
            "Sentiment": "negative",
            "PublishDate": 1764739458362,
            "Source": "corporate_governance"
        },
        {
            "Title": "North Eastern Carrying Corporation Fined Rs 5.40 Lakh by BSE for SEBI Compliance Violation",
            "Summary": "BSE Limited imposed a fine of Rs 5,40,000 plus GST on North Eastern Carrying Corporation Limited for non-compliance with SEBI Master Circular dated June 21, 2023, related to trading approval application requirements. The company disclosed that there is no material impact on its financial or operational activities and is evaluating the fine to respond to the notice.",
            "Sentiment": "negative",
            "PublishDate": 1764228345379,
            "Source": "corporate_governance"
        },
        {
            "Title": "North Eastern Carrying Corporation Reports Net Loss of Rs 181.20 Lakhs in Q2",
            "Summary": "North Eastern Carrying Corporation Limited posted a net loss of Rs 181.20 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 178.03 lakhs in the corresponding previous quarter. The transportation company's revenue from operations declined to Rs 7,074.60 lakhs from Rs 6,509.98 lakhs, with auditors noting concerns about provision for doubtful debts and lease accounting practices.",
            "Sentiment": "negative",
            "PublishDate": 1763126095508,
            "Source": "earnings"
        },
        {
            "Title": "North Eastern Carrying Corporation Reports Q1 2025 Results, Recommends New Secretarial Auditor Appointment",
            "Summary": "North Eastern Carrying Corporation Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing a net profit of Rs 178.03 crore compared to Rs 176.01 crore in the previous quarter. Revenue from operations stood at Rs 8,809.71 crore. The company reported basic and diluted earnings per share of Rs 0.18. The Board recommended appointing M/s. A. K. Friends & Co. as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company scheduled its Annual General Meeting for September 26, 2025. Independent auditors completed a limited review of the quarterly results and found no material misstatements.",
            "Sentiment": "neutral",
            "PublishDate": 1754572778974,
            "Source": "earnings"
        },
        {
            "Title": "North Eastern Carrying Corporation Secures 5-Year Steel Transportation Contract from Tata Steel",
            "Summary": "North Eastern Carrying Corporation Limited has been awarded a five-year work contract from Tata Steel Limited for transportation of steel products using electric vehicles from Khopoli to various destinations including Kalamboli, Panvel, and Taloja. The company stated it remains committed to exploring more opportunities in EV logistics.",
            "Sentiment": "positive",
            "PublishDate": 1754306928191,
            "Source": "order&deals"
        },
        {
            "Title": "North Eastern Carrying Corporation Schedules Board Meeting for Quarterly Results on August 7, 2025",
            "Summary": "North Eastern Carrying Corporation Limited has scheduled a Board of Directors meeting on August 7, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure from July 1, 2025, which will remain in effect until 48 hours after the declaration of the quarterly results. This trading restriction is part of the company's insider trading prevention measures.",
            "Sentiment": "neutral",
            "PublishDate": 1754054394587,
            "Source": "corporate_action"
        },
        {
            "Title": "North Eastern Carrying Corp Secures 5-Year EV Logistics Contract from Tata Steel",
            "Summary": "North Eastern Carrying Corporation has announced that it has been awarded a contract by Tata Steel for electric vehicle (EV) logistics services. The contract duration is for five years, indicating a long-term partnership between the two companies in the realm of sustainable transportation solutions.",
            "Sentiment": "positive",
            "PublishDate": 1743120834000,
            "Source": "order&deals"
        },
        {
            "Title": "North Eastern Carrying Corp Secures 5-Year EV Logistics Contract with Tata Steel",
            "Summary": "North Eastern Carrying Corporation has been awarded a significant contract by Tata Steel for electric vehicle (EV) logistics services. The contract duration is set for five years, indicating a long-term partnership between the two companies in the emerging field of EV logistics.",
            "Sentiment": "positive",
            "PublishDate": 1743075448000,
            "Source": "order&deals"
        },
        {
            "Title": "North Eastern Carrying Corporation: Q3 Profit Declines Despite Long-Term Growth",
            "Summary": "North Eastern Carrying Corporation reported a 22.7% YoY decline in Q3 FY25 net profit to ₹1.94 crore. Revenue from operations dipped 5.2% to ₹81.05 crore. The company's debt-equity ratio improved to 0.44 times, the lowest in five half-yearly periods. However, EPS dropped to ₹0.19, the lowest in five quarters. The stock price rose 4% to ₹20.74 despite weak market trends.",
            "Sentiment": "neutral",
            "PublishDate": 1741076946000,
            "Source": "earnings"
        },
        {
            "Title": "North Eastern Carrying Corporation: Shares Surge 8% Ahead of Q2 Results",
            "Summary": "North Eastern Carrying Corporation Ltd (NECCL) shares rose over 8% to ₹31.40 on NSE. The company will discuss Q2FY24 results on October 30, 2024. Promoters increased their stake to 54.19% in September 2024. NECCL reported strong Q1FY25 results with net profit growing 147% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1730110449000,
            "Source": "normal_news"
        }
    ]
}