{
    "Symbol": "NECLIFE",
    "ISIN": "INE023H01027",
    "News": [
        {
            "Title": "Nectar Lifesciences Promoters' Stake Rises to 51.84%",
            "Summary": "Nectar Lifesciences promoters' shareholding increased from 44.91% to 51.84% following completion of share buyback program that concluded on January 06, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769515254152,
            "Source": "co_actions_results"
        },
        {
            "Title": "Multiple Companies Report Q3FY26 Financial Results",
            "Summary": "Nectar Lifesciences, Nuvama Wealth, ideaForge Technology, Suryoday Small Finance Bank, and Coforge published their quarterly financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769240503836,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nectar Lifesciences Board Approves Business Expansion",
            "Summary": "Nectar Lifesciences board approves new MOA to expand into construction and real estate, appoints VDR & Associates as internal auditor for FY26-27, and seeks shareholder approval via postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1769170265726,
            "Source": "stocks"
        },
        {
            "Title": "Nectar Lifesciences Q3FY26 Results: Profit Surges",
            "Summary": "Nectar Lifesciences reports ₹1,426.97 lacs profit in Q3FY26 vs ₹784.04 lacs in Q3FY25, driven by exceptional gains from pharma business sale worth ₹8,815.13 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1769168973447,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nectar Lifesciences Completes ₹81 Cr Share Buyback",
            "Summary": "Nectar Lifesciences successfully extinguished 3 crore equity shares through tender offer buyback at ₹27 per share, reducing share capital from 22.43 crore to 19.43 crore shares.",
            "Sentiment": "neutral",
            "PublishDate": 1769003727651,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nectar Lifesciences Sees 5.07% Stake Acquisition",
            "Summary": "Rajasthan Global Securities and PAC acquire additional 0.16% stake in Nectar Lifesciences, increasing combined holding to 5.07% through open market purchase of 3.62 lakh shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765781299050,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nectar Lifesciences Issues Corrigendum for Equity Buyback Public Announcement",
            "Summary": "Nectar Lifesciences Limited published a corrigendum for its equity shares buyback public announcement in Business Standard and Desh Sewak newspapers. The corrigendum modifies paragraph 7.2(3) regarding aggregate equity shares purchased or sold by promoters and promoter group of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765348446711,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences Announces ₹81 Crore Share Buyback at ₹27 Per Share",
            "Summary": "Nectar Lifesciences Limited has approved a buyback of up to 3 crore equity shares at ₹27 per share through tender offer route, totaling ₹81 crore with record date set for December 24, 2025. The buyback represents 13.38% of total equity shares and 9% of paid-up capital plus free reserves, offering shareholders an exit opportunity at current market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1764923173104,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences Promoters Execute Share Transfer Between Spouses",
            "Summary": "Mr. Sanjiv Goyal, Chairman and Managing Director of Nectar Lifesciences, transferred 8 million equity shares (reducing his stake from 24.90% to 21.33%) to his wife Ms. Raman Goyal as a gift, increasing her shareholding from 0.55% to 4.12%. The off-market transfer was executed on November 27, 2025, representing an internal restructuring of promoter holdings within the same family without affecting overall promoter group ownership.",
            "Sentiment": "neutral",
            "PublishDate": 1764328263367,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences to Consider Equity Share Buyback Proposal",
            "Summary": "Nectar Lifesciences will consider a proposal for buyback of equity shares on December 3. The decision affects existing shareholders who may benefit from potential share repurchase at premium prices.",
            "Sentiment": "neutral",
            "PublishDate": 1764288347214,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences Reports Quarterly Loss, Completes Major Business Divestment",
            "Summary": "Nectar Lifesciences Limited reported a net loss of Rs 100.98 lacs from continuing operations for the quarter ended September 30, 2025, while completing the sale of its pharmaceutical business to Ceph Lifesciences Private Limited for Rs 127,398.55 lacs in November 2025. The company's board approved unaudited financial results showing revenue from operations of Rs 1,023.02 lacs for the half-year period, with the divested pharma business generating Rs 36,370.51 lacs in income during the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1763132867552,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences Transfers Key Management Personnel to Ceph Lifesciences Following Business Transfer Agreement",
            "Summary": "Nectar Lifesciences Limited has transferred four key management personnel to Ceph Lifesciences Private Limited effective November 10, 2025, following completion of a business transfer agreement dated July 7, 2025. The transferred personnel include Dr. Surulichamy Senthilkumar (Wholetime Director designated as Director R&D), Mr. Amit Chadah (Chief Executive Officer), Mr. Harparkash Singh Gill (President), and Mr. Parveen Kumar Sareen (Vice-President Technical). The transfers occurred as part of a slump sale involving the transfer of Nectar Lifesciences' business related to manufacture, distribution, marketing and sale of active pharmaceutical ingredients and formulations. Dr. Senthilkumar will continue as a Non-Executive Director of Nectar Lifesciences without any remuneration and sitting fee.",
            "Sentiment": "neutral",
            "PublishDate": 1762915063526,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nectar Lifesciences Completes Sale of Pharmaceutical Business and Assets",
            "Summary": "Nectar Lifesciences Limited has completed the slump sale of its active pharmaceutical ingredients and formulations business to Cephi Lifesciences Private Limited. The company also completed an asset sale to the same purchaser. Both transactions were finalized on November 10, 2025, following business transfer and asset purchase agreements executed on July 07, 2025. The completion includes all deliverables as detailed in the respective agreements.",
            "Sentiment": "neutral",
            "PublishDate": 1762913755718,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences VP Exports Ashok Kumar Resigns Due to Personal Reasons",
            "Summary": "Nectar Lifesciences Limited announced that Mr. Ashok Kumar, Vice President (Exports), has resigned from his position effective November 9, 2025. In his resignation letter addressed to CEO Mr. Amit Chadah, Kumar cited personal reasons for his departure and requested immediate relief from his responsibilities. The company has informed stock exchanges NSE and BSE about this senior management change as required under SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762686344502,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nectar Lifesciences Internal Auditor Mr. Aman Singla Resigns",
            "Summary": "Nectar Lifesciences Limited announced the resignation of Mr. Aman Singla from his position as internal auditor. The resignation became effective from the close of working hours on November 3, 2025, due to personal reasons and other commitments. The company confirmed there are no other reasons for his cessation as internal auditor.",
            "Sentiment": "neutral",
            "PublishDate": 1762286175835,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBICAP Trustee Releases Pledge on 44.35% Stake in Nectar Life Sciences",
            "Summary": "SBICAP Trustee Company Limited released its pledge on 9,94,68,000 equity shares of Nectar Life Sciences Limited on October 30, 2025. The shares represented 44.35% of the company's total voting capital. Following the release of pledge, SBICAP Trustee's holding in Nectar Life Sciences reduced to nil. The company has 19,94,68,000 equity shares of Rs. 1 each, aggregating Rs. 9,94,68,000. SBICAP Trustee does not belong to the promoter group of Nectar Life Sciences.",
            "Sentiment": "neutral",
            "PublishDate": 1762156218402,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences Promoters Release Pledged Shares Worth ₹156.76 Crore",
            "Summary": "Nectar Lifesciences Limited disclosed that promoters Sanjiv Goyal and Sanjiv HUF have released pledged shares. Sanjiv Goyal released 55,84,560 equity shares (24.90% shareholding) valued at ₹88.01 crore, while Sanjiv HUF released 43,62,240 equity shares (19.45% shareholding) valued at ₹68.75 crore. The pledge release was executed by SBICAP Trustee Company Limited as security trustee of the company's lenders. The transactions occurred on October 29, 2025, with intimation provided on October 30, 2025. Both promoters maintained their shareholding percentages as there was no change in actual share ownership, only the release of previously pledged shares.",
            "Sentiment": "positive",
            "PublishDate": 1761849447914,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences Director Ms. Meena Verma Steps Down Following EXIM Bank Withdrawal",
            "Summary": "Nectar Lifesciences Limited announced that Ms. Meena Verma (DIN: 05283168) has ceased to be a member of the Board of Directors effective October 27, 2025. The Export-Import Bank of India (EXIM) withdrew her nomination as Nominee Director on the company's board. The company received email notification from EXIM Bank regarding this withdrawal on October 27, 2025. The company confirmed there are no other reasons for her cessation as Nominee Director beyond the withdrawal of nomination by EXIM Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1761564027901,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nectar Lifesciences Fully Repays INR 1,338.35 Crore Secured Debt to Consortium Lenders",
            "Summary": "Nectar Lifesciences Limited has completely repaid its secured debt along with accrued interest to consortium lenders. The company has satisfied the consortium charge of INR 1,338.35 crore on all its assets, both movable and immovable including current assets. The charge was in favor of SBICAP Trustee Company Limited, which acted as Security Trustee for the lenders. The satisfaction has been registered with the Registrar of Companies, Punjab and Chandigarh on October 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761127112200,
            "Source": "stock"
        },
        {
            "Title": "Nectar Lifesciences Extends Sale Completion Deadline to November 2025",
            "Summary": "Nectar Lifesciences has delayed the completion date for its sale to Ceph Lifesciences Private Limited to on or before November 19, 2025. This marks the third postponement of the transaction, with previous target dates set for July 7, 2025, and September 16, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1760679764181,
            "Source": "order&deals"
        },
        {
            "Title": "Nectar Lifesciences Extends Pharmaceutical Business Sale Completion Date to October 2025",
            "Summary": "Nectar Lifesciences Limited has extended the expected completion date for its slump sale of pharmaceutical business to Ceph Lifesciences Private Limited to October 20, 2025. The transaction involves the sale of business related to manufacture, distribution, marketing and sale of active pharmaceutical ingredients and formulations. Both companies mutually agreed to the extension. Previous disclosures regarding this slump sale were made in July 2025, including an Extraordinary General Meeting notice and outcome in August 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758023236848,
            "Source": "corporate_action"
        },
        {
            "Title": "DRI Conducts Search Operations at Nectar Lifesciences Under Customs Act",
            "Summary": "The Directorate of Revenue Intelligence conducted search operations at various premises of Nectar Lifesciences Limited under the Customs Act, 1962. The search operations began on September 15, 2025, at approximately 11:00 AM and concluded later that night. The company has fully cooperated with officials during the proceedings and responded to clarifications sought by them. Nectar Lifesciences will continue to provide any further information required by DRI. The violations or contraventions alleged are not ascertainable at this initial stage, and the financial impact cannot be determined currently. The company's operations and other activities continued as usual and were not impacted due to the search.",
            "Sentiment": "neutral",
            "PublishDate": 1758015045564,
            "Source": "stock"
        },
        {
            "Title": "Nectar Lifesciences Reports Loss in Q1 Results, Announces Major Business Sale Worth ₹1,270 Crores",
            "Summary": "Nectar Lifesciences Limited approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a net loss of ₹6,323.08 lacs compared to a profit of ₹296.91 lacs in the same quarter last year. Revenue from operations declined to ₹28,066.51 lacs from ₹35,884.70 lacs year-over-year. The board scheduled the 30th Annual General Meeting for September 29, 2025, and approved the re-appointment of director Sanjiv Goyal. The company appointed M/s. P. Chadha & Associates as Secretarial Auditors for five years and re-appointed M/s V. Kumar & Associates as Cost Auditors. After the quarter ended, Nectar Lifesciences agreed to sell its pharmaceutical business to Ceph Lifesciences Private Limited for ₹1,270 crores and its menthol business assets for ₹20 crores.",
            "Sentiment": "negative",
            "PublishDate": 1755172837410,
            "Source": "earnings"
        },
        {
            "Title": "Nectar Lifesciences Receives GMP Certification from Ukraine for Unit VI",
            "Summary": "Nectar Lifesciences Limited has received GMP certification from Ukraine's State Service on Medicines and Drugs Control (SMDC) for its Unit VI manufacturing facility located in Himachal Pradesh. The certification is valid until April 18, 2026, and covers pharmaceutical products for sale within Ukraine or for export. The certification follows Good Manufacturing Practices guidelines from PIC/S, EU Directives, and WHO recommendations. Shareholders have previously approved a slump sale of this Unit VI facility.",
            "Sentiment": "positive",
            "PublishDate": 1754905973432,
            "Source": "stock"
        },
        {
            "Title": "Nectar Lifesciences Submits Revised EGM Proceedings After Exchange Query",
            "Summary": "Nectar Lifesciences Limited submitted revised proceedings of their Extraordinary General Meeting held on August 4, 2025, after stock exchanges queried the missing conclusion time in the original filing. The EGM, chaired by Dr. Surulichamy Senthilkumar (Director R&D), was held from 10:00 A.M. to 10:20 A.M. at the company's registered office in Punjab. Three resolutions were considered: appointment of Dr. Senthilkumar as Director liable to retire by rotation, his appointment as Wholetime Director (R&D) for three years, and approval for transfer of business to Ceph Lifesciences Private Limited on a slump sale basis. The company provided e-voting facilities from August 1-3, 2025, and ballot voting at the venue. Mr. Prince Chadha was appointed as scrutinizer for the voting process. Voting results will be announced separately after the scrutinizer's report is received.",
            "Sentiment": "neutral",
            "PublishDate": 1754470927361,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences Holds EGM to Vote on Director Appointment and Business Transfer to Ceph Lifesciences",
            "Summary": "Nectar Lifesciences Limited conducted its Extraordinary General Meeting on August 04, 2025, chaired by Dr. Surulichamy Senthilkumar, Director (R&D). Shareholders voted on three key resolutions: appointing Dr. Surulichamy Senthilkumar as a Director liable to retire by rotation, his appointment as Wholetime Director (R&D) for three years, and the transfer of business to Ceph Lifesciences Private Limited on a slump sale basis as a going concern. The meeting provided both e-voting facilities from August 01-03, 2025, and ballot paper voting at the venue. Mr. Prince Chadha of M/s P. Chadha & Associates served as scrutinizer for the voting process. Voting results will be announced separately after the scrutinizer's report is received and will be uploaded on the company's website and KFin Technologies Limited's platform.",
            "Sentiment": "neutral",
            "PublishDate": 1754300418039,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences: Major Business Divestment for ₹1,290 Crore",
            "Summary": "Nectar Lifesciences to sell its API, Formulations, and Menthol businesses to Ceph Lifesciences for ₹1,290 crore. The transaction is expected to complete by September 20, 2025, subject to approvals. Proceeds will be used for debt repayment, new investments, and shareholder rewards. Shareholder approval will be sought at an EGM on August 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1751945761000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nectar Lifesciences Reports Q4 Revenue Decline and Significant Loss",
            "Summary": "Nectar Lifesciences has reported its financial results for the fourth quarter. The company's revenue decreased to 4.29 billion rupees from 4.39 billion rupees in the same quarter last year. Additionally, Nectar Lifesciences reported a loss of 576 million rupees in Q4, compared to a profit of 105 million rupees in the corresponding period of the previous year. This represents a significant shift from profitability to loss for the company.",
            "Sentiment": "negative",
            "PublishDate": 1751945392000,
            "Source": "result"
        },
        {
            "Title": "Nectar Lifesciences Unit II Receives 2-Year GMP Certification from Brazil's ANVISA",
            "Summary": "Nectar Lifesciences has announced that its Unit II has been granted a 2-year Good Manufacturing Practice (GMP) certification from ANVISA, Brazil's health regulatory agency, for two Active Pharmaceutical Ingredients (APIs). This certification is a significant achievement for the company, as it validates the quality and safety standards of their manufacturing processes for these APIs.",
            "Sentiment": "positive",
            "PublishDate": 1746000854000,
            "Source": "default"
        },
        {
            "Title": "Nectar Lifesciences' API Facility Faces Critical Observations in Joint Inspection",
            "Summary": "Nectar Lifesciences' API manufacturing facility in Punjab underwent a joint inspection by EDQM (European Directorate for the Quality of Medicines & HealthCare) and AEMPS (Spanish Agency of Medicines and Medical Devices). The inspection resulted in seven observations, including four critical ones. As a consequence, the European regulator has decided to conduct a re-inspection of the facility.",
            "Sentiment": "negative",
            "PublishDate": 1741602639000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nectar Lifesciences Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Nectar Lifesciences has reported a significant decrease in its third-quarter EBITDA, which fell to 276 million rupees from 422 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 6.07% from 9.33% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738326612000,
            "Source": "earnings"
        },
        {
            "Title": "Nectar Lifesciences Reports Significant Profit Growth in Q3",
            "Summary": "Nectar Lifesciences has reported a substantial increase in its consolidated net profit for the third quarter. The company's net profit rose to 78 million rupees, compared to 16 million rupees in the same quarter last year, marking a year-over-year growth. The profit also increased from 56 million rupees in the previous quarter, indicating quarter-over-quarter growth. However, the company's revenue remained stable at 4.5 billion rupees, showing no change from the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738326520000,
            "Source": "earnings"
        },
        {
            "Title": "Nectar Lifesciences Reports Q2 Revenue Growth",
            "Summary": "Nectar Lifesciences has reported a revenue of 4.3 billion rupees for the second quarter, compared to 3.97 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731571535000,
            "Source": "result"
        },
        {
            "Title": "Nectar Lifesciences Reports Improved Q2 Financial Results",
            "Summary": "Nectar Lifesciences has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased to 433 million rupees from 287 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 10.13% from 6.75% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731571517000,
            "Source": "result"
        },
        {
            "Title": "Nectar Lifesciences Reports Significant Profit Increase in Q2",
            "Summary": "Nectar Lifesciences has reported a substantial increase in its consolidated net profit for the second quarter. The company's net profit rose to 56 million rupees, up from 10 million rupees in the same period last year, marking a 460% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731571453000,
            "Source": "result"
        }
    ]
}