{
    "Symbol": "NELCAST",
    "ISIN": "INE189I01024",
    "News": [
        {
            "Title": "Nelcast Q3FY26 Net Profit Surges 166% to ₹1590.20 Lakhs",
            "Summary": "Nelcast Limited reports strong Q3FY26 performance with net profit jumping 166% YoY to ₹1590.20 lakhs. Revenue from operations grew 13.1% to ₹32962.01 lakhs, driven by robust demand in iron castings segment.",
            "Sentiment": "positive",
            "PublishDate": 1770642453686,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nelcast Q3FY26 Earnings Call Set for February 10",
            "Summary": "Nelcast Limited announces earnings conference call scheduled for February 10, 2026 at 11:00 AM IST to discuss Q3FY26 financial performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768892030288,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nelcast Limited Reports Mixed Performance with Revenue Flat at Rs 639 Crores in H1FY26",
            "Summary": "Nelcast Limited reported total revenue of Rs 639 crores in H1FY26 compared to Rs 637.4 crores in H1FY25, remaining largely flat. The company's quarterly revenue declined to Rs 303 crores in Q2FY26 from Rs 335 crores in Q2FY25. EBITDA per kg improved marginally to Rs 12.5 in H1FY26 from Rs 11.8 in H1FY25, representing 5.8% growth. Profit after tax increased to Rs 17.3 crores in H1FY26 from Rs 14.0 crores in H1FY25 (adjusted), showing 23.2% growth. Export performance was impacted by U.S. economic slowdown due to additional tariffs, affecting both realizations and volumes. The tractor segment's revenue share increased from 25% to 27% in H1FY26, supported by favorable seasonal conditions and strong rural demand. Medium and Heavy Commercial Vehicles maintained a steady 36% contribution to overall revenue. The company expects FY26 to be a consolidation year with demand strengthening toward year-end driven by new product launches and export market recovery.",
            "Sentiment": "neutral",
            "PublishDate": 1761854429701,
            "Source": "earnings"
        },
        {
            "Title": "Nelcast Reports Q2 Export Impact from US Economic Slowdown, Expects Recovery in H2 FY26",
            "Summary": "Nelcast reported that its Q2 exports were affected by a U.S. economic slowdown caused by new tariffs, which led to temporary production stops by clients. The company expects a strong rebound in H2 FY26 with EBITDA per kg rising beyond ₹13.5. Export volumes are anticipated to recover after the US slowdown, while domestic tractor and M&HCV segments are projected to drive 10-12% growth. The company plans new high-margin product introductions to improve utilization and profitability into FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1761834661179,
            "Source": "stock"
        },
        {
            "Title": "NELCAST Reports 51% Decline in Q2 Net Profit to 48M Rupees",
            "Summary": "NELCAST reported quarterly net profit of 48 million rupees compared to 98.2 million rupees in the same period last year, representing a decline of over 50%. Revenue fell to 2.99 billion rupees from 3.3 billion rupees year-over-year. EBITDA decreased to 171 million rupees from 213.7 million rupees, while EBITDA margin compressed to 5.72% from 6.47% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761825919406,
            "Source": "earnings"
        },
        {
            "Title": "Nelcast Limited Reports Quarterly Financial Results for June 2025",
            "Summary": "Nelcast Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company operates primarily in the iron castings segment. The consolidated results include subsidiary NC Energy Limited, which reported nil revenue and profit for the quarter. The company had exceptional items related to profit on sale of land in previous periods but none for the current quarter. The financial statements were prepared under Indian Accounting Standards and reviewed by statutory auditors K. Nagaraju & Associates.",
            "Sentiment": "neutral",
            "PublishDate": 1753964051586,
            "Source": "earnings"
        },
        {
            "Title": "Nelcast Reports Strong Q4 Financial Results",
            "Summary": "Nelcast has announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 135 million rupees, up from 50.7 million rupees in the same quarter last year and 60 million rupees in the previous quarter. Revenue also saw growth, reaching 3.3 billion rupees compared to 2.95 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1747267804000,
            "Source": "default"
        },
        {
            "Title": "Nelcast Reports Strong Q4 Financial Performance",
            "Summary": "Nelcast has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 297 million rupees from 155.6 million rupees in the previous year, with EBITDA margin rising to 9% from 5.26%. Net profit grew to 135 million rupees, up from 50.7 million rupees year-over-year and 60 million rupees quarter-over-quarter. Revenue for Q4 reached 3.3 billion rupees, compared to 2.95 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747232559000,
            "Source": "result"
        },
        {
            "Title": "Nelcast Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "Nelcast, an Indian company, has reported its financial results for the third quarter. The company's net profit decreased to 60 million rupees, down from 255 million rupees in the same quarter last year and 98 million rupees in the previous quarter. Revenue also declined to 2.9 billion rupees from 3.20 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738284258000,
            "Source": "earnings"
        },
        {
            "Title": "NELCAST Reports Decline in Q3 EBITDA and Margin",
            "Summary": "NELCAST, a company in the manufacturing sector, has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 172 million rupees from 256 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 5.92% from 7.99% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738241617000,
            "Source": "earnings"
        },
        {
            "Title": "Nelcast Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "Nelcast Limited has reported a significant decrease in its third quarter net profit, which fell to 60 million rupees from 255 million rupees year-over-year. The company's revenue also declined to 2.9 billion rupees from 3.20 billion rupees in the same period last year. Compared to the previous quarter, net profit decreased from 98 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1738241555000,
            "Source": "earnings"
        },
        {
            "Title": "Nelcast Anticipates Demand Boost and Export Growth",
            "Summary": "Nelcast expects a significant increase in demand in their main markets, with early recovery signals anticipated by Q1FY26. The company also foresees the export market picking up at the beginning of Q1FY26 and growing at a good pace thereafter.",
            "Sentiment": "positive",
            "PublishDate": 1731037009000,
            "Source": "normal_news"
        },
        {
            "Title": "Nelcast Reports Q2 Profit Decline and Exceptional Item",
            "Summary": "Nelcast, an Indian company, reported a significant decrease in its Q2 profit before tax (PBT) from 223.2 million rupees last year to 111.9 million rupees this year. The company also disclosed an exceptional item of 17.1 million rupees, which likely impacted its financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1730995260000,
            "Source": "result"
        },
        {
            "Title": "Nelcast Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Nelcast, an Indian company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 213.7 million rupees from 317.7 million rupees in the same quarter last year. Additionally, the EBITDA margin fell to 6.47% from 8.87% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730995247000,
            "Source": "result"
        },
        {
            "Title": "Nelcast Reports Q2 Revenue Decline",
            "Summary": "Nelcast, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 3.3 billion rupees, showing a decrease from 3.58 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730995239000,
            "Source": "result"
        },
        {
            "Title": "Nelcast Reports Q2 Net Profit Decline",
            "Summary": "Nelcast Limited has reported a net profit of 98.2 million rupees for the second quarter, showing a decrease from 166.4 million rupees in the same quarter last year (YoY) and 79.6 million rupees in the previous quarter (QoQ).",
            "Sentiment": "negative",
            "PublishDate": 1730995231000,
            "Source": "result"
        }
    ]
}