{
    "Symbol": "NELCO",
    "ISIN": "INE045B01015",
    "News": [
        {
            "Title": "NELCO's Satellite Communication License Rejected by DOT",
            "Summary": "The Department of Telecommunications has rejected NELCO's application for a satellite communication license, marking a setback for the company's satellite communication ambitions.",
            "Sentiment": "negative",
            "PublishDate": 1769745171031,
            "Source": "stocks"
        },
        {
            "Title": "Nelco Q3 Loss Widens to ₹1.19cr as Revenue Falls 3% YoY",
            "Summary": "Tata Group firm Nelco reported Q3 net loss of ₹1.19cr vs ₹4.95cr profit last year. Revenue declined 3% to ₹78.3cr amid conservative cost provisions under new labour regulations.",
            "Sentiment": "negative",
            "PublishDate": 1768470215633,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nelco Schedules Q3 FY25 Results Review on Jan 15",
            "Summary": "Nelco has announced it will review its third quarter financial results on January 15, 2025, providing investors with key performance insights for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1767942582777,
            "Source": "co_actions_results"
        },
        {
            "Title": "NELCO Explores Satellite Internet Partnerships",
            "Summary": "Tata's NELCO is reportedly exploring partnerships with satellite internet providers including Starlink and Amazon Kuiper for LEO revenue opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1767860486873,
            "Source": "stocks"
        },
        {
            "Title": "NELCO GST Appeal Dismissed, ₹2.04 Cr Demand Upheld",
            "Summary": "NELCO Limited's GST appeal dismissed by Joint Commissioner, confirming ₹2.04 crore demand including penalty for reverse charge mechanism violations from July 2017 to March 2019.",
            "Sentiment": "negative",
            "PublishDate": 1766409041871,
            "Source": "stocks"
        },
        {
            "Title": "Nelco Receives Additional Authorization to Sell VSAT Services Under Unified License",
            "Summary": "Nelco has obtained additional authorization called UL VNO-GMPCS under its existing unified license from regulatory authorities. This authorization will enable Nelco to sell VSAT services of other UL-GMPCS licensees, expanding its service offerings in the satellite communications sector.",
            "Sentiment": "positive",
            "PublishDate": 1764115814998,
            "Source": "stock"
        },
        {
            "Title": "CRISIL Revises Nelco's Rating Outlook to Stable from Positive, Reaffirms A Rating",
            "Summary": "CRISIL revised Nelco Limited's long-term rating outlook to Stable from Positive while reaffirming the A rating on Rs 218.3 crore bank facilities, citing slower-than-expected revenue growth in government, maritime and BFSI segments. The revision follows range-bound revenue over the last 2-3 fiscals, with consolidated operating income declining from Rs 321 crore in fiscal 2024 to Rs 306 crore in fiscal 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763467668449,
            "Source": "corporate_action"
        },
        {
            "Title": "NELCO Receives Approval for GMPCS VNO License from Department of Telecom",
            "Summary": "The Department of Telecom has sent a Letter of Intent to NELCO, approving the company's GMPCS VNO (Global Mobile Personal Communications by Satellite Virtual Network Operator) license. This regulatory approval allows NELCO to operate as a virtual network operator in the satellite communications sector.",
            "Sentiment": "positive",
            "PublishDate": 1761902456335,
            "Source": "stock"
        },
        {
            "Title": "Nelco Limited Reports Q2 FY26 Results with Net Profit of Rs 162 Lakhs",
            "Summary": "Nelco Limited announced its quarterly results for the quarter and six months ended September 30, 2025. On a consolidated basis, the company reported net profit of Rs 162 lakhs for Q2 compared to Rs 410 lakhs in the same quarter last year. Total income for the quarter was Rs 7,561 lakhs versus Rs 8,346 lakhs in the previous year. For the six-month period, consolidated net profit stood at Rs 342 lakhs compared to Rs 866 lakhs in the corresponding period last year. On a standalone basis, Q2 net profit was Rs 271 lakhs against Rs 132 lakhs in the same quarter last year. The company operates in the Network Systems segment and paid a final dividend of Rs 1.00 per equity share for the financial year ended March 31, 2025. Earnings per share for Q2 on consolidated basis was Rs 0.71 compared to Rs 1.80 in the previous year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1760693845224,
            "Source": "earnings"
        },
        {
            "Title": "Nelco Plans to Focus on Enterprise and Government Sectors for Satellite Communication Services",
            "Summary": "Nelco is planning to target enterprises and government sectors for next-generation satellite communication service contracts. The company views retail opportunities in this space as potentially limited, leading to its strategic focus on business and government clients for its satcom services.",
            "Sentiment": "neutral",
            "PublishDate": 1760498551447,
            "Source": "stock"
        },
        {
            "Title": "NELCO Denies Hiding Information on Satellite Broadband Rumors, Attributes Price Changes to Market Forces",
            "Summary": "NELCO has responded to media speculation regarding its potential entry into the satellite broadband sector. The company stated that it is not concealing any material information from stakeholders. NELCO attributed recent price movements in its stock to general market factors rather than any specific corporate developments or undisclosed information.",
            "Sentiment": "neutral",
            "PublishDate": 1758186902748,
            "Source": "stock"
        },
        {
            "Title": "Nelco Partners With Eutelsat To Provide LEO Satellite Services In India",
            "Summary": "Nelco Ltd., a Tata Group satellite communication service provider, signed an agreement with Eutelsat to deliver OneWeb low Earth orbit satellite connectivity services across India. The partnership with OneWeb India Communications will provide secure, low-latency LEO connectivity for customers on land, sea, and air. Service coverage will extend across India's borders, territorial waters, and remote regions, supporting government and enterprise applications. Nelco plans to offer these services once OneWeb LEO services become commercially operational in the country. The collaboration aims to strengthen India's digital infrastructure and national security while ensuring connectivity in underserved areas.",
            "Sentiment": "positive",
            "PublishDate": 1754926591176,
            "Source": "order&deals"
        },
        {
            "Title": "Nelco Ltd: Q1 Profit Plunges 60%, Stock Tumbles",
            "Summary": "Nelco Ltd reported a 60% drop in Q1 net profit to ₹1.8 crore. Revenue remained flat at ₹74 crore, while EBITDA fell 36% to ₹7.8 crore. Margins narrowed to 10.4% from 16.5% year-on-year. The stock fell 5.3% to ₹897.5 following the results announcement.",
            "Sentiment": "negative",
            "PublishDate": 1752487455000,
            "Source": "earnings"
        },
        {
            "Title": "NELCO Reports Decline in Q1 EBITDA and Margin",
            "Summary": "NELCO has reported its Q1 financial results. The company's EBITDA decreased to 77 million rupees from 123 million rupees in the same quarter last year. The EBITDA margin also declined to 10.35% from 16.63% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1752486052000,
            "Source": "result"
        },
        {
            "Title": "NELCO Reports Q1 Financial Results",
            "Summary": "NELCO has reported its Q1 financial results. The company's revenue for the quarter was 748 million rupees, compared to 740 million rupees in the same quarter last year, showing a slight increase. However, NELCO's consolidated net profit for Q1 decreased to 18 million rupees from 46 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752486021000,
            "Source": "result"
        },
        {
            "Title": "NELCO Receives National VSAT Virtual Network Operator Authorization",
            "Summary": "NELCO has obtained a National-level VSAT Virtual Network Operator Authorization under its current Unified License from the Department of Telecommunications. This authorization allows NELCO to operate as a virtual network operator for VSAT (Very Small Aperture Terminal) services on a national scale.",
            "Sentiment": "positive",
            "PublishDate": 1750143062000,
            "Source": "default"
        },
        {
            "Title": "Nelco Reports Q4 FY23 Financial Results",
            "Summary": "Nelco reported a consolidated net loss of 41 million rupees in Q4, an improvement from 61 million rupees loss year-over-year. Revenue decreased to 675 million rupees from 816.1 million rupees in the same quarter last year. The company's profit before tax (PBT) was 13 million rupees, down from 81 million rupees year-over-year. Nelco has a deferred tax of 15 million rupees. The company has recommended a dividend of 1 rupee per share.",
            "Sentiment": "neutral",
            "PublishDate": 1745540085000,
            "Source": "default"
        },
        {
            "Title": "NELCO Reports Q4 Results and Dividend Announcement",
            "Summary": "NELCO has announced its Q4 results and dividend. The company recommended a dividend of 1 rupee per share. Q4 PBT decreased to 13M rupees from 81M year-over-year. Q4 EBITDA fell to 66M rupees from 147.2M, with EBITDA margin dropping to 9.82% from 18.04%. The company also reported a deferred tax of 15M rupees.",
            "Sentiment": "negative",
            "PublishDate": 1745504643000,
            "Source": "result"
        },
        {
            "Title": "NELCO Reports Q4 Financial Results",
            "Summary": "NELCO has reported its Q4 financial results. The company posted a consolidated net loss of 41 million rupees, an improvement from the 61 million rupee loss in the same quarter last year and the 50 million rupee loss in the previous quarter. However, Q4 revenue declined to 675 million rupees from 816.1 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1745504480000,
            "Source": "result"
        },
        {
            "Title": "NELCO Ltd: Board Meeting Set for Q4 Results and Dividend Decision",
            "Summary": "NELCO Ltd has scheduled a board meeting for April 24, 2025, to review Q4 and FY2025 financial results and consider dividend declaration. The trading window is closed from March 25, 2025, until 48 hours after results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1744790449000,
            "Source": "corporate_action"
        },
        {
            "Title": "NELCO to Consider Q4 Results on April 24",
            "Summary": "NELCO, a company in the telecommunications sector, has announced that it will consider its fourth quarter (Q4) financial results on April 24. This is a routine corporate event where the company will review and potentially approve its financial performance for the last quarter of its fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744780630000,
            "Source": "default"
        },
        {
            "Title": "NELCO Reports Improved Q3 EBITDA and Margin",
            "Summary": "NELCO, an Indian telecommunications company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 189.5 million rupees, up from 163 million rupees in the same quarter of the previous year. Additionally, NELCO's EBITDA margin improved to 23.48%, compared to 19.61% in the year-ago period, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1736932948000,
            "Source": "earnings"
        },
        {
            "Title": "NELCO Reports Q3 Revenue of 807 Million Rupees",
            "Summary": "NELCO, a telecommunications company, has reported its third-quarter revenue of 807 million rupees. This represents a slight decrease from the previous year's figure of 832 million rupees for the same quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1736932913000,
            "Source": "earnings"
        },
        {
            "Title": "NELCO Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "NELCO, an Indian telecommunications company, has reported a consolidated net profit of 50 million rupees for the third quarter, compared to 62 million rupees in the same period last year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1736932884000,
            "Source": "earnings"
        },
        {
            "Title": "Nelco Reports Q2 Results and Satellite Outage Impact",
            "Summary": "Nelco announced its Q2 consolidated net profit of 41 million rupees, down from 57 million year-over-year and 46 million quarter-over-quarter. Q2 revenue increased to 825 million rupees from 767 million year-over-year. The company reported that Intelsat's IS33e satellite experienced a power outage on October 19, 2024, and will not be recovered. Nelco has initiated backup plans to migrate affected customers to alternative satellite capacity, stating there will be no material financial impact.",
            "Sentiment": "neutral",
            "PublishDate": 1729556903000,
            "Source": "result"
        },
        {
            "Title": "NELCO Implements Backup Plans for Customer Migration",
            "Summary": "NELCO has initiated backup plans to migrate affected customers to alternative satellite capacity. The company states that there will be no significant financial impact from this action.",
            "Sentiment": "neutral",
            "PublishDate": 1729510022000,
            "Source": "corporate_action"
        },
        {
            "Title": "NELCO Reports Intelsat IS33E Satellite Power Outage and Failure",
            "Summary": "NELCO announced that Intelsat's IS33E satellite experienced a power outage on October 19, 2024. The satellite operator confirmed on October 20 that the satellite cannot be recovered.",
            "Sentiment": "negative",
            "PublishDate": 1729510014000,
            "Source": "corporate_action"
        },
        {
            "Title": "NELCO Reports Decline in Q2 EBITDA and Margin",
            "Summary": "NELCO, an Indian telecommunications company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased from 139 million rupees in the previous year to 108 million rupees this year. Additionally, NELCO's EBITDA margin fell from 18.15% to 13.13% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1729505343000,
            "Source": "result"
        },
        {
            "Title": "NELCO Reports Q2 Revenue Growth",
            "Summary": "NELCO, an Indian telecommunications company, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 825 million rupees, up from 767 million rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729505335000,
            "Source": "result"
        },
        {
            "Title": "NELCO Reports Q2 Financial Results",
            "Summary": "NELCO, an Indian telecommunications company, has reported its consolidated net profit for the second quarter. The company's net profit stands at 41 million rupees, showing a decrease from 57 million rupees year-over-year and a slight decrease from 46 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729505323000,
            "Source": "result"
        }
    ]
}