{
    "Symbol": "NEOGEN",
    "ISIN": "INE136S01016",
    "News": [
        {
            "Title": "Neogen Chemicals Gets Rs 60 Cr Insurance Payout",
            "Summary": "Neogen Chemicals receives third insurance payment of Rs 60 crore for fire damage at Dahej facility, bringing total on-account claims to Rs 140 crore with replacement plant commissioning planned for Q1 FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1770904482481,
            "Source": "stocks"
        },
        {
            "Title": "Neogen Chemicals Receives Customs Penalty Order",
            "Summary": "Neogen Chemicals receives customs penalty order totaling ₹1.23 crore from Commissioner of Customs, Raigad for non-fulfillment of export obligations under advance authorization scheme for FY 17-18 and 18-19.",
            "Sentiment": "negative",
            "PublishDate": 1770825993945,
            "Source": "stocks"
        },
        {
            "Title": "Neogen Chemicals Q3 FY26 Results Show Mixed Performance",
            "Summary": "Neogen Chemicals reported Q3 FY26 standalone net profit of ₹8.77 crore, down from ₹14.41 crore YoY, despite revenue growth to ₹215.60 crore. Nine-month performance remained resilient.",
            "Sentiment": "neutral",
            "PublishDate": 1770821514817,
            "Source": "co_actions_results"
        },
        {
            "Title": "Neogen Chemicals Grants 50,200 ESOPs in Tranche II",
            "Summary": "Neogen Chemicals Limited's NRC approved granting 50,200 stock options to 55 employees in Tranche II at Rs. 1,183.14 per option and vested 4,650 options from Tranche I under ESOP Scheme 2024.",
            "Sentiment": "positive",
            "PublishDate": 1770792529276,
            "Source": "co_actions_results"
        },
        {
            "Title": "Neogen Chemicals Board Meet on Feb 11 for Q3 Results",
            "Summary": "Neogen Chemicals has scheduled a board meeting on February 11, 2026, to consider Q3FY26 unaudited financial results and evaluate fund raising proposals through various instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1770387144119,
            "Source": "co_actions_results"
        },
        {
            "Title": "Neogen Chemicals Promoter Transfers 57.78 Lakh Shares",
            "Summary": "Haridas Thakarshi Kanani, Chairman Emeritus of Neogen Chemicals, transferred 57,78,500 equity shares (21.90% stake) to family trusts through off-market gift transactions on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767342917882,
            "Source": "co_actions_results"
        },
        {
            "Title": "Neogen Chemicals Promoter Transfers 26.38 Lakh Shares",
            "Summary": "Beena Haridas Kanani, promoter group member of Neogen Chemicals, transferred 26.38 lakh equity shares (10% stake) to Beena Kanani Family Trust through off-market gift transaction on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767338751224,
            "Source": "co_actions_results"
        },
        {
            "Title": "Neogen Chemicals Subsidiary Forms Joint Venture with Japan's Morita Investment for Electrolyte Salt Production",
            "Summary": "Neogen Ionics Limited, a wholly owned subsidiary of Neogen Chemicals Limited, has concluded a joint venture agreement with Japan's Morita Investment Limited to produce solid LiPF6 salt for lithium-ion battery electrolytes in India. The joint venture company Neogen Morita New Materials Limited will see NIL holding 80% stake while MIL contributes 20 million for a 20% stake, marking one of the first Indo-Japan collaborations in lithium-ion battery materials space.",
            "Sentiment": "positive",
            "PublishDate": 1764338262729,
            "Source": "order&deals"
        },
        {
            "Title": "Neogen Chemicals Reports 8% Revenue Growth Despite Fire Impact, Battery Business Faces Delays",
            "Summary": "Neogen Chemicals achieved 8% revenue growth to INR 209 crore in Q2 FY26 with 16% gross profit improvement, though EBITDA and PAT were affected by elevated costs from the Dahej plant fire incident. The company's battery chemicals business faces delays with revised guidance of INR 30-40 crore for FY26 (down from INR 300 crore) due to slower Indian gigafactory ramp-ups and delayed customer approvals, while forming a strategic Indo-Japan joint venture for lithium-ion battery materials.",
            "Sentiment": "neutral",
            "PublishDate": 1763365334597,
            "Source": "earnings"
        },
        {
            "Title": "Neogen Chemicals Corrects Typographical Errors in Financial Results for Quarter Ended September 30, 2025",
            "Summary": "Neogen Chemicals Limited issued a corrigendum to correct typographical errors in Note No. 1 of its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company revised several financial ratios including Debt Service Coverage Ratio and Interest Service Coverage Ratio for both standalone and consolidated results. For standalone results, the trailing twelve months DSCR was corrected from 2.11 to 2.38, and trailing twelve months ISCR was corrected from 3.59 to 2.51. For consolidated results, the quarterly DSCR was revised from 0.75 to 0.97 for the quarter and from 0.99 to 1.44 for the half year, while trailing twelve months DSCR was corrected from 0.77 to 1.99. The company stated that these were not material errors and do not impact the financial statements in any manner.",
            "Sentiment": "neutral",
            "PublishDate": 1762830405730,
            "Source": "earnings"
        },
        {
            "Title": "Neogen Chemicals Reports Mixed Q2 Results, Receives Regulatory Fine Notice",
            "Summary": "Neogen Chemicals Limited announced its quarterly results for the quarter ended September 30, 2025, with revenue from operations at ₹206.68 crore compared to ₹186.54 crore in the same period last year. The company reported a profit after tax of ₹9.31 crore for the quarter. The Board also noted receipt of fine notices from BSE and NSE totaling ₹1,69,920 for non-compliance with Regulation 17(1A) regarding special resolution requirements for director continuation post age 75. The company has applied for waiver of the fine and is awaiting response from the exchanges. During the half-year period, the company received ₹80.92 crore from insurance claims related to the March 2025 fire incident at its Dahej plant. The company also issued ₹200 crore worth of non-convertible debentures in August 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762609580561,
            "Source": "earnings"
        },
        {
            "Title": "Neogen Chemicals Appoints Non-Promoter Family Member as Chairman for First Time",
            "Summary": "Neogen Chemicals Limited has appointed Anurag Surana as Non-Executive Chairman, marking the first time in the company's history that a non-promoter family member holds the Chairperson role. The board also appointed Sanjay Mehta as Chairman of subsidiary Neogen Ionics Limited and TCN Sai Krishnan as Executive Director. These changes follow Haridas Kanani's retirement as Chairman and Managing Director after completing 80 years of age, with his appointment as Chairman Emeritus. The company has separated the positions of Chairman and Managing Director to enhance corporate governance practices. Surana brings over 35 years of specialty chemical industry experience, while Mehta is a Chartered Accountant with over 45 years of experience. The appointments are designed to enhance separation of ownership and control while ensuring independent oversight.",
            "Sentiment": "positive",
            "PublishDate": 1761320115036,
            "Source": "corporate_governance"
        },
        {
            "Title": "Neogen Chemicals Forms Joint Venture With Morita for Lithium-Ion Battery Component Production",
            "Summary": "Neogen Chemicals has established a joint venture with Morita to manufacture LiPF₆, a key component used in lithium-ion batteries. The partnership, named Neogen Ionics, will be owned 80% by Neogen Chemicals and 20% by Morita. This venture positions the companies to participate in the lithium-ion battery supply chain through the production of this specialized chemical compound.",
            "Sentiment": "positive",
            "PublishDate": 1756695641256,
            "Source": "order&deals"
        },
        {
            "Title": "Neogen Chemicals Raises Rs 200 Crore Through Private Placement of Non-Convertible Debentures",
            "Summary": "Neogen Chemicals Limited allotted 20,000 non-convertible debentures worth Rs 200 crore through private placement. The NCDs have a face value of Rs 1 lakh each and carry an interest rate of 10.50% per annum payable monthly. The debentures have a tenure of 30 months with maturity date of February 12, 2028. The issue was fully subscribed by 7 investors. The NCDs are secured by subservient charges on the company's present and future assets, including immovable properties in Vadodara and Bharuch, Gujarat. The debentures will be listed on BSE Limited's Wholesale Debt Market segment. Principal repayment will be made at maturity, while interest payments are scheduled monthly except for the last payment which will be clubbed with principal redemption.",
            "Sentiment": "positive",
            "PublishDate": 1754982200775,
            "Source": "corporate_action"
        },
        {
            "Title": "Neogen Chemicals Reports 4% Revenue Growth Despite Dahej Plant Fire Impact in Q1FY26",
            "Summary": "Neogen Chemicals achieved revenue of INR 186.7 crore in Q1FY26, up 4% year-on-year, despite the Dahej plant remaining unavailable throughout the quarter due to a fire incident. The company maintained EBITDA at INR 31.5 crore with margins of 18.8% on standalone basis. Neogen Ionics contributed INR 5.4 crore in revenue. The company received INR 50.55 crore insurance claim in June and additional INR 30 crore in July, with net claim receivable of INR 268.27 crore remaining. Recovery efforts are progressing with the replacement plant's civil foundation work completed and equipment orders placed. Chairman Haridas Kanani will retire on September 30, 2025, and will become Chairman Emeritus from October 1. Anurag Surana has been designated as Chairman and Non-Executive Director. The company is advancing its battery chemicals expansion with INR 506 crore deployed out of total INR 1,500 crore CAPEX for the Pakhajan facility. A joint venture with Morita Chemical Industries is progressing for lithium salt production. The Board approved raising INR 200 crore through NCDs for additional liquidity during ongoing CAPEX projects.",
            "Sentiment": "positive",
            "PublishDate": 1754569440718,
            "Source": "earnings"
        },
        {
            "Title": "Neogen Chemicals Reports Q1 FY26 Results with Revenue Growth Despite Dahej Plant Fire",
            "Summary": "Neogen Chemicals reported quarterly results with consolidated revenue of INR 186.7 crore, up 4% from INR 180.0 crore in the same quarter last year. The company achieved this growth despite its Dahej plant being unavailable for the entire quarter due to a fire incident. EBITDA increased 2% to INR 31.5 crore with margins at 16.9%. However, PAT declined 11% to INR 10.3 crore. The company received INR 80.55 crore in insurance claims to date, with net claim receivable of INR 268.27 crore. Neogen Ionics, the battery chemicals subsidiary, generated revenue of INR 5.4 crore in the quarter. The board approved raising up to INR 200 crore through non-convertible debentures. Chairman Haridas Kanani will retire on September 30, 2025, and Anurag Surana will become Chairman from October 1, 2025. The replacement Dahej plant is under construction and expected to be operational next year.",
            "Sentiment": "neutral",
            "PublishDate": 1754152591981,
            "Source": "earnings"
        },
        {
            "Title": "Neogen Chemicals Chairman Haridas Kanani to Retire September 30, 2025; Board Approves Leadership Transition",
            "Summary": "Neogen Chemicals Limited announced that Chairman and Managing Director Haridas Kanani will retire on September 30, 2025, and will be conferred with the honorary title of 'Chairman Emeritus' from October 1, 2025. The Board approved Anurag Surana's designation as Chairman and Non-Executive Non-Independent Director, and recommended the appointment of Triplicane Commandoor Narasimhan Saikrishnan as Executive Director for a five-year term. Additionally, Shyamsunder Upadhyay was re-appointed as Whole Time Director for three years. The company reported quarterly results for the period ended June 30, 2025, with standalone revenue of Rs 184.58 crores and profit of Rs 14.23 crores. The Board also approved the 36th Annual General Meeting for September 26, 2025, and granted additional corporate guarantee of Rs 125 crores for wholly owned subsidiary Neogen Ionics Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754137225875,
            "Source": "corporate_governance"
        },
        {
            "Title": "Neogen Chemicals Incorporates Step-Down Subsidiary for Lithium-Ion Battery Materials Market",
            "Summary": "Neogen Chemicals has incorporated a step-down subsidiary to enter the lithium-ion battery materials market. The move represents the company's strategic expansion into the battery materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1753961233093,
            "Source": "stock"
        },
        {
            "Title": "Neogen Chemicals Receives Insurance Payment for Fire Damage",
            "Summary": "Neogen Chemicals has received a 300 million rupees insurance payment for fire damage. The company estimates that reconstruction will take 9-12 months.",
            "Sentiment": "neutral",
            "PublishDate": 1752672815000,
            "Source": "default"
        },
        {
            "Title": "Neogen Chemicals: Board Approves ₹200 Crore NCD Issuance",
            "Summary": "Neogen Chemicals' board approved raising up to ₹200 crore through NCDs with a 36-month tenure. The company also received a fine of ₹3,61,080 from BSE for non-compliance with SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1752321014000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neogen Chemicals Board Approves ₹200 Crore Fundraising via NCDs",
            "Summary": "The Board of Directors of Neogen Chemicals has approved raising ₹200 crore through the issuance of Non-Convertible Debentures (NCDs). This decision represents a significant corporate financial action, potentially aimed at securing funds for the company's operations or expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1752318768000,
            "Source": "default"
        },
        {
            "Title": "Neogen Chemicals Plans to Raise Funds Through Non-Convertible Debentures",
            "Summary": "Neogen Chemicals has announced plans to raise funds through the issuance of Non-Convertible Debentures (NCDs). This financial instrument allows the company to borrow money from investors without the obligation to convert the debt into equity shares. The decision indicates that Neogen Chemicals is seeking to increase its capital, potentially for expansion, debt refinancing, or other corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1752069104000,
            "Source": "default"
        },
        {
            "Title": "India Initiates Anti-Dumping Investigation on Bromine OTBN Imports from China",
            "Summary": "India has launched an anti-dumping investigation into the import of Bromine OTBN (Ortho Tert Butyl Nitrobenzene) from China. This action is likely to affect Neogen Chemicals, a company mentioned in the news. The investigation aims to determine if these imports are being sold at unfairly low prices in the Indian market, potentially harming domestic producers.",
            "Sentiment": "neutral",
            "PublishDate": 1751426834000,
            "Source": "default"
        },
        {
            "Title": "Neogen Chemicals: Revenue Target Adjusted After Fire Incident",
            "Summary": "Neogen Chemicals revises FY26 revenue target to Rs 775-850 crore due to a fire at its Gujarat facility. The company plans Rs 1,500 crore capex over two years, with a focus on electrolyte production. FY27 revenue guidance set at Rs 1,000-1,100 crore, with potential for Rs 2,500-3,000 crore from electrolytes by FY28 or FY29.",
            "Sentiment": "neutral",
            "PublishDate": 1747884082000,
            "Source": "normal_news"
        },
        {
            "Title": "Neogen Chemicals Develops Lithium-Ion Battery Material Segment and Reports Fire Incident Losses",
            "Summary": "Neogen Chemicals is developing a new lithium-ion battery material segment, which is expected to contribute to sustained growth. The company also reported losses from a fire incident, with inventory loss estimated between Rs 160-180 crores. The replacement value of the loss due to the fire is estimated at Rs 200-225 crores, which will be fully capitalized.",
            "Sentiment": "neutral",
            "PublishDate": 1747712103000,
            "Source": "default"
        },
        {
            "Title": "Neogen Chemicals Revises Financial Guidance and Projections",
            "Summary": "Neogen Chemicals has updated its financial guidance and projections during a conference call. The company revised its FY26 revenue projection to Rs 775-850 crores due to a fire incident, with an expected EBITDA margin of 17-18%. For FY27, EBITDA margins are expected to range from 15-20% depending on lithium prices. The company's battery chemicals segment guidance has been adjusted to around Rs 300 crores, down from the initial Rs 300-500 crores. Neogen Chemicals is targeting four-digit revenue in the next year, contingent on electrolyte market share and salt volume ramp-up. The total capex for Neogen Ionics in the battery space is expected to be Rs 1,500 crores, with potential revisions to be announced later.",
            "Sentiment": "neutral",
            "PublishDate": 1747711679000,
            "Source": "default"
        },
        {
            "Title": "Neogen Chemicals to Invest 20 Million Yen in Japanese Subsidiary",
            "Summary": "Neogen Chemicals has announced plans to invest 20 million Japanese Yen in its subsidiary, NCL Japan. This investment indicates the company's commitment to expanding its presence in the Japanese market and potentially strengthening its international operations.",
            "Sentiment": "positive",
            "PublishDate": 1742947872000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neogen Chemicals to Invest 20 Million Yen in NCL Japan",
            "Summary": "Neogen Chemicals has announced plans to invest 20 million Japanese Yen in NCL Japan. This investment suggests the company is expanding its operations or strengthening its presence in the Japanese market.",
            "Sentiment": "positive",
            "PublishDate": 1742906657000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neogen Chemicals: Revenue Guidance Cut After Dahej Plant Fire",
            "Summary": "Neogen Chemicals has revised its FY25 and FY26 revenue guidance downward following a fire at its Dahej plant. FY25 guidance is now Rs 765-800 crore, down from Rs 800-825 crore. FY26 guidance is reduced to Rs 775-850 crore from Rs 950-1,000 crore. The fire caused extensive damage to the MPP3 facility, tank farms, and warehouse. Reconstruction may take 9-12 months. The company plans to shift critical production to other sites and expand its Patancheru plant to minimize impact.",
            "Sentiment": "negative",
            "PublishDate": 1741525767000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neogen Chemicals: Major Fire at Gujarat Plant Halts Production",
            "Summary": "A fire broke out at Neogen Chemicals' Dahej SEZ plant in Gujarat, causing temporary production suspension. No casualties reported. Insurance claim filed, damage assessment pending. Other plants unaffected. Shares dropped 4% following the news.",
            "Sentiment": "negative",
            "PublishDate": 1741157310000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neogen Chemicals: Q3 Profit Soars, Stock Jumps 10%",
            "Summary": "Neogen Chemicals reported a significant increase in Q3 net profit to Rs 10 crore from Rs 1.1 crore year-over-year. Revenue rose 22.5% to Rs 201 crore, surpassing estimates. Operating profit surged 70.7% to Rs 34.6 crore, with margins improving to 17.2%. The stock price initially jumped 9.71% before settling at a 5.16% gain.",
            "Sentiment": "positive",
            "PublishDate": 1738556584000,
            "Source": "earnings"
        }
    ]
}