{
    "Symbol": "NESCO",
    "ISIN": "INE317F01035",
    "News": [
        {
            "Title": "Nesco Opens Special Window for Physical Share Transfer",
            "Summary": "Nesco Limited announces special window for transfer and dematerialisation of physical securities from February 05, 2026 to February 04, 2027, following SEBI circular for shares sold/purchased prior to April 01, 2019.",
            "Sentiment": "neutral",
            "PublishDate": 1770141735587,
            "Source": "stocks"
        },
        {
            "Title": "NESCO Q3 Revenue Rises 20.8% Despite Profit Decline",
            "Summary": "NESCO reported Q3 revenue of ₹2.5 billion, up from ₹2.07 billion year-on-year, while net profit declined to ₹1.04 billion from ₹1.1 billion in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1769530154307,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nesco Ltd Completes Routine GST Search by Maharashtra Tax Office",
            "Summary": "Nesco Limited announces completion of routine GST search by Maharashtra State tax office with full cooperation extended, no further material updates requiring disclosure under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766225178500,
            "Source": "stocks"
        },
        {
            "Title": "Nesco Limited Presents Investor Deck at Kotak Midcap Conference 2025",
            "Summary": "Nesco Limited shared its investor presentation ahead of participating in the Kotak Midcap Conference 2025 at Grand Hyatt, Mumbai. The presentation showcases the company's diversified portfolio across IT parks, exhibition centers, events, food services, engineering, and wayside amenities with strategic expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1763558813265,
            "Source": "stock"
        },
        {
            "Title": "NESCO Reports Higher Q2 Revenue and Profit Despite Margin Decline",
            "Summary": "NESCO reported quarterly net profit of 1.2 billion rupees compared to 1.1 billion rupees in the same period last year. Revenue increased to 2.4 billion rupees from 1.9 billion rupees year-over-year. EBITDA rose to 1.4 billion rupees from 1.2 billion rupees, though EBITDA margin decreased to 57.32% from 62.24% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762442902050,
            "Source": "earnings"
        },
        {
            "Title": "NESCO Abandons Two South Zone Sites Due to Feasibility Issues, Proceeds with One Location for ₹75 Crore Investment",
            "Summary": "NESCO has abandoned two locations in the South Zone for its NHLML Wayside Amenities Project due to feasibility problems. The company will proceed with developing one site, requiring an investment of ₹75 crore. The project is expected to generate annual revenue of ₹115 crore starting from the fourth year of operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762182177844,
            "Source": "stock"
        },
        {
            "Title": "Nesco Limited Releases Investor Presentation for Equirus Annual India Conference 2025",
            "Summary": "Nesco Limited announced its participation in the Equirus Annual India Conference 2025 scheduled for August 19, 2025, in Mumbai and released an investor presentation ahead of the event. The company reported total income of ₹845 crores for FY2025 with year-over-year growth of 7.9%, EBITDA of ₹551 crores (3.8% YOY growth), and PAT of ₹375 crores (3.4% YOY growth). The company operates across multiple business segments including IT parks with Towers 3 and 4 achieving 100% occupancy rates, housing 25,000+ employees from clients like MSCI, HSBC, PwC, and BlackRock. The exhibition and events business generated ₹174 crores in income with 100+ exhibitions held during FY2024-25. Nesco received Intimation of Disapproval from BMC for Tower 2 in its IT park, which will span approximately 5.01 million sq. ft. of constructed area and offer 1.65 million sq. ft. of chargeable office space. The company has entered the wayside amenities sector, being awarded 11 sites across express highways with an estimated capex of ₹400 crores. Nesco operates with 100% renewable energy across its IT park operations and maintains various certifications including LEED IGBC Platinum and Great Place to Work certification.",
            "Sentiment": "positive",
            "PublishDate": 1755526598117,
            "Source": "stock"
        },
        {
            "Title": "NESCO Limited Passes All Six Resolutions at 66th Annual General Meeting",
            "Summary": "NESCO Limited conducted its 66th Annual General Meeting on July 30, 2025, through video conference, where all six proposed resolutions were approved with requisite majority. The approved resolutions included adoption of audited standalone and consolidated financial statements, declaration of dividend of ₹6.50 per equity share (325% on face value of ₹2), reappointment of Mrs. Sudha S. Patel as Director, appointment of secretarial auditor with remuneration approval, and ratification of cost auditors' remuneration for financial year ending March 31, 2026. The meeting had 64 shareholders in attendance, including 7 from promoter group and 57 from public. Remote e-voting was conducted from July 26-29, 2025, with 44,713 total shareholders on record date of July 23, 2025. All resolutions received overwhelming support, with most achieving nearly 100% approval rates, except for the director reappointment which received 99.76% approval.",
            "Sentiment": "positive",
            "PublishDate": 1753954800350,
            "Source": "corporate_action"
        },
        {
            "Title": "NESCO Reports 37.5% Jump in Net Profit to 960 Million Rupees",
            "Summary": "NESCO reported a net profit of 960 million rupees in its quarterly results, representing a significant increase from 698 million rupees in the same period last year. This marks a year-over-year growth of approximately 37.5% in the company's bottom line performance.",
            "Sentiment": "positive",
            "PublishDate": 1753856522224,
            "Source": "earnings"
        },
        {
            "Title": "NESCO Reports Q4 Results and Declares Final Dividend",
            "Summary": "NESCO has announced its Q4 financial results and dividend declaration. The company's Q4 revenue increased to 1.92 billion rupees from 1.89 billion rupees year-over-year. However, EBITDA decreased to 1.07 billion rupees from 1.17 billion rupees, with EBITDA margin falling to 55.56% from 62.06%. Net profit for Q4 declined to 886.2 million rupees from 1.05 billion rupees year-over-year and 1.1 billion rupees quarter-over-quarter. The company has recommended a final dividend of 6.50 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747414044000,
            "Source": "result"
        },
        {
            "Title": "NESCO Reports Q3 EBITDA Growth with Slight Margin Decline",
            "Summary": "NESCO has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.25 billion rupees, up from 1.14 billion rupees in the same quarter of the previous year. However, the EBITDA margin decreased to 60.73% from 64.04% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738257206000,
            "Source": "earnings"
        },
        {
            "Title": "NESCO Reports Q3 Revenue Growth",
            "Summary": "NESCO has announced its third quarter financial results, reporting revenue of 2.07 billion rupees. This represents an increase from the 1.78 billion rupees reported in the same quarter of the previous year, indicating year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738257197000,
            "Source": "earnings"
        },
        {
            "Title": "NESCO Reports Q3 Net Profit Increase",
            "Summary": "NESCO has reported a net profit of 1.1 billion rupees for the third quarter, showing an increase from 937 million rupees year-over-year and 1.07 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738257190000,
            "Source": "earnings"
        },
        {
            "Title": "Nesco Ltd: Secures Rs 300 Crore Annual Revenue Contract for Highway Amenities",
            "Summary": "Nesco Ltd. won a contract from National Highways Logistics Management Ltd. to develop and operate wayside amenities on the Raipur-Visakhapatnam Expressway. The 30-year lease project has an estimated annual revenue potential of Rs 300 crore from the fourth year of operations. The company will invest approximately Rs 200 crore to develop four sites within 10 months.",
            "Sentiment": "positive",
            "PublishDate": 1736932920000,
            "Source": "order&deals"
        },
        {
            "Title": "NESCO Expects Significant Revenue Boost from New Sites",
            "Summary": "NESCO has announced that it anticipates an annualized revenue of 3 billion rupees from four new sites, starting from the fourth year of operations. This additional revenue is expected to increase the company's overall revenue by 40%.",
            "Sentiment": "positive",
            "PublishDate": 1736930660000,
            "Source": "corporate_action"
        },
        {
            "Title": "NESCO Expects 3 Billion Rupees Annual Revenue from 4 Sites",
            "Summary": "NESCO has announced that it anticipates an estimated annualized revenue of 3 billion rupees from four operational sites. This revenue projection is expected to be realized from the fourth year of operations at these sites.",
            "Sentiment": "positive",
            "PublishDate": 1736930522000,
            "Source": "earnings"
        },
        {
            "Title": "NESCO Secures Highest Bid for Wayside Amenities on Raipur-Visakhapatnam Expressway",
            "Summary": "NESCO has been declared the highest bidder for developing wayside amenities on the Raipur-Visakhapatnam Expressway. The total development cost for each site is estimated at 500 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736930494000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nesco Ltd.: Wins Rs 350 Crore Revenue Potential Project from NHAI Unit",
            "Summary": "Nesco Ltd. secured a contract from National Highways Logistics Management Ltd. to develop, operate, and maintain wayside amenities on the Bengaluru-Chennai Expressway Corridor. The project spans three sites with a 30-year lease and potential 30-year extension. Estimated development cost is Rs 225 crore with expected annual revenue of Rs 350 crore from the fourth year of operations.",
            "Sentiment": "positive",
            "PublishDate": 1736181744000,
            "Source": "order&deals"
        },
        {
            "Title": "NESCO Wins Bid for Wayside Amenities on Bengaluru-Chennai Expressway",
            "Summary": "NESCO has been declared the highest bidder for wayside amenities on the Bengaluru-Chennai Expressway. The total development cost is estimated at 750 million rupees per site. The company expects to generate an estimated annualized revenue of 3.50 billion rupees from the fourth year of operations.",
            "Sentiment": "positive",
            "PublishDate": 1736171832000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nesco Ltd: Former Director Settles Disclosure Violation Case with Sebi",
            "Summary": "Manu M Parpia, ex-independent director of Nesco Ltd, settled a case with Sebi for alleged violation of disclosure norms by paying ₹21.45 lakh. Parpia was accused of serving beyond his tenure and providing misleading declarations.",
            "Sentiment": "neutral",
            "PublishDate": 1735741285000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NESCO Wins Bid for National Highways Logistics Management Project",
            "Summary": "NESCO has been declared the highest bidder by National Highways Logistics Management for a project involving four sites. The estimated annualized revenue from these sites is expected to be 3 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734002431000,
            "Source": "order&deals"
        },
        {
            "Title": "NESCO Reports Q2 EBITDA Growth",
            "Summary": "NESCO has announced its Q2 financial results. The company's EBITDA increased to 1.2 billion rupees, up from 1.09 billion rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 62.24% from 62.37% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730110119000,
            "Source": "result"
        },
        {
            "Title": "NESCO Reports Q2 Revenue Growth",
            "Summary": "NESCO, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 1.9 billion rupees, up from 1.75 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730110111000,
            "Source": "result"
        },
        {
            "Title": "NESCO Reports Q2 Net Profit Increase",
            "Summary": "NESCO has reported a net profit of 1.1 billion rupees for the second quarter, showing a year-over-year increase from 878 million rupees and a quarter-over-quarter increase from 698 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730110103000,
            "Source": "result"
        }
    ]
}