{
    "Symbol": "NESTLEIND",
    "ISIN": "INE239A01024",
    "News": [
        {
            "Title": "Nestlé India Q3FY26: Record Sales Growth of 18.5%",
            "Summary": "Nestlé India achieves highest quarterly turnover of ₹5,643.5 crore with 18.5% sales growth, declares ₹7 interim dividend, and announces key leadership appointments for Q3FY26.",
            "Sentiment": "positive",
            "PublishDate": 1769762683147,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nestlé India Wins Supreme Court Tax Case Worth ₹101.21 Cr",
            "Summary": "Supreme Court dismisses Income Tax authority appeals against Nestlé India regarding general licensing fees disallowances spanning 1996-2008, involving ₹101.21 crores in disputed claims.",
            "Sentiment": "positive",
            "PublishDate": 1769012692733,
            "Source": "stocks"
        },
        {
            "Title": "Nestlé India Names New CFO Effective March 2026",
            "Summary": "Nestlé India nominates Edouard Mac Nab as Executive Director-Finance & Control and CFO from March 1, 2026, succeeding Svetlana Boldina. Mac Nab brings 25+ years of international finance experience.",
            "Sentiment": "positive",
            "PublishDate": 1768571549286,
            "Source": "stocks"
        },
        {
            "Title": "Nestlé India Sets Record Date for FY26 Interim Dividend",
            "Summary": "Nestlé India announces February 6, 2026 as record date for interim dividend consideration, with Board meeting scheduled for January 30, 2026 to decide on dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768562486595,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nestle CMD on Volume-Driven FMCG Growth",
            "Summary": "Nestle Co CMD shares views on volume-driven growth potential for FMCG sector, though specific details and context require additional information for comprehensive coverage.",
            "Sentiment": "neutral",
            "PublishDate": 1766982127367,
            "Source": "stocks"
        },
        {
            "Title": "Nestlé India Board Meeting Set for Q3 FY26 Results",
            "Summary": "Nestlé India announces Board meeting on January 30, 2026, to consider Q3 FY26 financial results. Trading window closed from January 1 to February 1, 2026 for compliance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765972687687,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldman Sachs Maintains Neutral on Nestle at ₹1,230",
            "Summary": "Goldman Sachs maintains its 'Neutral' rating on Nestle with a price target of ₹1,230, reflecting the investment bank's balanced outlook on the FMCG major's current market position.",
            "Sentiment": "neutral",
            "PublishDate": 1765375549469,
            "Source": "stocks"
        },
        {
            "Title": "Nestle India Receives GST Order for Tax Period 2018-23 from Chennai Commissioner",
            "Summary": "Nestle India received an order from the Office of the Commissioner of GST and Central Excise, Chennai, confirming demand for tax of INR 8,28,36,108, applicable interest, and penalty of INR 8,28,36,108 for tax period 2018-23. The company states there is no material impact on financials or operations and will explore options to challenge the order.",
            "Sentiment": "negative",
            "PublishDate": 1764673321351,
            "Source": "stock"
        },
        {
            "Title": "Nestle India Appoints Mandeep Chhatwal as Additional Non-Executive Director",
            "Summary": "Nestle India's Board of Directors approved the appointment of Mandeep Chhatwal as Additional Director (Non-Executive) effective January 1, 2026, subject to shareholder approval. Chhatwal, currently CFO for Zone Asia, Oceania Africa at Nestle's global headquarters, brings over 30 years of finance sector experience and previously worked at Nestle India from 1989 to 2004.",
            "Sentiment": "positive",
            "PublishDate": 1763663288709,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nestle HR Head Anurag Patnaik Announces Departure for New Career Opportunity",
            "Summary": "Anurag Patnaik, HR Head at Nestle, has announced his departure from the company to pursue a new career opportunity.",
            "Sentiment": "neutral",
            "PublishDate": 1762786918783,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nestle India Plans 6% Workforce Reduction Due to Global Changes",
            "Summary": "Nestle India announced plans to reduce its workforce by 6% as part of global organizational changes. The company is implementing this workforce reduction strategy in response to broader global developments affecting its operations.",
            "Sentiment": "negative",
            "PublishDate": 1761642684452,
            "Source": "stock"
        },
        {
            "Title": "Nestle India Q2 Results: Revenue Rises 10.6% to 56.44B Rupees, Net Profit Falls 24% to 7.5B Rupees",
            "Summary": "Nestle India reported Q2 revenue of 56.44 billion rupees, up from 51.04 billion rupees year-over-year, exceeding estimates of 52.85 billion rupees. Net profit declined to 7.5 billion rupees from 9.86 billion rupees in the same period last year, though it surpassed estimates of 7.10 billion rupees. EBITDA increased to 12.36 billion rupees from 11.7 billion rupees year-over-year, matching estimates. However, EBITDA margin compressed to 21.9% from 22.9% in the previous year, falling short of the estimated 22.10%. The company expects double-digit sales growth driven by volume expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1760595995667,
            "Source": "earnings"
        },
        {
            "Title": "Nestlé India Reports 10.9% Sales Growth with Record Domestic Sales of ₹5,411 Crore in Q2 FY26",
            "Summary": "Nestlé India's Board approved quarterly results for the second quarter ended September 30, 2025. The company achieved total sales of ₹5,630.2 crore with 10.9% growth, while domestic sales grew 10.8% to reach ₹5,411 crore, marking the highest quarterly domestic sales on record. The growth was volume-led with three out of four product groups delivering strong double-digit growth. Profit after tax stood at ₹753.2 crore with earnings per share of ₹3.90. EBITDA margin was 22.0% of sales. Key product segments showed strong performance: Confectionery grew driven by KITKAT market share gains, Powdered and Liquid Beverages delivered high double-digit growth led by NESCAFÉ, and Prepared Dishes registered strong growth with MAGGI Noodles achieving double-digit volume growth. The company added a new MAGGI Noodles production line at its Sanand Factory in Gujarat and launched several new product variants across categories.",
            "Sentiment": "positive",
            "PublishDate": 1760595971250,
            "Source": "earnings"
        },
        {
            "Title": "Nestle India Quarterly Results Preview: Revenue Growth Expected Despite Margin Pressures from Coffee and Palm Oil Costs",
            "Summary": "Nestle India is set to announce quarterly results with analysts expecting mixed performance across segments. Revenue is projected to rise 5.4% year-on-year to Rs 5,350.48 crore, driven by price hikes in premium categories and GST rate cuts. However, margin pressures persist due to elevated coffee and palm oil input costs, with EBITDA margin expected to contract to 22.3% from 23.4% previously. The company has implemented price cuts of 3-23% across products following GST reductions, though temporary destocking by trade partners may impact near-term volumes. Brokerage firms maintain neutral to hold ratings with target prices ranging from Rs 1,117 to Rs 1,585. Key concerns include coffee price increases of 3% and palm oil prices up 18% from lows. Volume growth is expected in low to mid-single digits, with domestic sales projected to rise 2.5% and export revenues growing 5-6%. The company's largest segment, milk and nutrition accounting for 43% of revenue, continues to face challenges from competition and regulatory restrictions.",
            "Sentiment": "neutral",
            "PublishDate": 1760510143935,
            "Source": "earnings"
        },
        {
            "Title": "Nestlé India Announces Senior Management Restructuring Effective January 2026",
            "Summary": "Nestlé India announced senior management changes due to internal reorganization, effective January 1, 2026. Key appointments include Vineet Singh leading the combined Nutrition and Dairy portfolio, Gopichandar Jagatheesan heading Confectionery and Cereals, and Varun Gupta taking on Supply Chain plus Exports & Imports. Varun Sethuraman moves to Head - Marketing Communications, while Himmat Singh will oversee Corporate Affairs, Sustainability & Societal Initiatives. Dhwani Rao becomes General Counsel and Head - Legal & Compliance. Five executives will step out of their roles on December 31, 2025, including Manav Sahni, Chandan Mukherji, Vasudevan Krishnan, Taruna Saxena, and T S Venkateswaran. All changes are subject to necessary approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1760093820549,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nestle India Adds New Maggi Noodles Production Line at Gujarat Factory",
            "Summary": "Nestle India Limited has added a new Maggi Noodles production line at its Sanand Factory in Gujarat. The expansion increases production capacity by approximately 20,600 tons per annum, with an investment of about ₹85 crore financed through internal accruals. The existing capacity at the facility is 121,000 tons per annum with approximately 80% utilization. The capacity addition is scheduled for Financial Year 2025-26 and is part of the company's planned capital expenditure in greenfield and brownfield projects between 2020-2025 to increase overall capacities to meet future demand. The company also manufactures Maggi Noodles at other manufacturing locations.",
            "Sentiment": "positive",
            "PublishDate": 1759338425807,
            "Source": "stock"
        },
        {
            "Title": "Nestle India Signs Investment Agreement with Food Processing Ministry for Odisha Operations",
            "Summary": "Nestle India entered into an agreement with the Food Processing Ministry during the World Food India Summit. The agreement covers investments in Odisha and the company's existing manufacturing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1759240466272,
            "Source": "stock"
        },
        {
            "Title": "Nestlé India Nominates Mandeep Chhatwal as Non-Executive Director from January 2026",
            "Summary": "Nestlé India Limited has nominated Mandeep Chhatwal to be appointed as a non-executive director effective from January 1, 2026, subject to approvals. Chhatwal serves as CFO for Zone Asia, Oceania & Africa at Nestlé's global headquarters in Vevey, Switzerland. He holds an MBA from IIM Ahmedabad and brings over 30 years of finance sector experience. Chhatwal began his career at Nestlé India in 1989, developing financial capabilities across factory and sales operations before moving to other Nestlé Group markets in 2004. His previous roles include CFO positions at Nestlé Sri Lanka and Nestlé Philippines, Global Head of Financial Services, and Head of Corporate Finance & Deputy Treasurer. Since 2021, he has overseen the finance function across 112 countries in the Asia, Oceania & Africa region. The proposal will be placed before the Board of Directors at the upcoming meeting for consideration, following recommendation from the Nomination and Remuneration Committee.",
            "Sentiment": "positive",
            "PublishDate": 1758903163571,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nestlé Schedules Third Quarter Results Review for October 16",
            "Summary": "Nestlé has announced it will review its third quarter results on October 16. The company has set this date for the quarterly results presentation.",
            "Sentiment": "neutral",
            "PublishDate": 1758786275134,
            "Source": "global"
        },
        {
            "Title": "Nestlé India Passes GST Rate Reduction Benefits to Consumers",
            "Summary": "Nestlé India announced it will pass on benefits from recent GST rate reductions directly to consumers starting September 22, 2025. Chairman and Managing Director Manish Tiwary described the GST rate reduction as a positive step that will stimulate consumption and contribute to economic growth. The company has communicated these changes through announcements in national and regional newspapers, as well as to wholesalers, distributors, and retailers to ensure transparency.",
            "Sentiment": "positive",
            "PublishDate": 1758534568223,
            "Source": "stock"
        },
        {
            "Title": "TCS Leads Dividend Payments While Valuations Vary Across Top Dividend Stocks",
            "Summary": "TCS delivered the highest cumulative dividend payment of Rs 649.5 per share over the last decade with a 145.74% return since April 1, 2015. The company shows attractive valuations with a one-year forward PE of 21.04 versus five-year average of 29.12, indicating 18% return potential. Bajaj Auto recorded the highest return of 351.21% with Rs 610 cumulative dividend but shows minimal 0.4% return potential due to current valuations. Infosys paid Rs 313.5 cumulative dividend with 177.78% return and favorable valuations suggesting 15.4% return potential. HUL and Nestle, despite strong historical performance with cumulative dividends of Rs 308.5 and returns of 196.7% for HUL, show negative return potential of 7.7% and 5.6% respectively due to high current valuations, with forward PEs of 53.59 and 64.26 times.",
            "Sentiment": "neutral",
            "PublishDate": 1757651622184,
            "Source": "stock"
        },
        {
            "Title": "GST Rate on Biscuits Reduced to 5%",
            "Summary": "The GST rate on biscuits has been reduced to 5%. The article mentions conflicting information about the previous rate, stating both 12% and 18% as the earlier GST rate before the reduction.",
            "Sentiment": "positive",
            "PublishDate": 1756193606672,
            "Source": "sectoral"
        },
        {
            "Title": "Nestlé India Shareholders Approve 1:1 Bonus Share Issue and Authorized Capital Increase",
            "Summary": "Nestlé India held an Extraordinary General Meeting on July 24, 2025, where shareholders approved two key resolutions. The company received approval to issue bonus equity shares in a 1:1 ratio by capitalizing up to ₹96.42 crore from retained earnings. Shareholders also approved increasing the authorized share capital from ₹100 crore to ₹200 crore by creating an additional 100 crore equity shares of ₹1 each. The bonus issue aims to improve share liquidity and broaden the shareholder base, with over 45,000 members holding single shares set to benefit. As of March 31, 2025, the company's retained earnings stood at ₹4,008.95 crore. The meeting was conducted virtually with participation from 221 members holding a total of 606,914,845 equity shares. Both resolutions were passed with requisite majority, with voting results showing over 97% approval for both agenda items.",
            "Sentiment": "positive",
            "PublishDate": 1755524042933,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestle India Shares Drop 50% Due to 1:1 Bonus Issue Implementation",
            "Summary": "Nestle India shares fell over 50% on Friday due to the implementation of its 1:1 bonus issue, not a market crash. The stock closed at Rs 2,235.60 on Thursday and opened at Rs 1,124.95 on Friday, reflecting the bonus adjustment that doubles shareholding while halving the stock price. This marks the first bonus issue in Nestle India's history. The company aims to enhance stock liquidity and improve affordability for retail investors. Shareholders maintain the same total portfolio value despite the per-share price drop. Bonus shares will be credited to demat accounts on August 12, with trading beginning August 13. Nestle India reported quarterly results showing a 13.4% decline in consolidated profit after tax to Rs 647 crore, while revenue from operations increased 6% to Rs 5,096 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1754632676019,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestle India Sets Record Date for First-Ever 1:1 Bonus Issue",
            "Summary": "Nestle India has set August 8 as the record date for its first-ever bonus share issue, with August 7 being the last day for investors to purchase shares to qualify for the 1:1 bonus. Shareholders will receive one free share for every share held, effectively doubling the outstanding shares. The bonus issue aims to reward long-term shareholders and improve stock accessibility. In its quarterly results, Nestle India reported a 13.4% decline in profit after tax to Rs 647 crore, while revenue from operations increased 6% to Rs 5,096 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754535174532,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestle India Announces First-Ever 1:1 Bonus Issue with Record Date Set for August 8",
            "Summary": "Nestle India's board has recommended its first-ever bonus share issue in a 1:1 ratio at face value of Re 1 each, with the record date set for August 8. Shareholders must hold shares in their demat accounts by the record date to be eligible for the bonus allotment. Under India's T+1 settlement cycle, investors need to purchase shares at least one trading day before the record date. The company previously issued a final dividend of Rs 10 per equity share for fiscal 2025 with payout completed on July 26. Nestle India shares closed 1.20% higher at Rs 2,276.50, outperforming the NSE Nifty 50 which fell 0.82%. The stock has declined 8.35% over the past 12 months but gained nearly 5% year-to-date. Among 40 analysts covering the company, eight recommend 'buy', 20 suggest 'hold', and 12 advise 'sell', with the average 12-month consensus price target indicating a 4.7% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1754212647338,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestlé India Chairman and Managing Director Suresh Narayanan to Retire",
            "Summary": "Nestlé India Limited announced the retirement of Mr. Suresh Narayanan from his position as Chairman and Managing Director, effective July 31, 2025, after a 26-year career with the Nestlé Group. The company described it as a well-deserved retirement following his illustrious tenure. The announcement was made through a regulatory disclosure to BSE and NSE stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753968928338,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nestle India Sees Urban Recovery Signaling End to Consumption Slowdown",
            "Summary": "Nestle India's Chairman and Managing Director Suresh Narayanan stated that urban consumption is recovering and the worst of the slowdown may be over, citing recent data showing urban demand outpacing rural growth. He attributed the improvement to controlled inflation, positive economic growth outlook, favorable monsoons, and continued infrastructure spending. Urban demand is critical for Nestle as it represents 80% of the company's sales. The company had previously identified consumption stress, with growth in the consumer goods space dropping from 13-14% to 2-3% over recent quarters. Narayanan noted that regional competitors have gained market share and consumers are experimenting more with brands while increasing spending on travel and experiences. To address these changes, Nestle has launched around 150 new products over the last decade, contributing 7-8% of sales, with innovation pace now three to four times faster than previously.",
            "Sentiment": "positive",
            "PublishDate": 1753666626147,
            "Source": "stock"
        },
        {
            "Title": "Urban Consumption Recovery Signals Turnaround for Nestle India After Demand Slowdown",
            "Summary": "The consumer goods sector is showing signs of recovery after experiencing a significant slowdown, with growth declining from 13-14% to 2-3% over several quarters. Urban consumption growth has now surpassed rural growth, driven by successful inflation control and positive economic forecasts. This recovery is particularly significant for Nestle India, which derives 80% of its sales from urban markets. Consumer behavior has shifted, with less brand loyalty and increased willingness to experiment, while regional competition is affecting market share. Nestle is responding by accelerating innovation 3-4 times faster than before, focusing on maintaining brand relevance for products like Maggi and KitKat, pursuing premiumization, and leveraging digital channels. The company sees substantial opportunities ahead despite the changing consumption landscape.",
            "Sentiment": "positive",
            "PublishDate": 1753530622836,
            "Source": "stock"
        },
        {
            "Title": "Nestle India Q1 Results: Strong Brand Performance Overshadowed by Margin Pressure and Profit Decline",
            "Summary": "Nestle India reported mixed quarterly results with revenue growing 5.9% year-on-year to Rs 5,096 crore, meeting estimates. However, the company faced significant bottom-line challenges as Ebitda fell 1.3% to Rs 1,100 crore, missing consensus expectations of Rs 1,181 crore, while net profit dropped 11.7% to Rs 659 crore. The decline was attributed to higher input costs, operating expenses, and finance charges. Despite margin pressures, popular brands showed strong performance with double-digit growth in KitKat, Maggi, and beverages/confectionery segments returning to volume-led growth. E-commerce now contributes 12.5% of domestic sales. However, the milk and nutrition segments remained weak. Gross margin contracted 250 basis points year-on-year, leading to Ebitda margin hitting a 3-year low of 20.8%. Major brokerages Macquarie, Jefferies, and Morgan Stanley maintained cautious ratings, citing margin concerns and premium valuations. The company announced a leadership transition with Manish Tiwary taking over as CMD from August 1, replacing Suresh Narayanan after his decade-long tenure.",
            "Sentiment": "negative",
            "PublishDate": 1753415148161,
            "Source": "earnings"
        },
        {
            "Title": "Nestle India Approves 1:1 Bonus Share Issue and Doubles Authorized Share Capital to ₹200 Crore",
            "Summary": "Nestle India held an Extraordinary General Meeting on July 24, 2025, to approve two key resolutions. The company approved the issuance of bonus equity shares in a 1:1 ratio, meaning shareholders will receive one bonus share for every existing share held, by capitalizing up to ₹96.42 crore from retained earnings. The meeting also approved increasing the authorized share capital from ₹100 crore to ₹200 crore, along with corresponding amendments to the company's Memorandum of Association. The EGM was conducted through video conferencing from 3:00 PM to 4:00 PM, chaired by Suresh Narayanan, Chairman and Managing Director. Remote e-voting was available from July 21-23, 2025, with additional voting facility provided during the meeting. The voting results will be submitted to stock exchanges separately.",
            "Sentiment": "positive",
            "PublishDate": 1753364319909,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestlé India Appoints Manish Tiwary as Chairman and Managing Director",
            "Summary": "Nestlé India Limited has appointed Manish Tiwary as Chairman and Managing Director, effective August 1, 2025. The 55-year-old executive brings nearly three decades of experience in e-commerce and consumer goods sectors. Tiwary holds a B.Tech in Computer Science and an MBA from IIM Bangalore. He joined Nestlé India as Managing Director (Designate) in February 2025 and became Key Managerial Personnel in April 2025. His appointment as Managing Director was approved by members at the 66th Annual General Meeting held in June 2025. Prior to joining the company, Tiwary worked briefly at Nestlé S.A. as Special Project Manager for Zone - Asia Oceania and Africa, spent over eight years as Country Manager at Amazon India, and had a twenty-year career at Unilever in various sales, marketing, and general management roles across India, the Gulf, and North Africa.",
            "Sentiment": "positive",
            "PublishDate": 1753363243091,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nestlé Reports 3% Domestic Volume Growth in Q1, Meets Market Estimates",
            "Summary": "Nestlé achieved 3% growth in domestic volume for Q1, which aligned with market estimates of 2-3%. The company's performance met analyst expectations for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753340686094,
            "Source": "global"
        },
        {
            "Title": "Nestlé India Reports 5.9% Sales Growth in Q1 FY26; Manish Tiwary Appointed New Chairman",
            "Summary": "Nestlé India Limited reported quarterly results for the first quarter ended 30th June 2025, with total sales of INR 5,074 crore, representing 5.9% growth. Domestic sales grew 5.5% to INR 4,860 crore. Net profit reached INR 659.2 crore with earnings per share of INR 6.84. EBITDA stood at 21.7% of sales. The company achieved volume-led growth in three out of four product categories - Prepared Dishes and Cooking Aids, Powdered and Liquid Beverages, and Confectionery. Seven out of twelve top brands recorded double-digit growth. The quarter was impacted by elevated commodity prices and higher operational costs due to manufacturing expansion. E-commerce contributed 12.5% of domestic sales. The Board appointed Mr. Manish Tiwary as Chairman and Managing Director effective 1st August 2025, replacing Mr. Suresh Narayanan who retires on 31st July 2025. A final dividend of INR 10 per equity share for financial year 2024-25 will be paid from 24th July 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753339065785,
            "Source": "earnings"
        },
        {
            "Title": "Nestle India Reports Decline in Q1 Revenue and Profit",
            "Summary": "Nestle India reported Q1 revenue of 51 billion rupees, down from 58.1 billion rupees in the same period last year. The company's EBITDA stood at 11 billion rupees compared to 11.14 billion rupees year-over-year, falling short of the estimated 11.35 billion rupees. EBITDA margin decreased to 21.59% from 23.15% in the previous year, below the estimated 22.3%. Net profit dropped to 6.6 billion rupees from 7.5 billion rupees year-over-year, missing the estimated 7.5 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1753336893191,
            "Source": "earnings"
        },
        {
            "Title": "Nestlé Reports CHF 200M H1 Revenue with 2.9% Organic Growth, Targets CHF 0.7B Savings by 2025",
            "Summary": "Nestlé achieved CHF 200 million in global revenue for the first half with organic growth of 2.9%. The company increased pricing by 2.7%, exceeding the estimated 2.5%, while real internal growth reached 0.2%. The operating margin stands at 16.5%. Nestlé maintains its 2025 guidance despite facing increasing challenges and aims to achieve CHF 0.7 billion in savings by 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753333885902,
            "Source": "global"
        },
        {
            "Title": "Nestle India Q1 Results Preview: Analysts Expect 6.5% Revenue Growth Despite Margin Pressures",
            "Summary": "Nestle India is set to announce its quarterly results on Thursday. Bloomberg estimates project revenue growth of 6.5% to Rs 5,103 crore and Ebitda growth of 6% to Rs 1,181 crore, with margins at 23.1%. Net profit is expected to rise marginally by 0.6% to Rs 751 crore. Analysts cite rural recovery driving gradual volume growth toward low to mid-single digits, with rural areas outpacing urban demand recovery. The company has implemented significant price hikes to counter margin pressure from high input costs including palm oil and wheat. Analyst ratings vary from Goldman Sachs' Neutral (target Rs 2,335) to Nuvama's Buy (target Rs 2,825). Key factors include declining food inflation, potential income tax cuts supporting consumption recovery, and palm oil duty cuts from 20% to 10% benefiting raw material costs. Volume growth is projected at around 3%, with price increases of approximately 3% mainly in coffee and premium chocolates.",
            "Sentiment": "neutral",
            "PublishDate": 1753290642798,
            "Source": "earnings"
        },
        {
            "Title": "Nestle India to Announce Q1 Results on July 24",
            "Summary": "Nestle India will announce its first quarter results on July 24, 2025, when the Board of Directors meets to consider unaudited standalone and consolidated financial results for Q1FY26. The company's trading window for designated persons has been closed from July 1 to July 26. In the previous quarter (Q4FY25), Nestle India reported a 6.5% decline in consolidated net profit to Rs 873.46 crore, while total income increased 4.1% to Rs 5,512.32 crore. The company owns popular FMCG brands including Maggi, Nescafé, Milkybar and Milkmaid. Nestle India shares have declined 1.32% in the past five trading sessions but gained 3.22% over the last month and 12.25% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1753245622112,
            "Source": "earnings"
        },
        {
            "Title": "Nestle India: Board Approves 1:1 Bonus Share Issuance",
            "Summary": "Nestle India's board has approved a 1:1 bonus share issuance, doubling the number of equity shares from 96.42 crore to 192 crore. The record date for eligibility will be announced later, subject to shareholder approval. The company also paid a final dividend of Rs 10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1751642492000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestle India: Expands Maggi Production with ₹105 Crore Investment",
            "Summary": "Nestle India is adding a new Maggi noodles production line at its Sanand factory in Gujarat, investing ₹105 crore. This expansion will increase the facility's capacity by about 20,300 tonnes per annum by FY26, part of the company's broader capital expenditure plan for 2020-2025.",
            "Sentiment": "positive",
            "PublishDate": 1751461664000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestle India Expands Maggi Noodles Production",
            "Summary": "Nestle India has added a new production line for Maggi noodles. The expansion requires an investment of 1.05 billion rupees, which will be funded through the company's internal earnings.",
            "Sentiment": "positive",
            "PublishDate": 1751459023000,
            "Source": "default"
        },
        {
            "Title": "Nestle India: Shares Rally 4% on First-Ever 1:1 Bonus Issue Announcement",
            "Summary": "Nestle India's board approved a 1:1 bonus share issue, the company's first ever. Shares surged 3.7% this week, reaching Rs 2,453.95 on BSE. Bonus shares will be credited within two months, by August 25, 2025. The record date for shareholder eligibility is yet to be announced.",
            "Sentiment": "positive",
            "PublishDate": 1751003785000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestle to Release Q1 Results on July 24",
            "Summary": "Nestle has announced that it will release its first quarter results on July 24.",
            "Sentiment": "neutral",
            "PublishDate": 1750942457000,
            "Source": "default"
        },
        {
            "Title": "Nestle India: First-Ever 1:1 Bonus Share Issue Approved",
            "Summary": "Nestle India Ltd. has approved its first-ever bonus issue of equity shares in a 1:1 ratio. Major beneficiaries include promoters Maggi Enterprises Ltd. (28.48% stake) and Nestle SA (34.28% stake), along with retail investors holding 9.33% of shares.",
            "Sentiment": "positive",
            "PublishDate": 1750913418000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestlé Announces 1:1 Bonus Share Issue",
            "Summary": "Nestlé has announced a bonus share offering at a ratio of 1:1. This means shareholders will receive one additional share for each share they currently hold, effectively doubling their shareholding without any additional cost.",
            "Sentiment": "positive",
            "PublishDate": 1750912574000,
            "Source": "default"
        },
        {
            "Title": "Nestle India: Board Considers First-Ever Bonus Share Issue",
            "Summary": "Nestle India's board meets on June 26 to consider issuing bonus shares for the first time. This follows a recent 1:10 stock split in January 2024. The company has paid ₹42.5 per share in dividends since the split. Nestle India was recently excluded from the BSE Sensex index.",
            "Sentiment": "positive",
            "PublishDate": 1750894357000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestle India: Board to Consider Bonus Share Issue on June 26",
            "Summary": "Nestle India's board will meet on June 26, 2025, to consider issuing bonus shares. The trading window for the company's securities will be closed from June 19 to June 28. Nestle India and IndusInd Bank will be removed from BSE Sensex on June 23, replaced by Trent and Bharat Electronics.",
            "Sentiment": "positive",
            "PublishDate": 1750387279000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestlé Board to Discuss Bonus Shares on June 26",
            "Summary": "Nestlé has scheduled a board meeting for June 26 to discuss the issuance of bonus shares. This corporate action, if approved, would involve distributing additional shares to existing shareholders at no cost.",
            "Sentiment": "neutral",
            "PublishDate": 1750330585000,
            "Source": "default"
        },
        {
            "Title": "Nestle India: Board to Consider First-Ever Bonus Share Issue",
            "Summary": "Nestle India's board will consider issuing bonus shares on June 26, marking the company's first such action in its history. This follows a stock split in January 2024 and recent dividend payments totaling ₹42.5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1750330391000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nestle India: LIC Increases Stake to Over 5%",
            "Summary": "Life Insurance Corp. (LIC) has increased its stake in Nestle India Ltd. to 5.001% through a market purchase of 1.49 lakh shares. The transaction took place on Friday, raising LIC's ownership from 4.986% to 5.001%.",
            "Sentiment": "neutral",
            "PublishDate": 1748254705000,
            "Source": "block_deals"
        }
    ]
}