{
    "Symbol": "NETWEB",
    "ISIN": "INE0NT901020",
    "News": [
        {
            "Title": "Netweb Technologies Uploads Q3 FY26 Earnings Call",
            "Summary": "Netweb Technologies India Limited has uploaded the audio recording of its Q3 FY2025-26 earnings call held on January 19, 2026, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768831041472,
            "Source": "co_actions_results"
        },
        {
            "Title": "Netweb Technologies Block Trade Worth ₹24.08 Crores",
            "Summary": "Netweb Technologies India Ltd. witnessed a significant block trade on NSE worth ₹24.08 crores involving 70,402 shares at ₹3,419.70 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767597550034,
            "Source": "co_actions_results"
        },
        {
            "Title": "Netweb Tech Maintains 35-40% Organic Growth Target and 13-14% EBITDA Margin Guidance",
            "Summary": "Netweb Tech has reaffirmed its organic growth forecast of 35-40% CAGR, which excludes strategic orders. The company maintains its EBITDA margin target of 13-14% as it transitions toward larger scalable orders. These updates were shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1762227534881,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Reports Strong H1 FY26 Performance with 30.2% ROCE and 22.4% ROE",
            "Summary": "Netweb Technologies India Limited, a leading high-end computing solutions provider, released its strategy presentation for quarterly and half-yearly results ended September 30, 2025. The company reported strong financial metrics with ROCE of 30.2% and ROE of 22.4% for H1 FY26. Revenue composition shows government customers at 51.0% versus non-government at 49.0%. The company operates across four main segments: supercomputing/HPC systems, private cloud and hyperconverged infrastructure, AI systems, and high-performance storage solutions. Netweb has deployed over 600 HPC systems, 60 private cloud installations, and 7,000 accelerator/GPU-based AI systems. The company maintains partnerships with Nvidia and qualifies for PLI benefits under the IT Hardware Policy. Key clients include government defense, educational institutes, financial services, and large enterprises across various sectors.",
            "Sentiment": "positive",
            "PublishDate": 1761997902144,
            "Source": "corporate_action"
        },
        {
            "Title": "Netweb Technologies Reports Quarterly Financial Results for September 2025",
            "Summary": "Netweb Technologies India Limited announced its unaudited standalone financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the results in a meeting held on November 1, 2025. The company reported revenue from operations of ₹471.71 million for the quarter ended September 30, 2025, compared to ₹710.70 million in the previous quarter and ₹471.04 million in the same quarter last year. Profit after tax for the quarter was ₹30.99 million. For the half year ended September 30, 2025, revenue from operations stood at ₹1,182.41 million with profit after tax of ₹69.66 million. The company's earnings per share for the quarter was ₹3.55 (basic) and ₹3.35 (diluted). The company changed its accounting policy for valuation of raw materials, finished goods and work in progress from FIFO to moving weighted average cost method effective April 1, 2024. The results were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1761992062238,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Technologies Partners With Bud Ecosystem For AI Infrastructure Development In India",
            "Summary": "Netweb Technologies has entered into a partnership with Bud Ecosystem to develop affordable AI infrastructure in India. The collaboration aims to make AI infrastructure more accessible and cost-effective in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1759977638581,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Shares Surge 19% in One Week on Strong AI Orders and Market Growth",
            "Summary": "Netweb Technologies shares jumped 19% over the past week, reaching a 52-week high of Rs 4,426.90. The stock has gained 131% in three months and 46% in 2025. The rally is driven by significant contract wins, including a Rs 450 crore AI infrastructure deal and a Rs 1,734 crore order for Nvidia-powered servers under the IndiaAI Mission. The company's order book stands at Rs 4,142 crore. Profit after tax doubled to Rs 30.5 crore in Q1, with the AI segment now representing 29% of revenue compared to 7% two years ago. Analysts project India's AI infrastructure market to reach Rs 8,700 crore by FY28, while Netweb's revenue is expected to grow at 36.7% CAGR to Rs 2,938 crore by FY28. The company has expanded manufacturing capabilities and is developing AI GPU systems through partnerships with Nvidia and other firms.",
            "Sentiment": "positive",
            "PublishDate": 1759736145695,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Shares Surge 6% to Record High, Rally Continues for Third Session",
            "Summary": "Netweb Technologies shares reached a new record high of Rs 4,316 on NSE, gaining 6% in the latest session and extending gains for a third consecutive day with a 20% weekly jump. The high-performance computing company has surged 175% over six months. The rally is driven by India's digital infrastructure shift, rising internet traffic, AI adoption, and data localization policies. Ventura Securities projects India's AI infrastructure market to reach Rs 8,700 crore by FY28 at 29.5% CAGR, while estimating Netweb's revenue to grow at 36.7% CAGR to Rs 2,938 crore by FY28. Growth catalysts include a new SMT facility launched in May 2024, AI GPU system development with Nvidia and partners, and recent major contract wins including a Rs 450 crore AI infrastructure deal and a Rs 1,734 crore contract for Nvidia-powered servers under the IndiaAI Mission.",
            "Sentiment": "positive",
            "PublishDate": 1759471140251,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Shares Hit Record High, Surge 170% in Six Months",
            "Summary": "Netweb Technologies shares jumped 13% to a record high of Rs 4,108 on Wednesday, extending gains of over 80% in a month and 170% in six months. The rally is driven by India's digital infrastructure shift, rising internet traffic, AI adoption, and data localization policies. Ventura Securities projects India's AI infrastructure market to reach Rs 8,700 crore by FY28 at 29.5% CAGR, with private cloud and HCI hitting Rs 14,100 crore at 28.5% CAGR. Ventura expects Netweb's revenue to grow at 36.7% CAGR to Rs 2,938 crore by FY28, supported by AI systems and enterprise workstations projected at 50.9% CAGR to Rs 588 crore. Growth catalysts include a new SMT facility launched in May 2024, AI GPU systems development with Nvidia and Skylus.ai, and recent order wins including a Rs 450 crore AI infrastructure deal and a Rs 1,734 crore contract for Nvidia-powered servers under the IndiaAI Mission.",
            "Sentiment": "positive",
            "PublishDate": 1759298118348,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Stock Doubles in 6 Months on AI and Data Centre Growth",
            "Summary": "Netweb Technologies has delivered a 115% rally in six months, driven by order wins, government digital initiatives, and India's expanding data centre sector. The company recently secured significant contracts including a Rs 450 crore order for AI infrastructure deployment and a Rs 1,734 crore contract for NVIDIA-powered servers under the IndiaAI Mission. Ventura Securities projects India's AI infrastructure market could reach Rs 8,700 crore by FY28 with 29.5% CAGR growth. The brokerage expects Netweb's revenues to grow at 36.7% CAGR to Rs 2,938 crore by FY28, led by AI systems and enterprise workstations forecast to grow at 50.9% CAGR. Key growth drivers include a new SMT facility launched in May 2024 and partnerships with Nvidia for AI GPU systems development. The stock reached a fresh high of Rs 3,545.80, breaking past Rs 3,100 resistance levels. However, risks include dependence on imported components and exposure to supply chain disruptions and regulatory compliance challenges.",
            "Sentiment": "positive",
            "PublishDate": 1758608492470,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Shares Fall 5% After Record High Despite Rs 450 Crore AI Systems Order",
            "Summary": "Netweb Technologies' share price declined over 5% on Tuesday, dropping to Rs 3,355.40 before recovering to trade 1.39% lower at Rs 3,486.20. This decline came a day after the stock hit an all-time high with an 8.53% surge following a major order announcement. The company secured a Rs 450 crore contract to supply Tyrone AI GPU Accelerated Systems from a large Indian-headquartered global technology distribution provider, with execution scheduled by end of financial year 2025-26. Netweb Technologies specializes in high-end computing solutions including supercomputing systems, private cloud infrastructure, AI systems, and enterprise workstations with over 20 years of experience. The stock has gained 33.25% over the past 12 months. All three analysts tracking the company maintain buy ratings, though the average 12-month consensus price target suggests a 20.3% downside.",
            "Sentiment": "neutral",
            "PublishDate": 1758607587492,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Secures Rs. 450 Crore Order for AI GPU Systems",
            "Summary": "Netweb Technologies has secured a Rs. 450 crore order for Tyrone AI GPU accelerated systems from a leading Indian tech distributor. The order represents a significant contract win for the company in the artificial intelligence hardware segment.",
            "Sentiment": "positive",
            "PublishDate": 1758500511056,
            "Source": "order&deals"
        },
        {
            "Title": "Netweb Technologies Secures Rs. 450 Crore Order for AI GPU Systems",
            "Summary": "Netweb Technologies India Limited received a purchase order worth approximately Rs. 450 crores (excluding taxes) for supplying Tyrone AI GPU Accelerated Systems. The order comes from one of the largest Indian-headquartered global providers of technology distribution and integrated supply chain solutions. The contract involves deployment of AI infrastructure facility using Tyrone AI GPU-accelerated systems and is scheduled for execution by the end of FY 2025-26. The order is from a domestic entity and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1758286993018,
            "Source": "order&deals"
        },
        {
            "Title": "Goldman Sachs Asset Management International Reduces Stake in Netweb Technologies to 3.423%",
            "Summary": "Goldman Sachs Asset Management International has reduced its shareholding in Netweb Technologies India Limited to 3.423% (1,939,035 shares) from 5.481% (3,073,077 shares). The reduction occurred through an open market sale of 1,134,042 equity shares on September 16, 2025. As a result of this transaction, Goldman Sachs Asset Management International has ceased to be a substantial shareholder of the company. The sale involved multiple entities including Goldman Sachs Asset Management, L.P, Goldman Sachs Asset Management B.V, and Goldman Sachs Asset Management (Singapore) Pte. Ltd. acting in concert. Netweb Technologies' total equity share capital stands at 56,653,868 shares valued at Rs. 113,307,736.",
            "Sentiment": "neutral",
            "PublishDate": 1758191246932,
            "Source": "corporate_action"
        },
        {
            "Title": "Netweb Technologies Shares Surge 50% in Six Days on AI Infrastructure Deal",
            "Summary": "Netweb Technologies shares climbed 7.4% to a 52-week high of Rs 3,312 on BSE, capping a six-day rally of 50%. The surge was driven by four key factors: a Rs 1,734 crore sovereign AI infrastructure order under India's IndiaAI Mission scheduled for execution between Q4 FY26 and H1 FY27, positive investor sentiment following the company's annual general meeting on August 30, strong quarterly earnings showing profit jumping to Rs 30.5 crore with operating income rising 102% to Rs 301.2 crore, and bullish technical indicators with the stock trading above all key moving averages. Revenue from AI systems increased 300% year-on-year, contributing 29% of operating income. The company reported EBITDA of Rs 44.8 crore with 14.9% margins and a net cash position of Rs 47.5 crore. Year-to-date, shares are up 10.3% and have gained 99.4% over six months.",
            "Sentiment": "positive",
            "PublishDate": 1757313436455,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Shares Surge 32% in Five Days on AI Order Win and Strong Fundamentals",
            "Summary": "Netweb Technologies shares climbed 9.7% to Rs 2,908.20, extending a five-day rally to nearly 32%. The surge was driven by four key factors: a Rs 1,734 crore sovereign AI infrastructure order under the IndiaAI Mission scheduled for execution between Q4 FY26 and H1 FY27, post-AGM optimism from management's AI-focused roadmap, strong technical indicators with the stock trading above all key moving averages, and robust quarterly earnings momentum. The company's June quarter results showed profit more than doubling to Rs 30.5 crore, operating income surging 102% to Rs 301.2 crore, and AI systems revenue jumping 300% year-on-year to contribute 29% of operating income. EBITDA climbed 127% to Rs 44.8 crore with a 14.9% margin, and the company maintained a net cash position of Rs 47.5 crore.",
            "Sentiment": "positive",
            "PublishDate": 1757065319390,
            "Source": "stock"
        },
        {
            "Title": "Netweb Tech Secures ₹1,734 Crore Order for NVIDIA Blackwell Architecture Servers",
            "Summary": "Netweb Tech has secured a contract worth ₹1,734 crore for supplying servers equipped with NVIDIA's advanced Blackwell architecture. The order is expected to increase the company's annual revenue by over 60%.",
            "Sentiment": "positive",
            "PublishDate": 1756876283540,
            "Source": "order&deals"
        },
        {
            "Title": "Netweb Technologies Files Appeal Against Rs 1.06 Crore Customs Duty Demand",
            "Summary": "Netweb Technologies India Limited filed an appeal with the Customs, Excise and Service Tax Appellate Tribunal (CESTAT) against a customs duty demand of Rs. 1,05,94,991. The appeal was filed against an order dated 08.05.2025 passed by the Commissioner of Customs Audit under the Customs Act 1962 for differential custom duty. The company stated that this legal action has no material impact on its financials, operations, or other activities.",
            "Sentiment": "neutral",
            "PublishDate": 1755168414599,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Reports Strong Q1 FY26 Results with 102% Revenue Growth",
            "Summary": "Netweb Technologies India Limited reported robust quarterly results with revenue from operations growing 102% year-on-year to Rs. 3,012 million. Operating EBITDA increased 127% year-on-year to Rs. 448 million with a margin of 14.9%, while profit after tax grew 100% year-on-year to Rs. 305 million with a 10.1% margin. The company successfully executed a large AI order in the defense sector during the quarter. AI systems contributed 29% of operating revenue with 300% year-on-year growth. The company launched Skylus.ai, a GPU orchestration platform for AI infrastructure deployment. Management maintained revenue growth guidance of 35-40% and expects AI to represent around 22% of total revenue by year-end, up from the previous 20% guidance. The company operates across three segments: high-performance computing, private cloud, and AI systems. Current order book stands at Rs. 230 crore with L1 orders of Rs. 460 crore, totaling around Rs. 700 crore. The pipeline is approximately Rs. 4,000 crore with a 60% conversion ratio. Government contributed 60% of total revenue while enterprise accounted for 40%. The company maintains zero debt with net free cash of Rs. 475.2 million and expects EBITDA margins around 14% with PAT margins between 10-10.5%.",
            "Sentiment": "positive",
            "PublishDate": 1754373059667,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Tech Reports 300% AI Revenue Growth, Raises Segment Guidance to 22%",
            "Summary": "Netweb Tech reported significant growth in its AI business during Q1 FY26, with AI revenue surging 300% year-over-year and contributing 29% of total operating revenue. The company successfully executed a large AI order in the defense sector. Management raised AI segment contribution guidance from 20% to 22% of total business. For Q1 AI systems revenue, approximately 23-24% came from government clients while the remainder was from enterprise customers. The company maintains revenue growth guidance of 35-40% and expects export revenue to be 5-6% for the current year, growing to around 10% within 2-3 years. EBITDA margin guidance remains at around 14% with PAT margin guidance of 10-10.5%.",
            "Sentiment": "positive",
            "PublishDate": 1754279008605,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Reports Strong AI-Driven Growth with ₹4,600 Crore Level 1 Wins",
            "Summary": "Netweb Technologies has experienced significant growth driven by AI-related projects, securing over ₹4,600 crore in Level 1 wins. The company is positioning itself as a leader in 'Make in India' GPU servers and has announced plans for global expansion. The growth is attributed to rising demand across defense, cloud, and large language model (LLM) sectors.",
            "Sentiment": "positive",
            "PublishDate": 1753971163095,
            "Source": "stock"
        },
        {
            "Title": "Netweb Technologies Approves Cost Auditor Appointment and Schedules AGM for August 30, 2025",
            "Summary": "Netweb Technologies India Limited's Board of Directors approved the appointment of M/s. Sunny Chhabra & Co. as Cost Auditor for FY 2025-26. The company scheduled its 26th Annual General Meeting for August 30, 2025, at 3:00 PM through video conferencing. The register of members will remain closed from August 23-30, 2025, with August 22, 2025 set as the record date for final dividend eligibility for FY 2024-25. Remote e-voting will be available from August 26-29, 2025. The company released quarterly unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs 3,023.17 million compared to Rs 1,532.05 million in the previous year quarter. Profit for the period was Rs 416.06 million versus Rs 204.08 million in the corresponding previous quarter. The company operates in the computer servers business segment.",
            "Sentiment": "positive",
            "PublishDate": 1753956244315,
            "Source": "corporate_action"
        },
        {
            "Title": "NETWEB Reports Strong Q1 Performance with Doubled Revenue and Net Profit",
            "Summary": "NETWEB delivered robust quarterly results with net profit reaching 305 million rupees compared to 154 million rupees in the same period last year. Revenue doubled to 3 billion rupees from 1.5 billion rupees year-over-year. EBITDA increased significantly to 448 million rupees versus 197 million rupees previously, while EBITDA margin improved to 14.9% from 13.2% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753955424051,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Technologies Schedules Post-Results Conference Call for August 1, 2025",
            "Summary": "Netweb Technologies India Limited will host a post-results conference call on August 1, 2025, at 3:30 PM IST to discuss financial results for the quarter ended June 30, 2025. The call will feature key management personnel including Chairman & MD Sanjay Lodha, Whole Time Director Navin Lodha, CFO Ankit Kumar Singhal, and Chief Sales and Marketing Officer Hirdey Vikram. The company has provided dial-in numbers for participants from India and international locations including the USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753274648194,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Technologies: Q4 Profit Surges 42%, Shares Hit One-Month High",
            "Summary": "Netweb Technologies India Ltd. reported a 42% increase in Q4 net profit to Rs 42.9 crore, with revenue growing 24.2% to Rs 415 crore. EBIT rose 38.6% to Rs 56.6 crore, with margin expanding to 13.6%. The company highlighted AI as a major growth driver, contributing 14.8% to revenue with a 112.0% yearly increase. Shares surged over 18% in response to the results.",
            "Sentiment": "positive",
            "PublishDate": 1746422183000,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Technologies: Q4 Profit Surges 45%, Declares 125% Dividend",
            "Summary": "Netweb Technologies reported a 45% increase in Q4 FY25 net profit to ₹43 crore, with revenue up 55.9% to ₹414.6 crore. The company's AI systems segment saw significant growth, and it declared a 125% dividend of ₹2.5 per share. Netweb also received its first claim under the PLI Scheme 2.0 for IT hardware.",
            "Sentiment": "positive",
            "PublishDate": 1746420856000,
            "Source": "result"
        },
        {
            "Title": "Netweb Technologies India Reports Strong Q4 Financial Results",
            "Summary": "Netweb Technologies India Ltd has announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 429 million rupees, up from 296 million rupees year-over-year and 303 million rupees quarter-over-quarter. Revenue also saw substantial growth, reaching 4.14 billion rupees compared to 2.65 billion rupees year-over-year and 3.33 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746403476000,
            "Source": "default"
        },
        {
            "Title": "Netweb Technologies: Q4 Profit Soars 45%, Declares ₹2.5 Dividend",
            "Summary": "Netweb Technologies reported a 45% YoY increase in Q4 net profit to ₹429.9 million. Operating income rose 55.9% to ₹4.15 billion. Full-year income reached a record ₹11.58 billion, up 57.4%. AI systems segment grew 112% YoY. The company recommended a final dividend of ₹2.5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1746288100000,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Technologies: Shares Rebound 17% in Two Days After Eight-Day Decline",
            "Summary": "Netweb Technologies shares have recovered 17% in the last two trading sessions, regaining half of their losses from an eight-day decline. The company recently launched Skylus.ai, an AI resource management appliance. Netweb reported 60% revenue growth for the first nine months of FY2025 and has a strong order book.",
            "Sentiment": "positive",
            "PublishDate": 1740028137000,
            "Source": "normal_news"
        },
        {
            "Title": "Netweb Technologies Launches Skylus.AI for Easy GPU-Based AI Lab Setup",
            "Summary": "Netweb Technologies has introduced Skylus.AI, a new solution designed to simplify the process of setting up GPU-based AI lab infrastructure. This product aims to make it easier for organizations to establish and manage their artificial intelligence research and development environments.",
            "Sentiment": "positive",
            "PublishDate": 1739933472000,
            "Source": "corporate_action"
        },
        {
            "Title": "Netweb Technologies: Stock Surges 10% on AI Growth Prospects",
            "Summary": "Netweb Technologies' share price increased by 9.5% on the BSE, ending an eight-session losing streak. The surge is attributed to growth prospects related to the emergence of DeepSeek AI.",
            "Sentiment": "positive",
            "PublishDate": 1738123109000,
            "Source": "normal_news"
        },
        {
            "Title": "Netweb Technologies: Stock Plummets 50% from Peak Amid DeepSeek Concerns",
            "Summary": "Netweb Technologies shares have fallen 50% from their November peak, with an additional 10% drop on January 28. The stock decline coincides with the end of a shareholder lock-in period and concerns over DeepSeek, a Chinese AI startup challenging Nvidia. Despite the downturn, Netweb's management maintains its FY2025 revenue guidance of ₹1,000 crore and a 30-35% annual revenue CAGR.",
            "Sentiment": "negative",
            "PublishDate": 1738037815000,
            "Source": "normal_news"
        },
        {
            "Title": "Netweb Technologies Collaborates on IndiaAI Mission Project",
            "Summary": "Netweb Technologies is actively participating in the IndiaAI Mission Project, which involves the establishment of a 10,000 GPU cloud infrastructure. This cloud platform is intended to support AI developers and startups in India, potentially boosting the country's artificial intelligence capabilities and fostering innovation in the tech sector.",
            "Sentiment": "positive",
            "PublishDate": 1737428878000,
            "Source": "corporate_action"
        },
        {
            "Title": "Netweb Technologies Forecasts Strong AI Revenue Growth",
            "Summary": "Netweb Technologies anticipates significant growth in its AI segment compared to other business areas. The company expects AI to contribute around 15% of total revenue by year-end, with potential for further 2-3% growth in the revenue mix next year.",
            "Sentiment": "positive",
            "PublishDate": 1737428817000,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Technologies Forecasts Strong Growth in Concall Update",
            "Summary": "Netweb Technologies has provided guidance for a 30% to 35% long-term growth rate. The CEO expressed optimism about this forecast during a conference call, suggesting that the company may even exceed these projections and grow at a faster pace.",
            "Sentiment": "positive",
            "PublishDate": 1737428705000,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Technologies: Q3 Profit Rises 17.9%, Stock Hits 7-Month Low",
            "Summary": "Netweb Technologies reported a 17.9% increase in Q3 net profit to Rs 30.3 crore, with revenue up 33% YoY to Rs 334 crore. Despite positive results, the stock fell nearly 11% to a seven-month low. AI-related projects drove growth, with AI systems' revenue contribution rising to 14.7%. The company's order book stands at Rs 360.3 crore as of December 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1737349710000,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Technologies: Q3 Profit Rises 16%, Revenue Up 32% on AI Demand",
            "Summary": "Netweb Technologies India Ltd. reported a 16.56% increase in Q3 profit to Rs 30.3 crore, with revenue rising 32% to Rs 334 crore. AI projects drove growth, contributing 14.7% to revenue in the first nine months of FY'25. The company has an order book of Rs 360 crore as of December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1737218338000,
            "Source": "earnings"
        },
        {
            "Title": "Netweb Technologies: CFO Resigns, Interim Replacement Appointed",
            "Summary": "Netweb Technologies' CFO Prawal Jain has resigned. The company has appointed Ankit Kumar Singhal, the current Financial Controller, as Interim CFO effective November 15, 2024. Jain will remain with the company until December 31, 2024, to ensure a smooth transition.",
            "Sentiment": "neutral",
            "PublishDate": 1731678641000,
            "Source": "corporate_action"
        },
        {
            "Title": "Netweb Tech to Offer India's First 'Make in India' AI Servers",
            "Summary": "Netweb Technologies announces the introduction of India's first domestically produced 'Make in India' Tyrone servers. These servers will incorporate NVIDIA MGX-based Grace and NVIDIA GH200 GraceHopper Superchips. The company plans to offer these servers for both off-premises and on-premises AI cloud infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1729748432000,
            "Source": "corporate_action"
        },
        {
            "Title": "Netweb Technologies Expands NVIDIA MGX Platform Server Range",
            "Summary": "Netweb Technologies has announced an expansion of its server offerings based on the NVIDIA MGX platform. This move indicates the company's commitment to enhancing its product portfolio in the high-performance computing and AI infrastructure space.",
            "Sentiment": "positive",
            "PublishDate": 1729748368000,
            "Source": "corporate_action"
        },
        {
            "Title": "Netweb Technologies Reports Significant AI Revenue Growth",
            "Summary": "Netweb Technologies has reported that Artificial Intelligence has become a major contributor to its revenue. In the first half of the financial year 2025, AI accounted for 15% of the company's revenue, marking a substantial 193% year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729567400000,
            "Source": "result"
        },
        {
            "Title": "Netweb Technologies Announces 15% Growth Guidance for FY '25",
            "Summary": "Netweb Technologies has provided guidance for the fiscal year 2025, projecting a 15% growth. The company has offered broad margin range and topline estimates, leaving more detailed analysis to external parties. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1729567243000,
            "Source": "corporate_action"
        },
        {
            "Title": "Netweb Technologies Provides Strong Revenue Growth Guidance",
            "Summary": "Netweb Technologies has provided a hard guidance of 35% revenue growth. The company has a history of outperforming its revenue guidance and intends to continue this trend, as stated in their recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1729567190000,
            "Source": "corporate_action"
        },
        {
            "Title": "Netweb Technologies Reports Strong Q2 EBITDA Growth",
            "Summary": "Netweb Technologies has announced its Q2 financial results, showing significant year-over-year improvement. The company's EBITDA increased from 192 million rupees to 357 million rupees. Additionally, the EBITDA margin improved from 13.25% to 14.22% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729343175000,
            "Source": "result"
        },
        {
            "Title": "Netweb Technologies Reports Strong Q2 Financial Results",
            "Summary": "Netweb Technologies has announced its Q2 financial results, showing significant year-over-year growth. The company's net profit increased to 257 million rupees from 151 million rupees in the same quarter last year. Revenue also saw substantial growth, rising to 2.5 billion rupees from 1.45 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729343169000,
            "Source": "result"
        }
    ]
}