{
    "Symbol": "NETWORK18",
    "ISIN": "INE870H01013",
    "News": [
        {
            "Title": "Network18 achieves 2.5B CTV views, sets 2026 growth plan",
            "Summary": "Network18 reported landmark 2025 digital performance with 2.5 billion Connected TV views (26% YoY growth) and 56 billion total platform views. Company plans CTV-focused expansion and dedicated app launch for 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768812771757,
            "Source": "stocks"
        },
        {
            "Title": "Network18 Q3FY26: Revenue Up 5% YoY, EBITDA Surges 61% QoQ",
            "Summary": "Network18 Media reported Q3FY26 revenue growth of 5% YoY to ₹500cr with EBITDA surging 61% QoQ to ₹11.8cr, while maintaining position as India's top news network with 14.2% TV viewership share.",
            "Sentiment": "positive",
            "PublishDate": 1768407706013,
            "Source": "co_actions_results"
        },
        {
            "Title": "Network18-CNN partnership renewed for 10 years",
            "Summary": "Network18 extends CNN International partnership till 2035, expanding CNN-News18's digital footprint to global markets including YouTube and Connected TV platforms.",
            "Sentiment": "positive",
            "PublishDate": 1767598853519,
            "Source": "stocks"
        },
        {
            "Title": "Network18 Media & Investments Plans ₹250 Million Acquisition from Lokmat Media",
            "Summary": "Network18 Media & Investments has announced plans to acquire shares and debentures from Lokmat Media for ₹250 million. The transaction involves the purchase of equity stakes and debt instruments from the media company.",
            "Sentiment": "neutral",
            "PublishDate": 1760540326245,
            "Source": "order&deals"
        },
        {
            "Title": "Network18 Media Reports Mixed Results with Exceptional Gain from ETPL Investment",
            "Summary": "Network18 Media & Investments Limited reported quarterly results ended September 30, 2025. On a standalone basis, the company posted revenue from operations of Rs 477.18 crore compared to Rs 445.27 crore in the same quarter last year. The company recorded a loss before exceptional items of Rs 70.12 crore for the quarter. However, an exceptional gain of Rs 587.01 crore from fair valuation of its holding in Eenadu Television Private Limited (ETPL) resulted in a net profit of Rs 446.05 crore for the half-year period. ETPL ceased to be an associate from July 7, 2025, after assignment of voting rights to ETPL's promoter, though Network18 retains economic interest in the 24.5% equity shares. On a consolidated basis, the company reported revenue from operations of Rs 497.81 crore for the quarter and posted a profit of Rs 41.25 crore. The Board also approved acquisition of IBN Lokmat News Private Limited for Rs 25 crore, which will make it a wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1760533962967,
            "Source": "earnings"
        },
        {
            "Title": "Network18 Media & Investments Ltd: Q1FY26 Revenue Dips, Digital Reach Soars",
            "Summary": "Network18 reported Q1FY26 standalone news business revenue of ₹430 crore, down 5% YoY. Operating EBITDA increased 68.5% to ₹4 crore. The company became India's top digital news network with over 300 million monthly reach. TV news viewership share rose by 220 basis points YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1752592778000,
            "Source": "earnings"
        },
        {
            "Title": "Network18 Media & Investments Reports Q1 Results with Exceptional Gain",
            "Summary": "Network18 Media & Investments reported its Q1 financial results. The company had an exceptional gain of 1.5 billion rupees. The Q1 loss before exceptional items and tax was 18 million rupees, compared to a loss of 1.94 billion rupees in the same quarter last year. The company's Q1 EBITDA showed a gain of 40 million rupees, in contrast to a loss of 1.5 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752583220000,
            "Source": "result"
        },
        {
            "Title": "Network18 Media & Investments Reports Q1 Profit of 1.5B Rupees",
            "Summary": "Network18 Media & Investments has reported its quarterly results. The company posted a consolidated net profit of 1.5 billion rupees, compared to a loss of 1.2 billion rupees in the same quarter last year. Revenue for the quarter was 4.67 billion rupees, down from 31.4 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1752583006000,
            "Source": "result"
        },
        {
            "Title": "Network18 Assigns Voting Rights in Eenadu Television, ETPL No Longer an Associate",
            "Summary": "Network18 has assigned voting rights in Eenadu Television. As a result of this action, ETPL (presumably Eenadu Television Private Limited) is no longer considered an associate of Network18. The specific details of the voting rights assignment or the reasons behind this decision are not provided in the given information.",
            "Sentiment": "neutral",
            "PublishDate": 1751906490000,
            "Source": "default"
        },
        {
            "Title": "Network18: Surpasses Times Internet in Digital News Dominance",
            "Summary": "Network18 outperforms Times Internet in ComScore rankings with 315 million UVs compared to Times' 202 million. News18.com leads with 251 million UVs against The Times of India's 183 million. Network18 also dominates social media reach and maintains TV news leadership.",
            "Sentiment": "positive",
            "PublishDate": 1745916388000,
            "Source": "normal_news"
        },
        {
            "Title": "Network18: Tops Digital News Network Rankings in March 2025",
            "Summary": "Network18 leads Indian digital news ecosystem with 183.2 million unique visitors on-platform and 315 million cumulative reach including social media. News18.com reaches 251 million users, while vernacular properties attract 182 million unique visitors.",
            "Sentiment": "positive",
            "PublishDate": 1745908310000,
            "Source": "result"
        },
        {
            "Title": "Network18 Media & Investments Reports Q4 Financial Results",
            "Summary": "Network18 Media & Investments has reported its Q4 financial results. The company's EBITDA improved to a gain of 190 million rupees compared to a loss of 1.9 billion rupees year-over-year. The Q4 EBITDA margin was 3.39%. However, the company still reported a consolidated net loss of 290 million rupees, which is an improvement from the 1.96 billion rupees loss in the same quarter last year. Q4 revenue decreased to 5.61 billion rupees from 24.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1745064034000,
            "Source": "result"
        },
        {
            "Title": "Network18 Media & Investments Ltd: Q4 Net Loss of Rs 29.09 Crore, Revenue at Rs 561.32 Crore",
            "Summary": "Network18 Media & Investments Ltd reported a Q4 FY25 consolidated net loss of Rs 29.09 crore with revenue at Rs 561.32 crore. The company's FY25 consolidated revenue was Rs 6,887.92 crore. Results are not comparable to the previous year due to the merger of Viacom18 with Star India. Despite industry challenges, the company maintained its position as the largest news network in India.",
            "Sentiment": "neutral",
            "PublishDate": 1745053580000,
            "Source": "earnings"
        },
        {
            "Title": "Network18 Media & Investments to Consider Q4 Results on April 18",
            "Summary": "Network18 Media & Investments has announced that it will consider its fourth quarter (Q4) financial results on April 18. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744381218000,
            "Source": "earnings"
        },
        {
            "Title": "Network 18 Media & Investments: Q3 Loss Soars 2371.5% YoY",
            "Summary": "Network 18 Media & Investments reported Q3 FY25 results with a loss of ₹1435.45 crore, up 2371.5% YoY. Revenue declined 23.3% YoY to ₹1360.5 crore. Operating income decreased by 597.49% YoY. EPS fell to ₹-4.86, down 767.86% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737006958000,
            "Source": "earnings"
        },
        {
            "Title": "Network18 Media & Investments Reports Significant Q3 Loss",
            "Summary": "Network18 Media & Investments reported a consolidated net loss of 14.4 billion rupees in Q3, compared to a loss of 581 million rupees in the same period last year. The company's revenue decreased to 13.6 billion rupees from 17.74 billion rupees year-over-year. Exceptional items amounted to 14.26 billion rupees, while profit before tax stood at 256.8 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1736900212000,
            "Source": "earnings"
        },
        {
            "Title": "Network18 Media & Investments Ltd: Q3 News Revenue Grows 2% Amid Lukewarm Ad Environment",
            "Summary": "Network18 reported a 2% YoY increase in Q3 news business operating revenue to ₹478 crore. EBITDA margin decreased to 2% from 5% last year. TV news viewership share improved by over 100bps, while digital portfolio maintained strong position. Viacom18's merger with Star India completed, with Network18 now holding a 16.12% stake in Viacom18.",
            "Sentiment": "neutral",
            "PublishDate": 1736866030000,
            "Source": "earnings"
        },
        {
            "Title": "Network18 Media & Investments Reports Q3 Financial Results",
            "Summary": "Network18 Media & Investments has reported exceptional items of 14.26 billion rupees in their financial statement. The company's Profit Before Tax (PBT) for the third quarter stands at 256.8 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1736860597000,
            "Source": "earnings"
        },
        {
            "Title": "Network18 Media & Investments Reports Significant Q3 Loss",
            "Summary": "Network18 Media & Investments has reported a consolidated net loss of 14.4 billion rupees for the third quarter, compared to a loss of 581 million rupees in the same period last year. The company's revenue also declined to 13.6 billion rupees from 17.74 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1736860581000,
            "Source": "earnings"
        },
        {
            "Title": "News18 Lokmat: Dominates Marathi News Segment with 22.2% Market Share",
            "Summary": "News18 Lokmat leads the Marathi news segment with a 22.2% market share, outperforming competitors TV9 Marathi (21.4%) and ABP Majha (16.5%). In Mumbai, it has the highest cumulative reach of 4,462 viewers. The channel's success is attributed to its focus on local issues and comprehensive coverage.",
            "Sentiment": "positive",
            "PublishDate": 1736238081000,
            "Source": "normal_news"
        },
        {
            "Title": "Network 18 Media & Investments Ltd: Stock Surges 3.48% in Today's Trading",
            "Summary": "<p>Network 18 Media & Investments Ltd's stock <span class='positive'>rose 3.48%</span> to Rs 81.78 today, <span class='positive'>outperforming</span> the BSE Teck index which increased by 0.54%. The company's stock has seen a <span class='negative'>7.79% decline</span> over the past month, compared to <span class='neutral'>smaller drops</span> in the BSE Teck index and SENSEX.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728964800000,
            "Source": "normal_news"
        },
        {
            "Title": "Network18 Media: Q2 Net Loss Widens to Rs 152.31 Crore",
            "Summary": "<p>Network18 Media & Investments reported a <span class='negative'>wider net loss</span> of Rs 152.31 crore in Q2FY25, up from Rs 119.18 crore last year. Revenue <span class='positive'>rose 1.6%</span> to Rs 1,825.18 crore. <b>News segment</b> revenue <span class='positive'>grew 5.9%</span>, while <b>entertainment segment</b> <span class='negative'>fell 5.4%</span>. The company <span class='neutral'>completed merger</span> of TV18 Broadcast and e-Eighteen.com into Network18.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728732904000,
            "Source": "result"
        },
        {
            "Title": "Network18 Media & Investments Reports Q2 Revenue Decline",
            "Summary": "<p>Network18 Media & Investments has reported its <span class='neutral'>Q2 revenue</span> as <span class='neutral'>18.25 billion rupees</span>, compared to <span class='neutral'>18.65 billion rupees</span> in the same quarter last year, indicating a <span class='negative'>year-over-year decrease</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728722573000,
            "Source": "result"
        },
        {
            "Title": "Network18 Media & Investments Reports Increased Q2 Loss",
            "Summary": "<p>Network18 Media & Investments has reported a consolidated <span class='negative'>net loss</span> of <span class='negative'>958 million rupees</span> for the second quarter, compared to a loss of 831 million rupees in the same period last year. This represents an <span class='negative'><b>increase in losses</b></span> year-over-year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728722539000,
            "Source": "result"
        },
        {
            "Title": "Government Approves License Transfer from TV18 to Network18 Media & Investments",
            "Summary": "<p>The <span class='neutral'>government</span> has granted <span class='positive'>approval</span> for the <b>transfer of licenses</b> currently held by <span class='neutral'>TV18</span> to <span class='neutral'>Network18 Media & Investments</span>. This action suggests a <b>restructuring</b> or <b>consolidation</b> of media assets within the Network18 group.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728044336000,
            "Source": "corporate_action"
        }
    ]
}