{
    "Symbol": "NEULANDLAB",
    "ISIN": "INE794A01010",
    "News": [
        {
            "Title": "Neuland Labs Q3FY26 Results Show Mixed Performance",
            "Summary": "Neuland Laboratories reports 11.4% revenue growth to Rs. 447.8 crore in Q3FY26, but EBITDA margins decline 350 bps to 19.0% amid product mix challenges and higher operating expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1770635904245,
            "Source": "co_actions_results"
        },
        {
            "Title": "Neuland Labs Board Meet Set for Feb 9 to Review Q3 Results",
            "Summary": "Neuland Laboratories has scheduled a board meeting on February 9, 2026, to approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768991563371,
            "Source": "co_actions_results"
        },
        {
            "Title": "Neuland Labs Exports Surge 143% MoM to $20.4M",
            "Summary": "Neuland Laboratories reported a significant 143% month-on-month increase in exports, reaching $20.4 million, demonstrating strong international business growth and operational momentum.",
            "Sentiment": "positive",
            "PublishDate": 1768289992233,
            "Source": "stocks"
        },
        {
            "Title": "Neuland Laboratories Approves 1.89 Billion Rupees Investment for New R&D Center",
            "Summary": "Neuland Laboratories has approved an investment of 1.89 billion rupees for establishing a new research and development center. This significant capital allocation demonstrates the pharmaceutical company's commitment to expanding its R&D capabilities and strengthening its innovation infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1764546981556,
            "Source": "stock"
        },
        {
            "Title": "Neuland Laboratories Approves ₹1.89 Billion Investment for New R&D Center",
            "Summary": "Neuland Laboratories has approved an investment of ₹1.89 billion for establishing a new research and development center. This significant capital allocation demonstrates the company's commitment to expanding its R&D capabilities and strengthening its pharmaceutical development infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1764332365075,
            "Source": "stock"
        },
        {
            "Title": "Neuland Laboratories Reports Record Revenue of Rs 516 Crore in Q2, Up 63.7% Year-on-Year",
            "Summary": "Neuland Laboratories achieved its highest quarterly revenue of Rs 516 crore in Q2, representing a 63.7% increase from Rs 315 crore in the same period last year. The growth was primarily driven by commercial CMS (Contract Manufacturing Services) projects, with the company's top two commercial CMS molecules performing well. EBITDA stood at Rs 156.9 crore with a margin of 30.4%, while profit after tax reached Rs 96.5 crore compared to Rs 32 crore in Q2 of the previous year. EPS for the quarter was Rs 75.18 per share. The company expects commercialization of another molecule this year and reported strong customer interest in its peptide capabilities. Working capital increased to 155 days of sales due to higher inventories and receivables. CAPEX for the quarter was Rs 91 crore, with Rs 170.7 crore invested in the six-month period. The company's peptide facility investment is progressing as planned, with Module-1 expected to be operational in the next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1762939243810,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Reports Strong Q2 Growth with Net Profit Nearly Tripling",
            "Summary": "Neuland Laboratories reported consolidated net profit of 969 million rupees in Q2, up from 328 million rupees in the same period last year. Revenue increased to 5.15 billion rupees from 3.1 billion rupees year-over-year. EBITDA rose to 1.55 billion rupees compared to 622 million rupees previously, while EBITDA margin improved to 30.25% from 20.02% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762733494495,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Reports Strong Q2 Performance with 195% Jump in Net Profit",
            "Summary": "Neuland Laboratories delivered robust Q2 results with consolidated net profit surging to 969 million rupees from 328 million rupees in the same quarter last year. Revenue grew significantly to 5.15 billion rupees compared to 3.1 billion rupees year-over-year. EBITDA increased substantially to 1.55 billion rupees from 622 million rupees, while EBITDA margin improved to 30.25% from 20.02% in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762514023465,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Shareholders Approve Leadership Re-designations Through Postal Ballot",
            "Summary": "Neuland Laboratories Limited announced that shareholders have approved two special resolutions through remote e-voting. The resolutions approved the re-designation of Mr. Davuluri Suchet Rao as Executive Vice Chairman and Mr. Davuluri Saharsh Rao as Chief Executive Officer Managing Director. The e-voting period ran from October 7, 2025 to November 5, 2025. Both resolutions received overwhelming support with over 99% of votes cast in favor. The postal ballot notice was originally dated September 23, 2025, and the voting results were scrutinized by practicing company secretaries.",
            "Sentiment": "positive",
            "PublishDate": 1762364553566,
            "Source": "corporate_governance"
        },
        {
            "Title": "Neuland Laboratories Schedules Q2 FY26 Earnings Call for November 7, 2025",
            "Summary": "Neuland Laboratories Limited will announce its Q2 FY26 results for the quarter and half year ended September 30, 2025 on November 7, 2025. The company will host an earnings call on the same day at 17:30 hrs IST following the results announcement. The results will be available on the company's website. Neuland Labs operates cGMP manufacturing facilities serving customers in close to 80 countries, has developed more than 300 processes and 100 APIs, and filed around 990+ regulatory filings including 72 active US DMFs.",
            "Sentiment": "neutral",
            "PublishDate": 1761623613531,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Appoints Dr. Ravi Shankar Gopinath as Independent Director",
            "Summary": "Neuland Laboratories Limited announced the appointment of Dr. Ravi Shankar Gopinath as an Independent Director, effective August 1, 2025, for a five-year term. The appointment was approved by shareholders through a postal ballot process conducted via remote e-voting from August 28 to September 26, 2025. The resolution received overwhelming support with 99.997% of votes cast in favor, representing 7,996,901 votes from 472 members, while only 239 votes from 29 members were against the proposal. The total voting participation was 62.33% of outstanding shares, with 79,97,140 votes polled out of 1,28,29,889 total shares held by 45,705 shareholders as of the record date of August 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758968627940,
            "Source": "corporate_governance"
        },
        {
            "Title": "Neuland Laboratories Restructures Executive Leadership Roles Effective April 2026",
            "Summary": "Neuland Laboratories' Board of Directors approved modifications to executive leadership roles, effective April 1, 2026, subject to shareholder approval. Mr. Sucheth Rao Davuluri will transition from Vice Chairman & CEO to Executive Vice Chairman, focusing on strategic areas including long-term planning, enterprise risk management, stakeholder management, internal audit oversight, and CSR initiatives. Mr. Saharsh Rao Davuluri will move from Vice Chairman & Managing Director to CEO & Managing Director, taking charge of day-to-day operations. The changes are designed to align with the organization's growth plans and balance short-term and long-term objectives. A transition period will run from immediate effect until March 31, 2026, to ensure seamless handover of operational responsibilities. Both executives will continue reporting directly to Executive Chairman Dr. D. R. Rao.",
            "Sentiment": "positive",
            "PublishDate": 1758631701524,
            "Source": "corporate_governance"
        },
        {
            "Title": "Neuland Laboratories Issues Corrigendum to Postal Ballot Notice for Independent Director Appointment",
            "Summary": "Neuland Laboratories Limited issued a corrigendum to correct a typographical error in its Postal Ballot Notice dated July 31, 2025. The error was in the proposed Special Resolution regarding Dr. Ravi Shankar Gopinath's appointment as Independent Director, where the end date of his five-year term was incorrectly mentioned as July 31, 2025, instead of July 31, 2030. The corrected resolution shows Dr. Gopinath's term running from August 1, 2025, to July 31, 2030. The e-voting period for the postal ballot runs from August 28, 2025, to September 26, 2025. Dr. Gopinath, aged 59, brings extensive experience from leadership roles at companies including TCS, Geometric Ltd, AVEVA plc, and Schneider Electric. He holds a Ph.D. in Chemical Engineering and currently serves on the boards of Thermax Ltd and Spectris plc. The corrected notice has been sent to shareholders and published in newspapers.",
            "Sentiment": "neutral",
            "PublishDate": 1758106622749,
            "Source": "corporate_action"
        },
        {
            "Title": "Neuland Lab Reports 433% Yearly Growth and 250% Monthly Growth",
            "Summary": "Neuland Lab announced significant growth metrics, reporting a 433% increase on a yearly basis and 250% growth on a monthly basis.",
            "Sentiment": "positive",
            "PublishDate": 1757995208617,
            "Source": "stock"
        },
        {
            "Title": "Neuland Lab Begins Commercial Production at Expanded Unit 3 Facility in Telangana",
            "Summary": "Neuland Lab has commenced commercial production following the expansion of its Unit 3 manufacturing facility located in Telangana. The company has successfully started operations at the expanded capacity.",
            "Sentiment": "positive",
            "PublishDate": 1756545172894,
            "Source": "stock"
        },
        {
            "Title": "Neuland Laboratories Seeks Shareholder Approval for Dr. Ravi Shankar Gopinath's Appointment as Independent Director",
            "Summary": "Neuland Laboratories has issued a postal ballot notice seeking shareholder approval through remote e-voting for the appointment of Dr. Ravi Shankar Gopinath (DIN: 00803847) as an Independent Director. The Board appointed him as Additional Director effective August 1, 2025, based on recommendations from the Nomination and Remuneration Committee. The proposed appointment is for a five-year term from August 1, 2025 to July 31, 2030, and he will not be liable to retire by rotation. Dr. Gopinath, aged 59, holds a Ph.D. in Chemical Engineering and has extensive experience including leadership roles at TCS, Geometric Ltd., AVEVA plc, and Schneider Electric. The e-voting period runs from August 28, 2025 (9:00 AM IST) to September 26, 2025 (5:00 PM IST). Results will be announced by September 28, 2025. The resolution requires approval by special resolution, and NSDL is providing the remote e-voting facility.",
            "Sentiment": "neutral",
            "PublishDate": 1756194811946,
            "Source": "corporate_action"
        },
        {
            "Title": "Neuland Laboratories Reports 32% Revenue Decline in Q1FY26, Expects Strong Growth Recovery",
            "Summary": "Neuland Laboratories reported total income of Rs. 300.6 crores for Q1FY26, a 32.4% decrease compared to Rs. 444 crores in the same period last year. EBITDA stood at Rs. 42.1 crores with a margin of 14.4%, while profit after tax dropped to Rs. 13.7 crores from Rs. 98.3 crores in Q1FY25. The company attributed the decline to the uneven nature of order flows in their CDMO and specialty GDS business. Working capital deteriorated to 145 days of sales with negative free cash flow of Rs. 66 crores. Despite the weak start, management remains confident of achieving strong growth in FY26, expecting commercialization of another CMS molecule and commercial production from their Unit 3 facility later this fiscal year. The company invested Rs. 79 crores in CAPEX during the quarter and expects total CAPEX of Rs. 250 crores for FY26. Management emphasized their 3-5 year CAGR target of 20% and highlighted growing customer interest in their peptide capabilities, with the new peptide facility expected to be completed next financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1754310586671,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Labs Maintains Growth Plans Despite Weak Q1, Increases Investment in CDMO and Specialty APIs",
            "Summary": "Neuland Labs reported weak quarterly results but confirmed its full-year growth plans remain intact. The company is increasing investments in high-profit Contract Development and Manufacturing Organization (CDMO) services, specialty APIs, and peptide production. These investments aim to capitalize on global outsourcing demand and expand the company's pipeline.",
            "Sentiment": "neutral",
            "PublishDate": 1753961711678,
            "Source": "stock"
        },
        {
            "Title": "Neuland Laboratories Reports Q1 Results and Reappoints Independent Director",
            "Summary": "Neuland Laboratories announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹29,275.27 lakhs compared to ₹43,960.17 lakhs in the same quarter last year, representing a decline. Profit for the period was ₹1,370.76 lakhs versus ₹9,833.93 lakhs in the previous year quarter. On a consolidated basis, revenue from operations was ₹29,275.27 lakhs against ₹43,960.17 lakhs in the corresponding quarter. The company's board also approved the reappointment of Dr. Ravi Shankar Gopinath as an Additional Director categorized as Independent for a five-year term from August 1, 2025, subject to shareholder approval. Dr. Gopinath has over 30 years of global experience in scaling businesses and holds a Ph.D. in Chemical Engineering from Rensselaer Polytechnic Institute.",
            "Sentiment": "negative",
            "PublishDate": 1753959304051,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Issues Addendum Detailing Commission Structure for Executive's Reappointment",
            "Summary": "Neuland Laboratories Limited has issued an addendum to its 41st Annual General Meeting notice scheduled for July 30, 2025, providing additional details on the commission structure for Mr. Davuluri Saharsh Rao's proposed reappointment. The commission will not exceed 2% of net profits or INR 10 crores, whichever is lower, for each financial year during his tenure. The commission will be determined by the Board based on Nomination and Remuneration Committee recommendations and linked to a balanced scorecard with 60% weightage for financial parameters including revenue growth and CMS business growth, and 40% for non-financial parameters such as capability building, customer satisfaction, and employee engagement. A minimum achievement of 70% against set goals is required for commission eligibility, with no payment if performance falls below this threshold.",
            "Sentiment": "neutral",
            "PublishDate": 1753279779188,
            "Source": "corporate_action"
        },
        {
            "Title": "Neuland Laboratories: Shares Surge 12% Ahead of Final Dividend Announcement",
            "Summary": "Neuland Laboratories stock rose 12% to Rs 13,750. The company announced a final dividend of Rs 12 per share (120% of face value) for FY 2025, with a record date of July 18, 2025. The stock is trading above all eight Simple Moving Averages, indicating a strong bullish trend.",
            "Sentiment": "positive",
            "PublishDate": 1752474723000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neuland Laboratories: SEBI Issues Warning for Insider Trading Violation",
            "Summary": "Neuland Laboratories received an administrative warning from SEBI for a violation of insider trading regulations by a designated person. The violation relates to non-compliance with pre-clearance requirements. The company clarified that the issue is individual-specific and has no material impact on its financials or operations.",
            "Sentiment": "neutral",
            "PublishDate": 1750178236000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Issues Administrative Warning to Neuland Laboratories",
            "Summary": "The Securities and Exchange Board of India (SEBI) has issued an administrative warning to Neuland Laboratories due to lapses in their insider trading procedures. This action by SEBI indicates potential issues with the company's compliance with insider trading regulations.",
            "Sentiment": "negative",
            "PublishDate": 1750170281000,
            "Source": "default"
        },
        {
            "Title": "Neuland Laboratories: Stock Drops 7% Amid Profit Decline",
            "Summary": "Neuland Laboratories' stock fell nearly 7% on Friday, extending a three-day losing streak. The company reported a 59% drop in Q4 profit after tax, despite providing strong future guidance. Analysts attribute the decline to increased operating costs and reduced sales volumes. The stock closed at Rs 11,040 after falling as much as 11% during the session.",
            "Sentiment": "negative",
            "PublishDate": 1747448612000,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories: Shares Drop 11% Despite FY26 Growth Assurance",
            "Summary": "Neuland Laboratories' shares fell 11% after weak Q4 FY25 results, with net profit down 59% and revenue down 15% YoY. The company expects growth to resume in FY26. Goldman Sachs maintains a 'Buy' rating with a ₹14,775 target price, projecting 30% YoY topline growth in FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1747370130000,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Reports Q4 Financial Results and Dividend",
            "Summary": "Neuland Laboratories announced its Q4 consolidated net profit of 278.1 million rupees, down from 676 million rupees year-over-year and 1.02 billion rupees quarter-over-quarter. Q4 revenue was reported at 3.28 billion rupees, compared to 3.8 billion rupees in the same quarter last year. The company has recommended a final dividend of 12 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747354181000,
            "Source": "default"
        },
        {
            "Title": "Neuland Laboratories Reports Q4 Results and Dividend",
            "Summary": "Neuland Laboratories announced its Q4 financial results, showing a decline in performance compared to the previous year. The company reported Q4 revenue of 3.28 billion rupees, down from 3.8 billion rupees year-over-year. EBITDA decreased to 510.7 million rupees from 1.07 billion rupees, with the EBITDA margin falling to 15.55% from 27.77%. Consolidated net profit for Q4 was 278.1 million rupees, compared to 676 million rupees in the same quarter last year. Despite the decline, the company recommended a final dividend of 12 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747308507000,
            "Source": "result"
        },
        {
            "Title": "Neuland Laboratories to Consider Q4 Results on May 15",
            "Summary": "Neuland Laboratories has announced that it will consider its fourth quarter financial results on May 15. This is a standard practice for publicly traded companies to review and approve their quarterly financial statements before public release.",
            "Sentiment": "neutral",
            "PublishDate": 1745494481000,
            "Source": "default"
        },
        {
            "Title": "Neuland Laboratories: Multibagger Stock Soars 17,757% in 13 Years",
            "Summary": "Neuland Laboratories stock has risen from ₹61.60 to ₹11,000 in 13 years, turning a ₹1 lakh investment into ₹1.78 crore. However, the stock has declined 23.64% year-to-date and is currently trading at ₹10,915. The company's Q3 net profit declined 13.3% compared to previous quarters, but it recorded its highest EPS in five quarters at ₹78.75.",
            "Sentiment": "neutral",
            "PublishDate": 1740642011000,
            "Source": "normal_news"
        },
        {
            "Title": "Neuland Laboratories Reports Q3 Financial Results",
            "Summary": "Neuland Laboratories announced its Q3 consolidated financial results. The company reported a net profit of 1.02 billion rupees, up from 814 million rupees in the same quarter last year. Revenue increased slightly to 3.98 billion rupees from 3.93 billion rupees year-over-year. The company also reported an exceptional item of 558 million rupees. However, profit before tax (PBT) decreased to 720 million rupees from 1 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1739233376000,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Reports Q3 Profit Before Tax of 720M Rupees",
            "Summary": "Neuland Laboratories has reported a Profit Before Tax (PBT) of 720 million rupees for the third quarter, compared to 1 billion rupees in the same period last year. The company also disclosed an exceptional item of 558 million rupees, which significantly impacted their financial results.",
            "Sentiment": "negative",
            "PublishDate": 1739187810000,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Neuland Laboratories has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 866 million rupees from 1.21 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 21.76% from 30.87% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739187771000,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Reports Q3 Financial Results",
            "Summary": "Neuland Laboratories announced its Q3 consolidated financial results. The company reported a net profit of 1.02 billion rupees, up from 814 million rupees in the same quarter last year. Revenue for the quarter stood at 3.98 billion rupees, slightly higher than the 3.93 billion rupees reported in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739187765000,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories to Consider Q3 Results",
            "Summary": "Neuland Laboratories has announced that it will consider its third quarter financial results on February 10. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737638989000,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Approves Rs 342 Crore Capital Expenditure",
            "Summary": "The Board of Directors of Neuland Laboratories has approved a significant capital expenditure of Rs 342 crores. This decision indicates a substantial investment in the company's infrastructure, equipment, or expansion plans, which could potentially lead to increased production capacity or improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737505236000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neuland Laboratories Approves Major Capital Expenditure",
            "Summary": "The board of Neuland Laboratories has approved a significant capital expenditure of Rs 342 crores. This substantial investment decision indicates the company's commitment to expansion or modernization efforts, which could potentially enhance its operational capabilities or production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1737466881000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neuland Labs Completes Property Transfer for ₹23.45 Crore",
            "Summary": "Neuland Laboratories has finalized the transfer of its Nanakramguda property for a sum of ₹23.45 crore. This transaction marks the completion of a significant corporate action involving the company's real estate assets.",
            "Sentiment": "neutral",
            "PublishDate": 1734068604000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neuland Laboratories Updates on Transfer of Nanakramguda Property",
            "Summary": "Neuland Laboratories has provided an update regarding the final transfer of a portion of their Nanakramguda property. While specific details are not provided in the given news snippet, this appears to be a significant corporate action involving the company's real estate assets.",
            "Sentiment": "neutral",
            "PublishDate": 1734068584000,
            "Source": "corporate_action"
        },
        {
            "Title": "Neuland Laboratories: Shares Drop 7% Following Likely 3.8% Stake Sale",
            "Summary": "Neuland Laboratories shares fell 7.2% after a block deal involving 3.8% stake. Smallcap World Fund reportedly sold its 3.77% stake for approximately Rs 747 crore. The floor price was set at Rs 15,428, a 9% discount from the previous closing price.",
            "Sentiment": "negative",
            "PublishDate": 1733984244000,
            "Source": "block_deals"
        },
        {
            "Title": "Neuland Laboratories Reports Significant Export Growth",
            "Summary": "Neuland Laboratories has reported a substantial increase in exports for November, with export figures tripling compared to the same period last year. This strong performance indicates significant growth in the company's international business operations.",
            "Sentiment": "positive",
            "PublishDate": 1733979694000,
            "Source": "earnings"
        },
        {
            "Title": "Neuland Laboratories Block Trade on NSE",
            "Summary": "A significant block trade of Neuland Laboratories shares occurred on the National Stock Exchange (NSE). Approximately 489,667 shares were traded at a price of Rs. 15,900 per share, totaling Rs. 778.57 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1733975576000,
            "Source": "block_deals"
        },
        {
            "Title": "Neuland Labs: Stock Soars on KarXT Manufacturing Partnership",
            "Summary": "Neuland Laboratories' share price hit a record high following AbbVie's schizophrenia drug setback, which shifted focus to KarXT. Neuland is the exclusive manufacturing partner for KarXT's active ingredient, Xanomaline. The company expects significant growth from April 2025, with its CMS segment projected to grow over 50% in coming years.",
            "Sentiment": "positive",
            "PublishDate": 1731399416000,
            "Source": "normal_news"
        },
        {
            "Title": "Neuland Laboratories Reports Decline in Q2 EBITDA",
            "Summary": "Neuland Laboratories experienced a significant decrease in its Q2 EBITDA, dropping from 1.37 billion rupees in the previous year to 622 million rupees. The company's EBITDA margin also contracted, falling from 32.91% to 20.02% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730878725000,
            "Source": "result"
        },
        {
            "Title": "Neuland Laboratories Reports Q2 Revenue Decline",
            "Summary": "Neuland Laboratories has reported a revenue of 3.1 billion rupees for the second quarter, which represents a year-over-year decrease from 4.2 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730878697000,
            "Source": "result"
        },
        {
            "Title": "Neuland Laboratories Reports Significant Drop in Q2 Profit",
            "Summary": "Neuland Laboratories, a pharmaceutical company, has reported a consolidated net profit of 328 million rupees for the second quarter, compared to 892 million rupees in the same period last year. This represents a substantial year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1730878669000,
            "Source": "result"
        },
        {
            "Title": "Neuland Laboratories: Stock Soars 122% in 4 Months on Strong Q1 Performance",
            "Summary": "<p><span class='positive'>Neuland Laboratories'</span> stock hit a <span class='positive'>new high</span> of Rs 14,500, <b>up 16% intraday</b> and closed <b>12.8% higher</b> at Rs 14,100 on BSE. The company reported its <span class='positive'>highest-ever quarterly revenue</span> of Rs 444.4 crore in Q1FY25, with <span class='positive'>EBITDA margins at 28.9%</span> and <span class='positive'>PAT up 58% YoY</span>. Management expects <span class='neutral'>business momentum to regain from FY26 onwards</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728642226000,
            "Source": "result"
        },
        {
            "Title": "Neuland Labs: Record Exports Propel Stock to All-Time High",
            "Summary": "<p><span class='positive'>Neuland Laboratories'</span> shares <span class='positive'>surged 15%</span> to a <b>record high</b> after reporting <span class='positive'>$27 million</span> in exports for September 2024, a <span class='positive'>13-fold increase</span> from August. The launch of <span class='positive'>Xanomeline API</span> contributed <span class='positive'>$13 million</span> to exports. Other significant contributors included <span class='neutral'>Bempedoic Acid</span>, <span class='neutral'>Deutetrabenazine</span>, <span class='neutral'>Paliperidone API</span>, and <span class='neutral'>Mirtazapine API</span>. The company is also expected to be an <span class='positive'>API supplier</span> for <span class='neutral'>Bristol Myers Squibb's</span> newly approved <span class='neutral'>schizophrenia drug</span>, <span class='neutral'>Cobenfy</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728640946000,
            "Source": "normal_news"
        }
    ]
}