{
    "Symbol": "NEWGEN",
    "ISIN": "INE619B01017",
    "News": [
        {
            "Title": "Newgen Software Wins AED 5.31M UAE Government Deal",
            "Summary": "Newgen Software Technologies secures a 3-year contract worth AED 5.31 million with the UAE government for software licenses and support services, strengthening its Middle East presence.",
            "Sentiment": "positive",
            "PublishDate": 1770199891809,
            "Source": "co_actions_results"
        },
        {
            "Title": "Newgen Software Q3 Net Profit Drops 23% QoQ to ₹62.8 Cr",
            "Summary": "Newgen Software Technologies reported consolidated net profit of ₹62.8 crores in Q3, marking a 23.13% decline from the previous quarter's ₹81.7 crores, reflecting quarterly performance challenges.",
            "Sentiment": "negative",
            "PublishDate": 1768897405619,
            "Source": "co_actions_results"
        },
        {
            "Title": "Newgen Software Q3FY26 Results Call on Jan 20",
            "Summary": "Newgen Software Technologies announces Q3FY26 results conference call scheduled for January 20, 2026 at 4:00 PM IST, hosted by ICICI Securities with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1768310609535,
            "Source": "co_actions_results"
        },
        {
            "Title": "Newgen Software Board Meet Set for Jan 20 Q3 Results",
            "Summary": "Newgen Software Technologies has scheduled its board meeting for January 20, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from December 31, 2025, to January 22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768289075932,
            "Source": "co_actions_results"
        },
        {
            "Title": "Newgen Software appoints Shubhi Nigam as Director",
            "Summary": "Newgen Software Technologies shareholders approve appointment of Ms. Shubhi Nigam as Non-Executive Non-Independent Director through postal ballot with 99.37% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1768063452910,
            "Source": "stocks"
        },
        {
            "Title": "Newgen Software VP-HR Vivek Mani Tripathi Resigns",
            "Summary": "Newgen Software Technologies announces resignation of VP-Human Resources Vivek Mani Tripathi effective December 31, 2025, citing personal reasons for departure from senior management role.",
            "Sentiment": "neutral",
            "PublishDate": 1767187548281,
            "Source": "stocks"
        },
        {
            "Title": "Newgen Software Wins ₹16.53 Cr Order",
            "Summary": "Newgen Software Technologies secures significant order worth ₹16.53 crores, strengthening its business portfolio and market position in the software solutions sector.",
            "Sentiment": "positive",
            "PublishDate": 1765798277321,
            "Source": "co_actions_results"
        },
        {
            "Title": "Newgen Software Wins ₹16.53 Cr Digital Lending Order",
            "Summary": "Newgen Software Technologies secured a ₹16.53 crore purchase order from a leading Indian bank for supply, installation, customization and maintenance of Digital Lending Platform.",
            "Sentiment": "positive",
            "PublishDate": 1765798029375,
            "Source": "co_actions_results"
        },
        {
            "Title": "Newgen Software Wins ₹38.64 Cr Saudi Arabia Contract",
            "Summary": "Newgen Software Technologies' Saudi subsidiary secured a SAR 15.98 million contract from a leading public sector bank to design and develop a loan origination system, valued at ₹38.64 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765789574001,
            "Source": "co_actions_results"
        },
        {
            "Title": "Newgen Software Seeks Shareholder Approval for Shubhi Nigam's Board Appointment",
            "Summary": "Newgen Software Technologies has issued a postal ballot notice seeking shareholder approval to appoint Ms. Shubhi Nigam as a Non-Executive Non-Independent Director, with e-voting scheduled from December 12, 2025 to January 10, 2026. Shubhi Nigam, daughter of Chairman & Managing Director Diwakar Nigam and part of the promoter group, brings 14 years of experience in product management and AI-driven solutions, and will receive sitting fees of ₹1 lakh per board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1765360902736,
            "Source": "corporate_action"
        },
        {
            "Title": "Newgen Software's Kuwait Entity Withdraws from KWD 1.7 Million Business Process Management Tender",
            "Summary": "Newgen Software Technologies' Kuwait entity has withdrawn from a tender process for a business process management platform valued at KWD 1.7 million. The withdrawal affects the company's potential revenue opportunity in the Kuwait market for this specific project.",
            "Sentiment": "negative",
            "PublishDate": 1764950004737,
            "Source": "stock"
        },
        {
            "Title": "Newgen Software Tech Secures 140 Million Rupee Order",
            "Summary": "Newgen Software Tech has received a new order valued at 140 million rupees. This contract win will contribute to the company's revenue growth and business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1764763360650,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Secures Rs 13.99 Crore Loan Management System Order from Mercedes-Benz Financial Services",
            "Summary": "Newgen Software Technologies received and accepted a purchase order worth Rs 13.99 crore from Mercedes-Benz Financial Services India Private Limited for a Loan Management System to be executed over 5 years from license supply date. The domestic contract represents a significant business win for the software company and confirms no related party transaction involvement.",
            "Sentiment": "positive",
            "PublishDate": 1764763326367,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Tech Secures RM 6.47 Crore Contract",
            "Summary": "Newgen Software Tech has received a Letter of Award (LOA) worth RM 6,465,400.80, equivalent to ₹13.96 crore. This contract award represents a significant business win for the software technology company, adding to its revenue pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1764256955203,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Appoints Promoter Group Member Shubhi Nigam as Additional Director",
            "Summary": "Newgen Software Technologies appointed Ms. Shubhi Nigam, daughter of Chairman Managing Director Diwakar Nigam, as Additional Non-Executive Non-Independent Director effective November 26, 2025. The company will seek shareholder approval through postal ballot for her appointment, with compensation including Rs. 1 lakh sitting fee per board meeting and potential commission on net profits.",
            "Sentiment": "neutral",
            "PublishDate": 1764150112975,
            "Source": "corporate_governance"
        },
        {
            "Title": "Newgen Software's UK Subsidiary Secures GBP 1.47 Million Contract",
            "Summary": "Newgen Software Technologies' wholly owned UK subsidiary has executed a Master Service Agreement worth GBP 1,468,804 for software licenses, AWS managed cloud services, and implementation services with an overseas entity in the United Kingdom. The contract involves providing Newgen's Contract Management platform to help the customer create and manage policy documents across their enterprise.",
            "Sentiment": "positive",
            "PublishDate": 1763442082723,
            "Source": "stock"
        },
        {
            "Title": "Newgen Software Reports 11% Revenue Growth in Q2 with Strong International Performance",
            "Summary": "Newgen Software Technologies achieved revenues of INR 401 crores in quarterly results, marking 11% year-over-year growth. Subscription revenues reached INR 126 crores with 20% year-over-year growth. The company added 15 new customer logos during the quarter. U.S. and APAC regions witnessed strong growth of 22% each, while India region grew 7% and EMEA by 3%. Key wins included a GBP 3 million project from a U.K. life and pension consolidator, a EUR 4.2 million 5-year contract with a European retail group, and a USD 5.6 million 5-year contract from a Ghana-based conglomerate. Profit after tax was INR 82 crores with net margins at 20.4%. The company invested 9% of revenues in R&D initiatives and 21% in sales and marketing activities. Net cash generated from operating activities was INR 90 crores during the 6-month period. Net trade receivables were INR 521 crores as of September 30, 2025, resulting in net DSO of 124 days. Management noted that large deal momentum in India and EMEA markets still faces challenges compared to mature markets, though overall business momentum remains strong.",
            "Sentiment": "positive",
            "PublishDate": 1762234016336,
            "Source": "earnings"
        },
        {
            "Title": "Newgen Software CEO Expects Deal Flow Recovery as Decision-Making Cycles Improve",
            "Summary": "Newgen Software CEO Virender Jeet reported that the company has returned to normal growth trajectory after a muted first quarter. The CEO attributed recovery to successful sales and marketing efforts that secured new deals and acquisitions. Growth in the first half was slowed by longer decision-making times for larger deals, causing delays in the sales pipeline. Jeet expects decision-making cycles to improve over the next few quarters and anticipates renewed interest in automation solutions in the US due to credit revival in America. In India, Public Sector Undertaking banks have been major growth drivers, with private banks now joining to upgrade their systems. The company is developing new products for trade automation and payments while focusing on investment-led growth. Newgen has secured early wins in AI spaces and plans to increase investment and manpower for future AI product development.",
            "Sentiment": "positive",
            "PublishDate": 1761733080387,
            "Source": "stock"
        },
        {
            "Title": "Newgen Software Targets Double-Digit Growth in Second Half",
            "Summary": "Newgen Software has set a target to achieve double-digit growth in the second half of the year. The company appears focused on accelerating its performance during this period.",
            "Sentiment": "positive",
            "PublishDate": 1761714782673,
            "Source": "stock"
        },
        {
            "Title": "Newgen Software Reports Strong Q2 Performance with 64% Jump in Net Profit",
            "Summary": "Newgen Software delivered robust quarterly results with consolidated net profit rising to 817 million rupees from 497 million rupees quarter-on-quarter, representing a 64% increase. Revenue grew to 4 billion rupees compared to 3.2 billion rupees in the previous quarter, marking a 25% sequential growth. The company's EBIT stood at 933 million rupees versus 450 million rupees quarter-on-quarter, while EBIT margin expanded significantly to 23.28% from 14.03% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761640866545,
            "Source": "earnings"
        },
        {
            "Title": "Newgen Software's US Subsidiary Secures $5.29 Million Contract with American Financial Institution",
            "Summary": "Newgen Software Inc., the US subsidiary of Newgen Software Technologies Limited, has entered into a two-year agreement worth $5.29 million (₹46.54 crore) with a leading financial institution in the United States. The contract covers annual software licensing fees, cloud hosting services, and other service fees. The client's identity has been withheld for confidentiality reasons. The agreement is with an international entity and does not involve any promoter or group company interests. The transaction does not qualify as a related party transaction under the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1760766340070,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Technologies Secures $2.59 Million Contract with U.S. Healthcare Company",
            "Summary": "Newgen Software Technologies has signed a $2.59 million agreement with a U.S. healthcare firm. The contract covers a 3-year software license and cloud hosting services arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1759304675945,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Secures Four International Contracts Worth Combined $11.8 Million",
            "Summary": "Newgen Software Technologies Limited and its subsidiaries secured four international contracts totaling approximately $11.8 million. The Dubai subsidiary won a KWD 1,736,052 contract from a Kuwaiti entity for business process management platform implementation over two years. The parent company secured a $5.636 million contract with eProcess International Ghana Limited for loan management system delivery and support over five years. The US subsidiary signed a $1,637,400 agreement with a Caribbean bank for enterprise content management system implementation over two years. The UK subsidiary executed a £2,985,484 contract with Wipro Financial Outsourcing Services Limited for modernized enterprise content management and customer communication management platform over ten years. All contracts involve software licensing, implementation, and support services across various international markets including Kuwait, Ghana, Caribbean, and United Kingdom.",
            "Sentiment": "positive",
            "PublishDate": 1759284364955,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Faces $1.37 Million Court Order in Qatar Legal Dispute",
            "Summary": "Newgen Software has received an adverse court order from a Qatar court requiring the company to pay USD 1.37 million plus QAR 200,000 in damages. The company is currently evaluating its legal remedies in response to this court decision.",
            "Sentiment": "negative",
            "PublishDate": 1759232477307,
            "Source": "stock"
        },
        {
            "Title": "Newgen Software Technologies Secures ₹21.24 Crore Order from Kshema General Insurance",
            "Summary": "Newgen Software Technologies Limited has received and accepted a purchase order worth ₹21.24 crore from Kshema General Insurance Limited for its Policy Administration System. The order includes software license, implementation, and annual support services for a duration of 5 years. The contract is with a domestic entity based in India, and the company confirmed that promoters or group companies have no interest in the entity that awarded the order. The transaction does not qualify as a related party transaction under the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1758731487405,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software UK Secures €4.22M Five-Year Deal with TCS N.V. Belgium",
            "Summary": "Newgen Software UK has signed a €4.22 million contract with TCS N.V. Belgium for cloud hosting and software services spanning five years. The deal represents a significant service agreement for the software company's European operations.",
            "Sentiment": "positive",
            "PublishDate": 1758709048134,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Technologies Reports Strong Financial Results and Recommends Rs. 5 Dividend",
            "Summary": "Newgen Software Technologies Limited's Board approved audited standalone and consolidated financial results for the quarter and year ended March 31, 2025. The company reported consolidated revenue of Rs. 1,48,687.92 lakhs for the year, up from Rs. 1,24,382.86 lakhs in the previous year. Net profit increased to Rs. 31,524.24 lakhs compared to Rs. 25,160.50 lakhs in the prior year. The Board recommended a final dividend of Rs. 5 per equity share (50% on face value of Rs. 10), subject to shareholder approval. The company re-appointed PricewaterhouseCoopers Services LLP as Internal Auditor for 2025-2026 and appointed M/s Kundan Agrawal & Associates as Secretarial Auditor for five years from 2025-26 to 2029-30. The 33rd Annual General Meeting is scheduled for July 25, 2025, via video conferencing, with July 18, 2025 set as the record date for dividend entitlement.",
            "Sentiment": "positive",
            "PublishDate": 1757136139091,
            "Source": "earnings"
        },
        {
            "Title": "Newgen Software Technologies Secures Rs. 73.12 Crore Order for Court Digitization Project",
            "Summary": "Newgen Software Technologies Limited received and accepted a purchase order worth Rs. 73.12 crore from a domestic customer for a scanning and digitization project. The project involves digitizing judicial and administrative records for a state court on a turnkey basis over a two-year period. The company confirmed that promoters or group companies have no interest in the entity that awarded the contract, and the transaction does not qualify as a related party transaction under the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1756214145368,
            "Source": "stock"
        },
        {
            "Title": "Newgen Software Reports Muted Q1 FY26 Performance with Revenue of INR 321 Crores Amid Deal Closure Delays",
            "Summary": "Newgen Software Technologies reported quarterly revenues of INR 321 crores, describing it as a muted quarter due to uncertain economic and geopolitical conditions. The company experienced slower customer decision-making and project starts, leading to lower funnel conversion than anticipated. License sales and implementation revenues were impacted by deferrals and closure delays. However, subscription revenue showed recovery with SaaS, ATS/AMC revenues reaching INR 121 crores, registering 19% year-on-year growth. The company won 12 new logos during the quarter, though average deal sizes were lower compared to earlier periods. Key wins included deals with banks in EMEA region (USD 2.5 million), finance company in Saudi Arabia (USD 1.6 million), and insurance customers in Philippines. Profit after tax stood at INR 50 crores with net margins at 15.5%. The company invested 9% of revenues in R&D and 26% in sales and marketing activities. Net cash generated from operating activities was INR 81 crores. Management expects gradual improvement in deal closures in coming quarters, with better growth anticipated in the second half of the year.",
            "Sentiment": "negative",
            "PublishDate": 1753186961982,
            "Source": "earnings"
        },
        {
            "Title": "Newgen Software Shares Drop 16% Following Weak Quarterly Results",
            "Summary": "Newgen Software shares declined over 16% in three sessions after reporting disappointing quarterly earnings. The stock fell 4.8% to Rs 916.8 on Monday. While consolidated net profit rose 4.5% year-on-year to Rs 49.72 crore, it dropped 54% sequentially from Rs 108 crore in the previous quarter. Revenue from operations increased just 2% year-on-year to Rs 321 crore but fell over 25% from the preceding quarter's Rs 430 crore. Operating performance weakened with Ebitda declining 6% year-on-year to Rs 45 crore and margins compressing to 14% from 15%, impacted by higher employee costs and finance expenses. Revenue declined across key markets including India, Europe, APAC, and the US on a sequential basis. Despite the recent decline, analysts maintain a 'Buy' rating with an average target price of Rs 1,091, suggesting 18% upside potential. The stock has fallen 29% over six months and 46% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1753079733307,
            "Source": "earnings"
        },
        {
            "Title": "Newgen Software: Shares Tumble 11% Following Weak Q1 Results",
            "Summary": "Newgen Software's shares dropped over 11% in two days after reporting disappointing Q1FY26 earnings. Net profit increased 4.5% YoY but fell 54% QoQ. Revenue grew 2% YoY but decreased 25% QoQ. EBITDA declined 6% YoY with margin contraction. Key markets showed flat or declining revenues.",
            "Sentiment": "negative",
            "PublishDate": 1752823552000,
            "Source": "earnings"
        },
        {
            "Title": "Newgen Software Technologies Ltd: Q1 Results Disappoint, Stock Drops 6%",
            "Summary": "Newgen Software's Q1 FY2026 results show weak operating performance. EBITDA declined 6% YoY to ₹45 crore, with margins narrowing to 14%. Revenue increased 2% YoY to ₹321 crore, while net profit grew 4% to ₹50 crore. Higher employee expenses and finance costs impacted performance. The stock fell 5.4% to ₹1,032 post-earnings announcement.",
            "Sentiment": "negative",
            "PublishDate": 1752738164000,
            "Source": "earnings"
        },
        {
            "Title": "Newgen Software Reports Q1 Financial Results",
            "Summary": "Newgen Software has released its Q1 financial results. The company reported an EBITDA of 450 million rupees, down from 1.37 billion rupees in the previous quarter. The EBITDA margin decreased to 14.03% from 31.9% quarter-over-quarter. Consolidated net profit for Q1 was 497 million rupees, compared to 1.08 billion rupees in the previous quarter. Revenue for Q1 stood at 3.2 billion rupees, down from 4.3 billion rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1752736547000,
            "Source": "result"
        },
        {
            "Title": "Newgen Software Technologies: Shares Surge on $2 Million International Order",
            "Summary": "Newgen Software Technologies Ltd. received a $2 million (Rs 21.48 crore) order from an international client for Enterprise Workflow and Content Management System. The order, to be executed over five years, includes product supply and implementation for digital transformation. The company's shares rose over 9% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1749097113000,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Technologies Secures $2.5 Million Contract",
            "Summary": "Newgen Software Technologies has been awarded a contract valued at $2.5 million. No further details about the nature of the award or the client were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749082113000,
            "Source": "default"
        },
        {
            "Title": "Newgen Software Technologies Ltd: Secures $2.5 Million International Order for Digital Transformation",
            "Summary": "Newgen Software Technologies Ltd has received a $2.5 million international order for its Enterprise Workflow and Content Management System. The five-year contract includes licensing, implementation, and support services for digital transformation across multiple business lines of an overseas client.",
            "Sentiment": "positive",
            "PublishDate": 1749063289000,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Tech Secures $2.5 Million Award",
            "Summary": "Newgen Software Tech has been awarded a contract worth $2.5 million. No further details about the nature of the award or the awarding entity were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749050582000,
            "Source": "default"
        },
        {
            "Title": "Newgen Software's Saudi Subsidiary Secures $1.63m International Deal",
            "Summary": "Newgen Software's subsidiary in Saudi Arabia has secured an international software services deal worth $1.63 million. The deal involves providing software services, though specific details about the nature of the services or the client are not mentioned in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1747700272000,
            "Source": "default"
        },
        {
            "Title": "Newgen Software's Saudi Subsidiary Secures $1.63M Deal",
            "Summary": "Newgen Software's subsidiary in Saudi Arabia has secured an international software services deal worth $1.63 million. The deal involves providing software services, though specific details about the nature of the services or the client are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1747668287000,
            "Source": "default"
        },
        {
            "Title": "Newgen Software Technologies Granted Patent in India for Data Compression",
            "Summary": "Newgen Software Technologies has been granted a patent in India for a system and method of data compression. The company has filed a total of 55 patents, with 25 of them granted in India and the United States. This new patent is expected to enhance Newgen's intellectual property portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1747613573000,
            "Source": "default"
        },
        {
            "Title": "Newgen Software Technologies Granted Patent for Data Compression in India",
            "Summary": "Newgen Software Technologies has been granted a patent in India for a system and method of data compression. The company has filed 55 patents in total, with 25 of them granted in India and the United States. This new patent is expected to enhance Newgen's intellectual property portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1747396889000,
            "Source": "default"
        },
        {
            "Title": "Newgen Software: Q4 Profit Rises 2.8% to Rs 108.3 Crore",
            "Summary": "Newgen Software reported a 2.8% increase in Q4 FY25 net profit to Rs 108.3 crore. Revenue grew 14.5% to Rs 429.8 crore, driven by strong performance in APAC and US regions. FY25 profit jumped 20.5% to Rs 315.2 crore, with revenue up 19.5% to Rs 1,486.8 crore.",
            "Sentiment": "positive",
            "PublishDate": 1746183477000,
            "Source": "earnings"
        },
        {
            "Title": "Newgen Software Reports Improved Q4 EBITDA and Margin",
            "Summary": "Newgen Software's Q4 EBITDA increased to 1.37 billion rupees from 1.08 billion rupees in the previous quarter. The company's EBITDA margin also improved, rising to 31.9% from 28.42% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746169028000,
            "Source": "result"
        },
        {
            "Title": "Newgen Software Reports Q4 Results and Declares Dividend",
            "Summary": "Newgen Software has announced its Q4 financial results and a dividend declaration. The company's Q4 revenue increased to 4.3 billion rupees from 3.8 billion rupees in the previous quarter. Consolidated net profit for Q4 rose to 1.08 billion rupees from 890 million rupees quarter-over-quarter. Additionally, Newgen Software has declared a dividend of 5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746168976000,
            "Source": "result"
        },
        {
            "Title": "Newgen Software Technologies Subsidiary Signs $1.3 Million Agreement",
            "Summary": "A subsidiary of Newgen Software Technologies has executed an agreement worth $1.3 million. The news indicates a significant business deal for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1743466171000,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Technologies: Subsidiary Secures $1.58 Million Order",
            "Summary": "Newgen Software Technologies' subsidiary has secured a $1.58 million order to be completed within three years. The company reported strong Q3 FY2024 results with net profit up to ₹89 crore and revenue growth of 18% to ₹381 crore. EBITDA surged 40.2% to ₹107.8 crore with margin expansion to 28.3%.",
            "Sentiment": "positive",
            "PublishDate": 1743317051000,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Technologies Secures $1.3 Million Order",
            "Summary": "Newgen Software Technologies has announced that it has received a new order worth $1.3 million. This order represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1743034484000,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Technologies Secures $1.3 Million Order",
            "Summary": "Newgen Software Technologies has received a new order valued at $1.3 million. This represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1742990002000,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Inc. Secures 17 Crore Rupee Contract with US Client",
            "Summary": "Newgen Software Inc., a material unit of Newgen Software Technologies, has executed a Statement of Work with a USA-based client. The contract is valued at 17 crore rupees (approximately $2.1 million USD).",
            "Sentiment": "positive",
            "PublishDate": 1740624543000,
            "Source": "order&deals"
        },
        {
            "Title": "Newgen Software Secures 13 Crore Rupees Order",
            "Summary": "Newgen Software has won a new order valued at 13 crore rupees (approximately $1.6 million USD). This represents a significant business development for the company, potentially boosting its revenue and market position in the software industry.",
            "Sentiment": "positive",
            "PublishDate": 1738400260000,
            "Source": "order&deals"
        }
    ]
}