{
    "Symbol": "NEXTMEDIA",
    "ISIN": "INE747B01016",
    "News": [
        {
            "Title": "Next Mediaworks Q3FY26 Loss Widens to ₹103 Lacs",
            "Summary": "Next Mediaworks reported a net loss of ₹103 lacs for Q3FY26, with total income dropping to ₹17 lacs. The company has prepared results on non-going concern basis due to eroded net worth.",
            "Sentiment": "negative",
            "PublishDate": 1769155094766,
            "Source": "co_actions_results"
        },
        {
            "Title": "Next Mediaworks Reports Quarterly Loss with Eroded Net Worth",
            "Summary": "Next Mediaworks Limited approved its unaudited financial results for the quarter and six months ended September 30, 2025. The company reported a loss per share of INR 0.19 for the quarter and INR 0.39 for the six-month period. The company's net worth is eroded as of September 30, 2025, primarily due to inter-corporate borrowings of INR 3,684 lacs due for settlement in August 2027. The company has no external borrowings from banks or financial institutions. The holding company has provided a letter of support, agreeing to bear operating expenses in case of resource shortfall. Other comprehensive income includes fair value movement of INR 415 lacs due to decline in fair value of equity instruments. The results were reviewed by S.R. Batliboi Associates LLP, who issued an unmodified review conclusion.",
            "Sentiment": "negative",
            "PublishDate": 1762156227620,
            "Source": "earnings"
        },
        {
            "Title": "Next Mediaworks Reports Loss of ₹117 Lacs in Quarter Ended June 30, 2025",
            "Summary": "Next Mediaworks Limited reported a net loss of ₹117 lacs for the quarter ended June 30, 2025, compared to a loss of ₹131 lacs in the same quarter last year. The company generated total income of ₹12 lacs during the quarter, while total expenses stood at ₹117 lacs. Employee benefit expenses were ₹8 lacs, finance costs ₹103 lacs, and other expenses ₹7 lacs. The company's earnings per share was negative ₹1.17. The company's net worth remains eroded and current liabilities exceed current assets. However, the holding company has provided a letter of support agreeing to provide financial support. The company has no external borrowings due to banks or financial institutions. The results were reviewed by statutory auditors S.R. Batliboi & Associates LLP who issued an unmodified review conclusion.",
            "Sentiment": "negative",
            "PublishDate": 1754039893923,
            "Source": "earnings"
        },
        {
            "Title": "Next Radio Issues Shares to HT Media for 2.12 Billion Rupees",
            "Summary": "Next Mediaworks has announced that its subsidiary, Next Radio, has issued shares to HT Media amounting to 2.12 billion rupees. This share issuance represents a significant financial transaction between the two media companies, potentially impacting their ownership structure and financial positions.",
            "Sentiment": "neutral",
            "PublishDate": 1739146230000,
            "Source": "corporate_action"
        },
        {
            "Title": "Next Radio Issues Shares to HT Media",
            "Summary": "Next Mediaworks has announced that its subsidiary, Next Radio, has issued shares to HT Media amounting to 2.12 billion rupees. This share issuance represents a significant financial transaction between the two media companies.",
            "Sentiment": "neutral",
            "PublishDate": 1738941953000,
            "Source": "corporate_action"
        }
    ]
}