{
    "Symbol": "NGIL",
    "ISIN": "INE236Y01012",
    "News": [
        {
            "Title": "Nakoda Group Reports Q3 FY26 Results",
            "Summary": "Nakoda Group of Industries posts ₹35.24 lakh net profit in Q3 FY26 vs ₹0.03 lakh in Q3 FY25. Revenue drops to ₹1,064.51 lakh from ₹1,423.15 lakh year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1770646288332,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nakoda Group Board Meet Set for Feb 9 for Q3 Results",
            "Summary": "Nakoda Group of Industries has scheduled a board meeting on February 9, 2026, to consider Q3FY26 unaudited financial results and address late submission issues with stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1769870963010,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nakoda Group Fined ₹1.53L for Late Q2 Report Filing",
            "Summary": "Nakoda Group of Industries faces combined penalties of ₹1.53 lakh from NSE and BSE for delayed submission of Q2FY26 limited review report due to system error.",
            "Sentiment": "negative",
            "PublishDate": 1765955004595,
            "Source": "stocks"
        },
        {
            "Title": "Nakoda Group Reports Strong Q2 Turnaround with 58% Revenue Growth, Launches NOCTRL Energy Drink Brand",
            "Summary": "Nakoda Group of Industries delivered a significant financial turnaround in Q2 FY26 with revenue growing 58% year-on-year and achieving positive EBITDA of Rs. 103.37 lakhs and net profit of Rs. 25.11 lakhs. The company launched its NOCTRL energy drink brand on October 28, 2025, marking strategic entry into the FMCG beverage segment with 40% gross margins and distribution across quick commerce platforms including Blinkit.",
            "Sentiment": "positive",
            "PublishDate": 1763722389276,
            "Source": "corporate_action"
        },
        {
            "Title": "Nakoda Group Forfeits 2.77 Lakh Partly Paid-Up Shares Due to Non-Payment",
            "Summary": "Nakoda Group of Industries Limited forfeited 2,77,146 partly paid-up equity shares with face value of Rs. 10 each after shareholders failed to pay call money by the June 16, 2025 deadline. The forfeiture affects shareholders who did not respond to multiple notices for First, Second and Final Call money payments, resulting in extinction of all rights and claims on the forfeited shares.",
            "Sentiment": "negative",
            "PublishDate": 1763474031392,
            "Source": "corporate_action"
        },
        {
            "Title": "Nakoda Group Reports Strong Q2 FY26 Turnaround with 58% Revenue Growth and New FMCG Brand Launch",
            "Summary": "Nakoda Group of Industries achieved a significant financial turnaround in Q2 FY26 with revenue growing 58% year-on-year to ₹14.79 crore and EBITDA margin improving from -1.87% to 6.99%. The company launched its FMCG brand NOCTRL on October 24, 2025, marking its expansion into the beverages segment with energy drinks and flavored products across B2C and e-commerce platforms.",
            "Sentiment": "positive",
            "PublishDate": 1763298167575,
            "Source": "earnings"
        },
        {
            "Title": "Nakoda Group Forfeits 2.77 Lakh Shares and Reports Q2 Financial Results",
            "Summary": "Nakoda Group of Industries forfeited 2,77,146 partly paid-up rights equity shares due to non-payment of call money by shareholders, despite multiple notices and reminders. The company also approved its unaudited financial results for the second quarter ended September 30, 2025, with statutory auditors expressing an unmodified opinion.",
            "Sentiment": "negative",
            "PublishDate": 1763124817694,
            "Source": "corporate_action"
        },
        {
            "Title": "Nakoda Group Launches Energy Drink Brand 'NO CTRL' to Enter Beverage Market",
            "Summary": "Nakoda Group of Industries Limited announced its diversification into the beverage market with the launch of a new brand of energy and flavored soft drinks called 'NO CTRL (NO CONTROL)'. The company, which manufactures tutti frutti, cotton bales, and agricultural commodities, will launch the products on October 24, 2025, initially in Maharashtra and adjoining states before a nationwide rollout. Managing Director Pravin Choudhary stated this marks the company's strategic evolution from a traditional agro-based manufacturing business into a diversified FMCG enterprise, strengthening their transition from B2B to retail markets. The launch represents a shift toward high-demand consumer segments with youth-oriented products after three decades in food and agri-based industries.",
            "Sentiment": "positive",
            "PublishDate": 1760433504782,
            "Source": "stock"
        },
        {
            "Title": "Nakoda Group of Industries Appoints Aditya Vinod Kokil as Company Secretary and Compliance Officer",
            "Summary": "Nakoda Group of Industries Limited appointed Mr. Aditya Vinod Kokil as Whole-time Company Secretary & Compliance Officer, designated as Key Managerial Personnel (KMP), effective October 1, 2025. The appointment was approved by the Board of Directors based on recommendations from the Nomination & Remuneration Committee during a board meeting held on October 1, 2025. Mr. Kokil is an Associate member of the Institute of Company Secretaries of India (ICSI) with approximately 5 years and 6 months of post-qualification experience in Company Secretarial compliances with reputed companies. His CS membership number is A59159.",
            "Sentiment": "neutral",
            "PublishDate": 1759315651840,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nakoda Group of Industries Company Secretary Rishi Upadhaya Resigns",
            "Summary": "Rishi Upadhaya has resigned from his position as Company Secretary and Compliance Officer of Nakoda Group of Industries Limited, effective September 19, 2025. Upadhaya, who holds membership number ACS 74324, stepped down to pursue new career opportunities. His resignation was communicated to the Board of Directors on the same date, with his last working day being September 19, 2025 at closing business hours. The company has informed stock exchanges NSE and BSE about this key managerial personnel change.",
            "Sentiment": "neutral",
            "PublishDate": 1758282564514,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nakoda Group Partners with Patel Beverages for NOCTRL Brand Manufacturing",
            "Summary": "Nakoda Group of Industries Limited has signed a co-packing agreement with Patel Beverages Private Limited for the manufacturing, supply, and co-packing of NOCTRL brand beverages. Under the domestic agreement, Patel Beverages will handle production while Nakoda Group will pay consideration based on mutually agreed terms. The partnership allows Nakoda Group to enter the consumer beverage, soft drink, and energy drink segment, expanding its product range. Patel Beverages will benefit from acquiring a new client and increased capacity utilization. The agreement does not involve any share acquisition or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1754573051952,
            "Source": "order&deals"
        },
        {
            "Title": "Nakoda Group of Industries: Rights Issue Second Call Announced",
            "Summary": "Nakoda Group of Industries announced the second and final call of ₹10 on outstanding 49,54,654 partly paid-up equity shares from its rights issue. The call comprises ₹4 towards face value and ₹6 towards securities premium. The rights equity shares were originally allotted on July 6, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1745821217000,
            "Source": "corporate_action"
        }
    ]
}