{
    "Symbol": "NGLFINE",
    "ISIN": "INE887E01022",
    "News": [
        {
            "Title": "NGL Fine Chem Q3 Net Profit Surges Over 11x YoY",
            "Summary": "NGL Fine Chem reported exceptional Q3 performance with consolidated net profit jumping to ₹157 million from ₹13 million year-on-year, while revenue grew 44% to ₹1.28 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770130348684,
            "Source": "co_actions_results"
        },
        {
            "Title": "NGL Fine-Chem Company Secretary Resigns",
            "Summary": "NGL Fine-Chem Limited announces resignation of Company Secretary & Compliance Officer Mrs. Pallavi Pednekar effective January 23, 2026, to pursue external career opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1767604746553,
            "Source": "stocks"
        },
        {
            "Title": "NGL Fine-Chem Reports 28.64% Revenue Growth in Q2FY26 Amid Demand Recovery",
            "Summary": "NGL Fine-Chem Limited reported revenue growth of 28.64% year-on-year to ₹120.26 crores in Q2FY26, driven by steady demand recovery across its veterinary API product portfolio and key markets including Latin America, West Asia, Europe, and India. The company's ongoing ₹160 crore capacity expansion project remains on schedule for Q4FY26 completion, with commercial production expected to begin in the second half of the next financial year following regulatory audits.",
            "Sentiment": "positive",
            "PublishDate": 1763138572626,
            "Source": "earnings"
        },
        {
            "Title": "NGL Fine-Chem Plans ₹250 Cr Capex to Double Capacity by FY26, Targets 15-18% Revenue Growth",
            "Summary": "NGL Fine-Chem announced a ₹250 crore capital expenditure plan for new plant commissioning by FY26 to double its manufacturing capacity, supported by a 30+ API portfolio across veterinary and specialty segments. The company aims for 15-18% revenue CAGR through export-led growth and margin improvement from backward integration, while strengthening its R&D pipeline for animal health and custom synthesis.",
            "Sentiment": "positive",
            "PublishDate": 1763137109189,
            "Source": "stock"
        },
        {
            "Title": "NGL Fine-Chem Limited Announces Quarterly Financial Results for Quarter Ended September 30, 2025",
            "Summary": "NGL Fine-Chem Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The board meeting was held on November 12, 2025, at the company's Mumbai office. The results were prepared pursuant to SEBI listing regulations and include a limited review report from statutory auditors. The financial statements cover both the parent company and its wholly owned subsidiary, Macrotech Polychem Private Limited. The results have been disseminated on the company's website and submitted to BSE and NSE stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1762995180847,
            "Source": "earnings"
        },
        {
            "Title": "NGL Fine-Chem Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "NGL Fine-Chem reported quarterly consolidated net profit of 96 million rupees compared to 98 million rupees in the same period last year. The company's revenue increased to 1.2 billion rupees from 935 million rupees year-over-year. EBITDA rose to 171 million rupees from 116 million rupees, while EBITDA margin decreased to 14.25% from 17.28% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762955024172,
            "Source": "earnings"
        },
        {
            "Title": "NGL Fine-Chem Invests Rs. 119.83 Crore in Plant Expansion During Q1 FY2025-26",
            "Summary": "NGL Fine-Chem Limited invested approximately Rs. 119.83 crore in the first quarter of FY 2025-26 for expansion work at their S-18 plant. The company stated this investment is aimed at catering to future growth. This follows their earlier communication dated March 25, 2025 regarding the expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1754565604139,
            "Source": "stock"
        },
        {
            "Title": "NGL Fine-Chem Reports Strong Q1FY26 Results Despite Challenging Operating Environment",
            "Summary": "NGL Fine-Chem Limited delivered topline growth in Q1FY26, primarily driven by higher volumes despite challenging industry conditions. Revenue from operations increased 9.70% quarter-on-quarter to ₹104.19 crores. EBITDA surged 73.64% to ₹10.97 crores with margins improving to 10.53% from 6.65% in the previous quarter. Profit after tax jumped significantly to ₹9.24 crores. The company's CAPEX project completion timeline has been extended by one quarter to Q4FY26 due to execution delays, with meaningful contributions expected from end of FY27. Management noted intensified competition from new capacity commissioning globally, putting pressure on product realizations, while currency volatility and geopolitical uncertainties affected input costs. The company maintains focus on diversification into regulated markets and continues progress on its ₹160 crore greenfield expansion at Tarapur, having invested ₹119.83 crores till Q1FY26. NGL Fine-Chem operates as a leading animal health company with 90% revenue from veterinary APIs, serving over 400 customers globally across three manufacturing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1754559803143,
            "Source": "earnings"
        },
        {
            "Title": "NGL Fine-Chem Limited Reports Quarterly Financial Results for June 2025",
            "Summary": "NGL Fine-Chem Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹1,063.57 crores and standalone revenue of ₹1,074.15 crores for the quarter. Consolidated profit before tax stood at ₹1,183.95 crores while standalone profit before tax was ₹971.47 crores. The company's consolidated profit after tax was ₹924.06 crores compared to standalone profit of ₹764.41 crores. Basic earnings per share on consolidated basis was ₹29.91 and on standalone basis was ₹24.73. The company operates in pharmaceuticals manufacturing as a single business segment. The consolidated results include NGL Fine-Chem Limited and its wholly owned subsidiary Macrotech Polychem Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754059990840,
            "Source": "earnings"
        },
        {
            "Title": "NGL Fine-Chem Announces Dividend and Q4 EBITDA Results",
            "Summary": "NGL Fine-Chem has recommended a dividend of 1.75 rupees per equity share. The company's Q4 EBITDA was 63 million rupees, compared to 158.2 million rupees in the same quarter last year. The Q4 EBITDA margin was 6.65%, down from 15.86% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747925240000,
            "Source": "result"
        },
        {
            "Title": "NGL Fine-Chem Reports Q4 Financial Results",
            "Summary": "NGL Fine-Chem has reported its Q4 consolidated net profit at 5.4 million rupees, compared to 123.2 million rupees year-over-year and 13 million rupees quarter-over-quarter. The company's Q4 revenue stood at 950 million rupees, down from 997.6 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747925169000,
            "Source": "result"
        },
        {
            "Title": "Ngl Fine Chem Completes Partial Expansion at Plant S-18",
            "Summary": "Ngl Fine Chem has announced partial completion of expansion work at their Plant S-18. The company has obtained necessary approvals from the Maharashtra Pollution Control Board (MPCB) and has initiated pilot batch production at the expanded facility.",
            "Sentiment": "positive",
            "PublishDate": 1742947916000,
            "Source": "corporate_action"
        },
        {
            "Title": "NGL Fine-Chem: Settles Disclosure Lapses Case with SEBI for ₹92.21 Lakh",
            "Summary": "NGL Fine-Chem and its promoters have settled a case with SEBI for alleged shareholding disclosure violations by paying ₹92.21 lakh. The company incorrectly disclosed PCI Ferrmone Chemicals as 'public/non-promoter' instead of 'promoter & promoter group' from December 2002 to June 2019. Promoters also failed to include PCI Ferrmone's shareholding in takeover disclosures from 2011-2019.",
            "Sentiment": "neutral",
            "PublishDate": 1740564600000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NGL Fine-Chem Reports Q3 Financial Results",
            "Summary": "NGL Fine-Chem has released its Q3 financial results. The company reported a consolidated net profit of 13 million rupees, which is a significant decrease compared to 100 million rupees in the same quarter last year and 98 million rupees in the previous quarter. However, the company's revenue for Q3 stood at 891 million rupees, showing a slight increase from 879 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739146362000,
            "Source": "earnings"
        },
        {
            "Title": "NGL Fine-Chem Reports Q3 Financial Results",
            "Summary": "NGL Fine-Chem has released its Q3 financial results. The company reported a consolidated net profit of 13 million rupees, which is significantly lower compared to 100 million rupees in the same quarter last year and 98 million rupees in the previous quarter. However, the company's revenue showed a slight increase to 891 million rupees from 879 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738938079000,
            "Source": "earnings"
        },
        {
            "Title": "NGL Fine-Chem Reports Decline in Q2 EBITDA and Margin",
            "Summary": "NGL Fine-Chem's Q2 EBITDA decreased to 116 million rupees from 140 million rupees year-over-year. The company's Q2 EBITDA margin also declined to 12.37% from 17.42% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731077510000,
            "Source": "result"
        },
        {
            "Title": "NGL Fine-Chem Reports Q2 Financial Results",
            "Summary": "NGL Fine-Chem has released its Q2 financial results. The company reported a consolidated net profit of 98 million rupees, compared to 105 million rupees in the same quarter last year and 92 million rupees in the previous quarter. Revenue for Q2 stood at 935 million rupees, up from 802 million rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731077431000,
            "Source": "result"
        }
    ]
}