{
    "Symbol": "NH",
    "ISIN": "INE410P01011",
    "News": [
        {
            "Title": "Narayana Hrudayalaya Board Meet on Feb 13, 2026",
            "Summary": "Narayana Hrudayalaya Limited has scheduled its board meeting for February 13, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770381238409,
            "Source": "co_actions_results"
        },
        {
            "Title": "Narayana Hrudayalaya Holds Stakeholder Meetings",
            "Summary": "Narayana Hrudayalaya conducted shareholder and creditor meetings on January 19, 2026 to approve amalgamation scheme with subsidiary Meridian Medical Research & Hospital Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1768829206556,
            "Source": "co_actions_results"
        },
        {
            "Title": "Narayana Hrudayalaya Gets Credit Rating Reaffirmation",
            "Summary": "ICRA reaffirms [ICRA]AA (Stable) rating for Narayana Hrudayalaya's ₹5,195 crore facilities. Company shows strong financial performance with 15% revenue growth in H1 FY2026 and healthy 23.5% operating margins despite expansion investments.",
            "Sentiment": "positive",
            "PublishDate": 1768828001170,
            "Source": "co_actions_results"
        },
        {
            "Title": "Narayana Hrudayalaya Forms New Healthcare Subsidiary",
            "Summary": "Narayana Hrudayalaya Limited incorporates wholly owned subsidiary Narayana Healthcare North Private Limited with ₹5.00 lakh paid-up capital to expand healthcare services in northern India.",
            "Sentiment": "positive",
            "PublishDate": 1768583552253,
            "Source": "co_actions_results"
        },
        {
            "Title": "Narayana Hrudayalaya Gets AA Rating Reaffirmation",
            "Summary": "ICRA reaffirmed AA (Stable) ratings for Narayana Hrudayalaya's bank facilities worth ₹3,895 crores and NCDs worth ₹1,300 crores, maintaining strong credit profile.",
            "Sentiment": "positive",
            "PublishDate": 1768293565555,
            "Source": "stocks"
        },
        {
            "Title": "Narayana Hrudayalaya: ₹81.53 Cr NSE Block Trade",
            "Summary": "Narayana Hrudayalaya witnessed a significant block trade on NSE worth ₹81.53 crores involving 426,211 shares at ₹1,913 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767586194683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Narayana Health Board Approves Demerger Scheme",
            "Summary": "Board meeting held on December 12, 2025 approved scheme of arrangement for demerging clinical services undertaking from NH Integrated Care into Narayana Hrudayalaya under Companies Act sections 230-232.",
            "Sentiment": "neutral",
            "PublishDate": 1765543519370,
            "Source": "co_actions_results"
        },
        {
            "Title": "Narayana Health Receives GST Penalty of Rs 24.62 Lakh from Karnataka Authority",
            "Summary": "Narayana Health received a GST penalty order of Rs 24.62 lakh from Karnataka's Deputy Commissioner for alleged non-payment of GST amounting to Rs 2.45 crore on revenue exempted from GST being healthcare services for financial year 2021-22. The company states there is no material impact on its financials or operations and plans to file an appeal with the Appellate Authority challenging the order.",
            "Sentiment": "negative",
            "PublishDate": 1764679195021,
            "Source": "stock"
        },
        {
            "Title": "Narayana Hrudayalaya Sees Rs. 219.85 Crore Block Trade on NSE",
            "Summary": "Narayana Hrudayalaya Ltd. witnessed a significant block trade worth Rs. 219.85 crores involving 1,121,674 shares at Rs. 1,960 per share on the NSE. The large-volume transaction indicates substantial institutional or bulk investor activity in the healthcare company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764042865430,
            "Source": "order&deals"
        },
        {
            "Title": "Narayana Health Reports Strong Q2 FY26 Performance with 20% EBITDA Growth and Robust Cayman Operations",
            "Summary": "Narayana Health delivered impressive quarterly results with 20% EBITDA growth in India operations despite reduced bed capacity, driven by improved payor-mix optimization and higher-end procedures including 97 robotic cardiac surgeries in September. The company's Cayman Islands operations showed exceptional performance with 70% revenue growth in insurance business and hospital margins of 43-44%, while completing the Practice Plus acquisition in UK for expanding international presence.",
            "Sentiment": "positive",
            "PublishDate": 1763983780987,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Shares Surge 10% on Strong Q2 Results with 30% Profit Growth",
            "Summary": "Narayana Hrudayalaya reported a 29.6% year-on-year increase in net profit to Rs 258.3 crore for Q2 FY26, with consolidated revenue rising 20.3% to Rs 1,644 crore driven by growth in both India and Cayman operations. The strong financial performance led to a 10% surge in share price to Rs 1,929, with the stock gaining nearly 45% year-to-date as the healthcare chain achieved record revenue and profitability levels.",
            "Sentiment": "positive",
            "PublishDate": 1763361233830,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Health Reports Strong Q2FY26 Results with 20.3% Revenue Growth",
            "Summary": "Narayana Health delivered consolidated operating revenue of ₹16,438 Mn in Q2FY26, marking 20.3% YoY growth, with EBITDA rising 28.3% to ₹4,265 Mn at 25.9% margin. The healthcare provider achieved highest-ever revenue and profitability at both India and Group levels, driven by strong domestic footfall growth and improved payor mix across its network of 18 hospitals and 2 heart centers.",
            "Sentiment": "positive",
            "PublishDate": 1763173403891,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Completes Full Acquisition of Practice Plus Group Hospitals in UK",
            "Summary": "Narayana Hrudayalaya has completed the full acquisition of Practice Plus Group Hospitals in the United Kingdom. This transaction represents the healthcare company's expansion into the UK hospital market through the complete takeover of the Practice Plus Group's hospital operations.",
            "Sentiment": "positive",
            "PublishDate": 1762445576459,
            "Source": "order&deals"
        },
        {
            "Title": "Narayana Hrudayalaya Acquires UK's Practice Plus Group for £183 Million",
            "Summary": "Narayana Hrudayalaya has acquired UK-based Practice Plus Group Hospitals for £183 million, marking the company's entry into the UK healthcare market. The acquisition includes NHS contracts and an asset-light day-care model with 50% available capacity. The company plans to scale operations and enhance private-pay presence using its digital Athma platform for efficiency and growth.",
            "Sentiment": "positive",
            "PublishDate": 1762181816965,
            "Source": "order&deals"
        },
        {
            "Title": "Narayana Health Schedules Conference Call on UK Hospital Acquisition",
            "Summary": "Narayana Hrudayalaya Limited announced it will host a conference call on November 3, 2025 at 12 noon IST to discuss its acquisition of UK-based Practice Plus Group Hospitals Limited. The company referenced previous disclosures made on October 30 and October 31, 2025 regarding the acquisition. Meeting details including Zoom link, meeting ID, and passcode were provided to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761903971820,
            "Source": "order&deals"
        },
        {
            "Title": "Narayana Health Acquires UK's Practice Plus Group Hospitals for GBP 188.78 Million",
            "Summary": "Narayana Health announced the acquisition of 100% equity shares of Practice Plus Group Hospitals Limited, a UK-based healthcare company, for GBP 188.78 million through cash consideration. The acquisition is being executed through Health City Cayman Islands Limited's subsidiary, Narayana Hrudayalaya UK Ltd. Practice Plus Group operates 16 healthcare facilities including 7 hospitals, 3 surgical centers, 2 urgent treatment centers, 3 musculoskeletal/diagnostic centers, and 1 ophthalmology center with a total capacity of 330 beds. The company employs 2,500 full-time equivalents, including 1,300 doctors and clinical staff. Practice Plus Group reported a turnover of GBP 229 million in the year ended September 2024, with an estimated GBP 250 million for the year ending September 2025. The acquisition is expected to close within 6 business days and aims to build upon Narayana Health's international presence following its expansion in the Caribbean. No regulatory approvals are required for the transaction.",
            "Sentiment": "positive",
            "PublishDate": 1761854394871,
            "Source": "order&deals"
        },
        {
            "Title": "Narayana Hrudayalaya's Health City Cayman Islands Expands Operations to UK",
            "Summary": "Narayana Hrudayalaya's Health City Cayman Islands has opened a new unit in the United Kingdom, marking an international expansion for the healthcare organization.",
            "Sentiment": "positive",
            "PublishDate": 1759933828349,
            "Source": "stock"
        },
        {
            "Title": "Narayana Hrudayalaya Reports Mixed Quarterly Results with Margin Pressures from New Business Ventures",
            "Summary": "Narayana Hrudayalaya's quarterly results showed mixed performance across operations. India operations demonstrated improvement with expanded EBITDA margins driven by better payor mix, higher value procedures, and price increases. The company's Average Length of Stay decreased from 4.5 to 4.3 days. Cayman Islands operations generated $45 million in revenue but faced challenges with EBITDA declining by INR 20-25 crores sequentially due to margin dilution from the new Integrated Care business. The new hospital ramp-up continues with all services now activated. Government schemes represented 19% of the patient mix, while Bangladesh revenue dropped 50% year-over-year. The company's insurance business maintained flat Gross Written Premium covering 6,000 policyholders. Oncology operations are growing with management targeting 20-25% of total revenue within five years. Narayana Hrudayalaya announced expansion plans including new hospitals in Bangalore, Kolkata, and Raipur by FY27-28, supported by INR 3,000 crores in capex. Digital transformation initiatives include paperless hospitals and improved ICU systems. The Integrated Care model is expected to reach breakeven in 1-2 years, while new insurance and clinic businesses remain in investment phase with initial losses.",
            "Sentiment": "neutral",
            "PublishDate": 1754918233397,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Reports 15.4% Revenue Growth in Q1 FY26, Submits Revised Investor Presentation",
            "Summary": "Narayana Hrudayalaya Limited submitted a revised investor presentation for the quarter ended June 30, 2025. The healthcare company reported consolidated operating revenues of ₹15,073 million in Q1 FY26, representing a 15.4% year-over-year increase and 2.2% quarter-over-quarter growth. The company achieved consolidated EBITDA of ₹3,607 million with a margin of 23.9% and consolidated profit after tax of ₹1,961 million with a margin of 13.0%. The company operates 40 healthcare facilities with 5,563 operational beds across India and Cayman Islands, including 18 owned/operated hospitals, 2 heart centers, and 18 clinics. Net debt to equity ratio stands at 0.09 with total borrowings less cash and investments of ₹3,430 million as of June 30, 2025. The company has expansion plans targeting over 7,600 bed capacity with multiple projects in progress across Bangalore, Kolkata, and Raipur.",
            "Sentiment": "positive",
            "PublishDate": 1754206376929,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Health Reports Double-Digit Growth in Q1 FY26 with Strategic Expansion Plans",
            "Summary": "Narayana Health achieved double-digit growth in Q1 FY26 while maintaining strong business momentum. The healthcare company is implementing strategic capital expenditure initiatives and pursuing deep technology-led transformation. The company is focusing on scalable healthcare expansion with an emphasis on ESG-driven operations.",
            "Sentiment": "positive",
            "PublishDate": 1754063733941,
            "Source": "stock"
        },
        {
            "Title": "Narayana Hrudayalaya Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Narayana Hrudayalaya reported quarterly consolidated net profit of 1.97 billion rupees, down from 2 billion rupees in the same period last year. Revenue increased to 15.07 billion rupees from 13.06 billion rupees year-over-year. EBITDA rose to 3.61 billion rupees from 3.26 billion rupees, while EBITDA margin declined to 23.93% from 24.94%. The company's board has requested permission to issue debt securities worth up to 25 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1754055845022,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Schedules Board Meeting to Approve Q1 Results and Consider Debt Fundraising",
            "Summary": "Narayana Hrudayalaya Limited will hold a Board of Directors meeting on August 1, 2025, to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also review a revised proposal to raise funds through debt securities via private placement in multiple tranches, subject to shareholder approval at the Annual General Meeting scheduled for August 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753706343258,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya Receives BSE Approval for Merger Plan",
            "Summary": "Narayana Hrudayalaya has received no objections from the Bombay Stock Exchange (BSE) regarding its proposed merger plan. The company can now proceed with the next steps in the merger process.",
            "Sentiment": "positive",
            "PublishDate": 1750769375000,
            "Source": "default"
        },
        {
            "Title": "Narayana Hrudayalaya Invests $1 Million in Cayman Subsidiary",
            "Summary": "Narayana Hrudayalaya has invested $1 million into its downstream subsidiary, Cayman Integrated Healthcare. The investment is intended to facilitate working capital requirements for the subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1749608622000,
            "Source": "default"
        },
        {
            "Title": "Narayana Hrudayalaya Reports Q4 Results and Dividend",
            "Summary": "Narayana Hrudayalaya has announced its quarterly results and dividend. The company's Q4 EBITDA increased to 3.85 billion rupees from 3.14 billion rupees year-over-year. The EBITDA margin improved to 26.07% from 25.26% in the same period. Additionally, the company has recommended a dividend of 4.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748009425000,
            "Source": "result"
        },
        {
            "Title": "Narayana Hrudayalaya Reports Q4 Financial Results",
            "Summary": "Narayana Hrudayalaya announced its Q4 consolidated net profit of 1.97 billion rupees, compared to 1.91 billion rupees year-over-year and 1.92 billion rupees quarter-over-quarter. The company's Q4 revenue increased to 14.7 billion rupees from 12.8 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748009270000,
            "Source": "result"
        },
        {
            "Title": "Narayana Hrudayalaya Board to Consider Debt Securities Issuance",
            "Summary": "Narayana Hrudayalaya has announced a board meeting scheduled for May 23 to consider raising funds through the issuance of debt securities. The company has not provided any additional details about the potential amount or purpose of the fundraising.",
            "Sentiment": "neutral",
            "PublishDate": 1747404777000,
            "Source": "default"
        },
        {
            "Title": "Narayana Hrudayalaya's Subsidiary Forms Joint Venture for Cancer Care Expansion in India",
            "Summary": "Narayana Hrudayalaya's subsidiary, Healthcare Global Consolidated India (HCCI), has formed a joint venture to expand cancer care services in India. This strategic move aims to enhance the company's presence in the oncology sector and improve access to cancer treatment across the country.",
            "Sentiment": "positive",
            "PublishDate": 1741427735000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya Initiates 1,100-bed Hospital Project in Kolkata",
            "Summary": "Narayana Hrudayalaya has laid the foundation stone for a new 1,100-bed hospital project called 'Narayana Health City' in Kolkata. The company plans to invest approximately ₹900 crore in the first phase of this project.",
            "Sentiment": "positive",
            "PublishDate": 1740096549000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya Initiates 1,100-Bed Hospital Project in Kolkata",
            "Summary": "Narayana Hrudayalaya has laid the foundation stone for a new 1,100-bed hospital project called 'Narayana Health City' in Kolkata. The company plans to invest approximately ₹900 crore in the first phase of the project.",
            "Sentiment": "positive",
            "PublishDate": 1740059106000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya Confirms Q3 FY25 Financial Results and Expansion Plans",
            "Summary": "Narayana Hrudayalaya has issued a clarification regarding recent news articles discussing their Q3 FY25 financial results. The company confirmed a 2.6% increase in net profit to Rs. 192.9 crores and plans for capacity expansion with a focus on oncology. The company stated that the news items published in mainstream media are based on their disclosed financial results.",
            "Sentiment": "positive",
            "PublishDate": 1739924277000,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Confirms News Articles Based on Financial Results Disclosures",
            "Summary": "Narayana Hrudayalaya has officially confirmed that recent news articles published in mainstream media about the company are based on the disclosures of their financial results. The company has acknowledged the accuracy of these news items, indicating transparency in their financial reporting and communication with the public.",
            "Sentiment": "neutral",
            "PublishDate": 1739886206000,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Clarifies Q3 FY25 Results and Expansion Plans",
            "Summary": "Narayana Hrudayalaya has issued a clarification regarding recent news articles discussing their Q3 FY25 financial results. The company reported a 2.6% increase in net profit, reaching Rs. 192.9 crores. Additionally, the articles mentioned the company's plans for capacity expansion, with a particular focus on oncology services.",
            "Sentiment": "positive",
            "PublishDate": 1739886184000,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Reports Increased Q3 Profit and Revenue",
            "Summary": "Narayana Hrudayalaya, a healthcare provider, has announced its financial results for the third quarter. The company reported a consolidated net profit of 1.93 billion rupees, up from 1.88 billion rupees in the same period last year. Revenue also saw growth, reaching 13.67 billion rupees compared to 12.04 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739751466000,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya: Q3 Profit Up 2.62% YoY, Revenue Rises 13.55%",
            "Summary": "Narayana Hrudayalaya reported Q3 FY25 results with profit at ₹192.94 crore, up 2.62% YoY. Revenue increased 13.55% YoY to ₹1366.68 crore. However, both profit and revenue declined QoQ by 2.86% and 2.38% respectively. EPS stood at ₹9.5, up 2.59% YoY. Operating income rose 9.86% YoY but fell 2.57% QoQ.",
            "Sentiment": "positive",
            "PublishDate": 1739598904000,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Reports Q3 Financial Results",
            "Summary": "Narayana Hrudayalaya, a healthcare provider, has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 3.25 billion rupees from 2.97 billion rupees in the same quarter last year. However, the EBITDA margin decreased slightly to 23.81% from 24.67% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739540120000,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Reports Q3 Financial Results",
            "Summary": "Narayana Hrudayalaya announced its Q3 consolidated financial results. The company reported a net profit of 1.93 billion rupees, compared to 1.88 billion rupees in the same quarter last year. Revenue for Q3 increased to 13.67 billion rupees from 12.04 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739540114000,
            "Source": "earnings"
        },
        {
            "Title": "Narayana Hrudayalaya Acquires Land for Expansion in Bengaluru",
            "Summary": "Narayana Hrudayalaya has purchased approximately 3 acres of land in southern Bengaluru. This acquisition is part of the company's business expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1738801140000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya Acquires Land for Expansion in Bengaluru",
            "Summary": "Narayana Hrudayalaya has purchased approximately 3 acres of land in southern Bengaluru. This acquisition is part of the company's business expansion plans, indicating potential growth and development in their healthcare operations.",
            "Sentiment": "positive",
            "PublishDate": 1738756284000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya Signs MOU for New Hospital in Bengaluru",
            "Summary": "Narayana Hrudayalaya has signed a Memorandum of Understanding (MOU) with Sunglow Realties to establish a 200-bed hospital in central Bengaluru. This agreement marks a significant expansion of Narayana Hrudayalaya's healthcare services in the city.",
            "Sentiment": "positive",
            "PublishDate": 1738032926000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya's Subsidiary Granted Insurer Certificate in Cayman Islands",
            "Summary": "Cayman Integrated Healthcare Ltd., a step-down subsidiary of Narayana Hrudayalaya in the Cayman Islands, has been granted an Insurer Certificate by the Health Insurance Commission, Cayman Islands on December 27, 2024. This certification will allow the subsidiary to offer health insurance services, creating an additional revenue stream that complements the health services provided by the company and its subsidiary. The new offering is expected to enhance the business model of both Narayana Hrudayalaya and its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1735518064000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya's Subsidiary to Offer Health Insurance",
            "Summary": "Narayana Hrudayalaya announced that its subsidiary, Cayman Integrated Healthcare Ltd., will now offer health insurance services. This move is expected to create an additional revenue stream for the company, complementing its existing health services.",
            "Sentiment": "positive",
            "PublishDate": 1735373481000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya's Subsidiary Granted Insurer Certificate in Cayman Islands",
            "Summary": "Cayman Integrated Healthcare Ltd., a step-down subsidiary of Narayana Hrudayalaya, has been granted an Insurer Certificate by the Health Insurance Commission of the Cayman Islands. The certificate is set to be effective from December 27, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1735373440000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya Subsidiary Invests $1.5M in Cayman Integrated Healthcare",
            "Summary": "A subsidiary of Narayana Hrudayalaya has infused $1.5 million into Cayman Integrated Healthcare Limited to meet working capital requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1733567128000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Health: Delhi High Court Protects Doctor's Rights and Hospital Trademark",
            "Summary": "Delhi High Court issued an injunction to protect Dr. Devi Prasad Shetty's personality rights and Narayana Hrudayalaya's trademark against misuse. The court ordered removal of misleading content and prohibited unauthorized use of Shetty's name and image, including through AI and deepfake technologies.",
            "Sentiment": "positive",
            "PublishDate": 1733142136000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Narayana Hrudayalaya Approves Amalgamation of Meridian Medical Research & Hospital",
            "Summary": "The board of Narayana Hrudayalaya has approved a scheme of amalgamation to merge Meridian Medical Research & Hospital into the company. This corporate action represents a significant restructuring move for Narayana Hrudayalaya, potentially consolidating its operations and expanding its healthcare services portfolio.",
            "Sentiment": "neutral",
            "PublishDate": 1732893977000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Health Denies Intention to Make Offer for Spire Healthcare",
            "Summary": "Narayana Hrudayalaya, operating as Narayana Health, has officially clarified that it has no intention to make an offer for Spire Healthcare. The company stated that it routinely evaluates strategic opportunities as part of its ongoing business practices, but has no specific plans regarding Spire at this time.",
            "Sentiment": "neutral",
            "PublishDate": 1732882509000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Narayana Health in Talks to Acquire Stakes in UK's Spire Healthcare",
            "Summary": "Narayana Hrudayalaya, operating as Narayana Health, is reportedly in discussions to purchase stakes in Spire Healthcare, a UK-based healthcare provider. This potential acquisition suggests Narayana Health's interest in expanding its operations internationally, particularly into the UK healthcare market.",
            "Sentiment": "positive",
            "PublishDate": 1732851821000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya Invests in Advanced Medical Technologies",
            "Summary": "Narayana Hrudayalaya is investing in cutting-edge medical technologies, including robotic surgery and immune therapy for cancer treatment. The company is focusing on organic product development, which may impact revenue in the short term over the next one to two years.",
            "Sentiment": "positive",
            "PublishDate": 1730863157000,
            "Source": "corporate_action"
        },
        {
            "Title": "Narayana Hrudayalaya Forecasts Decline in International Business",
            "Summary": "Narayana Hrudayalaya expects its international business to diminish completely over the next decade. The company is optimistic about successfully controlling startup costs and anticipates a return to pre-commissioning profit margins within 4-5 quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1730863082000,
            "Source": "corporate_action"
        }
    ]
}