{
    "Symbol": "NHPC",
    "ISIN": "INE848E01016",
    "News": [
        {
            "Title": "NHPC to Participate in Two Major Investor Conferences",
            "Summary": "NHPC Limited announces participation in MANTHAN Systematix India Annual Conference and Advantage India Axis Capital Conference on February 9-10, 2026 in Mumbai for analyst and investor interactions.",
            "Sentiment": "neutral",
            "PublishDate": 1770213406601,
            "Source": "stocks"
        },
        {
            "Title": "NHPC Q3 Net Profit Drops 4.3% to ₹2,200 Crores",
            "Summary": "NHPC reports consolidated net profit of ₹2,200 crores in Q3, down from ₹2,300 crores year-on-year. Revenue also declined to ₹22,200 crores from ₹22,900 crores in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1770206834848,
            "Source": "co_actions_results"
        },
        {
            "Title": "NHPC announces senior management changes effective Feb 2026",
            "Summary": "NHPC Limited notifies stock exchanges of executive director transition with Shri Rajat Gupta retiring on January 31, 2026, and Shri Anish Gouraha taking over from February 01, 2026 through promotion.",
            "Sentiment": "neutral",
            "PublishDate": 1769876103846,
            "Source": "stocks"
        },
        {
            "Title": "NHPC Commissions Unit #3 of Subansiri Lower Project",
            "Summary": "NHPC Limited announces commercial operation of Unit #3 (250 MW) of its 2000 MW Subansiri Lower HE Project from February 1, 2026, marking completion of second unit.",
            "Sentiment": "positive",
            "PublishDate": 1769781901295,
            "Source": "stocks"
        },
        {
            "Title": "NHPC Block Trade Worth Rs. 16.19 Crores on NSE",
            "Summary": "NHPC Ltd. witnessed a significant block trade on NSE involving 2,169,822 shares valued at Rs. 16.19 crores, executed at Rs. 74.63 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769497521366,
            "Source": "co_actions_results"
        },
        {
            "Title": "NHPC Shares Drop 2.01% Despite Strong Q2 Growth",
            "Summary": "NHPC stock declined 2.01% to ₹75.89 despite reporting robust quarterly growth with revenue rising 10.27% YoY to ₹3,365.26 crore and net profit increasing 14.06% to ₹1,219.19 crore in Q2 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1769164972244,
            "Source": "co_actions_results"
        },
        {
            "Title": "CLSA Sets ₹117 Target for NHPC with 41% Upside",
            "Summary": "Global brokerage CLSA maintains high conviction rating on NHPC Ltd, projecting 41% upside potential driven by 64% capacity expansion and 90% EPS growth expected in 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768273240324,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Issues 'High-Conviction Outperform' Call on NHPC",
            "Summary": "CLSA sets ₹117 target price for NHPC, citing 64% capacity expansion in FY26 and 90% EPS growth over FY25-27. Company approves ₹2,000 crore bond issue for financial flexibility.",
            "Sentiment": "positive",
            "PublishDate": 1767938009434,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Sets ₹117 Target for NHPC with 43% Upside",
            "Summary": "CLSA maintains 'High conviction outperform' rating on NHPC with ₹117 price target, citing three key growth catalysts including Parbati II tariff finalisation and Subansiri project commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1767937748905,
            "Source": "stocks"
        },
        {
            "Title": "NHPC Board Approves ₹2,000 Cr Bond Issuance Plan",
            "Summary": "State-owned hydro power giant NHPC's board approved unsecured bond issuance of up to ₹2,000 crore via private placement as part of FY26 borrowing plan. Q2 FY26 net profit rose 13.4% YoY to ₹1,021 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767936429156,
            "Source": "co_actions_results"
        },
        {
            "Title": "NHPC Board Approves ₹2,000 Cr Bond Issuance Plan",
            "Summary": "NHPC Limited's Board of Directors approved the issuance of unsecured, redeemable, taxable, non-convertible bonds worth up to ₹2,000 crores through private placement as part of FY 2025-26 borrowing plan.",
            "Sentiment": "positive",
            "PublishDate": 1767884385295,
            "Source": "co_actions_results"
        },
        {
            "Title": "NHPC Board Approves ₹20,000 Cr Bond Issuance",
            "Summary": "NHPC's board has approved the issuance of bonds worth up to ₹20,000 crores to support the company's capital requirements and business expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1767884181818,
            "Source": "co_actions_results"
        },
        {
            "Title": "NHPC shares surge 10% in 5 days on fundraising news",
            "Summary": "NHPC shares gained 1.2% to Rs 84.69, marking fifth consecutive session of gains totaling over 10% in five days. Board to meet January 8 to approve Rs 2,000 crore bond issuance plan for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767591620955,
            "Source": "co_actions_results"
        },
        {
            "Title": "NHPC to raise ₹2,000 cr via bond placement",
            "Summary": "State-owned hydro power giant NHPC plans to raise ₹2,000 crore through private placement of bonds, with board meeting scheduled for January 8. Company reported strong Q2 performance with 13.4% YoY profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1767365908339,
            "Source": "co_actions_results"
        },
        {
            "Title": "NHPC Plans ₹2,000 Crore Bond Issuance Discussion",
            "Summary": "NHPC Ltd scheduled to discuss potential bond issuance of up to ₹20.00 billion (₹2,000 crores) on January 8, marking significant fundraising initiative for the power generation company.",
            "Sentiment": "neutral",
            "PublishDate": 1767359117537,
            "Source": "stocks"
        },
        {
            "Title": "NHPC announces senior management changes effective Jan 2026",
            "Summary": "NHPC Limited announces key senior management transitions with Shri Sandeep Kumar retiring on December 31, 2025, and new appointments of Shri Abhayanand Thakur and Shri Rajil Vyas as Executive Directors from January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767187291778,
            "Source": "stocks"
        },
        {
            "Title": "NHPC Reduces Stake in Ratle Hydro Electric Power Corp",
            "Summary": "NHPC adjusts its shareholding in Ratle Hydro Electric Power Corp from 59.51% to 49.72%, reducing its stake by approximately 9.79 percentage points in the joint venture project.",
            "Sentiment": "neutral",
            "PublishDate": 1767017876941,
            "Source": "co_actions_results"
        },
        {
            "Title": "NHPC's stake in Ratle Hydroelectric drops to 49.72%",
            "Summary": "NHPC Limited's shareholding in subsidiary Ratle Hydroelectric Power Corporation Limited decreased from 59.51% to 49.72% due to additional equity contribution from Jammu and Kashmir State Power Development Corporation Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767016735073,
            "Source": "stocks"
        },
        {
            "Title": "NHPC Board Meet on Feb 4, 2026 for Q3FY26 Results",
            "Summary": "NHPC Limited has scheduled its Board of Directors meeting for February 4, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1766999076374,
            "Source": "co_actions_results"
        },
        {
            "Title": "NHPC Launches New 250 MW Unit at Subansiri Project",
            "Summary": "NHPC has successfully launched a new 250 MW unit at its Subansiri Lower Hydroelectric Project, marking significant progress toward achieving the project's full operational capacity of 2000 MW.",
            "Sentiment": "positive",
            "PublishDate": 1766371359029,
            "Source": "stocks"
        },
        {
            "Title": "NHPC Finalizes Tripartite Agreement with New RTA",
            "Summary": "NHPC Limited completes tripartite agreement with Kfin Technologies Limited as new registrar and transfer agent, replacing Alankit Assignments Limited effective July 29, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1766060901447,
            "Source": "stocks"
        },
        {
            "Title": "NHPC Successfully Synchronizes 250MW Unit of Subansiri Lower Hydro Project with National Grid",
            "Summary": "NHPC Limited achieved test synchronization of the 250MW Unit 2 of its 2000MW Subansiri Lower Hydro Electric Project with the national grid on December 2, 2025. The Commercial Operation Date (CoD) for Unit 2 is expected in December 2025, marking progress in the company's major hydro power development.",
            "Sentiment": "positive",
            "PublishDate": 1764748737511,
            "Source": "stock"
        },
        {
            "Title": "NHPC Appoints Mahesh Kumar Sharma as Chief Financial Officer",
            "Summary": "NHPC Limited's Board of Directors appointed Shri Mahesh Kumar Sharma as Chief Financial Officer effective November 6, 2025. Sharma, who holds Director (Finance) position at NHPC, is a Fellow Member of the Institute of Chartered Accountants of India with over 30 years of post-qualification experience. He previously served as Finance Head of NHPC's Commercial Division and Chief Finance Officer of NHPC Renewable Energy Ltd. Sharma began his career at NHPC as an Accounts Officer and has over 25 years of experience with the company across finance, corporate accounts, treasury, commercial and contracts domains. He was part of the Initial Public Offer implementation team during NHPC's listing on Indian bourses and has extensive experience in financial management of large-scale infrastructure projects and regulatory frameworks for hydroelectric power projects.",
            "Sentiment": "positive",
            "PublishDate": 1762480748315,
            "Source": "corporate_governance"
        },
        {
            "Title": "NHPC Reports 8.3% Decline in Quarterly Profit to ₹925.52 Crore Despite Revenue Growth",
            "Summary": "NHPC Limited reported a net profit of ₹925.52 crore for the quarter ended September 30, 2025, compared to ₹1,071.87 crore in the previous quarter, representing an 8.3% decline. Revenue from operations increased to ₹2,732.11 crore from ₹2,677.32 crore in the prior quarter. For the half-year period, profit rose to ₹1,997.39 crore from ₹1,916.46 crore in the corresponding period last year. The company commissioned its 800MW Parbati-II Project in April 2025 and partially commissioned the 214.28MW Karnisar Solar Power Project. NHPC's Board approved the quarterly results and declared that no defaults exist on outstanding loans and debt securities totaling ₹41,474.91 crore. The company maintained security cover of 100% or higher for its listed non-convertible debt securities.",
            "Sentiment": "neutral",
            "PublishDate": 1762463070790,
            "Source": "earnings"
        },
        {
            "Title": "NHPC Reports 13.4% Growth in Q2 Net Profit to 10.21 Billion Rupees",
            "Summary": "NHPC reported quarterly net profit of 10.21 billion rupees compared to 9 billion rupees in the same period last year. Revenue increased to 33.65 billion rupees from 30.5 billion rupees year-over-year. EBITDA rose to 20.27 billion rupees versus 18 billion rupees previously, while EBITDA margin improved to 60.23% from 58.15% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762429007384,
            "Source": "earnings"
        },
        {
            "Title": "NHPC Reports Q2 Revenue Decline to 45.4 Billion Rupees",
            "Summary": "NHPC recorded revenue of 45.4 billion rupees in Q2, representing a decrease from 52 billion rupees in the same quarter of the previous year. This marks a year-over-year decline in the company's quarterly revenue performance.",
            "Sentiment": "negative",
            "PublishDate": 1762421465301,
            "Source": "earnings"
        },
        {
            "Title": "NHPC Limited Announces Senior Management Changes with New Executive Director Appointment",
            "Summary": "NHPC Limited has announced changes in its senior management personnel. Shri Prashant ceased his position on October 31 upon reaching superannuation age. Shri Jitendra Kumar has been appointed as Executive Director through promotion effective November 1, 2025. The new appointee holds a B.Tech in Electrical engineering, joined the company on November 13, 1995, and has 29 years of service experience. The company informed stock exchanges BSE and NSE about these management changes in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761922967639,
            "Source": "corporate_governance"
        },
        {
            "Title": "NHPC Plans ₹35,000 Crore Solar Projects to Reach 22,000 MW Capacity by 2028",
            "Summary": "NHPC has announced plans to develop solar projects worth ₹35,000 crore with a target to achieve 22,000 MW capacity by 2028. The company is expanding its renewable energy portfolio through this significant solar power initiative.",
            "Sentiment": "positive",
            "PublishDate": 1760950743917,
            "Source": "stock"
        },
        {
            "Title": "NHPC Appoints Mahesh Kumar Sharma as Director (Finance) for Five-Year Term",
            "Summary": "NHPC Limited appointed Shri Mahesh Kumar Sharma as Director (Finance) for a five-year term effective October 17, 2025, following an order from the Ministry of Power. Sharma, who holds DIN 11306355, assumed charge on the same date. He previously served as Finance Head of Commercial Division at NHPC and Chief Finance Officer of NHPC Renewable Energy Ltd. Sharma is a Fellow Member of the Institute of Chartered Accountants of India with over 30 years of post-qualification experience and has been with NHPC for more than 25 years since joining as Accounts Officer in July 2000. Following this appointment, Shri Sipan Kumar Garg ceased to hold the additional charge of Director (Finance) position. The company confirmed that Sharma is not related to any existing directors and faces no regulatory restrictions from holding the position.",
            "Sentiment": "neutral",
            "PublishDate": 1760704777741,
            "Source": "corporate_governance"
        },
        {
            "Title": "NHPC Launches 300 MW Solar Project in Bikaner, Rajasthan",
            "Summary": "NHPC has launched a 300 MW solar project in Bikaner, Rajasthan. The project commenced full capacity operations on October 16, 2025, and has received approval from PSERC (Punjab State Electricity Regulatory Commission).",
            "Sentiment": "positive",
            "PublishDate": 1760684183455,
            "Source": "stock"
        },
        {
            "Title": "NHPC Completes Trial Run of 300 MW Karnisar Solar Project in Rajasthan",
            "Summary": "NHPC has successfully completed the trial run of the final phase of its 300 MW Karnisar Solar Project in Bikaner, Rajasthan. The company received the Certificate of Successful Trial Run Completion for the 5th and final phase covering 85.72 MW capacity. The plant's full 300 MW capacity is now ready for commercial operation. The 25-year Power Usage Agreement period will commence after approval from Punjab State Electricity Regulatory Commission and consent from Punjab State Power Corporation Limited, which is expected shortly.",
            "Sentiment": "positive",
            "PublishDate": 1760184975664,
            "Source": "stock"
        },
        {
            "Title": "NHPC Begins Reservoir Filling for 2000 MW Subansiri Lower Project, 1000 MW Units Set for Commissioning",
            "Summary": "NHPC Limited has started reservoir filling for its Subansiri Lower HE Project (2000 MW) after obtaining permission from the National Dam Safety Authority. The project includes four generating units of 250 MW each, totaling 1000 MW, which have been boxed up and are scheduled for commissioning during fiscal year 2025-26. The company stated that further developments will be communicated in due course.",
            "Sentiment": "positive",
            "PublishDate": 1760116529646,
            "Source": "stock"
        },
        {
            "Title": "India Starts Construction of Highest Dam in Arunachal Pradesh Worth ₹17,069 Crore",
            "Summary": "India has begun construction of the Dibang Multipurpose Project in Arunachal Pradesh, which will be the country's highest dam at 278 meters. NHPC Limited has floated a global tender worth ₹17,069 crore for the main dam construction with a 91-month deadline, targeting completion by 2032. The 2880-MW project has a total cost of ₹31,875 crore and aims to generate 11,223 million units of electricity annually. The dam serves dual purposes of power generation and flood moderation, with a flood control capacity of 1,282 million cubic meters. The project will provide Arunachal Pradesh with ₹700 crore annually in free power. The construction follows reports of China building the world's largest hydropower dam on the Yarlung Tsangpo river in Tibet. The Dibang dam is positioned as a strategic buffer against potential water releases from China's dam and to prevent flooding in Indian territory. Prime Minister Narendra Modi laid the foundation stone for the project, and Chief Minister Pema Khandu has inspected the site at village Minli.",
            "Sentiment": "neutral",
            "PublishDate": 1757906556106,
            "Source": "stock"
        },
        {
            "Title": "NHPC Appoints Bhupender Gupta as Chairman & Managing Director for Five-Year Term",
            "Summary": "NHPC Limited has appointed Shri Bhupender Gupta as Chairman & Managing Director for a five-year term effective September 4, 2025, or until his superannuation on October 31, 2030, whichever is earlier. The appointment was made by the Ministry of Power. Gupta holds a bachelor's degree in electrical engineering and an MBA in Operations Management, with over 34 years of experience in the power sector including 31 years in Power CPSUs. He previously worked with ACC Ltd, SJVN, REC Ltd, and THDCIL, and has been holding additional charge as Chairman & Managing Director of SJVN Limited since May 1, 2025. Following this appointment, Shri Sanjay Kumar Singh ceases to hold the additional charge of Chairman & Managing Director position at NHPC.",
            "Sentiment": "positive",
            "PublishDate": 1756994201568,
            "Source": "corporate_governance"
        },
        {
            "Title": "NHPC Shares Rise 2% Following Board Approval of Rs 10,000 Crore Borrowing Plan",
            "Summary": "NHPC Ltd shares increased 2% to Rs 78.80 after the hydropower company's board approved a revised borrowing plan of up to Rs 10,000 crore for FY26. The funds will be raised through bonds, term loans, or external commercial borrowings in multiple tranches to finance ongoing and future projects. The company reported a 4.2% year-on-year rise in consolidated profit to Rs 1,065.02 crore for the quarter ended June, with revenue growing 19.3% to Rs 3,213.77 crore. However, NHPC shares have declined 6% in 2025 and 19% over the past 12 months. Technical indicators show the stock trading below all key moving averages with an RSI of 29.5, suggesting oversold conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1756700277384,
            "Source": "stock"
        },
        {
            "Title": "NHPC Board Approves ₹10,000 Crore Borrowing Plan and Cash Flow Monetization for FY 2025-26",
            "Summary": "NHPC's board has approved an updated borrowing plan of up to ₹10,000 crore along with cash flow monetization strategies for the fiscal year 2025-26. The decision represents the company's financial planning initiative for the upcoming fiscal period.",
            "Sentiment": "positive",
            "PublishDate": 1756482453332,
            "Source": "corporate_action"
        },
        {
            "Title": "NHPC Plans to Complete Karnisar Solar Power Project Operations by September 30",
            "Summary": "NHPC announced plans to start remaining operations of its Karnisar Solar Power Project by September 30. The company has already made 214.28 MW operational out of the project's total capacity of 300 MW.",
            "Sentiment": "positive",
            "PublishDate": 1756121783089,
            "Source": "stock"
        },
        {
            "Title": "NHPC to Review Updated Borrowing Strategy for 2025-26",
            "Summary": "NHPC will review its updated borrowing strategy for the fiscal year 2025-26. The review indicates the company is reassessing its debt financing approach for the upcoming period.",
            "Sentiment": "neutral",
            "PublishDate": 1755778239010,
            "Source": "stock"
        },
        {
            "Title": "NHPC Limited Reports Strong Q1 FY26 Results with 44% Revenue Growth and New Project Commissioning",
            "Summary": "NHPC Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. Standalone revenue from operations increased to ₹2,977.43 crore from ₹2,416.12 crore in the same quarter last year. Net profit rose to ₹1,071.87 crore compared to ₹1,018.43 crore in the previous year quarter. The company commissioned the 800 MW Parbati-II Project during the quarter and recognized ₹431.17 crore as unbilled sales pending tariff approval. Additionally, 214.28 MW of the 300 MW Kamisar Solar Power Project in Bikaner was commissioned. The company recognized ₹201.23 crore as Minimum Alternate Tax Credit during the quarter. Consolidated revenue reached ₹3,213.77 crore versus ₹2,694.20 crore in the corresponding previous quarter, with consolidated net profit at ₹1,131.16 crore. The company reported no defaults on outstanding loans and debt securities totaling ₹40,029.30 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755015715102,
            "Source": "earnings"
        },
        {
            "Title": "NHPC Reports Higher Q1 Profit and Revenue, Raises 20 Billion Rupees Through Bond Placement",
            "Summary": "NHPC reported consolidated net profit of 10.65 billion rupees in Q1, up from 10.29 billion rupees in the same period last year. Revenue increased to 32.14 billion rupees from 26.94 billion rupees year-over-year. EBITDA rose to 18 billion rupees compared to 16.1 billion rupees previously, though EBITDA margin declined to 56.07% from 59.73%. The company also secured 20 billion rupees through a private bond placement.",
            "Sentiment": "positive",
            "PublishDate": 1755013797882,
            "Source": "earnings"
        },
        {
            "Title": "NHPC Limited Raises Rs. 2000 Crore Through 6.40% Bond Issuance",
            "Summary": "NHPC Limited raised Rs. 2000 crore through the issuance of 6.40% NHPC AG Series Bonds 2027. The bonds are unsecured, redeemable, non-convertible, non-cumulative, and taxable, issued on a private placement basis. The bonds have a 2-year tenor with allotment date of 12.08.2025 and maturity date of 12.08.2027. The bonds offer a coupon rate of 6.40% per annum and are proposed to be listed on the Wholesale Debt Market segment of both BSE and NSE. The bonds are redeemable at par at the end of the 2nd year from the deemed date of allotment.",
            "Sentiment": "positive",
            "PublishDate": 1755013409287,
            "Source": "corporate_action"
        },
        {
            "Title": "NHPC Receives Approval for Bond Issuance Worth Up to 20 Billion Rupees",
            "Summary": "NHPC has obtained approval to issue bonds worth up to 20 billion rupees through one or more private placements. This approval enables the company to raise funds through private bond offerings.",
            "Sentiment": "positive",
            "PublishDate": 1753883811170,
            "Source": "stock"
        },
        {
            "Title": "NHPC Board Approves Rs. 2,000 Crore Bond Issue Plan for FY 2025-26",
            "Summary": "NHPC Limited's Board of Directors approved the Key Information Document for raising funds up to Rs. 2,000 crore through Unsecured, Redeemable, Taxable, Non-Convertible, Non-Cumulative AG-Series Bonds via private placement. The bond issue will be conducted in one or more tranches as part of the company's borrowing plan for FY 2025-26. The board meeting was held on July 30, 2025, commencing at 5:30 PM and concluding at 6:20 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1753882858127,
            "Source": "corporate_action"
        },
        {
            "Title": "NHPC Publishes Notice for Transfer of Unclaimed Shares to IEPF Authority",
            "Summary": "NHPC Limited has published newspaper advertisements in Financial Express and Jansatta regarding the transfer of unclaimed equity shares to the Investor Education and Protection Fund (IEPF) Authority. The notices were published on July 29, 2025, in compliance with regulatory requirements. The company has informed stock exchanges BSE and NSE about this mandatory transfer process for shares where dividends have remained unclaimed for seven consecutive years or more. Shareholders are advised to claim their unpaid dividends before the specified deadline to avoid transfer of their shares to IEPF. The company has provided detailed guidelines and contact information for shareholders to follow the claiming process.",
            "Sentiment": "neutral",
            "PublishDate": 1753787941729,
            "Source": "corporate_action"
        },
        {
            "Title": "NHPC Schedules Board Meeting to Consider ₹2,000 Crore Bond Fundraising Plan",
            "Summary": "NHPC Limited has scheduled a Board of Directors meeting for July 30, 2025, to consider and approve a proposal for raising funds up to ₹2,000 crore through unsecured, redeemable, taxable, non-convertible, non-cumulative bonds via private placement. The fundraising is part of the company's borrowing plan for FY 2025-26 and may be executed in one or more tranches. The board will review the Key Information Document for this bond issuance during the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753427515752,
            "Source": "corporate_action"
        },
        {
            "Title": "NHPC Plans to Raise Up to 20 Billion Rupees Through Bond Issuance",
            "Summary": "NHPC has announced plans to raise up to 20 billion rupees through bonds. The company is looking to utilize the bond market as a funding mechanism for its capital requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753426380595,
            "Source": "stock"
        },
        {
            "Title": "NHPC Ltd: Targets Rs 4,500 Crore Profit in FY26 with Project Expansions",
            "Summary": "NHPC aims for Rs 4,500 crore profit in FY26, driven by Parbati-II commissioning and increased Parbati-III generation. Revenue expected to rise by Rs 3,000 crore in current fiscal. Plans to triple installed capacity to 23,000 MW by 2032, with hydropower capacity exceeding 15,000 MW by 2030. Key projects include Rangit-IV, Dibang, and Sawalkot.",
            "Sentiment": "positive",
            "PublishDate": 1751330419000,
            "Source": "normal_news"
        },
        {
            "Title": "NHPC Commences Fourth Phase of Karnisar Solar Power Project",
            "Summary": "NHPC has announced the commercial operation date for the fourth phase of its 300 MW Karnisar Solar Power Project in Bikaner, Rajasthan. The operation is set to begin on June 30.",
            "Sentiment": "positive",
            "PublishDate": 1751299879000,
            "Source": "default"
        },
        {
            "Title": "NHPC Awaits Approval for Commercial Operations of Subansiri Lower HE Project Units",
            "Summary": "NHPC is waiting for approval from the National Dam Safety Authority to commence commercial operations of three units, each with a capacity of 250 MW, of the Subansiri Lower Hydroelectric Project. The total capacity of the project is 2000 MW.",
            "Sentiment": "neutral",
            "PublishDate": 1751274934000,
            "Source": "default"
        },
        {
            "Title": "NHPC Activates Third Phase of Karnisar Solar Project",
            "Summary": "NHPC has activated the third phase of its 300 MW Karnisar Solar Project in Bikaner, adding 53.57 MW of capacity. The project's cumulative operational capacity has now reached 160.71 MW.",
            "Sentiment": "positive",
            "PublishDate": 1749436264000,
            "Source": "default"
        }
    ]
}