{
    "Symbol": "NIACL",
    "ISIN": "INE470Y01017",
    "News": [
        {
            "Title": "New India Assurance Q3FY26 Results Call on Feb 2",
            "Summary": "The New India Assurance Company Ltd schedules earnings conference call for February 02, 2026 at 04:15 PM IST to discuss Q3FY26 financial performance ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769599037457,
            "Source": "co_actions_results"
        },
        {
            "Title": "New India Assurance Reports 17% Premium Growth",
            "Summary": "The New India Assurance Company has achieved a 17% year-on-year increase in premium collections, demonstrating strong business performance in the insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1767777315048,
            "Source": "co_actions_results"
        },
        {
            "Title": "New India Assurance Gets Positive Outlook from A.M. Best",
            "Summary": "A.M. Best revised The New India Assurance Company's outlook to positive from stable while affirming its B++ Financial Strength Rating and bbb+ Long-Term Issuer Credit Rating, citing improved risk management.",
            "Sentiment": "positive",
            "PublishDate": 1765523245414,
            "Source": "stocks"
        },
        {
            "Title": "New India Assurance Company Publishes Quarterly Financial Results Extract",
            "Summary": "The New India Assurance Company Limited submitted newspaper clippings of its un-audited financial results extract for the quarter ended September 30, 2025 to BSE and NSE exchanges. The company informed stock exchanges that these financial results extracts are also available on their official website at www.newindia.co.in.",
            "Sentiment": "neutral",
            "PublishDate": 1763117749191,
            "Source": "earnings"
        },
        {
            "Title": "New India Assurance Reports September Premiums of ₹32.52 Billion with 3.5% Growth",
            "Summary": "New India Assurance reported September premiums of ₹32.52 billion, marking a 3.5% increase compared to the same period in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1759829693428,
            "Source": "stock"
        },
        {
            "Title": "New India Assurance Faces ₹23.79 Billion GST Tax Demand on Co-Insurance Premiums",
            "Summary": "New India Assurance Co has received a tax demand of ₹23.79 billion from authorities for not paying GST on co-insurance premiums. The demand relates to the company's handling of goods and services tax obligations on its co-insurance business operations.",
            "Sentiment": "negative",
            "PublishDate": 1759233942589,
            "Source": "stock"
        },
        {
            "Title": "New India Assurance Receives Rs. 249.79 Crore Income Tax Refund",
            "Summary": "The New India Assurance Company Limited received an income tax refund of Rs. 249.79 crores for Assessment Year 2009-10 from the Income Tax Department. The refund amount includes interest of Rs. 8.89 crores. The company disclosed this information to stock exchanges BSE and NSE under regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1758725663073,
            "Source": "stock"
        },
        {
            "Title": "New India Assurance Reports Significant Premium Decline in August",
            "Summary": "New India Assurance experienced a substantial drop in general insurance premiums during August, with reports indicating a decline of approximately 47-50% compared to the previous month. The insurance company saw its monthly premium collections fall significantly during this period.",
            "Sentiment": "negative",
            "PublishDate": 1757323634314,
            "Source": "stock"
        },
        {
            "Title": "Lower Auto GST Rates Could Cut General Insurance Premiums by Up to 7%",
            "Summary": "A potential reduction in auto GST rates could lead to general insurance premiums decreasing by up to 7%. This development would impact general insurers including New India Assurance Company and could affect pricing structures across the insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1757061851977,
            "Source": "sectoral"
        },
        {
            "Title": "New India Assurance Reports 80% Jump in Q1 FY26 Profit Despite Rising Claims",
            "Summary": "New India Assurance Company Limited reported net profit after tax of Rs 391 crores for Q1 FY26, marking an 80% increase from Rs 217 crores in the same quarter last year. The company's gross written premium grew 13.11% to Rs 13,333.58 crores, with market share increasing to 15.51% from 14.65%. However, the net incurred claims ratio rose to 99.76% from 95.98%, primarily due to aviation claims including Air India losses and increased health and liability claims. The combined ratio remained stable at 116.16% compared to 116.13% in the previous year. Health insurance claims were impacted by 14-15% medical inflation and increased infectious diseases. The company maintained its AAA rating from CRISIL and received B++ rating from AM Best. Management targets a 3% improvement in combined ratio to around 113% for the full year. Net worth increased to Rs 22,279 crores from Rs 21,343 crores, while return on equity improved to 7.17% from 4.15%.",
            "Sentiment": "positive",
            "PublishDate": 1754388615561,
            "Source": "earnings"
        },
        {
            "Title": "New India Assurance Reports 80% Jump in Q1 Profit, Premium Growth at 13.11%",
            "Summary": "The New India Assurance Company Limited reported quarterly results for the period ended June 30, 2025, with profit after tax increasing 80% to ₹391 crores compared to the previous year. Gross written premium reached ₹13,334 crores, reflecting 13.11% year-on-year growth. The company's domestic gross direct premium grew 15.27% versus industry growth of 8.84%, leading to market share expansion from 14.65% to 15.51%. Combined ratio remained stable at 116.16%. The company maintained a solvency ratio of 1.87x with assets under management of ₹1,00,802 crores and net worth of ₹45,414 crores. The Board also appointed M/s Ragini Chokshi & Co. as auditors for financial years 2025-26 to 2029-30. An Air India flight incident adversely impacted underwriting results, while Health segment showed higher loss ratios and large losses affected Liability and Miscellaneous portfolios.",
            "Sentiment": "positive",
            "PublishDate": 1753803178605,
            "Source": "earnings"
        },
        {
            "Title": "New India Assurance Appoints Ms. Shwetha Rao B as Government Nominee Director",
            "Summary": "The New India Assurance Co. Ltd has appointed Ms. Shwetha Rao B as a Government Nominee Director on its Board with immediate effect. The appointment was made by the Ministry of Finance through a notification dated July 24, 2025. Ms. Shwetha Rao B serves as Director in the Department of Financial Services. The appointment was made under Article 121(1) of the company's Articles of Association and will remain in effect until further orders from the Central Government.",
            "Sentiment": "neutral",
            "PublishDate": 1753449709186,
            "Source": "corporate_governance"
        },
        {
            "Title": "New India Assurance Reports Premium Growth in Q1 and June",
            "Summary": "New India Assurance has reported a 15% increase in premium for Q1, surpassing the industry growth of 9%. Additionally, the company saw an 11% increase in premiums for June, compared to the industry's 5% growth rate.",
            "Sentiment": "positive",
            "PublishDate": 1751880470000,
            "Source": "default"
        },
        {
            "Title": "New India Assurance Company: ₹2,298 Crore GST Show Cause Notice Received",
            "Summary": "New India Assurance Company Ltd received a GST show cause notice for ₹2,298.06 crore covering April 2018 to March 2023. The notice, issued by Mumbai-South Additional Commissioner, cites unpaid taxes and failure to furnish information. The company believes it has a strong case and plans to file a detailed reply.",
            "Sentiment": "negative",
            "PublishDate": 1750958686000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Government Considers Accelerating Stake Sale in New India Assurance",
            "Summary": "The government is reportedly considering speeding up the sale of its stake in New India Assurance. No specific details about the size of the stake or the timeline for the sale were provided in the brief news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750908638000,
            "Source": "default"
        },
        {
            "Title": "Road Ministry Considering Increase in Motor Third Party Premiums",
            "Summary": "The Road Ministry is currently reviewing a potential increase in motor third party insurance premiums. This consideration follows a likely request from the Insurance Regulatory and Development Authority of India (IRDAI) for a hike in these premiums.",
            "Sentiment": "neutral",
            "PublishDate": 1750227575000,
            "Source": "default"
        },
        {
            "Title": "New India Assurance: Targets Double-Digit Premium Growth for FY26",
            "Summary": "New India Assurance aims for double-digit premium growth in FY26, focusing on improving underwriting quality and reducing combined ratio. The company's combined ratio improved to 117% in FY25 from 120% in FY24. Chairman and MD Girija Subramanian addresses merger speculation, stating no formal proposal exists. The company posted a 3.86% increase in gross written premium for FY25, maintaining a 12.6% market share in general insurance.",
            "Sentiment": "positive",
            "PublishDate": 1747715571000,
            "Source": "earnings"
        },
        {
            "Title": "The New India Assurance Reports Q4 Results and Recommends Dividend",
            "Summary": "The New India Assurance Co. has announced its Q4 results and dividend recommendation. The company's Q4 revenue increased to 93.1 billion rupees from 89.57 billion rupees year-over-year. However, the Q4 standalone net profit slightly decreased to 3.47 billion rupees from 3.54 billion rupees year-over-year, and 3.53 billion rupees quarter-over-quarter. The company has recommended a final dividend of 1.80 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747671062000,
            "Source": "result"
        },
        {
            "Title": "New India Assurance Invests in Bima Sugam India Federation",
            "Summary": "New India Assurance Company has invested in Bima Sugam India Federation by acquiring 49,90,000 equity shares for Rs. 4.99 crore. This investment represents a significant corporate action by the insurance company, potentially aimed at expanding its presence or influence in the insurance sector.",
            "Sentiment": "neutral",
            "PublishDate": 1741265911000,
            "Source": "corporate_action"
        },
        {
            "Title": "IRDAI Finds General & Health Insurers Missing Expense of Management Limits",
            "Summary": "The Insurance Regulatory and Development Authority of India (IRDAI) has observed that general and health insurance companies have not met the required Expense of Management (EoM) limits. This information was reported by CNBC TV18, suggesting potential regulatory concerns or compliance issues in the insurance sector.",
            "Sentiment": "negative",
            "PublishDate": 1741067232000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRDAI Directs Insurers to Pass on Benefits of Lower Commissions to Policyholders",
            "Summary": "The Insurance Regulatory and Development Authority of India (IRDAI) has instructed insurance companies to transfer the advantages of reduced commissions to policyholders. This directive aims to ensure that the cost savings from lower commission rates are reflected in more affordable insurance premiums for customers. The move is expected to potentially lead to lower insurance costs for policyholders across various insurance products.",
            "Sentiment": "positive",
            "PublishDate": 1741067209000,
            "Source": "corporate_governance"
        },
        {
            "Title": "The New India Assurance Co Reports Q3 Revenue Increase",
            "Summary": "The New India Assurance Co has reported a revenue of 90.33 billion rupees for the third quarter, compared to 89.46 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737996204000,
            "Source": "earnings"
        },
        {
            "Title": "New India Assurance Reports Q3 Net Profit Decline",
            "Summary": "The New India Assurance Co. has reported a net profit of 3.53 billion rupees for the third quarter, showing a significant year-over-year decrease from 7.15 billion rupees. However, the profit has increased from 710 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737996196000,
            "Source": "earnings"
        },
        {
            "Title": "The New India Assurance Co. to Consider Q3 Results",
            "Summary": "The New India Assurance Co. has announced that it will consider its third quarter (Q3) financial results on January 27. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737122680000,
            "Source": "result"
        },
        {
            "Title": "New India Assurance Reports 6% Premium Growth in November 2024",
            "Summary": "The New India Assurance Company has reported a 6% increase in premium for November 2024 compared to the same month in the previous year. This growth is particularly notable as it contrasts with a 1% decline observed in November 2023.",
            "Sentiment": "positive",
            "PublishDate": 1733823170000,
            "Source": "earnings"
        },
        {
            "Title": "New India Assurance Receives Substantial Tax Refund",
            "Summary": "New India Assurance Company has received a significant tax refund totaling 19.45 billion rupees. This refund represents a substantial financial inflow for the company, which could potentially impact its financial position and liquidity.",
            "Sentiment": "positive",
            "PublishDate": 1732581634000,
            "Source": "corporate_action"
        },
        {
            "Title": "New India Assurance Receives 19.45 Billion Rupees Tax Refund",
            "Summary": "The New India Assurance Company has received a total tax refund of 19.45 billion rupees (approximately $234 million USD). This significant refund could potentially impact the company's financial position positively.",
            "Sentiment": "positive",
            "PublishDate": 1732543256000,
            "Source": "corporate_action"
        },
        {
            "Title": "New India Assurance Acquires Shares in Bima Sugam India Federation",
            "Summary": "New India Assurance has acquired 10,000 shares in Bima Sugam India Federation. This acquisition suggests a strategic investment or partnership move by the insurance company.",
            "Sentiment": "neutral",
            "PublishDate": 1730978546000,
            "Source": "corporate_action"
        },
        {
            "Title": "New India Assurance Reports Q2 Revenue Growth",
            "Summary": "The New India Assurance Co. has reported a revenue of 85.25 billion rupees for the second quarter, compared to 82 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730299903000,
            "Source": "result"
        },
        {
            "Title": "New India Assurance Reports Q2 Profit Turnaround",
            "Summary": "The New India Assurance Co. has reported a net profit of 710 million rupees in Q2, compared to a loss of 2 billion rupees in the same quarter last year. This represents a significant turnaround for the company. Additionally, the profit has decreased from 2.17 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730299893000,
            "Source": "result"
        }
    ]
}