{
    "Symbol": "NIBE",
    "ISIN": "INE149O01018",
    "News": [
        {
            "Title": "Nibe Limited Completes 48.95% Acquisition in Naval Unit",
            "Summary": "Nibe Limited has completed the acquisition of 48,950 equity shares (48.95%) in Nibe Meson Naval Limited for Rs. 4.89 lakh, increasing its total shareholding to 99.95% for enhanced management control.",
            "Sentiment": "positive",
            "PublishDate": 1770661145856,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIBE Limited EGM Approves Preferential Share Issue",
            "Summary": "NIBE Limited shareholders unanimously approved resolutions for issuing convertible warrants and equity shares on preferential basis during EGM held January 22, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769239454713,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIBE Defence Gets Arms Manufacturing License from MHA",
            "Summary": "NIBE Ltd shares gained 2% after subsidiary NDAL received manufacturing license for firearms and ammunition from Ministry of Home Affairs, enabling entry into pistols, rifles production.",
            "Sentiment": "positive",
            "PublishDate": 1768203061463,
            "Source": "stocks"
        },
        {
            "Title": "Nibe's Subsidiary NDAL Gets Firearms Manufacturing License",
            "Summary": "Nibe Defence and Aerospace Limited, subsidiary of Nibe Limited, receives firearms manufacturing license from Ministry of Home Affairs under Arms Act provisions, marking strategic entry into defense manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1768023882847,
            "Source": "stocks"
        },
        {
            "Title": "Nibe Limited Secures ₹292.7 Crore Indian Army Order",
            "Summary": "Defence firm Nibe Limited secures major order from Indian Army for universal rocket launcher system manufacturing and supply, including ground equipment and ammunition with 12-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767358968706,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIBE Wins ₹292.69 Cr Indian Army Defense Contract",
            "Summary": "NIBE Limited secured a ₹292.69 crore contract from Indian Army for manufacturing Universal Rocket Launcher System equipment with 150-300km range capability, to be delivered within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1767353814761,
            "Source": "global"
        },
        {
            "Title": "NIBE Corrects Fund Raising Details to ₹251.85 Crores",
            "Summary": "NIBE Limited issued corrigendum correcting issue price to ₹1,258 per security from earlier ₹1,248, increasing total fund raising amount to ₹251.85 crores through preferential allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1765975037810,
            "Source": "global"
        },
        {
            "Title": "Nibe Receives Possession of 314,357 Square Meter Industrial Plot in Shirdi",
            "Summary": "Nibe has received possession of a 314,357 square meter plot located at Shirdi Industrial Area. This land acquisition provides the company with significant industrial space for potential manufacturing or operational expansion.",
            "Sentiment": "positive",
            "PublishDate": 1764893197626,
            "Source": "stock"
        },
        {
            "Title": "Nibe Limited Corrects Industry Classification in Acquisition Disclosure",
            "Summary": "Nibe Limited filed a clarification correcting the industry classification of target company Nibe Meson Naval Limited from 'Defence' to 'Fluid control equipment manufacturing' in its earlier acquisition disclosure for a 48.95% equity stake. The correction updates the regulatory filing submitted under SEBI regulations regarding the acquisition announced on November 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763060706564,
            "Source": "corporate_action"
        },
        {
            "Title": "Nibe Limited Reports Mixed Q2 Results, Announces CFO Change and Acquisition",
            "Summary": "Nibe Limited's board approved unaudited financial results for the second quarter and half year ended September 30, 2025. The company reported a consolidated net loss of Rs. 968.76 lakhs for Q2 2025 compared to a profit of Rs. 104.26 lakhs in Q2 2024. However, for the half year, the company posted a consolidated net profit of Rs. 1,677.36 lakhs. The company operates primarily in defence and aeronautics segments, with defence revenue at Rs. 14,758.06 lakhs and aeronautics at Rs. 828.65 lakhs for Q2 2025. In leadership changes, Mr. Rajesh Khatri resigned as CFO due to personal reasons, effective November 12, 2025, and Mr. Jigar Shah was appointed as the new CFO on the same date. The board also approved acquiring an additional 48.95% stake in Nibe Meson Naval Limited from Quest Flow Controls Limited at Rs. 10 per share, which will give the company full management control. The acquisition is expected to complete by November 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762999461265,
            "Source": "corporate_action"
        },
        {
            "Title": "Nibe Limited Secures Rs. 28.08 Crore Defense Contract for Breech Casing Assembly",
            "Summary": "Nibe Limited received a purchase order worth Rs. 28.08 crore from a leading infrastructure and defense company for manufacturing and supplying Breech Casing assembly. The order will be executed and delivered in tranches by June 2028. The contract amount is inclusive of all taxes and duties. The order comes from a domestic entity and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1760610681803,
            "Source": "stock"
        },
        {
            "Title": "NIBE Secures ₹29.07 Crore Defense Contract for Gun Stand Production",
            "Summary": "NIBE has secured a ₹29.07 crore order from a major infrastructure and defense company for gun stand production. The delivery is scheduled to be completed by June 2027.",
            "Sentiment": "positive",
            "PublishDate": 1760002140763,
            "Source": "order&deals"
        },
        {
            "Title": "Nibe Limited Reports Q1 FY26 Results with Leadership Changes and Fund Utilization Update",
            "Summary": "Nibe Limited announced its unaudited financial results for the quarter ended June 30, 2025, alongside significant leadership changes. The company reported consolidated revenue from operations of Rs 8,249.92 lakhs and net profit after tax of Rs 104.26 lakhs for the quarter. On standalone basis, revenue from operations was Rs 8,119.01 lakhs with net profit after tax of Rs 389.03 lakhs. The board accepted the resignation of CEO Mr. Ranjan Choudhary effective August 12, 2025, due to internal reorganization within the group, and simultaneously appointed Mr. Prakash Khose as the new CEO. Mr. Khose is a Mechanical Engineer with 34 years of experience across automotive, aerospace, defence, and other sectors, having been involved in 14 acquisitions and 7 greenfield projects globally. The company also appointed new cost auditors M/s Dhananjay Laxman Gawade & Co. for FY 2025-26 and secretarial auditors M/s D Maurya & Associates for a five-year term from FY 2025-26 to FY 2029-30. Additionally, Nibe reported no deviation in the utilization of Rs 782.99 lakhs raised through convertible warrants in April 2025, with funds being used for capital expenditure and working capital needs as planned. The board deferred a proposal to raise additional funds through preferential issue due to current market volatility.",
            "Sentiment": "neutral",
            "PublishDate": 1755015591957,
            "Source": "corporate_action"
        },
        {
            "Title": "Nibe Limited Secures Rs. 26.67 Crore Defense Manufacturing Contract",
            "Summary": "Nibe Limited has received purchase orders worth Rs. 26.67 crores from a leading Indian infrastructure and defense company. The contract involves manufacturing and supplying multiple defense structures including Turret Crew Access Door and Turret Ammunition Rack Access Door. The order will be executed and delivered in tranches by June 2026. The contract amount is inclusive of all taxes and duties, and the company confirmed that promoters have no interest in the entity awarding the order.",
            "Sentiment": "positive",
            "PublishDate": 1754986535093,
            "Source": "stock"
        },
        {
            "Title": "Aegis Investment Fund PCC Increases Stake in Nibe Limited Through Preferential Allotment",
            "Summary": "Aegis Investment Fund PCC acquired 70,758 shares of Nibe Limited through preferential allotment. The acquisition increased the fund's shareholding from 664,192 shares (4.58%) to 734,950 shares, representing 5.06% of the company's voting rights. The transaction was completed on August 8th, 2025. Nibe Limited is listed on NSE Limited, and Aegis Investment Fund PCC is not part of the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1754913902882,
            "Source": "stock"
        },
        {
            "Title": "Nibe Limited Secures $1.2 Million Defense Contract from Elbit Systems",
            "Summary": "Nibe Limited received a purchase order worth USD 1.2 million (approximately INR 10.52 crores) from Elbit Systems Land Ltd, an Israel-based defense technology company. The contract involves manufacturing and supplying ship-mounted universal rocket launcher mechanical and hydraulic kits. The order is to be executed by September 2026. This represents an international contract with no related party transactions or promoter group interests involved.",
            "Sentiment": "positive",
            "PublishDate": 1754652127351,
            "Source": "order&deals"
        },
        {
            "Title": "Nibe Limited Secures Rs. 29.22 Crore Purchase Orders from Leading Infra and Defence Company",
            "Summary": "Nibe Limited has received purchase orders worth Rs. 29.22 crores from a leading infrastructure and defence company. The orders involve supplying constructional details trackway components (including cutting, bending, pre-machining and fabrication) and breech casing components (including fabrication, machining and heat treatment). The orders are from a domestic entity and will be executed and delivered in tranches by December 2026. The contract value is inclusive of all taxes and duties. The company confirmed that promoters or group companies have no interest in the entity that awarded the orders, and the transactions do not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1754573079542,
            "Source": "stock"
        },
        {
            "Title": "Nibe Limited Schedules Board Meeting to Approve Q2 2025 Results and Consider Fund Raising Proposal",
            "Summary": "Nibe Limited has scheduled a Board of Directors meeting for August 12, 2025, to approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also consider a proposal to raise funds through equity shares and/or convertible securities via preferential allotment on private placement basis, subject to regulatory approvals and shareholder consent. The trading window for company securities has been closed since July 1, 2025, and will remain closed until 48 hours after the financial results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1754481732832,
            "Source": "corporate_action"
        },
        {
            "Title": "NIBE Limited Secures Major Defense Order from Elbit Systems for 70mm Guided Tactical Rockets",
            "Summary": "NIBE Limited has secured a significant order from Elbit Systems to manufacture and supply parts for 70mm class air-to-surface rockets, known as Guided Advanced Tactical Rockets (GATR). The advanced rockets feature precision strike capabilities up to 10 km range, can intercept moving targets up to 100 kmph, and use semi-active laser guidance systems. The rockets are compatible with attack helicopters including AH-64 Apache and HAL Rudra, delivering 16 kg warheads with penetration capability of up to 200mm in reinforced concrete. This marks the first time India will produce sophisticated rockets of this caliber. NIBE Limited will handle acquisition, localized production, and platform integration for the Indian Armed Forces and global allies. The partnership aligns with India's 'Make in India' and 'Atmanirbhar Bharat' initiatives, supporting indigenous defense capabilities and technological self-reliance.",
            "Sentiment": "positive",
            "PublishDate": 1754283841170,
            "Source": "order&deals"
        },
        {
            "Title": "Nibe Limited Secures $700,000 Defense Contract from Elbit Systems for Guided Rocket Parts",
            "Summary": "Nibe Limited has received a purchase order worth USD 700,000 (approximately INR 6.12 crores) from Elbit Systems Land Ltd, an Israel-based defense technology company. The contract involves manufacturing and supplying GATR 70mm Guided Rocket parts with a 10km range. The order is scheduled to be executed by September 2026. This represents an international contract for Nibe Limited in the defense manufacturing sector. The company has confirmed that its promoters have no interest in the awarding entity and the transaction does not fall under related party arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1754122243299,
            "Source": "order&deals"
        },
        {
            "Title": "NIBE Secures ₹61.2 Million Export Order for GATR 70MM Guided Rocket Parts",
            "Summary": "NIBE has secured an export order worth ₹61.2 million for producing and supplying parts for GATR 70MM guided rockets with a 10-kilometer range. The contract involves manufacturing components for defense equipment.",
            "Sentiment": "positive",
            "PublishDate": 1754121591136,
            "Source": "stock"
        },
        {
            "Title": "Nibe Limited Signs Technology Agreement with Elbit Systems for Artillery Rocket System Manufacturing",
            "Summary": "Nibe Limited has entered into a Technical Collaboration Agreement with Elbit Systems Land Limited, an Israel-based defense technology company, on July 26, 2025. The agreement involves the transfer of license and technology to design, develop, and manufacture the Precise & Universal Launch System (PULS), including artillery rocket systems in India. The system is capable of engaging targets with precision over a range of up to 300 km. Under the collaboration, Elbit will provide know-how and grant licenses to Nibe for manufacturing and assembly operations. The consideration details will be finalized within 45 days from the signing of the agreement. Both companies will leverage their respective expertise in the development and manufacturing of the defense system.",
            "Sentiment": "positive",
            "PublishDate": 1753519934311,
            "Source": "order&deals"
        },
        {
            "Title": "NIBE Ltd Secures Licensing Agreement with DRDO for Mountain Foot Bridge Technology",
            "Summary": "NIBE Ltd has entered into a licensing agreement with the Research & Development Establishment of the Defence Research and Development Organisation (DRDO), under the Ministry of Defence, Government of India. The agreement allows NIBE Ltd to manufacture and sell a 35M Mountain Foot Bridge, including its launching systems. This technology transfer enables the company to expand its product portfolio in defense-related infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1738896674000,
            "Source": "corporate_action"
        },
        {
            "Title": "NIBE Ltd Subsidiary Secures Contract with BlackSky Global for Satellite Operations",
            "Summary": "A subsidiary of NIBE Ltd has been awarded a contract by BlackSky Global, LLC for the operation and maintenance of the Global-6 optical satellite. The contract duration is set for 2 years.",
            "Sentiment": "positive",
            "PublishDate": 1738893406000,
            "Source": "order&deals"
        },
        {
            "Title": "NIBE LTD Unit Secures $19M Contract with Thales Alenia Space Italia",
            "Summary": "A subsidiary of NIBE LTD has entered into a contract with Thales Alenia Space Italia S.P.A to supply one GEN optical satellite, including LEOP (Launch and Early Orbit Phase) and in-orbit activities. The contract is valued at USD 19 million and is subject to approvals from various government and other authorities. The delivery is expected within 9 weeks.",
            "Sentiment": "positive",
            "PublishDate": 1738893146000,
            "Source": "order&deals"
        },
        {
            "Title": "NIBE LTD to Begin Trading on NSE",
            "Summary": "NIBE LTD will be listed and available for trading on the National Stock Exchange (NSE) starting Friday, February 07, 2025. This marks the company's entry into one of India's major stock exchanges, potentially increasing its visibility and liquidity for investors.",
            "Sentiment": "positive",
            "PublishDate": 1737712125000,
            "Source": "corporate_action"
        },
        {
            "Title": "NIBE Ltd Signs LOI for Defense and Aerospace Joint Venture",
            "Summary": "NIBE Ltd has signed a Letter of Intent (LOI) with HBE to establish a joint venture in India. The JV will focus on setting up forging facilities to manufacture defense and aerospace products. NIBE Ltd will hold a 51% stake in the proposed venture, while HBE will hold the remaining 49%.",
            "Sentiment": "positive",
            "PublishDate": 1730880020000,
            "Source": "corporate_action"
        },
        {
            "Title": "NIBE Ordnance and Maritime Raises 1.1 Billion Rupees Through CCDs",
            "Summary": "<p><span class='positive'>NIBE LTD's</span> subsidiary, <b>NIBE Ordnance and Maritime</b>, has <span class='positive'>successfully raised</span> <b>1.1 billion rupees</b> (approximately $13.3 million USD) through the issuance of <b>Compulsory Convertible Debentures (CCDs)</b>. This <span class='positive'>financial move</span> indicates a <span class='positive'>significant capital infusion</span> for the company's operations in the ordnance and maritime sectors.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728462100000,
            "Source": "corporate_action"
        }
    ]
}