{
    "Symbol": "NIBL",
    "ISIN": "INE047O01014",
    "News": [
        {
            "Title": "NRB Industrial Bearings Reports Q3FY26 Loss",
            "Summary": "NRB Industrial Bearings posted a net loss of ₹1,097.76 lakhs in Q3FY26 compared to ₹564.87 lakhs loss in Q3FY25. Revenue grew 10.53% YoY to ₹1,862.88 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770303859789,
            "Source": "co_actions_results"
        },
        {
            "Title": "NRB Industrial Bearings Promoter Aarti Devesh Sahney Acquires Additional 76,970 Shares",
            "Summary": "Promoter Aarti Devesh Sahney acquired 76,970 equity shares of NRB Industrial Bearings Limited through open market trade, increasing her shareholding from 2.82% to 3.14%. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1764062208879,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Industrial Bearings Promoter Aarti Devesh Sahney Acquires Additional 36,154 Equity Shares",
            "Summary": "Promoter Aarti Devesh Sahney acquired 36,154 equity shares of NRB Industrial Bearings Limited through open market trade, increasing her shareholding from 2.67% to 2.82%. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1763451100172,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Industrial Bearings Promoter Aarti Devesh Sahney Acquires Additional 70,000 Shares",
            "Summary": "Aarti Devesh Sahney, a promoter of NRB Industrial Bearings Limited, acquired 70,000 equity shares through open market trading. The acquisition increased her shareholding from 5,24,370 shares (2.16%) to 5,94,370 shares (2.45%) of the company's total equity capital. The transaction was completed and the company has disclosed this acquisition in compliance with SEBI regulations for substantial acquisition of shares and takeovers. NRB Industrial Bearings has an equity capital of Rs. 4,84,61,300 comprising 2,42,30,650 equity shares of Rs. 2 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763015567366,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Industrial Bearings Reports Loss of Rs 703.78 Lakhs in Q2 FY26",
            "Summary": "NRB Industrial Bearings Limited reported a net loss of Rs 703.78 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 529.81 lakhs in the same period last year. For the six-month period, the company's loss widened to Rs 2,252.29 lakhs from Rs 1,554.80 lakhs in the previous year. Revenue from operations decreased to Rs 1,274.26 lakhs in Q2 from Rs 1,453.07 lakhs year-on-year. The company has a negative net worth of Rs 3,573.41 lakhs and net current liability position of Rs 3,418.96 lakhs as of September 30, 2025. Management has formulated strategic plans to improve profitability through increased sales and reduced operating expenses. The promoter director has provided a support letter committing necessary financial support to meet operational and financial obligations.",
            "Sentiment": "negative",
            "PublishDate": 1762465848758,
            "Source": "earnings"
        },
        {
            "Title": "NRB Industrial Bearings Forms New Finance Committee with Four-Member Structure",
            "Summary": "NRB Industrial Bearings Limited has established a Finance Committee through a Board resolution passed on September 12, 2025. The committee comprises four members: Mr. Devesh Singh Sahney as Chairperson (Managing Director), Mrs. Aarti Sahney as Member (Director), Ms. Sejal Mehta as Member (Independent Director), and Mr. Sandeep Despande as Member (Independent Director). The committee will operate according to terms of reference defined by the Board and will report its actions and decisions to subsequent Board meetings for review and information.",
            "Sentiment": "neutral",
            "PublishDate": 1757673511122,
            "Source": "corporate_governance"
        },
        {
            "Title": "NRB Industrial Bearings Promoter Aarti Devesh Sahney Acquires Additional 29,409 Shares",
            "Summary": "Mrs. Aarti Devesh Sahney, a promoter of NRB Industrial Bearings Limited, acquired 29,409 equity shares through open market trading on August 11, 2025. The acquisition increased her shareholding from 4,94,961 shares (2.04%) to 5,24,370 shares (2.16%) of the company's total equity capital. The company has 2,42,30,650 equity shares of Rs. 2 each, representing a total equity capital of Rs. 4,84,61,300. The disclosure was made in compliance with SEBI regulations on substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1754992730399,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Industrial Bearings Promoter Aarti Devesh Sahney Acquires Additional 19,750 Shares",
            "Summary": "Mrs. Aarti Devesh Sahney, a promoter of NRB Industrial Bearings Limited, acquired 19,750 equity shares through open market trading on August 8, 2025. The acquisition increased her shareholding from 4,75,211 shares (1.96%) to 4,94,961 shares (2.04%) of the company's total equity capital. The company has 2,42,30,650 equity shares of Rs. 2 each, totaling Rs. 4,84,61,300 in equity capital. The disclosure was made in compliance with SEBI regulations on substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1754916765967,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Industrial Bearings Promoter Aarti Devesh Sahney Acquires Additional 9,198 Shares",
            "Summary": "Aarti Devesh Sahney, a promoter of NRB Industrial Bearings Limited, acquired 9,198 equity shares through open market trading on August 7, 2025. The acquisition increased her shareholding from 4,66,013 shares (1.92%) to 4,75,211 shares (1.96%) of the company's total voting capital. The transaction represents a 0.038% increase in her stake. NRB Industrial Bearings has an equity share capital of Rs. 4,84,61,300 consisting of 2,42,30,650 equity shares of Rs. 2 each. The company is listed on both BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754916012964,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Industrial Bearings Applies for Reclassification of Ms. Harshbeena S. Zaveri from Promoter Group to Public Category",
            "Summary": "NRB Industrial Bearings Limited has submitted applications to BSE and NSE for reclassification of Ms. Harshbeena S. Zaveri from Promoter Group category to Public category under SEBI LODR Regulations. The application was dated July 31st, 2025. Ms. Zaveri currently holds 0 shares (0%) in the company. The company informed both exchanges in compliance with Regulation 31A of SEBI LODR Regulations regarding this reclassification request.",
            "Sentiment": "neutral",
            "PublishDate": 1753964574350,
            "Source": "corporate_action"
        }
    ]
}