{
    "Symbol": "NIITMTS",
    "ISIN": "INE342G01023",
    "News": [
        {
            "Title": "NIIT Learning Systems Allots 1 Lakh Equity Shares",
            "Summary": "NIIT Learning Systems Limited allotted 1,00,000 equity shares of Rs. 2/- each under its Employee Stock Option Plan 2023-0 on February 9, 2026, with listing formalities underway.",
            "Sentiment": "positive",
            "PublishDate": 1770722333242,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Learning Systems Shares Q3FY26 Earnings Call",
            "Summary": "NIIT Learning Systems Limited provides audio recording of investors and analysts call for Q3FY26 results held on January 28, 2026, following declaration of unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769612165835,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Learning Systems approves USD 10.50 mn guarantee",
            "Summary": "NIIT Learning Systems board approves corporate guarantee of USD 10.50 mn for subsidiary NIIT (USA) Inc.'s term loan facility to finance Sweetrush Inc. acquisition costs.",
            "Sentiment": "neutral",
            "PublishDate": 1769588188568,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Learning Systems invests USD 300,000 in Brazil unit",
            "Summary": "NIIT Learning Systems announces additional USD 300,000 equity investment in Brazilian subsidiary through NIIT USA to support growth and working capital requirements in Latin America expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769192305249,
            "Source": "stocks"
        },
        {
            "Title": "NIIT Learning Systems Q3FY26 Earnings Call on Jan 28",
            "Summary": "NIIT Learning Systems Limited has scheduled an earnings call for January 28, 2026, to discuss its Q3FY26 financial results with investors and analysts from 3:30 PM to 4:30 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1768928491593,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Learning Systems Allots 98,000 Shares Under ESOP",
            "Summary": "NIIT Learning Systems Limited allotted 98,000 equity shares of ₹2 each under its Employee Stock Option Plan 2023-0 on January 16, 2026, with listing formalities underway.",
            "Sentiment": "positive",
            "PublishDate": 1768555376248,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Learning Systems Acquires SweetRush for $26M",
            "Summary": "NIIT Learning Systems Limited has acquired 100% of SweetRush Inc., a leader in AI-enabled custom learning experience design, for up to USD 26 million through its US subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1767985821683,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Learning Systems Acquires SweetRush for $26M",
            "Summary": "NIIT Learning Systems completed acquisition of 100% equity stake in US-based SweetRush Inc. for up to $26 million through its subsidiary NIIT (USA) Inc., expanding its managed learning services portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767985308969,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Learning Systems Acquires SweetRush for $26M",
            "Summary": "NIIT Learning Systems' US subsidiary completes 100% acquisition of SweetRush Inc., a San Francisco-based corporate learning solutions provider with $22.4M turnover, for up to $26M including earnouts.",
            "Sentiment": "positive",
            "PublishDate": 1767985003068,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT MTS Wins 64 Brandon Hall Excellence Awards",
            "Summary": "NIIT Learning Systems' managed training services division earned 64 Brandon Hall Technology and Education Technology Excellence Awards in partnership with major clients including MetLife and Unilever.",
            "Sentiment": "positive",
            "PublishDate": 1765383416518,
            "Source": "stocks"
        },
        {
            "Title": "NIIT MTS Wins 64 Brandon Hall Technology and Education Excellence Awards",
            "Summary": "NIIT Learning Systems Limited (NIIT MTS) earned 64 Brandon Hall Technology and Education Technology Excellence awards jointly with customers including MetLife, Century21 Heritage Group, The Writing Revolution, and Unilever. The company received 52 Gold, 7 Silver, and 5 Bronze awards for its AI solutions including NVerse, Spotter, NCAP, and XpertIX, demonstrating its leadership in managed learning services across 32 countries.",
            "Sentiment": "positive",
            "PublishDate": 1765363241609,
            "Source": "stock"
        },
        {
            "Title": "NIIT Learning Systems Initiates Strike-off of Inactive UK Subsidiary",
            "Summary": "MST Holding GmbH, a step-down subsidiary of NIIT Learning Systems Limited, has filed an application for striking off and dissolution of its inactive subsidiary MST UK Limited. The company stated this move aims to streamline corporate structure and will have no impact on financial statements, operations, or shareholding patterns.",
            "Sentiment": "neutral",
            "PublishDate": 1765275864423,
            "Source": "corporate_action"
        },
        {
            "Title": "NIIT Learning Systems Allots 8,658 Equity Shares Under Employee Stock Option Plan",
            "Summary": "NIIT Learning Systems Limited's Share Allotment Committee allotted 8,658 equity shares of Rs. 2/- each under the company's Employee Stock Option Plan 2023-0. The company is completing formalities for listing these shares and will file a listing application with stock exchanges for trading approval.",
            "Sentiment": "neutral",
            "PublishDate": 1764226313108,
            "Source": "corporate_action"
        },
        {
            "Title": "NIIT Learning Systems Reports 20% Revenue Growth in Q2, AI-Enabled Revenue Reaches 10% of Business",
            "Summary": "NIIT Learning Systems Limited reported revenue of INR 4,757 million for the quarter, representing 20% year-on-year growth and 5% quarter-on-quarter growth. In constant currency terms, revenue grew 15% year-on-year and 3% quarter-on-quarter. EBITDA for the quarter was INR 966 million with a margin of 20.3%. The company completed the acquisition of MST Group in Germany during July, which contributed to growth. AI-enabled revenue now represents approximately 10% of the business, marking significant progress in the company's AI-first strategy. The company added three new MTS contracts, renewed three existing contracts, and expanded scope with one large client, maintaining a 100% renewal record. Total MTS client count reached 104 after adding seven clients through the MST acquisition. For Q3, the company expects constant currency growth of 2-3% quarter-on-quarter, with full-year constant currency growth projected at 12.5-13% year-on-year. Margins are expected to remain in the 20-21% range for both Q3 and the full year. The company successfully completed the North American real estate contract transition during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762968496017,
            "Source": "earnings"
        },
        {
            "Title": "NIIT MTS and Client Nominees Win Seven Chief Learning Officer Awards 2025",
            "Summary": "NIIT Learning Systems Limited's Managed Training Services division and its client nominees received seven Chief Learning Officer Learning in Practice Awards in 2025. NIIT's AI-powered tool NVERSE won a Silver Award for Excellence in Technology Innovation. Client nominees John Kusi-Mensah at MetLife and Mark Slaga at Kyndryl won six awards across multiple categories including Gold and Silver in Innovation, Gold and Silver in Strategy, Gold in Technology, and Gold in Trailblazing Leadership. The Chief Learning Officer Learning in Practice Awards have recognized learning leaders since 2003 for excellence in employee development programs. NIIT MTS operates in over 32 countries and maintains a Net Promoter Score of 9/10 with a 100% renewal rate.",
            "Sentiment": "positive",
            "PublishDate": 1762964614144,
            "Source": "stock"
        },
        {
            "Title": "NIIT Learning Systems Allots 11,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "NIIT Learning Systems Limited allotted 11,000 equity shares of Rs. 2 each under its Employee Stock Option Plan 2023-0. The Share Allotment Committee approved the allotment on November 12, 2025. The company is completing formalities for listing these shares and will file a listing application with the exchanges for seeking listing and trading approval.",
            "Sentiment": "neutral",
            "PublishDate": 1762933674747,
            "Source": "corporate_action"
        },
        {
            "Title": "NIIT MTS Ranks Among Top 20 IT Training Companies for 16th Consecutive Year",
            "Summary": "NIIT Learning Systems Limited's Managed Training Services (NIIT MTS) has been named to Training Industry's 2025 Top 20 Companies in IT and Technical Training for the sixteenth consecutive year. The selection was based on scope and quality of program offerings, market presence and innovation, client portfolio strength, and business performance. Training Industry recognized companies that deliver high-quality training for IT, cybersecurity, data and technical professionals, including AI and emerging technology programs. NIIT MTS operates as a global leader in managed learning services, serving companies in over 30 countries with a Net Promoter Score of 9/10 and 100% renewal rate. The company was established in 1981 and offers managed learning services and strategic consulting for talent and workforce transformation.",
            "Sentiment": "positive",
            "PublishDate": 1762865329058,
            "Source": "stock"
        },
        {
            "Title": "NIIT Learning Systems Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "NIIT Learning Systems reported quarterly results showing revenue growth to 4.76 billion rupees from 3.97 billion rupees year-over-year. However, net profit declined to 469.6 million rupees compared to 570.3 million rupees in the same period last year. EBITDA increased to 927.1 million rupees from 875.2 million rupees year-over-year, while EBITDA margin compressed to 19.49% from 22.02% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762332494970,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Learning Systems Reports Quarterly Results and Completes MST Group Acquisition",
            "Summary": "NIIT Learning Systems Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved both consolidated and standalone results in a meeting held on November 5, 2025. On the consolidated basis, the company reported revenue from operations of Rs. 4,513.5 million for the quarter and Rs. 9,270.20 million for the half-year. Net profit after tax stood at Rs. 463.64 million for the quarter and Rs. 962.67 million for the half-year. On July 9, 2025, NIIT (Ireland) Limited, a wholly owned overseas subsidiary, acquired a 100% equity stake in MST Investment Holding GmbH and its subsidiaries for EUR 22.37 million. The acquisition included EUR 15.35 million for equity purchase and EUR 7.02 million for existing loan takeover. During the quarter, the company granted 1,691,667 stock options at Rs. 335.80 per option and issued 583,646 equity shares under employee stock option plans. The trading window for designated persons will open from November 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762330842850,
            "Source": "earnings"
        },
        {
            "Title": "NIIT USA Approves $13 Million Investment in Subsidiary StackRoute Learning",
            "Summary": "NIIT USA Inc., a wholly owned subsidiary of NIIT Learning Systems Limited, has approved a $13 million investment in its subsidiary StackRoute Learning Inc (SLI). The investment includes $9 million in equity to replace existing loans and an additional $4 million in cash for growth and working capital requirements. SLI provides managed learning services to the higher-education sector in North America, focusing on technology programs including AI, Cyber, Cloud and Data bootcamps. NIIT USA plans to leverage SLI's capabilities to serve corporate clients for employee onboarding, upskilling, and reskilling. The investment is subject to regulatory approvals and is not expected to materially impact NIIT Learning Systems' consolidated financials. SLI will remain a wholly owned subsidiary of NIIT USA following the transaction.",
            "Sentiment": "positive",
            "PublishDate": 1761854405415,
            "Source": "stock"
        },
        {
            "Title": "NIIT Learning Systems Allots 21,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "NIIT Learning Systems Limited allotted 21,000 equity shares of Rs. 2 each under its Employee Stock Option Plan 2023-0. The Share Allotment Committee approved the allotment on October 28, 2025. The company is completing formalities for listing these shares and will file a listing application with the exchanges for trading approval.",
            "Sentiment": "neutral",
            "PublishDate": 1761627742353,
            "Source": "corporate_action"
        },
        {
            "Title": "NIIT MTS Receives Gold Standard Accreditation from Learning and Performance Institute for Tenth Consecutive Year",
            "Summary": "NIIT Learning Systems Limited announced that NIIT MTS has been accredited with the Gold Standard by the Learning and Performance Institute for the tenth consecutive year, maintaining this ranking since 2021. The Learning and Performance Institute is a global membership body for learning professionals that provides globally recognized quality marks for learning service providers through rigorous audits. The accreditation report praised NIIT for its work in digital transformation, scalable learning programmes, and investment in AI and immersive learning technologies. Ed Monk, CEO of the Learning and Performance Institute, welcomed NIIT into the distinguished group of Gold Accredited providers, citing their innovation and learner-first approach. Sapnesh Lalla, CEO and Executive Director of NIIT MTS, described the Gold Accreditation as a significant milestone reinforcing their commitment to high-impact learning solutions. NIIT MTS operates as a managed learning services company serving clients in over 32 countries with a Net Promoter Score of 9/10 and 100% renewal rate.",
            "Sentiment": "positive",
            "PublishDate": 1757925660995,
            "Source": "stock"
        },
        {
            "Title": "NIIT Learning Systems Named to Training Industry's Top 20 Experiential Learning Technologies Companies for Fifth Consecutive Year",
            "Summary": "NIIT Learning Systems Limited (NIIT MTS) has been recognized among Training Industry's Top 20 Experiential Learning Technologies Companies for 2025, marking the fifth consecutive year of this achievement. The selection was based on criteria including scope and quality of features, market presence and innovation, client portfolio strength, and business performance. Training Industry noted that the listed companies leverage technologies such as augmented and virtual reality, digital environments, and gamification to improve learning outcomes while helping organizations reduce risk and manage costs. NIIT MTS, established in 1981, operates as a managed learning services company serving clients in over 30 countries with a reported Net Promoter Score of 9/10 and 100% renewal rate.",
            "Sentiment": "positive",
            "PublishDate": 1757592619456,
            "Source": "stock"
        },
        {
            "Title": "NIIT MTS Partners with AI Company Sana to Launch Center of Excellence for Learning Services",
            "Summary": "NIIT Learning Systems Limited (NIIT MTS) has announced a strategic partnership with Sana, an AI company based in Stockholm, Sweden. The partnership will establish a dedicated NIIT-Sana Center of Excellence that will deliver professional services across Sana Learn, an AI-native learning platform combining LMS, LXP, authoring tool, and virtual classroom capabilities. The Center of Excellence will offer six core service areas: strategic consulting, implementation services, learning experience design, technical consulting and support, learning administration services, and engineering services. The collaboration aims to leverage NIIT MTS' managed learning services expertise with Sana's AI-first platform to create integrated solutions for enterprise clients. Sana has been recognized on Forbes AI50 and Fast Company's Most Innovative lists, and has raised over $130 million from investors including NEA, Menlo Ventures, and EQT Ventures.",
            "Sentiment": "positive",
            "PublishDate": 1755002498725,
            "Source": "order&deals"
        },
        {
            "Title": "NIIT Learning Systems Reports 11% Revenue Growth, Completes MST Group Acquisition",
            "Summary": "NIIT Learning Systems reported revenue of INR 4,514 million, representing 11% year-over-year growth and 5% quarter-over-quarter growth for the quarter ended June 30, 2025. EBITDA reached INR 951 million with a margin of 21%, declining 7% annually but increasing 11% quarterly. The company completed the acquisition of MST Group for EUR 22.37 million, adding 7 Global 1000 clients and expanding presence in the DACH region. The acquisition is expected to be earnings accretive from the first year and contribute 3-4 percentage points to growth. NIIT added 2 new MTS customers and renewed 3 contracts, bringing total MTS customers to over 100. The company has made progress in AI capabilities, implementing enterprise-grade solutions for key clients. Management provided FY26 guidance of 10%+ constant currency organic growth with full-year EBITDA margin guidance of 20-21%. The company noted macroeconomic uncertainty is leading to longer client decision cycles and increased focus on cost optimization.",
            "Sentiment": "positive",
            "PublishDate": 1754892337620,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Learning Systems Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "NIIT Learning Systems reported quarterly revenue of 4.5 billion rupees, up from 4.1 billion rupees in the same period last year. However, the company's profitability declined with EBITDA falling to 904 million rupees from 960 million rupees year-over-year. EBITDA margin compressed to 20% compared to 23.58% in the previous year. Consolidated net profit also decreased to 493 million rupees from 600 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754466949230,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Ireland Acquires Complete Ownership of MST Group",
            "Summary": "NIIT Ireland has acquired complete ownership of MST Group for EUR 22.37 million. This acquisition represents a significant corporate action for NIIT, expanding its presence in the European market.",
            "Sentiment": "positive",
            "PublishDate": 1752069374000,
            "Source": "default"
        },
        {
            "Title": "NIIT Learning Recognized as Databricks' ATP APJ Training Partner of the Year",
            "Summary": "NIIT Learning has been awarded the title of ATP APJ Training Partner of the Year by Databricks. This recognition highlights NIIT Learning's excellence in providing training services for Databricks in the Asia-Pacific and Japan region.",
            "Sentiment": "positive",
            "PublishDate": 1749800951000,
            "Source": "default"
        },
        {
            "Title": "NIIT Learning Systems: Q4 Revenue Up, Profit Down; Dividend Declared",
            "Summary": "NIIT Learning Systems reported Q4 FY25 results with revenue up 7.9% YoY to ₹429.7 crore, but net profit down 10.4% to ₹48.7 crore. Full-year FY25 saw profit grow 6.7% to ₹227.5 crore and revenue increase 6.4% to ₹1,653.2 crore. The company secured 10 new global MTS contracts and renewed 9, ending with 93 MTS customers and $390 million revenue visibility. A final dividend of ₹3 per share was recommended.",
            "Sentiment": "neutral",
            "PublishDate": 1747225110000,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Learning Systems Announces Q4 Results and Dividend",
            "Summary": "NIIT Learning Systems has declared a dividend of 3 rupees per share. The company's Q4 EBITDA was 801 million rupees, down from 968 million rupees year-over-year. The Q4 EBITDA margin decreased to 18.64% from 24.32% in the previous year. The consolidated net profit for Q4 was 487 million rupees, compared to 544 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747215983000,
            "Source": "result"
        },
        {
            "Title": "NIIT Learning Systems to Consider Q4 Results on May 14",
            "Summary": "NIIT Learning Systems has announced that it will consider its fourth quarter (Q4) financial results on May 14. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746186606000,
            "Source": "default"
        },
        {
            "Title": "NIIT Learning Systems: Q3 Profit Rises 8.78% YoY to ₹61.73 Crore",
            "Summary": "NIIT Learning Systems reported Q3 FY25 results with revenue up 7.04% YoY to ₹418.88 crore and profit increasing 8.78% YoY to ₹61.73 crore. EPS rose to ₹4.6, a 13.86% YoY increase. Operating income decreased 5.84% YoY but grew 3.48% QoQ.",
            "Sentiment": "positive",
            "PublishDate": 1737609544000,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Learning Systems Reports Q3 Revenue Growth",
            "Summary": "NIIT Learning Systems has reported a revenue of 4.18 billion rupees for the third quarter, compared to 3.9 billion rupees in the same period last year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1737532951000,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Learning Systems Reports Q3 EBITDA Growth",
            "Summary": "NIIT Learning Systems has reported its Q3 financial results. The company's EBITDA increased to 916 million rupees, up from 901 million rupees in the same quarter last year. However, the EBITDA margin decreased to 21.87% from 23.03% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737532892000,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Learning Systems Reports Increased Q3 Consolidated Net Profit",
            "Summary": "NIIT Learning Systems has reported a consolidated net profit of 617 million rupees for the third quarter, compared to 567 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737532817000,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Learning Revises Growth Forecast Downward",
            "Summary": "NIIT Learning has adjusted its growth expectations from 12-13% to 7% due to weak market sentiment, as reported by CNBCTV18.",
            "Sentiment": "negative",
            "PublishDate": 1729672378000,
            "Source": "result"
        },
        {
            "Title": "NIIT Learning Reduces FY25 Revenue Growth Forecast",
            "Summary": "NIIT Learning has lowered its revenue growth guidance for the fiscal year 2025. This adjustment in financial outlook suggests potential challenges or changes in the company's business environment or market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1729672050000,
            "Source": "corporate_action"
        },
        {
            "Title": "NIIT Learning Systems Reports Q2 Financial Results",
            "Summary": "NIIT Learning Systems has reported its Q2 financial results. The company's EBITDA for Q2 was 876 million rupees, compared to 899 million rupees in the same quarter last year. The EBITDA margin for Q2 was 22.04%, down from 23.54% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729669379000,
            "Source": "result"
        },
        {
            "Title": "NIIT Learning Systems Reports Q2 Revenue Growth",
            "Summary": "NIIT Learning Systems has announced its second quarter revenue for the current fiscal year. The company reported revenue of 4 billion rupees, compared to 3.8 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729669308000,
            "Source": "result"
        },
        {
            "Title": "NIIT Learning Systems Reports Q2 Profit Growth",
            "Summary": "NIIT Learning Systems has reported a consolidated net profit of 570 million rupees for the second quarter, compared to 469 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729669283000,
            "Source": "result"
        }
    ]
}