{
    "Symbol": "NIITLTD",
    "ISIN": "INE161A01038",
    "News": [
        {
            "Title": "NIIT Partners with Abodoo for Skills Intelligence",
            "Summary": "NIIT Learning Systems announces strategic partnership with Abodoo to enhance skills intelligence and workforce development capabilities, targeting skills gaps in AI-driven economy.",
            "Sentiment": "positive",
            "PublishDate": 1770197918674,
            "Source": "stocks"
        },
        {
            "Title": "NIIT Gets Relief in Rs 8.11 Crore GST Demand Case",
            "Summary": "NIIT Limited receives favorable order from Commissioner (Appeals) Gurugram setting aside GST demand of Rs 8.11 crore related to credit mismatch for FY 2020-21, providing complete relief to the company.",
            "Sentiment": "positive",
            "PublishDate": 1770105379451,
            "Source": "stocks"
        },
        {
            "Title": "NIIT Appoints Three Senior Management Persons",
            "Summary": "NIIT Limited announces appointment of Pran Kishore Koul, Sachin Grover, and Vijay Kumar Srinivasan as Senior Management Persons effective January 30, 2026, following organizational restructuring.",
            "Sentiment": "positive",
            "PublishDate": 1769761198449,
            "Source": "stocks"
        },
        {
            "Title": "NIIT Q3FY26 Results: Revenue Up 3.3% YoY to ₹1,014 Cr",
            "Summary": "NIIT Limited reported consolidated revenue of ₹1,013.68 million for Q3FY26, up 3.3% YoY. Net profit declined to ₹39.50 million from ₹133.95 million due to exceptional items worth ₹54.34 million.",
            "Sentiment": "neutral",
            "PublishDate": 1769760273723,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Learning Reports 20.42% Jump in Q3 Net Profit",
            "Summary": "NIIT Learning Systems posted consolidated net profit of ₹743 million in Q3 compared to ₹617 million in the same quarter last year, marking strong year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1769587029569,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Board Meeting Set for January 30 to Review Q3 Results",
            "Summary": "NIIT Limited has scheduled a board meeting on January 30, 2026, to consider and approve unaudited financial results for Q3 FY26 and nine months ended December 31, 2025, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769094947592,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Limited Senior Management Personnel Change",
            "Summary": "NIIT Limited announces cessation of Ms. Mita Brahma as Senior Management Personnel effective December 31, 2025, completing her tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1767257093810,
            "Source": "stocks"
        },
        {
            "Title": "NIIT Receives ₹1.81 Cr GST Demand Order",
            "Summary": "NIIT Limited disclosed receiving a GST demand order worth ₹1.81 crores from tax authorities for FY2021-22, primarily due to differences in GST credit filings. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766650348806,
            "Source": "stocks"
        },
        {
            "Title": "NIIT Gets Relief in GST Assessment with Nil Demand",
            "Summary": "NIIT Limited receives assessment order with nil demand from Delhi tax authorities, concluding GST proceedings that initially involved ₹4.15 crore demand for FY2021-22.",
            "Sentiment": "positive",
            "PublishDate": 1765882926549,
            "Source": "stocks"
        },
        {
            "Title": "NIIT Allots 15,000 Shares Under ESOP-2005 Plan",
            "Summary": "NIIT Limited's Share Allotment Committee approved allotment of 15,000 equity shares of ₹2 each under Employee Stock Option Plan-2005 on December 11, 2025. Company initiating listing formalities.",
            "Sentiment": "neutral",
            "PublishDate": 1765508798235,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIIT Limited Launches AI Engineering Training Program",
            "Summary": "NIIT Limited has launched a new training program focused on teaching engineers how to build autonomous AI systems. The program aims to provide practical experience to participants and address the talent shortage in AI engineering.",
            "Sentiment": "positive",
            "PublishDate": 1762506398715,
            "Source": "stock"
        },
        {
            "Title": "NIIT Limited Reports 16% Revenue Growth in Q2 with Strong Order Intake Despite Volatile Market Conditions",
            "Summary": "NIIT Limited delivered quarterly results with revenue of INR 1,049 million, up 16% year-on-year and 25% quarter-on-quarter. Order intake reached INR 1,454 million, growing 14% year-on-year and 37% quarter-on-quarter. The company reported marginally positive EBITDA of INR 13 million versus negative INR 63 million in the previous quarter. Revenue included INR 111 million from iamneo acquisition, with organic growth at 3.5% year-on-year. Enterprise revenue was INR 703 million (up 10% year-on-year) while consumer revenue reached INR 347 million (up 29% year-on-year). Technology programs revenue grew 31% year-on-year to INR 761 million, while BFSI revenue declined 12% year-on-year to INR 288 million. The company added 18 new client logos and maintained cash reserves of INR 6,846 million. NIIT announced a scheme to merge subsidiaries RPS Consulting and IFBI into the parent company for operational simplification. Management guided Q3 revenue growth of 15-18% year-on-year with low single-digit margins, and maintained full-year guidance of 15-20% revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1762295786103,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Limited Appoints Shilpa Dua as Chief Human Resources Officer",
            "Summary": "NIIT Limited announced the appointment of Ms. Shilpa Dua as Chief Human Resources Officer and Senior Management Person effective October 30, 2025. Dua holds a postgraduate degree in HR from Fore School of Management, New Delhi and brings over 18 years of experience across financial services, retail, consumer goods and healthcare sectors. She has previously held HR leadership roles at organizations including Max Life Insurance, Walmart, Hindustan Coca Cola Beverages and GSK Consumer Healthcare Limited. Her last position was Corporate Vice President Head HR-Axis Partnership at Max Life Insurance Company Limited, after which she provided HR consulting services to start-up companies as a freelancer.",
            "Sentiment": "positive",
            "PublishDate": 1761843216422,
            "Source": "corporate_governance"
        },
        {
            "Title": "NIIT Appoints Dr. Vishnupriya Raghavan as Senior Management Person",
            "Summary": "NIIT Limited announced the appointment of Dr. Vishnupriya Raghavan as a Senior Management Person effective October 28, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Dr. Raghavan serves as Senior Vice President & Business Head for Enterprise IT Business - StackRoute. She brings over 25 years of experience in corporate education, research, and enterprise transformation. Since joining NIIT in November 2019, she has led the establishment and scaling of StackRoute as a strategic business division focused on deep-skilling and enterprise capability development. Under her leadership, StackRoute has secured key enterprise clients and won over 50 Brandon Hall awards. Dr. Raghavan holds a Master's in Mathematics, a Master's in Information Systems, and a PhD in Information Systems, with over 15 publications in top-tier journals.",
            "Sentiment": "positive",
            "PublishDate": 1761650251921,
            "Source": "corporate_governance"
        },
        {
            "Title": "NIIT Limited Reports Q2 FY26 Results with 16% YoY Revenue Growth to Rs. 1,049 Million",
            "Summary": "NIIT Limited announced its quarterly results for the period ended September 30, 2025, with net revenue of Rs. 1,049 million, representing a 16% year-over-year increase and 25% quarter-over-quarter growth. The company's Consumer business contributed 33% to total revenue with 29% YoY growth, while Enterprise business accounted for 67% with 10% YoY growth. Technology programs generated Rs. 761 million (73% of revenue) with 31% YoY growth, and BFSI & Other programs contributed Rs. 288 million. Order intake reached Rs. 1,454 million, up 14% YoY and 37% QoQ. EBITDA was Rs. 13 million compared to negative Rs. 63 million in the previous quarter. The company acquired 70% equity shareholding in iamneo Edutech Private Limited for Rs. 608.90 million and made NIIT Institute of Finance Banking and Insurance Training Limited a wholly owned subsidiary. Under the Employee Stock Option Plan 2005, 680,000 options were granted at Rs. 130.65 per option, with 563,664 equity shares issued during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761640719918,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Q2 Revenue Rises to 1.05 Billion Rupees, Net Profit Drops Significantly",
            "Summary": "NIIT reported Q2 revenue of 1.05 billion rupees, up from 907 million rupees in the same period last year. However, consolidated net profit declined sharply to 13.7 million rupees compared to 118 million rupees year-over-year. The company posted an EBITDA loss of 11 million rupees versus a loss of 10 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761638752063,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Limited Files Amalgamation Application with National Company Law Tribunal",
            "Summary": "NIIT Limited has submitted an application to the National Company Law Tribunal for the amalgamation of NIIT Institute of Finance Banking and Insurance Training Limited and RPS Consulting Private Limited into NIIT Limited. The Board of Directors had previously approved this scheme of amalgamation with an appointed date of April 01, 2026. The application was completed on October 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761565314136,
            "Source": "corporate_action"
        },
        {
            "Title": "NIIT Limited Re-designates Parappil Rajendran from Joint Managing Director to Non-Executive Director",
            "Summary": "NIIT Limited re-designated Mr. Parappil Rajendran from Joint Managing Director to Non-Executive Non-Independent Director, effective October 1, 2025. He ceased to be an Executive Director and Key Managerial Personnel as of September 30, 2025. The Board of Directors approved this change on July 1, 2025, based on the Nomination & Remuneration Committee's recommendation, and shareholders approved the proposal at the Annual General Meeting held on September 24, 2025. Rajendran has been with NIIT since its inception in 1981 and holds a degree in Electrical Engineering from IIT Delhi. He serves on the Board of Management of NIIT University and is engaged with NIIT Foundation. He has no relationships with other directors and is not debarred from holding directorship positions.",
            "Sentiment": "neutral",
            "PublishDate": 1759297262816,
            "Source": "corporate_governance"
        },
        {
            "Title": "NIIT Acquires 70% Stake in iamneo Edutech for Rs 613 Million, Plans Full Acquisition Over 5 Years",
            "Summary": "NIIT Limited has acquired 70% equity shareholding in iamneo Edutech Private Limited for up to Rs 613 million, making it a subsidiary. The acquisition was completed on April 17, 2025, following board approval. NIIT will acquire the remaining 30% stake from promoters over the next five years. iamneo Edutech is a provider of AI-powered deep skilling technology training solutions through a SaaS platform, serving universities and corporates. The company reported revenue of approximately Rs 276 million in FY 2024-25. The acquisition enables NIIT to deliver learning solutions for undergraduates and early career professionals, including industry-relevant technology courses, automated labs, assessments, and placement management for universities, plus talent onboarding and upskilling programs for corporates. The transaction was structured as cash consideration and does not involve related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1757084524848,
            "Source": "order&deals"
        },
        {
            "Title": "NIIT Limited Reports Mixed Q1 Results with Revenue Growth but Negative EBITDA",
            "Summary": "NIIT Limited reported revenue of INR 841 million, up 2% year-over-year but down 3% quarter-over-quarter for the quarter ended June 30, 2025. The company posted negative EBITDA of INR 63 million and PAT of INR 44 million, down from INR 131 million in the previous quarter. Enterprise business revenue grew 7% to INR 574 million while consumer business declined 8% to INR 267 million. The company completed acquisition of 70% stake in iamneo for INR 609 million and acquired remaining 19% stake in IFBI from ICICI Bank. Order intake increased 37% year-over-year to INR 1,065 million. Management revised FY26 revenue growth guidance to 15-20% from 25% earlier, citing macro headwinds and slower decision-making in the market. The company expects strong sequential growth in Q2 with 13-16% revenue growth but marginally negative margins.",
            "Sentiment": "neutral",
            "PublishDate": 1755150749596,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Reports 44% Drop in Net Profit Despite Revenue Growth",
            "Summary": "NIIT reported consolidated net profit of 44 million rupees compared to 78 million rupees in the same quarter last year, representing a decline. However, the company's revenue increased to 841 million rupees from 825 million rupees year-over-year, showing growth in the top line despite pressure on profitability.",
            "Sentiment": "negative",
            "PublishDate": 1754641140222,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Learning Systems Reports 11% Revenue Growth, Completes Germany Acquisition",
            "Summary": "NIIT Learning Systems Limited reported consolidated revenue of ₹451.4 crore for the first quarter of fiscal year 2026, representing an 11% year-on-year increase and 5% sequential growth. The company's EBITDA reached ₹95.1 crore with a 21% margin, improving 112 basis points quarter-on-quarter. However, profit after tax declined 18% year-on-year to ₹49.3 crore, with earnings per share at ₹3.62. The company expanded its client base to 95 by adding two new managed training services clients and maintained perfect contract renewals, securing revenue visibility of $388 million. NIIT MTS completed the acquisition of Munich-based MST Group for Euro 22.37 million, strengthening its presence in the DACH region and adding automotive and industrial sector capabilities. The acquisition provides MST Group access to NIIT MTS's AI-enabled learning solutions. Company shares were trading at ₹328.30, down ₹7.20 or 2.15%.",
            "Sentiment": "neutral",
            "PublishDate": 1754473693606,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Limited Launches New gNIIT Campaign to Simplify Career Skill-Building for Undergraduate Students",
            "Summary": "NIIT Limited announced a new campaign for its flagship gNIIT program targeting first and second-year undergraduate students. The campaign encourages students to explore multiple career skills before committing to a fixed path, addressing the gap between conventional education and industry demands. According to AISHE 2021-22 data cited by NIIT, while total enrollment in higher education reached 4.33 crore, only 50% of graduates are employable based on the India Skills Report 2025. The gNIIT program offers customized learning designed to complement undergraduate education by providing in-demand career options, 6-month internships, professional grooming, and placement assistance. The campaign uses relatable concepts like 'Trial Room for Careers,' 'Buffet for Careers,' and 'OTT Platform for Careers' to demonstrate flexible learning paths. The campaign was conceptualized by BBDO and will run across NIIT Digital's social media platforms including Instagram, YouTube, Facebook, and LinkedIn through a series of short digital films.",
            "Sentiment": "positive",
            "PublishDate": 1753778956203,
            "Source": "stock"
        },
        {
            "Title": "NIIT Announces Q4 Results and Dividend",
            "Summary": "NIIT has declared a dividend of 1 rupee per share. The company's Q4 consolidated net profit increased to 131 million rupees from 110 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747123110000,
            "Source": "result"
        },
        {
            "Title": "NIIT to Consider Q4 Results on May 13",
            "Summary": "NIIT Limited has announced that it will consider and approve its financial results for the fourth quarter on May 13.",
            "Sentiment": "neutral",
            "PublishDate": 1746186549000,
            "Source": "default"
        },
        {
            "Title": "NIIT to Acquire Remaining Stake in IFBI Subsidiary",
            "Summary": "NIIT has announced plans to acquire the remaining 19.28% stake in its subsidiary IFBI from ICICI Bank and other stakeholders for up to Rs 65.8 million. This acquisition will make IFBI a wholly owned subsidiary of NIIT.",
            "Sentiment": "positive",
            "PublishDate": 1745073472000,
            "Source": "default"
        },
        {
            "Title": "NIIT to Acquire 100% of IAMNEO Edutech in Phased Acquisition",
            "Summary": "NIIT has announced the acquisition of IAMNEO Edutech. The company has already completed a 70% acquisition for up to 613 million rupees, with the remaining 30% to be acquired over the next 5 years. The deal includes a primary investment of approximately 100 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744898293000,
            "Source": "default"
        },
        {
            "Title": "NIIT Launches GNIIT Dual Qualification Program for Undergraduates",
            "Summary": "NIIT has introduced GNIIT, a customizable dual qualification program designed for undergraduate students. This program aims to provide additional qualifications alongside their regular degree, potentially enhancing their employability and skills.",
            "Sentiment": "positive",
            "PublishDate": 1742794320000,
            "Source": "corporate_action"
        },
        {
            "Title": "NIIT Ltd: Q3 Profit Drops Despite Revenue Growth",
            "Summary": "NIIT Ltd reported a 17.2% decline in Q3 FY2025 net profit to Rs 13 crore, despite a 15.3% increase in revenue to Rs 98 crore. Ebitda margin contracted to 6.9% from 8.2% year-on-year. The company's stock fell 3.34% following the earnings announcement.",
            "Sentiment": "negative",
            "PublishDate": 1737707518000,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Reports Q3 Revenue Growth",
            "Summary": "NIIT has announced its third quarter revenue, which stands at 981 million rupees. This represents a year-over-year increase from 852 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1737704135000,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Reports Q3 Consolidated Net Profit of 134 Million Rupees",
            "Summary": "NIIT Limited has announced its financial results for the third quarter. The company reported a consolidated net profit of 134 million rupees, compared to 144 million rupees in the same quarter of the previous year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1737704066000,
            "Source": "earnings"
        },
        {
            "Title": "NIIT Reports Q2 Revenue Growth",
            "Summary": "NIIT has announced its second quarter revenue for the current fiscal year. The company reported revenue of 907 million rupees, compared to 814 million rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729841565000,
            "Source": "result"
        },
        {
            "Title": "NIIT Reports Increased Q2 Consolidated Net Profit",
            "Summary": "NIIT Limited has reported a consolidated net profit of 120 million rupees for the second quarter, compared to 106 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729841542000,
            "Source": "result"
        }
    ]
}