{
    "Symbol": "NILASPACES",
    "ISIN": "INE00S901012",
    "News": [
        {
            "Title": "Nila Spaces Gets CARE BBB Rating for Bank Facilities",
            "Summary": "Nila Spaces Limited receives CARE BBB stable rating for INR 125.00 crore long-term bank facilities while previous issuer rating gets withdrawn by CARE Ratings Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1770106417259,
            "Source": "stocks"
        },
        {
            "Title": "Nila Spaces Independent Director Amit Chokshi Resigns",
            "Summary": "Nila Spaces Limited announces resignation of Independent Director Mr. Amit R. Chokshi effective 30 January 2026, citing focus on other life priorities and commitments as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1769771051117,
            "Source": "stocks"
        },
        {
            "Title": "Nila Spaces Board Meet on Jan 30 for Q3FY26 Results",
            "Summary": "Nila Spaces Limited has scheduled its board meeting for January 30, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window to reopen 48 hours post announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1769173973811,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nila Spaces Reports Q2 FY26 Financial Results with Mixed Performance",
            "Summary": "Nila Spaces Limited announced its unaudited standalone and consolidated financial results for the quarter and six months ended September 30, 2025, following board approval on November 13, 2025. The real estate company's results show varied performance across standalone and consolidated operations, with statutory auditors completing their limited review as per SEBI regulations.",
            "Sentiment": "negative",
            "PublishDate": 1763055544169,
            "Source": "earnings"
        },
        {
            "Title": "Nila Spaces Reports 68.6% Jump in Q2 Net Profit to 65.6 Million Rupees",
            "Summary": "Nila Spaces delivered strong quarterly results with net profit rising to 65.6 million rupees compared to 38.9 million rupees in the same period last year. Revenue increased to 421.8 million rupees from 319.1 million rupees year-over-year. EBITDA grew to 119.8 million rupees versus 78.9 million rupees previously. The company's EBITDA margin improved to 28.39% from 24.72% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763037154191,
            "Source": "earnings"
        },
        {
            "Title": "Nila Spaces Reports Strong Q1 Performance with 92% Jump in Net Profit",
            "Summary": "Nila Spaces delivered robust Q1 results with consolidated net profit surging to 59 million rupees from 25 million rupees year-over-year. Revenue grew to 408 million rupees compared to 311 million rupees in the same period last year. The company's EBITDA nearly doubled to 121 million rupees from 63 million rupees, while EBITDA margin expanded significantly to 29.61% from 20.12% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754480927848,
            "Source": "earnings"
        },
        {
            "Title": "Nila Spaces Limited Approves Quarterly Financial Results for June 2025",
            "Summary": "Nila Spaces Limited held a board meeting on August 6, 2025, where directors approved the Unaudited Standalone & Consolidated Financial Results for the quarter ended June 30, 2025. The meeting commenced at 3:00 p.m. and concluded at 4:40 p.m. at the company's registered office. The financial results, along with the Limited Review Report from the Statutory Auditor, have been submitted to BSE Limited and National Stock Exchange of India Limited. The consolidated results include subsidiary company Nila Urban Living Private Limited and associate company Megacity Cinematt Pvt Ltd. The auditor's review found no material misstatements in the financial results prepared in accordance with Indian Accounting Standards.",
            "Sentiment": "neutral",
            "PublishDate": 1754480792115,
            "Source": "earnings"
        },
        {
            "Title": "Nila Spaces Awarded 1.3 Billion Rupee Construction Contract",
            "Summary": "Nila Spaces has awarded a construction contract worth 1.3 billion rupees to Riveria Infrastructures. The news indicates a significant business deal in the construction sector, potentially impacting Nila Spaces' operations and financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1749119883000,
            "Source": "default"
        },
        {
            "Title": "Nila Spaces Reports Improved Q3 EBITDA and Margin",
            "Summary": "Nila Spaces has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 91 million rupees, up from 73 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin saw a significant improvement, rising to 27.62% from 12.53% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738654500000,
            "Source": "earnings"
        }
    ]
}