{
    "Symbol": "NILAINFRA",
    "ISIN": "INE937C01029",
    "News": [
        {
            "Title": "Nila Infrastructures Board Meet on Jan 27 for Q3FY26",
            "Summary": "Nila Infrastructures Limited has scheduled its board meeting for January 27, 2026, to review and approve Q3FY26 financial results. Trading window closure announced.",
            "Sentiment": "neutral",
            "PublishDate": 1768915578449,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nila Infrastructures Reports Quarterly Results with Ongoing Income Tax Assessment Appeals",
            "Summary": "Nila Infrastructures Limited announced its unaudited standalone and consolidated financial results for the quarter and six months ended September 30, 2025. The Board of Directors approved these results at their meeting held on November 11, 2025. The company continues to face ongoing income tax assessment matters stemming from a search operation conducted by the Income Tax Department in September 2021. Assessment orders have been received for multiple years from 2014-15 to 2022-23, against which the company has filed appeals. The statutory auditors have issued an emphasis of matter in their review report highlighting that the final impact of these tax matters remains uncertain and currently not ascertainable. The company operates primarily in construction and development of infrastructure projects as a single operating segment.",
            "Sentiment": "neutral",
            "PublishDate": 1762847658571,
            "Source": "earnings"
        },
        {
            "Title": "Nila Infrastructures Secures ₹105 Crore Slum Rehabilitation Contract from Ahmedabad Municipal Corporation",
            "Summary": "Nila Infrastructures has won a ₹105 crore slum rehabilitation project from the Ahmedabad Municipal Corporation. The contract represents a significant business development for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1759890805501,
            "Source": "order&deals"
        },
        {
            "Title": "Nila Infrastructures Receives INR 12.75 Crore Sewage Treatment Plant Contract from Mahesana Municipal Corporation",
            "Summary": "Nila Infrastructures Limited received a Letter of Intimation from Mahesana Municipal Corporation for a sewage treatment plant project in Gujarat. The contract involves engineering, construction, commissioning, and 5-year operation and maintenance of a 2.0 MLD capacity Sewage Treatment Plant with 24x7 cloud-based monitoring. The project has a total value of INR 12.75 crores, with construction scheduled for 12 months followed by 5 years of operation and maintenance. The work falls under the company's regular business activities and involves no promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1757412886927,
            "Source": "stock"
        },
        {
            "Title": "Nila Infrastructures Ltd: Secures ₹63.52 Crore Order for Slum Redevelopment Project",
            "Summary": "Nila Infrastructures received a new work order worth ₹63.52 crore for finishing work on a slum rehabilitation project in Ahmedabad. The project, known as 'Ramapir no Tekro', includes construction of 1,694 residential flats. The order, awarded by Shree Infracon Private Limited, has a 10-month completion timeline with a 7-year operation and maintenance period.",
            "Sentiment": "positive",
            "PublishDate": 1742889899000,
            "Source": "order&deals"
        },
        {
            "Title": "Nila Infrastructures Secures Order Worth ₹64 Crore",
            "Summary": "Nila Infrastructures, a company with a market capitalization of ₹370 crore, has won a new order valued at ₹64 crore. This order represents a significant business development for the company, potentially boosting its project pipeline and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1742882516000,
            "Source": "order&deals"
        }
    ]
}