{
    "Symbol": "NILKAMAL",
    "ISIN": "INE310A01015",
    "News": [
        {
            "Title": "Nilkamal Reports 17.67% Growth in Q3 Net Profit",
            "Summary": "Nilkamal Limited posted consolidated net profit of 253 million rupees in Q3, marking a significant 17.67% year-on-year increase from 215 million rupees in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1770281148996,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nilkamal GST Appeal Dismissed, ₹37.37 Lakh Demand Upheld",
            "Summary": "Nilkamal Limited's GST appeal for FY 2019-20 dismissed by Ahmedabad Commissionerate, upholding ₹37.37 lakh demand including tax, interest and penalty. Company plans tribunal appeal.",
            "Sentiment": "negative",
            "PublishDate": 1769087499969,
            "Source": "stocks"
        },
        {
            "Title": "Nilkamal Limited Reports 5.46% Stake Acquisition",
            "Summary": "Seetha Kumari and PAC acquire 8,14,041 shares in Nilkamal Limited through off-market transfer, increasing total holding to 5.66% from 0.20% on December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766396015695,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nilkamal Limited: Madanlal Jain Disposes 5.46% Stake",
            "Summary": "Madanlal Jain disposed of his entire 8,14,041 shares (5.46% stake) in Nilkamal Limited through an off-market inter-se transfer by way of gift on December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766395695683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nilkamal Limited Receives Tax Demand Order of Rs. 7.22 Lakh from West Bengal CGST Authority",
            "Summary": "Nilkamal Limited received an order from the Office of The Superintendent of CGST Central Excise, Barjora Bankura, West Bengal, demanding Rs. 7,22,362 (including Rs. 3,61,181 in tax dues and Rs. 3,61,181 in penalty) for allegedly wrongly availing and utilizing Input Tax Credit for FY 2018-19 and FY 2019-20. The company plans to seek expert advice and file an appeal against the order, stating there is no material impact on its financial and operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1763639083593,
            "Source": "stock"
        },
        {
            "Title": "Nilkamal Reports Q2 Revenue Growth to 9.68 Billion Rupees",
            "Summary": "Nilkamal reported Q2 revenue of 9.68 billion rupees, up from 8.2 billion rupees in the same period last year. The company's consolidated net profit increased to 337 million rupees from 326 million rupees year-over-year. EBITDA rose to 880 million rupees compared to 774.2 million rupees in the previous year, though EBITDA margin declined slightly to 9.1% from 9.42%.",
            "Sentiment": "positive",
            "PublishDate": 1762416388450,
            "Source": "earnings"
        },
        {
            "Title": "Nilkamal's Furniture Division National Sales Manager Deepak S. Mehta Resigns",
            "Summary": "Deepak S. Mehta, National Sales Manager of Nilkamal's Furniture Division, has resigned from his position to explore new opportunities. His resignation will be effective from October 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759827997963,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nilkamal Limited Shareholders Approve Appointment of Gautam G. Chakravarti as Independent Director",
            "Summary": "Nilkamal Limited completed a postal ballot process for appointing Mr. Gautam G. Chakravarti as a Non-Executive Independent Director. The remote e-voting concluded on September 23, 2025, with shareholders passing the special resolution with requisite majority. Out of 14,922,525 total shares, 11,974,499 votes were polled representing 80.24% participation. The resolution received overwhelming support with 11,974,189 votes (99.9974%) in favor and only 310 votes (0.0026%) against. The voting period ran from August 25 to September 23, 2025, with 22,660 members eligible to vote as of the August 15, 2025 record date. Scrutinizer Mr. Bhaskar Upadhyay certified the results on September 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758702868373,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nilkamal Limited Reports Q1 FY26 Results and Appoints New Independent Director",
            "Summary": "Nilkamal Limited announced its quarterly results for the period ended June 30, 2025, with standalone revenue of ₹864 crores, representing 19% growth. The company's Business to Business segment grew 19% in value and 22% in volume terms, while the Retail & E-commerce segment grew 15%. Standalone profit before tax stood at ₹13 crores and profit after tax at ₹10 crores. On consolidated basis, net sales reached ₹883 crores with PAT of ₹15 crores. The Board also appointed Mr. Gautam G. Chakravarti as Additional Independent Director for a five-year term, subject to shareholder approval. The company operates through two main segments - Business to Business (₹773 crores) and Retail (₹92 crores). Net borrowing increased to ₹331 crores as of June 30, 2025, compared to ₹173 crores in the previous year. CARE Ratings reaffirmed the company's long-term rating as CARE AA Stable.",
            "Sentiment": "positive",
            "PublishDate": 1753789631931,
            "Source": "earnings"
        },
        {
            "Title": "Nilkamal Signs Deal to Acquire Healthcare Furniture Business",
            "Summary": "Nilkamal has signed an agreement to purchase the healthcare furniture business from Imedfurns Pvt. Ltd. This acquisition represents a strategic move for Nilkamal into the healthcare furniture sector.",
            "Sentiment": "positive",
            "PublishDate": 1752502391000,
            "Source": "default"
        },
        {
            "Title": "Nilkamal Reports Q4 Results and Announces Dividend",
            "Summary": "Nilkamal has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit was 341 million rupees, down from 355 million rupees year-over-year. Revenue increased to 8.94 billion rupees from 8.34 billion rupees in the same period last year. EBITDA rose to 852 million rupees from 815 million rupees, although the EBITDA margin slightly decreased to 9.53% from 9.77%. The company has recommended a dividend of 20 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747234471000,
            "Source": "result"
        },
        {
            "Title": "Nilkamal Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Nilkamal, a company, has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 634 million rupees from 728 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 7.42% from 9.06% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738745850000,
            "Source": "earnings"
        },
        {
            "Title": "Nilkamal Reports Q3 Revenue Growth",
            "Summary": "Nilkamal, a company known for its furniture and storage solutions, has reported a revenue of 8.5 billion rupees for the third quarter, compared to 8 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738745773000,
            "Source": "earnings"
        },
        {
            "Title": "Nilkamal Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Nilkamal, a company known for its furniture and material handling products, has reported a consolidated net profit of 216 million rupees for the third quarter, down from 293 million rupees in the same period last year. This represents a year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1738745749000,
            "Source": "earnings"
        },
        {
            "Title": "Nilkamal Reports Improved Q2 EBITDA and Margin",
            "Summary": "Nilkamal, an Indian company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 774.2 million rupees, up from 618 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 9.42% from 7.97% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730101867000,
            "Source": "result"
        },
        {
            "Title": "Nilkamal Reports Q2 Revenue Growth",
            "Summary": "Nilkamal, an Indian company, has reported its second quarter revenue for the current fiscal year. The company's revenue increased to 8.2 billion rupees, up from 7.7 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730101789000,
            "Source": "result"
        },
        {
            "Title": "Nilkamal Reports 30.4% Increase in Q2 Consolidated Net Profit",
            "Summary": "Nilkamal, an Indian company, has reported a consolidated net profit of 326 million rupees for the second quarter, up from 250 million rupees in the same period last year. This represents a year-over-year increase of 30.4%.",
            "Sentiment": "positive",
            "PublishDate": 1730101765000,
            "Source": "result"
        }
    ]
}