{
    "Symbol": "NINSYS",
    "ISIN": "INE395U01014",
    "News": [
        {
            "Title": "NINtec Systems: Two Independent Directors Resign",
            "Summary": "NINtec Systems Limited announces resignation of Independent Directors Mr. Vishal Ramesh Shah and Mr. Hursh Pareshkumar Jani effective from 12th February, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770900448293,
            "Source": "stocks"
        },
        {
            "Title": "NINtec Systems Appoints Two Independent Directors",
            "Summary": "NINtec Systems Limited's board approved the appointment of Mehul Ganpatbhai Makkampara and Rahul Ratankumar Guhathakurta as Additional Directors (Non-Executive Independent) for a five-year term starting February 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769599583402,
            "Source": "stocks"
        },
        {
            "Title": "Rachana Niraj Gemawat and Associates Acquire 2.85% Stake in Nintec Systems",
            "Summary": "Rachana Niraj Gemawat along with persons acting in concert including Niraj Gemawat, Chhaganraj Gemawat, Sumanlata Gemawat, Indrajeet Mitra, Ketki Mitra and VINIT Solutions LLP acquired 5,30,000 equity shares representing 2.85% stake in Nintec Systems Limited through open market transactions on November 21, 2025. The acquisition brings their total holding to 2.85% of the company's total share capital of 1,85,76,000 equity shares of Rs. 10 each, with the disclosure made under SEBI takeover regulations.",
            "Sentiment": "positive",
            "PublishDate": 1763739004071,
            "Source": "corporate_action"
        },
        {
            "Title": "Nintec Systems Reports Strong Q2 Performance with Revenue Growth and Improved Profitability",
            "Summary": "Nintec Systems Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 2,338.66 lakhs for the quarter, with profit after tax of Rs. 665.33 lakhs. For the six-month period, standalone revenue reached Rs. 4,138.35 lakhs with profit after tax of Rs. 1,083.15 lakhs. On a consolidated basis, quarterly revenue was Rs. 4,251.83 lakhs with profit after tax of Rs. 817.38 lakhs, while half-yearly consolidated revenue stood at Rs. 8,374.55 lakhs with profit after tax of Rs. 1,625.68 lakhs. The consolidated results include contributions from subsidiary Nintec Systems B.V., Netherlands, which reported quarterly revenues of Rs. 1,651.83 lakhs and net profit of Rs. 120.68 lakhs. The Board of Directors approved these results at their meeting held on November 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762980942635,
            "Source": "earnings"
        },
        {
            "Title": "Nintec Systems Reports 21.5% Growth in Net Profit for Q2",
            "Summary": "Nintec Systems reported consolidated net profit of 79 million rupees for Q2, representing growth from 65 million rupees in the same quarter last year. The company's revenue increased to 417 million rupees compared to 339 million rupees year-over-year, marking a 23% revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1762963352528,
            "Source": "earnings"
        },
        {
            "Title": "Nintec Systems Reports 35% Jump in Q1 Net Profit to 77 Million Rupees",
            "Summary": "Nintec Systems reported consolidated net profit of 77 million rupees for Q1, representing a year-over-year increase from 57 million rupees. The company's Q1 revenue reached 388 million rupees, up from 329 million rupees in the same period last year. Both profit and revenue figures show growth compared to the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754998985645,
            "Source": "earnings"
        },
        {
            "Title": "NINTEC SYSTEMS Reports Strong Q3 Financial Results",
            "Summary": "NINTEC SYSTEMS has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 60.5 million rupees, up from 34 million rupees in the same quarter last year. Revenue also saw a notable rise, reaching 213 million rupees compared to 175 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739372202000,
            "Source": "earnings"
        }
    ]
}