{
    "Symbol": "NIPPOBATRY",
    "ISIN": "INE567A01028",
    "News": [
        {
            "Title": "Indo National Acquires 54.79% Stake in Medcuore Medical",
            "Summary": "Indo National Limited invested ₹6.94 crores to acquire 54.79% stake in Medcuore Medical Solutions Private Ltd, making it a subsidiary. The acquisition expands into air monitoring systems and purifiers business.",
            "Sentiment": "positive",
            "PublishDate": 1769077736993,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indo National Appoints S R Aravind Kumar as CFO",
            "Summary": "Indo National Ltd announced the appointment of Mr. S R Aravind Kumar as Chief Financial Officer effective January 14, 2026, following board approval based on committee recommendations.",
            "Sentiment": "positive",
            "PublishDate": 1768376853944,
            "Source": "stocks"
        },
        {
            "Title": "Indo National CFO C R Sivaramakrishnan Retires",
            "Summary": "Indo National Limited announces retirement of Chief Financial Officer Mr. C R Sivaramakrishnan effective December 31, 2025, after valuable tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1767179202310,
            "Source": "stocks"
        },
        {
            "Title": "Indo National Limited's Amalgamation Scheme Proceeds with NCLT Approval for Next Hearing",
            "Summary": "The National Company Law Tribunal Chennai Bench heard Indo National Limited's amalgamation scheme with Helios Strategic Systems Limited on December 10, 2025, with the Official Liquidator recording no objections to the proposed merger. The tribunal has scheduled the petition for further consideration and hearing on January 13, 2026, advancing the amalgamation process under the Companies Act 2013.",
            "Sentiment": "positive",
            "PublishDate": 1765365811815,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo National Limited's Amalgamation Scheme Hearing Progresses at NCLT Chennai",
            "Summary": "The National Company Law Tribunal Chennai Bench conducted a hearing on December 3, 2025, regarding the amalgamation scheme between Helios Strategic Systems Limited and Indo National Limited, noting that statutory authority reports have been filed and accepted. The tribunal has scheduled the next hearing for December 10, 2025, as the merger process continues through regulatory approval stages.",
            "Sentiment": "neutral",
            "PublishDate": 1765194132857,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo National Limited Appoints Shardul Bist as Chief Marketing Officer",
            "Summary": "Indo National Limited has appointed Shardul Bist as Chief Marketing Officer effective October 27, 2025. Bist brings over 16 years of experience in marketing and e-commerce, having previously worked with companies including USV Consumer, Mother Dairy, and Modi Naturals. He holds a PGDM in Brand Communication from Mudra Institute of Communication, Ahmedabad, and a BBA from Indraprastha University, New Delhi. In his previous role as Head Marketing at USV Private Ltd, and earlier as Category Head at Mother Dairy handling marketing for value-added products, his marketing campaigns were recognized among the top 100 campaigns by Brand Equity.",
            "Sentiment": "positive",
            "PublishDate": 1761568997417,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Chennai Grants Two-Week Timeline for Statutory Reports on Helios-Indo National Merger",
            "Summary": "The National Company Law Tribunal Chennai Bench conducted a hearing on September 17, 2025 regarding the Scheme of Amalgamation between Helios Strategic Systems Limited and Indo National Limited. The tribunal granted statutory authorities including Regional Director, Registrar of Companies, Official Liquidator and Income Tax department a two-week timeline to submit their reports for representation or objections regarding the merger approval. The next hearing has been scheduled for October 29, 2025. The amalgamation scheme is being processed under Section 230-232 of the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1758197723658,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo National Limited Notifies Statutory Authorities of Amalgamation Scheme with Helios Strategic Systems Limited",
            "Summary": "Indo National Limited has served notice to statutory authorities regarding its scheme of amalgamation with Helios Strategic Systems Limited, following an order from the National Company Law Tribunal, Chennai Bench dated August 01, 2025. The notice was served on August 12, 2025, to multiple authorities including the Regional Director Southern Region, Registrar of Companies Chennai, National Stock Exchange of India, BSE Limited, Income Tax Department, and Official Liquidator. These authorities have been given 30 days from receipt of the notice to submit any representations to the tribunal regarding the amalgamation scheme. The scheme involves Indo National Limited as the transferee company and Helios Strategic Systems Limited as the transferor company, proceeding under Sections 230-232 of the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1755494150592,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo National Limited Sets Book Closure Dates for 52nd AGM and Dividend Payment",
            "Summary": "Indo National Limited announced that its Register of Members and Share Transfer Books will remain closed from September 20, 2025, to September 26, 2025. The record date is set for September 19, 2025. The book closure is for the purpose of the company's 52nd Annual General Meeting and dividend payment, which is subject to shareholder approval. The company's stock symbol is NIPPOBATRY and trades as equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1754991774582,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo National Limited Reports 60% YoY Growth in Q1 Profit Before Tax, Approves Key Management Reappointments",
            "Summary": "Indo National Limited announced quarterly results for the period ended June 30, 2025, with standalone profit before tax rising 60% year-on-year to Rs 1.74 crore. Revenue from operations increased 6.97% to Rs 119.44 crore compared to Rs 111.66 crore in the same quarter last year. The Board approved reappointment of P. Dwaraknath Reddy as Managing Director and Aditya Reddy as Joint Managing Director for five years from October 1, 2025 to September 30, 2030, subject to shareholder approval. BLN Prasad was appointed as Additional Non-executive Non-independent Director. The company made strategic investments totaling Rs 1,203.69 lakhs, including acquiring 32.87% stake in Medcuore Medical Solutions Private Limited for Rs 353.69 lakhs and investing Rs 850 lakhs in Compulsorily Convertible Preference Shares of Axial Aero Private Limited. The Board also approved alterations to the Articles of Association regarding director retirement by rotation, pending shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754988894140,
            "Source": "earnings"
        },
        {
            "Title": "NCLT Sets September 17, 2025 Hearing Date for Indo National-Helios Strategic Systems Merger",
            "Summary": "The National Company Law Tribunal Chennai has scheduled a hearing for September 17, 2025, regarding the amalgamation scheme between Helios Strategic Systems Limited and Indo National Limited. The NCLT passed an order on August 01, 2025, admitting the company scheme petition for hearing. The tribunal has directed notices to be sent to various regulatory authorities including the Central Government, RBI, SEBI, BSE, NSE, and income tax authorities, who have 30 days to file representations. The Chairman's report dated June 23, 2025, shows that shareholders and creditors have approved the proposed scheme. The tribunal has also mandated publication of notices in Business Standard and Makkal Kural newspapers.",
            "Sentiment": "neutral",
            "PublishDate": 1754482613802,
            "Source": "corporate_action"
        },
        {
            "Title": "Indo National Ltd Shareholders Approve Appointment of Ms. Suneeta Reddy as Director",
            "Summary": "Indo National Ltd completed a postal ballot process for the appointment of Ms. Suneeta Reddy (DIN: 00001873) as Non-Executive Non-Independent Director. The ordinary resolution was passed with 99.79% votes in favor, with 4,102,582 votes supporting and 8,493 votes against. The remote e-voting period ran from June 20 to July 19, 2025, with 54.81% of total shareholders participating. M. Damodaran of M Damodaran & Associates LLP served as scrutinizer for the process. The company has 7.5 million total shares outstanding, and the promoter group showed complete support for the resolution.",
            "Sentiment": "positive",
            "PublishDate": 1753161005634,
            "Source": "corporate_governance"
        },
        {
            "Title": "Indo National: Q3 FY25 Results Show Significant Loss and Revenue Decline",
            "Summary": "Indo National reported a loss of ₹12.07 crore in Q3 FY25, compared to a profit of ₹3.44 crore in Q3 FY24. Revenue decreased by 27.74% year-over-year to ₹121.63 crore. Operating income fell by 261.05% YoY, and EPS dropped to ₹-16.09.",
            "Sentiment": "negative",
            "PublishDate": 1738303594000,
            "Source": "earnings"
        }
    ]
}