{
    "Symbol": "NIRAJ",
    "ISIN": "INE368I01016",
    "News": [
        {
            "Title": "Niraj Cement Wins ₹230.06 Cr Railway Orders",
            "Summary": "Niraj Cement Structurals Limited secured two major work orders worth ₹230.06 crores from Northeast Frontier Railway for bridge construction and infrastructure development projects.",
            "Sentiment": "positive",
            "PublishDate": 1768823963300,
            "Source": "co_actions_results"
        },
        {
            "Title": "Niraj Cement Wins ₹46.52 Cr Railway Contract",
            "Summary": "Niraj Cement Structurals Limited secures major infrastructure order from Western Railway for quadrupling project between Gandhidham-Adipur with 18-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767964428734,
            "Source": "co_actions_results"
        },
        {
            "Title": "NIRAJ Cement Wins ₹465.2 Cr Railway Contract",
            "Summary": "NIRAJ Cement Structurals secures major infrastructure contract worth ₹465.20 million from Western Railway, marking significant business development for the cement company.",
            "Sentiment": "positive",
            "PublishDate": 1767964002899,
            "Source": "co_actions_results"
        },
        {
            "Title": "Niraj Cement Structurals Wins ₹348.6 Cr MMRDA Order",
            "Summary": "Niraj Cement Structurals secures significant infrastructure order worth ₹348.6 million from Mumbai Metropolitan Region Development Authority, strengthening its project portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767009993998,
            "Source": "co_actions_results"
        },
        {
            "Title": "Niraj Cement Structurals Wins ₹322.27 Cr Contract",
            "Summary": "Niraj Cement Structurals secures major contract worth ₹322.27 crores, significantly exceeding its current market capitalization of ₹221.29 crores, marking substantial business development.",
            "Sentiment": "positive",
            "PublishDate": 1766060551794,
            "Source": "co_actions_results"
        },
        {
            "Title": "Niraj Cement Wins ₹131 Cr PWD Road Project",
            "Summary": "Niraj Cement Structurals secures updated infrastructure contract from Public Works Department for road improvement and maintenance works in Assam with revised market cap at ₹216 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765883892968,
            "Source": "co_actions_results"
        },
        {
            "Title": "Niraj Cement Structurals Secures Rs 82.66 Crore Infrastructure Contract from MMRDA",
            "Summary": "Niraj Cement Structurals Limited received a work order worth Rs 82.66 crores including GST from Mumbai Metropolitan Region Development Authority (MMRDA) for providing connectivity from SGMC monorail station to Mahalaxmi metro and suburban station through FOB with Travellator. The domestic infrastructure project is scheduled to be executed within 12 months, representing a significant contract win for the engineering and construction company.",
            "Sentiment": "positive",
            "PublishDate": 1764843949545,
            "Source": "order&deals"
        },
        {
            "Title": "Niraj Cement Structurals Secures Rs. 81.52 Crore Railway Infrastructure Contract",
            "Summary": "Niraj Cement Structurals Limited received a Rs. 81.52 crore contract from Northeast Frontier Railway for construction of bridges, underpasses, and railway infrastructure in the elephant corridor area between Azara and Kamakhya stations. The project involves building multiple span PSC slab underpasses, major bridge, retaining walls, and embankment work as part of the New Bongaigaon-Goalpara Town-Kamakhya railway doubling project, with an 18-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1764841879510,
            "Source": "order&deals"
        },
        {
            "Title": "Niraj Cement Structurals Secures ₹220 Crore Work Order",
            "Summary": "Niraj Cement Structurals has received a work order valued at ₹220 crores. The order value exceeds the company's current market capitalization of ₹214 crores, representing a significant business win for the cement structurals company.",
            "Sentiment": "positive",
            "PublishDate": 1764028953587,
            "Source": "order&deals"
        },
        {
            "Title": "Niraj Cement Structurals Secures Rs 19.57 Crore Railway Infrastructure Contract from MCGM",
            "Summary": "Niraj Cement Structurals Limited received a work order worth Rs 19.57 crores including GST from Municipal Corporation of Greater Mumbai for reconstruction of approaches at Sion Railway Station ROB at km 12.995. The domestic infrastructure contract is to be executed within 18 months, representing a significant project win for the cement and construction company.",
            "Sentiment": "positive",
            "PublishDate": 1763467325495,
            "Source": "stock"
        },
        {
            "Title": "Niraj Cement Structurals Secures ₹195.7 Million Work Order",
            "Summary": "Niraj Cement Structurals has secured a new work order worth ₹195.7 million. This contract win represents new business for the company and could contribute to its revenue pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1763467067465,
            "Source": "stock"
        },
        {
            "Title": "Niraj Cement Structural Secures 505 Million Rupee Order",
            "Summary": "Niraj Cement Structural has received a significant order worth 505 million rupees. This substantial contract award represents a notable business development for the cement company.",
            "Sentiment": "positive",
            "PublishDate": 1763466068309,
            "Source": "stock"
        },
        {
            "Title": "Niraj Cement Structurals Reports No Deviation in Fund Utilization from Preferential Issue",
            "Summary": "Niraj Cement Structurals Limited confirmed no deviation in the use of funds raised through Preferential Issue of Equity Shares and Convertible Warrants for the quarter ended September 30, 2025. The company utilized Rs. 103.56 crores across working capital requirements, subsidiary investment, and general corporate purposes as originally planned, with proportional cost reductions due to under-subscription.",
            "Sentiment": "neutral",
            "PublishDate": 1763068112946,
            "Source": "corporate_action"
        },
        {
            "Title": "Niraj Cement Structurals Reports Strong Q2 FY26 Performance with Net Profit of Rs 1,027.36 Lakhs",
            "Summary": "Niraj Cement Structurals Limited posted a net profit of Rs 1,027.36 lakhs for the half year ended September 30, 2025, compared to Rs 485.07 lakhs in the previous year, with basic earnings per share at Rs 1.72. The Board approved unaudited standalone and consolidated financial results at their meeting on November 13, 2025, with statutory auditors issuing an unmodified review report.",
            "Sentiment": "positive",
            "PublishDate": 1763041429001,
            "Source": "earnings"
        },
        {
            "Title": "Niraj Cement Structurals Reports Quarterly Financial Results",
            "Summary": "Niraj Cement Structurals Limited published its un-audited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported total income of ₹97.32 crores for the quarter compared to ₹84.09 crores in the same quarter last year. Net profit after tax stood at ₹1.10 crores versus ₹0.81 crores in the previous year quarter. For the full year, total income was ₹513.27 crores compared to ₹513.47 crores in the previous year. Annual net profit after tax was ₹15.22 crores versus ₹15.08 crores in the prior year. Earnings per share for the quarter was ₹0.18 compared to ₹0.20 in the same quarter last year. The results were published in Financial Express and Mumbai Lakshdeep newspapers on August 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755242195629,
            "Source": "earnings"
        },
        {
            "Title": "Niraj Cement Structurals Reports Complete Utilization of Rs 103.56 Crore Preferential Issue Proceeds",
            "Summary": "Niraj Cement Structurals Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing complete utilization of Rs 103.56 crore raised through preferential issue of equity shares and warrants. CARE Ratings Limited, the monitoring agency, reported that all funds have been deployed across three objectives: Rs 29.31 crore for working capital requirements, Rs 48.37 crore for subsidiary investment, and Rs 25.88 crore for general corporate purposes. The issue was undersubscribed, reducing the original target from Rs 132.77 crore to Rs 103.56 crore. The company invested Rs 5.50 crore in joint venture 'Niraj-Mason JV' under general corporate purposes, which was approved by the board on May 22, 2025. The monitoring agency noted that during Q4FY25, the company had temporarily parked Rs 10 crore in Portfolio Management Services, which was not aligned with interim use guidelines, though these funds were subsequently transferred back to the monitoring account. No deviations from stated objectives were reported, and all completion targets were met ahead of the March 31, 2027 deadline.",
            "Sentiment": "neutral",
            "PublishDate": 1755103877513,
            "Source": "corporate_action"
        },
        {
            "Title": "Niraj Cement Structurals Reports Q1 FY2026 Results, Appoints New Auditor and Schedules AGM",
            "Summary": "Niraj Cement Structurals Limited approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 8,230.81 lakhs and net profit of Rs. 109.53 lakhs for the quarter. On a consolidated basis, revenue from operations was Rs. 8,260.75 lakhs with net profit of Rs. 99.87 lakhs. The Board appointed M/s. Abhay Kumar Pal & Co. as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company scheduled its 27th Annual General Meeting for September 29, 2025, to be conducted via video conferencing. The Register of Members and Share Transfer Books will remain closed from September 21-28, 2025. The statutory auditors issued an unmodified review report for the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1755100929370,
            "Source": "earnings"
        },
        {
            "Title": "Niraj Cements Receives Trading Approval for 3.3 Million Preferential Shares",
            "Summary": "Niraj Cements has obtained trading approval for 3.3 million shares that were issued preferentially. This indicates a successful completion of a preferential allotment process and the subsequent approval for these shares to be traded on the stock market.",
            "Sentiment": "positive",
            "PublishDate": 1751028493000,
            "Source": "default"
        },
        {
            "Title": "Niraj Cement Structurals JV Secures 1.15 Billion Rupee NHAI Contract",
            "Summary": "Niraj Cement Structurals has announced that its joint venture, SPPL JV, has been awarded a work order from the National Highways Authority of India (NHAI) valued at 1.15 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743466459000,
            "Source": "order&deals"
        },
        {
            "Title": "NIRAJ CEMENT STRUCTURALS JV Secures 1.15 Billion Rupee Contract from NHAI",
            "Summary": "NIRAJ CEMENT STRUCTURALS has announced that its joint venture, SPPL JV, has been awarded a work order from the National Highways Authority of India (NHAI) valued at 1.15 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743164547000,
            "Source": "order&deals"
        },
        {
            "Title": "Niraj Cement Structurals Secures 2.69 Billion Rupee Order",
            "Summary": "Niraj Cement Structurals has received a significant order worth 2.69 billion rupees (approximately $32.5 million USD). This substantial contract is likely to have a positive impact on the company's financial performance and business outlook.",
            "Sentiment": "positive",
            "PublishDate": 1742170401000,
            "Source": "order&deals"
        },
        {
            "Title": "Niraj Cement Structurals Secures 2.69 Billion Rupee Order",
            "Summary": "Niraj Cement Structurals has announced that it has received an order worth 2.69 billion rupees (approximately $32.5 million USD). This significant contract is likely to boost the company's revenue and potentially improve its market position in the construction and infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1741864694000,
            "Source": "order&deals"
        }
    ]
}