{
    "Symbol": "NITCO",
    "ISIN": "INE858F01012",
    "News": [
        {
            "Title": "Nitco Limited Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Nitco Limited has scheduled a board meeting on February 12, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769080690655,
            "Source": "co_actions_results"
        },
        {
            "Title": "NITCO Appoints New CFO and Company Secretary",
            "Summary": "NITCO Limited announces key leadership changes with Bikash Jain as CFO and Rupali Swami Kambli as Company Secretary, effective January 16, 2026, following Geeta Shah's resignation.",
            "Sentiment": "neutral",
            "PublishDate": 1768399200513,
            "Source": "stocks"
        },
        {
            "Title": "NITCO Appoints New CFO and Company Secretary",
            "Summary": "NITCO Limited announces key leadership changes with Bikash Jain as CFO and Rupali Swami Kambli as Company Secretary, effective January 16, 2026, following Geeta Shah's resignation due to relocation.",
            "Sentiment": "neutral",
            "PublishDate": 1768398755760,
            "Source": "stocks"
        },
        {
            "Title": "NITCO CFO Sitanshu Satapathy Resigns Effective Jan 13",
            "Summary": "NITCO Limited announces resignation of Chief Financial Officer Sitanshu Satapathy effective January 13, 2026, citing future plans of self-engagement as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768312776750,
            "Source": "stocks"
        },
        {
            "Title": "NITCO Reports 85% Monthly Sales Growth",
            "Summary": "NITCO demonstrates strong business momentum with an impressive 85% increase in sales compared to the previous month, highlighting significant growth in the tiles and building materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1767968072804,
            "Source": "stocks"
        },
        {
            "Title": "NITCO Limited Reports 85% Sales Growth in December 2025",
            "Summary": "NITCO Limited, a tiles, marble, and mosaic company, achieved approximately 85% sales growth in December 2025 compared to January 2025, driven by higher customer demand and operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1767954407152,
            "Source": "stocks"
        },
        {
            "Title": "NITCO Sets Ambitious Cash Flow Target of Over Rs 1,000 Crores",
            "Summary": "NITCO has announced its goal to generate cash flow exceeding Rs 1,000 crores within a 3-5 year timeframe. The company's ambitious target reflects its growth strategy and financial planning objectives for the medium term.",
            "Sentiment": "positive",
            "PublishDate": 1764127380069,
            "Source": "stock"
        },
        {
            "Title": "NITCO Limited Submits Q2 FY2026 Corporate Presentation Showing Strong Revenue Growth",
            "Summary": "NITCO Limited filed its Q2 FY2026 corporate presentation with stock exchanges, revealing 64% year-on-year revenue growth to INR 107 crores and 91% growth in H1 FY2026. The tiles, marble and mosaic manufacturer projects 44% revenue growth for FY2026 versus FY2025, supported by debt restructuring and working capital infusion from financial partner Authum Investment Infrastructure Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1764080085856,
            "Source": "corporate_action"
        },
        {
            "Title": "NITCO Limited Reports Quarterly Results with Asset Impairment Reversal and ESOP Implementation",
            "Summary": "NITCO Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reversed an impairment provision of Rs. 1,650 lakhs on its Alibaug factory assets after receiving a higher scrap sale offer of Rs. 3,250 lakhs compared to the initial estimate of Rs. 1,600 lakhs. The assets have been reclassified as 'held for sale' with a binding disposal contract. The Board implemented an Employee Stock Option Plan, granting 9,88,000 stock options at Rs. 25 per option to employees, recognizing an ESOP cost of Rs. 637.42 lakhs. The company continues to face a penalty of Rs. 17,000 lakhs from ADGFT for export obligation non-fulfillment, which has been challenged in Bombay High Court. NITCO has ongoing real estate development projects including a Joint Development Agreement for Alibaug land and property transactions in Kanjurmarg and Thane.",
            "Sentiment": "neutral",
            "PublishDate": 1762944739445,
            "Source": "earnings"
        },
        {
            "Title": "NITCO Reports Revenue Growth to 1.1B Rupees Despite EBITDA Loss in Q2",
            "Summary": "NITCO reported Q2 revenue of 1.1 billion rupees compared to 660 million rupees in the same period last year. The company posted an EBITDA loss of 137 million rupees versus a loss of 127 million rupees year-over-year. However, NITCO achieved a consolidated net profit of 9.4 million rupees, marking a significant turnaround from a net loss of 346 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762940864464,
            "Source": "earnings"
        },
        {
            "Title": "NITCO Limited Allots 56,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "NITCO Limited has allotted 56,000 equity shares of face value ₹10 each following the exercise of Employee Stock Options under the NITCO-Employee Stock Option Plan 2019. The allotment was approved by the Board of Directors through a circular resolution dated October 31, 2025. The options were originally granted on April 3, 2019, to an eligible grantee who retired from the company in 2020. The exercise generated ₹22,14,800 in proceeds at an exercise price of ₹39.55 per share. Following this allotment, the company's issued, subscribed and paid-up equity share capital increased from ₹379,06,01,050 to ₹379,11,61,050, with total equity shares now standing at 22,91,16,105. The diluted earnings per share pursuant to this share issuance is 1.94. The newly allotted shares rank pari-passu with existing equity shares and are identical in all respects.",
            "Sentiment": "neutral",
            "PublishDate": 1761931769772,
            "Source": "corporate_action"
        },
        {
            "Title": "NITCO Limited Reports 114% Revenue Surge in Q1 FY2025-26 Driven by Alibaug Land Deal",
            "Summary": "NITCO Limited reported consolidated revenue from operations of Rs.150.22 crore for the quarter ended June 30, 2025, representing a 114% increase from Rs.70.22 crore in the same quarter last year. The company achieved consolidated profit after tax of Rs.47.46 crore, compared to a loss of Rs.43.52 crore in Q1 FY2024-25. The revenue boost was primarily driven by Rs.58.42 crore from a Joint Development Agreement for its Alibaug land parcel, received as an Interest Free Adjustable Advance. The tiles and related products segment generated Rs.91.27 crore in revenue, up 31% from Rs.69.66 crore in Q1 last year. Chairman & Managing Director Vivek Talwar stated the results mark a strong start to the financial year and expressed confidence in sustaining growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1755184377323,
            "Source": "earnings"
        },
        {
            "Title": "NITCO Limited's Head of Human Resources Mr. Jyoti Ranjan Retires",
            "Summary": "Mr. Jyoti Ranjan, Head of Human Resources and Senior Management Personnel at NITCO Limited, retired from the company on August 14, 2025. His retirement was effective from the close of business hours on that date, and he ceased to be a Senior Management Personnel of the company. The retirement was announced by Chairman & Managing Director Vivek Talwar.",
            "Sentiment": "neutral",
            "PublishDate": 1755181098901,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nitco Limited Appoints Ajeet Singh as Senior General Manager for Tiles Division Sales",
            "Summary": "Nitco Limited appointed Ajeet Singh as Senior General Manager - Sales for its Tiles Division, effective August 11, 2025. Singh brings over 22 years of experience in sales and business development, holding a Bachelor's degree in Commerce from Delhi University and an MBA from IBSAR. He has also completed Digital Marketing Certification from MICA and a Senior Management Program from IIM-Kozhikode. The company expects Singh's appointment to drive stronger sales performance, enhance customer engagement, and support deeper market penetration for the Tiles Division. He will report to the President - Operations.",
            "Sentiment": "positive",
            "PublishDate": 1755080416806,
            "Source": "stock"
        },
        {
            "Title": "NITCO Reports Strong Q1 Turnaround with 475M Rupees Net Profit",
            "Summary": "NITCO delivered a significant turnaround in its quarterly results, reporting a consolidated net profit of 475 million rupees compared to a loss of 435 million rupees in the same period last year. The company's revenue more than doubled to 1.5 billion rupees from 702 million rupees year-over-year. EBITDA swung to a gain of 496 million rupees from a loss of 108 million rupees, with the EBITDA margin reaching 32.29%.",
            "Sentiment": "positive",
            "PublishDate": 1754923211089,
            "Source": "earnings"
        },
        {
            "Title": "NITCO Signs Land Development Agreement with Total Environment Building Systems",
            "Summary": "NITCO has entered into an agreement with Total Environment Building Systems for land development in Alibaug. The company anticipates revenue of ₹350 crores over a period of 3 years from this project.",
            "Sentiment": "positive",
            "PublishDate": 1751016561000,
            "Source": "default"
        },
        {
            "Title": "NITCO Receives Additional ₹45 Crore Tile Order from Prestige Estates",
            "Summary": "NITCO has received an additional tile order worth ₹45 crore from Prestige Estates. This new order increases the total order value to ₹261 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750649772000,
            "Source": "default"
        },
        {
            "Title": "NITCO Reports Q4 Financial Results",
            "Summary": "NITCO has announced its Q4 consolidated financial results. The company reported a net loss of 29 million rupees, which is an improvement from the 549 million rupee loss in the same quarter last year. However, it's a significant decline from the previous quarter's loss of 6.6 billion rupees. The company's revenue for Q4 increased to 935 million rupees, up from 718 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746191844000,
            "Source": "result"
        },
        {
            "Title": "Nitco Secures Major Order from Prestige Estates",
            "Summary": "Nitco, a company in the construction or building materials sector, has received orders worth 1.11 billion rupees from Prestige Estates, a prominent real estate developer. This significant order suggests a positive business development for Nitco and potentially indicates ongoing construction activity by Prestige Estates.",
            "Sentiment": "positive",
            "PublishDate": 1746144709000,
            "Source": "default"
        },
        {
            "Title": "NITCO Secures 1.11 Billion Rupee Order from Prestige Estates",
            "Summary": "NITCO, a company likely in the construction or materials sector, has received orders worth 1.11 billion rupees from Prestige Estates, a prominent real estate developer. This significant order suggests a potential boost in NITCO's business operations and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1746027109000,
            "Source": "default"
        },
        {
            "Title": "NITCO Approves Sale of Wind Energy Business",
            "Summary": "NITCO has approved the sale of its wind energy business to Siva Green Energy for a consideration of 63 million rupees. This decision represents a significant corporate action that will impact the company's asset portfolio and potentially its future business strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1739372232000,
            "Source": "corporate_action"
        },
        {
            "Title": "NITCO Reports Increased Q3 Net Loss and Slight Revenue Growth",
            "Summary": "NITCO has reported a significant increase in its consolidated net loss for the third quarter, rising to 6.6 billion rupees from 451 million rupees in the same period last year. However, the company's revenue showed a modest improvement, increasing to 846 million rupees from 805 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739363138000,
            "Source": "earnings"
        },
        {
            "Title": "NITCO Secures 500 Million Rupee Order from Hindustan Associates",
            "Summary": "NITCO, a company in the construction or manufacturing sector, has obtained a significant order worth 500 million rupees from Hindustan Associates. This order represents a substantial business opportunity for NITCO and could potentially boost its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1736945086000,
            "Source": "order&deals"
        },
        {
            "Title": "NITCO Secures Major Order from Prestige Group",
            "Summary": "NITCO has received an order worth 1.05 billion rupees from Prestige Group. The order size is expected to potentially increase to 2.10 billion rupees in the future.",
            "Sentiment": "positive",
            "PublishDate": 1734521904000,
            "Source": "order&deals"
        },
        {
            "Title": "Nitco Ltd: Secures ₹105.40 Crore Order from Prestige Estates Projects",
            "Summary": "Nitco Ltd received a new order worth ₹105.40 crore from Prestige Estates Projects for supplying tiles, marble, and mosaic over six months. The company anticipates additional orders worth ₹104 crore from Prestige Estates Projects in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1734411382000,
            "Source": "order&deals"
        },
        {
            "Title": "NITCO Secures Significant Orders Worth 2.09 Billion Rupees",
            "Summary": "NITCO has received an order worth 1.05 billion rupees and anticipates receiving additional orders worth 1.04 billion rupees from Prestige Estates. This totals to potential orders of 2.09 billion rupees, indicating a significant business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1734352658000,
            "Source": "order&deals"
        },
        {
            "Title": "NITCO Reports Increased Q2 EBITDA Loss",
            "Summary": "NITCO, a company likely in the manufacturing or industrial sector, has reported a significant increase in its Q2 EBITDA loss. The loss has grown from 22 million rupees in the previous year to 127 million rupees in the current quarter, indicating a substantial deterioration in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1731489006000,
            "Source": "result"
        },
        {
            "Title": "NITCO Reports Increased Q2 Net Loss and Decreased Revenue",
            "Summary": "NITCO, a company, has reported its Q2 financial results. The consolidated net loss has increased to 346 million rupees, compared to a loss of 316 million rupees in the same quarter last year. Additionally, the company's revenue has decreased to 660 million rupees from 805 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731488873000,
            "Source": "result"
        },
        {
            "Title": "NITCO Settles Debt with LIC",
            "Summary": "NITCO has entered into a one-time settlement agreement with Life Insurance Corporation of India (LIC) for its outstanding debt facilities. The company has paid the agreed-upon settlement amount, which covers all of its dues with LIC.",
            "Sentiment": "positive",
            "PublishDate": 1729176679000,
            "Source": "corporate_action"
        }
    ]
}