{
    "Symbol": "NITINSPIN",
    "ISIN": "INE229H01012",
    "News": [
        {
            "Title": "Nitin Spinners Seeks Approval for Rs 3000 Crore Borrowing",
            "Summary": "Nitin Spinners announces postal ballot for special resolutions to increase borrowing limit from Rs 2000 crores to Rs 3000 crores and authorize security creation. E-voting period: Feb 12-Mar 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770802125594,
            "Source": "stocks"
        },
        {
            "Title": "Nitin Spinners Q3FY26 Earnings Call on Feb 3",
            "Summary": "Nitin Spinners Ltd announces investor conference call scheduled for February 3, 2026 at 2:30 PM to discuss Q3FY26 results and future business outlook, organized by SMIFS Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769687102407,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nitin Spinners Board Meet Set for Jan 31, 2026",
            "Summary": "Nitin Spinners Limited has scheduled a board meeting on January 31, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769078286789,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nitin Spinners Receives Gold and Silver Trophies from Cotton Textiles Export Promotion Council",
            "Summary": "Nitin Spinners Ltd. received a Gold Trophy for highest employment generation and Silver Trophy for second highest exports of grey yarns in cotton yarns category from TEXPROCIL for the year 2023-24. The awards recognize the company's export performance and contribution to employment generation in the textile sector.",
            "Sentiment": "positive",
            "PublishDate": 1763788844761,
            "Source": "stock"
        },
        {
            "Title": "Nitin Spinners Reports Decline in Q2 Financial Performance",
            "Summary": "Nitin Spinners reported quarterly results showing a decline across key financial metrics. Revenue fell to 7.6 billion rupees from 8.2 billion rupees year-over-year. EBITDA decreased to 996 million rupees compared to 1.15 billion rupees in the same period last year, with EBITDA margin dropping to 13.1% from 14%. Net profit also declined to 348 million rupees from 422 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762246063353,
            "Source": "earnings"
        },
        {
            "Title": "Nitin Spinners Announces Book Closure and Annual General Meeting for September 2025",
            "Summary": "Nitin Spinners Ltd has announced a book closure period from August 31, 2025 to September 6, 2025 for dividend distribution purposes. The company will hold its Annual General Meeting on September 6, 2025 at 3:00 PM through video conference. The cut-off date for e-voting entitlement has been set for August 30, 2025. During the book closure period, the Register of Members and Share Transfer Books will remain closed.",
            "Sentiment": "neutral",
            "PublishDate": 1754912004478,
            "Source": "corporate_action"
        },
        {
            "Title": "Nitin Spinners Reports Marginal Revenue Decline in Q1 FY26 Amid Global Market Uncertainties",
            "Summary": "Nitin Spinners Limited reported total revenue of INR 793 crores for Q1 FY26, a marginal 1% year-on-year decline. EBITDA stood at INR 111 crores, down 6% with margins at 14.02%. Profit after tax was INR 41 crores, declining 3% year-on-year. The company operates spinning capacity at over 96% utilization while weaving and finishing divisions run at more than 90%. Revenue declined due to lower yarn prices following reduced cotton prices and decreased export demand as overseas buyers remained cautious about tariff uncertainties. Export sales contributed 62% of revenue while domestic market accounted for 38%. The US government announced 25% tariffs on imports from India, though the company expects limited direct impact due to minimal US exposure. The company is proceeding with its INR 1,120 crores capacity expansion plan expected to generate INR 1,000 crores incremental revenue, with 60% from fabrics and 40% from yarn. Management expects to maintain current margin levels and reach previous year's revenue despite market challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1754645034161,
            "Source": "earnings"
        },
        {
            "Title": "Nitin Spinners Expects Rs 1,000 Crore Revenue from Capacity Expansion, Maintains FY26 Outlook",
            "Summary": "Nitin Spinners reported that 35-40% of its sales come from higher value products, with fabrics contributing 22% and specialized yarns accounting for 15-20%. The company expects to maintain FY25 revenue levels in FY26 and anticipates EBITDA margins to remain around 14-15%. Management projects additional revenue of Rs 1,000 crores from new capacity expansion with an internal rate of return of 14-15%. The company is focusing on developing value-added products in both fabric and yarn segments.",
            "Sentiment": "positive",
            "PublishDate": 1754451566037,
            "Source": "stock"
        },
        {
            "Title": "Nitin Spinners Approves Q1 FY26 Results and Designates New Senior Management Personnel",
            "Summary": "Nitin Spinners Ltd. held a board meeting on August 5, 2025, approving unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 793.31 crores for the quarter, compared to Rs. 802.97 crores in the previous quarter and Rs. 841.29 crores in the same quarter last year. Profit after tax stood at Rs. 39.39 crores versus Rs. 42.82 crores in the corresponding quarter of the previous year. The board scheduled the 33rd Annual General Meeting for September 6, 2025. Four employees were designated as Senior Management Personnel: Arvind Singh Rathore as Vice President (Engineering), Ghanshyam Heda as Vice President (Engineering), Inderjeet Singh as Vice President (Spinning), and Om Prakash Verma as General Manager (HR). The trading window for insiders will open from August 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754385865416,
            "Source": "corporate_action"
        },
        {
            "Title": "Nitin Spinners Approves Quarterly Results and Announces Senior Management Appointments",
            "Summary": "Nitin Spinners Ltd. approved its unaudited financial results for the quarter ended June 30, 2025, along with a limited review report from statutory auditors. The company's revenue from operations was Rs. 79,331.32 lacs for the quarter, with profit after tax of Rs. 3,939.07 lacs. The company announced its 33rd Annual General Meeting scheduled for September 6, 2025. Four employees were designated as Senior Management Personnel: Arvind Singh Rathore as Vice President (Engineering), Ghanshyam Heda as Vice President (Engineering), Inderjeet Singh as Vice President (Spinning), and Om Prakash Verma as General Manager (HR). The trading window for directors and designated persons will open from August 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754384655603,
            "Source": "earnings"
        },
        {
            "Title": "Nitin Spinners Reports Q1 Net Profit of 410 Million Rupees",
            "Summary": "Nitin Spinners recorded a net profit of 410 million rupees in Q1, compared to 421 million rupees in the same period last year, representing a year-over-year decline of 11 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1754384251028,
            "Source": "earnings"
        },
        {
            "Title": "Nitin Spinners Schedules Conference Call to Discuss Q1 FY26 Results",
            "Summary": "Nitin Spinners Ltd. has scheduled a conference call on August 5, 2025, at 5:00 PM to discuss Q1 FY26 results and future business outlook. The call is being organized by SMIFS Limited and will be attended by the company's senior management. The company has informed stock exchanges BSE and NSE about this investor conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1753789607392,
            "Source": "earnings"
        },
        {
            "Title": "Nitin Spinners Schedules Board Meeting for August 5 to Approve Quarterly Financial Results",
            "Summary": "Nitin Spinners Limited has scheduled a Board of Directors meeting for August 5, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company has informed stock exchanges BSE and NSE about the meeting. As per the company's insider trading code, the trading window for securities will remain closed for all directors, designated persons, and their immediate relatives until August 7, 2025, which is 48 hours after the financial results are made public.",
            "Sentiment": "neutral",
            "PublishDate": 1753336087300,
            "Source": "corporate_action"
        },
        {
            "Title": "Nitin Spinners Approves Power Supply and Share Purchase Agreements",
            "Summary": "Nitin Spinners has approved the execution of a Power Supply Agreement and a Share Purchase Agreement with CGE Hybrid Energy. The news does not provide further details about the terms or specifics of these agreements.",
            "Sentiment": "neutral",
            "PublishDate": 1748856578000,
            "Source": "default"
        },
        {
            "Title": "Nitin Spinners Reports Q4 FY2023 Results and Declares Dividend",
            "Summary": "Nitin Spinners announced its Q4 FY2023 financial results. The company reported revenue of 8.4 billion rupees, up from 8 billion rupees year-over-year. EBITDA remained stable at 1.2 billion rupees, with a slight decrease in EBITDA margin from 14.52% to 14.3%. Net profit increased to 464 million rupees from 392 million rupees in the previous year. The company also declared a dividend of 3 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747129291000,
            "Source": "result"
        },
        {
            "Title": "Nitin Spinners: Major Expansion Plan to Double Woven Fabric Capacity",
            "Summary": "Nitin Spinners announces a ₹1,100 crore investment plan over the next two years to double its woven fabric production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1738057358000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nitin Spinners Announces ₹1,100 Crore Expansion Project",
            "Summary": "Nitin Spinners has announced a significant expansion project valued at ₹1,100 crore. The project aims to enhance the company's capabilities by adding capacity in spinning, woven fabric production, and renewable power generation.",
            "Sentiment": "positive",
            "PublishDate": 1737967392000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nitin Spinners Reports Q3 Revenue Increase",
            "Summary": "Nitin Spinners, a textile company, has reported its third-quarter revenue. The company's revenue for Q3 stood at 8.4 billion rupees, compared to 7.5 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737966533000,
            "Source": "earnings"
        },
        {
            "Title": "Nitin Spinners Reports Improved Q3 EBITDA and Margin",
            "Summary": "Nitin Spinners has announced its Q3 financial results. The company's EBITDA increased to 1.17 billion rupees, up from 1.02 billion rupees in the same quarter last year. The EBITDA margin also improved, rising to 13.96% from 13.69% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737966523000,
            "Source": "earnings"
        },
        {
            "Title": "Nitin Spinners Reports Increased Q3 Net Profit",
            "Summary": "Nitin Spinners has announced its financial results for the third quarter, reporting a net profit of 448 million rupees. This represents a significant increase from the 317 million rupees net profit reported in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1737966488000,
            "Source": "earnings"
        },
        {
            "Title": "Nitin Spinners Reports Strong Q2 Financial Performance",
            "Summary": "Nitin Spinners has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.15 billion rupees from 820 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 14.00% from 11.12% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730969667000,
            "Source": "result"
        },
        {
            "Title": "Nitin Spinners Reports Q2 Revenue Growth",
            "Summary": "Nitin Spinners, a textile company, has announced its second quarter revenue for the current fiscal year. The company reported revenue of 8.2 billion rupees, compared to 7.37 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730969610000,
            "Source": "result"
        },
        {
            "Title": "Nitin Spinners Reports 33% Increase in Q2 Net Profit",
            "Summary": "Nitin Spinners, a textile company, has reported a net profit of 422 million rupees for the second quarter, up from 317 million rupees in the same period last year. This represents a year-over-year increase of approximately 33%.",
            "Sentiment": "positive",
            "PublishDate": 1730969582000,
            "Source": "result"
        }
    ]
}