{
    "Symbol": "NIVABUPA",
    "ISIN": "INE995S01015",
    "News": [
        {
            "Title": "Niva Bupa Authorizes KMPs for Material Disclosures",
            "Summary": "Niva Bupa Health Insurance Company has authorized three Key Managerial Personnel to determine materiality of events and make disclosures to stock exchanges under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769699393030,
            "Source": "stocks"
        },
        {
            "Title": "Niva Bupa Appoints New Director and Company Secretary",
            "Summary": "Niva Bupa Health Insurance Company announces the appointment of Roger William John Davis as Additional Director and Aparna Sharma as Company Secretary, effective January 29, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769696422633,
            "Source": "stocks"
        },
        {
            "Title": "Niva Bupa Reports Q3 FY26 Loss of ₹8,764 Lakhs",
            "Summary": "Niva Bupa Health Insurance posted a net loss of ₹8,764 lakhs for Q3 FY26, despite 54.73% growth in gross premiums to ₹2,23,127 lakhs. Nine-month loss widened to ₹21,435 lakhs amid rising claims and expenses.",
            "Sentiment": "negative",
            "PublishDate": 1769692893268,
            "Source": "co_actions_results"
        },
        {
            "Title": "Niva Bupa Schedules Q3FY26 Earnings Call on Jan 29",
            "Summary": "Niva Bupa Health Insurance Company has announced its Q3FY26 earnings conference call for January 29, 2026, at 6:30 PM IST to discuss performance for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769001726365,
            "Source": "co_actions_results"
        },
        {
            "Title": "Niva Bupa Reports 53% Premium Revenue Growth YoY",
            "Summary": "Niva Bupa Health Insurance Company demonstrates strong business momentum with a significant 53% year-on-year increase in premium revenue, reflecting robust growth in the health insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1767777366779,
            "Source": "co_actions_results"
        },
        {
            "Title": "Niva Bupa Allots 88,000 Shares Under ESOP 2020",
            "Summary": "Niva Bupa Health Insurance Company allotted 88,000 equity shares of ₹10 face value each on December 30, 2025, under its Employee Stock Option Plan 2020 following exercise by eligible employees.",
            "Sentiment": "neutral",
            "PublishDate": 1767088313452,
            "Source": "co_actions_results"
        },
        {
            "Title": "Niva Bupa Gets ESG Rating of 65.3 for FY25",
            "Summary": "Niva Bupa Health Insurance Company receives an ESG rating of 65.3 for FY2024-25 from SEBI-registered rating provider SESESG Research, assigned independently without company engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1765974747346,
            "Source": "stocks"
        },
        {
            "Title": "Niva Bupa Health Insurance Shareholders Approve Director Appointments and Remuneration Through Postal Ballot",
            "Summary": "Niva Bupa Health Insurance Company completed a postal ballot through remote e-voting that concluded on December 04, 2025, with shareholders approving the appointment of Vivek Anant Karve as Independent Director and profit-related commission payments to two Non-Executive Independent Directors. All three resolutions passed with over 99.99% approval from participating shareholders, with 643-646 voters casting approximately 1.66 crore votes across the resolutions.",
            "Sentiment": "positive",
            "PublishDate": 1764939070931,
            "Source": "corporate_action"
        },
        {
            "Title": "Niva Bupa Allots 11.11 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "Niva Bupa Health Insurance Company allotted 11,11,500 equity shares of face value ₹10 each on November 13, 2025, following exercise of options by eligible employees under ESOP Scheme 2020. The newly allotted shares will rank pari-passu with existing equity shares of the company.",
            "Sentiment": "positive",
            "PublishDate": 1763090181774,
            "Source": "order&deals"
        },
        {
            "Title": "Niva Bupa Reports 23% Growth in H1 FY26 with Improved Combined Ratio",
            "Summary": "Niva Bupa Health Insurance Company reported gross written premium of INR 3,983 crores for H1 FY26, registering 23% growth on a like-to-like basis. The company's IFRS profit after tax more than doubled from INR 60 crores to INR 132 crores compared to the same period last year. The combined ratio improved by 105 basis points to 103.1%, driven by a 2.3% reduction in expense ratio despite a 1.2% increase in loss ratio. Retail health growth reached 28% while retail loss ratio remained flat at 68.1%. The company launched ReAssure 3.0 product and expanded its preferred provider network to 44 cities. Following GST reduction from 18% to 0% on health insurance, the company reported strong demand in October with over 50% retail growth and 15% increase in ticket size. Management passed on the entire GST benefit to distributors and customers. The solvency ratio stands at 2.85x with investment yield of 7.3% on assets under management of INR 8,482 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762430215250,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Health Insurance Q2 FY26 Profit Doubles, Retail Health GWP Grows 24.5%",
            "Summary": "Niva Bupa Health Insurance Company Limited announced its Q2 FY26 performance with Profit After Tax (IFRS) more than doubling to ₹62 crore from ₹24 crore in Q2 FY25. Retail Health Gross Written Premium (GWP) grew 24.5% year-over-year. The company reported overall GWP of ₹2,108 crore on a without 1/n basis and ₹1,843 crore on a with 1/n basis for Q2 FY26. For H1 FY26, the company recorded ₹3,983 crore GWP (without 1/n) and ₹3,475 crore (with 1/n). The Combined Insurance Service Ratio (IFRS) improved to 103.1%, an improvement of 141 basis points from Q2 FY25. Claims Settlement Ratio reached 95.2% and Solvency Ratio improved to 2.85x. The company covers 23.14 million lives with a Net Promoter Score of 57. Distribution channels showed Individual Agency contributing 31%, Brokers 27%, Bancassurance 20%, Direct business 10%, and Corporate Agents 11% with the fastest year-over-year growth of 44%.",
            "Sentiment": "positive",
            "PublishDate": 1762187807772,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Reports 22.9% Growth in Gross Written Premium for H1 FY2026",
            "Summary": "Niva Bupa Health Insurance Company achieved 22.9% year-on-year growth in Gross Written Premium, reaching ₹3,983 crore (without 1/n) and ₹3,475 crore (with 1/n) for H1 FY2026. The company's IFRS Profit After Tax increased to ₹132 crore compared to ₹60 crore in H1 FY2025. Combined Insurance Service Ratio improved to 103.1% from 104.2% in the previous year. Retail Health market share stands at 9.9% for H1 FY2026. The company launched ReAssure 3.0, India's first truly unlimited health insurance plan, and reported a Weighted Episodal NPS of 57, showing a 2-point improvement over FY2025. The company operates through 209 branches with 209,699 individual agents and maintains a network of 10,507 hospitals.",
            "Sentiment": "positive",
            "PublishDate": 1762180086141,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Reports No Deviation in IPO Fund Utilization for Quarter Ended September 2025",
            "Summary": "Niva Bupa Health Insurance Company Limited filed a statement confirming no deviation or variation in the utilization of funds raised through its Initial Public Offering. The company raised gross proceeds of INR 800 crores through the public issue with allotment date of November 12, 2024. The funds were designated for augmentation of capital base to maintain and strengthen solvency levels. For the quarter ended September 30, 2025, the company reported nil amount utilized and confirmed no deviation from the original allocation of INR 800 crores. The statement was reviewed by the Audit Committee in its meeting held on November 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762174283411,
            "Source": "stock"
        },
        {
            "Title": "Niva Bupa Health Insurance Reports Wider Q2 Net Loss Despite Revenue Growth",
            "Summary": "Niva Bupa Health Insurance reported a net loss of 353 million rupees in Q2, significantly higher than the 130 million rupees loss in the same quarter last year. The company's revenue increased to 14.2 billion rupees from 12.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762171988534,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Health Insurance Company Secretary Rajat Sharma Resigns",
            "Summary": "Rajat Sharma, Company Secretary and Compliance Officer at Niva Bupa Health Insurance Company Limited, submitted his resignation via email on October 31, 2025. His resignation became effective at the close of business hours on the same date. Sharma cited pursuing engagements outside the organization as the reason for his departure. The company informed stock exchanges NSE and BSE about the resignation of this key managerial personnel position.",
            "Sentiment": "neutral",
            "PublishDate": 1761922448221,
            "Source": "corporate_governance"
        },
        {
            "Title": "Niva Bupa Health Insurance Schedules Earnings Call for Q2FY26 Results",
            "Summary": "Niva Bupa Health Insurance Company Limited will conduct an earnings call on November 3, 2025, at 18:30 IST to discuss its unaudited financial results for the quarter and half year ended September 30, 2025. The call will be hosted by ICICI Securities and represented by key executives including Managing Director & CEO Krishnan Ramachandran, Executive Director & CFO Vishwanath Mahendra, and other senior leadership team members. Multiple access numbers are provided for participants from different regions including India, Singapore, Hong Kong, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1761657609483,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Wins ₹1,241 Crore GST Demand Case",
            "Summary": "Niva Bupa has successfully resolved a GST demand case worth ₹1,241 crore. The Additional Commissioner has closed the proceedings in favor of the company.",
            "Sentiment": "positive",
            "PublishDate": 1759319599214,
            "Source": "stock"
        },
        {
            "Title": "Fettle Tonne to Sell Up to 5% Stake in Niva Bupa Through Block Deal",
            "Summary": "Fettle Tonne plans to sell up to 5% of its 7.9% stake in Niva Bupa through a block deal. This transaction would reduce Fettle Tonne's ownership in the health insurance company.",
            "Sentiment": "neutral",
            "PublishDate": 1759311085580,
            "Source": "order&deals"
        },
        {
            "Title": "Niva Bupa Health Insurance Receives IRDAI Approval for New Chairman Appointment",
            "Summary": "Niva Bupa Health Insurance Company Limited received IRDAI approval for the appointment of Mr. Milind Gajanan Barve as Chairman of the Board of Directors, effective from August 28, 2025. The regulatory approval was granted on September 24, 2025. Mr. Barve's Director Identification Number is 00087839.",
            "Sentiment": "positive",
            "PublishDate": 1758734209665,
            "Source": "corporate_governance"
        },
        {
            "Title": "Niva Bupa Health Insurance Appoints Vivek Anant Karve as Independent Director",
            "Summary": "Niva Bupa Health Insurance Company Limited appointed Mr. Vivek Anant Karve as an Additional Director in the category of Independent Director for a five-year term, effective September 15, 2025. The appointment is subject to shareholder approval and was recommended by the Nomination & Remuneration Committee. Mr. Karve is a Chartered Accountant and Cost Accountant with over 30 years of professional experience across consumer products, IT services, and financial services sectors. He previously worked with organizations including P&G, ICICI, Siemens Information Systems, Marico, and Mahindra Finance. At Marico, he served for 20 years including 6 years as Group CFO. His most recent role was CFO of Financial Services Sector at Mahindra Finance. Mr. Karve is not related to any existing directors of the company.",
            "Sentiment": "positive",
            "PublishDate": 1757935251671,
            "Source": "corporate_governance"
        },
        {
            "Title": "Niva Bupa Reports 4% Monthly Decline in Health Insurance Premiums",
            "Summary": "Niva Bupa experienced a 4% month-over-month decrease in health insurance premiums during August. The decline represents a reduction in the company's premium collections compared to the previous month.",
            "Sentiment": "negative",
            "PublishDate": 1757323976024,
            "Source": "stock"
        },
        {
            "Title": "Niva Bupa Health Insurance Won't Raise Premiums Despite GST Exemption Uncertainty",
            "Summary": "Niva Bupa Health Insurance announced it will not immediately increase premiums following the GST Council's decision to exempt individual life and health insurance from tax effective September 22. The GST exemption provides customers an 18% benefit, representing about one-fifth of previously paid premiums. Executive Director Ankur Kharbanda stated the company wants to assess the impact before making any premium changes, particularly regarding unclear input tax credit provisions for insurers. The exemption removes GST from various insurance policies that previously carried rates ranging from 1.8% to 18%. Niva Bupa's market capitalization stands at ₹15,474 crore, with shares trading at ₹88.79 and gaining 19% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1756957915981,
            "Source": "stock"
        },
        {
            "Title": "Niva Bupa Disputes Viral ₹61 Lakh Health Insurance Claim Denial Allegation",
            "Summary": "Niva Bupa Health Insurance responded to a viral LinkedIn post claiming the company denied a ₹61 lakh cashless claim for bone marrow cancer treatment. The insurer stated it approved ₹25 lakh pre-authorization plus ₹77,000 additional amount, with the original approval remaining valid. The patient Chandra Kumar Jain has been a policyholder since November 2021, and two earlier claims totaling ₹22.72 lakh were already paid in 2025. Niva Bupa raised queries when treatment costs escalated from ₹25 lakh to ₹61 lakh and then nearly ₹80 lakh by September 1. The company asked the hospital not to demand additional payments until cost escalation is clarified. Separately, Niva Bupa suspended cashless treatment at Max Hospitals from August 16, 2025 after their contract expired in May due to pricing disagreements. Max Healthcare said it continues providing cashless treatment despite the expired contract but noted that Niva Bupa requested further tariff reductions beyond 2022 levels, which Max considers unviable.",
            "Sentiment": "negative",
            "PublishDate": 1756793068632,
            "Source": "stock"
        },
        {
            "Title": "Niva Bupa Suspends Cashless Services at Max Hospitals Nationwide",
            "Summary": "Niva Bupa has suspended cashless treatment facilities at all Max Hospitals across India, effective August 16, 2025. The suspension follows the expiration of their agreement in May 2025, with ongoing discussions on tariff revisions failing to reach mutual agreement. Customers will now need to pay medical bills upfront and seek reimbursement instead of direct cashless settlement. The insurer maintains cashless services at over 10,400 other network hospitals and has introduced priority reimbursement processing for Max Hospital treatments. Star Health and Care Health customers also reportedly face similar cashless unavailability at Max Hospitals. Niva Bupa is actively working with Max Hospitals to resolve the issue.",
            "Sentiment": "negative",
            "PublishDate": 1756721077049,
            "Source": "stock"
        },
        {
            "Title": "Niva Bupa Health Insurance Reports 28% Premium Growth, PAT Doubles to ₹70 Crores in Q1 FY26",
            "Summary": "Niva Bupa Health Insurance achieved 28% growth in gross written premium for Q1 FY26, with retail health business growing 32%. The company's IFRS profit after tax doubled from ₹36 crores to ₹70 crores year-on-year. Combined ratio improved from 103.9% to 103.2% on IFRS basis. Retail market share increased from 9.9% to 10%. The company executed a 7% price increase on its flagship ReAssure 2.0 product. Loss ratio increased due to reserve strengthening after temporary suspension of auto-adjudication services for security reviews and impact from large corporate accounts written in January 2025. The company expanded its preferred provider network to 43 cities with 17% of claims processed through this network. Expense of management ratio improved to 35.9% from 40.7% in the previous year. Solvency ratio stands at 2.86x against regulatory minimum of 1.50x.",
            "Sentiment": "positive",
            "PublishDate": 1754393157624,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Health Insurance Plans 8-9% Premium Increase for FY26",
            "Summary": "Niva Bupa Health Insurance Company may raise health insurance premiums by 8-9% in FY26. The potential increase would affect the company's pricing structure for health insurance products.",
            "Sentiment": "neutral",
            "PublishDate": 1754277146140,
            "Source": "stock"
        },
        {
            "Title": "Niva Bupa Health Insurance Conducts Earnings Call for Q1 Results",
            "Summary": "Niva Bupa Health Insurance Company Limited conducted an earnings call on July 31, 2025, to discuss its unaudited financial results for the quarter ended June 30, 2025. The call was held with investors and analysts. The audio recording of the earnings call has been made available on the company's website for public access.",
            "Sentiment": "neutral",
            "PublishDate": 1753978664609,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Targets Growth Through Technology and Multi-Channel Strategy",
            "Summary": "Niva Bupa has outlined its growth strategy focusing on technology adoption, multi-channel expansion, introduction of new premium products, and cost management initiatives. The company aims to enhance its profitable retail health portfolio through these strategic measures.",
            "Sentiment": "positive",
            "PublishDate": 1753972180234,
            "Source": "stock"
        },
        {
            "Title": "Niva Bupa Health Insurance Reports Wider Net Loss Despite Revenue Growth",
            "Summary": "Niva Bupa Health Insurance reported a net loss of 914.4 million rupees in Q1, significantly higher than the 188.2 million rupees loss in the same period last year. The company's revenue increased to 12.2 billion rupees from 10.18 billion rupees year-over-year, showing growth in the top line despite the expanded losses.",
            "Sentiment": "negative",
            "PublishDate": 1753964630416,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Health Insurance Schedules Earnings Call for Q1FY26 Results on July 31, 2025",
            "Summary": "Niva Bupa Health Insurance Company Ltd announced an earnings call scheduled for July 31, 2025, at 17:30 hours IST to discuss unaudited financial results for the quarter ended June 30, 2025. The call will be represented by key executives including MD & CEO Krishnan Ramachandran, ED & CFO Vishwanath Mahendra, ED & Chief Business Officer Ankur Kharbanda, Chief Operating Officer Bhabatosh Mishra, Chief Technology Officer Dhiresh Rustogi, and Chief Investment Officer Vikas Jain. The company has provided multiple access numbers including universal access lines and toll-free numbers for international participants from Singapore, Hong Kong, UK, and USA. ICICI Securities is coordinating the call with designated contact persons for clarifications.",
            "Sentiment": "neutral",
            "PublishDate": 1753380249445,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Health Insurance Independent Director Sridhar Srinivasan Resigns to Avoid Potential Conflicts",
            "Summary": "Sridhar Srinivasan resigned as Independent Director of Niva Bupa Health Insurance Company Limited effective July 21, 2025. In his resignation letter, Srinivasan cited the need to preempt perception of potential conflicts of interest as the reason for his departure. He confirmed there were no other material reasons for his resignation. Srinivasan also serves as Independent Director on the boards of Nirlon Limited and Graphite India Limited, holding various committee positions including chairman roles in Corporate Social Responsibility and Risk Management committees respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1753158141796,
            "Source": "corporate_governance"
        },
        {
            "Title": "Niva Bupa Health Insurance: Major Stake Transactions Worth Rs 309 Crore",
            "Summary": "Multiple entities, including M Pallonji and Co., conducted significant share transactions in Niva Bupa Health Insurance. M Pallonji acquired a 0.74% stake. The stock closed 9.9% lower at Rs 83.11 on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1748881552000,
            "Source": "block_deals"
        },
        {
            "Title": "Niva Bupa Health Insurance: True North and CEO Sell 10% Stake for ₹1,507 Crore",
            "Summary": "Private equity firm True North and Niva Bupa Health Insurance CEO Krishnan Ramachandran sold a combined 10% stake in the company for ₹1,507 crore. True North sold 9.46% through its SPV Fettle Tone LLP, while Ramachandran sold 0.55%. DSP Mutual Fund and SBI Mutual Fund were among the buyers.",
            "Sentiment": "neutral",
            "PublishDate": 1748878911000,
            "Source": "block_deals"
        },
        {
            "Title": "Niva Bupa Health Insurance: Stock Plunges 11% Amid Large Block Deal",
            "Summary": "Niva Bupa Health Insurance shares fell 11% after a block deal worth ₹391 crore involving 56 lakh shares. This follows reports of Fettle Tone and Krishnan Ramchandra potentially selling a 7.2% stake. The company recently reported a 31.2% increase in Q4 net profit, but saw declines in underwriting and operating profits.",
            "Sentiment": "negative",
            "PublishDate": 1748836143000,
            "Source": "block_deals"
        },
        {
            "Title": "Niva Bupa Health Insurance: Major Stake Sale via Block Deal",
            "Summary": "Fettle Tone and Krishnan Ramchandra to sell 7.2% stake in Niva Bupa Health Insurance on June 2. Offer price set at ₹82 per share, an 11% discount to Friday's closing price. Total deal size estimated at ₹1,082 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748784569000,
            "Source": "block_deals"
        },
        {
            "Title": "Niva Bupa Health Insurance: Q4 Profit Surges 31%, Stock Hits 4-Month High",
            "Summary": "Niva Bupa Health Insurance reported a 31.2% YoY increase in Q4FY25 net profit to ₹206 crore. The company's FY25 PAT rose 161% YoY to ₹214 crore. Q4 Gross Written Premium grew 36% YoY to ₹2,395 crore. The stock rallied over 14% to ₹92.45, reaching a 4-month high. Retail health market share increased to 9.4% in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1746678706000,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Health Insurance Reports Strong Q4 Financial Results",
            "Summary": "Niva Bupa Health Insurance has reported impressive Q4 financial results. The company's standalone net profit increased to 2.06 billion rupees, up from 1.6 billion rupees year-over-year and 132 million rupees quarter-over-quarter. Net premium earned rose to 15.3 billion rupees from 12.2 billion rupees in the previous year. The Gross Non-Performing Assets (GNPA) improved to 0.66% from 0.86% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746663156000,
            "Source": "default"
        },
        {
            "Title": "Niva Bupa Health Insurance: Q4 Net Profit Surges 31% to ₹206 Crore",
            "Summary": "Niva Bupa Health Insurance reported a 31.2% YoY increase in Q4FY25 net profit to ₹206 crore. Gross premiums written rose 18.2% YoY to ₹2,078.7 crore. Net premium written grew 21% YoY to ₹1,672 crore. However, underwriting profit declined 12.2% and operating profit dropped 43.1% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1746628567000,
            "Source": "earnings"
        },
        {
            "Title": "Niva Bupa Health Insurance Reports Improved Q4 GNPA",
            "Summary": "Niva Bupa Health Insurance has reported a decrease in its Gross Non-Performing Assets (GNPA) for the fourth quarter. The GNPA is expected to be 0.66%, down from 0.86% in the previous quarter, indicating an improvement in the company's asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1746624793000,
            "Source": "result"
        },
        {
            "Title": "Niva Bupa Health Insurance Reports Strong Q4 Profit Growth",
            "Summary": "Niva Bupa Health Insurance has reported a significant increase in net profit for Q4, rising to 2.06 billion rupees from 1.6 billion rupees year-over-year. The company also saw a quarter-on-quarter increase from 132 million rupees. Additionally, net premium earned grew to 15.3 billion rupees from 12.2 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746624659000,
            "Source": "result"
        },
        {
            "Title": "Niva Bupa Health Insurance to Consider Q4 Results",
            "Summary": "Niva Bupa Health Insurance has announced that it will consider its fourth quarter (Q4) financial results on May 7.",
            "Sentiment": "neutral",
            "PublishDate": 1745933017000,
            "Source": "result"
        },
        {
            "Title": "Niva Bupa Health Insurance: CEO Reappointment Approved by IRDAI",
            "Summary": "IRDAI has approved the reappointment of Krishnan Ramachandran as CEO and MD of Niva Bupa Health Insurance for a five-year term from May 1, 2025, to April 30, 2030. The company's stock closed 8% higher at Rs 83.76 on Wednesday.",
            "Sentiment": "positive",
            "PublishDate": 1745466552000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Niva Bupa Health Insurance: Shares Surge on First ₹100 Price Target",
            "Summary": "Niva Bupa Health Insurance shares jumped 9% after Motilal Oswal initiated coverage with a 'buy' rating and a ₹100 price target. The brokerage expects 25% CAGR in Gross Written Premium and 32% CAGR in Net Profit over FY2025-2028. Four out of five analysts recommend 'buy'.",
            "Sentiment": "positive",
            "PublishDate": 1745385799000,
            "Source": "normal_news"
        },
        {
            "Title": "Niva Bupa Health Insurance Invests 50 Million Rupees in BIMA Sugam India Federation",
            "Summary": "Niva Bupa Health Insurance has made a significant investment of 50 million rupees in BIMA Sugam India Federation. This move indicates the company's commitment to expanding its presence in the Indian insurance market and potentially enhancing its digital capabilities through collaboration with BIMA Sugam.",
            "Sentiment": "positive",
            "PublishDate": 1740744694000,
            "Source": "corporate_action"
        },
        {
            "Title": "Niva Bupa Health Insurance Reports Potential Data Breach",
            "Summary": "Niva Bupa Health Insurance has disclosed a potential cyber threat. The company received a communication from an anonymous sender claiming to possess customer data. Niva Bupa is currently conducting an investigation into the alleged data leak.",
            "Sentiment": "negative",
            "PublishDate": 1740355800000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Niva Bupa Health Insurance Reports Potential Data Breach",
            "Summary": "Niva Bupa Health Insurance has disclosed a potential cyber threat. The company received a communication from an anonymous sender claiming to possess customer data. Niva Bupa is currently investigating the alleged data leak to determine its extent and authenticity.",
            "Sentiment": "negative",
            "PublishDate": 1740137041000,
            "Source": "corporate_governance"
        },
        {
            "Title": "IRDAI Approves Acquisition of Niva Bupa Health Shares by Investor Group Entity",
            "Summary": "Niva Bupa Health Insurance Company has received approval from the Insurance Regulatory and Development Authority of India (IRDAI) for the acquisition of its shares by a group entity of an investor. This regulatory approval marks a significant corporate action for the health insurance company, potentially impacting its ownership structure and future operations.",
            "Sentiment": "positive",
            "PublishDate": 1739433482000,
            "Source": "corporate_action"
        },
        {
            "Title": "Niva Bupa Health Insurance: Targets 95% Combined Ratio Within 3 Years",
            "Summary": "Niva Bupa Health Insurance aims to reduce its combined ratio to 95-96% in 2-3 years, down from 100.9% in the nine months ending December 31, 2024. The company targets growth 10 percentage points above market average and has improved its retail market share from 9% to 9.6% in the current financial year's first nine months.",
            "Sentiment": "positive",
            "PublishDate": 1738904927000,
            "Source": "normal_news"
        },
        {
            "Title": "Niva Bupa Health Insurance: Targets Accelerated Growth Amid Market Potential and GST Changes",
            "Summary": "Niva Bupa Health Insurance is aiming for faster growth, leveraging market potential and recent GST changes in the health insurance sector.",
            "Sentiment": "positive",
            "PublishDate": 1738829267000,
            "Source": "normal_news"
        },
        {
            "Title": "Niva Bupa Health Insurance Reports Strong Q3 Financial Performance",
            "Summary": "Niva Bupa Health Insurance has reported a significant increase in net profit for Q3, rising to 132 million rupees from 46 million rupees in the same period last year. The company's net premium written grew to 11.5 billion rupees from 11.2 billion rupees year-over-year. Additionally, the Gross Non-Performing Assets (GNPA) ratio improved to 0.86% from 1.05% in the previous quarter, indicating better asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1738714769000,
            "Source": "earnings"
        }
    ]
}