{
    "Symbol": "NKIND",
    "ISIN": "INE542C01019",
    "News": [
        {
            "Title": "N.K. Industries Reports Q3 FY26 Loss of ₹69.55 Lakhs",
            "Summary": "N.K. Industries Ltd. reported a standalone net loss of ₹69.55 lakhs for Q3 FY26 ended December 31, 2025, compared to ₹14.56 lakhs loss in Q3 FY25. Nine-month losses widened to ₹238.73 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770228682269,
            "Source": "co_actions_results"
        },
        {
            "Title": "NK Industries Company Secretary Resigns",
            "Summary": "Jelin Dodiya resigned as Company Secretary and Compliance Officer of NK Industries Ltd effective January 2, 2026, citing personal reasons for her departure from the position.",
            "Sentiment": "neutral",
            "PublishDate": 1767349361464,
            "Source": "stocks"
        },
        {
            "Title": "NK Industries Reports Rs 173.88 Lakh Loss in H1 FY26 Amid Ongoing Legal Challenges",
            "Summary": "NK Industries Limited reported a net loss of Rs 173.88 lakh for the half year ended September 30, 2025, compared to Rs 39.54 lakh loss in the corresponding period last year. The company's quarterly results showed a loss of Rs 145.66 lakh versus Rs 28.48 lakh in the previous year quarter. Revenue from operations remained flat at Rs 120 lakh for the half year. The company faces significant legal challenges including proceedings by National Spot Exchange Limited (NSEL) for an alleged amount of around Rs 937 crores plus interest, attachment of assets by the Directorate of Enforcement under the Prevention of Money Laundering Act 2002, and criminal proceedings under various acts. The company has accumulated losses of Rs 35,403.93 lakh as of September 30, 2025, resulting in negative net worth. Despite these challenges, management remains confident about business revival through improved profitability and has prepared accounts on a going concern basis.",
            "Sentiment": "negative",
            "PublishDate": 1762790456153,
            "Source": "earnings"
        },
        {
            "Title": "N.K. Industries Reports Quarterly Loss, Reappoints Independent Director",
            "Summary": "N.K. Industries Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone net loss of Rs 20.71 lakhs compared to Rs 11.07 lakhs in the same quarter last year. Consolidated net loss was Rs 69.33 lakhs versus a profit of Rs 9.00 lakhs in the previous year quarter. Revenue from operations remained flat at Rs 60.00 lakhs for standalone results, while consolidated revenue declined to Rs 377.87 lakhs from Rs 420.62 lakhs. The company has accumulated losses of Rs 35,248.60 lakhs and negative net worth. Additionally, Mr. Snehal Patel was reappointed as Independent Director for a second five-year term. The auditor's report contains qualifications related to ongoing legal proceedings involving National Spot Exchange Limited transactions and enforcement actions by various government agencies.",
            "Sentiment": "negative",
            "PublishDate": 1754655084192,
            "Source": "earnings"
        }
    ]
}