{
    "Symbol": "NLCINDIA",
    "ISIN": "INE589A01014",
    "News": [
        {
            "Title": "NLC India Issues Commercial Paper Worth ₹1300 Crores",
            "Summary": "NLC India Limited has issued 26,000 commercial papers with face value of ₹5,00,000 each, totaling ₹1300 crores on February 6, 2026. The issuance comprises ₹800 crores and ₹500 crores tranches.",
            "Sentiment": "neutral",
            "PublishDate": 1770401180448,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Q3FY26 Results Call on Feb 10",
            "Summary": "NLC India Limited announces conference call with investors on February 10, 2026 at 17:00 hours IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770306872794,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Renewables Wins 600MW Solar Project Award",
            "Summary": "NLC India Renewables Limited has been awarded a significant 600MW renewable energy project, marking a major milestone in the company's clean energy expansion initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1770128033895,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Completes 300 MW Solar Project in Rajasthan",
            "Summary": "NLC India successfully commissioned the final 141.17 MW phase of its 300 MW solar project at Barsingsar, Rajasthan, increasing total renewable capacity to 1,766 MW.",
            "Sentiment": "positive",
            "PublishDate": 1769269617404,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Addresses Credit Rating Issue with BWR",
            "Summary": "NLC India informed exchanges about ongoing credit rating dispute with Brickwork Ratings, despite company's withdrawal request and reassignment to other agencies for ₹500 crore bonds.",
            "Sentiment": "neutral",
            "PublishDate": 1769080434514,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Appoints Mangat Ram Sharma as Director",
            "Summary": "NLC India Limited announces appointment of Shri Mangat Ram Sharma, IAS officer and Additional Chief Secretary to Tamil Nadu Government, as Part-time Official Director effective January 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768575011882,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Signs ₹2,500 Cr Gujarat Renewable MoU",
            "Summary": "NLC India enters strategic partnership with Gujarat government for large-scale renewable energy projects with aggregate investment potential of ₹2,500 crores, promising substantial employment generation.",
            "Sentiment": "positive",
            "PublishDate": 1768349872668,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Signs ₹2.5 Lakh Crore Gujarat Energy Deal",
            "Summary": "NLC India has entered into a significant agreement with Gujarat government for renewable energy projects valued at ₹2,50,000 crores, expected to generate substantial employment opportunities across the state.",
            "Sentiment": "positive",
            "PublishDate": 1768314930455,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Signs ₹25,000 Cr Gujarat Renewable Energy MoU",
            "Summary": "NLC India Limited signed a non-binding MoU with Gujarat government for large-scale renewable energy projects worth ₹25,000 crore, including solar, wind, hybrid and battery storage projects.",
            "Sentiment": "positive",
            "PublishDate": 1768314438605,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Modifies Interim Dividend Record Date to Jan 20",
            "Summary": "NLC India Limited has modified the record date for interim dividend FY 2025-26 to January 20, 2026, due to trading holiday declared by stock exchanges on January 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768308561504,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India surges 3% on renewables subsidiary listing nod",
            "Summary": "NLC India shares jumped 3% to ₹263.05 after board approved listing of renewable subsidiary NIRL with up to 25% dilution. Company also declared ₹3.60 interim dividend and authorized ₹66.60 crore equity infusion.",
            "Sentiment": "positive",
            "PublishDate": 1768305390515,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India declares ₹3.60 interim dividend per share",
            "Summary": "Navratna PSU NLC India Limited announces interim dividend of ₹3.60 per share and approves proposal to dilute stake in subsidiary through public offering under Ministry of Coal.",
            "Sentiment": "positive",
            "PublishDate": 1768302126458,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India gains 3% on subsidiary listing approval",
            "Summary": "NLC India shares rose 2.8% following board approval for listing renewable energy subsidiary NIRL with up to 25% equity dilution and declaration of 36% interim dividend worth ₹3.60 per share.",
            "Sentiment": "positive",
            "PublishDate": 1768282203647,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Board Approves Subsidiary Listing & Dividend",
            "Summary": "NLC India's board approved listing of renewable energy subsidiary NIRL with up to 25% stake dilution, ₹66.60 crore investment, and 36% interim dividend of ₹3.60 per share for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1768270519869,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Approves Renewables Listing & ₹3.60 Dividend",
            "Summary": "NLC India receives in-principle approval for listing its renewables subsidiary, approves ₹666 million investment, and declares interim dividend of ₹3.60 per share for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1768262898885,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Board Approves Renewable Arm Listing",
            "Summary": "NLC India's board gives in-principle approval for listing its renewable subsidiary NIRL, plans to divest up to 25% stake through public offer. Company also announces ₹3.60 interim dividend per share.",
            "Sentiment": "positive",
            "PublishDate": 1768229552224,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Board Approves Green Arm Listing, Dividend",
            "Summary": "NLC India's board approves listing of renewable subsidiary NIRL with up to 25% equity dilution and declares 36% interim dividend of ₹3.60 per share for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1768227855270,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Announces ₹3.60 Interim Dividend",
            "Summary": "NLC India declares 36% interim dividend of ₹3.60 per share for FY26 with record date set for January 16, 2026. Ex-dividend date moved to January 14 due to Mumbai civic polls.",
            "Sentiment": "positive",
            "PublishDate": 1768227744575,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Gets Green Light for Renewables Listing",
            "Summary": "NLC India receives initial approval for subsidiary listing, plans ₹666 million investment in renewables unit, and announces ₹3.60 per share interim dividend for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1768226112479,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Board Approves Subsidiary Listing & Dividend",
            "Summary": "NLC India's board approved in-principle listing of renewable energy subsidiary NIRL, declared 36% interim dividend of ₹3.60 per share, and sanctioned ₹66.60 crore investment for green energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1768225743885,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Declares 36% Interim Dividend for FY26",
            "Summary": "NLC India Limited announces interim dividend of ₹3.60 per share with record date January 16, 2026, and approves ₹66.60 crore investment in renewable subsidiary NIRL for green energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1768225438460,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Board to Meet on Jan 12 for Interim Dividend",
            "Summary": "NLC India Limited has scheduled a board meeting on January 12, 2026, to consider and approve the declaration of interim dividend for Financial Year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1767780221555,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Gets AAA Credit Rating Reaffirmation",
            "Summary": "Care Ratings Limited reaffirmed NLC India's AAA credit rating with stable outlook for bank facilities worth ₹1,972 crores and commercial paper worth ₹6,000 crores on January 6, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767702871005,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Transfers Seven Renewable Energy Assets",
            "Summary": "NLC India has transferred seven renewable energy assets to its subsidiary as part of its corporate restructuring strategy to optimize operations and enhance focus on clean energy initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1767279913428,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Signs Coal Mining Deal for North Dhadu Mine",
            "Summary": "NLC India Limited secured its first commercial coal mine through auction, signing agreement for North Dhadu Western Part Coal Mine with 110 million tonnes reserves and 3 MTPA capacity under MDO mode.",
            "Sentiment": "positive",
            "PublishDate": 1767166998606,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Begins Mining at Pachvara South Coal Block",
            "Summary": "NLC India's joint venture NUPPL commenced initial mining operations at the 264.84 million tonne Pachvara South coal block in Jharkhand to fuel the 3x660 MW Ghatampur thermal power plant.",
            "Sentiment": "positive",
            "PublishDate": 1766156226424,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Announces 500 Million Unit Green Energy Project",
            "Summary": "NLC India has announced a new green energy project that aims to produce approximately 500 million units of renewable energy annually, marking a significant step in the company's sustainable energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1765899802201,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Renewables Signs 200 MW Wind Power Deal",
            "Summary": "NLC India Renewables Limited has entered into a power purchase agreement with SJVN Limited for a 200 MW wind power project, marking a significant step in renewable energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1765899559318,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Gets Nod for 110 MW Solar Project in UP",
            "Summary": "NLC India Limited receives approval for a 110 MW solar power project in Uttar Pradesh, expanding its renewable energy portfolio in the state.",
            "Sentiment": "positive",
            "PublishDate": 1765764400523,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Wins 110MW Solar Project from NCRTC",
            "Summary": "NLC India Limited receives Letter of Acceptance from National Capital Region Transport Corporation for setting up 110MW solar PV power projects in Uttar Pradesh under captive mode with 25-year power supply agreement.",
            "Sentiment": "positive",
            "PublishDate": 1765707349562,
            "Source": "co_actions_results"
        },
        {
            "Title": "NLC India Signs JV Agreement with PTC for Green Energy",
            "Summary": "NLC India Renewables Limited signed a Joint Venture Agreement with PTC India Limited on December 12, 2025, to develop renewable energy projects with capacity up to 2000 MW in phases.",
            "Sentiment": "positive",
            "PublishDate": 1765547356098,
            "Source": "stocks"
        },
        {
            "Title": "NLC India Commences Commercial Operations at Ghatampur Thermal Power Project Unit-2",
            "Summary": "NLC India has started commercial operations for Unit-2 of its Ghatampur Thermal Power Project, marking the activation of another power generation unit. This development expands the company's operational capacity and strengthens its position in the thermal power sector.",
            "Sentiment": "positive",
            "PublishDate": 1765284043367,
            "Source": "stock"
        },
        {
            "Title": "NLC India Promotes Five Senior Executives to Executive Director Positions",
            "Summary": "NLC India Limited appointed five senior management personnel as Executive Directors on December 6, 2025, including Ramachandra R Parashar, Durai Kumar S, Devendra Pratap Singh, Anandaramanujam K, and Vanchinathan T. The promotions bring decades of experience in IT management, project management, renewable energy, and thermal power operations to the board level, strengthening the company's leadership across key business segments.",
            "Sentiment": "positive",
            "PublishDate": 1765085440734,
            "Source": "corporate_governance"
        },
        {
            "Title": "NLC India Executive Director Ashok Dattatraya Keote Retires Upon Superannuation",
            "Summary": "Ashok Dattatraya Keote ceased as Executive Director (Senior Management Personnel) of NLC India Limited on November 29, 2025, upon reaching superannuation age. The cessation affects the company's senior management structure as part of the normal retirement process for the Navratna government enterprise.",
            "Sentiment": "neutral",
            "PublishDate": 1764418966771,
            "Source": "corporate_governance"
        },
        {
            "Title": "NLC India Fined Rs 10.85 Lakh by NSE and BSE for Board Composition Non-Compliance",
            "Summary": "NLC India Limited received fines of Rs 5,42,800 each from NSE and BSE for non-compliance with SEBI regulations regarding board composition, including failure to appoint a women director. The government-owned company has requested waiver of the fines citing that director appointments are controlled by the President of India, with no impact expected on operations.",
            "Sentiment": "negative",
            "PublishDate": 1764334356821,
            "Source": "corporate_governance"
        },
        {
            "Title": "NLC India Commissions Additional 106 MW Solar Power Capacity in Rajasthan",
            "Summary": "NLC India Limited has successfully commissioned the second phase of its 300 MW solar power project, adding 106 MW capacity at Barsingsar, Bikaner, Rajasthan. The commissioning certificate was received from Rajasthan Renewable Energy Corporation Limited on November 2, 2025. Combined with the first phase of 52.83 MW that became operational in August 2025, the total operational capacity now stands at 158.83 MW out of the planned 300 MW project.",
            "Sentiment": "positive",
            "PublishDate": 1762086444048,
            "Source": "stock"
        },
        {
            "Title": "NLC India to Transfer 1,430 MW Renewable Energy Assets to NIRL",
            "Summary": "NLC India will transfer 1,430 MW of renewable energy assets to NIRL through a business agreement. The transfer involves renewable power generation capacity being moved between the companies under the structured business arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1761920066797,
            "Source": "stock"
        },
        {
            "Title": "NLC India Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "NLC India reported Q2 revenue of 41.78 billion rupees, up from 36.6 billion rupees in the same period last year. The company's EBITDA increased to 14 billion rupees from 10.72 billion rupees year-over-year, with EBITDA margin improving to 33.5% from 29.34%. However, consolidated net profit declined to 6.66 billion rupees compared to 9.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761725739978,
            "Source": "earnings"
        },
        {
            "Title": "NLC India Government Nominee Director Dr. Beela Venkatesan Passes Away",
            "Summary": "NLC India Limited announced the death of Dr. Beela Venkatesan, Government Nominee Director, on September 24, 2025. The company described her unexpected demise as an irreparable loss to the organization. Dr. Venkatesan held DIN 02729408 and her directorship ceased on the date of her passing. The Board Members and employees have expressed deep condolences to her family.",
            "Sentiment": "negative",
            "PublishDate": 1758777962441,
            "Source": "corporate_governance"
        },
        {
            "Title": "NLC India Receives Letters of Intent for Two Mining Blocks in Chhattisgarh",
            "Summary": "NLC India Limited has received Letters of Intent from the Government of Chhattisgarh for two mining blocks: Semhardih Phosphorite & Limestone Block and Raipura Phosphorite & Limestone Block, both located in Balod, Chhattisgarh. The company communicated this development to stock exchanges NSE and BSE through a regulatory disclosure dated September 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758032532741,
            "Source": "stock"
        },
        {
            "Title": "NLC India Shifts Strategic Focus to Rare Earths and Renewable Energy Integration",
            "Summary": "NLC India has announced a strategic shift in focus toward rare earths and renewable energy integration. An executive from the company stated that these sectors are now the primary areas of concentration for the organization's future operations and development.",
            "Sentiment": "positive",
            "PublishDate": 1757996398815,
            "Source": "stock"
        },
        {
            "Title": "NLC India Becomes First Central PSE to Receive IPMA Delta Certification Level 3",
            "Summary": "NLC India Limited has achieved the International Project Management Association Delta Certification - Level 3 (Standardized), becoming the first Central Public Sector Enterprise in India to receive this recognition. The certification acknowledges the company's maturity in project, program, and portfolio management governance practices. NLC India stated this achievement reflects their commitment to transparency, accountability, innovation, and alignment with global project management standards as part of their Vision 2030. The company believes this certification reinforces stakeholder confidence in their ability to execute projects with excellence and sustainability while setting a benchmark for global standards.",
            "Sentiment": "positive",
            "PublishDate": 1757942647640,
            "Source": "stock"
        },
        {
            "Title": "NLC India Signs MOU with Khanij Bidesh India for Critical Mineral Projects",
            "Summary": "NLC India has entered into a Memorandum of Understanding with Khanij Bidesh India Ltd. for global critical mineral projects.",
            "Sentiment": "positive",
            "PublishDate": 1757895137541,
            "Source": "stock"
        },
        {
            "Title": "NLC India Signs MoU with Khanij Bidesh India for Global Critical Minerals Collaboration",
            "Summary": "NLC India Limited signed a Memorandum of Understanding with Khanij Bidesh India Limited on September 10, 2025, to collaborate on identifying, acquiring, and developing critical and strategic mineral projects globally. NLCIL is actively pursuing opportunities in the Critical Minerals and Rare Earth Elements sector both within India and internationally. The partnership aligns with the Government of India's encouragement for Public Sector enterprises to acquire Critical Minerals Assets through domestic and international acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1757606001870,
            "Source": "order&deals"
        },
        {
            "Title": "NLC India Commissions 52.83 MW Phase of Solar Project in Rajasthan",
            "Summary": "NLC India commissioned the first phase of its 300 MW solar power project with a capacity of 52.83 MW at Barsingsar, Bikaner, Rajasthan. The company received the commissioning certificate from Rajasthan Renewable Energy Corporation Limited on August 26, 2025. In its quarterly results, NLC India reported net profit of ₹798 crore, up 42.7% from ₹559 crore in the same quarter last year. Revenue from operations increased 13.2% to ₹3,826 crore from ₹3,378 crore. However, EBITDA declined 13.6% to ₹935 crore from ₹1,082 crore, with EBITDA margin dropping to 24.4% from 32%. The company's shares rose 1.51% to ₹236.04, with a monthly gain of 0.70%.",
            "Sentiment": "positive",
            "PublishDate": 1756291992618,
            "Source": "stock"
        },
        {
            "Title": "NLC India Commissions First Phase of 300 MW Solar Power Project in Rajasthan",
            "Summary": "NLC India Limited successfully commissioned the first phase of its 300 MW Solar Power Project with a capacity of 52.83 MW at Barsingsar, District Bikaner, Rajasthan. The project has been declared commercially operational and the company received the Commissioning Certificate from Rajasthan Renewable Energy Corporation Limited on August 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756218239282,
            "Source": "stock"
        },
        {
            "Title": "NLC India Schedules Q1 FY26 Results Conference Call for August 13, 2025",
            "Summary": "NLC India Limited will conduct a conference call with investors on August 13, 2025, at 16:00 hours IST to discuss the company's financial results for the quarter ended June 30, 2025. The call will be led by Chairman and Managing Director Shri M. Prasanna Kumar along with Functional Directors and Senior Management. ICICI Securities is coordinating the call, which will be accessible through universal access numbers and toll-free numbers for international participants from Singapore, Hong Kong, UK, and USA. The company has noted that the conference call may be cancelled, rescheduled or postponed due to exigencies.",
            "Sentiment": "neutral",
            "PublishDate": 1754660533067,
            "Source": "earnings"
        },
        {
            "Title": "NLC India Reports Strong Q1 Performance with 48% PAT Growth and Major Project Milestones",
            "Summary": "NLC India Limited reported robust quarterly results with revenue from operations rising 13.25% to Rs. 3,825.61 crore compared to Rs. 3,378.17 crore in the previous year. Profit After Tax surged 48.09% to Rs. 839.21 crore from Rs. 566.69 crore in the corresponding quarter last year. Total income grew 12.99% to Rs. 4,115.85 crore. The company achieved significant operational milestones including the Prime Minister's dedication of NUPPL's 660 MW Unit 1 at Ghatampur Thermal Power Station. Cabinet Committee on Economic Affairs approved Rs. 7,000 crore investment in NIRL beyond Navratna guidelines. NUPPL achieved oil synchronization of Unit-2 (660 MW) at Ghatampur project. The company was declared preferred bidder for phosphorite and limestone blocks in Chhattisgarh, marking its entry into critical minerals mining. NIRL secured 250MW/500MWhr Battery Storage System project from Tamil Nadu Green Energy Corporation and received Letter of Award from NTPC for 450 MW wind-solar hybrid project. Capital expenditure achievement reached Rs. 1,925.62 crore, representing 113% of the target of Rs. 1,708.88 crore. NUPPL generated Rs. 642.29 crore revenue from operations during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754582842502,
            "Source": "earnings"
        },
        {
            "Title": "NLC India Approves Q1 FY26 Results and Rs 5,228 Crore Renewable Asset Transfer to Subsidiary",
            "Summary": "NLC India Limited's Board approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 2,495.60 crore for the quarter. The Board also gave in-principle approval for a Business Transfer Agreement to transfer operational renewable assets worth Rs 5,228 crore to its wholly-owned subsidiary, NLC India Renewables Limited. This restructuring is part of the company's Asset Monetization Scheme approved by the Ministry of Coal. Additionally, the Cabinet Committee on Economic Affairs approved investment of Rs 7,000 crore in NLC India Renewables Limited beyond Navratna guidelines. During the quarter, NLC India incorporated NLC Rajasthan Power Ltd with RVUNL with 74:26 equity participation for thermal power projects development in Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1754580523089,
            "Source": "earnings"
        },
        {
            "Title": "NLC India Reports Mixed Q1 Results, Plans Transfer of Renewable Assets Worth 52.28 Billion Rupees",
            "Summary": "NLC India announced plans to transfer renewable energy assets valued at 52.28 billion rupees to a subsidiary unit. The company reported Q1 consolidated net profit of 7.97 billion rupees, up from 5.6 billion rupees year-over-year, while revenue increased to 38.3 billion rupees from 33.76 billion rupees. However, EBITDA declined to 9.35 billion rupees from 10.82 billion rupees, with EBITDA margin dropping to 24.44% from 32.05%. Profit before tax fell to 3.9 billion rupees from 7.2 billion rupees year-over-year. The company has deferred tax of 4.2 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1754579085566,
            "Source": "stock"
        }
    ]
}