{
    "Symbol": "NMDC",
    "ISIN": "INE584A01023",
    "News": [
        {
            "Title": "NMDC revises iron ore prices effective Feb 10, 2026",
            "Summary": "NMDC Limited announces new pricing for iron ore products with Baila Lump at ₹4,700 per ton and Baila Fines at ₹4,000 per ton, effective February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770694106223,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Eyes Overseas Mineral Asset Acquisitions",
            "Summary": "NMDC and other PSUs are reportedly in discussions to acquire mineral assets in Indonesia and Malaysia, marking a strategic expansion into international markets.",
            "Sentiment": "positive",
            "PublishDate": 1770195935406,
            "Source": "co_actions_results"
        },
        {
            "Title": "NMDC Ventures into Critical Minerals Production",
            "Summary": "NMDC announces strategic entry into critical minerals production sector, expanding beyond traditional iron ore mining operations to diversify its business portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1770109333565,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Q3 Net Profit Falls to ₹17.6B, Misses Estimates",
            "Summary": "NMDC reported consolidated net profit of ₹17.6 billion in Q3, declining from ₹19 billion year-over-year and falling short of analyst estimates of ₹20 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770108901752,
            "Source": "co_actions_results"
        },
        {
            "Title": "NMDC Reports Strong Iron Ore Production Growth",
            "Summary": "NMDC achieved 9.02% growth in iron ore production to 5.56 MT in January 2026, while sales increased 6.92% to 4.79 MT compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770087674248,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Director Personnel Retires on Superannuation",
            "Summary": "Smt. Priyadarshini Gaddam ceased as Director (Personnel) at NMDC Limited on 31.01.2026 upon reaching superannuation age, with board responsibilities redistributed among existing directors.",
            "Sentiment": "neutral",
            "PublishDate": 1769940134758,
            "Source": "stocks"
        },
        {
            "Title": "NMDC CMD Takes Additional Charge as Director Finance",
            "Summary": "NMDC's Chairman and Managing Director Amitava Mukherjee has been assigned additional charge of Director (Finance) post for three months from December 6, 2025 to March 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769589159336,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Shares Drop 2.05% Despite Strong FY25 Performance",
            "Summary": "NMDC shares declined 2.05% to ₹76.63 on Friday despite reporting revenue growth of 12.20% to ₹23,905.52 crores and net profit increase of 17.36% to ₹6,539.75 crores for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1769160662298,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Starts Mining at Tokisud North Coal Mine",
            "Summary": "NMDC commences mining operations at Tokisud North Coal Mine in Jharkhand with target annual production capacity of 2.30 million tons of thermal coal, marking expansion in coal mining operations.",
            "Sentiment": "positive",
            "PublishDate": 1769156320576,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Appoints Joydeep Dasgupta as Additional Director",
            "Summary": "NMDC Limited announces Shri Joydeep Dasgupta, Director (Production), will take additional charge as Director (Personnel) for three months starting February 1, 2026, following Ministry of Steel directive.",
            "Sentiment": "neutral",
            "PublishDate": 1768482083902,
            "Source": "stocks"
        },
        {
            "Title": "Citi Issues Sell Rating on NMDC with ₹66 Target",
            "Summary": "Citigroup has issued a sell rating on NMDC with a target price of ₹66 per share, indicating potential downside for the iron ore mining company's stock.",
            "Sentiment": "negative",
            "PublishDate": 1768189495873,
            "Source": "stocks"
        },
        {
            "Title": "Anand Rathi picks 2 stocks under ₹200 to buy",
            "Summary": "Mehul Kothari of Anand Rathi recommends SJVN and NMDC as buy opportunities under ₹200 amid market correction. Both stocks offer attractive risk-reward ratios with clear targets and stop-loss levels.",
            "Sentiment": "neutral",
            "PublishDate": 1768031332795,
            "Source": "stocks"
        },
        {
            "Title": "NMDC assigns additional commercial charge to Vinay Kumar",
            "Summary": "NMDC Limited announces that Shri Vinay Kumar, Director (Technical), has been entrusted with additional charge of Director (Commercial) post for three months until April 6, 2026, as per Ministry of Steel order.",
            "Sentiment": "neutral",
            "PublishDate": 1767972516760,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Shares Fall After Iron Ore Price Announcement",
            "Summary": "NMDC stock declined up to 3.46% after the company announced fixed prices for Baila Lump at ₹4,600 per tonne and Baila Fines at ₹3,900 per tonne, effective immediately.",
            "Sentiment": "negative",
            "PublishDate": 1767944257365,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Cuts Iron Ore Prices by Up to ₹1,000 Per Tonne",
            "Summary": "NMDC announced significant price cuts for iron ore products effective January 9, with Baila Lump reduced to ₹4,600/tonne and Baila Fines to ₹3,900/tonne, despite global iron ore prices trading near $109/tonne.",
            "Sentiment": "negative",
            "PublishDate": 1767944227641,
            "Source": "stocks"
        },
        {
            "Title": "NMDC revises iron ore prices effective Jan 9, 2026",
            "Summary": "NMDC Limited announces new pricing for iron ore products with Baila Lump at ₹4,600 per ton and Baila Fines at ₹3,900 per ton, effective January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767943259912,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Sets New Iron Ore Prices Effective January 9, 2026",
            "Summary": "NMDC Limited announces revised iron ore pricing with Baila Lump at ₹4,600 per ton and Baila Fines at ₹3,900 per ton, effective January 9, 2026. Prices exclude taxes and additional fees.",
            "Sentiment": "neutral",
            "PublishDate": 1767943035017,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Plans ₹400/Tonne Iron Ore Price Hike in January",
            "Summary": "NMDC is expected to increase domestic iron ore prices by ₹400 per tonne in January, marking a significant price adjustment in the mining sector.",
            "Sentiment": "positive",
            "PublishDate": 1767850080968,
            "Source": "stocks"
        },
        {
            "Title": "NMDC December production jumps 14.7% to 5.4 MT",
            "Summary": "NMDC reported December 2025 iron ore production of 5.40 million tonnes, up 14.7% YoY, with sales rising 18.7% to 4.64 million tonnes. Cumulative FY26 production reached 36.89 million tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1767260639243,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Hits 52-Week High on Colorado School MoU",
            "Summary": "NMDC shares surge to ₹83.10, a new 52-week high, following announcement of research partnership with Colorado School of Mines for joint mining and AI technology development.",
            "Sentiment": "positive",
            "PublishDate": 1766738836649,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Signs MoU with Colorado School of Mines",
            "Summary": "NMDC Limited executed a Memorandum of Understanding with Colorado School of Mines on December 24, 2025, establishing framework for research collaboration in mining, mineral processing, metallurgy, and AI/ML applications.",
            "Sentiment": "positive",
            "PublishDate": 1766577361714,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Projects 11% Production Growth and 4% Sales Increase for November 2025",
            "Summary": "NMDC has projected its November 2025 production at 5.01 million tons, representing an 11% increase from 4.51 million tons in the previous year. The company also estimates sales of 4.17 million tons for November 2025, up from 4 million tons in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1764597121424,
            "Source": "stock"
        },
        {
            "Title": "NMDC Announces New Iron Ore Pricing Effective November 15, 2025",
            "Summary": "NMDC Limited has set new prices for iron ore products with Baila Lump (65.5%) priced at Rs 5,600 per ton and Baila Fines (64%) at Rs 4,750 per ton. The pricing is effective from November 15, 2025, with rates being FOR prices inclusive of royalty, DMF, and NMEDT but excluding various taxes and fees.",
            "Sentiment": "neutral",
            "PublishDate": 1763186066133,
            "Source": "stock"
        },
        {
            "Title": "NMDC Board Decides Against Interim Dividend Declaration",
            "Summary": "NMDC's board of directors chose not to declare any interim dividend on the company's equity shares. This decision affects current shareholders who will not receive interim dividend payments during this period.",
            "Sentiment": "negative",
            "PublishDate": 1763110280484,
            "Source": "corporate_action"
        },
        {
            "Title": "NMDC Reports Iron Ore Production and Sales Data for October 2025",
            "Summary": "NMDC Limited disclosed its iron ore production and sales figures for October 2025 and cumulative data for FY 2025-26. In October 2025, the company produced 17.84 MT of iron ore compared to 13.86 MT in October 2024, while sales reached 17.90 MT versus 16.77 MT in the previous year. For the cumulative period up to October, production stood at 26.47 MT compared to 21.55 MT in the previous year, and sales totaled 26.14 MT against 23.84 MT. The data covers operations in the Chhattisgarh sector and has been made available on the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1762016217951,
            "Source": "stock"
        },
        {
            "Title": "NMDC Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "NMDC Limited published its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported quarterly PAT of ₹1,694 crores and half-yearly PAT of ₹3,663 crores. Quarterly turnover stood at ₹6,261 crores while half-yearly turnover reached ₹12,895 crores. Production figures showed 10.21 million tonnes for the quarter and 22.20 million tonnes for the half-year. Sales volumes were recorded at 10.72 million tonnes quarterly and 22.23 million tonnes for the half-year period. The results were published in Financial Express, Vaartha, and Daily Hindi Milap newspapers and are accessible through the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1761852254658,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Targets 50 MTPA Output Through Steel Integration and Digital Mining",
            "Summary": "NMDC has outlined its strategy to achieve 50 million tonnes per annum (MTPA) output through steel integration and digital mining initiatives for long-term value creation. The company expects volume ramp-up and improved logistics efficiency to support higher realizations and enhanced free cash flow generation.",
            "Sentiment": "positive",
            "PublishDate": 1761754767938,
            "Source": "stock"
        },
        {
            "Title": "NMDC Reports Strong Q2 Results with Revenue Rising 28% to 63 Billion Rupees",
            "Summary": "NMDC delivered robust quarterly performance with revenue reaching 63 billion rupees, up from 49.19 billion rupees year-over-year, surpassing estimates of 58.25 billion rupees. Consolidated net profit grew significantly to 17 billion rupees from 11.96 billion rupees, exceeding the estimated 16.21 billion rupees. EBITDA increased to 20 billion rupees compared to 14.4 billion rupees, slightly above the 19.97 billion rupee estimate. EBITDA margin improved to 32.01% from 29.97%, though it fell short of the estimated 34% margin.",
            "Sentiment": "positive",
            "PublishDate": 1761726441303,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Announces New Iron Ore Pricing Effective October 22, 2025",
            "Summary": "NMDC Limited has set new prices for its iron ore products. Baila Lump (65.5%, 10-40mm) is priced at ₹5,550 per ton, while Baila Fines (64%, -10mm) is priced at ₹4,750 per ton. The prices are inclusive of Royalty, DMF, and NMET but exclude Cess, Forest Permit Fee, Transit fee, GST, Environmental Cess and Other Taxes. The company has informed major stock exchanges including NSE, BSE, and Calcutta Stock Exchange about the pricing update.",
            "Sentiment": "neutral",
            "PublishDate": 1761099428335,
            "Source": "stock"
        },
        {
            "Title": "NMDC Reports Production Growth to 3.75MT and Sales Increase to 3.88MT",
            "Summary": "NMDC reported production of 3.75 million tonnes compared to 3.04 million tonnes in the previous year, representing a year-over-year increase. Sales also grew to 3.88 million tonnes from 3.54 million tonnes year-over-year. The mining company showed growth in both production and sales volumes during the period.",
            "Sentiment": "positive",
            "PublishDate": 1759310151829,
            "Source": "stock"
        },
        {
            "Title": "India Considers Export Tax on Iron Ore Amid Production Concerns",
            "Summary": "India is considering the implementation of an export tax on iron ore due to concerns about production levels. The development could impact NMDC, a key player in India's iron ore sector.",
            "Sentiment": "negative",
            "PublishDate": 1757912848132,
            "Source": "sectoral"
        },
        {
            "Title": "Environment Ministry Exempts Critical Minerals From Public Consultations",
            "Summary": "The Environment Ministry has granted an exemption for critical minerals from public consultation requirements. This development relates to NMDC's operations in the critical minerals sector.",
            "Sentiment": "positive",
            "PublishDate": 1757497174966,
            "Source": "stock"
        },
        {
            "Title": "NMDC Shares Worth Rs. 55.32 Crores Traded in NSE Block Deal",
            "Summary": "NMDC Ltd. witnessed a block trade on NSE involving approximately 7,475,354 shares at Rs. 74.00 per share, totaling Rs. 55.32 crores. The transaction represents a significant bulk deal in the mining company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1757390952178,
            "Source": "order&deals"
        },
        {
            "Title": "NMDC Reports Higher Iron Ore Production and Sales in August",
            "Summary": "NMDC achieved iron ore production of 3.37 million tonnes in August, compared to 3.07 million tonnes in the same period last year. Sales reached 3.39 million tonnes versus 3.14 million tonnes year-over-year. Both production and sales showed growth compared to the previous year's August figures.",
            "Sentiment": "positive",
            "PublishDate": 1756724944500,
            "Source": "stock"
        },
        {
            "Title": "NMDC Shares Drop 5% Despite Revenue Surge as Profit Declines Marginally",
            "Summary": "NMDC shares fell 4.9% to Rs 69.02 after reporting a 1% decline in profit to Rs 1,969 crore despite a 23% revenue jump to Rs 6,634 crore. Iron ore output rose 31% to 119.94 lakh tonnes while sales increased 14% to 115.17 lakh tonnes. EBITDA grew 2% to Rs 2,777 crore with margins at 42%. Higher production costs offset revenue gains from increased volumes. Brokerages remain optimistic - Nuvama maintains 'buy' rating with Rs 85 target price, while PL Capital rates 'Accumulate' with Rs 80 target, citing expected price hikes and volume growth. NMDC forecasts 49 million tonnes sales volume for the year, representing 10% growth, and expects 11% compound annual EBITDA growth through fiscal 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1755152665156,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Targets Growth Through High Production and Strategic Investments by FY26",
            "Summary": "NMDC aims to maintain high production and sales levels driven by strong steel demand, stable pricing, and operational efficiency. The company is investing in capital expenditure, mine expansions, and joint ventures to position itself for enhanced growth and profitability by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755016973352,
            "Source": "stock"
        },
        {
            "Title": "NMDC Reports Record Q1 Performance with 31% Production Growth and Board Approves New Subsidiary",
            "Summary": "NMDC Limited achieved record-breaking performance in Q1 FY26 with iron ore production reaching 119.94 lakh tonnes, marking a 31% increase from 91.89 lakh tonnes in the previous year's Q1. Sales also hit a best-ever Q1 figure of 115.17 lakh tonnes, up 14% from 100.73 lakh tonnes. Revenue from operations grew 23% to Rs 6,634 crores compared to Rs 5,378 crores in Q1 FY25. EBITDA increased significantly by 51% to Rs 2,777 crores from Rs 2,725 crores, while profit before tax rose marginally by 1% to Rs 2,644 crores. The company's Board of Directors approved the incorporation of a wholly-owned subsidiary in the International Financial Service Centre at GIFT City, Gandhinagar, Gujarat, pending approvals from the Ministry of Steel, DIPAM, and other relevant authorities. Average domestic realization remained stable at Rs 5,353 per tonne compared to Rs 5,304 per tonne in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1755015471215,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Limited Approves Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "NMDC Limited's Board of Directors approved the integrated financial results for the quarter ended June 30, 2025, during a meeting held on August 12, 2025. The board approved both standalone and consolidated unaudited financial results, which were submitted along with a limited review report from statutory auditors. The board meeting lasted from 15:00 hrs to 16:50 hrs IST. The financial results and related disclosures have been made available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1755012827486,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Reports Mixed Q1 Results with Revenue Growth but Lower Margins",
            "Summary": "NMDC reported quarterly revenue of 66 billion rupees, up from 53.8 billion rupees in the same period last year. Net profit remained relatively stable at 19.7 billion rupees compared to 19.8 billion rupees year-over-year. However, EBITDA declined to 24.8 billion rupees from 25.7 billion rupees, while EBITDA margin compressed significantly to 37.37% from 47.79% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755009825320,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Reports July 2025 Production at 3.09 MT and Sales at 3.46 MT",
            "Summary": "NMDC reported production of 3.09 million tonnes and sales of 3.46 million tonnes for July 2025. The company's sales volume exceeded its production during the month.",
            "Sentiment": "neutral",
            "PublishDate": 1754050081884,
            "Source": "stock"
        },
        {
            "Title": "NMDC Increases Iron Ore Fines and Lump Prices by ₹400 Per Tonne",
            "Summary": "NMDC has announced a price increase of ₹400 per tonne for both iron ore fines and lumps. This pricing adjustment affects the company's key iron ore products.",
            "Sentiment": "positive",
            "PublishDate": 1754020590162,
            "Source": "stock"
        },
        {
            "Title": "NMDC Ltd. Block Trade: 2.29 Million Shares at Rs. 70.34",
            "Summary": "A block trade of approximately 2,287,050 shares of NMDC Ltd. took place on the National Stock Exchange (NSE). The total value of the trade was Rs. 16.09 crores, with shares trading at Rs. 70.34 each.",
            "Sentiment": "neutral",
            "PublishDate": 1752820566000,
            "Source": "block_details"
        },
        {
            "Title": "NMDC Explores Partnership with UAE for Steel and Aluminum Production",
            "Summary": "NMDC is exploring a partnership with the United Arab Emirates to create high-quality steel and aluminum. The focus of this collaboration is on developing the mining value chain. The news indicates potential international cooperation in the metals industry between India and the UAE.",
            "Sentiment": "positive",
            "PublishDate": 1751427985000,
            "Source": "default"
        },
        {
            "Title": "NMDC Ltd: Citi Warns of 12% Potential Downside",
            "Summary": "Citi maintains a 'sell' rating on NMDC Ltd with a price target of ₹60, indicating a potential 11.7% downside. NMDC has cut prices for lump ore and fines. The stock is trading at higher valuations compared to global peers. NMDC is moving towards a formula-based pricing mechanism.",
            "Sentiment": "negative",
            "PublishDate": 1751423946000,
            "Source": "normal_news"
        },
        {
            "Title": "NMDC Reports June Production and Sales Figures",
            "Summary": "NMDC has released its production and sales figures for June. Production increased to 3.57 Mt from 3.37 Mt in the same month last year. However, sales decreased to 3.58 Mt from 3.73 Mt compared to June of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1751415245000,
            "Source": "default"
        },
        {
            "Title": "NMDC Reports Mixed Production and Sales Figures for June",
            "Summary": "NMDC has reported its production and sales figures for June. Production increased to 3.57 million tonnes from 3.37 million tonnes in the same month last year. However, sales decreased to 3.58 million tonnes from 3.73 million tonnes year over year.",
            "Sentiment": "neutral",
            "PublishDate": 1751372844000,
            "Source": "default"
        },
        {
            "Title": "NMDC Explores Acquisition Options for Essential Minerals Globally",
            "Summary": "NMDC is seeking acquisition opportunities for essential minerals in Africa, Australia, and South America. The company is looking to expand its global presence in the mining sector, focusing on key regions known for mineral resources.",
            "Sentiment": "positive",
            "PublishDate": 1751349590000,
            "Source": "default"
        },
        {
            "Title": "NMDC Predicts Low Indian Iron Ore Prices Due to Weak Export Demand",
            "Summary": "NMDC reports that export demand for Indian iron ore has not fully recovered. The company anticipates that iron ore prices in India will remain low in the coming weeks due to this weak export demand.",
            "Sentiment": "negative",
            "PublishDate": 1751345134000,
            "Source": "default"
        },
        {
            "Title": "NMDC: Iron Ore Prices Cut for Second Consecutive Month",
            "Summary": "NMDC has reduced prices of lump ore by ₹600 to ₹5,700 per tonne and fines by ₹500 to ₹4,850 per tonne, effective July 1. The cuts are attributed to weak global prices, low Chinese demand, and monsoon impact. NMDC is transitioning to a formula-based pricing mechanism and targets 55 million tonnes volume for FY2026.",
            "Sentiment": "negative",
            "PublishDate": 1751342908000,
            "Source": "corporate_action"
        },
        {
            "Title": "NMDC Updates Iron Ore Prices Effective July 1, 2025",
            "Summary": "NMDC has announced new prices for its iron ore products starting July 1, 2025. The company has set the price for Baila Lump (65.5%, 10-40MM) at ₹5,700 per ton and Fines (64%, -10MM) at ₹4,850 per ton.",
            "Sentiment": "neutral",
            "PublishDate": 1751333215000,
            "Source": "default"
        }
    ]
}