{
    "Symbol": "NMSTEEL",
    "ISIN": "INE0TP801012",
    "News": [
        {
            "Title": "NMDC Steel Q3 Loss Narrows to ₹2.4B from ₹7.6B YoY",
            "Summary": "NMDC Steel reports significant improvement in Q3 performance with net loss reducing by 68.42% year-on-year from ₹7.60 billion to ₹2.40 billion, indicating operational recovery.",
            "Sentiment": "positive",
            "PublishDate": 1770111259123,
            "Source": "co_actions_results"
        },
        {
            "Title": "NMDC Steel Reports Rs 115 Crore Loss in Q2, Shares Drop 6.88%",
            "Summary": "NMDC Steel Ltd. swung to a loss of Rs 115 crore in the second quarter, reversing from a profit of Rs 25.6 crore in the first quarter. Revenue increased 0.7% year-on-year to Rs 3,390 crore for the quarter ended September. However, operating earnings fell significantly by 50.4% year-on-year to Rs 417 crore, with EBITDA margin contracting to 6.1%. The company achieved a milestone of producing 2 million tonnes of hot metal in the 2024-25 financial year, representing a 100% increase compared to 9,66,468 tonnes produced in the previous fiscal year. Following the earnings announcement, shares fell as much as 6.88% to Rs 44.39 before closing 6.36% lower at Rs 44.64. The stock has declined 1.22% over the last 12 months but gained 3.59% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1761733064901,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Steel Reports Reduced Quarterly Loss and Revenue Growth",
            "Summary": "NMDC Steel reported a net loss of 1.15 billion rupees in its quarterly results, significantly lower than the previous year's loss of 5.95 billion rupees. The company's revenue increased to 34 billion rupees compared to 15.2 billion rupees in the same period last year, representing more than double the revenue growth year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761729921395,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Steel Receives First BIS License in India for Hot Rolled Steel for Pipeline Transport",
            "Summary": "NMDC Steel has obtained the first Bureau of Indian Standards (BIS) license in India for hot rolled steel used in welded steel pipes for pipeline transport. This certification allows the company to manufacture and supply specialized steel products that meet Indian standards for pipeline infrastructure applications.",
            "Sentiment": "positive",
            "PublishDate": 1760606526804,
            "Source": "stock"
        },
        {
            "Title": "NMDC Steel Reports Strong Q1 Turnaround with 4.07B Rupees EBITDA",
            "Summary": "NMDC Steel delivered a significant turnaround in Q1 results, reporting EBITDA of 4.07 billion rupees compared to a loss of 4.01 billion rupees in the same period last year. The company's EBITDA margin improved dramatically to 12.11% from negative 19.83% year-over-year. Net profit reached 256 million rupees, reversing from a loss of 5.47 billion rupees in the previous year's quarter. Revenue grew substantially to 33.65 billion rupees from 20.23 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755013825228,
            "Source": "earnings"
        },
        {
            "Title": "Newmalayalam Steel: Flat Listing and Immediate Lower Circuit Hit on NSE SME",
            "Summary": "Newmalayalam Steel shares listed at ₹90 on NSE SME without premium. The stock immediately declined 5% post-listing, hitting the lower circuit.",
            "Sentiment": "negative",
            "PublishDate": 1735276636000,
            "Source": "normal_news"
        }
    ]
}