{
    "Symbol": "NOCIL",
    "ISIN": "INE163A01018",
    "News": [
        {
            "Title": "NOCIL Q3FY26 Results: Profit Drops 34% YoY",
            "Summary": "NOCIL Limited reported Q3FY26 standalone net profit of ₹12.20 crores, down 34% from ₹18.51 crores in Q3FY25. Revenue declined 1% to ₹315.84 crores amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1770831915829,
            "Source": "co_actions_results"
        },
        {
            "Title": "NOCIL: Mafatlal Industries pledges 9.59 lakh shares",
            "Summary": "Mafatlal Industries Limited has created a pledge on 9,59,065 equity shares of NOCIL Limited with ICICI Bank as part of security cover changes under their facilities agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1768305979049,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gurukrupa Trust Pledges 31 Lakh NOCIL Shares Under SEBI Disclosure",
            "Summary": "Gurukrupa Trust has pledged 31,00,000 shares of NOCIL Limited and disclosed this transaction to stock exchanges under SEBI takeover regulations. The pledge affects NOCIL shareholders and involves trustee Hrishikesh A. Mafatlal from the Arvind Mafatlal Group.",
            "Sentiment": "neutral",
            "PublishDate": 1764651291923,
            "Source": "corporate_action"
        },
        {
            "Title": "NOCIL Reports 4% Sequential Volume Growth Despite Pricing Pressures and U.S. Tariff Impact",
            "Summary": "NOCIL Limited reported quarterly revenue of Rs. 321 crores with a 4% quarter-on-quarter growth in sales volumes despite facing multiple challenges. The company experienced sequential decline in revenue due to softer price realizations and competitive pricing pressure from imports. Export volumes declined primarily due to U.S. tariff impacts creating uncertainties in international markets. Operating EBITDA stood at Rs. 22 crores with a 7% margin for the quarter. The company has filed anti-dumping petitions on select products with authorities initiating detailed investigations. NOCIL's ongoing TDQ capacity investment at Dahej remains on track with commissioning expected in H1 calendar year 2026. Management expects domestic market demand to remain robust supported by GST rate reductions and infrastructure push. The company continues to face dumping pressure from international producers, particularly from China and Korea, while working on operational efficiency measures and cost optimization initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1762871361474,
            "Source": "earnings"
        },
        {
            "Title": "Nocil Reports 58% Drop in Q2 Net Profit to 173 Million Rupees",
            "Summary": "Nocil reported Q2 net profit of 173 million rupees, down from 415 million rupees in the same period last year. Revenue declined to 3.2 billion rupees from 3.6 billion rupees year-over-year. EBITDA fell to 204 million rupees compared to 365 million rupees previously, while EBITDA margin compressed to 6.36% from 10.06% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1762128811325,
            "Source": "earnings"
        },
        {
            "Title": "NOCIL Plans Capacity-Led Growth Strategy Focusing on Specialty Rubber Chemicals and Exports",
            "Summary": "NOCIL is positioning itself for growth through capacity expansion with a focus on specialty rubber chemicals, margin stability, and exports. The company aims to capitalize on global supply rebalancing and demand revival in tyres and performance materials sectors.",
            "Sentiment": "positive",
            "PublishDate": 1761922501845,
            "Source": "stock"
        },
        {
            "Title": "NOCIL Limited Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "NOCIL Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of Rs. 320.36 crores for the quarter, compared to Rs. 362.23 crores in the previous quarter and Rs. 300.70 crores in the same quarter last year. Net profit after tax stood at Rs. 12.12 crores for the current quarter versus Rs. 17.26 crores in the previous quarter and Rs. 8.15 crores in the corresponding quarter of the previous year. On a consolidated basis, the company reported revenue from operations of Rs. 325.56 crores for the quarter and net profit after tax of Rs. 13.12 crores. The results include the performance of its wholly owned subsidiary, PIL Chemicals Limited. NOCIL operates primarily in the rubber chemicals manufacturing business, which constitutes a single reportable segment.",
            "Sentiment": "neutral",
            "PublishDate": 1761917093484,
            "Source": "earnings"
        },
        {
            "Title": "NOCIL Reports Flat Revenue at Rs 336 Crores in Q1 FY26, Faces Domestic Dumping Pressure",
            "Summary": "NOCIL Limited reported revenue from operations of Rs 336 crores for the quarter ended June 30, 2025, showing flat performance on a sequential basis. The company's EBITDA stood at Rs 31 crores with margins at 9.1%, down from Rs 34 crores in the previous quarter. Profit after tax declined to Rs 17 crores from Rs 21 crores sequentially. The company continues to face dumping pressure in the domestic market and has filed antidumping petitions on key products with the Government of India, which has initiated detailed investigations. Export business showed moderate growth of 3-3.5% in volumes, though latex products were impacted by U.S. tariffs. The company maintains a capacity utilization of 65-67% and expects trial production from its Rs 250 crore expansion project to begin in H1 FY27. NOCIL holds approximately 40% domestic market share and the products under antidumping investigation constitute about 40% of its business.",
            "Sentiment": "neutral",
            "PublishDate": 1755165656944,
            "Source": "earnings"
        },
        {
            "Title": "NOCIL Limited Uploads Audio Recording of Q1 FY2026 Investor Conference Call",
            "Summary": "NOCIL Limited has made available the audio recording of its investors and analyst conference call discussing operational and financial performance for the quarter ended June 30, 2025. The recording has been uploaded on the company's website at www.nocil.com. The company filed this intimation on August 8, 2025, under SEBI listing regulations. NOCIL is listed on BSE with scrip code 500730 and on NSE with symbol NOCIL. The filing was signed by Amit K. Vyas, Assistant Vice President - Legal & Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1754673689235,
            "Source": "stock"
        },
        {
            "Title": "NOCIL Plans ₹250 Crore Investment to Drive Recovery Through Export Growth",
            "Summary": "NOCIL is planning a ₹250 crore investment as part of its recovery strategy. The company is focusing on exports and positioning itself to capitalize on China+1 opportunities in the market.",
            "Sentiment": "positive",
            "PublishDate": 1754579915404,
            "Source": "stock"
        },
        {
            "Title": "NOCIL Reports Decline in Q1 Financial Performance Across Key Metrics",
            "Summary": "NOCIL reported quarterly results showing a decline across major financial metrics. Net profit dropped to 166 million rupees from 272 million rupees in the same period last year. Revenue decreased to 3.4 billion rupees compared to 3.72 billion rupees year-over-year. EBITDA fell to 296 million rupees from 397 million rupees, while EBITDA margin compressed to 8.8% from 10.69% in the corresponding period of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754557106676,
            "Source": "earnings"
        },
        {
            "Title": "NOCIL Limited Schedules Q1 FY26 Earnings Call for August 8, 2025",
            "Summary": "NOCIL Limited has scheduled an earnings call on August 8, 2025, at 2:30 PM IST to discuss operational and financial performance for Q1 FY26. The call will be attended by Managing Director V.S. Anand and President Finance & CFO P. Srinivasan. The company has provided pre-registration details and access numbers for participants, including toll-free numbers for international participants from the USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753352644925,
            "Source": "earnings"
        },
        {
            "Title": "NOCIL Obtains ISO Certification for Investor Services",
            "Summary": "NOCIL has received ISO certification for its investor servicing operations. This certification recognizes the company's commitment to quality standards in managing investor relations.",
            "Sentiment": "positive",
            "PublishDate": 1749029305000,
            "Source": "default"
        },
        {
            "Title": "NOCIL Reports Q4 Results and Dividend Recommendation",
            "Summary": "NOCIL has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA was 340 million rupees, down from 434 million rupees year-over-year, with EBITDA margin decreasing to 10% from 12.17%. Q4 net profit stood at 204 million rupees, compared to 411.3 million rupees year-over-year and 185 million rupees quarter-on-quarter. Revenue for Q4 was 3.4 billion rupees, down from 3.57 billion rupees year-over-year. Additionally, NOCIL has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747320079000,
            "Source": "result"
        },
        {
            "Title": "NOCIL to Consider Q4 Results on May 15",
            "Summary": "NOCIL, a company in the chemical industry, has announced that it will consider and approve its financial results for the fourth quarter on May 15.",
            "Sentiment": "neutral",
            "PublishDate": 1745842216000,
            "Source": "default"
        },
        {
            "Title": "NOCIL Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "NOCIL, a chemical company, has reported its financial results for the third quarter. The company's net profit decreased to 185 million rupees, down from 297 million rupees year-over-year and 415 million rupees quarter-over-quarter. Revenue also saw a decline, coming in at 3.2 billion rupees compared to 3.4 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738846710000,
            "Source": "earnings"
        },
        {
            "Title": "Anti-Dumping Investigation Initiated on TDQ Imports from China",
            "Summary": "An anti-dumping investigation has been initiated concerning imports of '2,2,4-Trimethyl-1,2-Dihydroquinoline' (TDQ) originating in or exported from China PR. This investigation could potentially impact NOCIL, a company likely involved in the production or use of TDQ.",
            "Sentiment": "neutral",
            "PublishDate": 1735702711000,
            "Source": "corporate_action"
        },
        {
            "Title": "NOCIL Reports Q2 FY25 Financial Results",
            "Summary": "NOCIL has reported its financial results for the second quarter of fiscal year 2025. The company's Profit Before Tax (PBT) for Q2 FY25 stands at 324 million rupees, compared to 360 million rupees in the same quarter last year, indicating a year-over-year decrease. Additionally, NOCIL has a deferred tax of 166 million rupees in this quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730123583000,
            "Source": "result"
        },
        {
            "Title": "NOCIL Reports Decline in Q2 EBITDA and Margin",
            "Summary": "NOCIL, a chemical company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 365 million rupees from 443 million rupees in the same quarter last year. Additionally, the EBITDA margin dropped to 10.06% from 12.61% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730123517000,
            "Source": "result"
        },
        {
            "Title": "NOCIL Reports Q2 Financial Results",
            "Summary": "NOCIL has announced its financial results for the second quarter. The company's net profit increased to 415 million rupees, up from 269 million rupees year-over-year and 272 million rupees quarter-over-quarter. Revenue for Q2 stood at 3.6 billion rupees, slightly higher than the 3.51 billion rupees reported in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730123438000,
            "Source": "result"
        }
    ]
}