{
    "Symbol": "NOIDATOLL",
    "ISIN": "INE781B01015",
    "News": [
        {
            "Title": "Noida Toll Bridge Q3FY26 Results Show Strong Recovery",
            "Summary": "Noida Toll Bridge Company reported consolidated revenue of ₹23.28 crore in Q3FY26, marking 126% YoY growth, and swung to profit of ₹15.48 crore from previous year's loss of ₹238.36 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769770628646,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTBCL Delays DND Flyway Work to Feb 2026 Due to GRAP-IV",
            "Summary": "Noida Toll Bridge Company officially announces DND Flyway upgradation delay to February 2026 due to GRAP-IV restrictions and technical temperature requirements affecting construction timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1767338413417,
            "Source": "stocks"
        },
        {
            "Title": "Noida Toll Bridge CEO Remuneration Approved",
            "Summary": "Noida Toll Bridge Company shareholders approved ₹50.00 lakhs annual remuneration for Executive Director & CEO Dheeraj Kumar through postal ballot with 87.61% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1765955360036,
            "Source": "stocks"
        },
        {
            "Title": "Noida Toll Bridge Company Reports Turnaround with Q2FY26 Profit After Previous Year Losses",
            "Summary": "Noida Toll Bridge Company Limited announced quarterly results showing a turnaround in financial performance. On a consolidated basis for Q2FY26, revenue increased 9.71% to Rs 11.75 crore compared to Rs 10.71 crore in Q2FY25. The company reported a profit before tax of Rs 3.78 crore and profit after tax of Rs 3.28 crore in Q2FY26, compared to losses of Rs 5.84 crore in the previous year quarter. For the half-year period H1FY26, consolidated revenue grew 6.88% to Rs 22.84 crore from Rs 21.37 crore in H1FY25, with profit after tax of Rs 7.91 crore versus a loss of Rs 11.15 crore in the corresponding previous period. The Board approved an increase in remuneration for Executive Director CEO Dheeraj Kumar effective December 5, 2025, subject to shareholder approval through postal ballot. The company continues to maintain the DND Flyway serving over 2.5 lakh daily commuters, with advertising revenue remaining the primary income stream. The company shared Rs 1.70 crore of revenue with Noida Authority during H1FY26 as part of the concession agreement.",
            "Sentiment": "positive",
            "PublishDate": 1762879159243,
            "Source": "earnings"
        },
        {
            "Title": "Delhi High Court Provides Temporary Protection to Noida Toll Bridge Company",
            "Summary": "The Delhi High Court has granted temporary protection to Noida Toll Bridge Company. The court's decision provides interim relief to the toll bridge operator, though specific details about the nature of the legal proceedings or the scope of protection were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1759140353103,
            "Source": "stock"
        },
        {
            "Title": "Noida Toll Company Receives Rs. 100.71 Crore Demand from NOIDA Authority, Plans Legal Challenge",
            "Summary": "Noida Toll Company has received a demand of Rs. 100.71 crore from the NOIDA Authority. The company has termed this demand as legally untenable and announced plans to pursue legal recourse against it.",
            "Sentiment": "negative",
            "PublishDate": 1758121705777,
            "Source": "stock"
        },
        {
            "Title": "Noida Toll Bridge Company Approves Quarterly Results and Appoints Secretarial Auditors",
            "Summary": "Noida Toll Bridge Company Limited's Board of Directors approved the standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The board appointed M/s Kumar Wadhwa & Company as secretarial auditors for a five-year term from 2025-26 to 2029-30, subject to shareholder approval at the 29th Annual General Meeting. The same firm was also appointed as scrutinizer for the e-voting process at the AGM. The board finalized the AGM notice, directors' report, corporate governance report, and management discussion and analysis for financial year 2024-25. The trading window for directors and insiders will reopen on August 8, 2025, 48 hours after publication of the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1754392424204,
            "Source": "corporate_action"
        },
        {
            "Title": "Noida Toll Bridge Company: Supreme Court Upholds Ban on DND Flyway Toll Collection",
            "Summary": "The Supreme Court has upheld the Allahabad High Court's ruling prohibiting Noida Toll Bridge Company from collecting tolls on the DND Flyway. The court stated the company has already recovered project costs and substantial profits. The ruling criticized the project cost formula and the Noida Authority's lack of competitive bidding. Following the news, Noida Toll Bridge Co's shares fell over 5% to ₹18.52 on NSE.",
            "Sentiment": "negative",
            "PublishDate": 1734674105000,
            "Source": "order&deals"
        }
    ]
}