{
    "Symbol": "NORBTEAEXP",
    "ISIN": "INE369C01017",
    "News": [
        {
            "Title": "Norben Tea Appoints New Company Secretary & KMP",
            "Summary": "Norben Tea & Exports Limited announces appointment of Ms. Namrata Das as Company Secretary, Key Managerial Personnel, and Compliance Officer effective December 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766051582843,
            "Source": "stocks"
        },
        {
            "Title": "Norben Tea Company Secretary Niraj Tiwari Resigns",
            "Summary": "Norben Tea & Exports confirms resignation of Company Secretary Niraj Tiwari effective December 23, 2025, citing career opportunities outside Kolkata.",
            "Sentiment": "neutral",
            "PublishDate": 1765453280439,
            "Source": "stocks"
        },
        {
            "Title": "Norben Tea Exports Gets Trading Approval for 1.55 Million Equity Shares from Warrant Conversion",
            "Summary": "Norben Tea Exports Limited received approval from NSE and BSE for listing and trading of 1,550,000 equity shares of Rs. 10 each issued at Rs. 17 per share through conversion of preferential warrants. The shares are admitted to trading on both exchanges from November 20, 2025, with distinctive numbers from 13994101 to 15544100 and a lock-in period until June 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763621138251,
            "Source": "corporate_action"
        },
        {
            "Title": "Norben Tea Exports Reports Mixed Performance in Q2 FY2026 Results",
            "Summary": "Norben Tea Exports Limited announced its unaudited financial results for the quarter and six months ended September 30, 2025. The company reported revenue from operations of Rs 59.07 lakhs for Q2, compared to Rs 124.64 lakhs in the previous quarter and Rs 320.65 lakhs in the same quarter last year. For the six-month period, revenue stood at Rs 183.71 lakhs versus Rs 455.34 lakhs in the previous year. The company posted a net loss of Rs 11.20 lakhs for Q2, contrasting with a profit of Rs 28.50 lakhs in Q1. However, for the half-year period, it achieved a net profit of Rs 39.70 lakhs compared to Rs 100.23 lakhs in the previous year. The company's equity share capital increased to Rs 1,554.41 lakhs from Rs 1,175.00 lakhs, reflecting warrant conversions during the period. Total assets grew to Rs 3,163.02 lakhs from Rs 2,806.93 lakhs as of March 31, 2025. The company noted that tea business results are seasonal in nature and quarterly figures should not be considered representative of full-year performance.",
            "Sentiment": "negative",
            "PublishDate": 1762422327480,
            "Source": "earnings"
        },
        {
            "Title": "Norben Tea & Exports Reports Quarterly Profit of ₹28.50 Lakhs",
            "Summary": "Norben Tea & Exports Limited reported unaudited financial results for the quarter ended June 30, 2025. The company posted a net profit of ₹28.50 lakhs compared to a loss of ₹103.25 lakhs in the previous quarter and a profit of ₹3.66 lakhs in the same quarter last year. Revenue from operations stood at ₹123.33 lakhs versus ₹108.30 lakhs in the previous quarter and ₹128.69 lakhs in the corresponding quarter of the previous year. Basic earnings per share improved to ₹0.22 from a loss of ₹0.88 per share in the previous quarter. The company's paid-up equity share capital increased to ₹1,333.61 lakhs from ₹1,296.81 lakhs in the previous quarter. During the quarter, the company allotted 3.68 lakh equity shares through warrant conversion, receiving ₹46.92 lakhs. The company operates primarily in tea cultivation, manufacturing and sales, which is seasonal in nature.",
            "Sentiment": "positive",
            "PublishDate": 1754646644771,
            "Source": "earnings"
        }
    ]
}