{
    "Symbol": "NORTHARC",
    "ISIN": "INE850M01015",
    "News": [
        {
            "Title": "Northern Arc Capital Faces Rs 2.7 Lakh RBI Penalty",
            "Summary": "Northern Arc Capital Limited receives Rs 2.7 lakh penalty from RBI for KYC compliance violations related to absence of automated AML alert software during review period.",
            "Sentiment": "negative",
            "PublishDate": 1769853239388,
            "Source": "stocks"
        },
        {
            "Title": "Northern Arc Q3 Net Profit Jumps 32% to ₹1B",
            "Summary": "Northern Arc Capital reported consolidated net profit of ₹1 billion in Q3, up 32% YoY from ₹756 million. Revenue grew 25% to ₹7.2 billion from ₹5.76 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769784148152,
            "Source": "co_actions_results"
        },
        {
            "Title": "Northern Arc Capital Board Meet on Jan 30, 2026",
            "Summary": "Northern Arc Capital Limited has scheduled its Board meeting for January 30, 2026, to consider Q3FY26 unaudited financial results. Trading window closes till February 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769520997065,
            "Source": "co_actions_results"
        },
        {
            "Title": "Northern Arc Capital completes postal ballot voting",
            "Summary": "Northern Arc Capital Limited successfully concluded its postal ballot process on January 24, 2026, with shareholders approving both resolutions for director appointments through remote e-voting.",
            "Sentiment": "positive",
            "PublishDate": 1769271813316,
            "Source": "co_actions_results"
        },
        {
            "Title": "Northern Arc Capital Gets ₹326 Target on ROE Growth",
            "Summary": "Northern Arc Capital receives ₹326 price target as analysts expect ROE to reach 15.7% by FY28E driven by retail transition. Stock trades at 50-60% discount to peers despite improving prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766589313320,
            "Source": "stocks"
        },
        {
            "Title": "Northern Arc Capital Allots 5,500 Equity Shares Under ESOP Plan",
            "Summary": "Northern Arc Capital's Board approved allotment of 5,500 equity shares of Rs. 10 face value each to option grantees who exercised their options under the company's ESOP Plan 2016. The allotment increases the company's paid-up equity share capital from Rs. 161,56,63,750 to Rs. 1,61,57,18,750, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764854339692,
            "Source": "corporate_action"
        },
        {
            "Title": "Northern Arc Capital Reports Complete Utilization of Rs 4,498.45 Million IPO Proceeds",
            "Summary": "Northern Arc Capital Limited has fully utilized the net proceeds of Rs 4,498.45 million from its IPO for meeting future capital requirements toward onward lending. The company's IPO was conducted from September 16-19, 2024, with a total issue size of Rs 7,770 million comprising a fresh issue of Rs 5,000 million and an offer for sale of Rs 2,770 million. CRISIL Ratings Limited, serving as the monitoring agency, reported no deviations from the stated objectives for the quarter ended September 30, 2025. The entire proceeds were utilized by the quarter ended December 31, 2024. As of September 30, 2025, Rs 223.65 million remains in the company's public offer account, representing unspent issue expenses. Northern Arc Capital operates as a Non-Banking Financial Company registered with RBI and is required to maintain a minimum Capital to Risk Weighted Assets Ratio of 15%.",
            "Sentiment": "neutral",
            "PublishDate": 1762935550035,
            "Source": "stock"
        },
        {
            "Title": "Northern Arc Capital Appoints New Chief People Officer as Umasree Parvathy Pratap Retires",
            "Summary": "Northern Arc Capital Limited announced a leadership change in its senior management. Umasree Parvathy Pratap retired from her position as Chief People Officer effective October 31, 2025, due to superannuation. Moushumi Mandal has been appointed as the new Chief People Officer effective November 1, 2025. Mandal brings 25 years of experience, with 18 years in the financial and technology sectors, including roles at JPMorgan and Citibank. She previously served as Vice President HR at the National Stock Exchange of India Limited and Vice President at Citibank N.A. Her experience spans across multiple geographies including India, Sri Lanka, Bangladesh, Japan, Singapore, Hong Kong, Australia, and New York. She holds a degree in Microbiology and a postgraduate degree in Management with specialization in Human Resources from Mumbai University.",
            "Sentiment": "neutral",
            "PublishDate": 1761920852218,
            "Source": "corporate_governance"
        },
        {
            "Title": "Northern Arc Capital Reports Mixed Q2 Results, Guides for 20%+ AUM Growth",
            "Summary": "Northern Arc Capital reported Q2 consolidated net profit of 917 million rupees, down from 977 million rupees year-over-year. Revenue increased to 6.3 billion rupees from 5.85 billion rupees in the same period. The company has provided guidance for over 20% AUM growth driven by its direct-to-customer operations across MSME, consumer, and rural lending segments. Northern Arc plans to expand its reach through 372 branches and 55 underwriting partners, utilizing advanced digital credit platforms. The company aims to maintain low NPAs while scaling co-lending and on-lending partnerships to sustain profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1761917837184,
            "Source": "stock"
        },
        {
            "Title": "Northern Arc Capital Reports 13% QoQ Growth in Q2FY26 PAT, Appoints New Directors",
            "Summary": "Northern Arc Capital Limited announced quarterly results showing profit after tax grew 13% quarter-on-quarter to INR 92 crore in Q2FY26. The company's Assets Under Management increased 15% year-on-year and 6% quarter-on-quarter to INR 14,166 crore. Credit costs improved to 2.7% from 3.0% in the previous quarter. The Board approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. Additionally, the company appointed Ms. Vidya Krishnan as Additional Director (Non-Executive Independent) for 5 years and Ms. Anuradha Rao as Additional Director (Non-Executive, Non-Independent) for 1 year, both effective October 31, 2025, subject to shareholder approval. The company also amended its Code of Conduct for trading by designated persons. Net worth grew 10% year-on-year to INR 3,663 crore with a capital adequacy ratio of 24.6%.",
            "Sentiment": "positive",
            "PublishDate": 1761915761102,
            "Source": "earnings"
        },
        {
            "Title": "Northern Arc Capital's Independent Director Ms. Anuradha Rao Retires After Completing Second Term",
            "Summary": "Northern Arc Capital Limited announced the retirement of Ms. Anuradha Rao (DIN: 07597195), who served as Non-executive Independent Director and Independent Woman Director of the company. She completed her second and final term as an Independent Director and ceased to be an Independent Director with effect from the closure of business hours on October 30, 2025. The retirement was due to completion of her tenure as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761841509153,
            "Source": "corporate_governance"
        },
        {
            "Title": "Catalyst Trusteeship Releases 40.55 Lakh Northern Arc Capital Shares from Pledge",
            "Summary": "Catalyst Trusteeship Limited released 40,55,000 equity shares of Northern Arc Capital Limited that were previously pledged as security for Non-Convertible Debentures issued by Dvara Holdings. The shares were released back to Dvara Holdings across multiple dates between April and September 2025. Following the release, Catalyst Trusteeship's encumbered shareholding in Northern Arc Capital decreased from 5.14% to 2.63% of the total share capital. The release was conducted in the trustee's capacity as Debenture Trustee for Dvara Holdings' debenture holders. Northern Arc Capital has an equity share capital of 16.14 crore shares of INR 10 each and is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758778473885,
            "Source": "corporate_action"
        },
        {
            "Title": "Northern Arc Capital Shareholders Approve Nine Resolutions Including INR 15,000 Crore Borrowing Limit and INR 5,000 Crore Debenture Issuance",
            "Summary": "Northern Arc Capital Limited held its 17th Annual General Meeting on August 25, 2025, where shareholders approved nine resolutions. Key approvals include adoption of audited financial statements for the year ended March 31, 2025, appointment of Michael Jude Fernandes as director, and appointment of M/s. Alagar & Associates as Secretarial Auditors for five years from April 2025 to March 2030. Shareholders authorized creation of charges on company assets up to INR 15,000 crores and increased borrowing powers to INR 15,000 crores. The meeting also approved issuance of Non-Convertible Debentures up to INR 5,000 crores on private placement basis and expansion of Employee Stock Option Pool by 4,71,209 ESOPs to 94,78,967 total ESOPs. Additionally, remuneration revisions were approved for Non-Executive Independent Director P S Jayakumar and Managing Director Ashish Mehrotra.",
            "Sentiment": "positive",
            "PublishDate": 1756133602827,
            "Source": "corporate_action"
        },
        {
            "Title": "Northern Arc Capital Appoints Sandeep Dhar as Independent Director for Five-Year Term",
            "Summary": "Northern Arc Capital Limited shareholders approved the appointment of Sandeep Dhar as an Independent Director for a five-year term effective May 7, 2025, at the company's Extra-ordinary General Meeting held on August 7, 2025. Dhar holds a bachelor's degree in physics from Delhi University and a Post Graduate Diploma in Business Management from the Institute of Management Technology, Ghaziabad. He has also completed an Advanced Management Program at Wharton Business School. Dhar brings 3.5 decades of experience in the BFSI sector and IT services, having worked across various organizations in India and overseas. He is not related to any of the company's Directors or Key Managerial Personnel and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1754574655540,
            "Source": "corporate_governance"
        },
        {
            "Title": "Northern Arc Capital Fully Utilizes ₹4,498 Crore IPO Proceeds for Onward Lending",
            "Summary": "Northern Arc Capital Limited has fully utilized the net proceeds of ₹4,498.45 crore from its IPO for meeting future capital requirements towards onward lending. The company's monitoring agency report for the quarter ended June 30, 2025, shows complete deployment of funds with no deviations from stated objectives. The IPO was conducted from September 16-19, 2024, raising ₹7,770 crore through fresh issue and offer for sale. CRISIL Ratings Limited, serving as the monitoring agency, confirmed all utilization was as per the offer document disclosures. The company maintains ₹223.65 crore in its public offer account representing unspent issue expenses. As a non-banking financial company, Northern Arc requires maintaining a minimum Capital to Risk Weighted Assets Ratio of 15% as per RBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1753968981334,
            "Source": "stock"
        },
        {
            "Title": "Northern Arc Sets Three-Year Growth Strategy with Direct-Customer Focus and Financial Targets",
            "Summary": "Northern Arc has outlined its strategic plan to achieve two-thirds of its assets under management from the direct-to-customer segment within three years. The company has set financial targets of 3.7%-4% return on assets and 16%-18% return on equity. The strategy will be supported by the company's retail system, technology infrastructure, and detailed portfolio management.",
            "Sentiment": "positive",
            "PublishDate": 1753798374262,
            "Source": "stock"
        },
        {
            "Title": "Northern Arc Capital Reports Mixed Q1 Performance with 53% AUM Growth Despite Margin Pressure",
            "Summary": "Northern Arc Capital Limited announced its quarterly results with Assets Under Management growing 53% to INR 13,351 crores and Gross Transaction Volume reaching INR 7,411 crores. The company's Direct to Customer mix increased to 53% from previous levels. However, profitability metrics showed pressure with Return on Equity declining to 9.3% and Return on Assets falling to 2.4%. Net Interest Margin compressed to 8.9% while Pre-Provision Operating Profit stood at INR 207 crores. The company maintained asset quality with Net NPA at 0.56% and reported Profit After Tax of INR 81 crores. Northern Arc operates across three main segments: Direct to Customer Lending (AUM INR 7,142 crores), Intermediate Retail Credit Solutions (AUM INR 6,209 crores), and Fund Management (AUM INR 3,174 crores). The company serves over 21 lakh direct customers through 369 branches and partners with 54 retail lending partners and 353 origination partners.",
            "Sentiment": "neutral",
            "PublishDate": 1753793488701,
            "Source": "earnings"
        },
        {
            "Title": "Northern Arc Capital Reports Strong Q1 Performance with 26% Jump in Net Profit",
            "Summary": "Northern Arc Capital delivered robust quarterly results with net profit rising to 1.03 billion rupees from 815 million rupees in the same period last year. Revenue increased to 5.9 billion rupees compared to 5.6 billion rupees year-over-year. The company's EBITDA grew to 3.53 billion rupees from 3.17 billion rupees, while EBITDA margin expanded to 59.86% from 56.61% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753791390019,
            "Source": "earnings"
        },
        {
            "Title": "Northern Arc Capital Schedules Q1 FY26 Earnings Conference Call for July 29, 2025",
            "Summary": "Northern Arc Capital Limited has scheduled an earnings conference call on July 29, 2025, at 18:30 hours IST to discuss the company's operational and financial performance for the first quarter ended June 30, 2025. The audio conference call will be open to all investors, analysts, and the general public. The company will be represented by Managing Director & CEO Ashish Mehrotra, CFO Atul Tibrewal, Group Risk Officer & Governance Head Pardhasaradhi Rallabandi, and Head of Investor Relations Chetan Parmar. The call will be based on publicly available information with no unpublished price sensitive information intended for discussion. Universal access numbers and international toll-free numbers have been provided for participation.",
            "Sentiment": "neutral",
            "PublishDate": 1753362667220,
            "Source": "earnings"
        },
        {
            "Title": "Northern Arc Capital: Madhusudan Kela's Fund Acquires Stake as 360 ONE Funds Exit",
            "Summary": "Cohesion MK Best Ideas Sub-Trust, associated with Madhusudan Kela, purchased 10 lakh shares of Northern Arc Capital at ₹208.83 per share. Three 360 ONE Special Opportunities Funds sold their stakes, totaling 13.84% of outstanding equity. BNP Paribas Financial Markets was another significant buyer in the block deal.",
            "Sentiment": "neutral",
            "PublishDate": 1750635959000,
            "Source": "block_deals"
        },
        {
            "Title": "Northern Arc Capital: Shares Plunge After ₹440 Crore Block Deal",
            "Summary": "Northern Arc Capital shares fell up to 8% following a block deal of 2.23 crore shares (13.84% equity) at ₹197 per share, totaling ₹440 crore. The stock is trading 4.7% lower at ₹203.77, below its IPO price of ₹263.",
            "Sentiment": "negative",
            "PublishDate": 1750393781000,
            "Source": "block_deals"
        },
        {
            "Title": "Northern Arc: Large Block Trade on NSE",
            "Summary": "A block trade of approximately 16,693,638 shares of Northern Arc was executed on the National Stock Exchange (NSE) for Rs 327.33 crore. The trade was carried out at a price of Rs 196.08 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1750391326000,
            "Source": "block_details"
        },
        {
            "Title": "Northern Arc Capital Receives RBI Approval for Factoring Business",
            "Summary": "Northern Arc Capital has obtained approval from the Reserve Bank of India (RBI) to engage in factoring business. This approval allows the company to expand its financial service offerings.",
            "Sentiment": "positive",
            "PublishDate": 1749687220000,
            "Source": "default"
        },
        {
            "Title": "Northern Arc Capital Receives RBI Approval for Factoring Operations",
            "Summary": "Northern Arc Capital has obtained approval from the Reserve Bank of India (RBI) to launch factoring operations. This development allows the company to expand its financial services offerings.",
            "Sentiment": "positive",
            "PublishDate": 1749645374000,
            "Source": "default"
        },
        {
            "Title": "Taylor Swift: Pop Star Acquires Rights to Her First Six Albums",
            "Summary": "Taylor Swift has purchased the master recordings of her first six albums from Shamrock Capital, regaining control over her early music catalog. This acquisition ends a long-standing dispute over ownership of her original recordings, which were previously sold without her consent.",
            "Sentiment": "positive",
            "PublishDate": 1748671675000,
            "Source": "normal_news"
        },
        {
            "Title": "Northern Arc Capital Reports Q4 Financial Results",
            "Summary": "Northern Arc Capital has released its Q4 financial results. The company reported revenue of 5.9 billion rupees, compared to 5.4 billion rupees in the same quarter last year. Net profit for Q4 was 467.4 million rupees, down from 819 million rupees year-over-year, but up from 1.02 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747670591000,
            "Source": "result"
        },
        {
            "Title": "360NE Special Opportunities Fund to Sell 2.2% Stake in Northern Arc Capital",
            "Summary": "360NE Special Opportunities Fund plans to sell a 2.2% stake in Northern Arc Capital through block deals on Monday. The floor price is set at 203 per share, with the total block deal valued at 72 crores. B&K Broker will handle the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1746810979000,
            "Source": "default"
        },
        {
            "Title": "Northern Arc Capital to Consider Debt Securities Issuance",
            "Summary": "Northern Arc Capital has scheduled a board meeting on May 19 to discuss and potentially approve raising funds through the issuance of debt securities.",
            "Sentiment": "neutral",
            "PublishDate": 1746705106000,
            "Source": "default"
        },
        {
            "Title": "Northern Arc Capital: Public Shareholders Offload 2.16% Stake for Rs 61 Crore",
            "Summary": "Public shareholders of Northern Arc Capital Ltd. sold a 2.16% stake for Rs 61 crore via open market transactions. Veteran investor Ashish Dhawan acquired the combined 35 lakh shares. The company's Q3 net profit fell 10.8% to Rs 73.2 crore, while revenue rose 17% to Rs 576 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1744221179000,
            "Source": "block_deals"
        },
        {
            "Title": "Northern Arc Capital Reports Strong Q3 Financial Performance",
            "Summary": "Northern Arc Capital has announced its financial results for the third quarter. The company's net profit increased significantly to 1.02 billion rupees, up from 661 million rupees in the same period last year. Revenue also saw growth, reaching 5.6 billion rupees compared to 4.73 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739751634000,
            "Source": "earnings"
        },
        {
            "Title": "Northern Arc Capital Reports Strong Q3 Financial Results",
            "Summary": "Northern Arc Capital has announced its financial results for the third quarter. The company's net profit increased significantly to 1.02 billion rupees, compared to 661 million rupees in the same period last year. Revenue also saw growth, rising to 5.6 billion rupees from 4.73 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739532973000,
            "Source": "earnings"
        },
        {
            "Title": "Donald Trump: New Branded Guitar Line Launched",
            "Summary": "Former President Donald Trump has endorsed a new line of guitars, priced from $1,250 to $10,000. The guitars feature American flag designs and Trump's slogans. The financial relationship between Trump and the guitar sales is unclear, as the website lacks typical licensing disclaimers found on other Trump-branded products.",
            "Sentiment": "neutral",
            "PublishDate": 1732165821000,
            "Source": "normal_news"
        },
        {
            "Title": "Northern Arc: Secures $65M for Climate Fund from Global Firms",
            "Summary": "Northern Arc has obtained $65 million in debt commitments for its maiden climate fund. The US International Development Finance Corporation pledged $50 million, while OeEB, Austria's Development Bank, committed $15 million. The fund, based in GIFT City, will finance growth-stage companies in sectors like solar energy, green buildings, e-mobility, and sustainable agriculture.",
            "Sentiment": "positive",
            "PublishDate": 1730995302000,
            "Source": "normal_news"
        },
        {
            "Title": "Northern Arc Capital: Q2 Profit Jumps 24%, Stock Rises",
            "Summary": "Northern Arc Capital reported a 24% increase in Q2 consolidated net profit to ₹96 crore. Total income rose 34% to ₹585 crore. The stock closed 6.4% higher at ₹246.85, below its IPO price of ₹263.",
            "Sentiment": "positive",
            "PublishDate": 1730214457000,
            "Source": "result"
        },
        {
            "Title": "Northern Arc: Q2FY25 Results Show 74% PPoP Growth",
            "Summary": "Northern Arc reported strong Q2FY25 results with 74% YoY growth in PPoP to INR 212 crore and 24% YoY growth in PAT to INR 98 crore. Lending AUM expanded 22% YoY to INR 12,309 crore. Net Interest Income increased 47% YoY to INR 288 crore. Asset quality remained solid with Gross NPA at 0.60% and Net NPA at 0.18%.",
            "Sentiment": "positive",
            "PublishDate": 1730129762000,
            "Source": "result"
        },
        {
            "Title": "Shilpa Shetty and Raj Kundra: ED Halts Eviction Pending Appeal",
            "Summary": "<p>The <span class='neutral'>Enforcement Directorate (ED)</span> informed the <span class='neutral'>Bombay High Court</span> it <span class='positive'>won't act</span> on <span class='negative'>eviction notices</span> issued to <b>Shilpa Shetty</b> and <b>Raj Kundra</b> until their <span class='neutral'>appeal</span> against a <span class='negative'>property attachment order</span> is decided. The notices, related to a <span class='negative'>money laundering case</span>, affect their <span class='neutral'>Mumbai home</span> and <span class='neutral'>Pune farmhouse</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728558617000,
            "Source": "normal_news"
        },
        {
            "Title": "Northern Arc: Launches 'Finserv Fund' Targeting Rs 1500 Crore",
            "Summary": "<p>Northern Arc's subsidiary NAIM launches '<span class='positive'>Finserv Fund</span>', a <b>Category II AIF</b>, aiming to raise <span class='positive'>Rs 1,500 crore</span>. The fund will focus on <b>six key sectors</b> including <span class='neutral'>MSMEs</span> and <span class='neutral'>Microfinance</span>, targeting <span class='positive'>gross returns of 14.00-14.50% XIRR</span> over four years.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728295783000,
            "Source": "normal_news"
        }
    ]
}