{
    "Symbol": "NOVAAGRI",
    "ISIN": "INE02H701025",
    "News": [
        {
            "Title": "Nova Agritech Q3FY26 Results: Mixed Performance",
            "Summary": "Nova Agritech reports Q3FY26 standalone revenue of ₹2,446.79 lakhs vs ₹4,322.53 lakhs in Q3FY25, while consolidated revenue reaches ₹6,654.57 lakhs vs ₹8,818.91 lakhs YoY.",
            "Sentiment": "negative",
            "PublishDate": 1770881870011,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nova Agritech Gets Biostimulants License Amendment",
            "Summary": "Nova Agritech receives license amendment from Telangana Government for biostimulants production, enabling expansion of product range at its formulation plant facility.",
            "Sentiment": "positive",
            "PublishDate": 1768985792868,
            "Source": "stocks"
        },
        {
            "Title": "Nova Agritech Independent Director Resigns",
            "Summary": "Nova Agritech Limited announces resignation of Independent Director Mr. Kiran Kumar Adapa effective January 12, 2026, due to professional commitments. Board committees reconstituted following the departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768215216519,
            "Source": "stocks"
        },
        {
            "Title": "Nova Agritech Independent Director Resigns",
            "Summary": "Nova Agritech Limited announces resignation of Independent Director Mr. Kiran Kumar Adapa effective January 12, 2026, due to professional commitments. Board committees reconstituted accordingly.",
            "Sentiment": "neutral",
            "PublishDate": 1768215189641,
            "Source": "stocks"
        },
        {
            "Title": "Nova Agritech Limited Submits IPO Proceeds Monitoring Report for Quarter Ended September 30, 2025",
            "Summary": "Nova Agritech Limited filed its monitoring agency report showing complete utilization of Rs. 100.95 crore IPO proceeds across planned objectives including subsidiary investments, plant expansion, and working capital funding. CARE Ratings Limited reported no deviations from stated objects, with Rs. 0.86 crore remaining as unutilized funds in the public issue account as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763068156621,
            "Source": "earnings"
        },
        {
            "Title": "Nova Agritech CEO Srinivasarao Mandalapu Resigns Due to Personal Reasons",
            "Summary": "Nova Agritech Limited announced the resignation of Chief Executive Officer Srinivasarao Mandalapu, effective November 10, 2025. Mandalapu submitted his resignation letter citing personal reasons and confirmed there are no other material reasons for his departure. The company has informed stock exchanges BSE and NSE about the resignation of this key managerial personnel. Mandalapu expressed gratitude to the Board of Directors, management, and colleagues for their support during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1762777535092,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nova Agritech Re-appoints Kiran Kumar Adapa as Independent Director for Second Five-Year Term",
            "Summary": "Nova Agritech Limited shareholders approved the re-appointment of Mr. Kiran Kumar Adapa as Independent Director for a second term of 5 years, effective from March 17, 2026. The decision was made at the company's 18th Annual General Meeting with requisite majority approval. Adapa holds a Bachelor of Science in Horticulture and a Doctorate of Philosophy in Horticulture, with over 26 years of experience as a scientist in horticulture research. He currently works as an Officer on special duty for oil palm development in Telangana Oilfed. The company confirmed that Adapa has not been debarred from holding directorship by any regulatory authority and is not related to any Director, Key Managerial Personnel, or Promoter of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758364986081,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nova Agritech CFO Gunupudi Kamoji Srinivas Resigns to Pursue New Professional Opportunities",
            "Summary": "Nova Agritech Limited announced the resignation of Mr. Gunupudi Kamoji Srinivas as Chief Financial Officer, effective September 8, 2025, to pursue new professional opportunities. The resignation takes effect from the close of business hours on September 8, 2025. The company confirmed that there are no other material reasons for his resignation beyond those stated in the resignation letter.",
            "Sentiment": "neutral",
            "PublishDate": 1757336932240,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nova Agritech Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Nova Agritech reported quarterly results showing revenue growth to 467 million rupees from 419 million rupees year-over-year. However, consolidated net profit declined to 32 million rupees from 43 million rupees in the same period last year. EBITDA decreased to 54 million rupees from 59 million rupees year-over-year, while EBITDA margin compressed to 11.47% from 14.05% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754832751929,
            "Source": "earnings"
        },
        {
            "Title": "Nova Agritech Limited Re-appoints Kiran Kumar Adapa as Independent Director for Second Five-Year Term",
            "Summary": "Nova Agritech Limited's Board of Directors approved the re-appointment of Mr. Kiran Kumar Adapa as Independent Director for a second term of 5 years, effective from March 17, 2026. The decision was made based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval at the 18th Annual General Meeting. Mr. Adapa holds a Bachelor of Science in Horticulture from Andhra Pradesh Agricultural University and a Doctorate of Philosophy in Horticulture from Dr. Y.S.R. Horticultural University. He has over 26 years of experience as a Scientist in Horticulture with extensive research in vegetables, fruits and post-harvest management. He currently works as an Officer on special duty for oil palm development in Telangana Oilfed. The company confirmed that Mr. Adapa has not been debarred from holding the office of Director and is not related to any Director, Key Managerial Personnel or Promoter of the Company.",
            "Sentiment": "positive",
            "PublishDate": 1754743928598,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nova Agritech Reports No Deviation in IPO Fund Utilization for Quarter Ended June 2025",
            "Summary": "Nova Agritech Limited confirmed no deviation or variation in the utilization of proceeds from its Initial Public Offer compared to objectives stated in the Prospectus dated January 28, 2024. The company raised Rs 11,200 lakhs through its IPO with allotment date of January 29, 2024. The Audit Committee reviewed and noted that there is no deviation and the unutilized proceeds of IPO are parked in fixed deposits with scheduled banks. The IPO funds were allocated for investment in subsidiary Nova Agri Sciences Private Limited for setting up a new formulation plant, funding capital expenditure for expansion of existing formulation plant, funding working capital requirements, investment in subsidiary for working capital, and general corporate purposes. CARE Ratings Ltd. serves as the monitoring agency for the fund utilization.",
            "Sentiment": "positive",
            "PublishDate": 1754743605875,
            "Source": "corporate_action"
        },
        {
            "Title": "Nova Agritech Reports Mixed Q1 FY2026 Results with Standalone Revenue Down 64.8% but Consolidated Revenue Up 11.5%",
            "Summary": "Nova Agritech Limited, a manufacturer and distributor of soil health management and crop protection products, announced its Q1 FY2026 financial results. On a standalone basis, the company faced significant challenges with revenue from operations declining 64.8% to ₹1,165.17 lakhs and net profit falling 78.9% to ₹47.30 lakhs. EPS dropped to ₹0.05 from ₹0.72 in the previous year. However, consolidated results showed better performance with revenue from operations growing 11.5% to ₹4,674.85 lakhs, though net profit declined 24.1% to ₹324.54 lakhs. The company's raw material costs increased substantially to ₹3,761.38 lakhs compared to ₹2,650.17 lakhs in the previous year, impacting margins. Nova Agritech completed its IPO in January 2024, raising ₹11,200 lakhs, with major fund allocations planned for subsidiary investments in working capital (₹4,335.85 lakhs), company working capital (₹2,665.47 lakhs), and a new formulation plant (₹1,420.11 lakhs). The board also approved the Directors' Report for FY2025 and set the date for the 18th AGM.",
            "Sentiment": "negative",
            "PublishDate": 1754742185093,
            "Source": "earnings"
        },
        {
            "Title": "Nova Agritech Reports Increased Q3 Profit and Revenue",
            "Summary": "Nova Agritech has announced its financial results for the third quarter. The company's consolidated net profit rose to 106 million rupees, up from 96.4 million rupees in the same period last year. Revenue also increased to 882 million rupees, compared to 784.8 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739261405000,
            "Source": "earnings"
        }
    ]
}