{
    "Symbol": "NPST",
    "ISIN": "INE0FFK01017",
    "News": [
        {
            "Title": "NPST schedules Q3FY26 earnings call for Feb 12",
            "Summary": "Network People Services Technologies Limited announces investor conference call on February 12, 2026 at 6:00 PM to discuss Q3FY26 performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770651366210,
            "Source": "co_actions_results"
        },
        {
            "Title": "NPST Stock Surges 16,270% in Four Years",
            "Summary": "Network People Services Technologies shares delivered phenomenal returns, turning ₹1 lakh into ₹64.5 lakh between 2021-2024, with standout performance in 2023 showing 1,012% gains.",
            "Sentiment": "positive",
            "PublishDate": 1767966609665,
            "Source": "stocks"
        },
        {
            "Title": "NPST Partners with Infinity for Digital Payment Cards",
            "Summary": "Network People Services Technologies Limited announces strategic partnership with Infinity Infoway to embed digital payments into identity cards, transforming student IDs and employee credentials into secure prepaid payment solutions.",
            "Sentiment": "positive",
            "PublishDate": 1767948580865,
            "Source": "co_actions_results"
        },
        {
            "Title": "NPST Partners With Infinity Infoway for Digital Payments",
            "Summary": "Network People Services Technologies announces strategic partnership with Infinity Infoway to integrate digital payment capabilities into identity cards, combining prepaid features with ERP systems for educational institutions and businesses.",
            "Sentiment": "positive",
            "PublishDate": 1767948308863,
            "Source": "stocks"
        },
        {
            "Title": "NPST Launches Bank-in-a-Box Digital Platform",
            "Summary": "Network People Services Technologies unveils comprehensive digital banking solution enabling small and mid-size banks to go fully digital within 12 weeks, featuring UPI/IMPS processing and AI-powered RegTech.",
            "Sentiment": "positive",
            "PublishDate": 1765873265386,
            "Source": "stocks"
        },
        {
            "Title": "Network People Services Tech Secures ₹3 Billion Investment from Tata Mutual Fund",
            "Summary": "Network People Services Tech has successfully raised ₹3 billion in funding from Tata Mutual Fund. This significant capital infusion will impact the company's growth trajectory and provides Tata Mutual Fund with a substantial stake in the technology services sector.",
            "Sentiment": "positive",
            "PublishDate": 1764762117355,
            "Source": "corporate_action"
        },
        {
            "Title": "Network People Services Technologies Gets BSE Approval for Listing 14.46 Lakh Equity Shares",
            "Summary": "Network People Services Technologies Limited received BSE approval to list 14,46,500 equity shares of Rs. 10 face value each, issued at a premium of Rs. 2064 to non-promoters on preferential basis. The company must file additional approvals from NSE and confirmation letters from depositories within seven working days to obtain trading approval.",
            "Sentiment": "positive",
            "PublishDate": 1764238083744,
            "Source": "corporate_action"
        },
        {
            "Title": "NPST Partners with Cosmos Co-operative Bank to Expand Digital Payment Infrastructure",
            "Summary": "Network People Services Technologies Limited has entered into a partnership with Cosmos Co-operative Bank Ltd to expand digital payment acceptance infrastructure for co-operative banks across India using NPST's Qynx platform. The collaboration will enable more than 1,500 co-operative banks with over 11,000 branches to offer QR code and soundbox-based digital payment acceptance, supporting financial inclusion in semi-urban and rural markets.",
            "Sentiment": "positive",
            "PublishDate": 1763619674449,
            "Source": "order&deals"
        },
        {
            "Title": "Network People Services Technologies Receives NSE Approval for 14.46 Lakh Equity Shares and Reports Strong Q2 Performance",
            "Summary": "Network People Services Technologies Limited received in-principle approval from NSE for listing 14,46,500 equity shares allotted on preferential basis and reported quarterly revenue growth of 39% to Rs. 48.61 crore with EBITDA rising 40% to Rs. 15.71 crore. The company expanded its product portfolio with new launches including Banking Connect, Bank-in-a-Box, and Queens platform while maintaining healthy profitability of 20.4% and targeting further growth through diversified payment solutions across TSP and payment platform segments.",
            "Sentiment": "positive",
            "PublishDate": 1763381638745,
            "Source": "corporate_action"
        },
        {
            "Title": "NPST Shares Drop 0.86% Despite Strong Q2 Results and Major PSU Bank Contract Win",
            "Summary": "Network People Services Technologies Limited reported robust second-quarter FY26 results with 39% revenue growth to ₹48.61 crore and secured a significant contract from a large PSU bank with over 3,300 branches. Despite strong financial performance and business expansion including new payment services and fraud detection capabilities, the stock declined 0.86% to ₹1,813.60, remaining well below its 52-week high of ₹3,151.",
            "Sentiment": "positive",
            "PublishDate": 1763099125827,
            "Source": "earnings"
        },
        {
            "Title": "Network People Services Technologies Reports Q2 FY26 Results, Allots Stock Options",
            "Summary": "Network People Services Technologies Limited's Board approved unaudited financial results for the quarter ended September 30, 2025. The company allotted 8,900 equity shares under the NPST Employee Stock Option Plan 2023 for the third tranche. The Board also constituted a Corporate Social Responsibility Committee and reviewed related party transactions for the first half of FY 2025-26. The company confirmed no deviation in utilization of proceeds from its preferential allotment of 14,46,500 equity shares worth Rs. 300 crore, with funds remaining unutilized and invested in fixed deposits with ICICI Bank earning 5% returns. The Board noted payment of penalties for non-compliance under SEBI regulations and implemented corrective measures to strengthen internal compliance controls.",
            "Sentiment": "neutral",
            "PublishDate": 1763003072705,
            "Source": "earnings"
        },
        {
            "Title": "Network People Services Technologies Reports No Fund Utilization in Q2 from Rs 300 Crore Preferential Issue",
            "Summary": "Network People Services Technologies Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no utilization of funds from its Rs 300 crore preferential issue. The company allotted 14,46,500 equity shares at Rs 2,074 per share but had not received in-principle approval from stock exchanges for listing these shares. The entire Rs 300 crore remains unutilized and is invested in a fixed deposit with ICICI Bank earning 5% interest. The funds were received in an escrow account on September 4, 2025, and must be utilized by September 4, 2027. The issue proceeds are allocated for three purposes: Rs 60 crore for global expansion and brand building, Rs 170 crore for accelerating growth through product development and infrastructure enhancement, and Rs 70 crore for general corporate purposes including fundraising costs. CARE Ratings Limited served as the monitoring agency and reported no deviation from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1763001077571,
            "Source": "corporate_action"
        },
        {
            "Title": "Network People Services Tech Reports 46% Decline in Q2 Net Profit",
            "Summary": "Network People Services Tech reported consolidated net profit of 98 million rupees for Q2, down from 182 million rupees in the same quarter last year, representing a 46% year-over-year decline. The company's revenue also decreased to 467 million rupees from 668 million rupees in the previous year's corresponding quarter, marking a 30% drop.",
            "Sentiment": "negative",
            "PublishDate": 1762965529680,
            "Source": "earnings"
        },
        {
            "Title": "NPST Partners with Indian Overseas Bank to Launch Voice-Based UPI Payments for Feature Phone Users",
            "Summary": "Network People Services Technologies Limited (NPST) has been awarded a mandate from Indian Overseas Bank to implement UPI 123Pay, enabling voice-based UPI payments for feature phone users and non-tech-savvy smartphone users. The solution, developed in partnership with MissCallPay, targets India's estimated 850 million individuals who have not yet adopted UPI, including around 400 million feature or button phone users. The system allows customers to make payments through voice or keypad inputs via missed calls and IVR callbacks, operating without mobile data or internet connectivity. The platform supports twelve Indian languages and offers features including balance checks, transaction history, dispute management, and UPI PIN management. NPST, incorporated in 2013 and listed on BSE and NSE, operates as a fintech company specializing in payments and digital banking technology. The company supports over 20 banks and 100 customers, processing more than 18 billion transactions annually, with reported revenue of ₹180 crore and profit after tax of ₹45 crore in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1762471396092,
            "Source": "stock"
        },
        {
            "Title": "NPST Launches 'Banking Connect' and 'Bank-in-a-Box' Products at Global Fintech Fest 2025",
            "Summary": "Network People Services Technologies Limited (NPST) launched two new products at the Global Fintech Fest 2025. 'Banking Connect' is an interoperable internet and mobile banking platform that streamlines banking operations by replacing fragmented integrations with a single, certified connection for scalable digital banking growth. 'Bank-in-a-Box' is a ready-to-deploy digital banking suite enabling banks and fintechs to rapidly launch core banking, payments, and customer engagement services. The solution combines modular technology, regulatory compliance, and plug-and-play integrations to accelerate go-to-market timelines while reducing operational complexity and cost.",
            "Sentiment": "positive",
            "PublishDate": 1760363735762,
            "Source": "stock"
        },
        {
            "Title": "Network People Services Technologies Sets Record Date for Final Dividend and AGM Book Closure",
            "Summary": "Network People Services Technologies Limited has set September 12, 2025 as the record date for determining shareholder eligibility for the final dividend for FY 2024-25. The company also announced book closure from September 22 to 29, 2025 for the upcoming AGM. If approved by shareholders at the AGM, dividend payments will be made on or after October 6, 2025, subject to tax deduction at source. The cut-off date for e-voting eligibility at the AGM has been fixed as September 19, 2025. Payments will be made to beneficial owners holding dematerialized shares and members holding physical shares as per the records on the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1757591878330,
            "Source": "corporate_action"
        },
        {
            "Title": "Network People Services Technologies Approves Preferential Share Allotment to Tata Mutual Fund and Key Leadership Appointments",
            "Summary": "Network People Services Technologies Limited's board approved the allotment of 14,46,500 equity shares to Tata Mutual Fund under a preferential issue during a board meeting held on September 5, 2025. The company appointed Singhi & Co., Chartered Accountants as statutory auditors and Ms. Kala Agarwal as secretarial auditor for five-year terms. The board approved re-appointments of key leadership positions: Mr. Abhishek Mishra as Independent Director, Mr. Deepak Chand Thakur as Managing Director, and Mr. Ashish Aggarwal as Joint Managing Director, all for five-year terms. The company approved its annual report for Financial Year 2024-25 and scheduled its 12th Annual General Meeting for September 29, 2025. The board set September 12, 2025 as the record date for dividend entitlement and approved closure of share transfer books from September 22-29, 2025. All appointments are subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1757068722161,
            "Source": "corporate_action"
        },
        {
            "Title": "Network People Services Technologies Issues Corrigendum for Rs. 300 Crore Preferential Share Issue",
            "Summary": "Network People Services Technologies Limited has issued a corrigendum to its Extraordinary General Meeting notice, correcting details about a proposed preferential issue of 14,46,500 equity shares at Rs. 2074 per share to raise up to Rs. 300.04 crore. The Board approved the proposal on August 4, 2025, subject to shareholder approval. Tata Mutual Fund is the proposed allottee, with their shareholding expected to increase from 2.66% to 9.42% post-issue. The funds will be utilized for global expansion and brand building (Rs. 60 crore), product development and strategic acquisitions (Rs. 170 crore), and general corporate purposes (Rs. 70.04 crore), with deployment planned over 24 months. The company obtained a valuation report from registered valuer Mr. Navin Khandelwal dated August 4, 2025. Promoter shareholding will decrease from 64.81% to 60.31% post-issue, with no change in control expected.",
            "Sentiment": "neutral",
            "PublishDate": 1755611726041,
            "Source": "corporate_action"
        },
        {
            "Title": "Network People Services Technologies Reports 25% Revenue Growth, Secures Rs 300 Crore Investment from Tata Mutual Fund",
            "Summary": "Network People Services Technologies Limited reported quarterly revenue growth of 25% from Rs 28 crores to Rs 35 crores, with net profit increasing 19.7% to Rs 7.19 crores. The company received in-principle commitment from Tata Mutual Fund for a preferential issue of Rs 300 crores and secured its first dollar-denominated remittance from Africa operations. The company expanded its business by getting empaneled with government PSUs, securing a major bill payment order from a large PSU, and adding new payment aggregators. Management targets breaching their highest performing quarter by Q3 and plans to use the fundraising for inorganic growth opportunities, acceptance ecosystem expansion, and global market development. The company currently has over 350 employees with 100+ open positions and aims to launch a hosted cloud platform for small to medium-sized banks.",
            "Sentiment": "positive",
            "PublishDate": 1755175184477,
            "Source": "earnings"
        },
        {
            "Title": "Network People Services Technologies Promoters Sell 2.75% Stake Worth ₹5.33 Crore",
            "Summary": "Three promoters of Network People Services Technologies Limited sold a combined 533,333 equity shares through market sale on the National Stock Exchange on August 11, 2025. Savita Vashist disposed of 210,000 shares, Deepak Chand Thakur sold 163,333 shares, and Ashish Aggarwal offloaded 160,000 shares. The transaction represents approximately 2.75% of the company's total paid-up share capital. Following the sale, the collective promoter holding decreased from 67.53% to 64.75%. The shares have a face value of ₹10 each, and the company's total equity share capital remains at 1,93,95,250 shares valued at ₹19.40 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1755005548386,
            "Source": "stock"
        },
        {
            "Title": "Network People Services Technologies Reports 24.83% Revenue Growth in Q1 FY26, Receives ₹300 Crore Funding Commitment",
            "Summary": "Network People Services Technologies Limited reported total income of ₹35.09 crores in Q1 FY26, marking a 24.83% increase from ₹28.11 crores in Q4 FY25. Net profit rose 19.70% to ₹7.19 crores from ₹6.01 crores in the previous quarter. However, EBITDA margin declined to 32.20% from 37.39% due to increased contribution from the Technology Service Provider (TSP) business, which operates at lower margins. The company received an in-principle commitment from Tata Mutual Fund for a preferential issue of approximately ₹300 crores. NPST also achieved its first dollar-denominated remittance from Africa, marking progress in global expansion. The PayTech company is focusing on diversification across payment processing, global payments, RegTech, and ONDC segments. Key business developments include empanelment with government PSUs, securing major Bill Pay orders, and launching a hosted cloud model for payment products with plans to onboard 100+ tenants over three years.",
            "Sentiment": "positive",
            "PublishDate": 1754989655220,
            "Source": "earnings"
        },
        {
            "Title": "Network People Services Technologies Reports Strong Q1 Results with 23.31 Rupees Basic EPS",
            "Summary": "Network People Services Technologies Limited's Board approved unaudited consolidated and standalone financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 2,635.36 lakhs and profit after tax of Rs 600.80 lakhs. On a standalone basis, revenue reached Rs 2,630.08 lakhs with profit after tax of Rs 601.73 lakhs. Basic earnings per share stood at Rs 23.31 for both consolidated and standalone results. The company operates primarily in providing software and payment solutions to the banking and finance sector. During the quarter, the company allotted 5,350 equity shares under its ESOP Plan 2023 and incorporated a wholly-owned subsidiary NPST Global Solutions LLC in Dubai, UAE. The trading window for company securities remains closed until 48 hours after the financial results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1754653082455,
            "Source": "earnings"
        },
        {
            "Title": "Network People Services Technologies Board Approves Rs 300 Crore Preferential Share Issue to Tata Mutual Fund",
            "Summary": "Network People Services Technologies Limited's Board of Directors approved a preferential issue of 14,46,500 equity shares at Rs 2074 per share to raise Rs 3,00,00,41,000. The entire allocation will go to Tata Mutual Fund, a non-promoter investor, which will acquire a 6.94% stake in the company post-allotment. The shares carry a face value of Rs 10 with a premium of Rs 2064 per share. An Extraordinary General Meeting is scheduled for August 28, 2025, to seek shareholder approval for the issue. The company has set August 22, 2025, as the cut-off date for e-voting, which will commence on August 25 and conclude on August 27, 2025. The preferential issue will be conducted on a private placement basis for cash consideration.",
            "Sentiment": "positive",
            "PublishDate": 1754305916264,
            "Source": "corporate_action"
        },
        {
            "Title": "Network People Services Technologies Schedules Board Meeting to Consider Fund Raising Through Preferential Issue",
            "Summary": "Network People Services Technologies Limited has scheduled a Board of Directors meeting for August 4, 2025 to consider a proposal for raising funds through preferential issue of securities. The fund raising proposal is subject to regulatory approvals and shareholder consent, and must comply with provisions under the Companies Act 2013, SEBI regulations, and other applicable laws. The company has closed its trading window for designated and connected persons from July 1, 2025, which will remain closed until 48 hours after declaration of unaudited financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1753885611384,
            "Source": "corporate_action"
        },
        {
            "Title": "Network People Services Tech Receives Purchase Order from Central Bank of India",
            "Summary": "Network People Services Tech has announced that it has received a purchase order from the Central Bank of India. The news suggests a business transaction between the technology services company and one of India's major public sector banks.",
            "Sentiment": "positive",
            "PublishDate": 1743660583000,
            "Source": "order&deals"
        },
        {
            "Title": "Network People Services Tech Receives In-Principle Approval for NSE Main Board Migration",
            "Summary": "Network People Services Tech has obtained in-principle approval to migrate from the SME board to the main board of the National Stock Exchange (NSE). This move represents a significant milestone for the company, potentially increasing its visibility and access to a broader investor base.",
            "Sentiment": "positive",
            "PublishDate": 1741854389000,
            "Source": "corporate_action"
        },
        {
            "Title": "NPST and Hyperface Partner to Expand UPI-Based Credit Access",
            "Summary": "Network People Services Technologies (NPST) has partnered with Hyperface to enable instant credit access via UPI for banks. This collaboration aims to democratize digital credit access for over 400 million UPI users in India, potentially transforming the landscape of digital financial services by making credit more accessible through the widely-used UPI platform.",
            "Sentiment": "positive",
            "PublishDate": 1740702266000,
            "Source": "corporate_action"
        },
        {
            "Title": "NPST and Hyperface Partner to Enable Instant UPI Credit Access for Banks",
            "Summary": "Network People Services Technologies (NPST) has partnered with Hyperface to provide instant credit access through UPI for banks. This collaboration aims to democratize digital credit access for over 400 million UPI users in India, potentially transforming the landscape of digital financial services.",
            "Sentiment": "positive",
            "PublishDate": 1740655257000,
            "Source": "corporate_action"
        },
        {
            "Title": "Network People Services Tech Partners with NSDL Payments Bank",
            "Summary": "Network People Services Tech has entered into a partner referral agreement with NSDL Payments Bank. This partnership is likely aimed at expanding the company's financial services offerings or reach. The agreement suggests a collaborative effort to leverage each other's strengths in the fintech and banking sectors.",
            "Sentiment": "positive",
            "PublishDate": 1736727743000,
            "Source": "corporate_action"
        },
        {
            "Title": "Network People Services Tech Partners with NSDL Payments Bank",
            "Summary": "Network People Services Tech has entered into a partner referral agreement with NSDL Payments Bank. This partnership likely aims to expand the reach and services of both companies in the financial technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1736508253000,
            "Source": "corporate_action"
        },
        {
            "Title": "NPST: 264% Net Profit Surge in Q2 FY'25, Plans Mainboard Listing",
            "Summary": "NPST reported a 264% increase in Q2 FY'25 net profit to ₹18.19 crore. Revenue grew 142% to ₹68.91 crore. The company announced plans for a Mainboard listing and introduced new initiatives including PayJoy and a Risk Intelligence Decisioning Platform.",
            "Sentiment": "positive",
            "PublishDate": 1729584218000,
            "Source": "result"
        }
    ]
}