{
    "Symbol": "NRAIL",
    "ISIN": "INE740D01017",
    "News": [
        {
            "Title": "N R Agarwal Industries Q3FY26 Results Show Strong Growth",
            "Summary": "N R Agarwal Industries reported robust Q3FY26 performance with revenue rising 34.77% YoY to Rs. 56,322.69 lakhs and net profit increasing 13.35% to Rs. 1,442.61 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770810148750,
            "Source": "co_actions_results"
        },
        {
            "Title": "Agarwal Industries Installs 302-kW Rooftop Solar System",
            "Summary": "Textile manufacturer Agarwal Industries commissioned a 302-kW rooftop solar project in Rajasthan, expected to save ₹2.80 million annually in electricity costs while generating 380,000 units of clean energy.",
            "Sentiment": "positive",
            "PublishDate": 1767966800319,
            "Source": "stocks"
        },
        {
            "Title": "NR Agarwal Industries Promoters Pledge 73.55% Stake to Axis Bank",
            "Summary": "Promoters of NR Agarwal Industries Limited have encumbered their entire shareholding of 1,25,17,966 shares (73.55% of total share capital) through non-disposal undertaking to Axis Bank Limited against a term loan of Rs. 112 crores. The security cover value of pledged shares stands at Rs. 618.84 crores, providing a coverage ratio of 5.52 times the loan amount, with proceeds intended for company benefit.",
            "Sentiment": "neutral",
            "PublishDate": 1763722283286,
            "Source": "corporate_action"
        },
        {
            "Title": "N R Agarwal Industries Reports Q2 Net Loss of 15M Rupees Despite Revenue Growth",
            "Summary": "N R Agarwal Industries swung to a net loss of 15 million rupees in Q2 compared to a profit of 83 million rupees in the same period last year, despite revenue increasing to 5.25 billion rupees from 4.28 billion rupees. The company's EBITDA declined to 438 million rupees from 469 million rupees year-over-year, though EBITDA margin improved to 8.36% from 6.29%, with exceptional items of 44 million rupees impacting results.",
            "Sentiment": "negative",
            "PublishDate": 1763127765699,
            "Source": "earnings"
        },
        {
            "Title": "N R Agarwal Industries Resumes Operations at Vapi Unit Following Fire Incident",
            "Summary": "N R Agarwal Industries has resumed operations at its Vapi unit after experiencing a fire incident. The company has successfully restarted production activities at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1759133968655,
            "Source": "stock"
        },
        {
            "Title": "N R Agarwal Industries Converts Share Pledge to Non-Disposal Undertaking with Punjab National Bank",
            "Summary": "N R Agarwal Industries Limited has accepted a sanction letter from Punjab National Bank to convert the pledge on promoters' shares into a Non-Disposal Undertaking (NDU) as collateral for a term loan, effectively releasing the existing pledge. The conversion follows an earlier intimation from May 17, 2025, and upon completion of necessary formalities, the pledge will be substituted with the Non-Disposal Undertaking arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1758888242105,
            "Source": "corporate_action"
        },
        {
            "Title": "N R Agarwal Industries Approves Memorandum Changes and Office Relocation",
            "Summary": "N R Agarwal Industries Ltd shareholders approved alterations to the company's Memorandum of Association at their 32nd Annual General Meeting. The changes include adding a new clause 35A to expand business activities into printing and publishing of newspapers, periodicals, magazines, books, greeting cards, playing cards, and stationery. The company also deleted the entire 'Other Objects' section from Part C of the Memorandum. Additionally, shareholders approved shifting the registered office from Maharashtra to Gujarat, subject to Regional Director approval.",
            "Sentiment": "neutral",
            "PublishDate": 1758726557073,
            "Source": "corporate_action"
        },
        {
            "Title": "N R Agarwal Industries Appoints Mahendra Kumar Gupta as Independent Director",
            "Summary": "N R Agarwal Industries Ltd appointed Shri Mahendra Kumar Gupta as an Independent Director through a special resolution passed at the company's 32nd Annual General Meeting held on September 24, 2025. Gupta has been appointed for a five-year term and brings 30 years of experience in fund raising, strategic business planning, project monitoring, ERP-SAP implementation, internal financial controls mapping, tax planning and compliance management. The company confirmed that Gupta has no relationships with other directors and that none of the company's directors are debarred from holding office.",
            "Sentiment": "positive",
            "PublishDate": 1758724441712,
            "Source": "corporate_governance"
        },
        {
            "Title": "N R Agarwal Industries Reports Fire at Gujarat Plant, Estimates Rs 4 Crore Loss",
            "Summary": "N R Agarwal Industries Limited experienced a fire at its Unit-I plant in Vapi, Gujarat on September 19, 2025 at 6:15 p.m. The fire originated in an electrical transformer and spread to the electrical PCC room, VFDs, ACBs, and LT and HT cables. The company controlled the fire using in-house firefighting systems and GIDC Vapi fire tenders. The estimated monetary loss is approximately Rs 4 crores with production loss of approximately 2300 MT. The company has filed an insurance claim under its Industrial All Risk Insurance Policy and expects the plant to resume operations within 7 days.",
            "Sentiment": "negative",
            "PublishDate": 1758355615889,
            "Source": "stock"
        },
        {
            "Title": "Income Tax Search Conducted at N R Agarwal Industries Offices and Directors' Residences",
            "Summary": "N R Agarwal Industries underwent an income tax search at the company's offices and directors' residences. The company stated that its business operations remain unaffected by the search proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1756822047700,
            "Source": "stock"
        },
        {
            "Title": "NR Agarwal Industries Reports Strong Q1 Results, Recommends New Independent Director",
            "Summary": "NR Agarwal Industries' board approved unaudited financial results for the quarter ended June 30, 2025, showing a net profit of Rs 1,654.88 lakhs compared to Rs 340.28 lakhs in the same quarter last year. Revenue from operations increased to Rs 45,214.23 lakhs from Rs 34,697.87 lakhs year-over-year. The board recommended appointing Mahendra Kumar Gupta as an Independent Director for a 5-year term, subject to shareholder approval. Gupta is a Chartered Accountant with 30 years of experience in fund raising, strategic planning, and compliance management. The company also approved alterations to its Memorandum of Association object clause. Earnings per share improved to Rs 9.72 from Rs 2.00 in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755086155253,
            "Source": "earnings"
        },
        {
            "Title": "N R Agarwal Industries Plans Rs 1,200 Crore Multilayer Board Plant, Closes Unit IV",
            "Summary": "N R Agarwal Industries announced plans to establish a new Multilayer Board plant (Unit VI) with a capacity of 1,000 tonnes per day, requiring an investment of Rs 1,200 crores. The project is expected to be completed within 4 years, with financing mode yet to be decided. The company has approved the purchase of a 2013 make 4.3 meter deckle board paper machine with 1,020 TPD capacity from China and is acquiring land for the project. Simultaneously, the company permanently closed its Unit IV Duplex Board Plant on July 31, 2025, due to non-viable operations. Unit IV contributed Rs 4,795.23 lakhs in turnover, representing 2.89% of total revenue in financial year 2024-25. The company's existing operational capacity stands at 4,44,000 MT per annum with utilization of 3,84,880 MT per annum in FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1753969544361,
            "Source": "stock"
        },
        {
            "Title": "N R Agarwal Industries Launches New Folding Box Board Products",
            "Summary": "N R Agarwal Industries has announced the launch of new Folding Box Board products from its Gujarat unit. The company has expanded its product line with this introduction, potentially aiming to strengthen its position in the packaging industry.",
            "Sentiment": "positive",
            "PublishDate": 1751895426000,
            "Source": "default"
        },
        {
            "Title": "N.R. Agarwal Industries Reports Mixed Q3 Financial Results",
            "Summary": "N.R. Agarwal Industries has released its Q3 financial results. The company reported a net profit of 127 million rupees, which is a decrease compared to 314 million rupees in the same quarter last year. However, revenue increased to 4.2 billion rupees from 3.3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739320558000,
            "Source": "earnings"
        },
        {
            "Title": "N.R. Agarwal Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "N.R. Agarwal Industries has reported a significant decrease in its Q3 EBITDA, which fell to 286 million rupees from 478 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 6.84% from 14.24% in the same period last year. This indicates a substantial reduction in the company's operational efficiency and profitability for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739272251000,
            "Source": "earnings"
        },
        {
            "Title": "N.R. Agarwal Industries Reports Q3 Financial Results",
            "Summary": "N.R. Agarwal Industries has released its third-quarter financial results. The company reported a net profit of 127 million rupees, which is a decrease compared to 314 million rupees in the same quarter of the previous year. However, the company's revenue increased to 4.2 billion rupees from 3.3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739272245000,
            "Source": "earnings"
        }
    ]
}