{
    "Symbol": "NRBBEARING",
    "ISIN": "INE349A01021",
    "News": [
        {
            "Title": "NRB Bearings Q3FY26 Results & Major Announcements",
            "Summary": "NRB Bearings reports Q3FY26 results with ₹2,397 lakhs profit after tax, declares ₹3.20 interim dividend, announces leadership changes and ₹70 crores capacity expansion investment.",
            "Sentiment": "positive",
            "PublishDate": 1770648193321,
            "Source": "co_actions_results"
        },
        {
            "Title": "NRB Bearings subsidiary acquires aerospace firm for ₹27.5 cr",
            "Summary": "NRB Bearings' wholly owned subsidiary Mahant Tool Room Private Limited acquires Mahant Tool Room business for ₹27.50 crore, marking company's entry into aerospace precision components manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1769537330145,
            "Source": "co_actions_results"
        },
        {
            "Title": "NRB Bearings Stock Down 10.58% Despite Market Leadership",
            "Summary": "Despite 60% market share in needle bearings and presence in 90% of Indian vehicles, NRB Bearings stock declined 10.58% YoY due to 57.84% promoter pledging, modest growth, and working capital concerns.",
            "Sentiment": "negative",
            "PublishDate": 1769409460920,
            "Source": "stocks"
        },
        {
            "Title": "NRB Bearings Promoter Pledges 80 Lakh Shares",
            "Summary": "Harshbeena Sahney Zaveri pledges additional 80,00,000 equity shares to Tata Capital Limited on January 21, 2026, increasing total encumbered shares to 3,29,19,877 representing 33.97% of share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1769236780587,
            "Source": "stocks"
        },
        {
            "Title": "NRB Bearings Board Meet on Feb 9 for Q3FY26 Results",
            "Summary": "NRB Bearings Limited has scheduled a board meeting on February 09, 2026, to consider Q3FY26 unaudited financial results and declare second interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769156971088,
            "Source": "co_actions_results"
        },
        {
            "Title": "NRB Bearings CFO Raman Malhotra Resigns, Dhara Dhedhi Named Interim Replacement",
            "Summary": "NRB Bearings Limited announced the resignation of Chief Financial Officer Raman Malhotra effective December 13, 2025, due to personal reasons after submitting his resignation on August 29, 2025. The company appointed Ms. Dhara Dhedhi, a Chartered Accountant with over thirteen years of finance experience and previous roles at Tata Chemicals and Tata Consultancy Services, as Interim CFO effective December 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765287522026,
            "Source": "corporate_governance"
        },
        {
            "Title": "NRB Bearings Forms Joint Venture with Italian Manufacturer Unitec to Expand Industrial Bearings Portfolio",
            "Summary": "NRB Bearings has established a joint venture with Italian manufacturer Unitec (Mondial Group) to broaden its industrial bearings range, with NRB holding a 75% stake in the partnership. The joint venture will manufacture cylindrical roller bearings at a facility in Hyderabad, enhancing NRB's production capabilities and market reach.",
            "Sentiment": "positive",
            "PublishDate": 1764669110285,
            "Source": "order&deals"
        },
        {
            "Title": "NRB Bearings Promoter Creates Pledge on 21.9 Million Shares Worth 22.61% Stake",
            "Summary": "Harshbeena Sahney Zaveri, a promoter of NRB Bearings Limited, has pledged 21,914,877 equity shares representing 22.61% of the company's total share capital in favor of Tata Capital Limited. The pledge was created in two tranches on November 19 and November 20, 2025, with the promoter maintaining a 41.48% total holding in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764565639175,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Bearings Promoters Execute Share Pledge Transfer Between Entities",
            "Summary": "Harshbeena Sahney Zaveri pledged 21,914,877 equity shares (22.61%) of NRB Bearings Limited to Tata Capital Limited on November 19-20, 2025. Simultaneously, Trilochan Singh Sahney Trust-1 released pledge on the same number of shares, maintaining overall promoter pledge percentage unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1764306061951,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Industrial Bearings Promoter Aarti Devesh Sahney Acquires Additional 63,429 Shares",
            "Summary": "Promoter Aarti Devesh Sahney acquired 63,429 equity shares of NRB Industrial Bearings Limited through open market trade, increasing her shareholding from 3.14% to 3.40%. The acquisition was disclosed under SEBI takeover regulations, representing a 0.26% increase in her stake in the industrial bearings company.",
            "Sentiment": "neutral",
            "PublishDate": 1764305751028,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Bearings Reports 21% Earnings Growth in H1 FY26, Announces ₹500 Crore CAPEX Plan",
            "Summary": "NRB Bearings delivered 21% earnings growth in the first half with PAT margins improving to 12% in Q2, while securing lifetime-nominated business worth ₹750 crores from global customers including BMW, Mercedes-Benz, and Stellantis. The company announced a ₹500 crore CAPEX plan over five years to expand into industrial segments and aerospace, targeting ₹2,500 crore revenue by 2031 from current levels.",
            "Sentiment": "positive",
            "PublishDate": 1763477340285,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Reports Strong Q2 FY26 Results with 37.9% PAT Growth",
            "Summary": "NRB Bearings Limited released its investor presentation for Q2 FY26 and half-year results ended September 30, 2025. The company reported consolidated revenue of ₹635.3 crores for H1 FY26, up 8% year-on-year from ₹590.8 crores. EBITDA increased to ₹128.7 crores with a margin of 20.3%. Profit after tax rose 19% to ₹73.3 crores compared to ₹61.6 crores in the previous year. For Q2 FY26 specifically, revenue reached ₹325.2 crores versus ₹310 crores in Q2 FY25. Managing Director Harshbeena Zaveri highlighted strong financial performance for three consecutive quarters and announced expansion plans worth ₹200 crores targeting ₹2,500 crores turnover by 2031. The company operates as India's largest independent bearing manufacturer with 7 manufacturing facilities across India and Thailand, serving 43 countries with 25% export revenue. NRB has fully restored operations after the 2023 Waluj fire incident and completed family settlement demerger in February 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762995323210,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Reports Quarterly Results with Interim Dividend Declaration",
            "Summary": "NRB Bearings Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved both standalone and consolidated financial statements during their meeting on November 10, 2025. The company declared an interim dividend of INR 2.50 per equity share (125% on face value of INR 2 each), which remains unpaid as of November 10, 2025. Additionally, the company paid a final dividend of INR 4.30 per share (215%) for the previous financial year following shareholder approval at the Annual General Meeting held on September 11, 2025. The Board also granted in-principle approval to acquire a minimum 51% stake in Sainey Bearings Private Limited from one of the company's promoters on an arm's length basis. The company's authorized share capital was increased from INR 2,000 lakhs to INR 4,000 lakhs, comprising 200,001,000 equity shares of INR 2 each.",
            "Sentiment": "positive",
            "PublishDate": 1762819895946,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Reports 15.2% Growth in Q2 Net Profit to 406.3 Million Rupees",
            "Summary": "NRB Bearings reported consolidated net profit of 406.3 million rupees in Q2, representing a year-on-year increase from 352.6 million rupees. The company's revenue grew to 3.25 billion rupees compared to 3 billion rupees in the same period last year. EBITDA increased to 535.6 million rupees from 518.3 million rupees year-on-year. However, EBITDA margin declined to 16.47% from 17.19% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762784649355,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Schedules Q2 FY26 Earnings Call for November 12, 2025",
            "Summary": "NRB Bearings Limited has scheduled an earnings call for November 12, 2025, at 14:30 hrs IST to discuss operational and financial performance for Q2 FY26. The company will announce its financial results for the second quarter and half year ended September 30, 2025, on November 10, 2025. The 60-minute call will feature management representatives including Vice Chairman Managing Director Harshbeena Zaveri, Non-Executive Director Satish Rangani, and Chief Financial Officer Raman Malhotra. NRB Bearings is India's leading manufacturer of needle roller bearings with manufacturing facilities in Thane, Aurangabad, Jalna, Pantnagar, and Thailand, serving global clients across Europe, Asia, and the Americas.",
            "Sentiment": "neutral",
            "PublishDate": 1762568278041,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Sees Multiple Promoter Share Transactions Including Inter-Se Transfer and Market Sales",
            "Summary": "NRB Bearings Limited witnessed several promoter shareholding changes through multiple transactions. Harshbeena Sahney Zaveri disclosed a proposed acquisition of 2.70 crore equity shares (27.88% stake) from Trilochan Singh Sahney Trust 1 at nil consideration as an inter-se transfer among promoters, scheduled for November 6, 2025. The company's promoter group includes entities like SZWW General Trading Private Limited, which acquired 5 equity shares in December 2023, maintaining the group's 50.32% holding. Separately, promoter Aarti Devesh Sahney sold equity shares through open market transactions, including 78,000 shares in September 2024 and 2.55 lakh shares in December 2024, reducing her holding to zero. Harshbeena Sahney Zaveri also purchased 10,877 shares through open market in November 2024, increasing her stake to 12.615%. The company has an equity capital of Rs. 19.38 crores comprising 9.69 crore shares of Rs. 2 each, with shares listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761889412218,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Bearings Declares Rs 2.50 Interim Dividend, Announces Key Management Changes and Acquisition Plans",
            "Summary": "NRB Bearings Limited's Board approved an interim dividend of Rs 2.50 per equity share (125%) for shareholders on record as of October 31, 2025, payable within 30 days. The company announced the resignation of Company Secretary Kishor Harish Talreja effective October 24, 2025, due to personal reasons. Ms. Khyati Hemang Danani has been appointed as the new Head - Legal, Company Secretary and Compliance Officer, effective November 3, 2025. She brings over 15 years of experience including 11 years with listed companies in corporate secretarial functions and compliance. The Board also approved acquiring a minimum 99% stake in Sahney Bearings Private Limited for Rs 1,00,000 from promoter Harshbeena Zaveri on an arm's length basis. Sahney Bearings is a recently incorporated entity (June 2025) with no current business operations, intended for exploring business expansion opportunities in the auto components sector.",
            "Sentiment": "positive",
            "PublishDate": 1761545466263,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Bearings Declares 125% Interim Dividend, Announces Key Management Changes and Acquisition Plans",
            "Summary": "NRB Bearings Limited's board approved an interim dividend of Rs. 2.50 per equity share (125%) with a record date of October 31, 2025. The company announced the resignation of Company Secretary Kishor Harish Talreja due to personal reasons, effective October 24, 2025. Ms. Khyati Hemang Danani has been appointed as the new Head - Legal, Company Secretary and Compliance Officer, effective November 3, 2025. She brings over 15 years of experience including 11 years in listed companies handling corporate secretarial functions, compliance, and legal advisory. The board also approved the acquisition of minimum 99% shares in Sahney Bearings Private Limited, a promoter-owned company, at par value to expand into aerospace, industrial, electric and hybrid vehicle applications. Sahney Bearings, incorporated on June 20, 2025, operates in bearings trade with nil turnover and net profit.",
            "Sentiment": "positive",
            "PublishDate": 1761320236299,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Bearings Schedules Board Meeting to Consider Interim Dividend Declaration",
            "Summary": "NRB Bearings Limited has scheduled a Board of Directors meeting on October 24, 2025 to consider and declare an interim dividend on equity shares for Financial Year 2025-26. The company's trading window for securities remains closed from October 1, 2025 and will stay closed until 48 hours after the declaration of unaudited financial results for the quarter and half year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760616562425,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Bearings Acquires 8.5% Stake in Amplus Ampere for ₹4.8 Crore Solar Power Deal",
            "Summary": "NRB Bearings has acquired an 8.5% stake in Amplus Ampere Pvt Ltd for ₹4.8 crore. The acquisition is part of an arrangement to source 15 MWp solar power in Maharashtra. This investment represents NRB Bearings' move into renewable energy sourcing through equity participation in a solar power company.",
            "Sentiment": "positive",
            "PublishDate": 1756207013275,
            "Source": "order&deals"
        },
        {
            "Title": "NRB Bearings Reports Strong Q1 FY26 Results with 10% Revenue Growth and 40.5% EBITDA Jump",
            "Summary": "NRB Bearings Limited announced its Q1 FY26 financial results with standalone revenue reaching Rs. 279 crores, marking 10% year-over-year growth. The company's standalone EBITDA surged 40.5% to Rs. 49 crores with margins improving to 16.9%. Standalone profit after tax increased 50.4% to Rs. 26 crores, while EPS reached Rs. 2.72. On a consolidated basis, revenue grew 7.2% to Rs. 310 crores with EBITDA rising 28.4% to Rs. 61 crores and consolidated PAT up 28.1% to Rs. 33 crores. The growth was driven by strong domestic market performance and expanding presence in mobility segments, with the Industrial segment delivering robust double-digit growth. Managing Director Harshbeena Zaveri attributed the performance to customer-centric approach, operational agility, and material cost optimization. The company serves marquee customers including Mercedes, Volvo, Magna, Borg Warner, ZF, and Meritor across 43 countries and recently received CRISIL's AA-Stable credit rating reaffirmation and a Star Exporter Award.",
            "Sentiment": "positive",
            "PublishDate": 1754920692887,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Appoints Tashwinder Singh as Non-Executive Director",
            "Summary": "NRB Bearings Limited appointed Mr. Tashwinder Singh as an additional Non-Executive Non-Independent Director for a three-year term effective August 09, 2025. The appointment is subject to shareholder approval and was approved during a board meeting held on the same date. Singh, who has 30 years of work experience, serves as CEO and MD of Niyogin Fintech Limited and previously held senior positions at KKR and Citigroup. He is not related to any existing directors or key managerial personnel of the company and is not debarred from holding directorship positions.",
            "Sentiment": "neutral",
            "PublishDate": 1754742922146,
            "Source": "corporate_governance"
        },
        {
            "Title": "NRB Bearings Reports Strong Q1 Results, Re-appoints Managing Director for 5 Years",
            "Summary": "NRB Bearings Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs 278.56 crore compared to Rs 253.35 crore in the same quarter last year. Standalone profit after tax increased to Rs 26.39 crore from Rs 17.55 crore year-on-year. The Board re-appointed Ms. Harshbeena Zaveri as Vice Chairman & Managing Director for five years from October 1, 2025 to September 30, 2030, subject to shareholder and regulatory approvals. The company also approved increasing authorized share capital from Rs 20 crore to Rs 40 crore and updated various policies in line with regulatory amendments. On a consolidated basis, revenue from operations stood at Rs 310.05 crore versus Rs 289.29 crore in the previous year quarter, with profit after tax at Rs 32.81 crore compared to Rs 25.62 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754576410703,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Reports Strong Q1 Growth with 29% Jump in Net Profit",
            "Summary": "NRB Bearings delivered robust quarterly performance with consolidated net profit rising to 321 million rupees from 249 million rupees year-over-year. Revenue increased to 3.1 billion rupees compared to 2.89 billion rupees in the same period last year. The company's EBITDA grew to 514 million rupees from 423 million rupees, while EBITDA margin improved to 16.58% from 14.63% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754571417356,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Recommends Dividend of 4.3 Rupees per Share",
            "Summary": "NRB Bearings has announced a recommendation for a dividend of 4.3 rupees per equity share. This corporate action, if approved, will result in a cash distribution to the company's shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747229728000,
            "Source": "result"
        },
        {
            "Title": "NRB Bearings Reports Mixed Q4 Results with Exceptional Item",
            "Summary": "NRB Bearings reported mixed Q4 results. Revenue increased to 3.3B rupees from 2.85B YoY. EBITDA rose to 603M rupees from 472.2M YoY, with margin improving to 18.30% from 16.59%. PBT grew to 484M rupees from 335M YoY. However, the company reported a net loss of 28M rupees, compared to a profit of 312.2M YoY, impacted by an exceptional item of 476M rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1747229694000,
            "Source": "result"
        },
        {
            "Title": "NRB Bearings: ₹200 Crore Investment for European OEM Expansion",
            "Summary": "NRB Bearings announces ₹200 crore capacity expansion over two years to support ₹600 crore worth of nominated business from European Tier 1 customers. The investment will enhance manufacturing capabilities for various bearings and support programs for BMW, Stellantis, and Renault across next-generation vehicle platforms. Additional ₹12 crore business secured for E-drive platforms of premium EVs.",
            "Sentiment": "positive",
            "PublishDate": 1745812532000,
            "Source": "corporate_action"
        },
        {
            "Title": "NRB Bearings Approves 2 Billion Rupee Investment for Capacity Upgrade",
            "Summary": "NRB Bearings has approved a capital investment of 2 billion rupees to upgrade its production capacity. This significant investment indicates the company's commitment to expanding its operations and improving its manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1745799386000,
            "Source": "default"
        },
        {
            "Title": "NRB Bearings Approves 2 Billion Rupee Capital Investment",
            "Summary": "NRB Bearings has approved a capital investment of 2 billion rupees for capacity upgrade. This significant investment indicates the company's commitment to expanding its production capabilities and potentially improving its market position.",
            "Sentiment": "positive",
            "PublishDate": 1745585674000,
            "Source": "default"
        },
        {
            "Title": "NRB Bearings Reports Q3 Financial Results",
            "Summary": "NRB Bearings announced its Q3 consolidated financial results. Net profit was 213.3 million rupees, down from 1.66 billion rupees year-over-year but up from 352.6 million rupees quarter-over-quarter. Revenue increased to 2.79 billion rupees from 2.58 billion rupees year-over-year. The company reported an exceptional loss of 42.7 million rupees. Profit before tax (PBT) rose to 361.5 million rupees from 283.2 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739146325000,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Reports Q3 Results with Exceptional Loss",
            "Summary": "NRB Bearings has reported its Q3 financial results. The company experienced an exceptional loss of 42.7 million rupees. Despite this, the profit before tax (PBT) for Q3 increased to 361.5 million rupees, compared to 283.2 million rupees in the same quarter of the previous year, showing a year-over-year growth.",
            "Sentiment": "neutral",
            "PublishDate": 1738946832000,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Reports Improved Q3 EBITDA and Margin",
            "Summary": "NRB Bearings has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 448.2 million rupees from 357.3 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 16.09% from 13.83% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738946822000,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Reports Q3 Revenue Increase",
            "Summary": "NRB Bearings has reported a revenue of 2.79 billion rupees for the third quarter, compared to 2.58 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738946815000,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Reports Q3 Consolidated Net Profit of 213.3 Million Rupees",
            "Summary": "NRB Bearings has announced its Q3 consolidated net profit of 213.3 million rupees. This represents a significant decrease from the previous year's figure of 1.66 billion rupees. However, it shows an improvement compared to the previous quarter's profit of 352.6 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738946807000,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings to Consider Q3 Results on February 7",
            "Summary": "NRB Bearings has announced that it will consider its third quarter financial results on February 7. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738159928000,
            "Source": "earnings"
        },
        {
            "Title": "NRB Bearings Reports Improved Q2 EBITDA and Margin",
            "Summary": "NRB Bearings has announced its Q2 financial results. The company's EBITDA increased to 518 million rupees, up from 455 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 17.19% from 16.31% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730989615000,
            "Source": "result"
        },
        {
            "Title": "NRB Bearings Reports Strong Q2 Financial Results",
            "Summary": "NRB Bearings has announced its Q2 consolidated financial results. The company's net profit increased to 353 million rupees, up from 241 million rupees year-over-year and 249 million rupees quarter-over-quarter. Revenue for Q2 reached 3 billion rupees, compared to 2.79 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730989546000,
            "Source": "result"
        },
        {
            "Title": "NRB Bearings Declares Interim Dividend",
            "Summary": "<p>NRB Bearings has announced an <span class=\"positive\">interim dividend</span> of <b>2.50 rupees</b> per equity share for its <span class=\"neutral\">shareholders</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728050574000,
            "Source": "corporate_action"
        }
    ]
}