{
    "Symbol": "NRL",
    "ISIN": "INE0JM501013",
    "News": [
        {
            "Title": "Nupur Recyclers Reports Improved Q3 EBITDA and Margin",
            "Summary": "Nupur Recyclers has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 29.2 million rupees from 17.9 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 8.52% from 2.40% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738340680000,
            "Source": "earnings"
        },
        {
            "Title": "Nupur Recyclers Reports Significant Revenue Decline in Q3",
            "Summary": "Nupur Recyclers has reported a substantial decrease in revenue for the third quarter. The company's revenue stood at 343 million rupees, compared to 746 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738340672000,
            "Source": "earnings"
        },
        {
            "Title": "Nupur Recyclers Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Nupur Recyclers has announced its Q3 consolidated net profit, which stands at 31.6 million rupees. This represents a substantial year-over-year increase from 9 million rupees in the same quarter last year. Additionally, the company has shown a quarter-over-quarter improvement, with profits rising from 47.6 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738340659000,
            "Source": "earnings"
        },
        {
            "Title": "Nupur Recyclers: Expansion into Lithium-ion Battery Recycling by 2027",
            "Summary": "Nupur Recyclers Limited (NRL) announced plans to expand into metal scrap processing and lithium-ion battery recycling, with a new facility set to open by 2027. The move aims to capitalize on growing demand in the electric vehicle sector. NRL's stock was trading at ₹109.70, down 0.63% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1731310710000,
            "Source": "normal_news"
        },
        {
            "Title": "Nupur Recyclers: ₹180 Million Investment in Aluminium Extrusion Subsidiary",
            "Summary": "Nupur Recyclers Limited invests ₹180 million in its subsidiary, Nupur Extrusion Private Limited, to enter aluminium extrusion manufacturing. The new facility in Haryana aims for 5,000-6,000 tons production capacity by FY 2025-26, targeting solar energy and construction sectors.",
            "Sentiment": "positive",
            "PublishDate": 1729066273000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nupur Recycler: ₹13 Crore Investment Boosts Subsidiary's Capacity",
            "Summary": "<p><span class='positive'>Nupur Recycler Ltd (NRL)</span> invests <span class='positive'>₹13 crore</span> in its subsidiary <b>Frank Metals</b>, aiming to <span class='positive'>increase production capacity</span> from 1,500-2,000 to <span class='positive'>5,000-6,000 tons annually</span>. This follows a previous <span class='positive'>₹27.97 crore investment</span> in March 2024. NRL plans to <span class='positive'>expand product offerings</span> and <span class='positive'>strengthen its position</span> in metal recycling. The company's stock <span class='positive'>rose 2.38%</span> on NSE following the announcement.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728371713000,
            "Source": "corporate_action"
        }
    ]
}