{
    "Symbol": "NSIL",
    "ISIN": "INE023A01030",
    "News": [
        {
            "Title": "Nalwa Sons Investments shareholders approve directors",
            "Summary": "Nalwa Sons Investments Limited shareholders approved re-appointment of two independent directors through postal ballot with 79.26% votes in favour for both resolutions.",
            "Sentiment": "positive",
            "PublishDate": 1768027806734,
            "Source": "stocks"
        },
        {
            "Title": "Nalwa Sons Investments postal ballot results declared",
            "Summary": "Nalwa Sons Investments Limited declared postal ballot results on January 10, 2026, with both special resolutions for re-appointment of independent directors passing with 79.26% approval.",
            "Sentiment": "positive",
            "PublishDate": 1768027594339,
            "Source": "stocks"
        },
        {
            "Title": "Nalwa Sons Investments postal ballot results declared",
            "Summary": "Nalwa Sons Investments Limited successfully passed two special resolutions through postal ballot on January 10, 2026, reappointing two independent directors for second terms.",
            "Sentiment": "positive",
            "PublishDate": 1768027561902,
            "Source": "stocks"
        },
        {
            "Title": "Nalwa Sons Seeks Approval for Director Re-appointments",
            "Summary": "Nalwa Sons Investments initiates postal ballot for re-appointing two independent directors for second five-year terms. Remote e-voting scheduled from December 11, 2025 to January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765383652686,
            "Source": "stocks"
        },
        {
            "Title": "Nalwa Sons Investments Seeks Shareholder Approval for Independent Directors' Re-appointment",
            "Summary": "Nalwa Sons Investments Limited has issued a postal ballot notice seeking shareholder approval for re-appointing Mr. Kanwaljit Singh Thind and Mrs. Shruti Shrivastava as independent directors for a second term of five consecutive years from January 21, 2026 to January 20, 2031. The remote e-voting period runs from December 11, 2025 to January 9, 2026, with results to be announced by January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765363886976,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nalwa Sons Investments Reports ₹1,285 Crore Quarterly Profit Despite ₹301 Crore Loss on Preference Shares",
            "Summary": "Nalwa Sons Investments Limited reported a standalone profit of ₹1,285.1 crore for the quarter ended September 30, 2025, compared to ₹2,324.36 crore in the same quarter last year. The company's total revenue from operations reached ₹2,093.09 crore. However, the company recorded a net loss of ₹301.10 crore on fair value changes during the quarter, primarily due to revising the redemption terms of its Non-Convertible Preference Shares (NCPRS) from the originally scheduled FY 2025-26 to 20 years from their respective allotment dates. On a consolidated basis, the company reported a profit of ₹1,522.85 crore for the quarter. The company's board meeting was held on November 13, 2025, where these unaudited financial results were approved. Earnings per share stood at ₹25.04 on a standalone basis.",
            "Sentiment": "neutral",
            "PublishDate": 1763016880367,
            "Source": "earnings"
        },
        {
            "Title": "Nalwa Sons Investments Reports 55% Decline in Q2 Net Profit and Revenue",
            "Summary": "Nalwa Sons Investments reported a net profit of 143 million rupees for Q2, down from 316 million rupees in the same quarter last year. The company's revenue also declined to 213 million rupees compared to 416 million rupees year-over-year, representing a significant decrease in both profitability and top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1763016396247,
            "Source": "earnings"
        },
        {
            "Title": "Nalwa Sons Investments Reports Mixed Q1 Results with 5.25% Standalone PAT Growth",
            "Summary": "Nalwa Sons Investments Limited reported quarterly results with standalone profit after tax increasing 5.25% year-over-year to ₹2,324.36 lakhs, while revenue remained stable at ₹3,009.17 lakhs. However, consolidated results showed a decline with profit after tax falling 11.71% to ₹2,578.59 lakhs and revenue dropping 6.45% to ₹3,709.18 lakhs. The Investment & Finance segment demonstrated strong recovery compared to the previous quarter, generating ₹3,346.13 lakhs in revenue and ₹3,276.50 lakhs in profit. The company faced significant negative other comprehensive income of ₹37,802.72 lakhs on standalone basis due to fair value changes in equity instruments. Standalone EPS improved to ₹45.25 compared to ₹43.00 in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754981784324,
            "Source": "earnings"
        },
        {
            "Title": "Nalwa Sons Investments Reports Q4 Financial Results",
            "Summary": "Nalwa Sons Investments announced its Q4 consolidated financial results. The company reported a net loss of 264 million rupees, compared to a loss of 17 million rupees in the same quarter last year and 82 million rupees in the previous quarter. Revenue for Q4 stood at 123 million rupees, up from 109 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748434483000,
            "Source": "result"
        },
        {
            "Title": "Nalwa Sons Investments Receives SEBI Settlement Order for Shalimar Paints Matter",
            "Summary": "Nalwa Sons Investments has received a settlement order from the Securities and Exchange Board of India (SEBI) regarding an inadvertent non-compliance under SAST (Substantial Acquisition of Shares and Takeovers) regulations in relation to Shalimar Paints. The settlement suggests that the company has resolved the issue with the regulatory body.",
            "Sentiment": "neutral",
            "PublishDate": 1742342808000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NALWA SONS INVESTMENTS Receives SEBI Settlement Order for Shalimar Paints Matter",
            "Summary": "NALWA SONS INVESTMENTS has received a settlement order from the Securities and Exchange Board of India (SEBI) regarding an inadvertent non-compliance under the SAST (Substantial Acquisition of Shares and Takeovers) regulations in relation to Shalimar Paints.",
            "Sentiment": "neutral",
            "PublishDate": 1742294950000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nalwa Sons Investments Reports Significant Revenue Growth in Q2",
            "Summary": "Nalwa Sons Investments has reported a substantial increase in revenue for the second quarter. The company's revenue rose to 597 million rupees, compared to 266 million rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731567874000,
            "Source": "result"
        },
        {
            "Title": "Nalwa Sons Investments Reports Increased Q2 Profit",
            "Summary": "Nalwa Sons Investments has reported a consolidated net profit of 350 million rupees for the second quarter, compared to 206 million rupees in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731567848000,
            "Source": "result"
        }
    ]
}