{
    "Symbol": "NSLNISP",
    "ISIN": "INE0NNS01018",
    "News": [
        {
            "Title": "NMDC Steel Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "NMDC Steel Limited has scheduled a board meeting on February 03, 2026, to consider and approve unaudited financial results for the quarter ended December 31, 2025. Trading window closed from January 1-5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769687051086,
            "Source": "co_actions_results"
        },
        {
            "Title": "NMDC Steel appoints Amitava Mukherjee as interim CFO",
            "Summary": "NMDC Steel Limited assigns additional charge of Director (Finance) position to Chairman & Managing Director Shri Amitava Mukherjee for three months effective December 6, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769520757069,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Steel appoints Joydeep Dasgupta as Director",
            "Summary": "NMDC Steel Limited assigns additional charge of Director (Personnel) post to Shri Joydeep Dasgupta, Director (Production), for 3 months starting February 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768479833537,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Steel appoints Vinay Kumar as Director Commercial",
            "Summary": "NMDC Steel Limited assigns additional charge of Director (Commercial) post to Shri Vinay Kumar, Director (Technical), for initial 3-month period until April 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768214270473,
            "Source": "stocks"
        },
        {
            "Title": "NMDC announces Board composition change",
            "Summary": "NMDC Limited announces Shri Vishwanath Suresh ceased to be Director with effect from 07.01.2026 following his appointment as CMD of MOIL Limited by Ministry of Steel.",
            "Sentiment": "neutral",
            "PublishDate": 1767795729084,
            "Source": "stocks"
        },
        {
            "Title": "NMDC Steel Limited Reports Financial Results for Quarter and Half-Year Ended September 30, 2025",
            "Summary": "NMDC Steel Limited, a Government of India Enterprise, published its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported total revenue from operations of ₹389.95 crore for the quarter ended September 30, 2025, compared to ₹305.22 crore in the previous quarter and ₹356.75 crore in the corresponding quarter of the previous year. For the half-year period, total revenue was ₹695.17 crore compared to ₹805.80 crore in the previous year. The company recorded a net loss for the quarter of ₹147.25 crore and basic earnings per share of ₹(0.39). The results were published in The Hitavada (English) and Pioneer (Hindi) newspapers and filed with stock exchanges under SEBI regulations. The company's paid-up equity share capital stands at ₹2,900.81 crore.",
            "Sentiment": "negative",
            "PublishDate": 1761832953609,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Steel Limited Submits Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "NMDC Steel Limited has submitted its integrated financial filing and unaudited financial results for the quarter ended June 30, 2025, along with the Limited Review Report from statutory auditors. The company filed these documents with BSE Limited, Calcutta Stock Exchange Limited, and National Stock Exchange of India Limited. The Board Meeting was held from 1700 hrs to 1800 hrs on August 12, 2025. The financial results and related disclosures are available on the company's website at https://nmdcsteel.nmdc.co.in/.",
            "Sentiment": "neutral",
            "PublishDate": 1755015459551,
            "Source": "earnings"
        },
        {
            "Title": "NMDC Steel: Q4 Revenue Rises 34%, Losses Narrow",
            "Summary": "NMDC Steel reported a 34% increase in Q4 revenue to Rs 2,838 crore. EBITDA loss contracted to Rs 291 crore from Rs 656 crore in the previous quarter. Net loss reduced to Rs 473 crore from Rs 758 crore. Share price rose nearly 3% in early trade.",
            "Sentiment": "positive",
            "PublishDate": 1748407916000,
            "Source": "earnings"
        },
        {
            "Title": "NMDC STEEL Reports Q4 Financial Results",
            "Summary": "NMDC STEEL has reported its quarterly financial results. For Q4, the company recorded a net loss of 4.7 billion rupees, which is an improvement compared to the loss of 8.61 billion rupees in the same quarter of the previous year. However, it represents a larger loss compared to the previous quarter's loss of 7.6 billion rupees. The company's revenue for Q4 stood at 28.4 billion rupees, showing an increase from 18.46 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748358493000,
            "Source": "result"
        },
        {
            "Title": "NMDC Steel: Q2 Loss Widens to Rs 595 Crore Despite Revenue Surge",
            "Summary": "NMDC Steel reported a wider loss of Rs 595.37 crore in Q2 FY24, compared to Rs 131.10 crore loss in Q2 FY23. Total income rose to Rs 1,535.46 crore from Rs 290.27 crore year-on-year. Expenses increased significantly to Rs 2,364.39 crore from Rs 464.93 crore in the same period last year. The company recently started commercial operations at its 3 million-tonne Nagar Steel Plant on August 31, 2023.",
            "Sentiment": "negative",
            "PublishDate": 1731413422000,
            "Source": "result"
        }
    ]
}