{
    "Symbol": "NTPC",
    "ISIN": "INE733E01010",
    "News": [
        {
            "Title": "NTPC Adds 125 MW Solar Capacity at Bhadla Project",
            "Summary": "NTPC's subsidiary NGEL declares commercial operation of 125 MW solar capacity at Bhadla project in Rajasthan, increasing NTPC group's total commercial capacity to 86,710 MW.",
            "Sentiment": "positive",
            "PublishDate": 1770189421298,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Partners with Assago Industries",
            "Summary": "NTPC Green Energy has signed an agreement with Assago Industries Private Limited for green ammonia supply and other utilities for green urea plant operations.",
            "Sentiment": "positive",
            "PublishDate": 1770049121050,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Transfers Coal Mines to Mining Subsidiary",
            "Summary": "NTPC Limited has transferred two coal mines - Dulanga in Odisha and Talaipalli in Chhattisgarh - to its wholly owned subsidiary NTPC Mining Limited effective February 1, 2026, as part of its phased coal mining business restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1769940380558,
            "Source": "stocks"
        },
        {
            "Title": "NTPC to Become Sole Promoter of PTC India Limited",
            "Summary": "NTPC Limited's board approves restructuring plan to become sole promoter of PTC India Limited, with other PSU promoters withdrawing their nominee directors and relinquishing promoter rights.",
            "Sentiment": "neutral",
            "PublishDate": 1769774827743,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Q3FY26 Results: Net Profit Rises 5.8% to ₹4,987cr",
            "Summary": "NTPC Limited reported Q3FY26 net profit of ₹4,986.94 crore, up 5.8% YoY. Revenue from operations declined 1.8% to ₹40,643.79 crore. Board declared second interim dividend of ₹2.75 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769773648196,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Executive Director Aditya Dar to Retire",
            "Summary": "NTPC Limited announces the superannuation of Executive Director Shri Aditya Dar on January 31, 2026, as part of senior management changes reported under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769688931628,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Q3FY26 Preview: Muted Power Demand Weighs",
            "Summary": "NTPC expected to report stable Q3FY26 earnings despite weak power demand. Revenue projected up 7.7% YoY to Rs 44,525.3 crore, net profit up 6.6% to Rs 5,023.7 crore. Regulated cost-plus model provides earnings stability.",
            "Sentiment": "neutral",
            "PublishDate": 1769516641582,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Board Meeting Set for January 30 to Review Q3 Results",
            "Summary": "NTPC Limited has scheduled a board meeting for January 30, 2026, to consider Q3FY26 unaudited financial results and declare a second interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769090058754,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Green Energy Signs UP Govt Deal for Renewable Projects",
            "Summary": "NTPC Green Energy has entered into an agreement with the Uttar Pradesh government for renewable energy and green hydrogen projects, marking a significant step in the state's clean energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1769082169289,
            "Source": "stocks"
        },
        {
            "Title": "NTPC's ₹15,000 Cr Chhabra Plant Expansion Faces Cancellation",
            "Summary": "NTPC's proposed ₹15,000 crore expansion of Rajasthan's Chhabra Thermal Power Plant is unlikely to proceed as the MoU with Rajasthan Rajya Vidyut Utpadan Nigam faces cancellation due to critical issues.",
            "Sentiment": "negative",
            "PublishDate": 1769052159745,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Solar Project Reaches Commercial Operation",
            "Summary": "NTPC announces commercial operation date for 37.5 MW solar project, marking another milestone in renewable energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768570195507,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Expands Bhuj Solar Project by 37.5 MW",
            "Summary": "NTPC Green Energy has expanded its Bhuj solar project by adding 37.5 MW capacity, bringing the company's total renewable energy capacity to 8,347.78 MW as it continues its clean energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768530714372,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Adds 37.5MW Solar Capacity",
            "Summary": "NTPC Green Energy Limited announces commercial operation of 37.5MW solar capacity in Bhuj, Gujarat, increasing group's total installed capacity to 8,347.78 MW.",
            "Sentiment": "positive",
            "PublishDate": 1768469313115,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Subsidiary Commissions 300MW Bhadla Solar Project",
            "Summary": "NTPC's subsidiary NGEL declares commercial operation of 300MW capacity at Bhadla Solar PV Project in Rajasthan, boosting group's total installed capacity to 87,287 MW.",
            "Sentiment": "positive",
            "PublishDate": 1768459077709,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Acquires Sinnar Thermal Power for ₹3,800 Cr",
            "Summary": "NTPC Ltd signs deal to acquire Sinnar Thermal Power Ltd through insolvency resolution process. Multiple companies announce major developments including Lemon Tree Hotels' ₹960 cr investment.",
            "Sentiment": "positive",
            "PublishDate": 1768183357870,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raja Venkatraman picks NTPC, NHPC as top energy buys",
            "Summary": "NeoTrader's Raja Venkatraman recommends NTPC above ₹340 (target ₹395) and NHPC above ₹83 (target ₹93) amid India's energy storage boom and 230 GWh capacity requirement by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1768178164177,
            "Source": "stocks"
        },
        {
            "Title": "NTPC-Mahagenco Sign ₹38,000 Cr STPL Deal",
            "Summary": "NTPC and Maharashtra State Power Generation Company Limited (Mahagenco) have signed an agreement for the acquisition of STPL with a total cost of ₹38,000 crores, marking a significant expansion in the power sector.",
            "Sentiment": "positive",
            "PublishDate": 1768176712176,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Plans ₹10,000 Cr Coal-to-SNG Project in Chhattisgarh",
            "Summary": "NTPC announces major coal-to-synthetic natural gas facility at Talaipalli, Chhattisgarh with ₹10,000 crore investment. Project to produce 5 lakh tonnes SNG annually using 25 lakh tonnes coal from captive mines.",
            "Sentiment": "positive",
            "PublishDate": 1768122831369,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Acquires Sinnar Thermal Plant for ₹3,800 Cr",
            "Summary": "NTPC and MAHAGENCO consortium to acquire 100% stake in Sinnar Thermal Power Ltd through insolvency resolution process. The 1,350 MW coal-based plant acquisition will boost NTPC's total capacity to 86,987 MW.",
            "Sentiment": "positive",
            "PublishDate": 1767975294830,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC, Mahagenco sign pact for ₹3,800 cr STPL buy",
            "Summary": "NTPC and Mahagenco executed shareholder agreement for acquiring Sinnar Thermal Power's 1,350 MW plant. Deal worth ₹3,800.14 crore to complete by February 26, 2026, boosting NTPC's capacity to 86,987 MW.",
            "Sentiment": "positive",
            "PublishDate": 1767972371959,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC, Mahagenco Agree to Acquire STPL for ₹38 Billion",
            "Summary": "NTPC and Maharashtra State Power Generation Company (Mahagenco) have reached an agreement to jointly acquire Singareni Thermal Power Limited (STPL) for ₹38 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1767966353732,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Unit Invites Bids for 7 MW Solar Systems in Odisha",
            "Summary": "NTPC Vidyut Vyapar Nigam invites bids for 7 MW rooftop solar installation at NALCO facilities in Odisha. Bid submission deadline is February 2, 2026, with ₹5 million security required.",
            "Sentiment": "neutral",
            "PublishDate": 1767963235978,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Block Trade Worth ₹18.01 Crores on NSE",
            "Summary": "NTPC witnessed a significant block trade on NSE involving 516,949 shares valued at ₹18.01 crores, executed at ₹348.40 per share, indicating institutional interest in the power generation major.",
            "Sentiment": "neutral",
            "PublishDate": 1767773945909,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Block Trade Worth ₹53.45 Crores on NSE",
            "Summary": "NTPC Ltd. witnessed a major block trade on NSE involving 1,521,714 shares worth ₹53.45 crores at ₹351.25 per share, marking significant institutional activity in the power sector stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767588063425,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Confirms Minority Stake Talks with US Nuclear Firm",
            "Summary": "NTPC officially confirms discussions for minority stake acquisition in US-based Clean Core Thorium Energy, marking shift from earlier clarification denying formal agreements.",
            "Sentiment": "positive",
            "PublishDate": 1767352829071,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Plans 30 GW Nuclear Capacity by 2047",
            "Summary": "NTPC targets 30 GW nuclear capacity by 2047, exploring partnerships with Rosatom, EDF, and Holtec for reactor projects. Company evaluating sites across Gujarat, MP, Bihar, and Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1767324790694,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Starts Commercial Operations for 13.98 MW Solar",
            "Summary": "NTPC begins commercial operations for 13.98 MW from Khavda-I Solar Project in Gujarat, pushing overall NTPC Group capacity to 85,637 MW in renewable energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1767059575777,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Completes 23 MW Solapur Solar Project",
            "Summary": "NTPC completes entire 23 MW Solapur Solar PV Project in Maharashtra with final 13 MW phase operational from December 25. Total group capacity reaches 85,623 MW.",
            "Sentiment": "positive",
            "PublishDate": 1766592355806,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy adds 69.04 MW at Khavda project",
            "Summary": "NTPC Green Energy commissioned 69.04 MW solar capacity at its Khavda-I project in Gujarat, bringing total group capacity to 7,996.30 MW. Company reported strong Q2 performance with 131.6% profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1766590301675,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Starts 69.04 MW Solar Project",
            "Summary": "NTPC Green Energy has commenced operations of a 69.04 MW solar project in Khavda-I, Gujarat, bringing total NTPC group capacity to 85,610 MW and NGEL group capacity to 7,996.30 MW.",
            "Sentiment": "positive",
            "PublishDate": 1766578696233,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Forms JV with EDF & Mauritius Subsidiary",
            "Summary": "NTPC receives approval to establish joint venture with EDF Power Solutions in India and creates wholly-owned subsidiary in Mauritius for business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1766502877100,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Receives GST Order from Delhi Tax Authority",
            "Summary": "NTPC Limited has received an order from Assistant Commissioner State Tax, Delhi for payment of tax, interest and penalty under CGST Act/Delhi GST Act. The company plans to file an appeal within prescribed timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1765971470311,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Commissions Additional 78 MW at Nokh Solar Project",
            "Summary": "NTPC declares commercial operation of second phase 78 MW capacity at Nokh Solar Project effective December 18, 2025, maintaining total installed capacity at 60,783 MW.",
            "Sentiment": "positive",
            "PublishDate": 1765949213754,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Tehri PSP Unit III (250 MW) Goes Operational",
            "Summary": "NTPC announces the successful commissioning of Unit III at Tehri Pumped Storage Project, adding 250 MW capacity to India's renewable energy infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1765449624777,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Subsidiary THDC Adds 250MW Unit to Portfolio",
            "Summary": "THDC India Limited declares commercial operation of Unit III (250MW) of Tehri PSP, bringing NTPC Group's total capacity to 85,181MW and THDC's capacity to 3,657MW effective December 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765449399320,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Green Energy Commissions 6.6 MW Wind Project",
            "Summary": "NTPC's renewable energy subsidiary NTPC Green Energy has set the commercial operation date for its 6.6 MW wind project, contributing to the group's total capacity of 84,931 MW.",
            "Sentiment": "positive",
            "PublishDate": 1765376459877,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Adds 6.6 MW Wind Capacity, Total Group Capacity Reaches 84,931 MW",
            "Summary": "NTPC Green Energy Limited declared commercial operations of 6.6 MW wind capacity from a 100 MW hybrid project in Bhuj, Gujarat through its subsidiary Ayana Renewable Power Four Private Limited. The addition increases NTPC Green Energy Group's total installed capacity to 7,645.675 MW and brings NTPC group's overall capacity to 84,931 MW.",
            "Sentiment": "positive",
            "PublishDate": 1765346205202,
            "Source": "corporate_action"
        },
        {
            "Title": "NTPC Receives ESG Rating of 60 from NSE Sustainability Ratings",
            "Summary": "NTPC Limited received an Environmental, Social and Governance (ESG) rating of 60 in the 'Adequate' category from NSE Sustainability Ratings and Analytics Limited, a SEBI registered ESG rating provider. The rating was independently prepared by NSE Sustainability based on publicly available data from NTPC's Financial Year 2024-25, without any engagement from the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765282835115,
            "Source": "corporate_governance"
        },
        {
            "Title": "NTPC Forms Green Energy Joint Venture with Chhattisgarh State Power Company",
            "Summary": "NTPC Ltd has established a subsidiary and joint venture called Chhattisgarh NTPC Green Energy Limited in partnership with Chhattisgarh State Power Generation Company. The joint venture operates with a 74:26 ownership ratio, with NTPC holding the majority stake in this green energy focused entity.",
            "Sentiment": "positive",
            "PublishDate": 1764939376834,
            "Source": "order&deals"
        },
        {
            "Title": "NTPC Transfers Kerandari Coal Mine to Wholly-Owned Subsidiary NTPC Mining Limited",
            "Summary": "NTPC Limited has transferred its Kerandari Coal Mine located in North Karanpura Coalfields, Jharkhand to its wholly-owned subsidiary NTPC Mining Limited effective December 18, 2025. This transfer is part of NTPC's phased approach to move its coal mining business operations to the subsidiary company.",
            "Sentiment": "neutral",
            "PublishDate": 1764594357175,
            "Source": "stock"
        },
        {
            "Title": "NCLT Approves MAHAGENCO-NTPC Consortium's Resolution Plan for Sinnar Thermal Power Limited",
            "Summary": "The National Company Law Tribunal has approved the resolution plan submitted by the MAHAGENCO-NTPC consortium for Sinnar Thermal Power Limited under the Corporate Insolvency Resolution Process. The approval covers the 1350 MW thermal power plant, marking a significant development in the resolution of the distressed power asset.",
            "Sentiment": "positive",
            "PublishDate": 1764547016121,
            "Source": "order&deals"
        },
        {
            "Title": "NTPC Receives Rs 5.42 Lakh Fine Each from NSE and BSE for Non-Compliance with Board Composition Rules",
            "Summary": "NTPC Limited received notices from NSE and BSE imposing fines of Rs 5,42,800 each for non-compliance with Regulation 17(1) of SEBI LODR Regulations 2015 regarding board composition requirements. The company has responded that as a Government company, director appointments are controlled by the President of India through the Ministry of Power, and they are following up for appointment of requisite independent directors to achieve compliance.",
            "Sentiment": "positive",
            "PublishDate": 1764406192389,
            "Source": "order&deals"
        },
        {
            "Title": "NTPC Plans Nuclear Power Projects With 700-1,600 MW Capacity Across Multiple States",
            "Summary": "State-owned NTPC is planning to establish nuclear power projects with capacities ranging from 700 MW to 1,600 MW across various states including Gujarat, Madhya Pradesh, Bihar and Andhra Pradesh, targeting 30 GW of India's proposed 100 GW nuclear capacity by 2047. The company is evaluating land options, exploring overseas uranium asset acquisitions, and will use indigenous pressurised heavy-water reactor technology for smaller plants while considering technology collaborations for 1,600 MW projects.",
            "Sentiment": "positive",
            "PublishDate": 1763276506540,
            "Source": "stock"
        },
        {
            "Title": "NTPC Plans Coal Gasification Project to Produce 5-10 Million Tonnes of Gas",
            "Summary": "NTPC will begin a coal gasification project this fiscal year to produce gas for fuel and feedstock applications. The company plans to produce 5-10 million tonnes of gas from coal at a production cost of USD 10-12 MMBtu. NTPC expects to float tenders for technical consultants by FY26 and will take four years to build the complete ecosystem. The gas will be used internally and sold to other users to maximize profits. NTPC Mining Limited targets 100 MT coal production annually by 2030. The project aligns with the National Coal Gasification Mission's goal of achieving 100 MT coal gasification by 2030. NTPC is also developing a nuclear power project in Rajasthan with NPCIL at a cost of Rs 42,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762957485572,
            "Source": "stock"
        },
        {
            "Title": "NTPC ESG Rating Upgraded from CCC to B by MSCI ESG Ratings",
            "Summary": "NTPC Limited received an ESG rating upgrade from CCC to B by MSCI ESG Ratings. The rating upgrade reflects NTPC's strengthened commitment to and enhanced performance in sustainability, governance and climate responsibility. It underscores the company's ongoing transition towards a cleaner energy portfolio and stronger ESG framework embedded at both execution and management levels.",
            "Sentiment": "positive",
            "PublishDate": 1762943111072,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Plans Rs 1,500 Crore Fundraise Through Non-Convertible Debentures",
            "Summary": "NTPC Green Energy announced plans to raise Rs 1,500 crore through unsecured non-convertible debentures via private placement on November 11, 2025. The bonds will carry a coupon rate of 7.01% per annum with a 10-year tenure, maturing on November 12, 2035. The proceeds will be used for financing capital expenditure, refinancing existing capex, providing inter-corporate loans to subsidiaries and joint ventures, and general corporate purposes. This marks the first debenture issue under the board approval dated April 29, 2025, and the debentures will be listed on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762512263962,
            "Source": "stock"
        },
        {
            "Title": "NTPC Reports Record Capacity Addition of 5,359 MW in Seven Months, Revises 2037 Target to 244 GW",
            "Summary": "NTPC Limited achieved its highest-ever capacity addition of 4,403 MW in the first half of FY26, bringing total group capacity to 83,893 MW, a 10% increase from 76,443 MW in the previous year. The company added another 956 MW in October, totaling 5,359 MW in seven months. NTPC standalone reported total income of ₹84,022 crore for H1 FY26 compared to ₹86,298 crore in the previous period, while profit after tax increased to ₹9,428 crore from ₹9,160 crore. The group's consolidated PAT rose 4% to ₹11,334 crore. NTPC Green Energy Limited (NGEL) showed strong performance with revenue growing 19% to ₹1,292 crore and operating EBITDA margin improving to 88%. The company revised its capacity addition target from 130 GW to 149 GW by 2032 and 244 GW by 2037, requiring an estimated capital expenditure of ₹7 lakh crore by 2032. NTPC declared an interim dividend of ₹2.75 per equity share and reduced fixed cost under-recoveries to ₹625 crore. The Mahi Banswara nuclear project foundation stone was laid, marking NTPC's entry into nuclear energy with four units of 700 MW each at an estimated cost of ₹50,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762466372543,
            "Source": "earnings"
        },
        {
            "Title": "Last Day to Buy BPCL and NTPC Shares for Interim Dividend Eligibility",
            "Summary": "Investors have until today to purchase shares of BPCL and NTPC to qualify for their interim dividends, with both companies setting November 7 as the ex-dividend date. BPCL declared an interim dividend of 75%, equivalent to Rs 7.5 per share, while NTPC announced an interim dividend of 27.5%, translating to Rs 2.75 per share. Shareholders must own the stocks before the ex-dividend date to receive the dividend payouts. The ex-dividend date marks when stocks begin trading without the upcoming dividend value, and purchases made on or after this date do not qualify buyers for the declared dividends.",
            "Sentiment": "neutral",
            "PublishDate": 1762404881489,
            "Source": "corporate_action"
        },
        {
            "Title": "NTPC Commences Commercial Operations of 800 MW Unit at Patratu Plant, Total Capacity Reaches 84,849 MW",
            "Summary": "NTPC announced the commercial start of Unit 1 with 800 MW capacity at Patratu STPP from November 5, 2025. Following this addition, NTPC Group's total installed capacity has reached 84,849 MW.",
            "Sentiment": "positive",
            "PublishDate": 1762231589512,
            "Source": "stock"
        },
        {
            "Title": "NTPC Reports 6% Decline in Power Generation Amid Weak Demand, Adds 4,403MW Capacity",
            "Summary": "NTPC Group's total installed capacity reached 83.9GW, with standalone capacity at 60.7GW. The company's gross power generation decreased 6% year-over-year to 83 billion units in quarterly results. NTPC Group added 4,403MW capacity, comprising 1,732MW on standalone basis, 1,506MW through NTPC Green Energy and joint ventures, and 1,165MW through other joint ventures and subsidiaries. An additional 956MW was commissioned in October. Motilal Oswal maintains a 'Neutral' stance on the stock, citing weak power demand impacting performance.",
            "Sentiment": "negative",
            "PublishDate": 1761899833101,
            "Source": "earnings"
        }
    ]
}