{
    "Symbol": "NTPCGREEN",
    "ISIN": "INE0ONG01011",
    "News": [
        {
            "Title": "NTPC Green Energy Adds 125 MW Solar Capacity",
            "Summary": "NTPC Green Energy Limited declared commercial operation of 125 MW Bhadla Solar PV Project in Rajasthan, increasing total installed capacity to 8813.25 MW from 8688.25 MW.",
            "Sentiment": "positive",
            "PublishDate": 1770132437087,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Commissions 210 MW Solar Project",
            "Summary": "NTPC Green Energy Limited declares commercial operation of 210 MW Khavda-II Solar PV Project in Gujarat, increasing total installed capacity to 8688.25 MW from 8478.25 MW.",
            "Sentiment": "positive",
            "PublishDate": 1769787425728,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Q3FY26 Results Show Mixed Performance",
            "Summary": "NTPC Green Energy reported Q3FY26 standalone profit of ₹60.27 crore, down from ₹89.42 crore YoY, while nine-month profit rose to ₹311.53 crore. Revenue remained stable at ₹446.81 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1769700468829,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Green Energy adds 130.47 MW solar capacity",
            "Summary": "NTPC Green Energy Limited declares commercial operation of 130.47 MW capacity from Khavda-I Solar PV Project in Gujarat, increasing total installed capacity to 8478.25 MW effective January 29, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769590451039,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Signs MoU with UP Government",
            "Summary": "NTPC Green Energy Limited signed an MoU with the Government of Uttar Pradesh on January 22, 2026, at the World Economic Forum in Davos for developing renewable energy and green hydrogen projects in the state.",
            "Sentiment": "positive",
            "PublishDate": 1769081997340,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Green Energy Forms JV with GAIL for Renewables",
            "Summary": "NTPC Green Energy's board approves 50:50 joint venture with GAIL for renewable energy projects. Q2 net profit surged 131.6% to ₹88 crore with revenue up 21.5% to ₹612.3 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768480186251,
            "Source": "co_actions_results"
        },
        {
            "Title": "NTPC Green Commissions 300 MW Bhadla Solar Project",
            "Summary": "NTPC Green Energy Limited successfully commissioned the first 300 MW capacity of its 500 MW Bhadla Solar PV Project in Rajasthan, increasing group capacity to 8,310.28 MW.",
            "Sentiment": "positive",
            "PublishDate": 1768413537619,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Adds 13.98 MW Solar Capacity",
            "Summary": "NTPC Green Energy Limited declares commercial operation of 13.98 MW solar capacity from its Khavda-I Solar PV Project in Gujarat, increasing group's total installed capacity to 8,010.28 MW.",
            "Sentiment": "positive",
            "PublishDate": 1765901432133,
            "Source": "stocks"
        },
        {
            "Title": "NTPC Green Energy Commences 6.6 MW Wind Project Operations, Boosting Group Capacity to 84,931 MW",
            "Summary": "NTPC's subsidiary NTPC Green Energy has set the commercial operation date for its 6.6 MW wind project, marking another milestone in the company's renewable energy expansion. The project contributes to NTPC Group's total installed capacity reaching 84,931 MW, strengthening its position in India's power generation sector.",
            "Sentiment": "positive",
            "PublishDate": 1765345687074,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Incorporates Joint Venture Company in Chhattisgarh for Renewable Energy Projects",
            "Summary": "NTPC Green Energy Limited incorporated Chhattisgarh NTPC Green Energy Limited on December 5, 2025, as a 74:26 joint venture with Chhattisgarh State Power Generation Company Limited. The new subsidiary will develop, operate and maintain renewable energy parks including solar, wind and hybrid projects up to 2GW capacity in Chhattisgarh state.",
            "Sentiment": "positive",
            "PublishDate": 1764938440636,
            "Source": "corporate_action"
        },
        {
            "Title": "NTPC Green Energy Changes Registrar and Share Transfer Agent",
            "Summary": "NTPC Green Energy Limited has appointed Beetal Financial Computer Services Private Limited as its new Registrar and Share Transfer Agent, replacing KFin Technologies Limited following completion of tenure. KFin Technologies will continue providing RTA services until electronic connectivity is shifted to Beetal and confirmations are received from both depositories.",
            "Sentiment": "neutral",
            "PublishDate": 1763984402724,
            "Source": "corporate_action"
        },
        {
            "Title": "Ayana Renewable Power Secures 140 MW RTC Renewable Project at ₹4.35/Unit",
            "Summary": "Ayana Renewable Power, a unit of ONGC NTPC Green, has won a 140 MW round-the-clock renewable energy project through a REMC tender at a tariff of ₹4.35 per unit. This project win strengthens the company's renewable energy portfolio and demonstrates competitive pricing in the clean energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1763802499968,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Signs MoU with Singareni Collieries for Renewable Energy Development",
            "Summary": "NTPC Green Energy has entered into a memorandum of understanding with Singareni Collieries Company to develop renewable energy projects. The partnership between the green energy subsidiary and the coal mining company marks a collaborative approach toward renewable energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763597029021,
            "Source": "order&deals"
        },
        {
            "Title": "NTPC Renewable Energy Completes 75.5 MW Khavda-I Solar Project",
            "Summary": "NTPC Renewable Energy has successfully completed its 75.5 MW Khavda-I Solar Project. The completion increases the company's total renewable energy capacity to 7,639 MW.",
            "Sentiment": "positive",
            "PublishDate": 1763484947097,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy to Issue Rs 1,500 Crore Debentures at 7.01% Coupon Rate",
            "Summary": "NTPC Green Energy Limited announced its decision to issue unsecured non-convertible debentures worth Rs 1,500 crore on November 11, 2025, through private placement. The debentures carry a coupon rate of 7.01% per annum with a tenor of 10 years and 1 day, maturing on November 12, 2035. This represents the first debenture issue under the board resolution dated April 29, 2025. The proceeds will be used for financing capital expenditure, including refinancing and recoupment of capital expenditure already incurred by the company, extending financing for capital expenditure to subsidiaries and joint ventures through inter-corporate loans, and other general corporate purposes. The debentures are proposed to be listed on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762510549738,
            "Source": "corporate_action"
        },
        {
            "Title": "NTPC Green Energy Reports Full Utilization of Rs 10,000 Crore IPO Proceeds",
            "Summary": "NTPC Green Energy Limited has fully utilized the Rs 10,000 crore raised through its Initial Public Offering, according to a monitoring agency report by CARE Ratings Limited for the quarter ended September 30, 2025. The company allocated Rs 7,500 crore for investment in wholly-owned subsidiary NTPC Renewable Energy Limited for debt repayment, Rs 2,446.49 crore for general corporate purposes, and Rs 53.51 crore for issue expenses. Key utilizations included Rs 102.47 crore for interest expenses and Rs 2,352.86 crore invested in joint venture ONGC-NTPC Green Private Limited for the acquisition of Ayana Renewable Power Private Limited. The monitoring agency reported no deviations from the stated objectives of the IPO.",
            "Sentiment": "positive",
            "PublishDate": 1762500729082,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Partners With CTRLS Datacenter For 2 GW Renewable Energy Projects",
            "Summary": "NTPC Green Energy has entered into a partnership with CTRLS Datacenter for renewable energy projects totaling 2 GW capacity.",
            "Sentiment": "positive",
            "PublishDate": 1761923467610,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Reports Strong Q2 Performance with 130% Jump in Net Profit",
            "Summary": "NTPC Green Energy delivered robust Q2 results with consolidated net profit surging to 875.9 million rupees from 380.4 million rupees year-over-year, representing a 130% increase. Revenue grew 21% to 6.12 billion rupees compared to 5.04 billion rupees in the same period last year. EBITDA rose to 5.3 billion rupees from 4.2 billion rupees year-over-year, while EBITDA margin improved to 86.49% from 83.41%, indicating enhanced operational efficiency and profitability across the renewable energy business.",
            "Sentiment": "positive",
            "PublishDate": 1761745148841,
            "Source": "earnings"
        },
        {
            "Title": "NTPC Green Energy Limited Categorized as Schedule A Central Public Sector Undertaking",
            "Summary": "NTPC Green Energy Limited, a subsidiary of NTPC Limited, has been categorized as a Schedule A Central Public Sector Undertaking (CPSE) by the Government of India. The company disclosed this development to stock exchanges NSE and BSE, where it trades under scrip codes NTPCGREEN and 544289 respectively. The categorization was communicated through a government letter dated October 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761657635815,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Partners With Paradip Port Authority For Green Hydrogen Development",
            "Summary": "NTPC Green Energy has signed an agreement with Paradip Port Authority to develop green hydrogen projects at Paradip Port. The partnership aims to establish green hydrogen infrastructure at the port facility.",
            "Sentiment": "positive",
            "PublishDate": 1761578355379,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Commences 9.9 MW Wind Power Operations in Gujarat",
            "Summary": "NTPC Green Energy has started operations of a 9.9 MW wind power project in Gujarat. The renewable energy subsidiary has successfully commissioned this wind power facility, adding to its operational capacity in the wind energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1761232686458,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Adds 37.95 MW Solar Capacity at Gujarat Project",
            "Summary": "NTPC Green Energy Limited announced the commercial operation of 37.95 MW capacity from its Khavda Solar Energy Project in Gujarat, bringing the total operational capacity of this project to 262.075 MW. This addition increases NTPC Green Energy Limited Group's total installed capacity to 7553.675 MW. The capacity became operational from 00:00 hours on October 19, 2025, representing the fourth phase of the 300 MW Khavda Solar Energy Project. Previous phases of 142.2 MW, 32.8 MW, and 49.125 MW were declared operational on June 28, June 30, and August 22, 2025 respectively. The project is being developed by NTPC Renewable Energy Limited, a wholly owned subsidiary of NTPC Green Energy Limited, under the 450 MW Hybrid Tranche V Project.",
            "Sentiment": "positive",
            "PublishDate": 1760811285816,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Adds 95.75 MW Solar Capacity, Total Installed Capacity Reaches 7,515.725 MW",
            "Summary": "NTPC Green Energy Limited announced the commercial operation of 95.75 MW capacity from its 1255 MW Khavda-I Solar PV Project in Gujarat. The project is operated by NTPC Renewable Energy Limited, a wholly owned subsidiary of NTPC Green Energy Limited, under the CPSU scheme Phase-II Tranche-III. The commercial operation became effective from October 18, 2025. Prior to this addition, the company's commercial capacity stood at 7,419.975 MW. With this new capacity, the total installed capacity of the NGEL Group increased to 7,515.725 MW.",
            "Sentiment": "positive",
            "PublishDate": 1760702458513,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Adds 12.5 MW Solar Capacity in Gujarat, Total Capacity Reaches 7,419.975 MW",
            "Summary": "NTPC Green Energy Limited announced that 12.5 MW of solar capacity from its 37.5 MW project in Bhuj, Gujarat has been declared commercially operational. This addition increases the NTPC Green Energy Limited Group's total installed capacity to 7419.975 MW. The solar project is operated by Ayana Renewable Power Four Private Limited, a subsidiary of Ayana Renewable Power Pvt. Ltd., which is a wholly owned subsidiary of joint venture ONGC NTPC Green Private. The commercial operation became effective from October 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760529502920,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Signs MoU with Japan's ENEOS Corporation for Green Hydrogen Products",
            "Summary": "NTPC Green Energy Limited (NGEL), a subsidiary of NTPC Limited, signed a Memorandum of Understanding with Japan's ENEOS Corporation to explore delivering Green Methanol and Green Hydrogen derivative products to ENEOS. The MoU was exchanged on October 10, 2025, at World Expo 2025 in Osaka, Japan. The partnership centers around NGEL's Green Hydrogen Hub at Pudimadaka, Andhra Pradesh, spanning 1200 acres, which is being developed as an integrated hub for green chemicals production and export. The collaboration combines ENEOS's demand for hydrogen derivative products with NGEL's renewable energy initiatives, supporting NGEL's target of achieving a 60 GW renewable energy portfolio by 2032.",
            "Sentiment": "positive",
            "PublishDate": 1760092395491,
            "Source": "order&deals"
        },
        {
            "Title": "NTPC Green Energy Signs Agreement with Gujarat Government for 15 GW Renewable Energy Projects",
            "Summary": "NTPC Green Energy has entered into an agreement with the Gujarat Government to develop solar parks and wind projects. The agreement covers the development of 10 GW solar capacity and 5 GW wind capacity, totaling 15 GW of renewable energy projects in the state.",
            "Sentiment": "positive",
            "PublishDate": 1760009728900,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Declares 25 MW Solar Capacity Operational in Bhuj",
            "Summary": "NTPC Green Energy has declared a 25 MW solar capacity commercially operational in Bhuj. This represents an expansion of the company's renewable energy portfolio through the commissioning of new solar power generation facilities.",
            "Sentiment": "positive",
            "PublishDate": 1758804002507,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Adds 9.9 MW Wind Capacity in Gujarat, Total Capacity Reaches 7,382.475 MW",
            "Summary": "NTPC Green Energy Limited announced the commercial operation of 9.9 MW wind capacity from a 92.4 MW wind project located in Bhuj, Gujarat. The project is operated by Ayana Renewable Power Four Private Limited, a subsidiary of Ayana Renewable Power Pvt. Ltd., which is a wholly owned subsidiary of joint venture ONGC NTPC Green Private. The commercial operation became effective from September 24, 2025. Prior to this addition, NTPC Green Energy Limited Group's commercial capacity stood at 7,372.575 MW. With the new capacity addition, the total installed capacity of the NGEL Group has increased to 7,382.475 MW.",
            "Sentiment": "positive",
            "PublishDate": 1758557773695,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Adds 100 MW Solar Capacity, Total Installed Capacity Reaches 7,372.575 MW",
            "Summary": "NTPC Green Energy Limited announced the commercial operation of 100 MW capacity from a 500 MW solar plant operated by IRCON Renewable Power Limited, a joint venture. The 100 MW capacity (Lot-6) brings the cumulative operational capacity to 400 MW out of the total 500 MW plant capacity. IRCON Renewable Power Limited is a 24% joint venture of Ayana Renewable Power Private Limited, which is a wholly owned subsidiary of ONGC NTPC Green Private Limited, a 50% joint venture of NTPC Green Energy Limited. The commercial operation became effective from 00:00 hours of September 17, 2025. With this addition, NTPC Green Energy Limited Group's total installed capacity increased from 7,272.575 MW to 7,372.575 MW.",
            "Sentiment": "positive",
            "PublishDate": 1757933990248,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Partners with VOC Port Authority for Green Hydrogen Station at Tuticorin Port",
            "Summary": "NTPC Green Energy has signed a memorandum of understanding with VOC Port Authority to establish a green hydrogen fuelling station and hydrogen-based mobility solutions at Tuticorin Port. The partnership aims to develop hydrogen infrastructure and mobility solutions at the port facility.",
            "Sentiment": "positive",
            "PublishDate": 1757086037822,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Expands Solar Portfolio with 25 MW Capacity Addition in Gujarat",
            "Summary": "NTPC Green Energy has added 25 MW of solar power capacity in Bhuj, Gujarat, expanding its renewable energy operations in the region.",
            "Sentiment": "positive",
            "PublishDate": 1756742859184,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Adds 50 MW Solar Capacity at Bhuj Project",
            "Summary": "NTPC Green Energy has added 50 MW of solar power capacity at its Bhuj project. Following this addition, the total group capacity has reached 7,247.6 MW. The overall NTPC Group capacity now stands at 83,341 MW.",
            "Sentiment": "positive",
            "PublishDate": 1756087278538,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Adds 50 MW Solar Capacity in Gujarat, Total Capacity Reaches 7,247.575 MW",
            "Summary": "NTPC Green Energy Limited announced the commercial operation of 50 MW solar capacity from a 150 MW project in Bhuj, Gujarat, effective August 24, 2025. The project is operated by Ayana Renewable Power Four Private Limited, a subsidiary of Ayana Renewable Power Pvt. Ltd., which is wholly owned by joint venture ONGC NTPC Green Private. Prior to this addition, NTPC Green Energy Limited Group's commercial capacity stood at 7,197.575 MW. The new capacity increases the NGEL Group's total installed capacity to 7,247.575 MW.",
            "Sentiment": "positive",
            "PublishDate": 1755881550799,
            "Source": "stock"
        },
        {
            "Title": "Government Proposes GST Reduction for Renewable Energy Sector from 12% to 5%",
            "Summary": "The government has suggested reducing the Goods and Services Tax (GST) rate for renewable energy from the current 12% to 5%. This proposal affects the renewable energy sector, including companies like NTPC Green.",
            "Sentiment": "positive",
            "PublishDate": 1755854940660,
            "Source": "sectoral"
        },
        {
            "Title": "NTPC Renewable Energy Commences 49.125 MW Solar Operations in Gujarat",
            "Summary": "NTPC Renewable Energy, a subsidiary of NTPC Green Energy, has declared commercial operation of 49.125 MW capacity at its 300 MW Khavda Solar Project (Hybrid Tranche V) in Gujarat. The operations commenced on August 22.",
            "Sentiment": "positive",
            "PublishDate": 1755773924560,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Brings Online 265.3 MW of Renewable Capacity in Gujarat",
            "Summary": "NTPC Green Energy Limited declared commercial operation of two renewable energy projects in Gujarat. The company activated 212.5 MW of solar capacity from the Khavda-I Solar PV Project through its wholly owned subsidiary NTPC Renewable Energy Limited. Additionally, 52.8 MW of wind capacity became operational from a hybrid project operated by Ayana Renewable Power Four Private Limited, a subsidiary within NTPC Green Energy's joint venture structure with ONGC. The solar project represents the fourth phase of a larger 1,255 MW development under the CPSU scheme Phase-II Tranche-III. The wind capacity is part of a 129.9 MW hybrid project combining wind and solar technologies.",
            "Sentiment": "positive",
            "PublishDate": 1755621973562,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Unit Wins SECI Auction for Green Ammonia Supply",
            "Summary": "NTPC Green's unit has successfully secured a SECI auction to supply 70,000 metric tons per year of green ammonia at a rate of ₹51.80 per kilogram. This represents a significant contract win for the company in the green energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1754365026675,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Commissions 75 MW Solar Capacity, Bringing Total to 300 MW",
            "Summary": "NTPC Green Energy Limited announced the commissioning of 75 MW capacity (Lot-5) as part of a 500 MW plant owned by IRCON Renewable Power Limited, a joint venture subsidiary. The commissioning became commercially operational from August 6, 2025, bringing the cumulative operational capacity to 300 MW. IRCON Renewable Power Limited is a joint venture of Ayana Renewable Power Pvt. Ltd., which is a wholly owned subsidiary of ONGC NTPC Green Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754329844495,
            "Source": "stock"
        },
        {
            "Title": "NTPC Renewable Energy Wins Green Ammonia Supply Contract Worth Rs. 51.80 per kg",
            "Summary": "NTPC Renewable Energy Limited, a subsidiary of NTPC Green Energy Limited, has secured a contract to supply 70,000 metric tonnes per annum of Green Ammonia to Krishana Phoschem Limited in Meghnagar, Madhya Pradesh. The company won the bid through an e-reverse auction conducted by Solar Energy Corporation of India (SECI) at a rate of Rs. 51.80 per kg. This contract is part of SECI's larger tender for 7.24 lakh MT/Year of Green Ammonia across 13 locations in India.",
            "Sentiment": "positive",
            "PublishDate": 1754326242128,
            "Source": "order&deals"
        },
        {
            "Title": "NTPC Green Energy Reports No Deviations in IPO Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "NTPC Green Energy Limited submitted its monitoring agency report for IPO fund utilization for the quarter ended June 30, 2025, prepared by CARE Ratings Limited. The company raised Rs. 10,000 crore through its IPO conducted from November 19-22, 2024. Out of the total proceeds, Rs. 6,650 crore has been utilized with Rs. 3,350 crore remaining unutilized. The funds were allocated across three main purposes: Rs. 7,500 crore for investment in subsidiary NTPC Renewable Energy Limited for debt repayment (Rs. 4,150 crore utilized), Rs. 2,446.49 crore for general corporate purposes (fully utilized at Rs. 2,455.33 crore), and Rs. 53.51 crore for issue expenses (Rs. 44.67 crore utilized). Under general corporate purposes, Rs. 102.47 crore was used for interest servicing and Rs. 2,352.86 crore for funding growth opportunities including joint venture with ONGC for Ayana Power acquisition. The monitoring agency reported no deviations from disclosed objects and confirmed all utilization was as per the offer document. Unutilized funds of Rs. 3,350 crore are parked in fixed deposits with PNB Bank and Yes Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1754047618118,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Completes 6 MW Dayapar Wind Project",
            "Summary": "NTPC Green Energy has completed its 6 MW wind project at Dayapar. The project represents the company's expansion in renewable energy infrastructure through wind power generation.",
            "Sentiment": "positive",
            "PublishDate": 1753888330489,
            "Source": "stock"
        },
        {
            "Title": "NTPC Green Energy Reports 58% Jump in Q1 Net Profit to 2.2 Billion Rupees",
            "Summary": "NTPC Green Energy reported consolidated net profit of 2.2 billion rupees in Q1, up from 1.39 billion rupees in the same period last year, marking a 58% increase. Revenue grew to 6.8 billion rupees from 5.78 billion rupees year-over-year. EBITDA rose to 6.03 billion rupees compared to 5.13 billion rupees previously, while EBITDA margin remained stable at 88.73% versus 88.68% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1753707524033,
            "Source": "earnings"
        },
        {
            "Title": "NTPC Green Energy Signs MoU with Bihar State Power Generation Company for Battery Storage and Renewable Energy Projects",
            "Summary": "NTPC Green Energy Limited (NGEL), a subsidiary of NTPC Limited, signed a Memorandum of Understanding with Bihar State Power Generation Company Limited (BSPGCL) on July 26, 2025, for developing Battery Energy Storage Projects and Renewable Energy Projects in Bihar. The agreement aims to support decarbonization and energy transition in the state. The MoU was signed by Sarit Maheswari, CEO of NGEL & NREL, and Abdesh Kumar Singh, Director Technical of BSPGCL, in the presence of Bihar's Minister of Energy, Planning & Development Bijendra Prasad Yadav, Minister of Industries Nitish Mishra, and other senior government officials.",
            "Sentiment": "positive",
            "PublishDate": 1753531560956,
            "Source": "order&deals"
        },
        {
            "Title": "NTPC Green Energy Signs Agreement for Renewable Energy Projects in Goa",
            "Summary": "NTPC Green Energy's unit has signed an agreement with Goa Energy Development Agency for renewable energy projects in Goa. The agreement covers 300 MW or more of renewable energy capacity.",
            "Sentiment": "positive",
            "PublishDate": 1752844180000,
            "Source": "default"
        },
        {
            "Title": "CCEA Expected to Approve NTPC's Additional Investment in Renewable Energy",
            "Summary": "The Cabinet Committee on Economic Affairs (CCEA) is anticipated to approve additional investment by NTPC in renewable energy projects. NTPC Green, likely referring to NTPC's green energy subsidiary, is mentioned in connection with this expected approval. The news suggests a potential expansion of NTPC's involvement in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1752651499000,
            "Source": "default"
        },
        {
            "Title": "NTPC Green Energy Expands Khavda Solar Project Capacity",
            "Summary": "NTPC Green Energy has announced the commencement of commercial operations for an additional 32.8 MW capacity at its Khavda Solar Project. This expansion increases the project's operational capacity, contributing to the company's renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1751333424000,
            "Source": "default"
        },
        {
            "Title": "NTPC Green Energy Commences Commercial Operations for 64.7 MW Solar Capacity",
            "Summary": "NTPC Green Energy has started commercial operations for an additional 64.7 MW of solar power capacity. This development indicates an expansion of the company's renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1751301947000,
            "Source": "default"
        },
        {
            "Title": "NTPC Green Energy: Shajapur Solar Project Unit II Fully Operational",
            "Summary": "NTPC Green Energy has commissioned the final 120 MW of the 220 MW Shajapur Solar Project (Unit-II) in Madhya Pradesh, bringing the total operational capacity to 325 MW. This is part of a larger 450 MW solar project in the Shajapur district.",
            "Sentiment": "positive",
            "PublishDate": 1751179779000,
            "Source": "corporate_action"
        },
        {
            "Title": "NTPC Green Inaugurates 110.25 MW of Khavda-I Solar Project",
            "Summary": "NTPC Renewable Energy has officially inaugurated 110.25 MW capacity of the 1255 MW Khavda-I Solar PV Project. This marks a significant milestone in the development of the larger solar power initiative.",
            "Sentiment": "positive",
            "PublishDate": 1749177851000,
            "Source": "default"
        },
        {
            "Title": "NTPC Green Signs 1000 MW Power Purchase Agreement",
            "Summary": "NTPC Green has signed a Power Purchase Agreement (PPA) for 1000 MW of power at a discovered tariff of ₹2.56 per kWh.",
            "Sentiment": "positive",
            "PublishDate": 1749082109000,
            "Source": "default"
        }
    ]
}