{
    "Symbol": "NUCLEUS",
    "ISIN": "INE096B01018",
    "News": [
        {
            "Title": "Nucleus Software Appoints Dr. Nitin R Gokarn as Director",
            "Summary": "Nucleus Software board approves appointment of Dr. Nitin R Gokarn as additional Independent Director effective February 10, 2026, bringing 37+ years of public administration experience.",
            "Sentiment": "positive",
            "PublishDate": 1770735778399,
            "Source": "stocks"
        },
        {
            "Title": "Nucleus Software Q3FY26 Results: Profit Drops 40.8%",
            "Summary": "Nucleus Software reports Q3FY26 consolidated profit of Rs 2,070 lacs vs Rs 3,497 lacs YoY. Revenue grows 7.0% to Rs 22,003 lacs. Exceptional charge of Rs 1,885 lacs due to new Labour Codes impacts results.",
            "Sentiment": "negative",
            "PublishDate": 1770715347697,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nucleus Software Appoints Dr. Apurva Chamaria as CBO",
            "Summary": "Nucleus Software Exports Limited announces the appointment of Dr. Apurva Chamaria as Chief Business Officer effective February 02, 2026, bringing over 23 years of leadership experience.",
            "Sentiment": "positive",
            "PublishDate": 1770028012230,
            "Source": "stocks"
        },
        {
            "Title": "Nucleus Software Board Meet Set for Feb 10, 2026",
            "Summary": "Nucleus Software Exports Limited has scheduled a board meeting on February 10, 2026, to approve Q3FY26 standalone audited and consolidated unaudited financial results for the quarter and nine months ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769000507598,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nucleus Software Celebrates 25 Years in Japan",
            "Summary": "Nucleus Software marked 25 years of partnership in Japan with distinguished gathering at Imperial Hotel Tokyo, featuring leaders from SMFG, SBI Shinsei Bank, and Mizuho Bank discussing digital transformation.",
            "Sentiment": "positive",
            "PublishDate": 1767843632558,
            "Source": "stocks"
        },
        {
            "Title": "Nucleus Software Reconstitutes Risk Management Committee",
            "Summary": "Nucleus Software Exports Limited announces reconstitution of its Risk Management Committee following the completion of Executive Director Anurag Mantri's term on December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766129330894,
            "Source": "stocks"
        },
        {
            "Title": "Nucleus Software Executive Director Steps Down",
            "Summary": "Nucleus Software Exports Ltd announces cessation of Executive Director Anurag Mantri effective December 18, 2025, following completion of his existing term.",
            "Sentiment": "neutral",
            "PublishDate": 1766062142504,
            "Source": "stocks"
        },
        {
            "Title": "Nucleus Software Launches AI Banking Solutions",
            "Summary": "Nucleus Software Exports unveils AI-powered banking initiatives at Synapse 2025, including the global release of Finnone Neo® GA 8.5, highlighting artificial intelligence's transformative role in financial services.",
            "Sentiment": "positive",
            "PublishDate": 1766032172112,
            "Source": "stocks"
        },
        {
            "Title": "Nucleus Software Launches FinnOne Neo® at MB Bank",
            "Summary": "Nucleus Software Exports successfully launches FinnOne Neo® platform at MB Bank in Vietnam, enhancing debt management and collection processes while boosting operational efficiency and customer satisfaction.",
            "Sentiment": "positive",
            "PublishDate": 1765857934043,
            "Source": "stocks"
        },
        {
            "Title": "Tamilnad Mercantile Bank Goes Live with Nucleus Software's FinnOne Neo for Digital Lending",
            "Summary": "Nucleus Software announced the successful go-live of its FinnOne Neo platform at Tamilnad Mercantile Bank, marking a major milestone in the 100-year-old bank's digital transformation journey. The deployment enables faster loan processing, enhanced transparency, strengthened compliance, and improved credit decisioning across retail, MSME, and corporate segments.",
            "Sentiment": "positive",
            "PublishDate": 1764570564659,
            "Source": "stock"
        },
        {
            "Title": "Nucleus Software Receives Great Place to Work Certification for Workplace Excellence",
            "Summary": "Nucleus Software, a global lending and transaction banking technology company, has been officially certified as a Great Place to Work based on independent evaluation and employee feedback reflecting trust, fairness, and collaboration. The certification positions the company as a preferred employer in the global fintech industry, supporting its ability to attract talent across engineering, AI, cloud, and digital transformation while serving 200 banks and financial institutions across 50 countries.",
            "Sentiment": "positive",
            "PublishDate": 1763967327718,
            "Source": "stock"
        },
        {
            "Title": "Nucleus Software Terminates Employee for Insider Trading Violations Following SEBI Order",
            "Summary": "Nucleus Software Exports Limited terminated employee Nitin Kumar Garg and forfeited his gratuity following a SEBI adjudication order for insider trading violations under Prohibition of Insider Trading Regulations. The company took action after Garg illegally traded 3,020 shares worth ₹19.68 lakh in purchases and ₹28.67 lakh in sales during April-May 2023, violating the company's Code of Conduct.",
            "Sentiment": "negative",
            "PublishDate": 1763555596075,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nucleus Software Extends Retirement Age for Senior Management and Reappoints CEO Parag Bhise",
            "Summary": "Nucleus Software's Board approved amendments to its superannuation policy, extending retirement age to 63 years for CEO and 62 years for Key Managerial Personnel and Senior Management, up from the standard 58 years. The Board also approved the re-appointment of Parag Bhise as Whole-Time Director and CEO for a two-year term from April 1, 2026 to March 31, 2028, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1763462344262,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nucleus Software Reports Q2 FY26 Results with Revenue Decline and Margin Pressure",
            "Summary": "Nucleus Software's consolidated revenue declined to Rs. 213.51 crore in Q2 FY26 from Rs. 217.72 crore in the previous quarter, while EBITDA dropped to Rs. 23.09 crore from Rs. 33.74 crore due to higher operating expenses. The company faces challenges in customer conversions and product upgrades from legacy platforms, though it continues investing in sales structure expansion and new AI-enabled product features for its FinnOne Neo platform.",
            "Sentiment": "negative",
            "PublishDate": 1763043287800,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software Reports Stable Q2 Results with Revenue Growth Despite Profit Decline",
            "Summary": "Nucleus Software announced its quarterly results with consolidated revenue rising to Rs. 213.51 crores from Rs. 202.20 crores in the same quarter last year. However, consolidated profit after tax declined to Rs. 26.29 crores from Rs. 33.06 crores, while EBITDA dropped to Rs. 23.09 crores from Rs. 31.52 crores. Earnings per share decreased to Rs. 9.99 from Rs. 12.35. On standalone basis, revenue increased to Rs. 196.37 crores from Rs. 185.26 crores, but PAT fell to Rs. 27.85 crores from Rs. 36.52 crores. The company continued strategic investments in AI-driven product enhancement and expansion of Digital Services portfolio. Management highlighted disciplined execution and foundational progress, with focus on enhancing product intelligence and customer-centric transformation. The company remains optimistic about opportunities in AI-powered capabilities and collaborations with banks and NBFCs across Asia, Middle East, and Africa.",
            "Sentiment": "neutral",
            "PublishDate": 1762600464055,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software Exports Reports Financial Results for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Nucleus Software Exports Limited announced the outcome of its board meeting held on November 8, 2025. The board approved audited standalone financial results and un-audited consolidated financial results for the quarter and half year ended September 30, 2025. The financial results were reviewed by the Audit Committee and approved by the Board of Directors. The board meeting commenced at 10:00 A.M. and concluded at 02:30 P.M. The company's auditors ASA Associates LLP provided an unmodified audit opinion on the standalone results and review conclusion on the consolidated results. The consolidated results include eight entities across various countries including India, Singapore, USA, Japan, Netherlands, UK, Australia, and South Africa.",
            "Sentiment": "neutral",
            "PublishDate": 1762595164653,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software Export Reports Decline in Q2 Financial Performance",
            "Summary": "Nucleus Software Export reported quarterly results showing a decline across key financial metrics. Net profit dropped to 263 million rupees from 352 million rupees in the previous quarter. Revenue decreased to 2.14 billion rupees from 2.18 billion rupees quarter-on-quarter. EBITDA fell to 234.1 million rupees from 339.8 million rupees, while EBITDA margin contracted to 10.96% from 15.61% compared to the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762594101654,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software Exports Appoints Nilanshuk Haldar as VP - Global Head of Partnerships and Alliances",
            "Summary": "Nucleus Software Exports Limited has hired Nilanshuk Haldar as Vice President - Global Head of Partnerships and Alliances. In this role, he will lead the company's global partner strategy and revenue growth initiatives. Haldar brings experience from previous positions at Deutsche Bank and JPMorgan.",
            "Sentiment": "positive",
            "PublishDate": 1760595549616,
            "Source": "stock"
        },
        {
            "Title": "Nucleus Software Exports Appoints Vishnu R Dusad as Interim CFO",
            "Summary": "Nucleus Software Exports has appointed Vishnu R Dusad to the position of interim Chief Financial Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1755708339762,
            "Source": "corporate_governance"
        },
        {
            "Title": "Saarathi Finance Partners with Nucleus Software for Digital Lending Platform Targeting Rural India",
            "Summary": "Saarathi Finance, a greenfield NBFC, has selected Nucleus Software's FinnOne Neo platform to launch a digital-first lending solution focused on semi-urban and rural areas in India. The partnership aims to bridge India's MSME credit gap through a cloud-ready, API-driven lending stack that includes customer acquisition, loan management, collections, and mobility solutions for Loan Against Property businesses. Saarathi Finance, backed by marquee investors including TVS Capital Funds, Lok Capital, Evolvence Equity Partners and Paragon Partners with a Rs.475 crore fund, will offer loan ticket sizes ranging from ₹5-25 lakhs for MSMEs and ₹50,000-3 lakhs for unsecured loans. The company targets tier 3 and tier 4 towns, focusing on underserved MSME segments. Nucleus Software serves 200+ banks and financial institutions across 50 countries, with its platforms managing over $15 trillion in yearly transactions and $1.2 trillion in loan values globally.",
            "Sentiment": "positive",
            "PublishDate": 1755575466788,
            "Source": "order&deals"
        },
        {
            "Title": "Nucleus Software Reports Mixed Q1 Results with Revenue Decline but Higher Order Book",
            "Summary": "Nucleus Software reported consolidated revenue of Rs. 217.72 crore for the quarter ended June 30, 2025, down from Rs. 228.96 crore in the previous quarter but up from Rs. 195.39 crore year-over-year. Product revenue declined to Rs. 184.91 crore from Rs. 199.56 crore quarter-over-quarter. Net profit dropped to Rs. 35.20 crore from Rs. 64.77 crore in the previous quarter. The company's order book increased to Rs. 703.16 crore from Rs. 612.40 crore as of March 31, 2025. The company went live with a major implementation involving over 20,000 users for one of India's biggest players. Employee costs increased primarily due to annual increments. Cash and cash equivalents rose to Rs. 965.93 crore from Rs. 877.26 crore. The company continues working on its lean journey and Hoshin Kanri initiative for long-term sustainability. Management expressed confidence in gaining back overseas revenue percentages and mentioned progress in North American market expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1754400402433,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software Plans AI Focus and Regional Expansion",
            "Summary": "Nucleus Software announced plans to focus on greater use of predictive and responsible AI in Q2. The company also plans to expand operations in Japan and Southeast Asia while creating scalable global delivery models for long-term value creation.",
            "Sentiment": "positive",
            "PublishDate": 1753970705645,
            "Source": "stock"
        },
        {
            "Title": "Nucleus Software Exports Reports 47% Decline in Q1 Net Profit",
            "Summary": "Nucleus Software Exports reported a consolidated net profit of 342 million rupees in Q1, down from 648 million rupees in the previous quarter, representing a 47% quarter-on-quarter decline. The company's EBITDA fell to 340 million rupees from 745 million rupees in the prior quarter. EBITDA margin compressed significantly to 15.61% from 32.54% quarter-on-quarter, indicating reduced operational efficiency and profitability during the period.",
            "Sentiment": "negative",
            "PublishDate": 1753952419264,
            "Source": "earnings"
        },
        {
            "Title": "Hatton National Bank Partners with Nucleus Software to Enhance Transaction Banking",
            "Summary": "Hatton National Bank has entered into a partnership with Nucleus Software Export to improve its transaction banking services using the Finnaxia® platform. This collaboration aims to enhance the bank's transaction banking capabilities through Nucleus Software's technology solution.",
            "Sentiment": "positive",
            "PublishDate": 1753847539452,
            "Source": "order&deals"
        },
        {
            "Title": "Nucleus Software Schedules Earnings Call for August 1, 2025 to Discuss Q1 Results",
            "Summary": "Nucleus Software Exports Limited will hold an investor and analyst earnings conference call on August 1, 2025 at 3:00 PM IST. The company's management team, including Managing Director Vishnu R. Dusad, CEO Parag Bhise, and COO Anurag Mantri, will discuss financial results for the quarter ended June 30, 2025. The results will be announced following a Board Meeting on July 31, 2025. Nucleus Software is a publicly traded fintech company that provides lending and transaction banking products to over 200 banks and financial institutions across 50 countries, facilitating over 26 million daily transactions and managing over $700 billion in loans globally.",
            "Sentiment": "neutral",
            "PublishDate": 1753361707715,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software Exports Reports Q4 Results and Declares Dividend",
            "Summary": "Nucleus Software Exports announced its Q4 financial results. The company's EBITDA increased to 745 million rupees from 332 million rupees in the previous quarter, with EBITDA margin rising to 32.54% from 16.14%. Revenue grew to 2.29 billion rupees from 2.06 billion rupees quarter-on-quarter. The consolidated net profit for Q4 was 648 million rupees, up from 350 million rupees in the previous quarter. Additionally, the company declared a dividend of 12.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747384833000,
            "Source": "result"
        },
        {
            "Title": "Nucleus Software and Deem Finance Expand Partnership with FinnOne NEO®",
            "Summary": "Nucleus Software has announced an expansion of its longstanding partnership with Deem Finance. The collaboration will involve the implementation of Nucleus Software's FinnOne NEO® product, suggesting a strengthening of their business relationship and potentially enhanced financial technology solutions for Deem Finance.",
            "Sentiment": "positive",
            "PublishDate": 1744691935000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nucleus Software Exports: Q3 Profit Drops 15.35% YoY Despite Revenue Growth",
            "Summary": "Nucleus Software Exports reported Q3 FY25 results with revenue up 0.77% YoY to ₹205.7 crore, but profit fell 15.35% to ₹34.97 crore. Operating income decreased 32.88% YoY. EPS declined to ₹13.28, down 13.93% YoY. Expenses increased, with SG&A up 11.01% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1738217207000,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software Exports Reports Improved Q3 EBITDA and Margin",
            "Summary": "Nucleus Software Exports has reported a quarter-on-quarter improvement in its financial performance. The company's Q3 EBITDA increased to 332 million rupees from 278 million rupees in the previous quarter. Additionally, the EBITDA margin expanded to 16.14% from 13.73% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738056180000,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software Exports Reports Q3 Revenue Increase",
            "Summary": "Nucleus Software Exports has reported a revenue of 2.06 billion rupees for the third quarter, showing a slight increase from 2.02 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738056146000,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software Exports Reports Q3 Profit Increase",
            "Summary": "Nucleus Software Exports has reported a consolidated net profit of 350 million rupees for the third quarter, showing an increase from 331 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738056117000,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software to Consider Q3 Results on January 28",
            "Summary": "Nucleus Software has announced that it will consider its third quarter (Q3) financial results on January 28. This news is a correction of a previous announcement, with the spelling now corrected.",
            "Sentiment": "neutral",
            "PublishDate": 1736253859000,
            "Source": "earnings"
        },
        {
            "Title": "Nucleus Software to Consider Q3 Results on January 28",
            "Summary": "Nucleus Software Exports Ltd. has announced that it will consider its financial results for the third quarter of the fiscal year on January 28. This indicates the company is preparing to disclose its performance for the most recent three-month period to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1736253604000,
            "Source": "result"
        },
        {
            "Title": "Federal Bank Launches FedOne for Corporate Banking",
            "Summary": "Nucleus Software announces that Federal Bank has introduced FedOne, a new platform aimed at transforming the corporate banking landscape. This initiative represents a significant move by Federal Bank to enhance its corporate banking services.",
            "Sentiment": "positive",
            "PublishDate": 1735797642000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nucleus Software Exports Limited: Appoints New Regional Sales Head for Southeast Asia",
            "Summary": "Nucleus Software has appointed Mukul Agrawal as Regional Sales Head for Southeast Asia to lead business expansion and product portfolio management. This move is part of the company's strategy to strengthen its senior leadership and global sales organization in the region.",
            "Sentiment": "positive",
            "PublishDate": 1734684090000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nucleus Software Exports Limited: Digital Collections Platform Boosts Bank Muscat's Operations",
            "Summary": "Nucleus Software has implemented its FinnOne Neo Collections platform at Bank Muscat, enhancing the bank's delinquency management and collections processes in Oman. The system enables real-time loan monitoring and improved NPA detection. Bank Muscat, with $2.9 billion in assets, sees this as part of its digital transformation strategy.",
            "Sentiment": "positive",
            "PublishDate": 1733214584000,
            "Source": "order&deals"
        },
        {
            "Title": "Bank Muscat Partners with Nucleus Software for Collections Operations Upgrade",
            "Summary": "Bank Muscat, a leading financial services provider in Oman, has partnered with Nucleus Software to implement FinnOne NEO® for revolutionizing its collections operations. This collaboration aims to enhance Bank Muscat's debt management processes and improve overall operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1733203507000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nucleus Software Exports Ltd: Celebrates 30th Anniversary at Singapore Fintech Event",
            "Summary": "Nucleus Software marked its 30th anniversary at Synapse 2024 in Singapore, showcasing its global impact in banking technology. The company manages $500 billion in loans in India and over $700 billion globally, serving 200+ financial institutions across 50 countries. The event featured key financial sector leaders and highlighted the Global Finance & Technology Network initiative.",
            "Sentiment": "positive",
            "PublishDate": 1732269473000,
            "Source": "normal_news"
        },
        {
            "Title": "Nucleus Software Exports Reports Q2 Financial Results",
            "Summary": "Nucleus Software Exports announced its Q2 financial results. The company's EBIT (Earnings Before Interest and Taxes) increased to 278 million rupees, up from 251 million rupees in the previous quarter. The EBIT margin also improved, rising to 13.73% from 12.83% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731402126000,
            "Source": "result"
        },
        {
            "Title": "Nucleus Software Exports Reports Q2 Revenue Growth",
            "Summary": "Nucleus Software Exports has reported a quarter-on-quarter increase in revenue for Q2. The company's revenue reached 2.02 billion rupees, up from 1.95 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731402033000,
            "Source": "result"
        },
        {
            "Title": "Nucleus Software Exports Reports Q2 Profit Increase",
            "Summary": "Nucleus Software Exports has reported a consolidated net profit of 331 million rupees for the second quarter, up from 302 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731401988000,
            "Source": "result"
        }
    ]
}