{
    "Symbol": "NURECA",
    "ISIN": "INE0DSF01015",
    "News": [
        {
            "Title": "Nureca Promoter Group Shareholding Rises to 68.09%",
            "Summary": "Nureca Limited's promoter group shareholding increased from 64.97% to 68.09% following completion of share buyback program that concluded on December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769574181078,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nureca Q3FY26 Results: Revenue Jumps 45.7% to ₹396.40 Cr",
            "Summary": "Nureca Limited reported strong Q3FY26 performance with revenue rising 45.7% YoY to ₹396.40 crores. The company swung to profitability with net profit of ₹32.31 crores versus loss of ₹32.89 crores in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768818195699,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nureca Q3 FY26 Revenue Surges 50% YoY to ₹396 Million",
            "Summary": "Nureca Limited reports strong Q3 FY26 performance with revenue jumping 50% YoY to ₹396 million. EBITDA grows 314% to ₹54 million while PAT turns positive at ₹32 million vs ₹33 million loss in Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768794118283,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nureca Completes Buyback of 4.58 Lakh Shares",
            "Summary": "Nureca Limited successfully extinguished 4,58,255 equity shares worth ₹45.83 crores following completion of its buyback program conducted through stock exchange mechanism at ₹330 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1768043433729,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nureca receives warning letters from BSE and NSE",
            "Summary": "Nureca Limited received warning letters from BSE and NSE on January 06-07, 2026 for failing to hold mandatory Stakeholder's Relationship Committee meeting during FY 2024-25 as required under SEBI regulations.",
            "Sentiment": "negative",
            "PublishDate": 1767790054366,
            "Source": "stocks"
        },
        {
            "Title": "Nureca Shifts Registered Office to Andheri West",
            "Summary": "Nureca Limited has relocated its registered office from Goregaon East to Andheri West, Mumbai, effective December 10, 2025, as per regulatory filing with stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1765378049753,
            "Source": "stocks"
        },
        {
            "Title": "Nureca Limited's Wholly Owned Subsidiary Struck Off from Company Register",
            "Summary": "Nureca Healthcare Private Limited, a wholly owned subsidiary of Nureca Limited, has been struck off and dissolved from the Register of Companies under Section 248 of the Companies Act, 2013, effective December 3, 2025. The parent company has informed stock exchanges BSE and NSE about the subsidiary's dissolution as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764768827736,
            "Source": "corporate_action"
        },
        {
            "Title": "Nureca Limited Announces ₹19.14 Crore Share Buyback Program",
            "Summary": "Nureca Limited's board approved a buyback of up to 5.8 lakh equity shares at ₹330 per share for a maximum consideration of ₹19.14 crore through stock exchange mechanism. The buyback represents 5.8% of total equity shares and will be conducted on a proportionate basis for shareholders as of December 12, 2025 record date.",
            "Sentiment": "positive",
            "PublishDate": 1764678649948,
            "Source": "corporate_action"
        },
        {
            "Title": "Nureca Limited Approves Rs 19.14 Crore Share Buyback at Rs 330 Per Share",
            "Summary": "Nureca Limited's Board approved a buyback of 5,80,000 equity shares at Rs 330 per share for Rs 19.14 crore, representing 5.80% of existing paid-up capital, with record date set as December 12, 2025. The buyback will be conducted through tender offer route excluding promoters and promoter group members, potentially increasing promoter shareholding from 64.97% to 68.97%.",
            "Sentiment": "positive",
            "PublishDate": 1764299736960,
            "Source": "corporate_action"
        },
        {
            "Title": "NURECA Schedules Board Meeting to Discuss Share Buyback Proposal",
            "Summary": "NURECA has announced plans to hold a board meeting on November 28 to discuss a potential share buyback program. The meeting indicates the company's consideration of returning capital to shareholders through share repurchases.",
            "Sentiment": "neutral",
            "PublishDate": 1764080110589,
            "Source": "corporate_action"
        },
        {
            "Title": "Nureca CFO Naresh Gupta Withdraws Resignation",
            "Summary": "Nureca Limited announced that Chief Financial Officer Naresh Gupta has withdrawn his resignation with immediate effect. Gupta had previously resigned on October 11, 2025, but has now reversed this decision after his personal issues that led to the original resignation have been resolved. The matter will be noted by the Board of Directors in their upcoming board meeting.",
            "Sentiment": "positive",
            "PublishDate": 1762464195277,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nureca Limited Board to Consider Equity Share Buyback Proposal",
            "Summary": "Nureca Limited announced that its Board of Directors will consider a proposal for buyback of equity shares at a meeting scheduled for November 10, 2025. The company informed stock exchanges BSE and NSE about this agenda item. Nureca trades on BSE under scrip code 543264 and on NSE under the symbol NURECA.",
            "Sentiment": "neutral",
            "PublishDate": 1762347527712,
            "Source": "corporate_action"
        },
        {
            "Title": "Nureca Limited Receives SEBI Approval for Share Buyback During Pending Merger",
            "Summary": "Nureca Limited received SEBI approval on October 16, 2025, for exemption from Regulation 24(ii) of Buy-Back Regulations, allowing the company to proceed with a share buyback while a merger scheme with its wholly owned subsidiary Nureca Technologies Private Limited is pending before the National Company Law Tribunal. The Board of Directors had approved the merger scheme on May 20, 2025, and shareholders approved it on June 16, 2025. SEBI granted the exemption considering that the internal restructuring involves no new equity issuance or change in shareholding pattern. The company's promoters have committed not to participate in the buyback, making it exclusively for public shareholders. The board will consider the buyback proposal at an appropriate time and comply with all applicable regulations.",
            "Sentiment": "positive",
            "PublishDate": 1760695524409,
            "Source": "corporate_action"
        },
        {
            "Title": "Nureca Limited Reports Strong Q2 FY26 Performance with 21% YoY Revenue Growth",
            "Summary": "Nureca Limited, a home healthcare and wellness company, announced its financial results for Q2 FY26 ended September 30, 2025. The company reported revenue of ₹37.7 crore in Q2 FY26, representing 21% year-over-year growth from ₹31.2 crore in Q2 FY25. For H1 FY26, revenue reached ₹71.9 crore, marking 40% growth from ₹51.5 crore in H1 FY25. Operating profits surged 239% year-over-year to ₹3.3 crore compared to ₹(2.4) crore in the same quarter last year. Profit after tax increased significantly to ₹3.6 crore from ₹(0.5) crore in Q2 FY25. The company attributed the performance to focused cost optimization and growth in quick commerce sales channels. Nureca operates as a digital-first healthcare company with over 93% revenue generated through online sales and maintains a debt-free, asset-light business model.",
            "Sentiment": "positive",
            "PublishDate": 1760619113862,
            "Source": "earnings"
        },
        {
            "Title": "Nureca Limited Reports Quarterly Financial Results for September 2025",
            "Summary": "Nureca Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The board meeting was held on October 16, 2025, commencing at 4:00 PM and concluding at 5:15 PM. The company operates in the home healthcare and wellness products business segment. During the quarter, Nureca filed a Scheme of Merger by Absorption for its wholly owned subsidiary Nureca Technologies Private Limited, effective from April 1, 2025, subject to regulatory approvals. The company also filed Form STK-2 for striking off its wholly owned subsidiary Nureca Healthcare Private Limited under Section 248 of the Companies Act, 2013, resulting in a write-off of investment of Rs 0.01 million. The results were reviewed by the Audit Committee and received limited review from statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1760617090704,
            "Source": "earnings"
        },
        {
            "Title": "Nureca Limited CFO Naresh Gupta Resigns, Effective January 2026",
            "Summary": "Nureca Limited announced that Chief Financial Officer Naresh Gupta has submitted his resignation via email dated October 11, 2025. His resignation will be effective from the close of business hours on January 9, 2026. Gupta confirmed that there are no other material reasons for his resignation beyond those mentioned in his resignation letter. The company has notified stock exchanges BSE and NSE about this leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1760188715480,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nureca Limited Files Merger Scheme with Wholly Owned Subsidiary Nureca Technologies",
            "Summary": "Nureca Limited has filed a scheme for merger by absorption of its wholly owned subsidiary, Nureca Technologies Private Limited. The Board of Directors approved the draft merger scheme on May 20, 2025, subject to statutory and regulatory approvals. Nureca Limited reported revenue of Rs 1,146.40 crores and net-worth of Rs 1,917.38 crores for the year ended March 31, 2025, while Nureca Technologies recorded revenue of Rs 228.14 crores and net-worth of Rs 53.94 crores. The merger aims to improve operational efficiency, eliminate inter-corporate dependencies, minimize administrative compliances, and maximize shareholder value through reduced overheads and simplified group structure. No shares will be issued as part of the scheme, and there will be no change in shareholding pattern. The company has also approved the strike-off of another wholly owned subsidiary, Nureca Healthcare Private Limited, which is non-material and non-functional.",
            "Sentiment": "positive",
            "PublishDate": 1753338149947,
            "Source": "corporate_action"
        },
        {
            "Title": "Nureca Reports Strong Q4 Growth and Expands Distribution",
            "Summary": "Nureca has reported an 87% growth for Q4 FY25. The company is expanding its reach by partnering with Swiggy for distribution. Additionally, Nureca has outlined its strategic priorities for the upcoming fiscal year FY26.",
            "Sentiment": "positive",
            "PublishDate": 1746465326000,
            "Source": "default"
        },
        {
            "Title": "Nureca Expands Quick Commerce Reach via Swiggy Instamart",
            "Summary": "Nureca has expanded its quick commerce reach by making Dr Trust products available on Swiggy Instamart. This move allows Nureca to tap into Swiggy's extensive delivery network, potentially increasing the accessibility and sales of Dr Trust products through a popular quick commerce platform.",
            "Sentiment": "positive",
            "PublishDate": 1745929490000,
            "Source": "default"
        },
        {
            "Title": "Nureca Receives Approval for New Manufacturing Facility in Punjab",
            "Summary": "Nureca has obtained formal approval to establish a manufacturing facility in Sundra, Punjab. The new unit will be dedicated to the production of health and wellness equipment.",
            "Sentiment": "positive",
            "PublishDate": 1745235295000,
            "Source": "default"
        },
        {
            "Title": "Nureca's Subsidiary Obtains US FDA Registration for Medical Devices",
            "Summary": "Nureca Technologies Pvt Ltd, a manufacturing subsidiary of Nureca, has secured registration from the US Food and Drug Administration (FDA). This achievement allows the company to expand its global reach in the medical devices market, particularly in the United States.",
            "Sentiment": "positive",
            "PublishDate": 1744457271000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nureca Obtains Injunction Against Competitors",
            "Summary": "Nureca has successfully obtained an injunction against Threpsi, ARC International, and Tech-Connect. This legal action is aimed at protecting Nureca's brand equity and intellectual property rights. The injunction serves as a safeguard for the company's assets and market position against potential infringement by these competitors.",
            "Sentiment": "positive",
            "PublishDate": 1736338279000,
            "Source": "corporate_governance"
        }
    ]
}