{
    "Symbol": "NUVOCO",
    "ISIN": "INE118D01016",
    "News": [
        {
            "Title": "HDFC Mutual Fund Crosses 5% Stake in Nuvoco Vistas",
            "Summary": "HDFC Mutual Fund disclosed substantial acquisition in Nuvoco Vistas Corporation, increasing its stake to 5.39% through acquisition of 16,12,970 shares via open market transactions on February 06, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770727062341,
            "Source": "mutualfunds"
        },
        {
            "Title": "Nuvoco Q3FY26: Record volumes, 50% EBITDA growth",
            "Summary": "Nuvoco Vistas Corporation delivered record Q3 volumes of 5 million tons with 7% YoY growth and EBITDA surge of 50% to ₹386 crores despite pricing pressures. Premium product mix reached historic 44% of trade volumes.",
            "Sentiment": "positive",
            "PublishDate": 1769083526305,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Securities Maintains Hold on Nuvoco Vistas",
            "Summary": "ICICI Securities retains Hold rating on Nuvoco Vistas Corporation with revised target price of ₹369, down from ₹400, citing competitive intensity and capacity additions despite Q3FY26 EBITDA growth of 49% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1768989572662,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prabhudas Lilladher Sets ₹443 Target for Nuvoco Vistas",
            "Summary": "Brokerage maintains BUY rating on Nuvoco Vistas with revised target price of ₹443, citing 7% YoY volume growth and improved EBITDA performance in Q3FY26 despite margin pressures from elevated raw material costs.",
            "Sentiment": "positive",
            "PublishDate": 1768896105586,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nuvoco Vistas Gets Stable Outlook from CRISIL",
            "Summary": "CRISIL removes Rating Watch with Developing Implications on Nuvoco Vistas' facilities, reaffirms AA/AA- ratings with stable outlook. Short-term A1+ rating also reaffirmed for bank facilities and commercial paper programme.",
            "Sentiment": "positive",
            "PublishDate": 1768482006793,
            "Source": "stocks"
        },
        {
            "Title": "Nuvoco Q3 FY26: Turns Profitable with ₹49 Cr Net Profit",
            "Summary": "Nuvoco Vistas reported Q3 FY26 net profit of ₹49.10 crores vs loss of ₹61.40 crores YoY. EBITDA surged 49% to ₹384 crores with margin expansion. Achieved highest Q3 cement sales volume at 5 MT.",
            "Sentiment": "positive",
            "PublishDate": 1768474655216,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nuvoco Vistas Auditor Firm Converts to LLP Structure",
            "Summary": "Nuvoco Vistas Corporation's statutory auditor M S K A & Associates has converted to Limited Liability Partnership structure, changing firm registration number to 105047W/W101187.",
            "Sentiment": "neutral",
            "PublishDate": 1768467504150,
            "Source": "stocks"
        },
        {
            "Title": "Nuvoco Vistas Schedules Earnings Call for Jan 16",
            "Summary": "Nuvoco Vistas Corporation has scheduled an investor and analyst conference call for January 16, 2026, at 4:30 PM IST to discuss Q3FY26 financial results following board meeting on January 15.",
            "Sentiment": "neutral",
            "PublishDate": 1767606121349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nuvoco Vistas Clarifies Trading Volume Spike",
            "Summary": "Nuvoco Vistas Corporation responds to stock exchange queries about significant trading volume increase on December 15, 2025, stating the movement was purely market-driven with no pending price-sensitive information.",
            "Sentiment": "neutral",
            "PublishDate": 1765869816962,
            "Source": "stocks"
        },
        {
            "Title": "Nuvoco Vistas Gets ESG Rating of 63 from NSE",
            "Summary": "Nuvoco Vistas Corporation receives consolidated ESG rating of 63 from NSE Sustainability Ratings Analytics Limited for FY25, reflecting performance on environmental, social and governance parameters.",
            "Sentiment": "positive",
            "PublishDate": 1765382213271,
            "Source": "stocks"
        },
        {
            "Title": "JSW Cement Sells Entire Stake in Algebra Endeavour to Nuvoco Vistas for ₹191.63 Crores",
            "Summary": "JSW Cement has signed an agreement to sell its complete stake in Algebra Endeavour to Nuvoco Vistas for ₹191.63 crores. The transaction involves a complete divestment by JSW Cement and acquisition by Nuvoco Vistas, representing a strategic portfolio restructuring move.",
            "Sentiment": "positive",
            "PublishDate": 1763430540797,
            "Source": "order&deals"
        },
        {
            "Title": "Nuvoco Vistas' Subsidiary Vadraj Cement Raises Rs. 600 Crores Through Convertible Debentures",
            "Summary": "Vadraj Cement Limited, a wholly owned subsidiary of Nuvoco Vistas Corporation Limited, has allotted 60,000 unlisted compulsorily convertible debentures worth Rs. 600 crores to three investors through private placement. The CCDs will automatically convert into equity shares either before the company's IPO filing or after seven years from allotment date, with each debenture convertible into 1,967 equity shares of face value Rs. 10 each.",
            "Sentiment": "positive",
            "PublishDate": 1763145360269,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco Vistas Corporation Approves ₹6 Billion Debenture Issuance",
            "Summary": "Nuvoco Vistas Corporation has approved the issuance of debentures worth ₹6 billion rupees. This debt fundraising initiative will impact the company's capital structure and provide additional financing for its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763130610394,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco Vistas Corporation Faces GST Department Search at Registered Office",
            "Summary": "The Maharashtra Goods & Service Tax Department conducted a search at Nuvoco Vistas Corporation Limited's registered office under Section 67 of the Maharashtra Goods & Service Tax Act, 2017. The search commenced on November 12, 2025. The company has cooperated with GST officials and responded to all clarifications and details sought by them. Nuvoco stated there is currently no material impact on the company's business operations due to this action. The company emphasized its adherence to high standards of governance and commitment to complying with laws and regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762996827349,
            "Source": "stock"
        },
        {
            "Title": "Nuvoco Vistas Corp Approves Acquisition of Algebra Endeavour",
            "Summary": "Nuvoco Vistas Corp has approved the purchase of Algebra Endeavour. The approval represents a corporate acquisition decision by the company's board or relevant authority.",
            "Sentiment": "neutral",
            "PublishDate": 1762176964038,
            "Source": "order&deals"
        },
        {
            "Title": "Nuvoco Vistas Wins Tax Disputes Worth Rs 452.52 Crores as Income Tax Authority Drops Proceedings",
            "Summary": "Nuvoco Vistas Corporation received favorable orders from the Principal Commissioner, Income Tax, Mumbai-6 (PCIT) dropping proceedings under section 263 of the Income Tax Act for two financial years. For FY 2020-21, the PCIT dropped proceedings related to denial of deduction claimed on interest paid on NCDs, which had an approximate tax impact of Rs 99.97 crores. For FY 2019-20, the PCIT dropped proceedings involving denial of deduction on interest paid on NCDs and transfer of NCDs liability of cement undertaking during a merger in February 2020, with an approximate tax impact of Rs 352.55 crores. The PCIT considered the company's detailed submissions and evidence, and based on judicial precedents and case merits, dropped all proceedings entirely. The company will not face any tax outflow as all issues raised in the show cause notices have been dropped.",
            "Sentiment": "positive",
            "PublishDate": 1761309225562,
            "Source": "stock"
        },
        {
            "Title": "Nuvoco Vistas Reports 62% Jump in Q2 EBITDA to Rs 371 Crores Despite Monsoon Challenges",
            "Summary": "Nuvoco Vistas Corporation achieved EBITDA of Rs 371 crores in Q2 FY26, marking a 62% year-on-year increase despite facing prolonged monsoon conditions and GST rate transition challenges. The company delivered 1% quarter-on-quarter revenue growth per ton and reached a record premiumization level of 44%. Trade mix remained favorable at 74%. The company passed on the full benefit of GST rate reduction from 28% to 18% to customers. Fuel costs increased slightly to Rs 1.46 per Mcal due to higher petcoke prices. Net debt decreased by Rs 1,009 crores year-on-year to Rs 3,492 crores. The company announced a 4 million ton capacity expansion in the East at an investment of less than Rs 200 crores, with phased commissioning starting December 2025. Vadraj Cement acquisition progress continues with plants targeted for commissioning by Q3 FY27. Management expects 7-8% demand growth in coming months and targets Rs 25-50 per ton realization improvement through premiumization and geo-mix optimization.",
            "Sentiment": "positive",
            "PublishDate": 1761118402200,
            "Source": "earnings"
        },
        {
            "Title": "Nuvoco's Subsidiary Vadraj Cement Moves Forward with Rs 1,200 Crore Debenture Issuance",
            "Summary": "Vadraj Cement Limited, a wholly owned subsidiary of Nuvoco Vistas Corporation Limited, is proceeding with its plan to issue unsecured unlisted compulsorily convertible debentures worth Rs 1,200 crore through private placement. The debentures are structured in two series - Series A and Series B - each valued at Rs 600 crore. The board committee has approved execution of securities subscription and debenture trustee agreements along with option agreements for both series. For Series A, the agreements involve Nirma Limited as an investor with Beacon Trusteeship Limited serving as debenture trustee. For Series B, Niyogi Enterprise Private Limited is the investor with the same trustee. The committee meeting was held on October 17, 2025, lasting 30 minutes from 8:30 AM to 9:00 AM.",
            "Sentiment": "positive",
            "PublishDate": 1760672590088,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco Vistas Reports Record Q2 Consolidated EBITDA of Rs 371 Cr, Reduces Net Debt by Rs 1,009 Cr",
            "Summary": "Nuvoco Vistas Corporation Limited announced quarterly results with consolidated revenue from operations of Rs 2,458 crore, up 8% year-on-year. The company achieved its highest-ever second-quarter consolidated EBITDA of Rs 371 crore and cement sales volume of 4.3 MMT. Net profit after tax was Rs 36.43 crore compared to a loss of Rs 85.17 crore in the same quarter last year. The company reduced like-to-like net debt by Rs 1,009 crore year-on-year to Rs 3,492 crore. Premium products reached a historic high of 44% of trade volume. The company completed acquisition of Vadraj Cement Limited and plans to expand cement capacity to 35 MMTPA by FY27. Refurbishment activities at Vadraj Cement Plant are progressing as scheduled with operationalisation targeted by Q3 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1760516791997,
            "Source": "earnings"
        },
        {
            "Title": "Nuvoco Vistas Faces Rs 112.48 Crore Tax Demand and Penalty Notice from CGST Authorities",
            "Summary": "Nuvoco Vistas Corporation received a show cause notice from the Joint Commissioner (Prev), CGST & Central Excise, Raipur covering the period from FY 2019-20 to September 2024 of FY 2024-25. The tax authorities allege that the company's Carrying and Forwarding Agents (C&FA) issued invoices without actual cement supply, based on incorrect vehicle number entries in invoices. The total demand includes Rs 37.61 crores in tax and Rs 74.87 crores in penalty, totaling Rs 112.48 crores. The company states the tax demand is based on assumptions by authorities regarding typographical errors in data entry by computer operators at C&FA warehouses. Nuvoco claims to have sufficient evidence supporting the genuineness of transactions and expects the demand and penalties to be set aside with no ultimate financial impact. The company will file an appropriate reply to the notice.",
            "Sentiment": "negative",
            "PublishDate": 1758802867816,
            "Source": "stock"
        },
        {
            "Title": "Nuvoco Vistas Raises Rs 600 Crores Through Non-Convertible Debentures",
            "Summary": "Nuvoco Vistas Corporation Limited has allotted 60,000 unsecured, redeemable, listed, rated non-convertible debentures with a face value of Rs 1,00,000 each through private placement, raising Rs 600 crores. The NCDs carry an interest rate of 7.70% per annum with annual coupon payments and have a 3-year tenure from September 18, 2025 to September 18, 2028. The debentures are listed on the Wholesale Debt Market Segment of National Stock Exchange of India Limited and carry a CRISIL AA/Watch Developing credit rating. In case of payment default, an additional interest of 2% per annum will be charged for the defaulting period.",
            "Sentiment": "positive",
            "PublishDate": 1758202000797,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco's Subsidiary Vadraj Cement Plans Rs 1,200 Crore Debenture Issue",
            "Summary": "Vadraj Cement Limited, a wholly owned subsidiary of Nuvoco Vistas Corporation Limited, plans to issue unsecured unlisted compulsorily convertible debentures worth up to Rs 1,200 crore through private placement. The debentures will be divided into two tranches: Series A CCDs worth up to Rs 600 crore and Series B CCDs worth up to Rs 600 crore. Nuvoco's board approved the formation of a committee to review, negotiate, finalize and approve the transaction documents and terms for this proposed transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1757952089821,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco Vistas Plans to Increase Cement Grinding Capacity by 4 Million Tonnes in Eastern Region",
            "Summary": "Nuvoco Vistas announced plans to boost its cement grinding capacity by 4 million tonnes per annum in the Eastern area. The expansion represents the company's strategy to increase production capabilities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1756717943093,
            "Source": "stock"
        },
        {
            "Title": "Nuvoco Vistas Corporation Completes Rs 350 Crore Debenture Payment",
            "Summary": "Nuvoco Vistas Corporation Limited made timely payment of redemption principal and interest for its secured, redeemable, listed and rated non-convertible debentures worth Rs 350 crores on August 28, 2025. The debentures carried the ISIN code INE118D07195 and scrip code NVCL 25. The company fulfilled its debt obligation as scheduled, completing both interest and principal payments on the due date.",
            "Sentiment": "positive",
            "PublishDate": 1756384297450,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco Vistas Approves ₹508.65 Crore Loan-to-Equity Conversion in Vadraj Cement",
            "Summary": "Nuvoco Vistas has approved a loan-to-equity conversion worth ₹508.65 crore in its subsidiary Vadraj Cement. This corporate action involves converting existing loans into equity shares within the subsidiary structure.",
            "Sentiment": "neutral",
            "PublishDate": 1756220401283,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLAT Upholds Nuvoco Vistas' Rs 1,800 Crore Acquisition of Vadraj Cement",
            "Summary": "The National Company Law Appellate Tribunal dismissed an appeal against Nuvoco Vistas Corporation's acquisition of Vadraj Cement during insolvency proceedings. The NCLAT upheld the Mumbai NCLT's approval of Nuvoco's resolution plan involving an upfront payment of Rs 1,800 crore. Vadraj Cement employees had challenged the bid over gratuity dues payout. The company, formerly owned by ABG Shipyard, operates a 3.5 MTPA clinker unit in Kutch and 6 MMTPA grinding unit in Surat, with total debt exceeding Rs 8,000 crore. The tribunal noted that Nuvoco's bid value exceeded the fair value of Rs 1,668 crore and average liquidation value of Rs 1,080 crore. The committee of creditors approved the plan with 100% majority. Employee claims totaled Rs 10.51 crore, with Rs 6.30 crore provided and remaining amount on pro-rata basis. Nuvoco Vistas acquired the company through subsidiary Vanya Corporation. The insolvency process began in February 2024 following a plea by Punjab National Bank.",
            "Sentiment": "positive",
            "PublishDate": 1756042707405,
            "Source": "order&deals"
        },
        {
            "Title": "Nuvoco Vistas Corporation Approves Rs 600 Crore Non-Convertible Debenture Issuance",
            "Summary": "Nuvoco Vistas Corporation Limited's Board Committee approved the issuance of Non-Convertible Debentures worth up to Rs 600 crores on a private placement basis. The NCDs will be issued in one or more tranches and are proposed to be listed on the Wholesale Debt Market Segment of National Stock Exchange of India Limited. The debentures may be secured or unsecured, rated, listed, and redeemable. Specific details regarding tenure, coupon rates, interest payment schedules, and credit ratings will be incorporated in the Key Information Document. The committee meeting was held on August 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755522397674,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco Vistas Corporation Receives ESG Rating of 'Crisil ESG 56' for FY2024",
            "Summary": "Nuvoco Vistas Corporation Limited has been assigned an ESG rating of 'Crisil ESG 56' by Crisil ESG Ratings & Analytics Limited for the financial year ended March 31, 2024. The company disclosed this information to stock exchanges BSE and NSE as per regulatory requirements. The ESG rating details are available on the company's website at www.nuvoco.com.",
            "Sentiment": "positive",
            "PublishDate": 1753277822094,
            "Source": "stock"
        },
        {
            "Title": "Nuvoco Vistas: Q1 Profit Soars, Shares Rally 9%",
            "Summary": "Nuvoco Vistas reported a significant increase in Q1 profit to Rs 133.16 crore, up from Rs 2.84 crore last year. Revenue grew 9% to Rs 2,872.70 crore. EBITDA reached a record Rs 533 crore, with operating margins improving by 510 basis points. The company is acquiring Vadraj Cement, which will increase its capacity from 25 to 31 million tonnes. Net debt reduced to Rs 3,474 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752815137000,
            "Source": "earnings"
        },
        {
            "Title": "Nuvoco Vistas Corp Reports Significant Profit Increase in Q1",
            "Summary": "Nuvoco Vistas Corp has reported its Q1 consolidated net profit at 1.3 billion rupees, a substantial increase from 28 million rupees in the same quarter last year. The company's Q1 revenue also saw growth, rising to 28.7 billion rupees from 26 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752801159000,
            "Source": "default"
        },
        {
            "Title": "Nuvoco Vistas: Q1 Profit Soars to Rs 133 Crore on Higher Sales",
            "Summary": "Nuvoco Vistas Corp reported a significant increase in Q1 consolidated profit to Rs 133.16 crore, up from Rs 2.84 crore year-over-year. Revenue rose 9% to Rs 2,872.70 crore, while expenses remained stable. The company sold 5.1 million tonnes of cement and achieved record Q1 EBITDA of Rs 533 crore. Operating margins improved by 510 basis points to 18.35%.",
            "Sentiment": "positive",
            "PublishDate": 1752766067000,
            "Source": "earnings"
        },
        {
            "Title": "Nuvoco Vistas Reports Financial and Operational Improvements",
            "Summary": "Nuvoco Vistas has reported several positive developments: 1) A year-over-year reduction in net debt by ₹884 crore, bringing it down to ₹3,474 crore. 2) Achieving a 76% trade mix, which is described as their best performance in 13 quarters. 3) An increase in the trade volume share of premium products to 41% in Q1 FY26, indicating a focus on higher-value offerings.",
            "Sentiment": "positive",
            "PublishDate": 1752764276000,
            "Source": "default"
        },
        {
            "Title": "Nuvoco Vistas Corp Reports Significant Q1 Financial Improvement",
            "Summary": "Nuvoco Vistas Corp has reported substantial year-over-year improvements in its Q1 financial results. The company's EBITDA increased to 5.2 billion rupees from 3.4 billion rupees in the previous year, with the EBITDA margin rising to 18.06% from 13.01%. Consolidated net profit saw a significant jump to 1.3 billion rupees from 28 million rupees. Revenue also grew to 28.7 billion rupees from 26 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1752758713000,
            "Source": "result"
        },
        {
            "Title": "NuvoCo Vistas Corp Board Meeting Scheduled for Q1 Results Review",
            "Summary": "NuvoCo Vistas Corp has announced that its Board of Directors will meet on July 17 to review the company's first quarter results.",
            "Sentiment": "neutral",
            "PublishDate": 1751377028000,
            "Source": "default"
        },
        {
            "Title": "Nuvoco Vistas: ED Clears ₹952 Crore Vadraj Cement Plant Acquisition",
            "Summary": "The Enforcement Directorate (ED) has returned assets worth ₹952 crore to Nuvoco Vistas Corporation Ltd., allowing its acquisition of Vadraj Cement's Surat plant. This decision, approved by the Special PMLA Court in Mumbai, resolves a part of the IL&FS-linked financial scandal. The NCLT had previously approved a ₹1,706 crore resolution plan for Nuvoco Vistas to acquire the distressed company.",
            "Sentiment": "positive",
            "PublishDate": 1751195783000,
            "Source": "order&deals"
        },
        {
            "Title": "Nuvoco Vistas Corporation: Completes Rs 1800 Crore Vadraj Cement Acquisition",
            "Summary": "Nuvoco Vistas Corp has finalized the Rs 1800 crore acquisition of Vadraj Cement, paying lenders led by Punjab National Bank and Union Bank of India. This acquisition boosts Nuvoco's cement capacity by over 20% to around 31 MTPA. The deal was completed ahead of the June 24 deadline, following NCLT approval in April.",
            "Sentiment": "positive",
            "PublishDate": 1750602547000,
            "Source": "corporate_action"
        },
        {
            "Title": "High Court Resolves Nuvoco Vista's Writ Petition on Sonadhi Cement Plant Transfer",
            "Summary": "The High Court has resolved a writ petition submitted by Nuvoco Vista Corporation regarding the transfer of their cement plant located in Sonadhi. The article does not provide specific details about the nature of the petition, the court's decision, or the implications of this resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1750166499000,
            "Source": "default"
        },
        {
            "Title": "Nuvoco Vistas Challenges West Bengal's Incentive Scheme Revocation",
            "Summary": "Nuvoco Vistas Corporation reports that West Bengal has notified the revocation of the Incentive Schemes Act 2025. This revocation impacts incentives worth 4.27 billion rupees and 3 billion rupees. In response, the company has filed a writ petition against the Revocation Act.",
            "Sentiment": "negative",
            "PublishDate": 1750031809000,
            "Source": "default"
        },
        {
            "Title": "West Bengal Revokes Incentive Schemes Affecting Nuvoco Vistas Corporation",
            "Summary": "Nuvoco Vistas Corporation reports that West Bengal has announced the revocation of incentive schemes under the Act 2025. This revocation impacts incentives totaling 4.27 billion rupees and 3 billion rupees. In response, the company has filed a writ petition challenging the revocation act.",
            "Sentiment": "negative",
            "PublishDate": 1749816276000,
            "Source": "default"
        },
        {
            "Title": "Nuvoco Vistas: Rs 1,200 Crore Fundraising Plan for Vadraj Cement Acquisition",
            "Summary": "Nuvoco Vistas plans to raise Rs 1,200 crore through CCDs and CCPS to partially fund its Rs 1,800 crore acquisition of Vadraj Cement. The company will initially use bridge financing and long-term debt, followed by structured funding in Vadraj post-acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1749691451000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco Vistas Corp Reports Mixed Q4 Results",
            "Summary": "Nuvoco Vistas Corp announced its Q4 financial results. The company's consolidated net profit increased to 1.66 billion rupees, up from 1 billion rupees in the same quarter last year. However, this represents a loss of 613.7 million rupees compared to the previous quarter. Revenue for Q4 rose to 30.42 billion rupees from 29.3 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746144653000,
            "Source": "default"
        },
        {
            "Title": "Nuvoco Vistas Corp Reports Q4 Financial Results",
            "Summary": "Nuvoco Vistas Corp announced its Q4 financial results. The company's EBITDA increased to 5.52 billion rupees from 4.91 billion rupees year-over-year, with EBITDA margin improving to 18.13% from 16.73%. Revenue rose to 30.42 billion rupees from 29.3 billion rupees. Consolidated net profit grew to 1.66 billion rupees from 1 billion rupees year-over-year, but showed a loss of 613.7 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746107667000,
            "Source": "result"
        },
        {
            "Title": "Nuvoco Vistas Corporation to Consider Q4 Results on May 1",
            "Summary": "Nuvoco Vistas Corporation has announced that it will consider its fourth quarter (Q4) financial results on May 1. This indicates that the company is preparing to release its earnings report for the last quarter of its fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744380977000,
            "Source": "earnings"
        },
        {
            "Title": "Nuvoco Vistas: NCLT Approves Rs 1,800 Crore Bid for Vadraj Cement",
            "Summary": "NCLT Mumbai has approved Nuvoco Vistas' bid to acquire Vadraj Cement for Rs 1,800 crore upfront payment. The acquisition will increase Nuvoco's cement capacity to 31 MTPA, solidifying its position as India's fifth-largest cement maker. Nuvoco plans to invest an additional Rs 1,200 crore to operationalize Vadraj's assets, with production expected to start in Q3 FY2027.",
            "Sentiment": "positive",
            "PublishDate": 1743779979000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco Vistas Corporation: Q3 FY25 Reports ₹61.37 Cr Loss, Revenue Dips 0.48% YoY",
            "Summary": "Nuvoco Vistas Corporation's Q3 FY25 results show a loss of ₹61.37 Cr, contrasting with a profit of ₹31.03 Cr in Q3 FY24. Revenue decreased by 0.48% YoY but grew 6.21% QoQ. Operating income rose 1077.81% QoQ but fell 77.19% YoY. EPS declined to ₹-1.72, down 297.7% YoY. Analysts' consensus recommendation is to Hold.",
            "Sentiment": "negative",
            "PublishDate": 1737609454000,
            "Source": "earnings"
        },
        {
            "Title": "Nuvoco Vistas Anticipates Increase in Q4 Metrics",
            "Summary": "Nuvoco Vistas expects a Rs 15-20 increase in a key metric for Q4, driven by anticipated volume growth and successful program implementation. The company advises considering its outlook for the next 4-5 years for modeling and projections.",
            "Sentiment": "positive",
            "PublishDate": 1737603137000,
            "Source": "earnings"
        },
        {
            "Title": "Nuvoco Vistas Corp Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Nuvoco Vistas Corp has reported a significant decrease in its third-quarter EBITDA, which fell to 2.58 billion rupees from 4.10 billion rupees in the same period last year. The company's EBITDA margin also declined, dropping to 10.70% from 16.93% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737533303000,
            "Source": "earnings"
        },
        {
            "Title": "Nuvoco Vistas Corporation Reports Q3 Net Loss of 614 Million Rupees",
            "Summary": "Nuvoco Vistas Corporation, a cement manufacturing company, has reported a consolidated net loss of 614 million rupees for the third quarter. This represents a significant downturn compared to the same period last year when the company posted a profit of 310 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1737533238000,
            "Source": "earnings"
        },
        {
            "Title": "Nuvoco Vistas Corp Approved as Successful Resolution Applicant for Vadraj Cement Limited",
            "Summary": "Nuvoco Vistas Corp has been approved as the successful resolution applicant for the insolvency process of Vadraj Cement Limited. The acquisition will be implemented through Nuvoco's subsidiary, Vanya Corporation.",
            "Sentiment": "positive",
            "PublishDate": 1736208629000,
            "Source": "corporate_action"
        },
        {
            "Title": "Nuvoco Vistas Approved as Successful Resolution Applicant for Vadraj Cement",
            "Summary": "Nuvoco Vistas Corporation has been approved as the successful resolution applicant for Vadraj Cement Limited's insolvency process. The acquisition will be implemented through Nuvoco's subsidiary, Vanya Corporation.",
            "Sentiment": "positive",
            "PublishDate": 1736158315000,
            "Source": "corporate_action"
        }
    ]
}