{
    "Symbol": "NYKAA",
    "ISIN": "INE388Y01029",
    "News": [
        {
            "Title": "Nykaa Allots 3.70 Lakh Shares Under ESOP Exercise",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) has allotted 3,70,900 equity shares to employees under its Employee Stock Option Scheme, increasing the company's issued and paid-up share capital.",
            "Sentiment": "positive",
            "PublishDate": 1770916855641,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nykaa CEO Cites Guidance Challenges Amid Growth",
            "Summary": "Nykaa's CEO highlights difficulties in providing financial guidance despite strong beauty sector growth and rising e-commerce trends with quick commerce adoption.",
            "Sentiment": "neutral",
            "PublishDate": 1770348443425,
            "Source": "stocks"
        },
        {
            "Title": "Nykaa Shareholders Approve Falguni Nayar Re-appointment",
            "Summary": "FSN E-Commerce Ventures (Nykaa) shareholders approved re-appointment of Ms. Falguni Nayar as Executive Chairperson, MD & CEO for 5 years through postal ballot with 90.14% votes in favour.",
            "Sentiment": "positive",
            "PublishDate": 1769676294833,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nykaa Q3 PAT Expected to Surge 105.7% YoY to ₹53.7 Cr",
            "Summary": "ICICI Securities forecasts strong Q3 performance for Nykaa with net profit rising 105.7% YoY to ₹53.7 crore, while revenue is expected to grow 26.6% to ₹2,870 crore for October-December period.",
            "Sentiment": "positive",
            "PublishDate": 1769146460471,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nykaa Forms Triple Top Pattern, Signals Bearish Reversal",
            "Summary": "Nykaa Ltd has formed a triple top pattern on its 4-hour chart after breaking below ₹240 support level, with technical indicators confirming bearish momentum and potential near-term downside pressure.",
            "Sentiment": "negative",
            "PublishDate": 1769135160628,
            "Source": "stocks"
        },
        {
            "Title": "Nykaa Board Meeting Set for Feb 5 to Review Q3 Results",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) has scheduled a board meeting on February 5, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 7, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768919293413,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nykaa Receives Enhanced ESG Rating of 72 from NSE",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) receives voluntary ESG rating of 72 for FY2025 from NSE Sustainability, reflecting improved environmental, social and governance performance.",
            "Sentiment": "positive",
            "PublishDate": 1767880690268,
            "Source": "stocks"
        },
        {
            "Title": "Nykaa Expects Revenue Growth in Upper Mid-Twenties",
            "Summary": "FSN E-Commerce Ventures (Nykaa) anticipates consolidated net revenue growth nearing upper mid-twenties, showing slight acceleration from previous mid-twenties growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1767580888136,
            "Source": "stocks"
        },
        {
            "Title": "Nykaa Q3 FY26 Revenue Update Shows Strong Growth",
            "Summary": "FSN E-Commerce Ventures (Nykaa) reports consolidated GMV and NSV growth in late twenties for Q3 FY26, with Beauty vertical delivering highest NSV growth in 6 quarters and Fashion vertical continuing revival. Stock gained 60% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767537596735,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nykaa's Beauty Rewind 2025: 1,750 lipsticks sold hourly",
            "Summary": "Nykaa's 2025 data reveals Indian beauty consumers prioritized performance over trends, with 1,750 lipsticks sold hourly and 1 crore rosemary products purchased across 45 million users.",
            "Sentiment": "positive",
            "PublishDate": 1767011942995,
            "Source": "stocks"
        },
        {
            "Title": "Nykaa Seeks Shareholder Approval for CEO Re-appointment",
            "Summary": "FSN E-Commerce Ventures Limited announces postal ballot for re-appointing Falguni Nayar as Executive Chairperson, MD & CEO for 5 years with ₹12.00 crore annual fixed compensation plus variable pay.",
            "Sentiment": "positive",
            "PublishDate": 1767004512053,
            "Source": "stocks"
        },
        {
            "Title": "Nykaa Receives Improved ESG Rating of 65.9 from SES ESG Research",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) received an unsolicited ESG score of 65.9 for 2025, up from 62.9, assigned by SEBI-registered ESG ratings provider SES ESG Research. The rating was prepared independently by SES based on FY2024-25 data and publicly available information, without any engagement from Nykaa.",
            "Sentiment": "positive",
            "PublishDate": 1764844494615,
            "Source": "stock"
        },
        {
            "Title": "FSN E-Commerce Ventures Sees Rs. 76.92 Crore Block Trade on NSE",
            "Summary": "FSN E-Commerce Ventures executed a block trade worth Rs. 76.92 crores involving approximately 2,897,679 shares at Rs. 265.46 per share on NSE. The transaction represents a significant institutional trading activity that could impact the company's stock liquidity and investor sentiment.",
            "Sentiment": "neutral",
            "PublishDate": 1764302554350,
            "Source": "order&deals"
        },
        {
            "Title": "Nykaa Appoints Chetan Sharma as Company Secretary and Key Managerial Personnel",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) appointed Chetan Sharma as Company Secretary, Compliance Officer and Key Managerial Personnel effective November 26, 2025, following Board approval based on the Nomination and Remuneration Committee's recommendation. Sharma brings 19 years of experience across company secretarial, legal, governance and compliance functions, having previously served as Group Company Secretary at Emcure Pharmaceuticals where he led strategic initiatives including IPO and M&A projects.",
            "Sentiment": "positive",
            "PublishDate": 1764157400678,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nykaa Seeks Shareholder Approval for Dipak Gupta's Appointment as Independent Director",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) has issued a postal ballot notice seeking member approval for appointing Dipak Gupta as Non-Executive Independent Director for a 5-year term from October 1, 2025 to September 30, 2030. The former Managing Director & CEO of Kotak Mahindra Bank brings over three decades of financial services experience, with remote e-voting scheduled from November 27 to December 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764150126123,
            "Source": "corporate_action"
        },
        {
            "Title": "FSNE-Commerce Ventures Allots 664,160 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "FSNE-Commerce Ventures Limited allotted 664,160 equity shares on November 15, 2025, following the exercise of vested stock options by employees under the company's Employee Stock Option Scheme. The newly allotted shares will rank equally with existing equity shares in all respects, affecting the company's share capital structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763227312515,
            "Source": "corporate_action"
        },
        {
            "Title": "Nykaa Reports 30% GMV Growth in Q2 FY26 with Highest EBITDA Margin Since IPO",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) delivered strong quarterly results with GMV reaching INR 4,744 crores, marking 30% year-on-year growth - the highest in 6 quarters. Net revenue grew 25% to INR 2,346 crores while gross profit increased 28% to INR 1,054 crores at 44.9% margin. EBITDA improved 53% to INR 159 crores (6.8% margin), achieving the highest EBITDA margin since IPO. PAT surged 154% to INR 33 crores. Beauty business maintained momentum with 28% GMV growth and 9.0% EBITDA margin. Fashion vertical showed strong recovery with 37% GMV growth and significant EBITDA improvement from -9.0% to -3.5%. The company expanded its store network to 265 stores across 90 cities, adding 19 stores in the quarter. Customer base grew 32% to 49 million with House of Nykaa brands reaching INR 2,900 crores annualized GMV. Nykaa Now operates 53 stores across 7 cities, delivering 70% of orders within next day in top 110 cities.",
            "Sentiment": "positive",
            "PublishDate": 1762974987280,
            "Source": "earnings"
        },
        {
            "Title": "Nykaa Q2 Profit Surges 243% YoY to Rs 34 Crore; Nuvama Raises Target Price to Rs 285",
            "Summary": "FSN E-Commerce Ventures (Nykaa) reported a consolidated net profit of Rs 34 crore in Q2FY26, representing a 243% year-on-year increase from Rs 10 crore in the previous year. Revenue from operations grew 25% YoY to Rs 2,346 crore from Rs 1,875 crore. The company achieved its highest gross margin in 12 quarters at 50% of net revenues, with gross profit rising 28% YoY to Rs 1,054 crore. EBITDA increased 53% YoY to Rs 159 crore, marking the highest since its IPO, with EBITDA margin expanding to 6.8% from 5.5%. PAT margin improved to 1.4% from 0.7%. The company expanded its retail presence by adding 19 new stores across eight cities, bringing total retail space to over 2.7 lakh square feet. Nuvama maintained its 'Buy' rating and raised the target price from Rs 235 to Rs 285, citing stronger long-term growth prospects despite profit falling short of the Rs 38.2 crore consensus estimate.",
            "Sentiment": "positive",
            "PublishDate": 1762742004936,
            "Source": "earnings"
        },
        {
            "Title": "FSN E-Commerce Ventures Reappoints Falguni Nayar as Executive Chairperson, MD, and CEO",
            "Summary": "FSN E-Commerce Ventures has reappointed Ms. Falguni Nayar to serve as Executive Chairperson, Managing Director, and Chief Executive Officer of the company.",
            "Sentiment": "positive",
            "PublishDate": 1762520560858,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nykaa Reports 243% Jump in Quarterly Net Profit to Rs 34 Crore",
            "Summary": "FSN E-Commerce Ventures, which operates the Nykaa brand, reported a consolidated net profit of Rs 34 crore for the quarter, representing a 243% year-over-year increase from Rs 10 crore in the same period last year. Revenue from operations reached Rs 2,346 crore, marking a 25% year-over-year growth from Rs 1,875 crore. On a sequential basis, net profit grew 48% from Rs 23 crore in the previous quarter, while revenue increased 9% from Rs 2,155 crore. The company's gross profits stood at Rs 1,054 crore, representing 50% of net revenues and showing a 28% year-over-year increase. Nykaa stated that the gross margin for the quarter was the highest in the last 12 quarters.",
            "Sentiment": "positive",
            "PublishDate": 1762513147030,
            "Source": "earnings"
        },
        {
            "Title": "Nykaa Expected to Report Strong Q2 Growth with 25-27% Revenue Increase",
            "Summary": "Beauty and fashion retailer Nykaa is projected to deliver robust quarterly results with analysts estimating 25-27% year-on-year revenue growth for the July-September period. The growth is expected to be driven by festive demand and strong performance in the beauty segment. Nuvama estimates Nykaa's Beauty and Personal Care GMV to rise 32% year-on-year, while the fashion segment is expected to grow 25%. Overall revenue is projected to reach Rs 2,380 crore with EBITDA margin expansion to 6.7%. Kotak Equities projects 24% GMV growth and 25% revenue growth, with BPC segment growing 26% and fashion segment growing 14%. EBITDA margin is expected to expand to 7.2%, with Kotak projecting a 276% year-on-year jump in net profit. The improved performance is attributed to the company's hybrid marketplace model, brand partnerships, better inventory control, operating leverage, and reduced losses in the fashion segment.",
            "Sentiment": "positive",
            "PublishDate": 1762408661260,
            "Source": "earnings"
        },
        {
            "Title": "FSN E-Commerce Reports Strong Q2 FY2026 Growth with GMV Expected to Reach 30%",
            "Summary": "FSN E-Commerce reported strong growth in Q2 FY2026, with Gross Merchandise Value (GMV) expected to approach 30%. This represents an improvement from the mid-20s percentage range recorded in recent quarters.",
            "Sentiment": "positive",
            "PublishDate": 1759718504664,
            "Source": "earnings"
        },
        {
            "Title": "Nykaa Appoints Dipak Gupta, Former Kotak Mahindra Bank MD & CEO, as Independent Director",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) has appointed Dipak Gupta as an Additional Independent Director effective October 1, 2025, for a five-year term until September 30, 2030, subject to shareholder approval. Gupta served as Managing Director & CEO of Kotak Mahindra Bank Limited until December 31, 2023, bringing over three decades of financial services experience. He was instrumental in building several businesses within the Kotak Mahindra Group, including forging the partnership with Ford Credit and serving as the first CEO of their joint venture. Gupta is not related to any existing Nykaa directors and is not debarred from holding directorial positions. With his appointment, Nykaa's Board will comprise 11 members, with women forming close to 30% of the board composition and independent directors representing nearly 55% of the Board. Falguni Nayar, Executive Chairperson and CEO, highlighted that Gupta's financial services knowledge and strategic acumen will be valuable as Nykaa continues to scale and diversify.",
            "Sentiment": "positive",
            "PublishDate": 1758724453633,
            "Source": "corporate_governance"
        },
        {
            "Title": "FSN E-Commerce Ventures Executes Rs. 47.65 Crore Block Trade on NSE",
            "Summary": "FSN E-Commerce Ventures Ltd. completed a block trade on the National Stock Exchange worth Rs. 47.65 crores. The transaction involved approximately 2,001,974 shares at a price of Rs. 238.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757650453279,
            "Source": "order&deals"
        },
        {
            "Title": "Nykaa Reports Strong Q3 Performance with 27% Revenue Growth and 42% EBITDA Increase",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) delivered robust quarterly results with revenue from operations reaching Rs 22,672 million, marking 27% year-over-year growth. The company's EBITDA surged 42% to Rs 1,408 million, while profit after tax increased 51% to Rs 264 million. Gross Merchandise Value (GMV) grew 25% to Rs 45,279 million across all verticals. The beauty segment drove strong performance with 32% GMV growth to Rs 33,899 million, while fashion segment GMV increased 8% to Rs 11,299 million. Nykaa expanded its physical presence by adding 12 stores, bringing the total to 221 stores across 73 cities. The company's cumulative customer base reached approximately 40 million, with beauty orders showing 70% same/next day delivery in top 110 cities. House of Nykaa beauty brands achieved 49% GMV growth, while the eB2B segment (Superstore by Nykaa) recorded 52% GMV growth. Gross profit margin improved to 43.7% from 42.5% in the previous year, supported by strong owned brand performance and operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1757146854670,
            "Source": "earnings"
        },
        {
            "Title": "Nykaa Expands Korean Beauty Portfolio with Launch of Mise En Scène and RYO Haircare Brands",
            "Summary": "Nykaa and South Korea's Amorepacific have launched two new Korean haircare brands in India - Mise En Scène and RYO. This expansion marks the 10th anniversary of their partnership. Mise En Scène, Korea's top-selling haircare brand, is being introduced in India for the first time with products like Perfect Serum Original and Salon 10 range available exclusively on Nykaa. The brand specializes in 'Glass Hair' formulations using salon-inspired technology. RYO focuses on scalp care using traditional Korean herbal science, offering solutions for hair loss and gender-specific treatments. With this launch, Nykaa now retails eight brands from Amorepacific's portfolio, including Laneige, Innisfree, Sulwhasoo, COSRX, and Aestura. The partnership began in 2016 with Innisfree's rollout in India. The launch responds to growing demand for Korean beauty products in India's haircare segment, with K-beauty evolving from niche to mainstream category. Both brands will be available on Nykaa's online platforms and select physical stores.",
            "Sentiment": "positive",
            "PublishDate": 1756882366884,
            "Source": "stock"
        },
        {
            "Title": "Nykaa Expands Kay Beauty to UK Market Through Space NK Partnership",
            "Summary": "FSN E-Commerce Ventures, owner of the Nykaa platform, is launching its Kay Beauty brand in the UK through a partnership with Space NK across 13 stores and online platforms. The brand, developed with Bollywood actor Katrina Kaif in 2019, plans to expand to the US, Middle East and Asian markets. FSN aims to nearly triple its in-house brands' gross merchandise value to 60 billion rupees by March 2030, up from 21 billion rupees in the previous financial year. The company has already established presence in the Middle East through partnerships in UAE, Qatar and Oman. FSN's shares have gained almost 40% this year, significantly outperforming India's benchmark Nifty 50 Index's near 4% gain. The company targets profitability margins in the mid-teens to early-twenties range and expects newer launches to drive sales during India's upcoming festival season.",
            "Sentiment": "positive",
            "PublishDate": 1756373557129,
            "Source": "stock"
        },
        {
            "Title": "Nykaa Reports Strong Q1 Performance with 26% GMV Growth and 79% Jump in Profit",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) delivered robust quarterly results with GMV reaching INR 4,182 crores, marking 26% year-on-year growth. Net revenue grew 23% to INR 2,155 crores, while gross profit expanded to 44.6% of net revenue at INR 962 crores, representing 27% growth. EBITDA margin improved to 6.5% with absolute EBITDA of INR 141 crores, showing 46% year-on-year growth. PAT surged 79% to INR 24 crores, achieving 1.1% margin. The Beauty vertical maintained strong momentum with 26% GMV growth to INR 3,208 crores and improved EBITDA margin from 8.5% to 9%. Fashion business grew 25% in GMV to INR 964 crores with EBITDA losses narrowing significantly from minus 9.2% to minus 6.2%. The company expanded its physical presence to 250 beauty stores across 82 cities and launched quick delivery service Nykaa Now in 7 cities. House of Nykaa brands achieved 57% growth with annualized GMV of INR 2,700 crores, led by Dot & Key crossing INR 1,500 crores run rate. Customer base grew 30% to 45 million with the platform now hosting over 9,000 brands.",
            "Sentiment": "positive",
            "PublishDate": 1755172598670,
            "Source": "earnings"
        },
        {
            "Title": "Nykaa Shares Surge 4% with Strong Trading Volumes and Long Build-up in F&O Market",
            "Summary": "FSN E-commerce Ventures (Nykaa) shares rose over 4% in early trading on August 13, following a nearly 50% expansion in EBITDA margin. Trading volumes were exceptionally high with over 11 million shares changing hands in the first 45 minutes, more than 4 times the 10-day average. The futures market showed a 6.7% increase in open interest, indicating long positions and trader expectations of further price increases. Nykaa topped the list of stocks with highest open interest increases alongside price rises, followed by Apollo Hospitals (7.97%), TVS Motor (5.4%), Paytm (3.72%), and Nuvama (3.35%). JM Financial analysts rated the stock as 'buy' with a target price of ₹260, citing expectations of accelerated EBITDA margin improvement and shrinking losses in the fashion unit. The stock has declined 4% over the past month but gained 24% over six months.",
            "Sentiment": "positive",
            "PublishDate": 1755060488605,
            "Source": "stock"
        },
        {
            "Title": "FSN E-Commerce Management Expects Competitive Pressures to Ease, Confirms Fashion Unit EBITDA Breakeven Target",
            "Summary": "FSN E-Commerce management expects competitive pressures to ease in coming quarters. The company confirmed it remains on track to meet its investor day guidance of achieving EBITDA breakeven for its fashion segment during this year. The company launched approximately 400 new brands in Q1, with the beauty segment adding around 100 brands and fashion segment launching about 300 new brands.",
            "Sentiment": "positive",
            "PublishDate": 1755056262228,
            "Source": "stock"
        },
        {
            "Title": "Nykaa Outlines Long-Term Growth Strategy Focusing on Beauty Leadership and Fashion Expansion",
            "Summary": "Nykaa has outlined its long-term growth strategy for FY26-28, focusing on maintaining leadership in the beauty and personal care segment while expanding its fashion platform. The company plans to develop high-profit private label products and pursue omnichannel growth supported by technology-driven personalization. The strategy emphasizes strong customer growth to support margins and market share expansion during the three-year period.",
            "Sentiment": "positive",
            "PublishDate": 1755016956737,
            "Source": "stock"
        },
        {
            "Title": "Nykaa's Company Secretary Neelabja Chakrabarty Resigns to Pursue External Opportunities",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) announced that Neelabja Chakrabarty has resigned from his position as Company Secretary and Compliance Officer. His resignation, submitted on August 8, 2025, will be effective from the close of business hours on September 30, 2025. Chakrabarty is leaving to pursue opportunities outside the organization. The company has accepted his resignation and acknowledged his valuable services while wishing him success in future endeavors.",
            "Sentiment": "neutral",
            "PublishDate": 1755002204326,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nykaa Acquires Remaining 40% Stake in Nudge Wellness for Rs 14.26 Lakhs, Reports Strong Q1 FY26 Results",
            "Summary": "FSN E-Commerce Ventures Limited (Nykaa) board approved the acquisition of the remaining 40% stake in Nudge Wellness Private Limited from Onesto Labs Private Limited for Rs 14.26 lakhs, making it a wholly-owned subsidiary. The transaction is based on pre-agreed terms from a shareholders' agreement dated April 2022 and is expected to complete by September 30, 2025. Nudge Wellness operates in health and wellness supplements with a turnover of Rs 34.79 lakhs in FY 2024-25. Separately, Nykaa reported strong quarterly results with consolidated GMV up 26% YoY to Rs 4,182 crores, revenue from operations growing 23% YoY to Rs 2,155 crores, and net profit surging 79% YoY to Rs 24 crores. EBITDA margins expanded to 6.5% from 5.5% in the previous year. The beauty business GMV increased 26% YoY to Rs 3,208 crores, while fashion GMV grew 25% YoY to Rs 964 crores. The company's cumulative customer base reached 45 million.",
            "Sentiment": "positive",
            "PublishDate": 1754998777672,
            "Source": "order&deals"
        },
        {
            "Title": "FSN E-Commerce Ventures Reports Strong Q1 Growth with Revenue Up 23% and Profit More Than Doubled",
            "Summary": "FSN E-Commerce Ventures delivered robust quarterly results with revenue rising to 21.55 billion rupees from 17.46 billion rupees year-over-year. The company's consolidated net profit surged to 233 million rupees compared to 96 million rupees in the same period last year. EBITDA improved to 1.41 billion rupees from 961 million rupees, while EBITDA margin expanded to 6.53% from 5.50% year-over-year, indicating enhanced operational efficiency and profitability across the business.",
            "Sentiment": "positive",
            "PublishDate": 1754996629098,
            "Source": "earnings"
        },
        {
            "Title": "Nykaa Fashion Wins 100 Million Rupees in Arbitration Award",
            "Summary": "FSN E-Commerce Ventures' subsidiary Nykaa Fashion has received 100 million rupees as compensation through an arbitration award. The company successfully obtained this monetary settlement through the arbitration process.",
            "Sentiment": "positive",
            "PublishDate": 1754578024388,
            "Source": "stock"
        },
        {
            "Title": "Nykaa: Bollywood Actor Sharvari Named New Brand Icon",
            "Summary": "Nykaa has appointed Bollywood actor Sharvari as its new brand icon. She will feature in major campaigns and experiences like Hot Pink Sale, Nykaa Play, Nykaaland, and New at Nykaa. Sharvari will also serve as a jury member for the Nykaa Best in Beauty Awards 2025.",
            "Sentiment": "positive",
            "PublishDate": 1751871057000,
            "Source": "normal_news"
        },
        {
            "Title": "FSN E-Commerce Ventures Ltd: Nykaa Projects Solid Q1 Performance",
            "Summary": "Nykaa expects Q1 consolidated net revenue growth at lower end of mid-twenties. GMV growth to cross mid-twenties. Beauty vertical GMV growth in higher mid-twenties despite geopolitical tensions. Fashion vertical shows improvement with mid-twenties GMV growth. House of Nykaa brands accelerating growth.",
            "Sentiment": "positive",
            "PublishDate": 1751852547000,
            "Source": "earnings"
        },
        {
            "Title": "FSN E-Commerce Anticipates Lower-End Growth for Q1 FY26",
            "Summary": "FSN E-Commerce expects its consolidated net revenue growth for Q1 FY26 to be at the lower end of the mid-twenties range year-over-year. The company also anticipates slightly higher GMV (Gross Merchandise Value) growth, indicating ongoing progress in its operations.",
            "Sentiment": "positive",
            "PublishDate": 1751851158000,
            "Source": "default"
        },
        {
            "Title": "FSN E-Commerce Ventures: Nykaa Sees Customer Growth but Retail Shareholder Decline",
            "Summary": "Nykaa's customer base grew from 24 million to 42 million over two years, but retail shareholders decreased by over 1 lakh. Public shareholding halved to 13.8%, and FPI stake reduced to 8.83%. Domestic institutions increased their stake to 24.83%. The company targets break-even for fashion business this year and projects 30% CAGR for own brands until 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1751585469000,
            "Source": "normal_news"
        },
        {
            "Title": "FSN E-Commerce Ventures Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 3,108,963 shares of FSN E-Commerce Ventures Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 203.59 per share. The total value of the transaction was Rs. 63.30 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1751514331000,
            "Source": "block_details"
        },
        {
            "Title": "FSN E-Commerce Ventures: Early Investors Plan Rs 1,200-Crore Stake Sale",
            "Summary": "Harindarpal Singh Banga and Indra Banga, early investors in Nykaa's parent company FSN E-Commerce Ventures, plan to sell up to 60 million shares (2.1% stake) at a floor price of Rs 200 per share through a block deal. The sale, worth up to Rs 1,200 crore, represents a 5.5% discount to the last traded price. The transaction is set for July 3, with a 45-day lock-up period for sellers.",
            "Sentiment": "neutral",
            "PublishDate": 1751511396000,
            "Source": "block_deals"
        },
        {
            "Title": "FSN E-Commerce Ventures: Promoters to Sell Rs 1,200 Crore Stake in Block Deal",
            "Summary": "Nykaa's parent company FSN E-Commerce Ventures will see promoters Harindarpal Singh Banga and Indra Banga sell up to 60 million shares (2.1% stake) in a block deal. The floor price is set at Rs 200 per share, a 5.5% discount to the last traded price. The deal, managed by Goldman Sachs and JP Morgan, is expected to execute on July 3 with settlement on July 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1751468110000,
            "Source": "block_deals"
        },
        {
            "Title": "FSN E-Commerce Ventures Ltd.: Banga Family to Sell $150 Million Stake in Nykaa",
            "Summary": "Harindarpal Singh Banga and family, early investors in Nykaa, plan to sell a $150 million (Rs 1,284 crore) stake via block deal. The sale is expected to be announced on Wednesday at a 4% discount to current market price.",
            "Sentiment": "neutral",
            "PublishDate": 1751453249000,
            "Source": "block_deals"
        },
        {
            "Title": "Nykaa: HDFC Securities Issues 'Reduce' Rating",
            "Summary": "HDFC Securities has given a 'Reduce' rating to Nykaa. The company's FY25 saw increased customer acquisition in beauty and personal care. Nykaa's mid-to-late 20s growth target for FY25-30 in the beauty and personal care segment is considered aggressive but plausible, with analysts projecting a 21% CAGR.",
            "Sentiment": "negative",
            "PublishDate": 1751279186000,
            "Source": "normal_news"
        },
        {
            "Title": "FSN E-Commerce Ventures Ltd.: Analysts Divided on Nykaa's Growth Prospects",
            "Summary": "Nykaa shares rally after investor day presentation. CLSA maintains 'Outperform' with ₹229 target, expecting mid-20% GMV CAGR for BPC segment. Nomura rates 'Neutral' with ₹216 target, projecting 22-25% revenue CAGR. Macquarie remains 'Underperform' with ₹145 target, citing risks to beauty margin estimates. Fashion segment aims for EBITDA breakeven by FY26, 10% margin in medium term.",
            "Sentiment": "neutral",
            "PublishDate": 1750998216000,
            "Source": "normal_news"
        },
        {
            "Title": "FSN E-Commerce Ventures Ltd: Nykaa Launches Quick Commerce, Sets Fashion Business Targets",
            "Summary": "Nykaa launched 'Nykaa Now', a quick commerce platform for beauty products in 7 cities. The company expects its fashion business to break even in FY26 with mid-single digit margins by FY28. Nykaa aims to grow 3-4 times in the next 5 years and targets 10% steady state EBITDA margins for fashion. Own brands reported 2,100 crore GMV across 12 brands, with organic portfolio expected to grow at 30% CAGR to 6,000 crore GMV by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1750929497000,
            "Source": "normal_news"
        },
        {
            "Title": "FSN E-commerce Targets EBITDA Breakeven in Fashion by FY2026",
            "Summary": "FSN E-commerce has presented its future plans in an investor presentation. The company expects to achieve EBITDA breakeven in its fashion segment by fiscal year 2026. Additionally, FSN E-commerce aims to grow its organic portfolio by 30% annually, targeting a Gross Merchandise Value (GMV) of ₹6000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750911696000,
            "Source": "default"
        },
        {
            "Title": "FSN E-Commerce Ventures Ltd: CLSA Initiates Coverage with 'Outperform' Rating",
            "Summary": "CLSA initiates coverage on Nykaa's parent company with an 'Outperform' rating and ₹229 price target, implying 12% upside. The brokerage sees Nykaa as well-positioned in India's growing beauty market despite rising competition. CLSA projects EBITDA margin expansion of 310 basis points between FY25 and FY28CL.",
            "Sentiment": "positive",
            "PublishDate": 1750734104000,
            "Source": "normal_news"
        },
        {
            "Title": "Nykaa: Margin Boost and Fashion Turnaround Drive Next Growth Phase",
            "Summary": "Nykaa reported a 40% rise in Ebitda to Rs 470 crore for FY25, with GMV growing 28% to Rs 15,600 crore. The company expects margins to exceed 6% driven by a steady beauty business and improving fashion segment. Nykaa Fashion, currently at -8% Ebitda, improved by 200 basis points in FY25 and could break even in about four years. The beauty segment holds over 30% market share and is growing at 30%. Nykaa's House of Brands strategy is boosting margins, with own brand gross margins between 65-80%.",
            "Sentiment": "positive",
            "PublishDate": 1749429136000,
            "Source": "earnings"
        },
        {
            "Title": "FSN E-Commerce Ventures Ltd: Nykaa Shares Drop Despite Profit Surge",
            "Summary": "Nykaa's parent company shares fell 5% despite a 193% increase in Q4 net profit. Concerns over fashion growth, margin pressures, and high valuations led to mixed brokerage opinions. Macquarie rated 'underperform' with a ₹145 target, while Citi assigned 'sell' with a ₹160 target.",
            "Sentiment": "negative",
            "PublishDate": 1748909664000,
            "Source": "result"
        }
    ]
}