{
    "Symbol": "OAL",
    "ISIN": "INE959C01023",
    "News": [
        {
            "Title": "Oriental Aromatics Schedules Q3FY26 Earnings Call",
            "Summary": "Oriental Aromatics Limited announces conference call on February 13, 2026 at 1:00 PM IST to discuss Q3FY26 financial performance with institutional investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770373015336,
            "Source": "stocks"
        },
        {
            "Title": "Oriental Aromatics VP Sales & Marketing Resigns Due to Personal Reasons",
            "Summary": "Ms. Savita Dalvi, Vice President-Sales Marketing at Oriental Aromatics Limited, resigned from her position with immediate effect on November 18, 2025, citing personal reasons. The company accepted her resignation and relieved her from duties effective from the close of business hours on the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1763467981511,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oriental Aromatics Reports Record Q2 Sales Despite Margin Pressure from Chinese Competition",
            "Summary": "Oriental Aromatics achieved highest-ever quarterly sales of Rs. 271 crores with 20% sequential growth, driven by strong performance across fragrance, aroma ingredients, and camphor divisions despite festive demand tailwinds. However, EBITDA margins compressed to 6.34% from previous levels due to pricing pressure from Chinese suppliers in non-tariff markets and the ramp-up phase of the new Mahad facility impacting profitability by 1.5-2%.",
            "Sentiment": "neutral",
            "PublishDate": 1763122494232,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Oriental Aromatics reported Q2 revenue of 2.7 billion rupees, up from 2.4 billion rupees in the same quarter last year. However, the company's profitability declined significantly with consolidated net profit falling to 7 million rupees from 148 million rupees year-over-year. EBITDA dropped to 173 million rupees from 286 million rupees, while EBITDA margin compressed to 6.36% from 12.09% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762777580818,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Reports 4.5% Revenue Growth in Q1 FY26 Despite Margin Pressures",
            "Summary": "Oriental Aromatics Limited reported operating revenue of INR 226 crores for Q1 FY26, marking a 4.5% year-on-year growth but a 10.9% quarter-on-quarter decline. The company achieved a 10% increase in production volume and 4% growth in group sales volume, driven by enhanced hydrogenation plant output and initial sales from the Mahad facility. EBITDA stood at INR 18 crores with margins at 8.03%, improving sequentially from 7.62% but down from 10.29% in the corresponding quarter. Net profit after tax was INR 0.5 crores, impacted by higher depreciation and finance costs from recent capacity expansions. The company maintains EBITDA guidance of 8-10% and expects stronger performance in Q2 due to festive demand. Management highlighted potential headwinds from 50% tariffs on certain Indian exports but emphasized their diversified product mix as a natural cushion. The Mahad facility is currently running at 20-30% capacity with revenue contribution of INR 38 lakhs in the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755168354875,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Reports Mixed Q1 Results with Revenue Growth but Sharp Profit Decline",
            "Summary": "Oriental Aromatics Limited released its quarterly earnings presentation showing revenue growth of 4.5% to INR 2,255 million, but faced significant profitability challenges. EBITDA declined 18.5% to INR 181 million with margins contracting to 8.03%. Net profit dropped dramatically by 95.5% to INR 5 million, while earnings per share fell 95.4% to INR 0.15. The company attributed the margin pressure to the ramp-up of its new Mahad plant and planned maintenance at the Bareilly facility. Production grew 10% and sales volumes increased 4%, driven by higher output from the hydrogenation plant. Raw material prices remained stable during the quarter. Management expects margin recovery in coming quarters as the Mahad plant reaches full capacity. The company noted a temporary slowdown in specialty chemicals due to global geopolitical factors and forex fluctuations impacting costs.",
            "Sentiment": "negative",
            "PublishDate": 1754885114206,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Reports Mixed Q1 Performance with Standalone Growth, Consolidated Revenue Decline",
            "Summary": "Oriental Aromatics Limited, a manufacturer of aromatic chemicals, reported its quarterly results with mixed performance indicators. On a standalone basis, the company showed growth with revenue from operations increasing to ₹218.74 crore from ₹204.80 crore year-over-year, while net profit rose to ₹17.19 crore from ₹12.04 crore. However, consolidated revenue declined to ₹291.60 crore from ₹333.33 crore, though consolidated net profit improved to ₹19.85 crore from ₹14.92 crore. The company received ₹1.83 crore in export incentives from the RODTEP scheme and recorded a foreign exchange gain of ₹1.04 crore. Oriental Aromatics maintains a net worth of ₹514.71 crore on standalone basis and ₹540.71 crore on consolidated basis, with total debt of ₹156.04 crore and ₹179.67 crore respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1754719471252,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Reports 51% Drop in Quarterly Net Profit to ₹57.35 Crore",
            "Summary": "Oriental Aromatics Limited reported standalone net profit of ₹57.35 crore for the quarter ended June 30, 2025, declining 50.7% from ₹116.45 crore in the same quarter last year. Revenue from operations increased 4.3% to ₹2,251.34 crore compared to ₹2,157.58 crore year-over-year. On a consolidated basis, net profit dropped significantly to ₹5.04 crore from ₹109.80 crore in the previous year quarter. The company's wholly owned subsidiary Oriental Aromatics & Sons Limited, which commenced commercial production in November 2024, contributed losses of ₹52.50 crore to the consolidated results. Basic and diluted earnings per share fell to ₹1.70 from ₹3.46 on standalone basis and to ₹0.15 from ₹3.26 on consolidated basis.",
            "Sentiment": "negative",
            "PublishDate": 1754654617032,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Schedules Q1-FY26 Earnings Conference Call for August 11, 2025",
            "Summary": "Oriental Aromatics Limited will hold a conference call with institutional investors and analysts on Monday, August 11, 2025, at 1:00 PM IST to discuss the company's financial performance for the quarter ended June 30, 2025. The management team will be represented by Chairman and Managing Director Dharmil A. Bodani, Executive Director Shyamal A. Bodani, CEO Parag K. Satoskar, CFO Girish Khandelwal, and Company Secretary Kiranpreet Gill. The call will be facilitated by Valorem Advisors and includes dial-in numbers for domestic and international participants across USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1754471445978,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Reports Q4 Financial Results",
            "Summary": "Oriental Aromatics has released its Q4 financial results. The company reported an EBITDA of 193 million rupees, down from 208.9 million rupees year-over-year. The EBITDA margin decreased to 7.61% from 9.65% in the same period last year. Consolidated net profit for Q4 was 14 million rupees, compared to 101.2 million rupees year-over-year and 71 million rupees quarter-on-quarter. Revenue for Q4 increased to 2.5 billion rupees from 2.16 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748350122000,
            "Source": "result"
        },
        {
            "Title": "Supreme Court Dismisses Special Leave Petition Against Oriental Aromatics",
            "Summary": "Oriental Aromatics has announced that the Supreme Court has dismissed a Special Leave Petition filed against the company. This dismissal suggests that a lower court's decision in favor of Oriental Aromatics has been upheld, though specific details about the case are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1741651553000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Supreme Court Dismisses Special Leave Petition Against Oriental Aromatics",
            "Summary": "Oriental Aromatics has announced that the Supreme Court has dismissed a Special Leave Petition filed against the company. This legal development suggests a favorable outcome for Oriental Aromatics in an ongoing legal matter.",
            "Sentiment": "positive",
            "PublishDate": 1741606836000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oriental Aromatics Reports Significant Profit Growth in Q3",
            "Summary": "Oriental Aromatics has announced its Q3 financial results, showing a substantial increase in consolidated net profit. The company reported a net profit of 71 million rupees, up from 26 million rupees in the same quarter last year, and 148 million rupees in the previous quarter. Revenue for Q3 also saw growth, reaching 2.2 billion rupees compared to 1.97 billion rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738628018000,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Reports Improved Q3 EBITDA and Margin",
            "Summary": "Oriental Aromatics has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 141 million rupees to 226 million rupees. Additionally, the EBITDA margin expanded from 7.15% to 10.13%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738583840000,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Reports Significant Profit Growth in Q3",
            "Summary": "Oriental Aromatics has announced its financial results for the third quarter. The company's consolidated net profit increased to 71 million rupees, up from 26 million rupees in the same quarter last year. This represents a substantial year-over-year growth. Sequentially, the profit also improved from 148 million rupees in the previous quarter. The company's revenue for Q3 stood at 2.2 billion rupees, showing an increase from 1.97 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738583788000,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics to Consider Q3 Results on February 3",
            "Summary": "Oriental Aromatics Limited has announced that it will consider its financial results for the third quarter on February 3. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737981369000,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Aromatics Reports Strong Q2 Financial Results",
            "Summary": "Oriental Aromatics has announced its Q2 financial results, showing significant year-over-year improvements. The consolidated net profit increased to 148 million rupees from 24 million rupees in the previous year, and 110 million rupees in the previous quarter. Revenue grew to 2.4 billion rupees from 2.26 billion rupees year-over-year. EBITDA rose to 286 million rupees from 110 million rupees, with EBITDA margin expanding to 12.09% from 4.85%. Additionally, the company's unit has commenced commercial operations of a new greenfield facility in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1731456056000,
            "Source": "result"
        }
    ]
}