{
    "Symbol": "OBCL",
    "ISIN": "INE426Z01016",
    "News": [
        {
            "Title": "Orissa Bengal Carrier Publishes EGM Notice",
            "Summary": "Orissa Bengal Carrier Ltd has published newspaper advertisements regarding the dispatch of Notice of Extra-Ordinary General Meeting to shareholders as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769082378824,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orissa Bengal Carrier Promoter Buys 68,000 Shares",
            "Summary": "Managing Director Ravi Agrawal acquired 68,000 equity shares through on-market transactions on December 16-17, 2025, representing 0.32% of total paid-up capital.",
            "Sentiment": "positive",
            "PublishDate": 1765966497548,
            "Source": "stocks"
        },
        {
            "Title": "Orissa Bengal Carrier Promoter Ravi Agrawal Acquires Additional 50,000 Shares",
            "Summary": "Ravi Agrawal, Managing Director and Promoter of Orissa Bengal Carrier Ltd., acquired 50,000 equity shares through open market purchase on November 17, 2025. The acquisition increased his shareholding from 44.22% to 44.46% of the company's total paid-up equity capital of 2,10,82,790 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763553114307,
            "Source": "corporate_action"
        },
        {
            "Title": "Orissa Bengal Carrier Reports Mixed Q2 Results with Consolidated Loss Despite Revenue Growth",
            "Summary": "Orissa Bengal Carrier Limited posted consolidated revenue of Rs 8,624.52 lakhs for Q2 FY2026 but reported a net loss of Rs 235.23 lakhs, compared to a profit of Rs 416.85 lakhs in the same quarter last year. The company operates through road transportation services and trading business segments, with the board approving unaudited financial results for the quarter and half-year ended September 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763131676490,
            "Source": "earnings"
        },
        {
            "Title": "Orissa Bengal Carrier Ltd Appoints New Internal Auditors",
            "Summary": "Orissa Bengal Carrier Ltd's Board of Directors approved the resignation of M/s. RA Agrawal & Associates as Internal Auditors and appointed M/s. Agrawal Jain & Co., Chartered Accountants (FRN: 012935C) as the new Internal Auditors starting from Quarter 2 (July-September) of FY 2025-26. The new auditing firm was established in 2005 and provides comprehensive professional services including audit, management consultancy, tax consultancy, and accounting services. The Board meeting was held on October 28, 2025, from 4:00 PM to 5:00 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1761654311530,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orissa Bengal Carrier Promoter Ravi Agrawal Acquires 118,735 Equity Shares",
            "Summary": "Ravi Agrawal, promoter of Orissa Bengal Carrier, purchased equity shares in the company across two transactions. He bought 61,735 shares on September 25 and 57,000 shares on September 26, totaling 118,735 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1759135956518,
            "Source": "stock"
        },
        {
            "Title": "Orissa Bengal Carrier Reports Strong Q1 2025 Results, Schedules AGM and Board Changes",
            "Summary": "Orissa Bengal Carrier Ltd. board approved unaudited financial results for quarter ended June 30, 2025, showing consolidated profit of ₹186.96 lakhs compared to ₹101.72 lakhs in the same quarter last year. Revenue from operations increased to ₹8,522.28 lakhs from ₹7,542.58 lakhs year-over-year. The company scheduled its 30th AGM for September 12, 2025, and approved re-appointment of Mr. Gopal Kumar Agrawalla as Non-Executive Director. Remote e-voting will be conducted from September 8-11, 2025. The company operates two business segments: Road Transportation Service and Trading Business, with the latter becoming reportable in December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1755091398892,
            "Source": "earnings"
        }
    ]
}