{
    "Symbol": "OBEROIRLTY",
    "ISIN": "INE093I01010",
    "News": [
        {
            "Title": "Oberoi Realty JV Signs Deal with Aman Group for Mumbai",
            "Summary": "I-Ven Realty Limited, a joint venture of Oberoi Realty, has signed hotel management and residences branding agreements with AMAN GROUP SARL for a luxury development at Worli, Mumbai featuring 80 guest rooms and residential units.",
            "Sentiment": "positive",
            "PublishDate": 1770781424942,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ravi Kumar Distilleries Q3FY26 Results Announced",
            "Summary": "Ravi Kumar Distilleries Limited reported Q3FY26 net sales of ₹1503.16 lacs with net profit of ₹1.92 lacs. Nine-month sales reached ₹4869.37 lacs with profit of ₹8.73 lacs.",
            "Sentiment": "neutral",
            "PublishDate": 1770720814866,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oberoi Realty Wins ₹5,400 Cr Railway Land Lease",
            "Summary": "Oberoi Realty successfully secured a 99-year lease for railway land in Bandra East with a ₹5,400 crore proposal, enabling development of approximately 19.5 lakh square feet of new space.",
            "Sentiment": "positive",
            "PublishDate": 1770256052048,
            "Source": "stocks"
        },
        {
            "Title": "Oberoi Realty Acquires Hotel Horizon for Rs 919.25 Cr",
            "Summary": "NCLT approves Oberoi Realty's consortium acquisition of Hotel Horizon Private Limited for Rs 919.25 crore, including prime 7500 sq mtr Juhu land overlooking Arabian Sea.",
            "Sentiment": "positive",
            "PublishDate": 1769699903244,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oberoi Realty Appoints Aditi Mittal as EVP North Zone",
            "Summary": "Oberoi Realty Limited announces appointment of Ms. Aditi Mittal as Executive Vice President - Business Head (North Zone) effective January 28, 2026, bringing 19 years of diverse industry experience.",
            "Sentiment": "positive",
            "PublishDate": 1769612102953,
            "Source": "stocks"
        },
        {
            "Title": "Oberoi Realty Block Trade Worth ₹74.30 Crores",
            "Summary": "Oberoi Realty witnessed a significant NSE block trade of ₹74.30 crores involving 503,696 shares at ₹1,475.10 per share, indicating substantial institutional activity in the real estate developer's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1769064780424,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nuvama Cuts Oberoi Realty Target to ₹1,719",
            "Summary": "Nuvama maintains Hold rating on Oberoi Realty but reduces target price from ₹1,794 to ₹1,719, reflecting a downward revision in valuation expectations.",
            "Sentiment": "neutral",
            "PublishDate": 1768967575573,
            "Source": "stocks"
        },
        {
            "Title": "Oberoi Realty Eyes Three Major Mumbai Deals",
            "Summary": "Oberoi Realty is set to complete three significant business development deals in Mumbai, with announcements expected this quarter or Q1 FY27. The company is also evaluating additional land parcels for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768964348573,
            "Source": "stocks"
        },
        {
            "Title": "Oberoi Realty Delays Launches, Signs Nepean Sea Deal",
            "Summary": "Oberoi Realty postpones project launches to Q4 FY26 and Q1 FY27 to focus on product design refinement. Company secures development agreement for Nepean Sea Road project with groundbreaking expected within nine months.",
            "Sentiment": "neutral",
            "PublishDate": 1768964302495,
            "Source": "stocks"
        },
        {
            "Title": "Oberoi Realty Unveils Multiple New Projects Pipeline",
            "Summary": "Oberoi Realty announces major upcoming developments across Mumbai, Thane, and NCR including new towers in Goregaon and Borivali, with Worli project expected in Q1 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1768964275168,
            "Source": "stocks"
        },
        {
            "Title": "Oberoi Realty Declares 3rd Interim Dividend at ₹2/Share",
            "Summary": "Oberoi Realty announces third interim dividend of ₹2 per equity share for FY25-26, representing 20% of face value. Record date set for January 23, 2026 with payment by February 5, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768829342799,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oberoi Realty Declares ₹2 Third Interim Dividend",
            "Summary": "Oberoi Realty announces third interim dividend of ₹2 per share for FY25-26 with record date January 23, 2026. Payment to commence by February 5, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768828951827,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oberoi Realty Q3: Profit flat, margins shrink, dividend declared",
            "Summary": "Oberoi Realty reports Q3 net profit up 0.7% to ₹622.6 crore with revenue rising 5.8% to ₹1,492.6 crore. EBITDA margins compressed to 57.4% from 60.7% YoY. Board declares interim dividend of ₹2 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1768828642874,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oberoi Realty Declares ₹2 Per Share Dividend",
            "Summary": "Oberoi Realty has announced a dividend of ₹2 per share for its shareholders. The real estate developer's dividend declaration reflects the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1768828370492,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oberoi Realty Q3FY26 Results Call on Jan 20",
            "Summary": "Oberoi Realty announces conference call scheduled for January 20, 2026 at 4:00 PM IST to discuss Q3FY26 financial results and provide business updates to stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1768397546017,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oberoi Realty Board Meet on Jan 19 for Q3 Results",
            "Summary": "Oberoi Realty has scheduled its board meeting for January 19, 2026, to consider Q3FY26 unaudited financial results and declare the third interim dividend for FY25-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768312161902,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oberoi Realty CEO-Mall Sameep Pathak Resigns",
            "Summary": "Oberoi Realty announced the resignation of Mr. Sameep Pathak from his position as Chief Executive Officer – Mall, effective December 26, 2025, under regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1766754780021,
            "Source": "stocks"
        },
        {
            "Title": "Oberoi Realty GM Investor Relations Resigns",
            "Summary": "Oberoi Realty announces resignation of Nimit Gala, General Manager-Investor Relations, effective December 12, 2025, citing exploration of better prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1765545843757,
            "Source": "stocks"
        },
        {
            "Title": "Oberoi Realty Subsidiary Gets Credit Rating Withdrawn After Facility Repayment",
            "Summary": "Incline Realty Private Limited, a wholly owned subsidiary of Oberoi Realty Limited, had its credit rating withdrawn by CARE Ratings Limited after repaying a bank facility. The facility previously held a CARE AA+ (CE) Stable rating with a corresponding unsupported rating of CARE AA-.",
            "Sentiment": "neutral",
            "PublishDate": 1764334375628,
            "Source": "stock"
        },
        {
            "Title": "Oberoi Realty Executive Vice President Ashok Choudhury Resigns from Compliance Role",
            "Summary": "Ashok Choudhury has resigned from his position as Executive Vice President for Compliance and Special Projects at Oberoi Realty. The resignation affects the company's compliance leadership structure and special projects oversight.",
            "Sentiment": "neutral",
            "PublishDate": 1764166312438,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oberoi Realty Signs Development Deal for Mumbai Land",
            "Summary": "Oberoi Realty has entered into a development agreement for land located in Mumbai. The deal expands the company's development portfolio in the key Mumbai real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1764159528942,
            "Source": "stock"
        },
        {
            "Title": "Oberoi Realty Senior Manager Resigns for Career Break",
            "Summary": "Minu Bhupal, General Manager-Internal Process Control at Oberoi Realty Limited, has resigned from her position effective November 14, 2025, citing a career break as the reason. The resignation affects the company's internal process control function and was disclosed to stock exchanges BSE and NSE as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763140819708,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oberoi Realty Refrains from Providing Specific Future Guidance in Conference Call",
            "Summary": "Oberoi Realty chose not to provide specific future predictions during a conference call with stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1760929931674,
            "Source": "stock"
        },
        {
            "Title": "Oberoi Realty Block Trade Worth Rs. 36.76 Crores Executed on NSE",
            "Summary": "Oberoi Realty Ltd. witnessed a block trade on the National Stock Exchange involving approximately 221,773 shares at a price of Rs. 1,657.50 per share, totaling Rs. 36.76 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1760587159604,
            "Source": "order&deals"
        },
        {
            "Title": "Oberoi Realty Reports Strong H1FY26 Results with Revenue of Rs 2,919 Crores",
            "Summary": "Oberoi Realty announced its financial results for H1FY26 and Q2FY26. The company reported booking value of Rs 2,938 crores for H1FY26 compared to Rs 2,509 crores in H1FY25. Consolidated revenue reached Rs 2,919 crores for H1FY26 versus Rs 2,801 crores in H1FY25. Q2FY26 revenue was Rs 1,845 crores against Rs 1,074 crores in Q1FY26. Profit after tax for H1FY26 stood at Rs 1,180 crores compared to Rs 1,174 crores in H1FY25, while Q2FY26 PAT was Rs 759 crores versus Rs 421 crores in Q1FY26. Chairman Vikas Oberoi highlighted strong performance driven by sustenance sales and growth in commercial and retail portfolios. The company noted healthy leasing momentum at Sky City Mall in Borivali and Commerz III, and opened a new office in Gurugram to expand NCR market presence.",
            "Sentiment": "positive",
            "PublishDate": 1760542657021,
            "Source": "earnings"
        },
        {
            "Title": "Oberoi Realty Declares Second Interim Dividend of Rs. 2 Per Share for FY25-26",
            "Summary": "Oberoi Realty Limited's Board of Directors declared a second interim dividend of Rs. 2 per equity share for FY25-26, representing 20% of the face value of Rs. 10 per share. The record date is set for October 21, 2025, and dividend payments will commence on or before November 4, 2025. The board meeting was held on October 15, 2025, lasting from 3:15 p.m. to 4:12 p.m.",
            "Sentiment": "positive",
            "PublishDate": 1760531300071,
            "Source": "corporate_action"
        },
        {
            "Title": "Oberoi Realty Reports Strong Q2 Growth with 29% Jump in Net Profit",
            "Summary": "Oberoi Realty delivered strong quarterly performance with consolidated net profit rising to 7.6 billion rupees from 5.9 billion rupees year-over-year. The real estate company's revenue grew significantly to 17.79 billion rupees compared to 13.2 billion rupees in the same period last year, representing substantial growth across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1760530507167,
            "Source": "earnings"
        },
        {
            "Title": "Oberoi Realty Sees Rs. 16.29 Crore Block Trade on NSE",
            "Summary": "Oberoi Realty Ltd. witnessed a block trade worth Rs. 16.29 crores on the NSE. The transaction involved approximately 101,652 shares at a price of Rs. 1,603.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757911984299,
            "Source": "order&deals"
        },
        {
            "Title": "Oberoi Realty Appoints Shrikanth Kamblii as COO-Construction and Meghna Bohra Maloo as AVP-Internal Process",
            "Summary": "Oberoi Realty Limited appointed Mr. Shrikanth Kamblii as COO-Construction effective September 3, 2025, and Ms. Meghna Bohra Maloo as Assistant Vice President-Internal Process and Control effective September 5, 2025. Kamblii brings over three decades of experience in real estate and infrastructure, specializing in large-scale township, commercial and hospitality projects with expertise in construction operations, digital transformation, and sustainable construction. Maloo is a Chartered Accountant with two decades of experience in internal audit, risk management, governance, and financial controls. She was previously associated with Oberoi Realty until July 2024. Both appointments are contractual in nature and subject to the company's employment policy.",
            "Sentiment": "positive",
            "PublishDate": 1757336996029,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oberoi Realty Reports 78 Units Booked Worth Rs. 853 Crores in Q4FY25",
            "Summary": "Oberoi Realty Limited disclosed its booking figures for Q4FY25 and FY25. The company booked 78 units in Q4FY25 with a booking value of Rs. 853 crores and carpet area of 1,37,321 sq.ft. For the full year FY25, the company booked 928 units valued at Rs. 5,266 crores with carpet area of 12,81,446 sq.ft. This compares to 705 units booked in FY24 worth Rs. 4,007 crores with carpet area of 10,76,192 sq.ft. The figures are provisional and subject to audit.",
            "Sentiment": "positive",
            "PublishDate": 1757146696958,
            "Source": "stock"
        },
        {
            "Title": "Oberoi Realty Seeks Shareholder Approval for Employee Stock Option Plan and Director Appointment",
            "Summary": "Oberoi Realty Limited has issued a postal ballot notice seeking shareholder approval for four special business items through remote e-voting from July 30 to August 28, 2025. The company proposes to introduce the 'Oberoi Realty Limited – Employee Stock Option Plan 2025' (ESOP 2025) offering up to 36,36,023 employee stock options convertible into equity shares of Rs. 10 face value each. The plan covers eligible employees of the company and its group companies, including subsidiaries and associates, with options exercisable at up to 20% discount to market price. The vesting period ranges from 1-7 years with a maximum exercise period of 4 years. Additionally, shareholders will vote on extending ESOP benefits to subsidiary and associate company employees, and the appointment of Mr. Sanjay Shah as Non-Executive Independent Director for a five-year term from June 16, 2025 to June 15, 2030. Mr. Shah, former Country Head-India & Managing Director at Morgan Stanley India, brings over 32 years of investment banking and capital markets experience. The postal ballot results will be declared by August 30, 2025, with Mr. Himanshu S. Kamdar appointed as scrutinizer for the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1753786469930,
            "Source": "corporate_action"
        },
        {
            "Title": "Oberoi Realty Sees Rs 1,961.4 Crore Block Trade on BSE",
            "Summary": "Oberoi Realty witnessed a significant block trade worth Rs 1,961.4 crore on the BSE. The transaction involved approximately 11,131,361 shares at a price of Rs 1,762.05 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753242848698,
            "Source": "order&deals"
        },
        {
            "Title": "Oberoi Realty Shares in Focus as Institutional Investor Plans $230 Million Stake Sale",
            "Summary": "An institutional investor is likely to offload approximately 3% stake in Oberoi Realty through a $230 million block deal. The floor price has been set at Rs 1,753.2 per share, representing a 4% discount to Tuesday's closing price. The selling investor's identity has not been disclosed. In its quarterly results, Oberoi Realty reported a 28% year-on-year decline in net profit to Rs 421.2 crore, while revenue from operations fell 29.7% to Rs 987.5 crore. EBITDA dropped 36% to Rs 520.4 crore with margins narrowing to 52.7%. The company announced an interim dividend of Rs 2 per share with a record date of July 25. Chairman Vikas Oberoi noted strong demand in the luxury housing segment. According to Trendlyne, the average target price stands at Rs 1,873, suggesting nearly 3% upside potential, with 24 analysts maintaining a 'Buy' consensus rating.",
            "Sentiment": "neutral",
            "PublishDate": 1753241243589,
            "Source": "stock"
        },
        {
            "Title": "Oberoi Realty Targets Full Occupancy for Commerz III and Borivali Mall",
            "Summary": "Oberoi Realty announced plans to achieve full occupancy in its Commerz III and Borivali Mall properties during the current fiscal year. This target was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1753241222719,
            "Source": "stock"
        },
        {
            "Title": "Oberoi Realty Faces $230 Million Block Deal as Institutional Investor Exits 3% Stake",
            "Summary": "An institutional investor plans to sell approximately 3% of Oberoi Realty through a block deal worth $230 million. The floor price is set at ₹1,753.2 per share, representing a 4% discount to Tuesday's closing price. Oberoi Realty reported mixed quarterly results with net profit declining 28% to ₹421.2 crore and revenue falling 29.7% to ₹987.5 crore. EBITDA dropped 36% to ₹520.4 crore with margins at 52.7%. The company declared an interim dividend of ₹2 per share for FY25-26. Chairman Vikas Oberoi noted strong demand for luxury homes and highlighted successful tower launch at Elysian project. Shares closed at ₹1,825.50, down 0.54%.",
            "Sentiment": "negative",
            "PublishDate": 1753191634336,
            "Source": "order&deals"
        },
        {
            "Title": "Oberoi Realty Uploads Q1FY26 Results Investor Presentation",
            "Summary": "Oberoi Realty has made its Q1FY26 results investor presentation available on the company website under the Financial Results section. The presentation can be accessed at https://www.oberoirealty.com/financial-results. Company Secretary Bhaskar Kshirsagar notified the BSE and NSE about the upload on July 21, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753156489617,
            "Source": "stock"
        },
        {
            "Title": "Oberoi Realty Q1 Results: Profit Falls 28% Despite Strong Pre-Sales, Brokerages Maintain Buy Ratings",
            "Summary": "Oberoi Realty reported quarterly results showing a 28% decline in profit to Rs 421 crore and a 30% drop in revenue to Rs 988 crore compared to the same period last year. EBITDA fell 36.2% to Rs 520 crore with margins contracting to 52.7%. Despite the decline in financial metrics, the company demonstrated robust sales across most projects and steady free cash flow. Strong pre-sales were driven by new launches at Elysian, Gurgaon, and the company maintained a comfortable net debt to equity ratio of 0.12x. The annuity business showed strength with steady occupancy rates. However, the company faced challenges with slower collections and development margins declining to 45%. Both JPMorgan and Nomura maintained positive ratings with 'overweight' and 'buy' calls respectively, both setting target prices of Rs 2,000. Nomura attributed the revenue and EBITDA decline to no revenue recognition from the 360West project, expecting pre-sales from this project to be visible in upcoming quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1753155668579,
            "Source": "earnings"
        },
        {
            "Title": "Oberoi Realty Declares Interim Dividend of Rs 2 Per Share",
            "Summary": "Oberoi Realty has announced an interim dividend of Rs 2 per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1753100773522,
            "Source": "corporate_action"
        },
        {
            "Title": "Oberoi Realty Reports Decline in Q1 Financial Performance",
            "Summary": "Oberoi Realty's consolidated net profit decreased to 4.21 billion rupees compared to 5.85 billion rupees in the same quarter last year. The company's revenue also declined to 9.88 billion rupees from 14.1 billion rupees year-over-year. This represents a significant drop in both profitability and revenue generation for the real estate developer.",
            "Sentiment": "negative",
            "PublishDate": 1753100097467,
            "Source": "earnings"
        },
        {
            "Title": "Oberoi Realty Reports Rs 1,639 Crore Bookings from 181 Unit Sales in Q1 FY26",
            "Summary": "Oberoi Realty achieved bookings worth Rs 1,639 crore during the first quarter of FY26 by selling 181 units. This represents the company's sales performance for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753069308794,
            "Source": "stock"
        },
        {
            "Title": "Oberoi Realty-Led Consortium Wins Hotel Horizon Resolution Plan",
            "Summary": "A consortium led by Oberoi Realty has secured the resolution plan for Hotel Horizon with a bid of ₹919 crore. The property is located seaside in Juhu, Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1752544469000,
            "Source": "default"
        },
        {
            "Title": "Oberoi Realty Consortium Acquires Hotel Horizon for ₹919 Crores",
            "Summary": "A consortium led by Oberoi Realty has successfully completed the full purchase of Hotel Horizon for ₹919 crores through an approved resolution plan. The acquisition gives the consortium control of a key property in Juhu. The deal is currently awaiting final approval from the National Company Law Tribunal (NCLT).",
            "Sentiment": "positive",
            "PublishDate": 1752511077000,
            "Source": "default"
        },
        {
            "Title": "Oberoi Realty: New Tower Launch Generates ₹970 Crore in Sales",
            "Summary": "Oberoi Realty launched Elysian Tower D at Oberoi Garden City in Mumbai, generating ₹970 crore in gross booking value. The tower offers 3 and 4 BHK residences with carpet areas from 2,009 to 3,430 square feet, covering 2.1 lakh square feet of RERA carpet area and 3.25 lakh square feet of saleable area.",
            "Sentiment": "positive",
            "PublishDate": 1746425646000,
            "Source": "normal_news"
        },
        {
            "Title": "Oberoi Realty: Goregaon Project Secures ₹970 Crore in Sales",
            "Summary": "Oberoi Realty's Elysian Tower D at Oberoi Garden City, Goregaon, launched on April 30, 2025, has recorded bookings worth ₹970 crore. The project sold approximately 2.1 lakh sq. ft. of RERA carpet area and 3.25 lakh sq. ft. of saleable area. The tower offers premium 3 and 4-BHK residences ranging from 2,009 to 3,430 sq. ft.",
            "Sentiment": "positive",
            "PublishDate": 1746418399000,
            "Source": "corporate_action"
        },
        {
            "Title": "Oberoi Realty Secures ₹970 Crore in Bookings from Elysian Tower D Launch",
            "Summary": "Oberoi Realty has reported bookings worth ₹970 crore from the launch of Elysian Tower D at Oberoi Garden City in Goregaon, Mumbai. This successful launch demonstrates strong demand for the company's residential projects in the Mumbai real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1746408932000,
            "Source": "default"
        },
        {
            "Title": "Oberoi Realty Seeks Significant Land Acquisitions",
            "Summary": "Oberoi Realty has expressed a strong interest in pursuing land acquisitions, particularly those requiring substantial investment. The company believes that opportunities for large-scale acquisitions may present themselves within the current year, as stated during a recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1745983602000,
            "Source": "default"
        },
        {
            "Title": "Oberoi Realty: Q4 Profit Plunges 45% YoY Amid Revenue Decline",
            "Summary": "Oberoi Realty reported a 45% YoY drop in Q4 consolidated net profit to Rs 433.17 crore. Revenue fell 12.5% to Rs 1,150 crore. EBITDA decreased 21.6% to Rs 618.07 crore with margin contraction. FY25 PAT rose to Rs 2,224.05 crore from Rs 1,925.17 crore in FY24. CMD Vikas Oberoi noted steady residential sales and interest in commercial spaces.",
            "Sentiment": "negative",
            "PublishDate": 1745898289000,
            "Source": "earnings"
        },
        {
            "Title": "Oberoi Realty Reports Q4 Results and Declares Dividend",
            "Summary": "Oberoi Realty announced its Q4 consolidated net profit of 4.3 billion rupees, down from 7.88 billion rupees year-over-year and 6.2 billion rupees quarter-over-quarter. The company's Q4 revenue was 11.5 billion rupees, compared to 13.15 billion rupees in the same quarter last year. Additionally, Oberoi Realty declared a fourth interim dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745885412000,
            "Source": "default"
        },
        {
            "Title": "Oberoi Realty: Q4 Profit Plunges 45%, Revenue Drops 12.5%",
            "Summary": "Oberoi Realty's Q4 consolidated net profit fell 45% YoY to Rs 433 crore. Revenue declined 12.5% to Rs 1,150 crore. EBITDA decreased 21.6% to Rs 618 crore, with margins contracting to 53.7%.",
            "Sentiment": "negative",
            "PublishDate": 1745850932000,
            "Source": "earnings"
        },
        {
            "Title": "Oberoi Realty Declares Dividend and Plans CSR Subsidiary",
            "Summary": "Oberoi Realty has declared a fourth interim dividend of 2 rupees per equity share. The company's board has also approved the incorporation of a wholly-owned subsidiary under Section 8 of the Companies Act, 2013, which will serve as the group's Corporate Social Responsibility (CSR) arm. The incorporation is subject to approval from the Ministry of Corporate Affairs.",
            "Sentiment": "positive",
            "PublishDate": 1745850784000,
            "Source": "result"
        }
    ]
}