{
    "Symbol": "OCCLLTD",
    "ISIN": "INE0PK601023",
    "News": [
        {
            "Title": "OCCL Appoints Rajneesh Dhiman as Head of Sales",
            "Summary": "OCCL Limited announces the appointment of Mr. Rajneesh Dhiman as Senior Management Personnel and Head of Sales & Marketing, effective February 4, 2026. Dhiman brings 23 years of experience in chemicals industry.",
            "Sentiment": "positive",
            "PublishDate": 1770207410679,
            "Source": "stocks"
        },
        {
            "Title": "OCCL Board Meet on Feb 4 for Q3FY26 Results",
            "Summary": "OCCL Limited has scheduled a board meeting on February 04, 2026, to consider and approve unaudited financial results for Q3FY26. Trading window closed from January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769686492067,
            "Source": "co_actions_results"
        },
        {
            "Title": "OCCL Limited Reports 16% Revenue Growth in Q2 FY26 Despite Margin Pressures from Rising Sulphur Costs",
            "Summary": "OCCL Limited reported total income of Rs. 121 crores in Q2 FY26, representing 16% growth compared to Rs. 104 crores in Q2 FY25. EBITDA stood at Rs. 20 crores with margins of 16.8%, while profit after tax reached Rs. 9 crores, up 16% year-on-year. For H1 FY26, total income was Rs. 244 crores with EBITDA of Rs. 47 crores and margins of 19.2%. The company faces margin pressure from rising sulphur prices and a 50% US tariff imposed in September on Indian imports. Anti-dumping duties on China and Japan have improved domestic realizations, though benefits are offset by increased raw material costs. The company operates at 70% capacity utilization for insoluble sulphur and full capacity for sulphuric acid. Management expects 2-3% annual global demand growth and is exploring anti-dumping measures against Malaysia. Total debt position stands at Rs. 81 crores as of September 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762803635336,
            "Source": "earnings"
        },
        {
            "Title": "OCCL Projects 15-18% Revenue Growth with 16.8% EBITDA Margins",
            "Summary": "OCCL has provided guidance for sustained revenue growth of 15-18% with EBITDA margins of 16.8%. The company expects benefits from anti-dumping duties imposed on Chinese and Japanese imports. A shift toward green energy is improving the company's cost structure. Recovery in tyre sector demand is anticipated to drive long-term volume growth.",
            "Sentiment": "positive",
            "PublishDate": 1761835265678,
            "Source": "stock"
        },
        {
            "Title": "OCCL Reports 16% Growth in Q2 Net Profit to 87M Rupees",
            "Summary": "OCCL reported net profit of 87 million rupees for Q2, up from 75 million rupees in the same period last year. Revenue increased to 1.2 billion rupees from 1 billion rupees year-over-year. EBITDA rose to 192 million rupees compared to 185 million rupees previously, though EBITDA margin declined to 16.07% from 17.96% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1761817779079,
            "Source": "earnings"
        },
        {
            "Title": "OCCL Limited Schedules Q2 & H1 FY26 Earnings Conference Call for November 3, 2025",
            "Summary": "OCCL Limited has announced an earnings conference call scheduled for November 3, 2025, at 11:30 AM IST to discuss the company's financial and operational performance for Q2 & H1 FY26. The call will be attended by Mr. Akshat Goenka, Promoter & Joint Managing Director, and Mr. Anurag Jain, Chief Financial Officer. The company has provided dial-in details for participants from multiple countries including India, United States, United Kingdom, Singapore, and Hong Kong, with pre-registration available through a provided link.",
            "Sentiment": "neutral",
            "PublishDate": 1761569678622,
            "Source": "corporate_action"
        },
        {
            "Title": "OCCL Limited Reports 14% Revenue Growth in Q1 FY26, Driven by Sulphuric Acid Margins",
            "Summary": "OCCL Limited reported revenue of INR 123 crores for Q1 FY26, marking 14% growth from Q4 FY25. EBITDA increased 36% to INR 27 crores with margins improving to 21.7% from 18.1%. The growth was primarily driven by increased sulphuric acid margins due to elevated sulphur prices. Anti-dumping duties imposed on imports from Japan and China in June are expected to benefit future quarters, with the company estimating INR 70-80 lakhs monthly benefit at PBT level. The company maintains 55% domestic market share in insoluble sulphur and expects it to exceed 60% following the anti-dumping measures. However, Malaysia continues importing without price increases, limiting the full benefit of anti-dumping duties. OCCL operates at 70% capacity utilization for insoluble sulphur and 100% for sulphuric acid. The company is focusing on product innovation, cost optimization, and sustainability initiatives including renewable energy adoption.",
            "Sentiment": "positive",
            "PublishDate": 1754909971759,
            "Source": "earnings"
        },
        {
            "Title": "OCCL Limited Reports Strong Q1 FY26 Results with 14% Sequential Revenue Growth",
            "Summary": "OCCL Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported total income of Rs. 123.49 crores compared to Rs. 108.46 crores in the previous quarter, representing a 14% sequential growth. EBITDA stood at Rs. 27 crores with margins of 21.7%, showing a 36% quarter-on-quarter growth. Profit after tax reached Rs. 13.14 crores with margins of 10.6%, marking a 51% sequential increase. Revenue from operations was Rs. 123.09 crores, up from Rs. 107.48 crores in the previous quarter. The company's Managing Director Arvind Goenka attributed the performance to good results from the acid division and improved operational efficiency. He noted that recent anti-dumping duties on imports from Japan and China are expected to strengthen the domestic market environment. OCCL Limited is a market leader in Insoluble Sulphur production for the tire and rubber industry, with manufacturing facilities in Dharuhera, Haryana and Mundra, Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1753867243366,
            "Source": "earnings"
        }
    ]
}