{
    "Symbol": "ODIGMA",
    "ISIN": "INE054301028",
    "News": [
        {
            "Title": "Odigma Reports Q3 FY26 Loss Amid Client Budget Deferrals",
            "Summary": "Odigma Consultancy Solutions reported revenue of ₹956.26 lakh and net loss of ₹143.97 lakh for Q3 FY26, impacted by temporary client marketing spend deferrals during festive season.",
            "Sentiment": "negative",
            "PublishDate": 1769762328079,
            "Source": "co_actions_results"
        },
        {
            "Title": "Odigma Shares Transmitted to Legal Heir",
            "Summary": "Odigma Consultancy Solutions announces transmission of 42,299 shares from deceased promoter Late Mr. Subhashchandra R. Amin to his legal heir Mr. Vishal Subhashchandra Amin on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766402040193,
            "Source": "stocks"
        },
        {
            "Title": "Odigma Gets GST Demand Order Worth ₹16.75 Lakhs",
            "Summary": "Odigma Consultancy Solutions receives GST demand order of ₹16.75 lakhs from Karnataka tax authorities for alleged Input Tax Credit disallowance during April 2021-March 2022 period.",
            "Sentiment": "negative",
            "PublishDate": 1765462432158,
            "Source": "stocks"
        },
        {
            "Title": "Odigma Consultancy Solutions Reports 66% Jump in Profit After Tax for Q2FY26",
            "Summary": "Odigma Consultancy Solutions Limited reported strong financial performance for the quarter ended September 30, 2025. Revenue from operations increased 49% year-on-year to INR 1,257 lakhs compared to INR 841 lakhs in the same quarter last year. Profit After Tax surged 66% year-on-year to INR 12 lakhs from INR 7 lakhs. The growth was driven by the company's strategic focus on bottom-line/retainer business including social media management, SEO, online reputation management, and creative design work, which generate consistent cash flow. The company operates in digital marketing and e-commerce related services including domain registry. Following its demerger from Infibeam Avenues Ltd and listing in December, the company deliberately chose to focus on bottom-line segments to build a sustainable business foundation before pursuing top-line growth more aggressively. The company is launching RealAlse, an AI-powered lead engagement platform to help brands nurture leads.",
            "Sentiment": "positive",
            "PublishDate": 1762850363209,
            "Source": "earnings"
        },
        {
            "Title": "Odigma Consultancy Solutions Incorporates Wholly Owned Subsidiary in UAE",
            "Summary": "Odigma Consultancy Solutions Limited has incorporated a wholly owned subsidiary company named Odigma FZE LLC in Sharjah, UAE. The subsidiary has an authorized and paid-up share capital of AED 1,00,000 and is yet to commence business operations. The company acquired 100% shareholding through cash consideration. The subsidiary will operate in the IT sector, focusing on digital media management, marketing, content services, and online advertising. Odigma is expanding its presence in the UAE to position itself strategically near existing customers and tap into the growing IT sector in the Middle East. Through this expansion, the company will offer services including managing digital assets, social media presence, developing digital marketing campaigns, content production, and targeted online advertising across multiple platforms.",
            "Sentiment": "positive",
            "PublishDate": 1755088983007,
            "Source": "corporate_action"
        },
        {
            "Title": "ODigMa Consultancy Solutions Reports 23.5% PAT Growth in Q1FY26 Despite Revenue Decline",
            "Summary": "ODigMa Consultancy Solutions Limited reported quarterly results for the period ended June 30, 2025, showing mixed performance. The company's Profit After Tax increased 23.5% year-on-year to INR 10.62 lakh compared to INR 8.60 lakh in the same quarter last year, primarily driven by strong performance in its global Top-Level Domain (gTLD) business. However, revenue from operations declined to INR 657 lakh from INR 1,357 lakh in the previous year quarter due to seasonal softness and macroeconomic headwinds causing clients to defer or reduce spending. EBITDA decreased 61% year-on-year to INR 25.24 lakh from INR 64.14 lakh. The company's board also approved the incorporation of a wholly owned subsidiary in Sharjah, UAE, focused on digital media management, marketing, content services, and online advertising. Additionally, the board scheduled the 14th Annual General Meeting for September 22, 2025, to be conducted through video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1754035650435,
            "Source": "earnings"
        }
    ]
}