{
    "Symbol": "OFSS",
    "ISIN": "INE881D01027",
    "News": [
        {
            "Title": "Oracle Financial Services Software Block Trade",
            "Summary": "Oracle Financial Services Software Ltd. executed a significant NSE block trade worth Rs. 18.10 crores involving approximately 24,092 shares at Rs. 7,512.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770183257245,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oracle Financial Services Grants 104 Stock Options",
            "Summary": "Oracle Financial Services Software Limited granted 104 stock options under OFSS Stock Plan 2014 to an employee on February 2, 2026, as approved by the Nomination and Remuneration Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1770038245905,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oracle Financial Services Posts Strong Q3 Results",
            "Summary": "Oracle Financial Services Software reported robust Q3 FY26 performance with consolidated revenue of ₹19,659 million and net profit of ₹6,096 million, marking significant growth over previous periods.",
            "Sentiment": "positive",
            "PublishDate": 1769008871815,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oracle Financial Services Allots 4,624 ESOP Shares",
            "Summary": "Oracle Financial Services Software Limited allotted 4,624 equity shares under ESOP to eligible employees on January 21, 2026, increasing paid-up capital to ₹43.51 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768999918338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oracle Financial Services Software Board Meet on Jan 21",
            "Summary": "Oracle Financial Services Software Limited has scheduled a Board meeting on January 21, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768305653026,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oracle Financial Services Director Resigns Jan 22",
            "Summary": "Oracle Financial Services Software Limited announces resignation of Non-Executive Director Mr. Harinderjit Singh, effective January 22, 2026, citing professional commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1767601624615,
            "Source": "stocks"
        },
        {
            "Title": "Oracle Financial Services Software Grants 366 Stock Options to Employees",
            "Summary": "Oracle Financial Services Software Limited's Nomination and Remuneration Committee granted 366 Stock Options named OFSS Stock Units (OSUs) under OFSS Stock Plan 2014 to company employees on December 8, 2025. The stock options will vest according to the plan's vesting schedule and can be exercised during the defined exercise period.",
            "Sentiment": "positive",
            "PublishDate": 1765185942304,
            "Source": "corporate_action"
        },
        {
            "Title": "Oracle Financial Services Software Allots 5,506 Equity Shares Under ESOP",
            "Summary": "Oracle Financial Services Software Limited's ESOP Allotment Committee approved the allotment of 5,506 equity shares of face value Rs. 5 each to eligible employees who exercised stock options under the OFSS Stock Plan 2014. The allotment increased the company's paid-up capital to Rs. 435,056,160 divided into 87,011,232 equity shares, with no shares allotted to directors in this exercise.",
            "Sentiment": "neutral",
            "PublishDate": 1763531313383,
            "Source": "corporate_action"
        },
        {
            "Title": "Oracle Financial Services Software Allots 69,484 Equity Shares Under Employee Stock Plan",
            "Summary": "Oracle Financial Services Software Limited allotted 69,484 equity shares with a face value of Rs. 5 each to eligible employees who exercised stock options under the OFSS Stock Plan 2014. The allotment included 14,816 shares to a company director. Following this allotment, the company's paid-up capital increased to Rs. 435,028,630, comprising 87,005,726 equity shares of Rs. 5 face value each. The newly allotted shares will have equal rights with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1761632621794,
            "Source": "corporate_action"
        },
        {
            "Title": "Oracle Financial Services Software Grants Stock Options to Employees",
            "Summary": "Oracle Financial Services Software Limited's Nomination and Remuneration Committee granted 105,336 OFSS Stock Units (OSUs) and 46,020 Stock Options to company employees under the OFSS Stock Plan 2014. The options will vest according to the plan's vesting schedule and can be exercised during the defined exercise period.",
            "Sentiment": "neutral",
            "PublishDate": 1761412282680,
            "Source": "corporate_action"
        },
        {
            "Title": "Oracle Financial Services Software Declares Rs 130 Interim Dividend Per Share for FY 2025-26",
            "Summary": "Oracle Financial Services Software Limited's Board of Directors declared an interim dividend of Rs 130 per equity share of face value Rs 5 each for Financial Year 2025-26. The dividend will be payable to shareholders whose names appear in the Register of Members and as beneficial owners in Depositories as of November 3, 2025 (Record Date). The company has communicated tax deduction at source provisions to shareholders, with different TDS rates applicable based on shareholder categories - 0% for certain entities like mutual funds and government, 10% for resident individuals (if conditions are met), and 20% for non-resident shareholders. Physical shareholders must update their KYC details including PAN, contact information, and bank account details to receive dividend payments electronically. All required documentation for tax exemptions or lower rates must be submitted by October 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761135002363,
            "Source": "corporate_action"
        },
        {
            "Title": "Oracle Financial Services Software Reports Q2 EBITDA Growth, Declares Interim Dividend",
            "Summary": "Oracle Financial Services Software reported Q2 EBITDA of 7.55 billion rupees compared to 7.5 billion rupees in the same period last year. The company's EBITDA margin decreased to 42.22% from 44.84% year-over-year. The company approved an interim dividend of 130 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1760714871257,
            "Source": "earnings"
        },
        {
            "Title": "Oracle Financial Services Software Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Oracle Financial Services Software reported quarterly consolidated net profit of 5.5 billion rupees, down from 5.8 billion rupees in the same period last year. The company's revenue increased to 17.9 billion rupees compared to 16.7 billion rupees year-over-year, showing growth in the top line despite the decline in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1760714459045,
            "Source": "earnings"
        },
        {
            "Title": "Deutsche Bank Raises Oracle Corp Target Price to $375",
            "Summary": "Deutsche Bank has increased its target price for Oracle Corp (OFSS) from $335 to $375, representing an upward revision in the investment bank's valuation of the technology company's stock.",
            "Sentiment": "positive",
            "PublishDate": 1760699904620,
            "Source": "global"
        },
        {
            "Title": "Oracle Financial Services Software Shares Drop 8% Despite Parent Company's Strong Results",
            "Summary": "Oracle Financial Services Software (OFSS) shares declined over 8% to ₹9,181 after the company clarified that Oracle Corporation's business developments do not directly impact OFSS operations. The stock fell from an opening high of ₹9,950 to an intraday low of ₹9,109.50. Meanwhile, parent company Oracle Corporation reported strong quarterly results with total revenue of $14.9 billion, up 12% in USD. Oracle signed four multi-billion-dollar contracts and expects Oracle Cloud Infrastructure revenue to grow 77% to $18 billion this fiscal year, with projections reaching $144 billion over the next four years. The company's multi-cloud database revenue from Amazon, Google and Microsoft surged 1,529% in the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1757570932061,
            "Source": "stock"
        },
        {
            "Title": "Oracle Financial Services Surges 8% on Parent Company's Strong Cloud Business Performance",
            "Summary": "Oracle Financial Services shares jumped over 8% to reach an intraday high of Rs 9,137, marking the sharpest increase in four months. The surge followed positive developments at parent company Oracle Corp, which reported strong growth in its global cloud infrastructure business. Oracle Corp highlighted significant growth in bookings driven by multi-billion dollar contracts with Nvidia, OpenAI and TikTok. The parent company reported new cloud bookings of $455 billion and expects cloud business growth of 77% this year, with plans to increase eightfold over five years. As a subsidiary specializing in cloud-native banking and financial services, Oracle Financial Services benefits from access to Oracle's technology, cloud infrastructure and sales channels. The stock surge comes despite year-to-date declines of almost 30% and one-year losses of almost 20%. Trading volumes were nearly five times the average 30-day volumes, with the stock showing a Relative Strength Index of 50.",
            "Sentiment": "positive",
            "PublishDate": 1757480481787,
            "Source": "stock"
        },
        {
            "Title": "Oracle Financial Services Software Reports Q1 FY26 Results with Revenue Growth",
            "Summary": "Oracle Financial Services Software Limited reported its quarterly results for the period ended June 30, 2025. The company's standalone revenue from operations increased to ₹13,968 million compared to ₹12,954 million in the same period last year. Net profit rose to ₹5,872 million from ₹5,360 million year-over-year. Basic earnings per share improved to ₹67.58 from ₹61.82 in the previous year. On a consolidated basis, revenue reached ₹18,522 million versus ₹17,414 million in the prior year period, with net profit at ₹6,561 million compared to ₹6,439 million. The company operates through two main segments: product licenses and related activities, and IT solutions and consulting services. During the quarter, the company allotted 37,636 equity shares under its employee stock option plan. The Board also appointed Mr. Nian Nian Yuan as Additional Non-Executive Director, while Mr. Yong Meng Kau resigned from his directorship position.",
            "Sentiment": "positive",
            "PublishDate": 1753279790879,
            "Source": "earnings"
        },
        {
            "Title": "Oracle Financial Services Software Ltd: Announces Highest Dividend in a Decade",
            "Summary": "Oracle Financial Services Software Ltd. approved an interim dividend of ₹265 per share for FY 2024-25, payable by May 17, 2025. The company reported strong Q4 results with flat revenue but expanded margins by 300 basis points to 44.6% and increased profit by 18-19%.",
            "Sentiment": "positive",
            "PublishDate": 1745818726000,
            "Source": "corporate_action"
        },
        {
            "Title": "Oracle Financial Services Software Reports Strong Q4 Results",
            "Summary": "Oracle Financial Services Software announced its Q4 financial results. The company's consolidated net profit increased to 6.4 billion rupees, up from 5.6 billion rupees year-over-year and 5.4 billion rupees quarter-over-quarter. Revenue for Q4 rose to 17.2 billion rupees from 16.4 billion rupees in the previous year. Additionally, the company recommended a dividend of 265 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745799417000,
            "Source": "default"
        },
        {
            "Title": "Oracle Financial Services Software Announces Dividend",
            "Summary": "Oracle Financial Services Software has recommended a dividend of 265 rupees per equity share to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1745592635000,
            "Source": "result"
        },
        {
            "Title": "Oracle Financial Services Software Reports Q4 FY2023 Results",
            "Summary": "Oracle Financial Services Software announced its Q4 financial results. The company's EBITDA increased to 7.64 billion rupees from 7.34 billion rupees year-over-year. The EBITDA margin slightly decreased to 44.56% from 44.71%. Consolidated net profit rose to 6.4 billion rupees from 5.6 billion rupees year-over-year and 5.4 billion rupees quarter-over-quarter. Revenue for Q4 increased to 17.2 billion rupees from 16.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745592577000,
            "Source": "result"
        },
        {
            "Title": "Oracle Financial Services Software to Consider Q4 Results on April 25",
            "Summary": "Oracle Financial Services Software has announced that it will consider its fourth quarter (Q4) financial results on April 25. This indicates that the company is preparing to review and potentially approve its quarterly financial statements for the period ending March 31, 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1744893290000,
            "Source": "default"
        },
        {
            "Title": "Oracle Financial Services Software Reports Q3 Financial Results",
            "Summary": "Oracle Financial Services Software has announced its Q3 financial results. The company reported a consolidated net profit of 5.4 billion rupees, which is lower compared to 7.41 billion rupees in the same quarter last year and 5.8 billion rupees in the previous quarter. Revenue for Q3 stood at 17.15 billion rupees, down from 18.24 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1736985884000,
            "Source": "earnings"
        },
        {
            "Title": "Oracle Financial Services Software Reports Decline in Q3 EBITDA",
            "Summary": "Oracle Financial Services Software has reported a decrease in its third-quarter EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA for Q3 stood at 7.14 billion rupees, down from 9.05 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin has decreased from 49.62% to 41.62% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1736953447000,
            "Source": "earnings"
        },
        {
            "Title": "Oracle Financial Services Software Reports Q3 Financial Results",
            "Summary": "Oracle Financial Services Software has reported its Q3 financial results. The company's consolidated net profit for the quarter was 5.4 billion rupees, compared to 7.41 billion rupees year-over-year and 5.8 billion rupees quarter-over-quarter. Revenue for Q3 stood at 17.15 billion rupees, down from 18.24 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1736953375000,
            "Source": "earnings"
        },
        {
            "Title": "Oracle Financial Services Software to Consider Q3 Results on January 15",
            "Summary": "Oracle Financial Services Software (OFSS) has announced that it will consider its third quarter (Q3) financial results on January 15. This news is a standard corporate announcement regarding the company's upcoming earnings report.",
            "Sentiment": "neutral",
            "PublishDate": 1736253827000,
            "Source": "earnings"
        },
        {
            "Title": "Oracle Financial Services Software to Consider Q3 Results on January 15",
            "Summary": "Oracle Financial Services Software (OFSS) has announced that it will consider its third-quarter financial results on January 15. This indicates that the company is preparing to review and potentially approve its quarterly financial performance for public disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1736253527000,
            "Source": "result"
        },
        {
            "Title": "Oracle Financial Services Software Ltd Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Oracle Financial Services Software Ltd. The trade involved approximately 45,148 shares at a price of Rs. 12,709.95 per share, totaling Rs. 57.38 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1735549858000,
            "Source": "block_deals"
        },
        {
            "Title": "Oracle Financial Services Software Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Oracle Financial Services Software Ltd. The trade involved approximately 50,491 shares at a price of Rs. 12,232.60 per share, totaling Rs. 61.76 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1735022807000,
            "Source": "block_deals"
        },
        {
            "Title": "Oracle Financial Services Software Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Oracle Financial Services Software Ltd. The trade involved approximately 138,997 shares at a price of Rs. 12,243.95 per share, totaling Rs. 170.19 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734943723000,
            "Source": "block_deals"
        },
        {
            "Title": "Oracle Financial Services Software Ltd Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Oracle Financial Services Software Ltd. The trade involved approximately 61,404 shares at a price of Rs. 12,237.50 per share, totaling Rs. 75.14 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734943703000,
            "Source": "block_deals"
        },
        {
            "Title": "Oracle Financial Services Software Ltd Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Oracle Financial Services Software Ltd. The trade involved approximately 91,078 shares at a price of Rs. 12,460.00 per share, totaling Rs. 113.48 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734593738000,
            "Source": "block_deals"
        },
        {
            "Title": "Oracle Financial Services Software Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Oracle Financial Services Software Ltd shares occurred on the National Stock Exchange (NSE). The trade involved approximately 73,341 shares at a price of Rs. 12,469.00 per share, totaling Rs. 91.45 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734593476000,
            "Source": "block_deals"
        },
        {
            "Title": "Oracle Financial Services Software Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for Oracle Financial Services Software Ltd. The trade involved approximately 100,492 shares at a price of Rs. 12,325.00 per share, totaling Rs. 123.86 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734588230000,
            "Source": "block_deals"
        },
        {
            "Title": "Oracle Financial Services: Stock Dips Despite Strong Year-to-Date Performance",
            "Summary": "Oracle Financial Services shares fell 3.4% following Oracle Corp's disappointing Q3 guidance. Oracle Corp reported Q2 revenue of $14.1 billion, up 9%, with cloud infrastructure business growing 52%. However, Q3 projections missed analyst estimates, causing Oracle Corp shares to drop 8% in extended trading. Oracle Financial Services stock is up 190% YTD, its best performance since 2009.",
            "Sentiment": "neutral",
            "PublishDate": 1733806826000,
            "Source": "earnings"
        },
        {
            "Title": "Oracle Financial Services Software Reports Strong Q2 Results",
            "Summary": "Oracle Financial Services Software has announced its Q2 financial results. The company's consolidated net profit increased to 5.8 billion rupees, up from 4.17 billion rupees year-over-year and 6.2 billion rupees quarter-over-quarter. Revenue for Q2 rose to 16.7 billion rupees, compared to 14.4 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729780330000,
            "Source": "result"
        },
        {
            "Title": "Oracle: AI-Powered Translation for Pharmacovigilance",
            "Summary": "<p>Oracle introduces <span class='positive'>AI-powered</span> automatic translation of <span class='neutral'>safety case information</span> into 30 languages within <b>Oracle Argus</b>, aiming to <span class='positive'>streamline</span> <b>pharmacovigilance</b> processes and <span class='positive'>improve</span> regulatory compliance efficiency.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728031625000,
            "Source": "normal_news"
        }
    ]
}