{
    "Symbol": "OIL",
    "ISIN": "INE274J01014",
    "News": [
        {
            "Title": "Oil India schedules Q3FY26 results call on Feb 11",
            "Summary": "Oil India Limited announces conference call organized by Antique Stock Broking on February 11, 2026 at 10:30 AM IST to discuss third quarter FY2025-26 financial results with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770299385615,
            "Source": "co_actions_results"
        },
        {
            "Title": "Russia Backs India's Oil Purchases as Market Stabilizer",
            "Summary": "Russian Foreign Ministry defends India's continued purchase of Russian oil, stating the trade benefits both nations and helps maintain stability in global energy markets amid ongoing geopolitical tensions.",
            "Sentiment": "positive",
            "PublishDate": 1770208619409,
            "Source": "global"
        },
        {
            "Title": "Oil India Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Oil India Limited has scheduled its board meeting for February 10, 2026, to consider Q3FY26 financial results. Trading window remains closed until February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770028041220,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oil India clarifies seismic studies news report",
            "Summary": "Oil India Limited provides regulatory clarification on news regarding seismic studies and OALP-X bidding strategy, stating information was general in nature for E&P companies.",
            "Sentiment": "neutral",
            "PublishDate": 1770010884309,
            "Source": "stocks"
        },
        {
            "Title": "Oil India clarifies volume surge amid crude rally",
            "Summary": "Oil India Limited clarifies recent trading volume increase, citing 13% crude oil price surge from ~$60 to ~$68 over three weeks as potential factor affecting stock movement.",
            "Sentiment": "neutral",
            "PublishDate": 1769661152949,
            "Source": "stocks"
        },
        {
            "Title": "India Oil Minister Eyes Canadian Gas Supply Deal",
            "Summary": "India's Oil Minister expresses optimism about securing gas supplies from Canada, potentially strengthening bilateral energy cooperation between the two nations.",
            "Sentiment": "positive",
            "PublishDate": 1769509532285,
            "Source": "global"
        },
        {
            "Title": "Numaligarh Refinery Plans 180,000 BPD Expansion",
            "Summary": "Oil India's Numaligarh Refinery is set to expand its capacity to 180,000 barrels per day by the end of 2026, marking a significant milestone in India's refining infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1769499717921,
            "Source": "stocks"
        },
        {
            "Title": "Russian Oil Flows to India Show Resilience Despite Sanctions",
            "Summary": "India's Russian crude imports stabilize at 1.3 million barrels daily in December, down from 2 million at peak. Despite US sanctions and pressure, discounted Russian oil remains attractive to Indian refiners through 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769491141942,
            "Source": "global"
        },
        {
            "Title": "Gandhar Oil Q3 Net Profit Surges 68% to ₹32 Crore",
            "Summary": "Gandhar Oil Refinery reported 67.9% YoY growth in Q3 net profit to ₹32.4 crore, driven by higher revenue of ₹1,167 crore and strong PHPO demand contributing 50% of total revenue.",
            "Sentiment": "positive",
            "PublishDate": 1769235349508,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gulf Oil Partners with ACE, Ammann & XCMG",
            "Summary": "Gulf Oil Lubricants India announces strategic partnerships with three construction equipment manufacturers to strengthen its infrastructure segment position through OEM-branded lubricant supply.",
            "Sentiment": "positive",
            "PublishDate": 1768828344044,
            "Source": "stocks"
        },
        {
            "Title": "Gulf Oil Partners with Ace, Ammann & XCMG",
            "Summary": "Gulf Oil Lubricants India forms strategic partnerships with three infrastructure equipment companies to expand its portfolio and enhance equipment reliability while reducing ownership costs.",
            "Sentiment": "positive",
            "PublishDate": 1768808194538,
            "Source": "stocks"
        },
        {
            "Title": "Russia-India Oil Trade Exposes Sanctions Limitations",
            "Summary": "Despite US imposing 500% duties on Russian oil trade, India continues imports through loopholes. Small companies bypass sanctions as Rosneft and Lukoil restrictions don't apply to all Russian oil exports.",
            "Sentiment": "neutral",
            "PublishDate": 1768380075997,
            "Source": "global"
        },
        {
            "Title": "Oil India Sees ₹140.39 Cr NSE Block Trade",
            "Summary": "Oil India witnessed a significant block trade on NSE worth ₹140.39 crores involving 3,227,362 shares at ₹435 per share, indicating substantial institutional activity in the energy sector stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768279732191,
            "Source": "co_actions_results"
        },
        {
            "Title": "Trump's 500% tariff threat unlikely to halt India's Russian crude imports",
            "Summary": "India expected to continue importing Russian crude at 1.1-1.3 million barrels per day in January despite US tariff threats, according to Kpler analyst. Middle Eastern alternatives available but would increase import costs.",
            "Sentiment": "neutral",
            "PublishDate": 1767935007301,
            "Source": "global"
        },
        {
            "Title": "Kotak Cuts Oil India Target Price by 8.3%",
            "Summary": "Kotak Securities maintains Sell rating on Oil India, reduces target price to ₹275 from ₹300, indicating 35% downside potential from current levels.",
            "Sentiment": "negative",
            "PublishDate": 1767878736502,
            "Source": "stocks"
        },
        {
            "Title": "Oil India Remains Top Pick Despite Q3 Challenges",
            "Summary": "PL Capital maintains Oil India as a preferred investment choice, citing expected volume growth and upcoming Numaligarh Refinery commissioning to boost earnings despite anticipated subdued Q3 performance.",
            "Sentiment": "positive",
            "PublishDate": 1767845906044,
            "Source": "stocks"
        },
        {
            "Title": "Gandhar Oil Refinery shares surge 17% on heavy volumes",
            "Summary": "Gandhar Oil Refinery shares jumped 17% to ₹177.60 with massive trading volumes of 21 lakh shares, significantly higher than the usual 20,000 shares average.",
            "Sentiment": "positive",
            "PublishDate": 1767602513245,
            "Source": "stocks"
        },
        {
            "Title": "Oil India Clarifies Graphite Mining Deal Timeline",
            "Summary": "Oil India clarifies that its Arunachal Pradesh graphite mining deal execution on January 2, 2026 is part of ongoing licensing process, with no material impact on company operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767425766245,
            "Source": "stocks"
        },
        {
            "Title": "Oil India Faces Refinery Delays, Target Cut to ₹495",
            "Summary": "Oil India's subsidiary NRL refinery expansion delayed to Q4-FY26 from December 2025. Analysts trim EPS estimates by 1.6-9.1% but maintain Buy rating with ₹495 target price amid production growth expectations.",
            "Sentiment": "neutral",
            "PublishDate": 1767274268200,
            "Source": "stocks"
        },
        {
            "Title": "Oil India Block Trade Worth ₹58.50 Crores on NSE",
            "Summary": "Oil India witnessed a significant block trade on NSE involving 1,462,605 shares worth ₹58.50 crores at ₹400.00 per share, indicating substantial institutional activity in the oil and gas major.",
            "Sentiment": "neutral",
            "PublishDate": 1765376160738,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oil India Ltd. Sees Rs. 58.50 Crore Block Trade on NSE",
            "Summary": "Oil India Ltd. witnessed a block trade worth Rs. 58.50 crores on NSE involving approximately 1,462,605 shares at Rs. 400.00 per share. The transaction represents a significant institutional or bulk investor activity in the oil exploration company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765341433016,
            "Source": "order&deals"
        },
        {
            "Title": "Oil India Board Approves Promotion of 9 Executives to Executive Director Positions",
            "Summary": "Oil India Limited's Board of Directors approved the promotion of nine company executives to Executive Director positions, one level below the Board of Directors, with appointments effective between January and March 2026. The promotions include key roles such as ED (Offshore), ED (Business Development), ED (Finance), and ED (Medical Services), among others, representing a significant organizational restructuring at the Maharatna CPSE.",
            "Sentiment": "positive",
            "PublishDate": 1764849505631,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oil India's Numaligarh Refinery Receives Navratna Status from Government",
            "Summary": "Oil India's subsidiary Numaligarh Refinery has been awarded the prestigious Navratna status by the Indian government. This recognition grants the refinery greater operational and financial autonomy, potentially enhancing Oil India's strategic positioning in the energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1764767175502,
            "Source": "corporate_action"
        },
        {
            "Title": "Oil India Executive Director Gaurang Borgohain to Retire from Senior Management",
            "Summary": "Oil India Limited announced that Shri Gaurang Borgohain, Executive Director (Engineering Services) and senior management member, will superannuate from the company's services after close of working hours on November 30, 2025. The retirement affects a key senior management position one level below the Board of Directors at the state-owned oil exploration company.",
            "Sentiment": "neutral",
            "PublishDate": 1764506076264,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oil India Limited Fined Rs 10.85 Lakh by NSE and BSE for Board Composition Non-Compliance",
            "Summary": "Oil India Limited received fines of Rs 5,42,800 each from NSE and BSE for failing to appoint the requisite number of Independent Directors as per SEBI regulations for the quarter ended September 2025. The company attributed the non-compliance to its status as a Government of India enterprise where directors are appointed by the Ministry of Petroleum and Natural Gas, and has requested the ministry to appoint the required Independent Directors.",
            "Sentiment": "negative",
            "PublishDate": 1764334028161,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oil India Successfully Caps Well After Blowout at Kharsang Oil Field",
            "Summary": "Oil India has successfully executed the safe capping of Well KSG#76 at the Kharsang Oil Field in Arunachal Pradesh following a blowout incident. The successful capping operation addresses the safety and operational concerns at the oil field facility.",
            "Sentiment": "positive",
            "PublishDate": 1763942782891,
            "Source": "stock"
        },
        {
            "Title": "Oil India Successfully Caps Well KSG#76 After Blowout in Arunachal Pradesh",
            "Summary": "Oil India has successfully capped well KSG#76 following a blowout incident at its operations in Arunachal Pradesh. The successful capping operation resolves the emergency situation and allows the company to restore normal operations at the affected well site.",
            "Sentiment": "positive",
            "PublishDate": 1763795232732,
            "Source": "stock"
        },
        {
            "Title": "Oil India Reports Q2 FY26 Results with Production Disruptions and Exploration Write-offs",
            "Summary": "Oil India Limited reported Q2 FY26 standalone revenue of INR 5,456 crores with PAT of INR 1,044 crores, while facing production disruptions due to ethnic group blockades in Northeast region and exploration write-offs totaling INR 723 crores for Andaman wells. The company's crude oil production declined 2.58% year-on-year to 0.848 million metric tons, with average crude oil realization dropping 18.11% to USD 68.19 per barrel, significantly impacting overall revenue performance.",
            "Sentiment": "negative",
            "PublishDate": 1763719321569,
            "Source": "earnings"
        },
        {
            "Title": "Oil India Limited and TotalEnergies Sign Technology Service Agreement for Deepwater Exploration",
            "Summary": "Oil India Limited and TotalEnergies signed a Technology Service Agreement on November 19, 2025, to strengthen strategic collaboration for exploration activities in deep and ultra-deepwater offshore frontiers of Indian sedimentary basins. The agreement establishes a framework to leverage TotalEnergies' expertise across OIL's current and future offshore portfolio, including ongoing appraisal programs in Andaman Basin and exploration in ultra-deepwater blocks in Mahanadi Krishna-Godavari Basins.",
            "Sentiment": "positive",
            "PublishDate": 1763542462103,
            "Source": "order&deals"
        },
        {
            "Title": "Oil India Presents Scale-Up Plans for Production and NRL Capacity Expansion at Investor Conference",
            "Summary": "Oil India outlined plans to maintain crude oil production at 3.5-3.6 MMT for FY25-26 while scaling up gas offtake through increased supply to NRL and new pipeline connections. The company detailed NRL's phased capacity expansion from 3 MMT to 9 MMT by FY28, supported by new pipeline infrastructure including the Paradip-Numaligarh Crude Pipeline and an upcoming polypropylene plant with 360 KTPA capacity.",
            "Sentiment": "positive",
            "PublishDate": 1763471805068,
            "Source": "stock"
        },
        {
            "Title": "Oil India Lowers Annual Oil Production Target to 3.55 MMT",
            "Summary": "Oil India's management has revised down its annual oil production target to 3.55 MMT from the previously set target of 3.70 MMT. The downward revision of 0.15 MMT represents a reduction in the company's production expectations for the year.",
            "Sentiment": "negative",
            "PublishDate": 1763358901024,
            "Source": "stock"
        },
        {
            "Title": "Oil India Management Plans to Offset H1 Production Shortfall in Second Half",
            "Summary": "Oil India's management announced during a conference call that the company experienced a production shortfall in the first half of the year. The management stated they plan to compensate for this H1 production deficit during the second half of the current year.",
            "Sentiment": "neutral",
            "PublishDate": 1763358503888,
            "Source": "stock"
        },
        {
            "Title": "Oil India Reports Q2FY26 Results, Declares Interim Dividend of Rs 3.50 Per Share",
            "Summary": "Oil India Limited sustained consolidated turnover at Rs 9,175 crore in Q2FY26 but standalone PAT declined to Rs 1,044 crore from Rs 1,834 crore in Q2FY25 due to 14% drop in crude price realization. The Board declared an interim dividend of Rs 3.50 per equity share and achieved mechanical completion for upgradation of Numaligarh-Siliguri Product Pipeline facilities.",
            "Sentiment": "negative",
            "PublishDate": 1763138088581,
            "Source": "earnings"
        },
        {
            "Title": "Oil India Holds 4% Stake in Mozambique Offshore Block as Force Majeure Lifted",
            "Summary": "Oil India has a 4% stake in the Area-1 Offshore Rovuma Basin Block in Mozambique. The force majeure on the project has been lifted due to an improved security situation in the region.",
            "Sentiment": "positive",
            "PublishDate": 1762784120265,
            "Source": "stock"
        },
        {
            "Title": "Oil India Limited Announces Senior Management Changes with New RCE Appointment",
            "Summary": "Oil India Limited has announced changes in its senior management personnel. Shri Rupjyoti Phukan, Resident Chief Executive (RCE), will superannuate on October 31, 2025. Shri Binayananda Bharali will assume charge as RCE effective November 1, 2025. Bharali holds an M.Tech in Applied Geology and has more than 30 years of experience. He currently serves as Executive Director (OSD) in the RCE's Office.",
            "Sentiment": "neutral",
            "PublishDate": 1761919547050,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oil India Limited Signs Strategic Partnerships with BPCL and NRL Worth ₹1.35 Lakh Crore",
            "Summary": "Oil India Limited signed two Memoranda of Understanding with Bharat Petroleum Corporation Limited and Numaligarh Refinery Limited at the 28th Energy Technology Meet 2025 in Hyderabad. The first MoU with BPCL involves collaboration on a ₹1 lakh crore Greenfield Refinery and Petrochemical Complex near Ramayapatnam Port in Nellore district, Andhra Pradesh. The facility will have a refining capacity of 9-12 MMTPA and an ethylene cracker unit of 1.5 MMTPA, with commercial operations planned by FY 2030. OIL may take a minority equity stake in the proposed joint venture. The second tripartite MoU between OIL, BPCL, and NRL focuses on developing a cross-country petroleum product pipeline from Siliguri to Mughalsarai via Muzaffarpur, with an estimated investment of ₹3,500 crore. This project supports NRL's expansion from 3 MMTPA to 9 MMTPA capacity. The pipeline project will be jointly owned by BPCL (50%), OIL (25%) and NRL (25%). Both agreements were signed in the presence of Pankaj Jain, Secretary, Ministry of Petroleum and Natural Gas.",
            "Sentiment": "positive",
            "PublishDate": 1761648192443,
            "Source": "order&deals"
        },
        {
            "Title": "Oil India Limited Completes Numaligarh-Siliguri Product Pipeline Upgrade Project",
            "Summary": "Oil India Limited achieved mechanical completion of its Numaligarh-Siliguri Product Pipeline (NSPL) upgradation project on October 12, 2025. The project enhances the pipeline's transportation capacity from 1.77 Million Metric Tonnes Per Annum to 5.5 MMTPA, strengthening the company's midstream infrastructure to handle increased product flows from the Numaligarh Refinery. This development supports the ongoing Numaligarh Refinery Expansion Project by Numaligarh Refinery Ltd., which will increase refinery capacity from 3.0 MMTPA to 9.0 MMTPA. The completion reinforces Oil India Limited's commitment to enhancing energy infrastructure in the Northeastern region and meeting India's growing petroleum product demand.",
            "Sentiment": "positive",
            "PublishDate": 1760362438598,
            "Source": "stock"
        },
        {
            "Title": "Oil India Limited Signs 15-Year Gas Supply Agreement with NEEPCO for Assam Power Plant",
            "Summary": "Oil India Limited has signed a 15-year Gas Sale and Purchase Agreement with North Eastern Electric Power Corporation Limited for continued supply of 1.4 MMSCMD of natural gas to NEEPCO's Assam Gas Based Power Station at Bokuloni, Dibrugarh. The new 15-year agreement replaces the previous 10-year arrangement between the companies. The agreement was executed by Executive Director (Business Development) from OIL and Executive Director (Operation & Maintenance) from NEEPCO at the AGBPS office. AGBPS is the largest gas-based power plant in Assam and plays a vital role in meeting regional power demand. The partnership aims to secure power needs of Assam and the Northeast while strengthening regional energy security.",
            "Sentiment": "positive",
            "PublishDate": 1760361664969,
            "Source": "order&deals"
        },
        {
            "Title": "Oil India Signs LNG Collaboration Agreement With Mahanagar Gas",
            "Summary": "Oil India has entered into an agreement with Mahanagar Gas for collaboration in the LNG sector. The partnership involves both companies working together on liquefied natural gas initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1759763369722,
            "Source": "order&deals"
        },
        {
            "Title": "Oil India Signs Partnership Agreement with GAIL to Enhance Natural Gas Sector Cooperation",
            "Summary": "Oil India has entered into an agreement with GAIL (India) Limited aimed at strengthening collaboration in the natural gas sector. The partnership between the two energy companies is designed to boost their cooperative efforts in natural gas operations.",
            "Sentiment": "positive",
            "PublishDate": 1759238688725,
            "Source": "order&deals"
        },
        {
            "Title": "Oil India Discovers Natural Gas in Andaman Shallow Offshore Block",
            "Summary": "Oil India has reported the occurrence of natural gas in its Andaman shallow offshore block. The company is conducting additional testing to evaluate the gas discovery.",
            "Sentiment": "positive",
            "PublishDate": 1759104734432,
            "Source": "stock"
        },
        {
            "Title": "Oil India Discovers Natural Gas in Andaman Shallow Offshore Block",
            "Summary": "Oil India has discovered natural gas in its Andaman shallow offshore block. The company plans to conduct further testing to evaluate the discovery.",
            "Sentiment": "positive",
            "PublishDate": 1758895886155,
            "Source": "stock"
        },
        {
            "Title": "Oil India Expands Global Partnerships for Critical Minerals, Geothermal Energy, and Deep Water Exploration",
            "Summary": "Oil India's leadership announced multiple strategic initiatives to expand the company's exploration activities. The Co CMD highlighted the company's global focus on exploring critical minerals and rare earth elements. Additionally, Oil India plans to collaborate with global partners to explore geothermal opportunities within India while seeking international asset purchases. The CEO also announced plans to partner with global explorers for potential deep water exploration sites.",
            "Sentiment": "positive",
            "PublishDate": 1758605554509,
            "Source": "stock"
        },
        {
            "Title": "Oil India and RVUNL Form Joint Venture for 1.2 GW Renewable Energy Projects in Rajasthan",
            "Summary": "Oil India and Rajasthan Rajya Vidyut Utpadan Nigel Limited (RVUNL) have signed a Joint Venture Agreement to develop 1.2 GW renewable energy projects in Rajasthan. The project portfolio includes 1,000 MW of solar capacity and 200 MW of wind capacity. This partnership is part of India's broader green energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1758288249872,
            "Source": "stock"
        },
        {
            "Title": "Oil India and HCL Form Partnership for Mineral Exploration and Development",
            "Summary": "Oil India and HCL have entered into an agreement to collaborate on exploring and developing minerals, with a focus on copper and related resources. The partnership aims to leverage both companies' capabilities in the mineral exploration sector.",
            "Sentiment": "positive",
            "PublishDate": 1758272257714,
            "Source": "order&deals"
        },
        {
            "Title": "Oil India Plans Major Exploration Expansion with Doubled Capex for FY26",
            "Summary": "Oil India will undertake exploration activities in the Kerala-Konkan basin and acquire seismic data covering 40,000 square kilometers in the Mahanadi and KG Basin. The company has acquired 1 lakh square kilometers for exploration and completed drilling 57 wells across Assam, Rajasthan, Mahanadi, and Andaman offshore regions. Oil India plans to drill 80+ new wells and targets 4 MMT oil production and 5 BCM gas production in FY26. The company has doubled its capex estimate for FY26 to ₹17,000 crores from ₹8,500 crores in the previous fiscal. Oil India achieved record production of 6.710 MMTOE in FY25, with natural gas production reaching 3,252 MMSCM. Crude oil production grew 15% over three years from 3.01 MMT in FY22 to 3.458 MMT in FY25. The company targets annual revenue of ₹1 lakh crores and cumulative capex of ₹1.3 lakh crores by 2030. An MoU will be signed with Rajasthan for 1,000 MW solar and 200 MW wind power capacity, while commissioning of Numaligarh refinery units is planned for December.",
            "Sentiment": "positive",
            "PublishDate": 1758239299500,
            "Source": "stock"
        },
        {
            "Title": "Oil India Expects Mozambique LNG Project Restart by Year End, Reports Strong Russian Asset Returns",
            "Summary": "Oil India expects the $20-billion TotalEnergies-operated Mozambique liquefied natural gas project to restart development by the end of this year, with operations resuming in the second half of 2025. The project was halted in 2021 following a deadly attack by Islamic State-linked insurgents, but improved security conditions are enabling the restart. Oil India holds a stake in the project alongside other Indian state firms ONGC Videsh and Bharat PetroResources, collectively owning 30%. TotalEnergies operates the project with a 26.5% stake. Additionally, Oil India reported receiving $942 million in dividends from its Russian assets Vankorneft and Taas-Yuryakh, representing 91% of its original investment, with full recovery expected in the coming year.",
            "Sentiment": "positive",
            "PublishDate": 1758204646441,
            "Source": "stock"
        },
        {
            "Title": "Oil India Executive Holds Discussions on Fuel Supply with State Retailers via Numaligarh Refinery",
            "Summary": "An Oil India executive engaged in discussions with other state retailers regarding fuel supply arrangements from the expanded Numaligarh Refinery. The talks focused on supply coordination between the refinery and various state-owned retail entities.",
            "Sentiment": "neutral",
            "PublishDate": 1758196045083,
            "Source": "stock"
        },
        {
            "Title": "Oil India Plans to Triple Numaligarh Refinery Capacity to 180,000 BPD by December 2025",
            "Summary": "Oil India has announced plans to significantly expand its Numaligarh Refinery capacity from the current 60,000 barrels per day (BPD) to 180,000 BPD by December 2025. This expansion represents a three-fold increase in the refinery's processing capacity.",
            "Sentiment": "positive",
            "PublishDate": 1758195215896,
            "Source": "stock"
        },
        {
            "Title": "Oil India Limited Reports Record Production and Strong Financial Performance at 66th AGM",
            "Summary": "Oil India Limited held its 66th Annual General Meeting, where Chairman & Managing Director Dr. Ranjit Rath highlighted the company's record-breaking performance. The company achieved its highest-ever oil and oil-equivalent gas production of 6.710 MMTOE and natural gas production of 3,252 MMSCM. Financially, OIL reported total income of ₹23,987 crore (standalone) and ₹37,830 crore (consolidated), with net profit of ₹6,114 crore (standalone) and ₹7,040 crore (consolidated), reflecting margins of 27.64% and 19.47% respectively. The company maintained a capital investment program of over ₹18,000 crore on consolidated basis. OIL also inaugurated the world's first bamboo-based 2-G Bio Ethanol Plant and laid foundation for a 360 KTPA polypropylene plant at Numaligarh with project cost over Rs. 7,000 crore. The company achieved a 59% reduction in flaring and is investing in renewables, green hydrogen, biofuels and sustainable aviation fuel as part of its Net Zero 2040 target.",
            "Sentiment": "positive",
            "PublishDate": 1758190832639,
            "Source": "corporate_action"
        }
    ]
}