{
    "Symbol": "OILCOUNTUB",
    "ISIN": "INE591A01010",
    "News": [
        {
            "Title": "Oil Country Tubular Q3FY26 Loss Widens to ₹1,747 Lakhs",
            "Summary": "Oil Country Tubular Limited reported a net loss of ₹1,747.35 lakhs for Q3FY26, compared to a profit of ₹164.37 lakhs in Q3FY25, with revenue declining 86.37% to ₹562.10 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1770894364120,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oil Country Tubular Board Meet Set for Feb 12",
            "Summary": "Oil Country Tubular Limited has scheduled a board meeting on February 12, 2026, to consider and approve unaudited standalone financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770032404580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oil Country Tubular Faces ₹11,800 Penalty",
            "Summary": "Oil Country Tubular Limited received regulatory penalties totaling ₹11,800 from BSE and NSE for late submission of related party transaction disclosures by one day.",
            "Sentiment": "negative",
            "PublishDate": 1765953085959,
            "Source": "stocks"
        },
        {
            "Title": "United Steel Allied Industries Sells 9.5% Stake in Oil Country Tubular Limited",
            "Summary": "United Steel Allied Industries Private Limited, a promoter group shareholder, sold 49,40,000 equity shares of Oil Country Tubular Limited on December 1, 2025, reducing its shareholding from 42.68% to 33.18%. The transaction represents a 9.5% stake disposal in the target company, with the seller maintaining significant ownership through remaining equity shares and convertible securities.",
            "Sentiment": "neutral",
            "PublishDate": 1764665859399,
            "Source": "corporate_action"
        },
        {
            "Title": "Vivek Mundra Acquires 9.50% Stake in Oil Country Tubular Ltd Through Open Market Purchase",
            "Summary": "Vivek Mundra acquired 49,40,000 shares representing 9.50% of Oil Country Tubular Ltd's total voting capital through open market transactions on December 1, 2025. The acquisition increases his shareholding from zero to 9.50% in the company, requiring regulatory disclosure under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764598455749,
            "Source": "corporate_action"
        },
        {
            "Title": "United Steel Allied Industries Submits Revised SEBI Disclosure for Oil Country Tubular Limited",
            "Summary": "United Steel Allied Industries Private Limited has submitted a revised disclosure under SEBI regulations to BSE regarding its shareholding in Oil Country Tubular Limited. The revision addresses discrepancies pointed out by BSE in the original disclosure under Regulation 31(1) and 31(2) of SEBI (Substantial Acquisition of Shares and Takeovers) Regulations, 2011. United Steel Allied Industries, identified as a promoter group entity of Oil Country Tubular Limited, has rectified the discrepancies and updated the disclosure format in line with SEBI's revised format effective August 05, 2015. The submission includes clarification on encumbrance release of pledge. The disclosure was signed by Director Kamineni Shashidhar from Hyderabad.",
            "Sentiment": "neutral",
            "PublishDate": 1762409079355,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oil Country Tubular Limited Issues Corrigendum to Correct Financial Results Errors",
            "Summary": "Oil Country Tubular Limited issued a corrigendum to correct typographical errors in its unaudited financial results for the quarter and half-year ended September 30, 2025. The company corrected reserves excluding revaluation reserves from Rs. 113.23 lakhs to Rs. 873.14 lakhs for the quarter ended June 30, 2025. Additionally, segment-wise results were revised for Drill Pipe and Allied Products and OCTG Services segments across Q1 and Q2 FY25-26. The company reported a net loss of Rs. 2,156.70 lakhs for the quarter ended September 30, 2025, compared to Rs. 880.53 lakhs in the previous quarter. Revenue from operations was Rs. 1,004.78 lakhs for the latest quarter. The company issued 41,50,000 equity shares during the half-year period through conversion of warrants at a premium of Rs. 35 per share.",
            "Sentiment": "negative",
            "PublishDate": 1761837119750,
            "Source": "earnings"
        },
        {
            "Title": "Oil Country Tubular Limited Reports Net Loss of Rs 24.87 Crores in Q2 FY2026",
            "Summary": "Oil Country Tubular Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported a net loss of Rs 24.87 crores compared to a net loss of Rs 8.81 crores in the previous quarter. Revenue from operations stood at Rs 10.05 crores for the current quarter versus Rs 7.92 crores in the prior quarter. For the half-year period, the company posted a net loss of Rs 33.37 crores against Rs 22.96 crores in the corresponding previous period. The company's total income for the quarter was Rs 40.81 crores. Basic earnings per share was negative at Rs 4.15 for the quarter. The Board also appointed Mr. Vaibhav Suryawanshi as the Nodal Officer for Investor Education and Protection Fund purposes and approved revised Related Party Transactions Policy.",
            "Sentiment": "negative",
            "PublishDate": 1761832962135,
            "Source": "earnings"
        },
        {
            "Title": "Oil Country Tubular Limited Appoints New Director and Key Management Personnel",
            "Summary": "Oil Country Tubular Limited's Board of Directors approved several key appointments during their meeting on August 7, 2025. Dr. Kamineni Shashidhar, a General Surgeon with a Master's degree from Gulbarga University, was appointed as Additional Director in the Non-Executive Professional Director category, subject to shareholder approval. Dr. Shashidhar is the son of Chairman and Managing Director Shri. Kamineni Suryanarayana and brings over three decades of experience in healthcare and hospital administration, having established the Kamineni Group of Hospitals with over 2,500 beds. The Board also appointed Mr. G.L.B Shastry, a Chartered Accountant with 16 years of experience, as Chief Financial Officer, and Mr. Vaibhav S Suryawanshi as Company Secretary and Compliance Officer effective August 5, 2025. Additionally, Mr. J. Ramamuni Reddy was re-designated as Head-Accounts. The Board approved quarterly financial results and preparations for the 39th Annual General Meeting scheduled for September 10, 2025, including the appointment of NSDL as E-Voting Agency and Ms. Manjula Aleti as Scrutinizer.",
            "Sentiment": "positive",
            "PublishDate": 1754567540878,
            "Source": "corporate_governance"
        }
    ]
}