{
    "Symbol": "OLAELEC",
    "ISIN": "INE0LXG01040",
    "News": [
        {
            "Title": "Ola Electric Begins Shakti 9.1kWh Deliveries",
            "Summary": "Ola Electric commences deliveries of India's first residential BESS solution Shakti 9.1kWh in Bengaluru, while securing BIS certification for 5.2kWh variant with 4680 Bharat Cells.",
            "Sentiment": "positive",
            "PublishDate": 1769932467486,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Plans Workforce Reduction of 5%",
            "Summary": "Ola Electric announces plans to impact approximately 5% of its workforce as the company focuses on enhancing speed and efficiency through increased automation in frontend operations.",
            "Sentiment": "neutral",
            "PublishDate": 1769779426272,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Seeks Shareholder Approval for New Director",
            "Summary": "Ola Electric Mobility has issued a postal ballot notice seeking member approval for the appointment of Mr. Navalur Dattatreya Singh Shashank as Non-Executive Independent Director for a five-year term.",
            "Sentiment": "neutral",
            "PublishDate": 1769703124106,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric hits all-time low, drops 3.54%",
            "Summary": "Ola Electric shares plunged to record low of Rs 30.76 on NSE amid declining quarterly revenues from Rs 1,214 crore to Rs 690 crore and persistent losses across all reporting periods.",
            "Sentiment": "negative",
            "PublishDate": 1769508467971,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ola Electric shares fall 10th day, CFO quits",
            "Summary": "Ola Electric Mobility shares dropped 4.50% on Tuesday, marking the tenth consecutive day of losses as CFO Harish Abichandani resigned citing personal reasons. Stock trades near all-time low.",
            "Sentiment": "negative",
            "PublishDate": 1768883980233,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Authorizes Key Personnel for Disclosures",
            "Summary": "Ola Electric Mobility Limited has designated three key managerial personnel to determine materiality of events and make regulatory disclosures to stock exchanges under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768842307066,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Appoints New CFO Deepak Rastogi",
            "Summary": "Ola Electric Mobility Limited announces CFO transition with Deepak Rastogi replacing Harish Abichandani effective January 20, 2026. Board meeting held on January 19, 2026 approved the leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1768841780259,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Gets BIS Nod for शक्ति 9.1kWh Battery",
            "Summary": "Ola Electric secures BIS certification for शक्ति 9.1kWh residential battery storage system with 4680 Bharat Cells, set to begin deliveries end-January 2026 at ₹2,49,999.00.",
            "Sentiment": "positive",
            "PublishDate": 1768551928740,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Expands 4680 Bharat Cell Platform",
            "Summary": "Ola Electric announces expansion of its 4680 Bharat Cell platform beyond mobility, opens sales to businesses and startups, launches Ola Shakti residential energy storage system, and begins deliveries of Roadster X+ motorcycle.",
            "Sentiment": "positive",
            "PublishDate": 1768377334617,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Expands 4680 Bharat Cell Platform Access",
            "Summary": "Ola Electric opens its 4680 Bharat Cell platform to businesses and startups for automotive, humanoids, drones, and medical equipment applications, while announcing delivery timelines for residential energy storage.",
            "Sentiment": "positive",
            "PublishDate": 1768377255797,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Launches Muhurat Mahotsav Campaign",
            "Summary": "Ola Electric reintroduces Muhurat Mahotsav with special pricing on 4680 Bharat Cell products including Shakti variants and upgraded scooters for two days starting January 14, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768309206776,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric launches first BESS product 'Shakti'",
            "Summary": "Ola Electric rolls out residential Battery Energy Storage System 'Shakti' from Tamil Nadu Gigafactory, marking entry into BESS market with indigenous 4680 Bharat Cell technology.",
            "Sentiment": "positive",
            "PublishDate": 1768276224700,
            "Source": "stocks"
        },
        {
            "Title": "SoftBank Reduces Stake in Ola Electric to 13.53%",
            "Summary": "SoftBank Group has reduced its stake in Ola Electric Mobility from 15.68% to 13.53% over four months, selling 94.6 million shares amid declining market share and revenue challenges for the EV maker.",
            "Sentiment": "negative",
            "PublishDate": 1768220826030,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ola Electric launches Shakti home energy storage",
            "Summary": "Ola Electric rolls out first unit of 'Shakti', India's first fully made-in-India residential energy storage system from its Krishnagiri Gigafactory in Tamil Nadu.",
            "Sentiment": "positive",
            "PublishDate": 1768216687672,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric launches home battery 'Ola शक्ति'",
            "Summary": "Ola Electric unveils India's first residential battery energy storage system powered by indigenous 4680 Bharat Cells, expanding beyond EVs into energy storage with four configurations available for booking at ₹999.",
            "Sentiment": "positive",
            "PublishDate": 1768215073871,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Launches First 'शक्ति' Residential BESS",
            "Summary": "Ola Electric rolls out its first शक्ति residential battery energy storage system from its Gigafactory, marking entry into India's residential BESS market with indigenous 4680 Bharat Cell technology.",
            "Sentiment": "positive",
            "PublishDate": 1768212361529,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Launches 'शक्ति' BESS from GigaFactory",
            "Summary": "Ola Electric Mobility enters residential battery energy storage market with indigenous 4680 Bharat cells, launching शक्ति product line from its GigaFactory in multiple configurations.",
            "Sentiment": "positive",
            "PublishDate": 1768211564585,
            "Source": "stocks"
        },
        {
            "Title": "SoftBank cuts Ola Electric stake to 13.53%",
            "Summary": "SoftBank reduces its holding in Ola Electric from 15.68% to 13.53% by selling 94.6 million shares through open market transactions between September 2025 and January 2026, continuing broader investor exit trend.",
            "Sentiment": "negative",
            "PublishDate": 1768184440255,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ola Electric Plans Major Announcement on January 14",
            "Summary": "Bhavish Aggarwal-led Ola Electric is set to make a significant announcement on January 14, coinciding with Makar Sankranti festival, hinting at potential energy sector developments.",
            "Sentiment": "positive",
            "PublishDate": 1767958024514,
            "Source": "stocks"
        },
        {
            "Title": "SoftBank reduces Ola Electric stake to 13.53%",
            "Summary": "SoftBank sold 2.15% stake in Ola Electric through open market transactions between September 2025 and January 2026, reducing ownership from 15.68% to 13.53% via SVF II OSTRICH investment vehicle.",
            "Sentiment": "neutral",
            "PublishDate": 1767956362792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ola Electric Plans Major Announcement on Jan 14",
            "Summary": "Ola Electric teases significant announcement on Makar Sankranti, hinting at major milestone in India's energy revolution with cryptic social media post referencing 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767955078836,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric shares drop as SoftBank cuts stake again",
            "Summary": "Ola Electric shares declined 1.71% to ₹39.77 after Japan-based SoftBank reduced its stake in the electric vehicle company for the second time in six months, highlighting continued investor repositioning.",
            "Sentiment": "negative",
            "PublishDate": 1767945072720,
            "Source": "co_actions_results"
        },
        {
            "Title": "SVF II Ostrich Sells 9.46 Cr Ola Electric Shares",
            "Summary": "SoftBank affiliate SVF II OSTRICH (DE) LLC disposed of 94.63 million equity shares of Ola Electric Mobility Limited between September 2025 and January 2026, reducing its stake from 15.68% to 13.53%.",
            "Sentiment": "neutral",
            "PublishDate": 1767940806534,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ola Electric shares decline 8% after 3-day rally",
            "Summary": "Ola Electric shares fell 8% from day's highs, ending three-session winning streak despite December market share recovery to 9.3% and improved service operations under Hyperservice initiative.",
            "Sentiment": "negative",
            "PublishDate": 1767677357120,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric shares surge 16% on turnaround signals",
            "Summary": "Ola Electric shares jumped 8.2% to ₹44.28, extending a 16% rally driven by improved service execution through Hyperservice program and rising market share to 9.3% in December.",
            "Sentiment": "positive",
            "PublishDate": 1767603391544,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Introduces Roadster X Electric Motorcycle",
            "Summary": "Ola Electric launches Roadster X electric motorcycle in India as part of its comprehensive 2025 achievements including indigenous battery technology and enhanced customer services.",
            "Sentiment": "positive",
            "PublishDate": 1767275861632,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Shares Surge 12% in Two Days on Strong December Performance",
            "Summary": "Ola Electric shares gained over 12% in two trading sessions, hitting Rs 40.77 on January 2, 2026, driven by December market share recovery to 9.3% and strong regional performance gains.",
            "Sentiment": "positive",
            "PublishDate": 1767275146849,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Market Share Jumps to 9.3% in December",
            "Summary": "Ola Electric announces business turnaround with market share rising to 9.3% in December 2025, driven by Hyperservice program delivering 77% same-day service resolution and strong demand recovery.",
            "Sentiment": "positive",
            "PublishDate": 1767255478858,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric's Business Head Vishal Chaturvedi Resigns",
            "Summary": "Ola Electric Mobility Limited announces resignation of Senior Management Personnel Mr. Vishal Chaturvedi, Business Head - Cell, effective December 31, 2025, citing personal commitments as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1767197972223,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Roadster X+ Gets Government Certification",
            "Summary": "Ola Electric receives CMVR certification for Roadster X+ motorcycle with 4680 Bharat Cell technology, enabling commercial deliveries with industry-leading 500 km range.",
            "Sentiment": "positive",
            "PublishDate": 1767065154721,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Market Share Drops to 16% in 2025",
            "Summary": "Ola Electric's market share in the electric two-wheeler segment declined significantly to approximately 16% in 2025, down from 37% in the previous year, representing a substantial reduction.",
            "Sentiment": "negative",
            "PublishDate": 1766979439065,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric shares fall 1.52% despite PLI approval",
            "Summary": "Ola Electric shares declined to ₹35.64 despite securing ₹366.78 crore PLI incentive and expanding Bharat Cell deliveries across 4 states, with heavy selling pressure in Monday trade.",
            "Sentiment": "negative",
            "PublishDate": 1766977664199,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric shares jump 4% on ₹367cr PLI incentive",
            "Summary": "Ola Electric shares rose 4% to ₹36.85 after receiving ₹366.78 crore PLI-Auto incentive sanction from Ministry of Heavy Industries for FY25, providing much-needed liquidity amid profitability challenges.",
            "Sentiment": "positive",
            "PublishDate": 1766666745989,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Launches Same-Day Service Centers",
            "Summary": "Ola Electric Mobility introduces same-day service guarantee centers starting with Bengaluru, planning nationwide expansion to enhance customer service experience.",
            "Sentiment": "positive",
            "PublishDate": 1766474920798,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric: Debt Repayment & Share Pledge Release",
            "Summary": "Ola Electric confirms completion of debt repayment using share sale proceeds, with all promoter-level pledges (3.93% equity) fully released while promoter group maintains 34.60% stake.",
            "Sentiment": "positive",
            "PublishDate": 1766062852873,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ola Electric: Bhavish Aggarwal To Offload 2.78% Stake",
            "Summary": "Bhavish Aggarwal plans to offload 2.78% stake over next few days to release 3.93% pledged shares and repay ₹260 crore promoter loan, maintaining strong promoter control.",
            "Sentiment": "neutral",
            "PublishDate": 1765888995329,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ola Electric Launches Same-Day Hyperdelivery Service",
            "Summary": "Ola Electric commences Hyperdelivery service in Bangalore, offering same-day registration and delivery for 4680 Bharat Cell powered vehicles as part of its customer-first Hyperservice initiative.",
            "Sentiment": "positive",
            "PublishDate": 1765625522681,
            "Source": "stocks"
        },
        {
            "Title": "Ola Electric Begins Delivery of 4,680 Vehicles with In-House Bharat Cell Battery Technology",
            "Summary": "Ola Electric has started delivering 4,680 vehicles equipped with its in-house Bharat Cell battery technology. This milestone represents a significant advancement in the company's electric vehicle operations and domestic battery manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765159584870,
            "Source": "stock"
        },
        {
            "Title": "Ola Electric Appoints Practo CEO Shashank Singh as Independent Director, Ananth Sankaranarayanan Resigns",
            "Summary": "Ola Electric Mobility Limited appointed Navalur Dattatreya Singh Shashank (Practo CEO) as Non-Executive Independent Director for a five-year term from December 05, 2025 to December 04, 2030. Ananth Sankaranarayanan resigned from his Independent Director position due to increased professional commitments, with both changes resulting in revised compositions of the Stakeholders Relationship Committee and Audit Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1764955981887,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ola Electric Launches Nationwide In-App Service Booking Under Hyperservice Initiative",
            "Summary": "Ola Electric rolled out its in-app service appointment feature across India, allowing customers to schedule vehicle services, track status, and manage service needs directly through the Ola Electric app. The launch strengthens the company's direct-to-consumer model and supports its broader India Inside strategy of building scalable domestic platforms across batteries, software, and after-sales infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1764575348051,
            "Source": "stock"
        },
        {
            "Title": "Ola Electric Shareholders Approve Fundraising Through Securities Issuance",
            "Summary": "Ola Electric Mobility Limited shareholders approved a special resolution to raise funds through securities issuance via postal ballot with 99.83% votes in favor. The remote e-voting process concluded on November 27, 2025, with over 2.76 crore votes cast supporting the fundraising proposal.",
            "Sentiment": "positive",
            "PublishDate": 1764274653574,
            "Source": "corporate_action"
        },
        {
            "Title": "Ola Electric Launches Test Rides for 4680 Bharat Cell-Powered Vehicles",
            "Summary": "Ola Electric has commenced test rides of vehicles powered by 4680 Bharat Cell technology at its main stores across India. The initiative allows customers to experience the company's latest battery technology across multiple retail locations nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1763345015192,
            "Source": "stock"
        },
        {
            "Title": "Ola Electric's Bhavish Aggarwal Increases Share Pledging to 10.11% for External Financing",
            "Summary": "Bhavish Aggarwal increased his pledged stake in Ola Electric from 8.09% to 10.11% during the September quarter, pledging 13.38 crore shares as collateral to Aditya Birla Capital for an undisclosed loan to fund an unnamed group company. This represents over a tenth of his total 30.02% holding in the company. The pledging is part of a pattern since Ola Electric's August 2024 listing, with previous pledges made to fund his AI venture Krutrim through various lenders including Axis Trustee Services and Avendus entities. Ola Electric shares have declined 43% since listing and over 36% since Aggarwal's first pledge in November. The company recently reduced its FY26 revenue guidance by nearly a third to Rs 3,000-3,200 crore and approved a Rs 1,500 crore equity fundraise. Aggarwal previously had to add Rs 20 crore worth of collateral when the stock dropped below Rs 50. The company's total debt and interest obligations due by FY30 stand at Rs 2,114 crore.",
            "Sentiment": "negative",
            "PublishDate": 1762932691324,
            "Source": "stock"
        },
        {
            "Title": "Ola Electric Shares Drop 14% in Four Sessions Amid Technical Downtrend and Mixed Earnings",
            "Summary": "Ola Electric Mobility shares declined nearly 14% over four trading sessions, reaching near four-month lows. The stock has fallen 72% from its all-time high of Rs 157 and 57% from its 52-week high of Rs 102.50. Technical analysts note the stock remains in a downtrend since IPO highs, with key resistance at Rs 60-65 and support at Rs 40. The company reported mixed quarterly results with consolidated net loss narrowing to Rs 418 crore from Rs 495 crore year-over-year, but revenue dropped 43% to Rs 690 crore from Rs 1,214 crore. Ola achieved Auto EBITDA profitability for the first time with gross margin of 30.7% and reduced operating expenses by 52%. The company projects full-year revenue of Rs 3,000-3,200 crore and targets 100,000 unit deliveries for the second half. Ola dismissed a South Korean report alleging improper acquisition of battery technology as 'misleading and baseless,' stating it has begun commercial production of its in-house 4680 Bharat Cell technology.",
            "Sentiment": "negative",
            "PublishDate": 1762836716106,
            "Source": "stock"
        },
        {
            "Title": "Ola Electric Denies Technology Theft Allegations, Claims Foreign Rival Fears Market Competition",
            "Summary": "Ola Electric refuted allegations of stealing battery technology from South Korea's LG Energy Solution, calling the reports misleading and baseless. The company stated that the alleged leaked pouch cell technology is not part of its research focus, as Ola Electric's 4680 Bharat Cell uses advanced dry electrode technology in cylindrical form. Reports from South Korea claimed a former LG Energy Solution executive attempted to pass pouch cell technology to Ola Electric. Ola Electric questioned the timing of these allegations, coinciding with its 4680 Bharat Cell entering commercial production. The company asserted that fear of losing market opportunities is driving the foreign rival to attack indigenous battery innovation. Ola Electric highlighted its 720 patent filings with 124 granted patents and established India's first operational Gigafactory with Rs 2,500 crore investment. The company positioned its 4680 Bharat Cell as India's first indigenous large-format cell competing directly with Korean manufacturers in the domestic market.",
            "Sentiment": "negative",
            "PublishDate": 1762699120734,
            "Source": "stock"
        },
        {
            "Title": "LG Energy Solutions Accuses Ola Electric of Technology Theft Through Former Researcher",
            "Summary": "LG Energy Solution has accused Ola Electric of accessing confidential battery technology through a former researcher who allegedly leaked proprietary information about pouch-type ternary lithium-ion battery manufacturing processes. The ex-researcher is under investigation by South Korean authorities and has admitted to transferring information to Ola Electric but denies knowing it was confidential. This adds to Ola Electric's legal challenges, following a previous dispute with MapmyIndia over license agreement violations. Despite being India's top patent filer with 205 patents and launching its own lithium-ion cell production, industry experts question the originality of Ola's technology development, suggesting the company may have copied designs rather than developing them independently.",
            "Sentiment": "negative",
            "PublishDate": 1762536805122,
            "Source": "stock"
        },
        {
            "Title": "Moody's Downgrades Ola Electric Credit Rating to CAA1 with Negative Outlook",
            "Summary": "Moody's has lowered Ola Electric's credit rating to CAA1 and assigned a negative outlook to the electric vehicle company.",
            "Sentiment": "negative",
            "PublishDate": 1762521009866,
            "Source": "stock"
        },
        {
            "Title": "Ola Electric Submits IPO Fund Utilization Report for Quarter Ended September 2025",
            "Summary": "Ola Electric Mobility Limited submitted its monitoring agency report for IPO proceeds utilization for the quarter ended September 30, 2025. The company raised Rs. 5,500 crore through its IPO in August 2024. ICRA Limited, the monitoring agency, reported no material deviation from stated objectives, though utilization differs from original prospectus but aligns with shareholder-approved changes. The company revised its fund allocation across six objects through an AGM resolution in August 2025. Key utilizations include Rs. 616.43 crore for research and development, Rs. 341.78 crore for organic growth initiatives, Rs. 1,130.34 crore for general corporate purposes, and Rs. 85.44 crore for debt repayment. Unutilized proceeds of Rs. 2,337.52 crore are deployed in fixed deposits across various banks earning returns between 5.10% to 7.40%. The company maintains Rs. 800 crore allocated for subsidiary debt repayment and Rs. 1,227.64 crore for manufacturing capacity expansion, both unutilized during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762446794553,
            "Source": "corporate_action"
        },
        {
            "Title": "Ola Electric Achieves Auto Business Profitability with 30.7% Gross Margins in Q2 FY26",
            "Summary": "Ola Electric reported its auto business turned profitable for the first time, achieving positive EBITDA of 0.3% compared to -5.3% in Q1 FY26. The company's auto gross margins expanded to 30.7%, up 510 basis points sequentially. Consolidated revenue stood at ₹690 crores with total deliveries of 52,666 vehicles in Q2 FY26. The company launched Ola S1fea, India's first residential Battery Energy Storage System using in-house 4680 Bharat Cells, expecting ₹100 crores revenue in Q4 FY26 and ₹1,000-1,200 crores in FY27. Ola commissioned 2.5 GWh cell manufacturing capacity, making it India's first operational facility at gigawatt scale. Roadster sales grew 4x from Q1, representing about 15% of overall sales. The company launched HyperService to improve customer experience and unlock parts revenue opportunities. For H2 FY26, the company targets approximately 100,000 auto deliveries and expects FY26 consolidated revenue of ₹3,000-3,200 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762406192781,
            "Source": "earnings"
        },
        {
            "Title": "Ola Electric Reports Quarterly Loss, Appoints PwC as Internal Auditor",
            "Summary": "Ola Electric Mobility Limited's Board approved the appointment of PricewaterhouseCoopers Services LLP as Internal Auditors for financial year 2025-2026. The company also approved unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. The consolidated results show total revenue from operations of Rs 1,214 crores for the quarter, with a net loss of Rs 495 crores. For the six-month period, revenue was Rs 2,428 crores with a net loss of Rs 935 crores. The company maintains negative cash flow from operations of Rs 343 crores for the six months. Management believes the company can continue as a going concern based on available cash balances, expected future operating cash flows, available credit limits, and ability to raise borrowings. The Board previously approved raising funds up to Rs 1,700 crores through debt securities and up to Rs 1,500 crores through equity instruments. The trading window for company securities will reopen 48 hours after declaration of financial results.",
            "Sentiment": "negative",
            "PublishDate": 1762405444961,
            "Source": "earnings"
        }
    ]
}