{
    "Symbol": "OLECTRA",
    "ISIN": "INE260D01016",
    "News": [
        {
            "Title": "Olectra Greentech Insulator Division Secures ₹300+ Cr",
            "Summary": "Olectra Greentech's insulator division reports orders exceeding ₹300 crores while planning to bid for CESL's 3,000+ bus tender. Company maintains strong order book with 3,600+ buses deployed.",
            "Sentiment": "positive",
            "PublishDate": 1770176665418,
            "Source": "co_actions_results"
        },
        {
            "Title": "Olectra Greentech Projects Strong Q4 FY26 Performance",
            "Summary": "Olectra Greentech anticipates robust revenue growth and stable margins in Q4 FY26, with cautious optimism for full-year performance. Long-term EBITDA margins expected to normalize between 10-12%.",
            "Sentiment": "positive",
            "PublishDate": 1770176448057,
            "Source": "stocks"
        },
        {
            "Title": "Olectra Greentech Revises FY26 Vehicle Delivery Target",
            "Summary": "Olectra Greentech has lowered its FY26 vehicle delivery target to 1,500-2,000 units from the previous goal of 2,000 units, while its insulator division targets INR 300 crores revenue with 10%-15% annual growth.",
            "Sentiment": "neutral",
            "PublishDate": 1770176186294,
            "Source": "stocks"
        },
        {
            "Title": "Olectra Greentech Q3 Revenue Jumps 28% to ₹6.6B",
            "Summary": "Olectra Greentech reports strong Q3 performance with revenue rising 28% YoY to ₹6.6 billion, while net profit remains stable at ₹464 million compared to ₹466 million in previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770033806284,
            "Source": "co_actions_results"
        },
        {
            "Title": "MEIL Holdings Releases Share Encumbrance on Olectra",
            "Summary": "MEIL Holdings Limited releases Non-Disposal Undertaking on 6,38,083 shares of Olectra Greentech following loan closure with REC Limited, reducing encumbered shareholding to zero.",
            "Sentiment": "positive",
            "PublishDate": 1769077239753,
            "Source": "co_actions_results"
        },
        {
            "Title": "MEIL Holdings Gets Release from Non-Disposal Undertaking",
            "Summary": "MEIL Holdings Limited receives release of Non-Disposal Undertaking from REC Limited on January 08, 2026, after full loan repayment by Olectra Greentech Limited, removing restrictions on 6,38,083 shares.",
            "Sentiment": "positive",
            "PublishDate": 1768303308312,
            "Source": "co_actions_results"
        },
        {
            "Title": "Olectra Greentech Cuts FY26 Delivery Guidance",
            "Summary": "Olectra Greentech reduces delivery guidance for FY26 to 1500-2000 units from previous target of 2000-2500 units, indicating revised business expectations amid strategic expansion plans.",
            "Sentiment": "negative",
            "PublishDate": 1767328383254,
            "Source": "stocks"
        },
        {
            "Title": "Olectra Greentech Faces ₹2.58 Cr Penalty Notice",
            "Summary": "Olectra Greentech receives penalty notice of ₹2.58 crores from TGIIC for delayed completion of EV manufacturing facility construction at Hyderabad industrial park.",
            "Sentiment": "negative",
            "PublishDate": 1766051531333,
            "Source": "stocks"
        },
        {
            "Title": "Olectra Greentech Clarifies It Does Not Manufacture Electric Cars Following Media Report",
            "Summary": "Olectra Greentech Limited clarified that it is not engaged in manufacturing electric cars, responding to a news article in EENADU about an electric car unveiling. The company stated that the electric concept car unveiled at the Telangana Rising Global Summit 2025 belongs to one of its group companies, while Olectra participated in the event.",
            "Sentiment": "neutral",
            "PublishDate": 1765266040788,
            "Source": "stock"
        },
        {
            "Title": "Olectra Greentech Seeks Shareholder Approval for Key Leadership Appointments via Postal Ballot",
            "Summary": "Olectra Greentech Limited has issued a postal ballot notice seeking shareholder approval for three resolutions: regularization and appointment of Mr. Mahesh Babu Subramanian as Managing Director with Rs. 10 crore annual remuneration, and re-appointment of Mrs. Chintalapudi Laksmi Kumari as Independent Director. The e-voting period runs from November 24 to December 23, 2025, with results to be announced by December 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763552088458,
            "Source": "corporate_action"
        },
        {
            "Title": "Olectra Greentech Confirms No Concerns Over Maharashtra Bus Delivery Timeline",
            "Summary": "Olectra Greentech stated that there are no concerns regarding the timeline commitment for bus deliveries in Maharashtra. The company made this clarification during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1762926816284,
            "Source": "stock"
        },
        {
            "Title": "Olectra Greentech Reports Mixed Q2 Results with EV Revenue Up 20.5% but EBITDA Margins Decline",
            "Summary": "Olectra Greentech Limited released its investor presentation for quarterly results ended September 30, 2025. The company's EV division revenue increased 20.5% to Rs 58,125 lakhs in Q2 compared to Rs 48,247 lakhs in the previous year quarter. However, EBITDA margins compressed from 15.3% to 11.4% in the EV segment. The insulator division showed strong performance with revenue growing 82.9% to Rs 7,537 lakhs and EBITDA margins expanding to 35.3% from 28.5%. Overall consolidated revenue rose 25.4% to Rs 65,662 lakhs. The company sold 536 vehicles in the first half compared to 471 in the previous year period. Olectra has delivered over 9,818 electric vehicles on Indian roads and maintains an order book of over Rs 3,000 crores. The company operates a manufacturing facility in Hyderabad with capacity of 5,000 units per year, scalable to 10,000 units.",
            "Sentiment": "neutral",
            "PublishDate": 1762924121260,
            "Source": "earnings"
        },
        {
            "Title": "Olectra Greentech Targets 2,000 Vehicle Deliveries in FY26 After Record H1 Revenue",
            "Summary": "Olectra Greentech aims to deliver around 2,000 vehicles in FY26, compared to nearly 1,900 vehicles delivered in the previous financial year, according to Managing Director Mahesh Babu. The electric bus manufacturer achieved over Rs 1,000 crore in revenue for the first half of FY26, marking its best-ever H1 performance. The company reported a 4.2% year-on-year increase in consolidated net profit at Rs 49.5 crore in the latest quarter, while revenue jumped 25.4% to Rs 657 crore. Olectra operates in 35-40 cities across India with over 3,000 electric vehicles on the road and about 100 trucks running. The company faces challenges including depot readiness and power infrastructure availability at deployment locations.",
            "Sentiment": "positive",
            "PublishDate": 1762771714718,
            "Source": "stock"
        },
        {
            "Title": "Olectra Greentech Issues Rs 300 Crore Corporate Undertaking for REC Limited Advance Facility",
            "Summary": "Olectra Greentech Limited has issued a revised Irrevocable Corporate Undertaking with Indemnification obligation in favor of REC Limited for Rs 300 crores. This replaces an earlier Letter of Credit facility that remained unutilized against a sanctioned amount of Rs 2,500 crores. The undertaking is provided alongside EVEYTRANS (MSR) Private Limited, which is a subsidiary of EVEY TRANS PRIVATE LIMITED and step-down subsidiary of promoter MEIL Holdings Limited. REC Limited has sanctioned an advance facility of Rs 300 crores to Olectra from a larger Rupee Term Loan of Rs 6,578.42 crores sanctioned to the borrower. The advance can be utilized exclusively for bus procurement, with advance payments to bus manufacturers requiring bank guarantees. If buses are not delivered and hypothecated within 120 days, Olectra must refund the corresponding amount within 30 days, plus additional interest at 2% above prevailing rates. The company plans to use the facility to make payments to key vendors including BYD, accelerate procurement of raw materials, increase production levels, and improve working capital cycles.",
            "Sentiment": "positive",
            "PublishDate": 1762611719163,
            "Source": "corporate_action"
        },
        {
            "Title": "Olectra Greentech Reports Strong Q2 Performance with Leadership Changes",
            "Summary": "Olectra Greentech Limited announced its quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs 64,700.89 lakhs compared to Rs 33,759.72 lakhs in the previous quarter. Net profit after tax increased to Rs 5,278.05 lakhs from Rs 2,239.14 lakhs in the prior quarter. The company operates in two main segments: insulator division generating Rs 7,536.88 lakhs and e-vehicle division contributing Rs 57,164.01 lakhs in revenue. Simultaneously, Mr. Rajesh Reddy Peketi resigned from his position as Whole Time Director due to personal reasons, effective from November 8, 2025, but will continue serving as a Non-Executive Non-Independent Director. The company's Key Managerial Personnel now includes Mr. Mahesh Babu Subramanian as Managing Director, Mr. B. Sharat Chandra as Chief Financial Officer, and Mr. P. Hanuman Prasad as Vice President-Company Secretary Legal. Earnings per share stood at Rs 6.43 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762608291287,
            "Source": "earnings"
        },
        {
            "Title": "Olectra Greentech Reports 3.9% Growth in Q2 Net Profit to 494.3M Rupees",
            "Summary": "Olectra Greentech reported quarterly net profit of 494.3 million rupees compared to 475.6 million rupees in the same period last year. Revenue increased to 6.57 billion rupees from 5.24 billion rupees year-over-year. EBITDA rose to 891.7 million rupees from 812.5 million rupees, though EBITDA margin declined to 13.58% from 15.52% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762606796131,
            "Source": "earnings"
        },
        {
            "Title": "Olectra Greentech Whole Time Director Rajesh Reddy Peketi Resigns, Transitions to Non-Executive Role",
            "Summary": "Olectra Greentech announced that Whole Time Director Rajesh Reddy Peketi has resigned from his position citing personal reasons. Peketi will continue with the company as a Non-Executive Director. The company has not yet announced the effective date for this transition.",
            "Sentiment": "neutral",
            "PublishDate": 1762412374107,
            "Source": "corporate_governance"
        },
        {
            "Title": "Olectra Greentech Targets 3,000 E-Bus Deliveries in Next 12 Months",
            "Summary": "Olectra Greentech has announced plans to deliver 3,000 electric buses over the next 12 months. The company has also set a target of delivering 2,000 e-buses in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1759207225479,
            "Source": "stock"
        },
        {
            "Title": "Olectra Greentech Appoints Mahesh Babu Subramanian as Managing Director, Reconstitutes Board Committees",
            "Summary": "Olectra Greentech's Board of Directors approved the appointment of Mahesh Babu Subramanian as Additional Director and Managing Director for three years, effective September 27, 2025, subject to shareholder approval. The board also approved the re-appointment of Chintalapudi Laksmi Kumari as Independent Director for five years starting January 9, 2026. The company reconstituted four board committees including Audit, Stakeholders Relationship, Corporate Social Responsibility, and Risk Management committees. Subramanian brings over 30 years of mobility sector experience, having previously served as CEO of SWITCH Mobility and Managing Director of Mahindra Electric. He holds a postgraduate engineering degree from BITS Pilani and has completed leadership programs at Carnegie Mellon University and other institutions.",
            "Sentiment": "positive",
            "PublishDate": 1758705362330,
            "Source": "corporate_governance"
        },
        {
            "Title": "Government Considers Six-Month Extension for Bus Manufacturers to Import Motors with Rare Earth Materials",
            "Summary": "The government may provide bus manufacturers, including Olectra Greentech, with a six-month extension to import fully assembled motors containing rare earth materials. This potential extension would affect the bus manufacturing sector's import timeline for these specialized motor components.",
            "Sentiment": "positive",
            "PublishDate": 1757993476533,
            "Source": "sectoral"
        },
        {
            "Title": "Rajesh Power Services Secures ₹143 Crore Order; BYD Plans India Expansion",
            "Summary": "Rajesh Power Services has secured an order worth ₹143 crores. Meanwhile, Chinese electric vehicle manufacturer BYD is planning to expand its operations into India, with improved diplomatic relations between the countries creating opportunities for the Chinese EV company's entry into the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1757488482308,
            "Source": "order&deals"
        },
        {
            "Title": "Delhi CM Proposes Electric School Buses To Reduce Pollution",
            "Summary": "Delhi's Chief Minister has proposed the use of electric school buses as a measure to reduce pollution in the city. This proposal relates to Olectra Greentech, which operates in the electric vehicle sector.",
            "Sentiment": "positive",
            "PublishDate": 1756199297009,
            "Source": "stock"
        },
        {
            "Title": "Olectra Greentech Sets Book Closure Dates and Proposes Final Dividend for FY2025",
            "Summary": "Olectra Greentech Limited announced book closure from September 21-27, 2025, with record date of September 20, 2025, for its 25th Annual General Meeting. The company proposed a final dividend of 10% (Rs. 0.40 per equity share of Rs. 4 face value) for the financial year ended March 31, 2025, subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1756131960669,
            "Source": "corporate_action"
        },
        {
            "Title": "Olectra Greentech Plans to Participate in PM E-Drive Tender Worth ₹10,900 Crore",
            "Summary": "Olectra Greentech announced plans to enter the PM E-Drive tender for 10,900 buses. The tender is valued at approximately ₹10,900 crore. The company is positioning itself to participate in this government initiative for electric buses.",
            "Sentiment": "positive",
            "PublishDate": 1755142405641,
            "Source": "stock"
        },
        {
            "Title": "Olectra Greentech Targets 2,000 Bus Deliveries in FY26 with 12% Long-Term EBITDA Margin",
            "Summary": "Olectra Greentech expects its long-term EBITDA margin to be around 12%, though margins may decline as production scales up. The company aims for 35-40% growth in its insulator segment compared to last year's Rs 180 crore revenue. For FY26, the company targets 2,000 bus deliveries. Q2 deliveries are expected to more than double from Q1's 161 units, with the second half of the year forecasted as the peak delivery period.",
            "Sentiment": "positive",
            "PublishDate": 1755142044346,
            "Source": "stock"
        },
        {
            "Title": "Olectra Greentech Reports Q1 FY26 Results with 5.7% Revenue Growth in EV Division",
            "Summary": "Olectra Greentech Limited submitted its quarterly results presentation showing consolidated revenue of INR 347.22 crores for Q1 FY26, up 10.6% year-over-year from INR 313.94 crores. The EV division generated revenue of INR 292.24 crores, a 5.7% increase from the previous year, while selling 161 vehicles compared to 156 in Q1 FY25. The insulator division showed strong performance with revenue of INR 54.98 crores, up 46.6% year-over-year, and EBITDA margin improving to 34.6%. Consolidated EBITDA was INR 56.94 crores with a margin of 16.4%. The company reported profit after tax of INR 26.03 crores for the quarter. Olectra has over 2,800 electric vehicles on Indian roads, an order book of 10,000+ units, and operates a manufacturing facility with capacity of 5,000 units per year, scalable to 10,000 units.",
            "Sentiment": "positive",
            "PublishDate": 1755081245775,
            "Source": "earnings"
        },
        {
            "Title": "Olectra Greentech Reports 11% Revenue Growth in Q1 FY2026 Results",
            "Summary": "Olectra Greentech Limited reported its Q1 FY2026 financial results showing growth across key metrics. On a standalone basis, revenue from operations increased 11.0% year-over-year to ₹337.60 crores, while net profit after tax grew 8.0% to ₹22.39 crores. EBITDA rose 9.4% to ₹49.22 crores and earnings per share improved to ₹2.73 from ₹2.53. Consolidated results showed similar trends with revenue from operations growing 10.6% to ₹347.22 crores and net profit increasing 7.3% to ₹26.03 crores. The company operates two main segments: the E-vehicle Division generated ₹282.62 crores in standalone revenue with ₹22.98 crores profit before tax and interest, while the Insulator Division contributed ₹54.98 crores in revenue with ₹18.19 crores profit before tax and interest. The company manufactures composite polymer insulators and electric vehicles including e-buses and e-trucks, and has subsidiaries, joint ventures and associates primarily in the electric vehicle transportation sector.",
            "Sentiment": "positive",
            "PublishDate": 1754746453336,
            "Source": "earnings"
        },
        {
            "Title": "Olectra Greentech Increases Stake in Evey Trans (Mah) Pvt Ltd",
            "Summary": "Olectra Greentech has purchased additional shares to maintain a 26% ownership in Evey Trans (Mah) Pvt Ltd. The company has taken this action to preserve its existing stake in the subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1752238194000,
            "Source": "default"
        },
        {
            "Title": "Centre Releases Tender for 10,900 Electric Buses, Bengaluru Gets Largest Allocation",
            "Summary": "The Indian government has issued a tender for 10,900 electric buses. Bengaluru has been allocated the highest number of buses among the cities included in this initiative. Olectra Greentech, an electric vehicle manufacturer, is mentioned in connection with this news.",
            "Sentiment": "positive",
            "PublishDate": 1751435773000,
            "Source": "default"
        },
        {
            "Title": "Olectra Greentech: Chairman KV Pradeep Resigns Amid Order Challenges",
            "Summary": "Olectra Greentech's Chairman and MD KV Pradeep resigned citing personal reasons. The company faced recent order cancellations but saw reinstatement of a major contract with Maharashtra. Telangana reduced an order for intercity buses, resulting in revenue loss. Maharashtra reinstated a Rs 9,000 crore contract for 5,150 e-buses with a new delivery schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1749460319000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Olectra Greentech Chairman and MD K.V. Pradeep Resigns",
            "Summary": "K.V. Pradeep, the Chairman and Managing Director of Olectra Greentech, has submitted his resignation. The effective date of his departure has not been disclosed and will be announced later.",
            "Sentiment": "negative",
            "PublishDate": 1749459978000,
            "Source": "default"
        },
        {
            "Title": "Olectra Greentech: Order Cancellations and Delivery Challenges Signal Uncertain Outlook",
            "Summary": "Olectra Greentech faces significant order cancellations and delivery challenges. Telangana reduced an order from 50 to 10 buses, causing a Rs 70 crore revenue loss. Maharashtra reinstated a previously cancelled Rs 9,000 crore contract with a new delivery schedule. The company's sales guidance for FY2025 was repeatedly revised downward, settling at 972 buses against an initial 1,500-2,000 projection. Manufacturing capacity constraints and supply issues contribute to delivery delays, with current capacity at 1,200 units annually against a 10,224 bus order book.",
            "Sentiment": "negative",
            "PublishDate": 1749085103000,
            "Source": "normal_news"
        },
        {
            "Title": "Olectra Greentech: Maharashtra Reinstates 5,150 Electric Bus Order with New Delivery Schedule",
            "Summary": "Maharashtra government has reinstated its order of 5,150 electric buses from Olectra Greentech Ltd. under a new delivery schedule. The company must deliver 620 buses in 2025, 2,100 in 2026, and 2,210 in 2027. This decision comes after initial plans to terminate the contract due to delivery delays.",
            "Sentiment": "positive",
            "PublishDate": 1748836839000,
            "Source": "order&deals"
        },
        {
            "Title": "Olectra Greentech: Telangana Cancels Partial Electric Bus Order",
            "Summary": "Telangana State Road Transport Corporation (TSRTC) has withdrawn an order for 40 out of 50 intercity electric buses from Olectra Greentech Ltd. Only 10 buses were delivered by May 2023. The company states this reduction will not significantly impact their business due to a large existing order book.",
            "Sentiment": "neutral",
            "PublishDate": 1748701900000,
            "Source": "order&deals"
        },
        {
            "Title": "Olectra Greentech: Clarifies Status of Rs 10,000 Crore E-Bus Order",
            "Summary": "Olectra Greentech issued a clarification regarding media reports of a cancelled Rs 10,000 crore electric bus order from MSRTC. The company states that the contract execution is still in process, and no cancellation communication has been received by the executing SPV.",
            "Sentiment": "neutral",
            "PublishDate": 1748404123000,
            "Source": "normal_news"
        },
        {
            "Title": "Olectra Green Clarifies No Cancellation of Maharashtra Contract",
            "Summary": "Olectra Green has issued a statement addressing recent media reports. The company clarifies that it has not received any cancellation order as reported in the media. Furthermore, Olectra Green states that the execution of the Maharashtra contract is currently in process.",
            "Sentiment": "neutral",
            "PublishDate": 1748331719000,
            "Source": "default"
        },
        {
            "Title": "Olectra Greentech Reports Q4 Net Profit and Revenue Growth",
            "Summary": "Olectra Greentech announced its Q4 consolidated financial results. The company's net profit increased to 210 million rupees, up from 137.1 million rupees year-over-year and 463 million rupees quarter-over-quarter. Revenue for Q4 rose to 4.5 billion rupees, compared to 2.89 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748304312000,
            "Source": "default"
        },
        {
            "Title": "Olectra Greentech: Maharashtra Cancels E-Bus Order Over Delivery Delays",
            "Summary": "Maharashtra's Transport Minister has directed officials to cancel a tender order for 5,150 electric buses awarded to Olectra Greentech due to delivery failures. The company missed a revised deadline to supply 1,000 buses by May 22. This order was valued at nearly ₹10,000 crore with a 12-year contract period. Olectra has not made any official announcement regarding the cancellation.",
            "Sentiment": "negative",
            "PublishDate": 1748304011000,
            "Source": "order&deals"
        },
        {
            "Title": "Olectra Greentech Reports Q4 Financial Results",
            "Summary": "Olectra Greentech has announced its Q4 financial results. The company's EBITDA increased to 565 million rupees from 344.6 million rupees year-over-year. The EBITDA margin improved to 12.59% from 11.93% in the same period. Consolidated net profit rose to 210 million rupees from 137.1 million rupees year-over-year, but decreased from 463 million rupees quarter-over-quarter. Revenue for Q4 grew to 4.5 billion rupees from 2.89 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748267835000,
            "Source": "result"
        },
        {
            "Title": "Centre to Provide Electric Buses to Cities Under PM's E-Drive Scheme",
            "Summary": "The Indian government plans to supply electric buses to several cities as part of the Prime Minister's E-Drive scheme. Bengaluru is set to receive approximately 4,500 buses, while Hyderabad and Delhi will each get over 2,000 buses.",
            "Sentiment": "positive",
            "PublishDate": 1747909784000,
            "Source": "default"
        },
        {
            "Title": "Government Launches PM E-Drive Scheme for Electric Buses",
            "Summary": "The Indian government has launched the PM E-Drive Scheme in September 2024, with an outlay of Rs 10,900 crore until March 2026. The scheme aims to support 14,028 e-buses with a subsidy outlay of Rs 4,391 crore. Additionally, the Union government plans to launch a tender for procuring 10,000 electric buses for major cities including Bengaluru, Chennai, Hyderabad, Pune, Mumbai, Surat, Ahmedabad, and New Delhi.",
            "Sentiment": "positive",
            "PublishDate": 1744775280000,
            "Source": "default"
        },
        {
            "Title": "Olectra Greentech Secures 4.24 Billion Rupee Contract for Electric Buses",
            "Summary": "Olectra Greentech has received a Letter of Award (LOA) from Himachal Road Transport Corporation (HRTC) for the supply and maintenance of 297 electric buses. The contract is valued at 4.24 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744330055000,
            "Source": "order&deals"
        },
        {
            "Title": "Olectra Greentech Secures 4.24 Billion Rupee Contract for Electric Buses",
            "Summary": "Olectra Greentech has been awarded a contract by Himachal Road Transport Corporation (HRTC) for the supply and maintenance of 297 electric buses. The contract is valued at 4.24 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744206191000,
            "Source": "order&deals"
        },
        {
            "Title": "Olectra Greentech Sets Ambitious Targets for Current Quarter and Financial Year",
            "Summary": "Olectra Greentech has announced a reverse target of 1,200 units for the current quarter and full year. The company anticipates significant growth in both consolidated revenue and profitability for the current financial year, as stated during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1738380871000,
            "Source": "earnings"
        },
        {
            "Title": "Olectra Greentech Targets 400 EVs in Current Quarter, Expects Substantial Growth",
            "Summary": "Olectra Greentech has announced its expectation to meet the target of 400 electric vehicles (EVs) in the current quarter. The company aims to surpass its Q4 record with all previous quarter numbers. Additionally, Olectra Greentech anticipates substantial growth in production volume and revenue, which is expected to ensure sustained value for all stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1738380823000,
            "Source": "corporate_action"
        },
        {
            "Title": "Olectra Greentech Announces Ambitious Production Targets",
            "Summary": "Olectra Greentech has set ambitious production targets for the coming years. The company aims to produce 1,200 units in 2024-25 and 2,500 units in 2025-26. To achieve these goals, Olectra plans to increase its installed capacity to 5,000 units.",
            "Sentiment": "positive",
            "PublishDate": 1738380723000,
            "Source": "corporate_action"
        },
        {
            "Title": "Olectra Greentech Reports Strong Q3 Financial Performance",
            "Summary": "Olectra Greentech has announced its Q3 consolidated financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit reached 466 million rupees, up from 271 million rupees in the same quarter last year and 477 million rupees in the previous quarter. Revenue also saw a substantial increase, rising to 5.15 billion rupees from 3.43 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738197212000,
            "Source": "earnings"
        },
        {
            "Title": "Olectra Greentech Reports Strong Q3 Financial Performance",
            "Summary": "Olectra Greentech has announced its Q3 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit reached 466 million rupees, up from 271 million rupees in the same quarter last year and 477 million rupees in the previous quarter. Revenue also saw a substantial increase, rising to 5.15 billion rupees from 3.43 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738158593000,
            "Source": "earnings"
        },
        {
            "Title": "Olectra Greentech to Consider Q3 Results on January 29",
            "Summary": "Olectra Greentech has announced that it will consider its third quarter (Q3) financial results on January 29. This meeting is likely to review and potentially approve the company's performance for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737726201000,
            "Source": "result"
        },
        {
            "Title": "Olectra Greentech Signs MOU with Maharashtra Government for Automotive and EV Sector",
            "Summary": "Olectra Greentech has entered into a Memorandum of Understanding (MOU) with the Government of Maharashtra, valued at Rs 3,000 crore. The agreement focuses on investments in the automotive and electric vehicle (EV) sectors within the state. This strategic partnership signifies Olectra Greentech's commitment to expanding its presence in Maharashtra's growing EV market and contributing to the state's automotive industry development.",
            "Sentiment": "positive",
            "PublishDate": 1737517029000,
            "Source": "corporate_action"
        }
    ]
}