{
    "Symbol": "OMAXE",
    "ISIN": "INE800H01010",
    "News": [
        {
            "Title": "Omaxe Allots ₹5 Crore NCDs in Second Tranche",
            "Summary": "Omaxe Limited allotted 50 unrated senior secured non-convertible debentures worth ₹5 crore on private placement basis, offering 12% IRR with project-backed security structure.",
            "Sentiment": "neutral",
            "PublishDate": 1770646926867,
            "Source": "co_actions_results"
        },
        {
            "Title": "Omaxe Gets RERA Approval for Bathinda Project",
            "Summary": "Omaxe Limited receives RERA approval for 'Natures Home' project in Bathinda, Punjab, valid until September 30, 2030, enhancing buyer confidence and project credibility.",
            "Sentiment": "positive",
            "PublishDate": 1770283274144,
            "Source": "stocks"
        },
        {
            "Title": "Omaxe Board Meeting Set for February 6, 2026",
            "Summary": "Omaxe Limited has scheduled its Board of Directors meeting for February 6, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769784002441,
            "Source": "co_actions_results"
        },
        {
            "Title": "Omaxe Subsidiary Gets RERA Nod for New Ludhiana Project",
            "Summary": "Omaxe Limited's step-down subsidiary Estatelance Developers receives RERA registration for Omaxe New Ludhiana residential and commercial plotted project, enabling sales and marketing activities.",
            "Sentiment": "positive",
            "PublishDate": 1768918442812,
            "Source": "stocks"
        },
        {
            "Title": "Omaxe invests ₹500 cr in Ludhiana mixed-use project",
            "Summary": "Omaxe announces ₹500-crore investment for Omaxe Chowk, a mixed-use high-street retail and luxury residential project in Ludhiana, scheduled for delivery by June 2030.",
            "Sentiment": "positive",
            "PublishDate": 1768310809675,
            "Source": "stocks"
        },
        {
            "Title": "Omaxe stock surges 14% on ₹500 Cr Ludhiana project",
            "Summary": "Omaxe Limited shares jumped nearly 14% after announcing a ₹500 crore mixed-use development project called Omaxe Chowk in Ludhiana's Ghumar Mandi area, combining retail, residential and commercial spaces.",
            "Sentiment": "positive",
            "PublishDate": 1768296579379,
            "Source": "stocks"
        },
        {
            "Title": "Omaxe Shares Surge 15% on ₹500 Crore Investment Plan",
            "Summary": "Real estate developer Omaxe's shares jumped over 15% despite weak market trends after announcing plans to invest ₹500 crore in a new real estate project through an exchange filing.",
            "Sentiment": "positive",
            "PublishDate": 1768295088158,
            "Source": "stocks"
        },
        {
            "Title": "Omaxe Invests ₹500 Crore in Ludhiana Mixed-Use Project",
            "Summary": "Omaxe announces major investment of ₹500 crores for OMAXE Chowk, a 5.25-acre mixed-use development in Ludhiana featuring retail, residential, and entertainment facilities, scheduled for completion by June 2030.",
            "Sentiment": "positive",
            "PublishDate": 1768281972002,
            "Source": "stocks"
        },
        {
            "Title": "Omaxe: Guild Builders revokes pledge on 6.8 cr shares",
            "Summary": "Guild Builders Private Limited, the holding company of Omaxe Limited, has revoked pledge on 68,00,000 equity shares representing 3.72% of total shareholding, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767091751628,
            "Source": "co_actions_results"
        },
        {
            "Title": "Omaxe President-Corporate Accounts Manoj Kumar Dua Resigns Due to Personal Reasons",
            "Summary": "Manoj Kumar Dua resigned from his position as President-Corporate Accounts (Senior Management Personnel) at Omaxe Limited, effective from the close of business hours on December 10, 2025, citing personal reasons. The resignation affects the company's senior management structure, with Dua serving a one-month notice period as per his employment contract.",
            "Sentiment": "neutral",
            "PublishDate": 1765353551171,
            "Source": "corporate_governance"
        },
        {
            "Title": "Omaxe Fully Repays ₹700 Crore Debt to Samman Capital Ahead of Schedule",
            "Summary": "Omaxe has successfully repaid its entire ₹700 crore debt exposure to Samman Capital (formerly Indiabulls Housing Finance) ahead of schedule using project cash flows. The early repayment strengthens Omaxe's balance sheet and reflects the company's commitment to financial discipline and deleveraging strategy.",
            "Sentiment": "positive",
            "PublishDate": 1765175910367,
            "Source": "stock"
        },
        {
            "Title": "Omaxe Subsidiary Receives RERA Registration for Ludhiana Project",
            "Summary": "Ludhiana Wholesale Market Private Limited, a wholly owned subsidiary of Omaxe Limited, received RERA registration certificate for its Omaxe Chowk project located at Civil Line, Ludhiana, Punjab. The approval enables the subsidiary to sell, transfer, or advertise the project and is expected to strengthen brand value and positively impact Omaxe's consolidated financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1765003844266,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Subsidiary Receives RERA Registration for Commercial Project in Faridabad",
            "Summary": "Omaxe World Street Private Limited, a wholly owned subsidiary of Omaxe Limited, obtained RERA registration certificate for developing London Street Extension commercial colony in Sector-79, Faridabad, Haryana. The approval enables the subsidiary to sell, transfer, and advertise the project, which is expected to strengthen brand value and positively impact the company's consolidated financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1764666615464,
            "Source": "stock"
        },
        {
            "Title": "Omaxe Completes Major Construction Projects and Fully Repays SWAMIH Facility",
            "Summary": "Omaxe Group announced substantial completion of The Lake development in New Chandigarh (28,00,205 sq.ft., 1,402 units) and Omaxe Shiva projects in Prayagraj (5,60,680 sq.ft., 304 units), fully repaying the utilized SWAMIH facility from internal cash flows. The company had received ₹168.80 crore for Chandigarh and ₹60.40 crore for Prayagraj projects, demonstrating strong operational performance and financial discipline through timely project execution and debt repayment.",
            "Sentiment": "positive",
            "PublishDate": 1764657033495,
            "Source": "stock"
        },
        {
            "Title": "Omaxe to Acquire 40% Stake in Aquarise Developers, Making it Associate Company",
            "Summary": "Omaxe announced its plan to acquire a 40% stake in Aquarise Developers Pvt Ltd through this strategic investment. The acquisition will result in Aquarise Developers becoming an associate company of Omaxe, expanding the company's business portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1764595057048,
            "Source": "order&deals"
        },
        {
            "Title": "Omaxe Completes Acquisition of Two Real Estate Companies",
            "Summary": "Omaxe Limited has completed the acquisition of 100% equity shareholding in Next10 Realbuild Private Limited and Next10 Land Developers Private Limited. The completion follows the company's earlier disclosure and maintains all previously provided information without changes.",
            "Sentiment": "neutral",
            "PublishDate": 1763191937712,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Reports Widening Losses with Rs 352 Crore Net Loss in H1 FY26",
            "Summary": "Omaxe Limited posted a consolidated net loss of Rs 352.19 crores for the half year ended September 30, 2025, compared to Rs 386.46 crores loss in the same period last year, with quarterly revenue from operations at Rs 298.03 crores. The real estate company faces ongoing regulatory challenges including SEBI proceedings and income tax demands, while its step-subsidiary issued Rs 190 crore NCDs during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763138073135,
            "Source": "earnings"
        },
        {
            "Title": "Omaxe Limited Acquires 100% Stake in Two Real Estate Companies",
            "Summary": "Omaxe Limited has agreed to acquire 100% equity shareholding of Next10 Realbuild Private Limited and Next10 Land Developers Private Limited, making them wholly owned subsidiaries. The acquisition involves purchasing 10,000 equity shares of each company at Rs. 10.10 per share for Next10 Realbuild (total Rs. 1,01,000) and Rs. 10.13 per share for Next10 Land Developers (total Rs. 1,01,300). Both target companies are engaged in real estate business and were incorporated in July 2021. The acquisition is a related party transaction as 99% shareholding in both companies is held by Rohtas Goel, Non-Executive Chairman Promoter of Omaxe Limited. The transactions are being conducted at arm's length price through cash consideration via banking channels. The acquisitions are expected to be completed by November 19, 2025, and no governmental or regulatory approvals are required.",
            "Sentiment": "neutral",
            "PublishDate": 1762997992229,
            "Source": "corporate_action"
        },
        {
            "Title": "OMAXE Transfers Full Ownership of Colors Real Estate to Subsidiary",
            "Summary": "OMAXE has transferred complete ownership of Colors Real Estate Pvt. Ltd. to its subsidiary OMAXE World Street Pvt. Ltd. This corporate restructuring makes Colors Real Estate a step-down subsidiary within OMAXE's organizational structure.",
            "Sentiment": "neutral",
            "PublishDate": 1761745570190,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Subsidiary Receives RERA Registration for 'The Nest' Residential Project in Lucknow",
            "Summary": "Omaxe Garv Buildtech Private Limited, a wholly-owned subsidiary of Omaxe Limited, has obtained RERA Registration Certificate for its residential project 'The Nest' located at Sarojini Nagar, Lucknow, Uttar Pradesh. The registration number UPRERAPRJ845286/10/2025 was issued by the Uttar Pradesh Real Estate Regulatory Authority. The project is scheduled to launch on October 15, 2025, and targets both domestic and international markets. The RERA registration is valid until August 31, 2027, unless extended. The approval enables the subsidiary to sell, transfer, or advertise the project and is expected to strengthen brand value and positively impact the consolidated financial performance of Omaxe Limited.",
            "Sentiment": "positive",
            "PublishDate": 1760432636920,
            "Source": "stock"
        },
        {
            "Title": "Omaxe Receives RERA Registration for Gardenia Floors Phase 2 Project in New Chandigarh",
            "Summary": "Omaxe has obtained RERA registration for its 'Gardenia Floors Phase 2' project located in New Chandigarh. The registration is valid until December 11, 2029, allowing the company to proceed with the residential development project.",
            "Sentiment": "positive",
            "PublishDate": 1759829346619,
            "Source": "stock"
        },
        {
            "Title": "Omaxe Partners with IHCL to Develop India's First Stadium-Hotel Project",
            "Summary": "Omaxe Ltd has partnered with The Indian Hotels Company Limited (IHCL) to develop India's first stadium-hotel at The Omaxe State in Dwarka, Delhi. The project features a 158-key Gateway hotel with 40 stadium-view suites inside a 30,000-seat international cricket-cum-football stadium and 108 additional rooms in an adjoining club building. IHCL will manage a 250,000 sq. ft. members-only club with dining, wellness, and sports facilities. The 50.4-acre development is being built under a PPP model with Delhi Development Authority and includes a stadium meeting ICC and FIFA standards. The project is expected to generate ₹4,200 crore in lifecycle revenue, target completion by 2027, and serve a catchment population of over 30 lakh within 10 km radius.",
            "Sentiment": "positive",
            "PublishDate": 1758633068463,
            "Source": "order&deals"
        },
        {
            "Title": "GST Rate Cuts on Construction Materials Expected to Reduce Housing Costs by 2-4%",
            "Summary": "GST rate cuts on cement (from 28% to 18%) and construction materials like marble and granite (from 12% to 5%) are expected to reduce overall construction costs by 2-4%. Mohit Goel, Managing Director of Omaxe Ltd, states that material costs typically account for 50-60% of total construction expenses. The cost savings will flow through gradually over one to two quarters as new tenders are issued and fresh material orders are placed. Affordable and mid-market housing segments are expected to benefit most due to tight margins and higher material cost sensitivity. The timing coincides with festive season, which traditionally drives a 15-20% increase in housing enquiries. New GST rates are expected to reflect in tender negotiations within 30-90 days, and visible market pricing adjustments should emerge over the next three to nine months. The rate cuts, combined with stable interest rates, are expected to encourage new project launches and accelerate housing supply in key urban markets.",
            "Sentiment": "positive",
            "PublishDate": 1757389804184,
            "Source": "stock"
        },
        {
            "Title": "Omaxe Subsidiary Allots ₹19 Crore Non-Convertible Debentures to OCM India Fund",
            "Summary": "Bhanu Infrabuild Private Limited, a wholly owned subsidiary of Omaxe Limited, has allotted 1,900 Non-Convertible Debentures worth ₹19 crore to OCM India Opportunities XII Alternate Investment Fund - Scheme I. The debentures have a face value of ₹1 lakh each and were issued on a private placement basis. The debentures are senior, secured, rated, listed, redeemable, and guaranteed.",
            "Sentiment": "neutral",
            "PublishDate": 1756385392187,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Reports Rs 186 Crore Net Loss in June Quarter on Lower Income",
            "Summary": "Omaxe Ltd reported a consolidated net loss of Rs 185.77 crore in the first quarter, compared to a net loss of Rs 146.98 crore in the same period last year. Total income declined to Rs 298.03 crore from Rs 385.23 crore year-on-year. The real estate company operates in 30 cities across eight states in North and Central India and has delivered over 135 million sq ft since inception. Omaxe recently acquired 450-acre land in Indore for Rs 1,200 crore township development and raised Rs 500 crore from Oaktree Capital Management for existing projects and future growth.",
            "Sentiment": "negative",
            "PublishDate": 1755514710001,
            "Source": "earnings"
        },
        {
            "Title": "Omaxe Limited Reports Leadership Changes and Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Omaxe Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue from operations of Rs 119.46 crores and a net loss of Rs 35.83 crores. The company announced several key leadership changes: Mr. Atul Banshal was appointed as Chief Financial Officer effective August 14, 2025, replacing Mr. Manoj Kumar Dua who resigned from the CFO position but will continue as President-Corporate Accounts. The Board also approved the re-appointment of Mr. Aroon Kumar Aggarwal as Non-Executive & Independent Director for a second five-year term from May 27, 2026, and Mr. Vinit Goyal as Whole-Time Director for five years from April 12, 2026, both subject to shareholder approval. Additionally, DMK Associates was appointed as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30. The company continues to face ongoing legal proceedings with SEBI and income tax authorities, though management believes these will not impact financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1755100101844,
            "Source": "earnings"
        },
        {
            "Title": "Omaxe Reports Wider Net Loss and Revenue Decline in Q1 Results",
            "Summary": "Omaxe reported a consolidated net loss of 1.86 billion rupees in Q1, compared to a loss of 1.47 billion rupees in the same period last year. The company's revenue decreased to 2.8 billion rupees from 3.4 billion rupees year-over-year. Both metrics show deterioration compared to the previous year's performance.",
            "Sentiment": "negative",
            "PublishDate": 1755098053169,
            "Source": "earnings"
        },
        {
            "Title": "Omaxe Schedules Board Meeting for August 13 to Approve Quarterly Financial Results",
            "Summary": "Omaxe Limited has scheduled a Board of Directors meeting for August 13, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company announced that the trading window for its equity shares will remain closed from July 1, 2025, to August 15, 2025, in accordance with insider trading regulations and the company's code of conduct for prevention of insider trading.",
            "Sentiment": "neutral",
            "PublishDate": 1754492220155,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe CFO Manoj Kumar Dua Resigns, Transitions to President-Corporate Accounts Role",
            "Summary": "Omaxe Limited announced that Manoj Kumar Dua has resigned from his position as Chief Financial Officer and Key Managerial Personnel, effective August 13, 2025. Dua cited increased responsibilities within the company as the reason for stepping down from the CFO role. He will continue serving the company as President-Corporate Accounts. Dua confirmed there are no material reasons for his resignation beyond those stated in his resignation letter. The company is currently searching for a suitable replacement for the CFO position.",
            "Sentiment": "neutral",
            "PublishDate": 1754486536841,
            "Source": "corporate_governance"
        },
        {
            "Title": "Omaxe Completes Sale of Landlord Developers Pvt Ltd",
            "Summary": "Omaxe has completed the sale of Landlord Developers Pvt Ltd. The transaction represents a divestment by the real estate company of its subsidiary entity.",
            "Sentiment": "neutral",
            "PublishDate": 1754402650032,
            "Source": "order&deals"
        },
        {
            "Title": "Omaxe Limited Completes Sale of Wholly Owned Subsidiary Landlord Developers Private Limited",
            "Summary": "Omaxe Limited has completed the sale of its 100% equity shareholding in wholly owned subsidiary Landlord Developers Private Limited (LDPL). The transaction was completed on August 5, 2025, on the same terms and conditions as previously disclosed. As a result of this sale, LDPL has ceased to be a subsidiary of Omaxe Limited. The company had previously made intimations regarding this transaction on March 28, 2025, June 2, 2025, and July 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754398337912,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Limited Shareholders Approve Both Resolutions in Postal Ballot with Over 99% Majority",
            "Summary": "Omaxe Limited announced that shareholders approved both resolutions through postal ballot with requisite majority. The voting took place from July 04, 2025 to August 02, 2025 via remote e-voting. Resolution 1 regarding regularization of appointment of Mr. Satbir Singh (DIN: 06887978) as Non-Executive & Independent Director received 99.9988% votes in favor with 133,734,883 votes supporting and 1,571 votes against. Resolution 2 for regularization of appointment of Mr. Gurnam Singh (DIN: 08357396) as Non-Executive & Independent Director also received 99.9988% approval with 133,734,858 votes in favor and 1,596 votes against. The scrutinizer's report was prepared by Neeraj Jain & Associates, and voting results were submitted to stock exchanges. The postal ballot notice was dispatched on July 03, 2025 to eligible members with registered email addresses as of the June 30, 2025 cut-off date.",
            "Sentiment": "positive",
            "PublishDate": 1754317188447,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Extends Subsidiary Sale Completion Date to August 14, 2025",
            "Summary": "Omaxe Limited has extended the expected completion date for the sale of its 100% equity shareholding in wholly owned subsidiary Landlord Developers Private Limited to August 14, 2025. The company stated there is no change in earlier disclosures except for the timeline extension. This follows previous communications dated March 28, 2025 and June 02, 2025 regarding the divestment.",
            "Sentiment": "neutral",
            "PublishDate": 1753967675598,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Group Secures ₹500 Crore Funding from Oaktree Capital for Project Acceleration",
            "Summary": "Omaxe Group announced it has secured ₹500 crore in funding from funds managed by Oaktree Capital Management L.P. The capital will be used to accelerate project construction, improve delivery timelines, and strengthen expansion plans across key Indian markets. The investment will support ongoing developments in New Chandigarh, Lucknow, Ludhiana, and Faridabad, along with flagship projects like The Omaxe State in Dwarka, a new integrated township in Amritsar, and an upcoming project in Indore. Omaxe has repaid ₹1,285 crore in principal to lenders, reducing its net debt to ₹300 crore and improving financial flexibility. The company reported property sales exceeding ₹3,000 crore in FY25. Omaxe has delivered more than 140 million square feet of projects across 31 cities in eight states by March 2025. Oaktree Capital manages over $203 billion in assets globally as of March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753707681975,
            "Source": "stock"
        },
        {
            "Title": "Omaxe Group Secures Rs. 500 Crore Funding from Oaktree",
            "Summary": "Omaxe Group has secured Rs. 500 crore in funding from Oaktree. The funding arrangement represents a significant capital infusion for the real estate company.",
            "Sentiment": "positive",
            "PublishDate": 1753703214614,
            "Source": "order&deals"
        },
        {
            "Title": "Omaxe Subsidiary Raises Rs. 431 Crore Through Private Placement of Debentures",
            "Summary": "Omaxe New Chandigarh Developers Private Limited, a wholly owned subsidiary of Omaxe Limited, raised Rs. 431 crore through the issuance of 43,100 unlisted, senior, secured, redeemable non-convertible debentures. Each debenture has a face value of Rs. 1 lakh and was issued through private placement to OCM India Opportunities XII Alternate Investment Fund Scheme I. The fundraising was completed through the issuance and allotment of these NCDs.",
            "Sentiment": "positive",
            "PublishDate": 1753673703222,
            "Source": "stock"
        },
        {
            "Title": "Omaxe Allocates ₹39.8 Crore from ₹199.4 Crore NCD Issue",
            "Summary": "Omaxe has allocated ₹39.8 crore from a total non-convertible debenture (NCD) issue of ₹199.4 crore. This allocation represents approximately 20% of the total NCD issue amount.",
            "Sentiment": "neutral",
            "PublishDate": 1752675063000,
            "Source": "default"
        },
        {
            "Title": "Omaxe Ltd: Announces ₹1,200 Crore Investment in Indore Township",
            "Summary": "Omaxe Ltd plans to develop a 450-acre integrated township in Indore, Madhya Pradesh, with an investment of ₹1,200 crore. The project is expected to generate revenues of ₹2,500 crore over the next three years. The township will include residential plots, commercial spaces, and public infrastructure along Indore's Super Corridor.",
            "Sentiment": "positive",
            "PublishDate": 1751967727000,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Announces ₹1,200 Crore Investment in 450-Acre Indore Township",
            "Summary": "Omaxe has revealed plans for significant expansion in Madhya Pradesh, focusing on a 450-acre integrated township in Indore. The company intends to invest ₹1,200 crore in this project. Omaxe's current revenue stands at ₹15,000 crore, and they project a revenue increase to ₹2,500 crore over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1751956511000,
            "Source": "default"
        },
        {
            "Title": "Omaxe Subsidiary Approves Plan to Issue Debentures Worth Up to 190 Million Rupees",
            "Summary": "A subsidiary of Omaxe has approved a plan to issue debentures valued at up to 190 million rupees. This decision represents a significant financial move for the company, potentially aimed at raising capital or restructuring debt. The specific details about the type of debentures, their terms, or the intended use of the funds are not provided in the given information.",
            "Sentiment": "neutral",
            "PublishDate": 1751892539000,
            "Source": "default"
        },
        {
            "Title": "Garv Buildtech Receives RERA Approval for Omaxe Metro City Phase 10",
            "Summary": "Garv Buildtech has obtained RERA (Real Estate Regulatory Authority) approval for Phase 10 of Omaxe Metro City project. This indicates progress in the development of the real estate project and compliance with regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1751288477000,
            "Source": "default"
        },
        {
            "Title": "Omaxe Ltd: Invests ₹1,000 Crore in New Amritsar Township",
            "Summary": "Omaxe Ltd announced a ₹1,000 crore investment in a new 260-acre integrated township near the Golden Temple in Amritsar, Punjab. The first phase will develop 127 acres, offering residential plots of various sizes. The project is part of Omaxe's larger ₹10,000 crore investment plan across Northern India.",
            "Sentiment": "positive",
            "PublishDate": 1750061020000,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Extends Sale Completion Date for Landlord Developers",
            "Summary": "Omaxe has announced an extension of the sale completion date for Landlord Developers to July 31, 2025. No further details about the reasons for the extension or the original completion date were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1748874880000,
            "Source": "default"
        },
        {
            "Title": "Omaxe Reports Q4 Financial Results",
            "Summary": "Omaxe has reported its quarterly financial results. The company's consolidated net loss for Q4 is 1.5 billion rupees, compared to a loss of 1.4 billion rupees in the same quarter last year. The loss remains unchanged at 1.5 billion rupees compared to the previous quarter. Q4 revenue stands at 5.4 billion rupees, which is the same as the revenue reported in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748443805000,
            "Source": "result"
        },
        {
            "Title": "Omaxe Approves Fundraising of Up to 1.99 Billion Rupees",
            "Summary": "Omaxe, a company, has approved raising funds of up to 1.99 billion rupees. No further details about the purpose of the fundraising or the method were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747314692000,
            "Source": "default"
        },
        {
            "Title": "Omaxe Subsidiary Granted License for Affordable Housing Project in Haryana",
            "Summary": "Omaxe Forest Spa & Hills Developers Ltd., a subsidiary of Omaxe, has received a license from the Directorate of Town & Country Planning, Haryana. The license allows the company to establish an affordable residential plotted colony under the Deen Dayal Jan Awas Yojna-2016 scheme.",
            "Sentiment": "positive",
            "PublishDate": 1742829735000,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Announces 27 Billion Rupee Investment in Projects",
            "Summary": "Omaxe Limited has disclosed plans to invest approximately 27 billion rupees in various projects. This significant investment indicates the company's commitment to expansion and development in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1741327539000,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe Projects Expected to Generate Over 47 Billion Rupees in Revenue",
            "Summary": "Real estate company Omaxe has announced that its upcoming projects are anticipated to generate revenue exceeding 47 billion rupees. This projection indicates significant potential growth for the company's future business operations.",
            "Sentiment": "positive",
            "PublishDate": 1741327494000,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe to Upgrade Six Bus Terminals in Uttar Pradesh",
            "Summary": "Omaxe, through its subsidiary BeTogether, has announced plans to upgrade six key bus terminals in Uttar Pradesh with modern facilities. This initiative aims to improve public transportation infrastructure in the state.",
            "Sentiment": "positive",
            "PublishDate": 1741327442000,
            "Source": "corporate_action"
        },
        {
            "Title": "Omaxe World Street Receives RERA Certificates for New Commercial Projects",
            "Summary": "Omaxe World Street, a unit of Omaxe Limited, has obtained RERA (Real Estate Regulatory Authority) registration certificates from the Haryana Real Estate Regulatory Authority (HRERA) for two of its new commercial projects. This regulatory approval is a significant step for the company's expansion in the commercial real estate sector in Haryana.",
            "Sentiment": "positive",
            "PublishDate": 1741265219000,
            "Source": "corporate_action"
        }
    ]
}