{
    "Symbol": "OMAXAUTO",
    "ISIN": "INE090B01011",
    "News": [
        {
            "Title": "Omax Autos Internal Auditor Resigns",
            "Summary": "Omax Autos Limited announces resignation of internal auditor M/s. Singhi Chugh & Kumar effective January 14, 2026, as disclosed to stock exchanges under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769523714095,
            "Source": "stocks"
        },
        {
            "Title": "OMAX Autos Q3FY26 Profit Surges 326% to ₹1,222 Lakhs",
            "Summary": "OMAX Autos Limited reported exceptional Q3FY26 results with net profit jumping 326% to ₹1,222.13 lakhs. Revenue grew 32% to ₹12,217.18 lakhs, driven by strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769512235399,
            "Source": "co_actions_results"
        },
        {
            "Title": "Omax Autos Internal Auditor Resigns Effective Jan 14",
            "Summary": "Omax Autos Limited announces resignation of internal auditor M/s. Singh Chugh & Kumar, effective January 14, 2026, with immediate effect from close of business hours.",
            "Sentiment": "neutral",
            "PublishDate": 1768387003587,
            "Source": "stocks"
        },
        {
            "Title": "Omax Autos Penalty Proceedings for 1.26 Billion Rupees Dropped",
            "Summary": "Omax Autos announced that penalty proceedings involving 1.26 billion rupees have been dropped. This development removes a significant financial liability for the company and its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1763596975601,
            "Source": "stock"
        },
        {
            "Title": "Omax Autos Limited Reports Quarterly and Half-Year Financial Results for Period Ended September 30, 2025",
            "Summary": "Omax Autos Limited's Board of Directors approved unaudited standalone financial results for the quarter and half-year ended September 30, 2025. The company, which manufactures sheet metal components and assemblies for various customers within India, reported a profit before tax of ₹1,238.85 lakhs for the half-year period compared to ₹2,571.37 lakhs in the previous year. Total assets stood at ₹47,505.24 lakhs as of September 30, 2025, compared to ₹47,758.57 lakhs as of March 31, 2025. The company's equity share capital remained unchanged at ₹2,138.82 lakhs. Cash and cash equivalents increased to ₹1,939.12 lakhs from ₹1,375.37 lakhs. The results were reviewed by the audit committee and the financial statements comply with Indian Accounting Standards.",
            "Sentiment": "neutral",
            "PublishDate": 1761847387818,
            "Source": "earnings"
        },
        {
            "Title": "Omax Autos Reports Q1 FY26 Results, Recommends Rs 2.5 Final Dividend and Key Leadership Changes",
            "Summary": "Omax Autos Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 9,963.65 lakhs compared to Rs 8,420.18 lakhs in the same quarter last year. The board recommended a final dividend of Rs 2.5 per equity share for FY 2024-25, subject to shareholder approval at the Annual General Meeting scheduled for August 29, 2025. The record date for dividend eligibility is set as August 22, 2025. The company made several key appointments including Ms. Kannu Sharma as Company Secretary and Compliance Officer, and Mr. Sanjeev Kumar as Chief Financial Officer. Mr. Devashish Mehta resigned from his CFO position but continues as Managing Director. The board also approved reappointments of key directors including Mr. Jatender Kumar Mehta as Vice Chairman & Managing Director and Mr. Tavinder Singh as Whole Time Director. Mrs. Sakshi Kaura's designation changed from Managing Director to Non-Executive, Non-Independent Director. The company reappointed M/s ISN & Co. as Cost Auditors for FY 2025-26 and appointed M/s DR Associates as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1755169815082,
            "Source": "earnings"
        },
        {
            "Title": "OMAX AUTOS LIMITED Publishes Quarterly Financial Results for June 2025",
            "Summary": "OMAX AUTOS LIMITED published its unaudited standalone financial results for the quarter ended June 30, 2025. The results were approved by the Board of Directors on July 24, 2025, and published in Hindi and English newspapers on July 26, 2025. The company operates primarily in manufacturing sheet metal components and assemblies for various customers across different geographical segments in India. The Board of Directors has recommended a final dividend of 2.5 rupees per equity share of face value 10 rupees for the year ended March 31, 2025, subject to shareholder approval at the upcoming Annual General Meeting scheduled for August 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753515324477,
            "Source": "earnings"
        },
        {
            "Title": "Omax Autos Board Approves Q1 Results, Declares Rs 2.5 Final Dividend, and Makes Key Leadership Changes",
            "Summary": "Omax Autos Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs 9,963.65 lakhs compared to Rs 8,420.18 lakhs in the same quarter last year. The Board recommended a final dividend of Rs 2.5 per equity share for FY 2024-25, subject to shareholder approval at the Annual General Meeting. Key management changes include the appointment of Ms. Kannu Sharma as Company Secretary and Compliance Officer, and Mr. Sanjeev Kumar as Chief Financial Officer, following the resignation of Mr. Devashish Mehta from the CFO position. The Board also approved several director reappointments, including Mr. Jatender Kumar Mehta as Vice Chairman & Managing Director and Mr. Devashish Mehta as Managing Director, while changing Mrs. Sakshi Kaura's designation from Managing Director to Non-Executive, Non-Independent Director. The record date for dividend eligibility has been set as August 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753356834051,
            "Source": "corporate_action"
        },
        {
            "Title": "Omax Autos Reports Q1 FY26 Results, Announces Rs 2.5 Final Dividend and Key Management Changes",
            "Summary": "Omax Autos Limited announced its quarterly results for the quarter ended June 30, 2025. The company's revenue from operations was Rs 9,963.65 lakhs compared to Rs 8,420.18 lakhs in the same quarter last year. The board recommended a final dividend of Rs 2.5 per equity share for FY 2024-25, subject to shareholder approval at the Annual General Meeting scheduled for August 29, 2025. The record date for dividend eligibility is August 22, 2025. The company made several key management appointments: Ms. Kannu Sharma was appointed as Company Secretary and Compliance Officer, while Mr. Sanjeev Kumar was appointed as Chief Financial Officer following the resignation of Mr. Devashish Mehta from the CFO position. Mr. Devashish Mehta continues as Managing Director. The board also approved reappointments of several directors including Mr. Jatender Kumar Mehta as Vice Chairman & Managing Director and Mr. Tavinder Singh as Whole Time Director. Mrs. Sakshi Kaura's designation was changed from Managing Director to Non-Executive, Non-Independent Director. Additionally, the company reappointed M/s. ISN & Co. as Cost Auditors for FY 2025-26 and appointed M/s. DR Associates as Secretarial Auditors for a five-year term from FY 2025-26 to FY 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1753354951608,
            "Source": "earnings"
        },
        {
            "Title": "Omaxe Invests ₹1000 Crore in New Amritsar Township",
            "Summary": "Omaxe, a real estate company, is expanding its presence in Punjab by investing ₹1000 crore in a new township project in Amritsar. This investment signifies a significant commitment to the region's development and potentially indicates growth opportunities for the company in Punjab's real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1750054421000,
            "Source": "default"
        }
    ]
}