{
    "Symbol": "OMFREIGHT",
    "ISIN": "INE1BZC01019",
    "News": [
        {
            "Title": "Om Freight Forwarders Board Meet on Feb 13, 2026",
            "Summary": "Om Freight Forwarders Limited has scheduled a board meeting for February 13, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770462686647,
            "Source": "co_actions_results"
        },
        {
            "Title": "OM Freight Forwarders Promoter Group Acquires 9 Lakh Equity Shares",
            "Summary": "Three promoter group members of OM Freight Forwarders Limited acquired 9,00,000 equity shares representing 2.67% of the company's share capital through open market transactions. Maya Rahul Joshi acquired 5,00,000 shares, Kejal Harmesh Joshi acquired 3,00,000 shares, and Lachita Kamesh Joshi acquired 1,00,000 shares, increasing their collective shareholding in the freight forwarding company.",
            "Sentiment": "positive",
            "PublishDate": 1763532680249,
            "Source": "corporate_action"
        },
        {
            "Title": "Om Freight Forwarders Reports Strong Q2 Performance with 21% Revenue Growth",
            "Summary": "Om Freight Forwarders Limited posted revenue of INR 1,138.36 million for the quarter ended September 30, 2025, marking growth from INR 944.31 million in the previous quarter, with profit after tax rising to INR 38.75 million. The logistics company's half-year revenue reached INR 2,082.67 million compared to INR 2,502.85 million in the same period last year, demonstrating operational resilience in the third-party logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1763061760581,
            "Source": "earnings"
        },
        {
            "Title": "Om Freight Forwarders Reports 24% Revenue Decline in Q1 FY26, Approves Rs 70 Crore Loan from Promoters",
            "Summary": "Om Freight Forwarders Limited reported quarterly results with revenue from operations declining to Rs 944.31 million compared to Rs 1,233.77 million in the previous quarter. Profit after tax decreased to Rs 70.94 million from Rs 88.84 million in the prior quarter. The company's board approved availment of loans up to Rs 70 crores from three key executives - Chairman and Managing Director Rahul J Joshi, Executive Director Harmesh R Joshi, and Executive Director Kamesh R Joshi for the financial year 2025-2026. The company operates as a Third-Party Logistics Provider and had previously secured a major contract for material handling at various ports in India. Basic earnings per share stood at Rs 6.79 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761661959487,
            "Source": "earnings"
        }
    ]
}