{
    "Symbol": "OMINFRAL",
    "ISIN": "INE239D01028",
    "News": [
        {
            "Title": "Om Infra Q3FY26 Net Profit Surges 64.20% YoY",
            "Summary": "Om Infra Limited reports strong Q3FY26 results with net profit rising 64.20% YoY to ₹607.49 lacs. Revenue from operations reached ₹10,017.68 lacs despite challenges in JJM project funding.",
            "Sentiment": "positive",
            "PublishDate": 1770385076306,
            "Source": "co_actions_results"
        },
        {
            "Title": "Om Infra Reports 44% Revenue Decline in H1FY26, Secures Rs 328 Crore New Orders",
            "Summary": "Om Infra Limited posted consolidated revenue of Rs 228 crores in H1FY26, down 44% from Rs 408 crores in H1FY25, with EBITDA margins dropping to 3% from 8% due to delayed payments in Jal Jeevan Mission projects. The company secured new orders worth Rs 328 crores including a Rs 199 crore hydro-mechanical contract for the 2,880MW Dibang hydropower project and a Rs 129 crore water infrastructure project in Uttar Pradesh.",
            "Sentiment": "negative",
            "PublishDate": 1764235991905,
            "Source": "stock"
        },
        {
            "Title": "Om Infra Limited Reports Quarterly Financial Results with Auditor Qualifications",
            "Summary": "Om Infra Limited announced its standalone and consolidated unaudited financial results for the quarter and half year ended September 30, 2025. The company's board meeting was held on November 10, 2025, where these results were approved. The auditor's review report contains several qualifications including issues with the Nepal branch records being unavailable for audit (involving revenue of Rs. 197.03 lacs), inadequate internal audit policies and financial controls, and unbilled revenue of Rs. 4149.92 lacs without proper project authority approval. The financial statements include results from 9 joint operations consolidated on proportionate basis, with some joint operations reviewed by other auditors. The company operates in engineering, real estate, and road project segments.",
            "Sentiment": "negative",
            "PublishDate": 1762783166912,
            "Source": "earnings"
        },
        {
            "Title": "OM Infra Reports Mixed Q2 Results with 79% Jump in Net Profit Despite Revenue Decline",
            "Summary": "OM Infra announced its Q2 consolidated results showing net profit increased to 70 million rupees from 39 million rupees year-over-year. However, revenue declined significantly to 1.24 billion rupees compared to 2.38 billion rupees in the same period last year. EBITDA dropped to 67 million rupees from 173.5 million rupees year-over-year, while EBITDA margin compressed to 5.42% from 7.28% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762782373077,
            "Source": "earnings"
        },
        {
            "Title": "Om Infra Limited Appoints Kamlesh Kumar Singh as Independent Director for Five-Year Term",
            "Summary": "Om Infra Limited shareholders approved the appointment of Mr. Kamlesh Kumar Singh as a Non-Executive Independent Director at their 53rd Annual General Meeting held on September 29, 2025. The appointment is effective from September 29, 2025, for a five-year term ending September 28, 2030. Singh is a Civil Engineering professional with over 43 years of experience in the power sector, water resources, and infrastructure development. He previously worked in government PSUs including NHPC, NTPC, SJVNL, and UJVNL, holding senior positions such as Chief Engineer and Regional Executive Director. He retired from NTPC as Regional Executive Director in 2021. Singh does not hold directorship in any other listed entities and owns no equity shares in Om Infra Limited.",
            "Sentiment": "positive",
            "PublishDate": 1759321371762,
            "Source": "corporate_governance"
        },
        {
            "Title": "Om Infra Limited Sets September 22, 2025 as Record Date for AGM and Dividend Entitlement",
            "Summary": "Om Infra Limited has announced September 22, 2025 as the record date for its Annual General Meeting and dividend entitlement for the financial year ended March 31, 2025. The company set the same date as the cut-off for e-voting eligibility, with electronic voting available from September 25 to September 28, 2025. The 53rd Annual General Meeting is scheduled for September 29, 2025 at 12:30 PM through video conferencing. If approved at the AGM, the dividend will be paid by October 28, 2025 to eligible shareholders whose names appear in the register of members as of the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1758286115728,
            "Source": "corporate_action"
        },
        {
            "Title": "Om Infra Reports Sharp Decline in Q1 FY26 Performance Due to Delayed Government Payments",
            "Summary": "Om Infra Limited experienced significant financial deterioration in Q1 FY26, with revenue falling 38% to Rs 104 crores and EBITDA turning negative at Rs (1) crore compared to Rs 17 crores in the previous year. The company reported losses at both profit before tax level (Rs 1.4 crores loss vs Rs 13 crores profit) and net profit (Rs 1 crore loss vs Rs 13 crores profit). The decline stems from delayed payments in Jal Jeevan Mission projects and state fund constraints. Despite financial challenges, the company maintains a strong order book of Rs 2,684 crores with a book-to-bill ratio of 3.31x. Recent wins include Rs 129 crores from Uttar Pradesh Jal Nigam and Rs 199 crores for the Dibang hydropower project. Management targets Rs 2,000 crores in order inflow for FY26 and expects the payment situation to improve from the first half of FY26 onwards.",
            "Sentiment": "negative",
            "PublishDate": 1755067889583,
            "Source": "earnings"
        },
        {
            "Title": "OmInfra Limited Reports Mixed Q1 Results with Rs. 326 Crore New Orders",
            "Summary": "OmInfra Limited released its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue of Rs. 99.78 crores and net profit of Rs. 0.99 crores. Consolidated results showed revenue of Rs. 104.34 crores but recorded a net loss of Rs. 0.98 crores. The company secured significant new orders totaling Rs. 326 crores, including a Rs. 199 crore contract for hydro-mechanical components for the 2,880 MW Dibang Hydro Project in Arunachal Pradesh and a Rs. 127 crore water distribution project in Shahjahanpur, Uttar Pradesh. Management expects improved execution in coming quarters from Rajasthan and Uttar Pradesh Jal Jeevan Mission projects. However, auditors raised concerns about unavailable financial records from the Nepal branch affecting Rs. 10.31 crores revenue verification, missing internal audit reports, and unreviewed financial results of three joint ventures with Rs. 1.27 crores total revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1754918539695,
            "Source": "earnings"
        },
        {
            "Title": "OM INFRA Reports Q1 Net Loss of 10M Rupees, Revenue Drops to 1.04B Rupees",
            "Summary": "OM INFRA reported a net loss of 10 million rupees in Q1, compared to a profit of 125 million rupees in the same period last year. The company's revenue declined to 1.04 billion rupees from 1.69 billion rupees year-over-year, representing a significant decrease in both profitability and top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1754917392321,
            "Source": "earnings"
        },
        {
            "Title": "OM Infra Secures 2 Billion Rupee Contract for Dibang Project",
            "Summary": "OM Infra has won a contract worth 2 billion rupees for the 2880 MW Dibang Project. The news briefly mentions the contract value and the project's power generation capacity.",
            "Sentiment": "positive",
            "PublishDate": 1750856625000,
            "Source": "default"
        },
        {
            "Title": "Om Infra Reports Q4 Financial Results",
            "Summary": "Om Infra has released its Q4 financial results. The company reported a net profit of 229 million rupees, compared to 50 million rupees year-over-year and 37 million rupees quarter-over-quarter. Revenue for Q4 was 1.8 billion rupees, down from 2.86 billion rupees in the same quarter last year. The company reported a deferred tax of 165 million rupees. Profit before tax (PBT) for Q4 was 81 million rupees, compared to 164 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748823138000,
            "Source": "default"
        },
        {
            "Title": "OM INFRA Reports Q4 Financial Results",
            "Summary": "OM INFRA has reported its quarterly financial results. The company's Profit Before Tax (PBT) for Q4 was 81 million rupees, down from 164 million rupees in the same quarter last year. EBITDA for Q4 decreased to 9.9 million rupees from 220 million rupees year-over-year. The EBITDA margin fell to 0.54% from 7.7% in the previous year's corresponding quarter. The company also reported a deferred tax of 165 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1748619781000,
            "Source": "result"
        },
        {
            "Title": "OM INFRA Reports Q4 Financial Results",
            "Summary": "OM INFRA has reported its Q4 financial results. The company's net profit for the quarter was 229 million rupees, compared to 50 million rupees year-over-year and 37 million rupees quarter-over-quarter. Revenue for Q4 was 1.8 billion rupees, down from 2.86 billion rupees in the same quarter last year.",
            "Sentiment": "mixed",
            "PublishDate": 1748619673000,
            "Source": "result"
        },
        {
            "Title": "OM Infra Ltd: Shares Surge 8% on ₹129 Crore Water Project Win",
            "Summary": "OM Infra Ltd secured a ₹129 crore water infrastructure project in Uttar Pradesh, to be completed in 24 months. The company's share price jumped over 8% following the announcement. This project is expected to contribute positively to revenue and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1746681235000,
            "Source": "order&deals"
        },
        {
            "Title": "Om Infra Secures 1.29 Billion Rupee Water Project in Uttar Pradesh",
            "Summary": "Om Infra has been awarded a significant water supply infrastructure project worth 1.29 billion rupees by Uttar Pradesh Jal Nigam (Urban) in Shahjahanpur. This project represents a major contract for the company in the water management sector.",
            "Sentiment": "positive",
            "PublishDate": 1746663138000,
            "Source": "default"
        },
        {
            "Title": "OM Infra Secures 1.29 Billion Rupee Water Project in Uttar Pradesh",
            "Summary": "OM Infra has been awarded a significant water supply infrastructure project worth 1.29 billion rupees by Uttar Pradesh Jal Nigam (Urban) in Shahjahanpur. This project aims to improve water supply infrastructure in the region.",
            "Sentiment": "positive",
            "PublishDate": 1746620072000,
            "Source": "default"
        },
        {
            "Title": "OM INFRA Secures Water Infrastructure Projects Worth Rs 448 Crores in Uttar Pradesh",
            "Summary": "OM INFRA has been awarded water infrastructure projects valued at Rs 448 crores in Uttar Pradesh. These projects are likely to contribute to the improvement of water infrastructure in the state.",
            "Sentiment": "positive",
            "PublishDate": 1741180837000,
            "Source": "order&deals"
        },
        {
            "Title": "Om Infra Reports Q3 Financial Results",
            "Summary": "Om Infra has announced its Q3 consolidated financial results. The company reported a net profit of 46 million rupees, which is lower compared to 61 million rupees in the same quarter last year (YoY) but higher than 39 million rupees in the previous quarter (QoQ). The Q3 revenue stood at 1.3 billion rupees, significantly lower than the 2.71 billion rupees reported in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739146366000,
            "Source": "earnings"
        },
        {
            "Title": "OM INFRA Reports Decline in Q3 Financial Performance",
            "Summary": "OM INFRA has reported its Q3 financial results, showing a decrease in both net profit and revenue compared to the previous year. The consolidated net profit for Q3 was 46 million rupees, down from 61 million rupees year-over-year (YoY) and 39 million rupees quarter-over-quarter (QoQ). Revenue for Q3 stood at 1.3 billion rupees, a significant decrease from 2.71 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738937945000,
            "Source": "earnings"
        },
        {
            "Title": "OM INFRA Reports Decline in Q2 EBITDA and Margin",
            "Summary": "OM INFRA has reported a significant decrease in its Q2 EBITDA, which fell to 173 million rupees from 433 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 7.28% from 15.47% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730981865000,
            "Source": "result"
        },
        {
            "Title": "OM INFRA Reports Q2 Financial Results",
            "Summary": "OM INFRA announced its Q2 financial results. The company's consolidated net profit decreased to 39 million rupees, down from 236 million rupees year-over-year and 125 million rupees quarter-over-quarter. Revenue for Q2 was 2.4 billion rupees, a decrease from 2.8 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730981726000,
            "Source": "result"
        },
        {
            "Title": "OM Infra Secures ₹410 Crore Infrastructure Project in Jammu and Kashmir",
            "Summary": "OM Infra has been awarded a significant infrastructure project worth ₹410 crore in Jammu and Kashmir. This contract represents a major business opportunity for the company in the region's development sector.",
            "Sentiment": "positive",
            "PublishDate": 1730078425000,
            "Source": "corporate_action"
        }
    ]
}