{
    "Symbol": "ONELIFECAP",
    "ISIN": "INE912L01015",
    "News": [
        {
            "Title": "Onelife Capital Advisors Approves ₹36 Crore Rights Issue",
            "Summary": "Onelife Capital Advisors' Rights Issue Committee approved issuance of 2.40 crore equity shares at ₹15 each, raising ₹36 crore with record date set for February 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770721993094,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onelife Capital Advisors Seeks Shareholder Approval",
            "Summary": "Onelife Capital Advisors Limited has issued a postal ballot notice seeking member approval for re-appointment of three independent directors for second terms through remote e-voting from February 06 to March 07, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770301888566,
            "Source": "stocks"
        },
        {
            "Title": "Onelife Capital Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "Onelife Capital Advisors schedules board meeting for February 03, 2026 to approve Q3FY26 financial results and finalize Rs. 30 crores rights issue modalities including pricing and record date.",
            "Sentiment": "neutral",
            "PublishDate": 1769695227473,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onelife Capital CFO Resigns Due to Personal Reasons",
            "Summary": "Onelife Capital Advisors announces resignation of Interim CFO Mr. Pandoo Prabhakar Naig effective January 20, 2026, citing pre-occupation and personal reasons as the cause for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768916914914,
            "Source": "stocks"
        },
        {
            "Title": "Onelife Capital Advisors Schedules Board Meeting to Consider Rights Issue",
            "Summary": "Onelife Capital Advisors Limited has scheduled a board meeting for December 10, 2025, to consider fundraising through a rights issue of equity shares to eligible shareholders, subject to regulatory approvals. The company has implemented a trading window closure from December 5, 2025, until 48 hours after the board meeting conclusion for all insiders.",
            "Sentiment": "positive",
            "PublishDate": 1764947969617,
            "Source": "corporate_action"
        },
        {
            "Title": "Onelife Capital Advisors Promoter Pledges 49 Lakh Shares to Globe Fincap",
            "Summary": "Onelife Capital Advisors Limited disclosed that promoter Prabhakara Naig has pledged 4,905,000 equity shares representing 36.71% of the company's total share capital to Globe Fincap Limited. The pledge was created on November 3, 2025, for working capital and business purposes against a loan amount of Rs 2 crore. The pledged shares were valued at Rs 7.36 crore on the date of the agreement. This represents 99.20% of the promoter's total shareholding in the company. The company issued a revised disclosure correcting an earlier error where the lender's name was mistakenly mentioned as Globe Capital Market Ltd instead of Globe Fincap Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762836656500,
            "Source": "corporate_action"
        },
        {
            "Title": "Onelife Capital Advisors Promoter Pledges 4.9 Million Shares",
            "Summary": "Promoter Prabhakara Naig of Onelife Capital Advisors Limited pledged 4,905,000 equity shares to Global Capital Market Limited. The pledge was created on November 3, 2025, representing 36.71% of the company's total share capital. Following this transaction, Naig's total holding in the company remains at 6,905,000 shares or 51.68% of total share capital. The disclosure was made under SEBI regulations regarding substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1762281914693,
            "Source": "corporate_action"
        },
        {
            "Title": "Onelife Capital Advisors Reports Mixed Quarterly Results with Ongoing Regulatory Challenges",
            "Summary": "Onelife Capital Advisors Limited announced its quarterly results for the period ended September 30, 2025. The company reported standalone revenue from operations of ₹0 lakhs for the quarter, with other income of ₹18.96 lakhs, resulting in total income of ₹18.96 lakhs. The company posted a standalone profit of ₹63.20 lakhs for the quarter compared to a loss of ₹61.62 lakhs in the previous quarter. On a consolidated basis, the company reported a loss of ₹492.67 lakhs for the quarter. The company faces several regulatory issues including a SEBI order directing payment of ₹50 lakhs each by the company and its directors for non-compliances related to related party transactions, against which an appeal has been filed. There is also an outstanding GST liability of ₹39.60 lakhs under dispute. The company has investments of ₹9,868.17 crores in subsidiaries, some with negative net worth. A subsidiary company has deferred recognition of advisory income of ₹260 lakhs and corresponding expenses of ₹2,120 lakhs due to ongoing SEBI proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1761852264416,
            "Source": "earnings"
        },
        {
            "Title": "Onelife Capital Advisors Appoints Rohit Gupta as Company Secretary & Compliance Officer",
            "Summary": "Onelife Capital Advisors Limited has appointed Mr. Rohit Gupta as Company Secretary & Compliance Officer with immediate effect. The appointment was approved by the Board of Directors on August 7, 2025, following recommendation from the Nomination and Remuneration Committee. The board meeting was held from 4:17 PM to 4:45 PM on the same day. Mr. Rohit Gupta is an Associate Member of the Institute of Company Secretaries of India and has experience in Companies Act, Listing Regulations and allied laws.",
            "Sentiment": "neutral",
            "PublishDate": 1754578806925,
            "Source": "corporate_governance"
        },
        {
            "Title": "Onelife Capital Advisors Reports Quarterly Loss, Appoints New Company Secretary",
            "Summary": "Onelife Capital Advisors Limited approved its unaudited financial results for the quarter ended June 30, 2025, and appointed Mr. Rohit Gupta as Company Secretary & Compliance Officer. The company reported a standalone loss of ₹61.64 crores and consolidated loss of ₹52.51 crores for the quarter. Revenue from operations remained nil on standalone basis, while consolidated revenue was ₹84.67 crores. The company faces several regulatory challenges including a SEBI order directing payment of ₹50 lakh each by the company and its directors for non-compliance with related party transaction provisions, which is currently under appeal. The auditors highlighted concerns about ₹87.22 crores investment in subsidiaries with negative net worth, disputed GST liability of ₹39.60 lakhs, and issues with a ₹25 crore transaction involving uncashed cheques. The company operates through multiple subsidiaries in advisory, broking, and trading services.",
            "Sentiment": "negative",
            "PublishDate": 1754576398965,
            "Source": "earnings"
        },
        {
            "Title": "Onelife Capital Advisors: Sebi Bans Company and Promoters from Securities Markets",
            "Summary": "Sebi has banned Onelife Capital Advisors and its promoters, Pandoo Naig and Prabhakara Naig, from securities markets for alleged fund diversion and financial misrepresentation. The company is accused of inflating revenue and expense figures, conducting circuitous transactions among related parties, and diverting funds. Sebi has also restrained the Naigs from acting as directors or key managerial personnel in any listed company seeking to raise public funds.",
            "Sentiment": "negative",
            "PublishDate": 1729616240000,
            "Source": "normal_news"
        }
    ]
}