{
    "Symbol": "ONEPOINT",
    "ISIN": "INE840Y01029",
    "News": [
        {
            "Title": "1Point1 Solutions Wins 3 AI Awards at Global Summit",
            "Summary": "One Point One Solutions Ltd. received three prestigious awards at the Elets AI Summit 2026 in New Delhi, including Customer Experience AI Solution, AI-Powered Analytics Solution and AI Leader awards.",
            "Sentiment": "positive",
            "PublishDate": 1769175310771,
            "Source": "stocks"
        },
        {
            "Title": "One Point One Solutions Passes Warrant Issue Resolution",
            "Summary": "One Point One Solutions Limited receives overwhelming 99.97% shareholder approval for issuing ₹84 crore worth of fully convertible warrants to promoters and non-promoters through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1768296247823,
            "Source": "co_actions_results"
        },
        {
            "Title": "One Point One Solutions surges on ₹84cr fundraise",
            "Summary": "One Point One Solutions share price gained 2.62% after shareholders approved ₹84 crore preferential warrant issue with 99.97% voting support, strengthening capital structure for growth.",
            "Sentiment": "positive",
            "PublishDate": 1768286372722,
            "Source": "co_actions_results"
        },
        {
            "Title": "One Point One Solutions MENA Arm Acquires BPO Firms",
            "Summary": "One Point One Solutions' MENA division finalizes $33 million acquisition deal to purchase 100% stake in Costa Rica and Colombia-based BPO companies.",
            "Sentiment": "positive",
            "PublishDate": 1766373766003,
            "Source": "co_actions_results"
        },
        {
            "Title": "One Point One Solutions Partners with Ducati India",
            "Summary": "One Point One Solutions announces strategic partnership with Ducati India for AI integration services and signs letter of intent for agentic AI-driven web chat implementation, strengthening its position as AI partner for global brands.",
            "Sentiment": "positive",
            "PublishDate": 1765511141517,
            "Source": "stocks"
        },
        {
            "Title": "One Point One Solutions Secures $1 Million Three-Year Partnership with Edu-Tech Firms for AI Test Integrity",
            "Summary": "One Point One Solutions has entered into a three-year deal worth approximately $1 million with leading edu-tech companies to enhance AI-driven test integrity operations. The partnership is expected to improve the company's operational efficiency and generate additional revenue through enhanced testing solutions.",
            "Sentiment": "positive",
            "PublishDate": 1764042857222,
            "Source": "stock"
        },
        {
            "Title": "One Point One Solutions Reports Strong Q2 Growth with Revenue Up 13% and Profit Rising 18%",
            "Summary": "One Point One Solutions delivered robust quarterly performance with revenue increasing to 709M rupees from 625M rupees year-over-year, while consolidated net profit grew to 99M rupees from 84M rupees. The company also improved its operational efficiency with EBITDA rising to 217M rupees and EBITDA margin expanding to 30.65% from 29.72% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1763047888936,
            "Source": "earnings"
        },
        {
            "Title": "One Point One Solutions Partners with Akasa Air for New Customer Service Solution",
            "Summary": "One Point One Solutions has partnered with Akasa Air to launch a new omnichannel Contact Center as a Service (CCaaS) solution. The collaboration aims to improve customer experience and enhance operational efficiency for the airline.",
            "Sentiment": "positive",
            "PublishDate": 1762832261921,
            "Source": "order&deals"
        },
        {
            "Title": "One Point One Solutions Reports Mixed Q1 Results with Revenue Growth and Profit Increase",
            "Summary": "One Point One Solutions reported Q1 revenue of 690 million rupees, up from 611 million rupees in the same quarter last year. The company's consolidated net profit increased to 94 million rupees from 76 million rupees year-over-year. However, EBITDA declined to 147 million rupees from 168.4 million rupees in the previous year's corresponding quarter. EBITDA margin also compressed to 21.32% compared to 27.54% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1755079504547,
            "Source": "earnings"
        },
        {
            "Title": "One Point One Solutions to Acquire Majority Stake in Techscient.AI",
            "Summary": "One Point One Solutions plans to acquire a majority stake in Techscient.AI to drive AI-powered Business Process Management (BPM) transformation. The transaction is expected to be completed by September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1749451733000,
            "Source": "default"
        },
        {
            "Title": "One Point One Solutions: Warrant Conversion Boosts Paid-Up Capital",
            "Summary": "One Point One Solutions approved the conversion of 379,944 warrants into equity shares, increasing its paid-up capital from ₹52.50 crore to ₹52.58 crore. The company received ₹80.70 lakh, representing 75% of the issue price of ₹21.24 per warrant. An additional 57,45,000 warrants remain available for conversion within 18 months.",
            "Sentiment": "neutral",
            "PublishDate": 1745819741000,
            "Source": "corporate_action"
        },
        {
            "Title": "One Point One Solutions: AI Acquisition to Boost Software Development Capabilities",
            "Summary": "One Point One Solutions signed a term sheet to acquire a majority stake in an AI-powered autonomous software engineering platform. The acquisition aims to accelerate global expansion, enter the AI-Low Code/No Code market, and transition from services to AI-led product engineering solutions.",
            "Sentiment": "positive",
            "PublishDate": 1744703207000,
            "Source": "corporate_action"
        },
        {
            "Title": "One Point One Solutions Approves Conversion of 5 Million Warrants to Equity Shares",
            "Summary": "The board of One Point One Solutions has approved the conversion of 5 million warrants into equity shares. This decision represents a significant corporate action that will impact the company's capital structure and potentially its share ownership.",
            "Sentiment": "neutral",
            "PublishDate": 1741274256000,
            "Source": "corporate_action"
        },
        {
            "Title": "One Point One Solutions: Q3 Income Surges 67%, PAT Up 41% YoY",
            "Summary": "One Point One Solutions reported Q3FY25 results with net profit up 41.21% to ₹8.43 crore and total income growing 67.18% to ₹70.40 crore YoY. The company is exploring acquisitions in USA, Latin America, and Europe, having signed non-binding term sheets with three potential targets. It also secured a major contract with a leading bank and added three new clients in the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739435508000,
            "Source": "earnings"
        },
        {
            "Title": "One Point One Solutions Reports Strong Q3 Financial Results",
            "Summary": "One Point One Solutions has announced its Q3 consolidated financial results. The company's net profit increased to 84 million rupees, up from 60 million rupees year-over-year, and remained stable at 84 million rupees quarter-over-quarter. Revenue for Q3 rose significantly to 657 million rupees, compared to 420 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739320382000,
            "Source": "earnings"
        },
        {
            "Title": "One Point One Solutions Reports Strong Q3 Financial Results",
            "Summary": "One Point One Solutions has announced its Q3 consolidated financial results. The company's net profit increased to 84 million rupees, up from 60 million rupees year-over-year. Revenue for the quarter rose to 657 million rupees, compared to 420 million rupees in the same period last year. The results also show stability in net profit quarter-over-quarter, remaining at 84 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739286447000,
            "Source": "earnings"
        },
        {
            "Title": "One Point One Solutions: Potential ₹261 Crore Acquisition to Boost Healthcare and Financial Services Offerings",
            "Summary": "One Point One Solutions signed a non-binding term sheet to acquire a Business Process Consulting and Management company for ₹261 crore. The acquisition aims to strengthen service offerings in healthcare and financial services sectors. Due diligence is expected to complete by Q1FY26. The target company has offices in Belize, Canada, UAE, and India.",
            "Sentiment": "positive",
            "PublishDate": 1738215984000,
            "Source": "corporate_action"
        },
        {
            "Title": "One Point One Solutions Signs Term Sheet for Acquisition",
            "Summary": "One Point One Solutions has signed a non-binding term sheet to acquire an India-based business process consulting and management company. The proposed acquisition is valued at an enterprise value of 261 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738137423000,
            "Source": "corporate_action"
        },
        {
            "Title": "One Point One Solutions Ltd: Signs Term Sheet for $45M US Healthcare Acquisition",
            "Summary": "One Point One Solutions Limited has signed a term sheet to acquire an unnamed US-based healthcare company specializing in Revenue Cycle Management for $45 million, including earnouts. The acquisition will add nearshore delivery locations in Uruguay and the Dominican Republic, and offshore centers in the Philippines. Integration is expected to be completed by Q3 2025.",
            "Sentiment": "positive",
            "PublishDate": 1737112899000,
            "Source": "corporate_action"
        },
        {
            "Title": "One Point One Solutions to Acquire LATAM Contact Center",
            "Summary": "One Point One Solutions has signed a non-binding term sheet to acquire a Latin America-based contact center. The acquisition is valued between $30 million to $35 million (approximately Rs 2.49 billion to Rs 2.905 billion).",
            "Sentiment": "positive",
            "PublishDate": 1736239634000,
            "Source": "corporate_action"
        },
        {
            "Title": "One Point One Solutions Secures Major Contract in Travel and Fleet Management Vertical",
            "Summary": "One Point One Solutions has announced a significant contract in the travel and fleet management sector. The company's Managing Director expressed enthusiasm about the partnership, describing it as a noteworthy milestone in their growth strategy for this vertical.",
            "Sentiment": "positive",
            "PublishDate": 1733896059000,
            "Source": "order&deals"
        },
        {
            "Title": "One Point One Solutions Secures Key Contract in Travel & Fleet Management Sector",
            "Summary": "One Point One Solutions has expanded its presence in the travel and fleet management vertical by winning a significant contract from Everest Fleet. This new business acquisition represents a strategic growth opportunity for the company in a key industry sector.",
            "Sentiment": "positive",
            "PublishDate": 1733895941000,
            "Source": "order&deals"
        },
        {
            "Title": "One Point One Solutions: Penny Stock Soars 3000% in 4 Years",
            "Summary": "One Point One Solutions' stock price has surged from ₹1.91 to ₹60 in four years, marking a 3,057% increase. The company recently partnered with a multinational for data analytics and consumer credit reporting. Q2FY25 results show strong growth with revenue up 56.68% YoY to ₹62.48 crore. The company plans to add 750 seats in FY 2025-26 and has allocated ₹220 crore for expansion and acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1733214624000,
            "Source": "normal_news"
        },
        {
            "Title": "One Point One Solutions Partners with Global Data Analytics Leader",
            "Summary": "One Point One Solutions has announced a partnership with a global data analytics leader to enhance customer experience in India. This collaboration aims to leverage advanced analytics capabilities to improve service delivery and customer satisfaction in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1733123416000,
            "Source": "corporate_action"
        },
        {
            "Title": "One Point One Solutions: Q2 Revenue Soars 56.68%, Expansion Plans Unveiled",
            "Summary": "One Point One Solutions reported Q2 FY25 revenue of Rs 62.48 crore, up 56.68% YoY. Net profit increased 41.32% to Rs 8.38 crore. The company plans to add 750 seats in FY26, targeting 25% revenue growth. A UK subsidiary has been incorporated for European market entry, and the company is exploring acquisitions in South America.",
            "Sentiment": "positive",
            "PublishDate": 1731466693000,
            "Source": "result"
        },
        {
            "Title": "One Point One Solutions: Expands Global Footprint with UK Subsidiary",
            "Summary": "One Point One Solutions Limited has established a wholly owned subsidiary, ONE POINT ONE SOLUTIONS UK LTD, in England and Wales. The new entity will serve as a holding company for future foreign subsidiary acquisitions. The parent company will hold 100% of the paid-up share capital and subscribe for 100% of the initial share capital.",
            "Sentiment": "positive",
            "PublishDate": 1729338113000,
            "Source": "corporate_action"
        }
    ]
}