{
    "Symbol": "ONESOURCE",
    "ISIN": "INE013P01021",
    "News": [
        {
            "Title": "OneSource Gets ESG Score of 65.7 from SES Research",
            "Summary": "OneSource Specialty Pharma receives unsolicited ESG rating of 65.7 from SES ESG Research based on FY25 public data, company informs exchanges under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770898124829,
            "Source": "stocks"
        },
        {
            "Title": "OneSource Gets Saudi Approval for Generic Ozempic",
            "Summary": "OneSource Specialty Pharma receives SFDA approval for generic semaglutide in Saudi Arabia, partnering with Hikma Pharmaceuticals for exclusive MENA commercialisation of the diabetes therapy.",
            "Sentiment": "positive",
            "PublishDate": 1770778654380,
            "Source": "stocks"
        },
        {
            "Title": "Pronomz Ventures acquires additional stake in Onesource",
            "Summary": "Pronomz Ventures LLP, part of promoter group, acquired 33,906 equity shares in Onesource Specialty Pharma through open market purchase on January 30, 2026, increasing total holding to 30.19%.",
            "Sentiment": "neutral",
            "PublishDate": 1770094682010,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onesource Promoter Group Acquires Additional Shares",
            "Summary": "Tenshi Pharmaceuticals Private Limited, part of Onesource Speciality Pharma's promoter group, acquired 2,00,000 equity shares through open market purchase, increasing total promoter holding to 30.10%.",
            "Sentiment": "neutral",
            "PublishDate": 1769601048852,
            "Source": "co_actions_results"
        },
        {
            "Title": "OneSource Specialty Pharma shares plunge 18% on weak Q3",
            "Summary": "OneSource Specialty Pharma shares tumbled 18% after reporting Q3 FY26 net loss of Rs 47 crore versus Rs 67 crore profit last year. Revenue declined 26% to Rs 290 crore due to delayed semaglutide approvals in Canada.",
            "Sentiment": "negative",
            "PublishDate": 1769498908237,
            "Source": "co_actions_results"
        },
        {
            "Title": "OneSource Specialty Pharma Reports Q3 FY26 Results",
            "Summary": "OneSource Specialty Pharma Limited reported Q3 FY26 consolidated revenue of ₹2,903.40 million with a net loss of ₹886.99 million. The company faced exceptional items of ₹70.90 million during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1769181876155,
            "Source": "co_actions_results"
        },
        {
            "Title": "OneSource Allots 36,065 ESOP Shares to Employees",
            "Summary": "OneSource Specialty Pharma allotted 36,065 equity shares under ESOP 2021 to eligible employees at ₹278.00 per share, increasing paid-up capital to ₹11.46 crores on January 21, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769001042273,
            "Source": "co_actions_results"
        },
        {
            "Title": "OneSource Pharma Q3FY26 Earnings Call on Jan 24",
            "Summary": "OneSource Specialty Pharma Limited has scheduled its Q3FY26 earnings call for January 24, 2026, at 09:30 AM IST to discuss unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768816532471,
            "Source": "co_actions_results"
        },
        {
            "Title": "OneSource Pharma Board Meet Set for Jan 23, 2026",
            "Summary": "OneSource Specialty Pharma Limited has scheduled a board meeting on January 23, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768815341457,
            "Source": "co_actions_results"
        },
        {
            "Title": "OnSource Specialty Pharma Merges Singapore Units",
            "Summary": "OnSource Specialty Pharma completes merger of its Singapore subsidiary Stelis Pte. Limited with OnSource Specialty Pte. Limited, streamlining operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768401457413,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onesource Specialty Pharma Creates Share Pledge",
            "Summary": "Catalyst Trusteeship Limited creates pledge over 64,00,000 equity shares representing 5.59% of total share capital in connection with ₹1,000 crore debenture issuance by Onesource Specialty Pharma Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1767941655290,
            "Source": "stocks"
        },
        {
            "Title": "OneSource Pharma: 64L Shares Pledged for ₹1000 Cr Debenture",
            "Summary": "Tenshi Pharmaceuticals pledged 64,00,000 equity shares of OneSource Specialty Pharma to Catalyst Trusteeship Limited as security for ₹1000 crore debentures issued by Karuna Ventures.",
            "Sentiment": "neutral",
            "PublishDate": 1767940715772,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onesource Pharma: 20L Shares Pledged by Promoter",
            "Summary": "Tenshi Pharmaceuticals pledged 20 lakh equity shares of Onesource Specialty Pharma on December 16, 2025, citing business and operational requirements under SEBI disclosure norms.",
            "Sentiment": "neutral",
            "PublishDate": 1766121604655,
            "Source": "stocks"
        },
        {
            "Title": "OneSource Specialty Pharma Allots 23,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "OneSource Specialty Pharma's Management Committee allotted 23,000 equity shares of INR 1 each to eligible employees under the ONESOURCE ESOP 2021 plan at a premium of INR 277 per share. The allotment increased the company's paid-up share capital from INR 11,45,62,136 to INR 11,45,85,136, with the new shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765275119977,
            "Source": "corporate_action"
        },
        {
            "Title": "OneSource Specialty Pharma Reports Strong Q2 Performance Despite GLP-1 Launch Uncertainties",
            "Summary": "OneSource Specialty Pharma delivered 12% revenue growth to INR 3,758 million and 37% EBITDA growth to INR 1,065 million in Q2 FY26, with margins expanding 506 basis points to 28%. The company faces near-term revenue recognition uncertainty due to regulatory approval delays for GLP-1 customers including potential Canada launch delays, while maintaining confidence in FY28 guidance of INR 500 million revenue including proposed acquisitions.",
            "Sentiment": "negative",
            "PublishDate": 1763457731216,
            "Source": "stock"
        },
        {
            "Title": "OneSource Specialty Pharma Reports 12% Revenue Growth in Q2FY26, Raises FY28 Outlook to $500M",
            "Summary": "OneSource Specialty Pharma delivered quarterly results showing revenue of $43.1 million, representing 12% year-over-year growth driven by MSA executions and IP-led base business sales. EBITDA reached $12.2 million with a 28% margin, marking 506 basis points improvement year-over-year. The company moved from loss to profit with adjusted PAT of $4.3 million. Performance was supported by signing 9 new MSAs and licensing agreements across different platforms. The company is accelerating DDC capacity additions to support upcoming customer launches and has onboarded 2 new device platforms, bringing total device platforms to 11. OneSource announced proposed acquisitions of a multi-dose fill-finish site in Europe and an integrated carbapenem facility in India. Based on these developments, the company raised its FY28 revenue outlook to $500 million with 40% EBITDA margins. The biologics funnel increased 4x versus FY25 driven by strengthened sales teams and industry tailwinds. Capacity expansion is progressing with cartridge capacity planned to increase from 40 million to 220 million units.",
            "Sentiment": "positive",
            "PublishDate": 1762913828550,
            "Source": "earnings"
        },
        {
            "Title": "OneSource Specialty Pharma Reports Mixed Results with Revenue Growth but Higher Losses",
            "Summary": "OneSource Specialty Pharma Limited reported quarterly results for the period ended September 30, 2025. The company's consolidated revenue increased to Rs. 3,787.63 million compared to Rs. 3,272.70 million in the previous quarter. However, the company posted a consolidated net loss of Rs. 104.85 million for the quarter, compared to a profit of Rs. 47.02 million in the previous quarter. For the six-month period, consolidated revenue reached Rs. 7,060.33 million versus Rs. 6,263.37 million in the corresponding period last year, while net loss widened to Rs. 72.80 million from Rs. 179.70 million loss in the previous year. The company operates primarily in the CDMO (Contract Development and Manufacturing Organization) segment for pharmaceutical products. The results include exceptional items related to business combination, listing, and post-merger integration expenses. The company is involved in ongoing litigation with Prestige Biopharma Limited regarding a USD 136.32 million claim related to Sputnik vaccine manufacturing, which is currently pending before the Singapore International Arbitration Centre.",
            "Sentiment": "negative",
            "PublishDate": 1762895811913,
            "Source": "earnings"
        },
        {
            "Title": "OneSource Specialty Pharma Reports Q2 FY2025-26 Results: Swings to Profit, Revenue Up 15.7%",
            "Summary": "OneSource Specialty Pharma reported a consolidated net profit of ₹104.85 million for Q2 FY2025-26, compared to a ₹1.86 million loss in Q1, as revenue rose 15.7% QoQ to ₹3,787.63 million. For H1 FY2025-26, revenue reached ₹7,060.33 million with a profit of ₹102.99 million, marking a turnaround from last year’s loss. Management highlighted stronger CDMO order flow, improved utilization, and a focus on margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762865991672,
            "Source": "earnings"
        },
        {
            "Title": "OneSource Specialty Pharma Approves Multi-Company Merger and Financial Restructuring Scheme",
            "Summary": "OneSource Specialty Pharma's board approved a composite scheme involving mergers of four companies - Steriscience Specialties, Brooks Steriscience, Steriscience Pte, and Strides Pharma Services - into OneSource. The scheme includes specific share exchange ratios: 137 OneSource shares for every 10 Brooks Steriscience shares, and 53 OneSource shares for every 100 Steriscience Pte shares. Post-merger, promoter shareholding will increase from 29.77% to 36.17%, while public shareholding will decrease from 70.23% to 63.83%. The consolidation aims to strengthen OneSource's contract development and manufacturing operations by integrating sterile injectable operations and adding European manufacturing capabilities. Additionally, the scheme includes financial restructuring to offset negative retained earnings against securities premium account. The merger requires approvals from shareholders, creditors, stock exchanges, SEBI, National Company Law Tribunal, Singapore Court, and other regulatory authorities. OneSource reported standalone profits in financial year 2024-25 after previous losses.",
            "Sentiment": "positive",
            "PublishDate": 1758908048294,
            "Source": "corporate_action"
        },
        {
            "Title": "OneSource Specialty Pharma Reports Strong Q1 FY26 Results with 37% EBITDA Growth",
            "Summary": "OneSource Specialty Pharma Limited delivered robust Q1 FY26 financial performance with revenue of INR 3,273 million, marking 12% year-over-year growth. EBITDA surged 37% to INR 885 million with margins improving 500 basis points to 27%. The company turned profitable with adjusted PAT of INR 371 million compared to negative PAT in the previous year, achieving adjusted EPS of INR 3.2 per share. The contract development and manufacturing organization received a credit rating upgrade to the 'A' family. All three business segments - drug-device combinations, injectables, and soft gelatin capsules - performed in line with expectations. The company is accelerating Phase 2 capacity expansion for drug-device combinations to reach 200 million cartridges by end of 2026, up from current capacity of 40 million units. OneSource successfully completed 25 regulatory inspections across all sites and received USFDA and ANVISA approvals. The company announced a strategic partnership with Swedish biotech Xbrane Biopharma and is evaluating acquisitions of facilities in Poland and India with combined revenue potential of $100 million. Management maintains organic revenue target of $400 million by FY28, with commercial supplies of Semaglutide expected to begin in H2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754978719693,
            "Source": "earnings"
        },
        {
            "Title": "OneSource Specialty Pharma Board Approves Evaluation of Sterile Injectable Business Acquisition",
            "Summary": "OneSource Specialty Pharma Limited's Board of Directors has given in-principle approval to evaluate the potential acquisition of Sterile Injectable CDMO and CMO businesses from Steriscience Pte. Limited and Brooks Steriscience Limited. The potential transaction would include a USFDA-approved sterile fill-finish manufacturing facility in Warsaw, Poland, with capacity expansion capabilities for drug-device combination products, and an integrated USFDA-approved carbapenem facility in Vadodara, India. Both Steriscience SG and Brooks Steriscience Limited are majorly owned by the company's promoters. The Board has authorized management to conduct detailed evaluation of the transaction and appoint necessary consultants, advisors, valuers, and merchant bankers. The company will make appropriate disclosures following board consideration and approval.",
            "Sentiment": "positive",
            "PublishDate": 1754322608635,
            "Source": "order&deals"
        },
        {
            "Title": "OneSource Specialty Pharma Reports Loss of Rs 1.86 Million in Q1 FY26",
            "Summary": "OneSource Specialty Pharma Limited reported a consolidated net loss of Rs 1.86 million for the quarter ended June 30, 2025, compared to a loss of Rs 55.47 million in the same quarter last year. Revenue from operations increased to Rs 3,272.70 million from Rs 2,922.89 million year-over-year. The company faced exceptional items worth Rs 28.70 million related to legal charges from subsidiary litigation regarding Sputnik vaccine matters. On a standalone basis, the company posted a profit of Rs 248.15 million compared to a loss of Rs 239.66 million in the previous year quarter. The Board of Directors approved these unaudited results at a meeting held on August 4, 2025. The company operates primarily in the CDMO (Contract Development and Manufacturing Organization) segment for pharmaceutical products development and manufacturing.",
            "Sentiment": "neutral",
            "PublishDate": 1754321679155,
            "Source": "earnings"
        },
        {
            "Title": "ONESOURCE Specialty Pharma Receives VAI Classification from USFDA",
            "Summary": "ONESOURCE Specialty Pharma has received a 'Voluntary Action Indicated' (VAI) classification from the US Food and Drug Administration (USFDA) for its key facility in Bangalore, India. This classification validates the company's ongoing compliance with regulatory standards.",
            "Sentiment": "positive",
            "PublishDate": 1749525415000,
            "Source": "default"
        },
        {
            "Title": "Onesource Specialty Pharma Reports Q4 Profit and Meets First-Year Targets",
            "Summary": "Onesource Specialty Pharma announced Q4 net profit of 1.75 billion rupees, compared to a loss of 400 million rupees year-over-year. Q4 revenue increased to 4.77 billion rupees from 731 million rupees in the previous year. The company achieved its revenue and EBITDA outlook in its first year post-listing. Additionally, the company has approved the consolidation of its Singapore business operations.",
            "Sentiment": "positive",
            "PublishDate": 1746490161000,
            "Source": "default"
        },
        {
            "Title": "OneSource Specialty Pharma Consolidates Singapore Operations",
            "Summary": "OneSource Specialty Pharma has approved the consolidation of its business operations in Singapore. This strategic move likely aims to streamline the company's presence and improve operational efficiency in the Singapore market.",
            "Sentiment": "neutral",
            "PublishDate": 1746457784000,
            "Source": "default"
        },
        {
            "Title": "OneSource Specialty Pharma Meets Revenue and EBITDA Targets in First Post-IPO Year",
            "Summary": "OneSource Specialty Pharma has successfully achieved its revenue and EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) goals in its first year as a publicly traded company. This performance indicates strong financial health and successful execution of the company's business strategy following its initial public offering.",
            "Sentiment": "positive",
            "PublishDate": 1746457584000,
            "Source": "default"
        },
        {
            "Title": "OneSource Specialty Pharma Reports Significant Q4 Turnaround",
            "Summary": "OneSource Specialty Pharma has reported a remarkable turnaround in its Q4 financial results. The company's EBITDA improved from a loss of 27 million rupees to a gain of 2.4 billion rupees year-over-year, with an EBITDA margin of 49.64%. Net profit for Q4 stood at 1.75 billion rupees, compared to a loss of 400 million rupees in the same quarter last year and a loss of 730 million rupees in the previous quarter. Revenue significantly increased to 4.77 billion rupees from 731 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746457100000,
            "Source": "result"
        },
        {
            "Title": "Onesource Specialty Pharma's Unit 2 Receives GMP Certification from ANVISA",
            "Summary": "Onesource Specialty Pharma announced that its Unit 2 has been granted Good Manufacturing Practice (GMP) certification by ANVISA, Brazil's National Health Surveillance Agency. This certification follows a successful regulatory inspection conducted in November 2024. The approval enables the company to supply DDCs (Drug-Device Combinations) and GLP-1s (Glucagon-Like Peptide-1 receptor agonists) to the Brazilian market.",
            "Sentiment": "positive",
            "PublishDate": 1744329977000,
            "Source": "corporate_action"
        },
        {
            "Title": "OneSource Specialty Pharma's Unit 2 Receives GMP Certification from ANVISA",
            "Summary": "OneSource Specialty Pharma has announced that its Unit 2 has been granted Good Manufacturing Practice (GMP) certification by ANVISA, the Brazilian Health Regulatory Agency. This certification follows a successful regulatory inspection conducted in November 2024. The approval enables the company to supply DDCs (Drug-Device Combinations) and GLP-1s (Glucagon-like peptide-1 receptor agonists) to the Brazilian market.",
            "Sentiment": "positive",
            "PublishDate": 1744284825000,
            "Source": "corporate_action"
        },
        {
            "Title": "OneSource Specialty Pharma: QIP Plans Halted by SEBI Guidance",
            "Summary": "SEBI's informal guidance prevents OneSource Specialty Pharma from conducting a Qualified Institutional Placement (QIP) immediately after listing due to the involvement of an unlisted entity in its merger scheme. The company must now wait for one year post-listing before initiating a QIP.",
            "Sentiment": "negative",
            "PublishDate": 1741269704000,
            "Source": "corporate_action"
        }
    ]
}