{
    "Symbol": "ONGC",
    "ISIN": "INE213A01029",
    "News": [
        {
            "Title": "ONGC schedules Q3 FY26 earnings call for Feb 13",
            "Summary": "Oil and Natural Gas Corporation Limited announces conference call with analysts and investors on February 13, 2026 at 11:00 AM IST to discuss Q3 FY26 financial results under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1770780132316,
            "Source": "co_actions_results"
        },
        {
            "Title": "ONGC Executive Director Ajay Dixit Retires",
            "Summary": "Oil and Natural Gas Corporation Limited announced the superannuation of Executive Director Ajay Dixit effective February 1, 2026, marking a senior management change at the state-owned energy giant.",
            "Sentiment": "neutral",
            "PublishDate": 1769936516320,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Oil and Natural Gas Corporation Limited has scheduled its board meeting for February 12, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1769761337384,
            "Source": "co_actions_results"
        },
        {
            "Title": "ONGC Denies ExxonMobil Partnership Negotiations",
            "Summary": "ONGC clarifies it is not engaged in definitive negotiations with ExxonMobil for joint bidding on oil & gas blocks, responding to market speculation that drove E&P sector gains.",
            "Sentiment": "neutral",
            "PublishDate": 1769702875360,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Partners With Reliance for Deepwater Resources",
            "Summary": "Oil & Natural Gas Corporation enters strategic partnership with Reliance to share deepwater resources off India's east coast, aiming to reduce costs and accelerate project timelines.",
            "Sentiment": "positive",
            "PublishDate": 1769581772491,
            "Source": "co_actions_results"
        },
        {
            "Title": "India Negotiates ONGC Videsh Dividend Release",
            "Summary": "India is in discussions with Venezuela and the US to resolve ONGC Videsh's stuck dividends, addressing financial complications arising from international sanctions and diplomatic relations.",
            "Sentiment": "neutral",
            "PublishDate": 1769570834614,
            "Source": "stocks"
        },
        {
            "Title": "US Natural Gas Prices Surge 70% on Winter Freeze",
            "Summary": "Natural gas futures jumped 70% in the US during a week of brutal cold weather, catching traders off guard who had bet on falling prices after months of mild conditions.",
            "Sentiment": "negative",
            "PublishDate": 1769394797878,
            "Source": "global"
        },
        {
            "Title": "ONGC Forms Joint Ventures with Japan's Mitsui for Ethane",
            "Summary": "Oil & Natural Gas Corporation invests ₹40.00 crores in two joint ventures with Mitsui O.S.K. Lines Ltd, Japan, acquiring 50% stakes in ethane shipping companies for OPaL feedstock transportation.",
            "Sentiment": "positive",
            "PublishDate": 1769082882815,
            "Source": "co_actions_results"
        },
        {
            "Title": "ONGC Appoints 4 New Executive Directors",
            "Summary": "Oil & Natural Gas Corporation announced the appointment of four new Executive Directors effective January 19, 2026, bringing decades of engineering and management experience to senior leadership roles.",
            "Sentiment": "positive",
            "PublishDate": 1768832022524,
            "Source": "stocks"
        },
        {
            "Title": "ONGC, Oil India surge on rising crude prices",
            "Summary": "ONGC and Oil India shares extend three-day winning streak as Brent crude hits 12-week highs near $66/barrel amid Iran concerns. Both PSU oil stocks see strong trading volumes.",
            "Sentiment": "positive",
            "PublishDate": 1768355574611,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Completes Well Control at Mori-5 in Record Time",
            "Summary": "Oil and Natural Gas Corporation successfully establishes well control at Well Mori-5, completing the critical capping operation in just five days, demonstrating operational efficiency in well management.",
            "Sentiment": "positive",
            "PublishDate": 1768176599957,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Completes Well Control at Mori-5 in Five Days",
            "Summary": "Oil & Natural Gas Corporation successfully completed well control operations at its Mori-5 facility within five days, demonstrating efficient operational capabilities in upstream activities.",
            "Sentiment": "positive",
            "PublishDate": 1768041640177,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Establishes Well Control at Mori-5 in Record Time",
            "Summary": "Oil and Natural Gas Corporation successfully establishes well control at Mori-5 well in record five days following blowout incident on January 5, 2026, demonstrating operational excellence in crisis management.",
            "Sentiment": "positive",
            "PublishDate": 1768034923611,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Gas Well Fire Extinguished After 5-Day Battle",
            "Summary": "Fire at ONGC's Mori-5 gas well in Andhra Pradesh's Konaseema district successfully extinguished after five days. No casualties reported in the incident that created 20-metre high flames.",
            "Sentiment": "neutral",
            "PublishDate": 1768034627655,
            "Source": "stocks"
        },
        {
            "Title": "ONGC gas well fire extinguished after 5-day battle",
            "Summary": "Fire at ONGC's Mori-5 gas well in Andhra Pradesh's Konaseema district successfully extinguished after five days. The massive blowout created 20-metre high flames but caused no casualties.",
            "Sentiment": "positive",
            "PublishDate": 1768031102847,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Initiates Control Operations for Mori 5 Well",
            "Summary": "Oil & Natural Gas Corporation has commenced operations to control and seal its Mori 5 well facility. The state-owned energy company is undertaking technical measures to address the well situation.",
            "Sentiment": "neutral",
            "PublishDate": 1767965038776,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Makes Progress on Well Mori#5 Blowout Control",
            "Summary": "Oil and Natural Gas Corporation advances debris clearing and wellhead access operations for Well Mori#5 capping, with residents resuming normal activities as conditions stabilize.",
            "Sentiment": "positive",
            "PublishDate": 1767964456416,
            "Source": "stocks"
        },
        {
            "Title": "Three Oil Stocks Poised for Venezuela Opportunity Gains",
            "Summary": "ONGC, Reliance Industries, and IOC could benefit from potential US-Venezuela oil sector restructuring, with ONGC standing to recover $536 million in pending dues from San Cristobal field stake.",
            "Sentiment": "positive",
            "PublishDate": 1767933166634,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Receives ₹26.76 Cr Tax Demand from CGST Surat",
            "Summary": "Oil & Natural Gas Corporation receives order from CGST & Central Excise Commissioner, Surat demanding ₹26.76 crores in Special Additional Excise Duty plus penalty for partner's participating interest.",
            "Sentiment": "negative",
            "PublishDate": 1767865378356,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Reports Progress in Andhra Pradesh Mori-5 Blowout Control",
            "Summary": "Oil & Natural Gas Corporation makes significant progress in controlling Mori-5 well blowout in Andhra Pradesh, with reduced fire intensity and debris clearance operations enabling residents to resume normal activities.",
            "Sentiment": "positive",
            "PublishDate": 1767789317862,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Controls Andhra Pradesh Gas Leak, Flame Reduces",
            "Summary": "ONGC's crisis management team has operational control of Mori-5 well gas leak in Andhra Pradesh, with flame intensity gradually reducing and comprehensive safety measures deployed.",
            "Sentiment": "neutral",
            "PublishDate": 1767701499787,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Forms 50:50 JVs With Japan's MOL in GIFT City",
            "Summary": "ONGC signs agreements with Japan's Mitsui OSK Lines to establish two 50:50 joint ventures in GIFT City for ethane transportation using VLECs, with operations starting mid-2028.",
            "Sentiment": "positive",
            "PublishDate": 1767617067533,
            "Source": "co_actions_results"
        },
        {
            "Title": "ONGC Management Monitors Gas Leak, Mobilises Equipment",
            "Summary": "ONGC management and technical experts closely monitor Mori Field gas leak situation while mobilising additional equipment for emergency response operations at Well Mori#5.",
            "Sentiment": "neutral",
            "PublishDate": 1767609990708,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Shares Ease After Hitting One-Month High On Venezuela",
            "Summary": "ONGC shares hit one-month high then declined 1% as US involvement in Venezuela's oil sector could help recover $500M in unpaid dividends from San Cristobal field amid geopolitical developments.",
            "Sentiment": "neutral",
            "PublishDate": 1767581393087,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Issues Public Notice Against Fraudulent Entity",
            "Summary": "Oil and Natural Gas Corporation Limited warns stakeholders against unauthorized entity 'ONGC INDIA' falsely claiming association with the company, threatening legal action against impersonation.",
            "Sentiment": "negative",
            "PublishDate": 1766052446544,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Receives ESG Rating & Climate Scores",
            "Summary": "Oil & Natural Gas Corporation receives ESG rating of 62 from NSE Sustainability with 'Adequate' category and B score from CDP for climate change performance in FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1765621986541,
            "Source": "stocks"
        },
        {
            "Title": "ONGC Sees ₹68.58 Cr NSE Block Trade at ₹240.10",
            "Summary": "Oil & Natural Gas Corporation witnessed a significant block trade worth ₹68.58 crores involving 2,856,262 shares executed at ₹240.10 per share on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1765431306730,
            "Source": "co_actions_results"
        },
        {
            "Title": "ONGC Re-appoints Arun Kumar Singh as Chairman & CEO for One More Year",
            "Summary": "ONGC's Board approved the re-employment of Arun Kumar Singh as Chairman & CEO on contract basis for one year from December 7, 2025, or until a regular incumbent assumes charge. Singh, who originally took the role in December 2022, brings nearly four decades of oil and gas industry experience and previously served as Chairman & MD of BPCL.",
            "Sentiment": "positive",
            "PublishDate": 1764957494344,
            "Source": "corporate_governance"
        },
        {
            "Title": "ONGC Chairman Arun Kumar Singh Gets One-Year Contract Extension",
            "Summary": "The Appointment Committee of the Cabinet has approved the re-employment of Arun Kumar Singh as Chairman of ONGC on a contract basis for one year starting December 7, 2025. The extension will continue until a regular incumbent assumes charge or further orders are issued, whichever comes first.",
            "Sentiment": "neutral",
            "PublishDate": 1764769456581,
            "Source": "corporate_governance"
        },
        {
            "Title": "S&P Withdraws Credit Rating on ONGC Videsh Vankorneft's $600 Million Notes at Issuer Request",
            "Summary": "S&P Global Ratings withdrew its BBB long-term issuer rating on the $600 million senior unsecured notes due 2026 issued by ONGC Videsh Vankorneft Pte. Ltd., a wholly owned step-down subsidiary of ONGC Videsh in Singapore, following the issuer's request. S&P's BBB issuer credit ratings on ONGC and BBB long-term issue credit rating on the $300 million senior unsecured notes due 2029 issued by ONGC remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1763722319056,
            "Source": "corporate_action"
        },
        {
            "Title": "ONGC Ends Force Majeure For Mozambique LNG Project Area",
            "Summary": "ONGC has ended the force majeure status for its Mozambique LNG project area.",
            "Sentiment": "positive",
            "PublishDate": 1762953606226,
            "Source": "stock"
        },
        {
            "Title": "ONGC Shares Rise 2% Despite 18% Drop in Quarterly Profit",
            "Summary": "ONGC shares gained 2.5% to Rs 255 despite reporting an 18% decline in quarterly profit to Rs 9,848 crore. The profit drop was attributed to lower oil prices, with revenues falling 2.5% to Rs 33,031 crore. The company declared an interim dividend of Rs 6 per equity share with a total payout of Rs 7,548 crore. ONGC's crude oil realization dropped 14% to $67.34 per barrel, while natural gas price realization from nominated fields increased 3.8% to $6.75 per mmbtu. Goldman Sachs maintained a 'Sell' rating with a target price of Rs 220, cutting EBITDA estimates by 13% and modeling conservative 2% growth versus ONGC's guided 5% CAGR for oil and gas production. Nomura maintained a Neutral rating but reduced the target price to Rs 270 from Rs 275, cutting consolidated EPS estimates by 14% and 7% for the next two fiscal years. ONGC management outlined plans for annual capital expenditure of Rs 30,000-35,000 crore, cost reduction of Rs 5,000 crore, and expansion of renewable energy capacity to 10 GW by 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1762929773282,
            "Source": "earnings"
        },
        {
            "Title": "ONGC Targets 21 Million Tonnes Oil and 21.5 BCM Gas Production by FY27",
            "Summary": "ONGC has announced production targets of 21 million tonnes of oil and 21.5 billion cubic meters of gas for FY27. The targets were shared by a company executive.",
            "Sentiment": "positive",
            "PublishDate": 1762857839345,
            "Source": "stock"
        },
        {
            "Title": "ONGC Reports 28.2% Jump in Net Profit, Announces ₹6 Interim Dividend",
            "Summary": "Oil and Natural Gas Corporation Ltd (ONGC) reported a 28.2% year-on-year increase in consolidated net profit to ₹12,615 crore for the quarter ended September 2025. The company declared an interim dividend of ₹6 per equity share with a record date of November 14, 2025, representing a 120% payout totaling ₹7,548 crore. Standalone crude oil production increased 1.2% to 4.63 million metric tonnes, while natural gas production declined marginally by 0.04%. Crude oil realisation from nomination fields stood at $67.34 per barrel, down 14% year-on-year. The company announced two hydrocarbon discoveries during the half-year period and signed multiple partnership agreements including joint ventures with Mitsui O.S.K. Lines for ethane carriers and development agreements with various companies. The board approved an investment of up to ₹421.50 crore in subsidiary ONGC Green Ltd and gave in-principle approval for two joint venture companies with Mitsui O.S.K. Lines involving a cumulative investment of up to $49.20 million.",
            "Sentiment": "positive",
            "PublishDate": 1762799302775,
            "Source": "earnings"
        },
        {
            "Title": "ONGC Reports Q2 Net Profit of ₹98.48B, Declares ₹6 Per Share Interim Dividend",
            "Summary": "ONGC announced an interim dividend of ₹6 per share. The company reported Q2 net profit of ₹98.48 billion, up from ₹80.24 billion in the previous quarter, though slightly below estimates of ₹100 billion. Revenue increased to ₹330.3 billion from ₹320 billion quarter-on-quarter, exceeding estimates of ₹324.8 billion. However, EBITDA declined to ₹166 billion from ₹171.85 billion in the previous quarter, missing estimates of ₹186.6 billion. EBITDA margin compressed to 50.25% from 53.7% quarter-on-quarter, falling short of the estimated 58.3%.",
            "Sentiment": "neutral",
            "PublishDate": 1762793813023,
            "Source": "corporate_action"
        },
        {
            "Title": "ONGC Shares Worth Rs. 18.97 Crores Traded in NSE Block Deal",
            "Summary": "Oil & Natural Gas Corporation Ltd. witnessed a block trade on NSE involving approximately 756,851 shares valued at Rs. 18.97 crores. The shares were traded at a price of Rs. 250.65 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762758642764,
            "Source": "order&deals"
        },
        {
            "Title": "ONGC to Announce Q2 Results on November 10, May Consider Interim Dividend",
            "Summary": "Oil and Natural Gas Corporation Ltd. (ONGC) will announce its quarterly results for the period ended September 2025 on November 10. The Board meeting will consider unaudited financial results and may approve an interim dividend recommendation for shareholders. An earnings conference call is scheduled for November 11 at 3:30 p.m. with Director (Finance) Vivek C Tongaonkar. The company's trading window has been closed since October 1 and will remain closed until November 12. In the previous quarter, ONGC reported consolidated net profit of Rs 11,554 crore, up 18.2% year-over-year, while gross revenue declined 3.5% to Rs 1.63 lakh crore. ONGC shares have declined 1.77% in the last five trading sessions but are up 4.42% over the past month and 6.56% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1762655735848,
            "Source": "earnings"
        },
        {
            "Title": "ONGC Appoints Rama K Gupta & Co. as Statutory Auditor for FY 2025-26",
            "Summary": "Oil and Natural Gas Corporation Limited (ONGC) announced the appointment of M/s Rama K Gupta & Co. as Statutory/Joint Statutory Auditor for Financial Year 2025-26. The Comptroller Auditor General of India (CAG) had initially appointed 5 Chartered Accountant firms as auditors, but M/s MSKA & Associates declined the appointment. CAG then issued a letter dated November 6, 2025, in partial modification of their earlier September 10, 2025 letter, appointing Rama K Gupta & Co. The appointed firm is a Bhopal-based Chartered Accountancy firm established in 1989, with 25 experienced partners and branch offices across multiple Indian states. The firm has previously conducted audits for major institutions including State Bank of India, NTPC Ltd., NMDC Ltd., and Life Insurance Corporation of India.",
            "Sentiment": "neutral",
            "PublishDate": 1762568120757,
            "Source": "corporate_governance"
        },
        {
            "Title": "ONGC to Announce Quarterly Results with Focus on Profitability and Dividend Updates",
            "Summary": "Oil and Natural Gas Corporation (ONGC) will announce its quarterly results on Monday, November 10. Market participants are watching for updates on profitability, production trends, and potential interim dividend announcements. Profit is expected to rise from the previous quarter, though volumes are anticipated to remain flat.",
            "Sentiment": "neutral",
            "PublishDate": 1762525910198,
            "Source": "earnings"
        },
        {
            "Title": "ONGC Announces Senior Management Changes Including Company Secretary Superannuation",
            "Summary": "Oil and Natural Gas Corporation Limited (ONGC) announced multiple senior management changes effective November 1, 2025. Rajni Kant, who served as Company Secretary and Compliance Officer, ceased to hold the position upon reaching superannuation age. Additionally, the company reported changes in senior management positions one level below the Board, involving Joseph Rozario Vijay Raj and Rajiv Nischal as Executive Directors. The changes were disclosed to stock exchanges as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761985556513,
            "Source": "corporate_governance"
        },
        {
            "Title": "ONGC Sets Record Date for Interim Dividend Consideration",
            "Summary": "Oil and Natural Gas Corporation Limited has fixed November 14, 2025 as the record date for determining member eligibility for interim dividend payment. The dividend decision will be made at a board meeting scheduled for November 10, 2025. The company has notified both NSE and BSE exchanges about this record date announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1761852748654,
            "Source": "corporate_action"
        },
        {
            "Title": "ONGC Withdraws Credit Ratings on Rs 1,360 Crore NCD Programme, Affirms Rs 1,000 Crore Balance",
            "Summary": "Oil and Natural Gas Corporation Limited (ONGC) announced that India Ratings and Research Private Limited has withdrawn the long-term rating of IND AAA/Stable on Rs 500 crore of Non-Convertible Debentures as the tranche has been redeemed with no outstanding amount. The rating agency also withdrew the IND AAA/Stable rating on ONGC's unutilized NCD programme of Rs 860 crore at the company's request. India Ratings affirmed the long-term rating of IND AAA/Stable for the balance NCD programme of Rs 1,000 crore. The rating agency maintains ONGC's strong linkages with the Government of India, which holds a 58.89% stake, and considers the company's dominant market position in domestic crude oil and natural gas production. ONGC reported consolidated oil and gas production of 51.36 mmtoe and standalone revenue of Rs 1,378.46 billion. The company's proven reserves stand at 775.42 million metric tonnes of oil equivalent as of March 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761851737582,
            "Source": "corporate_action"
        },
        {
            "Title": "ONGC Appoints Shashi Bhushan Singh As Interim Compliance Officer",
            "Summary": "Oil and Natural Gas Corporation (ONGC) has appointed Shashi Bhushan Singh to the position of interim compliance officer.",
            "Sentiment": "neutral",
            "PublishDate": 1761741691643,
            "Source": "corporate_governance"
        },
        {
            "Title": "ONGC Schedules Board Meeting for November 10 to Review Quarterly Results and Interim Dividend",
            "Summary": "Oil and Natural Gas Corporation Limited has announced a Board of Directors meeting scheduled for November 10, 2025. The board will consider and approve the company's un-audited financial results for the quarter and half year ended September 30, 2025, covering both standalone and consolidated results. The board will also evaluate a recommendation for the first interim dividend. The company has implemented a trading window closure from October 1, 2025, which will remain in effect until November 12, 2025, for all insiders as per insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761320150691,
            "Source": "corporate_action"
        },
        {
            "Title": "ONGC Executive in Talks with Four Global Companies for Oil and Fuel Trading Partnership",
            "Summary": "ONGC's Co-Executive is currently negotiating with four global companies to establish a partnership in oil and fuel trading operations.",
            "Sentiment": "positive",
            "PublishDate": 1760363776546,
            "Source": "stock"
        },
        {
            "Title": "ONGC Explores Global Partnerships for Block Development and Production Enhancement",
            "Summary": "ONGC executives are discussing collaboration with global firms like Shell for the East Coast KG 98/2 block development. The company plans to fulfill exploration and production funding requirements using internal resources. ONGC is focusing on cost efficiency and identifies value potential in new initiatives worth ₹50 billion, with ₹130 billion capex allocated for the combined Western Offshore Development Project. The company is exploring partnerships with global companies to boost output and anticipates additional production of 19 million tons of oil and 22 BCM of gas from Mumbai High Fields over a 10-year period.",
            "Sentiment": "positive",
            "PublishDate": 1760362041593,
            "Source": "stock"
        },
        {
            "Title": "ONGC Forecasts Crude Oil Prices at $60-65 Per Barrel for Next 2-3 Years",
            "Summary": "ONGC executives predict crude oil prices will remain between $60-65 per barrel over the next 2-3 years. The company plans to develop 100 new wells for the MH Field by FY28 and FY29 as part of BP-TSP progress. ONGC expects continued oil price volatility driven by rising demand, supply changes, and the transition to clean energy. The company is focusing on cost efficiency through more than 20 projects valued at ₹43 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1760361683532,
            "Source": "stock"
        },
        {
            "Title": "ONGC Market Cap Falls Behind Zomato Despite Holding Assets Worth Over Third of Its Valuation",
            "Summary": "ONGC's market capitalisation of ₹3.097 lakh crore now trails behind Zomato (₹3.36 lakh crore), Hindustan Aeronautics Ltd (₹3.23 lakh crore), and Titan Company (₹3.13 lakh crore). The state-owned oil company was India's most valuable company in 2012 with ₹2.44 lakh crore market cap, but has grown only 26% over 13 years while competitors saw quantum jumps. ONGC now ranks 25th by market capitalisation. The company holds significant stakes including 71.63% in MRPL (worth ₹18,000 crore), 54.9% in HPCL (worth ₹52,770 crore), 14.20% in Indian Oil Corporation (worth ₹31,000 crore), and 5% in GAIL (worth ₹5,900 crore). Combined value of these holdings exceeds ₹1.07 lakh crore, representing over one-third of ONGC's current market cap. ONGC reported standalone net profit of ₹1.16 lakh crore over the last three financial years and paid dividends of ₹12.25 per ₹5 share, while Zomato had net profit of just ₹527 crore in FY25. Oil Minister Hardeep Singh Puri noted that state-owned oil PSUs are significantly undervalued despite their profitability.",
            "Sentiment": "negative",
            "PublishDate": 1760266584985,
            "Source": "stock"
        },
        {
            "Title": "ONGC Provides First Bond Guarantee in 15 Years for Subsidiary's $563 Million Fundraise",
            "Summary": "Oil and Natural Gas Corp (ONGC) has provided its first guarantee in 15 years for a rupee-denominated bond to be issued by subsidiary ONGC Petro Additions Ltd (OPAL) this quarter. OPAL, in which ONGC owns more than 95% stake, plans to raise 50 billion rupees ($563.22 million) through a multiple-tranche bond sale. The guarantee was provided after rating agency Crisil designated OPAL's bonds at AA+ rating, with ONGC's unconditional and irrevocable guarantee enhancing the credit rating to provisional AAA. ONGC's last such guarantee was in January 2010 for ONGC Videsh Ltd bonds. OPAL operates a petrochemical project in Gujarat and is seeking a five-year bond issue, currently in talks with large state-run investors to act as anchor investors. The company currently has outstanding bonds worth 17.60 billion rupees and last raised 1.60 billion rupees through bonds 15 months ago at 8.39% coupon rate.",
            "Sentiment": "positive",
            "PublishDate": 1760001155844,
            "Source": "stock"
        },
        {
            "Title": "ONGC Partners with APM to Develop Offshore Oil and Gas Logistics Facility",
            "Summary": "ONGC has announced plans to collaborate with APM to establish an offshore oil and gas logistics facility. The partnership aims to develop infrastructure to support offshore energy operations.",
            "Sentiment": "positive",
            "PublishDate": 1758777030017,
            "Source": "stock"
        }
    ]
}