{
    "Symbol": "ONMOBILE",
    "ISIN": "INE809I01019",
    "News": [
        {
            "Title": "OnMobile Global Q3FY26 Results: Profit Drops 37%",
            "Summary": "OnMobile Global reported Q3FY26 standalone net profit of Rs 27.15 million, down 37% YoY. Revenue fell 48% to Rs 426.14 million. Board appointed Manoranjan Mohapatra as Independent Director.",
            "Sentiment": "negative",
            "PublishDate": 1770311741326,
            "Source": "co_actions_results"
        },
        {
            "Title": "OnMobile Global Board Meet Set for Feb 5, 2026",
            "Summary": "OnMobile Global Limited announces board meeting on February 5, 2026 to approve Q3 FY26 unaudited financial results, followed by management conference call on February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768811765828,
            "Source": "co_actions_results"
        },
        {
            "Title": "OnMobile Global Reports Q2 FY26 Results with 12% Growth in Mobile Gaming Revenue",
            "Summary": "OnMobile Global Limited announced its financial results for Q2 FY26 ended September 30, 2025. The company reported revenue of INR 1,310 million, up 2.7% quarter-on-quarter. Mobile gaming revenue reached INR 355 million, showing 12% growth quarter-on-quarter, with the gaming subscriber base expanding 14% to 13.7 million users. EBITDA increased significantly by 32.3% to INR 86 million compared to the previous quarter. The company closed the quarter with a gross cash balance of INR 1,295 million. President and COO Bikram Singh Sherawat highlighted mobile gaming as a key performance driver and pivotal growth engine. Global CFO Radhika Venugopal noted improved operating efficiency, cost discipline, and stronger operating cash flows contributing to the financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1762275367361,
            "Source": "earnings"
        },
        {
            "Title": "OnMobile Global Targets Profitable Growth Through Gaming Platforms and AI-Based Content Monetization",
            "Summary": "OnMobile Global is pursuing profitable growth through its Gamize and Challenges Arena platforms. The company is enhancing AI-based content monetization capabilities while expanding globally across Europe, Latin America, and Africa. OnMobile is targeting a margin turnaround by FY27 and aims to achieve a diversified digital entertainment revenue mix.",
            "Sentiment": "positive",
            "PublishDate": 1762269194666,
            "Source": "stock"
        },
        {
            "Title": "OnMobile Global Reports Q2 Net Profit of 60M Rupees After Previous Year Loss",
            "Summary": "OnMobile Global posted a consolidated net profit of 60 million rupees in Q2, compared to a loss of 118 million rupees in the same quarter last year. The company's Q2 revenue was 1.28 billion rupees, slightly down from 1.29 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762259010017,
            "Source": "earnings"
        },
        {
            "Title": "OnMobile Partners with Dialog Sri Lanka as Master Aggregator for Value-Added Services",
            "Summary": "OnMobile Global Limited has entered into a strategic partnership with Dialog Axiata PLC, Sri Lanka's leading connectivity provider, to serve as the Master Aggregator for Dialog's Value-Added Services (VAS) portfolio. The Master Aggregator platform will bridge Dialog with third-party content providers, consolidating services across entertainment, mobile gaming, infotainment and education into a unified ecosystem. OnMobile's mandate covers the full spectrum of the VAS ecosystem, including customer lifecycle management, technical integration, billing, support and analytics. The platform aims to streamline processes, ensure regulatory compliance, simplify payouts to content providers, and enable Dialog to scale its offerings efficiently while delivering personalized content to both prepaid and postpaid customers. This agreement represents an expansion of the existing relationship between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1758520167920,
            "Source": "stock"
        },
        {
            "Title": "OnMobile Launches Enterprise Engagement Solution for Vodafone Qatar",
            "Summary": "OnMobile has launched an advanced enterprise engagement solution for Vodafone Qatar using its Buzzmo platform. The deployment represents an expansion of OnMobile's enterprise services in the Middle East telecommunications market.",
            "Sentiment": "positive",
            "PublishDate": 1755755591010,
            "Source": "stock"
        },
        {
            "Title": "OnMobile Global Reports Strong Turnaround with ₹15.59 Crore Net Profit in Q1 FY2026",
            "Summary": "OnMobile Global Limited delivered a significant financial turnaround in Q1 FY2026. The company reported consolidated total income from operations of ₹147.71 crore, marking a 19.4% year-over-year increase from ₹123.70 crore. Net profit reached ₹15.59 crore compared to a loss of ₹15.29 crore in the same quarter last year. Standalone results showed even stronger performance with total income growing 75.6% to ₹71.73 crore and net profit of ₹21.89 crore versus a loss of ₹0.48 crore previously. Earnings per share improved to ₹1.47 from negative ₹1.44 in Q1 FY2025. The company demonstrated profitability improvements across both consolidated and standalone operations, with particularly strong growth in its core India business.",
            "Sentiment": "positive",
            "PublishDate": 1755241559153,
            "Source": "earnings"
        },
        {
            "Title": "OnMobile Global Targets $2 Million Monthly Gaming Subscription Revenue Through New Platform Launch",
            "Summary": "OnMobile Global aims to increase its gaming subscription revenue to $2 million monthly by launching a new platform. The company plans to leverage its base of over 12 million active gamers and strong telecom partnerships to achieve this target. The strategy focuses on targeting growing markets within a global gaming industry experiencing 10.5% growth.",
            "Sentiment": "positive",
            "PublishDate": 1755104756620,
            "Source": "stock"
        },
        {
            "Title": "OnMobile Global Reports Q1 Net Profit of 157M Rupees, Reversing Previous Year Loss",
            "Summary": "OnMobile Global reported a consolidated net profit of 157 million rupees in Q1, compared to a loss of 153.2 million rupees in the same period last year. Revenue grew to 1.25 billion rupees from 1.23 billion rupees year-over-year. The company's EBITDA turned positive at 63 million rupees versus a loss of 8 million rupees in the previous year, with EBITDA margin improving to 5% from negative 0.63%.",
            "Sentiment": "positive",
            "PublishDate": 1755097853679,
            "Source": "earnings"
        },
        {
            "Title": "OnMobile Global Reports Q4 Financial Results",
            "Summary": "OnMobile Global has released its Q4 financial results. The company reported revenue of 1.56 billion rupees, up from 1.2 billion rupees in the same quarter last year. However, the company also reported a consolidated net loss of 79.3 million rupees, compared to a loss of 6 million rupees in the previous year. Sequentially, the loss increased from 50.9 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747760589000,
            "Source": "result"
        },
        {
            "Title": "OnMobile Global to Consider Q4 Results on May 20",
            "Summary": "OnMobile Global Limited has announced that it will consider and approve its financial results for the fourth quarter on May 20. This is a routine corporate announcement regarding the company's upcoming financial disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1745929721000,
            "Source": "default"
        },
        {
            "Title": "OnMobile Global to Close Qatar Branch in 2025",
            "Summary": "OnMobile Global has announced the closure of its Qatar branch, which will be effective from March 10, 2025. This decision represents a significant change in the company's operational structure in the Middle East region.",
            "Sentiment": "neutral",
            "PublishDate": 1741696422000,
            "Source": "corporate_action"
        },
        {
            "Title": "OnMobile Global Reports Mixed Q3 Results with Exceptional Loss",
            "Summary": "OnMobile Global has reported a profit before tax (PBT) of 105 million rupees for the third quarter, showing a significant increase from 37.99 million rupees in the same period last year. However, the company also incurred an exceptional loss of 49.7 million rupees during this period.",
            "Sentiment": "neutral",
            "PublishDate": 1738689629000,
            "Source": "earnings"
        },
        {
            "Title": "OnMobile Global Reports Q3 EBITDA Profit of 124.3 Million Rupees",
            "Summary": "OnMobile Global has reported a significant turnaround in its financial performance for the third quarter. The company posted an EBITDA profit of 124.3 million rupees, compared to a loss of 63 million rupees in the same period last year. This represents a positive shift in the company's operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738689606000,
            "Source": "earnings"
        },
        {
            "Title": "OnMobile Global Reports Significant Revenue Growth in Q3",
            "Summary": "OnMobile Global has announced its financial results for the third quarter, reporting a substantial year-over-year increase in revenue. The company's revenue for Q3 reached 820.3 million rupees, compared to 365.6 million rupees in the same period last year, marking a significant growth in their financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738689590000,
            "Source": "earnings"
        },
        {
            "Title": "OnMobile Global Reports Increased Q3 Net Profit",
            "Summary": "OnMobile Global has reported a net profit of 43.17 million rupees for the third quarter, showing an increase from 38.3 million rupees year-over-year and 21.2 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738689578000,
            "Source": "earnings"
        },
        {
            "Title": "OnMobile Global to Raise Up to 3 Billion Rupees Through QIP and Other Modes",
            "Summary": "OnMobile Global has announced plans to raise funds up to 3 billion rupees. The company intends to use Qualified Institutional Placement (QIP) and other funding modes to achieve this capital raise.",
            "Sentiment": "positive",
            "PublishDate": 1732893963000,
            "Source": "corporate_action"
        },
        {
            "Title": "OnMobile Global to Consider Issuance of Securities, Including QIP",
            "Summary": "OnMobile Global has announced a board meeting scheduled for November 29 to discuss and potentially approve the issuance of eligible securities through various modes, including Qualified Institutional Placement (QIP). This decision suggests the company may be looking to raise capital or restructure its securities.",
            "Sentiment": "neutral",
            "PublishDate": 1732535546000,
            "Source": "corporate_action"
        },
        {
            "Title": "OnMobile Global Partners with Deosphere for Advanced Gaming & AI Edge Network",
            "Summary": "OnMobile Global has announced a partnership with Deosphere to deploy a cutting-edge global gaming and AI edge network. This collaboration aims to leverage advanced technologies to enhance gaming experiences and AI capabilities on a global scale.",
            "Sentiment": "positive",
            "PublishDate": 1731374811000,
            "Source": "corporate_action"
        },
        {
            "Title": "OnMobile Global Reports Q2 Loss, Exceptional Item Noted",
            "Summary": "OnMobile Global has reported a loss before tax of 74.4 million rupees in Q2, compared to a profit of 121.9 million rupees in the same quarter last year. The company also noted an exceptional item of 34.12 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731346000000,
            "Source": "result"
        },
        {
            "Title": "OnMobile Global Reports Significant Drop in Q2 EBITDA",
            "Summary": "OnMobile Global's Q2 EBITDA has fallen sharply to 6.14 million rupees from 79 million rupees in the same quarter last year. The company's EBITDA margin also decreased significantly, dropping to 0.47% from 5.92% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731345944000,
            "Source": "result"
        },
        {
            "Title": "OnMobile Global Reports Q2 Revenue",
            "Summary": "OnMobile Global announced its second quarter revenue of 1.29 billion rupees, compared to 1.3 billion rupees in the same quarter last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731345934000,
            "Source": "result"
        },
        {
            "Title": "OnMobile Global Reports Q2 Net Loss",
            "Summary": "OnMobile Global has reported a consolidated net loss of 118.4 million rupees for the second quarter, compared to a profit of 85 million rupees in the same period last year. The loss has increased from 153.2 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731345921000,
            "Source": "result"
        },
        {
            "Title": "Ajay Upadhyaya Acquires 1.65% Stake in OnMobile Global",
            "Summary": "<p><span class=\"positive\">Investor</span> Ajay Upadhyaya has <b>emerged as a significant shareholder</b> in OnMobile Global, <span class=\"positive\">holding a 1.65% stake</span> in the company during the second quarter of the fiscal year. This information was revealed in the company's <span class=\"neutral\">latest shareholding disclosure</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728547978000,
            "Source": "normal_news"
        }
    ]
}