{
    "Symbol": "ONWARDTEC",
    "ISIN": "INE229A01017",
    "News": [
        {
            "Title": "Onward Technologies Clarifies Disclosure Timing",
            "Summary": "Onward Technologies explains delay in regulatory disclosure was due to late receipt of order after business hours on January 28, 2026, requiring legal review before announcement on January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770037046786,
            "Source": "stocks"
        },
        {
            "Title": "Onward Technologies Wins US Court Petition Appeal",
            "Summary": "Onward Technologies' US subsidiary successfully vacated an ex-parte judgment from Cook County Circuit Court. The court granted OTI's petition and provided 30 days to file defense in the wage dispute case.",
            "Sentiment": "positive",
            "PublishDate": 1769768917077,
            "Source": "stocks"
        },
        {
            "Title": "Onward Technologies Allots 7,400 Shares Under ESOP 2019",
            "Summary": "Onward Technologies Limited has allotted 7,400 equity shares at ₹20 per share under its Employee Stock Option Scheme 2019, bringing total issued shares to 2,27,50,370 and share capital to ₹22,75,03,700.",
            "Sentiment": "positive",
            "PublishDate": 1769764726748,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onward Technologies Q3 FY26 Revenue Grows 11.7% to ₹411.8 Cr",
            "Summary": "Onward Technologies delivered strong Q3 FY26 performance with revenue of ₹411.8 crores (11.7% YoY growth) and EBITDA margin of 13.9%. The company maintained double-digit growth guidance while expanding offshore capabilities across three verticals.",
            "Sentiment": "positive",
            "PublishDate": 1769164647701,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onward Technologies Q3FY26 Net Profit Rises 67.4% YoY",
            "Summary": "Onward Technologies reported consolidated net profit of ₹1,010.20 lakhs for Q3FY26, up 67.4% YoY. Revenue grew 9.1% to ₹13,461.73 lakhs despite sequential decline.",
            "Sentiment": "positive",
            "PublishDate": 1768549313163,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onward Technologies Q3 Revenue Flat at ₹1.4B YoY",
            "Summary": "Onward Technologies reported Q3 revenue of ₹1.4 billion, remaining flat compared to same quarter last year, while EBIT margin declined to 11.5% with net profit falling to ₹101M.",
            "Sentiment": "neutral",
            "PublishDate": 1768548757117,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onward Technologies Board Meet Set for Jan 16",
            "Summary": "Onward Technologies Limited has scheduled its board meeting for January 16, 2026, to approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767957821267,
            "Source": "co_actions_results"
        },
        {
            "Title": "Onward Technologies Reports Record Quarter with 14.3% EBITDA Margin Growth",
            "Summary": "Onward Technologies delivered a record quarter in terms of revenue and EBITDA growth, with EBITDA margins improving to 14.3%. The company operates across three verticals - Industrial Equipment and Heavy Machinery (largest vertical), Transportation & Mobility, and Healthcare. Managing Director Jigar Mehta reported that attrition declined to 15.49%, DSO remained at 73 days, and headcount stayed steady at 2,525 employees. The company has invested approximately INR 18 crores in infrastructure upgrades across delivery centers in Bangalore, Hyderabad, Pune, and Chennai. Revenue has grown from INR 100 crores to INR 500 crores over five years while maintaining the same headcount. The business has shifted from primarily India-focused to predominantly North American and European markets. Management expects to deliver double-digit revenue and EBITDA growth and sees strong demand in the US manufacturing industry, particularly in AI adoption. The company operates with about 70 clients and focuses on deepening existing relationships rather than acquiring new clients.",
            "Sentiment": "positive",
            "PublishDate": 1761319797020,
            "Source": "earnings"
        },
        {
            "Title": "Onward Technologies Reports Record Q2FY26 Revenue of ₹140.1 Crore with 14.3% EBITDA Margin",
            "Summary": "Onward Technologies Limited reported consolidated total revenue of ₹140.1 crore for the quarter ended September 30, 2025, marking a 12.4% year-over-year increase and 3.3% quarter-over-quarter growth. The company achieved a record EBITDA margin of 14.3%, expanding 144 basis points sequentially from 12.9% in the previous quarter. EBITDA grew 151.9% year-over-year to ₹19.9 crore. Profit after tax reached ₹11.9 crore, up 230.6% year-over-year, though down 6.5% quarter-over-quarter. For the half-year period, total revenue increased 13.0% to ₹275.7 crore with EBITDA margin at 13.6%. The software outsourcing company, specializing in digital and ER&D services, maintained its focus on three key verticals: Industrial Equipment & Heavy Machinery (63% of revenue), Transportation & Mobility (34%), and Healthcare & Life Sciences (3%). The company employs 2,525 people with attrition at 15.49% and maintains 74 active clients, with top 25 clients contributing 87% of total revenues.",
            "Sentiment": "positive",
            "PublishDate": 1760688700007,
            "Source": "earnings"
        },
        {
            "Title": "Onward Tech Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Onward Tech reported quarterly revenue of 1.4 billion rupees, up from 1.3 billion rupees in the previous quarter. The company's EBIT increased to 118 million rupees from 108 million rupees quarter-on-quarter, with EBIT margin improving to 8.47% from 8.09%. However, consolidated net profit declined to 119 million rupees compared to 127 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760687006177,
            "Source": "earnings"
        },
        {
            "Title": "Onward Technologies Board Approves Quarterly Financial Results for September 2025",
            "Summary": "Onward Technologies Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The board meeting was held on October 17, 2025, commencing at 11:50 AM and concluding at 12:45 PM. The financial results were accompanied by Limited Review Reports from statutory auditors BSR & Co. LLP. The consolidated results include 6 subsidiaries: Onward Technologies Inc., Onward Technologies GmbH, Onward Technologies B.V., Onward Technologies Canada Inc., OT Park Private Limited, and Onward Technologies Employee Welfare Trust. The auditors noted that 4 subsidiaries' interim financial information were not reviewed but were deemed not material to the Group, with total assets of Rs. 3,482.30 lakhs and revenues of Rs. 1,293.00 lakhs for the quarter and Rs. 2,635.78 lakhs for the half year.",
            "Sentiment": "neutral",
            "PublishDate": 1760686975039,
            "Source": "earnings"
        },
        {
            "Title": "Onward Technologies Subsidiary Faces $414,439 Court Award in Illinois Wage Dispute",
            "Summary": "Onward Technologies Inc, a wholly owned subsidiary of Onward Technologies Limited, received a court order from the Circuit Court of Cook County, Illinois. The order awards damages of USD 414,439 plus USD 1,752.69 in costs, along with statutory penalties at 5% per month under the Illinois Wage Collection and Payment Act. The case relates to alleged non-payment of wage amounts to a plaintiff during employment. The company received the order on August 13, 2025, dated April 2, 2025. Onward Technologies is reviewing the order and assessing legal options, including a possible appeal. The company is evaluating financial and operational implications, stating no material impact on consolidated financial statements has been determined at present.",
            "Sentiment": "negative",
            "PublishDate": 1755191275317,
            "Source": "stock"
        },
        {
            "Title": "Onward Technologies Expands Chennai Operations to Largest Design Center in India",
            "Summary": "Onward Technologies Limited announced the expansion of its Chennai operations by relocating to its largest Design Center in India. The Mumbai-headquartered digital engineering services provider plans to increase its Chennai workforce capacity from 1,000 employees to 2,000 employees. The Chennai design center will support global clients from Industrial Equipment, Heavy Machinery, Transportation and Mobility industries with digital and engineering research & development services. Managing Director Jigar Mehta stated the expansion responds to growing demand for offshore services from USA and Europe clients. The center will feature state-of-the-art training centers, software labs, and employee amenities. Onward Technologies operates over 2,500 employees across 12 offices in 6 countries, with offshore development centers in Chennai, Pune, Bengaluru, and Hyderabad.",
            "Sentiment": "positive",
            "PublishDate": 1754880509496,
            "Source": "stock"
        },
        {
            "Title": "Onward Technologies Relocates European Offices to Birmingham and Munich",
            "Summary": "Onward Technologies Limited has relocated its European offices to Birmingham, UK, and Munich, Germany. The company states this strategic move aims to align more closely with key automotive and global mobility industry customers and reflects a shift in its international business model.",
            "Sentiment": "positive",
            "PublishDate": 1754022039243,
            "Source": "stock"
        },
        {
            "Title": "Onward Technologies Reports Record Q1 FY26 Results with 12.9% EBITDA Margin",
            "Summary": "Onward Technologies achieved consolidated revenues of INR 135.6 crores and EBITDA margin of 12.9% in Q1 FY26, both the highest in company history. Managing Director Jigar Mehta attributed the performance to seamless execution and operational efficiencies through automation. The company maintains around 2,570 full-time employees with 16.5% LTM attrition rate and serves 75+ customers across Industrial Equipment & Heavy Machinery and Transportation & Mobility verticals in North America and Europe. Onward has upgraded its Pune office and plans to open its largest design center in Chennai during Q2. The company targets double-digit revenue and EBITDA growth annually, with internal projections to reach approximately 2,700 employees by March 2025. Management expects headcount growth over coming quarters as engagements mature and the global delivery model scales.",
            "Sentiment": "positive",
            "PublishDate": 1753182499284,
            "Source": "earnings"
        },
        {
            "Title": "Onward Technologies: Q1 Profit Surges 80%, Revenue Up 13.56%",
            "Summary": "Onward Technologies reported Q1 FY26 consolidated net profit of ₹12.73 crore, up 80% YoY. Revenue increased 13.56% to ₹135.61 crore. EBITDA margin improved to 12.9%. Industrial Equipment & Heavy Machinery segment contributed 59% of revenue, followed by Transportation & Mobility at 36%. Total headcount at 2,570 with 16.5% LTM attrition rate.",
            "Sentiment": "positive",
            "PublishDate": 1752657554000,
            "Source": "earnings"
        },
        {
            "Title": "Onward Tech Reports Q1 Financial Results",
            "Summary": "Onward Tech has released its Q1 financial results. The company's revenue increased to 1.33 billion rupees from 1.28 billion rupees in the previous quarter. EBIT (Earnings Before Interest and Taxes) rose to 137 million rupees from 104 million rupees quarter-over-quarter. The EBIT margin improved to 10.5% from 8.2% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752644431000,
            "Source": "result"
        },
        {
            "Title": "Onward Tech Reports Quarterly Net Profit Increase",
            "Summary": "Onward Tech has reported a consolidated net profit of 127 million for the most recent quarter, compared to 104 million in the previous quarter, representing a quarter-over-quarter increase.",
            "Sentiment": "positive",
            "PublishDate": 1752644369000,
            "Source": "result"
        },
        {
            "Title": "Onward Tech Reports Q4 Results and Declares Dividend",
            "Summary": "Onward Tech has announced its Q4 financial results and a dividend declaration. The company's Q4 consolidated net profit increased to 104 million rupees from 60 million rupees in the previous quarter. Q4 revenue rose to 1.27 billion rupees from 1.23 billion rupees quarter-over-quarter. EBIT for Q4 was 104 million rupees, up from 79 million rupees, with EBIT margin improving to 8.18% from 6.41% in the previous quarter. Additionally, the company has declared a dividend of 5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747380529000,
            "Source": "result"
        },
        {
            "Title": "Onward Technologies: Q3 Profit Dips 11%, Revenue Up 8%",
            "Summary": "Onward Technologies reported Q3 FY25 results with profit at ₹6.04 crore, down 11.05% YoY, and revenue at ₹123.39 crore, up 8.15% YoY. Operating income increased by 31.18% YoY. EPS stood at ₹2.63, a 11.15% YoY decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1737609476000,
            "Source": "earnings"
        },
        {
            "Title": "Onward Technologies Reports Improved Q3 Financial Performance",
            "Summary": "Onward Technologies has reported significant improvement in its third quarter financial results. The company's Earnings Before Interest and Taxes (EBIT) increased to 79 million rupees, up from 46 million rupees in the previous quarter. Additionally, the EBIT margin expanded to 6.41% from 3.80% quarter-over-quarter, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737445995000,
            "Source": "earnings"
        },
        {
            "Title": "Onward Technologies Reports Stable Q3 Revenue",
            "Summary": "Onward Technologies has reported a quarterly revenue of 1.23 billion rupees for Q3, which remains unchanged compared to the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737445963000,
            "Source": "earnings"
        },
        {
            "Title": "Onward Technologies Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Onward Technologies has reported a consolidated net profit of 60 million rupees for the third quarter, showing an increase from 35 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737445927000,
            "Source": "earnings"
        },
        {
            "Title": "Onward Technologies to Consider Q3 Results",
            "Summary": "Onward Technologies has announced that it will consider its third quarter (Q3) financial results on January 21.",
            "Sentiment": "neutral",
            "PublishDate": 1736863374000,
            "Source": "earnings"
        },
        {
            "Title": "Onward Technologies Forecasts Improved EBITDA Performance",
            "Summary": "Onward Technologies expects to achieve an EBITDA margin of 9% to 11% for the current year. The company also anticipates a higher EBITDA figure in the upcoming year compared to the current year, as stated in their conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1729481176000,
            "Source": "result"
        },
        {
            "Title": "Onward Technologies Aims for Revenue Growth in Current Fiscal Year",
            "Summary": "Onward Technologies has announced its revenue target for the current financial year during a conference call. The company is aiming to achieve revenue between ₹490 crore and ₹520 crore.",
            "Sentiment": "positive",
            "PublishDate": 1729480615000,
            "Source": "result"
        },
        {
            "Title": "Onward Technologies Reports Q2 Revenue Growth",
            "Summary": "Onward Technologies has reported a quarter-over-quarter increase in revenue for Q2. The company's revenue rose to 1.23 billion rupees, up from 1.18 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729244775000,
            "Source": "result"
        },
        {
            "Title": "Onward Technologies Reports Q2 Financial Results",
            "Summary": "Onward Technologies has reported its Q2 financial results. The company's EBIT (Earnings Before Interest and Taxes) for Q2 is 46 million rupees, down from 83 million rupees in the previous quarter. The EBIT margin has also decreased to 3.8% from 7.07% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729244734000,
            "Source": "result"
        },
        {
            "Title": "Onward Technologies Reports Q2 Net Profit Decline",
            "Summary": "Onward Technologies has reported a consolidated net profit of 35 million rupees for the second quarter, down from 71 million rupees in the previous quarter. This represents a significant quarter-on-quarter decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1729244672000,
            "Source": "result"
        }
    ]
}