{
    "Symbol": "OPTIEMUS",
    "ISIN": "INE350C01017",
    "News": [
        {
            "Title": "Optiemus Infracom Senior Management Personnel Retires",
            "Summary": "Optiemus Infracom Limited announces retirement of Mr. Sanjay Mirakhur, Associate Vice President, effective December 31, 2025, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767173762572,
            "Source": "stocks"
        },
        {
            "Title": "Optiemus Infracom Shifts Corporate Office to Sector-65",
            "Summary": "Optiemus Infracom Limited announces relocation of its corporate office from Sector-63 to Sector-65 in Noida, effective December 27, 2025, following board committee approval.",
            "Sentiment": "neutral",
            "PublishDate": 1766837494708,
            "Source": "stocks"
        },
        {
            "Title": "Optiemus Infracom Approves ₹30 Cr Corporate Guarantee",
            "Summary": "Optiemus Infracom's board committee approved corporate guarantee for ₹30 crores credit facility to wholly owned subsidiary Optiemus Electronics Limited through Axis Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1766836144166,
            "Source": "stocks"
        },
        {
            "Title": "Optiemus Infracom Allots 3.04 Lakh Equity Shares",
            "Summary": "Optiemus Infracom allotted 3,04,291 equity shares through warrant conversion at ₹672.25 per share, raising ₹20.46 crores and increasing paid-up capital to ₹88.69 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765871132806,
            "Source": "co_actions_results"
        },
        {
            "Title": "Optiemus Infracom Approves Rs 45 Crore Corporate Guarantee for Subsidiary",
            "Summary": "Optiemus Infracom's Operations and Administration Committee approved providing a corporate guarantee not exceeding Rs 45 crore for its wholly owned subsidiary Optiemus Electronics Limited. The guarantee will secure open credit arrangements with Lianzhou Technologies Co., Ltd for import of raw materials and will be treated as a contingent liability for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764327412003,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Seeks Shareholder Approval to Expand into Manufacturing of Electronic and Telecom Products",
            "Summary": "Optiemus Infracom Limited has issued a postal ballot notice seeking shareholder approval through special resolution to amend its Memorandum of Association to include manufacturing, assembling, and processing of electronic and telecommunication products. The e-voting period runs from November 19, 2025 to December 18, 2025, with the company aiming to achieve vertical integration and enhance competitiveness beyond its current wholesale trading operations.",
            "Sentiment": "positive",
            "PublishDate": 1763445230766,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Plans Aggressive Expansion With New Smartphone Facility and 30%+ Growth Target",
            "Summary": "Optiemus Infracom announced plans to commence production at its new smartphone facility next quarter as a key manufacturing partner for Nothing and other global OEMs, targeting 30%+ CAGR over 3 years. The company is expanding into AI devices and IoT ecosystems while aiming for 8%+ EBITDA margins as part of its strategy to establish India as a global hub for premium electronics manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1763136939080,
            "Source": "stock"
        },
        {
            "Title": "Optiemus Infracom Reports Mixed Q2 Results with Higher Profit Despite Revenue Decline",
            "Summary": "Optiemus Infracom posted Q2 consolidated net profit of 168 million rupees, up from 137 million rupees year-over-year, while revenue declined to 4.2 billion rupees from 4.8 billion rupees. The company's EBITDA improved to 336 million rupees from 289 million rupees, with EBITDA margin expanding to 8.04% from 6.07% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1763132906627,
            "Source": "earnings"
        },
        {
            "Title": "Optiemus Infracom Reports Quarterly Results and Proposes MOA Amendment for Electronics Business Expansion",
            "Summary": "Optiemus Infracom Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025, along with an amendment to its Memorandum of Association to expand into manufacturing and trading of electronic products, telecommunication products, and related accessories including tempered glass and screen protectors. The company will seek shareholder approval through postal ballot for the MOA amendment that broadens its business scope beyond current operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763121242864,
            "Source": "earnings"
        },
        {
            "Title": "Optiemus Infracom Approves Joint Venture for Electronics Manufacturing",
            "Summary": "Optiemus Infracom has approved the incorporation of a joint venture subsidiary called 'The Factory Private Limited' for manufacturing electronic products. The company will hold a 65 percent stake in this new venture.",
            "Sentiment": "positive",
            "PublishDate": 1761735921837,
            "Source": "stock"
        },
        {
            "Title": "Optiemus Infracom Receives Approval for Wholly Owned Subsidiary XO Ventures",
            "Summary": "Optiemus Infracom Limited received Ministry of Corporate Affairs approval for the incorporation of XO Ventures Private Limited as its wholly owned subsidiary on October 15, 2025. The company had previously submitted the required details under SEBI regulations on October 9, 2025. XO Ventures Private Limited is now officially incorporated as a subsidiary of Optiemus Infracom.",
            "Sentiment": "neutral",
            "PublishDate": 1760593435644,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Creates New Subsidiary XO Ventures for Electronic Products and Industrial Solutions",
            "Summary": "Optiemus Infracom has approved the creation of a new subsidiary called XO Ventures Private Limited. The new subsidiary will focus on electronic products and industrial solutions.",
            "Sentiment": "positive",
            "PublishDate": 1759993722094,
            "Source": "stock"
        },
        {
            "Title": "Optiemus Infracom Partners with Ordinary Theory USA for Smart Enterprise Hardware Manufacturing Joint Venture",
            "Summary": "Optiemus Infracom Limited signed a binding term sheet with Ordinary Theory LLC, USA on September 30, 2025, to establish a joint venture for manufacturing, developing, and selling smart enterprise hardware and integrated industrial solutions. Optiemus will hold a majority stake in the venture, which focuses on payments, retail, logistics, and AI solutions. The partnership aims to support India's Make in India initiative by leveraging Optiemus's production facilities in India and Ordinary Theory's expertise in fintech, logistics, retail, and AI solutions. The joint venture is subject to statutory approvals and completion of customary conditions. Chairman Ashok Kumar Gupta stated the partnership will strengthen manufacturing capabilities for smart enterprise hardware, while Ordinary Theory CEO Shen Tianzhou emphasized introducing innovative solutions to accelerate India's digital economy growth.",
            "Sentiment": "positive",
            "PublishDate": 1759212909970,
            "Source": "order&deals"
        },
        {
            "Title": "Optiemus Infracom Partners With Nothing Electronics for Manufacturing Operations",
            "Summary": "Optiemus Infracom has formed a partnership with Nothing Electronics for electronic product manufacturing. The partnership involves a planned investment of over $100 million and is expected to create more than 1,800 jobs in India.",
            "Sentiment": "positive",
            "PublishDate": 1758776568662,
            "Source": "order&deals"
        },
        {
            "Title": "Optiemus Infracom Invests Rs 77 Crore in Subsidiary Through Rights Issue",
            "Summary": "Optiemus Infracom Limited has approved an investment of Rs 7,69,99,728 in its wholly owned subsidiary Optiemus Electronics Limited (OEL). The company will acquire 2,46,794 equity shares at Rs 312 per share through a rights issue. OEL operates in manufacturing of mobile phones, hearables, wearables, IT hardware and telecom products with facilities in Noida. The subsidiary reported a turnover of Rs 23,118.60 lakhs and net worth of Rs 16,729.17 lakhs. The investment aims to support OEL's working capital requirements and business expansion through capital expenditure. The transaction is structured as a related party transaction conducted at arm's length basis with valuation by an independent valuer. The acquisition is expected to complete within 90 days and requires no regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1757500370045,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Inaugurates India's First Tempered Glass Manufacturing Plant in Noida",
            "Summary": "Optiemus Infracom has inaugurated India's first tempered glass manufacturing plant in Noida with an initial investment of ₹70 crore. The company plans a second phase that will create 4,500 jobs and require an investment of ₹800 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756542706918,
            "Source": "stock"
        },
        {
            "Title": "Optiemus Infracom Approves Board Changes and Modifies Rs 29,637 Crore Fund Deployment",
            "Summary": "Optiemus Infracom Limited's Board approved several key decisions on August 28, 2025. The company re-appointed Mr. Ashok Gupta as Whole-time Director and Executive Chairman for three years (April 2026 to March 2029) and Ms. Ritu Goyal as Independent Director for five years (April 2026 to March 2031), both subject to shareholder approval. Mr. Naresh Kumar Jain will cease as Independent Director on October 27, 2025, while Mr. Vishal Rajpal was appointed as new Independent Director for three years (October 2025 to October 2028). The Board also designated Mr. Kush Srivastava as Legal Head and Mr. Rajesh Rana as Taxation Head under senior management. Additionally, the company modified deployment of Rs 29,636.81 lakhs raised through preferential issue, with significant changes including increased allocation for working capital requirements from Rs 1,481.84 lakhs to Rs 6,570.47 lakhs. The 32nd Annual General Meeting is scheduled for September 30, 2025, with book closure from September 24-30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756370164825,
            "Source": "corporate_governance"
        },
        {
            "Title": "Optiemus Infracom Reports Monitoring Agency Compliance and Q1 FY26 Financial Results",
            "Summary": "Optiemus Infracom Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing no material deviation in the utilization of proceeds from its preferential issue. The company raised INR 296.368 crore through equity shares and warrants, reduced from the original INR 434.407 crore due to undersubscription. ICRA Limited confirmed proper fund utilization across subsidiary investments including Optiemus Electronics, GDN Enterprises, Optiemus Unmanned Systems, and Bharat Innovative Glass Technology. The company reported standalone operating revenue of INR 1,047 crore with 8% year-on-year growth, while consolidated revenue reached INR 4,353 crore with 59% growth. Key business developments include manufacturing partnerships with Realme, Xiaomi, and OnePlus in the EMS segment, launch of RhinoTech screen protector brand, progress on cover glass finishing facility with Corning USA, and drone segment trials with Indian Army commands. The chairman indicated aspirations to achieve four-digit EBITDA within 24-36 months.",
            "Sentiment": "positive",
            "PublishDate": 1755181154600,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Reports Mixed Q1 Results with Higher Profit Despite Revenue Decline",
            "Summary": "Optiemus Infracom reported Q1 consolidated net profit of 145.3 million rupees, up from 121.3 million rupees in the same period last year. However, revenue declined to 4.35 billion rupees from 4.92 billion rupees year-over-year. The company's EBITDA increased to 267.5 million rupees from 225.6 million rupees, while EBITDA margin improved to 6.15% from 4.58% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755166552773,
            "Source": "earnings"
        },
        {
            "Title": "Optiemus Infra Launches Rhinotech Tempered Glass Brand, Targets ₹2000 Crore Revenue by March 2027",
            "Summary": "Optiemus Infra has launched Rhinotech, a brand of Indian-made tempered glasses for mobile screens. The company has set a revenue target of ₹2000 crores by March 2027 for this new product line.",
            "Sentiment": "positive",
            "PublishDate": 1755068834511,
            "Source": "stock"
        },
        {
            "Title": "Optiemus Infracom Incorporates New Wholly Owned Subsidiary Optiemus Micro Electronics",
            "Summary": "Optiemus Infracom Limited has successfully incorporated a new wholly owned subsidiary named Optiemus Micro Electronics Private Limited. The Ministry of Corporate Affairs approved the incorporation on August 4, 2025. The company had previously submitted the required details under SEBI regulations in earlier communications dated July 14, 2025 and July 22, 2025. This development represents an expansion of Optiemus Infracom's corporate structure through the establishment of a new subsidiary entity.",
            "Sentiment": "positive",
            "PublishDate": 1754309855850,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Approves ₹26.86 Crore Investment in Subsidiary GDN Enterprises",
            "Summary": "Optiemus Infracom has approved an investment of ₹26.86 crore in its subsidiary GDN Enterprises. The investment is intended to strengthen manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1753361778104,
            "Source": "stock"
        },
        {
            "Title": "Optiemus Infracom Invests Rs. 26.86 Crore in Wholly Owned Subsidiary GDN Enterprises",
            "Summary": "Optiemus Infracom Limited's Operations and Administration Committee approved an additional investment of Rs. 26.86 crore in its wholly owned subsidiary GDN Enterprises Private Limited. The investment involves acquiring 6,88,820 equity shares at Rs. 390 per share through a rights issue, with each share having a face value of Rs. 10 and premium of Rs. 380. GDN Enterprises operates in manufacturing and assembly of electronic products, with a turnover of Rs. 1,109.93 crore and net worth of Rs. 104.67 crore as of March 31, 2025. The company has a manufacturing facility in Noida and produces mobile phones for over 10 global brands. The investment aims to support GDN's working capital requirements, business expansion, and capital expenditure needs. The transaction is structured as a related party transaction conducted at arm's length basis, valued by an independent valuer, and is expected to complete within 90 days.",
            "Sentiment": "positive",
            "PublishDate": 1753361746820,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Approves ₹268.6 Million Investment in GDN Enterprises",
            "Summary": "Optiemus Infracom has approved an investment of ₹268.6 million in GDN Enterprises. The approval represents a significant capital allocation decision by the company.",
            "Sentiment": "positive",
            "PublishDate": 1753361171932,
            "Source": "order&deals"
        },
        {
            "Title": "Optiemus Infracom Gets Approval to Create Two New Technology Units",
            "Summary": "Optiemus Infracom has received approval from the Ministry of Corporate Affairs to establish two new business units: Optiemus Vision Technology and Optiemus Display Technology. This corporate restructuring expands the company's operational structure into specialized technology segments.",
            "Sentiment": "positive",
            "PublishDate": 1753239812929,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Approves Rs 2.4 Crore Investment in Drone Manufacturing Subsidiary",
            "Summary": "Optiemus Infracom Limited has approved an investment of Rs 2.4 crore in its wholly owned subsidiary Optiemus Unmanned Systems Private Limited (OUS) through acquisition of 24 lakh equity shares at face value of Rs 10 each on a rights basis. The Operations and Administration Committee approved this transaction to support OUS's working capital requirements and business expansion through capital expenditure. OUS, incorporated in June 2024, is engaged in manufacturing unmanned aerial vehicles including drones for industries such as Defence, Agriculture, Mining, Solar Farms, Oil and Gas, Railways, and Highways. The subsidiary reported a turnover of Rs 11.70 lakh and negative net worth of Rs 495.96 lakh as of March 2025. The transaction is expected to complete within 90 days and will be paid in cash. Post-acquisition, Optiemus will hold 24.09 lakh shares in OUS, maintaining its wholly owned subsidiary status.",
            "Sentiment": "positive",
            "PublishDate": 1753160694824,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Reports Q4 EBITDA Decline",
            "Summary": "Optiemus Infracom's Q4 EBITDA decreased to 232 million rupees from 290 million rupees year-over-year. The company's Q4 EBITDA margin also declined to 5.16% from 5.93% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748263508000,
            "Source": "result"
        },
        {
            "Title": "Optiemus Infracom Reports Q4 Financial Results",
            "Summary": "Optiemus Infracom announced its Q4 consolidated net profit of 225 million rupees, compared to 240 million rupees year-over-year and 150 million rupees quarter-over-quarter. The company's Q4 revenue was 4.5 billion rupees, down from 4.9 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748263376000,
            "Source": "result"
        },
        {
            "Title": "Optiemus Electronics Partners with ASRock for Made-in-India Motherboards",
            "Summary": "Optiemus Electronics, a subsidiary of Optiemus Infracom, has entered into a partnership with Taiwan-based ASRock to manufacture motherboards in India. This collaboration expands Optiemus Electronics' product portfolio in the IT hardware segment and contributes to the 'Made in India' initiative.",
            "Sentiment": "positive",
            "PublishDate": 1745908457000,
            "Source": "default"
        },
        {
            "Title": "Optiemus Infra Launches 4 New Drones for Defence Sector",
            "Summary": "Optiemus Infra has expanded its product portfolio by introducing four new drones designed for the defence sector. This move demonstrates the company's commitment to delivering advanced technology solutions for military applications.",
            "Sentiment": "positive",
            "PublishDate": 1745390358000,
            "Source": "default"
        },
        {
            "Title": "Optiemus Infracom: Realme Partnership Boosts Stock by 10%",
            "Summary": "Optiemus Infracom's stock hit a 10% upper circuit, reaching ₹492.15, after announcing a partnership with Realme to manufacture AIoT products in India. Realme aims to produce all its AIoT portfolio in India, starting with earphones and smartwatches. The collaboration targets manufacturing 5 million AIoT devices annually and creating over 2,000 new jobs.",
            "Sentiment": "positive",
            "PublishDate": 1744788350000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Partners with Realme for AIoT Device Manufacturing in India",
            "Summary": "Optiemus Infracom has entered into a partnership with Realme to manufacture AIoT (Artificial Intelligence of Things) devices in India. This collaboration aims to boost domestic production of smart devices and aligns with India's push for local manufacturing in the tech sector.",
            "Sentiment": "positive",
            "PublishDate": 1744781845000,
            "Source": "default"
        },
        {
            "Title": "Optiemus Infracom Invests ₹21 Crore in BigTech Rights Issue",
            "Summary": "Optiemus Infracom has invested ₹21 crore in a rights issue of BigTech, aiming to strengthen its joint venture holding. This move indicates Optiemus Infracom's commitment to expanding its stake in the partnership and potentially enhancing its position in the market.",
            "Sentiment": "positive",
            "PublishDate": 1742797857000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom to Acquire Shares of Bigtech for 238 Million Rupees",
            "Summary": "Optiemus Infracom has announced its plan to acquire shares of Bigtech for a total of 238 million rupees. This acquisition represents a significant corporate action that could potentially impact the company's market position and financial structure.",
            "Sentiment": "neutral",
            "PublishDate": 1740355833000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom to Acquire Shares of Bigtech for 238 Million Rupees",
            "Summary": "Optiemus Infracom has announced its intention to acquire shares of Bigtech for a sum of 238 million Indian rupees. This acquisition represents a significant corporate action that could potentially impact the company's market position and financial structure.",
            "Sentiment": "neutral",
            "PublishDate": 1740134850000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Reports Q3 Financial Results",
            "Summary": "Optiemus Infracom has released its Q3 consolidated financial results. The company reported a net profit of 150 million rupees, down from 179 million rupees in the same quarter last year. Revenue for Q3 stood at 4.7 billion rupees, slightly lower than the 4.82 billion rupees reported in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1739320532000,
            "Source": "earnings"
        },
        {
            "Title": "Optiemus Infracom Reports Improved Q3 EBITDA and Margin",
            "Summary": "Optiemus Infracom has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 338 million rupees from 229 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 7.17% from 4.75% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739278276000,
            "Source": "earnings"
        },
        {
            "Title": "Optiemus Infracom Reports Q3 Financial Results",
            "Summary": "Optiemus Infracom announced its Q3 consolidated financial results. The company reported a net profit of 150 million rupees, down from 179 million rupees in the same quarter last year. Revenue for Q3 stood at 4.7 billion rupees, slightly lower than the 4.82 billion rupees reported in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1739278241000,
            "Source": "earnings"
        },
        {
            "Title": "Optiemus Infracom Announces Strategic Partnership for Connected Devices",
            "Summary": "Optiemus Infracom has entered into a strategic partnership to address India's growing demand for connected devices. This collaboration aims to boost the production of 'Made in India' electronics and expand their reach to export markets. The initiative aligns with India's push for domestic manufacturing and technological self-reliance.",
            "Sentiment": "positive",
            "PublishDate": 1737957135000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Partners with TP-Link for Manufacturing in India",
            "Summary": "Optiemus Infracom has announced a partnership with TP-Link to manufacture network and IoT devices in India. This collaboration aims to produce these devices domestically, potentially boosting local manufacturing and aligning with India's push for self-reliance in technology production.",
            "Sentiment": "positive",
            "PublishDate": 1737957123000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Partners with Kunway Technology for Drone Manufacturing in India",
            "Summary": "Optiemus Infracom has entered into a partnership with Taiwan-based Kunway Technology to promote drone manufacturing localization in India. The company's unit, OUS, will be responsible for selling, manufacturing, and localizing selected drone products for the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1736900126000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Partners with Kunway Technology for Drone Manufacturing in India",
            "Summary": "Optiemus Infracom has announced a partnership with Taiwan-based Kunway Technology to promote drone manufacturing localization in India. The company's unit OUS will be responsible for selling, manufacturing, and localizing selected products for the Indian market. This collaboration aims to boost domestic drone production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1736858187000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom to Acquire 14.7 Million Shares of Bigtech",
            "Summary": "Optiemus Infracom has announced its intention to acquire 14.7 million shares of Bigtech. The acquisition is valued at 147 million rupees, indicating a strategic move to expand its holdings or influence in Bigtech.",
            "Sentiment": "neutral",
            "PublishDate": 1736511424000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Partners with LS Spectrum for Drone-based Spectrum Analysis in India",
            "Summary": "Optiemus Infracom has announced a partnership with LS Spectrum to introduce drone-based spectrum analysis services in India. This collaboration aims to leverage drone technology for advanced spectrum analysis, potentially improving telecommunications infrastructure and services across the country.",
            "Sentiment": "positive",
            "PublishDate": 1735863449000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Partners with LS Spectrum for Drone-Based Spectrum Analysis in India",
            "Summary": "Optiemus Infracom has entered into a partnership with LS Spectrum to conduct drone-based spectrum analysis in India. This collaboration aims to leverage drone technology for analyzing and potentially improving wireless spectrum utilization in the country.",
            "Sentiment": "positive",
            "PublishDate": 1735827243000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Subsidiary Appoints Military Consultant",
            "Summary": "Optiemus Unmanned Systems Private Limited (OUS), a wholly owned subsidiary of Optiemus Infracom Limited, has appointed Lieutenant General Anil Chandra Chait as a consultant.",
            "Sentiment": "neutral",
            "PublishDate": 1734428505000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Optiemus Infracom Approves Preferential Share Issue Worth 1.47 Billion Rupees",
            "Summary": "Optiemus Infracom has approved a preferential issue of shares totaling up to 1.47 billion rupees. This corporate action indicates the company is raising capital through the issuance of new shares to select investors.",
            "Sentiment": "positive",
            "PublishDate": 1734048738000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Approves Preferential Share Issue Worth 1.47 Billion Rupees",
            "Summary": "Optiemus Infracom has approved a preferential issue of shares totaling up to 1.47 billion Indian rupees. This corporate action involves issuing new shares to select investors, potentially to raise capital for the company's operations or expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1734007759000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom to Consider Fundraising on December 12",
            "Summary": "Optiemus Infracom has announced that it will hold a meeting on December 12 to consider raising funds. The company has not provided details on the amount or purpose of the potential fundraising at this time.",
            "Sentiment": "neutral",
            "PublishDate": 1733449682000,
            "Source": "corporate_action"
        },
        {
            "Title": "Optiemus Infracom Reports Significant Revenue Growth in Q2",
            "Summary": "Optiemus Infracom, an Indian telecommunications company, has reported a substantial increase in its second-quarter revenue. The company's revenue for Q2 reached 4.8 billion rupees, compared to 2.74 billion rupees in the same period last year, representing a year-over-year growth of approximately 75%.",
            "Sentiment": "positive",
            "PublishDate": 1731500164000,
            "Source": "result"
        }
    ]
}