{
    "Symbol": "ORBTEXP",
    "ISIN": "INE231G01010",
    "News": [
        {
            "Title": "Orbit Exports Board Meet Set for Jan 30 Q3 Results",
            "Summary": "Orbit Exports Limited has scheduled a board meeting on January 30, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769525525317,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orbit Exports Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Orbit Exports Limited has issued a postal ballot notice seeking member approval for the appointment of Ms. Raveena Modi (DIN: 11041551) as Non-Executive Independent Director for a five-year term until September 26, 2030. The remote e-voting period runs from November 19, 2025 to December 18, 2025, with results to be announced by December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763374263625,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orbit Exports Approves Q2 FY26 Results, Appoints Independent Director",
            "Summary": "Orbit Exports Ltd approved its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue from operations of ₹5,272.06 lakhs for the quarter compared to ₹5,753.38 lakhs in the same quarter last year. Net profit after tax stood at ₹902.05 lakhs versus ₹1,578.27 lakhs in the corresponding quarter. For the half year, standalone revenue was ₹11,572.51 lakhs against ₹10,681.07 lakhs in the previous year, with net profit of ₹2,327.30 lakhs compared to ₹2,501.07 lakhs. On a consolidated basis, quarterly revenue was ₹5,718.73 lakhs versus ₹5,910.32 lakhs last year, with net profit of ₹1,005.26 lakhs against ₹1,599.72 lakhs. The company also appointed Ms. Raveena Modi as Non-Executive Independent Director with effect from October 07, 2025, for a five-year term concluding September 26, 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1760611608137,
            "Source": "earnings"
        },
        {
            "Title": "Orbit Exports Corrects Director Appointment Details for Ms. Raveena Modi",
            "Summary": "Orbit Exports Limited issued a corrigendum correcting details about Ms. Raveena Modi's appointment as Additional Director. The company clarified that Modi was appointed as a Non-Executive Director effective September 27, 2025, and will transition to an Independent Director role upon her registration in the Independent Directors Data Bank. Her five-year term will conclude on September 26, 2030, subject to member approval. Modi holds an LL.B. from Government Law College Mumbai, is a qualified Company Secretary, and brings over nine years of experience in corporate litigation, insolvency proceedings, and regulatory compliance. She has worked with top-tier law firms and contributed to regulatory policy through SEBI's Working Group.",
            "Sentiment": "neutral",
            "PublishDate": 1760453508539,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orbit Exports Limited Appoints Ms. Raveena Modi as Non-Executive Independent Director",
            "Summary": "Orbit Exports Limited has appointed Ms. Raveena Modi as an Additional Director in the category of Non-Executive Independent Director with immediate effect from September 27, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Ms. Modi holds DIN 11041551 and has been appointed for a term of 5 years, subject to approval by members through General Meeting or Postal Ballot. She is an LL.B. from Government Law College, Mumbai, a qualified Company Secretary with a background in Accounting and Finance. Ms. Modi brings over nine years of experience in corporate and commercial litigation, insolvency and bankruptcy proceedings, regulatory compliance, and real estate advisory. She has worked with top-tier law firms and currently practices independently in Hyderabad. She has contributed to regulatory policy through her work with SEBI's Working Group and has experience in handling complex legal transactions and disputes. Ms. Modi is not debarred from holding office of an Independent Director and has no relationships with other directors.",
            "Sentiment": "positive",
            "PublishDate": 1758983173631,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orbit Exports Reports 25% Growth in Q1 EBITDA to 189 Million Rupees",
            "Summary": "Orbit Exports achieved Q1 EBITDA of 189 million rupees, representing a year-over-year increase from 151 million rupees. The company's EBITDA margin was 28.75% compared to 29.02% in the same period last year, showing a slight decline of 27 basis points despite the absolute earnings growth.",
            "Sentiment": "positive",
            "PublishDate": 1753279323952,
            "Source": "earnings"
        },
        {
            "Title": "Orbit Exports Reports 53% Jump in Quarterly Net Profit to 150 Million Rupees",
            "Summary": "Orbit Exports delivered strong quarterly performance with consolidated net profit rising to 150 million rupees compared to 98 million rupees in the same period last year, marking a 53% year-on-year increase. The company's revenue also grew significantly to 659 million rupees from 519 million rupees in the previous year, representing a 27% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1753278918788,
            "Source": "earnings"
        },
        {
            "Title": "Orbit Exports to Acquire 26% Stake in K&H Construction",
            "Summary": "Orbit Exports has announced plans to acquire a 26% stake in K&H Construction. The acquisition is valued at up to 7.5 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1752583895000,
            "Source": "default"
        },
        {
            "Title": "Orbit Exports Reports Strong Q4 EBITDA Growth",
            "Summary": "Orbit Exports has announced its Q4 financial results, showing significant year-over-year improvement. The company's EBITDA increased to 115 million rupees from 82 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 23.11% from 18.94% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1745929294000,
            "Source": "result"
        },
        {
            "Title": "Orbit Exports Reports Q4 FY2023 Financial Results",
            "Summary": "Orbit Exports announced its Q4 financial results. The company's consolidated net profit increased to 66 million rupees, up from 56 million rupees year-over-year. Revenue also saw growth, reaching 497 million rupees compared to 435 million rupees in the same quarter last year. The quarterly performance remained stable with net profit at 66 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745929214000,
            "Source": "result"
        },
        {
            "Title": "Orbit Exports Reports Improved Q3 EBITDA and Margin",
            "Summary": "Orbit Exports has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 116 million rupees from 90 million rupees in the same quarter last year. The EBITDA margin also improved to 21.95% from 20.41% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738931434000,
            "Source": "earnings"
        },
        {
            "Title": "Orbit Exports Reports Increased Q3 Profits and Revenue",
            "Summary": "Orbit Exports has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 66 million rupees from 54 million rupees in the previous year. Revenue also saw a substantial rise, reaching 530 million rupees compared to 440 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738931426000,
            "Source": "earnings"
        },
        {
            "Title": "Orbit Exports Plans 300M Rupee Capacity Expansion at Valsad Plant",
            "Summary": "Orbit Exports has announced plans to undertake a capital expenditure of 300 million rupees to increase the production capacity of its plant located in Valsad.",
            "Sentiment": "positive",
            "PublishDate": 1731933577000,
            "Source": "corporate_action"
        }
    ]
}