{
    "Symbol": "ORCHPHARMA",
    "ISIN": "INE191A01027",
    "News": [
        {
            "Title": "Orchid Pharma Q3FY26 Earnings Call Set for Feb 12",
            "Summary": "Orchid Pharma Limited announces analysts/investors earnings call on February 12, 2026 at 4:30 PM IST to discuss Q3FY26 financial results ended December 31, 2025, hosted by Systematix Institutional Equities.",
            "Sentiment": "neutral",
            "PublishDate": 1770375884146,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orchid Pharma Q2 FY26 Results: Revenue Declines 13% YoY to INR 194 Crores Amid Antibiotics Market Downturn",
            "Summary": "Orchid Pharma reported quarterly sales of INR 194 crores, down 13% year-on-year, with gross margins compressed to 32% from 43% due to inventory revaluation and weak antibiotic market conditions. The company completed acquisition of global rights to Enmetazobactam (Exblifep) and reported strong domestic performance with 15,000 patients treated and 200,000+ vials sold through its Orblicef brand partnership with Cipla.",
            "Sentiment": "negative",
            "PublishDate": 1763376197784,
            "Source": "earnings"
        },
        {
            "Title": "Orchid Pharma Reports Delays in QIP-Funded Projects, Revises Fund Allocation",
            "Summary": "Orchid Pharma Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of Rs. 400 crore raised through Qualified Institutional Placement. The company revised the allocation of QIP proceeds among project objectives following shareholder approval through AGM resolution dated September 20, 2025. Two key projects face implementation delays: the investment in Orchid BioPharma Limited for setting up manufacturing facility in Jammu, and funding capital expenditure for new API facility block in Alathur, Tamil Nadu, though the extent of delays remains unascertainable. For the Jammu project, Rs. 73.02 crores has been utilized as of September 30, 2025, with land acquisition challenges cited as the primary cause of delay. Registration of 164.50 Kanal out of 203.8 Kanal identified land has been completed, with remaining land registration expected by December 2025. The Alathur project delay is attributed to dependency on the Jammu 7ACA project, with only Rs. 0.36 crores utilized. The company has deployed unutilized proceeds in fixed deposits with Yes Bank Limited. CARE Ratings Limited served as the monitoring agency and reported no deviation from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1763021959531,
            "Source": "corporate_action"
        },
        {
            "Title": "Orchid Pharma Plans Capacity Expansion and New Product Launches with 13% Revenue Growth Target",
            "Summary": "Orchid Pharma is targeting capacity expansion and new product launches across Cephalosporin and Carbapenem APIs. The company projects FY26 revenue growth of 13% year-on-year. A new plant in Chennai is being commissioned to enhance API output by 25%. The company is focusing on export market penetration and backward integration. The R&D pipeline includes 8 new molecules. Orchid Pharma expects volume-led growth and higher EBITDA margins in FY26-27.",
            "Sentiment": "positive",
            "PublishDate": 1762875924942,
            "Source": "stock"
        },
        {
            "Title": "Orchid Pharma Reports Strong Q2 Performance with 12% Revenue Growth and Profit Turnaround",
            "Summary": "Orchid Pharma Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported standalone net sales of Rs 193.52 crores compared to Rs 172.93 crores in the previous quarter, marking growth in revenue. The company achieved a standalone profit before tax of Rs 20.23 crores for the current quarter versus Rs 204.29 crores in the previous quarter. Basic earnings per share stood at Rs 0.44 for the quarter. The company completed acquisitions of 100% assets of Alectra Therapeutics GmbH, Germany and Alectra Therapeutics SAS, France, gaining global ownership of Enmetazobactam antibiotic molecule. Orchid Pharma also acquired 100% share capital of Weichensee 1272 VV GmbH, Germany, now renamed as Orchid Pharma Europe GmbH. The Board of Directors approved the unaudited financial results in a meeting held on November 11, 2025. The company has submitted a petition for amalgamation with its holding company Dhanuka Laboratories Limited to the National Company Law Tribunal, Chennai bench.",
            "Sentiment": "positive",
            "PublishDate": 1762855375500,
            "Source": "earnings"
        },
        {
            "Title": "Orchid Pharma Reports Q2 Losses After Previous Year Gains",
            "Summary": "Orchid Pharma reported an EBITDA loss of 15 million rupees in Q2, compared to a gain of 296 million rupees in the same period last year. The company also posted a consolidated net loss of 57 million rupees versus a profit of 256 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762854923085,
            "Source": "earnings"
        },
        {
            "Title": "Orchid Pharma Completes Acquisition of Allecra Therapeutics Assets",
            "Summary": "Orchid Pharma Limited has successfully completed the acquisition of assets from Allecra Therapeutics GmbH on October 29, 2025. The transaction, which was initially announced on July 30, 2025, was finalized after all conditions precedent were met. Following the completion, Orchid Pharma now owns all intellectual property and commercial contracts of Allecra. The company informed stock exchanges NSE and BSE about the transaction closure.",
            "Sentiment": "positive",
            "PublishDate": 1761838899374,
            "Source": "corporate_action"
        },
        {
            "Title": "Orchid Pharma Acquires Global Rights to Enmetazobactam from Allecra, Q1 Revenue Drops 29%",
            "Summary": "Orchid Pharma Limited reported quarterly sales of INR 173 crores compared to INR 244 crores in the same period last year, marking a 29% decline. The company attributed this performance to an unprecedented global slowdown in the antibiotics market, with both prices and volumes under pressure. Despite challenges, the company maintained gross margins at around 42% and operational EBITDA of INR 14 crores. In a significant development, Orchid acquired global rights to Enmetazobactam and trademark Exblifep from Allecra following the latter's insolvency. This acquisition gives Orchid complete control over regulatory and commercial strategy for the novel antibiotic worldwide, with double-digit royalties from Advanz in Europe now flowing directly to Orchid. The product is already licensed in Europe, Middle East, and North African markets through existing agreements. Management expects the antibiotics market challenges to persist through the current year, with no revival anticipated in the near future. The company's 7ACA project in Jammu continues as planned, and the Cefiderocol project remains on track for December 2026 launch.",
            "Sentiment": "neutral",
            "PublishDate": 1755174933373,
            "Source": "earnings"
        },
        {
            "Title": "Orchid Pharma Plans Cost Reduction Strategy to Counter Weak Sales Performance",
            "Summary": "Orchid Pharma is implementing cost-cutting measures to maintain profit margins amid declining sales performance. The pharmaceutical company plans to leverage its API portfolio, explore export opportunities, and improve operational efficiency to drive medium-term revenue and profit growth.",
            "Sentiment": "neutral",
            "PublishDate": 1755016967141,
            "Source": "stock"
        },
        {
            "Title": "Orchid Pharma Reports Strong Q1 Results with 59% Jump in Standalone Profit, Appoints Auditors for Multiple Years",
            "Summary": "Orchid Pharma Limited reported standalone profit of Rs 1,819.74 lakhs for the quarter ended June 30, 2025, compared to Rs 2,910.26 lakhs in the same quarter last year. Net sales from operations declined to Rs 17,292.88 lakhs from Rs 24,440.61 lakhs year-over-year. On a consolidated basis, profit reached Rs 1,491.06 lakhs versus Rs 2,935.06 lakhs in the previous year quarter. The company's Board approved the appointment of internal auditor for FY 2025-26, cost auditor for FY 2025-26 subject to shareholder ratification, and secretarial auditor for five consecutive years from FY 2025-26 to FY 2029-30, pending shareholder approval. The Annual General Meeting is scheduled for September 20, 2025, with e-voting commencing September 17, 2025. Earnings per share on standalone basis was Rs 3.59 compared to Rs 5.74 in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754994105984,
            "Source": "earnings"
        },
        {
            "Title": "Orchid Pharma Receives French Court Approval to Acquire Allecra Therapeutics Assets",
            "Summary": "Orchid Pharma Limited has received approval from the French court to acquire the assets of Allecra Therapeutics SAS, with the acquisition taking effect from August 01, 2025. The court order finalizes the asset purchase that was previously announced by the company on July 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754410961085,
            "Source": "order&deals"
        },
        {
            "Title": "Orchid Pharma Shares Hit Upper Circuit After Buyback of Global Rights to Novel Antibiotic",
            "Summary": "Orchid Pharma shares surged 5% to hit the upper circuit at ₹740.10, extending gains for a second consecutive session. The company acquired 100% global ownership of its novel antibiotic Enmetazobactam, which it had originally developed in-house but out-licensed in 2013. The drug, marketed as EXBLIFEB internationally by Germany-based Allecra Therapeutics and as Orblicef in India, received regulatory approval from the European Medicines Agency in January 2024 and USFDA approval in February 2024. Allecra had previously out-licensed regional rights to Shanghai Haini for China in a $78 million deal in 2020 and to Advanz Pharma for the EU market. Industry estimates suggest the drug has global peak sales potential of $150-200 million. Orchid described the buyback as a 'full repatriation of India's first novel antibiotic' and expects the move to be financially accretive while strengthening its anti-infective portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1753938396235,
            "Source": "stock"
        },
        {
            "Title": "Orchid Pharma Acquires Allecra Therapeutics Assets to Gain 100% Global Ownership of Enmetazobactam",
            "Summary": "Orchid Pharma Limited has entered into agreements to acquire assets of Allecra Therapeutics GmbH and Allecra Therapeutics SAS, including intellectual property rights and trademarks related to Enmetazobactam. The company signed an agreement with the Insolvency Administrator of Allecra Therapeutics GmbH (Germany) to purchase all assets including intellectual property, trademarks, customer contracts, regulatory filings and tangible/intangible assets, subject to condition precedents. A French court accepted Orchid Pharma's binding bid for acquiring assets including intellectual property rights and trademarks of Allecra Therapeutics SAS, with formal order expected shortly. Upon completion, Orchid Pharma will possess 100% global ownership of Enmetazobactam (internationally known as EXBLIFEP, known as Orblicef in India), consolidating rights previously split across entities. This marks the full repatriation of the first novel antibiotic molecule discovered in India back to India. The company expects the consolidation to provide global growth and expansion opportunities and be financially beneficial.",
            "Sentiment": "positive",
            "PublishDate": 1753887104986,
            "Source": "order&deals"
        },
        {
            "Title": "Orchid Pharma Acquires German Company for European Market Expansion",
            "Summary": "Orchid Pharma Limited has acquired 100% share capital of Weilchensee 1272. V V GmbH, a German company, for Euro 28,500. The acquired entity has been renamed Orchid Pharma Europe GmbH and is now a wholly owned subsidiary. The target company is a shelf company incorporated on June 24, 2025, under German laws with a paid-up capital of Euro 25,000 and no current turnover or business operations. The acquisition aims to facilitate market expansion into Europe for Orchid Pharma's pharmaceutical business. The transaction was completed through cash consideration and required only fund remittance approvals under Reserve Bank of India norms. The acquisition is not classified as a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1753886629658,
            "Source": "order&deals"
        },
        {
            "Title": "Orchid Pharma Signs ₹1,425 Million Agreement with HDFC Bank",
            "Summary": "Orchid Pharma has entered into an agreement with HDFC Bank to secure funding of ₹1,425 million. The funds are intended for the Cefiderocol project, though specific details about the project are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752758846000,
            "Source": "default"
        },
        {
            "Title": "NCLT Rules on Dispute Between Orchid Pharma and DBS Bank",
            "Summary": "The National Company Law Tribunal (NCLT) has issued a ruling regarding the ongoing legal dispute between Orchid Pharma and DBS Bank. This decision is expected to impact the company's financial situation, though specific details of the ruling are not provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749217910000,
            "Source": "default"
        },
        {
            "Title": "USFDA Issues EIR with VAI Status for Orchid Pharma",
            "Summary": "Orchid Pharma has announced that the U.S. Food and Drug Administration (USFDA) has issued an Establishment Inspection Report (EIR) with Voluntary Action Indicated (VAI) status. This decision comes after the USFDA accepted the company's response to observations raised during a previous inspection.",
            "Sentiment": "positive",
            "PublishDate": 1748522310000,
            "Source": "default"
        },
        {
            "Title": "Orchid Pharma: Q4 Revenue Up, EBITDA Margin Declines",
            "Summary": "Orchid Pharma reported Q4 FY25 revenue of Rs 2,375 million, up 9.4% YoY and 9.3% QoQ. EBITDA was Rs 280 million, down 3.2% YoY but up 6.1% QoQ. EBITDA margin decreased to 11.8%, down 154 bps YoY and 35 bps QoQ.",
            "Sentiment": "neutral",
            "PublishDate": 1748323210000,
            "Source": "earnings"
        },
        {
            "Title": "Orchid Pharma Reports Improved Q4 EBITDA and Margin",
            "Summary": "Orchid Pharma has reported its latest quarterly results. The company's EBITDA for Q4 increased to 343.3 million rupees from 289.2 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 14.46% from 13.32% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748259653000,
            "Source": "result"
        },
        {
            "Title": "Orchid Pharma Reports Q4 Financial Results",
            "Summary": "Orchid Pharma has announced its financial results for the fourth quarter. The company reported revenue of 2.37 billion rupees, compared to 2.17 billion rupees in the same quarter last year. Net profit for the quarter stood at 278.5 million rupees, down from 332 million rupees year-over-year, but up from 239 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748259643000,
            "Source": "result"
        },
        {
            "Title": "Orchid Pharma Reaches Settlement with DBS India Bank",
            "Summary": "Orchid Pharma has entered into a joint memorandum of compromise with DBS India Bank to resolve an ongoing dispute. The agreement involves a settlement amount of 76.2 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744200766000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orchid Pharma: FDA Inspection Complete, EU GMP Certification Renewed",
            "Summary": "Orchid Pharma's API facility in Alathur, Tamil Nadu completed a USFDA inspection with seven minor observations. The facility also renewed its EU GMP certification. It remains India's only FDA-approved site for sterile cephalosporins.",
            "Sentiment": "positive",
            "PublishDate": 1740022231000,
            "Source": "normal_news"
        },
        {
            "Title": "Orchid Pharma's Alathur API Facility Passes USFDA Inspection and Renews EU GMP Certificate",
            "Summary": "Orchid Pharma has announced two significant regulatory achievements. First, their Alathur API facility successfully completed a USFDA inspection, resulting in only seven minor observations. Second, the company secured a renewal of its EU GMP certificate for Cephalosporin API manufacturing. These developments indicate the company's compliance with international quality standards and potentially strengthen its position in global pharmaceutical markets.",
            "Sentiment": "positive",
            "PublishDate": 1740010544000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orchid Pharma: USFDA Inspection Success at Alathur API Facility",
            "Summary": "Orchid Pharma's API facility in Alathur, Tamil Nadu, passed a surprise USFDA inspection with only minor observations. The facility remains India's only USFDA-approved site for sterile cephalosporins. It also renewed its EU GMP certification.",
            "Sentiment": "positive",
            "PublishDate": 1739971526000,
            "Source": "normal_news"
        },
        {
            "Title": "Orchid Pharma's Alathur API Facility Passes USFDA Inspection and Secures EU GMP Certificate Renewal",
            "Summary": "Orchid Pharma has announced that its Alathur API facility has successfully completed a USFDA inspection, resulting in seven minor observations. Additionally, the company has secured a renewal of its EU GMP certificate for Cephalosporin API manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1739968602000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orchid Pharma Reports Q3 Financial Results",
            "Summary": "Orchid Pharma announced its Q3 consolidated financial results. The company reported a net profit of 208 million rupees, down from 294 million rupees in the same quarter last year. Revenue remained stable at 2.2 billion rupees, unchanged from the previous year's Q3.",
            "Sentiment": "neutral",
            "PublishDate": 1739360005000,
            "Source": "earnings"
        },
        {
            "Title": "Orchid Pharma to Consider Q3 Results",
            "Summary": "Orchid Pharma has announced that it will consider its third quarter (Q3) financial results on February 12. This indicates the company is preparing to disclose its performance for the latest financial quarter to stakeholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738848386000,
            "Source": "result"
        },
        {
            "Title": "Orchid Pharma Launches Orblicef Drug in India",
            "Summary": "Orchid Pharma has successfully launched Orblicef, a drug product for Enmetazobactam combination, in the Indian market during the last week of September. The company has established a marketing partnership with Cipla, which is expected to boost sales in the coming months.",
            "Sentiment": "positive",
            "PublishDate": 1731382505000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orchid Pharma's New Product Outperforms PIP-TAZ in Clinical Trial",
            "Summary": "Orchid Pharma reported that their new product demonstrated superior efficacy compared to PIP-TAZ in a large-scale clinical trial. The study involved over 1,000 patients and showed an efficacy rate of 79% for Orchid Pharma's product versus 59% for PIP-TAZ.",
            "Sentiment": "positive",
            "PublishDate": 1731382386000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orchid Pharma Reports 27% Increase in Q2 Net Profit",
            "Summary": "Orchid Pharma has announced its financial results for the second quarter, reporting a net profit of 256 million rupees. This represents a significant increase from the 202 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth of approximately 27%.",
            "Sentiment": "positive",
            "PublishDate": 1731317331000,
            "Source": "result"
        }
    ]
}