{
    "Symbol": "ORCHASP",
    "ISIN": "INE215B01022",
    "News": [
        {
            "Title": "Orchasp Limited Reports Q3FY26 Results & Board Changes",
            "Summary": "Orchasp Limited announced Q3FY26 unaudited financial results with net profit of Rs. 19.03 lakhs and appointed two new directors while three independent directors completed their tenures.",
            "Sentiment": "neutral",
            "PublishDate": 1770718624028,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orchasp Clarifies INDUSAYUSH App Launch Timeline",
            "Summary": "Orchasp Limited provides additional details about the timing of INDUSAYUSH platform admission on Google Play Store, clarifying the announcement timeline following compliance inquiry.",
            "Sentiment": "neutral",
            "PublishDate": 1767338672075,
            "Source": "stocks"
        },
        {
            "Title": "Orchasp Board Approves Preferential Allotment Implementation",
            "Summary": "Orchasp Limited board formally approves allotment of 2.69 crore equity shares worth ₹8.60 crores to promoter Mrs. P. Rajeswari for loan conversion, following earlier exchange approvals.",
            "Sentiment": "positive",
            "PublishDate": 1765561088503,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orchasp Incorporates US Subsidiary for Healthcare Platform",
            "Summary": "Orchasp Limited establishes wholly-owned subsidiary Orchasp Inc in USA with USD 10,000 share capital to market healthcare platform indusayush and enable mobile app hosting on Android and iOS platforms.",
            "Sentiment": "positive",
            "PublishDate": 1765467189049,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orchasp Limited Reports Quarterly Loss with Auditor Qualifications on Subsidiary Investment",
            "Summary": "Orchasp Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported a net loss of Rs 30.50 lakhs for the quarter compared to a profit of Rs 72.64 lakhs in the same period last year. For the half year, the net loss was Rs 1,427.58 lakhs. Revenue from operations decreased to Rs 753.80 lakhs from Rs 458.59 lakhs in the previous year quarter. The auditors issued a qualified opinion citing concerns about a Rs 6,825 lakhs investment in Portuguese subsidiary Cybermate International which has been non-operational for over four years and faces cancellation of incorporation certificate. Additional qualifications include unpaid statutory dues including TDS, and trade receivables overdue for more than six months without proper confirmations. The company attributed delays in statutory payments to receivables realization issues due to adverse market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1762851449279,
            "Source": "earnings"
        },
        {
            "Title": "Orchasp Limited Reports 137% Revenue Growth in Q1 2025, Faces Auditor Qualifications",
            "Summary": "Orchasp Limited announced its quarterly results for the period April-June 2025, showing revenue from operations of Rs 775.19 lakhs compared to Rs 347.77 lakhs in the same quarter last year, representing a 123% increase. The company reported a profit after tax of Rs 54.22 lakhs versus Rs 22.83 lakhs in the previous year quarter. However, auditors JMT & Associates issued a qualified opinion highlighting several concerns: a Rs 6,825 lakhs investment in Portuguese subsidiary Cybermate International which has been non-operational for over four years and faces cancellation of incorporation due to statutory filing defaults; unpaid statutory dues for Provident Fund and Employees' State Insurance; and trade receivables and payables outstanding for over six months without external confirmations. The company acknowledged these issues, attributing delays to adverse business conditions and stating it is working to resolve the Portuguese subsidiary matter and expects to recover substantial receivables in the coming quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754905195847,
            "Source": "earnings"
        }
    ]
}