{
    "Symbol": "ORIANA",
    "ISIN": "INE0OUT01019",
    "News": [
        {
            "Title": "Oriana Power Wins ₹186 Cr Solar Project Award",
            "Summary": "Oriana Power secures award to establish 50 MW solar power project worth ₹186 crore in EPC segment, marking significant expansion in renewable energy infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1766377601176,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriana Power Reports Strong H1 Performance with Revenue More Than Doubling",
            "Summary": "Oriana Power delivered robust H1 results with revenue surging to 7.8 billion rupees from 3.6 billion rupees year-over-year, while EBITDA increased to 1.8 billion rupees from 754 million rupees. The company's consolidated net profit more than doubled to 1.2 billion rupees from 485 million rupees, with EBITDA margin improving to 23.1% from 20.97%.",
            "Sentiment": "positive",
            "PublishDate": 1763112593998,
            "Source": "earnings"
        },
        {
            "Title": "Oriana Power Signs Rs. 476.13 Crore Deal for 75 MW Solar Plant with Battery Storage",
            "Summary": "Oriana Power has signed a contract worth approximately Rs. 476.13 crore for a 75 MW solar power plant project. The deal includes 111.57 MWH battery storage systems and is scheduled for completion within 8 months.",
            "Sentiment": "positive",
            "PublishDate": 1755510092200,
            "Source": "stock"
        },
        {
            "Title": "Oriana Power Secures ₹212 Crore for Battery Energy Storage Project in Karnataka",
            "Summary": "Oriana Power has obtained ₹212 crore in funding for a 50 MW/100 MWh Battery Energy Storage Project. The project is to be developed for Karnataka Power Transmission Corporation Limited (KPTCL) in Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1752467250000,
            "Source": "default"
        },
        {
            "Title": "Oriana Power Secures 1.9 Billion Rupee Contract",
            "Summary": "Oriana Power has been awarded a contract worth 1.9 billion rupees. The contract duration is set for 18 months. No further details about the nature of the contract or the client were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752035281000,
            "Source": "default"
        },
        {
            "Title": "Oriana Power Receives Approval for 125 MW/250 MWh Battery Storage Project",
            "Summary": "Oriana Power has obtained approval for a battery energy storage project with a capacity of 125 MW/250 MWh. The project is valued at 4.65 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1751885498000,
            "Source": "default"
        },
        {
            "Title": "Oriana Power Secures ₹98.63 Crore EPC Contract for Solar Project in Bihar",
            "Summary": "Oriana Power has been awarded an Engineering, Procurement, and Construction (EPC) contract worth ₹98.63 crore for a 20 MW solar power project in Bihar. The contract includes a 3-year operations and maintenance agreement. This initiative represents a significant solar energy development in the region.",
            "Sentiment": "positive",
            "PublishDate": 1749195046000,
            "Source": "default"
        },
        {
            "Title": "Oriana Power Signs MOU with Assam Government for Solar and Battery Project",
            "Summary": "Oriana Power has signed a Memorandum of Understanding (MOU) with the Government of Assam for a solar and battery energy storage project. The project involves an investment of 5 billion rupees (approximately $60 million USD). This agreement signifies Oriana Power's commitment to expanding renewable energy infrastructure in the northeastern state of India.",
            "Sentiment": "positive",
            "PublishDate": 1740715780000,
            "Source": "corporate_action"
        },
        {
            "Title": "Oriana Power Secures 384 Million Rupee Order",
            "Summary": "Oriana Power has received a significant order valued at 384 million rupees. This order represents a substantial business opportunity for the company, potentially boosting its revenue and market position in the power sector.",
            "Sentiment": "positive",
            "PublishDate": 1737418805000,
            "Source": "order&deals"
        },
        {
            "Title": "Oriana Power Secures 384 Million Rupee Order",
            "Summary": "Oriana Power has received a significant order valued at 384 million rupees. This order represents a substantial business opportunity for the company and could potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1737382845000,
            "Source": "order&deals"
        },
        {
            "Title": "Oriana Power Signs MoU with Rajasthan for Renewable Energy Projects",
            "Summary": "Oriana Power has signed a Memorandum of Understanding (MoU) with the state of Rajasthan to explore investment opportunities in renewable energy projects. The potential investment value is estimated to be up to 100 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734396756000,
            "Source": "corporate_action"
        },
        {
            "Title": "Oriana Power: Rs 10,000 Crore Green Energy Investment in Rajasthan",
            "Summary": "Oriana Power has signed an MoU with the Rajasthan government to invest Rs 10,000 crore in green energy projects. The agreement, signed during the Rising Rajasthan Global Summit 2024, covers development of solar, floating solar, green hydrogen, and energy storage solutions in the state.",
            "Sentiment": "positive",
            "PublishDate": 1734345430000,
            "Source": "corporate_action"
        },
        {
            "Title": "Oriana Power Secures 19.26 MW Solar Power Plant Order",
            "Summary": "Oriana Power has received an order worth 835.6 million rupees from NTPC-Vidyut Vyapar Nigam Ltd for the development of a 19.26 MW solar power plant.",
            "Sentiment": "positive",
            "PublishDate": 1730897685000,
            "Source": "corporate_action"
        },
        {
            "Title": "Oriana Power: Secures Rs 375-Crore Solar Plant Contract in Maharashtra",
            "Summary": "Oriana Power Ltd. has won a contract from Maharashtra State Electricity Distribution Co. to build a 75-megawatt AC solar power plant. The project, part of the PM-KUSUM scheme, is valued at Rs 375 crore and includes a Rs 78 crore subsidy. It has a 12-month completion timeline and a 25-year contract span.",
            "Sentiment": "positive",
            "PublishDate": 1729091956000,
            "Source": "normal_news"
        },
        {
            "Title": "Oriana Power Secures 75MW Solar Power Plant Contract with Subsidy",
            "Summary": "Oriana Power has been awarded a new contract for a 75MW(AC) solar power plant. The project comes with a Central Financial Assistance (CFA) or subsidy of approximately 780 million rupees. The estimated cost of construction for this project is 3.75 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729081525000,
            "Source": "corporate_action"
        }
    ]
}