{
    "Symbol": "ORICONENT",
    "ISIN": "INE730A01022",
    "News": [
        {
            "Title": "Oricon Enterprises Board Restructuring",
            "Summary": "Oricon Enterprises appoints three new directors including Joint MD-CFO and Executive Director, while accepting resignation of Executive Director effective February 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769517656202,
            "Source": "stocks"
        },
        {
            "Title": "Oricon Enterprises Sells Aluminium Tubes Unit for ₹2.38 Cr",
            "Summary": "Oricon Enterprises Limited has completed the sale of its aluminium collapsible tubes manufacturing unit located in Thane, Maharashtra to Precise Multitube Packaging for a total consideration of ₹2.38 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767267208093,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oricon Enterprises Approves Asset Sale for Production",
            "Summary": "Oricon Enterprises has approved the sale of assets related to aluminium tube production operations in Thane, marking a significant corporate development for the packaging company.",
            "Sentiment": "neutral",
            "PublishDate": 1767005626683,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oricon Enterprises Re-appoints Independent Director",
            "Summary": "Oricon Enterprises Limited successfully passes special resolution for re-appointment of Mr. Sumant Mimani as Independent Director for second five-year term with 99.99% approval through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1766845048007,
            "Source": "stocks"
        },
        {
            "Title": "Oricon Enterprises Reports Mixed Q2 Results, Reappoints Independent Director",
            "Summary": "Oricon Enterprises approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025, showing revenue from operations of Rs 461.56 lakhs for the quarter. The Board also reappointed Mr. Sumant Mimani as Independent Director for a second 5-year term from December 29, 2025 to December 28, 2030, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1763174990230,
            "Source": "earnings"
        },
        {
            "Title": "Oricon Enterprises Transfers Metal Crown Seals and Roll-On Pilfer-Proof Closures Business to Guala Closures India",
            "Summary": "Oricon Enterprises has transferred its metal crown seals and roll-on pilfer-proof closures business to Guala Closures (India) Private Limited. The transaction involves the divestiture of a specific product line segment from Oricon's operations to Guala Closures India.",
            "Sentiment": "neutral",
            "PublishDate": 1762252467663,
            "Source": "order&deals"
        },
        {
            "Title": "Oricon Enterprises Completes Asset Transfer of Maharashtra Petrochemical Unit to Narendra Plastochem",
            "Summary": "Oricon Enterprises Limited has completed the transfer of its Petrochemical Unit assets located in Village Niphan and Anandwadi District Raigad, Maharashtra to Narendra Plastochem Private Limited. The asset transfer was executed under an Asset Purchase Agreement and became effective on October 15, 2025. The company disclosed this transaction to stock exchanges BSE and NSE under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1760528025426,
            "Source": "corporate_action"
        },
        {
            "Title": "Oricon Enterprises Shareholders Approve Sale of Metal Crown Seals Business to Guala Closures",
            "Summary": "Oricon Enterprises Limited received shareholder approval for the sale and transfer of its Metal Crown Seals and Roll On Pilfer Proof Closures business to GUALA CLOSURES (INDIA) PRIVATE LIMITED through a slump sale on a going concern basis. The special resolution was passed by postal ballot on September 16, 2025. The voting results showed 99.99% approval with 100,580,394 votes polled out of 157,047,715 total shares. Promoter and promoter group held 103,185,059 shares and voted 100% in favor, while public non-institutional shareholders voted 99.93% in favor. The transaction involves the manufacturing, trading and sale business segment being transferred as a complete unit.",
            "Sentiment": "positive",
            "PublishDate": 1758096446707,
            "Source": "order&deals"
        },
        {
            "Title": "Oricon Enterprises Promoter Group Reduces Shareholding Through Inter-Group Transfer",
            "Summary": "Oricon Enterprises Limited's promoter group has completed an off-market sale transaction that reduced their collective shareholding from 11.93% to 2.96%. The transaction involved multiple promoter group entities including Namrata Somani, Surendra Somani, Vandana Somani, and Varun Somani, along with associated companies. Most individual promoters reduced their holdings significantly, with Namrata Somani, Surendra Somani, and Varun Somani reducing their stakes to zero. Vandana Somani's holding decreased from 3.444% to 0.007%. The company's equity share capital increased from INR 3,141.49 lakhs to INR 3,414.49 lakhs following the transaction. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1757679122317,
            "Source": "corporate_action"
        },
        {
            "Title": "Adarsh Somani Increases Stake in Oricon Enterprises to 37.97% Through Off-Market Acquisition",
            "Summary": "Adarsh Somani and associated persons have increased their collective shareholding in Oricon Enterprises Limited from 30.60% to 40.39%. Adarsh Somani acquired 11,569,000 shares (7.37% stake) through off-market transactions, raising his individual holding from 2.68% to 10.05%. The promoter group includes 11 entities comprising family members, trusts, HUFs, and companies. The company's equity share capital increased from INR 3,141.49 lakhs to INR 3,414.49 lakhs following the acquisition. Oricon Enterprises is listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757336405528,
            "Source": "corporate_action"
        },
        {
            "Title": "Adarsh Somani and Associated Parties to Acquire 10.31% Stake in Oricon Enterprises",
            "Summary": "Adarsh Somani, along with Hazarimal Somani Partnership Firm and other persons acting in concert, will acquire 1.61 crore shares representing 10.31% of Oricon Enterprises Limited. The acquisition involves purchasing shares from eight entities including Parijat Shipping and Finale Limited, Oriental Enterprises Partnership Firm, and Sarvamangal Mercantile Company Limited. The transaction is scheduled for September 1, 2025, with shares priced at Rs 54.54 per equity share or prevailing market price. Some transfers from family members including Namrata Somani, Varun Somani, Surendra Somani, and Vandana Somani will be executed as gifts without consideration. The acquisition is aimed at resolving family disputes and settling inequalities in family business partition. Post-transaction, the acquirer group's shareholding will increase from 30.60% to 40.91%, while seller shareholding will decrease from 11.93% to 1.61%.",
            "Sentiment": "neutral",
            "PublishDate": 1756109905109,
            "Source": "corporate_action"
        },
        {
            "Title": "Oricon Enterprises Reports Strong Q1 FY2026 Results with 163.5% Revenue Growth",
            "Summary": "Oricon Enterprises Limited published its Q1 FY2026 financial results showing significant growth across key metrics. On a standalone basis, total income from operations increased 163.5% year-over-year to Rs. 400.27 crore, while net profit after tax rose 151.3% to Rs. 182.14 crore. Earnings per share improved to Rs. 13.10 from Rs. 5.21 in the previous year. Consolidated results showed total income growing 68.6% to Rs. 659.48 crore, with the company turning around from a net loss of Rs. 46.19 crore in Q1 FY2025 to a profit of Rs. 128.17 crore in Q1 FY2026. Consolidated earnings per share moved from a loss of Rs. 0.30 to a profit of Rs. 0.79. The diversified company operates in manufacturing and trading activities across packaging products, real estate development, and petrochemicals segments.",
            "Sentiment": "positive",
            "PublishDate": 1755496261822,
            "Source": "earnings"
        },
        {
            "Title": "Oricon Enterprises Reports Quarterly Results and Schedules 55th AGM for September 2025",
            "Summary": "Oricon Enterprises Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 3,444.72 lakhs compared to Rs 2,935.22 lakhs in the same quarter last year. Profit after tax from continuing operations was Rs 683.75 lakhs versus a loss of Rs 626.09 lakhs in the previous year quarter. The Board decided to convene the 55th Annual General Meeting on September 25, 2025 through video conferencing. The company also approved the sale of its Metal Crown Seals and Roll On Pilfer Proof Closures business to Guala Closures (India) Private Limited for Rs 4,250 lakhs, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1755174970556,
            "Source": "earnings"
        },
        {
            "Title": "Oricon Enterprises Reports 66% Jump in Quarterly Net Profit to 123 Million Rupees",
            "Summary": "Oricon Enterprises reported quarterly consolidated net profit of 123 million rupees compared to 74 million rupees in the same period last year, marking a 66% increase. The company's quarterly revenue grew to 383 million rupees from 315 million rupees year-over-year, representing a 22% rise.",
            "Sentiment": "positive",
            "PublishDate": 1755172982193,
            "Source": "earnings"
        },
        {
            "Title": "Oricon Enterprises Seeks Shareholder Approval for Rs 42.50 Crore Business Sale to Guala Closures",
            "Summary": "Oricon Enterprises Limited has issued a postal ballot notice seeking shareholder approval for the sale of its Metal Crown Seals and Roll On Pilfer Proof Closures business to Guala Closures (India) Private Limited through a slump sale at an enterprise value of Rs 42.50 crores. The transaction includes manufacturing, trading and sales operations along with respective assets, goodwill, transferring employees and assumed liabilities. The business being sold operates from a plant located at MIDC Murbad District Thane in Maharashtra. E-voting will be conducted from August 18 to September 16, 2025. The Board believes the company is receiving good enterprise value for the sale, with proceeds intended to capitalize on continuing business operations and explore new growth opportunities. A Business Transfer Agreement was executed on August 8, 2025 between both parties.",
            "Sentiment": "neutral",
            "PublishDate": 1754989643602,
            "Source": "corporate_action"
        },
        {
            "Title": "Oricon Enterprises to Sell Metal Crown Seals Business to Guala Closures for Rs 42.50 Crores",
            "Summary": "Oricon Enterprises Limited has entered into a business transfer agreement with Guala Closures (India) Private Limited to sell its metal crown seals and roll-on pilfer-proof closures manufacturing business located in MIDC Murbad, Maharashtra. The transaction is structured as a slump sale on a going concern basis with an enterprise value of Rs 42.50 crores. The business unit contributed Rs 110.46 crores in turnover (20.75% of total) and Rs 44.12 crores in net worth (5.46% of total) during the financial year ended March 31, 2025. The sale is expected to complete by December 7, 2025, subject to shareholder approval through postal ballot and necessary regulatory permissions. Oricon stated the rationale for the sale is to capitalize on the business and explore new growth opportunities. The buyer, Guala Closures, is engaged in bottle closures manufacturing and is not related to Oricon's promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1754636774150,
            "Source": "order&deals"
        },
        {
            "Title": "Oricon Enterprises Board Approves Sale of Metal Crown Seals Manufacturing Business",
            "Summary": "Oricon Enterprises Limited's Board of Directors has approved the sale of the company's metal crown seals and roll-on pilfer-proof closures manufacturing business located in MIDC Murbad, Maharashtra. The sale will be conducted through a slump sale on a going concern basis and requires shareholder approval via postal ballot. The Board has authorized Managing Director Adarsh Somani and Executive Director B. K. Toshniwal to execute the necessary agreements and documents for the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1754550758245,
            "Source": "corporate_action"
        },
        {
            "Title": "Oricon Enterprises' Subsidiary United Shippers Limited Sells Entire Stake in United Shippers Logistics Limited",
            "Summary": "United Shippers Limited, a wholly owned subsidiary of Oricon Enterprises Limited, has entered into an agreement to sell its entire holding of 10,000 equity shares in United Shippers Logistics Limited for Rs. 1,00,000. The sale agreement was signed on July 31, 2025, with completion expected by August 20, 2025. The buyer is Alfalal Shipping Private Limited, which is not related to the promoter group. Following this transaction, United Shippers Logistics Limited will cease to be a step-down subsidiary of Oricon Enterprises. United Shippers Logistics Limited reported total revenue of Rs. 53,482 and a negative net worth of Rs. 6,04,837 for the financial year ending March 31, 2025. The company is not classified as a material subsidiary under regulatory provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1754047097000,
            "Source": "corporate_action"
        },
        {
            "Title": "Oricon Enterprises Shareholders Approve Four Resolutions Including MD Reappointment and Related Party Transactions",
            "Summary": "Oricon Enterprises Limited shareholders approved four resolutions through postal ballot voting concluded on July 22, 2025. The approved resolutions include the reappointment of Mr. Adarsh Somani as Managing Director for five years from June 1, 2025 to May 31, 2030, and three related party transactions for holding office or place of profit by Mr. Susheel G. Somani, Mr. Hridai Somani, and Mr. Sharad Toshniwal. The voting was conducted through remote e-voting platform provided by NSDL from June 23 to July 22, 2025, with 41,637 total shareholders on record date of June 13, 2025. All four resolutions passed with over 99% approval from valid votes cast, with the scrutinizer report prepared by practicing company secretary Ms. Mayuri Bharat Thakkar.",
            "Sentiment": "positive",
            "PublishDate": 1753277893384,
            "Source": "corporate_action"
        },
        {
            "Title": "Oricon Enterprises Reports Profit in Q3 FY2024",
            "Summary": "Oricon Enterprises has reported a consolidated net profit of 30 million rupees in the third quarter, compared to a loss of 5 million rupees in the same quarter last year. The profit also increased from 33 million rupees in the previous quarter. However, the company's revenue decreased to 513 million rupees from 650 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739447169000,
            "Source": "earnings"
        }
    ]
}