{
    "Symbol": "ORIENTCEM",
    "ISIN": "INE876N01018",
    "News": [
        {
            "Title": "Orient Cement Q3FY26 PAT Jumps 174% to ₹2,779.94 Lacs",
            "Summary": "Orient Cement reports strong Q3FY26 performance with PAT rising 174% YoY to ₹2,779.94 lacs. Nine-month PAT surges 474% to ₹28,225.87 lacs despite revenue decline.",
            "Sentiment": "positive",
            "PublishDate": 1769697202684,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Cement's Company Secretary Resigns",
            "Summary": "Ms. Shrishti Jain has resigned from her position as Company Secretary & Compliance Officer at Orient Cement Limited, effective January 9, 2026, to pursue career opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1768063183303,
            "Source": "stocks"
        },
        {
            "Title": "Orient Cement Shifts Registered Office to Gujarat",
            "Summary": "Orient Cement Limited has officially relocated its registered office from Bhubaneswar, Orissa to Ahmedabad, Gujarat effective January 9, 2026, following regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1768062134263,
            "Source": "stocks"
        },
        {
            "Title": "Orient Cement Board Approves Ambuja Cements Merger",
            "Summary": "Orient Cement's board approved amalgamation scheme with Ambuja Cements on December 22, 2025, under 33:100 share exchange ratio. The merger requires regulatory approvals and aims to drive operational synergies.",
            "Sentiment": "positive",
            "PublishDate": 1766416407805,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Cement Gets Approval to Shift Base to Gujarat",
            "Summary": "Orient Cement Limited receives regulatory approval from Ministry of Corporate Affairs to relocate its registered office from Orissa to Gujarat, marking a significant corporate restructuring move.",
            "Sentiment": "positive",
            "PublishDate": 1766152866436,
            "Source": "stocks"
        },
        {
            "Title": "Orient Cement Limited Announces Board Changes with New Director Appointment",
            "Summary": "Orient Cement Limited appointed Mr. Rohit Soni as Additional Director (Non-Executive and Non-Independent) with immediate effect from November 21, 2025, while Mr. Rakesh Tiwary ceased to be Director from the same date. The changes are part of ongoing leadership development process across Adani portfolio companies, with Soni bringing extensive finance leadership experience from Adani New Industries Limited and Adani Energy Solutions Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1763744750293,
            "Source": "corporate_governance"
        },
        {
            "Title": "Adani Cement Partners with Coolbrook for World's First Commercial RotoDynamic Heater Technology Deployment",
            "Summary": "Adani Cement and Coolbrook announced a delivery agreement for the world's first commercial deployment of RotoDynamic Heater (RDH) technology at the Boyareddypalli Integrated Cement Plant in Andhra Pradesh, India. The technology will decarbonize the calcination phase of cement production by providing clean heat to dry and enhance alternative fuels. The RDH system will be powered entirely by Adani Cement's renewable energy portfolio, ensuring emission-free industrial heat generation. The deployment is expected to directly reduce 60,000 tonnes of CO2 emissions annually with potential to increase 10x in due course. This supports Adani Cement's net-zero goals by 2050 and targets to increase alternative fuel ratio to 30% and achieve 60% green power share by FY28. The companies plan to launch at least five additional projects within the next two years. The first generation RDH will deliver hot gases at around 1000°C to facilitate drying of alternate fuels.",
            "Sentiment": "positive",
            "PublishDate": 1762917454759,
            "Source": "stock"
        },
        {
            "Title": "Ambuja Cements Reports 58% Jump in Quarterly EBITDA to INR 1,761 Crores with Strong Volume Growth",
            "Summary": "Ambuja Cements achieved highest ever sales volume of 16.6 million tons in the quarter, up 20% year-on-year, significantly outpacing industry growth of 4%. Revenue stood at INR 9,174 crores, up 21% year-on-year with a 3% price gain. EBITDA reached INR 1,761 crores, up 58% year-on-year, while EBITDA per metric ton was INR 1,060, up 32% year-on-year. EBITDA margin improved to 19.2% from 14.7% in the previous year. Profit after tax surged 364% to INR 2,302 crores, including a one-time tax write-back of INR 1,697 crores. The company's existing capacity increased to 107 MTPA and has revised its target capacity to 155 MTPA by FY28, up from the earlier target of 140 MTPA. Cost reduction initiatives led to total costs decreasing by 5% year-on-year, with kiln fuel cost at INR 1.65 per 1,000 kilocalories. The company is targeting total cost of INR 4,000 per metric ton by March 2026, down from current levels of INR 4,200. Market share increased by 1% to 16.6%. The company announced debottlenecking initiatives across plants to add 15 million tons capacity at a capex of INR 48 per ton on integrated basis.",
            "Sentiment": "positive",
            "PublishDate": 1762597315150,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Reports Strong Q2 Performance with Net Profit Surge to ₹490.8 Million",
            "Summary": "Orient Cement delivered robust quarterly results with net profit jumping to ₹490.8 million from ₹23.2 million in the same period last year. Revenue increased to ₹6.4 billion compared to ₹5.4 billion year-over-year. The company's EBITDA rose significantly to ₹1.65 billion from ₹442 million, while EBITDA margin expanded substantially to 25.70% from 8.13% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762128890826,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Reports 274% EBITDA Growth in Q2, Achieves 97% Brand Transition to Ambuja/ACC",
            "Summary": "Orient Cement Limited reported strong quarterly performance with EBITDA rising 274% year-over-year to Rs 165 crore and EBITDA per ton increasing 191% to Rs 1,177. Cement sales volume grew 29% to 1.4 million tonnes, while capacity utilization reached 65% compared to 50% in the previous year. The company achieved 97% of sales under Ambuja/ACC brands through MSA arrangement, with complete brand transition by quarter-end. Clinker sales synergies with Ambuja/ACC resulted in 0.4 million tonnes sold and 0.13 million tonnes purchased. Green power share increased by 22 percentage points to 46%, contributing to fuel cost reductions. Depreciation expenses rose significantly by Rs 63 crore due to reassessment of asset useful life to align with parent company Ambuja Cements' accounting policies. Trade receivables increased by Rs 311 crore related to cement supplies to parent company under MSA guidelines. The company expects 75-80% capacity utilization for the remaining fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1761997234164,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Reports 93% Drop in Quarterly Profit Despite Revenue Growth",
            "Summary": "Orient Cement Limited reported a net profit of ₹49.09 crores for the quarter ended September 30, 2025, representing a 93% decline from ₹232.47 crores in the same period last year. Revenue from operations increased to ₹643.32 crores compared to ₹575.40 crores in the previous year quarter. For the half-year period, the company posted a profit of ₹254.46 crores versus ₹39.04 crores in the corresponding period last year. The company reassessed the useful life and residual value of its Power Plant equipment during the quarter, resulting in an additional depreciation expense of ₹63.09 crores. Orient Cement operates as a subsidiary of Ambuja Cements Limited, which acquired a 72.66% stake through a share purchase agreement and open offer completed in June 2025. The Board meeting was held on November 1, 2025, to approve these unaudited financial results.",
            "Sentiment": "negative",
            "PublishDate": 1761996422654,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Shares Adani Group Chairman's Letter Addressing Hindenburg Report and SEBI Clearance",
            "Summary": "Orient Cement Limited issued a chairman's letter from Gautam S. Adani to shareholders addressing the Hindenburg report from January 24, 2023, and SEBI's recent dismissal of allegations against the Adani Group. Adani stated that SEBI delivered an unequivocal verdict dismissing the allegations, calling it a validation of the company's transparency and governance. The letter highlighted the group's financial performance during this period, with portfolio EBITDA rising from ₹57,205 Cr in FY23 to ₹89,806 Cr in FY25, representing 57% absolute growth and a two-year CAGR of 25%. Gross Block expanded from ₹4,12,318 Cr in FY23 to ₹6,09,133 Cr in FY25, adding nearly ₹2 lakh Cr. The group commissioned several projects including India's first container transshipment port at Vizhinjam, added 6 GW of renewable capacity including the Khavda project, and commissioned the world's largest copper smelter. Adani expressed gratitude to investors, lenders, suppliers and partners for their support during this period and promised to strengthen governance standards, accelerate innovation and sustainability, and continue nation-building investments.",
            "Sentiment": "positive",
            "PublishDate": 1758693647286,
            "Source": "stock"
        },
        {
            "Title": "Orient Cement Reports Q1 FY26 Earnings Call Transcript Release",
            "Summary": "Orient Cement Limited has released the transcript of its earnings conference call for the quarter ended June 30, 2025. The transcript discusses the company's unaudited financial results and has been made available on the company's website at www.orientcement.com. The document was submitted to both BSE and NSE as part of regulatory disclosure requirements. The earnings call was originally scheduled for July 31, 2025, and was conducted jointly with other cement companies including Ambuja Cements, ACC, and Sanghi Industries. The call featured management representatives including CEO Vinod Bahety, CFO Rakesh Tiwary, and Head of Investor Relations Deepak Balwani, with moderation by Prabhudas Lilladher Pvt Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1754492308654,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Submits Q1 FY26 Investor Presentation for Analyst Call",
            "Summary": "Orient Cement Limited submitted an investor presentation titled 'Operational & Financial Highlights' for the quarter ended June 30, 2025, to stock exchanges. The presentation was prepared for an analyst/institutional call scheduled for July 31, 2025. The document was signed by Company Secretary & Compliance Officer Shrishti Jain and will be uploaded on the company's website. The presentation contains the company's quarterly operational and financial performance data.",
            "Sentiment": "neutral",
            "PublishDate": 1753953830312,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Reports Strong Q1 Performance with Net Profit Surging to 2 Billion Rupees",
            "Summary": "Orient Cement delivered robust quarterly results with net profit jumping to 2 billion rupees from 367 million rupees in the same period last year. Revenue increased to 8.7 billion rupees compared to 7 billion rupees year-over-year. The company's EBITDA rose significantly to 1.8 billion rupees from 960 million rupees, while EBITDA margin expanded to 21.07% from 13.79% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753662218744,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Reports 6-Fold Jump in Net Profit to ₹205 Crore in Q1",
            "Summary": "Orient Cement reported a 458% year-on-year increase in net profit to ₹205 crore for the first quarter ended June 30, 2025, compared to ₹36.7 crore in the same period last year. Revenue from operations grew 24.4% to ₹866 crore from ₹696 crore. EBITDA surged 88.9% to ₹182.3 crore with margins improving to 21% from 13.8%. Total expenses increased 12.4% to ₹724.28 crore while total income rose 23.7% to ₹868.64 crore. Following an open offer, Adani Group's shareholding in the company increased to 72.66%. Ambuja Cements had entered into a share purchase agreement to acquire 46.80% shareholding of Orient Cement. The company's shares closed at ₹254.00, down 1.07% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1753468205202,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Reports Strong Q1 Performance with Net Profit Surging to 2 Billion Rupees",
            "Summary": "Orient Cement delivered robust quarterly results with net profit jumping to 2 billion rupees compared to 367 million rupees in the same period last year. Revenue increased to 8.7 billion rupees from 7 billion rupees year-over-year. The company's EBITDA rose significantly to 1.8 billion rupees versus 960 million rupees previously, while EBITDA margin expanded to 21.07% from 13.79% in the comparable period.",
            "Sentiment": "positive",
            "PublishDate": 1753453756722,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement: Q4 Earnings Show Significant Decline in Profit and Revenue",
            "Summary": "Orient Cement's Q4 net profit fell 38.3% to Rs 42 crore, with revenue down 7.1% to Rs 825 crore. EBITDA decreased 30.4% to Rs 103 crore, and EBITDA margin contracted to 12.5%. Share price declined up to 1.59% following the results.",
            "Sentiment": "negative",
            "PublishDate": 1744690531000,
            "Source": "earnings"
        },
        {
            "Title": "CCI Approves Ambuja Cements' Acquisition of Majority Stake in Orient Cement",
            "Summary": "The Competition Commission of India (CCI) has approved Ambuja Cements' proposed acquisition of up to 72.8% stake in Orient Cement. This decision marks a significant corporate action in India's cement industry, potentially reshaping market dynamics and competition in the sector.",
            "Sentiment": "neutral",
            "PublishDate": 1741092866000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Cement Wins Arbitration Award for Coal Supply",
            "Summary": "Orient Cement has announced a favorable arbitration award in its case against SCCL (Singareni Collieries Company Limited). The ruling directs SCCL to supply coal worth 103.7 million rupees to Orient Cement. This decision is likely to secure a significant coal supply for Orient Cement's operations.",
            "Sentiment": "positive",
            "PublishDate": 1738761402000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Cement Reports Decline in Q3 Revenue",
            "Summary": "Orient Cement has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 6.4 billion rupees, down from 7.5 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737712413000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Reports Significant Decline in Q3 EBITDA",
            "Summary": "Orient Cement has reported a substantial decrease in its Q3 EBITDA, which fell to 581 million rupees from 1.15 billion rupees year-over-year. The company's EBITDA margin also declined, dropping to 9.03% from 15.36% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737712403000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Reports Significant Decline in Q3 Net Profit",
            "Summary": "Orient Cement has reported a net profit of 101 million rupees for the third quarter, marking a substantial decrease from 450 million rupees in the same period last year. This represents a year-over-year decline of approximately 77.6% in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1737712344000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Cement Receives GST Demand Order of 64.6 Million Rupees",
            "Summary": "Orient Cement has been issued a GST demand order for 64.6 million rupees, along with additional interest and penalties. This tax demand represents a significant financial obligation for the company.",
            "Sentiment": "negative",
            "PublishDate": 1735689807000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orient Cement Receives Tax Demand Order of 64.6 Million Rupees",
            "Summary": "Orient Cement has received a GST demand order for 64.6 million rupees, plus additional interest and penalties. This tax demand represents a significant financial obligation for the company.",
            "Sentiment": "negative",
            "PublishDate": 1735657064000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orient Cement Granted Interim Relief in Legal Matter with Maharashtra State Power Generation Co",
            "Summary": "Orient Cement has received interim relief from a court in a legal matter involving Maharashtra State Power Generation Co. The court's decision requires Orient Cement to deposit Rs. 3.18 crore as part of the interim arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1735223927000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orient Cement: Q2 Profit Plummets 90% Amid Adani Acquisition News",
            "Summary": "Orient Cement's Q2 profit dropped 90.5% to Rs 2.32 crore, with sales down 24.5% to Rs 544.02 crore. Adani Cement recently announced plans to acquire OCL for Rs 8,100 crore, with Ambuja Cements set to acquire 46.8% shares and an open offer for 26% more.",
            "Sentiment": "negative",
            "PublishDate": 1731070167000,
            "Source": "result"
        },
        {
            "Title": "Ambuja Cements to Acquire 46.8% Stake in Orient Cement",
            "Summary": "Ambuja Cements has announced plans to acquire a 46.8% stake in Orient Cement. This transaction has triggered an open offer for an additional 26% of shares from public shareholders, as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1729568988000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Cement Announces Transaction Worth Rs. 8,100 Crore",
            "Summary": "Orient Cement has announced a transaction valued at Rs. 8,100 crore, or Rs. 395.40 per share. The company plans to fund this transaction entirely through its internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1729568981000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Cement: Stock Surges 16% in a Week, Breaks Resistance",
            "Summary": "Orient Cement stock rose over 16% in a week, breaking out from a falling trendline resistance on weekly charts. The breakout suggests potential for further gains, with experts recommending buying on dips for a target of Rs 390 in 1-2 months.",
            "Sentiment": "positive",
            "PublishDate": 1729467000000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Cement Receives Work Order from MPPGCL",
            "Summary": "<p><span class=\"neutral\">Orient Cement</span> has been <span class=\"positive\">issued a work order</span> by <span class=\"neutral\">Madhya Pradesh Power Generating Company Limited (MPPGCL)</span> to <b>install a clinker grinding unit</b> at the <span class=\"neutral\">Satpura Thermal Power Station</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728025084000,
            "Source": "corporate_action"
        }
    ]
}