{
    "Symbol": "ORIENTHOT",
    "ISIN": "INE750A01020",
    "News": [
        {
            "Title": "Oriental Hotels Q3 profit surges 63% QoQ, stock jumps",
            "Summary": "Oriental Hotels reported strong Q3 FY26 results with revenue up 26% QoQ to ₹139.25 cr and net profit rising 63% QoQ to ₹20.70 cr. Stock gained 12% on robust performance and positive outlook.",
            "Sentiment": "positive",
            "PublishDate": 1768302019279,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Hotels Q3 profit jumps 44% to ₹20.7 cr",
            "Summary": "IHCL-backed Oriental Hotels reports strong Q3 performance with net profit rising 44% YoY to ₹20.7 crore and revenue growing 14%. Stock surges 11% following results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1768296604157,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Hotels Q3FY26 Revenue Grows 15% to ₹140.56 Cr",
            "Summary": "Oriental Hotels Limited reported Q3FY26 revenue of ₹140.56 crores, marking 15% YoY growth. EBITDA increased to ₹43.35 crores while PAT surged 45% to ₹20.23 crores, driven by strong demand in Chennai and Cochin markets.",
            "Sentiment": "positive",
            "PublishDate": 1768294867423,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Hotels Q3 profit jumps 44% to ₹21 cr",
            "Summary": "Oriental Hotels reported strong Q3 FY26 results with net profit rising 44% to ₹20.70 crore and revenue growing 14% to ₹139.00 crore. EBITDA margin expanded to 30.00% from 28.40% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1768289896380,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Hotels Q3FY26 Revenue Jumps 14.2% to ₹140.56 Cr",
            "Summary": "Oriental Hotels Limited reported strong Q3FY26 results with revenue rising 14.2% YoY to ₹140.56 crores. Net profit surged 44.6% to ₹20.23 crores, driven by improved operational performance across hotel operations.",
            "Sentiment": "positive",
            "PublishDate": 1768288269112,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Hotels Q3 EBITDA Rises 21% to ₹414M",
            "Summary": "Oriental Hotels reported strong Q3 performance with EBITDA growing 21% year-on-year to ₹414 million, while EBITDA margin improved to 29.9% from 28.2% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768287853420,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Hotels Q3 Revenue Rises 15% to ₹138 Crores",
            "Summary": "Oriental Hotels reported Q3 revenue of ₹138 crores compared to ₹120 crores in the same quarter last year, marking a 15% year-on-year growth in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1768287830997,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Hotels Q3 Net Profit Jumps 44% to ₹202M",
            "Summary": "Oriental Hotels Limited reported a strong 44.29% year-on-year growth in Q3 net profit, rising from ₹140.00 million in the previous year to ₹202.00 million in the current quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768287804907,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Hotels Gets Credit Rating Upgrade from Care Ratings on Improved Business Profile",
            "Summary": "Care Ratings Limited upgraded Oriental Hotels Limited's long-term bank facilities rating to CARE AA- Stable from CARE A+ Stable, driven by sustained improvement in business risk profile and near completion of multi-year renovation programs across key properties. The upgrade reflects expected enhancement in average room rates and revenue per available room, with revenue growing 12% year-on-year in FY25 to ₹440 crore and projected to reach ₹500 crore over the medium term.",
            "Sentiment": "positive",
            "PublishDate": 1764758545359,
            "Source": "corporate_action"
        },
        {
            "Title": "Oriental Hotels' Subsidiary Allots 63,000 Equity Shares Worth $1.76 Million",
            "Summary": "Oriental Hotels Limited announced that its wholly-owned subsidiary, OHL International (HK) Limited, allotted 63,000 equity shares on October 25, 2025. The shares have a face value of USD 10 each and were issued at USD 28 per share, representing a total value of USD 1.76 million. This disclosure follows the company's previous communication dated October 23, 2025 regarding an acquisition update.",
            "Sentiment": "neutral",
            "PublishDate": 1761565299487,
            "Source": "corporate_action"
        },
        {
            "Title": "Oriental Hotels Invests USD 1.764 Million in Subsidiary's Rights Issue for Debt Repayment",
            "Summary": "Oriental Hotels Limited's Investment Committee approved a USD 1.764 million subscription to the rights issue of its wholly-owned subsidiary OHL International (HK) Limited. The investment involves acquiring 63,000 equity shares at USD 28 per share with a USD 18 premium. The funds will be further invested in St. James Court Hotels Ltd for debt repayment. OHL International (HK) Limited, incorporated in 1994 and operating in the hospitality industry with presence in Hong Kong, reported turnovers of USD 245,988 in FY2024-2025, USD 506,054 in FY2023-2024, and USD 214,816 in FY2022-2023. The transaction maintains Oriental Hotels' 100% shareholding in the subsidiary and is scheduled for completion by November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761234527003,
            "Source": "order&deals"
        },
        {
            "Title": "Oriental Hotels Expects Double-Digit Revenue Growth in Coming Quarters",
            "Summary": "Oriental Hotels has indicated expectations to maintain double-digit revenue growth in the upcoming quarters. The company appears optimistic about its revenue trajectory in the near term.",
            "Sentiment": "positive",
            "PublishDate": 1760712854864,
            "Source": "stock"
        },
        {
            "Title": "Oriental Hotels Reports Q2 EBITDA Growth to 257M Rupees with Slight Margin Decline",
            "Summary": "Oriental Hotels reported Q2 EBITDA of 257 million rupees, representing an increase from 243 million rupees in the same quarter of the previous year. The company's EBITDA margin for the quarter was 23.42%, compared to 23.64% in the year-over-year comparison, showing a marginal decline in profitability margins despite higher absolute earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1760703748713,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Hotels Reports 38% Jump in Net Profit to 127M Rupees",
            "Summary": "Oriental Hotels reported net profit of 127 million rupees compared to 92 million rupees in the same quarter last year, marking a 38% increase. The company's revenue grew to 1.1 billion rupees from 1.03 billion rupees year-over-year, representing a 6.8% rise.",
            "Sentiment": "positive",
            "PublishDate": 1760703097170,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Hotels Limited Reports Malware Incident Affecting Select IT Systems",
            "Summary": "Oriental Hotels Limited detected a malware incident impacting select IT systems. The company has taken immediate action to contain the impact and secure the affected systems. Relevant authorities have been notified of the security incident. The company stated that business operations continue as usual while closely monitoring the situation.",
            "Sentiment": "negative",
            "PublishDate": 1757091953071,
            "Source": "stock"
        },
        {
            "Title": "Gita Nayyar Retires as Independent Director of Oriental Hotels Limited",
            "Summary": "Ms. Gita Nayyar has completed her term and retired as an Independent Director of Oriental Hotels Limited effective July 30, 2025. Her departure follows the completion of her second consecutive term as an Independent Director. The company has informed stock exchanges NSE and BSE about this board change through a regulatory disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1753880247633,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oriental Hotels Appoints New Independent Director and Secretarial Auditor",
            "Summary": "Oriental Hotels Limited announced two key appointments approved at its Annual General Meeting held on July 24, 2025. The company appointed Mr. Arvind Singh as an Independent Director for a five-year term starting July 1, 2025. Singh brings over 35 years of experience as an Indian Administrative Service officer, with expertise in infrastructure, finance, tourism, and agriculture sectors. He previously served as Secretary of Tourism for the Government of India and Chairman of Airports Authority of India. Additionally, the company appointed M/s. Alagar & Associates LLP as Secretarial Auditor for a five-year term beginning from FY 2025-26. The firm has over 15 years of experience in secretarial audit services across various sectors including technology, healthcare, manufacturing, and financial services.",
            "Sentiment": "positive",
            "PublishDate": 1753454280565,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oriental Hotels Reports 139% Jump in Quarterly Net Profit to Rs 8.71 Crore",
            "Summary": "Oriental Hotels Ltd, an associate company of The Indian Hotels Company Ltd, reported a standalone net profit of Rs 8.71 crore for the April-June 2025 quarter, compared to Rs 3.64 crore in the same period last year. The company's total income increased to Rs 107.24 crore from Rs 84.78 crore year-on-year, representing a 26% growth. EBITDA for the quarter stood at Rs 25.4 crore. Managing Director and CEO Pramod Ranjan attributed the performance to completion of significant asset upgradations and sustained demand momentum. For the financial year ending March 31, 2025, the company reported a net profit of Rs 44.52 crore and total income of Rs 444.63 crore. Oriental Hotels operates seven hotels including Taj Coromandel Chennai, Taj Fisherman's Cove Resort and Spa Chennai, and other properties across South India.",
            "Sentiment": "positive",
            "PublishDate": 1752916587713,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Hotels Reports Significant Growth in Q1 Financial Results",
            "Summary": "Oriental Hotels has announced its Q1 financial results, showing substantial year-over-year improvements. The company's net profit increased to 87 million rupees from 36 million rupees in the same quarter last year. Revenue rose to 1.1 billion rupees from 814 million rupees. EBITDA grew to 251 million rupees from 113 million rupees, with the EBITDA margin expanding to 23.49% from 13.84% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752711059000,
            "Source": "default"
        },
        {
            "Title": "Oriental Hotels Reports Significant Growth in Q1 Financial Results",
            "Summary": "Oriental Hotels has announced its Q1 financial results, showing substantial year-over-year improvements. The company's EBITDA increased to 251 million rupees from 113 million rupees in the previous year. The EBITDA margin rose to 23.49% from 13.84%. Net profit grew to 87 million rupees from 36 million rupees. Revenue also saw an increase, reaching 1.1 billion rupees compared to 814 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1752670824000,
            "Source": "result"
        },
        {
            "Title": "Oriental Hotel to Review Q1 Results on July 16",
            "Summary": "Oriental Hotel has announced that it will review its first quarter results on July 16th. The company has scheduled this review to assess its performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751978153000,
            "Source": "default"
        },
        {
            "Title": "Oriental Hotels Ltd: Q4 Profit Rises to Rs 17.69 Crore, Revenue Up 20%",
            "Summary": "Oriental Hotels Ltd reported a Q4 FY25 standalone profit of Rs 17.69 crore, up from Rs 16.33 crore year-over-year. Q4 revenue increased 20% to Rs 133.36 crore. The company recommended a final dividend of Rs 0.50 per equity share. For FY25, total income grew to Rs 444.63 crore, while profit decreased to Rs 44.52 crore compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1745590968000,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Hotels Reports Strong Q4 Financial Results",
            "Summary": "Oriental Hotels has announced its Q4 financial results, showing significant year-over-year improvements. The company's revenue increased to 1.33 billion rupees from 1.07 billion rupees in the previous year. EBITDA rose to 389 million rupees from 266 million rupees, with the EBITDA margin expanding to 29.38% from 24.83%. Net profit also saw a modest increase, reaching 177 million rupees compared to 163 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1745567105000,
            "Source": "result"
        },
        {
            "Title": "Oriental Hotels: Q3 Profit Drops 16.81% Despite Revenue Growth",
            "Summary": "Oriental Hotels reported Q3 FY25 results with revenue up 19.44% YoY to ₹121.9 crore, but profit down 16.81% to ₹15.44 crore. QoQ revenue grew 18.01% and profit surged 170.4%. EPS decreased 17.31% YoY to ₹0.86. Operating income increased 14.49% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1737093427000,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Hotels Reports Q3 Revenue Increase",
            "Summary": "Oriental Hotels has reported a revenue of 1.2 billion rupees for the third quarter, compared to 1 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1736923815000,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Hotels Reports Improved Q3 EBITDA and Margin",
            "Summary": "Oriental Hotels has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 341.8 million rupees from 280.8 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 28.17% from 27.67% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1736923787000,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Hotels Reports Q3 Net Profit of 140 Million Rupees",
            "Summary": "Oriental Hotels has announced its financial results for the third quarter. The company reported a net profit of 140 million rupees, which represents a decrease from the 164 million rupees reported in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1736923683000,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Hotels Reports Improved Q2 Financial Performance",
            "Summary": "<p>Oriental Hotels has announced its Q2 financial results, showing <span class='positive'>significant year-over-year improvements</span>. The company's <b>EBITDA</b> <span class='positive'>increased</span> from 196 million rupees to 243 million rupees. Additionally, the <b>EBITDA margin</b> <span class='positive'>rose</span> from 21.72% to 23.64%.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728888956000,
            "Source": "result"
        },
        {
            "Title": "Oriental Hotels Reports Q2 Revenue Increase",
            "Summary": "<p>Oriental Hotels has reported a <span class='positive'>revenue</span> of <b>1.03 billion rupees</b> for the second quarter, compared to <b>904 million rupees</b> in the same period last year, representing a <span class='positive'>year-over-year increase</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728888871000,
            "Source": "result"
        },
        {
            "Title": "Oriental Hotels Reports Q2 Net Profit of 92M Rupees",
            "Summary": "<p>Oriental Hotels has reported a net profit of <span class='neutral'>92 million rupees</span> for the second quarter, compared to <span class='neutral'>104 million rupees</span> in the same period last year, indicating a <span class='negative'>year-over-year decrease</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728888836000,
            "Source": "result"
        }
    ]
}