{
    "Symbol": "ORIENTELEC",
    "ISIN": "INE142Z01019",
    "News": [
        {
            "Title": "Orient Electric Q3 FY26 Results: 11% Revenue Growth",
            "Summary": "Orient Electric reported 11% YoY revenue growth to INR 906.5 crores in Q3 FY26, driven by strong performance in ECD segment with 12.6% growth and heating appliances expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769765850312,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Electric Announces Postal Ballot for Executive Incentives",
            "Summary": "Orient Electric Limited has issued a postal ballot notice for shareholder approval of long-term incentive plans for Managing Director Ravindra Singh Negi and President-Strategy Avani Birla, with e-voting scheduled from January 24 to February 22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769155755817,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Electric Targets 45% Premium Fan Mix in 2 Years",
            "Summary": "Orient Electric aims to increase its premium fan portfolio from current 30%+ to 45% within two seasons, focusing on BLDC, decorative, and non-BLDC premium segments during recent concall.",
            "Sentiment": "positive",
            "PublishDate": 1769134954549,
            "Source": "stocks"
        },
        {
            "Title": "Orient Electric Q3 Net Profit Drops 4.4% to ₹26 Crores",
            "Summary": "Orient Electric reported a net profit of ₹26 crores in Q3, down from ₹27.20 crores in the same quarter last year, marking a 4.4% year-on-year decline in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1769072711963,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Electric GST proceedings dropped with NIL demand",
            "Summary": "Orient Electric Limited receives favorable orders from GST authorities in Kochi and Jammu, dropping proceedings worth ₹4.70 crores with no financial impact on the company.",
            "Sentiment": "positive",
            "PublishDate": 1767100617892,
            "Source": "stocks"
        },
        {
            "Title": "Orient Electric Receives Rectification Order Slashing Tax Demand by Over 99%",
            "Summary": "Orient Electric received a rectification order that dramatically reduced its tax demand from Rs 51.6 crore to just Rs 31,904 plus applicable interest. This significant reduction in tax liability provides substantial financial relief to the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1764288355930,
            "Source": "stock"
        },
        {
            "Title": "Orient Electric Receives ₹5.73 Crore GST Demand Order Over LED Goods Classification",
            "Summary": "Orient Electric has received a demand order of ₹5.73 crore from the Assistant Commissioner of Central Tax and Central Excise, Amravati, alleging short payment of GST due to wrong HSN classification of LED goods. The company states there is no material impact on financial operations at this stage and plans to file an appeal with the appropriate authority within the permissible timeline.",
            "Sentiment": "negative",
            "PublishDate": 1763060284019,
            "Source": "stock"
        },
        {
            "Title": "Orient Electric Grants 8.57 Lakh Stock Options to Employees Under ESOP Scheme",
            "Summary": "Orient Electric Limited granted 8,57,200 stock options to eligible employees under its Employee Stock Option Scheme-2019. Each option is convertible into one equity share with a face value of Re. 1 at an exercise price of Rs. 213.52 per option. The options will vest in two tranches: 40% after one year and 60% after two years from the grant date. Employees can exercise these options within four years from their respective vesting dates. The grant was determined by the company's Nomination and Remuneration Committee and complies with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762254436631,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Electric Appoints New Senior Management Team with Three Key Executives",
            "Summary": "Orient Electric has appointed a new senior management team, naming Ajay Saraf as Head of Switchgear and Wires. The company has also brought in Aadarsh Rohira and Rakesh Sorout as senior management personnel.",
            "Sentiment": "positive",
            "PublishDate": 1762245322977,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orient Electric Reports 6.4% Revenue Growth in Q2 FY26 Despite Seasonal Headwinds",
            "Summary": "Orient Electric delivered consolidated revenue of INR 703 crores in Q2 FY26, marking 6.4% year-on-year growth. The Lighting and Switchgear segment led performance with 18.6% growth, driven by distribution expansion and premiumization focus. The wires business doubled year-on-year from a smaller base. In fans, the company gained 60 basis points market share year-to-date despite seasonal softness from heavy rainfall. BLDC fans grew 40% and now contribute 30% of domestic ceiling fan sales. Premium SKUs accounted for 65% of consumer lighting sales. EBITDA increased 6.4% to INR 38 crores with 5.4% margin, while profit after tax rose 15.5% to INR 12 crores. Gross margins stood at 31.5%. The company expanded its direct-to-market footprint by transitioning Pune market and added Madhya Pradesh and Chhattisgarh to its direct service network. Management expects stronger demand momentum in H2 driven by festive season buildup and improving retail sentiment.",
            "Sentiment": "positive",
            "PublishDate": 1761559524708,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric Maintains Gross Margin Target Despite Q2 Decline, Plans Fan Price Hike",
            "Summary": "Orient Electric reported a gross margin of 31.5% in Q2, below its target range of 32-34%. Despite this decline, the company is maintaining its gross margin target of 32-34%. Management announced plans to increase fan prices by 3-4% due to changes in BEE Star Rating requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1760932084972,
            "Source": "stock"
        },
        {
            "Title": "Orient Electric Focuses on Premium Products and Cost-Efficiency Program for Growth",
            "Summary": "Orient Electric is focusing on premium fans, smart lighting, and expanding its wires business as part of its growth strategy. The company has implemented a cost-efficiency program called 'Spark Sanchay' and is leveraging digital channels to drive profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1760715270284,
            "Source": "stock"
        },
        {
            "Title": "Orient Electric Reports Q2 FY26 Results with 19% Revenue Growth",
            "Summary": "Orient Electric's Board approved unaudited financial results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs 702.61 crores for Q2, compared to Rs 660.15 crores in the same quarter last year, marking a 6.4% increase. Net profit for the quarter stood at Rs 12.06 crores versus Rs 10.44 crores in the previous year. For the half-year period, revenue reached Rs 1,471.69 crores against Rs 1,415.01 crores last year, while net profit increased to Rs 29.58 crores from Rs 24.78 crores. The company operates through two segments: Electrical Consumer Durables (Rs 440.91 crores revenue in Q2) and Lighting & Switchgear (Rs 261.70 crores revenue in Q2). Basic earnings per share for the quarter was Rs 0.57 compared to Rs 0.49 in the previous year. The company received a GST demand order of Rs 51.59 crores from Chennai authorities for FY 2021-22, which it is contesting through rectification proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1760703591129,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric Faces Arbitration Proceedings from Comfort and Flora",
            "Summary": "Comfort and Flora have initiated arbitration proceedings against Orient Electric. The specific nature of the dispute, financial implications, and details of the arbitration claims have not been disclosed.",
            "Sentiment": "negative",
            "PublishDate": 1754408397550,
            "Source": "stock"
        },
        {
            "Title": "Orient Electric Reports 2% Revenue Growth to ₹769 Crores in Q1 FY26 Despite Weather Headwinds",
            "Summary": "Orient Electric reported revenue of ₹769 crores for Q1 FY26, marking 2% year-on-year growth despite challenging weather conditions. The company faced headwinds from mild temperatures and record-breaking rainfall in May that disrupted seasonal sales cycles. EBITDA increased 15% to ₹46 crores with margins expanding 68 basis points to 6%. The Lighting & Switchgear segment delivered 7% growth, while the ECD segment remained stable at ₹545 crores despite muted fan sales and a 40% decline in cooler sales. BLDC fan sales grew over 50% year-on-year, with premium product mix improving by 250 basis points. The company maintained gross margins at 32.6% and working capital days at 25 days. Orient Electric added 1,800 new retailers under its DTM network and launched premium BLDC fans. Management remains confident about achieving double-digit EBITDA margins over the next 7-8 quarters, expecting festive season tailwinds in Q2.",
            "Sentiment": "neutral",
            "PublishDate": 1753964567613,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric Reports 22% Jump in Q1 Profit, Appoints Deloitte as Internal Auditor",
            "Summary": "Orient Electric Limited reported a net profit of Rs 17.52 crores for the quarter ended June 30, 2025, representing a 22% increase from Rs 14.34 crores in the same quarter last year. Revenue from operations grew 1.9% to Rs 769.08 crores compared to Rs 754.86 crores in the previous year quarter. The company's earnings per share improved to Rs 0.82 from Rs 0.67 year-on-year. The board also approved the appointment of Deloitte Touche Tohmatsu India LLP as internal auditor for financial year 2025-26. Orient Electric operates through two segments - Electrical Consumer Durables (Rs 545 crores revenue) and Lighting & Switchgear (Rs 224.08 crores revenue). The company faces ongoing GST disputes totaling Rs 63.20 crores across multiple states, though management believes it has a strong case and has not made provisions against these demands.",
            "Sentiment": "positive",
            "PublishDate": 1753432592069,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric Reports Revenue Growth to 7.7 Billion Rupees in Q1",
            "Summary": "Orient Electric reported Q1 revenue of 7.7 billion rupees, up from 7.55 billion rupees in the same period last year. The company's EBITDA increased to 460 million rupees from 400 million rupees year-over-year, with EBITDA margin improving to 6% from 5.31%. Net profit rose to 175 million rupees compared to 143 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753431819475,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric: Q4 Revenue Grows 9.4%, Lighting and Switchgears Outperform",
            "Summary": "Orient Electric reported 9.4% YoY revenue growth to Rs 8.6 billion in Q4, driven by 12.5% growth in Lighting and Switchgears segment. The company gained ~200bps market share in B2C lighting with high-double digit volume growth. Fans segment showed high-single digit growth despite a soft start to Q4.",
            "Sentiment": "positive",
            "PublishDate": 1745827580000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric: Q4 Profit More Than Doubles on Strong Fan and Air Cooler Demand",
            "Summary": "Orient Electric reported a 144% increase in Q4 profit to 312.6 million rupees, driven by strong demand for fans and air coolers. Revenue grew 9.4% to 8.62 billion rupees. The consumer durables segment, including fans and air coolers, saw a 7.9% revenue increase.",
            "Sentiment": "positive",
            "PublishDate": 1745575768000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric Reports Significant Increase in Q4 Net Profit",
            "Summary": "Orient Electric has announced its financial results for the fourth quarter, reporting a net profit of 313 million rupees, a substantial increase from 128 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745571295000,
            "Source": "result"
        },
        {
            "Title": "Orient Electric Reports Q3 Revenue Growth",
            "Summary": "Orient Electric has announced its third-quarter revenue results, reporting 8.2 billion rupees compared to 7.5 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738139266000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric Reports Improved Q3 EBITDA and Margin",
            "Summary": "Orient Electric has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 610 million rupees, up from 489 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 7.47% from 6.51% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738139260000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric Reports Q3 Net Profit Increase",
            "Summary": "Orient Electric has reported a net profit of 272 million rupees for the third quarter, compared to 240 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738139238000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Electric Appoints Arvind Vats as New CFO",
            "Summary": "Orient Electric has announced the appointment of Arvind Vats as their new Chief Financial Officer (CFO). This change in leadership represents a significant development in the company's financial management structure.",
            "Sentiment": "neutral",
            "PublishDate": 1734416618000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orient Electric: Expansion into New Trade Channels Prompts Upgrade",
            "Summary": "Orient Electric's venture into alternate trade channels is viewed positively. Nirmal Bang has upgraded the stock to 'Buy'.",
            "Sentiment": "positive",
            "PublishDate": 1730086237000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Electric Reports Strong Q2 Financial Performance",
            "Summary": "Orient Electric has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 360 million rupees, up from 207 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 5.45% from 3.65% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729848234000,
            "Source": "result"
        },
        {
            "Title": "Orient Electric Reports Q2 Revenue Growth",
            "Summary": "Orient Electric has reported a revenue of 6.6 billion rupees for the second quarter, compared to 5.7 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729848152000,
            "Source": "result"
        },
        {
            "Title": "Orient Electric Reports Q2 Net Profit Decline",
            "Summary": "Orient Electric's second quarter net profit decreased to 104 million rupees from 185 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1729848133000,
            "Source": "result"
        }
    ]
}