{
    "Symbol": "ORIENTLTD",
    "ISIN": "INE609C01024",
    "News": [
        {
            "Title": "Orient Press Limited Reports Quarterly Loss, Board Approves Financial Results",
            "Summary": "Orient Press Limited's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a loss before tax of ₹212.20 lakhs for the half-year period. The company operates three business segments: Printing, Flexible Packaging, and Paper Board Packaging. Revenue from operations was ₹2,626.53 lakhs for the quarter. The results were reviewed by the Audit Committee and approved at the board meeting held on November 11, 2025. Statutory auditors Sarda Pareek LLP conducted a limited review of the financial results.",
            "Sentiment": "negative",
            "PublishDate": 1762897919941,
            "Source": "earnings"
        },
        {
            "Title": "Orient Press Limited Issues Circular for Fixed Deposit Scheme from Shareholders",
            "Summary": "Orient Press Limited has issued a circular to shareholders for accepting fixed deposits under Section 73(2) of the Companies Act, 2013. The company offers a non-cumulative deposit scheme for 2-3 years at 9% interest rate, with minimum deposit of ₹50,000 and multiples of ₹10,000. The scheme allows the company to raise up to ₹12,273.36 lakhs based on its balance sheet as at March 31, 2025, with ₹748.60 lakhs currently outstanding from 133 depositors. The company reported losses before tax of ₹374.35 lakhs for the year ended March 31, 2025, compared to ₹130.30 lakhs in the previous year. The company has a credit rating of CARE BB with stable outlook from CARE Ratings Limited dated March 20, 2025. The deposits are unsecured and will be used for general business purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1758624235503,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Press Limited Reports Q2 2025 Loss, Schedules 37th AGM for September 25",
            "Summary": "Orient Press Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, showing a net loss of ₹79.15 lakhs compared to a loss of ₹52.02 lakhs in the previous quarter. Revenue from operations declined to ₹2,624.59 lakhs from ₹3,488.84 lakhs in the prior quarter. The company operates through three business segments: Printing, Flexible Packaging, and Paper Board Packaging. The Board scheduled the 37th Annual General Meeting for September 25, 2025, at 11:30 AM via video conferencing. The company appointed M/s. Bhanwarlal Gurjar & Co. as Cost Auditors for FY 2025-26 and M/s V.K. Mandawaria & Co. as Secretarial Auditors for five consecutive years from FY 2025-26 to FY 2029-30, both subject to member approval. September 19, 2025, was fixed as the cut-off date for determining voting eligibility at the AGM.",
            "Sentiment": "negative",
            "PublishDate": 1755009410059,
            "Source": "earnings"
        },
        {
            "Title": "Orient Press: Q3 FY25 Loss Widens, Revenue Declines",
            "Summary": "Orient Press reported Q3 FY25 results with a loss of ₹0.75 crore, up 33.93% YoY. Revenue decreased by 21.36% YoY to ₹34.1 crore. Operating income fell 160% YoY. EPS stood at ₹-0.75.",
            "Sentiment": "negative",
            "PublishDate": 1739566483000,
            "Source": "earnings"
        }
    ]
}