{
    "Symbol": "ORIENTTECH",
    "ISIN": "INE0PPK01015",
    "News": [
        {
            "Title": "Orient Technologies Bonus Issue: Last Day Today",
            "Summary": "Orient Technologies marks the final trading session for investors to purchase shares and qualify for the 1:10 bonus issue ahead of the January 6 record date. Company to capitalize ₹4.16 crore from securities premium.",
            "Sentiment": "positive",
            "PublishDate": 1767320776877,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Technologies Sets Jan 7 Record Date for Bonus Issue",
            "Summary": "Orient Technologies announces January 7, 2025 as record date for 1:10 bonus share issue. Shareholders who hold shares on this date will be eligible for bonus allocation.",
            "Sentiment": "positive",
            "PublishDate": 1767067873396,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Technologies Opens New Service Delivery Centre in Turbe with Advanced NOC-SOC Capabilities",
            "Summary": "Orient Technologies Limited launched a new state-of-the-art Service Delivery Centre in Turbe, Navi Mumbai, featuring 24/7 Network Operations Centre and Security Operations Centre with Securonix-powered capabilities. The facility strengthens the company's ability to deliver uninterrupted IT services across BFSI, Pharma, Manufacturing, ITES, Government, and large enterprise sectors while enhancing threat detection and response capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764576172886,
            "Source": "stock"
        },
        {
            "Title": "Orient Technologies Announces 1:10 Bonus Share Issue Through Postal Ballot",
            "Summary": "Orient Technologies Limited has issued a postal ballot notice seeking shareholder approval for a bonus share issue in the ratio of 1:10, capitalizing ₹4.16 crores from Securities Premium Account. The e-voting period runs from November 19, 2025 to December 18, 2025, with the company citing its stock exchange listing milestone and aim to reward loyal shareholders while making shares more affordable.",
            "Sentiment": "positive",
            "PublishDate": 1763474594144,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Technologies Reports 22.25% Revenue Growth in Q2 FY26, SOC Operations to Begin Q3-Q4",
            "Summary": "Orient Technologies delivered strong Q2 FY26 performance with revenue rising 22.25% year-on-year to Rs. 272.80 crores, driven by strategic shift towards services-led model and wins in cloud, digital transformation and government automation projects. The company's Security Operations Center (SOC) setup is nearing completion with commercial revenue generation expected to begin in latter half of Q3 or early Q4, while major deals include Rs. 30.81 crores multi-year contract from New India Assurance and Rs. 30 crores order from Big Four consulting firm.",
            "Sentiment": "positive",
            "PublishDate": 1763473965606,
            "Source": "earnings"
        },
        {
            "Title": "Orient Technologies Schedules Q2H1FY26 Earnings Conference Call",
            "Summary": "Orient Technologies Limited will host a post-results conference call on Friday, November 14, 2025, at 1:00 PM IST to discuss financial results for the half-yearly and quarter ended September 30, 2025. The IT company, which specializes in cloud and data management solutions for enterprises, announced its Q2H1FY26 results on Tuesday, November 11, 2025. Key executives including Chairman Managing Director Ajay Sawant, CEO Shrihari Bhat, and CFO Gourav Modi will represent the company during the investor and analyst call. Orient Technologies trades on BSE under scrip code 544235 and on NSE under symbol ORIENTTECH.",
            "Sentiment": "neutral",
            "PublishDate": 1762880032110,
            "Source": "earnings"
        },
        {
            "Title": "Orient Technologies Approves 1:10 Bonus Share Issue and Reports Strong Q2 Results",
            "Summary": "Orient Technologies Limited's Board approved issuing bonus equity shares in a 1:10 ratio, subject to shareholder approval through postal ballot. For every 10 existing shares of Rs. 10 each, shareholders will receive 1 additional share. The company reported quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs. 34,496.74 lakhs and profit after tax of Rs. 4,417.57 lakhs. Basic earnings per share stood at Rs. 10.61. The Board also noted the resignation of Company Secretary and Compliance Officer Ms. Nayana Akhil Nair, effective November 30, 2025, who is leaving to pursue another career opportunity. The bonus shares will be issued from the company's securities premium account, requiring Rs. 4.16 crores for implementation.",
            "Sentiment": "positive",
            "PublishDate": 1762869516346,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Technologies Q2 Revenue Rises 22% to 2.72B Rupees Despite Net Profit Decline",
            "Summary": "Orient Technologies reported Q2 net profit of 141.7 million rupees, down from 150.5 million rupees in the same period last year. Revenue increased to 2.72 billion rupees compared to 2.23 billion rupees year-over-year. EBITDA grew to 206.5 million rupees from 187.9 million rupees, while EBITDA margin compressed to 7.57% from 8.42% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762868897562,
            "Source": "earnings"
        },
        {
            "Title": "Orient Technologies Board Approves Proposal to Acquire Stakes in Three IT Companies for ₹971 Crores",
            "Summary": "Orient Technologies Limited's board approved a proposal to potentially acquire shares in three private companies: Athena IT & Telecom Private Limited, AIT Internet Services Private Limited, and Red Hut Innovation Technology Private Limited. The total acquisition cost is ₹971 crores in cash consideration. Orient Technologies will acquire 46% stakes in Athena IT & Telecom (₹575 crores) and AIT Internet Services (₹80.5 crores), and a 100% stake in Red Hut Innovation Technology (₹115 crores). The target companies operate in IT hardware, networking solutions, telecommunications infrastructure, and software development services. The acquisition aligns with Orient Technologies' strategy to expand its IT and telecommunications portfolio. The transaction is expected to complete within 30 days, subject to mutual agreement on definitive terms between the parties.",
            "Sentiment": "positive",
            "PublishDate": 1760615580713,
            "Source": "order&deals"
        },
        {
            "Title": "Orient Technologies Schedules Board Meeting to Consider Acquisition of Three IT Companies",
            "Summary": "Orient Technologies Limited has scheduled a Board of Directors meeting on October 16, 2025, to consider and approve a potential acquisition of three companies: Athena IT & Telecom Private Limited, AIT Internet Services Private Limited, and Red Hut Innovation Technology Private Limited. The acquisition proposal is subject to mutual agreement by the parties on terms and conditions through a definitive agreement. The company has informed both NSE and BSE about the board meeting. The trading window for dealing in the company's securities remains closed from October 1, 2025, as per the company's insider trading code.",
            "Sentiment": "positive",
            "PublishDate": 1760118859369,
            "Source": "order&deals"
        },
        {
            "Title": "Orient Technologies Surges 18% on Data Center Growth Prospects",
            "Summary": "Orient Technologies shares jumped 18% on Friday with strong trading volumes, extending gains to 21% over five days. The stock is trading near Rs 416, holding above its support zone of Rs 405-400. Technical analysts suggest a breakout above Rs 430 could drive the stock toward Rs 455-470. The company provides data center solutions including servers, storage, and networking hardware. Orient announced plans to deploy up to 6,000 GPUs in its data center infrastructure under the IndiaAI mission to provide remote compute and AI services. The stock has shown strong volume accumulation over 15 trading days, indicating institutional participation. India's data center demand is expected to more than double over three years, requiring Rs 90,000 crore in investment. However, the sector faces challenges including high capital requirements for power, cooling, and regulatory compliance, with significant execution risks in scaling operations profitably.",
            "Sentiment": "positive",
            "PublishDate": 1759480823262,
            "Source": "stock"
        },
        {
            "Title": "Orient Tech Targets 30% Annual Growth Over Next Three Years Despite Current Cash Flow Pressures",
            "Summary": "Orient Technologies plans aggressive top-line growth exceeding 30% year-on-year for the next three years, driven by new high-margin ventures in cybersecurity and managed services. Chairman and Managing Director Ajay Sawant outlined growth strategies focusing on Device as a Service (DaaS), Security Operations Centre (SOC), and cloud offerings to increase service revenue and margins. The company's current order book stands at Rs 414 crore, fully billable and expected to be realized in Q3 and Q4 of FY26, with projections to reach approximately Rs 600 crore in the second half of FY26. Orient Technologies faced cash flow challenges in FY25 with negative cash flow of Rs 11 crore due to high receivables from delayed projects, but management expects to return to cash-positive status within a couple of quarters. The SOC business will become operational by mid-Q3 of FY26, projected to contribute single-digit percentage to overall revenue in its first year, expanding to higher double-digit share by years two and three, with target margins exceeding 20% by calendar year 2026. The company aims to improve EBITDA margins from current 6-7% to 9-10% within a couple of years, expecting to reach around 8% within 3-4 quarters.",
            "Sentiment": "positive",
            "PublishDate": 1758269630836,
            "Source": "stock"
        },
        {
            "Title": "Orient Tech Secures ₹31 Crore Order",
            "Summary": "Orient Tech has secured an order worth ₹31 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756186643421,
            "Source": "stock"
        },
        {
            "Title": "Orient Technologies Reports 43.65% Revenue Growth in Q1 FY26, Invests in Cybersecurity Expansion",
            "Summary": "Orient Technologies Limited reported total income of Rs. 214.48 crore in Q1 FY26, marking a 43.65% year-over-year increase from Rs. 149.31 crore. Revenue from operations grew 42.81% to Rs. 212.56 crore, while EBITDA rose 26.91% to Rs. 17.33 crore. Profit after tax increased 8% to Rs. 10.03 crore with earnings per share at Rs. 2.41. The company secured contracts worth Rs. 104.66 crore across various sectors and maintains an order book of Rs. 414 crore for execution in FY26. Orient Technologies is investing over Rs. 18 crore in building a Security Operating Center and Network Operating Center, expected to be operational by end of Q2 FY26. The company has restructured into two business lines: IT Infrastructure Solutions and Application & IT Infrastructure Services, targeting a 50-50 revenue split. Management expects margin pressure in Q1 and Q2 due to investments, with improvement anticipated from Q3 FY26 onwards. The company is focusing on Device as a Service offerings and aims to become a top-five system integrator in India within three years.",
            "Sentiment": "positive",
            "PublishDate": 1755613230261,
            "Source": "earnings"
        },
        {
            "Title": "Orient Technologies Projects 43% Revenue Growth in FY26 with ₹414 Crore Order Book",
            "Summary": "Orient Technologies expects significant growth in FY26 with a projected 43% revenue increase. The company has secured an order book worth ₹414 crore and is expanding its services in cloud computing, cybersecurity, and device-as-a-service offerings. The IT services company plans to extend its operations beyond India to achieve global reach through premium IT services.",
            "Sentiment": "positive",
            "PublishDate": 1755016008571,
            "Source": "stock"
        },
        {
            "Title": "Orient Technologies Reports 43.65% Revenue Growth in Q1 FY2026, Driven by Cloud and DaaS Expansion",
            "Summary": "Orient Technologies Limited reported strong quarterly results with total income rising 43.65% year-over-year to ₹214.48 crore. Revenue from operations increased 42.81% to ₹212.56 crore, while EBITDA grew 26.91% to ₹17.33 crore. Profit after tax reached ₹10.03 crore, up 8% from the previous year, with earnings per share at ₹2.41. The company secured ₹88.51 crore in strategic contracts across government, healthcare, technology, and enterprise sectors. Device-as-a-Service contracts totaled ₹16 crore, spanning energy, e-commerce, healthcare, and logistics sectors. The company maintains an order book of ₹414.40 crore for the remainder of FY2026. Orient Technologies also reported a minor deviation in IPO fund utilization, where issue expenses included GST payments contrary to prospectus specifications, resulting in excess payment of ₹0.01 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755012647135,
            "Source": "earnings"
        },
        {
            "Title": "Orient Technologies Approves Quarterly Results and Schedules 28th AGM for September 2025",
            "Summary": "Orient Technologies Limited's Board of Directors approved unaudited standalone financial results for the quarter ended June 30, 2025. The company scheduled its 28th Annual General Meeting for September 23, 2025, at 4:00 p.m. IST via video conferencing. The cut-off date for member eligibility is September 12, 2025, with remote e-voting available from September 20-22, 2025. Mr. Alwyn D'Souza has been appointed as Scrutinizer for the e-voting process. The Board also approved the interim dividend declared on November 11, 2024 as the final dividend for Financial Year 2024-25.",
            "Sentiment": "neutral",
            "PublishDate": 1755009545381,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Technologies Reports Q4 Financial Results",
            "Summary": "Orient Technologies has released its Q4 financial results. The company's EBIT (Earnings Before Interest and Taxes) for Q4 was 174 million rupees, compared to 154 million rupees year-over-year. The EBIT margin decreased to 6.66% from 7.43% in the same period last year. Net profit for Q4 was 134 million rupees, up from 127 million rupees quarter-over-quarter. Revenue for Q4 increased to 2.6 billion rupees from 2 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747320511000,
            "Source": "result"
        },
        {
            "Title": "Orient Technologies Terminates Agreement with eProtect 360 Solutions",
            "Summary": "Orient Technologies has announced the termination of its teaming agreement with eProtect 360 Solutions. The company has also called off its planned 60% stake acquisition in eProtect 360. Orient Technologies states that this termination will have no material financial impact on the company.",
            "Sentiment": "neutral",
            "PublishDate": 1743552715000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Technologies Terminates Agreement with eProtect 360 Solutions",
            "Summary": "Orient Technologies has announced the termination of its teaming agreement with eProtect 360 Solutions. The company has stated that this termination will not have any material financial impact on its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1743511545000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Technologies Collaborates with AWS India for Advanced GPU and AI Services",
            "Summary": "Orient Technologies has announced a collaboration with Amazon Web Services (AWS) India to provide advanced GPU and AI services. This partnership aims to enhance Orient Technologies' capabilities in delivering cutting-edge technology solutions to its customers.",
            "Sentiment": "positive",
            "PublishDate": 1740640692000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Technologies Reports Mixed Q3 Financial Results",
            "Summary": "Orient Technologies has released its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 was 164 million rupees, slightly up from 162 million rupees in the same quarter last year. However, the EBITDA margin decreased to 7.92% from 10.40% year-over-year, indicating a decline in profitability despite the marginal increase in EBITDA.",
            "Sentiment": "neutral",
            "PublishDate": 1738851720000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Technologies Reports Q3 FY2024 Financial Results",
            "Summary": "Orient Technologies has announced its financial results for the third quarter. The company reported a net profit of 127 million rupees, showing an increase from 109 million rupees year-over-year and 151 million rupees quarter-over-quarter. Revenue for Q3 stood at 2.1 billion rupees, up from 1.55 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738851631000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Technologies Declares Interim Dividend",
            "Summary": "Orient Technologies has announced an interim dividend of 1.8 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1731338130000,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Technologies Reports Improved Q2 EBITDA and Margin",
            "Summary": "Orient Technologies has announced its Q2 financial results. The company's EBITDA increased to 188 million rupees from 122 million rupees year-over-year. Additionally, the EBITDA margin improved to 8.42% from 8.18% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731338080000,
            "Source": "result"
        },
        {
            "Title": "Orient Technologies Reports Strong Q2 Financial Results",
            "Summary": "Orient Technologies has announced its Q2 financial results, showing significant year-over-year growth. The company's net profit increased to 151 million rupees, up from 93 million rupees in the same quarter last year. This also represents a quarter-over-quarter increase from 93 million rupees. Revenue for Q2 reached 2.2 billion rupees, compared to 1.5 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731338020000,
            "Source": "result"
        },
        {
            "Title": "Orient Technologies: Shares Surge 10.12% Amid Market Rally",
            "Summary": "Orient Technologies shares are trading at ₹401.4, up 10.12% from the previous close. The stock hit a high of ₹414 and a low of ₹365.95. Sensex is up 0.66% at ₹79997.5, while Nifty is up 0.62%. The company has a ROE of 27.26% and ROA of 15.04%. Institutional holdings have decreased, with MF holding at 0.03% and FII holding at 3.56%.",
            "Sentiment": "positive",
            "PublishDate": 1730872947000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Stock Surges 15.61% Amid Market Decline",
            "Summary": "Orient Technologies shares are trading at ₹365.45, up 15.61% from the previous close. The stock hit a high of ₹375 and a low of ₹313.35. It's trading above short and long-term moving averages. The company has a ROE of 27.26% and a P/E of 30.02. Institutional holdings have decreased in the September quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730786409000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Shares Up 1.71% Amid Market Downturn",
            "Summary": "Orient Technologies shares are trading at ₹312.55, up 1.71% from the previous close. The stock has outperformed the broader market, with Nifty down 1.57% and Sensex down 1.59%. The stock hit a high of ₹321 and a low of ₹308 during the day. Institutional holdings have decreased, with MF holding at 0.03% and FII holding at 3.56% as of September quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730699240000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Share Price Surges 4.69% Amid Market Decline",
            "Summary": "Orient Technologies shares are trading at ₹297.95, up 4.69% from the previous close. The stock hit a high of ₹301.45 and a low of ₹279.25. Sensex is down 0.13% at ₹80,261.71, while Nifty is down 0.11%. The company has a ROE of 27.26% and ROA of 15.04%. Institutional holdings have decreased in the September quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730268028000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Stock Surges 2.43% Amid Market Gains",
            "Summary": "Orient Technologies shares are trading at ₹289.05, up 2.43% from the previous close. The stock hit a high of ₹297.95 and a low of ₹276.25. It's trading above most key SMAs except the 5-day SMA. The company has a ROE of 27.26% and a P/E of 27.73. Institutional holdings have decreased in the September quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729661918000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Share Price Dips Amid Market Decline",
            "Summary": "Orient Technologies shares are down 1.38% to ₹286.35. The stock has fluctuated between ₹292 and ₹281.6 today. Institutional holdings have decreased, with MF holding dropping from 0.11% to 0.03% and FII holding falling from 6.49% to 3.56% since the June quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729229799000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Shares Surge 3.71% Amid Market Downturn",
            "Summary": "Orient Technologies shares are trading at ₹283.5, up 3.71% from the previous close. The stock hit a high of ₹285.1 and a low of ₹271.05. It's trading above most key SMAs except the 20-day SMA. The company has a ROE of 27.26% and a P/E of 26.07.",
            "Sentiment": "positive",
            "PublishDate": 1729056992000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Shares Up 0.24% Amid Market Decline",
            "Summary": "<p><span class='neutral'>Orient Technologies</span> shares are trading at <span class='neutral'>₹272.65</span>, <span class='positive'>up 0.24%</span> from previous close. The stock hit a <span class='positive'>high</span> of <span class='neutral'>₹274.95</span> and a <span class='negative'>low</span> of <span class='neutral'>₹271</span>. It's trading <span class='positive'>above most SMAs</span> except 20-day. <b>Sensex</b> and <b>Nifty</b> are <span class='negative'>down 0.19%</span> and <span class='negative'>0.25%</span> respectively.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728971498000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Shares Surge 2.43% Amid Market Rally",
            "Summary": "<p><span class='positive'>Orient Technologies</span> shares are trading at <span class='neutral'>₹259.2</span>, <span class='positive'>up 2.43%</span> from the previous close. The stock hit a <span class='positive'>high</span> of <span class='neutral'>₹260.5</span> and a <span class='negative'>low</span> of <span class='neutral'>₹247.55</span>. <b>Sensex</b> and <b>Nifty</b> are also <span class='positive'>up by 0.52% and 0.46%</span> respectively.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728365795000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Shares Tumble 4.44% Amid Market Downturn",
            "Summary": "<p><span class='neutral'>Orient Technologies</span> shares are trading at <span class='negative'>₹251, down 4.44%</span> from the previous close. The stock hit a <span class='positive'>high of ₹267.2</span> and a <span class='negative'>low of ₹248.1</span>. <b>Sensex</b> is <span class='negative'>down 0.44%</span> at ₹81,327.83, while <b>Nifty</b> is <span class='negative'>down 0.5%</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728279527000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Share Price Dips Amid Market Downturn",
            "Summary": "<p><span class='negative'>Orient Technologies</span> shares are <span class='negative'>down 1.08%</span> to ₹269.7. The stock has <b>fluctuated</b> between ₹264.5 and ₹275.5 today. <br/> Broader market indices <span class='neutral'>Nifty</span> and <span class='neutral'>Sensex</span> are also <span class='negative'>down by 2.12% and 2.1%</span> respectively.</p>",
            "Sentiment": "negative",
            "PublishDate": 1727934315000,
            "Source": "normal_news"
        },
        {
            "Title": "Orient Technologies: Stock Dips Amid Broader Market Decline",
            "Summary": "<p><span class='negative'>Orient Technologies shares are down 1.08%</span> to ₹269.7. The stock has <span class='neutral'>fluctuated between ₹264.5 and ₹275.5</span> today. It's trading <span class='positive'>above 50, 100, and 300-day SMAs</span> but <span class='negative'>below 5, 10, and 20-day SMAs</span>. The company has a <span class='positive'>ROE of 27.26%</span> and a P/E of 25.92. <b>Promoter holding stands at 73.21%</b>, with 0.11% MF and 6.49% FII holdings.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727934315000,
            "Source": "normal_news"
        }
    ]
}