{
    "Symbol": "ORIENTPPR",
    "ISIN": "INE592A01026",
    "News": [
        {
            "Title": "Orient Paper Q3FY26 Loss Widens to ₹21.26 Crores",
            "Summary": "Orient Paper & Industries reported a net loss of ₹21.26 crores for Q3FY26, wider than ₹10.51 crores in Q3FY25, despite revenue growth of 2.73% to ₹236.39 crores.",
            "Sentiment": "negative",
            "PublishDate": 1770815528822,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Paper Industries CIO Rajnish Sinha Resigns Due to Personal Reasons",
            "Summary": "Orient Paper Industries Limited announced that Chief Information Officer Rajnish Sinha resigned on July 22, 2025, citing personal reasons and career direction changes, with his resignation effective from November 30, 2025. The departure affects the company's senior management structure as Sinha was designated as Senior Management Personnel under SEBI regulations and had been contributing to the organization's IT digital transformation journey.",
            "Sentiment": "neutral",
            "PublishDate": 1764595001618,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orient Paper & Industries Reports Net Loss of ₹30.60 Crore in Q2 Despite Revenue of ₹199.75 Crore",
            "Summary": "Orient Paper & Industries Limited posted a net loss of ₹30.60 crore for the quarter ended September 30, 2025, compared to a net loss of ₹19.66 crore in the same period last year, with total income from operations at ₹199.75 crore. The company's earnings per share stood at negative ₹1.44 for the quarter, reflecting continued operational challenges despite maintaining revenue levels.",
            "Sentiment": "positive",
            "PublishDate": 1763121507731,
            "Source": "earnings"
        },
        {
            "Title": "Orient Paper & Industries Reports Mixed Quarterly Results with Net Profit of ₹33.99 Crore",
            "Summary": "Orient Paper & Industries Limited published its unaudited financial results for the quarter ended June 30, 2025. The company reported total income from operations of ₹238.34 crore compared to ₹238.28 crore in the previous quarter. Despite a loss before tax of ₹17.85 crore, the company achieved a net profit of ₹33.99 crore for the quarter, compared to a net loss of ₹6.42 crore in the previous quarter. Other comprehensive income contributed ₹71.17 crore, resulting in total comprehensive income of ₹105.17 crore. Basic and diluted earnings per share stood at ₹1.60. The results were reviewed by the Audit Committee and approved by the Board of Directors on August 5, 2025, and published in Business Standard and Pratidin newspapers on August 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754563074876,
            "Source": "earnings"
        },
        {
            "Title": "Orient Paper And Industries Approves ₹1.25 Billion Capital Expenditure Plan",
            "Summary": "Orient Paper And Industries has approved a capital expenditure plan worth ₹1.25 billion. The company's board has given approval for this investment initiative.",
            "Sentiment": "positive",
            "PublishDate": 1754407453195,
            "Source": "stock"
        },
        {
            "Title": "Orient Paper Approves Quarterly Results and Rs 125 Crore Capex Plan",
            "Summary": "Orient Paper and Industries Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company exercised a tax option under Section 115BAA of the Income Tax Act, resulting in a credit of Rs. 4848.71 lacs in tax expenses and a charge of Rs. 525.91 lacs in other comprehensive income for the quarter. The Board also approved a capital expenditure plan of Rs. 125 crores for debottlenecking, capacity addition and improving cost efficiency at the company's manufacturing facility in Amlai, Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1754405983491,
            "Source": "earnings"
        },
        {
            "Title": "Orient Paper & Industries Reports Q1 Net Profit of 340M Rupees After Previous Year Loss",
            "Summary": "Orient Paper & Industries posted a net profit of 340 million rupees in Q1, compared to a loss of 64 million rupees in the same period last year. The company's quarterly revenue remained flat at 2.38 billion rupees, unchanged from the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754405345846,
            "Source": "earnings"
        },
        {
            "Title": "Orient Paper & Industries Announces 89th AGM for August 29, 2025 via Video Conferencing",
            "Summary": "Orient Paper & Industries Limited has scheduled its 89th Annual General Meeting for Friday, August 29, 2025 at 3:00 PM IST through video conferencing. The company has submitted its Annual Report for FY 2024-25 and provided e-voting details for shareholders. Key agenda items include adoption of audited financial statements, re-appointment of Mr. Chandra Kant Birla as director, appointment of secretarial auditor M/s. Labh & Labh Associates for 5 years, ratification of cost auditor remuneration of Rs. 75,000, and alteration of Articles of Association to include electricity generation provisions. The e-voting period runs from August 26-28, 2025. The company reported revenue of Rs. 896 crore for FY25, up 7.7% from previous year, but posted a net loss of Rs. 55 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1753962329790,
            "Source": "stock"
        },
        {
            "Title": "Orient Paper & Industries Limited Announces 89th AGM for August 29, 2025 via Video Conferencing",
            "Summary": "Orient Paper & Industries Limited has scheduled its 89th Annual General Meeting for Friday, August 29, 2025 at 3:00 PM IST through video conferencing. The company has submitted its Annual Report for FY 2024-25 and provided e-voting details for shareholders. Key agenda items include adoption of audited financial statements, re-appointment of Mr. Chandra Kant Birla as director, appointment of secretarial auditor M/s. Labh & Labh Associates for 5 years (2025-26 to 2029-30), ratification of cost auditor remuneration of Rs. 75,000 for Mr. Somnath Mukherjee, and alteration of Articles of Association to include electricity generation provisions. E-voting will be available from August 26-28, 2025, with cut-off date of August 22, 2025. The company reported revenue of Rs. 896 crore for FY25, up 7.7% from previous year, but posted a net loss of Rs. 55 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1753961145829,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Paper & Industries Reports Q4 Financial Results",
            "Summary": "Orient Paper & Industries has reported its Q4 financial results. The company's net loss increased to 181 million rupees, compared to a loss of 64 million rupees in the same quarter last year. Sequentially, the loss increased from 105 million rupees in the previous quarter. The company's revenue for Q4 stood at 2.2 billion rupees, down from 2.4 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1747914383000,
            "Source": "result"
        },
        {
            "Title": "Orient Paper & Industries Reports Q3 Revenue Growth",
            "Summary": "Orient Paper & Industries has reported a revenue of 2.3 billion rupees for the third quarter, compared to 2.03 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739176565000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Paper & Industries Reports Increased Q3 Net Loss",
            "Summary": "Orient Paper & Industries has reported a net loss of 105 million rupees for the third quarter, compared to a loss of 32 million rupees in the same period last year. This represents a significant increase in the company's losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739176410000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Paper & Industries Reports Increased Q2 EBITDA Loss",
            "Summary": "Orient Paper & Industries has reported an EBITDA loss of 174 million rupees for the second quarter, compared to a loss of 115 million rupees in the same period last year. This represents a year-over-year increase in losses.",
            "Sentiment": "negative",
            "PublishDate": 1731318364000,
            "Source": "result"
        },
        {
            "Title": "Orient Paper & Industries Reports Significant Revenue Growth in Q2",
            "Summary": "Orient Paper & Industries has announced its second quarter financial results, reporting a revenue of 2.1 billion rupees. This represents a substantial increase from the 1.43 billion rupees reported in the same quarter of the previous year, indicating a year-over-year growth in the company's performance.",
            "Sentiment": "positive",
            "PublishDate": 1731318328000,
            "Source": "result"
        },
        {
            "Title": "Orient Paper & Industries Reports Increased Q2 Net Loss",
            "Summary": "Orient Paper & Industries has reported a net loss of 197 million rupees for the second quarter, compared to a loss of 163 million rupees in the same period last year. This represents an increase in losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731318261000,
            "Source": "result"
        }
    ]
}