{
    "Symbol": "ORIENTBELL",
    "ISIN": "INE607D01018",
    "News": [
        {
            "Title": "Orient Bell Promoter Increases Stake to 20.73%",
            "Summary": "Mahendra K. Daga, promoter of Orient Bell Limited, acquired 2,541 additional shares through open market purchase, raising his shareholding from 20.72% to 20.73% as per SEBI disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1770354556361,
            "Source": "stocks"
        },
        {
            "Title": "Orient Bell corrects share acquisition disclosure error",
            "Summary": "Orient Bell Limited issued a clarification correcting inadvertent errors in shareholding figures disclosed under SEBI regulations for a 250-share acquisition transaction on February 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770188908759,
            "Source": "stocks"
        },
        {
            "Title": "Orient Bell Promoter Increases Stake via Market Purchase",
            "Summary": "Mahendra K. Daga, promoter of Orient Bell Limited, acquired 250 additional shares through open market purchase on January 30, 2026, maintaining his 20.69% shareholding in the ceramic tiles company.",
            "Sentiment": "neutral",
            "PublishDate": 1770108481394,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Bell Q3 FY26 Revenue Up 3.4%, EBITDA Surges 35%",
            "Summary": "Orient Bell Limited reports Q3 FY26 revenue growth of 3.4% YoY with EBITDA jumping 35% to INR10.8 crores. Company maintains strong gross margins and achieves virtually debt-free status.",
            "Sentiment": "positive",
            "PublishDate": 1769772453429,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Bell schedules Q3FY26 earnings call for Jan 27",
            "Summary": "Orient Bell Limited has scheduled its quarterly earnings conference call for January 27, 2026, at 3:30 PM IST to discuss Q3FY26 financial results and nine-month performance ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768918943377,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Bell Opens Special Window for Share Transfer",
            "Summary": "Orient Bell Limited announces special window for re-lodgement of physical share transfer requests following SEBI circular, with notice published in Financial Express and Jansatta newspapers.",
            "Sentiment": "neutral",
            "PublishDate": 1766045983136,
            "Source": "stocks"
        },
        {
            "Title": "Freesia Investment Acquires Additional Shares in Orient Bell Limited",
            "Summary": "Freesia Investment and Trading Co. Limited, a promoter group entity, acquired 2,070 shares (0.01%) of Orient Bell Limited through open market transactions on November 17, 2025. The acquisition maintains Freesia's total shareholding at 6,67,890 shares, representing 4.54% of Orient Bell's total share capital of 14,69,74,760 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763553439065,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Bell Reports 22.5% EBITDA Growth in Q2 FY26 Despite Soft Market Conditions",
            "Summary": "Orient Bell Limited achieved 3% revenue growth and 22.5% EBITDA increase to INR 9.8 crores in Q2 FY26, driven by volume growth and 250 basis points improvement in gross margins to 39%. The company turned around from Q1 losses with PBT of INR 3.9 crores versus INR 80 lakhs last year, while maintaining healthy working capital cycle of 26 days and expanding into adhesives business.",
            "Sentiment": "positive",
            "PublishDate": 1763373469730,
            "Source": "earnings"
        },
        {
            "Title": "Orient Bell Reports Q2 Results: Revenue Up, Strong Profit Recovery",
            "Summary": "Orient Bell Limited reported steady performance in Q2 FY2026, with revenue of ₹164.1 crore and a strong profit recovery to ₹269 lakh, compared to a loss in the previous year. For H1 FY2026, revenue stood at ₹304 crore with a net profit of ₹203 lakh, signaling a turnaround despite marginally lower sales. Consolidated profit rose to ₹318.65 lakh on revenue of ₹165.1 crore, reflecting improved operational efficiency and stronger demand momentum.",
            "Sentiment": "negative",
            "PublishDate": 1762852430831,
            "Source": "earnings"
        },
        {
            "Title": "Orient Bell Schedules Earnings Conference Call for November 11, 2025",
            "Summary": "Orient Bell Limited has announced a conference call scheduled for Tuesday, November 11, 2025, at 4:00 PM IST to discuss the company's unaudited financial results for the quarter and half-year ended September 30, 2025. The call will be led by CEO Aditya Gupta and CFO Anuj Arora. The earnings call is scheduled post the board meeting on the same date where the financial results and other outcomes will be submitted. Dial-in details have been provided for domestic and international participants, with toll-free numbers available for Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762430701756,
            "Source": "earnings"
        },
        {
            "Title": "Good Team Investment Increases Stake in Orient Bell Limited to 16.71%",
            "Summary": "Good Team Investment and Trading Company Private Limited disclosed an increase in its shareholding in Orient Bell Limited. The promoter group entity acquired 1,111 shares, raising its total holding from 24,11,484 shares (16.70%) to 24,12,595 shares (16.71%) of the total share capital. The acquisition was completed on September 12, 2022. Orient Bell's equity share capital remained unchanged at 14,43,80,760 shares, while the total diluted share capital stands at 14,72,20,760 shares. The company's shares are listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761795462947,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Bell Promoter Mahendra K. Daga Increases Shareholding to 20.62%",
            "Summary": "Mahendra K. Daga, a promoter of Orient Bell Limited, has increased his shareholding through open market purchases. He acquired 5,669 shares across two transactions, bringing his total holding to 30,24,752 shares, representing 20.62% of the company's voting rights. The disclosure was made under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1757679113847,
            "Source": "stock"
        },
        {
            "Title": "Orient Bell Q1 FY26 Revenue Drops 3% to ₹142.5 Crores Amid Subdued Demand",
            "Summary": "Orient Bell Limited reported net sales of ₹142.5 crores for Q1 FY26, down 3% from ₹147.3 crores in the previous year. Despite maintaining volumes year-on-year, the company faced lower average selling prices due to increased trade discounting and heightened competition. Gross margins improved by 50 basis points to 36.5%, while consolidated EBITDA stood at ₹5.6 crores with margins improving by 60 basis points. The company maintained a net debt position of ₹9.5 crores and improved its cash conversion cycle to 33 days from 35 days. Vitrified tile mix increased to 58% of sales, up 2% from last year. CEO Aditya Gupta noted that demand remained subdued with exports showing some improvement in May and June, though the three-month moving average remains below FY25 levels. The company reported that approximately 39 units in Morbi have shut down in the last three months due to market conditions. Orient Bell welcomed new CFO Anuj Arora, a chartered accountant with 23 years of experience. The company continues investing in brand building with TV campaigns and launched an AI-based visualization tool that has crossed one million views. Current capacity utilization stands at approximately 60%.",
            "Sentiment": "neutral",
            "PublishDate": 1754651813364,
            "Source": "earnings"
        },
        {
            "Title": "Orient Bell Reports 13% EBITDA Growth in Q1 FY26, Plans 385 New Showrooms",
            "Summary": "Orient Bell achieved 13% year-over-year EBITDA growth in Q1 FY26 with margins improving to 3.9%. Premium and vitrified tiles constitute 58% of sales, while GVT (Glazed Vitrified Tiles) contributes 40%. The company plans to open 385 tile showrooms as part of its expansion strategy. Orient Bell maintains a net debt of ₹9.5 crores and operates with a 33-day cash cycle. The company is focusing on cost efficiency measures and positioning itself to capitalize on housing and infrastructure demand.",
            "Sentiment": "positive",
            "PublishDate": 1754406042671,
            "Source": "earnings"
        },
        {
            "Title": "Orient Bell Approves Quarterly Results and Appoints Anuj Arora as CFO",
            "Summary": "Orient Bell Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company appointed Mr. Anuj Arora as Chief Financial Officer effective August 5, 2025. Arora is a Chartered Accountant with over 23 years of experience across manufacturing, retail, and hospitality sectors, having previously worked with companies including Uflex Limited, Apollo International Limited, Reliance Retail Limited, and Ballarpur Industries Limited. His appointment was based on recommendations from the Nomination and Remuneration Committee and Audit Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1754394360324,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orient Bell Limited Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Orient Bell Limited announced its unaudited financial results for the quarter ended June 30, 2025. The Board of Directors approved both standalone and consolidated results on August 5, 2025. On a standalone basis, the company reported revenue from operations of ₹10,858.75 lakh compared to ₹9,672.67 lakh in the previous quarter and ₹14,513.43 lakh in the same quarter last year. The company recorded a net loss of ₹65.98 lakh for the quarter, compared to a profit of ₹242.07 lakh in the previous quarter and a loss of ₹193.89 lakh in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations stood at ₹10,913.50 lakh with a net loss of ₹41.48 lakh. The company operates in the ceramic tiles and allied products segment. Earnings per share on a standalone basis was ₹(1.33) compared to ₹1.70 in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754392414820,
            "Source": "earnings"
        },
        {
            "Title": "Orient Bell Limited Schedules Q1FY26 Earnings Conference Call for August 5, 2025",
            "Summary": "Orient Bell Limited has scheduled a post-earnings conference call for Tuesday, August 5, 2025, at 5:00 PM IST following the submission of unaudited financial results for the quarter ended June 30, 2025. The call will be represented by CEO Aditya Gupta and includes dial-in details for domestic and international participants. The company has provided contact information for investor relations support through Stellar IR Advisors.",
            "Sentiment": "neutral",
            "PublishDate": 1753956637865,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Downgrades Orient Bell's Credit Rating to 'A-/Stable' from 'A/Negative'",
            "Summary": "CRISIL Ratings downgraded Orient Bell Ltd's long-term rating to 'CRISIL A-/Stable' from 'CRISIL A/Negative' and short-term rating to 'CRISIL A2+' from 'CRISIL A1' for bank facilities totaling Rs. 236.15 crore. The downgrade reflects moderation in business risk profile marked by steady decline in revenue and profitability over the years. Revenue remained stagnant at Rs 672 crore in fiscal 2025 compared to Rs 677 crore in fiscal 2024 due to reduced demand in domestic and export markets. Operating margin improved to 4.4% in fiscal 2025 from 3.4% in fiscal 2024, supported by vitrified tiles commanding premium pricing, but remains below CRISIL's expectation of 5.5-6.0%. The company faces challenges from high marketing expenditure, low offtake and intense competition resulting in lower product realisation. Revenue growth is expected to remain rangebound at 4-5% in fiscal 2026. The ratings continue to reflect the company's established position in the tiles industry, diversified geographical reach and healthy financial risk profile with comfortable gearing at 0.14 times and strong liquidity supported by Rs 30 crore cash and bank balance.",
            "Sentiment": "negative",
            "PublishDate": 1753706383887,
            "Source": "stock"
        },
        {
            "Title": "Porinju Veliyath's Equity Intelligence India Increases Stake in Orient Bell",
            "Summary": "Equity Intelligence India Private Limited, led by Porinju Veliyath, has increased its stake in Orient Bell by 0.90% during the first quarter. This represents a notable change in the company's ownership structure.",
            "Sentiment": "positive",
            "PublishDate": 1752672876000,
            "Source": "default"
        },
        {
            "Title": "Orient Bell Launches New Adhesive Product MasterBond",
            "Summary": "Orient Bell has introduced a new product called MasterBond, which is an adhesive designed for fixing tiles and stones.",
            "Sentiment": "positive",
            "PublishDate": 1752573992000,
            "Source": "default"
        },
        {
            "Title": "Orient Bell Reports Q4 Financial Results",
            "Summary": "Orient Bell has released its Q4 financial results. The company's EBITDA for Q4 was 89.5 million rupees, down from 120.6 million rupees year-over-year. The EBITDA margin decreased to 4.52% from 5.79% in the same period last year. Revenue for Q4 was 1.98 billion rupees, compared to 2.08 billion rupees in the previous year. The consolidated net profit for Q4 stood at 27.5 million rupees, down from 49.3 million rupees year-over-year, but up from 9.8 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747923448000,
            "Source": "result"
        },
        {
            "Title": "Orient Bell Reports Improved Q2 EBITDA and Margin",
            "Summary": "Orient Bell, a company likely in the manufacturing sector, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 75 million rupees from 53 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 4.68% from 3.31% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730105699000,
            "Source": "result"
        },
        {
            "Title": "Orient Bell Reports Increased Q2 Net Profit",
            "Summary": "Orient Bell Limited has reported a year-over-year increase in its second quarter consolidated net profit, rising from 7 million rupees to 10 million rupees. The company's revenue for Q2 remained stable at 1.6 billion rupees compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730105646000,
            "Source": "result"
        }
    ]
}