{
    "Symbol": "ORIENTALTL",
    "ISIN": "INE998H01012",
    "News": [
        {
            "Title": "Oriental Trimex Q3 Results & USD 43M FCCB Approval",
            "Summary": "Oriental Trimex reports Q3FY26 profit of ₹10.98 lacs with 76.52% revenue growth. Board approves USD 43 million FCCB fundraising on private placement basis.",
            "Sentiment": "positive",
            "PublishDate": 1770892530734,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Trimex Board Meet on Feb 12 for Q3 Results",
            "Summary": "Oriental Trimex Limited has scheduled a board meeting for February 12, 2026, to consider Q3FY26 unaudited financial results and discuss fund raising options through equity, debt, or hybrid instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1770220530846,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oriental Trimex Defaults on Rs 3.24 Crore One-Time Settlement with Asset Reconstruction Company",
            "Summary": "Oriental Trimex Limited has defaulted on a One-Time Settlement arrangement worth Rs 3.24 crore with Asset Reconstruction Company India Limited, comprising Rs 2.29 crore principal and Rs 95.91 lakh interest. The company disclosed this default to stock exchanges in compliance with SEBI regulations regarding payment defaults on loans from financial institutions.",
            "Sentiment": "negative",
            "PublishDate": 1764852686265,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oriental Trimex Reports Loss of ₹23.35 Lacs in Q2 Results",
            "Summary": "Oriental Trimex Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a net loss of ₹23.35 lacs for the quarter, compared to a loss of ₹149.41 lacs in the same period last year. For the half year, the company posted a loss of ₹166.98 lacs versus ₹856.56 lacs in the previous year. Total revenue for the quarter stood at ₹785 lacs. The company's total assets were ₹12,425.61 lacs as of September 30, 2025, with total equity of ₹9,836.34 lacs. The Board of Directors approved these results at their meeting held on November 12, 2025. The results were reviewed by the audit committee and audited by Aditya S Jain and Company, Chartered Accountants.",
            "Sentiment": "neutral",
            "PublishDate": 1762978138129,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Trimex Limited Appoints Ms. Amreen as Company Secretary and Compliance Officer",
            "Summary": "Oriental Trimex Limited appointed Ms. Amreen as Company Secretary and Compliance Officer effective October 10, 2025. The Board of Directors approved the appointment in their meeting held on October 10, 2025. Ms. Amreen is an Associate Member of the Institute of Company Secretaries of India with membership number ACS 65722. She has experience in managing secretarial and compliance functions of listed companies and possesses knowledge of the Companies Act 2013, SEBI LODR Regulations, and other corporate and securities laws. The appointment was made under Section 203 of the Companies Act 2013 and Regulation 6(1) of SEBI LODR Regulations 2015. Her term continues until resignation or termination in accordance with applicable laws and company policies.",
            "Sentiment": "neutral",
            "PublishDate": 1760100380548,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oriental Trimex Limited Company Secretary Pooja Somani Resigns Due to Personal Reasons",
            "Summary": "Ms. Pooja Somani has resigned from her position as Company Secretary and Compliance Officer of Oriental Trimex Limited, effective September 22, 2025, citing personal reasons. The company has informed stock exchanges NSE and BSE about this key managerial personnel change as required under SEBI listing regulations. Somani holds ACS membership number 44573. The resignation was communicated by Managing Director Rajesh Kumar Punia.",
            "Sentiment": "neutral",
            "PublishDate": 1758543454871,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oriental Trimex Limited Reports Quarterly Results and Key Board Appointments",
            "Summary": "Oriental Trimex Limited's Board approved unaudited standalone financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 169.85 lacs and profit for the quarter of Rs 59.56 lacs, with basic earnings per share of Rs 0.11. The Board re-appointed Mr. Rajesh Kumar Punia as Managing Director for five years starting January 1, 2026, subject to shareholder approval. Additionally, the company appointed M/s. Aditya S Jain and Company as Statutory Auditors for five consecutive years from the 29th AGM to the 34th AGM, and M/s. Aman Kesarwani & Associates as Secretarial Auditors for five years from April 1, 2025 to March 31, 2030.",
            "Sentiment": "positive",
            "PublishDate": 1753950030053,
            "Source": "corporate_action"
        },
        {
            "Title": "Oriental Trimex Limited Schedules Board Meeting for July 31, 2025 to Approve Quarterly Financial Results",
            "Summary": "Oriental Trimex Limited has scheduled a Board of Directors meeting for July 31, 2025, to consider and approve the Standalone Un-Audited Financial Results for the quarter ended June 30, 2025. The company has implemented a trading window closure for designated persons from July 1, 2025, which will remain in effect until 48 hours after the announcement of the quarterly financial results. The meeting notice was signed by Managing Director Rajesh Kumar Punia.",
            "Sentiment": "neutral",
            "PublishDate": 1753363254761,
            "Source": "earnings"
        },
        {
            "Title": "Oriental Trimex: Expansion and Efficiency Initiatives Boost Stock",
            "Summary": "Oriental Trimex shares hit 5% upper circuit after Q1 update. Company introduced ultrathin wire cutting technology, received black granite mining lease in Odisha, plans to divest non-core assets, and sees growth in NCR luxury housing market.",
            "Sentiment": "positive",
            "PublishDate": 1751868681000,
            "Source": "normal_news"
        }
    ]
}