{
    "Symbol": "ORIENTCER",
    "ISIN": "INE569C01020",
    "News": [
        {
            "Title": "Orient Ceratech Q3FY26 Results Show Strong Growth",
            "Summary": "Orient Ceratech Limited reported robust financial performance for Q3FY26 with standalone revenue of ₹9,698.41 lakhs and net profit after tax of ₹428.16 lakhs, demonstrating significant improvement over previous periods.",
            "Sentiment": "positive",
            "PublishDate": 1770392050723,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orient Ceratech Postal Ballot Results Declared",
            "Summary": "Orient Ceratech Limited successfully passes two special resolutions through postal ballot - regularization of Mrs. Akhila Agnihotri Samdaria as Independent Director and reappointment of Mr. Manan Shah as Managing Director.",
            "Sentiment": "positive",
            "PublishDate": 1770390729511,
            "Source": "stocks"
        },
        {
            "Title": "Orient Ceratech Announces Postal Ballot for Key Appointments",
            "Summary": "Orient Ceratech Limited has issued a postal ballot notice for shareholders to vote on the regularization of Mrs. Akhila Agnihotri Samdaria as Independent Director and reappointment of Mr. Manan Shah as Managing Director through electronic voting from January 8 to February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767793938389,
            "Source": "stocks"
        },
        {
            "Title": "Orient Ceratech clarifies recent price movement",
            "Summary": "Orient Ceratech Limited responds to BSE inquiry about recent stock price movements, attributing changes to market conditions rather than undisclosed material events or company-specific factors.",
            "Sentiment": "neutral",
            "PublishDate": 1767592431935,
            "Source": "stocks"
        },
        {
            "Title": "Orient Ceratech Reports Strong Q2 Performance, Announces Board Changes and Subsidiary Expansion",
            "Summary": "Orient Ceratech Limited reported quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs. 115.52 crores and profit before tax of Rs. 8.18 crores. The company announced significant board changes including the appointment of Mrs. Akhila Agnihotri Samdaria as Independent Director for 5 years and re-appointment of Mr. Manan Shah as Managing Director for 5 years from April 2026. Mrs. Neeta Shah resigned as Independent Director due to professional commitments. The board approved a new plant setup by wholly-owned subsidiary Orient Advanced Materials Private Limited for foundry coating and resin coating business at Baraya, expected to be operational by Q4 FY2025-26. Additionally, the company received an eviction order from Gujarat Industrial Development Corporation for alleged outstanding dues of approximately Rs. 2.51 crores, which the company plans to challenge in District Court.",
            "Sentiment": "neutral",
            "PublishDate": 1762800045197,
            "Source": "corporate_action"
        },
        {
            "Title": "Orient Ceratech Undergoes Income Tax Department Search at Registered Office",
            "Summary": "The Income Tax Department conducted a search at Orient Ceratech Limited's registered office from October 13-16, 2025. During the search, certain records and electronic data were seized for examination, and statements from company officials were recorded. The company stated there are no violations or contraventions committed or alleged as of now. Orient Ceratech cooperated with the proceedings and confirmed that business operations remain unaffected. The company indicated the search was for limited verification purposes with no financial impact expected.",
            "Sentiment": "neutral",
            "PublishDate": 1760630282599,
            "Source": "stock"
        },
        {
            "Title": "Orient Ceratech Invests 260 Million Rupees in Baraya Plant Upgrade",
            "Summary": "Orient Ceratech has upgraded its Baraya plant with an investment of 260 million rupees. The upgrade represents a significant capital expenditure by the company to enhance its manufacturing capabilities at this facility.",
            "Sentiment": "positive",
            "PublishDate": 1758893798106,
            "Source": "stock"
        },
        {
            "Title": "Orient Ceratech Reports 20% Jump in Quarterly Net Profit to ₹312.59 Crores",
            "Summary": "Orient Ceratech Limited reported a net profit of ₹312.59 lacs for the quarter ended June 30, 2025, compared to ₹260.42 lacs in the same period last year, marking a 20% increase. Revenue from operations rose to ₹10,012.22 lacs from ₹9,978.31 lacs year-on-year. On a consolidated basis, net profit increased to ₹430.24 lacs from ₹290.83 lacs in the previous year quarter. The company operates in two segments: Alumina Refractories & Monolithics products & bauxite ores, and Power division. Basic earnings per share stood at ₹0.26 compared to ₹0.22 in the same quarter last year. The Board approved these unaudited financial results at a meeting held on August 7, 2025, with statutory auditors issuing an unmodified review opinion.",
            "Sentiment": "positive",
            "PublishDate": 1754564642773,
            "Source": "earnings"
        },
        {
            "Title": "Orient Ceratech Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Orient Ceratech has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 53 million rupees from 60 million rupees in the same quarter last year. Additionally, the EBITDA margin declined to 7.15% from 7.46% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738851294000,
            "Source": "earnings"
        },
        {
            "Title": "Orient Ceratech Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "Orient Ceratech has reported a decrease in both net profit and revenue for the third quarter. The company's net profit fell to 24 million rupees, down from 47 million rupees year-over-year and 18 million rupees quarter-over-quarter. Revenue also declined to 742 million rupees from 804 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738851228000,
            "Source": "earnings"
        }
    ]
}