{
    "Symbol": "ORISSAMINE",
    "ISIN": "INE725E01024",
    "News": [
        {
            "Title": "OMDC Reports Strong Q3 FY26 Turnaround with ₹434.41L Profit",
            "Summary": "The Orissa Minerals Development Company Limited posted net profit of ₹434.41 lakh in Q3 FY26, marking significant recovery from ₹749.33 lakh loss in Q3 FY25, driven by iron ore operations.",
            "Sentiment": "positive",
            "PublishDate": 1770823211178,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orissa Minerals Q2 Net Profit Surges 296.8% YoY",
            "Summary": "Orissa Minerals Development Company reports exceptional Q2 performance with net profit jumping to ₹314.11 million from ₹79.16 million year-on-year, while revenue grows 7.4% to ₹2,512.75 million.",
            "Sentiment": "positive",
            "PublishDate": 1766157034220,
            "Source": "co_actions_results"
        },
        {
            "Title": "OMDC Appeals High Court Verdict to Supreme Court",
            "Summary": "Orissa Minerals Development Company Limited has filed appeals at the Supreme Court of India against the Calcutta High Court's December 9 judgment in its dispute with Jai Balaji Industries.",
            "Sentiment": "neutral",
            "PublishDate": 1765439028331,
            "Source": "stocks"
        },
        {
            "Title": "Supreme Court Rejects Mining Lease Renewals for Orissa Minerals Development",
            "Summary": "The Supreme Court has disposed of review petitions filed by Orissa Minerals Development and 3A Capitals, upholding the denial of the Kolha-Roida mining lease renewal. Additionally, renewal requests for Thakurani and Dalki leases were also rejected by the court.",
            "Sentiment": "negative",
            "PublishDate": 1749017607000,
            "Source": "default"
        },
        {
            "Title": "Public Hearing Scheduled for Orissa Minerals' Bhadrasahi Mines",
            "Summary": "Orissa Minerals Development Company has announced that a public hearing for their Bhadrasahi Iron & Manganese Ore Mines will take place on March 26. This hearing is likely part of the regulatory process for mining operations, potentially related to environmental clearances or community engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1739276333000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orissa Minerals Development Reports Q3 Net Loss",
            "Summary": "Orissa Minerals Development has reported a net loss of 75 million rupees in the third quarter, compared to a profit of 23 million rupees in the same period last year. The company's revenue for Q3 decreased to 206 million rupees from 283 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739233254000,
            "Source": "earnings"
        },
        {
            "Title": "Orissa Minerals Development Company Suspends CFO Ramakanta Behera",
            "Summary": "Orissa Minerals Development Company has suspended its Chief Financial Officer (CFO), Ramakanta Behera. The company has not provided any specific reasons for the suspension in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1736295403000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orissa Minerals Development Company Suspends CFO Ramakanta Behera",
            "Summary": "Orissa Minerals Development Company has suspended its Chief Financial Officer (CFO), Ramakanta Behera. The company has not provided any additional details regarding the reasons for the suspension or any interim arrangements for the CFO position.",
            "Sentiment": "negative",
            "PublishDate": 1736248717000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orissa Minerals Development Board Meeting Scheduled",
            "Summary": "Orissa Minerals Development Company has announced a board meeting on November 30th. The primary agenda is to discuss the company's funding requirements for its mining operations and other business matters.",
            "Sentiment": "neutral",
            "PublishDate": 1732839764000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orissa Minerals Development Company to Hold Board Meeting on November 30",
            "Summary": "Orissa Minerals Development Company has announced a board meeting scheduled for November 30. The primary agenda items include discussing the requirement of funds for mines and other business matters. This meeting suggests the company is planning for future financial needs and operational strategies.",
            "Sentiment": "neutral",
            "PublishDate": 1732796694000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Orissa Minerals Development Receives Consent for Belkundi Mine",
            "Summary": "<p>Orissa Minerals Development Company has obtained <span class='positive'>consent to establish</span> operations for its <b>Belkundi Iron & Manganese Ore Mine</b>. This <span class='positive'>regulatory approval</span> is a <span class='positive'>crucial step</span> for the company to proceed with <span class='neutral'>mining activities</span> at the site.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728476985000,
            "Source": "corporate_action"
        }
    ]
}