{
    "Symbol": "ORKLAINDIA",
    "ISIN": "INE16NZ01023",
    "News": [
        {
            "Title": "Orkla India Q3FY26 Results: Revenue Up 3.2% YoY",
            "Summary": "Orkla India reported Q3FY26 revenue of Rs. 6,242.2 million, up 3.2% YoY. Net profit declined to Rs. 551.7 million from Rs. 650.4 million due to exceptional items of Rs. 158.4 million.",
            "Sentiment": "neutral",
            "PublishDate": 1770808380072,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orkla India schedules Q3FY26 earnings call for Feb 11",
            "Summary": "Orkla India Limited announces board meeting and investor conference call on February 11, 2026 to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770029502542,
            "Source": "co_actions_results"
        },
        {
            "Title": "Orkla India Faces ₹62.69L GST Demand After Appeal Loss",
            "Summary": "Orkla India Limited received an adverse order from CGST Appeals confirming ₹62.69 lakh demand including penalty for non-reversal of input tax credit on damaged stock returns for FY2020-23.",
            "Sentiment": "negative",
            "PublishDate": 1769073676712,
            "Source": "stocks"
        },
        {
            "Title": "Orkla India Gets New CIN from Ministry",
            "Summary": "Orkla India Limited announces change in Corporate Identification Number from U15136KA1996PLC021007 to L15136KA1996PLC021007 as updated by Ministry of Corporate Affairs.",
            "Sentiment": "neutral",
            "PublishDate": 1768545900214,
            "Source": "stocks"
        },
        {
            "Title": "Orkla India Faces ₹2.46 Cr GST Demand from Kerala",
            "Summary": "Orkla India received a GST demand order of ₹2.46 crores from Kerala State Tax Department for alleged misclassification of ready-to-cook products during FY2018-19 to FY2023-24. Company plans to contest the demand.",
            "Sentiment": "negative",
            "PublishDate": 1767708676030,
            "Source": "stocks"
        },
        {
            "Title": "Orkla India Gets Buy Rating with ₹800 Target Price",
            "Summary": "Analysts initiate coverage on Orkla India with Buy rating and ₹800 target price, citing strong regional market position, export growth potential, and expected revenue CAGR of 9% over FY25-28E.",
            "Sentiment": "positive",
            "PublishDate": 1766590076132,
            "Source": "stocks"
        },
        {
            "Title": "JPMorgan Initiates Overweight Rating on Orkla India",
            "Summary": "JPMorgan has initiated coverage on Orkla India with an overweight rating and set a target price of ₹745.00 per share, indicating positive outlook for the FMCG company.",
            "Sentiment": "positive",
            "PublishDate": 1765943469250,
            "Source": "stocks"
        },
        {
            "Title": "Orkla India Reports 4.9% Revenue Growth in First Post-Listing Earnings Call",
            "Summary": "Orkla India delivered revenue of INR 6,503 million with 7.7% volume growth in Q2 FY26, driven by strong convenience foods performance at 19.2% growth despite spice price deflation impacting overall revenue. The company maintained healthy EBITDA margin of 16.9% while managing GST 2.0 transition costs and commodity price challenges in its first earnings call since November listing.",
            "Sentiment": "positive",
            "PublishDate": 1763541861248,
            "Source": "earnings"
        },
        {
            "Title": "Orkla India Reports 7% Drop in Q2 Net Profit to Rs 77 Crore in First Results Since Listing",
            "Summary": "Orkla India, parent company of MTR, reported a 7% decline in net profit to Rs 76.7 crore for Q2 despite 5% revenue growth to Rs 650.3 crore, with performance impacted by GST migration costs and reduced PLI benefits. The newly-listed company's shares will be closely watched by investors following these weak quarterly results, which mark its first earnings report since the successful Rs 1,667 crore IPO that was subscribed 48.7 times.",
            "Sentiment": "neutral",
            "PublishDate": 1763094253511,
            "Source": "earnings"
        },
        {
            "Title": "Orkla India Reports Quarterly Results Following Recent IPO Listing",
            "Summary": "Orkla India Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025, marking its first quarterly disclosure since completing its IPO of 22,843,008 equity shares at Rs. 730 per share in November 2025. The food products and beverages company, formerly known as MTR Foods Private Limited, listed on NSE and BSE on November 6, 2025, with total IPO proceeds of Rs. 16,673.3 million through an offer for sale.",
            "Sentiment": "neutral",
            "PublishDate": 1763063835508,
            "Source": "earnings"
        },
        {
            "Title": "Orkla India Targets ₹5,000 Cr Revenue By FY28 With 30% Capacity Expansion",
            "Summary": "Orkla India is commissioning a new manufacturing line in Karnataka to boost capacity by 30% while expanding its ready-to-eat and instant mix segments with a strong pipeline in packaged foods and spices. The company is targeting ₹5,000 crore revenue by FY28 through focus on innovation, nutrition, and rural market penetration.",
            "Sentiment": "positive",
            "PublishDate": 1763051671599,
            "Source": "stock"
        }
    ]
}