{
    "Symbol": "ORTINGLOBE",
    "ISIN": "INE749B01020",
    "News": [
        {
            "Title": "Ortin Global Open Offer by Parveen Satija at ₹14.65",
            "Summary": "Mr. Parveen Satija announces open offer to acquire 26% stake in Ortin Global Limited at ₹14.65 per share, triggered by Share Purchase Agreement with promoter sellers.",
            "Sentiment": "neutral",
            "PublishDate": 1770776749731,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ortin Global Board Meet Set for Feb 14 to Review Q3 Results",
            "Summary": "Ortin Global Limited has scheduled a board meeting for February 14, 2026, to consider unaudited financial results for the quarter and nine months ended December 31, 2025, as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770307096305,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ortin Global Reports Quarterly Loss and Approves Dubai Subsidiary Formation",
            "Summary": "Ortin Global Limited reported a net loss of Rs 50.25 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 17.54 lakhs in the previous quarter. The company's board approved the incorporation of a wholly owned subsidiary, Ortin Global Dubai FZ-LLC, in UAE with a paid-up capital of USD 30,000 to expand its healthcare and pharma business operations into new markets.",
            "Sentiment": "negative",
            "PublishDate": 1763140912878,
            "Source": "corporate_action"
        },
        {
            "Title": "Ortin Global Limited Reports Loss of Rs 17.54 Crores for Quarter Ended June 30, 2025",
            "Summary": "Ortin Global Limited approved its unaudited financial results for the quarter ended June 30, 2025, during a board meeting held on August 14, 2025. The company reported a net loss after tax of Rs 17.54 crores compared to Rs 16.41 crores loss in the previous quarter. Total income decreased to Rs 8.09 crores from Rs 11.63 crores in the prior quarter. Net sales dropped significantly to Rs 3.98 crores from Rs 4.53 crores. Total expenses remained elevated at Rs 24.38 crores versus Rs 21.75 crores in the previous quarter. The company's earnings per share stood at negative Rs 0.27. The paid-up equity share capital remained unchanged at Rs 813.14 crores. The results were recommended by the Audit Committee and received a clean limited review report from statutory auditors Mathesh & Ramana.",
            "Sentiment": "negative",
            "PublishDate": 1755180435122,
            "Source": "earnings"
        },
        {
            "Title": "Ortin Global Limited Schedules EGM on August 25, 2025 for Board Appointments",
            "Summary": "Ortin Global Limited has scheduled an Extraordinary General Meeting for August 25, 2025 at 3:00 PM via video conferencing. The meeting will address five special resolutions including the appointment of Mr. Sarang Balbhimrao Patodekar as Chairperson and Independent Director for a 5-year term from July 10, 2025 to July 9, 2030. The agenda also includes appointing Mr. Ajay Vishwakarma and Ms. Mounika Pammi as Independent Directors for similar 5-year terms. Additionally, shareholders will vote on appointing Mr. Prashant Prakash Sawant and Mrs. Prakruti Prashant Sawant as Whole-time Directors for 3-year terms from July 10, 2025 to July 9, 2028, each with monthly remuneration of Rs. 55,000. The pharmaceutical company, formerly known as Ortin Laboratories Limited, reported turnover of Rs. 602.03 lakhs and net loss of Rs. 9.36 lakhs for 2024-25. Remote e-voting will be available from August 22-24, 2025, with the cut-off date for voting eligibility set as August 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754135437325,
            "Source": "corporate_governance"
        }
    ]
}