{
    "Symbol": "OSELDEVICE",
    "ISIN": "INE0RMF01018",
    "News": [
        {
            "Title": "OSEL Devices Reports Strong H1 Performance with 84% Revenue Growth",
            "Summary": "OSEL Devices reported H1 revenue of 1.5 billion rupees compared to 874 million rupees in the previous year, representing significant growth. The company's H1 EBITDA increased to 247 million rupees from 134 million rupees year-over-year, with EBITDA margin improving to 16.79% from 15.37%. Net profit for H1 reached 152 million rupees versus 80 million rupees in the prior year. Q2 EBITDA was 247 million rupees compared to 134 million rupees year-over-year, with Q2 EBITDA margin at 16.79% versus 15.37%.",
            "Sentiment": "positive",
            "PublishDate": 1762965426138,
            "Source": "earnings"
        },
        {
            "Title": "Mukul Agarwal Acquires 7.56% Stake in Osel Devices as Stock Hits Upper Circuit",
            "Summary": "Osel Devices shares surged 5% to reach an upper circuit of Rs 562.05 after investor Mukul Mahavir Agarwal acquired over 13 lakh shares, representing a 7.56% stake in the company. The stock has delivered 218% returns over the past year and risen 251% from its IPO price of Rs 160 per share. Osel Devices debuted on NSE SME in September 2024 with a Rs 70 crore issue that was subscribed 129 times. The company manufactures LED display systems for commercial applications including advertising and corporate use, and also produces hearing aids which contribute 30% to consolidated revenue. The stock has gained 63% in three months and over 90% in six months.",
            "Sentiment": "positive",
            "PublishDate": 1759906355578,
            "Source": "stock"
        },
        {
            "Title": "Osel Devices Partners with Frye Electronics for Hearing Aid Analyzer Distribution",
            "Summary": "Osel Devices has formed a distribution partnership with Frye Electronics Inc. for hearing aid analyzers and related accessories. This collaboration aims to expand the reach of these specialized devices in the market.",
            "Sentiment": "positive",
            "PublishDate": 1750319543000,
            "Source": "default"
        },
        {
            "Title": "OSEL Devices Enters Strategic Agreement with TPV for Philips Mobile Devices in India",
            "Summary": "OSEL Devices has entered into a strategic agreement with TPV Audio and Visual Technology. The agreement allows OSEL Devices to manufacture and distribute Philips-branded mobile phones and tablets in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1737453194000,
            "Source": "corporate_action"
        }
    ]
}