{
    "Symbol": "OSWALGREEN",
    "ISIN": "INE143A01010",
    "News": [
        {
            "Title": "Oswal Greentech Q3 FY26 Results: Profit Jumps to ₹858 Cr",
            "Summary": "Oswal Greentech reports strong Q3 FY26 performance with net profit of ₹858.04 crores vs ₹53.30 crores in Q3 FY24. Nine-month profit reaches ₹2,073.84 crores, up from ₹914.48 crores YoY.",
            "Sentiment": "positive",
            "PublishDate": 1770895329182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oswal Greentech Updates Authorized Officials List",
            "Summary": "Oswal Greentech Limited has revised its list of officials authorized to determine and disclose material events under SEBI regulations, appointing Mrs. Aruna Oswal and Mr. Moxit Bhupendra Modi as key contacts.",
            "Sentiment": "neutral",
            "PublishDate": 1770736719999,
            "Source": "stocks"
        },
        {
            "Title": "Oswal Greentech Board Meet Set for Feb 12, 2026",
            "Summary": "Oswal Greentech Limited has scheduled a board meeting on February 12, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770463303142,
            "Source": "stocks"
        },
        {
            "Title": "Oswal Greentech Company Secretary Sonal Gupta Resigns Due to Professional Commitments",
            "Summary": "Sonal Gupta has resigned from her position as Company Secretary and Compliance Officer at Oswal Greentech Limited, effective December 11, 2025, citing other professional commitments. Her departure will result in her ceasing to be a Key Managerial Personnel under the Companies Act, 2013, requiring the company to find a replacement for this critical compliance role.",
            "Sentiment": "neutral",
            "PublishDate": 1764338782464,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oswal Greentech CFO Vipin Kumar Vij Steps Down",
            "Summary": "Vipin Kumar Vij has resigned from his position as Chief Financial Officer of Oswal Greentech Limited, with his duties ending on November 12, 2025. The resignation was initially communicated on November 5, 2025, and was discussed and decided with the management. In his resignation letter, Vij expressed gratitude to the Board and management for their support and guidance during his tenure, describing his experience with the company as valuable and enriching.",
            "Sentiment": "neutral",
            "PublishDate": 1763011143448,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oswal Greentech CFO Vipin Kumar Vij Resigns Due to Personal Commitments",
            "Summary": "Vipin Kumar Vij has resigned from his position as Chief Financial Officer of Oswal Greentech Limited, effective December 5, 2025. Vij, who has been with the company since April 2014, cited personal commitments requiring his full attention as the reason for his departure. He submitted his resignation letter on November 5, 2025, providing one month's notice as per company rules. Following his departure, Vij will cease to be a Key Managerial Personnel under the Companies Act, 2013. The company has notified stock exchanges NSE and BSE of this leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1762344045547,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oswal Greentech Reports Quarterly Financial Results with Ongoing Legal Dispute",
            "Summary": "Oswal Greentech Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company is involved in a legal dispute regarding interest charges on Inter Corporate Deposits with a borrower. An arbitration award of Rs 9,717.00 lacs was passed in favor of the company against its total claim of Rs 47,212.27 lacs, resulting in a shortfall of Rs 37,495.27 lacs. The company has challenged this arbitration award at the High Court of New Delhi. Due to the pending legal proceedings, the company has not charged further interest, resulting in interest income and current assets being understated by Rs 1,071.01 lacs for the quarter. The auditors provided an unmodified review conclusion with emphasis of matter regarding these disputes.",
            "Sentiment": "neutral",
            "PublishDate": 1762249886286,
            "Source": "earnings"
        },
        {
            "Title": "Oswal Greentech Reports Strong Q2 Performance with 41% Revenue Growth",
            "Summary": "Oswal Greentech delivered robust quarterly results with revenue rising to 172 million rupees from 150 million rupees year-over-year. Net profit increased to 55 million rupees compared to 39 million rupees in the same period last year. The company's EBITDA performance showed significant improvement, recording a gain of 19 million rupees versus a loss of 2.6 million rupees year-over-year, with EBITDA margin reaching 11.1%.",
            "Sentiment": "positive",
            "PublishDate": 1762248787439,
            "Source": "earnings"
        },
        {
            "Title": "Oswal Green Tech Limited Approves Key Leadership Appointments at 43rd AGM",
            "Summary": "Oswal Green Tech Limited shareholders approved multiple key appointments at their 43rd Annual General Meeting held on September 25, 2025. The company appointed M/s. Mehta Chokshi & Shah LLP as statutory auditors and M/s. Jay Mehta & Associates as secretarial auditors, both for five-year terms from 2025-2030. Four new independent directors were also appointed for five-year terms: Mrs. Kiran Vohra (entrepreneur with 10+ years experience in executive search), Mrs. Isha Deepak Shah (practicing company secretary with 13 years corporate compliance experience), Mr. Gaurav Chawla (sales and marketing professional in logistics and warehousing), and Mr. Umang Kaushik Shah (chartered accountant with expertise in taxation and statutory audits). All appointments were made to strengthen the company's governance structure and compliance framework.",
            "Sentiment": "positive",
            "PublishDate": 1758802444085,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oswal Greentech Acquires 4.99% Stake in Oswal Agro Mills for ₹50.91 Crore",
            "Summary": "Oswal Greentech acquired a 4.99% stake in Oswal Agro Mills through an open market transaction. The acquisition involved purchasing 66.99 lakh shares for ₹50.91 crore. This transaction resulted in an increase in the promoter holding of Oswal Agro Mills.",
            "Sentiment": "positive",
            "PublishDate": 1755873117749,
            "Source": "order&deals"
        },
        {
            "Title": "Oswal Greentech's Statutory Auditors M/s Oswal Sunil & Company Resign",
            "Summary": "Oswal Greentech Limited announced that M/s Oswal Sunil & Company resigned as the company's Statutory Auditors effective August 7, 2025. The Board of Directors accepted the resignation, which was submitted due to reasons outlined in the auditors' resignation letter. The resigning auditors did not raise any concerns regarding the company's management, and no material reasons were cited for the resignation. The Audit Committee and Board members acknowledged M/s Oswal Sunil & Company's contribution to the company's audit processes and auditing standards.",
            "Sentiment": "neutral",
            "PublishDate": 1754586070953,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oswal Greentech Reports 40% Jump in Q1 Net Profit to 66 Million Rupees",
            "Summary": "Oswal Greentech reported net profit of 66 million rupees in Q1, representing a year-over-year increase from 47 million rupees. The company's revenue grew to 202 million rupees compared to 158 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754559907803,
            "Source": "earnings"
        }
    ]
}