{
    "Symbol": "OSWALPUMPS",
    "ISIN": "INE0BYP01024",
    "News": [
        {
            "Title": "Oswal Pumps Q3FY26 IPO Proceeds Monitoring Report",
            "Summary": "ICRA Limited submits Q3FY26 monitoring report for Oswal Pumps' IPO proceeds utilization. Company utilized INR 24.263 crore during quarter, with INR 339.638 crore remaining unutilized from INR 890.00 crore net proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1770470810866,
            "Source": "stocks"
        },
        {
            "Title": "Oswal Pumps Q3FY26 Net Profit Rises 15.9% to ₹694.32M",
            "Summary": "Oswal Pumps reported Q3FY26 net profit of ₹694.32 millions, up 15.9% YoY. Revenue grew 31.1% to ₹4,477.17 millions with strong nine-month performance showing 20.1% profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1770469859308,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oswal Pumps Board Meet Set for Feb 7 for Q3FY26 Results",
            "Summary": "Oswal Pumps Limited has scheduled its board meeting for February 07, 2026, to consider and approve Q3FY26 financial results. Trading window remains closed until February 09, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769792169216,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oswal Pumps Wins ₹119.92 Cr Solar Pump Order",
            "Summary": "Oswal Pumps Limited secured a major order worth ₹119.92 crores from Karnataka Renewable Energy Development Limited for 3,263 solar agriculture pump sets under the PM-KUSUM B scheme, marking its first comprehensive project in Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1768363782293,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oswal Pumps Wins ₹119.92 Cr Karnataka Solar Order",
            "Summary": "Oswal Pumps Limited secures major order from Karnataka Renewable Energy Development Limited for 3,263 solar agriculture pump sets under PM-KUSUM scheme, marking company's first comprehensive project in Karnataka.",
            "Sentiment": "positive",
            "PublishDate": 1768363436658,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oswal Pumps Wins ₹119.92 Cr Solar Pump Contract",
            "Summary": "Oswal Pumps Limited secures major order for 3,263 solar pump sets worth ₹119.92 crores with completion deadline of March 31, 2026, strengthening its position in renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1768363112128,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oswal Pumps Clarifies Negative Cash Flow Concerns",
            "Summary": "Oswal Pumps responds to market report concerns, explaining negative cash flows stem from government scheme timing mismatches between revenue recognition and subsidy disbursements, while announcing ERP system upgrades.",
            "Sentiment": "neutral",
            "PublishDate": 1767853164839,
            "Source": "stocks"
        },
        {
            "Title": "Oswal Pumps Secures ₹180 Cr Solar Pump Order",
            "Summary": "Oswal Pumps Ltd. receives approval from Maharashtra State Electricity Distribution Co. for 6,500 off-grid DC solar pump systems worth ₹180 crores under PM KUSUM B scheme.",
            "Sentiment": "positive",
            "PublishDate": 1766548697982,
            "Source": "stocks"
        },
        {
            "Title": "Oswal Pumps Wins ₹380 Cr Solar Pump Contract",
            "Summary": "Oswal Pumps secures major ₹380 crore order from Maharashtra State Electricity Distribution Co. for 13,738 off-grid DC solar water pumping systems under PM Kusum B Scheme with one-year execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1765445647845,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oswal Pumps' Subsidiary Changes Name from Oswal Solar Structure to Oswal Solar Energy",
            "Summary": "Oswal Pumps Limited announced that the Ministry of Corporate Affairs has approved the name change of its wholly owned subsidiary from Oswal Solar Structure Private Limited to Oswal Solar Energy Private Limited, effective December 09, 2025. The change affects the company's material subsidiary operations and has been formally communicated to stock exchanges BSE and NSE as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765284644400,
            "Source": "corporate_action"
        },
        {
            "Title": "Oswal Pumps Reports 73.9% Revenue Growth to INR 540 Crores in Q2 FY26",
            "Summary": "Oswal Pumps Limited achieved operating revenue of INR 540 crores in Q2 FY26, reflecting 73.9% year-on-year growth driven by continued execution of PM-KUSUM and Magel Tyala orders. The company maintained EBITDA margin at 24.7% despite pricing pressures from L1 tenders and expects margin recovery in Q3 FY26 through value engineering initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1763618034617,
            "Source": "earnings"
        },
        {
            "Title": "Oswal Pumps Seeks Shareholder Approval to Vary IPO Fund Utilization Terms",
            "Summary": "Oswal Pumps Limited has issued a postal ballot notice dated November 17, 2025, seeking shareholder approval through special resolution to vary the terms of contract mentioned in its prospectus regarding fund utilization. The company proposes to utilize IPO proceeds of INR 27.27 million for setting up new manufacturing units at Karnal, Haryana, instead of the originally planned investment in subsidiary Oswal Solar.",
            "Sentiment": "neutral",
            "PublishDate": 1763450819098,
            "Source": "corporate_action"
        },
        {
            "Title": "Oswal Pumps Sets Aggressive Growth Targets with 50-60% Revenue Growth for FY26",
            "Summary": "Oswal Pumps announced ambitious financial guidance targeting 50-60% revenue growth for FY26 with medium-term CAGR goals of 30-35%, while expecting to install 65,000-75,000 pumps this fiscal year. The company projects PAT margins of 17.5-19%, operating EBITDA margins improving from 25.5-26% in Q3 FY26 to 26.25-26.75% in Q4 FY26, and cost savings of at least 100 basis points by Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763218577038,
            "Source": "earnings"
        },
        {
            "Title": "Oswal Pumps Appoints Avadesh K. Singh as President & COO",
            "Summary": "Oswal Pumps Limited's Board of Directors approved the appointment of Mr. Avadesh K. Singh as President & Chief Operating Officer effective November 15, 2025. Singh brings over 37 years of leadership experience in sales and marketing from organizations including RR Kabel Ltd, Bajaj Electricals Ltd, and Usha International Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1763069213350,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oswal Pumps Focuses on Value Unlocking Through Real Estate Monetization and Renewable Energy Diversification",
            "Summary": "Oswal Pumps is pursuing value creation through monetization of its real estate and investment portfolio while strategically diversifying into renewable energy and industrial leasing sectors. The company maintains healthy cash reserves to support future business expansions and capitalize on new growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1763052314846,
            "Source": "stock"
        },
        {
            "Title": "Central Government Suggests Removing GST on Essential Farm Equipment Including Irrigation and Sprinklers",
            "Summary": "The Central Government has suggested eliminating GST on essential farm equipment, specifically mentioning irrigation systems and sprinklers. This proposal could impact companies like Oswal Pumps that operate in the agricultural equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1755599417373,
            "Source": "stock"
        },
        {
            "Title": "Oswal Pumps Secures ₹442 Crore Order",
            "Summary": "Oswal Pumps has secured an order worth ₹442 crores. The company announced this significant contract win, which represents a substantial business development for the pump manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1755072505825,
            "Source": "order&deals"
        },
        {
            "Title": "Oswal Pumps Reports Strong Q1 Results with 36.8% Revenue Growth, Guides for 50-60% FY2026 Growth",
            "Summary": "Oswal Pumps Limited reported operating income of Rs 5,139 million for Q1 FY2026, marking a 36.8% year-over-year increase and 40.9% quarter-over-quarter growth. EBITDA reached Rs 1,408 million with a margin of 27.4%, while PAT stood at Rs 947 million with an 18.4% margin. The company maintains a strong order book of 29,961 pumps valued at Rs 700-800 crores. Management has provided guidance for FY2026 revenue growth of 50-60% with EBITDA margins of 27-29%. The company is expanding manufacturing capacity from 2 lakh to over 5 lakh pumps per annum and adding 1.5 GW solar module capacity. Oswal holds a 31% market share in the PM-KUSUM scheme and expects Maharashtra to be the biggest revenue contributor. The company is also developing new industrial pump products with helical pump sampling planned by Q3 FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1754899634418,
            "Source": "earnings"
        },
        {
            "Title": "Oswal Pumps Shares Hit All-Time High Following Subsidiary Acquisition",
            "Summary": "Oswal Pumps Ltd. shares reached an all-time high after the company completed the acquisition of its renewable energy subsidiary, Oswal Solar Structure. The company purchased 5.24 crore shares with a face value of Rs 10 for Rs 303.76 crore. Oswal Solar Structure, established in January 2022, was already a wholly-owned subsidiary that manufactures solar modules from its facility in Karnal, Haryana. The acquisition was part of the objectives disclosed during Oswal Pumps' IPO process, with plans to establish a new unit using IPO proceeds. Shares rose 3.31% to Rs 781.15, later trading 1.75% higher at Rs 769.30. The stock has gained 22.73% since its June 20 listing, when it debuted at Rs 634 on NSE and Rs 632 on BSE, representing premiums of 3.3% and 2.9% respectively over the IPO price of Rs 614.",
            "Sentiment": "positive",
            "PublishDate": 1753251748849,
            "Source": "stock"
        },
        {
            "Title": "Oswal Pumps Completes INR 303.76 Crore Acquisition of Additional Shares in Solar Subsidiary",
            "Summary": "Oswal Pumps Limited acquired 5,23,72,121 equity shares of its wholly owned subsidiary Oswal Solar Structure Private Limited for INR 303.76 crore through a rights issue allotment. The subsidiary operates in solar module manufacturing with a facility in Karnal, Haryana, and reported turnover of INR 4,522.46 million for FY 2024-25, compared to INR 593.22 million in FY 2023-24. The subsidiary was incorporated in January 2022 and had nil turnover in FY 2022-23. Following the acquisition, the subsidiary's paid-up equity share capital stands at INR 64.87 crore. The acquisition was completed as part of the objects disclosed in the company's prospectus dated June 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753188469683,
            "Source": "order&deals"
        },
        {
            "Title": "Oswal Pumps MD Expects 28%-29% Annual Operating EBITDA Margin",
            "Summary": "The Managing Director of Oswal Pumps has expressed confidence in achieving an annual operating EBITDA margin of 28%-29% for the current financial year. No specific details about the company's performance or strategies to achieve this target were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752210471000,
            "Source": "default"
        },
        {
            "Title": "Oswal Pumps Reports Significant Increase in Q4 Profit and Revenue",
            "Summary": "Oswal Pumps has reported its latest quarterly results. The company's consolidated net profit for Q4 increased to 639 million rupees, up from 286 million rupees in the same quarter last year. Revenue also saw substantial growth, rising to 3.65 billion rupees from 2.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752192361000,
            "Source": "default"
        },
        {
            "Title": "Oswal Pumps Reports Strong Q4 Financial Results",
            "Summary": "Oswal Pumps has announced its Q4 financial results. The company's EBITDA increased to 989 million rupees from 452 million rupees year-over-year. The EBITDA margin improved to 27.13% from 19.63% in the same period. Consolidated net profit rose to 639 million rupees from 286 million rupees year-over-year. Revenue for Q4 grew to 3.65 billion rupees from 2.3 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752156970000,
            "Source": "result"
        },
        {
            "Title": "Oswal Pumps: Shares Fall Below IPO Price After 8% Drop",
            "Summary": "Oswal Pumps shares fell 8% on Monday, dropping below the IPO price of ₹614 to ₹580. The stock has declined 11% from its post-listing peak. The company's CMD reports strong demand and expects to be cash positive in FY26. Current pump capacity utilization is at 80-85%.",
            "Sentiment": "negative",
            "PublishDate": 1750660099000,
            "Source": "normal_news"
        }
    ]
}