{
    "Symbol": "OSWALAGRO",
    "ISIN": "INE142A01012",
    "News": [
        {
            "Title": "Oswal Agro Mills Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Oswal Agro Mills Limited has scheduled its Board of Directors meeting for February 12, 2026, to consider and approve unaudited financial results for Q3FY26. Trading window remains closed until February 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770459804430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Oswal Agro Mills Updates Material Event Disclosure Team",
            "Summary": "Oswal Agro Mills Limited has revised its list of officials authorized to determine and disclose material events under SEBI regulations, including CEO Shreya Choudhary and CFO Hemant Patni.",
            "Sentiment": "neutral",
            "PublishDate": 1767776527199,
            "Source": "stocks"
        },
        {
            "Title": "Oswal Agro Mills Appoints Shreya Choudhary as CEO",
            "Summary": "Oswal Agro Mills Limited appointed Ms. Shreya Choudhary as Additional Director and CEO effective January 07, 2026, for a three-year term subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1767775824393,
            "Source": "stocks"
        },
        {
            "Title": "Oswal Agro Mills Reports Quarterly Financial Results for September 2025",
            "Summary": "Oswal Agro Mills Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved these results at their meeting held on November 4, 2025. The company's results include both standalone and consolidated statements covering revenue from operations, profit/loss figures, comprehensive income, cash flow statements, and segment-wise performance data. The financial statements were reviewed by statutory auditors Mehta Chokshi Shah LLP, who provided unmodified review reports for both standalone and consolidated results. The results show the company's performance across different business segments including trading, investment activities, and real estate operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762259451032,
            "Source": "earnings"
        },
        {
            "Title": "Oswal Agro Mills Appoints New Auditors and Independent Directors at 45th AGM",
            "Summary": "Oswal Agro Mills Limited shareholders approved multiple key appointments at their 45th Annual General Meeting held on September 25, 2025. The company appointed M/s Mehta Chokshi & Shah LLP as statutory auditors and M/s Jay Mehta & Associates as secretarial auditors, both for five-year terms from 2025-2030. Shareholders also approved the continuation of Mrs. Aruna Oswal's directorship and appointed three new independent directors: Mr. Gulshan Chamanlal Vohra (HR and legal professional with 30+ years experience), Mr. Swapneel Vinod Patel (Company Secretary with 10 years compliance experience), and Ms. Larly Nitin Bahl (creative professional with 20+ years in event design and digital sales). All independent director appointments are for five-year terms commencing August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758810704978,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oswal Agro Mills Shareholders Approve New MOA and AOA to Align with Companies Act 2013",
            "Summary": "Oswal Agro Mills Limited shareholders approved the adoption and alteration of new Memorandum of Association and Articles of Association at their 45th Annual General Meeting held on September 25, 2025. The changes align the company's governing documents with the Companies Act 2013, replacing the previous framework based on the Companies Act 1956. Key alterations include restructuring the object clause into main and ancillary objects with clearer business descriptions, adding a new sub-clause allowing trading and investing in financial instruments including derivatives, and updating the liability clause to specify member liability is limited to unpaid share amounts. The Articles of Association were restructured to comply with current regulations including SEBI listing requirements and secretarial standards.",
            "Sentiment": "neutral",
            "PublishDate": 1758810205235,
            "Source": "corporate_action"
        },
        {
            "Title": "Oswal Greentech Acquires 4.99% Stake in Oswal Agro Mills for Rs 66.99 Crore",
            "Summary": "Oswal Greentech Limited acquired 66,99,000 equity shares representing 4.99% of Oswal Agro Mills Limited through open market transactions on August 22, 2025. The acquisition increased Oswal Greentech's total shareholding in Oswal Agro Mills from 4.98% to 9.97%, with total shares held rising from 66,83,109 to 1,33,82,109. Oswal Greentech belongs to the promoter group of Oswal Agro Mills. The target company has an equity share capital of INR 1,342,347,760 divided into 134,234,776 equity shares of Rs. 10 each. Both companies are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1756114556525,
            "Source": "corporate_action"
        },
        {
            "Title": "Oswal Agro Mills' Statutory Auditor Resigns Over Fee Dispute",
            "Summary": "Oswal Agro Mills Limited's statutory auditor, M/s. Oswal Sunil & Company, Chartered Accountants, resigned effective August 7, 2025, citing inadequate audit fees as the primary reason. The auditing firm had requested a fee revision for FY 2025-26 in May 2025, stating that current fees do not align with the scope of work required under applicable auditing standards, making it unviable to continue services. The Board of Directors accepted the resignation, with no material concerns raised regarding company management. The auditor had completed the statutory audit for the financial year ended March 31, 2025, and issued a limited review report for the quarter ended June 30, 2025. The firm was originally appointed in September 2022 for a five-year term until 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1754580460743,
            "Source": "corporate_governance"
        },
        {
            "Title": "Oswal Agro Mills Reports Strong Q1 Results with 727% Jump in Net Profit",
            "Summary": "Oswal Agro Mills Limited reported quarterly results for the period ended June 30, 2025. The company's net profit increased significantly to ₹1,418.74 lakh compared to ₹171.55 lakh in the same quarter last year. Revenue from operations surged to ₹1,922.69 lakh from ₹45.67 lakh year-over-year. Basic earnings per share improved to ₹1.06 from ₹0.13 in the corresponding quarter. The company operates in three business segments: Trading, Real Estate, and Investment Activities. Real Estate contributed the largest portion of revenue at ₹1,904.18 lakh, while Investment Activities generated ₹450.44 lakh. The company has Transferable Development Rights of 1,06,374.15 sq. mtr. from Brihanmumbai Municipal Corporation, of which approximately 81,357.47 sq. mtr. has been sold as of June 30, 2025. Total comprehensive income for the quarter reached ₹2,347.03 lakh compared to ₹382.90 lakh in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754566472015,
            "Source": "earnings"
        },
        {
            "Title": "Oswal Agro Mills Reports Significant Profit Increase in Q3",
            "Summary": "Oswal Agro Mills has reported a substantial increase in net profit for the third quarter. The company's net profit rose to 435 million rupees, compared to 10.5 million rupees in the same quarter last year and 2.5 million rupees in the previous quarter. Revenue also saw a significant jump, reaching 625 million rupees, up from 33 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738109856000,
            "Source": "earnings"
        },
        {
            "Title": "Oswal Agro Mills Reports Significant Profit Increase in Q3",
            "Summary": "Oswal Agro Mills has reported a substantial increase in net profit for the third quarter. The company's net profit rose to 435 million rupees, compared to 10.5 million rupees in the same quarter last year and 2.5 million rupees in the previous quarter. Revenue also saw a significant jump, reaching 625 million rupees, up from 33 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738065969000,
            "Source": "earnings"
        }
    ]
}