{
    "Symbol": "PACEDIGITK",
    "ISIN": "INE0S3G01027",
    "News": [
        {
            "Title": "Pace Digitek Wins Rs. 17,750 Million Solar Project",
            "Summary": "Pace Digitek Limited secures major Letter of Award from KREDL for 250 MW Solar + 1.1 GWh BESS project at Pavagada Solar Park, boosting total order book to Rs. 102,428 million.",
            "Sentiment": "positive",
            "PublishDate": 1770909336652,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek Submits Q3FY26 IPO Monitoring Report",
            "Summary": "Pace Digitek Limited submitted its quarterly monitoring agency report for Q3FY26 regarding IPO proceeds utilization, showing Rs 2,265.20 million utilized during the quarter with Rs 5,926.28 million remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770647695016,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek Q3FY26 Results: Revenue Up 13.5% YoY",
            "Summary": "Pace Digitek reports strong Q3FY26 performance with revenue of Rs. 6,440 Mn (up 13.5% YoY), PAT of Rs. 788 Mn (up 11.3% YoY), and total order book of Rs. 84,678 Mn as of January 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770487623045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek unit wins ₹94 cr BSNL Li-Ion order",
            "Summary": "Pace Digitek's subsidiary Lineage Power secured second ₹94.35 crore order from BSNL for Li-Ion battery solutions including 25,000 modules and 2,500 racks with 5-year warranty.",
            "Sentiment": "positive",
            "PublishDate": 1768925668638,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek Wins ₹943.5 Cr BSNL Contract",
            "Summary": "Pace Digitek Limited has secured a significant contract worth ₹943.50 crores from Bharat Sanchar Nigam Limited (BSNL), marking a major business development for the telecommunications equipment company.",
            "Sentiment": "positive",
            "PublishDate": 1768922814614,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek Secures ₹94 Crore Order Win",
            "Summary": "Pace Digitek Limited announces winning a significant order worth ₹94 crores, marking a major business development for the telecom equipment and infrastructure services company.",
            "Sentiment": "positive",
            "PublishDate": 1768804734560,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek Secures ₹375 Cr Solar EPC Order",
            "Summary": "Pace Digitek Limited announced a major ₹375.7 crore solar EPC order from Bondada Engineering for a 300 MW AC solar power project, marking significant expansion in renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1768403804834,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek incorporates subsidiary for MSPGCL order",
            "Summary": "Pace Digitek Limited has incorporated PACE ECOPLANET SOLACE PRIVATE LIMITED as a subsidiary and Special Purpose Vehicle to execute orders from Maharashtra State Power Generation Company Limited in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1767702455384,
            "Source": "stocks"
        },
        {
            "Title": "PACE Digitek Subsidiary Wins ₹94.35 Cr BSNL Contract",
            "Summary": "Lineage Power, a subsidiary of PACE Digitek, secured a significant ₹94.35 crore contract from BSNL for supplying 25,000 lithium-ion battery modules with comprehensive warranty and maintenance support.",
            "Sentiment": "positive",
            "PublishDate": 1767348176454,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek Unit Wins ₹94.35 Cr BSNL Contract",
            "Summary": "Lineage Power Private Limited, material subsidiary of Pace Digitek Limited, secured advance purchase order worth ₹94.35 crores from BSNL for supply of Li-ion battery modules, IP55 racks and 5-year AMC services.",
            "Sentiment": "positive",
            "PublishDate": 1767190466028,
            "Source": "co_actions_results"
        },
        {
            "Title": "PACE Digitek Forms New Defence & Aerospace Subsidiary",
            "Summary": "PACE Digitek announces the formation of Lineage Defence And Aerospace as a new wholly-owned subsidiary, marking the company's strategic expansion into the defence and aerospace sector.",
            "Sentiment": "positive",
            "PublishDate": 1766499654798,
            "Source": "stocks"
        },
        {
            "Title": "Pace Digitek Forms Defence & Aerospace Subsidiary",
            "Summary": "Pace Digitek Limited incorporates wholly owned subsidiary Lineage Defence and Aerospace Private Limited with ₹10.00 lakh authorized capital to manufacture EMI/EMC equipment for defence sector.",
            "Sentiment": "positive",
            "PublishDate": 1766498158541,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pace Digitek Board Approves Multiple Subsidiary Formations",
            "Summary": "Pace Digitek Limited's board approved formation of three new subsidiaries including one with 60% stake and two wholly-owned entities, plus two step-down subsidiaries through TransGreenx Energy.",
            "Sentiment": "positive",
            "PublishDate": 1765880766397,
            "Source": "co_actions_results"
        },
        {
            "Title": "CRISIL Upgrades Pace Digitek's Credit Rating to A-/Stable, Assigns A-/Stable to Subsidiary",
            "Summary": "CRISIL upgraded Pace Digitek Limited's bank loan facilities rating to A-/Stable from BBB+/Stable on Rs.1000 crore facilities and assigned A-/Stable rating to subsidiary Lineage Power Private Limited's Rs.200 crore facilities. The upgrade reflects significant improvement in the Pace group's financial risk profile driven by Rs.400 crore private placement, Rs.819 crore IPO proceeds, and Rs.250 crore intercorporate loan repayment.",
            "Sentiment": "positive",
            "PublishDate": 1765279185469,
            "Source": "stock"
        },
        {
            "Title": "Pace Digitek Unit Secures 997.10 Million Rupee Order",
            "Summary": "Pace Digitek's subsidiary has received a significant order worth 997.10 million rupees. This substantial contract represents a major business win for the company's unit, potentially boosting revenue and operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1764766225044,
            "Source": "order&deals"
        },
        {
            "Title": "PACE Digitek Reports Strong Order Book Growth with Major Energy Storage Projects",
            "Summary": "PACE Digitek secured major contracts worth INR 2,264 crores including a INR 1,159 crore SECI battery energy storage project and INR 920 crore MAHAGENCO solar EPC project, bringing total order book to INR 9,135 crores. The company reported quarterly results with revenue of INR 900 crores and PAT margin of 13.61%, while expanding battery energy storage capacity from 5 to 10 gigawatt hours with guidance of INR 2,600-2,700 crores revenue for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1764163621128,
            "Source": "earnings"
        },
        {
            "Title": "Pace Digitek's Subsidiary Secures ₹1,994 Crore Battery Storage Contract from L&T",
            "Summary": "Lineage Power Private Limited, a material subsidiary of Pace Digitek Limited, received an order worth ₹1,994.20 million from Larsen Toubro Limited for supplying Battery Energy Storage Systems including LiFePo4 liquid cooling BESS integrated containers. The contract involves supplying 2,75,825 kWhr capacity systems (55 units) for Bihar State Power Generation Company Limited's Kajra project, with manufacturing clearance by December 2025 and complete delivery before March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1764140689344,
            "Source": "order&deals"
        },
        {
            "Title": "PACE Digitek Launches TransgreenX Energy Unit for Renewable Energy Development",
            "Summary": "PACE Digitek has established a new subsidiary called TransgreenX Energy Pvt Ltd focused on developing renewable energy assets. This strategic move positions the company to enter the growing renewable energy sector and diversify its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1763949131186,
            "Source": "corporate_action"
        },
        {
            "Title": "PACE DIGITEK Projects Strong Revenue Growth With Operational Revenue Target of ₹2600-2700 Crore for FY26",
            "Summary": "PACE DIGITEK estimates operational revenue between ₹2600-2700 crore for FY26 with enhanced PAT margins at 12%, and projects topline of ₹3100-3200 crore for FY27. The company expects to maintain PAT margins between 11-12% for FY27, indicating sustained profitability alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1763392344206,
            "Source": "stock"
        },
        {
            "Title": "PACE DIGITEK Secures Rs 5,869 Crore Energy Sector Orders, Targets Rs 8,000 Crore by March 2026",
            "Summary": "PACE DIGITEK reported securing orders worth Rs 5,869 crore in the energy sector over the past year, demonstrating strong business momentum. The company has set an ambitious target to increase its order book to Rs 8,000 crore by March 2026, indicating significant growth plans in the energy segment.",
            "Sentiment": "positive",
            "PublishDate": 1763392103573,
            "Source": "stock"
        },
        {
            "Title": "Pace Digitek Announces Investor Call for Q2 FY26 Results Discussion",
            "Summary": "Pace Digitek Limited will host an investor call on November 20, 2025, at 10:30 AM IST to discuss financial results for the quarter and half year ended September 30, 2025. The company has made the investor presentation available on its website and provided dial-in details for stakeholders to participate in the earnings discussion.",
            "Sentiment": "positive",
            "PublishDate": 1763384871428,
            "Source": "stock"
        },
        {
            "Title": "Pace Digitek Reports Significant Decline in Q2 Financial Performance",
            "Summary": "Pace Digitek reported Q2 consolidated net profit of 641 million rupees, down from 952 million rupees year-over-year, while revenue fell to 5.33 billion rupees from 8.5 billion rupees. The company's EBITDA decreased to 941 million rupees from 1.87 billion rupees, with EBITDA margin contracting to 17.64% from 22.10% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763205529073,
            "Source": "earnings"
        },
        {
            "Title": "Pace Digitek Targets ₹25 Billion Revenue By FY28 With New BESS Manufacturing And Global Expansion",
            "Summary": "Pace Digitek is positioning for expansion in telecom-energy synergy through new Battery Energy Storage System (BESS) manufacturing at Bidadi and global projects in Africa and Asia. The company aims to achieve ₹25 billion revenue by FY28 using an integrated EPC-O&M (Engineering, Procurement, Construction - Operations & Maintenance) model.",
            "Sentiment": "positive",
            "PublishDate": 1761667337991,
            "Source": "stock"
        },
        {
            "Title": "Pace Digitek Reports 10% PAT Growth in Q1 FY26, Raises ₹819 Crore Through IPO",
            "Summary": "Pace Digitek Limited reported quarterly results with profit after tax increasing 10% to ₹546.98 million and total income growing 4% to ₹3,727.15 million. The Bengaluru-based telecom and energy infrastructure company successfully completed its IPO raising ₹819.15 crore and listed on BSE and NSE on October 6, 2025, with shares debuting at ₹226.85. The company secured a major ₹1,159 crore BESS order from SECI for a 600 MW/1,200 MWh battery energy storage system. Telecom segment revenue reached ₹3,421.19 million while energy segment contributed ₹249.61 million. The company operates three manufacturing facilities in Karnataka and has announced plans to deploy ₹630 million into subsidiary Pace Renewable Energies for the MSEDCL BESS project involving 750 MW storage across 75 substations.",
            "Sentiment": "positive",
            "PublishDate": 1761657392997,
            "Source": "earnings"
        },
        {
            "Title": "Pace Digitek Reports Strong Q1 Performance with Doubled Profit After Tax",
            "Summary": "Pace Digitek Limited published its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported total income from operations of ₹3,396.65 million compared to ₹3,154.20 million in the same quarter last year. Profit before tax increased to ₹689.21 million from ₹329.89 million, while profit after tax more than doubled to ₹510.4 million from ₹246.89 million. Basic earnings per share rose to ₹2.86 from ₹1.65. On a consolidated basis, total income reached ₹3,670.79 million versus ₹3,421.61 million in the previous year, with profit after tax growing to ₹546.98 million from ₹496.08 million. The results were approved by the Board of Directors on October 25, 2025, and published in Economic Times and Udayakala newspapers on October 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761558384627,
            "Source": "earnings"
        },
        {
            "Title": "Pace Digitek Reports Q1 FY26 Results and Approves New Wholly Owned Subsidiary Formation",
            "Summary": "Pace Digitek Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, during a meeting held on October 25, 2025. The company reported standalone revenue from operations of ₹3,396.65 million and profit after tax of ₹510.40 million for the quarter. On a consolidated basis, revenue from operations stood at ₹3,670.79 million with profit after tax of ₹546.98 million. The Board also approved the formation of a new wholly owned subsidiary, with incorporation subject to regulatory approvals. The company operates primarily in Energy and Telecom segments, with Telecom contributing ₹3,421.19 million to consolidated quarterly revenue. Pace Digitek completed its IPO of ₹8,191.48 million subsequent to the quarter end, with shares listed on NSE and BSE effective October 6, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761408547796,
            "Source": "earnings"
        },
        {
            "Title": "Pace Digitek Secures Rs. 1,159 Crore Battery Energy Storage System Order from Solar Energy Corporation of India",
            "Summary": "Pace Digitek Limited has received an order worth Rs. 1,159.31 crores from Solar Energy Corporation of India Ltd for supplying a 600 MW/1200 MWh Battery Energy Storage System (BESS). The contract includes design and engineering of the complete system, supply of BESS DC blocks with HVAC and fire protection systems, power conversion systems, battery management systems, and energy management systems. The scope also covers integration, testing, commissioning, and plant performance demonstration. Additionally, the company will provide comprehensive maintenance services for 10 years from the date of commissioning. The project timeline requires 50% completion within 11 months and full completion within 13 months for supply, with commissioning to be completed within 14 months for 50% capacity and 16 months for full capacity from the contract agreement date.",
            "Sentiment": "positive",
            "PublishDate": 1761203579396,
            "Source": "order&deals"
        },
        {
            "Title": "Pace Digitek Limited Receives Penalty Order for CSR Non-Compliance Violations",
            "Summary": "Pace Digitek Limited received an Order for Adjudication of Penalty from the Registrar of Companies, Bangalore on October 17, 2025, for violations under Section 135(7) of the Companies Act, 2013. The company had voluntarily filed for adjudication prior to its listing regarding CSR non-compliance. The violations relate to the company's failure to spend mandatory CSR obligations within prescribed timelines for financial years 2020-21, 2021-22, and 2023-24, and failure to transfer unspent amounts to Schedule-VII funds. Total penalties imposed include INR 52,26,590 on the company and INR 2,66,330 on officer Venugopal Rao Maddisetty across the affected financial years. The company states there is no impact on its financial or operational activities due to this order.",
            "Sentiment": "negative",
            "PublishDate": 1760785995345,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pace Digitek Secures ₹185.87 Crore Maintenance Contract from Tata Teleservices",
            "Summary": "Pace Digitek Limited has secured a maintenance contract worth ₹185.87 crore from Tata Teleservices. The contract is scheduled to begin in October 2025 and will run for 3.5 years with an option for extension. Under the agreement, Pace Digitek will handle OSP fiber network maintenance and ISP services across five states.",
            "Sentiment": "positive",
            "PublishDate": 1759917192180,
            "Source": "order&deals"
        },
        {
            "Title": "Morgan Stanley Acquires Stake in Pace Digitek as Brokerage Sets 75% Upside Target",
            "Summary": "Morgan Stanley purchased nearly 12 lakh shares of Pace Digitek, a recently listed renewable and telecom infrastructure company, in the open market. The stock had debuted at approximately 4% premium to its issue price. Arihant Capital initiated coverage with a Buy rating and target price of Rs 385, representing 75% upside from current levels around Rs 225. The company operates in Battery Energy Storage Systems (BESS) and telecom infrastructure, combining manufacturing, EPC, and BOO models. Pace has commissioned a 5 GWh BESS facility in Bangalore with estimated annual revenue potential of Rs 32 billion at full capacity. The company has secured 2.8 GWh of orders with execution visibility through FY26. Arihant cited India's target of 500 GW renewable energy by 2030 and expected 230 GWh BESS capacity by 2032 as growth drivers for the sector.",
            "Sentiment": "positive",
            "PublishDate": 1759830119325,
            "Source": "stock"
        },
        {
            "Title": "PACE DIGITEK Shares Open Above Issue Price on Market Debut",
            "Summary": "PACE DIGITEK shares made their market debut at Rs 225 per share, trading higher than the issue price of Rs 219. This represents a premium to the IPO price at the time of listing.",
            "Sentiment": "positive",
            "PublishDate": 1759725186980,
            "Source": "stock"
        }
    ]
}