{
    "Symbol": "PAGEIND",
    "ISIN": "INE761H01022",
    "News": [
        {
            "Title": "Page Industries Q3 FY26 Results & Interim Dividend",
            "Summary": "Page Industries reported Q3 FY26 revenue of ₹1,38,675.71 lakhs with net profit of ₹18,953.64 lakhs. Board declared 3rd interim dividend of ₹125 per share with record date February 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770303930167,
            "Source": "co_actions_results"
        },
        {
            "Title": "Page Industries Declares ₹125 Interim Dividend",
            "Summary": "Page Industries board approves interim dividend of ₹125 per share for shareholders, marking significant cash distribution by the leading innerwear manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1770283368912,
            "Source": "co_actions_results"
        },
        {
            "Title": "Page Industries Q3 Net Profit Drops to ₹1.9B",
            "Summary": "Page Industries reported Q3 standalone net profit of ₹1.90 billion, declining from ₹2.00 billion year-over-year and missing analyst estimates of ₹2.20 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770283301648,
            "Source": "co_actions_results"
        },
        {
            "Title": "Page Industries reconstitutes Audit Committee",
            "Summary": "Page Industries Limited has inducted Mr. Dinesh Malkani as a new member of its Audit Committee effective 01 February 2026, bringing the total committee membership to four members.",
            "Sentiment": "neutral",
            "PublishDate": 1770118745298,
            "Source": "stocks"
        },
        {
            "Title": "Page Industries Board Meet on Feb 5 for Q3 Results",
            "Summary": "Page Industries has scheduled its board meeting for February 5, 2026, to consider Q3FY26 financial results and declare third interim dividend with record date set for February 11, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768566685472,
            "Source": "co_actions_results"
        },
        {
            "Title": "Page Industries Faces Weaker Jockey Brand Performance",
            "Summary": "Broker cuts Page Industries' Q3FY26E sales growth forecast to 3% from 5% due to much weaker domestic operating environment for Jockey brand, with downside risks remaining.",
            "Sentiment": "negative",
            "PublishDate": 1767679412853,
            "Source": "stocks"
        },
        {
            "Title": "Page Industries Block Trade Worth ₹15.96 Crores",
            "Summary": "Page Industries witnessed a significant NSE block trade of ₹15.96 crores involving 4,477 shares at ₹35,650 per share, indicating institutional interest in the apparel manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1767588665859,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICICI Prudential Mutual Fund Crosses 5% Stake in Page Industries",
            "Summary": "ICICI Prudential Mutual Fund acquired 15,847 shares of Page Industries on December 03, 2025, increasing its total holding to 5,65,718 shares representing 5.07% of the company's paid-up capital. The acquisition was made for investment purposes without seeking controlling interest, triggering mandatory disclosure requirements under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764917305046,
            "Source": "stock"
        },
        {
            "Title": "Page Industries Reports 3.6% Revenue Growth in Q2 FY26 Amid Subdued Consumption",
            "Summary": "Page Industries delivered revenue growth of 3.6% to INR 12,909 million in Q2 FY26 with sales volume of 56.6 million pieces, though profit after tax remained flat at INR 1,948 million. The company saw improved demand during late September and early October festive season, with management expressing confidence about better performance in H2 despite acknowledging current growth rates are below internal targets.",
            "Sentiment": "neutral",
            "PublishDate": 1763634577441,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries Reports Marginal Profit Decline in September Quarter Despite Revenue Growth",
            "Summary": "Page Industries reported a marginal decline in net profit to Rs 194.76 crore in the September quarter compared to Rs 195.25 crore in the same period last year, despite revenue growing 3.57% to Rs 1,290.85 crore. The apparel manufacturer, which is the exclusive licensee of JOCKEY International for multiple countries, saw sales volume growth of 2.5% with 56.6 million pieces sold, while total expenses increased 5.1% to Rs 1,049.27 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763044776067,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries Schedules Quarterly Results Review for November 13",
            "Summary": "Page Industries has announced plans to review its quarterly results on November 13. The company will be examining its financial performance during this scheduled review session.",
            "Sentiment": "neutral",
            "PublishDate": 1760532169692,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries Reports 3.5% Revenue Growth Despite Subdued Consumer Demand in Q1 FY26",
            "Summary": "Page Industries Limited reported revenue of Rs. 13,156 million for Q1 FY26, representing 3.1% growth year-on-year. Sales volume reached 58.6 million pieces with 1.9% growth. Despite modest revenue growth, the company achieved strong profitability with EBITDA of Rs. 2,947 million (21.1% growth) and profit after tax of Rs. 2,008 million (21.5% growth). EBITDA margin stood at 22.4%. The company experienced subdued consumption during the quarter, particularly affecting offline retail performance due to festive timing shifts and general retail slowdown. Online business continued delivering robust growth. Management noted month-on-month improvement with May stronger than April and June stronger than May. The company maintained its margin guidance of 19-21% and continued strategic investments including SAP S4 HANA migration and new Salesforce distribution management system. Commercial operations commenced at the new Odisha plant, and the company launched JKY Groove fashion range targeting younger audiences. The distribution network includes 110,400+ multi-branded outlets, 1,490 exclusive brand stores, and 1,296 large format point of sales.",
            "Sentiment": "neutral",
            "PublishDate": 1755088918630,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries Reports 21.5% PAT Growth in Q1 FY26, Declares Rs 150 Interim Dividend",
            "Summary": "Page Industries Limited reported strong financial performance for the quarter ended June 30, 2025, with Profit After Tax growing 21.5% year-on-year to Rs 2,008 million. Revenue increased 3.1% to Rs 13,166 million, while EBITDA grew 21.1% to Rs 2,947 million with margins improving to 22.4% from 19.0% in the previous year. Sales volume grew 1.9% to 58.6 million pieces. The Board declared a first interim dividend of Rs 150 per equity share for 2025-26, with record date of August 13, 2025 and payment by September 5, 2025. Managing Director V.S. Ganesh attributed the performance to cost efficiency measures, optimized market investments, and process automation initiatives. The company launched JKY Groove product range targeting younger consumers and commenced commercial production at its new Odisha manufacturing facility. Despite subdued consumption patterns affecting tertiary sales growth, the company maintains confidence in demand recovery for coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1754559646114,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries Reports Strong Q1 Results, Declares Rs 150 Interim Dividend",
            "Summary": "Page Industries reported quarterly revenue of Rs 13.2 billion compared to Rs 12.7 billion in the same period last year. The company's net profit increased to Rs 2 billion from Rs 1.65 billion year-over-year. EBITDA rose to Rs 2.95 billion versus Rs 2.43 billion, with EBITDA margin improving to 22.4% from 19.05%. The board declared an interim dividend of Rs 150 per share.",
            "Sentiment": "positive",
            "PublishDate": 1754558237241,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries: Stock Breaks Out, Hits 52-Week High",
            "Summary": "Page Industries Ltd stock broke out from a Cup & Handle formation on daily charts, reaching a new 52-week high. Experts suggest a potential target of Rs 58,000 in the next 2 months for short-term traders.",
            "Sentiment": "positive",
            "PublishDate": 1752103800000,
            "Source": "normal_news"
        },
        {
            "Title": "Page Industries: Goldman Sachs Initiates 'Buy' Rating with ₹52,000 Target",
            "Summary": "Goldman Sachs initiated coverage on Page Industries with a 'buy' rating and a price target of ₹52,000, citing potential for sustainable mid-teens growth. The brokerage expects normalization of channel inventory and recovery in the outer wear segment. Page Industries plans to accelerate exclusive brand outlet expansion.",
            "Sentiment": "positive",
            "PublishDate": 1750741975000,
            "Source": "normal_news"
        },
        {
            "Title": "Page Industries: HSBC Initiates Coverage with 'Reduce' Rating, Cites Growth Concerns",
            "Summary": "HSBC initiated coverage on Page Industries with a 'Reduce' rating and a price target of ₹41,450, implying an 8% downside. The brokerage cites lack of growth drivers, moderating market share expansion, and slower revenue growth expectations. HSBC projects FY25-28 revenue CAGR of 10% and values the company at a P/E of 50x, lower than its historical average.",
            "Sentiment": "negative",
            "PublishDate": 1750398705000,
            "Source": "normal_news"
        },
        {
            "Title": "Page Industries: Rs 200 Dividend Record Date Set for May 21",
            "Summary": "Page Industries has set May 21 as the record date for its Rs 200 dividend. Shareholders must own shares by May 20 to be eligible due to the T+1 settlement cycle. The company's shares are currently trading around Rs 47,861.55 on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1747727556000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries Commences Operations at New Odisha Facility",
            "Summary": "Page Industries has begun commercial operations at its new facility in Odisha. The company announced the start of operations, marking an expansion of its manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1747646344000,
            "Source": "default"
        },
        {
            "Title": "Page Industries: Morgan Stanley Overweight Despite Price Target Below Current",
            "Summary": "Morgan Stanley maintains an 'overweight' rating on Page Industries despite the stock surpassing their price target of ₹46,444. The company aims for high single-digit volume growth by FY2026. Q4 results show 10.6% revenue growth and 50% increase in net profit. The board approved a fourth interim dividend of ₹200 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747390707000,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries: Q4 Revenue Growth Amid Near-Term Uncertainties",
            "Summary": "Page Industries reported 10.6% revenue growth to ₹1,098 crore in Q4. Net profit increased by over 50% to ₹164 crore. EBITDA rose 43% to ₹235.3 crore with margins expanding to 21.4%. The company warned of near-term uncertainties but remains confident in long-term industry outlook. A fourth interim dividend of ₹200 per share was declared.",
            "Sentiment": "neutral",
            "PublishDate": 1747303188000,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries: Announces ₹200 Fourth Interim Dividend for FY 2024-25",
            "Summary": "Page Industries has declared a fourth interim dividend of ₹200 per equity share for FY 2024-25. The record date is set for May 21, 2025, with payment scheduled for June 13, 2025. This follows multiple dividend payouts over the past year, totaling over ₹900 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747302439000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries Optimistic About Innerwear and Athleisure Industry",
            "Summary": "Page Industries has expressed a positive long-term outlook for the innerwear and athleisure industry in India. The company cites urbanization and increasing purchasing power as key factors driving growth in these sectors.",
            "Sentiment": "positive",
            "PublishDate": 1747301999000,
            "Source": "default"
        },
        {
            "Title": "Page Industries Declares ₹200 Per Share Dividend",
            "Summary": "Page Industries has announced a dividend of ₹200 per share. This significant dividend declaration is a corporate action that will directly benefit the company's shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747301543000,
            "Source": "result"
        },
        {
            "Title": "Page Industries Reports Strong Q4 Financial Results",
            "Summary": "Page Industries has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.35 billion rupees from 1.65 billion rupees, with the EBITDA margin expanding to 21.42% from 16.8%. Revenue grew to 11 billion rupees from 9.95 billion rupees. Net profit also saw a substantial increase, reaching 1.6 billion rupees compared to 1.08 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747301496000,
            "Source": "result"
        },
        {
            "Title": "Page Industries: Dividend Record Date Rescheduled to May 21, 2025",
            "Summary": "Page Industries has changed its dividend record date from May 23, 2025 to May 21, 2025. The company's board meeting to approve Q4 results and declare the fourth interim dividend for FY25 is scheduled for May 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1745579043000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries: Board to Meet for Q4 Results and Final Dividend Decision",
            "Summary": "Page Industries' board will meet on May 15 to discuss Q4 results and final dividend for FY2025. The company has paid over ₹900 per share in dividends over the past 12 months, including recent payouts of ₹150 and ₹250 per share.",
            "Sentiment": "positive",
            "PublishDate": 1745304256000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries: Rs 150 Interim Dividend Record Date Set for February 13",
            "Summary": "Page Industries has declared a third interim dividend of Rs 150 per share for FY 2024-25. The record date is set for February 13, 2025, with the dividend to be credited to eligible shareholders by March 7. Investors must purchase the stock by February 12 to qualify.",
            "Sentiment": "positive",
            "PublishDate": 1739326440000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries: Analysts Cautious Despite Margin Beat",
            "Summary": "Page Industries shares fell nearly 5% after Macquarie and Citi expressed caution due to weak demand and subdued sales growth, despite Q3 Ebitda margin of 23% surpassing guidance. Revenue growth of 7% YoY fell short of expectations, with volume growth at 4.7%. Analysts maintain 'underperform' and 'sell' ratings, citing concerns over demand weakness and increased competition.",
            "Sentiment": "negative",
            "PublishDate": 1738818117000,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries: Q3 Profit Surges 34% YoY Amid Retail Headwinds",
            "Summary": "Page Industries reported a 34.4% YoY increase in Q3 net profit to Rs 204.7 crore, with revenue growing 7.1% to Rs 1,313 crore. EBITDA rose 33.6% to Rs 302 crore. The company declared a third interim dividend of Rs 150 per share. However, it noted challenges in the apparel retail sector due to dampened consumer sentiment.",
            "Sentiment": "neutral",
            "PublishDate": 1738811880000,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries: Q3 Profit Surge and Interim Dividend Announced",
            "Summary": "Page Industries reported a 34.3% increase in Q3 FY25 net profit to Rs 205 crore, with revenue growing 7.1% to Rs 1,313 crore. The company declared a third interim dividend of Rs 150 per share. Despite positive results, the stock price fell 1.24% after the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1738747096000,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries: Announces Third Interim Dividend, Q3 Profit Surges 35%",
            "Summary": "Page Industries declared a third interim dividend of ₹150 per share for FY2025, bringing total dividends to ₹700 per share this fiscal year. Q3 net profit rose 35% to ₹205 crore, with revenue up 7.2% to ₹1,313 crore. EBITDA increased 34% YoY, with margins expanding to 23%.",
            "Sentiment": "positive",
            "PublishDate": 1738744612000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries Announces Dividend of 150 Rupees Per Share",
            "Summary": "Page Industries has declared a dividend of 150 rupees per share for its shareholders. This corporate action reflects the company's decision to distribute profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1738744116000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries Reports Strong Q3 EBITDA Growth",
            "Summary": "Page Industries has announced its Q3 financial results, showing significant improvement in profitability. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 3.02 billion rupees, up from 2.29 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 23.04% from 18.69% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738744049000,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries Reports Q3 Revenue Growth",
            "Summary": "Page Industries, an Indian clothing company, has reported a revenue of 13.13 billion rupees for the third quarter, compared to 12.3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738744001000,
            "Source": "earnings"
        },
        {
            "Title": "Page Industries Reports 33% Increase in Q3 Net Profit",
            "Summary": "Page Industries, a leading Indian apparel manufacturer, has reported a net profit of 2 billion rupees for the third quarter, compared to 1.5 billion rupees in the same period last year. This represents a significant year-over-year increase of approximately 33% in the company's quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1738743972000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Court Dismisses Customs Appeal Against Page Industries",
            "Summary": "The Supreme Court of India has dismissed an appeal filed by the Commissioner of Customs against Page Industries. This ruling appears to be in favor of Page Industries, potentially resolving a customs-related dispute.",
            "Sentiment": "positive",
            "PublishDate": 1736468262000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Supreme Court Dismisses Customs Appeal Against Page Industries",
            "Summary": "The Supreme Court of India has dismissed an appeal filed by the Commissioner of Customs against Page Industries. This ruling appears to be in favor of Page Industries, potentially resolving a customs-related dispute.",
            "Sentiment": "positive",
            "PublishDate": 1736424647000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Page Industries to Consider Q3 Results on February 5",
            "Summary": "Page Industries, a prominent Indian apparel manufacturer, has announced that it will review and consider its financial results for the third quarter on February 5. This scheduled meeting indicates the company's adherence to regular financial reporting practices.",
            "Sentiment": "neutral",
            "PublishDate": 1736341355000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries: Karthik Yathindra Appointed as New CEO",
            "Summary": "Page Industries Ltd has appointed Karthik Yathindra as its new CEO, effective April 1, 2025. Yathindra, a nine-year veteran of the company, has held various leadership positions across sales, retail, product, marketing, and supply chain.",
            "Sentiment": "positive",
            "PublishDate": 1736179249000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Page Industries Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade of Page Industries Ltd shares occurred on the National Stock Exchange (NSE). The transaction involved approximately 10,935 shares, valued at Rs. 50.84 crores. The shares were traded at a price of Rs. 46,494.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1733377205000,
            "Source": "block_deals"
        },
        {
            "Title": "Page Industries: Stock Surges on Motilal Oswal's 'Buy' Rating",
            "Summary": "Page Industries' share price rose over 4% after Motilal Oswal upgraded it to 'buy' with a Rs 54,000 target price. The company reported 11% YoY sales growth in Q2, driven by 7% volume increase. Motilal Oswal forecasts stable 20-21% Ebitda margin for FY25-27. Citi maintained 'buy' rating, raising target price to Rs 35,800.",
            "Sentiment": "positive",
            "PublishDate": 1731046343000,
            "Source": "normal_news"
        },
        {
            "Title": "Page Industries: Stock Surges 6% on Strong Q2 Results",
            "Summary": "Page Industries' shares hit a 52-week high, rising 6% after Q2 results. The company reported 11% revenue growth, 30.5% net profit increase, and 6.7% volume growth. EBITDA margin expanded by 250 basis points to 23.5%. Analysts have mixed views, with price targets ranging from ₹35,800 to ₹54,000.",
            "Sentiment": "positive",
            "PublishDate": 1731045789000,
            "Source": "result"
        },
        {
            "Title": "Page Industries Announces Robust Product Pipeline",
            "Summary": "Page Industries has announced that they have a strong product pipeline, with new products set to be released over the next few quarters. The company also stated that they have a full pipeline planned for the upcoming year.",
            "Sentiment": "positive",
            "PublishDate": 1731036069000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries Expects Stable Margins Despite IT and Transformation Costs",
            "Summary": "Page Industries anticipates maintaining margins between 19% to 21% despite upcoming IT and transformation costs. The impact of these costs on margins is expected to begin in the latter part of Q3 and continue into Q4, as stated in a conference call update.",
            "Sentiment": "neutral",
            "PublishDate": 1731035959000,
            "Source": "normal_news"
        },
        {
            "Title": "Page Industries Declares Second Interim Dividend",
            "Summary": "Page Industries has announced a second interim dividend of ₹250 per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1730970706000,
            "Source": "corporate_action"
        },
        {
            "Title": "Page Industries Reports Strong Q2 Financial Performance",
            "Summary": "Page Industries has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 2.8 billion rupees from 2.33 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 22.58% from 20.76% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730970402000,
            "Source": "result"
        },
        {
            "Title": "Page Industries Reports Q2 Revenue Growth",
            "Summary": "Page Industries, an Indian clothing company, announced its second quarter revenue for the current fiscal year. The company reported revenue of 12.5 billion rupees, compared to 11.3 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730970328000,
            "Source": "result"
        },
        {
            "Title": "Page Industries Reports 30% Increase in Q2 Net Profit",
            "Summary": "Page Industries, an Indian clothing company, has announced its financial results for the second quarter. The company's net profit rose to 1.95 billion rupees, up from 1.5 billion rupees in the same period last year, marking a significant year-over-year increase of approximately 30%.",
            "Sentiment": "positive",
            "PublishDate": 1730970310000,
            "Source": "result"
        }
    ]
}