{
    "Symbol": "PAISALO",
    "ISIN": "INE420C01059",
    "News": [
        {
            "Title": "Paisalo Digital Redeems Rs 1 Crore NCDs",
            "Summary": "Paisalo Digital Limited has redeemed 1 unlisted unsecured 12% non-convertible debenture worth Rs 1,00,00,000 from Series PDL 2020-2 at par value on February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770876302827,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paisalo Digital Q3 Net Profit Rises to ₹660M",
            "Summary": "Paisalo Digital Limited reports net profit of ₹660 million rupees for Q3, marking growth from ₹621 million rupees in the corresponding period last year, representing year-over-year improvement.",
            "Sentiment": "positive",
            "PublishDate": 1770367602412,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paisalo Digital Redeems Rs 1 Cr NCDs Early",
            "Summary": "Paisalo Digital exercised call option to redeem 10 unlisted NCDs worth Rs 1 crore from Series PDL-09-2023, originally due September 2033. Board meeting scheduled February 6, 2026 for Q3 results.",
            "Sentiment": "positive",
            "PublishDate": 1769501795694,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paisalo Digital Redeems ₹1 Cr Debt 7 Years Early",
            "Summary": "Paisalo Digital Limited exercised call option to redeem ₹1 crore worth of unlisted NCDs seven years ahead of maturity, strengthening its balance sheet through proactive debt management.",
            "Sentiment": "positive",
            "PublishDate": 1768895628040,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paisalo Digital Raises ₹188.5 Cr at 8.5% ROI",
            "Summary": "Paisalo Digital Limited raises ₹188.5 crore at 8.5% annual ROI through Q3 listed issuances to reduce funding costs, strengthen capital base, and support pan-India expansion across 22 states.",
            "Sentiment": "positive",
            "PublishDate": 1767688310963,
            "Source": "stocks"
        },
        {
            "Title": "Paisalo Digital Expands OEM & Institutional Partnerships",
            "Summary": "Paisalo Digital Limited strengthens partnerships across healthcare, agriculture, industrial equipment, solar energy, and alternative fuel mobility sectors to broaden product accessibility for micro-entrepreneurs and small businesses.",
            "Sentiment": "positive",
            "PublishDate": 1766471774508,
            "Source": "stocks"
        },
        {
            "Title": "Paisalo Digital Allots ₹300 Cr NCDs at 8.45% Interest",
            "Summary": "Paisalo Digital Limited has allotted 3,000 non-convertible debentures worth ₹300 crores through private placement on December 15, 2025, offering 8.45% annual interest with 24-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1765781602792,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paisalo Digital Launches AI Fraud Detection System",
            "Summary": "Paisalo Digital unveils advanced AI-powered customer profiling and fraud detection framework to strengthen credit risk management ecosystem. System assesses each customer as distinct financial identity.",
            "Sentiment": "positive",
            "PublishDate": 1765455362408,
            "Source": "stocks"
        },
        {
            "Title": "Paisalo Digital Makes Interest Payment on FCCBs",
            "Summary": "Paisalo Digital Limited has made timely interest payment on its outstanding Foreign Currency Convertible Bonds worth USD 44 million with 7.5% coupon rate on December 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765384233694,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paisalo Digital Limited Makes Interest Payment on USD 44 Million Foreign Currency Convertible Bonds",
            "Summary": "Paisalo Digital Limited made a timely interest payment on its outstanding Foreign Currency Convertible Bonds worth USD 44 million carrying a 7.5% coupon rate on December 10, 2025. The payment fulfills the company's debt obligations to bondholders and maintains compliance with its bond terms.",
            "Sentiment": "positive",
            "PublishDate": 1765366101781,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Corrects NCD Coupon Payment Frequency from Quarterly to Annually",
            "Summary": "Paisalo Digital Limited issued a revised communication to stock exchanges correcting an error in their NCD documentation where coupon payment frequency was mistakenly stated as quarterly instead of annually. The correction pertains to their secured non-convertible debentures issue of up to Rs. 50 crores with 18.45% annual interest rate and tentative allotment date of December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765272082073,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Limited Raises Rs 40 Crore Through NCDs, Approves Additional Rs 50 Crore Issuance",
            "Summary": "Paisalo Digital Limited's Operations and Finance Committee approved allotment of 4,000 secured non-convertible debentures worth Rs 40 crore at 8.50% interest with 36-month tenure on private placement basis. The committee also approved issuance of up to 5,000 additional NCDs worth Rs 50 crore at 8.45% interest, including Rs 25 crore through green shoe option, with tentative allotment date of December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765267356941,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Schedules Board Review of NCD Fundraising Plan for December 9",
            "Summary": "Paisalo Digital has scheduled a review of its fundraising plan through non-convertible debentures on December 9. The review will determine the company's debt fundraising strategy and potential capital structure changes.",
            "Sentiment": "neutral",
            "PublishDate": 1764851384981,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Promoters Increase Shareholding to 41.75% Through Open Market Acquisitions",
            "Summary": "Paisalo Digital's promoter group increased their shareholding to 41.75% through open-market acquisitions, demonstrating continued commitment to the company's growth trajectory. The promoter ownership has steadily risen from approximately 26% in FY19 to 37% in FY25 and now to 41.75% in the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1764315892678,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Promoter Releases Pledge on 25 Lakh Shares",
            "Summary": "Equilibrated Venture Cflow Pvt Ltd, a promoter group entity of Paisalo Digital Limited, released pledge on 25,00,000 shares on November 21, 2025, reducing its encumbered shareholding from 8,14,09,002 shares to 7,89,09,002 shares. The pledge release was related to collateral for loans taken by the company, with the shares pledged to Anmol Industries Limited.",
            "Sentiment": "positive",
            "PublishDate": 1764046976506,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Limited Approves Rs 75 Crore Unsecured NCD Issuance",
            "Summary": "Paisalo Digital Limited's Operations and Finance Committee approved the issuance of up to 7,500 unsecured non-convertible debentures worth Rs 75 crores with 8.50% annual coupon rate. The NCDs will be secured by loan receivables at 1.10 times the outstanding principal amount, with tentative allotment scheduled for December 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763708765668,
            "Source": "corporate_action"
        },
        {
            "Title": "Equilibrated Venture C Flow Increases Stake in Paisalo Digital Through Open Market Acquisitions",
            "Summary": "Equilibrated Venture C Flow (P) Ltd., a promoter group entity, acquired 9,77,400 equity shares of Paisalo Digital Limited through two separate open market transactions on November 18 and 19, 2025. The acquisitions increased the company's shareholding from 20.4268% to 20.5343% in the digital lending company listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763533361566,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Plans Non-Convertible Debenture Fundraising on November 21",
            "Summary": "Paisalo Digital has announced plans to raise funds through the issuance of non-convertible debentures scheduled for November 21. The fundraising initiative will provide the company with debt capital to support its business operations and growth plans.",
            "Sentiment": "neutral",
            "PublishDate": 1763466402173,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Reports 20% AUM Growth to INR 54,494 Million in Q2 FY26",
            "Summary": "Paisalo Digital achieved record Assets Under Management of INR 54,494 million with 20% year-on-year growth, supported by 41% increase in disbursements to INR 11,025 million and total income reaching INR 2,240 million. The company delivered profit before tax of INR 690 million and profit after tax of INR 515 million while expanding its network by 383 new touchpoints and maintaining asset quality with gross NPA at 0.81%.",
            "Sentiment": "positive",
            "PublishDate": 1763185762552,
            "Source": "earnings"
        },
        {
            "Title": "Paisalo Digital Installs Energy-Efficient Liquid-Cooled Server in Mumbai for Sustainable Tech Operations",
            "Summary": "Paisalo Digital Limited has installed a high-efficiency liquid immersion cooling server at its Mumbai office to support its Generative AI capabilities development and sustainability goals. The new server setup is projected to avoid approximately 55.8 tonnes of CO2 emissions annually and save nearly 79,716 kWh of electricity at peak load, with the company planning to integrate these ESG benefits in its Q3 sustainability reporting.",
            "Sentiment": "positive",
            "PublishDate": 1763053864692,
            "Source": "stock"
        },
        {
            "Title": "Equilibrated Venture Ceflow Increases Stake in Paisalo Digital Limited",
            "Summary": "Equilibrated Venture Ceflow (P) Ltd., a promoter group entity, acquired 43,94,034 equity shares of Paisalo Digital Limited through open market transactions on November 13, 2025. The acquisition increased the company's shareholding from 20.1074% to 20.4268% in Paisalo Digital. The shares were acquired at face value of Re. 1 each. Paisalo Digital's total equity share capital remains at Rs. 90,95,21,874 divided into 90,95,21,874 equity shares. The disclosure was made under SEBI regulations for substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763016332543,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Reports 20% YoY AUM Growth to Rs 54,494 Mn in Q2 Results",
            "Summary": "Paisalo Digital Limited announced its quarterly results with Assets Under Management (AUM) growing 20% year-on-year to Rs 54,494 million. Total income increased 20% YoY to Rs 2,240 million, while disbursements surged 41% YoY to Rs 11,025 million. The company maintained stable asset quality with Gross NPA at 0.81% and Net NPA at 0.65%. Net Interest Income rose 15% YoY to Rs 1,262 million, and Profit After Tax grew 3% YoY to Rs 515 million. The company expanded its customer base to a record 13 million, adding 1.8 million new customers during the quarter. Collection efficiency stood at 98.4% with a strong Capital Adequacy Ratio of 38.2%. The company's geographic footprint expanded to 4,380 touchpoints across 22 states. Net Worth increased 19% YoY to Rs 16,799 million. USD 4 million from the company's USD 50 million FCCB issuance were converted into share capital in September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762803705867,
            "Source": "earnings"
        },
        {
            "Title": "Paisalo Digital Reports 8.9% Rise in Quarterly Profit to Rs 51.5 Crore",
            "Summary": "Paisalo Digital Limited announced unaudited financial results for the quarter ended September 30, 2025. The company reported a net profit of Rs 51.5 crore compared to Rs 47.2 crore in the same quarter last year, marking an 8.9% increase. Total revenue from operations rose to Rs 224 crore from Rs 218.7 crore year-over-year. Interest income, the company's primary revenue source, increased to Rs 207.1 crore from Rs 200.9 crore. The company's loan portfolio expanded to Rs 5,249.3 crore from Rs 4,954.4 crore. During the quarter, the company raised funds through Non-Convertible Debentures and allotted 74.06 lakh equity shares at a premium of Rs 44.74 per share upon conversion of Foreign Currency Convertible Bonds. Basic earnings per share stood at Rs 0.57 compared to Rs 0.52 in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762792761320,
            "Source": "earnings"
        },
        {
            "Title": "Paisalo Digital Targets 25-30% AUM Growth Through Co-Lending Partnerships and Digital Expansion",
            "Summary": "Paisalo Digital has provided guidance for consistent 25-30% AUM growth, driven by co-lending partnerships with SBI, UBI, and Axis Bank. The company is expanding rural financial inclusion through its digital lending platform and AI-based credit analytics. Paisalo Digital maintains NPA levels below 1% and focuses on a strong margin profile with low-cost borrowings. The company plans to double its customer base by FY27 through technology-led efficiency and new loan origination models.",
            "Sentiment": "positive",
            "PublishDate": 1762790054069,
            "Source": "stock"
        },
        {
            "Title": "Paisalo Digital Reports Growth in Quarterly Net Profit and Revenue",
            "Summary": "Paisalo Digital reported net profit of 508 million rupees compared to 495 million rupees in the same quarter last year. The company's revenue increased to 2.16 billion rupees from 1.76 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762776715419,
            "Source": "earnings"
        },
        {
            "Title": "Paisalo Digital Limited Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Paisalo Digital Limited has announced an earnings conference call scheduled for Tuesday, November 11, 2025, at 2:00 PM IST. The call will discuss the company's standalone and consolidated unaudited financial results for the quarter ended September 30, 2025. The call will be represented by Deputy Managing Director Santanu Agarwal, Executive Director and Chief Financial Officer Harish Singh, and Chief Risk Officer Gaurav Chaubey. Conference dial-in details and registration information have been provided for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762458324452,
            "Source": "earnings"
        },
        {
            "Title": "Paisalo Digital Allots Rs 80 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Paisalo Digital Limited has allotted 8,000 unsecured non-convertible debentures worth Rs 80 crore through private placement on November 6, 2025. The allotment includes 5,500 NCDs at 8.45% interest rate with maturity on November 6, 2027, and 2,500 NCDs at 8.50% interest rate maturing on November 6, 2028. Each debenture has a face value of Rs 1 lakh. Both series offer one-time payment on maturity and will be redeemed at par. The company's Operations and Finance Committee approved the allotment through a resolution dated November 6, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762417679489,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Approves Rs 150 Crore Non-Convertible Debenture Issuance",
            "Summary": "Paisalo Digital Limited's Operations and Finance Committee approved the issuance of two series of non-convertible debentures totaling Rs 150 crores. The company will issue up to 7,500 unsecured NCDs each for both 8.45% and 8.50% coupon rates, with each debenture having a face value of Rs 1 lakh. Both series include a base issue of Rs 25 crores with a green shoe option of Rs 50 crores. The 8.45% NCDs have a 2-year tenure while the 8.50% NCDs have a 3-year tenure, with coupon payments made annually. Both debentures will be issued through private placement via EBP Platform and listed on BSE Limited. The allotment is scheduled for November 6, 2025, with redemption at par on maturity dates.",
            "Sentiment": "neutral",
            "PublishDate": 1761848968638,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Limited Schedules Board Meeting to Consider Non-Convertible Debenture Issuance",
            "Summary": "Paisalo Digital Limited has announced that its Operations and Finance Committee meeting is scheduled for October 30, 2025, to consider and approve a fund raising proposal through the issuance of Non-Convertible Debentures on a Private Placement basis. The company has informed stock exchanges BSE Limited and National Stock Exchange of India about this upcoming meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1761562952160,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Allots 700 Commercial Papers Worth Rs. 35 Crore Through Private Placement",
            "Summary": "Paisalo Digital Limited has allotted 700 commercial papers through private placement with a face value of Rs. 5,00,000 each. The papers carry a yield of 8.50% and have a tenure of 162 days, maturing on March 25, 2026. The issue price was Rs. 4,81,822.50 per paper, resulting in a total issue value of Rs. 33,72,75,750 and redemption value of Rs. 35,00,00,000. IDBI Bank Limited served as the Issue and Paying Agent for the transaction. The allotment was approved by the company's Operations and Finance Committee on October 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760428157062,
            "Source": "corporate_action"
        },
        {
            "Title": "Equilibrated Venture Flow Private Ltd Acquires 39.51 Lakh Shares in Paisalo Digital",
            "Summary": "Equilibrated Venture Flow Private Ltd purchased 39.51 lakh shares of Paisalo Digital on September 23 through open market transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1758613686884,
            "Source": "order&deals"
        },
        {
            "Title": "Paisalo Digital Limited Redeems Rs 30 Crore Commercial Paper on Maturity",
            "Summary": "Paisalo Digital Limited has fully redeemed and repaid its Commercial Paper with ISIN INE420C14193 worth Rs 30 crore on September 23, 2025, matching the scheduled maturity date. The commercial paper was listed on BSE Limited under scrip code 729722.",
            "Sentiment": "neutral",
            "PublishDate": 1758607988813,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Promoter Entity Releases 25 Lakh Pledged Shares",
            "Summary": "Equilibrated Venture Cflow Private Limited, a promoter group entity of Paisalo Digital Limited, released 25 lakh pledged shares on September 22, 2025. The shares were released in favor of Anmol Industries Limited for the purpose of purchasing shares. Post-release, Equilibrated Venture Cflow holds 17.74 crore shares (19.67% of total share capital) with 8.14 crore shares (9.02% of total share capital) remaining encumbered. The entity's encumbered shares represent 45.88% of its total promoter shareholding in Paisalo Digital.",
            "Sentiment": "neutral",
            "PublishDate": 1758605525571,
            "Source": "corporate_action"
        },
        {
            "Title": "Equilibrated Venture Cflow Acquires Additional 4.5 Million Shares in Paisalo Digital",
            "Summary": "Equilibrated Venture Cflow (P) Ltd acquired 45,00,000 equity shares of Paisalo Digital Limited through open market purchase on September 12, 2025. The acquisition increased the promoter group company's shareholding from 18.67% to 19.17% in Paisalo Digital. The shares have a face value of Re. 1 each, and the transaction was disclosed under SEBI substantial acquisition regulations. Paisalo Digital's total equity share capital remains at Rs. 90,21,18,289 divided into 90,21,18,289 equity shares, with the company listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757936447736,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Promoter Increases Stake by 0.5% to 18.17%",
            "Summary": "Paisalo Digital's promoter company, Equilibrated Venture Cflow (P) Ltd, acquired 45 lakh shares, raising its stake by 0.5% to 18.17%. The NBFC reported consolidated net profit of Rs 47 crore for the quarter ended June 30, 2025, up 13.7% from Rs 41 crore year-over-year. Total revenue increased 17% to Rs 219 crore from Rs 187 crore. The company's assets under management stood at Rs 5,203 crore with net worth at Rs 1,575 crore. Net NPA was 0.68% and debt-to-equity ratio at 2.15. Despite the stake increase, the stock has declined 37% over the past year. LIC holds a 1.12% stake in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1757826360973,
            "Source": "stock"
        },
        {
            "Title": "Equilibrated Venture Cflow Acquires Additional 4.5 Million Shares in Paisalo Digital Limited",
            "Summary": "Equilibrated Venture Cflow (P) Ltd acquired 45,00,000 equity shares of Paisalo Digital Limited through open market purchase on September 11, 2025. The acquisition increased the company's shareholding from 17.67% to 18.17% of Paisalo Digital's total voting capital. Equilibrated Venture Cflow belongs to the promoter group of Paisalo Digital Limited. The acquired shares have a face value of Re. 1 each, and Paisalo Digital's total equity share capital remains at Rs. 90,21,18,289 divided into 90,21,18,289 equity shares. The company is listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757674489570,
            "Source": "corporate_action"
        },
        {
            "Title": "Equilibrated Venture Cflow Acquires Additional 4.6 Million Shares in Paisalo Digital",
            "Summary": "Equilibrated Venture Cflow (P) Ltd acquired 46,04,670 equity shares of Paisalo Digital Limited through open market transactions on September 10, 2025. The acquisition increased the company's shareholding from 17.16% to 17.67% of Paisalo Digital's total voting capital. Equilibrated Venture Cflow belongs to the promoter group of Paisalo Digital. The acquired shares have a face value of Re. 1 each, and Paisalo Digital's total equity share capital remains at Rs. 90,21,18,289 divided into 90,21,18,289 equity shares. The company is listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757490508693,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Allots 5,000 Secured NCDs Worth Rs 50 Crore Through Private Placement",
            "Summary": "Paisalo Digital Limited has allotted 5,000 secured non-convertible debentures through private placement. Each NCD has a face value of Rs 1 lakh, totaling Rs 50 crore. The debentures carry a 10% annual coupon rate with monthly payments and have a tenure of 36 months. The NCDs are secured by a first ranking pari-passu charge on loan receivables, maintaining security value at 1.10 times the principal outstanding amount. Redemption will occur in 4 equal quarterly installments starting from the 9th quarter, with debentures redeemed at par on maturity. The allotment was approved by the Operations and Finance Committee of the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1757482123088,
            "Source": "corporate_action"
        },
        {
            "Title": "Equilibrated Venture Cflow Acquires Additional 31.02 Lakh Shares in Paisalo Digital",
            "Summary": "Equilibrated Venture Cflow (P) Ltd, a promoter group entity, acquired 31,02,822 equity shares of Paisalo Digital Limited through open market transactions on September 08, 2025. The acquisition increased the company's shareholding from 16.82% to 17.16% in Paisalo Digital. The shares were acquired at face value of Re. 1 each. Post-acquisition, Equilibrated Venture Cflow holds 15,48,36,776 shares in the target company. Paisalo Digital's total equity share capital remains unchanged at Rs. 90,21,18,289 divided into 90,21,18,289 equity shares. The company is listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757407738216,
            "Source": "corporate_action"
        },
        {
            "Title": "Equilibrated Venture Cflow Acquires Additional 582,840 Shares in Paisalo Digital Limited",
            "Summary": "Equilibrated Venture Cflow (P) Ltd, a promoter group entity, acquired 582,840 equity shares of Paisalo Digital Limited through open market transactions on September 04, 2025. The acquisition increased the company's shareholding from 16.7551% to 16.8197%, representing a 0.0646% increase in voting rights. The shares were acquired at face value of Re. 1 each. Paisalo Digital's total equity share capital remains unchanged at Rs. 90,21,18,289 divided into 90,21,18,289 equity shares. The company is listed on both NSE and BSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1756984023035,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Redeems Commercial Papers Worth Rs. 43 Crore",
            "Summary": "Paisalo Digital Limited has fully redeemed and repaid two Commercial Papers totaling Rs. 43 crore on September 4, 2025. The first Commercial Paper (scrip code 729780) had a maturity amount of Rs. 30 crore with a maturity date of September 4, 2025. The second Commercial Paper (scrip code 727935) had a maturity amount of Rs. 13 crore with a maturity date of September 5, 2025, but was repaid a day early due to September 5 being a banking holiday for Eid e Milad. Both Commercial Papers were listed on BSE Limited.",
            "Sentiment": "positive",
            "PublishDate": 1756967959559,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Plans NCD Private Placement on September 4",
            "Summary": "Paisalo Digital has announced plans to raise funds through a private placement of Non-Convertible Debentures (NCDs) scheduled for September 4. The company will use this debt instrument to secure capital from select investors.",
            "Sentiment": "neutral",
            "PublishDate": 1756727962861,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Approves Rs 50 Crore Non-Convertible Debenture Issuance",
            "Summary": "Paisalo Digital Limited's Operations and Finance Committee approved the issuance of up to 5,000 Non-Convertible Debentures worth Rs 50 crores through private placement on the EBP Platform. The debentures have a face value of Rs 1 lakh each, with a base issue of Rs 25 crores and a green shoe option for an additional Rs 25 crores. The instruments carry a 9.75% annual coupon rate with quarterly payments and a 36-month tenure. The debentures will be secured by a first ranking pari-passu charge on loan receivables, maintaining security value at 1.10 times the outstanding principal amount. The tentative allotment date is August 8, 2025, with the debentures proposed to be listed on BSE Limited. In case of payment delays, the coupon rate increases by 2% per annum.",
            "Sentiment": "neutral",
            "PublishDate": 1754371445459,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Schedules Board Meeting to Discuss Private Placement Fundraising",
            "Summary": "Paisalo Digital has scheduled a board meeting for August 5 to discuss fundraising through private placement. The meeting will focus on potential capital raising activities through this method.",
            "Sentiment": "neutral",
            "PublishDate": 1753959343938,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Lists $50 Million FCCBs on India International Exchange",
            "Summary": "Paisalo Digital Limited has listed its 7.5% Foreign Currency Convertible Bonds (FCCBs) due 2029 on the Global Securities Market of India International Exchange (IFSC) Limited, effective July 31, 2025. The bonds have a total issue size of USD 50 million and were originally issued on December 10, 2024, with a maturity date of December 10, 2029. The securities carry a 7.50% coupon rate and have minimum denominations of USD 200,000 each or integral multiples of USD 1,000. The bonds are assigned ISIN XS2952463086 and will trade under the security symbol 7500PSDL1229. GLAS Trust Company LLC serves as the trustee for the issue.",
            "Sentiment": "neutral",
            "PublishDate": 1753878030369,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Reports 14% AUM Growth, Expands SBI Co-lending Partnership to MSME Segment",
            "Summary": "Paisalo Digital Limited reported assets under management of INR 52,302 million, representing 14% year-on-year growth for the quarter ended June 30, 2025. The company achieved its highest-ever total income of INR 2,187 million, up 17% year-on-year, with net interest income rising 28% to INR 1,244 million. Disbursements increased 16% to INR 7,581 million, while the company crossed 11 million customers by adding 1.5 million new customers during the quarter. Profit after tax grew 14% to INR 472 million, with return on equity at 11.9% and return on assets at 3.7%. Asset quality improved with Gross NPA at 0.85% and Net NPA at 0.68%, while collection efficiency strengthened to 99.8% from 99.2% in the previous year. The company expanded its co-lending partnership with State Bank of India to include MSME and SME segments, with operational rollout expected by Q4 FY26. Paisalo added a record 50 new branches during the quarter, bringing its distribution network to 3,997 touchpoints across 22 states and union territories.",
            "Sentiment": "positive",
            "PublishDate": 1753515334639,
            "Source": "earnings"
        },
        {
            "Title": "Equilibrated Venture Cflow Increases Stake in Paisalo Digital to 16.50%",
            "Summary": "Equilibrated Venture Cflow (P) Ltd, a promoter group entity, acquired 74,70,000 equity shares of Paisalo Digital Limited through open market purchases on July 24, 2025 and July 25, 2025. The acquisition increased their shareholding from 15.67% to 16.50% of the total share capital. The shares have a face value of Re. 1/- each. Paisalo Digital's total equity share capital remains at Rs. 90,21,18,289 divided into 90,21,18,289 equity shares. The company's shares are listed on both the National Stock Exchange of India Limited and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753421655696,
            "Source": "stock"
        },
        {
            "Title": "Paisalo Digital Sets Record Date for Final Dividend Payment",
            "Summary": "Paisalo Digital Limited has set September 22, 2025, as the record date for determining shareholder eligibility for the final dividend for financial year 2024-2025. The dividend payment is subject to shareholder approval at the 33rd Annual General Meeting scheduled for September 29, 2025. The Board of Directors has recommended the final dividend, which requires formal approval from shareholders at the upcoming meeting.",
            "Sentiment": "positive",
            "PublishDate": 1753348932099,
            "Source": "corporate_action"
        },
        {
            "Title": "Paisalo Digital Limited Completes Q1FY26 Earnings Conference Call",
            "Summary": "Paisalo Digital Limited held an earnings conference call on July 22, 2025, to discuss the financial results for the quarter ended June 30, 2025. The company has made the audio recording of the Q1FY26 earnings call available on its website. The presentation materials were previously disclosed to exchanges on July 21, 2025. Company Secretary Manendra Singh communicated this update to BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753191244111,
            "Source": "earnings"
        },
        {
            "Title": "Paisalo Digital Corrects Director Reappointment Date in Board Meeting Revision",
            "Summary": "Paisalo Digital Limited issued a revision to correct an error in their board meeting intimation dated July 21, 2025. The company corrected the reappointment date for Mr. Harish Singh as a director from September 23, 2025 to September 29, 2025. The corrected date aligns with the company's 33rd Annual General Meeting scheduled for September 29, 2025. The revision was communicated to BSE Limited and National Stock Exchange of India Limited to update their records accordingly.",
            "Sentiment": "neutral",
            "PublishDate": 1753179646631,
            "Source": "corporate_governance"
        }
    ]
}