{
    "Symbol": "PAKKA",
    "ISIN": "INE551D01018",
    "News": [
        {
            "Title": "Pakka Limited Reports Q3 FY26 Results & Strategic Pause",
            "Summary": "Pakka Limited announced Q3 FY26 results with standalone revenue of ₹9,619.18 lakhs and net profit of ₹914.36 lakhs. Board approved strategic pause of US subsidiary expansion to focus on Jagriti Project.",
            "Sentiment": "neutral",
            "PublishDate": 1769761763833,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pakka Limited Reschedules Q3FY26 Earnings Call",
            "Summary": "Pakka Limited has revised the timing of its analyst/investor video conference call to discuss Q3FY26 financial performance, now scheduled for February 2, 2026 at 09:30 AM IST due to unavoidable circumstances.",
            "Sentiment": "neutral",
            "PublishDate": 1769593402950,
            "Source": "stocks"
        },
        {
            "Title": "Pakka Grants Stock Options to 89 Team Members",
            "Summary": "Pakka Limited grants 1,24,500 stock options to 89 eligible team members under Employee Stock Option Plan with exercise price of ₹152.31 per share and vesting period of one year.",
            "Sentiment": "positive",
            "PublishDate": 1767164307306,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pakka Limited Q3FY26 Earnings Call on Jan 31",
            "Summary": "Pakka Limited schedules analyst/investor video conference call for January 31, 2026 at 4:00 PM IST to discuss Q3FY26 financial performance ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767084834322,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pakka Limited Gets NCLT Approval for Merger",
            "Summary": "NCLT Allahabad approves first motion petition for merger of wholly-owned subsidiary Pakka Impact Limited with Pakka Limited. Court dispenses with shareholder and creditor meetings, paving way for final approval.",
            "Sentiment": "positive",
            "PublishDate": 1765475267430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pakka Limited Reports Revenue Decline and Loss in Q2 Results, Announces US Expansion Plans",
            "Summary": "Pakka Limited reported revenue of Rs. 118.39 crores in Q2, down from Rs. 115.97 crores in the previous year's corresponding quarter and Rs. 84.26 crores in Q1. The company posted a profit before tax loss of Rs. 0.40 crores compared to a profit of Rs. 21.66 crores in Q2 of the previous year and Rs. 6.54 crores in Q1. The company is progressing with Project Jagriti, initially planned for commissioning within the financial year but now optimized for July 2026. In the US market, Pakka is developing a 40 TPD moulded product facility in Guatemala with a total investment of USD 55 million, targeting stabilized turnover of USD 36 million and EBITDA of USD 12 million by 2028. The company plans to invest USD 16.5 million in equity and has received a letter of intent for USD 38.5 million in debt financing. The food services division showed growth with B2C revenue doubling in the last 6 months and successful launch of clamshells generating Rs. 20 lakh sales in the first month.",
            "Sentiment": "negative",
            "PublishDate": 1762901391977,
            "Source": "earnings"
        },
        {
            "Title": "Pakka Reports 16% Revenue Growth, Targets 20% CAGR Through Global Expansion",
            "Summary": "Pakka reported Q2FY26 revenue of ₹212 crores, marking a 16% year-on-year increase. The company achieved EBITDA of ₹40 crores with a 19% margin. Pakka is establishing a new 1.2 lakh TPA biopaper plant in Ayodhya and expanding international distribution across 45 countries. The company has provided guidance for 20% revenue CAGR through global expansion in compostable packaging and is positioned to benefit from the sustainable packaging market growth.",
            "Sentiment": "positive",
            "PublishDate": 1762875906969,
            "Source": "earnings"
        },
        {
            "Title": "Pakka Limited Reports No Deviation in Fund Utilization from Rs 244.80 Crore Preferential Issue",
            "Summary": "Pakka Limited reported no deviations in fund utilization from its preferential issue worth Rs 244.80 crore for the quarter ended September 30, 2025. The issue comprised Rs 146.88 crore from equity shares and Rs 97.92 crore from fully convertible warrants. The company utilized Rs 2.75 crore during the quarter for plant machinery procurement under the Jagriti Project. Shareholders approved extending the warrant exercise timeline from 12 to 18 months from the allotment date. The monitoring agency CARE Ratings noted that the company's share price is trading significantly below the warrant exercise price of Rs 272, which may impact warrant conversion. The company experienced revenue decline to Rs 82.24 crore in the quarter due to a plant shutdown for expansion activities. Managing Director Jagdeep Hira resigned citing health concerns and was replaced by Ved Krishna.",
            "Sentiment": "neutral",
            "PublishDate": 1762826230940,
            "Source": "corporate_action"
        },
        {
            "Title": "PAKKA Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "PAKKA reported quarterly results showing significant year-over-year declines across key financial metrics. Net profit dropped to 3 million rupees from 205 million rupees in the same quarter last year. Revenue fell to 758 million rupees compared to 1.11 billion rupees previously. EBITDA decreased to 46.5 million rupees from 231.7 million rupees, while EBITDA margin compressed to 6.13% from 20.86% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762593760133,
            "Source": "earnings"
        },
        {
            "Title": "Pakka Limited Reports Quarterly Results, Revises Jagriti Project Cost and Timeline",
            "Summary": "Pakka Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company revised its Jagriti Project cost from Rs. 675 crores to Rs. 750 crores, citing alterations in machinery and infrastructure. The commercial production date has been delayed from April 1, 2026 to August 1, 2026. The Board also approved a revised CSR policy. Management stated that appropriate steps have been taken to mitigate further delays and control costs, with no material change expected in the project's overall viability or profitability. The plant was shut from June 16 to July 26, 2025 for expansion of production facility as part of Project Jagriti.",
            "Sentiment": "neutral",
            "PublishDate": 1762593437793,
            "Source": "earnings"
        },
        {
            "Title": "Pakka Limited Receives Approval for Rs. 224.47 Crore Fiscal Incentives for Jagriti Project",
            "Summary": "Pakka Limited has received approval and recommendation for fiscal incentives worth Rs. 224.47 crores from the Evaluation Committee of Uttar Pradesh Government for its Jagriti Project. The incentives fall under the state's Industrial Investment and Employment Promotion Policy, 2022. The company had applied for these incentives on July 23, 2025. The Evaluation Committee of Invest UP has reviewed and recommended the proposal to the Uttar Pradesh Government for issuing a Letter of Comfort. The fiscal incentives are subject to final approval by the state cabinet and will be distributed over 15 years from the start of commercial production.",
            "Sentiment": "positive",
            "PublishDate": 1758025237378,
            "Source": "stock"
        },
        {
            "Title": "Pakka Limited Reports Strong Growth with 24% Revenue Rise in FY2025 and 26% Jump in Q1 FY2026",
            "Summary": "Pakka Limited delivered robust financial performance across multiple reporting periods. For Q4 FY2025, the company posted revenue of ₹198.03 crores with 23% year-on-year growth, EBITDA of ₹33.68 crores (17% margin), and PAT of ₹16.86 crores (8.5% margin). Full year FY2025 results showed revenue of ₹715.26 crores (24% growth), EBITDA of ₹121.59 crores, and PAT of ₹60.80 crores. Q1 FY2026 continued the momentum with revenue reaching ₹209.91 crores (26% YoY growth) and PAT of ₹17.84 crores (46% YoY growth). Operationally, capacity utilization improved from 85% to 90% in Q4 FY2025 and further to 92% in Q1 FY2026. The company expanded its distribution network by adding 15 new distributors in Q4 and 10 more in Q1. Management announced plans for a new manufacturing facility operational by FY2027 and expressed confidence in maintaining double-digit growth through capacity expansion and market expansion strategies.",
            "Sentiment": "positive",
            "PublishDate": 1755602662284,
            "Source": "earnings"
        },
        {
            "Title": "Pakka Limited Reports Progress on Rs 244.80 Crore Preferential Issue Fund Utilization",
            "Summary": "Pakka Limited submitted its monitoring agency report for the quarter ended June 30, 2025, regarding the utilization of proceeds from its preferential issue of 54 lakh equity shares (Rs 146.88 crore) and 36 lakh fully convertible warrants (Rs 97.92 crore). The company utilized Rs 46.01 crore during the quarter, with Rs 29.01 crore invested in plant and machinery for the Jagriti Project and Rs 17.00 crore invested in its wholly-owned subsidiary Pakka INC, USA for land acquisition. Total funds utilized to date amount to Rs 168.60 crore out of Rs 171.36 crore raised, leaving Rs 2.76 crore unutilized. The monitoring agency noted that the company's share price is trading below the warrant exercise price, which may impact warrant conversion. Additionally, the company has delayed publishing its consolidated financials for FY25. Care Ratings Limited serves as the monitoring agency under the agreement dated October 9, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1755360947251,
            "Source": "corporate_action"
        },
        {
            "Title": "PAKKA Reports 42% Decline in Q1 Net Profit to 32M Rupees",
            "Summary": "PAKKA's consolidated net profit dropped to 32 million rupees in Q1 compared to 55 million rupees in the same period last year, representing a 42% decline. The company's revenue also decreased to 922 million rupees from 946 million rupees year-over-year, marking a 2.5% decline in quarterly revenue.",
            "Sentiment": "negative",
            "PublishDate": 1755097891848,
            "Source": "earnings"
        },
        {
            "Title": "Pakka Limited Reports Financial Results and Leadership Change with Ved Krishna Appointed as Managing Director",
            "Summary": "Pakka Limited's Board approved consolidated audited financial results for the fourth quarter and financial year ended March 31, 2025, with C N K & Associates LLP issuing an unmodified audit opinion. The company reported consolidated revenue from operations of Rs 40,604.08 lakhs for the year ended March 31, 2025, compared to Rs 40,474.29 lakhs in the previous year. Net profit for the year was Rs 3,751.98 lakhs versus Rs 4,080.73 lakhs in the prior year. Basic earnings per share decreased to Rs 8.96 from Rs 10.54. The Board also approved unaudited financial results for the first quarter ended June 30, 2025. In a significant leadership change, Jagdeep Hira resigned as Managing Director effective August 13, 2025, and Ved Krishna was appointed as the new Managing Director for a three-year term from August 13, 2025 to August 12, 2028, subject to shareholder approval. The company operates in Paper & Pulp and Moulded Products segments, with Paper & Pulp contributing Rs 36,408.28 lakhs and Moulded Products Rs 5,664.60 lakhs in revenue for the year. The 45th Annual General Meeting is scheduled for September 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755082407930,
            "Source": "earnings"
        },
        {
            "Title": "Pakka Ltd Reports Q4 Financial Results",
            "Summary": "Pakka Ltd has announced its Q4 financial results. The company's EBITDA for Q4 was 148 million rupees, compared to 182 million rupees in the same quarter last year. The EBITDA margin decreased to 16.14% from 19.25% year-over-year. However, the company's net profit for Q4 increased to 126 million rupees from 86 million rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748587382000,
            "Source": "result"
        },
        {
            "Title": "PAKKA Reports Decline in Q3 EBITDA and Margin",
            "Summary": "PAKKA has reported a decrease in its third quarter EBITDA, which fell to 181 million rupees from 197 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 17.05% from 19.84% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739010399000,
            "Source": "earnings"
        },
        {
            "Title": "Pakka Limited Reports Increased Q3 Profit and Revenue",
            "Summary": "Pakka Limited has announced its financial results for the third quarter. The company reported a net profit of 128 million rupees, up from 118 million rupees in the same period last year. Revenue also increased to 1.06 billion rupees from 993 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739010391000,
            "Source": "earnings"
        },
        {
            "Title": "Pakka Ltd Reports Increased Q2 Profits and Revenue",
            "Summary": "Pakka Ltd announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter improvements. The company's consolidated net profit rose to 168 million rupees, up from 110 million rupees year-over-year and 85 million rupees quarter-over-quarter. Revenue also increased to 1.11 billion rupees, compared to 1 billion rupees year-over-year and 967 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731284245000,
            "Source": "result"
        },
        {
            "Title": "Pakka: Board Approves Rs 171 Crore Preferential Allotment",
            "Summary": "<p>Pakka's board <span class='positive'>approved</span> a preferential allotment of <b>54 lakh</b> equity shares at <b>Rs 272</b> per share and <b>36 lakh</b> convertible warrants at <b>Rs 272</b> per warrant on October 14, 2024. The company <span class='positive'>received</span> <b>Rs 146.88 crore</b> for equity shares and <b>Rs 24.48 crore</b> as upfront payment for warrants.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728884460000,
            "Source": "corporate_action"
        }
    ]
}