{
    "Symbol": "PALASHSECU",
    "ISIN": "INE471W01019",
    "News": [
        {
            "Title": "Palash Securities Board Meet Set for Feb 13, 2026",
            "Summary": "Palash Securities Limited has scheduled a board meeting on February 13, 2026, to consider and approve unaudited financial results for Q3 FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770217438830,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morton Foods Ceases to be Material Subsidiary of Palash Securities After Rights Issue",
            "Summary": "Morton Foods Limited completed a rights issue raising Rs. 10.26 crores by allotting 44,61,454 equity shares at Rs. 23 per share, which Palash Securities declined to participate in. Following the rights issue completion, Palash Securities' shareholding in Morton Foods reduced to 44.95%, causing Morton Foods to cease being a material unlisted subsidiary of Palash Securities with effect from November 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763467385575,
            "Source": "corporate_action"
        },
        {
            "Title": "Palash Securities Reports Standalone Net Loss of ₹57.93 Lakhs for Q2 FY26",
            "Summary": "Palash Securities Limited posted a standalone net loss of ₹57.93 lakhs for the quarter ended September 30, 2025, compared to a profit of ₹40.54 lakhs in the same period last year. On a consolidated basis, the company reported a net loss of ₹274.19 lakhs for the quarter, with subsidiary Morton Foods Limited continuing to face material uncertainty regarding its going concern status due to substantial erosion of net worth.",
            "Sentiment": "negative",
            "PublishDate": 1763068168370,
            "Source": "earnings"
        },
        {
            "Title": "Palash Securities' Subsidiary Morton Foods Appoints New CFO and Independent Director",
            "Summary": "Morton Foods Limited, a material unlisted subsidiary of Palash Securities Limited, has made two key appointments. The company appointed Nirmal Kumar Sharma as Chief Financial Officer effective November 6, 2025. Sharma is a qualified Chartered Accountant and Fellow member of ICAI with over 15 years of post-qualification experience in finance, accounts, taxation, and strategic budgetary planning across retail, multinational corporations, services, and manufacturing sectors. Additionally, Morton Foods appointed Ashishkumar Harimohan Srivastava as Additional Director in Independent Category effective November 7, 2025, subject to shareholder approval. Srivastava holds an MBA from APS University and a Diploma in Foreign Trade from IIFT, with over 25 years of experience in textile value chain, business excellence, strategy frameworks, and commercial operations. His appointment is for a 5-year term pending shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1762457277998,
            "Source": "corporate_governance"
        },
        {
            "Title": "Palash Securities Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Palash Securities Limited approved and released unaudited financial results for the quarter ended June 30, 2025, during a board meeting held on August 14, 2025. The company operates in two business segments: investing business and food processing. The consolidated results include five subsidiaries: Morton Foods Limited, Hargaon Investment & Trading Company Limited, OSM Investment & Trading Company Limited, Hargaon Properties Limited, and Champaran Marketing Company Limited. Morton Foods Limited reported a net loss of Rs. 299.44 Lakhs during the quarter, with substantially eroded net worth raising going concern uncertainties. The auditors noted that Morton Foods Limited has recognized Deferred Tax Asset of Rs. 450.53 Lakhs up to March 31, 2022, based on future profitability projections, though no further DTA was recognized during the quarter. The financial results were prepared in accordance with Indian Accounting Standards and reviewed by statutory auditors.",
            "Sentiment": "negative",
            "PublishDate": 1755174509481,
            "Source": "earnings"
        },
        {
            "Title": "Morton Foods CFO Shravan Kumar Jain Resigns Due to Personal Reasons",
            "Summary": "Morton Foods Limited, a material unlisted subsidiary of Palash Securities Limited, announced the resignation of Mr. Shravan Kumar Jain as Chief Financial Officer and Key Managerial Personnel, effective from the close of business hours on 7th August, 2025. The Board of Directors of Morton Foods Limited accepted his resignation in their meeting held on 7th August, 2025. According to the resignation letter dated 20th May 2025, Mr. Jain cited personal reasons for his departure and stated there were no other material reasons for his resignation. The disclosure was made by Palash Securities Limited under SEBI regulations regarding material subsidiary changes.",
            "Sentiment": "neutral",
            "PublishDate": 1754570614312,
            "Source": "corporate_governance"
        }
    ]
}