{
    "Symbol": "PALREDTEC",
    "ISIN": "INE218G01033",
    "News": [
        {
            "Title": "pTron Enters Automotive Accessories Market",
            "Summary": "Palred Technologies' consumer electronics brand pTron launches car vacuum cleaners and wireless CarPlay adapter, expanding into automotive accessories segment with products priced ₹1,199-₹1,999.",
            "Sentiment": "positive",
            "PublishDate": 1767165381540,
            "Source": "stocks"
        },
        {
            "Title": "pTron Launches Smart Eyewear Series at ₹2,499",
            "Summary": "Palred Technologies subsidiary pTron enters smart eyewear market with Orbis Era and Orbis Urban Bluetooth-enabled glasses featuring open-ear audio, blue light protection, and competitive pricing.",
            "Sentiment": "positive",
            "PublishDate": 1765754891797,
            "Source": "stocks"
        },
        {
            "Title": "Palred Technologies Reports Mixed Financial Performance in Q2 Results",
            "Summary": "Palred Technologies Limited announced its quarterly results for the period ended September 30, 2025. On a standalone basis, the company reported other income of Rs 100.93 lakhs for the quarter, with total expenses of Rs 192.61 lakhs, resulting in a profit before tax of Rs 91.68 lakhs and profit after tax of Rs 91.68 lakhs. However, the consolidated results showed a different picture, with the company and its subsidiaries reporting a loss before tax of Rs 429.41 lakhs and loss after tax of Rs 429.41 lakhs for the half-year period. The consolidated results include financial performance from six subsidiaries across India, Hong Kong, China, and Turkey. The company's total assets on a consolidated basis stood at Rs 11,455.45 lakhs as of September 30, 2025. The board meeting was held on November 12, 2025, where these unaudited financial results were approved.",
            "Sentiment": "neutral",
            "PublishDate": 1762947038383,
            "Source": "earnings"
        },
        {
            "Title": "Palred Technologies Reports Standalone Profit of Rs 66.98 Lakhs but Consolidated Loss of Rs 340.51 Lakhs",
            "Summary": "Palred Technologies Limited announced its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 37.50 lakhs and profit after tax of Rs 66.98 lakhs, compared to a profit of Rs 91.33 lakhs in the same quarter last year. However, on a consolidated basis, the company posted a loss after tax of Rs 340.51 lakhs against a loss of Rs 201.59 lakhs in the corresponding quarter of the previous year. Consolidated revenue from operations was Rs 1,350.72 lakhs compared to Rs 1,932.19 lakhs in the same period last year. The company operates in trading electronic products, mobile accessories and providing related services. The consolidated results include six subsidiaries across India, Hong Kong, China and Turkey.",
            "Sentiment": "negative",
            "PublishDate": 1754641787611,
            "Source": "earnings"
        },
        {
            "Title": "Palred Technologies: Q3 FY25 Loss Narrows, Revenue Grows",
            "Summary": "Palred Technologies reported Q3 FY25 results with revenue increasing 7.45% YoY to ₹20.33 crore and loss decreasing 28.19% YoY to ₹1.63 crore. However, compared to Q2 FY25, revenue declined 28.72% and loss increased 91.76%. Operating income improved 26.72% YoY but fell 152.63% QoQ. EPS stood at ₹-1.34, a 27.96% YoY improvement.",
            "Sentiment": "neutral",
            "PublishDate": 1739653172000,
            "Source": "earnings"
        }
    ]
}