{
    "Symbol": "PANAMAPET",
    "ISIN": "INE305C01029",
    "News": [
        {
            "Title": "Panama Petrochem Q3FY26 Results Show Strong Growth",
            "Summary": "Panama Petrochem Limited reported Q3FY26 standalone net profit of ₹34.07 crore, up from ₹30.48 crore YoY. Revenue from operations increased to ₹483.94 crore versus ₹461.02 crore in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770728609492,
            "Source": "co_actions_results"
        },
        {
            "Title": "Panama Petrochem Board Meet Set for Feb 10, 2026",
            "Summary": "Panama Petrochem Limited announces board meeting on February 10, 2026 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769574597546,
            "Source": "co_actions_results"
        },
        {
            "Title": "Panama Petrochem clarifies trading volume surge",
            "Summary": "Panama Petrochem Limited responds to BSE inquiry about increased trading volume, stating it's market-driven with no undisclosed price-sensitive information affecting operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767344211220,
            "Source": "stocks"
        },
        {
            "Title": "Panama Petrochem Gets Approval to Set Up EOU Unit in Maharashtra",
            "Summary": "Panama Petrochem has received approval from the Development Commissioner to establish an Export Oriented Unit (EOU) at Lodha Industrial and Logistic Park II in Maharashtra. This approval enables the company to expand its manufacturing operations with export-focused production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764893296462,
            "Source": "stock"
        },
        {
            "Title": "Panama Petrochem Reports Higher Q2 Profit and Revenue Growth",
            "Summary": "Panama Petrochem reported consolidated net profit of 530 million rupees in Q2, up from 441 million rupees in the same period last year. Revenue increased to 7.7 billion rupees from 6.99 billion rupees year-over-year. EBITDA rose to 687 million rupees compared to 584 million rupees previously, with EBITDA margin improving to 8.9% from 8.4%.",
            "Sentiment": "positive",
            "PublishDate": 1762843357251,
            "Source": "earnings"
        },
        {
            "Title": "Panama Petrochem Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Panama Petrochem announced its Q1 financial results showing revenue of 6.9 billion rupees compared to 6.7 billion rupees in the same period last year. However, the company's consolidated net profit declined to 426 million rupees from 502 million rupees year-over-year. EBITDA also decreased to 553 million rupees from 658 million rupees, with EBITDA margin falling to 7.98% from 9.73% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753943356163,
            "Source": "earnings"
        },
        {
            "Title": "Panama Petrochem Q4 Results: Revenue and Profit Decline, Dividend Declared",
            "Summary": "Panama Petrochem reported its quarterly results. Q4 EBITDA decreased to 594 million rupees from 781 million rupees year-over-year. EBITDA margin fell to 8.55% from 10.55%. Q4 revenue declined to 6.9 billion rupees from 7.4 billion rupees. The company declared a dividend of 3 rupees per share. Q4 consolidated net profit decreased to 443 million rupees from 610 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748243270000,
            "Source": "result"
        },
        {
            "Title": "Panama Petrochem Reports Mixed Q3 Results",
            "Summary": "Panama Petrochem has reported its Q3 financial results. The company's EBITDA increased to 630 million rupees from 562 million rupees year-over-year. However, the EBITDA margin decreased to 8.65% from 10.98% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738305605000,
            "Source": "earnings"
        },
        {
            "Title": "Panama Petrochem Reports Significant Revenue Growth in Q3",
            "Summary": "Panama Petrochem has announced its third-quarter financial results, reporting a substantial increase in revenue. The company's Q3 revenue reached 7.3 billion rupees, compared to 5 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738305592000,
            "Source": "earnings"
        },
        {
            "Title": "Panama Petrochem Reports Increase in Q3 Consolidated Net Profit",
            "Summary": "Panama Petrochem has announced its financial results for the third quarter. The company's consolidated net profit rose to 485 million rupees, up from 414 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738305564000,
            "Source": "earnings"
        },
        {
            "Title": "Panama Petrochem Q2 EBITDA and Margin Update",
            "Summary": "Panama Petrochem reported Q2 EBITDA of 590 million rupees, slightly down from 600 million rupees year-over-year. The company's Q2 EBITDA margin decreased to 8.44% from 10.45% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731394068000,
            "Source": "result"
        },
        {
            "Title": "Panama Petrochem Reports Q2 Revenue Growth",
            "Summary": "Panama Petrochem has announced its second quarter financial results. The company reported revenue of 6.99 billion rupees, compared to 5.7 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731392993000,
            "Source": "result"
        },
        {
            "Title": "Panama Petrochem Reports Q2 Consolidated Net Profit",
            "Summary": "Panama Petrochem announced its Q2 consolidated net profit of 441 million rupees, compared to 469 million rupees in the same quarter last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731392969000,
            "Source": "result"
        }
    ]
}