{
    "Symbol": "PANACEABIO",
    "ISIN": "INE922B01023",
    "News": [
        {
            "Title": "Panacea Biotec Q3 FY26 Results Show Mixed Performance",
            "Summary": "Panacea Biotec reported Q3 FY26 results with standalone revenue of ₹9,931 lakh and net loss of ₹736 lakh. Consolidated operations showed revenue of ₹16,519 lakh with net profit of ₹389 lakh.",
            "Sentiment": "negative",
            "PublishDate": 1770908899283,
            "Source": "co_actions_results"
        },
        {
            "Title": "Panacea Biotec Faces GMP Certification Removal",
            "Summary": "NCPHP issues non-compliance notice to Panacea Biotec's Baddi facility, removes all GMP certifications and halts non-essential product supplies except oncology treatments.",
            "Sentiment": "negative",
            "PublishDate": 1770283809323,
            "Source": "stocks"
        },
        {
            "Title": "Panacea Biotec shares jump 7% on dengue vaccine news",
            "Summary": "Panacea Biotec shares gained 7% after completing Phase III enrollment for DengiAll dengue vaccine with 10,335 participants. Company targets 2027 market launch for India's first indigenous single-dose dengue vaccine.",
            "Sentiment": "positive",
            "PublishDate": 1767792739783,
            "Source": "stocks"
        },
        {
            "Title": "Panacea Biotec Receives ₹9.38 Cr Income Tax Demand",
            "Summary": "Panacea Biotec received three income tax demand orders totaling ₹9.38 crores for alleged under-reporting of income across assessment years 2017-18, 2020-21, and 2021-22. Company plans to appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766753606886,
            "Source": "stocks"
        },
        {
            "Title": "Panacea Biotec Enhances UNICEF Vaccine Contract",
            "Summary": "Panacea Biotec announces significant enhancement to UNICEF vaccine supply contract with value increases and new awards, while Taro Pharmaceutical recalls antifungal medication in US.",
            "Sentiment": "positive",
            "PublishDate": 1766715475156,
            "Source": "stocks"
        },
        {
            "Title": "Panacea Biotec gets $8.9M additional UNICEF orders",
            "Summary": "Panacea Biotec receives $8.9 million in additional vaccine orders from UNICEF, including contract value increases for 2026-2027 and new awards for pentavalent and polio vaccines.",
            "Sentiment": "positive",
            "PublishDate": 1766590589755,
            "Source": "stocks"
        },
        {
            "Title": "Panacea Biotec Gets UNICEF Contract Boost Worth $8.93M",
            "Summary": "UNICEF amends Panacea Biotec contract, increasing vaccine supply value by $8.93 million across 2026-2027, including new $3.68M award for Easyfive-TT vaccine supply.",
            "Sentiment": "positive",
            "PublishDate": 1766576771755,
            "Source": "co_actions_results"
        },
        {
            "Title": "Panacea Biotec CFO Devender Gupta Steps Down",
            "Summary": "Devender Gupta has stepped down from his position as Chief Financial Officer of Panacea Biotec. The leadership change affects the pharmaceutical company's senior management structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764161507748,
            "Source": "corporate_governance"
        },
        {
            "Title": "Panacea Biotec Reports Widened Q2 Net Loss and Revenue Decline",
            "Summary": "Panacea Biotec reported a consolidated net loss of 139 million rupees for Q2, significantly higher than the 48 million rupees loss in the same period last year, while revenue declined to 1.4 billion rupees from 1.47 billion rupees year-over-year. The company's EBITDA shifted from a gain of 70 million rupees in the prior year quarter to a loss of 178 million rupees, indicating deteriorating operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1763337247511,
            "Source": "earnings"
        },
        {
            "Title": "Panacea Biotec Publishes Unaudited Financial Results for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Panacea Biotec Limited published its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025 in Business Standard (English) and Desh Sewak (Punjabi) newspapers on November 15, 2025. The company fulfilled its compliance obligations under SEBI Listing Regulations by notifying stock exchanges BSE and NSE about the newspaper publication of its financial results extract.",
            "Sentiment": "neutral",
            "PublishDate": 1763192295274,
            "Source": "earnings"
        },
        {
            "Title": "Panacea Biotec Reports Q2 Loss as EBITDA Swings Negative",
            "Summary": "Panacea Biotec posted a Q2 EBITDA loss of 178 million rupees compared to a 70 million rupee gain in the same period last year, while consolidated net loss widened to 139 million rupees from 48 million rupees year-over-year. The pharmaceutical company's quarterly revenue declined to 1.4 billion rupees from 1.47 billion rupees, reflecting operational challenges across key financial metrics.",
            "Sentiment": "negative",
            "PublishDate": 1763132917137,
            "Source": "earnings"
        },
        {
            "Title": "Panacea Biotec Designates Bal Krishan Saini as Senior Management Personnel at Subsidiary PBPL",
            "Summary": "Panacea Biotec Limited has designated Mr. Bal Krishan Saini, Senior Vice President-Head Pharma Plant Operations Corporate Project and Engineering Head, as Senior Management Personnel of its wholly owned subsidiary Panacea Biotec Pharma Limited effective November 13, 2025. Saini brings over 30 years of experience in engineering, projects and operations with expertise in USFDA/MHRA/WHO-compliant facilities, having previously served as Director (VP)-Operations at Emcure Pharmaceuticals Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1763042355925,
            "Source": "corporate_governance"
        },
        {
            "Title": "Panacea Biotec Secures $4.75 Million Vaccine Supply Contract for 2026-2027",
            "Summary": "Panacea Biotec has secured a $4.75 million order to supply Easyfive-TT vaccine for the period 2026-2027 under a long-term contract arrangement. The deal represents a significant revenue opportunity for the pharmaceutical company's vaccine business segment.",
            "Sentiment": "positive",
            "PublishDate": 1762864127827,
            "Source": "stock"
        },
        {
            "Title": "Panacea Biotec Files Defense and Counterclaims in $7 Million COVID-19 Technology Transfer Arbitration",
            "Summary": "Panacea Biotec has filed defense and counterclaims in a $7 million arbitration dispute with Russia's Human Vaccine LLC at the London Court of International Arbitration (LCIA). The dispute centers on COVID-19 technology transfer issues between the two companies.",
            "Sentiment": "negative",
            "PublishDate": 1762430240485,
            "Source": "stock"
        },
        {
            "Title": "Panacea Biotec Secures ₹127 Crore Government Order for Polio Vaccines",
            "Summary": "Panacea Biotec received a ₹127.20 crore order from the Central Medical Services Society under the Ministry of Health and Family Welfare for supplying bivalent oral polio vaccine. The domestic order will be delivered over 90 to 480 days starting from October 8. Additionally, UNICEF awarded the company a long-term agreement worth approximately $35.65 million (₹315 crore) to supply polio vaccines from April 2026 to March 2030, with orders for Q2 CY2026 and CY2027 to be executed by CY2027. The company's shares traded marginally higher at ₹432.05.",
            "Sentiment": "positive",
            "PublishDate": 1760000454650,
            "Source": "order&deals"
        },
        {
            "Title": "Panacea Biotec Secures ₹127.20 Crore Order for Bivalent Oral Polio Vaccine",
            "Summary": "Panacea Biotec has received an order worth ₹127.20 crore from CMSS for bivalent oral polio vaccine. The delivery will be completed in stages over a period ranging from 90 to 480 days.",
            "Sentiment": "positive",
            "PublishDate": 1759992646216,
            "Source": "order&deals"
        },
        {
            "Title": "Panacea Biotec Secures ₹315 Crore Order",
            "Summary": "Panacea Biotec has secured an order worth ₹315 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759482174607,
            "Source": "order&deals"
        },
        {
            "Title": "Panacea Biotec Subsidiary Launches Toxin-Free Baby Care Products in India",
            "Summary": "Panacea Biotec's wholly-owned subsidiary, Panacea Biotec Pharma Ltd., has launched two new products for the domestic market: 'NikoMom', described as India's first 100% toxin-free baby care line, and 'Staart Prime', an infant milk substitute. The products are being introduced specifically for the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1758719607655,
            "Source": "stock"
        },
        {
            "Title": "Panacea Biotec Reports Quarterly Results with Revenue Growth and Announces 41st AGM",
            "Summary": "Panacea Biotec announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported total income from operations of Rs 11,225 lakh compared to Rs 5,688 lakh in the same quarter last year, representing significant growth. However, the company recorded a net loss after tax of Rs 670 lakh for the quarter. On a consolidated basis, total income from operations was Rs 16,670 lakh versus Rs 11,572 lakh in the previous year quarter, while the company posted a net profit after tax of Rs 396 lakh. The consolidated results included exceptional income of Rs 1,132 lakh, which comprised Rs 858 lakh from a settlement agreement with Apotex Inc. and Rs 274 lakh from deferred consideration related to the sale of domestic pharmaceutical brands. The company operates in two segments: Vaccines and Formulations. The Board also announced that the 41st Annual General Meeting will be held on September 30, 2025, through video conferencing, with book closure from September 26-30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755180464680,
            "Source": "earnings"
        },
        {
            "Title": "Panacea Biotec Reports Q1 Net Profit of 41M Rupees, Reversing Previous Year's Loss",
            "Summary": "Panacea Biotec reported quarterly consolidated net profit of 41 million rupees, compared to a loss of 158 million rupees in the same period last year. The company's quarterly revenue increased to 1.7 billion rupees from 1.16 billion rupees year-over-year. Loss before tax narrowed to 48 million rupees versus a loss of 198 million rupees in the previous year. The company recorded an exceptional item of 113 million rupees during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755175231620,
            "Source": "earnings"
        },
        {
            "Title": "Panacea Biotec Gets Exchange Approval to Reclassify Three Jain Family Members from Promoter to Public Category",
            "Summary": "Panacea Biotec Limited received approval from BSE and NSE to reclassify Mrs. Sunanda Jain, Mr. Sumit Jain, and Ms. Radhika Jain from the Promoters and Promoters' Group category to the Public category of shareholders. The company had applied for this reclassification on October 16, 2024, and received approval on July 29, 2025. Despite this reclassification, there will be no change in the aggregate shareholding of Promoters and Promoters' Group as none of the outgoing members hold any shares in the company. The promoter holding remains at 4,43,94,190 shares (72.48%) and public holding stays at 1,68,56,556 shares (27.52%) both pre and post-reclassification.",
            "Sentiment": "neutral",
            "PublishDate": 1753791935754,
            "Source": "corporate_action"
        },
        {
            "Title": "Panacea Biotec Faces New GST Demand of 70.3 Million Rupees",
            "Summary": "Panacea Biotec has received a new Goods and Services Tax (GST) demand of 70.3 million rupees. The news indicates a financial obligation for the company related to tax liabilities.",
            "Sentiment": "negative",
            "PublishDate": 1752233973000,
            "Source": "default"
        },
        {
            "Title": "Panacea Biotec: India's First Dengue Vaccine Nears Phase 3 Trial Completion",
            "Summary": "Panacea Biotec and ICMR's indigenous dengue vaccine Phase 3 trial enrollment is 70% complete, expected to finish by October 2025. The single-dose vaccine shows promise in safety and immunogenicity. Two-year follow-up will continue until 2027, after which market authorization application may be submitted.",
            "Sentiment": "positive",
            "PublishDate": 1751547366000,
            "Source": "normal_news"
        },
        {
            "Title": "US Halts Support for Global Vaccine Alliance Gavi, Potentially Impacting Panacea Biotec",
            "Summary": "The US Health Secretary has announced a halt to support for the Global Vaccine Alliance Gavi. This decision could potentially affect Panacea Biotec's business, as the company may have connections to or rely on Gavi for vaccine-related activities.",
            "Sentiment": "negative",
            "PublishDate": 1750919923000,
            "Source": "default"
        },
        {
            "Title": "Panacea Biotech's Emulsipan Adjuvant Added to CEPI Library",
            "Summary": "Panacea Biotech has announced that its Emulsipan adjuvant has been included in the CEPI (Coalition for Epidemic Preparedness Innovations) Adjuvant Library. The company is also moving forward with the commercialization of its indigenously developed adjuvants.",
            "Sentiment": "positive",
            "PublishDate": 1748929609000,
            "Source": "default"
        },
        {
            "Title": "Panacea Biotec Reports Q4 Financial Results",
            "Summary": "Panacea Biotec announced its Q4 financial results. The company reported a consolidated net loss of 19 million rupees, compared to a loss of 14 million rupees in the same quarter last year. However, it showed improvement from the previous quarter with a profit of 45 million rupees. Q4 revenue stood at 1.3 billion rupees, down from 1.36 billion rupees in the year-ago period.",
            "Sentiment": "neutral",
            "PublishDate": 1748616254000,
            "Source": "result"
        },
        {
            "Title": "Panacea Biotec Secures $14.95 Million Order",
            "Summary": "Panacea Biotec has won an order worth $14.95 million (approximately Rs. 127 crore). This significant contract represents a positive development for the company's business operations and financial outlook.",
            "Sentiment": "positive",
            "PublishDate": 1745402541000,
            "Source": "default"
        },
        {
            "Title": "Panacea Biotec Reports Profitable Q3 Results",
            "Summary": "Panacea Biotec has released its Q3 financial results, showing a significant turnaround. The company reported a consolidated net profit of 45 million rupees, compared to a loss of 22 million rupees in the same quarter last year. Revenue increased to 1.6 billion rupees from 1.5 billion rupees year-over-year. Profit before tax (PBT) improved to 16 million rupees, reversing a loss of 44 million rupees in the previous year. The company also reported an exceptional item of 28 million rupees, consistent with the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739751440000,
            "Source": "earnings"
        },
        {
            "Title": "Panacea Biotec Reports Profit in Q3, Reverses Previous Year's Loss",
            "Summary": "Panacea Biotec has reported a profit before tax (PBT) of 16 million rupees in the third quarter, compared to a loss of 44 million rupees in the same period last year. The company also recorded an exceptional item of 28 million rupees, which remained unchanged from the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739541831000,
            "Source": "earnings"
        },
        {
            "Title": "Panacea Biotec Reports Significant EBITDA Improvement in Q3",
            "Summary": "Panacea Biotec has reported a substantial improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a gain of 80 million rupees, compared to a loss of 2 million rupees in the same period last year. Additionally, the EBITDA margin for Q3 stood at 4.87%.",
            "Sentiment": "positive",
            "PublishDate": 1739541825000,
            "Source": "earnings"
        },
        {
            "Title": "Panacea Biotec Reports Profit in Q3 FY2024",
            "Summary": "Panacea Biotec has reported a consolidated net profit of 45 million rupees in the third quarter, compared to a loss of 22 million rupees in the same period last year. The company's revenue increased to 1.6 billion rupees from 1.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739541819000,
            "Source": "earnings"
        },
        {
            "Title": "Panacea Biotec: Bombay HC Quashes 18% GST on Leasehold Land Assignment",
            "Summary": "Bombay High Court ruled against applying 18% GST on the assignment of leasehold land by Panacea Biotec to Mankind Pharma. The court quashed the GST demand, directing authorities to reconsider the case while taking into account the petitioner's submissions and a similar Gujarat HC ruling.",
            "Sentiment": "positive",
            "PublishDate": 1737656162000,
            "Source": "order&deals"
        },
        {
            "Title": "Panacea Biotec: Shares Rise on Launch of Baby Diaper Brand",
            "Summary": "Panacea Biotec's stock jumped over 5% after announcing the launch of 'NikoMom', a new diaper and wipes brand for the domestic market, with plans for international expansion. The shares closed at Rs 443.20 on NSE, up from the day's high of Rs 450.85.",
            "Sentiment": "positive",
            "PublishDate": 1735908193000,
            "Source": "corporate_action"
        },
        {
            "Title": "Panacea Biotec Secures $14.95 Million UNICEF Contract for Polio Vaccine",
            "Summary": "Panacea Biotec has been awarded a contract by UNICEF worth $14.95 million (approximately Rs 1.27 billion) for the supply of 115 million doses of Bivalent Oral Polio Vaccine (BOPV) in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1735172424000,
            "Source": "order&deals"
        },
        {
            "Title": "Panacea Biotec Secures $14.95 Million UNICEF Contract for Polio Vaccine",
            "Summary": "Panacea Biotec has been awarded a contract by UNICEF worth $14.95 million (approximately Rs 1.27 billion) for the supply of 115 million doses of bivalent oral polio vaccine (bOPV) in 2025. This significant order demonstrates the company's continued role in global polio eradication efforts and its manufacturing capabilities in the vaccine sector.",
            "Sentiment": "positive",
            "PublishDate": 1735043028000,
            "Source": "order&deals"
        },
        {
            "Title": "Panacea Biotec Reports Improved Q2 EBITDA",
            "Summary": "Panacea Biotec has reported a significant improvement in its Q2 EBITDA, turning a loss of 35.6 million rupees in the previous year into a gain of 70 million rupees. The company's EBITDA margin for Q2 stands at 4.75%.",
            "Sentiment": "positive",
            "PublishDate": 1731495096000,
            "Source": "result"
        },
        {
            "Title": "Panacea Biotec Reports Q2 Revenue Growth",
            "Summary": "Panacea Biotec, a pharmaceutical company, has reported its second quarter revenue for the current fiscal year. The company's revenue reached 1.47 billion rupees, showing a slight increase from 1.43 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1731495070000,
            "Source": "result"
        },
        {
            "Title": "Panacea Biotec Reports Q2 Profit Turnaround",
            "Summary": "Panacea Biotec has reported a consolidated net profit of 48 million rupees in Q2, compared to a loss of 83 million rupees in the same quarter last year. However, this represents a decrease from the previous quarter's loss of 158 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731495038000,
            "Source": "result"
        },
        {
            "Title": "Panacea Biotec to Consider $20M Fundraising via ECB",
            "Summary": "Panacea Biotec has scheduled a board meeting on November 13 to discuss raising funds up to $20 million through External Commercial Borrowings (ECB) from the U.S. International Development Finance Corporation (DFC).",
            "Sentiment": "positive",
            "PublishDate": 1731070172000,
            "Source": "corporate_action"
        },
        {
            "Title": "Panacea Biotec's Dengue Vaccine Progresses in Phase 3 Trials",
            "Summary": "<p><span class='neutral'>Panacea Biotec</span>, in collaboration with <span class='neutral'>ICMR</span>, is conducting <b>Phase 3 trials</b> of their <span class='positive'>dengue vaccine</span> across <b>19 sites</b> in India. The trials involve over <b>10,000 adult participants</b>, indicating <span class='positive'>significant progress</span> in the vaccine's development.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728620907000,
            "Source": "corporate_action"
        },
        {
            "Title": "Panacea Biotec: Dengue Vaccine Launch Targeted Within 2-3 Years",
            "Summary": "<p>Panacea Biotec is conducting <span class='positive'>phase 3 trials</span> for India's <span class='positive'>first dengue vaccine</span>, aiming to immunize 10,000 adults by March 2025. The company expects to <span class='positive'>launch the vaccine</span> in India and other countries within two years, pending regulatory approvals. Additionally, Panacea has <span class='positive'>entered the children's nutrition market</span> with a new range of supplements and aims to <span class='neutral'>break even</span> in this segment by March 2025.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728482229000,
            "Source": "normal_news"
        }
    ]
}