{
    "Symbol": "PARADEEP",
    "ISIN": "INE088F01024",
    "News": [
        {
            "Title": "Paradeep Phosphates Q3 FY26 Results & Board Changes",
            "Summary": "Paradeep Phosphates reports Q3 FY26 financial results with profit of ₹182.06 crores. Board approves re-appointment of Managing Director N Suresh Krishnan and appointment of K K Rajeev Nambiar as Joint Managing Director.",
            "Sentiment": "positive",
            "PublishDate": 1770039462878,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paradeep Phosphates Q3FY26 Results Call on Feb 4",
            "Summary": "Paradeep Phosphates Limited announces conference call scheduled for February 4, 2026 at 11:00 AM to discuss Q3FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769692611846,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paradeep Phosphates Gets Credit Rating Upgrade from ICRA",
            "Summary": "ICRA Limited upgraded Paradeep Phosphates' credit ratings across multiple instruments totaling ₹17,500.00 crores, with long-term facilities moving to [ICRA]AA- Stable from [ICRA]A+ rating watch.",
            "Sentiment": "positive",
            "PublishDate": 1769514902593,
            "Source": "stocks"
        },
        {
            "Title": "Paradeep Phosphates faces customs seizure of urea",
            "Summary": "Paradeep Phosphates discloses seizure of 25,000 MTs of Technical Grade Urea worth Rs.103.30 crores by Customs Department over alleged Biuret content violations in imported goods.",
            "Sentiment": "negative",
            "PublishDate": 1769322792393,
            "Source": "stocks"
        },
        {
            "Title": "Paradeep Phosphates Board Approves MOA Amendments",
            "Summary": "Paradeep Phosphates Limited's board approved amendments to its Memorandum of Association on December 31, 2025, including addition of power generation and distribution as a new business object.",
            "Sentiment": "neutral",
            "PublishDate": 1767184535348,
            "Source": "stocks"
        },
        {
            "Title": "Zuari Industries Receives 5.72 Lakh Shares in Paradeep Phosphates Through MCFL Merger Exchange",
            "Summary": "Zuari Industries Limited was allotted 5,72,582 equity shares of Paradeep Phosphates Limited on December 3, 2025, in exchange for its 3,06,194 shares held in Mangalore Chemicals & Fertilizers Limited which merged with PPL. The share exchange was executed as per the composite scheme of arrangement among MCFL, PPL and their shareholders, giving Zuari Industries a 0.0552% stake in the merged entity.",
            "Sentiment": "neutral",
            "PublishDate": 1765005575245,
            "Source": "corporate_action"
        },
        {
            "Title": "Zuari Maroc Phosphates Receives 5.43 Crore Shares in Paradeep Phosphates Through Merger Allotment",
            "Summary": "Zuari Maroc Phosphates Private Limited was allotted 5,42,99,190 equity shares of Paradeep Phosphates Limited on December 3, 2025, as part of the merger with Mangalore Chemicals Fertilizers Limited. The allotment reduced Zuari Maroc's shareholding in Paradeep Phosphates from 57.20% to 50.22% due to the increased share capital following the composite scheme of arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1765000134641,
            "Source": "corporate_action"
        },
        {
            "Title": "Adventz Finance Acquires 0.78% Stake in Paradeep Phosphates Through Merger-Related Share Allotment",
            "Summary": "Adventz Finance Private Limited acquired 81,35,175 equity shares (0.78% stake) in Paradeep Phosphates Limited on December 3, 2025, through share allotment under a composite scheme of arrangement. The acquisition resulted from the merger of Mangalore Chemicals Fertilizers Limited with Paradeep Phosphates, where Adventz Finance's existing 43,50,361 shares were exchanged based on the stipulated share exchange ratio.",
            "Sentiment": "neutral",
            "PublishDate": 1764999888173,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Allots Shares to Promoter Group Members Under Merger Scheme",
            "Summary": "Paradeep Phosphates Limited allotted 3,74,000 equity shares to Shradha Agarwala and 2,80,500 shares to Gaurav Agarwala on December 3, 2025, as part of the share exchange ratio under the merger with Mangalore Chemicals Fertilizers Limited. The allotments were made against their existing holdings in the merged entity, with both promoter group members now holding 0.04% and 0.03% respectively of Paradeep Phosphates' total paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764999655963,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Issues Shares to Promoter Group Members Following Mangalore Chemicals Merger",
            "Summary": "Paradeep Phosphates Limited allotted 26,22,545 equity shares to Akshay Poddar and 2,93,874 shares to Jyotsna Poddar on December 3, 2025, as part of the share exchange ratio from the merger with Mangalore Chemicals Fertilizers Limited. The allotments were made against their existing holdings in the merged entity based on the record date of October 31, 2025, with their combined stake representing 0.28% of Paradeep Phosphates' total paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764999433538,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Allots 22.16 Crore Equity Shares Under Merger Scheme with Mangalore Chemicals",
            "Summary": "Paradeep Phosphates Limited's Board approved allotment of 22,16,23,331 equity shares of INR 10 each to shareholders of Mangalore Chemicals Fertilizers Limited under a composite scheme of arrangement with share exchange ratio of 187:100. The allotment increased Paradeep Phosphates' paid-up share capital from INR 816.35 crore to INR 1,037.97 crore, comprising 10.38 crore equity shares, with the new shares to be listed on BSE and NSE after necessary approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1764745769200,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Announces ₹3,600 Crore Capacity Expansion and MCFL Merger",
            "Summary": "Paradeep Phosphates has announced a ₹3,600 crore investment plan to increase its capacity by 1.0 MMT. Additionally, the company's merger with MCFL has resulted in a 23% capacity boost, bringing total capacity to 3.7 MMT.",
            "Sentiment": "positive",
            "PublishDate": 1762507784585,
            "Source": "stock"
        },
        {
            "Title": "Paradeep Phosphates Reports Strong Q2 Results, Announces Major Capacity Expansion and Board Changes",
            "Summary": "Paradeep Phosphates Limited reported quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs 6,872.20 crores and profit after tax of Rs 341.94 crores. The company announced two major capacity expansion projects: a fully integrated granulation plant at Paradeep site with estimated capex of Rs 2,450 crores and a Phosphoric Sulphuric Acid plant at Mangalore site with estimated capex of Rs 1,150 crores, both expected to be completed within 2.5 years. The board appointed Mr. Akshay Poddar as Additional Director (Non-Executive) and Vice Chairman, and Mrs. Ruchira Kamboj as Additional Director (Non-Executive) in the Independent Director category for a 5-year term, both appointments subject to member approval. The company completed a scheme of arrangement with Mangalore Chemicals and Fertilizers Limited, which was approved by the National Company Law Tribunal with an appointed date of April 1, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1762435801928,
            "Source": "earnings"
        },
        {
            "Title": "Paradeep Phosphates Reports 49% Jump in Q2 Net Profit to 3.42 Billion Rupees",
            "Summary": "Paradeep Phosphates reported net profit of 3.42 billion rupees in Q2, up from 2.3 billion rupees in the same period last year. Revenue increased significantly to 68.72 billion rupees compared to 38.4 billion rupees year-over-year. EBITDA rose to 6.57 billion rupees from 5.07 billion rupees, though EBITDA margin declined to 9.56% from 10.98% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762435415523,
            "Source": "earnings"
        },
        {
            "Title": "SBI Mutual Fund's Stake in Paradeep Phosphates Decreases to 3.96% Following Composite Scheme",
            "Summary": "SBI Mutual Fund's shareholding in Paradeep Phosphates Limited decreased by 2% to 3.9626% following a composite scheme of arrangement between Mangalore Chemicals & Fertilizers Limited and Paradeep Phosphates Limited. The mutual fund was allotted 3,130,443 shares of Paradeep Phosphates on October 31, 2025, bringing its total holding to 41,130,443 shares. The previous disclosed holding was 6.3912% of the paid-up share capital. The equity share capital of Paradeep Phosphates increased from Rs 816.35 crore to Rs 1,037.97 crore after the arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1762402650785,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Appoints Rahul Dravid as Brand Ambassador",
            "Summary": "Paradeep Phosphates has appointed Rahul Dravid as its brand ambassador to promote innovative and sustainable farming solutions.",
            "Sentiment": "positive",
            "PublishDate": 1762329568746,
            "Source": "stock"
        },
        {
            "Title": "Paradeep Phosphates Completes Merger with Mangalore Chemicals & Fertilizers",
            "Summary": "Paradeep Phosphates Limited announced the completion of its merger with Mangalore Chemicals & Fertilizers Limited, effective October 16, 2025. The board set October 31, 2025 as the record date for determining shareholders eligible to receive equity shares in the merged entity. Under the merger terms, shareholders of Mangalore Chemicals & Fertilizers will receive 187 fully paid-up equity shares of INR 10 each in Paradeep Phosphates for every 100 shares held in the transferor company. Mangalore Chemicals & Fertilizers has been dissolved without winding up following the completion of the amalgamation scheme.",
            "Sentiment": "positive",
            "PublishDate": 1760611149717,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Announces Effective Date for Merger with Mangalore Chemicals & Fertilizers",
            "Summary": "Paradeep Phosphates Limited announced that the Effective Date 1 for its composite scheme of arrangement with Mangalore Chemicals & Fertilizers Limited is October 13, 2025. Both companies have filed certified copies of sanction orders from the National Company Law Tribunals in Cuttack and Bengaluru with their respective Registrars of Companies. The scheme involves the amalgamation of Mangalore Chemicals & Fertilizers (Transferor Company) with Paradeep Phosphates (Transferee Company), which will be completed on Effective Date 2, scheduled for three days after Effective Date 1. The company will make appropriate disclosures when Effective Date 2 occurs.",
            "Sentiment": "positive",
            "PublishDate": 1760331395835,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Commissions ₹510 Crore Sulphuric Acid Plant",
            "Summary": "Paradeep Phosphates has successfully commissioned a 1500 Mtpd sulphuric acid plant at Paradeep with a total investment of ₹510 crores. The new facility enhances the company's captive production capabilities, reduces import dependency, and improves operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1759104746241,
            "Source": "stock"
        },
        {
            "Title": "Paradeep Phosphates Commissions 1500 MTPD Sulphuric Acid Plant, Boosting Capacity to 5700 MTPD",
            "Summary": "Paradeep Phosphates Limited has successfully commissioned a new 1500 MTPD Sulphuric Acid Plant at its Paradeep facility in Odisha. The plant increases the company's total sulphuric acid capacity from 4200 MTPD to 5700 MTPD. The project required an investment of approximately Rs. 510 crores, financed through internal accruals and term loans. The enhanced capacity will boost captive production of sulphuric acid, reduce import dependency, and ensure uninterrupted availability of raw materials for phosphoric acid and fertilizer manufacturing. The plant will also generate around 150 million units of non-fossil fuel energy annually from process waste heat, supporting the company's sustainability goals while improving cost efficiency and operating margins.",
            "Sentiment": "positive",
            "PublishDate": 1758971207032,
            "Source": "stock"
        },
        {
            "Title": "NCLT Approves Amalgamation of Mangalore Chemicals & Fertilizers with Paradeep Phosphates",
            "Summary": "The National Company Law Tribunal, Cuttack Bench has sanctioned the scheme of arrangement for amalgamation of Mangalore Chemicals & Fertilizers Limited with Paradeep Phosphates Limited. Under the approved scheme, all assets and liabilities of Mangalore Chemicals will transfer to Paradeep Phosphates with effect from April 1, 2024. Paradeep Phosphates will issue 187 equity shares for every 100 shares of Mangalore Chemicals as per the share exchange ratio. The scheme received approval from 778 equity shareholders representing 99.9984% shareholding value and 79 unsecured creditors representing 100% credit value. Both BSE and NSE issued no-objection certificates for the arrangement. The scheme will become effective upon filing certified copies of sanction orders with the Registrar of Companies. Mangalore Chemicals will be dissolved without winding up following the amalgamation.",
            "Sentiment": "positive",
            "PublishDate": 1758903568948,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Secures 75,000 MTPA Green Ammonia Allocation at ₹55.75/kg",
            "Summary": "Paradeep Phosphates Limited has been allocated 75,000 metric tonnes per annum of Green Ammonia through the first auction conducted by the Solar Energy Corporation of India under the National Green Hydrogen Mission's Strategic Interventions for Green Hydrogen Transition Scheme. The auction achieved a price discovery of ₹55.75 per kilogram (approximately USD 641 per metric tonne) for Green Ammonia. The company's Paradeep unit received this allocation, which represents a significant step in the company's decarbonisation and clean energy transition roadmap.",
            "Sentiment": "positive",
            "PublishDate": 1753970075648,
            "Source": "stock"
        },
        {
            "Title": "Paradeep Phosphates Promoter Zuari Maroc Phosphates Enters Inter-se Agreement with Shareholders",
            "Summary": "Zuari Maroc Phosphates Private Limited, the promoter of Paradeep Phosphates Limited, has entered into an inter-se agreement dated July 29, 2025, with Zuari Agro Chemicals Limited and OCP S.A. The agreement establishes that Zuari Maroc Phosphates will be the sole entity on behalf of the promoter group for any future acquisition of additional securities or voting rights in Paradeep Phosphates. The purpose is to ensure Zuari Maroc Phosphates continues to hold more than 50% of share capital and maintains control of the company post-effectiveness of a scheme of arrangement between Paradeep Phosphates and Mangalore Chemicals and Fertilizers Limited. The agreement becomes effective from the date of effectiveness of the scheme. There will be no impact on the management or control of Paradeep Phosphates as it will continue to be majority held and controlled by Zuari Maroc Phosphates.",
            "Sentiment": "neutral",
            "PublishDate": 1753886215971,
            "Source": "corporate_governance"
        },
        {
            "Title": "Paradeep Phosphates Reports Strong Q1 Performance with 3x EBITDA Growth and 58% Revenue Jump",
            "Summary": "Paradeep Phosphates reported significant financial growth with EBITDA increasing three times and revenue jumping 58% in Q1 FY26. The company is targeting margin expansion and long-term growth through backward integration, MCFL merger, and product diversification strategies.",
            "Sentiment": "positive",
            "PublishDate": 1753798392513,
            "Source": "earnings"
        },
        {
            "Title": "Paradeep Phosphates Shares Jump 17.5% to 52-Week High on Strong Quarterly Results",
            "Summary": "Paradeep Phosphates shares surged 17.5% to reach a new 52-week high of Rs 234.05 following strong quarterly earnings. The fertilizer manufacturer reported consolidated net profit of Rs 255.85 crore, up 59.9% from Rs 160.03 crore in the same quarter last year. Revenue from operations increased 7.4% to Rs 3,754 crore from Rs 3,494 crore. EBITDA rose 34.2% to Rs 465.87 crore from Rs 347.07 crore, with EBITDA margin expanding by 248 basis points to 12.4% from 9.9%. The company is India's second largest private sector phosphatic company, manufacturing non-urea fertilizers including DAP and various NPK grades.",
            "Sentiment": "positive",
            "PublishDate": 1753778165490,
            "Source": "earnings"
        },
        {
            "Title": "Paradeep Phosphates Reports Strong Q1 Growth with Net Profit Surging to 2.56B Rupees",
            "Summary": "Paradeep Phosphates delivered robust quarterly performance with net profit jumping to 2.56 billion rupees compared to 63 million rupees in the same period last year. Revenue increased significantly to 37.54 billion rupees from 23.8 billion rupees year-over-year. The company's EBITDA rose to 4.66 billion rupees versus 1.47 billion rupees previously, while EBITDA margin expanded to 12.41% from 6.19% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1753705809689,
            "Source": "earnings"
        },
        {
            "Title": "Paradeep Phosphates Schedules Q1 FY26 Results Conference Call for July 30, 2025",
            "Summary": "Paradeep Phosphates Limited has scheduled a conference call for analysts and investors on July 30, 2025, at 11:30 AM to discuss Q1 FY26 results. The call will be hosted by Antique Stock Broking Limited and will feature key management representatives including Managing Director and CEO Suresh Krishnan, COO Rajeev Nambiar, CFO Bijoy Biswal, and other senior executives. The company has provided dial-in details for domestic and international participants, with toll-free numbers available for multiple countries including the US, UK, Germany, Japan, and others.",
            "Sentiment": "neutral",
            "PublishDate": 1753434201985,
            "Source": "earnings"
        },
        {
            "Title": "Court Orders Release of 535 Million Rupees Subsidy to Paradeep Phosphates",
            "Summary": "Paradeep Phosphates has announced that a court has ordered the release of a 535 million rupees subsidy to the company. No further details about the court case or the nature of the subsidy were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747396347000,
            "Source": "default"
        },
        {
            "Title": "Paradeep Phosphates Reports Strong Q4 FY23 Results",
            "Summary": "Paradeep Phosphates has announced its Q4 FY23 results, showing significant year-over-year growth. The company's net profit increased to 1.6 billion rupees, up from 203 million rupees in the same quarter last year. Revenue also saw a substantial rise to 34.9 billion rupees, compared to 22.4 billion rupees in Q4 FY22. Additionally, the company has declared a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746576829000,
            "Source": "default"
        },
        {
            "Title": "Paradeep Phosphates Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Paradeep Phosphates has announced a dividend of 1 rupee per equity share. The company's Q4 EBITDA increased to 3.5 billion rupees from 1.5 billion year-over-year, with EBITDA margin improving to 9.93% from 6.6%. Q4 net profit rose significantly to 1.6 billion rupees from 203 million year-over-year and 1.58 billion quarter-over-quarter. Revenue for Q4 grew to 34.9 billion rupees from 22.4 billion year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746536293000,
            "Source": "result"
        },
        {
            "Title": "Paradeep Phosphates to Consider Q4 Results on May 6",
            "Summary": "Paradeep Phosphates Limited has announced that it will consider its fourth quarter financial results on May 6. This indicates the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1745581938000,
            "Source": "default"
        },
        {
            "Title": "Paradeep Phosphates Resumes Production at Ammonia and Urea Plants",
            "Summary": "Paradeep Phosphates Limited has announced the resumption of production at its ammonia and urea plants. This indicates that the company has overcome any previous operational challenges or maintenance issues that may have caused a temporary halt in production.",
            "Sentiment": "positive",
            "PublishDate": 1742463927000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Shuts Down Ammonia and Urea Plants in Goa",
            "Summary": "Paradeep Phosphates Limited has announced the closure of its ammonia and urea production facilities located in Goa. This action represents a significant operational change for the company, potentially impacting its production capacity and business operations in the region.",
            "Sentiment": "negative",
            "PublishDate": 1741771712000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Reports Strong Q3 Financial Results",
            "Summary": "Paradeep Phosphates has announced its financial results for the third quarter. The company's net profit increased to 1.59 billion rupees, up from 1.09 billion rupees in the same period last year. Revenue also saw significant growth, rising to 41.05 billion rupees from 25.9 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738627970000,
            "Source": "earnings"
        },
        {
            "Title": "Paradeep Phosphates Reports Mixed Q3 Financial Results",
            "Summary": "Paradeep Phosphates has reported its Q3 financial results. The company's EBITDA increased to 3.36 billion rupees from 2.81 billion rupees year-over-year. However, the EBITDA margin decreased to 8.19% from 10.83% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738590697000,
            "Source": "earnings"
        },
        {
            "Title": "Paradeep Phosphates Reports Strong Q3 Financial Results",
            "Summary": "Paradeep Phosphates has announced its financial results for the third quarter. The company's net profit increased to 1.59 billion rupees, up from 1.09 billion rupees in the same period last year. Revenue also saw significant growth, rising to 41.05 billion rupees from 25.9 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738590691000,
            "Source": "earnings"
        },
        {
            "Title": "Paradeep Phosphates Signs MoU for ₹40 Billion Investment in Odisha",
            "Summary": "Paradeep Phosphates has signed a Memorandum of Understanding (MoU) with the Government of Odisha for a significant investment of ₹40 billion over the next 5 years. The investment aims to increase the company's fertilizer production capacity. This expansion is expected to generate 100-150 direct jobs and 700-1,000 indirect employment opportunities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1738284190000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Signs MOU for 40 Billion Rupee Investment in Odisha",
            "Summary": "Paradeep Phosphates has signed a Memorandum of Understanding (MOU) with the Government of Odisha for a significant investment of 40 billion rupees. The investment, spread over a period of 5 years, aims to increase the company's fertilizer production capacity. This expansion is expected to generate 100-150 direct jobs and 700-1000 indirect employment opportunities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1738241202000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Resumes Production at Ammonia and Urea Plants",
            "Summary": "Paradeep Phosphates Limited has announced the resumption of production at its ammonia and urea plants. This indicates that the company has overcome any previous operational issues or maintenance shutdowns that may have affected these facilities.",
            "Sentiment": "positive",
            "PublishDate": 1735259131000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Resumes Production at Ammonia and Urea Plants",
            "Summary": "Paradeep Phosphates Limited has announced the resumption of production at its ammonia and urea plants. This indicates that the company has overcome any previous production challenges or maintenance issues that may have caused a temporary halt in operations.",
            "Sentiment": "positive",
            "PublishDate": 1735212937000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Announces INR250 Crore Expansion Plan",
            "Summary": "Paradeep Phosphates has announced an expansion plan with an estimated cost of approximately INR250 crores. The company plans to finance this expansion through a combination of internal accruals and external financing sources.",
            "Sentiment": "positive",
            "PublishDate": 1730259447000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Aims for Profit Margins and Increased Production",
            "Summary": "Paradeep Phosphates has set profit margin targets of 8% for traders and 10-12% for manufacturers. The company anticipates a price increase of INR10,000 per ton, which is expected to generate an additional INR200 crores from a 200,000-ton facility.",
            "Sentiment": "positive",
            "PublishDate": 1730259116000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Reports Strong Q2 Profit Growth and Announces Expansion",
            "Summary": "Paradeep Phosphates reported a significant increase in Q2 net profit, rising to 2.3 billion rupees from 894 million rupees year-over-year. The company's revenue also grew to 38.4 billion rupees from 36.8 billion rupees in the same period. Additionally, Paradeep Phosphates announced a brownfield expansion of its phosphoric acid plant-II project, including the installation of an evaporator, with an investment of 2.5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730160599000,
            "Source": "result"
        },
        {
            "Title": "Paradeep Phosphates Announces Brownfield Expansion Project",
            "Summary": "Paradeep Phosphates has announced a brownfield expansion of its Phosphoric Acid Plant-II project. The expansion includes the installation of an evaporator, with an estimated cost of 2.5 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730123526000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paradeep Phosphates Reports Strong Q2 Financial Performance",
            "Summary": "Paradeep Phosphates has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 4.3 billion rupees, up from 2.56 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 11.08% from 6.95% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1730122044000,
            "Source": "result"
        },
        {
            "Title": "Paradeep Phosphates Reports Significant Profit Increase in Q2",
            "Summary": "Paradeep Phosphates has reported a substantial increase in net profit for the second quarter. The company's net profit rose to 2.3 billion rupees, up from 894 million rupees in the same quarter last year, representing a year-over-year increase. Sequentially, the profit grew from 63 million rupees in the previous quarter. Revenue for Q2 also saw a slight increase, reaching 38.4 billion rupees compared to 36.8 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730121998000,
            "Source": "result"
        }
    ]
}