{
    "Symbol": "PARACABLES",
    "ISIN": "INE074B01023",
    "News": [
        {
            "Title": "Paramount Communications Promoter Buys 27,000 Shares",
            "Summary": "Sandeep Aggarwal, Managing Director and Promoter of Paramount Communications Limited, acquired 27,000 equity shares through market purchase on December 24, 2025, increasing promoter group holding to 49.06%.",
            "Sentiment": "positive",
            "PublishDate": 1766481403476,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paramount Communications Allots 1.76 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "Paramount Communications Limited allotted 1,76,886 equity shares to employees under its Stock Incentive Plan following the exercise of employee stock options. The company's paid-up share capital increased from ₹61,00,65,856 to ₹61,04,19,628, with the newly allotted shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765349447089,
            "Source": "corporate_action"
        },
        {
            "Title": "Paramount Communications Publishes Unaudited Financial Results for Second Quarter and Half Year Ended September 30, 2025",
            "Summary": "Paramount Communications Limited's Board of Directors approved and published unaudited financial statements (standalone and consolidated) for the second quarter and half year ended September 30, 2025. The company disclosed this information to BSE and NSE exchanges and published the results in Financial Express and Jansatta newspapers on November 14, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763098991572,
            "Source": "earnings"
        },
        {
            "Title": "Paramount Communications Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Paramount Communications reported quarterly results showing net profit of 132.6 million rupees compared to 202.7 million rupees in the same period last year, representing a decline. Revenue increased to 4.28 billion rupees from 3.52 billion rupees year-over-year. EBITDA dropped significantly to 57.1 million rupees from 306.1 million rupees, while EBITDA margin compressed to 1.34% from 8.69% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1763032221540,
            "Source": "earnings"
        },
        {
            "Title": "Paramount Communications Divests Wholly Owned Subsidiary Valens Technologies",
            "Summary": "Paramount Communications Limited has decided to divest its entire investment in wholly owned subsidiary Valens Technologies Private Limited. The company acquired 1,93,996 equity shares of Valens Technologies on August 23, 2023, for Rs. 1,97,87,592. The Banking Finance Committee decided to sell the complete stake due to negative growth and uncertainty about future business prospects. The divestment agreement was signed on November 6, 2025, with completion expected by November 15, 2025. The sale consideration is Rs. 2,05,63,576 to buyers Marwar Portfolio Private Limited and Mr. Sanjeev Kumar Jain, who are not related to the promoter group. Valens Technologies contributed revenue of Rs. 20,84,07,247 and had a net worth of Rs. 35 lakh based on the March 31, 2025 audited balance sheet.",
            "Sentiment": "negative",
            "PublishDate": 1762421901012,
            "Source": "corporate_action"
        },
        {
            "Title": "Paramount Communications Holds EGM, Passes 3 of 4 Resolutions Including Fund Raising and Director Appointments",
            "Summary": "Paramount Communications Limited conducted an Extra Ordinary General Meeting on August 18, 2025, through video conferencing with 106 members attending (16 promoter group, 90 public). The company considered four special resolutions: fund raising through various securities, issuing warrants to promoter group entities, and appointing two independent directors - Sanjay Kumar Srivastava and Anjali Verma. Three resolutions passed with requisite majority, while the warrant issuance to promoter group failed. The fund raising resolution received 94.99% votes in favor, while the failed warrant resolution got only 30.92% support. Remote e-voting was conducted from August 15-17, 2025, with scrutinizer Abhishek Mittal overseeing the process. Total shareholders on record date were 149,579 as of August 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755599265738,
            "Source": "corporate_action"
        },
        {
            "Title": "Paramount Communications Reports Q1 FY2025-26 Results, Schedules AGM and Director Continuation",
            "Summary": "Paramount Communications Limited approved its Q1 FY2025-26 unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 450.87 crores compared to Rs 313.32 crores in the same quarter last year. Net profit for the quarter stood at Rs 19.00 crores versus Rs 25.18 crores in the previous year quarter. Other income included Rs 13.91 crores from maturity of keyman insurance policy with Life Insurance Corporation of India. The board fixed September 29, 2025 as the date for the 31st Annual General Meeting through video conferencing. Book closure dates are set from September 23 to September 29, 2025. The board approved continuation of Mr. Vijay Maheshwari as Director upon reaching 75 years of age, subject to shareholder approval. Mr. Maheshwari is a fellow member of the Institute of Chartered Accountants of India with over 46 years of finance experience.",
            "Sentiment": "neutral",
            "PublishDate": 1755084064142,
            "Source": "earnings"
        },
        {
            "Title": "Paramount Communications Schedules Board Meeting for Q1 FY2026 Results on August 13",
            "Summary": "Paramount Communications Limited has scheduled a Board of Directors meeting for August 13, 2025, to consider and approve unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The company's trading window, which closed on July 1, 2025, will remain closed until August 15, 2025, in compliance with insider trading regulations. The company trades on BSE under scrip code 530555 and on NSE under symbol PARACABLES.",
            "Sentiment": "neutral",
            "PublishDate": 1754652029661,
            "Source": "corporate_action"
        },
        {
            "Title": "Paramount Communications Plans Rs 135 Crore Fund Raise Through Multiple Securities",
            "Summary": "Paramount Communications Limited has announced plans to raise up to Rs 135 crores through issuance of various securities including convertible debentures, foreign currency bonds, and other instruments. The fundraising will be conducted through public issue, qualified institutions placement, or preferential allotment. An Extraordinary General Meeting has been scheduled for August 18, 2025, to seek shareholder approval for the proposal. The company also plans to issue 50 lakh warrants to Hertz Electricals (International) Private Limited, a promoter group entity, at Rs 60 per warrant for Rs 30 crores. Additionally, the company will appoint two new independent directors - Mr. Sanjay Kumar Srivastava for a five-year term and Ms. Anjali Verma for a three-year term. The funds will be utilized for working capital requirements, business expansion, debt reduction, and general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1753355439473,
            "Source": "corporate_governance"
        },
        {
            "Title": "Paramount Communications Announces Rs 300 Crore Convertible Warrant Allotment to Promoter Entity",
            "Summary": "Paramount Communications Ltd announced a preferential allotment of up to 5 million convertible warrants to Hertz Electricals (International) Private Limited, a promoter entity, at Rs 60 per warrant. The warrants can be converted into an equivalent number of equity shares within 18 months from allotment date. The company will receive 25% of the consideration at the time of warrant subscription and allotment, with the remaining 75% payable upon exercise of the conversion option. The Board has constituted a Fund-Raising Committee to decide the terms and conditions of the proposed fund raising.",
            "Sentiment": "neutral",
            "PublishDate": 1753101631364,
            "Source": "corporate_action"
        },
        {
            "Title": "Paramount Communication Board Approves ₹135 Crore Fundraising Plan",
            "Summary": "Paramount Communication's board has approved a fundraising initiative of up to ₹135 crore. The company has a market capitalization of ₹1,800 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753085204899,
            "Source": "corporate_action"
        },
        {
            "Title": "Paramount Communications to Explore Fundraising Options",
            "Summary": "Paramount Communications has announced plans to explore fundraising opportunities through equity and bonds on July 21.",
            "Sentiment": "positive",
            "PublishDate": 1752668242000,
            "Source": "default"
        },
        {
            "Title": "Paramount Communication Reports Capacity Enhancement and US Growth",
            "Summary": "Paramount Communication has reported capacity enhancement and strong growth trajectory in the US market, according to an investor presentation. The company also states that it has achieved zero debt status.",
            "Sentiment": "positive",
            "PublishDate": 1747902950000,
            "Source": "default"
        },
        {
            "Title": "Paramount Communications Reports Q4 Financial Results",
            "Summary": "Paramount Communications has released its Q4 financial results. The company's EBITDA increased to 316.9 million rupees from 271.2 million rupees year-over-year. However, the EBITDA margin decreased to 6.25% from 8.39% in the same period. Revenue grew significantly to 5.07 billion rupees from 3.23 billion rupees year-over-year. The consolidated net profit for Q4 was 187.4 million rupees, down from 295 million rupees year-over-year and 226 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747839460000,
            "Source": "result"
        },
        {
            "Title": "Paramount Communications Reports Improved Q3 EBITDA Performance",
            "Summary": "Paramount Communications has announced its Q3 financial results, showing an increase in EBITDA to 336 million rupees, up from 241 million rupees in the same quarter last year. The company's EBITDA margin also improved slightly to 8.58% from 8.47% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738846927000,
            "Source": "earnings"
        },
        {
            "Title": "Paramount Communications Reports Increased Q3 Revenue and Profit",
            "Summary": "Paramount Communications has announced its Q3 financial results. The company's consolidated net profit rose to 226 million rupees, up from 220 million rupees in the same quarter last year. Revenue showed significant growth, increasing to 3.92 billion rupees from 2.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738846919000,
            "Source": "earnings"
        },
        {
            "Title": "Paramount Communications Secures 30-Acre Land Lease for Cable Manufacturing Unit in Madhya Pradesh",
            "Summary": "Paramount Communications has been allotted 30 acres of industrial land on a 99-year lease in Madhya Pradesh. The company plans to use this land to establish a manufacturing unit for DC and AC cables.",
            "Sentiment": "positive",
            "PublishDate": 1733817190000,
            "Source": "corporate_action"
        },
        {
            "Title": "Paramount Communications: Penny Stock Soars 864% in Four Years",
            "Summary": "Paramount Communications stock has risen from ₹7 to ₹67.95 in four years, marking an 864% increase. The company reported a 4.31% rise in Q2FY25 net profit to ₹20.33 crore and a 40.98% surge in sales to ₹355.89 crore. The stock is currently 42% below its December 2023 peak of ₹116.70.",
            "Sentiment": "positive",
            "PublishDate": 1730105874000,
            "Source": "normal_news"
        },
        {
            "Title": "Paramount Communications: Q2 Profit Up 4.31%, Revenue Surges 41%",
            "Summary": "Paramount Communications reported Q2FY25 net profit of Rs 20.33 crore, up 4.31% YoY. Revenue increased 40.98% to Rs 355.89 crore. The company issued equity warrants to non-promoters and converted some into shares. Paramount's revenue CAGR was 27% from FY21-FY24, with improved ROE and reduced debt levels.",
            "Sentiment": "positive",
            "PublishDate": 1730097571000,
            "Source": "result"
        }
    ]
}