{
    "Symbol": "PARAS",
    "ISIN": "INE045601023",
    "News": [
        {
            "Title": "Paras Defence eyes 30-40% FY26 revenue growth",
            "Summary": "Paras Defence expects strong Q4 performance to drive FY26 revenues to ₹450-500 crore range, with order book projected to reach ₹1,100-1,200 crore by year-end amid rising demand for optics and defence electronics.",
            "Sentiment": "positive",
            "PublishDate": 1769510517368,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paras Defence launches semiconductor unit with 3D packaging",
            "Summary": "Paras Defence launches semiconductor subsidiary with ₹10 lakh capital, focusing on advanced 3D packaging OSAT facility for defence electronics and HPC applications, holding 70% stake.",
            "Sentiment": "positive",
            "PublishDate": 1768800886547,
            "Source": "stocks"
        },
        {
            "Title": "Paras Defence Extends Ayatti Stake Sale Timeline",
            "Summary": "Paras Defence extends completion timeline for 58.02% Ayatti stake sale to March 2026 as due diligence continues with prospective buyers.",
            "Sentiment": "neutral",
            "PublishDate": 1766734019708,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paras Defence Signs Technology Licensing Agreement with DRDO for T-90 Tank Driver Night Sight",
            "Summary": "Paras Defence And Space Technologies has entered into a technology licensing agreement with DRDO for T-90 tank driver night sight systems. The partnership aims to enhance defence manufacturing capabilities and increase domestic content in defence equipment.",
            "Sentiment": "positive",
            "PublishDate": 1764144179164,
            "Source": "stock"
        },
        {
            "Title": "Paras Defence And Space Tech Signs Agreement With Inter-University Accelerator Centre",
            "Summary": "Paras Defence And Space Tech has entered into an agreement with Inter-University Accelerator Centre. The partnership involves the defence and space technology company collaborating with the research institution.",
            "Sentiment": "positive",
            "PublishDate": 1763987559705,
            "Source": "stock"
        },
        {
            "Title": "Paras Defence Seeks Shareholder Approval for Independent Director Re-appointment",
            "Summary": "Paras Defence and Space Technologies Limited has issued a postal ballot notice seeking shareholder approval for the re-appointment of Mr. Suresh Katyal as Non-Executive Independent Director for a second five-year term from January 05, 2026 to January 04, 2031. The e-voting process will be conducted from November 20, 2025 to December 19, 2025, with the resolution requiring special resolution approval from shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1763461759261,
            "Source": "corporate_action"
        },
        {
            "Title": "Paras Defence Secures Rs 71.68 Crore Order from DRDO for Submarine Periscopes",
            "Summary": "Paras Defence and Space Technologies Limited received an order worth Rs 71.68 crores from IRDE-DRDO, Ministry of Defence for supply of two Optronic Periscopes for submarine application. The order is scheduled for execution by August-September 2026, representing a significant defense contract for the company.",
            "Sentiment": "positive",
            "PublishDate": 1763358478784,
            "Source": "order&deals"
        },
        {
            "Title": "Paras Defence Shares Rise 14% Over Seven Days Following Strong Q2 Results",
            "Summary": "Paras Defence and Space Technologies shares extended gains for the seventh consecutive day, rising over 3% on Monday after reporting a 48.6% jump in quarterly profit to Rs 20.6 crore and 21.4% revenue growth to Rs 106 crore. The company also secured new defence ministry orders worth Rs 35.68 crore for counter-drone systems and Rs 3.95 crore for RF jammers through its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1763355906706,
            "Source": "stock"
        },
        {
            "Title": "Paras Defence Shares Surge 10% on Strong Q2 Results and Rs 35.68 Crore Defence Order",
            "Summary": "Paras Defence and Space Technologies shares rallied 10% to Rs 719 after reporting 50% jump in net profit to Rs 21 crore and 22% revenue growth to Rs 106 crore for the quarter ended September 30. The company also secured a Rs 35.68 crore order from Ministry of Defence for Portable Counter-Drone Systems, with shares gaining nearly 60% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1763102611618,
            "Source": "earnings"
        },
        {
            "Title": "Paras Defence Reports Strong Q2 Performance with 38% Revenue Growth",
            "Summary": "Paras Defence and Space Technologies Limited announced quarterly results for the period ended September 30, 2025. The company reported revenue from operations of Rs. 19,272 lakhs compared to Rs. 13,958 lakhs in the same quarter last year. Net profit increased to Rs. 2,768 lakhs from Rs. 2,106 lakhs in the previous year quarter. The Board approved the re-appointment of Mr. Suresh Katyal as Non-Executive Independent Director for a second five-year term effective January 5, 2026. The company also approved a postal ballot process for shareholder approval of this appointment, with e-voting scheduled from November 20 to December 19, 2025. Earnings per share stood at Rs. 2.76 for the quarter. The company operates through two main segments: Optics and Optronic Systems, and Defence Engineering.",
            "Sentiment": "positive",
            "PublishDate": 1763025373468,
            "Source": "earnings"
        },
        {
            "Title": "Paras Defence Secures ₹39.63 Crore Orders from Ministry of Defence for Counter-Drone Systems",
            "Summary": "Paras Defence and Space Technologies Limited received a ₹35.68 crore order from the Ministry of Defence for Portable Counter-Drone Systems, scheduled for execution by May 2026. Additionally, its subsidiary Paras Anti-Drone Technologies Private Limited secured a separate ₹3.95 crore order for RF Jammers (Integrated Drone Detector Jammer), also due by May 2026. These represent the company's second and third engagements with the Ministry within two months. The orders are part of India's expanding counter-UAV ecosystem and align with the government's Atmanirbhar Bharat vision for self-reliance in defence technology.",
            "Sentiment": "positive",
            "PublishDate": 1762899089045,
            "Source": "order&deals"
        },
        {
            "Title": "Paras Defence Secures ₹35.68 Crore Defence Ministry Order for Counter-Drone Systems",
            "Summary": "Paras Defence And Space Technologies has received an order worth ₹35.68 crores from the Ministry of Defence for portable counter-drone systems. The order is expected to be completed by May 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762838731134,
            "Source": "order&deals"
        },
        {
            "Title": "Paras Defence Subsidiary Secures ₹3.95 Crore Anti-Drone Systems Order from Defence Ministry",
            "Summary": "A subsidiary of Paras Defence And Space Technologies has received a ₹3.95 crore order from the Defence Ministry for anti-drone systems. The project is scheduled for completion by May 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762764864766,
            "Source": "order&deals"
        },
        {
            "Title": "Paras Defence Incorporates New Subsidiary for Drone Manufacturing",
            "Summary": "Paras Defence and Space Technologies Limited incorporated a new subsidiary named Paras Heven Advanced Drones Private Limited on October 15, 2025. The subsidiary has an authorized and paid-up capital of ₹1 lakh divided into 10,000 equity shares of ₹10 each. Paras Defence holds a 51% stake by subscribing to 5,100 shares for ₹51,000 in cash. The new company will focus on development and production of logistics and cargo drones for both defence and civil markets. The subsidiary operates in the defence and logistics industry and is registered in Maharashtra, India.",
            "Sentiment": "positive",
            "PublishDate": 1760598996381,
            "Source": "corporate_action"
        },
        {
            "Title": "Paras Defence Partners with Cielo Inertial Solutions for Joint Development of Inertial Sensors",
            "Summary": "Paras Defence And Space Technologies has entered into a partnership with Cielo Inertial Solutions Limited for the joint development of inertial sensors and closed loop FOG (Fiber Optic Gyroscope) solutions. The collaboration aims to enhance sales and production capabilities in India.",
            "Sentiment": "positive",
            "PublishDate": 1760413143631,
            "Source": "order&deals"
        },
        {
            "Title": "Paras Defence Subsidiary Secures ₹46.19 Crore Anti-Drone Order from Ministry of Defence",
            "Summary": "Paras Anti-Drone Technologies, a subsidiary of Paras Defence and Space Technologies Ltd., received an order worth ₹46.19 crore from the Ministry of Defence for supplying advanced anti-drone systems including drone jammers to the armed forces. The contract is scheduled for execution by March 2026. The company will supply indigenous systems designed to neutralise hostile drones in real-time, addressing security concerns from unmanned aerial systems used for surveillance, smuggling and potential security breaches. The order supports the government's Atmanirbhar Bharat initiative for self-reliance in defence manufacturing. CEO Ashutosh Baheti stated the order reflects confidence in the company's indigenous capabilities and commitment to delivering Made-in-India solutions. Paras Anti-Drone specialises in counter-drone systems including wide-band detection and jamming systems operating from 400MHz to 6GHz. Despite the contract win, Paras Defence shares were trading down 1.29% at ₹713.85 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1759824453394,
            "Source": "order&deals"
        },
        {
            "Title": "Paras Defence Subsidiary Secures ₹46.19 Crore Anti-Drone Systems Contract from Defence Ministry",
            "Summary": "Paras Defence And Space Technologies announced that its subsidiary has received a ₹46.19 crore order from the Defence Ministry for anti-drone systems. The delivery is scheduled to be completed by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1759462902522,
            "Source": "order&deals"
        },
        {
            "Title": "Paras Defence Secures $3.8 Million International Order from Israeli Company",
            "Summary": "Paras Defence and Space Technologies Limited has received an international order worth approximately $3.8 million (₹34 crores) from Elbit Security Systems Limited, Israel, for the supply of Electro-Optics equipment. The contract is scheduled to be executed from February 2026 to November 2026. The order does not involve any related party transactions, and the promoter group has no interest in the awarding entity.",
            "Sentiment": "positive",
            "PublishDate": 1758858289349,
            "Source": "order&deals"
        },
        {
            "Title": "Paras Defence Secures Rs. 26.6 Crore Incremental Order for Battle-Tank Electronic Control Systems",
            "Summary": "Paras Defence and Space Technologies Limited received incremental orders worth Rs. 26.6 crores from Opto Electronics Factory, a unit of India Optel Ltd. under the Ministry of Defence. The order is for supplying Electronic Control Systems used in Thermal Imaging Fire Control Systems for Battle-Tank applications delivered to Indian Armed Forces. The contract will be executed from December 2025 to September 2026. With this incremental order, the total revised order value for Electronic Control Systems used in TIFCS now stands at Rs. 141.63 crores, up from the existing orders of Rs. 115.03 crores. The order is domestic in nature and does not involve any related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1757648988517,
            "Source": "stock"
        },
        {
            "Title": "Paras Defence Eyes Submarine Periscope Contracts for Growth with Rs 928 Crore Order Book",
            "Summary": "Paras Defence and Space Technologies expects its submarine periscope segment to drive future growth, with Director Amit Mahajan highlighting long-term visibility in this business. The company is the only player in the Asia-Pacific region manufacturing submarine optronic periscopes, which are indigenously developed systems providing day and night vision capabilities. The Optics & Optronics segment contributed Rs 177 crore to revenue in FY25, representing 48% of overall revenue, up from Rs 66 crore in FY24. Paras Defence maintains a total order book of Rs 928 crore, with Rs 120 crore coming from the submarine periscope segment. The company expects minimal competition from domestic players due to its technological advantage, with competition mainly from foreign players. Management anticipates the submarine periscope order value to increase going forward.",
            "Sentiment": "positive",
            "PublishDate": 1756715911516,
            "Source": "stock"
        },
        {
            "Title": "Paras Defence Secures ₹45 Crore Order from BEL for Air Defence Systems",
            "Summary": "Paras Defence and Space Technologies received an order worth ₹45.32 crore from Bharat Electronics (BEL) for supplying signal and data processing systems and multi-sensor fusion systems. The domestic contract has a completion timeline of 29 months. The company also signed a teaming agreement with Germany's High Performance Space Structure Systems GmbH for defence and space projects in India. For the quarter ended June, Paras Defence reported mixed financial performance with revenue increasing 11.5% to ₹93.2 crore, while net profit remained flat at ₹15 crore. EBITDA declined 8.7% to ₹22 crore and margins compressed to 23.6% from 28.8%. The Optics and Optronic Systems segment grew to ₹42.5 crore and Defence Engineering segment increased to ₹50.7 crore. Shares closed down 0.8% at ₹675, though the stock has gained 34% year to date.",
            "Sentiment": "neutral",
            "PublishDate": 1755773623678,
            "Source": "stock"
        },
        {
            "Title": "Paras Defence And Space Secures ₹45 Crore Contract",
            "Summary": "Paras Defence And Space has secured a contract worth ₹45 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755767237621,
            "Source": "stock"
        },
        {
            "Title": "Paras Defence Partners with German Firm to Develop Satellite Antenna Systems for Indian Market",
            "Summary": "Paras Defence & Space Technologies signed a teaming agreement with Germany's High Performance Space Structure Systems GmbH to co-develop deployable antenna reflector systems for satellites in India. The partnership will create unfurlable antenna reflectors that fold during satellite launches and deploy automatically in orbit, including reflector assemblies, hold-down release mechanisms, deployment electronics, and thermal hardware components. Under the exclusive arrangement for India, Paras Defence will serve as the primary customer interface while HPS GmbH provides design and manufacturing support from Germany. The collaboration aims to address India's reliance on international suppliers for deployable reflector technology and represents one of the first private sector initiatives to develop these capabilities domestically. The reflectors will support satellite internet, Earth imaging, disaster response, and military communications applications. Paras Defence shares were trading at ₹630.05, down ₹19.10 or 2.94% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1754638716678,
            "Source": "stock"
        },
        {
            "Title": "Paras Defence Partners with German Firm HPS for Space Antenna Technology Collaboration",
            "Summary": "Paras Defence and Space Technologies Limited has entered into a teaming agreement with High Performance Space Structure Systems GmBH, Germany to collaborate on defence and space projects in India. The partnership focuses on Unfurlable/Deployable Antenna Reflector Subsystems, including reflector and arm assembly, HDRM, thermal hardware, and deployment electronics. HPS brings expertise in design, manufacturing, integration and testing of antenna reflector subsystems for space applications, along with experience in solid reflector antennas, lightweight structures, thermal hardware, and nanosatellite equipment. The agreement spans two years with potential for extension based on mutual consent. Both companies will work exclusively with each other for the identified products in the Indian region. Paras Defence holds no shareholding in HPS, and the transaction does not involve related party dealings.",
            "Sentiment": "positive",
            "PublishDate": 1754489484837,
            "Source": "order&deals"
        },
        {
            "Title": "Paras Defence Shares Drop 13% Following Decline in Quarterly Profit and Revenue",
            "Summary": "Paras Defence and Space Technologies shares fell 10% on Monday to Rs 704.70, extending losses to over 13% in two sessions. The decline followed the company's quarterly results showing consolidated net profit dropped 25% to Rs 15 crore from Rs 20 crore in the same period last year. Revenue from operations decreased 14% to Rs 93 crore compared to Rs 108 crore in the corresponding quarter of the previous financial year. The company's expenses stood at Rs 76 crore in the reported quarter. Despite recent declines, the stock maintains year-to-date returns of 40% and 1-year returns of 6%. The company operates in defence and space applications through two verticals: Optics & Optronic Systems and Defence Engineering. Paras Defence has scheduled its 16th Annual General Meeting for August 21, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753694965915,
            "Source": "earnings"
        },
        {
            "Title": "Paras Defence Sets August 8, 2025 Record Date for Final Dividend of Rs. 0.50 Per Share",
            "Summary": "Paras Defence and Space Technologies Limited has announced August 8, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 0.50 per equity share for FY 2024-25. The dividend payment is subject to shareholder approval at the company's 16th Annual General Meeting. The Board of Directors had previously recommended this dividend on April 30, 2025. Once approved, the dividend will be paid within 30 days of the AGM to shareholders whose names appear in records as of the close of business on the record date, subject to tax deduction at source.",
            "Sentiment": "positive",
            "PublishDate": 1753435931599,
            "Source": "corporate_action"
        },
        {
            "Title": "Paras Defence Approves Q1 2025 Results, Sets AGM Date and Dividend Record Date",
            "Summary": "Paras Defence and Space Technologies Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company scheduled its 16th Annual General Meeting for August 21, 2025, and fixed August 8, 2025 as the record date for dividend eligibility. A final dividend of Rs. 0.50 per equity share (10%) for the financial year ended March 31, 2025 is subject to shareholder approval at the AGM. The company reported standalone revenue from operations of Rs. 8,741 lakhs for Q1 2025 compared to Rs. 7,760 lakhs in the same quarter last year. Standalone profit for the quarter was Rs. 1,543 lakhs versus Rs. 1,587 lakhs in the previous year quarter. The Board also approved material related party transactions with associate company Controp-Paras Technologies Private Limited and the re-appointment of Mr. Sharad Virji Shah as director.",
            "Sentiment": "neutral",
            "PublishDate": 1753434195125,
            "Source": "earnings"
        },
        {
            "Title": "Paras Defence and Space Tech Reports Mixed Q1 Results with Revenue Growth but Lower Margins",
            "Summary": "Paras Defence and Space Tech reported quarterly results showing net profit remained flat at 149 million rupees compared to the same period last year. Revenue increased to 932 million rupees from 836 million rupees year-over-year. However, EBITDA declined to 220 million rupees from 241 million rupees, with EBITDA margin compressing to 23.55% from 28.86% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753433027326,
            "Source": "earnings"
        },
        {
            "Title": "Paras Defence to Announce Q1 Results on July 25; Stock Up 59.59% Year-to-Date",
            "Summary": "Paras Defence and Space Technologies will announce its Q1 financial results on July 25, with the Board of Directors meeting scheduled to approve standalone and consolidated unaudited results. The company operates in defence sector verticals including Optics and Optronic Systems, and Defence Engineering. In Q4FY25, the company reported strong performance with consolidated net profit jumping 117% to Rs 20.83 crore and total income rising 31.8% to Rs 112.28 crore. The stock has shown mixed recent performance, declining 0.66% in the past five trading sessions and 2.56% over the past month, but gaining significantly over longer periods with 50.63% growth in six months and 59.59% year-to-date returns. Shares hit a 52-week high of Rs 972.5 in May and were trading at Rs 802.60, up 0.6% during Thursday morning session.",
            "Sentiment": "positive",
            "PublishDate": 1753331082530,
            "Source": "earnings"
        },
        {
            "Title": "Paras Defence and Space Technologies Schedules Board Meeting for Q1 FY2026 Results",
            "Summary": "Paras Defence and Space Technologies Limited has scheduled a Board of Directors meeting for July 25, 2025 to consider and approve the standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The meeting will also review the Limited Review Report from statutory auditors. The company has informed both BSE and NSE about this scheduled meeting through a formal communication signed by Company Secretary Jajvalya Raghavan.",
            "Sentiment": "neutral",
            "PublishDate": 1753100606948,
            "Source": "corporate_action"
        },
        {
            "Title": "Paras Defence and Space Technologies: Stock Falls 6% Post-Split Rally",
            "Summary": "Paras Defence shares dropped 6.1% to Rs 876.55 on BSE as investors booked profits following last week's 1:2 stock split rally. The stock remains above key moving averages despite the decline. The company's market capitalization stands at Rs 7,442.64 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1751863763000,
            "Source": "corporate_action"
        }
    ]
}