{
    "Symbol": "PARASPETRO",
    "ISIN": "INE162C01024",
    "News": [
        {
            "Title": "Paras Petrofils clarifies share price movement",
            "Summary": "Paras Petrofils Limited responds to BSE inquiry regarding recent equity share price movements, stating no pending price-sensitive information and attributing movement to market forces.",
            "Sentiment": "neutral",
            "PublishDate": 1770188840912,
            "Source": "stocks"
        },
        {
            "Title": "Paras Petrofils Limited Approves Unaudited Financial Results for Second Quarter and Half Year Ended September 30, 2025",
            "Summary": "Paras Petrofils Limited's Board of Directors approved and took on record the unaudited standalone financial statements for the second quarter and half year ended September 30, 2025, along with the limited review report. The Board meeting was held on November 14, 2025, commencing at 5:00 p.m. IST and concluding at 6:10 p.m. IST, with the outcome being hosted on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1763141121245,
            "Source": "earnings"
        },
        {
            "Title": "Paras Petrofils Limited Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Paras Petrofils Limited's Board of Directors approved the unaudited standalone financial statements for the quarter ended June 30, 2025, along with the Limited Review Report. The board meeting was held on August 13, 2025, from 3:30 PM to 3:59 PM IST. The company has submitted these financial results to stock exchanges including NSE, BSE, and Calcutta Stock Exchange. The Limited Review Report was prepared by RMR & Co. Chartered Accountants, with CA Rohit Vijayvargia as the reviewing partner. The review found no material misstatements in the financial results prepared in accordance with applicable accounting standards and regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1755084140461,
            "Source": "earnings"
        },
        {
            "Title": "Paras Petrofils Limited Company Secretary Shalu Sarraf Resigns Due to Relocation",
            "Summary": "Shalu Sarraf has resigned from her position as Company Secretary and Compliance Officer of Paras Petrofils Limited, effective from the closing of working hours on July 30, 2025. The resignation was submitted via email on July 30, 2025, citing relocation as the reason for her departure. Sarraf, who holds ACS certification number 63225, indicated her inability to continue in the position due to moving out of the city. The company has accepted her resignation and disclosed the change in key managerial personnel to stock exchanges including NSE, BSE, and Calcutta Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1753896797279,
            "Source": "corporate_governance"
        }
    ]
}