{
    "Symbol": "PARKHOTELS",
    "ISIN": "INE988S01028",
    "News": [
        {
            "Title": "Apeejay Surrendra Park Hotels Q3FY26 Results",
            "Summary": "Apeejay Surrendra Park Hotels reported Q3FY26 standalone revenue of Rs. 187.61 crores and net profit of Rs. 24.67 crores. The company completed strategic acquisitions in Mumbai and Kerala during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1770223047221,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Appoints Joint Auditor",
            "Summary": "Apeejay Surrendra Park Hotels Limited has appointed M/s. A. Mukhopadhyay & Co. as joint Internal Auditor for FY 2025-26, following board approval on February 04, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770220933732,
            "Source": "stocks"
        },
        {
            "Title": "ASPH Board Meeting Set for Q3FY26 Results on Feb 4",
            "Summary": "Apeejay Surrendra Park Hotels Limited has scheduled its board meeting for February 04, 2026, to consider and approve Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769695284618,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Opens First Bihar Hotel",
            "Summary": "Apeejay Surrendra Park Hotels launches Zone Connect by The Park Patna, its first hotel in Bihar, featuring modern amenities and strategic location. Stock closed up 1.72%.",
            "Sentiment": "positive",
            "PublishDate": 1768394995777,
            "Source": "stocks"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Debuts in Kerala Market",
            "Summary": "Apeejay Surrendra Park Hotels officially launches three boutique properties in Kerala - The Malabar House, Purity, and Discovery - under THE Park Collection brand, marking company's entry into Kerala's luxury hospitality market.",
            "Sentiment": "positive",
            "PublishDate": 1765907976346,
            "Source": "co_actions_results"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Faces INR 33.08 Lakh GST Penalty for FY2021-22 Violations",
            "Summary": "Apeejay Surrendra Park Hotels Limited received orders from the Assistant Commissioner (ST), Chennai, imposing a total penalty of INR 33,08,010 under CGST and TNGST Acts for excess availment of Input Tax Credit and other GST-related discrepancies for FY2021-22. The company disclosed that the maximum financial impact is limited to the penalty amount of INR 33,08,010, with orders received on December 05, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1765025821405,
            "Source": "stock"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Leases 42-Room Casa De Katson Hotel Property in Goa",
            "Summary": "Apeejay Surrendra Park Hotels Limited executed a 12-year lease agreement with Katson Hotel and Developer Private Limited for a fully furnished and operational hotel property Casa De Katson in Bardez, Goa. The hotel comprises 42 rooms with associated facilities spanning approximately 2772.69 sq. mts. built-up area, with the company receiving full operational and commercial rights to manage the property under its own brand standards.",
            "Sentiment": "positive",
            "PublishDate": 1764681831715,
            "Source": "stock"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Signs MoU to Lease 42-Room Hotel Property in Mathura",
            "Summary": "Apeejay Surrendra Park Hotels Limited entered into a Memorandum of Understanding with Raman Industrial Enterprises to lease and operate a 42-room hotel property under construction in Mathura, Uttar Pradesh. The company plans to manage the hotel for a 12-year lease term, with the definitive Lease Deed proposed to be executed on or before March 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1764413843432,
            "Source": "order&deals"
        },
        {
            "Title": "Apeejay Surendra Park Hotels Launches New Zone By The Park Hotel in Kolkata",
            "Summary": "Apeejay Surendra Park Hotels has opened a new Zone By The Park Hotel in New Market, Kolkata. The launch represents the company's expansion of its hospitality portfolio in the eastern Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1764249060965,
            "Source": "stock"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Reports Record Q2 Performance with 16.8% Revenue Growth",
            "Summary": "Apeejay Surrendra Park Hotels delivered its best-ever second quarter with revenue rising 16.8% year-on-year to INR 165 crore and operating EBITDA growing 14.9% to INR 49 crore in Q2 FY26. The company maintained industry-leading occupancy at 93% with ARR growing 13% and RevPAR increasing 11.9%, while completing strategic acquisition of 90% stake in Zillion Hotels for approximately INR 206 crore to enter Mumbai market.",
            "Sentiment": "positive",
            "PublishDate": 1763547476883,
            "Source": "earnings"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Reports Strong Q2 Performance with 17% Revenue Growth and 93% Occupancy",
            "Summary": "Apeejay Surrendra Park Hotels Limited reported its best-ever second quarter performance with revenue growth of 17% and India's highest occupancy rate of 93%. The company achieved consolidated revenue of Rs. 167 crores, up 17% year-over-year, with operating EBITDA of Rs. 49 crores. Average Room Rate grew 13% and Revenue per Available Room increased 12%. The company operates under five brands including THE PARK, THE PARK Collection, and Zone by The Park. Flurys retail business expanded to 102 outlets with 22% topline growth. The company completed acquisition of Zillion Hotel at Juhu, Mumbai for Rs. 2.64 crores and plans to break ground on a new Kolkata project in January 2026. Managing Director Vijay Dewan highlighted the sustained growth momentum and expansion plans across iconic hotels in India. The company received global recognition with awards for Ran Baas, The Palace, Patiala and The Lotus Palace, Chettinad.",
            "Sentiment": "positive",
            "PublishDate": 1763008197236,
            "Source": "earnings"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Apeejay Surrendra Park Hotels reported Q2 revenue of 1.65 billion rupees, up from 1.4 billion rupees in the same period last year. EBITDA increased to 490 million rupees from 410 million rupees year-over-year, with EBITDA margin improving to 29.70% from 28.87%. However, consolidated net profit declined to 162 million rupees compared to 268 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762877417229,
            "Source": "earnings"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Acquires 90% Stake in Zillion Hotels for ₹2.07 Billion",
            "Summary": "Apeejay Surrendra Park Hotels Limited has entered into a Share Purchase Agreement to acquire 90% stake in Zillion Hotels and Resorts Private Limited for up to ₹2,065,500,000 in cash consideration. The acquisition includes an option to acquire the remaining 10% shareholding based on certain events. Zillion Hotels operates Z Luxury Residences in Mumbai, which includes 62 service residences and food & beverage facilities located at Juhu. The acquisition will make Zillion Hotels a subsidiary of Apeejay Surrendra Park Hotels. The transaction is expected to be completed over an indicative period of 18-20 months. The acquisition is not a related party transaction and no governmental or regulatory approvals are required.",
            "Sentiment": "positive",
            "PublishDate": 1758733821087,
            "Source": "order&deals"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Sets Record Date for Final Dividend Payment",
            "Summary": "Apeejay Surrendra Park Hotels Limited has fixed September 19, 2025 as the record date for determining shareholders eligible for final dividend of Rs. 0.50 per equity share for financial year 2024-25. The dividend payment is subject to shareholder approval at the 37th Annual General Meeting. Upon approval, the dividend will be paid within 30 days to shareholders whose names appear in the register of members as of the record date. The Board of Directors had previously recommended this final dividend of Rs. 0.50 per fully paid-up equity share of face value Rs. 1 each.",
            "Sentiment": "positive",
            "PublishDate": 1757044373627,
            "Source": "corporate_action"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Reports 14% Revenue Growth and 92% Occupancy in Q1 FY26",
            "Summary": "Apeejay Surrendra Park Hotels Limited reported revenue from operations of Rs 154 crore in Q1 FY26, representing a 14% year-on-year increase. Operating EBITDA reached Rs 45 crore, up 16% year-on-year, while net profit stood at Rs 13 crore for the quarter. The company achieved 92% occupancy during the quarter, with Average Room Rate improving by 13% and Revenue per Available Room increasing by 12%. The hospitality company has entered into an MoU to acquire and manage four leisure properties in Goa, Manali, Shimla, and Dharamshala, adding 138 rooms to its portfolio. The company plans to more than double its key count to 5,750 over the next five years. Its bakery brand Flurys now operates 102 outlets. Managing Director Vijay Dewan described it as an extraordinary and best-ever Q1 performance, highlighting the company's leadership in RevPAR in the upper upscale segment.",
            "Sentiment": "positive",
            "PublishDate": 1755172523989,
            "Source": "earnings"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Reports Strong Q1 Turnaround with 134 Million Rupees Net Profit",
            "Summary": "Apeejay Surrendra Park Hotels delivered a strong quarterly performance, reporting a net profit of 134 million rupees compared to a loss of 19 million rupees in the same period last year. The company's revenue grew to 1.5 billion rupees from 1.35 billion rupees year-over-year. EBITDA increased to 460 million rupees from 390 million rupees, while EBITDA margin improved to 29.87% from 28.89% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754872136562,
            "Source": "earnings"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Reports Q1 FY2026 Results with Profit Growth",
            "Summary": "Apeejay Surrendra Park Hotels Limited announced its quarterly results with the Board of Directors approving unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 148.26 crores compared to Rs. 129.85 crores in the same quarter last year. Profit after tax increased to Rs. 17.09 crores from a loss of Rs. 1.83 crores in the corresponding quarter. On a consolidated basis, revenue from operations stood at Rs. 154.25 crores versus Rs. 135.07 crores in the previous year quarter, with profit after tax at Rs. 13.42 crores compared to a loss of Rs. 1.90 crores. The company converted Rs. 70.47 crores of unsecured loans given to its wholly-owned subsidiary into Optionally Convertible Redeemable Preference Shares. The Board had previously proposed a final dividend of Re. 0.50 per share for the year ended March 31, 2025, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754663767005,
            "Source": "earnings"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels: Expansion into Goa and Himachal Pradesh",
            "Summary": "Apeejay Surrendra Park Hotels signed an MoU to lease and operate 138 rooms across four properties in Goa and Himachal Pradesh. The 12-year lease arrangement covers properties in Goa, Manali, Shimla, and Dharamshala. Goa and Dharamshala properties expected to be operational within 60 days, Manali and Shimla within 90 days after definitive agreements.",
            "Sentiment": "positive",
            "PublishDate": 1752306393000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apeejay Surendra Park Hotels Expands with 4 New Properties",
            "Summary": "Apeejay Surendra Park Hotels has signed an agreement to operate 4 new properties, expanding its presence in Goa and Himachal Pradesh. The expansion will add 138 rooms in key tourist areas.",
            "Sentiment": "positive",
            "PublishDate": 1752304869000,
            "Source": "default"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Reports Q4 Financial Results",
            "Summary": "Apeejay Surrendra Park Hotels has reported its Q4 financial results. The company's EBITDA increased to 610.7 million rupees from 503.6 million rupees year-over-year. The EBITDA margin improved to 34.44% from 33.04% in the same period. Revenue rose to 1.77 billion rupees from 1.52 billion rupees year-over-year. The consolidated net profit for Q4 was 265.6 million rupees, up from 184 million rupees year-over-year and 321.6 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748278655000,
            "Source": "result"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Expands with New Management Agreement in Indore",
            "Summary": "Apeejay Surrendra Park Hotels has signed a management agreement for a new property, Zone by The Park, in Indore. This move indicates the company's expansion strategy and growth in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1746013668000,
            "Source": "default"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels: Stock Surges 7% Amid Market Weakness",
            "Summary": "Apeejay Surrendra Park Hotels share price rose 6.8% to ₹165 in intraday trading, despite overall market decline. The stock was trading at ₹164.60, up 6.54%, while Sensex was down 0.32%.",
            "Sentiment": "positive",
            "PublishDate": 1745476864000,
            "Source": "normal_news"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels to Acquire 90% Stake in Zillion Hotels",
            "Summary": "Apeejay Surrendra Park Hotels is set to acquire a 90% stake in Zillion Hotels for Rs 209.25 crore. This strategic move aims to expand the company's hospitality footprint in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1745463550000,
            "Source": "default"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Launches Zone Connect in Jaisalmer",
            "Summary": "Apeejay Surrendra Park Hotels has announced the launch of a new hotel property, Zone Connect by The Park, in Jaisalmer. This expansion marks the company's entry into the Jaisalmer market, extending its hospitality offerings to a new location.",
            "Sentiment": "positive",
            "PublishDate": 1744729070000,
            "Source": "default"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels: Plans to Double Portfolio by 2028",
            "Summary": "Apeejay Surrendra Park Hotels aims to expand its portfolio to over 5,000 keys by 2028, effectively doubling its current capacity.",
            "Sentiment": "positive",
            "PublishDate": 1739274015000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels to Consider Q3 Results",
            "Summary": "Apeejay Surrendra Park Hotels has announced that it will consider its third quarter (Q3) financial results on February 8. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738583992000,
            "Source": "result"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Inaugurates Luxury Palace Hotel in Punjab",
            "Summary": "Apeejay Surrendra Park Hotels has launched a new luxury palace hotel called Ran Baas in Punjab. This expansion marks the company's entry into the high-end heritage hotel segment, potentially enhancing its portfolio and market presence in the luxury hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1737418853000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Inaugurates Luxury Palace Hotel in Punjab",
            "Summary": "Apeejay Surrendra Park Hotels has inaugurated a new luxury palace hotel called Ran Baas in Punjab. This expansion marks the company's entry into the high-end heritage hotel segment, potentially enhancing its portfolio and market presence in the luxury hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1737376655000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apeejay Surrendra Park Hotels Opens New 'Zone Connect by The Park' in Prayagraj",
            "Summary": "Apeejay Surrendra Park Hotels has announced the soft opening of a new hotel property called 'Zone Connect by The Park' in Prayagraj, Uttar Pradesh. This expansion marks the company's growth in the hospitality sector and its entry into a new market within Uttar Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1736408067000,
            "Source": "corporate_action"
        },
        {
            "Title": "Apeejay Surrendra Park Reports Q2 EBITDA Decline",
            "Summary": "Apeejay Surrendra Park's Q2 EBITDA decreased to 410 million rupees from 450 million rupees year-over-year. The company's EBITDA margin also fell to 28.87% from 33.09% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731337908000,
            "Source": "result"
        },
        {
            "Title": "Apeejay Surrendra Park Reports Q2 Financial Results",
            "Summary": "Apeejay Surrendra Park announced its Q2 financial results. The company reported a consolidated net profit of 268 million rupees, up from 148 million rupees year-over-year. However, it showed a loss of 19 million rupees compared to the previous quarter. Q2 revenue increased to 1.4 billion rupees from 1.35 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731337821000,
            "Source": "result"
        }
    ]
}