{
    "Symbol": "PARSVNATH",
    "ISIN": "INE561H01026",
    "News": [
        {
            "Title": "Parsvnath Developers Board Meet Set for Feb 11",
            "Summary": "Parsvnath Developers has scheduled a board meeting for February 11, 2026, to consider and approve Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770223656479,
            "Source": "co_actions_results"
        },
        {
            "Title": "IDBI Trusteeship sells 88.9L Parsvnath shares",
            "Summary": "IDBI Trusteeship Services disposed of 88,90,984 equity shares of Parsvnath Developers through open market transactions, reducing its holding from 7.26% to 5.22% following debenture default events.",
            "Sentiment": "negative",
            "PublishDate": 1766555808207,
            "Source": "co_actions_results"
        },
        {
            "Title": "Parsvnath Developers Pays ₹1.53L Fine for Delayed Results",
            "Summary": "Parsvnath Developers paid ₹76,700 each to BSE and NSE on December 18, 2025, totaling ₹1.53 lakh in fines for delayed submission of Q2 FY26 financial results under Regulation 33.",
            "Sentiment": "negative",
            "PublishDate": 1766146440751,
            "Source": "stocks"
        },
        {
            "Title": "Parsvnath Developers Reports Rs 5,859 Crore Loss in Q2 FY26 Amid Ongoing Legal Disputes",
            "Summary": "Parsvnath Developers Limited posted a standalone net loss of Rs 5,859.34 crore for the quarter ended September 30, 2025, compared to Rs 5,541.38 crore loss in the same period last year. The company faces multiple arbitration proceedings with DMRC over BOT projects worth thousands of crores, with auditors expressing qualified opinions on asset recoverability and going concern uncertainties.",
            "Sentiment": "negative",
            "PublishDate": 1764419992558,
            "Source": "earnings"
        },
        {
            "Title": "Unity Group and Parsvnath Target Rs 120 Crore Annual Rental Income from New Delhi Mall",
            "Summary": "Parsvnath Developers and Unity Group have opened their new shopping mall 'Unity One Elegante' at Netaji Subhash Place, Delhi, expecting annual rental income of Rs 120 crore. The mall spans 5 lakh square feet of leasable area and has achieved 100% occupancy of its retail space. The project was developed through an equal joint venture formed in 2023 via special purpose vehicle 'Unity Parsvnaths LLP'. The joint venture pays approximately Rs 20 crore annually as lease rental to Delhi Metro Rail Corporation. Unity Group currently operates six malls across Delhi and Mohali totaling 2 million square feet, while Parsvnath Group has presence in over 37 cities across 13 states.",
            "Sentiment": "positive",
            "PublishDate": 1762138795505,
            "Source": "stock"
        },
        {
            "Title": "Parsvnath Developers Reports Quarterly Profit, Appoints New Company Secretary",
            "Summary": "Parsvnath Developers Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and appointed Mr. Atul Kumar Gupta as Company Secretary and Compliance Officer. The company reported standalone profit after tax of Rs. 806.46 lakhs for the quarter, compared to a loss of Rs. 4,297.98 lakhs in the same period last year. However, on consolidated basis, the company posted a loss of Rs. 5,920.45 lakhs. The company recognized exceptional gains of Rs. 6,883.56 lakhs on standalone basis and Rs. 7,060.06 lakhs on consolidated basis, primarily from compensation received from Chandigarh Administration. Revenue from operations declined to Rs. 1,338.02 lakhs on standalone basis from Rs. 3,565.67 lakhs in the previous year quarter. The company continues to face multiple ongoing arbitration proceedings with DMRC and other parties, with various projects under dispute. The auditors have expressed qualified opinions citing uncertainties around asset recoverability and going concern issues due to the company's tight liquidity situation.",
            "Sentiment": "neutral",
            "PublishDate": 1760710352134,
            "Source": "corporate_action"
        },
        {
            "Title": "Parsvnath Developers Opens 'Unity One Elegante' Shopping Mall in Delhi Through Joint Venture",
            "Summary": "Parsvnath Developers Limited opened a new shopping mall called 'Unity One Elegante' at Netaji Subhash Place, Delhi. The mall was developed through the company's special purpose vehicle 'Unity Parsvnaths LLP', a joint venture with Unity Group. The mall was inaugurated on October 15, 2025, and has received an Occupancy-Cum-Completion Certificate from Delhi Development Authority. Built on 28,400 square meters of land, the mall has a total leasable super built-up area of 4,89,530 square feet, with almost the entire area already leased out. The mall houses major retail brands including PVR-Luxe, Lifestyle, H&M, Apple, and various dining establishments. Chairman Pradeep Jain stated that the company is focusing on developing new commercial projects with strategic and joint venture partners to strengthen the Parsvnaths brand value.",
            "Sentiment": "positive",
            "PublishDate": 1760592578907,
            "Source": "stock"
        },
        {
            "Title": "Parsvnath Developers Receives Occupancy Certificate for Unity One Elegante Mall in Delhi",
            "Summary": "Parsvnath Developers has completed construction of the Unity One Elegante Mall in Delhi and received the occupancy certificate. The mall includes luxury brands and family entertainment areas.",
            "Sentiment": "positive",
            "PublishDate": 1759824030387,
            "Source": "stock"
        },
        {
            "Title": "Parsvnath Developers Appoints Development Manager for 112.856-Acre Rajpura Township Project",
            "Summary": "Parsvnath Developers Limited announced details about its integrated township project in Rajpura, Punjab, spanning 112.856 acres. The project is located along GT Road near Shambu Border Railway Station, 20 km from Ambala and Chandigarh. The township will include plots, group housing, commercial complexes, clubs, and schools. The company has appointed Emperor Infratech Private Limited as Development Manager through a Development Management Agreement. The Development Manager will handle development services, completion, implementation, sales, marketing, and maintenance of the project in a time-bound manner, focusing on delivering possession to existing customers and selling unsold inventory. Chairman Pradeep Jain stated the company is focusing on execution of ongoing projects to achieve 'Mission Possession.' Parsvnath Group operates across 37 cities in 13 states and has delivered 68 projects.",
            "Sentiment": "positive",
            "PublishDate": 1758608009474,
            "Source": "stock"
        },
        {
            "Title": "Parsvnath Developers Launches New Project Parsvnath Palacia in Greater Noida",
            "Summary": "Parsvnath Developers announced the launch of Parsvnath Palacia, a new project in Greater Noida spanning 8.65 acres. The company has partnered with Opaa Realty to ensure quick completion of the project and has secured co-development approval from the Greater Noida Industrial Development Authority (GNIDA).",
            "Sentiment": "positive",
            "PublishDate": 1758098438139,
            "Source": "stock"
        },
        {
            "Title": "Parsvnath Developers Reports Progress on La-Tropicana Delhi Project with 2025 Completion Target",
            "Summary": "Parsvnath Developers provided an update on its La-Tropicana project in Delhi. The project includes 505 planned flats, with fit-outs offered for 353 units. Phase-III construction is currently ongoing, with completion anticipated in 2025. The company obtained a Fire Safety Certificate on September 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757921771392,
            "Source": "stock"
        },
        {
            "Title": "Parsvnath Developers Reports Rs 347 Crore Loss in FY25",
            "Summary": "Parsvnath Developers Ltd reported a consolidated net loss of Rs 347.27 crore in FY25, an improvement from the Rs 594.13 crore loss in the previous year. The company's total income declined to Rs 303.45 crore in FY25 from Rs 493.72 crore in the preceding fiscal. The Delhi-based real estate firm develops housing and commercial projects in North India.",
            "Sentiment": "negative",
            "PublishDate": 1756880607851,
            "Source": "earnings"
        },
        {
            "Title": "Parsvnath Developers Reschedules Board Meeting to August 31 for Q4 and FY 2024-25 Results",
            "Summary": "Parsvnath Developers Limited has rescheduled its Board of Directors meeting from September 1, 2025, to August 31, 2025. The meeting will consider and approve the audited financial results for Q4 and FY 2024-25, and recommend dividends if any. The company's trading window remains closed until 48 hours after the financial results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1756302489658,
            "Source": "corporate_action"
        },
        {
            "Title": "Parsvnath Developers Delays Financial Results Submission Due to Pending Annual Statements",
            "Summary": "Parsvnath Developers Limited has delayed submitting financial results for the quarter ended June 30, 2025, because the company has not yet finalized its annual financial statements for the year ended March 31, 2025 due to unavoidable circumstances. The company stated it cannot approve and publish the quarterly results until the annual statements are completed. Parsvnath is working to resolve the issues and will inform stock exchanges about upcoming meetings to approve both the annual financial statements and quarterly results. The communication was signed by Chairman Pradeep Kumar Jain.",
            "Sentiment": "negative",
            "PublishDate": 1755064300540,
            "Source": "stock"
        }
    ]
}