{
    "Symbol": "PASHUPATI",
    "ISIN": "INE124Y01010",
    "News": [
        {
            "Title": "Pashupati Cotspin Limited Appoints New Company Secretary and Compliance Officer",
            "Summary": "Pashupati Cotspin Limited's Board of Directors approved the appointment of Ms. Tanvi Mafatlal Patel as Whole-Time Company Secretary, Compliance Officer, and Key Managerial Personnel effective November 14, 2025. The appointment follows the resignation of Mrs. Bijal Kaivan Thakkar from these positions and ensures compliance with SEBI LODR Regulations and Companies Act provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1763148222108,
            "Source": "earnings"
        },
        {
            "Title": "Pashupati Cotspin Reports 6.7% Growth in Q2 Net Profit to 40M Rupees",
            "Summary": "Pashupati Cotspin delivered quarterly results showing net profit growth to 40M rupees from 37.5M rupees year-over-year, alongside revenue expansion to 2.42B rupees from 1.89B rupees. The company's EBITDA increased to 85M rupees from 78M rupees, though EBITDA margin compressed to 3.51% from 4.15% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1763134024707,
            "Source": "earnings"
        },
        {
            "Title": "Pashupati Cotspin Reports Q1 Results, Company Secretary Resigns",
            "Summary": "Pashupati Cotspin Limited's Board approved unaudited standalone and consolidated financial results for the half year ended June 30, 2025. The company reported standalone revenue from operations of ₹10,608.46 lakhs for the quarter, down from ₹15,572.40 lakhs in the same quarter last year. Net profit stood at ₹203.03 lakhs compared to ₹236.43 lakhs in the previous year quarter. The company announced the resignation of Mrs. Bijal Kaivan Thakkar from her position as Company Secretary and Compliance Officer, effective August 13, 2025, citing personal reasons. Following her resignation, Mr. Saurin Jagdishbhai Parikh (Chairman & Managing Director) and Mr. Haresh Rameshchandra Shah (Chief Financial Officer) will act as Key Managerial Personnel for regulatory disclosures. The company migrated from NSE's SME platform to the main boards of NSE and BSE with effect from July 17, 2025, and adopted Indian Accounting Standards from April 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755097662389,
            "Source": "earnings"
        },
        {
            "Title": "Pashupati Cotspin Schedules Board Meeting on August 13 to Approve Quarterly Financial Results",
            "Summary": "Pashupati Cotspin Limited will hold a Board of Directors meeting on August 13, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The company recently migrated from NSE's SME platform (EMERGE) to the main boards of NSE and BSE, with listing effective July 17, 2025. Following this migration, the submission of quarterly financial results became applicable to the company. The trading window for company securities has been closed since July 17, 2025, and will remain closed until 48 hours after the financial results are approved.",
            "Sentiment": "neutral",
            "PublishDate": 1754646613467,
            "Source": "corporate_action"
        },
        {
            "Title": "Pashupati Cotspin Sets QIP Floor Price",
            "Summary": "Pashupati Cotspin has announced that the floor price for their Qualified Institutional Placement (QIP) issue has been set at 505.55 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1729769173000,
            "Source": "corporate_action"
        }
    ]
}