{
    "Symbol": "PASUPTAC",
    "ISIN": "INE818B01023",
    "News": [
        {
            "Title": "Pasupati Acrylon Q3FY26 Net Profit Jumps 154% YoY",
            "Summary": "Pasupati Acrylon reported strong Q3FY26 results with net profit rising 154% YoY to ₹25.69 crore. Revenue increased 55% to ₹269.23 crore, driven by ethanol segment performance.",
            "Sentiment": "positive",
            "PublishDate": 1770814241265,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pasupati Acrylon Board Meet Set for Feb 11, 2026",
            "Summary": "Pasupati Acrylon Limited has scheduled its board meeting for February 11, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770140764126,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pasupati Acrylon Reports Strong Quarterly Performance with 82% Jump in Earnings Per Share",
            "Summary": "Pasupati Acrylon Limited announced its quarterly results for the period ended September 30, 2025. The company reported revenue from operations of Rs. 280.25 crore compared to Rs. 124.44 crore in the same quarter last year. Net profit increased to Rs. 16.20 crore from Rs. 2.73 crore in the previous year quarter. Earnings per share rose to Rs. 1.82 from Rs. 0.31 in the corresponding quarter. The company operates three business segments: Fibre (Rs. 137.98 crore revenue), CPP Film (Rs. 26.77 crore), and Ethanol (Rs. 115.50 crore). Total assets stood at Rs. 644.97 crore. The board meeting was held on November 7, 2025, where directors approved the unaudited financial results. The company had established a 150KL per day grain-based distillery for ethanol blended petrol as an additional segment in March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762512619150,
            "Source": "earnings"
        },
        {
            "Title": "Pasupati Acrylon Secures ₹215 Crore Ethanol Supply Contract for FY 2025-26",
            "Summary": "Pasupati Acrylon has been granted an order to supply 32,320 KL of ethanol worth ₹215 crore for FY 2025-26. The contract involves supply to three major oil marketing companies: BPCL, IOCL, and HPCL. This deal is expected to boost the company's annual revenue by approximately 40%. The company has a market capitalization of ₹400 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761802366123,
            "Source": "stock"
        },
        {
            "Title": "National Company Law Tribunal Approves Merger of Pasupati Acrylon's Promoter Group Companies",
            "Summary": "The National Company Law Tribunal, New Delhi Bench has approved a scheme of amalgamation for the merger of several promoter group companies into Arihant Exports Private Limited. The merger involves MVA Finance Private Limited, Inder Overseas Private Limited, Nityanand Exports and Consultants Company Private Limited, and VMA Finance Private Limited merging into Arihant Exports Private Limited. Following the merger, the shareholding structure of the promoter group in Pasupati Acrylon Limited will undergo inter-se changes, with shares held by the merging entities being consolidated into Arihant Exports Private Limited. The aggregate holding of the promoter and promoter group in Pasupati Acrylon Limited will remain unchanged at 65.87%. Pasupati Acrylon Limited is not a direct party to the scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1758713320690,
            "Source": "corporate_action"
        },
        {
            "Title": "Pasupati Acrylon Limited Reconstitutes Board Committees with New Leadership Structure",
            "Summary": "Pasupati Acrylon Limited has reconstituted five Board committees effective September 18, 2025. The Audit Committee is now chaired by Mr. Raj Ganesh Viswanathan with four other members including three independent directors and one executive director. The Nomination & Remuneration Committee is led by Mr. Sanjiv Nair with two other independent directors as members. Mrs. Kamlesh Gupta chairs the Stakeholders Relationship Committee alongside two executive directors. The Corporate Social Responsibility Committee is headed by Mr. Raj Ganesh Viswanathan with Executive Managing Director Mr. Vineet Jain and Executive Director Mr. Satya Prakash Gupta as members. The Risk Management Committee is chaired by Mr. Sanjiv Nair with three other directors. The reconstitution follows an earlier intimation dated August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758179631787,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pasupati Acrylon Appoints Two Independent Directors for Five-Year Terms",
            "Summary": "Pasupati Acrylon Limited appointed Mr. Sudhir Agarwal and Mr. Sanjiv Nair as Non-Executive Independent Directors for five-year terms from September 1, 2025 to August 31, 2030. The appointments were approved by shareholders at the company's 42nd Annual General Meeting held on September 18, 2025. Mr. Sudhir Agarwal holds a B.Tech in Chemical Engineering and has over 39 years of experience in chemical and process industries. Mr. Sanjiv Nair is a retired Indian Administrative Services officer who served as Additional Chief Secretary of Uttar Pradesh and was the first Director General of the North East Centre for Technology Application and Reach. Both directors are not related to any existing directors or key managerial personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758178487559,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pasupati Acrylon Reports Q1 FY26 Results, Announces Board Changes and Committee Restructuring",
            "Summary": "Pasupati Acrylon Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 168.32 crore compared to Rs. 154.80 crore in the previous quarter and Rs. 216.05 crore in the same quarter last year. Profit for the period stood at Rs. 11.27 crore versus Rs. 11.25 crore in the previous quarter and Rs. 11.34 crore in the corresponding quarter of the previous year. The company operates in three segments: Fibre (Rs. 137.12 crore revenue), CPP Film (Rs. 23.12 crore), and Ethanol (Rs. 55.81 crore). Two independent directors, S.C. Malik and D.K. Kapila, will retire upon completion of their second terms at the 42nd Annual General Meeting on September 18, 2025. The board appointed Sudhir Agarwal and Sanjiv Nair as additional non-executive independent directors effective September 1, 2025, subject to shareholder approval for five-year terms. All board committees including Audit, Nomination & Remuneration, Stakeholders Relationship, Corporate Social Responsibility, and Risk Management will be reconstituted effective September 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755088545992,
            "Source": "corporate_action"
        },
        {
            "Title": "Pasupati Acrylon Secures Ethanol Allocation Worth 630 Million Rupees",
            "Summary": "Pasupati Acrylon has been allocated 9,798 KL of ethanol for Q3 2024-25. The allocation carries an estimated contract value of 630 million rupees. This ethanol allocation represents a significant business opportunity for the company during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753275294815,
            "Source": "stock"
        },
        {
            "Title": "Pasupati Acrylon Secures Rs 63 Crore Ethanol Supply Contract for Q3 2024-25",
            "Summary": "Pasupati Acrylon Limited has been allocated quantities to supply 9,798 kilolitres of ethanol to oil marketing companies including Bharat Petroleum Corporation Limited (BPCL), Indian Oil Corporation Limited (IOCL), and Hindustan Petroleum Corporation Limited (HPCL) for Q3 of Ethanol Supply Year 2024-25. The allocation covers the period from May 2025 to July 2025 and has an estimated value of Rs. 63.00 crore. The ethanol will be produced from damaged food grains, surplus FCI rice and maize under the Ethanol Blended Petrol Programme (EBPP). The company confirmed that promoters have no interest in the awarding entities and the contract does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753275199499,
            "Source": "order&deals"
        },
        {
            "Title": "Pasupati Acrylon Resumes Manufacturing After Fire Incident",
            "Summary": "Pasupati Acrylon has restarted its manufacturing operations following a temporary halt due to a fire in the cooling tower. The company had previously suspended production activities as a result of the incident.",
            "Sentiment": "neutral",
            "PublishDate": 1750243837000,
            "Source": "default"
        },
        {
            "Title": "Pasupati Acrylon Reports Q4 Financial Results",
            "Summary": "Pasupati Acrylon has released its Q4 financial results. The company's EBITDA for Q4 was 136 million rupees, down from 161 million rupees in the same quarter last year. The EBITDA margin decreased to 8.10% from 9.10% year-over-year. Net profit for Q4 was 113 million rupees, compared to 125 million rupees in the previous year and 101 million rupees in the previous quarter. Q4 revenue stood at 1.7 billion rupees, down from 1.8 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747656390000,
            "Source": "result"
        },
        {
            "Title": "Pasupati Acrylon Receives Ethanol Allocation for Q2 and Q4",
            "Summary": "Pasupati Acrylon has been allocated 3,450 KL of ethanol valued at 201.8 million rupees for Q2, and 12,375 KL of ethanol valued at 889.3 million rupees for Q4.",
            "Sentiment": "positive",
            "PublishDate": 1742887582000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pasupati Acrylon Receives Ethanol Supply Allocation",
            "Summary": "Pasupati Acrylon Limited has received an allocation for the supply of ethanol. This news indicates that the company has secured a contract or agreement to provide ethanol to a customer or market.",
            "Sentiment": "positive",
            "PublishDate": 1742887505000,
            "Source": "order&deals"
        },
        {
            "Title": "Pasupati Acrylon Completes 150 KL Per Day Grain-Based Ethanol Plant",
            "Summary": "Pasupati Acrylon has announced the completion of its proposed 150 KL per day grain-based ethanol plant. The company, with a market capitalization of 390 crore rupees, has successfully set up this new production facility.",
            "Sentiment": "positive",
            "PublishDate": 1741668835000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pasupati Acrylon: Q3 Profit Rises 11.44% YoY to ₹10.13 Crore",
            "Summary": "Pasupati Acrylon reported Q3 FY25 results with revenue at ₹173.87 crore, up 11.41% YoY. Profit increased by 11.44% YoY to ₹10.13 crore. Operating income grew 440.37% QoQ and 7.88% YoY. EPS rose to ₹1.14, up 11.76% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1739425770000,
            "Source": "earnings"
        },
        {
            "Title": "Pasupati Acrylon Reports Q2 EBITDA Turnaround",
            "Summary": "Pasupati Acrylon has reported a significant improvement in its Q2 financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a gain of 41 million rupees, compared to a loss of 129 million rupees in the same quarter of the previous year. The Q2 EBITDA margin was reported at 3.31%.",
            "Sentiment": "positive",
            "PublishDate": 1730893723000,
            "Source": "result"
        },
        {
            "Title": "Pasupati Acrylon Reports Profit in Q2 FY2024",
            "Summary": "Pasupati Acrylon has reported a net profit of 27 million rupees in Q2, compared to a loss of 96 million rupees in the same quarter last year. The company's profit has also increased from 113 million rupees in the previous quarter. Revenue for Q2 stood at 1.24 billion rupees, slightly up from 1.22 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730893623000,
            "Source": "result"
        }
    ]
}