{
    "Symbol": "PATANJALI",
    "ISIN": "INE619A01035",
    "News": [
        {
            "Title": "Patanjali Foods Grants 52.71 Lakh ESOPs to Employees",
            "Summary": "Patanjali Foods' board committee approved ESOP Grant IV of 52,71,793 stock options under its 2023 employee plan, with exercise price at 20% discount to market price.",
            "Sentiment": "positive",
            "PublishDate": 1770876209771,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patanjali Foods Board Meet Set for Feb 11, 2026",
            "Summary": "Patanjali Foods Limited has scheduled a board meeting on February 11, 2026, to consider Q3FY26 unaudited financial results. Trading window closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770122365448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patanjali Foods Block Trade Worth Rs. 25.50 Crores",
            "Summary": "Patanjali Foods executed a significant NSE block trade valued at Rs. 25.50 crores involving approximately 508,003 shares at Rs. 501.95 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769572756116,
            "Source": "co_actions_results"
        },
        {
            "Title": "GQG Partners Reduces Patanjali Foods Stake by 0.9%",
            "Summary": "GQG Partners has reduced its shareholding in Patanjali Foods by 0.9% during Q3, marking a notable change in the institutional investor's position in the FMCG company.",
            "Sentiment": "neutral",
            "PublishDate": 1768806156426,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patanjali Foods Block Trade Worth ₹16.72 Crores",
            "Summary": "Patanjali Foods executed a significant NSE block trade involving 292,314 shares at ₹572.00 per share, totaling ₹16.72 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767845677104,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patanjali Foods Invests ₹35 Cr in Subsidiary RFPL",
            "Summary": "Patanjali Foods Limited announces ₹35 crore investment in wholly-owned subsidiary Rishikrishni Farming Private Limited through rights issue of 3.5 crore zero percent redeemable preference shares.",
            "Sentiment": "positive",
            "PublishDate": 1767616269724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patanjali Foods Acquires 51% Stake in Health Startup",
            "Summary": "Patanjali Foods Ltd announces acquisition of majority stake in health food startup to expand product portfolio and strengthen market position in the health segment.",
            "Sentiment": "positive",
            "PublishDate": 1766559927559,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patanjali Foods Promoter Group Donates 60L Shares",
            "Summary": "Yogakshem Sansthan, part of Patanjali Foods' promoter group, donated 60 lakh equity shares on December 19, 2025, reducing its shareholding from 8.16% to 7.61% in the FMCG company.",
            "Sentiment": "neutral",
            "PublishDate": 1766470714028,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patanjali Foods Sees ₹53.63 Cr NSE Block Trade",
            "Summary": "Patanjali Foods Limited witnessed a significant block trade on NSE worth ₹53.63 crores involving 1,007,357 shares at ₹532.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765376619093,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patanjali Foods Sees Rs. 53.63 Crore Block Trade on NSE",
            "Summary": "Patanjali Foods executed a block trade worth Rs. 53.63 crores involving approximately 1,007,357 shares at Rs. 532.40 per share on the NSE. The transaction represents a significant institutional trading activity for the food company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1765349464198,
            "Source": "order&deals"
        },
        {
            "Title": "Patanjali Foods Limited Receives Rs 63.32 Lakh Penalty for GST Input Tax Credit Non-Reversal",
            "Summary": "Patanjali Foods Limited has been penalized Rs 63,32,245 by the Office of the Commissioner of Central Excise Central Tax, Mangalore for non-reversal of Input Tax Credit under CGST Act provisions. The company states there is no material impact on financial or operational activities except for the penalty amount and is filing an appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1765283988772,
            "Source": "stock"
        },
        {
            "Title": "Patanjali Foods Sees Rs. 154.90 Crore Block Trade on NSE",
            "Summary": "Patanjali Foods executed a block trade worth Rs. 154.90 crores involving approximately 2,868,607 shares at Rs. 540.00 per share on the NSE. The transaction represents a significant trading activity for the company's shares in the block deal segment.",
            "Sentiment": "neutral",
            "PublishDate": 1765274321516,
            "Source": "order&deals"
        },
        {
            "Title": "Patanjali Foods Declares Interim Dividend of Rs. 1.75 Per Share",
            "Summary": "Patanjali Foods Limited's Board of Directors approved an interim dividend of Rs. 1.75 per equity share with a face value of Rs. 2 each for Financial Year 2025-26. The dividend payment will be made on or before December 07, 2025. The company has set November 13, 2025 as the record date to determine eligible shareholders for the dividend payment. The board meeting was held on November 08, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762582006887,
            "Source": "corporate_action"
        },
        {
            "Title": "Delhi High Court Criticizes Patanjali Over 'Dhoka' Chyawanprash Advertisement in Dabur Lawsuit",
            "Summary": "The Delhi High Court criticized Patanjali for its chyawanprash advertisement that refers to competitors' products as 'dhoka' (fraud or deception). Justice Tejas Karia stated that while Patanjali can claim to be the best, it cannot call competitors fraud, suggesting they could use words like 'inferior' instead. The court reserved its verdict on an interim injunction application in a disparaging ads case filed by Dabur against Patanjali. Dabur alleges that Patanjali's advertisement falsely claims its chyawanprash contains '51 Ayurvedic herbs and saffron' despite a 2014 government advisory deeming such claims misleading. Dabur also contends that Patanjali's use of 'Special' as a prefix violates Drug Rules regarding misleading labelling of Ayurvedic formulations. Patanjali's legal team defended the advertisement as permissible puffery and hyperbole, arguing they are allowed to claim superiority over competitors.",
            "Sentiment": "negative",
            "PublishDate": 1762427222624,
            "Source": "stock"
        },
        {
            "Title": "Patanjali Foods Board to Consider Interim Dividend Declaration",
            "Summary": "Patanjali Foods Limited has announced that its Board of Directors will meet on November 8, 2025, to consider declaring an interim dividend for shareholders for the financial year 2025-26. The record date for determining shareholder entitlement to the interim dividend has been set as November 13, 2025, subject to board approval. The company's trading window will remain closed from November 5 to November 8, 2025, during which designated persons and connected persons are advised not to trade in the company's securities. Shareholders are required to update their tax residential status and PAN details with depositories and provide requisite documents to the company's registrar by November 13, 2025, for appropriate tax deduction at source on dividend payments.",
            "Sentiment": "positive",
            "PublishDate": 1762254599946,
            "Source": "corporate_action"
        },
        {
            "Title": "Patanjali Foods' Statutory Auditor Chaturvedi Shah LLP Resigns Over Fee Dispute",
            "Summary": "Chaturvedi Shah LLP resigned as statutory auditor of Patanjali Foods Limited with immediate effect from November 3, 2025. The resignation followed management discussions regarding revision and reduction of existing audit remuneration. The auditing firm had previously expressed their intention to resign in October 2025 after email communications from the company in September 2025 about fee reductions. Chaturvedi Shah LLP was appointed for a second term in September 2022 for five consecutive years until 2027. Walker Chandiok Co. LLP will continue as the company's statutory auditors. The resigning firm had issued audit reports for the year ended March 31, 2025, and limited review reports for quarters ended June 30, 2025, and September 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762174325151,
            "Source": "corporate_governance"
        },
        {
            "Title": "Patanjali Foods Reports 68% Jump in Q2 Net Profit to 5.2 Billion Rupees",
            "Summary": "Patanjali Foods reported quarterly net profit of 5.2 billion rupees compared to 3.1 billion rupees in the same period last year. Revenue increased to 97.99 billion rupees from 81.54 billion rupees year-on-year. EBITDA rose to 5.5 billion rupees from 4.6 billion rupees, while EBITDA margin decreased slightly to 5.63% from 5.71% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762128823971,
            "Source": "earnings"
        },
        {
            "Title": "Patanjali Foods Projects 8-10% Food Business Growth, 15% HPC Growth",
            "Summary": "Patanjali Foods expects 8-10% growth in its food business and 15% growth in its home and personal care (HPC) business. The company's management anticipates a 300-400 basis points volume increase due to GST changes.",
            "Sentiment": "positive",
            "PublishDate": 1761994655610,
            "Source": "stock"
        },
        {
            "Title": "Patanjali Foods Reports Record Q2FY26 Performance with Revenue of ₹9,799 Crores",
            "Summary": "Patanjali Foods Limited achieved its strongest quarterly and half-yearly performance with revenue from operations reaching ₹9,798.84 crores in Q2FY26. The company reclassified its segment as FMCG to include Food FMCG and HPC business, with the FMCG segment contributing 29.44% of revenue from operations and EBITDA margins at 12.28%. For H1FY26, revenue from operations stood at ₹18,565 crores compared to ₹15,251 crores in the previous year. The company expanded its oil palm plantation area to over 1 lakh hectares and expects 55% of its FMCG portfolio to benefit from revised GST rates. Export revenues reached ₹51.69 crores in Q2FY26, with the company now present in 35 countries. The edible oil segment showed strong growth momentum with branded edible oil sales contributing 76% of total edible oil sales. Key product categories including biscuits, dental care, and cow ghee reported significant growth during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761988762961,
            "Source": "earnings"
        },
        {
            "Title": "Patanjali Foods Reports Q2 EBITDA Growth to 5.5 Billion Rupees",
            "Summary": "Patanjali Foods reported Q2 EBITDA of 5.5 billion rupees, representing an increase from 4.6 billion rupees in the same period last year. However, the company's EBITDA margin declined to 5.63% compared to 5.71% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761910987465,
            "Source": "earnings"
        },
        {
            "Title": "Patanjali Foods Reports 68% Jump in Quarterly Net Profit to 5.2 Billion Rupees",
            "Summary": "Patanjali Foods reported net profit of 5.2 billion rupees for Q2, compared to 3.1 billion rupees in the same period last year. The company's revenue increased to 97.99 billion rupees from 81.54 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761910531074,
            "Source": "earnings"
        },
        {
            "Title": "Patanjali Foods Signs ₹1,000 Crore Investment Agreement with Ministry of Food Processing Industries",
            "Summary": "Patanjali Foods Limited has signed an agreement with the Ministry of Food Processing Industries for an investment of up to ₹1,000 crores. The investment is subject to financial review and approvals.",
            "Sentiment": "positive",
            "PublishDate": 1759472181279,
            "Source": "stock"
        },
        {
            "Title": "Patanjali Foods Expects 300-400 Basis Points Growth in Food Business Over Next Two Months",
            "Summary": "Patanjali Foods anticipates growth of 300-400 basis points in its food business segment over the next two months.",
            "Sentiment": "positive",
            "PublishDate": 1757909882003,
            "Source": "stock"
        },
        {
            "Title": "Patanjali Foods Sets Final Deadline for 2:1 Bonus Share Eligibility",
            "Summary": "Patanjali Foods has declared a 2:1 bonus issue with September 11 as the record date. Shareholders will receive two additional equity shares for every one share held. Due to T+1 settlement in Indian markets, investors must purchase shares by the final trading day to be eligible. The bonus shares will be issued by capitalizing free reserves, securities premium, or retained earnings. While the number of shares increases, the overall investment value remains unchanged as share prices adjust proportionately. Patanjali Foods shares closed flat at Rs 1,802 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757472570068,
            "Source": "corporate_action"
        },
        {
            "Title": "Patanjali Foods Receives AEO-T2 Certification from Directorate of International Customs",
            "Summary": "Patanjali Foods has received Authorized Economic Operator (AEO-T2) certification from the Directorate of International Customs. This certification relates to the company's international trade operations.",
            "Sentiment": "positive",
            "PublishDate": 1755502955888,
            "Source": "stock"
        },
        {
            "Title": "Patanjali Foods Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Patanjali Foods reported Q1 net profit of 1.8 billion rupees, down from 2.6 billion rupees in the same period last year. Revenue increased to 88.99 billion rupees compared to 71.7 billion rupees year-over-year. EBITDA declined to 3.2 billion rupees from 4 billion rupees, while EBITDA margin compressed to 3.61% from 5.66% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755172945546,
            "Source": "earnings"
        },
        {
            "Title": "Patanjali Foods Issues Bonus Shares in 2:1 Ratio, Urges Physical Shareholders to Dematerialize Holdings",
            "Summary": "Patanjali Foods Limited's Board of Directors has recommended issuing bonus shares in a 2:1 ratio, meaning two new equity shares of Rs. 2 each for every existing equity share held by eligible shareholders. The proposal is subject to shareholder approval through postal ballot e-voting, which runs from July 23, 2025, to August 21, 2025. Due to SEBI regulations effective May 23, 2023, bonus shares can only be allotted in dematerialized form. The company is appealing to physical shareholders to open demat accounts and complete KYC formalities to receive bonus shares and final dividend promptly. Shareholders holding physical shares must share demat account details with the Registrar and Transfer Agent, submit required forms including ISR-4, and update KYC documentation. For shareholders who remain in physical form on the record date, bonus shares will be transferred to a suspense escrow demat account until proper documentation is completed. The company has provided templates and guidance on its website for KYC updation processes.",
            "Sentiment": "neutral",
            "PublishDate": 1754894330303,
            "Source": "corporate_action"
        },
        {
            "Title": "Patanjali Foods Faces GST Appeal Worth Rs 27.46 Crore",
            "Summary": "The Principal Commissioner, CGST, Uttar Pradesh has filed an appeal against an order dated January 10, 2025 passed by ADC, Central Goods and Service Taxes, Meerut that was in favor of Patanjali Foods Limited. The original order reduced the GST demand to Rs. 44,82,198 plus penalty. If the appeal is successful, Patanjali Foods may be liable to pay Rs. 27.46 crore towards GST plus additional penalty. The company received intimation of the appeal on July 30, 2025 but became aware of it on August 5, 2025. Patanjali Foods states it does not expect any financial liability and will defend its case before the appellate authority. The company notes that exact financial implications cannot be determined until proceedings are completed.",
            "Sentiment": "negative",
            "PublishDate": 1754486414447,
            "Source": "stock"
        },
        {
            "Title": "Patanjali Foods Seeks Shareholder Approval for 2:1 Bonus Share Issue",
            "Summary": "Patanjali Foods Limited has issued a postal ballot notice seeking shareholder approval for issuing bonus shares in a 2:1 ratio - 2 new fully paid-up equity shares of ₹2 each for every 1 existing share. The company plans to capitalize up to ₹146 crore from its reserves including Capital Redemption Reserve, Securities Premium, or General Reserve for this purpose. The e-voting period runs from July 23 to August 21, 2025, with National Securities Depository Limited providing the voting facility. The cut-off date for eligible shareholders is July 18, 2025. Results will be announced by August 23, 2025. The bonus shares will be issued only in dematerialized form and will rank equally with existing shares. CS Prashant Diwan has been appointed as scrutinizer for the postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1753156439185,
            "Source": "corporate_action"
        },
        {
            "Title": "Patanjali Foods: First-Ever Bonus Share Issue Announced",
            "Summary": "Patanjali Foods Ltd. has declared its first bonus issue of shares in a 2:1 ratio. Shareholders will receive two bonus shares for every one share held on the record date, which is yet to be announced. The company has previously paid dividends in 2022, 2023, and 2024.",
            "Sentiment": "positive",
            "PublishDate": 1752734687000,
            "Source": "corporate_action"
        },
        {
            "Title": "Patanjali Foods Announces 2:1 Bonus Share Issue",
            "Summary": "Patanjali Foods has announced a bonus share issue at a ratio of 2:1. This means shareholders will receive two additional shares for every one share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1752734091000,
            "Source": "default"
        },
        {
            "Title": "Patanjali Foods Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 121,033 shares of Patanjali Foods Ltd. occurred on the National Stock Exchange (NSE) for Rs. 22.62 Crores. The trade was executed at a price of Rs. 1869.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752732033000,
            "Source": "block_details"
        },
        {
            "Title": "Patanjali Foods: Board to Consider First-Ever Bonus Share Issue",
            "Summary": "Patanjali Foods' shares have rallied 8% in two days, reaching Rs 1,813.60 on the BSE. The company's board will meet on July 17, 2025, to consider issuing bonus shares for the first time in its history, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1752654356000,
            "Source": "corporate_action"
        },
        {
            "Title": "Patanjali Foods: First Bonus Share Issue Under Consideration",
            "Summary": "Patanjali Foods Ltd. will consider its first-ever bonus share issue at a board meeting on July 17, 2025. The company, formerly known as Ruchi Soya, was acquired by Patanjali Ayurved in 2019. The stock is currently trading at ₹1,686.9, down 7% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1752552328000,
            "Source": "corporate_action"
        },
        {
            "Title": "Patanjali Foods to Consider Bonus Share Issue",
            "Summary": "Patanjali Foods has announced a board meeting scheduled for July 17 to consider the issuance of bonus shares. This potential corporate action could impact the company's share structure and value for existing shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1752512470000,
            "Source": "default"
        },
        {
            "Title": "Ban on Patanjali's Organic Wild Honey in Ladakh Lifted",
            "Summary": "The sale ban on Patanjali Foods' Organic Wild Honey in Ladakh has been lifted. This decision came after laboratory tests confirmed that the product meets the required safety standards. The lifting of the ban allows Patanjali to resume selling its honey product in the Ladakh region.",
            "Sentiment": "positive",
            "PublishDate": 1752126491000,
            "Source": "default"
        },
        {
            "Title": "Patanjali Foods Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 404,808 shares of Patanjali Foods Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 1634.90 per share. The total value of the transaction was Rs. 66.18 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1751873289000,
            "Source": "block_details"
        },
        {
            "Title": "Patanjali Foods Plans to Modify Company Constitution for Electricity Generation",
            "Summary": "Patanjali Foods is planning to modify its Memorandum and Articles of Association to expand into electricity generation. This move suggests the company is looking to diversify its operations beyond its current focus.",
            "Sentiment": "positive",
            "PublishDate": 1750082214000,
            "Source": "default"
        },
        {
            "Title": "Patanjali Foods Denies Receiving Communication from MCA on Alleged Company Law Lapses",
            "Summary": "Patanjali Foods has issued a clarification stating that it has not received any communication from the Ministry of Corporate Affairs (MCA) regarding alleged company law lapses. This statement appears to be in response to speculation or reports about potential regulatory issues.",
            "Sentiment": "neutral",
            "PublishDate": 1748834585000,
            "Source": "default"
        },
        {
            "Title": "Patanjali Foods: Q4 Profit Surges 74% YoY, Revenue Up 18%",
            "Summary": "Patanjali Foods reported a 74.3% YoY increase in Q4FY25 net profit to Rs 359 crore. Revenue from operations rose 17.8% YoY to Rs 9,692 crore. EBITDA grew 14.5% YoY to Rs 569 crore. Export revenues stood at Rs 73.44 crore, with presence in 29 countries.",
            "Sentiment": "positive",
            "PublishDate": 1747365151000,
            "Source": "earnings"
        },
        {
            "Title": "Patanjali Foods Reports Q4 Results and Dividend",
            "Summary": "Patanjali Foods announced its Q4 financial results. The company's net profit increased to 3.6 billion rupees, up from 2.06 billion rupees year-over-year and 3.7 billion rupees quarter-over-quarter. Revenue rose to 96.9 billion rupees from 82.22 billion rupees in the same quarter last year. The company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747354113000,
            "Source": "default"
        },
        {
            "Title": "Patanjali Foods: Q4 Profit Surges 76%, Dividend Proposed",
            "Summary": "Patanjali Foods reported a 76.3% YoY increase in Q4 consolidated net profit to ₹358.5 crore. Revenue rose 17.8% to ₹9,692.2 crore. EBITDA jumped 37.1% to ₹516.2 crore, with margins improving to 5.3%. The board recommended a final dividend of ₹2 per share, bringing the total dividend for FY25 to ₹10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747324383000,
            "Source": "earnings"
        },
        {
            "Title": "Patanjali Foods Reports Q4 Results and Dividend Recommendation",
            "Summary": "Patanjali Foods has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA increased to 5.2 billion rupees from 3.71 billion rupees year-over-year, with EBITDA margin improving to 5.33% from 4.51%. Net profit for Q4 rose to 3.6 billion rupees from 2.06 billion rupees year-over-year. Revenue for Q4 grew to 96.9 billion rupees from 82.22 billion rupees in the previous year. The company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747320692000,
            "Source": "result"
        },
        {
            "Title": "Patanjali Foods to Consider Q4 Results on May 15",
            "Summary": "Patanjali Foods has announced that it will consider its fourth quarter financial results on May 15. This is a routine corporate announcement regarding the company's upcoming earnings report.",
            "Sentiment": "neutral",
            "PublishDate": 1746624420000,
            "Source": "default"
        },
        {
            "Title": "GQG Partners Increases Stake in Patanjali Foods",
            "Summary": "GQG Partners has increased its stake in Patanjali Foods from 3.68% to 3.89% during the fourth quarter of the fiscal year. This represents a small but notable increase in the investment firm's holdings in the Indian consumer goods company.",
            "Sentiment": "positive",
            "PublishDate": 1745216684000,
            "Source": "default"
        },
        {
            "Title": "Patanjali Foods Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 104,481 shares of Patanjali Foods Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 1958.00 per share. The total value of the transaction amounted to Rs. 20.46 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1744782677000,
            "Source": "block_details"
        },
        {
            "Title": "Patanjali Foods: Jefferies Initiates Coverage with 'Buy' Rating",
            "Summary": "Jefferies initiated coverage on Patanjali Foods with a 'buy' rating and a target price of ₹2,050, citing product diversification and expansion. The stock rose 1.52% in Monday's trading. Separately, Patanjali Ayurved and DS Group are acquiring a 98% stake in Magma General Insurance for ₹4,500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1742193406000,
            "Source": "normal_news"
        },
        {
            "Title": "Adar Poonawalla to Sell Magma Insurance Stake to Patanjali Ayurved and DS Group",
            "Summary": "Adar Poonawalla is set to sell his stake in Magma Insurance to Patanjali Ayurved and DS Group for approximately Rs 4,500 crore. This transaction involves Patanjali Foods, suggesting a significant corporate action in the insurance and FMCG sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1742170287000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adar Poonawalla to Sell Magma Insurance Stake to Patanjali Ayurved and DS Group",
            "Summary": "Adar Poonawalla is set to sell his stake in Magma Insurance to Patanjali Ayurved and DS Group for approximately Rs 4,500 crore. This transaction represents a significant corporate action involving the transfer of ownership in the insurance sector.",
            "Sentiment": "neutral",
            "PublishDate": 1741880150000,
            "Source": "corporate_action"
        },
        {
            "Title": "Patanjali Foods Faces Prohibition Order on Organic Wild Honey Batch in Ladakh",
            "Summary": "Patanjali Foods has reported a prohibition order issued by the Ladakh administration on the sale of a specific batch of Patanjali Organic Wild Honey. The order was issued due to the presence of nitrofurans in the product. The company states that this incident will have no material impact on its financial activities, except for a minor loss of 1.4 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1741871905000,
            "Source": "corporate_governance"
        }
    ]
}