{
    "Symbol": "PATELRMART",
    "ISIN": "INE0R8B01010",
    "News": [
        {
            "Title": "Patel Retail Q3FY26 Results Show Strong Growth",
            "Summary": "Patel Retail Limited reports impressive Q3FY26 performance with total income rising 35.51% to ₹311.12 crore and PAT growing 95.89% to ₹12.00 crore, driven by retail expansion and manufacturing strength.",
            "Sentiment": "positive",
            "PublishDate": 1770655664066,
            "Source": "stocks"
        },
        {
            "Title": "Patel Retail Files Q3 FY26 Fund Utilisation Statement",
            "Summary": "Patel Retail Limited reports no deviation in fund utilisation for Q3 FY26, having raised Rs.205.48 crore through IPO and pre-IPO placement, with Rs.184.69 crore utilised as per original objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1770046562218,
            "Source": "stocks"
        },
        {
            "Title": "Patel Retail Q3 Net Profit Doubles to 120M Rupees",
            "Summary": "Patel Retail reports strong Q3 performance with net profit surging 96.72% year-on-year to 120 million rupees from 61 million rupees in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1770021602909,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patel Retail Opens 49th Store in Titwala",
            "Summary": "Patel Retail expands its retail footprint with the launch of 'Patel's R Mart' in Titwala, marking the company's 49th store milestone in its ongoing expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1768973070837,
            "Source": "stocks"
        },
        {
            "Title": "Patel Retail Bags ₹25 Crore Export Order",
            "Summary": "Patel Retail Limited secures international export order worth ₹25 crores for spices and FMCG products across UK, Italy, UAE, and Saudi Arabia with 45-day execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768901556490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patel Retail Opens 48th Store in Dombivili as Part of Mumbai Expansion",
            "Summary": "Patel Retail launched its 48th Patel's R Mart store in Dombivili, expanding its retail footprint in the Mumbai area. The company aims to grow its presence by offering quality essentials and groceries at competitive low prices to local consumers.",
            "Sentiment": "positive",
            "PublishDate": 1764571652843,
            "Source": "stock"
        },
        {
            "Title": "Patel Retail Reports Strong Q2 FY26 Results with 73% PAT Growth and Export Order Book of INR 50 Crores",
            "Summary": "Patel Retail Limited delivered exceptional quarterly performance with total income growing 14.97% to INR 225.43 crores, PAT surging 73.20% to INR 10.14 crores, and EBITDA margins expanding 108 basis points to 8.67%. The company opened its 47th store, secured new export orders worth INR 22 crores taking total export order book to INR 50 crores, and targets 60+ stores by FY27 with revenue guidance of 15-20% growth.",
            "Sentiment": "positive",
            "PublishDate": 1763732185694,
            "Source": "earnings"
        },
        {
            "Title": "Patel Retail Limited Schedules Q2 H1 FY26 Earnings Conference Call",
            "Summary": "Patel Retail Limited will conduct its Q2 H1 FY26 earnings conference call on November 19, 2025 at 3:00 PM IST to discuss financial performance for the quarter and half-year ended September 30, 2025. The virtual call will feature management speakers including Chairman & Managing Director Dhanji Patel, CEO Rahul Patel, and CFO, with dial-in and online registration options provided for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1763212211395,
            "Source": "earnings"
        },
        {
            "Title": "Patel Retail Limited Reports Strong Q2 Results and Appoints New Internal Auditor",
            "Summary": "Patel Retail Limited approved unaudited financial results for the quarter and half year ended September 30, 2025, showing revenue from operations of Rs 22,533.40 lakhs for Q2 and net profit of Rs 1,013.96 lakhs. The company also appointed CA Bhavisha Manish Motwani as Internal Auditor for a five-year term from 2025-2026 to 2029-2030, following board approval based on audit committee recommendations.",
            "Sentiment": "positive",
            "PublishDate": 1763067807064,
            "Source": "earnings"
        },
        {
            "Title": "Patel Retail Limited Opens New Store in Palghar District, Total Store Count Reaches 47",
            "Summary": "Patel Retail Limited has opened a new store named PATEL'S R MART located at Jaya Chhaya Complex in Kudus village, Wada Taluka, Palghar district. The store is situated next to State Bank on Bhiwandi Wada Road. With this new addition, the company's total store count now stands at 47 stores.",
            "Sentiment": "positive",
            "PublishDate": 1760319921504,
            "Source": "stock"
        },
        {
            "Title": "Patel Retail Limited Opens New Store in Kalyan East, Total Store Count Reaches 46",
            "Summary": "Patel Retail Limited has opened a new store named 'PATEL'S R MART' located at Shop no.28,29,30, New ERA Yogi Dham, Kalyan East, Kalyan- 421 301. The store has been assigned the code 'KYD'. With this new addition, the company's total store count has reached 46 stores. The announcement was made by Company Secretary & Compliance Officer Prasad Ramesh Khopkar.",
            "Sentiment": "positive",
            "PublishDate": 1759111638568,
            "Source": "stock"
        },
        {
            "Title": "Patel Retail Limited Approves Q1 FY2026 Financial Results and Appoints New Secretarial Auditor",
            "Summary": "Patel Retail Limited's Board of Directors approved the company's unaudited standalone financial results for the first quarter ended June 30, 2025. The company reported revenue from operations of ₹18,245.42 lakhs compared to ₹17,738.00 lakhs in the same quarter last year, and net profit of ₹692.42 lakhs versus ₹611.88 lakhs in the previous year's corresponding quarter. Basic and diluted earnings per share stood at ₹2.78 for the quarter. The Board also approved the appointment of Messer Deep Shukla & Associates as Secretarial Auditor for five consecutive financial years from 2025-26 to 2029-30, subject to shareholder approval. The company completed its IPO of 95,20,000 equity shares at ₹255 per share after the quarter ended, with shares listed on NSE and BSE on August 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757944812917,
            "Source": "earnings"
        },
        {
            "Title": "Patel Retail Limited Secures ₹22 Crore Export Order, Total Export Book Reaches ₹50 Crore",
            "Summary": "Patel Retail Limited has secured a new export order worth ₹22 crore, bringing the company's cumulative export order book to ₹50 crore. The orders span across multiple regions including Europe, UK, Canada, Australia, New Zealand, and Singapore. The consignments will be processed at the company's facilities in Ambernath, Thane, Mumbai, Maharashtra and Gujarat. The order book includes repeat orders from long-term clients. Patel Retail exports to over 35 countries worldwide and operates as a diversified retail and food processing company with presence in value retail supermarkets, food exports, and agri-processing. The company is recognized as a 4-star export house by the Government of India.",
            "Sentiment": "positive",
            "PublishDate": 1757653568037,
            "Source": "order&deals"
        }
    ]
}