{
    "Symbol": "PATELENG",
    "ISIN": "INE244B01030",
    "News": [
        {
            "Title": "Vijay Kedia Buys 1.01% Stake in Patel Engineering",
            "Summary": "Ace investor Vijay Kedia acquired 1.01% stake in Patel Engineering through Kedia Securities, despite the stock declining 43% in past year. Company secured Rs 2,498 crore projects recently.",
            "Sentiment": "positive",
            "PublishDate": 1768370546352,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patel Engineering Secures ₹1,700 Cr Hydropower Deal",
            "Summary": "Patel Engineering Ltd finalizes MOU with Arunachal Pradesh government for 144 MW Gongri Hydropower Project worth ₹1,700 crores, with completion expected in four years under BOOT model.",
            "Sentiment": "positive",
            "PublishDate": 1766037975198,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patel Engineering Announces Rights Issue of ₹3,989.68 Million",
            "Summary": "Patel Engineering Limited has issued 14,77,65,820 fully paid-up equity shares at ₹27 per share (including ₹26 premium) through a rights issue worth ₹3,989.68 million. The rights issue opens on December 12, 2025, with the last date for on-market renunciations on December 16, 2025, and closes on December 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765284960602,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Announces ISIN for Rights Issue Entitlements",
            "Summary": "Patel Engineering Limited has obtained ISIN INE244B20022 for rights entitlements to be credited to eligible equity shareholders' demat accounts. The rights entitlements for shareholders as on record date December 4, 2025 will be credited prior to the issue opening date.",
            "Sentiment": "neutral",
            "PublishDate": 1764592355917,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Approves ₹3,989.67 Million Rights Issue at ₹27 Per Share",
            "Summary": "Patel Engineering has approved a rights issue worth ₹3,989.67 million at ₹27 per share, planning to issue 14.77 crore equity shares in a 7:40 ratio. The record date for the rights issue has been set for December 4, 2025, affecting existing shareholders who will have the opportunity to subscribe to additional shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764402853089,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Secures Project Worth 7.98 Billion Rupees",
            "Summary": "Patel Engineering has secured a new project contract valued at 7.98 billion rupees. This project win represents a significant business development for the engineering company, adding substantial value to its order book.",
            "Sentiment": "positive",
            "PublishDate": 1764202266235,
            "Source": "stock"
        },
        {
            "Title": "Patel Engineering Secures ₹798.19 Crore Coal Mining Contract from SECL",
            "Summary": "Patel Engineering received two Letters of Intent worth ₹798.19 crores (excluding taxes) for excavation and coal transportation work at Jhiria West OCP in Chhattisgarh for South Eastern Coalfields Limited. The contract adds to the company's robust tender pipeline of over ₹34,000 crores already bid and under evaluation, with additional opportunities worth ₹18,000 crores expected before the financial year end.",
            "Sentiment": "positive",
            "PublishDate": 1764161836461,
            "Source": "order&deals"
        },
        {
            "Title": "Patel Engineering Board Approves ₹500 Crore Rights Issue Plan",
            "Summary": "Patel Engineering's board has approved a plan to raise ₹500 crore through a rights issue. The fundraising initiative will provide existing shareholders the opportunity to purchase additional shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764128193800,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Reports Rs 1,208 Crore Revenue in Q2, Plans Rs 500 Crore Rights Issue",
            "Summary": "Patel Engineering achieved Rs 1,208 crore quarterly revenue with 3% growth and Rs 77 crore net profit, while completing major milestones including wet commissioning of first 250MW unit at Subansiri project and record 752-meter tunneling progress at CIDCO project. The company plans a Rs 500 crore rights issue for debt servicing with Rs 15,146 crore order book and expects Rs 8,000-10,000 crore order inflow in next 6 months from submitted tenders worth Rs 34,000 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763534367769,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Patel Engineering announced its quarterly results showing revenue of 12.1 billion rupees compared to 11.7 billion rupees in the same period last year. The company's consolidated net profit decreased to 730 million rupees from 735 million rupees year-over-year. EBITDA stood at 1.58 billion rupees versus 1.62 billion rupees in the previous year, with EBITDA margin declining to 13.1% from 13.8%.",
            "Sentiment": "neutral",
            "PublishDate": 1763022913180,
            "Source": "earnings"
        },
        {
            "Title": "Patel Engineering Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Patel Engineering Limited has announced a conference call to discuss its Q2 FY26 earnings results, scheduled for Thursday, November 13, 2025, at 5:30 PM IST. The call will be hosted by Share India Securities Ltd and will feature Managing Director Ms. Kavita Shirvaikar and Chief Financial Officer Mr. Rahul Agarwal as speakers from the management team. The company has provided dial-in numbers for both domestic and international participants, with toll-free access available for Hong Kong, UK, Singapore, and USA. Pre-registration is available to avoid wait times.",
            "Sentiment": "neutral",
            "PublishDate": 1762568152759,
            "Source": "earnings"
        },
        {
            "Title": "Patel Engineering Settles ASI Constructors Claims for $5 Million",
            "Summary": "Patel Engineering has agreed to a $5 million settlement with Continental Casualty Company and Western Surety Company to resolve claims related to ASI Constructors Inc.",
            "Sentiment": "neutral",
            "PublishDate": 1760452445968,
            "Source": "stock"
        },
        {
            "Title": "Patel Engineering Appoints R V R Kishore as Whole-Time Director for Three Years",
            "Summary": "Patel Engineering Ltd appointed Mr. R V R Kishore as Additional and Whole-Time Director for a three-year term starting September 22, 2025, subject to shareholder approval. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Kishore brings over 35 years of infrastructure experience spanning urban infrastructure, transport, tunneling, marine, power, EPC, BOT and PPP projects, having previously held CXO level roles. He has managed portfolios exceeding ₹40,000 crore and holds a Bachelor of Engineering in Construction from Shivaji University and a Diploma Masters in Construction Management from NICMAR. Kishore is not related to any existing directors and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1757663516497,
            "Source": "corporate_governance"
        },
        {
            "Title": "Patel Engineering Raises INR 90 Crores Through Non-Convertible Debentures",
            "Summary": "Patel Engineering Ltd has allotted 9,000 non-convertible debentures with a face value of INR 1,00,000 each, raising INR 90 crores through private placement. The debentures carry a 10.25% coupon rate with monthly interest payments and have a 36-month tenure, maturing on August 25, 2028. The securities are secured by first ranking exclusive charge over identified land parcels and will be listed on the National Stock Exchange of India Limited. Principal repayment is structured in three tranches: 30% after 24 months, 30% after 30 months, and 40% at maturity after 36 months.",
            "Sentiment": "neutral",
            "PublishDate": 1756194787914,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Reports 12% Revenue Growth and 56% Profit Jump in Q1 FY26",
            "Summary": "Patel Engineering achieved consolidated revenue of INR 1,233 crores in Q1 FY26, representing 12% year-on-year growth. Net profit increased 56% from INR 48 crores to INR 75 crores compared to Q1 FY25. The company secured new orders worth INR 2,250 crores during the quarter, including a 240-megawatt hydropower project (INR 711 crores), Kondhane Dam project (INR 1,319 crores), and Nira Deoghar irrigation project (INR 1,000 crores with company's share at INR 200 crores). Order book stands at INR 16,285 crores as of June 30, 2025, with 61% comprising hydropower projects. The company reduced total debt by INR 76 crores to INR 1,527 crores during the quarter. Management targets crossing INR 5,000 crores revenue for the full year and expects to add INR 8,000-10,000 crores to the order book, aiming for INR 20,000-25,000 crores total order book by year-end. EBITDA margin was 13.4% for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755519866340,
            "Source": "earnings"
        },
        {
            "Title": "Janky Patel Acquires Control in Praham India LLP, Indirect Stakeholder in Patel Engineering",
            "Summary": "Janky Patel acquired 49.99% rights and interest each from her children Alina Patel and Ryan Patel in Praham India LLP through a gift transfer on August 7, 2025. The children had inherited these interests following the demise of Rupen Patel. While Janky Patel's direct shareholding in Patel Engineering Limited remains unchanged at 2,94,33,333 shares (3.49%), the acquisition gives her indirect control over significant stakes. Praham India LLP holds 4,01,95,352 shares (4.76%) in Patel Engineering and owns 67.23% of Raahitya Constructions Private Limited, which in turn holds 27.52% shares in Patel Engineering. Janky Patel belongs to the promoter group of Patel Engineering Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754916891408,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Reports 56% Profit Growth in Q1 Results",
            "Summary": "Patel Engineering reported a 56% year-on-year increase in consolidated net profit to Rs 75 crore in the June quarter, compared to Rs 48 crore in the same period last year. Revenue from operations grew 12% to Rs 1,233 crore from Rs 1,102 crore. The company reduced its total debt to Rs 1,527 crore as of June 30, 2025, down from Rs 1,603 crore at the end of March 2025. During the quarter, Patel Engineering secured new orders worth Rs 2,250 crore, bringing its total order book to Rs 16,285 crore. The company received a Rs 240 crore order from NHPC for civil and hydro mechanical works at the Teesta-V project in Sikkim. MD Kavita Shirvaikar attributed the performance to consistent growth and enhanced operational efficiency, noting the company's track record of executing over 350 projects.",
            "Sentiment": "positive",
            "PublishDate": 1754909177029,
            "Source": "earnings"
        },
        {
            "Title": "Patel Engineering Reports Mixed Q1 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Patel Engineering reported quarterly revenue of 12.3 billion rupees, up from 11 billion rupees in the same period last year. Consolidated net profit increased to 810 million rupees from 547 million rupees year-over-year. However, EBITDA declined to 1.65 billion rupees from 1.68 billion rupees, with EBITDA margin falling to 13.4% from 15.3% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754898031734,
            "Source": "earnings"
        },
        {
            "Title": "Patel Engineering to Announce Q1FY26 Results on August 11",
            "Summary": "Patel Engineering Ltd., an infrastructure and construction services company founded in 1949, will announce its first quarter financial results for FY2026 on August 11. The Board of Directors will consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company will host an earnings call at 5 p.m. on the same day. In the previous quarter (Q4FY25), the company reported a 75.4% year-on-year drop in consolidated net profit to Rs 34.71 crore, while total income increased 19.13% to Rs 1,637.3 crore. Patel Engineering shares have declined significantly across all time periods, falling 32.27% over the past year and 29.97% year-to-date. The stock closed at Rs 36.46 on Friday, up 0.89%.",
            "Sentiment": "neutral",
            "PublishDate": 1754743289278,
            "Source": "earnings"
        },
        {
            "Title": "Patel Engineering Approves INR 100 Crore Non-Convertible Debentures Issue",
            "Summary": "Patel Engineering Ltd's Allotment Committee has approved the issuance of non-convertible debentures worth up to INR 100 crores through private placement. The issue comprises 5,000 senior, secured, rated, listed and transferable non-convertible debentures with a face value of INR 1 lakh each, aggregating to INR 50 crores, plus a green shoe option of another 5,000 debentures worth INR 50 crores. The debentures carry a 36-month tenure with a 10.25% coupon rate and monthly interest payments. The principal will be repaid in three installments: 30% after 24 months, 30% after 30 months, and 40% after 36 months. The debentures are secured by a first ranking exclusive charge on identified land parcels of the company and will be listed on the National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753422542612,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Schedules Allotment Committee Meeting for Debenture Issuance",
            "Summary": "Patel Engineering Ltd has scheduled an Allotment Committee meeting for July 25, 2025, to finalize terms and conditions for debenture issuance. The meeting will decide matters related to the debenture issue, including detailed terms, conditions, and the number of securities to be issued. This follows the Board of Directors' approval granted on July 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753191972693,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Secures Rs. 240 Crore Hydropower Project from NHPC",
            "Summary": "Patel Engineering has been awarded a hydropower project worth Rs. 239.98 crore from NHPC. The contract represents a significant business win for the engineering company in the power sector.",
            "Sentiment": "positive",
            "PublishDate": 1753057643655,
            "Source": "order&deals"
        },
        {
            "Title": "Patel Engineering Secures ₹240 Crore NHPC Contract for Teesta-V Hydropower Project",
            "Summary": "Patel Engineering Limited secured a ₹239.98 crore contract from NHPC Ltd for civil and hydro mechanical works at the Teesta-V power station in Sikkim. The project involves modifying the diversion tunnel into a tunnel spillway arrangement, with completion expected within 18 months. Work includes construction of tunnel spillway, gate operation chamber, precast bridge, access road, and related infrastructure. The company previously won a ₹1,318.89 crore Kondhane Dam project from CIDCO in May, scheduled for completion within 42 months. Patel Engineering shares closed at ₹39.50, down 1.08% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1752890533239,
            "Source": "order&deals"
        },
        {
            "Title": "Patel Engineering Approves ₹200 Crore NCD Issuance",
            "Summary": "Patel Engineering's Board has approved the issuance of Non-Convertible Debentures (NCDs) worth ₹200 crore through private placement. The issuance is scheduled for the fiscal year 2026 (FY26).",
            "Sentiment": "positive",
            "PublishDate": 1751527378000,
            "Source": "default"
        },
        {
            "Title": "Patel Engineering: Secures Rs 958 Crore Pipeline Project in Maharashtra",
            "Summary": "Patel Engineering Ltd. received a letter of acceptance for a Rs 958 crore pipeline distribution network construction order from Maharashtra Krishna Valley Development Corp. The project, located in Maharashtra's Kalaj village, will be executed through a joint venture with Patel Engineering holding a 20% share. The contract includes construction, operations, repairs, and maintenance for five years post-completion.",
            "Sentiment": "positive",
            "PublishDate": 1748247442000,
            "Source": "order&deals"
        },
        {
            "Title": "Patel Engineering JV Secures Rs 958.33 Crore Irrigation Project",
            "Summary": "Patel Engineering, in a joint venture, has been awarded an irrigation project worth Rs 958.33 crore. The company's share in the contract amounts to Rs 191.67 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748241037000,
            "Source": "default"
        },
        {
            "Title": "Patel Engineering JV Secures Rs 958.33 Crore Irrigation Project",
            "Summary": "Patel Engineering, in a joint venture, has been awarded an irrigation project worth Rs 958.33 crore. The company's share in the contract amounts to Rs 191.67 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747970497000,
            "Source": "default"
        },
        {
            "Title": "Patel Engineering: Secures ₹711 Crore Hydropower Project in Arunachal Pradesh",
            "Summary": "Patel Engineering received a ₹711.29 crore contract from NEEPCO for a 240 MW hydropower project in Arunachal Pradesh. The project, to be completed in 44 months, involves civil infrastructure and hydro-mechanical works.",
            "Sentiment": "positive",
            "PublishDate": 1747798777000,
            "Source": "order&deals"
        },
        {
            "Title": "Patel Engineering Secures Rs 711 Crore Hydropower Project from NEEPCO",
            "Summary": "Patel Engineering has been awarded a hydropower project contract worth Rs 711 crore from NEEPCO (North Eastern Electric Power Corporation Limited). The project details, location, and timeline are not specified in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747796000000,
            "Source": "default"
        },
        {
            "Title": "Patel Engineering: Expects Rs 12,000 Crore New Orders in FY26",
            "Summary": "Patel Engineering anticipates new orders worth Rs 10,000-12,000 crore in FY25 and FY26. The company plans to bid for projects worth Rs 50,000 crore in FY26, with an expected 18-20% success rate. Current order book stands at Rs 17,500 crore. FY26 revenue may be flat due to sluggish FY25 order inflow, but growth is expected from FY27. The company targets 10-15% revenue growth and 14% Ebitda margin in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1747479075000,
            "Source": "normal_news"
        },
        {
            "Title": "Patel Engineering: Q4 Net Profit Plunges to Rs 35 Crore",
            "Summary": "Patel Engineering's Q4 net profit dropped to Rs 34.7 crore from Rs 140.9 crore year-over-year, despite a 19% increase in total income to Rs 1,637.2 crore. The company cited higher provisions, including Rs 87.1 crore for impairment and write-offs. The order book stands at Rs 15,218 crore with additional orders of Rs 2,500 crore.",
            "Sentiment": "negative",
            "PublishDate": 1747129037000,
            "Source": "earnings"
        },
        {
            "Title": "Patel Engineering Reports Q4 FY2023 Financial Results",
            "Summary": "Patel Engineering announced its Q4 financial results. Revenue increased to 16.12 billion rupees from 13.43 billion rupees year-over-year. However, EBITDA decreased to 2.18 billion rupees from 2.38 billion rupees, with EBITDA margin falling to 13.54% from 17.69%. Consolidated net profit declined significantly to 330 million rupees from 1.23 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747124771000,
            "Source": "result"
        },
        {
            "Title": "Patel Engineering: Q4 FY25 Results Announcement Scheduled for May 13",
            "Summary": "Patel Engineering Ltd. will announce Q4 and FY25 results on May 13, 2025. The company's board meeting is scheduled to approve audited standalone and consolidated financial results. An earnings call with investors is set for the same day at 5 p.m. The trading window for insiders is closed from April 1 until 48 hours after the results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1747028788000,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering: Secures ₹1,319 Crore Dam Construction Order from CIDCO",
            "Summary": "Patel Engineering has been awarded a ₹1,318.89 crore project by CIDCO for the construction of Kondhane Dam in Maharashtra. The project includes civil works, hydro mechanical, and electrical works, with a 42-month completion timeline. This follows their recent lowest bidder status for a ₹718 crore hydropower project in Arunachal Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1746508327000,
            "Source": "order&deals"
        },
        {
            "Title": "Patel Engineering Secures ₹1,319 Crore Urban Infrastructure Project from CIDCO",
            "Summary": "Patel Engineering has been awarded an urban infrastructure project worth ₹1,319 crore by the City and Industrial Development Corporation (CIDCO). This significant contract highlights the company's growing presence in the infrastructure development sector.",
            "Sentiment": "positive",
            "PublishDate": 1746500943000,
            "Source": "default"
        },
        {
            "Title": "Patel Engineering Secures Two Major Orders Worth 2,037 Crore Rupees",
            "Summary": "Patel Engineering has won two significant orders. The first order is valued at 718 crore rupees, while the second order is worth 1,319 crore rupees. These orders represent a substantial business win for the company, potentially boosting its project portfolio and revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1745548040000,
            "Source": "default"
        },
        {
            "Title": "Patel Engineering: Secures Two Major Projects Worth ₹2,037 Crore",
            "Summary": "Patel Engineering Ltd. has been declared the lowest bidder for two projects totaling ₹2,037 crore, equivalent to 55% of its market cap. The projects include a ₹1,319 crore dam construction for CIDCO in Maharashtra and a ₹718 crore hydropower project for NEEPCO in Arunachal Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1745547908000,
            "Source": "order&deals"
        },
        {
            "Title": "Patel Engineering: Shares Rise on Rs 1,090-Crore Irrigation Project Win",
            "Summary": "Patel Engineering and its JV partner were declared the lowest bidder for a Rs 1,090.45-crore irrigation project in Maharashtra's Satara district. The project involves constructing a pipeline distribution network for Nira Deoghar Right Bank Main Canal, to be completed in 36 months. Patel Engineering's share in the JV is 20%. The company's stock rose up to 3.7% in early trade.",
            "Sentiment": "positive",
            "PublishDate": 1739939435000,
            "Source": "order&deals"
        },
        {
            "Title": "Patel Engineering JV Wins Rs 1,090 Crore Irrigation Project in Maharashtra",
            "Summary": "Patel Engineering, in a joint venture, has been declared the lowest bidder (L1) for an irrigation project worth Rs 1,090 crore from Maharashtra Krishna Valley Development Corporation. Patel Engineering's share in the contract amounts to Rs 218.09 crore.",
            "Sentiment": "positive",
            "PublishDate": 1739848244000,
            "Source": "order&deals"
        },
        {
            "Title": "Patel Engineering: Q3 Profit Surges 14%, Shares Rally",
            "Summary": "Patel Engineering reported a 14.49% increase in Q3 consolidated net profit to Rs 80.24 crore. Revenue rose to Rs 1,206 crore from Rs 1,061 crore year-on-year. The company's shares surged 6.1% following the earnings announcement.",
            "Sentiment": "positive",
            "PublishDate": 1739425812000,
            "Source": "earnings"
        },
        {
            "Title": "Patel Engineering Reports 14% Increase in Q3 Consolidated Net Profit",
            "Summary": "Patel Engineering, an infrastructure and construction company, has announced its financial results for the third quarter. The company's consolidated net profit rose to 802 million rupees, up from 702 million rupees in the same period last year, representing a 14% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739348467000,
            "Source": "earnings"
        },
        {
            "Title": "Patel Engineering: Q3 Results Announcement and Earnings Call Scheduled",
            "Summary": "Patel Engineering Ltd. will announce Q3 FY25 results on February 12, 2025. An earnings call is scheduled for 5:30 PM IST the same day. The company's market cap is around Rs 4,000 crore. Q2 FY25 saw net profit nearly doubling to Rs 73.44 crore and total income rising to Rs 1,230.98 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1739167502000,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering: Small-Cap Stock Plummets 40% from Recent Peak",
            "Summary": "Patel Engineering, a small-cap infrastructure company, has seen its stock price drop 40% from its February 2024 peak of ₹79. The company, which has 50.2% retail ownership, has lost ₹2,668 crore in market capitalization. Despite the recent decline, the stock remains up 265% over two years. IDBI Capital has initiated coverage with a 'buy' rating and a target price of ₹76.",
            "Sentiment": "neutral",
            "PublishDate": 1738215882000,
            "Source": "normal_news"
        },
        {
            "Title": "Patel Engineering: Two-Pronged Strategy for 20% YoY Growth",
            "Summary": "Patel Engineering aims for 20% year-on-year revenue growth from FY26, while maintaining current debt levels. Q2 FY25 saw 95% PAT increase to Rs 73.44 crore and 15% revenue growth to Rs 1,174.3 crore. The company plans to monetize Rs 100-150 crore in non-core assets in H2 FY25 and has a Rs 17,000 crore order book with Rs 10,000 crore bids under evaluation.",
            "Sentiment": "positive",
            "PublishDate": 1731728813000,
            "Source": "result"
        },
        {
            "Title": "Patel Engineering Anticipates Order Growth and Targets Hydro Projects",
            "Summary": "Patel Engineering expects an increase in new orders, with numerous projects available for bidding from Q3 onwards. The company is specifically targeting hydro projects due to their strategic locations. For a small project worth Rs 240 crore, the company aims to maintain an average margin of 14-15%.",
            "Sentiment": "positive",
            "PublishDate": 1731555876000,
            "Source": "normal_news"
        },
        {
            "Title": "Patel Engineering Expects to Maintain 14-15% Margins, Targets Additional Work",
            "Summary": "Patel Engineering anticipates maintaining average margins of 14-15% in a small project, consistent with their performance in hydro projects. The company is aiming to secure additional work worth Rs 10,000 crore to Rs 12,000 crore in the coming year, as revealed during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1731555765000,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Anticipates Strong Growth and Debt Reduction",
            "Summary": "Patel Engineering expects a robust economic recovery and significant increase in order inflows in upcoming quarters. The company plans to repay its term debt of Rs 650 crore over the next 3-4 years, as stated in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1731555692000,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Engineering Reports Improved Q2 EBITDA and Margin",
            "Summary": "Patel Engineering announced its Q2 financial results, showing an increase in EBITDA to 1.62 billion rupees from 1.4 billion rupees year-over-year. The company's EBITDA margin also improved slightly to 13.8% from 13.71% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731481890000,
            "Source": "result"
        },
        {
            "Title": "Patel Engineering Reports Q2 Revenue Growth",
            "Summary": "Patel Engineering announced its second quarter revenue, which increased to 11.7 billion rupees from 10 billion rupees in the same quarter last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731481834000,
            "Source": "result"
        },
        {
            "Title": "Patel Engineering Reports Significant Profit Growth in Q2",
            "Summary": "Patel Engineering has announced its Q2 consolidated net profit of 735 million rupees, compared to 377 million rupees in the same quarter last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731481809000,
            "Source": "result"
        }
    ]
}