{
    "Symbol": "PATINTLOG",
    "ISIN": "INE529D01014",
    "News": [
        {
            "Title": "Patel Integrated Logistics Q3FY26 Results",
            "Summary": "Patel Integrated Logistics reports Q3FY26 operational income of INR 884 Mn with PAT of INR 27 Mn, showing 22.7% YoY growth despite revenue decline of 1.4%.",
            "Sentiment": "neutral",
            "PublishDate": 1770897855457,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patel Integrated Logistics CFO Deepak Keni Resigns",
            "Summary": "Patel Integrated Logistics Limited announces resignation of Chief Financial Officer Mr. Deepak Madhukar Keni effective January 30, 2026, citing personal reasons for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1769770424391,
            "Source": "stocks"
        },
        {
            "Title": "PATEL Integrated Logistics schedules Q3FY26 call",
            "Summary": "PATEL Integrated Logistics Limited announces earnings call on February 13, 2026 at 16:00 hours IST to discuss Q3FY26 unaudited financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769752471726,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patel Integrated Logistics Board Meet on Feb 12",
            "Summary": "Patel Integrated Logistics Limited has scheduled a board meeting on February 12, 2026, to consider Q3 FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768994660174,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patel Integrated Logistics Incorporates Subsidiary",
            "Summary": "Patel Integrated Logistics Limited incorporated House of Patels Limited as wholly owned subsidiary on January 06, 2026, focusing on logistics, real estate, and facility management operations in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1767777911896,
            "Source": "stocks"
        },
        {
            "Title": "Patel Integrated Logistics Promoter Acquires 30,000 Shares",
            "Summary": "Patel Integrated Logistics Limited disclosed substantial acquisition of 30,000 equity shares by promoter Mr. Asgar Shakoor Patel through open market purchase, increasing promoter group holding to 35.95%.",
            "Sentiment": "neutral",
            "PublishDate": 1767263759535,
            "Source": "co_actions_results"
        },
        {
            "Title": "Patel Integrated Logistics Establishes New Subsidiary in Mumbai",
            "Summary": "Patel Integrated Logistics has launched a new subsidiary called Rajpat Logistics Pvt. Ltd. in Mumbai. The establishment of this subsidiary represents an expansion move for the parent company into the Mumbai market.",
            "Sentiment": "neutral",
            "PublishDate": 1764252955590,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Integrated Logistics Reports Quarterly Financial Results",
            "Summary": "Patel Integrated Logistics Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported income from operations of Rs. 1,108.99 lakhs for the quarter, compared to Rs. 918.59 lakhs in the previous quarter and Rs. 992.27 lakhs in the same quarter last year. For the half year, income from operations reached Rs. 2,027.59 lakhs versus Rs. 1,959.89 lakhs in the previous year. The company posted a profit before tax of Rs. 27.88 lakhs for the quarter, down from Rs. 163.95 lakhs in the previous quarter but higher than Rs. 20.75 lakhs in the same quarter last year. Basic earnings per share stood at Rs. 0.32 for the quarter. The company operates through segments including Sea Freight Division, Air Freight Division, Co-loading of Air Freight Division, and others. Total assets as of September 30, 2025 were Rs. 16,811.59 lakhs with total equity of Rs. 12,166.01 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1762885089290,
            "Source": "earnings"
        },
        {
            "Title": "Patel Integrated Logistics Reports 18% Revenue Growth, Plans Aggressive Expansion After Becoming Debt-Free",
            "Summary": "Patel Integrated Logistics achieved FY25 revenue of ₹3,427 million, marking an 18% year-over-year increase. The company became debt-free following a rights issue and operates a pan-India network spanning 112 airports and 125 offices. The logistics firm targets aggressive expansion in air cargo, warehousing, and tech-enabled logistics services. The company has achieved 99% freight automation through digital platform adoption and secured new international airfreight contracts. Management plans to capitalize on e-commerce demand growth and expand full truckload (FTL) and less-than-truckload (LTL) segments to improve long-term margins.",
            "Sentiment": "positive",
            "PublishDate": 1762874068106,
            "Source": "stock"
        },
        {
            "Title": "Patel Integrated Logistics Receives ₹2.26 Crore Tax Refund",
            "Summary": "Patel Integrated Logistics has received a tax refund of ₹2.26 crores. The refund is expected to have a positive impact on the company's financial results.",
            "Sentiment": "positive",
            "PublishDate": 1762499510444,
            "Source": "stock"
        },
        {
            "Title": "Patel Integrated Logistics Schedules Earnings Call for September Quarter Results",
            "Summary": "Patel Integrated Logistics Limited will host an earnings call on November 13, 2025, at 11:30 hours IST to discuss its unaudited financial results for the quarter and half year ended September 30, 2025. The call will include senior management discussing results with analysts and investors. The company has provided dial-in numbers for multiple regions including India, USA, Singapore, UK, and Hong Kong, along with pre-registration details to avoid wait times. An audio replay will be made available on the company's website following the conference call.",
            "Sentiment": "neutral",
            "PublishDate": 1761652371289,
            "Source": "earnings"
        },
        {
            "Title": "Patel Integrated Logistics Sets Record Date for ₹0.30 Final Dividend",
            "Summary": "Patel Integrated Logistics Limited has set September 1, 2025 as the record date for determining shareholder eligibility for a final dividend of ₹0.30 per equity share for the financial year ended March 31, 2025. The dividend is subject to shareholder approval at the company's 63rd Annual General Meeting scheduled for September 8, 2025 at 11:00 a.m. through video conferencing. If approved, the dividend payment will be made on or before October 7, 2025, subject to tax deduction at source. The dividend represents 30% on shares with a face value of ₹10 each.",
            "Sentiment": "positive",
            "PublishDate": 1756383115584,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Integrated Logistics Reports 5% Revenue Decline in Q1 FY26 Despite Improved Profit Margins",
            "Summary": "Patel Integrated Logistics Limited reported operational income of INR 78 crores for the quarter ended June 30, 2025, representing a 5% year-on-year decline. Total sales volume decreased to 13,318 tons from 14,535 tons in the same quarter last year. The domestic segment contributed 11,636 tons while international segment handled 1,682 tons. EBITDA fell 9% to INR 1.9 crores with a margin of 2.44%. However, profit after tax increased 6.7% to INR 1.6 crores, supported by reduced finance costs, with profit margin improving to 2.05%. Sales realization improved 3.5% year-on-year to Rs. 57.04 per kg. The company signed a new rate contract with a Middle Eastern airline and expects to benefit from upcoming infrastructure developments including the Navi Mumbai International Airport expected to be operational by October 2025. Management attributed the volume decline to seasonal softness and geopolitical uncertainties affecting international operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754564744961,
            "Source": "earnings"
        },
        {
            "Title": "Patel Integrated Logistics Plans Growth Through E-Commerce, Pharma Expansion and Technology Integration",
            "Summary": "Patel Integrated Logistics is pursuing growth through multiple strategic initiatives. The company plans to expand its client base in e-commerce and pharmaceutical sectors while opening new warehouses. Technology implementation for track-and-trace capabilities is part of their expansion strategy. The company intends to utilize passenger airlines to increase cargo revenue, enhance delivery times, and improve customer interaction. Industry growth driven by demand in air freight and warehousing is expected to support the company's long-term scale and profitability objectives.",
            "Sentiment": "positive",
            "PublishDate": 1754405367155,
            "Source": "stock"
        },
        {
            "Title": "Patel Integrated Logistics Reports Net Profit of Rs. 163.95 Lakhs on Revenue of Rs. 7842.35 Lakhs",
            "Summary": "Patel Integrated Logistics Limited reported quarterly results with a net profit of Rs. 163.95 lakhs and total revenue of Rs. 7842.35 lakhs. The company's income from operations stood at Rs. 7798.12 lakhs, while total expenses were Rs. 7678.40 lakhs. The Co-loading of Air Freight Division generated segment revenue of Rs. 9110.30 lakhs and segment results of Rs. 194.01 lakhs. Basic earnings per share was Rs. 0.24. The company's paid-up equity share capital remained at Rs. 6958.57 lakhs. Total comprehensive income after tax was Rs. 160.05 lakhs. The results were approved by the Board of Directors at their meeting held on August 05, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754395169578,
            "Source": "earnings"
        },
        {
            "Title": "Patel Integrated Logistics Approves Q2 2025 Results, Sets AGM Date and Confirms Rs 0.30 Dividend",
            "Summary": "Patel Integrated Logistics Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reported total revenue of Rs 7,842.35 lakhs compared to Rs 8,267.54 lakhs in the same quarter last year. Net profit for the quarter was Rs 163.95 lakhs versus Rs 153.03 lakhs in the previous year quarter. The Board scheduled the 63rd Annual General Meeting for September 8, 2025, to be held through video conferencing at 11:00 AM. The company confirmed a final dividend of Rs 0.30 per equity share (3%) for the year ended March 31, 2025, which was previously recommended by the Board in May 2025. The register of members will remain closed from September 2-8, 2025 for AGM and dividend entitlement purposes. Earnings per share for the quarter stood at Rs 0.24.",
            "Sentiment": "neutral",
            "PublishDate": 1754393765131,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Integrated Logistics Schedules Earnings Call for August 6, 2025",
            "Summary": "Patel Integrated Logistics Limited will host an earnings call on August 6, 2025, at 16:00 hours IST to discuss unaudited financial results for the quarter ended June 30, 2025. The call will include senior management discussing financial results with analysts and investors. Dial-in numbers have been provided for participants from India, USA, UK, Singapore, and Hong Kong, with pre-registration available to avoid wait times. An audio replay will be made available on the company's website following the call.",
            "Sentiment": "neutral",
            "PublishDate": 1753470971833,
            "Source": "earnings"
        },
        {
            "Title": "Patel Integrated Logistics: R Kannan Appointed as Independent Director",
            "Summary": "Patel Integrated Logistics Limited appoints R Kannan as Additional Non-Executive Independent Director, effective October 24, 2024, subject to shareholder approval. Kannan brings 39 years of experience in finance, strategy, and corporate performance management. Company shares trade flat at ₹21.05 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1729761750000,
            "Source": "corporate_action"
        },
        {
            "Title": "Patel Integrated Logistics: Rights Issue Oversubscribed 3.19 Times",
            "Summary": "<p><span class='positive'>Patel Integrated Logistics Ltd's</span> rights issue closed on October 1, 2024, <span class='positive'>oversubscribed by 3.19 times</span>. The company received bids for <b>1,59,67,190</b> shares against <b>50,00,000</b> offered at <b>Rs 18</b> per share. <br/> Proceeds will be used to <span class='positive'>repay term loans</span>, potentially <span class='positive'>reducing annual interest expenses</span> by around <b>Rs 1 crore</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727935190000,
            "Source": "corporate_action"
        }
    ]
}