{
    "Symbol": "PAUSHAKLTD",
    "ISIN": "INE111F01024",
    "News": [
        {
            "Title": "Paushak Q3FY26 Results: Revenue Up 3.1% YoY to ₹4,880 Lacs",
            "Summary": "Paushak Limited reported Q3FY26 revenue of ₹4,880 lacs, up 3.1% YoY. Net profit declined 59.6% to ₹617 lacs. Nine-month revenue grew 3.1% to ₹16,346 lacs with profit at ₹2,682 lacs.",
            "Sentiment": "neutral",
            "PublishDate": 1769517504306,
            "Source": "co_actions_results"
        },
        {
            "Title": "PaushaK Limited Starts Commercial Production at ₹175 Cr Plant",
            "Summary": "PaushaK Limited has commenced commercial production at its new multi-purpose manufacturing facility with an investment of ₹175 crore. The company plans a phased rollout over the next year.",
            "Sentiment": "positive",
            "PublishDate": 1768989837658,
            "Source": "stocks"
        },
        {
            "Title": "Paushak Gets Enhanced Credit Rating from CRISIL",
            "Summary": "CRISIL reaffirms A/Stable long-term rating and assigns A1 short-term rating for Paushak's enhanced bank facilities worth ₹145 crores, up from ₹40 crores previously.",
            "Sentiment": "positive",
            "PublishDate": 1768471497200,
            "Source": "stocks"
        },
        {
            "Title": "Paushak Receives NSE Approval for Equity Share Listing on December 1st",
            "Summary": "Paushak has obtained approval from the National Stock Exchange (NSE) for listing its equity shares on December 1st. This approval enables the company to commence trading on the NSE platform, providing investors access to Paushak's shares through the exchange.",
            "Sentiment": "positive",
            "PublishDate": 1764264418634,
            "Source": "stock"
        },
        {
            "Title": "Paushak Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Paushak reported quarterly results showing revenue increased to 588 million rupees from 573 million rupees year-over-year. However, net profit declined to 86 million rupees compared to 142 million rupees in the same period last year. EBITDA decreased to 148 million rupees from 170 million rupees year-over-year, while EBITDA margin compressed to 25.18% from 29.72% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762517449479,
            "Source": "earnings"
        }
    ]
}