{
    "Symbol": "PAVNAIND",
    "ISIN": "INE07S101038",
    "News": [
        {
            "Title": "Pavna Industries Board Meet on Feb 11 for Q3FY26 Results",
            "Summary": "Pavna Industries Limited has scheduled a board meeting on February 11, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770300992679,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pavna Industries Invests ₹4 Lakh in Subsidiary",
            "Summary": "Pavna Industries board approves ₹4 lakh investment in subsidiary Pavna SMC Private Limited for automobile electronic components business and updates related party policy.",
            "Sentiment": "positive",
            "PublishDate": 1769595724681,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pavna Industries Starts ₹50 Cr Hosur Plant Construction",
            "Summary": "Pavna Industries begins construction of new manufacturing facility in Tamil Nadu with ₹50 crore first-phase investment. Operations expected to start in 2026, targeting southern India OEMs.",
            "Sentiment": "positive",
            "PublishDate": 1768820729339,
            "Source": "stocks"
        },
        {
            "Title": "Pavna Industries Signs MoU with Uttar Pradesh Government for Rs. 250 Crore Investment",
            "Summary": "Pavna Industries has entered into a Memorandum of Understanding with the Government of Uttar Pradesh for a proposed project requiring Rs. 250 crores investment over the next 3 to 5 years. The project is expected to create employment opportunities for approximately 500 employees.",
            "Sentiment": "positive",
            "PublishDate": 1764028944671,
            "Source": "stock"
        },
        {
            "Title": "Pavna Industries Shares Drop 0.77% Despite Fourth Land Acquisition Near Jewar Airport",
            "Summary": "Pavna Industries Limited shares fell to ₹35.96 on Monday despite announcing its fourth land purchase of 4.33 acres near Jewar Airport, bringing total holdings to 15.82 acres. The automotive component manufacturer, which supplies to major OEMs like Bajaj and Honda, faces sell-side pressure with modest trading volumes of 0.51 lakh shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763362058845,
            "Source": "stock"
        },
        {
            "Title": "Pavna Industries Acquires Additional 4.33 Acres Near Jewar Airport for Manufacturing Expansion",
            "Summary": "Pavna Industries Limited acquired 4.33 acres of adjoining land near Jewar Airport in Uttar Pradesh, continuing its strategic land consolidation following previous purchases of 1.89 acres, 4.96 acres in August 2025, and 4.64 acres in July 2025. The automotive components manufacturer is building a contiguous land parcel to support long-term capacity building, infrastructure development, and manufacturing ecosystem expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763174843500,
            "Source": "stock"
        },
        {
            "Title": "Pavna Industries Reports No Deviation in Fund Utilization for Preferential Issue Worth Rs. 210.70 Crore",
            "Summary": "Pavna Industries Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding its preferential issue of equity shares and fully convertible warrants worth Rs. 210.70 crore. CARE Ratings Limited, serving as the monitoring agency, reported no deviation from the stated objectives and no range of deviation in fund utilization. The company issued 17,72,200 preferential equity shares at Rs. 505 per share and 24,00,000 warrants at the same price. The company has received Rs. 119.80 crore from the total issue proceeds, comprising the entire amount from preferential equity shares (Rs. 89.50 crore) and 25% from warrants (Rs. 30.30 crore). The remaining 75% from warrant holders (Rs. 90.90 crore) is expected to be received in tranches within 18 months from allotment date. The funds are allocated for issue-related expenses (Rs. 0.28 crore), working capital requirements (Rs. 81.50 crore), general corporate purposes (Rs. 80.25 crore), and strategic acquisitions (Rs. 160.00 crore). The company's share price stood at Rs. 36.74 per share as of October 22, 2025, compared to the warrant conversion price of Rs. 50.50 per share post-split.",
            "Sentiment": "neutral",
            "PublishDate": 1762987987864,
            "Source": "stock"
        },
        {
            "Title": "Pavna Industries Limited Approves Quarterly Financial Results for September 2025",
            "Summary": "Pavna Industries Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The board meeting was held on November 12, 2025, based on the Audit Committee's recommendation. The company operates in the automotive segment as a single operating segment. The financial results were prepared in accordance with Indian Accounting Standards and have been reviewed by statutory auditors. The company will upload these results on its website and publish them in newspapers as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762977949400,
            "Source": "earnings"
        },
        {
            "Title": "Pavna Industries Incorporates Joint Venture Subsidiary PAVNA SMC Private Limited",
            "Summary": "Pavna Industries Limited has incorporated a joint venture subsidiary named PAVNA SMC Private Limited in partnership with Smartchip Microelectronics Corp. The Ministry of Corporate Affairs approved the incorporation and issued the Certificate of Incorporation on November 5, 2025. Pavna Industries holds 80% shareholding while Smartchip Microelectronics Corp holds 20%. The subsidiary has an authorized and paid-up share capital of Rs 5 lakh each. The company will manufacture electronic components for the automobile industry including ICE and EV sectors, as well as hardware for cupboard/door locks in residential/commercial industries, aerospace, and medical sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762355565656,
            "Source": "corporate_action"
        },
        {
            "Title": "Pavna Industries Establishes New R&D Centre in Noida",
            "Summary": "Pavna Industries has opened a new research and development center in Noida as part of its innovation strategy.",
            "Sentiment": "positive",
            "PublishDate": 1762340842636,
            "Source": "stock"
        },
        {
            "Title": "Pavna Industries Partners with Tamil Nadu Government for Auto-Components Manufacturing Plant",
            "Summary": "Pavna Industries Limited has entered into an agreement with the Tamil Nadu Government to establish a new auto-components manufacturing plant in Shoolagiri. The project is designed to expand the company's manufacturing presence and generate employment opportunities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1758096038217,
            "Source": "stock"
        }
    ]
}