{
    "Symbol": "PAYTM",
    "ISIN": "INE982J01020",
    "News": [
        {
            "Title": "Paytm Insurance Unit Gets IRDAI License Renewal",
            "Summary": "One 97 Communications announces IRDAI has renewed the insurance broking license for its wholly-owned subsidiary Paytm Insurance Broking Private Limited under Direct (Life & General Insurance Broker) category.",
            "Sentiment": "positive",
            "PublishDate": 1770735885259,
            "Source": "stocks"
        },
        {
            "Title": "Paytm Schedules Analyst Meets Feb-Mar 2026",
            "Summary": "One 97 Communications (Paytm) announces participation in multiple analyst and investor conferences from February 10 to March 18, 2026, including events by Axis Capital, Kotak, and Jefferies across Mumbai and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1770291065065,
            "Source": "stocks"
        },
        {
            "Title": "Paytm Shareholders Approve Independent Director",
            "Summary": "One 97 Communications shareholders overwhelmingly approved the appointment of Ms. Manisha Raj Raisinghani as Independent Director with 99.68% votes in favour through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1769702263569,
            "Source": "stocks"
        },
        {
            "Title": "Paytm Files Q3FY26 Monitoring Agency Report",
            "Summary": "One97 Communications (Paytm) submitted its quarterly monitoring agency report for Q3FY26, showing no deviations in IPO proceeds utilization with ₹2,000 crore remaining unutilized from the ₹8,119 crore raised.",
            "Sentiment": "neutral",
            "PublishDate": 1769701994038,
            "Source": "stocks"
        },
        {
            "Title": "Paytm Q3 FY26 Results: Revenue Rises to ₹2,194 Crores",
            "Summary": "One 97 Communications reports consolidated revenue of ₹2,194 crores for Q3 FY26, up from ₹1,828 crores in Q3 FY24. Company posts net profit of ₹225 crores compared to loss of ₹208 crores in previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769697365688,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paytm NRC Approves ESOP Grant and Share Allotment",
            "Summary": "One 97 Communications' NRC granted 5,15,617 stock options and allotted 1,00,281 equity shares under ESOP 2019, increasing paid-up capital to ₹ 63,98,28,416.",
            "Sentiment": "neutral",
            "PublishDate": 1769692846143,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paytm shares fall 10% amid PIDF scheme concerns",
            "Summary": "One97 Communications shares declined 10% to ₹1,134 due to market concerns over Payment Infrastructure Development Fund extension beyond December 2025, which accounts for 20% of operating profit.",
            "Sentiment": "negative",
            "PublishDate": 1769153208535,
            "Source": "stocks"
        },
        {
            "Title": "Paytm schedules Q3FY26 earnings call for Jan 30",
            "Summary": "One 97 Communications Limited announces board meeting on January 29, 2026 to approve Q3FY26 financial results, followed by earnings call on January 30, 2026 from 8:00-8:45 AM IST.",
            "Sentiment": "neutral",
            "PublishDate": 1768562455289,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mutual funds trim Paytm stake for first time since IPO",
            "Summary": "Domestic mutual funds reduced their stake in One97 Communications to 14.34% from 16.25% during Q3, marking the first reduction since IPO. Retail investors also continued selling for the seventh consecutive quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1768537959105,
            "Source": "stocks"
        },
        {
            "Title": "MF shareholding in Paytm drops for first time post-IPO",
            "Summary": "Domestic mutual funds reduced their stake in One97 Communications to 14.96% in Q3, marking the first decline since the company's November 2021 listing, while retail investors continued selling for the seventh consecutive quarter.",
            "Sentiment": "negative",
            "PublishDate": 1768449239038,
            "Source": "mutualfunds"
        },
        {
            "Title": "Paytm Completes Fincollect Acquisition & Europe Expansion",
            "Summary": "One 97 Communications (Paytm) completes 100% acquisition of Fincollect Services and establishes Paytm Europe Payments S.A. in Luxembourg, marking strategic expansion moves.",
            "Sentiment": "positive",
            "PublishDate": 1768316459358,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paytm Sees Strong Institutional Interest in Q3 FY26",
            "Summary": "One 97 Communications witnessed increased FPI and domestic institutional participation in Q3 FY26, with Category I FPIs raising stake to 25.33% and insurance companies boosting holdings to 4.77%.",
            "Sentiment": "positive",
            "PublishDate": 1768232112365,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Upgrades Paytm to Neutral, Raises Target",
            "Summary": "Macquarie upgrades Paytm from Underperform to Neutral rating and raises target price to ₹1,265, signaling improved outlook for the digital payments company.",
            "Sentiment": "positive",
            "PublishDate": 1768189964624,
            "Source": "stocks"
        },
        {
            "Title": "One 97 Communications: ₹37.67 Cr NSE Block Trade",
            "Summary": "One 97 Communications executed a significant NSE block trade worth ₹37.67 crores involving approximately 286,870 shares at ₹1,313.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767852067528,
            "Source": "co_actions_results"
        },
        {
            "Title": "One 97 Communications Acquires Stakes in Three Firms",
            "Summary": "One 97 Communications has completed the acquisition of shares in Admirable Software, Mobiquest Mobile Technologies, and Urja Money, expanding its business portfolio through strategic investments.",
            "Sentiment": "positive",
            "PublishDate": 1767182805051,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paytm Seeks Shareholder Approval for New Independent Director",
            "Summary": "One 97 Communications (Paytm) has issued a postal ballot notice seeking member approval for the appointment of Ms. Manisha Raj Raisinghani as Non-Executive Independent Director and her remuneration framework.",
            "Sentiment": "neutral",
            "PublishDate": 1767011886021,
            "Source": "stocks"
        },
        {
            "Title": "India's travel boom diversifies with spiritual tourism",
            "Summary": "Paytm reports sustained growth in spiritual, cultural and entertainment travel in 2025, with Kumbh Mela bookings to Prayagraj rising threefold and tier-2 cities showing increased demand.",
            "Sentiment": "positive",
            "PublishDate": 1766588245852,
            "Source": "stocks"
        },
        {
            "Title": "Paytm Unit Gets Approval for WOSS in Two Countries",
            "Summary": "One 97 Communications subsidiary receives regulatory approval to establish Wholly Owned Subsidiary Services in Indonesia and Luxembourg, expanding international operations.",
            "Sentiment": "positive",
            "PublishDate": 1766408669728,
            "Source": "stocks"
        },
        {
            "Title": "Paytm Expands Globally with New Subsidiaries & UAE Deal",
            "Summary": "One 97 Communications approves incorporation of subsidiaries in Indonesia and Luxembourg while securing AED 7.69 million investment from Abbar Global for its UAE operations through strategic partnership.",
            "Sentiment": "positive",
            "PublishDate": 1766408441719,
            "Source": "co_actions_results"
        },
        {
            "Title": "Paytm Gets RBI Nod for Offline & Cross-Border Payments",
            "Summary": "One 97 Communications' subsidiary PPSL receives comprehensive RBI authorization for payment aggregator services across online, offline, and cross-border segments on December 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765985901177,
            "Source": "stocks"
        },
        {
            "Title": "Paytm Invests ₹22.50 Billion in Payment Services Unit",
            "Summary": "One 97 Communications makes substantial investment of ₹22.50 billion in its Paytm Payments Services subsidiary to strengthen payment operations and business capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765544272144,
            "Source": "stocks"
        },
        {
            "Title": "Paytm Allots 2.25 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "One97 Communications Limited (Paytm) allotted 2,25,559 equity shares of ₹1 face value each to eligible employees upon exercise of vested stock options under its ESOP schemes on December 2, 2025. The allotment increased the company's paid-up share capital from ₹63,93,13,697 to ₹63,95,39,256, with the newly issued shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764645697507,
            "Source": "corporate_action"
        },
        {
            "Title": "Paytm Transfers Offline Merchant Payments Business to Subsidiary PPSL",
            "Summary": "Paytm has transferred its offline merchant payments business to its subsidiary PPSL, with the transfer taking effect on November 30, 2025. The transfer includes key executives along with the business operations, representing a restructuring of Paytm's merchant payment services.",
            "Sentiment": "neutral",
            "PublishDate": 1764404420293,
            "Source": "corporate_action"
        },
        {
            "Title": "Paytm Completes Acquisition of Remaining Stakes in Three Subsidiaries to Simplify Group Structure",
            "Summary": "One97 Communications Limited (Paytm) acquired remaining stakes of 9.99% in Foster Payment Networks, 67.55% in Paytm Insuretech, and 51.22% in Paytm Financial Services Limited, making them wholly owned subsidiaries. The acquisitions also resulted in four additional entities becoming step-down wholly owned subsidiaries through direct and indirect shareholdings.",
            "Sentiment": "positive",
            "PublishDate": 1764349103557,
            "Source": "corporate_action"
        },
        {
            "Title": "RBI Grants Payment Aggregator License to Paytm Payments Services",
            "Summary": "The Reserve Bank of India has issued a Certificate of Authorization to Paytm Payments Services Limited, enabling it to operate as a payment aggregator. This regulatory approval allows One 97 Communications' subsidiary to facilitate payment processing services for merchants and businesses.",
            "Sentiment": "positive",
            "PublishDate": 1764202314394,
            "Source": "corporate_action"
        },
        {
            "Title": "Paytm Shareholders Approve Transfer of Offline Merchant Payment Business to Subsidiary",
            "Summary": "One 97 Communications Limited (Paytm) shareholders unanimously approved the transfer of its Offline Merchants Payment Business to wholly-owned subsidiary Paytm Payments Services Limited through postal ballot voting. The special resolution received 100% approval with 48,69,41,861 votes cast in favor and zero votes against, demonstrating complete shareholder support for the business restructuring move.",
            "Sentiment": "positive",
            "PublishDate": 1763980842841,
            "Source": "corporate_action"
        },
        {
            "Title": "SAIF III Mauritius Sells 2% Stake in Paytm Through Open Market Transaction",
            "Summary": "SAIF III Mauritius Company Limited and its persons acting in concert sold 12.8 million shares (2%) of One97 Communications Limited (Paytm) through open market transactions on November 18, 2025. The disposal reduced their combined holding from 16.46% to 14.45%, with SAIF III Mauritius retaining 9.45% and associated entities holding smaller percentages in the digital payments company.",
            "Sentiment": "neutral",
            "PublishDate": 1763704942624,
            "Source": "corporate_action"
        },
        {
            "Title": "Paytm Recovers UPI Transaction Volumes to Pre-Decline Levels After Two-Year Period",
            "Summary": "Paytm has restored its UPI transaction volumes to previous levels after a two-year recovery period, achieving record transaction volumes. The milestone represents a significant operational recovery for the digital payments company and its stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1763613670171,
            "Source": "stock"
        },
        {
            "Title": "Societe Generale Acquires 3.2 Million Paytm Shares at Rs 1,305 Per Share",
            "Summary": "Societe Generale purchased 3.2 million shares of Paytm at Rs 1,305 per share through a bulk deal transaction. The acquisition represents institutional investment in the digital payments company at the specified price point.",
            "Sentiment": "neutral",
            "PublishDate": 1763507276877,
            "Source": "order&deals"
        },
        {
            "Title": "Paytm Reports Turnaround with Consecutive Profitable Quarters After Regulatory Crisis",
            "Summary": "Paytm achieved its first profit of Rs 123 crore in Q1 followed by Rs 210 crore in Q2, marking a dramatic recovery from regulatory setbacks that caused shares to fall from Rs 1782 to Rs 341. The fintech company's revival through cost cutting, AI integration, and focus on core payments business has attracted domestic institutional investors and analyst upgrades with target prices up to Rs 1,600.",
            "Sentiment": "positive",
            "PublishDate": 1763353080246,
            "Source": "stock"
        },
        {
            "Title": "Paytm Files Insolvency Plea Against WinZO Over ₹3.6 Crore Advertising Dues",
            "Summary": "One97 Communications Ltd filed an insolvency petition against online gaming platform WinZO at the National Company Law Tribunal over unpaid advertising dues of ₹3.6 crore. The dues relate to four invoices for promoting WinZO's real-money gaming products like poker and rummy on Paytm's app, with a 60-day payment term. Paytm served a demand notice on October 1 but received no payment. WinZO claims the invoices require email validation under purchase order terms and are under internal review. Paytm argues this constitutes indefinite delay, noting earlier invoices were cleared without dispute. The tribunal granted WinZO two weeks to respond, with the next hearing scheduled for December 15.",
            "Sentiment": "negative",
            "PublishDate": 1762861072377,
            "Source": "stock"
        },
        {
            "Title": "Paytm Launches Redesigned App With AI Features and Digital Gold Rewards",
            "Summary": "Paytm (One 97 Communications Ltd) has launched a fully redesigned version of its flagship app featuring artificial intelligence-driven capabilities and over 15 new features. The update includes a cleaner user interface designed to make payments faster and more personalized. Key innovations include 'Gold Coins,' which rewards users with digital gold on every payment, and AI-powered features that understand spending patterns, automatically organize transactions, and provide personalized insights. The app now categorizes monthly expenses into shopping, bills, travel, and utilities using AI tags, and offers enhanced privacy with 'Hide Payments' functionality. Additional features include UPI statement downloads, payment search filters, Magic Paste for auto-filling bank details, and a Receive Money widget for professionals. The app extends support to Non-Resident Indians from 12 countries, allowing them to link international mobile numbers with their NRE or NRO bank accounts for UPI payments in Indian rupees. CEO Vijay Shekhar Sharma stated the redesign brings intelligence to payments and represents the next step in making payments smarter.",
            "Sentiment": "positive",
            "PublishDate": 1762765882639,
            "Source": "stock"
        },
        {
            "Title": "Paytm Reports Strong Q2 Performance with AI Integration and Postpaid Product Relaunch",
            "Summary": "One97 Communications (Paytm) conducted its quarterly earnings call discussing results for the quarter ended September 30, 2025. CEO Vijay Shekhar Sharma emphasized the company's focus on AI integration across business operations, highlighting AI-powered features and voice models developed in-house. The company relaunched its Postpaid product in September 2025, partnering with a bank to offer UPI-based credit services. Paytm reported improvements in net payment margins driven by credit instruments and EMI capabilities during the festive season. The company added 5,000 sales employees in the quarter to expand merchant acquisition. Financial services revenue showed acceleration, with growth in merchant loans and wealth products including gold. Management indicated they are near completion of device optimization, with refurbishment programs reducing capital expenditure. The company outlined plans for international expansion of its payment technology stack and AI infrastructure monetization opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1762610614158,
            "Source": "earnings"
        },
        {
            "Title": "Paytm and Razorpay Founders Respond to Viral Delhi Parking Fee QR Code Controversy",
            "Summary": "A viral video on X platform showed a man collecting parking fees using a Razorpay POS terminal displaying a PhonePe QR code. When the QR code was scanned, it revealed 'Vinod Kumar' as the payment receiver instead of Municipal Corporation of Delhi. The man identified himself as Vinod Kumar and explained that contractors collect parking fees on behalf of the corporation. Razorpay Founder Shashank Kumar responded by announcing plans to disable gallery access for sellers in the next software update. Paytm Founder Vijay Shekhar Sharma promoted his company's soundbox feature as a solution to prevent such offline payment confusion. Social media users had mixed reactions, with some explaining that contractors typically handle municipal parking collections, while others raised concerns about payment transparency.",
            "Sentiment": "neutral",
            "PublishDate": 1762501230637,
            "Source": "stock"
        },
        {
            "Title": "Paytm Launches Gold Loyalty Program and AI-Powered Travel Platform",
            "Summary": "One97 Communications, owner of the Paytm brand, launched a loyalty program allowing users to convert points into gold. Users earn one gold point per Rs 100 spent, with double points for RuPay card payments. Points can be converted to digital gold once reaching Rs 15, with 100 gold coins equaling Rs 1 worth of digital gold. The program includes person-to-person money transfers and UPI payments. Paytm also released a new travel platform featuring an AI assistant for destination recommendations, personalized itineraries, and booking services across flights, trains, buses, and metro through conversational interface.",
            "Sentiment": "positive",
            "PublishDate": 1762479073402,
            "Source": "stock"
        },
        {
            "Title": "Paytm Reports 98% Profit Drop Despite Strong Revenue Growth; Citi Sets Rs 1,500 Target",
            "Summary": "Paytm reported a 98% decline in net profit to Rs 21 crore for the July-September quarter, down from Rs 928 crore in the same period last year, primarily due to a Rs 190 crore impairment charge related to its First Games Technology joint venture. Excluding this charge, profit stood at Rs 211 crore. The company demonstrated strong operational performance with revenue rising 24% to Rs 2,061 crore, driven by increased subscription merchants and higher payment volumes. Contribution profit grew 35% to Rs 1,207 crore with margins improving to 59%. Net payment revenue increased 28% to Rs 594 crore, while financial services distribution revenue surged 63% to Rs 611 crore. Citi maintained a 'Buy' rating with a Rs 1,500 target price, upgrading EBITDA estimates for the next three years by 33%, 19%, and 13% respectively, citing improved unit economics and strong growth momentum across payment aggregation and UPI credit segments.",
            "Sentiment": "neutral",
            "PublishDate": 1762400210119,
            "Source": "earnings"
        },
        {
            "Title": "One 97 Communications Reports Mixed Financial Updates with Growth Plans for AI Products",
            "Summary": "One 97 Communications reported a decrease in capital expenditures and depreciation expenses for devices. The company's management stated that marketing services revenue is near its lowest point but expects future growth. The company experienced significant growth in non-lender partners, with their assets under management more than doubling over the past year, particularly in merchant loans. One 97 Communications plans to implement a subscription model with additional fees for AI-enabled products.",
            "Sentiment": "neutral",
            "PublishDate": 1762400053001,
            "Source": "stock"
        },
        {
            "Title": "Paytm Co-Executive Predicts AI Products Will Create New Revenue Streams",
            "Summary": "A Paytm co-executive has predicted that AI products will create new revenue streams for the company.",
            "Sentiment": "positive",
            "PublishDate": 1762328434232,
            "Source": "stock"
        },
        {
            "Title": "Paytm Partners With Groq For AI Platform Development",
            "Summary": "Paytm has entered into a partnership with Groq for AI platform development. The collaboration aims to leverage Groq's capabilities in the artificial intelligence space to enhance Paytm's platform offerings.",
            "Sentiment": "positive",
            "PublishDate": 1762327922683,
            "Source": "stock"
        },
        {
            "Title": "Paytm Reports No Deviation in IPO Fund Utilization for September Quarter",
            "Summary": "One97 Communications Limited (Paytm) submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from the stated objectives of its IPO fund utilization. Axis Bank Limited, serving as the monitoring agency, confirmed that the company's utilization remains aligned with the offer document disclosures. The original IPO raised ₹18,300 crores during November 8-10, 2021. The funds were allocated for two main purposes: ₹4,300 crores for growing and strengthening the Paytm ecosystem (including marketing expenses of ₹761 crores and technology platform expansion of ₹1,817 crores), and ₹2,000 crores for investing in new business initiatives, acquisitions and strategic partnerships. During the quarter, the company transferred ₹1 crore from the monitoring agency account to general purpose accounts as interest earned in the previous quarter, and received ₹13 crores as interest on fixed deposits. Unutilized funds are maintained in bank balances earning 2.93% return.",
            "Sentiment": "neutral",
            "PublishDate": 1762298672953,
            "Source": "corporate_action"
        },
        {
            "Title": "Paytm Reports Quarterly Results, Appoints New Director and Plans INR 2,250 Crore Investment in Subsidiary",
            "Summary": "One97 Communications Limited (Paytm) announced its quarterly results for the quarter and half year ended September 30, 2025. The company appointed Ms. Manisha Raj Raisinghani as Non-Executive Independent Director for a five-year term, subject to shareholder approval. The board approved additional investment of up to INR 2,250 crores in wholly owned subsidiary Paytm Payments Services Limited through a rights issue. The investment will strengthen PPSL's net worth, fund acquisition of offline merchant payment business, support working capital needs, and maintain leadership in merchant payments business. The company also granted 5,50,000 stock options under ESOP 2019 scheme. Paytm received show cause notice from Directorate of Enforcement regarding alleged FEMA contraventions worth approximately INR 611 crores, with some matters already resolved by RBI. The company recorded exceptional items including impairment losses related to First Games Technology Private Limited due to online gaming prohibition.",
            "Sentiment": "neutral",
            "PublishDate": 1762281204512,
            "Source": "earnings"
        },
        {
            "Title": "Paytm Reports 98% Profit Drop Despite 24% Revenue Growth in Q2",
            "Summary": "Paytm reported a consolidated net profit of Rs 21 crore, down 98% from Rs 928 crore in the same period last year. The decline was attributed to a one-time charge of Rs 190 crore for full impairment of a loan to joint venture First Games Technology. Without this charge, profit would have been Rs 211 crore. Revenue from operations grew 24% year-on-year to Rs 2,061 crore, driven by increased subscription merchants, higher payments GMV, and growth in financial services distribution. Contribution profit rose 35% to Rs 1,207 crore with a 59% margin. Net payment revenue increased 28% to Rs 594 crore, while distribution of financial services revenue jumped 63% to Rs 611 crore. The company outlined four focus areas including expanding merchant leadership, growing financial services distribution, driving AI-first innovation, and evaluating new international markets as a long-term growth driver expected to contribute meaningfully after 2-3 years.",
            "Sentiment": "neutral",
            "PublishDate": 1762274804200,
            "Source": "earnings"
        },
        {
            "Title": "One 97 Communications Reports Sharp Drop in Net Profit Despite Revenue Growth",
            "Summary": "One 97 Communications reported quarterly net profit of 210 million rupees compared to 9.3 billion rupees in the same period last year. The company recorded an exceptional loss of 1.9 billion rupees versus an exceptional gain of 13.45 billion rupees year-over-year. Revenue increased to 20.6 billion rupees from 16.6 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762273709332,
            "Source": "earnings"
        },
        {
            "Title": "One 97 Communications Acquires Majority Stakes in Two Paytm Subsidiaries",
            "Summary": "One 97 Communications has acquired 51% shares in Paytm Intelligence Ltd and Paytm Life Insurance Ltd from Vijay Shekhar Sharma. This transaction gives One 97 Communications majority control over both subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1761842341675,
            "Source": "order&deals"
        },
        {
            "Title": "Paytm Launches UPI Service for NRIs in 12 Countries Using International Mobile Numbers",
            "Summary": "Paytm has launched a service enabling Non-Resident Indians from 12 countries to make UPI payments in India using their international mobile numbers, eliminating the need for local Indian SIM cards. The service works with NRE or NRO bank accounts and allows NRIs to send money, pay merchants through QR codes, and shop on Indian platforms without currency conversions. The National Payments Corporation of India powers the service, available to Indians in Singapore, Australia, Canada, Hong Kong, Oman, Qatar, USA, Saudi Arabia, UAE, UK, France, and Malaysia. Currently in beta testing, the feature will roll out to all eligible users soon. The platform includes additional features such as downloadable UPI statements, automatic expense categorization, and an AI-generated spending summary called Paytm Playbook. One 97 Communications Limited shares closed at ₹1,305.60, up ₹18.60 or 1.45%.",
            "Sentiment": "positive",
            "PublishDate": 1761567998880,
            "Source": "stock"
        },
        {
            "Title": "Paytm Seeks Shareholder Approval to Transfer Offline Merchant Payment Business to Subsidiary",
            "Summary": "One 97 Communications Limited (Paytm) has issued a postal ballot notice seeking shareholder approval to transfer its Offline Merchants Payment Business to wholly-owned subsidiary Paytm Payments Services Limited (PPSL). The business transfer includes offline merchants serviced through QR, Soundbox, and EDC machine payments. The transfer is proposed as a slump sale at book value consideration, which was approximately INR 960 crores as of March 31, 2025. The move aims to comply with RBI Master Directions on Payment Aggregator regulation issued in September 2025. PPSL received in-principle RBI approval in August 2025 to operate Online Merchants Payment Business. The transferred business generated approximately 47% of Paytm's total revenue in FY 24-25. Remote e-voting will be conducted from October 25, 2025 to November 23, 2025, with results to be announced by November 25, 2025. The transfer will consolidate online and offline merchant payment businesses within one regulated entity while maintaining full consolidation in Paytm's financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1761308944829,
            "Source": "corporate_action"
        },
        {
            "Title": "Paytm Retail Shareholders Continue Exit While Mutual Funds Increase Stakes",
            "Summary": "One97 Communications Ltd., Paytm's parent company, saw retail shareholders decline for the sixth consecutive quarter. Retail shareholders dropped to 8.45 lakh from 8.93 lakh in the previous quarter, with their stake falling to 9.07% from 9.73%. Conversely, domestic mutual funds increased their holdings to 16.25% from 13.86% in the previous quarter and 13.11% in March. Key mutual fund investors include Motilal Oswal Midcap Fund (5.57%), Nippon India Growth Midcap Fund (2.11%), and Mirae Asset Largecap Fund (1.66%). Founder Vijay Shekhar Sharma's stake remained unchanged at 9.07%. Paytm shares gained 22% during July-September and 18% in April-June, closing at ₹1,306.8. Axis Capital upgraded the stock with a target price of ₹1,500.",
            "Sentiment": "positive",
            "PublishDate": 1761182110706,
            "Source": "stock"
        },
        {
            "Title": "Paytm Restructures Operations with Business Transfer and Group Simplification Initiatives",
            "Summary": "One 97 Communications Limited (Paytm) announced two major restructuring initiatives. The company's board approved the transfer of its Offline Merchants Payment Business to wholly-owned subsidiary Paytm Payments Services Limited through a slump sale to comply with Reserve Bank of India's Master Directions on Payment Aggregators dated September 15, 2025. The transferred business, which includes QR, soundbox, and EDC machine payments, generated approximately INR 2,580 crores in revenue for FY 2024-25, representing 47% of Paytm's standalone revenue. The transfer is valued at approximately INR 960 crores based on book value and is expected to complete by December 31, 2025. Additionally, Paytm approved a group restructuring to simplify its corporate structure by acquiring stakes in multiple subsidiaries from Vijay Shekhar Sharma and related entities for a total consideration of up to INR 4.02 crores. This includes acquiring 51.22% of Paytm Financial Services Limited for INR 0.5 crores, making it a wholly-owned subsidiary, and acquiring remaining stakes in Paytm Emerging Tech Limited, Paytm Insuretech Private Limited, and Paytm Life Insurance Limited. The company will also convert debentures worth approximately INR 15 crores in Little Internet Private Limited, increasing its shareholding from 62.53% to 78%. All transactions are expected to complete by January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1760512645345,
            "Source": "corporate_action"
        },
        {
            "Title": "One 97 Communications Approves Transfer of Offline Merchant Payments to Paytm Payments Services",
            "Summary": "One 97 Communications has approved the transfer of its offline merchant payments business to Paytm Payments Services to comply with RBI regulations. The company has set a completion deadline of December 31, 2025 for this transfer.",
            "Sentiment": "neutral",
            "PublishDate": 1760512227313,
            "Source": "stock"
        },
        {
            "Title": "Paytm Unveils App Redesign Focusing on Core Payment Services",
            "Summary": "Paytm founder Vijay Shekhar Sharma announced a redesign of the company's mobile app, featuring a clean white-themed interface that prioritizes core services like UPI transfers and bill payments. The new layout emphasizes quick-access functionality with prominent placement of frequently used features including UPI transfers, credit card bill reminders, and investment options. User feedback has been mixed, with some praising the cleaner, clutter-free design while others raised concerns about ad placement disrupting payment processes and reported technical issues including capitalization errors for bank names and flight ticket display glitches. Users also suggested improvements such as customizable sections for most-used features and better prioritization of transaction functions. The app revamp represents Paytm's effort to rebuild consumer confidence and streamline services following Reserve Bank of India restrictions on its payments bank operations.",
            "Sentiment": "neutral",
            "PublishDate": 1760441714455,
            "Source": "stock"
        }
    ]
}