{
    "Symbol": "PCBL",
    "ISIN": "INE602A01031",
    "News": [
        {
            "Title": "PCBL Chemical gets credit ratings reaffirmed by ICRA",
            "Summary": "ICRA Limited reaffirmed credit ratings for PCBL Chemical Limited's various financial instruments totaling Rs. 2,400.00 crores, including NCDs, commercial paper, and term loans with AA negative ratings.",
            "Sentiment": "neutral",
            "PublishDate": 1770904718414,
            "Source": "stocks"
        },
        {
            "Title": "PCBL Chemical clarifies trading volume surge to BSE",
            "Summary": "PCBL Chemical Limited responds to BSE inquiry about increased trading volumes, stating compliance with disclosure norms and attributing volume surge to market-driven factors with no undisclosed price-sensitive information.",
            "Sentiment": "neutral",
            "PublishDate": 1770883320336,
            "Source": "stocks"
        },
        {
            "Title": "PCBL Chemical Submits Q3FY26 Monitoring Report",
            "Summary": "PCBL Chemical Limited submitted its monitoring agency report for Q3FY26 under SEBI regulations regarding preferential issue of warrants. The report shows no deviation from stated objects.",
            "Sentiment": "neutral",
            "PublishDate": 1770815932907,
            "Source": "co_actions_results"
        },
        {
            "Title": "PCBL Chemical Q3 Results Show Mixed Performance",
            "Summary": "PCBL Chemical reports standalone revenue of ₹1,292.12 crores for Q3 FY26, with net profit declining to ₹36.08 crores compared to ₹110.99 crores in Q3 FY25.",
            "Sentiment": "negative",
            "PublishDate": 1770225528070,
            "Source": "co_actions_results"
        },
        {
            "Title": "PCBL Chemical Q3FY26 Results: Revenue Drops to ₹1,846 Cr",
            "Summary": "PCBL Chemical reports Q3FY26 consolidated revenue of ₹1,846 crore and EBITDA of ₹231 crore. Company commissioned 60 KTPA brownfield expansion and improved working capital cycle by 12 days.",
            "Sentiment": "neutral",
            "PublishDate": 1770128556259,
            "Source": "co_actions_results"
        },
        {
            "Title": "PCBL Chemical Q3 Net Profit Drops to ₹20M",
            "Summary": "PCBL Chemical reports consolidated net profit of ₹20 million in Q3 compared to ₹930 million in the same quarter last year, marking a significant year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1770106496887,
            "Source": "co_actions_results"
        },
        {
            "Title": "PCBL Chemical schedules investor meet on Feb 11",
            "Summary": "PCBL Chemical Limited announces participation in Nuvama India Investor Conference 2026 on February 11, 2026 in Mumbai as group meeting under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770037378500,
            "Source": "stocks"
        },
        {
            "Title": "PCBL Chemical Subsidiary Starts Line-4 Production",
            "Summary": "PCBL Chemical's subsidiary commenced commercial production of Line-4 on January 28, 2026, adding 60,000 MT annual carbon black capacity through brownfield expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769659331436,
            "Source": "stocks"
        },
        {
            "Title": "PCBL Chemical Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "PCBL Chemical Limited has scheduled a board meeting on February 3, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769500722121,
            "Source": "co_actions_results"
        },
        {
            "Title": "PCBL Chemical Gets AA Rating Reaffirmed on ₹600 Cr NCDs",
            "Summary": "Crisil Ratings reaffirmed PCBL Chemical Limited's AA rating with negative outlook on ₹600 crore Non-Convertible Debentures, maintaining the credit assessment for the chemical company's debt instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1768035118958,
            "Source": "stocks"
        },
        {
            "Title": "PCBL Chemical Gets A1+ Rating Reaffirmed",
            "Summary": "PCBL Chemical Limited receives credit rating reaffirmation from CRISIL for its ₹550 crore Commercial Paper programme with A1+ rating maintained, reflecting strong financial position.",
            "Sentiment": "positive",
            "PublishDate": 1768034947961,
            "Source": "stocks"
        },
        {
            "Title": "PCBL Chemical gets Crisil AA rating reaffirmation",
            "Summary": "PCBL Chemical Limited receives Crisil AA/Negative rating reaffirmation for bank facilities worth ₹800 crores across three loan categories including proposed long-term facility and term loans.",
            "Sentiment": "neutral",
            "PublishDate": 1768034868390,
            "Source": "stocks"
        },
        {
            "Title": "PCBL Chemical Appoints Sanjay Ghawghawe as Executive Director",
            "Summary": "PCBL Chemical Limited has appointed Mr. Sanjay Prabhakar Ghawghawe as Chief Manufacturing Operations Executive Director effective January 5, 2026. Ghawghawe brings 29 years of industry experience.",
            "Sentiment": "positive",
            "PublishDate": 1767618514586,
            "Source": "stocks"
        },
        {
            "Title": "PCBL Chemical Gets ISCC Plus Certification",
            "Summary": "PCBL Chemical receives ISCC Plus certification and introduces sustainable Ecozen6000R material, marking advancement in sustainable chemical solutions.",
            "Sentiment": "positive",
            "PublishDate": 1767096212658,
            "Source": "stocks"
        },
        {
            "Title": "PCBL Chemical Receives Rs 10,000 GST Penalty from State Tax Appellate Authority",
            "Summary": "PCBL Chemical Limited has been imposed a general penalty of Rs 10,000 under section 125 of the Goods and Services Tax Act 2017 by the State Tax Appellate Authority, Vadodara, due to address mismatch in Tax Invoice and Eway Bill. The authority waived off the tax liability of Rs 1,77,171 along with equal penalty, and the company states there is no material impact on its financial or operational activities.",
            "Sentiment": "neutral",
            "PublishDate": 1764086226424,
            "Source": "stock"
        },
        {
            "Title": "PCBL Chemical Seeks Shareholder Approval for Nilesh Koul's Appointment as Managing Director",
            "Summary": "PCBL Chemical Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Nilesh Koul (DIN: 10963815) as Managing Director for a five-year term from November 3, 2025 to November 2, 2030. The 52-year-old executive brings 28 years of leadership experience across metals, construction materials, oil and gas, and FMCG sectors, having worked with companies including Hindalco Industries Limited, British Petroleum, Castrol India Ltd, and Lafarge Holcim. His proposed remuneration package includes a basic salary of Rs 22.50 lakh per month, customized allowance pool of Rs 23.71 lakh per month, one-time joining bonus of Rs 1.5 crore, and Long Term Incentive Plan worth Rs 9 crore. Remote e-voting will be conducted from November 12, 2025 at 9:00 AM to December 11, 2025 at 5:00 PM through NSDL platform. Manoj Prasad Shaw has been appointed as scrutinizer for the postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1762848741760,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quest Capital Markets Acquires PCBL Chemical Shares Through Warrant Exercise at Rs 280 Per Share",
            "Summary": "Quest Capital Markets Limited, a promoter group entity of PCBL Chemical Limited, has acquired equity shares through the exercise of warrants. Each warrant was converted into one fully paid-up equity share of PCBL Chemical Limited with a face value of Re. 1 per share at a price of Rs. 280 each. The shares were issued on a preferential basis. Quest Capital Markets disclosed this acquisition under insider trading regulations to PCBL Chemical's compliance officer, which was subsequently reported to stock exchanges NSE and BSE by PCBL Chemical.",
            "Sentiment": "neutral",
            "PublishDate": 1762483097304,
            "Source": "corporate_action"
        },
        {
            "Title": "Rainbow Investments Converts Warrants to Acquire 1.36 Crore PCBL Chemical Shares",
            "Summary": "Rainbow Investments Limited, a promoter of PCBL Chemical Limited, acquired 1.36 crore equity shares through conversion of warrants at Rs. 280 per share. The shares were allotted on November 3, 2025, pursuant to exercise of rights attached to warrants issued on a preferential basis. Post-acquisition, Rainbow Investments' shareholding in PCBL Chemical increased to 18.66 crore shares, representing 47.43% of the company's equity. The warrants had a face value of Re. 1 per share and were converted at the predetermined price of Rs. 280 each.",
            "Sentiment": "neutral",
            "PublishDate": 1762481865127,
            "Source": "corporate_action"
        },
        {
            "Title": "Stel Holdings Converts Warrants to Equity Shares in PCBL Chemical",
            "Summary": "Stel Holdings Limited, a promoter group entity of PCBL Chemical Limited, has acquired equity shares through the exercise of warrants. Each warrant was converted into one fully paid equity share with a face value of Re. 1 per share at a price of Rs. 280 each. The conversion was completed under a preferential issue arrangement, with the warrants having an 18-month exercise period from the date of allotment. PCBL Chemical has disclosed this transaction in compliance with insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762435374071,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Chemical Allots Rs 100 Crore Commercial Paper",
            "Summary": "PCBL Chemical Limited has allotted 2,000 units of Commercial Paper with a face value of Rs 5,00,000 each, totaling Rs 100 crores on November 6, 2025. The Fund Raising Committee-Commercial Paper approved the allotment under powers delegated by the Board of Directors. The commercial paper will be listed on BSE Ltd. The company reported no delays in payment of interest or principal amounts and no defaults in payment obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1762432955688,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Chemical Allots 1.6 Crore Equity Shares Upon Warrant Exercise, Raises Rs 336 Crore",
            "Summary": "PCBL Chemical Limited has allotted 1,60,00,000 equity shares of face value Re. 1 each upon conversion of an equal number of warrants. The company received Rs 336 crore at Rs 210 per warrant, representing 75% of the warrant issue price of Rs 280. Three promoter entities exercised the warrants: Rainbow Investments Limited (1.36 crore shares), Quest Capital Markets Limited (12 lakh shares), and STEL Holdings Limited (12 lakh shares). The warrants were originally allotted on May 7, 2024, with 25% payment of Rs 70 per warrant made initially. Following this allotment, the company's paid-up share capital has increased to Rs 39.35 crore, consisting of 39,34,62,604 equity shares of Re. 1 each. The newly allotted equity shares rank equally with existing equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1762174761279,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Chemical Limited Announces Leadership Change: Managing Director Resigns, New Appointment Made",
            "Summary": "PCBL Chemical Limited announced significant leadership changes during its board meeting on November 3, 2025. Kaushik Roy resigned from his position as Managing Director due to personal reasons, also stepping down from his roles as Chairman of the Sustainability and Risk Management Committee and CSR Committee, and as Member of the Stakeholders Relationship Committee. The board simultaneously approved the appointment of Nilesh Koul as the new Managing Director for a five-year term, subject to shareholder approval through a special resolution via postal ballot. Koul brings 28 years of leadership experience across metals, construction materials, oil and gas, and FMCG industries, having worked with companies including Hindalco Industries Limited, British Petroleum, Castrol India Ltd, and Lafarge Holcim. His most recent role was Senior President and CEO of Aluminium Downstream at Hindalco Industries Limited from January 2021 to October 2025. He holds a graduate degree from G.B. Pant University and a PGDBM from IIM Ahmedabad.",
            "Sentiment": "neutral",
            "PublishDate": 1762156236791,
            "Source": "corporate_governance"
        },
        {
            "Title": "PCBL Chemical Q2 FY26 Earnings: Margins Hit by US Tariffs and Market Pressures Despite Volume Growth",
            "Summary": "PCBL Chemical reported consolidated revenue of Rs. 2,164 crores in Q2 FY26 with carbon black sales volume increasing 5% quarter-on-quarter to 161,728 metric tons, achieving 99% capacity utilization. However, consolidated EBITDA dropped to Rs. 278 crores with EBITDA per ton declining to approximately Rs. 16,000 from previous levels of Rs. 20,000. The company faced margin pressure from US tariffs (effective 20% rate on their exports), crude oil price volatility, and GST-related purchase deferrals in the auto sector. US exports account for 5% of total volume but generate Rs. 350 crores in annual revenue. The company reduced gross debt by over Rs. 300 crores since March 2025 and improved working capital cycle by 12 days, releasing Rs. 240 crores of cash. Power generation reached record levels at 223 MUs with external sales of 138 MUs. Aquapharm Chemical reported revenue of Rs. 395 crores with 9% topline growth and EBITDA of Rs. 48 crores, targeting an exit rate of Rs. 75 crores EBITDA by year-end. The company is commissioning multiple expansion projects including a 90,000 MTPA rubber line in Tamil Nadu and specialty black lines in Gujarat and Mundra.",
            "Sentiment": "neutral",
            "PublishDate": 1761320214225,
            "Source": "earnings"
        },
        {
            "Title": "PCBL Chemical Reports 5% QoQ Growth in Carbon Black Sales Despite Challenging Environment",
            "Summary": "PCBL Chemical Limited reported consolidated revenue of Rs. 2,164 crore and EBITDA of Rs. 278 crore for Q2 FY26. Carbon Black sales volume increased 5% quarter-on-quarter to 1,61,728 MT, while Specialty Black sales volume grew 9% QoQ to 17,505 MT. The company's subsidiary Aquapharm Chemical generated revenue of Rs. 395 crore with EBITDA of Rs. 48 crore. Working capital cycle improved by 12 days in H1 FY26, releasing around Rs. 240 crore of cash, with gross debt reduction of over Rs. 300 crore since March 2025. Power generation increased 7% year-on-year to 223 MU. The company is expanding capacity with a specialty black line for super-conductive grades expected to start commercial production from November 2025, and a 20,000 MTPA specialty blacks line commissioning likely preponed to March 2026. PCBL targets 50% capacity addition over the next 5 years across all product segments.",
            "Sentiment": "positive",
            "PublishDate": 1760696842039,
            "Source": "earnings"
        },
        {
            "Title": "PCBL Chemical Reports 50% Drop in Net Profit Despite Flat Revenue Growth",
            "Summary": "PCBL Chemical reported quarterly results showing net profit declined to 615 million rupees from 1.23 billion rupees year-over-year. Revenue remained flat at 21.6 billion rupees compared to the same period last year. EBITDA decreased to 2.66 billion rupees from 3.63 billion rupees, while EBITDA margin compressed to 12.3% from 16.8% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1760690365070,
            "Source": "earnings"
        },
        {
            "Title": "PCBL Chemical Limited Approves Q2 FY2026 Results and Declares Rs. 6 Interim Dividend",
            "Summary": "PCBL Chemical Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company declared an interim dividend of Rs. 6 per equity share (600% on face value of Re. 1 each) for the financial year ending March 31, 2026, with October 27, 2025 set as the record date. The board meeting was held on October 17, 2025, commencing at 12:00 noon and concluding at 1:55 PM. The financial results will be published in newspapers and made available on stock exchange websites and the company's website.",
            "Sentiment": "positive",
            "PublishDate": 1760690345241,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Chemical Presents Ambitious Vision 2030 at Investor Conference",
            "Summary": "PCBL Chemical Limited held an investors' conference on September 8, 2025, presenting its strategic roadmap for 2030. The company, which is the 6th largest carbon black producer globally and India's largest, outlined plans to double revenue from Rs. 8,400 Cr to Rs. 16,000 Cr and triple EBITDA from Rs. 1,400 Cr to Rs. 4,000 Cr by 2030. Key growth initiatives include expanding carbon black capacity to 1 million MTPA by FY28, increasing specialty chemicals' revenue share from 28% to 45%, and developing next-generation battery materials including Nano-Silicon, Acetylene Black, and Super-Conductive Carbons. The company reported strong historical performance with revenue growing at 13% CAGR and EBITDA at 20% CAGR over the past decade. PCBL operates 9 manufacturing facilities across 6 continents, serving 70+ countries, and plans significant capacity additions including 2,40,000 tons of carbon black expansion and new battery chemical plants. The company aims to improve EBITDA margins from 16.5% to 24% while reducing net debt to EBITDA ratio from 3.6x to below 1x by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1757244003688,
            "Source": "stock"
        },
        {
            "Title": "PCBL Chemical Reports Steady Q1 FY26 Performance with 2.6% Volume Growth Despite Global Headwinds",
            "Summary": "PCBL Chemical Limited delivered stable quarterly results with consolidated revenue of INR 2,114 crores and EBITDA of INR 325 crores, representing a 2.5% quarter-on-quarter increase. Carbon Black sales volume grew 2.6% to 154,093 MT with 97% capacity utilization, while Aquapharm business volumes increased 9% year-on-year to 26,523 MT. The company achieved record power generation of 215 MUs, up 11% annually. PCBL received a U.S. patent for nanomaterials technology and completed technology transfer for India's first Acetylene Black capacity. The company is expanding with a 30,000 MTPA brownfield project in Tamil Nadu nearing commissioning and planning a 20,000 MTPA Specialty Black line in Mundra. Management noted challenges from global uncertainties including geopolitical tensions and potential U.S. tariffs, while highlighting opportunities from major global carbon black producer Orion's announced plant closures in Europe and North America. The company maintains its target of over 1 million tons capacity by FY28 and expects Aquapharm to achieve INR 300 crores EBITDA guidance for the current year.",
            "Sentiment": "neutral",
            "PublishDate": 1753874480542,
            "Source": "earnings"
        },
        {
            "Title": "PCBL Chemical Establishes Wholly Owned Subsidiary in USA",
            "Summary": "PCBL Chemical has incorporated a wholly owned subsidiary in the United States. The company states this move is aimed at strengthening its global market presence.",
            "Sentiment": "positive",
            "PublishDate": 1753701412137,
            "Source": "stock"
        },
        {
            "Title": "PCBL Chemical Reports No Deviation in Rs 448 Crore Convertible Warrants Fund Utilization",
            "Summary": "PCBL Chemical Limited confirmed no deviation in the use of proceeds from its allotment of 1.6 crore convertible warrants issued on preferential basis. The company raised Rs 112 crore as initial subscription amount (25% of total warrant issue price) on May 7, 2024, with the remaining Rs 336 crore to be received when warrant holders exercise their conversion rights by November 8, 2025. The funds were allocated for debt repayment (Rs 168 crore), working capital funding (Rs 168 crore), and general corporate purposes (Rs 112 crore). During the quarter ended June 30, 2025, no warrants were exercised and no proceeds were utilized. The Audit Committee reviewed and approved the statement confirming no deviation from the original fund utilization plan. CRISIL Ratings Limited serves as the monitoring agency for the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1753278880705,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Chemical Reports Decline in Q1 Financial Performance",
            "Summary": "PCBL Chemical reported a decline in its Q1 financial results. Net profit decreased to 940.5 million rupees from 1.2 billion rupees in the previous year. EBITDA fell to 3.2 billion rupees compared to 3.6 billion rupees year-over-year, with EBITDA margin dropping to 15% from 16.7%. Revenue also declined slightly to 21.1 billion rupees from 21.4 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1753259723133,
            "Source": "earnings"
        },
        {
            "Title": "PCBL's Unit Nanovace Secures US Patent for Energy Storage Technology, Plans Pilot Plant Launch",
            "Summary": "PCBL's subsidiary Nanovace has obtained a US patent for advanced energy storage nanotechnology. The company plans to launch a pilot plant by Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753076415229,
            "Source": "stock"
        },
        {
            "Title": "PCBL Chemical's Subsidiary Expands into U.S. Battery Chemicals Market",
            "Summary": "PCBL Chemical's subsidiary, Nanovace Technologies, has established a new division in the United States to expand its presence in the battery chemicals sector. This move indicates the company's strategic effort to grow in the emerging battery technology market.",
            "Sentiment": "positive",
            "PublishDate": 1750352647000,
            "Source": "default"
        },
        {
            "Title": "PCBL Chemical Reaffirms Growth Guidance",
            "Summary": "PCBL Chemical has confirmed its commitment to its previously announced growth targets. The company expects to achieve revenue of Rs 25,000 crore in the next four to five years. Additionally, PCBL has provided guidance of Rs 70-80 crore for the fourth quarter of fiscal year 2026. This information was shared during a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1745983691000,
            "Source": "default"
        },
        {
            "Title": "PCBL Chemical Reports Q4 Financial Results",
            "Summary": "PCBL Chemical announced its Q4 financial results. Revenue increased to 20.87 billion rupees from 19.3 billion year-over-year. However, EBITDA decreased to 2.97 billion rupees from 3.09 billion, with EBITDA margin falling to 14.23% from 16.05%. Consolidated net profit slightly declined to 1 billion rupees from 1.1 billion year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1745915755000,
            "Source": "result"
        },
        {
            "Title": "PCBL to Consider Q4 Results on April 29",
            "Summary": "PCBL Chemical has announced that it will consider its fourth quarter (Q4) financial results on April 29. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745494689000,
            "Source": "default"
        },
        {
            "Title": "PCBL Chemical to Establish India's First Acetylene Black Plant",
            "Summary": "PCBL Chemical Ltd has announced plans to strengthen its specialty portfolio by setting up India's first Acetylene Black plant. The company has signed a technology transfer agreement with Ningxia Jinhua to facilitate this expansion into specialized chemical production.",
            "Sentiment": "positive",
            "PublishDate": 1739751138000,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Chemical Signs Technology Transfer Agreement with Jinhua",
            "Summary": "PCBL Chemical has entered into a technology transfer agreement with Jinhua. Under the terms of the agreement, PCBL will pay Jinhua USD 2 million to acquire technology for manufacturing conductive carbon black.",
            "Sentiment": "positive",
            "PublishDate": 1739542735000,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Ltd: Q3 Profit Drops 37%, Share Price Tumbles 11%",
            "Summary": "PCBL Ltd's Q3 net profit fell 37% to Rs 93.1 crore due to higher interest and depreciation expenses. Revenue increased 21.4% to Rs 2,010 crore. Carbon black sales grew 2% year-on-year. Export volume growth slowed, and domestic customers deferred purchases. Nuvama revised rating to 'hold' with a target price of Rs 397.",
            "Sentiment": "negative",
            "PublishDate": 1736747542000,
            "Source": "earnings"
        },
        {
            "Title": "PCBL Declares Interim Dividend of 5.5 Rs Per Share",
            "Summary": "PCBL (formerly known as Phillips Carbon Black Limited) has announced an interim dividend of 5.5 rupees per share for its shareholders. This corporate action reflects the company's decision to distribute a portion of its profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1736507793000,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Reports Mixed Q3 Results with Higher EBITDA but Lower Margin",
            "Summary": "PCBL announced its Q3 financial results. The company's EBITDA increased to 3.18 billion rupees from 2.78 billion rupees year-over-year. However, the EBITDA margin decreased to 15.82% from 16.84% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1736507787000,
            "Source": "earnings"
        },
        {
            "Title": "PCBL Reports Q3 Financial Results",
            "Summary": "PCBL has announced its Q3 financial results. The company's consolidated net profit decreased to 931 million rupees from 1.5 billion rupees year-over-year. However, revenue increased to 20.1 billion rupees from 16.6 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1736507778000,
            "Source": "earnings"
        },
        {
            "Title": "PCBL Limited to Hold Investor Meeting on December 13",
            "Summary": "PCBL Limited, formerly known as Phillips Carbon Black Limited, has announced a scheduled meeting with multiple investors on December 13. This meeting suggests the company's active engagement with its stakeholders and potential interest from investors.",
            "Sentiment": "neutral",
            "PublishDate": 1733817153000,
            "Source": "corporate_governance"
        },
        {
            "Title": "PCBL Obtains ISCC PLUS Certification for Sustainable Carbonaceous Material",
            "Summary": "PCBL (formerly Phillips Carbon Black Limited) has announced that it has been certified with ISCC PLUS. This certification allows PCBL Chemical to launch a sustainable carbonaceous material. The International Sustainability and Carbon Certification (ISCC) PLUS is a globally recognized sustainability certification system, indicating that PCBL's new product meets high environmental and social standards.",
            "Sentiment": "positive",
            "PublishDate": 1733233648000,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Commissions Final Phase of Specialty Chemical Capacity at Mundra Plant",
            "Summary": "PCBL has announced the commissioning of the second and final phase of its specialty chemical capacity expansion at its Mundra plant in Gujarat. This phase adds 20,000 MTPA to the plant's capacity, completing the planned 40,000 MTPA expansion. With this addition, PCBL's total combined manufacturing capacity has reached 7,90,000 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1732797658000,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Receives Land Allotment Approval from Andhra Pradesh Government",
            "Summary": "The Government of Andhra Pradesh has approved the allotment of 116.62 acres of land to PCBL. This approval is contingent on the de-notification of the Naidupeta Special Economic Zone (SEZ). The land allocation is a significant development for PCBL's potential expansion or new project in the region.",
            "Sentiment": "positive",
            "PublishDate": 1732716274000,
            "Source": "corporate_action"
        },
        {
            "Title": "PCBL Reports Strong Q2 Financial Performance",
            "Summary": "PCBL has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 1.89 billion rupees to 3.63 billion rupees. Additionally, PCBL's EBITDA margin expanded from 12.74% to 16.78% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730190545000,
            "Source": "result"
        },
        {
            "Title": "PCBL Reports Strong Q2 Revenue Growth",
            "Summary": "PCBL has announced its second quarter revenue results, showing a significant year-over-year increase. The company reported revenue of 21.6 billion rupees for Q2, compared to 14.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730190477000,
            "Source": "result"
        },
        {
            "Title": "PCBL Reports Steady Q2 Net Profit",
            "Summary": "PCBL (formerly Phillips Carbon Black Limited) has announced its Q2 consolidated net profit of 1.23 billion rupees, which remains unchanged compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730190455000,
            "Source": "result"
        }
    ]
}