{
    "Symbol": "PCJEWELLER",
    "ISIN": "INE785M01021",
    "News": [
        {
            "Title": "PC Jeweller Allots 51.25 Crore Equity Shares",
            "Summary": "PC Jeweller Limited allotted 51,24,68,600 equity shares on conversion of warrants by promoter group entities, raising ₹216.01 crore and increasing promoter holding to 40.94%.",
            "Sentiment": "positive",
            "PublishDate": 1769856082374,
            "Source": "co_actions_results"
        },
        {
            "Title": "PC Jeweller Reports No Deviation in Fund Utilization",
            "Summary": "PC Jeweller Limited confirms no deviation in utilization of ₹33.67 crores raised through preferential issues during Q3 FY26, with funds used for debt repayment and working capital as planned.",
            "Sentiment": "neutral",
            "PublishDate": 1769523326934,
            "Source": "stocks"
        },
        {
            "Title": "PC Jeweller Q3 Net Profit Surges 28% to ₹1.9B",
            "Summary": "PC Jeweller reported strong Q3 performance with consolidated net profit rising 28% YoY to ₹1.9 billion, while revenue jumped 37% to ₹8.75 billion, demonstrating robust growth across key metrics.",
            "Sentiment": "positive",
            "PublishDate": 1769521426968,
            "Source": "co_actions_results"
        },
        {
            "Title": "PC Jeweller Allots 6.86 Cr Shares via Warrant Conversion",
            "Summary": "PC Jeweller Limited allotted 6.86 crore equity shares on conversion of 68.55 lakh warrants by 6 non-promoter allottees, raising ₹28.89 crores and increasing paid-up capital to ₹739.70 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769087107607,
            "Source": "co_actions_results"
        },
        {
            "Title": "PC Jeweller Shares Surge 7% on Strong Q3 Performance",
            "Summary": "PC Jeweller shares rally up to 7% following 37% YoY revenue growth in Q3FY26, 68% debt reduction progress, and strategic partnership with UP government for 1,000 retail franchisee units under CM-YUVA initiative.",
            "Sentiment": "positive",
            "PublishDate": 1767519416655,
            "Source": "co_actions_results"
        },
        {
            "Title": "PC Jeweller Partners with CM Yuva Mission",
            "Summary": "PC Jeweller has entered into a strategic agreement with CM Yuva Mission, marking a significant corporate development for the diamond, gems and jewellery company.",
            "Sentiment": "positive",
            "PublishDate": 1766502899076,
            "Source": "stocks"
        },
        {
            "Title": "PC Jeweller Gets UP Government Approval for CM-Yuva Portal Franchise Program",
            "Summary": "PC Jeweller received approval from the Uttar Pradesh government to join the CM-Yuva portal as a franchise brand, enabling the company to establish franchise partnerships through the state platform. The company plans to set up 1,000 jewellery retail franchise units through this initiative to promote entrepreneurship and create employment opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1765151600213,
            "Source": "stock"
        },
        {
            "Title": "PC Jeweller Receives Approval to Join UP Government's CM-YUVA Portal, Plans 1,000 Franchise Outlets",
            "Summary": "PC Jeweller has received approval from the Uttar Pradesh government to join the CM-YUVA portal as part of its expansion strategy. The company plans to establish 1,000 jewellery retail franchise locations aimed at promoting entrepreneurship and creating employment opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1764935175145,
            "Source": "stock"
        },
        {
            "Title": "PC Jeweller Allots 17.56 Lakh Equity Shares on Warrant Conversion",
            "Summary": "PC Jeweller's Board allotted 17,56,260 equity shares of ₹1 face value each to Hawk Capital Pvt Ltd upon conversion of 1,75,626 fully convertible warrants at ₹56.20 per warrant. The allotment increased the company's paid-up equity share capital from ₹732.67 crores to ₹732.85 crores, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763205437013,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller Reports Q2 FY26 Results, Pays ₹23,600 in Exchange Fines for Compliance Delays",
            "Summary": "PC Jeweller's Board approved unaudited standalone and consolidated financial results for the quarter and six months ended September 30, 2025. The company acknowledged fines totaling ₹11,800 each from BSE and NSE for delayed submission of voting results related to a postal ballot notice dated July 10, 2025. The delay of one day in submitting voting results in XBRL format was unintentional, and the company has paid both fines within the prescribed timeframe. The exchange notices detailed multiple compliance violations including delays in board meeting intimation, reclassification application submission, and voting results submission for August 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762898987594,
            "Source": "earnings"
        },
        {
            "Title": "PC Jeweller Reports No Deviation in Use of ₹572 Crore Preferential Issue Proceeds",
            "Summary": "PC Jeweller Limited confirmed no deviation in the utilization of proceeds from its preferential issues for the quarter ended September 30, 2025. The company raised ₹572.30 crores through preferential issues of fully convertible warrants and equity shares across multiple tranches in July, August, and September 2025. The funds were allocated for repayment of outstanding bank debts (₹2,022.73 crores originally allocated), working capital requirements (₹529.10 crores), general corporate purposes (₹149.83 crores), and issue-related expenses. During the quarter, the company utilized ₹206.62 crores from earlier warrant conversions and ₹313.23 crores from the recent issues, with ₹56.57 crores remaining unutilized in monitoring accounts. The statement was reviewed by the Audit Committee and monitored by CARE Ratings Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762897229549,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller Reports 16.8% Jump in Q2 Net Profit to 2.09 Billion Rupees",
            "Summary": "PC Jeweller reported quarterly net profit of 2.09 billion rupees compared to 1.79 billion rupees in the same period last year. Revenue increased significantly to 8.25 billion rupees from 5.05 billion rupees year-over-year. However, EBITDA declined to 177.8 million rupees from 857.7 million rupees in the previous year. EBITDA margin improved to 21.55% from 16.99% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762864892860,
            "Source": "earnings"
        },
        {
            "Title": "PC Jeweller Regains Full Control of Inventory from Debt Recovery Appellate Tribunal",
            "Summary": "PC Jeweller Limited has regained possession of all its inventory from showrooms that were previously held by the Debt Recovery Appellate Tribunal (DRAT) following a joint settlement agreement with consortium lenders. The Debt Recovery Appellate Tribunal, Kolkata allowed the joint application filed by the company and consortium lenders through an order dated October 7, 2025. The handover of keys and inventory for showrooms located at South Extension and Kingsway Camp in Delhi was completed on October 10, 2025. The company now has possession of all its inventory with none remaining in custody of DRAT Delhi or any other authority.",
            "Sentiment": "positive",
            "PublishDate": 1760186553161,
            "Source": "stock"
        },
        {
            "Title": "PC Jeweller Complies with Settlement Agreement, to Hand Over Assets Following DRAT Order",
            "Summary": "PC Jeweller has complied with a joint settlement agreement with its consortium lenders. The company will hand over showroom keys and inventory following a DRAT (Debt Recovery Appellate Tribunal) order.",
            "Sentiment": "neutral",
            "PublishDate": 1759905629825,
            "Source": "stock"
        },
        {
            "Title": "PC Jeweller Reports 63% Revenue Growth, Reduces Debt by 23% in September Quarter",
            "Summary": "PC Jeweller reported revenue growth of approximately 63% year-on-year in the July-September quarter, driven by strong consumer demand during the festive season. The Delhi-based jewelry retailer, which operates 52 showrooms (49 company-owned), reduced its outstanding bank debt by 23% during the quarter. This follows a 9% debt reduction in the first quarter and over 50% reduction in the previous financial year. The company aims to become debt-free by the end of 2025-26, with net debt standing at Rs 1,780 crore at the end of 2024-25. To support debt clearance, PC Jeweller plans to raise Rs 500 crore in equity from promoters and Capital Ventures, plus Rs 1,300 crore from warrant conversions. The company expanded retail presence by opening a franchise showroom in Pitampura, Delhi. For the April-June quarter, total income jumped to Rs 807.88 crore from Rs 439.78 crore year-on-year, while consolidated net profit increased marginally by 4% to Rs 161.93 crore. The company's shares closed at Rs 12.66 with a market capitalization of Rs 8,324.43 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759411467328,
            "Source": "earnings"
        },
        {
            "Title": "Capri Global Holdings Reduces Stake in PC Jeweller to 4.623% from 6.663%",
            "Summary": "Capri Global Holdings Private Limited has reduced its shareholding in PC Jeweller Ltd from 6.663% to 4.623%. The company acquired 56,00,000 shares while selling 7,46,00,000 shares through open market transactions between May 29, 2025 and September 23, 2025. Following these transactions, Capri Global Holdings now holds 32,00,00,000 equity shares in PC Jeweller. The company is not part of PC Jeweller's promoter group. PC Jeweller's total equity share capital increased from 583,81,69,480 shares to 692,21,59,350 shares of Re.1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1758777527345,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller Shares Surge 6% as Company Targets Debt-Free Status",
            "Summary": "PC Jeweller shares climbed 6.1% to Rs 15.94 after Managing Director Balram Garg announced the company had reduced net debt by 19% over four months and aims to become debt-free by fiscal year-end. The company repaid Rs 335 crore in bank loans during April-July, bringing net debt down to Rs 1,445 crore from Rs 1,780 crore. PC Jeweller plans to raise Rs 1,800 crore through equity infusion - Rs 500 crore from promoters and Capital Ventures, plus Rs 1,300 crore from warrant conversions. The company reported quarterly results showing net profit rose 4% to Rs 161.93 crore while revenue surged to Rs 807.88 crore from Rs 439.78 crore year-on-year. PC Jeweller operates 52 showrooms across India, with 49 company-owned locations.",
            "Sentiment": "positive",
            "PublishDate": 1754285026227,
            "Source": "stock"
        },
        {
            "Title": "PC Jeweller Reports Rs 164 Crore PAT in Q1, Reduces Outstanding Debt to Rs 1,440 Crore",
            "Summary": "PC Jeweller Limited submitted supplementary information for its quarterly results ended June 30, 2025. The company reported a Profit After Tax of Rs 164 crores with sales of Rs 725 crores in Q1. This represents a significant increase from the previous year's Q1 operating PAT of Rs 49 crores (after excluding Rs 106 crores from income tax refund). The company's finance costs increased to Rs 41.6 crores in Q1 as the interest moratorium period ended in December 2024. PC Jeweller has reduced its outstanding bank debt to approximately Rs 1,440 crores after discharging Rs 2,005 crores in the previous financial year and an additional Rs 335 crores in Q1 and July 2025. The company previously raised Rs 2,702.11 crores through convertible warrants, receiving Rs 1,417 crores with Rs 1,285 crores pending upon conversion. The Board approved raising an additional Rs 500 crores through preferential allotment. PC Jeweller aims to become debt-free by the end of FY 2025-2026.",
            "Sentiment": "positive",
            "PublishDate": 1754218031024,
            "Source": "earnings"
        },
        {
            "Title": "PC Jeweller Issues Corrigendum to Postal Ballot Notice, Modifies Fund Utilization Details",
            "Summary": "PC Jeweller Limited issued a corrigendum to its Postal Ballot Notice dated July 10, 2025, modifying explanatory statements for special resolutions. The Board approved changes at its meeting on August 01, 2025, following instructions from National Stock Exchange regarding the company's application for In-Principle Approval for preferential issues of Fully Convertible Warrants and equity shares. Key modifications include updated details on utilization of gross proceeds totaling ₹500 crore, with ₹434.27 crore allocated for repayment of banker's outstanding debts by September 30, 2026, ₹65.33 crore for working capital by March 31, 2027, and ₹0.40 crore for issue expenses. The corrigendum also revised information about preferential allotments made during the year, including conversion of warrants to equity shares. E-voting for the postal ballot remains available until August 10, 2025. All other contents of the original Postal Ballot Notice remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1754138237580,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller Reports No Deviation in Use of Proceeds from Preferential Issue of Warrants",
            "Summary": "PC Jeweller Limited confirmed no deviation in the utilization of proceeds from its preferential issue of Fully Convertible Warrants for the quarter ended June 30, 2025. The company raised Rs. 92.77 crores during the quarter through warrant conversions - Rs. 79.77 crores on April 29, 2025, and Rs. 13.00 crores on May 29, 2025. The funds were allocated for repayment of outstanding debts (Rs. 2,022.73 crores), working capital requirements (Rs. 529.10 crores), general corporate purposes (Rs. 149.83 crores), and issue-related expenses (Rs. 0.45 crores). As of June 30, 2025, the company had utilized Rs. 598.49 crores for debt repayment, Rs. 529.01 crores for working capital, Rs. 139.90 crores for corporate purposes, with no funds used for issue expenses. The company allotted 22,00,92,400 equity shares during the quarter upon warrant conversion. The Audit Committee reviewed the statement, and CARE Ratings Limited serves as the monitoring agency.",
            "Sentiment": "neutral",
            "PublishDate": 1754057636754,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller Targets Complete Debt Elimination by Fiscal Year 2026",
            "Summary": "PC Jeweller has announced its expectation to eliminate all debt by the end of fiscal year 2026. The jewelry company has set this debt-free target as part of its financial restructuring goals.",
            "Sentiment": "positive",
            "PublishDate": 1754057135113,
            "Source": "stock"
        },
        {
            "Title": "PC Jeweller Reports Strong Q1 Performance with Revenue Rising 81% Year-on-Year",
            "Summary": "PC Jeweller delivered robust quarterly results with revenue increasing to 7.25 billion rupees from 4 billion rupees in the same period last year. The company's EBITDA more than doubled to 1.27 billion rupees compared to 516 million rupees year-on-year, while EBITDA margin expanded to 17.56% from 12.86%. Consolidated net profit grew marginally to 1.62 billion rupees from 1.56 billion rupees in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1754054430703,
            "Source": "earnings"
        },
        {
            "Title": "PC Jeweller Allots 34.68 Crore Equity Shares Through Warrant Conversion, Paid-Up Capital Reaches ₹692.22 Crore",
            "Summary": "PC Jeweller has allotted 34.68 crore equity shares following warrant conversion. This allotment has expanded the company's paid-up capital to ₹692.22 crore. The share allotment represents a capital restructuring exercise through the conversion of existing warrants into equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1753445229830,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller: Shares Drop 3.5%, Market Cap Falls Below Rs 11,000 Crore",
            "Summary": "PC Jeweller's stock price decreased by 3.5% to Rs 16.76, reducing its market capitalization to approximately Rs 10,968 crore. The company submitted regulatory certificates for dematerialization and rematerialization for Q2 2025. Despite the day's decline, the stock has rallied about 35% over the past month.",
            "Sentiment": "neutral",
            "PublishDate": 1752472849000,
            "Source": "normal_news"
        },
        {
            "Title": "PC Jeweller: Board Approves Rs 500 Crore Equity Raise for Debt Reduction",
            "Summary": "PC Jeweller's board has approved raising Rs 500 crore through preferential allotment to promoter Balram Garg and Capital Ventures Pvt Ltd. The funds will be used to prepay debt, aiming to become debt-free by March 2025. The company will issue convertible warrants to Garg for Rs 175 crore and shares to a non-promoter entity for Rs 325 crore, both at Rs 18 per share.",
            "Sentiment": "positive",
            "PublishDate": 1752154248000,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller Approves Plan to Raise Up to 5 Billion Rupees",
            "Summary": "PC Jeweller has approved a plan to raise funds up to 5 billion rupees. The news article does not provide any additional details about the method of fundraising or the intended use of the funds.",
            "Sentiment": "positive",
            "PublishDate": 1752151994000,
            "Source": "default"
        },
        {
            "Title": "PC Jeweller: Board Meeting to Consider Fundraising via Preferential Allotment",
            "Summary": "PC Jeweller's board will meet on July 10, 2025, to consider fundraising through preferential allotment of securities. The stock surged 4% ahead of the meeting, reaching Rs 19.15. The company's market cap stands at Rs 12,251 crore. The trading window for insiders is closed until Q1 results or meeting outcome announcement.",
            "Sentiment": "positive",
            "PublishDate": 1752130652000,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller: Stock Tumbles After Sharp Rally, Board to Consider Fund Raising",
            "Summary": "PC Jeweller shares fell 8% on July 8, ending a five-day surge. The company announced a board meeting on July 10 to consider raising funds through preferential share issue. Q1 FY2026 revenue grew 80% year-over-year. The company aims to be debt-free by year-end, having reduced bank debt by over 50% in the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1751953812000,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller: Stock Placed Under Surveillance After Sharp Rally",
            "Summary": "PC Jeweller shares fell 8.1% after BSE and NSE placed the stock under Additional Surveillance Measure (ASM) framework. This follows a recent rally driven by strong Q1FY26 performance, with revenue up 80% year-over-year. The company reported progress in debt reduction and aims to be debt-free by FY26 end.",
            "Sentiment": "neutral",
            "PublishDate": 1751948367000,
            "Source": "normal_news"
        },
        {
            "Title": "PC Jeweller: Board to Consider Preferential Allotment for Fundraising",
            "Summary": "PC Jeweller's board will meet on July 10 to consider fundraising via preferential allotment. The company reported 80% YoY revenue growth, reduced debt by over 50% in FY24-25, and aims to be debt-free by FY26 end. Operational improvements continue across the board.",
            "Sentiment": "positive",
            "PublishDate": 1751890698000,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller to Consider Fundraising Through Securities Issuance",
            "Summary": "PC Jeweller has announced plans to consider fundraising through the issuance of securities. The company's board meeting to discuss this matter is scheduled for July 10.",
            "Sentiment": "neutral",
            "PublishDate": 1751886926000,
            "Source": "default"
        },
        {
            "Title": "PC Jeweller: 1 Crore Shares Traded in Block Deals",
            "Summary": "PC Jeweller experienced significant trading activity with 1 crore shares being traded in multiple block deals at a price of 19 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1751863888000,
            "Source": "block_details"
        },
        {
            "Title": "PC Jewellers: Shares Surge 14% After Strong Q1 Performance",
            "Summary": "PC Jewellers' shares rose over 14% following a positive Q1 business update. The company reported 80% year-on-year revenue growth, reduced debt by over 50% in FY25, and aims to be debt-free by FY26 end. The stock has rallied 31% in five days and 269.76% in the last 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1751863809000,
            "Source": "result"
        },
        {
            "Title": "PC Jeweller: 80% Revenue Surge in Q1 Driven by Festive Demand",
            "Summary": "PC Jeweller reported an 80% year-on-year revenue growth in Q1, attributed to strong wedding and seasonal purchases. The company reduced its outstanding debt to bankers by over 50% in FY 2024-25 and by an additional 7.5% in the current quarter. PC Jeweller aims to be debt-free by the end of FY 2026 and expects to maintain growth momentum in upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1751554618000,
            "Source": "earnings"
        },
        {
            "Title": "PC Jeweller Reports 80% Revenue Growth and Debt Reduction in June Quarter",
            "Summary": "PC Jeweller has announced significant financial improvements in its latest quarterly results. The company reported an 80% year-over-year increase in revenue for the June quarter. Additionally, PC Jeweller has managed to reduce its outstanding debts by 7.50%. These figures indicate a strong performance for the company in the recent quarter, showing both top-line growth and improved financial health through debt reduction.",
            "Sentiment": "positive",
            "PublishDate": 1751549934000,
            "Source": "default"
        },
        {
            "Title": "PC Jeweller Approves Share Allotment to Banks for Debt Settlement",
            "Summary": "PC Jeweller's board has approved the allotment of 51.7 crore shares to 14 banks as part of a debt settlement agreement. This move is aimed at settling a debt of 1,510 crore rupees owed by the company.",
            "Sentiment": "neutral",
            "PublishDate": 1742269006000,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller Ltd: Board Approves Share Allotment to Banks for Debt Settlement",
            "Summary": "PC Jeweller's board has approved the allotment of 51.71 crore shares to a consortium of 14 banks at Rs 29.20 per share, settling Rs 1,510 crore of debt. This is part of a one-time settlement agreement dated September 30, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1742229393000,
            "Source": "corporate_action"
        },
        {
            "Title": "PC Jeweller Ltd: Mauritius-Based FII Acquires 5.757% Stake Through Warrants",
            "Summary": "UNICO GLOBAL OPPORTUNITIES FUND LIMITED has acquired 5,45,00,000 warrants of PC Jeweller Ltd, representing 5.757% of the company's equity share capital. The acquisition was made by the Mauritius-based FII at a price under ₹20 per share. Following this news, PC Jeweller's stock price jumped over 5% in morning trades.",
            "Sentiment": "positive",
            "PublishDate": 1741850169000,
            "Source": "corporate_action"
        }
    ]
}