{
    "Symbol": "PDMJEPAPER",
    "ISIN": "INE865T01018",
    "News": [
        {
            "Title": "Pudumjee Paper Products Announces Postal Ballot",
            "Summary": "Pudumjee Paper Products seeks shareholder approval for director remuneration and re-appointment through postal ballot. E-voting period runs from February 3 to March 4, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770029969121,
            "Source": "stocks"
        },
        {
            "Title": "Pudumjee Paper Products Authorizes Key Personnel",
            "Summary": "Pudumjee Paper Products Ltd has authorized three Key Managerial Personnel to determine materiality of events and make necessary disclosures to stock exchanges under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769850814098,
            "Source": "stocks"
        },
        {
            "Title": "Pudumjee Paper Products Announces Q3FY26 Results",
            "Summary": "Pudumjee Paper Products Ltd announced Q3FY26 quarterly results for quarter ended December 31, 2025. The company also re-appointed Dr. Ashok Kumar as Executive Director for 5 years starting May 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769849968281,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pudumjee Paper Products Board Meet on Jan 31, 2026",
            "Summary": "Pudumjee Paper Products Ltd has scheduled a board meeting on January 31, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768562146665,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pudumjee Gets Solar Power Open Access Permission",
            "Summary": "Pudumjee Paper Products receives medium-term open access permission for its 15.4 MWac solar power plant in Solapur, Maharashtra, enabling captive power consumption from December 2025 to November 2030.",
            "Sentiment": "positive",
            "PublishDate": 1768389152349,
            "Source": "stocks"
        },
        {
            "Title": "Pudumjee Paper Products Receives GST Order Disallowing Rs 15.98 Lakh Input Tax Credit",
            "Summary": "Pudumjee Paper Products Limited received an order from Maharashtra GST Department disallowing Input Tax Credit of Rs 15,98,154 claimed on differential IGST paid against imports for Financial Year 2021-2022, along with interest and penalty. The company states there is no material impact on its financials or operations and plans to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1764409392881,
            "Source": "stock"
        },
        {
            "Title": "Pudumjee Paper Products Commissions 15.4 MW Solar Power Plant in Maharashtra",
            "Summary": "Pudumjee Paper Products Limited has commissioned a 15.4 MW AC solar power plant located in District Solapur, Maharashtra on November 26, 2025. The renewable power generated will be utilized for the company's captive consumption at its Pune plant, subject to receipt of open access permission.",
            "Sentiment": "positive",
            "PublishDate": 1764231719762,
            "Source": "stock"
        },
        {
            "Title": "Pudumjee Paper Products Director Mrs. Madhu Dubhashi Retires After Completing Tenure",
            "Summary": "Pudumjee Paper Products Limited announced the retirement of Mrs. Madhu Dubhashi (DIN: 00036846), Non-Executive Independent Director, effective from the close of business hours on November 13, 2025. Her retirement follows the completion of her tenure as per the Companies Act, 2013 provisions. Mrs. Dubhashi was re-appointed for a second term at the Annual General Meeting held on August 21, 2021, for a period from September 17, 2021 to November 13, 2025. Upon retirement, she will cease to be a member of any Board committees she currently serves on.",
            "Sentiment": "neutral",
            "PublishDate": 1763029208917,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pudumjee Paper Products Appoints Shailaja Nair as Independent Director, Reports Quarterly Results",
            "Summary": "Pudumjee Paper Products Limited appointed Mrs. Shailaja Nair as Additional Director in the capacity of Non-Executive Independent Director for a period of 5 years effective November 14, 2025, subject to shareholder approval by postal ballot. Nair holds an MBA in Finance and has over 30 years of experience in financial services, ESG strategy and regulatory compliance. The company also announced its unaudited financial results for the quarter and half year ended September 30, 2025. Revenue from operations stood at Rs 20,713 lakhs for the quarter compared to Rs 19,645 lakhs in the previous quarter. Profit for the period was Rs 2,192 lakhs for the quarter. The company operates in two business segments: Paper and Hygiene Products.",
            "Sentiment": "neutral",
            "PublishDate": 1762793296525,
            "Source": "corporate_action"
        },
        {
            "Title": "Pudumjee Paper Reports Decline in Q2 Financial Performance",
            "Summary": "Pudumjee Paper reported Q2 revenue of 2.07 billion rupees, down from 2.2 billion rupees in the same period last year. The company's EBITDA fell to 273 million rupees compared to 440 million rupees year-over-year, with EBITDA margin declining to 13.2% from 19.8%. Net profit also decreased to 169 million rupees from 298 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762762912444,
            "Source": "earnings"
        },
        {
            "Title": "Pudumjee Paper Products' Two Independent Directors Retire After Completing Second Term",
            "Summary": "Pudumjee Paper Products Limited announced the retirement of two Non-Executive Independent Directors, Mr. Vinod Kumar Beswal and Mr. Nandan Damani, effective October 20, 2025, upon completion of their tenure. Both directors were re-appointed for a second term at the Annual General Meeting held on August 21, 2021, for a period from September 17, 2021 to October 20, 2025. Following their retirement, they will cease to be members or chairmen of any board committees they currently serve on.",
            "Sentiment": "neutral",
            "PublishDate": 1760944837753,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pudumjee Paper Reports 31% Jump in Q1 Net Profit to Rs 362 Million",
            "Summary": "Pudumjee Paper reported a net profit of Rs 362 million for Q1, representing a significant increase from Rs 276 million in the same period last year. The company's EBITDA rose to Rs 523 million compared to Rs 410 million year-on-year. EBITDA margin improved to 26.60% from 20.22% in the corresponding quarter of the previous year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754032657628,
            "Source": "earnings"
        },
        {
            "Title": "India Adjusts Anti-Dumping Duties on Chinese Decor Paper",
            "Summary": "The Indian government has modified anti-dumping duties on decor paper imported from China. The changes involve reducing rates for some Chinese producers while increasing them for others. This action is aimed at supporting the local paper industry in India.",
            "Sentiment": "neutral",
            "PublishDate": 1750821469000,
            "Source": "default"
        },
        {
            "Title": "Pudumjee Paper Reports Q4 Financial Results",
            "Summary": "Pudumjee Paper has released its Q4 financial results. The company's EBITDA decreased to 290 million rupees from 539 million rupees year-over-year. The EBITDA margin fell to 15.25% from 26.26% in the same period last year. Revenue slightly decreased to 1.9 billion rupees from 2 billion rupees year-over-year. The company's net profit declined to 188 million rupees from 374 million rupees compared to the previous year's Q4.",
            "Sentiment": "negative",
            "PublishDate": 1748248265000,
            "Source": "result"
        },
        {
            "Title": "Pudumjee Paper Products to Acquire Lloyds Enterprise Shares",
            "Summary": "Pudumjee Paper Products has announced plans to acquire equity shares of Lloyds Enterprise from the open market. The acquisition cost is not expected to exceed 300 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745321253000,
            "Source": "default"
        },
        {
            "Title": "Pudumjee Paper Products Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Pudumjee Paper Products has reported a decrease in its Q3 EBITDA, which fell to 310 million rupees from 473 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 15.99% from 21.51% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738325000000,
            "Source": "earnings"
        },
        {
            "Title": "Pudumjee Paper Products Reports Q3 Financial Results",
            "Summary": "Pudumjee Paper Products has announced its financial results for the third quarter. The company reported a net profit of 196 million rupees, which is lower compared to both the previous year (319 million rupees) and the previous quarter (298 million rupees). Revenue for Q3 stood at 1.9 billion rupees, slightly down from 2 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738324906000,
            "Source": "earnings"
        },
        {
            "Title": "Pudumjee Paper Reports Strong Q2 Financial Performance",
            "Summary": "Pudumjee Paper has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA increased to 377 million rupees from 256 million rupees year-over-year. Additionally, the EBITDA margin expanded to 16.96% from 13.11% in the same period last year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730118997000,
            "Source": "result"
        },
        {
            "Title": "Pudumjee Paper Reports Q2 Revenue Growth",
            "Summary": "Pudumjee Paper has announced its Q2 revenue figures. The company reported revenue of 2.2 billion rupees, compared to 1.94 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730118986000,
            "Source": "result"
        },
        {
            "Title": "Pudumjee Paper Reports Significant Profit Growth in Q2",
            "Summary": "Pudumjee Paper has reported a net profit of 298 million rupees for the second quarter, showing a substantial increase from 176 million rupees in the same quarter last year (YoY). The profit also improved from 276 million rupees in the previous quarter (QoQ).",
            "Sentiment": "positive",
            "PublishDate": 1730118977000,
            "Source": "result"
        }
    ]
}