{
    "Symbol": "PDSL",
    "ISIN": "INE111Q01021",
    "News": [
        {
            "Title": "PDS Limited Q3 FY26 Results Show Mixed Performance",
            "Summary": "PDS Limited reported 6% revenue growth to ₹9,591 crores in 9M FY26, but PAT declined 35% to ₹106 crores. GMV grew 7% to ₹14,760 crores with improved gross margins and reduced working capital days.",
            "Sentiment": "neutral",
            "PublishDate": 1770737017815,
            "Source": "co_actions_results"
        },
        {
            "Title": "PDS Limited Q3FY26 Monitoring Agency Report Filed",
            "Summary": "PDS Limited submitted its Q3FY26 monitoring agency report for QIP proceeds utilization. CRISIL confirmed no deviation from stated objectives with Rs 10,799.83 lakhs remaining unutilized from the Rs 41,055.96 lakhs net proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1770736965015,
            "Source": "co_actions_results"
        },
        {
            "Title": "PDS Limited Allots 63,750 Shares Under ESOP Plan A",
            "Summary": "PDS Limited allotted 63,750 equity shares to employees under its Employee Stock Option Plan 2021 - Plan A on February 10, 2026, increasing paid-up capital to ₹28,28,84,266.",
            "Sentiment": "positive",
            "PublishDate": 1770732624871,
            "Source": "co_actions_results"
        },
        {
            "Title": "PDS Limited Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "PDS Limited has scheduled a board meeting on February 10, 2026, to approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770048936502,
            "Source": "co_actions_results"
        },
        {
            "Title": "PDS Acquires 15% Stake in Four Subsidiaries for $308K",
            "Summary": "PDS Limited announces acquisition of 15% stake in four subsidiaries from Rakesh Chadha for USD 308,174 as part of ownership structure streamlining initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1769511765240,
            "Source": "co_actions_results"
        },
        {
            "Title": "PDS Limited Step-Down Subsidiary Struck Off",
            "Summary": "PDS Limited announces strike-off of step-down subsidiary Kontemporary Koncepts Private Limited effective January 20, 2026, as part of corporate restructuring initiative with no material financial impact.",
            "Sentiment": "neutral",
            "PublishDate": 1769509907924,
            "Source": "stocks"
        },
        {
            "Title": "PDS Limited Acquires Full Ownership of Jcraft Array",
            "Summary": "PDS Limited's subsidiary Norwest Industries acquired the remaining 15% stake in Jcraft Array Limited for USD 7,500, making it a 100% owned step-down subsidiary effective January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768471998466,
            "Source": "co_actions_results"
        },
        {
            "Title": "PDS Limited Dissolves Step-Down Subsidiary",
            "Summary": "PDS Limited announces dissolution of S. Oliver Fashion India Private Limited effective January 8, 2026, as part of corporate restructuring to eliminate non-operational entities.",
            "Sentiment": "neutral",
            "PublishDate": 1767959349464,
            "Source": "co_actions_results"
        },
        {
            "Title": "PDS Limited Divests 20% Stake in Mambo Leisure",
            "Summary": "PDS Limited has completed the divestment of its entire 20% stake in Mambo Leisure Masters as part of corporate restructuring initiatives to streamline operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767753366851,
            "Source": "co_actions_results"
        },
        {
            "Title": "PDS Appoints Abhishek Nawani as CEO-Manufacturing",
            "Summary": "PDS Limited strengthens manufacturing leadership by appointing Abhishek Nawani as CEO-Manufacturing to drive growth and operational excellence across its global manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1766209389675,
            "Source": "stocks"
        },
        {
            "Title": "PDS Limited Gets SBTi Validation for Net-Zero Targets",
            "Summary": "PDS Limited receives Science Based Targets initiative validation for its climate commitments, targeting 42% reduction in Scope 1&2 emissions and 25% in Scope 3 emissions by FY2030, with net-zero by FY2050.",
            "Sentiment": "positive",
            "PublishDate": 1766034967619,
            "Source": "stocks"
        },
        {
            "Title": "PDS Limited Allots 13,750 Equity Shares Under ESOP and Grants 7,10,000 Stock Options to Employees",
            "Summary": "PDS Limited's Nomination and Remuneration Committee approved the allotment of 13,750 equity shares of Rs. 2 each to employees under Employee Stock Option Plan 2021-Plan A, increasing the company's paid-up capital to Rs. 28,27,56,766. The committee also granted 7,10,000 stock options across two schemes - 5,32,665 under Phantom Stock Units Plan 2021 and 1,77,335 under Employee Stock Option Plan 2021-Plan B, with a vesting period of one year from grant date.",
            "Sentiment": "positive",
            "PublishDate": 1765259124476,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Limited Reduces Stake in Hong Kong Subsidiary to 85% After Strategic Share Transfer",
            "Summary": "PDS Limited transferred 15% equity stake in its Hong Kong subsidiary Onme Soho Health and Beauty Limited to Business Head Melanie Wilson for HKD 300,000, reducing its shareholding to 85%. The transaction, effective from October 9, 2025, was undertaken for strategic and economic objectives, causing the subsidiary to cease being a wholly owned entity.",
            "Sentiment": "neutral",
            "PublishDate": 1764853764728,
            "Source": "corporate_action"
        },
        {
            "Title": "Shrey Shah Group Increases Stake in PDS Limited to 5.22% Through Open Market Purchases",
            "Summary": "Shrey Shah and his Persons Acting in Concert acquired 808,058 equity shares of PDS Limited through open market transactions from August 1, 2024 to November 13, 2025, increasing their collective holding from 4.97% to 5.22%. The acquisition triggers disclosure requirements under SEBI regulations as the group's shareholding crossed the 5% threshold in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763464368523,
            "Source": "stock"
        },
        {
            "Title": "PDS Limited Reports 8% Revenue Growth in H1 FY26 with Strong Order Book Expansion",
            "Summary": "PDS Limited reported quarterly results showing gross merchandise value of Rs 5,461 crores in Q2 and crossing Rs 10,000 crores for H1, representing 8% year-over-year growth. The company's order book as of early October stands at Rs 25,300 crores, marking a 15% year-over-year increase. Revenue for Q2 FY26 was Rs 3,419 crores, growing 14% compared to Q1, while H1 FY26 revenue reached Rs 6,419 crores with 8% growth. Net working capital days improved significantly from 17 days in March 2025 to 6 days in September 2025. The company generated Rs 593 crores of cash flow from operations in the first half compared to cash outflow in the previous year. EBITDA margin expanded to 3% in Q2 versus 1.7% in Q1. Management declared an interim dividend of Rs 1.65 per share. The company is implementing cost optimization measures and has established financial guardrails for new investments. PDS expects to reduce losses in new verticals by 25% and anticipates structural cost initiatives to deliver benefits in Q3 and Q4.",
            "Sentiment": "positive",
            "PublishDate": 1762176072427,
            "Source": "earnings"
        },
        {
            "Title": "PDS Establishes UK Subsidiary for Marketing and Trading Operations",
            "Summary": "PDS has launched a new fully owned subsidiary called Simple Approach-UK Limited in the United Kingdom. The subsidiary will focus on marketing, design, trading, and sourcing activities.",
            "Sentiment": "positive",
            "PublishDate": 1761909684185,
            "Source": "stock"
        },
        {
            "Title": "PDS Sets Ambitious FY27 Targets: ₹20,000 Crore GMV and ₹500 Crore PAT",
            "Summary": "PDS has announced strategic targets for FY27, aiming to achieve ₹20,000 crore in Gross Merchandise Value (GMV) and ₹500 crore in Profit After Tax (PAT). The company plans to expand its order book beyond ₹6,000 crore while reducing working capital days to below 5. These goals will be supported by a BCG-led transformation initiative focused on margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1761580621405,
            "Source": "stock"
        },
        {
            "Title": "PDS Reports 55% Drop in Quarterly Net Profit, Declares Interim Dividend",
            "Summary": "PDS announced an interim dividend of 1.65 rupees per share. The company's quarterly consolidated net profit declined to 300 million rupees from 675 million rupees year-over-year. Revenue increased to 34.19 billion rupees from 33 billion rupees compared to the same period last year. EBITDA fell to 1.03 billion rupees from 1.44 billion rupees year-over-year, with EBITDA margin compressing to 3.01% from 4.35%.",
            "Sentiment": "negative",
            "PublishDate": 1761577249722,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Limited Allots 15,000 Shares Under Employee Stock Option Plan",
            "Summary": "PDS Limited's Nomination and Remuneration Committee approved the allotment of 15,000 equity shares of ₹2 each on October 27, 2025, to employees and subsidiary staff who exercised stock options under the Employee Stock Option Plan 2021 - Plan A. The exercise price was ₹219 per share with a premium of ₹217 per share. Following this allotment, the company's paid-up capital increased from ₹28,26,99,266 to ₹28,27,29,266, with total issued shares rising to 14,13,64,633. The new shares will rank equally with existing equity shares. PDS Limited is listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761572182306,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Limited's US Subsidiary Incorporates New Design-Led Sourcing Entity in Delaware",
            "Summary": "PDS Far East USA Inc, a step-down wholly owned subsidiary of PDS Limited, has incorporated Design COE USA Inc in Delaware, USA, effective October 17, 2025. The new entity operates in the fashion and apparel industry as a design-led sourcing organization dedicated to supplying the US market. Design COE offers a diversified product range including woven, knits, sweater, denim, activewear, and career apparels. The incorporation involved a cash consideration of approximately INR 8,795.09 (USD 100), with PDS Limited maintaining 100% shareholding through its subsidiary structure.",
            "Sentiment": "positive",
            "PublishDate": 1760776687308,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Limited Revises Record Date to October 31, 2025 for Interim Dividend Eligibility",
            "Summary": "PDS Limited has revised the record date to October 31, 2025, for determining shareholder eligibility for the interim dividend for FY 2025-26. The dividend declaration is subject to approval by the Board of Directors at their meeting scheduled for October 27, 2025. This revision was communicated to stock exchanges NSE and BSE on October 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760776316097,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Limited Divests Entire Stake in Bangladesh Subsidiary Grupo Sourcing Limited",
            "Summary": "PDS Limited has sold its complete stake in Grupo Sourcing Limited, a step-down subsidiary in Bangladesh, to the company's business head Mr. Zamal Uddin Ahmed and his family. The divestment is part of PDS Group's strategic initiative to improve profitability and address loss-making verticals. The sale agreement was signed on May 27, 2025, with regulatory approval received on August 12, 2025. PDS received consideration of ₹21.26 million from the transaction. Grupo Sourcing Limited contributed ₹3,565.41 lakhs in turnover (0.28% of consolidated turnover) but reported losses with profit after tax of ₹(54.55) lakhs during the last financial year. Following this transaction, Grupo Sourcing Limited has ceased to be a step-down subsidiary of PDS Limited. The buyers are not members of PDS's promoter group, and the transaction was conducted on an arm's length basis.",
            "Sentiment": "positive",
            "PublishDate": 1755018302673,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Limited Reports 14% Revenue Growth to ₹2,999 Crores in Q1 FY26 Despite Margin Pressures",
            "Summary": "PDS Limited reported revenue of ₹2,999 crores for Q1 FY26, marking 14% year-over-year growth, with gross merchandise value reaching ₹4,634 crores (19% increase). However, gross margins declined 139 basis points to 19.4% due to market disruptions including customer bankruptcies and administration issues affecting Gerry Weber and Matalan. The company's order book stands at ₹5,200 crores with 8% growth. EBITDA margin fell to 1.7% and PAT margin to 0.7%. Key customer growth included Primark (23%), Next (46%), and Tesco (20%). The effective tax rate increased to 25% from 13% due to global minimum tax implementation. Net working capital days improved to 10 days from 17 days, and net debt reduced by ₹156 crores. The company is implementing cost optimization initiatives with Boston Consulting Group targeting ₹25 crores in opex savings and ₹30 crores in COGS savings for H2. Management expects margin pressures to continue in H1 but anticipates recovery in H2 through various efficiency measures and new customer acquisitions.",
            "Sentiment": "neutral",
            "PublishDate": 1754490596457,
            "Source": "earnings"
        },
        {
            "Title": "PDS Targets Profit Recovery with ₹60 Crore Cost Savings Plan by FY26",
            "Summary": "PDS is implementing a comprehensive recovery strategy to achieve solid profit and cash flow recovery amid economic challenges. The company plans to generate ₹60 crore in annual savings through a BCG-driven cost cutting initiative. As part of its restructuring efforts, PDS has reduced new investments by half and aims to achieve profitability across all business areas by the end of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753978705172,
            "Source": "stock"
        },
        {
            "Title": "PDS Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "PDS reported quarterly revenue of 29.9 billion rupees, up from 26 billion rupees year-over-year. However, the company's profitability declined with EBITDA falling to 505 million rupees from 733 million rupees, while EBITDA margin compressed to 1.68% from 2.80%. Consolidated net profit also decreased to 130 million rupees compared to 199 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1753972989485,
            "Source": "earnings"
        },
        {
            "Title": "PDS Limited Incorporates New US Subsidiary Design Arc LLC for Fashion and Apparel Business",
            "Summary": "PDS Limited announced the incorporation of Design Arc LLC in Delaware, USA, effective July 29, 2025. The new entity was established as a wholly owned subsidiary of PDS Far East USA Inc, making it a step-down wholly owned subsidiary of PDS Limited. Design Arc operates in the fashion and apparel industry, offering private label and white-label services across casualwear, formalwear, activewear, loungewear, kidswear, and fashion accessories. The incorporation involved cash consideration of approximately INR 87.22 (USD 1), with PDS Limited maintaining 100% control through its subsidiary structure.",
            "Sentiment": "positive",
            "PublishDate": 1753954825609,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Limited Schedules Q1 FY26 Earnings Conference Call for August 1, 2025",
            "Summary": "PDS Limited has scheduled a conference call on August 1, 2025, at 4:00 PM IST to discuss the company's Q1 FY26 financial results. The call will feature senior management including Executive Vice Chairman Pallak Seth, Group CEO Sanjay Jain, Group CFO Rahul Ahuja, and Deputy Group CFO Reenah Joseph. The company has provided multiple dial-in numbers including universal access numbers and international toll-free options for USA, UK, Singapore, and Hong Kong. Participants are requested to dial-in 10 minutes before the scheduled time. The company noted that the earnings conference call schedule may undergo changes, which would be communicated to stock exchanges accordingly.",
            "Sentiment": "neutral",
            "PublishDate": 1753279831990,
            "Source": "earnings"
        },
        {
            "Title": "PDS Plans to Acquire Majority Stake in GSC Link Limited",
            "Summary": "PDS has announced plans to acquire a 60% ownership stake in GSC Link Limited. This move represents a significant corporate action, potentially expanding PDS's business operations or market presence.",
            "Sentiment": "positive",
            "PublishDate": 1752151788000,
            "Source": "default"
        },
        {
            "Title": "PDS Subsidiary to Acquire 60% Stake in Hong Kong Apparel Firm",
            "Summary": "PDS has announced that its subsidiary, PDS Sourcing Limited (Mauritius), will acquire a 60% stake in GSC Link Limited, a Hong Kong-based apparel company. The acquisition is valued at USD 1.2 million and is scheduled to take place on July 1.",
            "Sentiment": "positive",
            "PublishDate": 1751369331000,
            "Source": "default"
        },
        {
            "Title": "PDS Subsidiary Expands Operations and Acquires Stake in Knit Gallery India",
            "Summary": "PDS's subsidiary, Nexstyle Apparel Manufacturing Ltd, has established a new entity in Mauritius under the same name. Additionally, the company has acquired a 55% equity stake in Knit Gallery India Pvt Ltd through this subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1747146758000,
            "Source": "default"
        },
        {
            "Title": "PDS to Consider Q4 Results on May 15",
            "Summary": "PDS (company name not fully specified) has announced that it will consider its fourth quarter (Q4) financial results on May 15.",
            "Sentiment": "neutral",
            "PublishDate": 1746704445000,
            "Source": "default"
        },
        {
            "Title": "PDS Enters Agreement for Divestment of Digital Ecom Techno Stake",
            "Summary": "PDS has entered into an agreement with AAPT Outsourcing Solutions for the divestment of its entire stake in Digital Ecom Techno. The deal is valued at 22.6 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1744205379000,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Ltd.: CEO Outlines Strategy for $3.5 Billion Revenue Target by FY29",
            "Summary": "PDS Ltd.'s Group CEO Sanjay Jain reaffirms the company's '5-5-5' strategy, aiming for $5 billion GMV and $3.5 billion turnover by FY29, up from current $1.5-$1.8 billion.",
            "Sentiment": "positive",
            "PublishDate": 1743852984000,
            "Source": "normal_news"
        },
        {
            "Title": "PDS to Invest 442.5 Million Rupees in Nexstyle Apparel Manufacturing",
            "Summary": "PDS Limited has announced plans to invest 442.5 million rupees in Nexstyle Apparel Manufacturing. This investment suggests a significant expansion or development in the company's apparel manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1743078339000,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS to Acquire Majority Stake in Knit Gallery India",
            "Summary": "PDS Limited has announced plans to acquire a 55% stake in Knit Gallery India for 413.4 million rupees. This acquisition represents a significant corporate action that will likely expand PDS's presence in the Indian textile market.",
            "Sentiment": "positive",
            "PublishDate": 1738077414000,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Limited Reports Improved Q3 EBITDA and Margin",
            "Summary": "PDS Limited has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 746 million rupees to 956 million rupees. Additionally, the EBITDA margin rose from 2.90% to 3.06% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738076124000,
            "Source": "earnings"
        },
        {
            "Title": "PDS Limited Reports Significant Profit Growth in Q3",
            "Summary": "PDS Limited has announced its financial results for the third quarter. The company's consolidated net profit increased to 249 million rupees, up from 146 million rupees year-over-year. However, it decreased from 718 million rupees quarter-over-quarter. Revenue for Q3 rose to 31.2 billion rupees, compared to 25.8 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738076054000,
            "Source": "earnings"
        },
        {
            "Title": "PDS Disposes of JJ Star Industrial in Hong Kong",
            "Summary": "PDS has announced the disposal of JJ Star Industrial, a company incorporated under the laws of Hong Kong. This action represents a divestment of PDS's interests in the Hong Kong-based entity.",
            "Sentiment": "neutral",
            "PublishDate": 1733399573000,
            "Source": "corporate_action"
        },
        {
            "Title": "PDS Ltd Reports Strong Q2 Financial Results",
            "Summary": "PDS Ltd announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 718 million rupees from 650.4 million rupees in the same quarter last year. Revenue also saw substantial growth, rising to 33.06 billion rupees from 24.63 billion rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1730251585000,
            "Source": "result"
        }
    ]
}