{
    "Symbol": "PEARLPOLY",
    "ISIN": "INE844A01013",
    "News": [
        {
            "Title": "Pearl Polymers Q3FY26 Results: Loss Narrows to ₹164.26L",
            "Summary": "Pearl Polymers reported Q3FY26 net loss of ₹164.26 lakhs vs ₹221.69 lakhs in Q3FY25, with revenue declining 14.49% YoY to ₹469.56 lakhs. Nine-month performance shows marginal improvement.",
            "Sentiment": "negative",
            "PublishDate": 1770893334456,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pearl Polymers Reports Q2 Results with Mixed Performance",
            "Summary": "Pearl Polymers Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025, following a board meeting held on November 13, 2025. The company, which trades bottles, jars and containers under the Pearl Pet brand, showed a net profit of Rs 95.65 lakhs for the half year compared to a loss of Rs 527.13 lakhs in the previous year, while facing negative cash flow from operations of Rs 347.99 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1763047385358,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Polymers Appoints Ms. Prachi Tyagi as Company Secretary & Compliance Officer",
            "Summary": "Pearl Polymers Limited appointed Ms. Prachi Tyagi as Company Secretary & Compliance Officer, designated as Key Managerial Personnel, effective September 12, 2025. The appointment was made on the recommendation of the Nomination and Remuneration Committee and approved by the Board of Directors. Ms. Tyagi is a Member of the Institute of Company Secretaries of India with ICSI Membership No. 78163, has over 2 years of experience in managing compliances, and has been associated with the company for the past 1.5 years.",
            "Sentiment": "positive",
            "PublishDate": 1757661839045,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pearl Polymers Limited Company Secretary Aman Thakran Resigns",
            "Summary": "Aman Thakran has resigned from his position as Company Secretary and Compliance Officer of Pearl Polymers Limited, effective September 8, 2025. Thakran cited pursuing better career opportunities outside the company as the reason for his departure. He confirmed there is no material reason for his resignation. The company has informed stock exchanges NSE and BSE about the resignation of this Key Managerial Personnel position.",
            "Sentiment": "neutral",
            "PublishDate": 1757336696858,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pearl Polymers Reports Strong Q1 FY2026 Results with 289% Profit Jump, Schedules AGM for September",
            "Summary": "Pearl Polymers Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported a net profit of Rs. 289.44 lakhs compared to Rs. 129.24 lakhs in the same quarter last year. Total revenue increased to Rs. 937.58 lakhs from Rs. 471.98 lakhs year-on-year. Revenue from operations was Rs. 491.78 lakhs while other income contributed Rs. 445.80 lakhs. Basic and diluted earnings per share stood at Rs. 1.72 compared to Rs. 0.77 in the previous year quarter. The company has scheduled its Annual General Meeting for September 22, 2025, at 12:30 p.m. through video conferencing. The register of members will be closed from September 16-22, 2025. Pearl Polymers also appointed M/s Abhishek Gupta & Associates as Secretarial Auditors for a five-year term starting FY 2025-26, subject to shareholder approval. The company operates in the business of trading bottles, jars and containers under the 'Pearl Pet' brand.",
            "Sentiment": "positive",
            "PublishDate": 1755005077209,
            "Source": "earnings"
        }
    ]
}