{
    "Symbol": "PENIND",
    "ISIN": "INE932A01024",
    "News": [
        {
            "Title": "Pennar Industries Q3FY26 Earnings Call on Feb 16",
            "Summary": "Pennar Industries has scheduled its Q3FY26 earnings conference call for February 16, 2026, at 11:30 AM IST, with senior management participation including Vice Chairman & MD Aditya Rao.",
            "Sentiment": "neutral",
            "PublishDate": 1770456109124,
            "Source": "stocks"
        },
        {
            "Title": "Pennar Industries Q2FY26 Revenue Grows 22% to Rs 919.6 Crores Despite Labor Challenges",
            "Summary": "Pennar Industries reported strong quarterly results with revenue rising 22.04% to Rs 919.6 crores and PAT growing 20.13% to Rs 32.28 crores. The company's Custom Designed Building Solutions (PEB) division delivered 31.9% revenue growth despite earlier labor supply constraints that temporarily impacted margins. US subsidiary Ascent showed strong double-digit growth with order backlog expanding to $51 million. The company completed the Telco acquisition for $14 million enterprise value, expected to contribute over Rs 100 crores annually. Body-in-white division secured new orders from Hyundai, TIVOLT, Ashok Leyland and Stellantis. PAT margins stood at 3.56%, slightly lower due to one-time acquisition costs and labor issues. Working capital days increased to 76 days. Management expressed confidence in margin expansion from Q3 onwards, targeting a floor of 20% PAT growth going forward. The company's equity and reserves crossed Rs 1,000 crores mark. Total order book across all segments reached Rs 956 crores to be executed over next 4-6 months.",
            "Sentiment": "positive",
            "PublishDate": 1763021213251,
            "Source": "earnings"
        },
        {
            "Title": "Pennar Industries Reports 22% Revenue Growth in Q2FY26 with Strong Order Book",
            "Summary": "Pennar Industries reported total sales of Rs 919.60 crores for Q2FY26, marking a 22.04% year-over-year growth. EBITDA increased 16.32% to Rs 94.43 crores with a margin of 10.42%. PAT grew 20.13% to Rs 32.28 crores. For H1FY26, total sales reached Rs 1,773.60 crores, up 18.68% year-over-year. The company operates through two main verticals: Diversified Engineering (Rs 468.26 crores revenue in Q2FY26) and Custom Designed Building Solutions (Rs 465.72 crores). The company maintains a strong order book with PEB India at Rs 860 crores and PEB U.S. at $51.2 million as of September 30, 2025. Pennar operates 14 manufacturing facilities in India and overseas facilities in Portland, USA, serving over 1,000 customers across automotive, railways, infrastructure, and industrial sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762754958866,
            "Source": "stock"
        },
        {
            "Title": "Pennar Industries Reports 22% Revenue Growth in Q2FY26, Announces Investment in German Subsidiary",
            "Summary": "Pennar Industries Limited reported consolidated total sales of INR 919.60 crore for Q2FY26, representing a 22.04% increase from INR 753.53 crore in Q2FY25. The company's profit after tax grew 20.13% to INR 32.28 crore compared to INR 26.87 crore in the previous year quarter. EBITDA increased 16.32% to INR 94.43 crore from INR 81.18 crore. For the half-year period, total sales reached INR 1,773.60 crore, up 18.68% from INR 1,494.42 crore in the previous year. The Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025, and authorized an investment in Pennar GmbH, Germany, a wholly owned subsidiary. The company received orders worth INR 956 crores across various business verticals in the past three months, expected to be executed in the next two quarters.",
            "Sentiment": "positive",
            "PublishDate": 1762613131993,
            "Source": "earnings"
        },
        {
            "Title": "Pennar Industries Reports 15.3% Revenue Growth Despite Labor Constraints in Q1 FY26",
            "Summary": "Pennar Industries Limited reported revenue of ₹845.67 crores, up 15.3% year-on-year, with EBITDA rising 19.12% to ₹94.12 crores and PAT increasing 21.06% to ₹31.96 crores. The diversified engineering company faced labor supply constraints that resulted in ₹100 crores revenue loss during the quarter. The Pre-Engineered Buildings segment achieved double-digit growth with order backlog of ₹855 crores for India operations and $54 million for US operations. Body-in-White secured new clients including Hyundai and Ashok Leyland. The company's Raebareli plant is operating at 65% utilization. Management expects strong Q2 performance across business units and projects high double-digit growth for prioritized segments, while working to reduce working capital days from 76 to a target of 60 days.",
            "Sentiment": "positive",
            "PublishDate": 1755599257126,
            "Source": "earnings"
        },
        {
            "Title": "Pennar Industries Reports 15.30% Revenue Growth in Q1FY26 with Strong Order Book of INR 809 Crores",
            "Summary": "Pennar Industries Limited announced its Q1FY26 financial results with consolidated net sales rising 15.30% year-over-year to INR 845.67 crore compared to INR 733.45 crore in Q1FY25. Profit after tax increased 21.06% to INR 31.96 crore from INR 26.40 crore in the previous year. EBITDA grew 19.12% to INR 94.12 crore with margins improving to 11.13% from 10.77%. The company secured orders worth INR 809 crores across various business verticals in the past three months, expected to be executed in the next two quarters. The Board approved the 49th Annual General Meeting for September 30, 2025, and appointed Mr. Subhash Kishan Kandrapu as Secretarial Auditor for five years from 2025-26 to 2029-30. Management highlighted steady operational performance supported by firm demand across key customer segments, with the PEB business scaling up through the Raebareli plant and new project wins.",
            "Sentiment": "positive",
            "PublishDate": 1755100592040,
            "Source": "earnings"
        },
        {
            "Title": "Pennar Industries Reports Strong Q1 Growth with Revenue Up 16% and Profit Rising 21%",
            "Summary": "Pennar Industries delivered robust quarterly results with revenue increasing to 8.46 billion rupees from 7.3 billion rupees year-over-year. The company's consolidated net profit grew to 319 million rupees compared to 264 million rupees in the same period last year. EBITDA improved to 860 million rupees from 716 million rupees, while EBITDA margin expanded to 10.16% from 9.76% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1755097997850,
            "Source": "earnings"
        },
        {
            "Title": "Pennar Industries Reports Improved Q4 EBITDA and Margin",
            "Summary": "Pennar Industries has reported its quarterly financial results. The company's EBITDA for Q4 increased to 917 million rupees, up from 648.3 million rupees in the same quarter of the previous year. The EBITDA margin also improved, rising to 10.12% from 7.88% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748617490000,
            "Source": "result"
        },
        {
            "Title": "Pennar Industries Reports Q4 Financial Results",
            "Summary": "Pennar Industries has reported its quarterly financial results. The company's consolidated net profit for Q4 was 356 million rupees, compared to 286.1 million rupees year-over-year and 305 million rupees quarter-over-quarter. Revenue for Q4 was 9.06 billion rupees, up from 8.23 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748617436000,
            "Source": "result"
        },
        {
            "Title": "Pennar Industries Reports Increased Q3 Profit and Revenue",
            "Summary": "Pennar Industries has announced its financial results for the third quarter. The company's consolidated net profit rose to 305 million rupees, up from 254 million rupees in the same period last year. Revenue also increased to 8.39 billion rupees from 7.45 billion rupees year-over-year, showing growth in both top and bottom lines.",
            "Sentiment": "positive",
            "PublishDate": 1739751421000,
            "Source": "earnings"
        },
        {
            "Title": "Pennar Industries Reports Q3 EBITDA Growth",
            "Summary": "Pennar Industries has reported its Q3 financial results. The company's EBITDA increased to 816 million rupees, up from 759.6 million rupees in the same quarter last year. However, the EBITDA margin decreased slightly to 9.71% from 10.20% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739544572000,
            "Source": "earnings"
        },
        {
            "Title": "Pennar Industries Reports Increased Q3 Profit and Revenue",
            "Summary": "Pennar Industries has announced its financial results for the third quarter. The company's consolidated net profit rose to 305 million rupees, up from 254 million rupees in the same period last year. Revenue also increased to 8.39 billion rupees from 7.45 billion rupees year-over-year, indicating growth in both profitability and sales.",
            "Sentiment": "positive",
            "PublishDate": 1739544567000,
            "Source": "earnings"
        },
        {
            "Title": "Pennar Industries to Consider Q3 Results",
            "Summary": "Pennar Industries has announced that it will consider its third quarter (Q3) financial results on February 14. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738848261000,
            "Source": "earnings"
        },
        {
            "Title": "Pennar Industries Forms Joint Venture with Zetwerk for Solar Module Manufacturing",
            "Summary": "Pennar Industries has signed a joint venture agreement with Zetwerk to establish a solar module manufacturing business. Pennar will hold a 45% stake in the venture by investing Rs 18.75 crore.",
            "Sentiment": "positive",
            "PublishDate": 1735696022000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pennar Industries to Form Joint Venture for Solar Module and Cell Manufacturing",
            "Summary": "Pennar Industries has announced its intention to enter into a joint venture agreement with Zetwerk Manufacturing Businesses. The purpose of this joint venture is to manufacture and sell solar modules and cells.",
            "Sentiment": "positive",
            "PublishDate": 1734048705000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pennar Industries to Form Joint Venture for Solar Module and Cell Manufacturing",
            "Summary": "Pennar Industries has announced plans to enter into a joint venture agreement with Zetwerk Manufacturing Businesses. The joint venture will focus on the manufacturing and sale of solar modules and cells.",
            "Sentiment": "positive",
            "PublishDate": 1734010469000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pennar Industries Considers Joint Venture for Business Expansion",
            "Summary": "Pennar Industries is contemplating entering into a joint venture to expand its business operations. The company is exploring strategic partnerships to potentially enhance its market presence and diversify its portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1733788685000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pennar Industries Considers Joint Venture for Business Expansion",
            "Summary": "Pennar Industries has announced that it will consider entering into a joint venture to expand its business operations. This strategic move suggests the company is looking for opportunities to grow and potentially diversify its portfolio through collaboration with another entity.",
            "Sentiment": "positive",
            "PublishDate": 1733741446000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pennar Industries Reports Q2 Financial Results and Announces Stake Sale",
            "Summary": "Pennar Industries reported its Q2 consolidated net profit at 269 million rupees, up from 225 million rupees year-over-year and 264 million rupees quarter-over-quarter. However, Q2 revenue decreased to 7.5 billion rupees from 8.14 billion rupees year-over-year. The company also announced plans to sell its stake in Enertech Pennar Defense and Engineering Systems.",
            "Sentiment": "neutral",
            "PublishDate": 1731455674000,
            "Source": "result"
        }
    ]
}