{
    "Symbol": "PENINLAND",
    "ISIN": "INE138A01028",
    "News": [
        {
            "Title": "Peninsula Land Q3 Loss Widens to ₹111M",
            "Summary": "Peninsula Land reported a wider net loss of ₹111 million in Q3 compared to ₹68 million loss in the same quarter last year, while revenue declined significantly to ₹269 million from ₹966 million year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770296074127,
            "Source": "co_actions_results"
        },
        {
            "Title": "Peninsula Land Acquires 29.42% in Zenithvista LLP",
            "Summary": "Peninsula Land has acquired a 29.42% stake in Zenithvista Real Estate LLP for a Mumbai redevelopment project, partnering with Alpha AIF and Delta Corp in this strategic real estate venture.",
            "Sentiment": "positive",
            "PublishDate": 1769526670111,
            "Source": "co_actions_results"
        },
        {
            "Title": "Peninsula Land Limited Faces Rs 8.4 Lakh Fine from BSE for Regulatory Non-Compliance",
            "Summary": "BSE rejected Peninsula Land Limited's waiver request and imposed a fine of Rs 8,40,000 (excluding 18% GST) for non-compliance with SEBI ICDR Regulations Schedule XIX Para(2). The company stated the delayed compliance did not cause detriment to shareholders and will pursue appeal options while discharging the obligation.",
            "Sentiment": "negative",
            "PublishDate": 1764932602754,
            "Source": "corporate_governance"
        },
        {
            "Title": "Peninsula Land Initiates Redemption of Rs. 112.50 Crore Optionally Convertible Debentures",
            "Summary": "Peninsula Land Limited has initiated the redemption process for Tranche A OCDs worth Rs. 112.49 crore held by RE2.0 Residential Opportunities Fund, with all obligations fulfilled despite pending banking formalities. The company is required to complete redemption of remaining Tranche B OCDs worth Rs. 37.50 crore by January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764595649068,
            "Source": "corporate_action"
        },
        {
            "Title": "Peninsula Land's Credit Rating Downgraded to CARE BB+ on Liquidity Concerns",
            "Summary": "CARE Ratings downgraded Peninsula Land Limited's long-term bank facilities worth ₹300 crore from CARE BBB- Stable to CARE BB+ Stable due to increased delays in lease rental receipts and upcoming optionally convertible debentures redemption of ₹150 crore in December 2025. The downgrade reflects concerns over the company's liquidity position and debt coverage indicators, with high tenant concentration risk as only two government tenants occupy the entire leased property in Mumbai's Parel area.",
            "Sentiment": "negative",
            "PublishDate": 1764073862719,
            "Source": "corporate_action"
        },
        {
            "Title": "Peninsula Land Limited Faces Rs 10.14 Lakh Fine from NSE for Regulatory Non-Compliance",
            "Summary": "NSE imposed a fine of Rs 10,14,800 (including GST) on Peninsula Land Limited for delayed compliance with SEBI ICDR Regulations Schedule XIX-Para(2), rejecting the company's appeal filed in September. The company stated the delayed compliance did not cause any detriment to shareholders or market participants and will discharge the obligation while pursuing further appeals.",
            "Sentiment": "negative",
            "PublishDate": 1763720610879,
            "Source": "corporate_governance"
        },
        {
            "Title": "Peninsula Land Reports Q2 Net Loss of 182M Rupees, Revenue Drops to 372M Rupees",
            "Summary": "Peninsula Land reported a net loss of 182 million rupees in Q2, compared to a profit of 87 million rupees in the same period last year. Revenue declined to 372 million rupees from 523 million rupees year-over-year. EBITDA fell to 38 million rupees from 119 million rupees, with EBITDA margin contracting to 10.07% from 22.69% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762963680186,
            "Source": "earnings"
        },
        {
            "Title": "Peninsula Land Reports Deviation in Fund Utilization from Preferential Issue Proceeds",
            "Summary": "Peninsula Land Limited submitted a monitoring agency report for the quarter ended June 30, 2025, revealing a deviation in the utilization of funds raised through a preferential issue of optionally convertible debentures worth Rs. 149.99 crore. CARE Ratings Limited, the monitoring agency, reported that the company utilized Rs. 13.25 crore for land acquisition payments, vendor payments, and earnest money deposits, which deviates from the stated object of making investments into the real estate platform. The company invested Rs. 22.65 crore in a real estate platform entity through its subsidiary Peninsula Holdings and Investments Private Limited. The monitoring agency noted that Rs. 35.90 crore from Tranche B OCDs was invested into RE Platform entities, with Rs. 1.60 crore remaining unutilized as of quarter-end. The company reported a net loss of Rs. 5.03 crore in Q1 FY26, following a net loss of Rs. 36 crore in FY25. The stock price stood at Rs. 37.30 per share as of August 11, 2025, below the conversion price of Rs. 56.60 per share, potentially creating repayment risk if the OCDs are not converted to equity.",
            "Sentiment": "negative",
            "PublishDate": 1755190684817,
            "Source": "corporate_action"
        },
        {
            "Title": "Peninsula Land Reports Q1 Loss, Approves Key Leadership Reappointments and New Appointments",
            "Summary": "Peninsula Land Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing a standalone loss after tax of Rs. 581 lakhs compared to Rs. 188 lakhs loss in the same quarter last year. Revenue from operations increased to Rs. 3,684 lakhs from Rs. 3,003 lakhs year-over-year. The Board approved the reappointment of Rajeev A. Piramal as Executive Vice Chairman and Managing Director for five years from October 26, 2025, and Nandan A. Piramal as Whole Time Director for the same period, both subject to shareholder approval. New appointments include Amyn Asgarali Jassani as Additional Non-Executive Independent Director, Shivam Sharma & Associates as Secretarial Auditor for five years, and Aneja Assurance Private Limited as Internal Auditor for 2025-2026. The company faces uncertainty regarding Rs. 9,615 lakhs in investments and loans related to joint venture entity Hem Infrastructure and Development Private Limited, which is undergoing Corporate Insolvency Resolution Process. The company converted 77.27 lakh compulsorily convertible debentures into equity shares during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754492276475,
            "Source": "earnings"
        },
        {
            "Title": "Peninsula Land's JV Faces NCLT Insolvency Process Over ₹266 Crore Loan Default",
            "Summary": "Peninsula Land Ltd has reported that its joint venture company, Hemil Developers Private Limited (HDPL), is facing a corporate insolvency resolution process initiated by the National Company Law Tribunal (NCLT) due to a loan default of ₹266 crore. Peninsula Land had already written off its investment in HDPL in previous financial statements. The company stated that this development is not expected to have any material impact on its financial position.",
            "Sentiment": "negative",
            "PublishDate": 1752719182000,
            "Source": "default"
        },
        {
            "Title": "Peninsula Land Acquires Land in Alibaug and Karjat, Secures 7.65 Billion Rupees Real Estate Platform",
            "Summary": "Peninsula Land has purchased land parcels in Alibaug and Karjat. The company's partners have committed 2.16 billion rupees towards RE platform projects. Additionally, Peninsula Land has recently established a 7.65 billion rupees real estate development platform.",
            "Sentiment": "positive",
            "PublishDate": 1752106196000,
            "Source": "default"
        },
        {
            "Title": "Peninsula Land Expands Real Estate Portfolio with Land Acquisitions and Investment",
            "Summary": "Peninsula Land has acquired land parcels in Alibaug and Karjat, expanding its real estate portfolio. The company's partners have invested 2.16 billion rupees in real estate platform projects. Peninsula Land recently established a 7.65 billion rupees real estate development platform, indicating significant growth and investment in the sector.",
            "Sentiment": "positive",
            "PublishDate": 1752063978000,
            "Source": "default"
        },
        {
            "Title": "Peninsula Land Announces Strategic Investment in Terranest Agri-infratech LLP",
            "Summary": "Peninsula Land has announced a strategic investment in Terranest Agri-infratech LLP. This move is in line with the company's renewed focus on real estate verticals, specifically plotted developments in the Mumbai Metropolitan Region (MMR) and society redevelopment projects in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1748823117000,
            "Source": "default"
        },
        {
            "Title": "Peninsula Land Announces Strategic Investment in Terranest Agri-Infratech LLP",
            "Summary": "Peninsula Land has announced a strategic investment in Terranest Agri-Infratech LLP. This move aligns with the company's renewed focus on real estate verticals, specifically plotted developments in the Mumbai Metropolitan Region (MMR) and society redevelopment projects in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1748623991000,
            "Source": "default"
        },
        {
            "Title": "Peninsula Land Reports Significant Drop in Q4 EBITDA",
            "Summary": "Peninsula Land has reported a substantial decrease in its Q4 EBITDA, which fell to 18 million rupees from 315 million rupees in the same quarter of the previous year. The company's EBITDA margin also declined sharply, dropping to 2.83% from 27.89% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748529924000,
            "Source": "result"
        },
        {
            "Title": "Peninsula Land Reports Q4 Financial Results",
            "Summary": "Peninsula Land reported a net loss of 252 million rupees in Q4, compared to a loss of 245 million rupees in the same quarter last year. The loss increased from 68 million rupees in the previous quarter. Q4 revenue was 627 million rupees, down from 1.1 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748529838000,
            "Source": "result"
        },
        {
            "Title": "Peninsula Land Files FIR Against KBK Group for Alleged Fraud",
            "Summary": "Peninsula Land has filed a First Information Report (FIR) against KBK Group, alleging fraud. The company claims potential financial implications of approximately INR 200 crores, which it expects to recover through legal proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1742516336000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Peninsula Land Files FIR Against KBK Group for Alleged Fraud",
            "Summary": "Peninsula Land has filed a First Information Report (FIR) against KBK Group, alleging fraud. The company claims potential financial implications of approximately INR 200 crores, which it expects to recover through legal proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1742484414000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Peninsula Land Reports Q3 Net Loss of 97 Million Rupees",
            "Summary": "Peninsula Land, a real estate company, has reported a consolidated net loss of 97 million rupees for the third quarter, compared to a profit of 323 million rupees in the same period last year. The company's revenue also declined to 1 billion rupees from 1.43 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739146342000,
            "Source": "earnings"
        },
        {
            "Title": "Peninsula Land Reports Q3 Net Loss of 97 Million Rupees",
            "Summary": "Peninsula Land, a real estate company, has reported a consolidated net loss of 97 million rupees for the third quarter, compared to a profit of 323 million rupees in the same period last year. The company's revenue also declined to 1 billion rupees from 1.43 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738938930000,
            "Source": "earnings"
        },
        {
            "Title": "Peninsula Land Reports Mixed Q2 Financial Results",
            "Summary": "Peninsula Land's Q2 EBITDA decreased to 119 million rupees from 155 million rupees year-over-year. However, the company's EBITDA margin improved significantly, rising to 22.69% from 12.03% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731597862000,
            "Source": "result"
        },
        {
            "Title": "Peninsula Land Reports Q2 Financial Results",
            "Summary": "Peninsula Land announced its Q2 financial results. The company reported a net profit of 87 million rupees, down from 94 million rupees year-over-year. Compared to the previous quarter, there was a loss of 19 million rupees. Q2 revenue stood at 523 million rupees, significantly lower than the 1.29 billion rupees reported in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731597798000,
            "Source": "result"
        }
    ]
}