{
    "Symbol": "PERSISTENT",
    "ISIN": "INE262H01021",
    "News": [
        {
            "Title": "Persistent Systems Appoints Vikram Tulsyan as SVP",
            "Summary": "Persistent Systems Limited has appointed Mr. Vikram Tulsyan as Senior Vice President and Senior Management Personnel effective February 12, 2026, bringing 20+ years of finance experience.",
            "Sentiment": "positive",
            "PublishDate": 1770917872632,
            "Source": "stocks"
        },
        {
            "Title": "Persistent Systems Block Trade Worth ₹443.71 Crores",
            "Summary": "Persistent Systems executed a significant NSE block trade worth ₹443.71 crores involving approximately 741,742 shares at ₹5,982.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770264329623,
            "Source": "co_actions_results"
        },
        {
            "Title": "Persistent Systems Holds Investor Session with Creagis",
            "Summary": "Persistent Systems conducted a virtual one-on-one investor session with Creagis on January 30, 2026, reiterating Q3 FY26 earnings information without sharing additional details.",
            "Sentiment": "neutral",
            "PublishDate": 1769781074590,
            "Source": "stocks"
        },
        {
            "Title": "Persistent Systems Schedules Investor Meet Feb 2",
            "Summary": "Persistent Systems Limited announces investor session with American Century Investments on February 2, 2026, at 8:30 PM IST via virtual mode under Regulation 30 compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769611719451,
            "Source": "stocks"
        },
        {
            "Title": "Persistent Systems Q3 FY26 Results Show Strong Growth",
            "Summary": "Persistent Systems reported robust Q3 FY26 performance with revenue of $422.5 million, marking 17.3% YoY growth. The company achieved significant AI-driven margin improvements and declared ₹22 interim dividend per share.",
            "Sentiment": "positive",
            "PublishDate": 1769530122739,
            "Source": "co_actions_results"
        },
        {
            "Title": "Persistent Systems schedules investor meet Jan 28",
            "Summary": "Persistent Systems Limited announces investor/analyst session with Creagis on January 28, 2026, to discuss Q3 FY26 earnings in virtual format under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769098328999,
            "Source": "stocks"
        },
        {
            "Title": "Persistent Systems Conducts Non-Deal Roadshow",
            "Summary": "Persistent Systems held investor meetings on January 22, 2026, with major AMCs and institutional investors including Axis AMC, Goldman Sachs AMC, and Kotak Mahindra AMC in physical mode.",
            "Sentiment": "neutral",
            "PublishDate": 1769095807390,
            "Source": "stocks"
        },
        {
            "Title": "Prabhudas Lilladher Sets ₹7,360 Target for Persistent",
            "Summary": "Prabhudas Lilladher maintains BUY rating on Persistent Systems with target price of ₹7,360, citing strong Q3 revenue growth of 4.1% QoQ and robust ACV growth of 18% YoY reaching $722 million.",
            "Sentiment": "positive",
            "PublishDate": 1768982527930,
            "Source": "co_actions_results"
        },
        {
            "Title": "Anand Rathi Upgrades Persistent Systems to Buy",
            "Summary": "Anand Rathi upgrades Persistent Systems to BUY with target price of ₹7,587.00, citing strong 17.30% YoY revenue growth and ambitious $2bn revenue target by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1768977903785,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nuvama hikes Persistent Systems target price",
            "Summary": "Brokerage firms maintain positive outlook on select stocks including Persistent Systems and CEAT, citing strong operating performance and improving margins across IT services and auto sectors.",
            "Sentiment": "positive",
            "PublishDate": 1768969487150,
            "Source": "stocks"
        },
        {
            "Title": "Persistent Systems Block Trade Worth ₹63.71 Crores",
            "Summary": "Persistent Systems executed a significant NSE block trade worth ₹63.71 crores involving 101,949 shares at ₹6,249.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768968497623,
            "Source": "co_actions_results"
        },
        {
            "Title": "Persistent Systems Block Trade Worth ₹20.55 Crores",
            "Summary": "Persistent Systems witnessed a significant block trade on NSE involving 32,632 shares valued at ₹20.55 crores, executed at ₹6,296.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768968472984,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nomura Sets Neutral Rating on Persistent Systems",
            "Summary": "Nomura maintains neutral stance on Persistent Systems with target price of ₹6,100.00, reflecting cautious outlook on the IT services company's near-term prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1768967362941,
            "Source": "stocks"
        },
        {
            "Title": "HSBC Sets Hold Rating on Persistent Systems at ₹6,560",
            "Summary": "HSBC maintains Hold rating on Persistent Systems with target price of ₹6,560, indicating neutral outlook on the IT services company's stock performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768967335385,
            "Source": "stocks"
        },
        {
            "Title": "CLSA Raises Persistent Systems Target to ₹8,865",
            "Summary": "CLSA maintains High Conviction Outperform rating on Persistent Systems and raises target price to ₹8,865, reflecting positive analyst sentiment on the IT services company.",
            "Sentiment": "positive",
            "PublishDate": 1768967312733,
            "Source": "stocks"
        },
        {
            "Title": "Investec Raises Persistent Target Price to ₹6,665",
            "Summary": "Investec maintains 'Hold' rating on Persistent Systems while increasing target price to ₹6,665, reflecting updated valuation assessment of the IT services company.",
            "Sentiment": "neutral",
            "PublishDate": 1768967261323,
            "Source": "stocks"
        },
        {
            "Title": "Persistent Systems Sets FY26 ETR at 20-24%",
            "Summary": "Persistent Systems announces fiscal year 2026 effective tax rate forecast between 20% and 24%, prioritizing strategic reinvestment over margin expansion to drive long-term growth.",
            "Sentiment": "neutral",
            "PublishDate": 1768965257360,
            "Source": "co_actions_results"
        },
        {
            "Title": "Persistent Systems Sets $2B Revenue Target by 2027",
            "Summary": "Persistent Systems announces ambitious revenue targets of $2 billion by March 2027 and $5 billion by March 2030, while declining to provide future margin guidance to investors.",
            "Sentiment": "positive",
            "PublishDate": 1768965224614,
            "Source": "stocks"
        },
        {
            "Title": "Persistent Systems Q3 PAT up 18% YoY to ₹439 cr",
            "Summary": "Persistent Systems delivered strong Q3 FY26 results with PAT growing 18% YoY to ₹439 crore and revenue reaching $422.5 million. Board declared ₹22 interim dividend per share.",
            "Sentiment": "positive",
            "PublishDate": 1768919775018,
            "Source": "co_actions_results"
        },
        {
            "Title": "Persistent Systems Transfers German, French Units",
            "Summary": "Persistent Systems board approves transfer of 100% shareholding in German and French subsidiaries to Ireland-based Aepona Group Limited for operational efficiency and entity rationalization.",
            "Sentiment": "neutral",
            "PublishDate": 1768907809650,
            "Source": "co_actions_results"
        },
        {
            "Title": "Persistent Systems Declares ₹22 Interim Dividend",
            "Summary": "Persistent Systems announces interim dividend of ₹22 per equity share for FY 2025-26 with record date January 27, 2026. Payment within 30 days of board approval on January 20, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768906789560,
            "Source": "co_actions_results"
        },
        {
            "Title": "Persistent Systems Q3 FY26 Results Preview",
            "Summary": "Persistent Systems to report Q3 FY26 earnings on January 20. Street expects 3.6% QoQ dollar revenue growth to $421 million, while margins may decline due to wage hike pressure despite operating efficiencies.",
            "Sentiment": "neutral",
            "PublishDate": 1768824658549,
            "Source": "co_actions_results"
        },
        {
            "Title": "Persistent Systems Appoints Nitha Puthran as EVP",
            "Summary": "Persistent Systems Limited has appointed Ms. Nitha Puthran as Executive Vice President and Senior Managerial Person effective January 2, 2026, bringing over 20 years of cloud and infrastructure expertise.",
            "Sentiment": "positive",
            "PublishDate": 1767372753050,
            "Source": "stocks"
        },
        {
            "Title": "Persistent Systems Q3FY26 Results Call on Jan 20",
            "Summary": "Persistent Systems announces investor/analyst conference call scheduled for January 20, 2026 at 6:00 PM IST to discuss Q3FY26 financial results ended December 31, 2025. Updated registration links provided.",
            "Sentiment": "neutral",
            "PublishDate": 1767269895389,
            "Source": "co_actions_results"
        },
        {
            "Title": "Persistent Systems Partners with DigitalOcean for AI",
            "Summary": "Persistent Systems announces strategic partnership with DigitalOcean to enhance AI access and security, targeting over 50% reduction in AI infrastructure costs to boost adoption.",
            "Sentiment": "positive",
            "PublishDate": 1765872496034,
            "Source": "stocks"
        },
        {
            "Title": "Persistent Systems Completes Internal Restructuring by Acquiring Full Ownership of Aepona Group",
            "Summary": "Persistent Systems has completed a Share Purchase Agreement (SPA) to acquire total ownership of Aepona Group Limited from its US subsidiary as part of an internal restructuring initiative. The transaction represents an organizational realignment within the company's existing portfolio of subsidiaries.",
            "Sentiment": "neutral",
            "PublishDate": 1765012979720,
            "Source": "order&deals"
        },
        {
            "Title": "Persistent Systems Establishes Branch Office in Abu Dhabi, UAE",
            "Summary": "Persistent Systems Limited has established a branch office in Abu Dhabi, UAE, following the issuance of Commercial Registration Certificate and License by the Department of Economic Development-Abu Dhabi Registration Authority on December 5, 2025. The expansion represents the company's strategic move to establish operations in the UAE market, potentially enhancing its regional presence and business opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1764958885303,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Senior VP Business Finance Vikram Tulsyan Resigns Due to Personal Reasons",
            "Summary": "Vikram Tulsyan resigned from his position as Senior Vice President-Business Finance and SMP at Persistent Systems Limited, effective from the closure of business hours on November 21, 2025 (US Time). The resignation was attributed to personal reasons with no material reasons cited beyond the stated cause, affecting the company's senior finance leadership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763822861131,
            "Source": "corporate_governance"
        },
        {
            "Title": "Persistent Systems Launches Experience Transformation Studio for AI-Based Innovation",
            "Summary": "Persistent Systems has launched an Experience Transformation Studio focused on AI-based innovation. The studio is designed to help businesses create revolutionary user experiences and improve their work processes through AI technology.",
            "Sentiment": "positive",
            "PublishDate": 1761808400400,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Reports Strong Q2 FY26 Results with 17.6% YoY Revenue Growth and 230 bps Margin Expansion",
            "Summary": "Persistent Systems delivered revenue of $406.2 million in Q2 FY26, marking 4.2% quarter-on-quarter growth and 17.6% year-on-year growth. This represents the company's 22nd consecutive quarter of growth, bringing trailing 12-month revenue above $1.5 billion. EBIT margin reached 16.3%, showing 230 basis points improvement year-on-year, while profit after tax margin was 13.2%, up 45.1% year-on-year in absolute terms. The company reported total contract value of $609.2 million with new bookings at $350.8 million. Client metrics showed robust growth with top 5 clients' revenue up 23.4% year-on-year. Geographically, Europe led with 37.9% growth, followed by North America at 15.4%. BFSI sector drove industry growth at 30% year-on-year. The company implemented merit increments for all global employees effective October 1, 2025, and promoted Jaideep Dhok to Chief Operating Officer. Total headcount reached 26,224, up 884 from the previous quarter, with trailing 12-month attrition improving to 13.8%. The company continues advancing its AI strategy through three core pillars: AI for Technology, AI for Business, and Enterprise Data Readiness for AI.",
            "Sentiment": "positive",
            "PublishDate": 1760969981188,
            "Source": "earnings"
        },
        {
            "Title": "Persistent Systems Reports Record Quarterly Results with 4.2% Sequential Revenue Growth",
            "Summary": "Persistent Systems' stock gained 8% following its September quarter results announcement on October 14. The IT company reported sequential revenue growth of 4.2% to $406.2 million, up from 3.9% in the prior quarter. The healthcare vertical, contributing over 25% of revenue, recovered with 4% sequential growth after a 2.2% decline previously. The company achieved a record quarterly operating margin of 16.3%, supported by 80 basis points from software license cost reversal, 60 basis points from currency benefits, and 20 basis points from increased offshoring. Record order bookings reached $609.2 million, primarily driven by renewal projects. Employee count increased by 884 to 26,224, while attrition remained stable at 13.8%. The company maintains its $2 billion revenue target by FY27 and expects double-digit growth for FY26. Salary revisions implemented from October 1 are expected to impact margins by 80-100 basis points. Motilal Oswal projects 19% revenue and 26% earnings growth between FY25-FY27, maintaining a buy rating with Rs6,550 target price.",
            "Sentiment": "positive",
            "PublishDate": 1760707884291,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Conducts Non-Deal Roadshow with Major Mutual Funds and Asset Managers",
            "Summary": "Persistent Systems Limited held a Non-Deal Roadshow on October 16, 2025, conducting meetings with nine major institutional investors including Axis Mutual Fund, Aditya Birla Mutual Fund, HDFC Mutual Fund, Kotak Mutual Fund, SBI Life Insurance, Motilal Oswal Mutual Fund, Goldman Sachs Asset Management, and Nippon Mutual Fund. The sessions were conducted through one-on-one meetings and a group meeting format throughout the day. During these interactions, the company reiterated information previously communicated during its earnings call held on October 14, 2025, for the quarter ended September 30, 2025, without sharing any additional information beyond what was already disclosed.",
            "Sentiment": "neutral",
            "PublishDate": 1760627667211,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Sees Block Trade Worth Rs. 55.65 Crores on NSE",
            "Summary": "Persistent Systems Ltd. had a block trade executed on the National Stock Exchange (NSE) involving approximately 96,190 shares at Rs. 5,785 per share, totaling Rs. 55.65 crores. The transaction represents a significant institutional trade in the company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1760596851553,
            "Source": "order&deals"
        },
        {
            "Title": "Persistent Systems Conducts Non-Deal Roadshow with HSBC and Edelweiss Mutual Funds",
            "Summary": "Persistent Systems Limited held a Non-Deal Roadshow on October 15, 2025, conducting one-on-one meetings with HSBC Mutual Fund at 6:30 PM IST and Edelweiss Mutual Fund at 7:30 PM IST. During these physical meetings, the company reiterated information previously communicated during its earnings call held on October 14, 2025, for the quarter ended September 30, 2025. No additional information was shared with the investors beyond what was already disclosed in the earnings presentation.",
            "Sentiment": "neutral",
            "PublishDate": 1760551316655,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Shares Surge 7% After Strong Q2 Results Trigger Bullish Brokerage Calls",
            "Summary": "Persistent Systems reported strong quarterly results with consolidated net profit jumping 45% to ₹471.5 crore and revenue from operations growing 23.5% to ₹3,580.7 crore. The company's board approved the transfer of 100% shareholding of Aepona Group Ltd, Ireland. Multiple brokerages responded positively with upgraded target prices: CLSA raised its target to ₹8,270 with an outperform rating, Nuvama increased to ₹7,000 with a buy rating, and Motilal Oswal maintained a buy at ₹6,550 projecting 19% USD revenue CAGR over FY25-27. HDFC Securities noted broad-based growth with strong performance in BFSI vertical and European market, highlighting the company's AI-led platform strategy with 20 new patents filed for its SASVA platform. The stock surged over 7% to an intraday high of ₹5,728.90, trading at ₹5,692.70, up 6.91% from the previous close of ₹5,324.25.",
            "Sentiment": "positive",
            "PublishDate": 1760506424163,
            "Source": "earnings"
        },
        {
            "Title": "Persistent Systems Anticipates 180 Basis Points Margin Impact from Q3 Wage Increases",
            "Summary": "Persistent Systems expects wage increases to impact margins by 180 basis points in Q3. The company plans to offset this impact by 80-100 basis points through operational strategies including offshoring and improved utilization rates.",
            "Sentiment": "neutral",
            "PublishDate": 1760499278540,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Sets $2 Billion Revenue Target by FY27 with Margin Expansion Plans",
            "Summary": "Persistent Systems has announced its goal to achieve $2 billion in revenue by FY27. The company is targeting a 100 basis point margin improvement in FY26, followed by an additional 100 basis point margin enhancement in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1760498895859,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Reports Strong Q2 Results with Net Profit Rising to 4.71 Billion Rupees",
            "Summary": "Persistent Systems delivered quarterly results that exceeded estimates across key metrics. Net profit increased to 4.71 billion rupees from 4.25 billion rupees in the previous quarter, surpassing the estimated 4.36 billion rupees. Revenue grew to 35.8 billion rupees from 33.3 billion rupees quarter-on-quarter, slightly above the 35.21 billion rupees estimate. EBIT rose to 5.83 billion rupees from 5.19 billion rupees, beating the estimated 5.52 billion rupees. The company's EBIT margin improved to 16.28% from 15.57% in the previous quarter, exceeding the estimated 15.7%.",
            "Sentiment": "positive",
            "PublishDate": 1760487158732,
            "Source": "earnings"
        },
        {
            "Title": "Persistent Systems Reports $406.2M Revenue in Q2 FY26 with 17.6% YoY Growth",
            "Summary": "Persistent Systems announced revenue of $406.2 million for Q2 FY26, representing a 17.6% increase compared to the same period in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760460997183,
            "Source": "earnings"
        },
        {
            "Title": "Persistent Systems Targets 17% Revenue CAGR with AI Strategy and Margin Expansion",
            "Summary": "Persistent Systems has outlined growth targets including a 17% revenue compound annual growth rate driven by AI strategy and an expanding client base. The company aims to maintain a 16% EBIT margin while achieving a 45% increase in profit after tax to enhance long-term shareholder value.",
            "Sentiment": "positive",
            "PublishDate": 1760456121332,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Approves Transfer of Aepona Group Limited from US Subsidiary to Parent Company",
            "Summary": "Persistent Systems Limited's Board of Directors approved the transfer of 100% shareholding of Aepona Group Limited, Ireland, from its subsidiary Persistent Systems Inc., USA to the parent company. The restructuring aims to achieve entity rationalization and operational efficiency within the group. Following the transfer, Aepona Group Limited will become a wholly owned subsidiary of Persistent Systems Limited. The company stated there are no benefits to promoters or group companies from this proposed restructuring. The transfer will be executed through a Share Purchase Agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1760441242286,
            "Source": "corporate_action"
        },
        {
            "Title": "Persistent Systems Approves Audited Financial Statements for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Persistent Systems Limited's Board of Directors approved the audited financial statements for the quarter and half year ended September 30, 2025, during a meeting held on October 14, 2025. The company has made both consolidated and standalone financial statements available on its website. The approval was communicated to BSE Limited and National Stock Exchange of India Limited through a formal notification signed by Company Secretary Amit Atre.",
            "Sentiment": "neutral",
            "PublishDate": 1760440866169,
            "Source": "earnings"
        },
        {
            "Title": "Persistent Systems Receives Approval for Aepona Group Share Transfer",
            "Summary": "Persistent Systems has received approval for the transfer of Aepona Group shares to the company. The approval allows the share transfer process to proceed.",
            "Sentiment": "positive",
            "PublishDate": 1760438387629,
            "Source": "corporate_action"
        },
        {
            "Title": "Persistent Systems Reports Q2 Net Profit of 4.71B Rupees, Beats Estimates",
            "Summary": "Persistent Systems reported quarterly consolidated net profit of 4.71 billion rupees, up from 4.25 billion rupees in the previous quarter and above analyst estimates of 4.36 billion rupees. The company's quarterly revenue reached 35.8 billion rupees, compared to 33.3 billion rupees in the prior quarter, slightly exceeding estimates of 35.21 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1760436886324,
            "Source": "earnings"
        },
        {
            "Title": "Persistent Systems Plans Non-Deal Roadshow for Major Institutional Investors",
            "Summary": "Persistent Systems will conduct a non-deal roadshow on October 15-16, 2025. The roadshow will target major institutional investors including Axis, HDFC, Kotak, and Goldman Sachs.",
            "Sentiment": "neutral",
            "PublishDate": 1760167566742,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Schedules Board Meeting for Q2 FY2026 Results on October 13-14, 2025",
            "Summary": "Persistent Systems Limited has scheduled a Board of Directors meeting for October 13-14, 2025 to review and approve audited financial results for the quarter and half year ending September 30, 2025. The meeting will cover both standalone company results and consolidated results including subsidiaries. The company will hold an investor/analyst call after the board meeting, with details to be shared separately. Trading window will remain closed from September 24, 2025 to October 16, 2025, reopening on October 17, 2025. The company has notified all relevant stakeholders including promoters, directors, and key personnel about the trading window closure.",
            "Sentiment": "neutral",
            "PublishDate": 1758644788580,
            "Source": "corporate_action"
        },
        {
            "Title": "Persistent Systems Says U.S. H-1B Visa Executive Order Won't Significantly Impact Operations",
            "Summary": "Persistent Systems Limited announced that a recent U.S. Executive Order on H-1B visa applications is not expected to significantly impact the company's operations or financials. The company reviewed the Executive Order titled 'Restriction on Entry of Certain Non-Immigrant Workers' and a subsequent memorandum issued by U.S. immigration authorities. Persistent Systems stated it will continue monitoring developments and provide updates as needed.",
            "Sentiment": "neutral",
            "PublishDate": 1758472456516,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Receives Improved ESG Rating of 81.7 for FY 2024-25",
            "Summary": "Persistent Systems Limited received an ESG rating of 81.7 for FY 2024-25 from SES ESG Research Pvt. Ltd., a SEBI-registered ESG Rating Provider. This represents an increase of 4.3 points from the previous fiscal year FY 2023-24. The assessment was based on the company's Annual Report, ESG Report for FY 2024-25, ESG-related web page, and other publicly available information. SES ESG Research is a wholly owned subsidiary of Stakeholders Empowerment Services.",
            "Sentiment": "positive",
            "PublishDate": 1758209656061,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Wins 'Growth Honor of the Year' at 2025 Everest Group Elevate Honors",
            "Summary": "Persistent Systems has been awarded the 'Growth Honor of the Year' at the 2025 Everest Group Elevate Honors, recognizing companies with annual revenue between $1-5 billion. The award acknowledges Persistent's market-leading organic, constant-currency revenue growth among publicly listed global service providers. The company has achieved 21 sequential quarters of revenue growth and reported $1,470.7 million in trailing twelve-month revenue as of Q1 FY26. Persistent delivered a 25.6% four-year CAGR from FY21-FY25 and a 17.4% CAGR since its 2010 IPO. The company has provided a five-year shareholder return of 1,805.2%. CEO Sandeep Kalra stated the recognition affirms client trust and highlighted the company's AI-led, platform-driven services strategy as growth drivers. Persistent aims to become a $5 billion company by FY31.",
            "Sentiment": "positive",
            "PublishDate": 1758093618136,
            "Source": "stock"
        },
        {
            "Title": "Persistent Systems Appoints Jaideep Dhok as COO-Technology Following Dhanashree Bhat's Resignation",
            "Summary": "Persistent Systems announced leadership changes in its operations team. Dhanashree Bhat stepped down from her position as Chief Operating Officer and SMP effective August 11, 2025. Jaideep Dhok has been designated as the new Chief Operating Officer - Technology and SMP effective August 12, 2025. Dhok previously served as Senior Vice President for Banking, Financial Services and Insurance at the company and brings over 23 years of experience across horizontal technologies and the BFSI industry. He has spent over 14 years at Persistent, leading major transformation programs and expanding the company's BFSI segment. In his new role, Dhok will take on additional responsibilities including Delivery Excellence, Talent Acquisition/Talent Management, Learning and Development, and Alliances and Partnerships. He also leads the APAC region and contributes to the company's AI strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1754990510023,
            "Source": "corporate_governance"
        }
    ]
}