{
    "Symbol": "PETRONET",
    "ISIN": "INE347G01014",
    "News": [
        {
            "Title": "Petronet LNG Q3FY26 Results Call on Feb 13",
            "Summary": "Petronet LNG Limited has scheduled a post-results conference call on February 13, 2026 at 11:00 AM IST to discuss Q3FY26 financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770711921273,
            "Source": "co_actions_results"
        },
        {
            "Title": "Petronet LNG Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Petronet LNG Limited has scheduled its board meeting for February 12, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until February 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770052387167,
            "Source": "co_actions_results"
        },
        {
            "Title": "Petronet LNG Signs Key Agreements with ONGC and MGL",
            "Summary": "Petronet LNG Limited executed a five-year Master Regasification Agreement with ONGC for LNG services at Dahej terminal and a one-year Master Agreement with Mahanagar Gas Limited for RLNG sales.",
            "Sentiment": "positive",
            "PublishDate": 1769528455554,
            "Source": "co_actions_results"
        },
        {
            "Title": "Petronet LNG Appoints New Chairman & Director",
            "Summary": "Petronet LNG Limited announces appointment of Shri Neeraj Mittal as Additional Director (Chairman) and Ms. Avantika Singh Aulakh as Additional Director, effective January 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768576545881,
            "Source": "stocks"
        },
        {
            "Title": "Petronet LNG Shareholders Approve Leadership Extensions",
            "Summary": "Petronet LNG shareholders approved tenure extensions for Managing Director Akshay Kumar Singh and Director Technical Pramod Narang through postal ballot voting, with 98.55% and 81.94% approval rates respectively.",
            "Sentiment": "positive",
            "PublishDate": 1768229806678,
            "Source": "stocks"
        },
        {
            "Title": "Petronet LNG shares surge 5% on JPMorgan upgrade",
            "Summary": "JPMorgan upgraded Petronet LNG to 'Overweight' with a ₹335 price target, citing Dahej expansion benefits and tariff escalation as key growth drivers for the LNG terminal operator.",
            "Sentiment": "positive",
            "PublishDate": 1767941732516,
            "Source": "stocks"
        },
        {
            "Title": "JPMorgan Upgrades Petronet LNG to Overweight",
            "Summary": "JPMorgan upgrades Petronet LNG to Overweight rating with target price raised to ₹335, signaling positive outlook for the natural gas company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1767931050537,
            "Source": "stocks"
        },
        {
            "Title": "Petronet LNG appoints new government nominee director",
            "Summary": "Petronet LNG Limited receives nomination from Ministry of Petroleum and Natural Gas for Shri Neeraj Mittal, IAS as new board director, replacing Shri Pankaj Jain, IAS effective January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767887271488,
            "Source": "stocks"
        },
        {
            "Title": "Citi warns of regulatory risks for Petronet LNG",
            "Summary": "Citi maintains 'sell' rating on Petronet LNG with ₹260 target, citing potential regulatory changes in regasification tariffs that could shift bargaining power to offtakers.",
            "Sentiment": "negative",
            "PublishDate": 1767687427543,
            "Source": "stocks"
        },
        {
            "Title": "Pankaj Jain Steps Down as Petronet LNG Chairman",
            "Summary": "Petronet LNG announces Pankaj Jain's cessation as Director and Chairman effective January 1, 2026, following his superannuation as Secretary, PNG on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767362327874,
            "Source": "stocks"
        },
        {
            "Title": "Petronet LNG Board Change: New Director Appointed",
            "Summary": "Petronet LNG announces withdrawal of Shri Milind Torawane and nomination of Ms. Avantika Singh Aulakh as Director, effective December 24, 2025, following GSPC communication.",
            "Sentiment": "neutral",
            "PublishDate": 1767108299851,
            "Source": "stocks"
        },
        {
            "Title": "Petronet LNG Named Investec's 2026 Top Pick with 44% Upside",
            "Summary": "Investec designates Petronet LNG as top pick for 2026 with ₹400 target, citing 44% upside potential amid expected 7% global LNG supply growth and favorable pricing environment for India.",
            "Sentiment": "positive",
            "PublishDate": 1767066340426,
            "Source": "stocks"
        },
        {
            "Title": "Petronet LNG Receives ₹6.69 Cr GST Demand Order",
            "Summary": "Petronet LNG receives GST demand order of ₹6.69 crores from Delhi tax authorities for FY2021-22, citing excess ITC claims. Company disputes the demand and plans legal action.",
            "Sentiment": "negative",
            "PublishDate": 1765443207039,
            "Source": "stocks"
        },
        {
            "Title": "Petronet LNG Signs ₹12,000 Cr Loan for PDH-PP Project",
            "Summary": "Petronet LNG executes loan agreement with SBI-BoB consortium for ₹12,000 crores to finance 750 KTPA PDH and 500 KTPA PP petrochemicals project at Dahej, Gujarat with comprehensive security arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1765377295611,
            "Source": "stocks"
        },
        {
            "Title": "Petronet LNG Seeks Shareholder Approval for Director Tenure Extensions via Postal Ballot",
            "Summary": "Petronet LNG Limited is conducting a postal ballot to extend the tenure of Managing Director & CEO Akshay Kumar Singh from February 1, 2026 to May 12, 2027, and Director (Technical) Pramod Narang from November 26, 2025 to November 25, 2027. The e-voting period runs from December 12, 2025 to January 10, 2026, with results to be announced by January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765181852703,
            "Source": "corporate_action"
        },
        {
            "Title": "Petronet LNG Signs 15-Year Ethane Services Deal with ONGC Worth 50 Billion Rupees",
            "Summary": "Petronet LNG and ONGC executed a 15-year binding term sheet for ethane unloading, storage and handling services. The agreement is expected to generate gross revenue of approximately 50 billion rupees for Petronet LNG over the contract period.",
            "Sentiment": "positive",
            "PublishDate": 1764806749627,
            "Source": "order&deals"
        },
        {
            "Title": "Petronet LNG Projects Gross Revenue of Rs 50 Billion",
            "Summary": "Petronet LNG expects to achieve gross revenue of approximately Rs 50 billion. The revenue projection indicates the company's business outlook and financial expectations for its LNG operations.",
            "Sentiment": "positive",
            "PublishDate": 1764763368577,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Sees Rs. 30.45 Crore Block Trade on NSE",
            "Summary": "Petronet LNG Ltd. witnessed a block trade worth Rs. 30.45 crores involving approximately 1,112,307 shares executed at Rs. 273.75 per share on the NSE. The transaction represents a significant institutional or bulk investor activity in the company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764135554995,
            "Source": "order&deals"
        },
        {
            "Title": "Petronet LNG Independent Director Mukerjeet Sharma Steps Down After Completing Three-Year Tenure",
            "Summary": "Shri Mukerjeet Sharma (DIN: 07599788) ceased to be an Independent Director on Petronet LNG Limited's Board effective November 24, 2025, following completion of his three-year tenure on November 23, 2025. The company has informed stock exchanges BSE and NSE about this board change as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763965030503,
            "Source": "corporate_governance"
        },
        {
            "Title": "Spice Islands Industries Declares Rs. 0.50 Interim Dividend with TDS Guidelines for FY 2025-26",
            "Summary": "Spice Islands Industries Limited declared an interim dividend of Rs. 0.50 per equity share of face value Rs. 10 each for FY 2025-26, with record date set as November 21, 2025. The company communicated detailed tax deduction at source (TDS) guidelines to shareholders, specifying 10% TDS for resident shareholders and 20% for non-residents, with various exemptions and documentation requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1763390590041,
            "Source": "corporate_action"
        },
        {
            "Title": "Petronet LNG Reports 5% Decline in Net Profit to INR 805.75 Crores in Q2 FY26",
            "Summary": "Petronet LNG's net profit fell 5% year-on-year to INR 805.75 crores in Q2 FY26 due to lower LNG volumes, while revenue dropped 15% to INR 11,009 crores with EBITDA at INR 1,117 crores. The company declared Rs. 7 per share interim dividend and achieved highest-ever 27% capacity utilization at Kochi terminal, with Dahej expansion of 5 MMTPA capacity expected by March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763107052620,
            "Source": "earnings"
        },
        {
            "Title": "Petronet LNG CEO AK Singh Gets 15-Month Extension Until May 2027",
            "Summary": "Akshay Kumar Singh, CEO and managing director of Petronet LNG Ltd, India's largest gas importer, has received a 15-month extension until May 12, 2027. Singh, who is 64 years old, began his initial five-year term on February 1, 2020. The board approved the extension on November 7, maintaining existing terms and conditions. Singh will retire at age 66, beyond the typical 60-year retirement age for public sector companies, as Petronet operates as a private limited company despite government oversight. Singh earned Rs 3.04 crore in total remuneration for 2024-25, including salary, allowances, and profit commission. The company is equally owned by four state-owned oil companies: IOC, GAIL, ONGC, and BPCL, each holding 12.5% stakes. Additionally, the board extended Pramod Narang's tenure as Director (Technical) for two years starting November 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762687080922,
            "Source": "corporate_governance"
        },
        {
            "Title": "Petronet LNG Plans 500,000 Ton LNG Acquisition from Australia's Gorgon Project",
            "Summary": "Petronet LNG executives anticipate increased utilization of the Dahej LNG terminal capacity amid stable global prices. The company projects that imported LNG will constitute 51% of local gas consumption by FY26. The company plans to acquire 500,000 tons of LNG under a 1.2 million tons per year contract from Australia's Gorgon LNG Project by 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762520997842,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Executive Forecasts LNG Prices at $11-12 Per MBTU Range",
            "Summary": "A Petronet LNG executive has predicted that LNG prices will remain in the $11-12 per MBTU range, with the forecast dependent on winter severity conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1762518933246,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Expects First Cargo Delivery From Gorgon LNG Agreement by March-April 2026",
            "Summary": "Petronet LNG expects to receive its first cargo from a 1.2 million tonnes per year LNG agreement with the Gorgon LNG Project by March-April 2026, according to a company executive.",
            "Sentiment": "positive",
            "PublishDate": 1762517028087,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Reports Rs 1,656 Crore Net Profit for Half-Year, Declares Rs 7 Interim Dividend",
            "Summary": "Petronet LNG Limited reported net profit of Rs 805.75 crore for the quarter ended September 30, 2025, and Rs 1,656.33 crore for the half-year period. Revenue from operations stood at Rs 11,009.13 crore for the quarter and Rs 22,888.99 crore for the half-year. The Board declared an interim dividend of Rs 7 per equity share (face value Rs 10) for financial year 2025-26. The company continues to face challenges with Use or Pay (UoP) dues totaling Rs 1,392.68 crore gross (Rs 656.84 crore net after provisions) arising from lower capacity utilization by customers under long-term regasification agreements. These dues pertain to different financial years: Rs 694.29 crore from FY2022-23, Rs 581.12 crore from FY2023-24, and Rs 117.27 crore from FY2024-25. The company has implemented recovery mechanisms and obtained bank guarantees from customers to secure recovery of these dues.",
            "Sentiment": "positive",
            "PublishDate": 1762514843225,
            "Source": "earnings"
        },
        {
            "Title": "Petronet LNG Extends Managing Director Akshay Kumar Singh's Tenure Until May 2027",
            "Summary": "Petronet LNG Limited's Board of Directors approved the extension of Akshay Kumar Singh's tenure as Managing Director, CEO, and Key Managerial Personnel from February 1, 2026, to May 12, 2027. The extension will be on existing terms and conditions and requires approval from company members through General Meeting or Postal Ballot. The board meeting was held on November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762513971251,
            "Source": "corporate_governance"
        },
        {
            "Title": "Petronet LNG Extends Director Pramod Narang's Tenure by Two Years",
            "Summary": "Petronet LNG's Board of Directors approved the extension of Shri Pramod Narang's tenure as Director (Technical) for an additional two years, effective from November 26, 2025, to November 25, 2027. The extension maintains existing terms and conditions and requires approval from company members through General Meeting or Postal Ballot. The Board meeting was held on November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762512611217,
            "Source": "corporate_governance"
        },
        {
            "Title": "Petronet LNG Board to Consider Interim Dividend for FY 2025-26",
            "Summary": "Petronet LNG Limited announced that its Board of Directors will meet on November 7, 2025, to consider and approve interim dividend for the financial year 2025-26, along with unaudited financial results for the quarter and half-year ended September 30, 2025. The company has implemented a trading window closure for all insiders from October 1, 2025, through November 9, 2025, prohibiting securities trading during this period due to unpublished price sensitive information.",
            "Sentiment": "neutral",
            "PublishDate": 1761825295882,
            "Source": "corporate_action"
        },
        {
            "Title": "Petronet LNG Appoints Roopesh Kumar Tiwari as Executive Director (HR)",
            "Summary": "Petronet LNG Limited has appointed Shri Roopesh Kumar Tiwari as Executive Director (HR), one level below the Board of Directors, effective September 22, 2025. Mr. Tiwari brings over 26 years of diverse HR experience across organizations including Penna Cement, Kesoram Industries, Dr. Reddy's Laboratories, Sumtotal Systems, CAE Simulation, and Food Corporation of India Ltd. He holds a Bachelor of Science degree in Chemistry and Zoology, and a Master's Degree in Human Resource Management and Industrial Relations from Lucknow University. His expertise spans recruitment, employee engagement, performance management, workforce development, talent management, industrial relations, mergers & acquisitions, and organizational development. Prior to joining Petronet LNG, he was associated with Dalmia Bharat Limited. His appointment term extends until he reaches the superannuation age of 60 years.",
            "Sentiment": "positive",
            "PublishDate": 1758544629150,
            "Source": "corporate_governance"
        },
        {
            "Title": "Petronet LNG Reports Mixed Q1 FY26 Results with 7% Volume Growth Despite Lower Profits",
            "Summary": "Petronet LNG processed 220 TBTU of LNG volumes in Q1 FY26, registering 7% growth compared to 205 TBTU in the previous quarter. However, profit before tax declined to INR1,136 crores from INR1,446 crores in the previous quarter and INR1,520 crores in Q1 FY25. PAT stood at INR851 crores versus INR1,070 crores in the previous quarter. The company's net worth crossed INR20,000 crores, reaching INR20,233 crores. The Board approved an enhanced investment of INR6,355 crores for a 5 MMTPA land-based LNG terminal at Gopalpur Port, Odisha, with a 3-year completion timeline. The company issued an RFP for INR12,000 crores rupee term loan financing. Dahej terminal processed 207 TBTU, showing 10% quarterly growth. The company signed an agreement with Deepak Fertilisers for minimum 0.5 million tons starting May-July 2026. Regasification contribution was INR643 crores with inventory gains of INR42 crores and no trading gains.",
            "Sentiment": "neutral",
            "PublishDate": 1754299955410,
            "Source": "earnings"
        },
        {
            "Title": "Petronet LNG Announces Rs 3 Per Share Final Dividend for FY2024-25 with TDS Guidelines",
            "Summary": "Petronet LNG Limited has announced a final dividend of Rs 3 per share (face value Rs 10) for financial year 2024-25, as recommended by the Board on May 19, 2025, subject to shareholder approval at the 27th Annual General Meeting. The dividend will be paid within 30 days of declaration to shareholders on record as of July 4, 2025. The company has issued detailed guidelines regarding tax deduction at source (TDS) on dividend payments, with rates varying based on shareholder category - 10% for resident individuals (with exemptions for dividends under Rs 10,000 annually), 20% for non-residents (or treaty rates if lower), and specific exemptions for insurance companies, mutual funds, and other institutional investors. Shareholders must submit required documentation by August 23, 2025, to avail applicable exemptions or reduced TDS rates.",
            "Sentiment": "positive",
            "PublishDate": 1753887087867,
            "Source": "corporate_action"
        },
        {
            "Title": "Petronet LNG Confirms Dahej Expansion Completion by December, Operations Expected by March",
            "Summary": "Petronet LNG has confirmed that its Dahej expansion project will be completed by the end of December. The company anticipates that the expanded capacity will become operational between January and March. This update was shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1753683073703,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Reports Mixed Results: Terminal Throughput Rises 10% While Price Gap Hurts Demand",
            "Summary": "Petronet LNG reported a 10% increase in throughput at its Dahej LNG terminal during the April-June quarter. However, the company noted that the gap between long-term and spot LNG prices is negatively impacting overall demand in the market.",
            "Sentiment": "neutral",
            "PublishDate": 1753682706776,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Expects Demand Boost Next Quarter, Sees No Geopolitical Impact on Long-Term Prices",
            "Summary": "Petronet LNG anticipates an increase in demand for the next quarter. The company expects geopolitical risks will not impact long-term LNG prices. These updates were shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1753682276217,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Reports Decline in Q1 Financial Performance",
            "Summary": "Petronet LNG reported quarterly results showing a decline across key financial metrics. Net profit fell to 8.5 billion rupees from 10.7 billion rupees in the previous quarter. Revenue decreased to 118.8 billion rupees compared to 123 billion rupees quarter-on-quarter. EBITDA dropped to 11.6 billion rupees from 15.13 billion rupees, while EBITDA margin compressed to 9.76% from 12.28% in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753662230103,
            "Source": "earnings"
        },
        {
            "Title": "Petronet LNG Board Recommends Akhil Rohtagi & Company as Secretarial Auditors for Five-Year Term",
            "Summary": "Petronet LNG Ltd's Board of Directors has recommended the appointment of M/s Akhil Rohtagi & Company as Secretarial Auditors for a five-year period from FY 2025-26 to 2029-30. The appointment is subject to shareholder approval at the upcoming Annual General Meeting. M/s Akhil Rohtagi & Company is a company secretaries firm with over 30 years of experience, having worked with both private and large-scale public sector companies. The firm has expertise in public issues, company incorporation, secretarial audits, mergers and amalgamations, liquidation of companies, and compliance with DPE guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1753454251664,
            "Source": "corporate_governance"
        },
        {
            "Title": "Petronet LNG Reports Decreased Demand and Updates on Terminal Projects",
            "Summary": "Petronet LNG experienced decreased LNG demand attributed to lower power plant usage and fertilizer plant maintenance shutdowns. The company noted that long-term LNG prices are cheaper than spot rates. The Gopalpur LNG terminal project is estimated to cost 63.5 billion rupees. The Dahej LNG terminal expansion to 22.5 MTPA capacity is expected to be completed by October.",
            "Sentiment": "neutral",
            "PublishDate": 1753453043228,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Secures Approval for ₹63.54 Billion Project Including New Gopalpur Terminal",
            "Summary": "Petronet LNG has received approval for a project valued at ₹63.54 billion. The company has also approved investment for a new 5 MMTPA (Million Metric Tonnes Per Annum) terminal in Gopalpur, which will cost ₹40.49 billion. This expansion represents a significant capital investment in LNG infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1753450938267,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Reports Quarterly Results with Outstanding Use or Pay Dues of Rs. 1,421.56 Crore",
            "Summary": "Petronet LNG Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 11,879.86 crore and profit after tax of Rs. 850.58 crore on a standalone basis. The consolidated profit after tax was Rs. 841.88 crore. A significant highlight is the outstanding Use or Pay (UoP) dues of Rs. 1,421.56 crore gross (Rs. 814.01 crore net after provisions of Rs. 607.55 crore) arising from lower capacity utilization by customers under long-term regasification agreements. These dues span across FY 2022-23 (Rs. 694.29 crore), FY 2023-24 (Rs. 610.00 crore), and FY 2024-25 (Rs. 117.27 crore). The company has implemented recovery mechanisms for UoP dues and obtained bank guarantees from customers to secure recovery. The Board approved these results at a meeting held on July 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753450328001,
            "Source": "earnings"
        },
        {
            "Title": "Petronet LNG Seeks $1.4 Billion Local Loan for Petrochemical Plant and LNG Terminal",
            "Summary": "Petronet LNG Ltd., India's largest natural gas importer, is seeking a loan of at least 120 billion rupees ($1.4 billion) for a new petrochemical plant and LNG terminal. Local lenders including Axis Bank, State Bank of India, and Union Bank of India are considering joining the facility, with SBI Capital Markets appointed as adviser. The loan proceeds will partially fund construction of a petrochemical complex in Dahej, Gujarat, estimated to cost 206.85 billion rupees, helping diversify the company's earnings beyond LNG. The company is also establishing a five million tons land-based LNG import terminal at Gopalpur, Odisha. The loan could carry a tenor of more than 10 years with pricing potentially lower than SBI's current 7.95% lending rate. This represents one of Petronet's largest fundraising exercises and would be among the biggest local currency loans in India this year, occurring during a period when bank lending growth has slowed to 9.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1753285267416,
            "Source": "stock"
        },
        {
            "Title": "Petronet LNG Schedules Q1FY26 Earnings Call",
            "Summary": "Petronet LNG has scheduled its Q1FY26 earnings call for July 28 at 11 AM IST. The company will discuss its quarterly financial results during this call.",
            "Sentiment": "neutral",
            "PublishDate": 1752823890000,
            "Source": "default"
        },
        {
            "Title": "Petronet LNG: Signs ₹1,200 Crore Regasification Deal with Deepak Fertilisers Subsidiary",
            "Summary": "Petronet LNG Ltd has signed a 5.5-year regasification agreement worth ₹1,200 crore with Performance Chemiserve Ltd, a subsidiary of Deepak Fertilisers. The deal involves regasification of 25.6 TBTUs of LNG annually at Petronet's Dahej terminal, starting between May-July 2026 until December 2031.",
            "Sentiment": "positive",
            "PublishDate": 1752140660000,
            "Source": "order&deals"
        },
        {
            "Title": "Petronet LNG: Upgrade on Fair Valuations and Improving Prospects",
            "Summary": "ICICI Securities upgrades Petronet LNG to 'Add' from 'Sell', raising price target to ₹330. Upgrade based on moderate LNG prices, planned Dahej terminal expansion, and expected Kochi-Bengaluru pipeline completion. Stock trades at 9.1x FY28E EPS, with 11% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1751008356000,
            "Source": "normal_news"
        },
        {
            "Title": "Petronet LNG to Release Q1 Results on July 25",
            "Summary": "Petronet LNG has announced that it will release its first quarter results on July 25. The company has not provided any additional details about the expected financial performance or any other information related to the upcoming results.",
            "Sentiment": "neutral",
            "PublishDate": 1750937762000,
            "Source": "default"
        },
        {
            "Title": "Petronet LNG Reports Q4 Net Profit of 10.7 Billion Rupees, Announces Dividend",
            "Summary": "Petronet LNG reported a Q4 net profit of 10.7 billion rupees, up from 8.7 billion rupees in the previous quarter, exceeding estimates of 8.6 billion rupees. Q4 revenue was 123 billion rupees, slightly up from 122 billion rupees in the previous quarter, but below estimates of 134.7 billion rupees. The company recommended a final dividend of 3 rupees per equity share. A company executive stated that the capacity expansion of the Dahej LNG terminal from 17.5 MTPA to 22.5 MTPA will be completed in 3-4 months. Long-term LNG prices are around $10/MBTU, about $1.5 cheaper than spot LNG. The executive noted that Indian markets want LNG prices below $10/MMBTU and expects LNG demand from power plants to increase in June.",
            "Sentiment": "positive",
            "PublishDate": 1747700334000,
            "Source": "default"
        },
        {
            "Title": "Petronet LNG: Q4 Profit Surges 23%, Beats Estimates",
            "Summary": "Petronet LNG Ltd. reported a 23% increase in standalone net profit to Rs 1,070 crore for Q4 FY2025, surpassing analyst estimates. Revenue rose 0.7% to Rs 12,316 crore, while EBITDA grew 21% to Rs 1,513.7 crore. The company declared a final dividend of Rs 3 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747662664000,
            "Source": "earnings"
        },
        {
            "Title": "Petronet LNG Expects Demand Increase and Completes Terminal Expansion",
            "Summary": "Petronet LNG executive states that Indian markets desire LNG prices below $10/MMBTU. The company anticipates increased LNG demand from power plants in June. Petronet LNG is finalizing the capacity expansion of its Dahej LNG terminal from 17.5 MTPA to 22.5 MTPA, expected to complete in 3-4 months. The executive also notes that long-term LNG prices are around $10/MBTU, approximately $1.5 cheaper than spot LNG prices.",
            "Sentiment": "positive",
            "PublishDate": 1747658302000,
            "Source": "default"
        },
        {
            "Title": "Petronet LNG Reports Q4 Results and Announces Dividend",
            "Summary": "Petronet LNG has announced its quarterly results and a dividend. The company's Q4 EBITDA was 15.13 billion rupees, up from 12.5 billion rupees in the previous quarter. The EBITDA margin improved to 12.28% from 10.21% quarter-on-quarter. Net profit for Q4 was 10.7 billion rupees, an increase from 8.7 billion rupees in the previous quarter. Revenue for Q4 was 123 billion rupees, slightly up from 122 billion rupees in the previous quarter. The company has recommended a final dividend of 3 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747656911000,
            "Source": "result"
        },
        {
            "Title": "Petronet LNG to Consider Q4 Results on May 19",
            "Summary": "Petronet LNG Limited has announced that it will consider and approve its financial results for the fourth quarter of the fiscal year on May 19. This announcement indicates the company is preparing to disclose its performance for the last quarter of the financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1746537731000,
            "Source": "default"
        }
    ]
}