{
    "Symbol": "PFC",
    "ISIN": "INE134E01011",
    "News": [
        {
            "Title": "PFC Board Approves Merger with REC Limited",
            "Summary": "Power Finance Corporation's board gives in-principle approval for restructuring merger with REC Limited following Union Budget 2026-27 announcement on public sector NBFC consolidation.",
            "Sentiment": "positive",
            "PublishDate": 1770398878111,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Reports Strong Q3 FY26 Results with 14.7% Profit Growth",
            "Summary": "Power Finance Corporation declares ₹4,763.33 crore net profit for Q3 FY26, up 14.7% YoY. Board approves third interim dividend of ₹4.00 per share with record date February 20, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770300888593,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Transfers Two Subsidiaries for ₹42 Crore",
            "Summary": "Power Finance Corporation completes subsidiary transfers to Power Grid Corporation and Enerica Infra 1 for ₹19.63 crore and ₹22.35 crore respectively in non-related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1770203176111,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Board to Consider 3rd Interim Dividend on Feb 5",
            "Summary": "Power Finance Corporation Limited has scheduled a board meeting on February 5, 2026, to consider the declaration of a 3rd interim dividend for FY 2025-26, following regulatory compliance under Regulation 30.",
            "Sentiment": "positive",
            "PublishDate": 1770039752418,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Block Trade Worth Rs. 19.32 Crores on NSE",
            "Summary": "Power Finance Corporation executed a significant block trade on NSE involving 508,964 shares valued at Rs. 19.32 crores at Rs. 379.55 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769749356773,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Board Meeting Set for Feb 5 to Review Q3FY26 Results",
            "Summary": "Power Finance Corporation Limited has scheduled a board meeting on February 05, 2026, to consider unaudited financial results for Q3FY26. Trading window remains closed until February 07, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769516364975,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Zero Coupon Bonds Offer Tax-Efficient Returns",
            "Summary": "Power Finance Corporation's zero coupon bonds provide 6.95% yield with LTCG tax benefits, offering higher post-tax returns than bank deposits and tax-free bonds. Issue closes January 30.",
            "Sentiment": "positive",
            "PublishDate": 1769043911687,
            "Source": "stocks"
        },
        {
            "Title": "PFC Plans ₹5,000 Cr NCD Issue Opening Jan 16",
            "Summary": "Power Finance Corporation announces largest retail bond issue in 8 years with ₹5,000 crore NCD fundraise offering 7.3% coupon rate for 15-year tenor, opening January 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768275250195,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Plans ₹5,000 Cr Bond Issue at 6.85-7.30% Rate",
            "Summary": "Power Finance Corporation announces public bond issue worth ₹5,000 crore with coupon rates of 6.85-7.30%, opening January 16, 2026, following three withdrawn private placements due to higher yield demands.",
            "Sentiment": "neutral",
            "PublishDate": 1768215423236,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Board Approves ₹5,000 Cr NCD Public Issue",
            "Summary": "Power Finance Corporation's board has approved a public issue of secured NCDs worth up to ₹5,000 crores as part of its broader ₹10,000-crore shelf fundraising program announced on January 12.",
            "Sentiment": "positive",
            "PublishDate": 1768215397961,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Launches ₹5,000 Crore NCD Public Issue",
            "Summary": "Power Finance Corporation announces public issue of secured NCDs worth ₹5,000 crores with base size of ₹500 crores, offering tenors from 5-15 years and yields up to 7.30% across five series.",
            "Sentiment": "positive",
            "PublishDate": 1768057465207,
            "Source": "co_actions_results"
        },
        {
            "Title": "PFC Forms New Subsidiary for Latur Transmission Project",
            "Summary": "Power Finance Corporation establishes Latur Rez Transmission Limited for 400/220/132 kV AIS Latur project and gets appointed as bid coordinator by MSETCL for transmission provider selection process.",
            "Sentiment": "positive",
            "PublishDate": 1765438231033,
            "Source": "stocks"
        },
        {
            "Title": "PFC Establishes New SPV for Power Transmission Project in Siang Basin",
            "Summary": "Power Finance Corporation (PFC) has established a new Special Purpose Vehicle named 'NERGS-III Siang Basin Transmission Ltd.' for developing power transmission projects. The SPV formation indicates PFC's expansion into transmission infrastructure development in the Siang Basin region.",
            "Sentiment": "neutral",
            "PublishDate": 1763727917905,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Finance Corporation Appoints Deepak Jain as Chief Risk Officer",
            "Summary": "Power Finance Corporation Limited has appointed Shri Deepak Jain, Chief General Manager, as Chief Risk Officer for the period from November 1, 2025 to April 15, 2026. The appointment affects the company's risk management leadership structure and has been communicated to stock exchanges for regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1763467016815,
            "Source": "corporate_governance"
        },
        {
            "Title": "PFC Subsidiary Incorporates Raigad Power Transmission Limited for Maharashtra Grid Project",
            "Summary": "PFC Consulting Limited incorporated Raigad Power Transmission Limited as a Special Purpose Vehicle to develop a 765/400/220 KV transmission system at Khandalgaon in Maharashtra's Raigad district. The SPV will handle preparatory activities including land acquisition and forest clearance before being transferred to the successful bidder selected through the competitive bidding process coordinated by MSETCL.",
            "Sentiment": "neutral",
            "PublishDate": 1763373505165,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Finance Corporation Reports 17% Growth in H1 FY26 Profit, Announces Rs 3.65 Interim Dividend",
            "Summary": "Power Finance Corporation reported consolidated profit after tax of Rs 16,816 crores for H1 FY26, marking a 17% year-on-year increase. The company's standalone loan asset book grew 14% to Rs 5,61,210 crores, driven by strong disbursements of Rs 86,000 crores (30% increase from previous half-year). Net profit for the half-year stood at Rs 8,960 crores versus Rs 8,088 crores in H1 FY25. The board declared an interim dividend of Rs 3.65 per share, bringing cumulative interim dividend for FY26 to Rs 7.35 per share. Asset quality improved with gross NPA declining to 1.87% from 2.71% in H1 FY25, while net NPA reached a 10-year low of 0.37%. The company maintained its loan book growth guidance of 10-11% for FY26. PFC entered its first cross-border financing deal in Bhutan worth Rs 4,800 crores for a 600MW hydro power project. The company faced foreign exchange losses of Rs 1,100 crores in H1 FY26 due to Euro appreciation against USD by approximately 8%. Yield for H1 FY26 was 9.98% with cost of funds at 7.43%, maintaining spread at 2.55% and NIM at 3.62%. CRAR stood at 21.62% with tier 1 capital at 19.89%.",
            "Sentiment": "positive",
            "PublishDate": 1762931906068,
            "Source": "earnings"
        },
        {
            "Title": "PFC Shares Drop 3% Despite Moderate Profit Growth in Q2 Results",
            "Summary": "Power Finance Corporation shares declined 2.85% over two trading sessions to Rs 369.60 following Q2 FY26 results. The company reported standalone net profit of Rs 4,462 crore, a 2% year-on-year increase from Rs 4,370 crore, though profit declined 0.9% sequentially from Rs 4,501 crore. Net Interest Income rose 20% year-on-year to Rs 5,290 crore. Total revenue from operations increased 12% year-on-year to Rs 14,755 crore. On consolidated basis, net profit grew 9% year-on-year to Rs 7,834 crore but fell 13% quarter-on-quarter. The company declared a second interim dividend of Rs 3.65 per share with record date November 26, 2025. PFC shares have declined 22.90% over the past year and 17.19% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1762842867460,
            "Source": "earnings"
        },
        {
            "Title": "Alibag Power Transmission Becomes Subsidiary of PFC Consulting",
            "Summary": "Alibag Power Transmission has become a subsidiary of PFC Consulting.",
            "Sentiment": "neutral",
            "PublishDate": 1762777592071,
            "Source": "corporate_action"
        },
        {
            "Title": "PFC Announces Rs 3.65 Per Share Interim Dividend, Reports 2% Rise in Quarterly Net Profit",
            "Summary": "Power Finance Corporation declared its second interim dividend of Rs 3.65 per equity share for FY26, with November 26 as the record date and payment by December 6, 2025. The company reported standalone net profit of Rs 4,462 crore, up 2% year-on-year from Rs 4,370 crore, though down 0.9% sequentially from Rs 4,501 crore. Total revenue from operations increased 12% year-on-year to Rs 14,755 crore and 7% quarter-on-quarter. On consolidated basis, net profit rose 9% year-on-year to Rs 7,834 crore but declined 13% sequentially from Rs 8,981 crore. Consolidated revenue grew 12% year-on-year to Rs 28,901 crore and 1% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762521473314,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Finance Corp Reports 2% Growth in Net Profit to 44.6 Billion Rupees",
            "Summary": "Power Finance Corp reported net profit of 44.6 billion rupees compared to 43.7 billion rupees in the same quarter last year, representing a year-over-year increase. The company's revenue grew to 147.6 billion rupees from 132 billion rupees in the corresponding period of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762507314242,
            "Source": "earnings"
        },
        {
            "Title": "PFC to Announce Q2 Results on November 7, Considers Second Interim Dividend",
            "Summary": "Power Finance Corporation Ltd. (PFC) will announce its second quarter and six months results ended September 30, 2025 on November 7, 2025. The Board of Directors will also consider a proposal for declaration of a second interim dividend for FY 2025-26. An earnings call is scheduled for the same day at 3 p.m. The trading window for designated employees is closed from October 1 to November 9. In the previous quarter, PFC reported a 25.1% year-on-year rise in consolidated net profit to Rs 8,981.45 crore and total revenue increased 15.5% to Rs 28,539.04 crore. PFC shares have declined 3.04% in the past five trading sessions and are down 11.81% year-to-date. The stock hit a 52-week high of Rs 523.90 on December 6, 2024 and a 52-week low of Rs 357.25 on February 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762403583178,
            "Source": "earnings"
        },
        {
            "Title": "Power Finance Corporation to Consider Second Interim Dividend Declaration",
            "Summary": "Power Finance Corporation Limited has announced that its Board of Directors will meet on November 7, 2025, to consider a proposal for declaration of a second interim dividend for FY 2025-26. The company has notified stock exchanges NSE and BSE about this board meeting agenda in compliance with listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1762188548103,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Finance Corporation Executive Director Sanjay Sharma Retires Due to Superannuation",
            "Summary": "Power Finance Corporation Limited announced a change in senior management position. Sanjay Sharma, Executive Director, retired from the Corporation's services on October 31, 2025, upon reaching the age of superannuation. The company informed stock exchanges NSE and BSE about this senior management change in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761907041906,
            "Source": "corporate_governance"
        },
        {
            "Title": "Power Finance Corporation Transfers Subsidiary to Power Grid Corporation for Rs. 198 Crores",
            "Summary": "Power Finance Corporation Limited has transferred its wholly owned subsidiary, Vindhyachal Varanasi Transmission Limited, to Power Grid Corporation of India Limited for Rs. 19,83,77,896 on October 16, 2025. The subsidiary was established for inter-regional transmission system strengthening between Northern and Western regions. The transaction is not a related party transaction as Power Grid Corporation does not belong to the promoter group. The subsidiary contributed negligible amounts to turnover, revenue, income and net worth during the last financial year. The consideration for the transfer was determined according to Ministry of Power guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1760615531492,
            "Source": "order&deals"
        },
        {
            "Title": "Power Finance Corporation Sells Subsidiary to Power Grid Corporation for ₹7.29 Crore",
            "Summary": "Power Finance Corporation has sold its subsidiary Mandsaur I RE Transmission Limited to Power Grid Corporation Of India for ₹7.29 crore. The transaction is structured as neither a related party transaction nor a slump sale.",
            "Sentiment": "neutral",
            "PublishDate": 1759992627216,
            "Source": "order&deals"
        },
        {
            "Title": "PFC Partners With Export Finance Australia And Citi For Clean Energy Funding",
            "Summary": "Power Finance Corporation (PFC) has formed a partnership with Export Finance Australia and Citi to enhance funding support for India's clean energy transition. The collaboration aims to boost financial resources available for clean energy projects in India.",
            "Sentiment": "positive",
            "PublishDate": 1759309438782,
            "Source": "order&deals"
        },
        {
            "Title": "PFC Establishes New SPV for Power Transmission Project Development",
            "Summary": "Power Finance Corporation (PFC) has incorporated a Special Purpose Vehicle named 'South Kalamb Power Transmission Limited' under PFCCL. The SPV has been established for transmission scheme development purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1759232456526,
            "Source": "stock"
        },
        {
            "Title": "Khorlochhu Hydro Power Ltd Secures ₹4,829 Crore Loan from Power Finance Corporation",
            "Summary": "Khorlochhu Hydro Power Ltd has signed a loan agreement worth ₹4,829 crore with Power Finance Corporation (PFC). The deal represents a significant financing arrangement between the hydro power company and the state-owned financial institution.",
            "Sentiment": "positive",
            "PublishDate": 1759130289226,
            "Source": "order&deals"
        },
        {
            "Title": "Power Finance Corporation Incorporates TUMKUR II RE TRANSMISSION LIMITED for Renewable Energy Transmission Project",
            "Summary": "Power Finance Corporation Limited announced the incorporation of TUMKUR II RE TRANSMISSION LIMITED as a wholly owned subsidiary of PFC Consulting Limited. The Special Purpose Vehicle was created to develop a transmission system strengthening project at Tumkur-II for integration of additional renewable energy potential of 1.5 GW. The Ministry of Power appointed PFC Consulting Limited as Bid Process Coordinator to select a Transmission Service Provider through a competitive bidding process. The SPV will handle preparatory activities including surveys, land acquisition processes, and forest clearance initiatives. Upon completion of the bidding process, the SPV will be transferred to the successful bidder who will then develop the transmission project.",
            "Sentiment": "positive",
            "PublishDate": 1758798105006,
            "Source": "corporate_action"
        },
        {
            "Title": "Germany Discusses Green Hydrogen and Green Financing with India",
            "Summary": "External Affairs Minister Jaishankar stated that Germany has engaged in discussions about green hydrogen and green financing. The statement was made in relation to Power Finance Corporation (PFC).",
            "Sentiment": "positive",
            "PublishDate": 1756889314701,
            "Source": "stock"
        },
        {
            "Title": "PFC Signs ₹3,500 Crore Loan Agreement with JBIC for Clean Energy Projects",
            "Summary": "Power Finance Corporation and Japan Bank for International Cooperation signed a loan agreement worth 60 billion Japanese Yen (approximately ₹3,500 crore) to finance clean energy projects in India. The financing falls under JBIC's Global Action for Reconciling Economic Growth and Environmental Preservation initiative, with co-financing support from Sumitomo Mitsui Banking Corporation and other Japanese banks. The loan agreement was signed in Tokyo by PFC CMD Parminder Chopra and JBIC Governor Nobumitsu Hayashi. Part of the funding will support establishing Assam Bio Ethanol Pvt Ltd's second-generation bio-ethanol and chemicals plant in Assam, which uses bamboo as feedstock. Power Finance Corporation is India's largest government-owned non-banking financial company by asset size and operates under the Ministry of Power as the principal financial institution for India's power sector.",
            "Sentiment": "positive",
            "PublishDate": 1756477760435,
            "Source": "order&deals"
        },
        {
            "Title": "PFC Establishes New Subsidiary for Power Grid Strengthening Project",
            "Summary": "Power Finance Corporation (PFC) has incorporated a wholly owned subsidiary named 'SR AND ER Power Transmission Ltd.' The new subsidiary will focus on an Inter-Regional Grid Strengthening Project.",
            "Sentiment": "positive",
            "PublishDate": 1755868602700,
            "Source": "stock"
        },
        {
            "Title": "PFC Sets Monday as Dividend Record Date; Multiple Companies Follow Same Timeline",
            "Summary": "Power Finance Corporation (PFC) has set Monday, August 18, 2025, as the record date for its dividend payout, making the preceding day the final opportunity for investors to purchase shares for eligibility. Several other companies share the same August 18 record date, including Aarti Industries (20% final dividend at Re 1 per share), Bright Brothers (25% final dividend at Rs 2.5 per share), DHP India (40% final dividend at Rs 4 per share), JK Paper (50% final dividend at Rs 5 per share), and Lakshmi Electrical Control Systems (40% final dividend at Rs 4 per share). The record date determines which shareholders qualify for the declared dividend, with investors needing to buy shares before the ex-dividend date to secure eligibility.",
            "Sentiment": "neutral",
            "PublishDate": 1755140642863,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Finance Corporation Announces Book Closure for 39th Annual General Meeting",
            "Summary": "Power Finance Corporation Limited has announced that its Register of Members and Share Transfer books will remain closed from August 19, 2025 to August 28, 2025 for the company's 39th Annual General Meeting. The AGM is scheduled for August 28, 2025 at 11:00 AM through video conferencing. The company has set August 22, 2025 as the cut-off date for determining voting rights of shareholders. E-voting will be available from August 25, 2025 at 9:00 AM to August 27, 2025 at 5:00 PM for all agenda items.",
            "Sentiment": "neutral",
            "PublishDate": 1754499197938,
            "Source": "corporate_action"
        },
        {
            "Title": "PFC Reports 25% Jump in Net Profit to Rs 8,981 Crore, Declares Interim Dividend",
            "Summary": "Power Finance Corporation Ltd (PFC) reported net profit of Rs 8,981.45 crore for the quarter ended June 30, 2025, marking a 25% increase from Rs 7,182.06 crore in the same period last year. Revenue from operations rose 15.5% to Rs 28,539.04 crore compared to Rs 24,716.76 crore previously. The company declared an interim dividend of Rs 3.70 per share. Total expenses increased 10% to Rs 17,429.93 crore from Rs 15,843.01 crore. Key financial metrics include earnings per share of Rs 20.81, operating margin of 38.93%, net profit margin of 31.37%, debt-equity ratio of 5.98, and net worth of Rs 1,22,994.30 crore. The gross credit impaired assets ratio stood at 1.47% while net credit impaired assets ratio was 0.31%. PFC shares traded flat at Rs 414.20 on BSE following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1754478145822,
            "Source": "earnings"
        },
        {
            "Title": "Power Finance Corporation Reports Rs 4,501.50 Crore Profit for Q1 FY2026, Declares Rs 3.70 Interim Dividend",
            "Summary": "Power Finance Corporation Ltd. reported unaudited standalone net profit of Rs 4,501.50 crore for the quarter ended June 30, 2025, compared to Rs 3,717.88 crore in the same quarter last year. Total income increased to Rs 13,776.78 crore from Rs 11,916.24 crore year-on-year. The company declared an interim dividend of Rs 3.70 per equity share (37%) for FY 2025-26, with record date set as August 18, 2025, and payment by September 5, 2025. On consolidated basis, the group reported net profit of Rs 8,981.45 crore versus Rs 7,182.06 crore in the previous year quarter. Interest income on standalone basis grew to Rs 13,738.89 crore from Rs 11,827.03 crore. The company's earnings per share stood at Rs 13.64 for the quarter. Finance costs increased to Rs 8,269.73 crore from Rs 7,500.48 crore year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1754466846885,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Finance Corp Reports 16% Revenue Growth in Q1",
            "Summary": "Power Finance Corp reported quarterly revenue of 138 billion rupees, representing a year-over-year increase from 119 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754466261343,
            "Source": "earnings"
        },
        {
            "Title": "Power Finance Corp Reports 22% Jump in Net Profit to 45 Billion Rupees",
            "Summary": "Power Finance Corp announced net profit of 45 billion rupees for the first quarter, representing a year-on-year increase from 37 billion rupees in the same period last year. The company's quarterly earnings showed growth of approximately 8 billion rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754465669786,
            "Source": "earnings"
        },
        {
            "Title": "PFC to Announce Q1 FY26 Results on August 6, Board to Consider Interim Dividend",
            "Summary": "Power Finance Corporation Ltd. (PFC), a Maharatna public sector undertaking under the Ministry of Power, will announce its financial results for the first quarter of FY26 on August 6. The Board of Directors will consider unaudited standalone and consolidated financial results for the quarter ended June 2025, along with a proposal for interim dividend declaration. The company has closed its trading window from July 1 until August 8 for equity shares and listed debt securities. In Q4 FY25, PFC reported strong performance with total income rising 19.4% to Rs 13,721.47 crore and net profit increasing 24% to Rs 5,108.9 crore. PFC shares have gained 1.25% over the past five trading sessions but declined 8.54% year-to-date and 17.68% over the past year. The stock hit a 52-week high of Rs 566.4 and a 52-week low of Rs 357.25.",
            "Sentiment": "neutral",
            "PublishDate": 1754287943614,
            "Source": "earnings"
        },
        {
            "Title": "Power Finance Corporation Schedules Board Meeting for Q1 Results and Interim Dividend Consideration",
            "Summary": "Power Finance Corporation Limited has scheduled a Board of Directors meeting on August 06, 2025 to consider the unaudited financial results (standalone & consolidated) for the quarter ended June 30, 2025. The Board will also consider a proposal relating to the declaration of interim dividend for FY 2025-26. The trading window for the company's equity shares and listed debt securities remains closed from July 01, 2025 to August 08, 2025, and will reopen on August 09, 2025. All designated persons and their immediate relatives have been advised not to deal in PFC's securities during this closure period.",
            "Sentiment": "neutral",
            "PublishDate": 1753864357557,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Finance Corporation Transfers Subsidiary Angul Sundargarh Transmission Limited to H.G. Infra Engineering for Rs. 8.16 Crore",
            "Summary": "Power Finance Corporation Limited has completed the transfer of its wholly owned subsidiary, Angul Sundargarh Transmission Limited, to H.G. Infra Engineering Limited for Rs. 8,16,49,841 on July 28, 2025. The subsidiary was established for the development of the Eastern Region Generation Scheme-I. H.G. Infra Engineering Limited was the successful bidder and does not belong to the promoter or promoter group. The transaction is not classified as a related party transaction or slump sale. The consideration for the transfer was determined according to guidelines issued by the Ministry of Power, Government of India. The subsidiary's contribution to Power Finance Corporation's turnover, revenue, and net worth during the last financial year was negligible.",
            "Sentiment": "neutral",
            "PublishDate": 1753775467710,
            "Source": "order&deals"
        },
        {
            "Title": "Power Finance Corporation Transfers Two Transmission Subsidiaries to Private Bidders",
            "Summary": "Power Finance Corporation Limited completed the transfer of two wholly owned subsidiaries on July 23, 2025. Raghanesda RE Transmission Limited, established for developing transmission systems for renewable energy evacuation from Gujarat's Raghanesda area (3 GW under Phase-I), was transferred to Dineshchandra R. Agrawal Infracon Private Limited for Rs. 10,13,67,677. NER Expansion Transmission Limited, established for the North-Eastern Region Expansion Scheme-XXV Part-A, was transferred to Resonia Limited for Rs. 12,99,97,631. Both subsidiaries were originally owned by PFC Consulting Limited, a wholly owned subsidiary of Power Finance Corporation. The buyers do not belong to the promoter or promoter group, and the transactions do not fall under related party transactions. The consideration was determined according to Ministry of Power guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1753351661171,
            "Source": "order&deals"
        },
        {
            "Title": "Power Finance Corporation Ltd. Sees Block Trade of Rs. 65.57 Crores",
            "Summary": "A significant block trade has occurred for Power Finance Corporation Ltd. on the National Stock Exchange (NSE). The trade involved approximately 1,536,912 shares, valued at Rs. 65.57 crores. The per-share price for this transaction was Rs. 426.65.",
            "Sentiment": "neutral",
            "PublishDate": 1752123221000,
            "Source": "block_details"
        },
        {
            "Title": "PFC Establishes Subsidiary 'Saswad Transmission Limited' for Maharashtra Power Project",
            "Summary": "Power Finance Corporation (PFC) has established a new subsidiary called 'Saswad Transmission Limited'. This subsidiary is aimed at developing a power project in Maharashtra. The news indicates PFC's expansion into power transmission infrastructure development in the state.",
            "Sentiment": "positive",
            "PublishDate": 1750076496000,
            "Source": "default"
        },
        {
            "Title": "PFC Creates SPV 'Wagdari Transmission Limited' for Maharashtra Power Project",
            "Summary": "Power Finance Corporation (PFC) has established a Special Purpose Vehicle (SPV) named 'Wagdari Transmission Limited' to implement a 400/220 KV transmission project in Maharashtra. The project will be executed through a tariff-based competitive bidding process.",
            "Sentiment": "neutral",
            "PublishDate": 1749902086000,
            "Source": "default"
        },
        {
            "Title": "Power Finance Corp: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "June 13 is the record date for Power Finance Corp's dividend. The company has recommended a final dividend of Rs 2.05 per equity share for FY 2025, subject to shareholder approval. PFC's Q4 net profit increased 24% year-on-year to Rs 5,108.90 crore, with total income up 19.4% to Rs 13,721.47 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749694917000,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Finance Corporation: Q4 PAT Grows 24% YoY, Beats Estimates",
            "Summary": "Power Finance Corporation reported Q4 FY25 PAT of Rs 51.1 billion, up 24% YoY and 17% above estimates. FY25 PAT increased 20% YoY to Rs 173.5 billion. The earnings beat was mainly due to a Rs 12 billion interest income write-back from KSK Mahanadi resolution.",
            "Sentiment": "positive",
            "PublishDate": 1747889693000,
            "Source": "earnings"
        },
        {
            "Title": "PFC Revises Loan Growth Guidance Downward",
            "Summary": "PFC (Power Finance Corporation) has revised its loan growth guidance downward to 10-11% from the previous 14-15%. This indicates a reduction in the company's expected loan growth for the period.",
            "Sentiment": "negative",
            "PublishDate": 1747819251000,
            "Source": "default"
        },
        {
            "Title": "Power Finance Corporation: Q4 Profit Rises 11%, Declares Final Dividend",
            "Summary": "Power Finance Corporation reported a consolidated net profit of ₹8,358 crore for Q4 FY25, up 11% year-over-year. Net Interest Income increased 41% to ₹12,681 crore. The company declared a final dividend of ₹2.05 per share for FY25, with the record date set as June 13, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1747814143000,
            "Source": "earnings"
        },
        {
            "Title": "Power Finance Corp Reports Q4 Results and Dividend Declaration",
            "Summary": "Power Finance Corp has announced its quarterly results and a dividend declaration. The company's Q4 revenue increased to 149 billion rupees from 122 billion rupees year-over-year. The standalone net profit for Q4 rose to 51.1 billion rupees from 41.3 billion rupees in the same period last year. Additionally, the company has declared a dividend of 2.05 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747813384000,
            "Source": "result"
        }
    ]
}