{
    "Symbol": "PFIZER",
    "ISIN": "INE182A01018",
    "News": [
        {
            "Title": "5 Stocks Trading Below 5-Year Average PE Ratios",
            "Summary": "IRB Infrastructure, Pfizer, Jyoti CNC, HBL Engineering, and Anant Raj are trading at P/E ratios 28-61 versus their 5-year averages of 32-84, suggesting potential undervaluation opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1769348423472,
            "Source": "stocks"
        },
        {
            "Title": "Pfizer Limited Announces Senior Management Changes",
            "Summary": "Pfizer Limited announces key senior management changes effective February 1, 2026, including appointment of Nilesh Pendse as Category Lead – Vaccines and organizational restructuring across business divisions.",
            "Sentiment": "neutral",
            "PublishDate": 1768881959505,
            "Source": "stocks"
        },
        {
            "Title": "Pfizer Faces ₹8.79 Cr GST Demand from West Bengal",
            "Summary": "Pfizer Limited receives significantly higher GST demand order of ₹8.79 crores from West Bengal authorities for FY2018-23, plans to appeal against the order citing it as non-maintainable.",
            "Sentiment": "negative",
            "PublishDate": 1766581669836,
            "Source": "stocks"
        },
        {
            "Title": "Pfizer Limited Senior Management Personnel Change",
            "Summary": "Ms. Aditi Mehta, Category Lead-Vaccines at Pfizer Limited, has resigned from her position effective January 2, 2026, to pursue opportunities outside the company.",
            "Sentiment": "neutral",
            "PublishDate": 1766478163310,
            "Source": "stocks"
        },
        {
            "Title": "Pfizer Ltd Shares Worth Rs 100.37 Crores Traded in NSE Block Deal",
            "Summary": "Pfizer Ltd witnessed a block trade on NSE involving 200,949 shares at Rs 4,995 per share, totaling Rs 100.37 crores. The transaction represents a significant institutional or bulk investor activity in the pharmaceutical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1764064096714,
            "Source": "order&deals"
        },
        {
            "Title": "Pfizer Reports Strong Q2 Performance with 19.6% Revenue Growth",
            "Summary": "Pfizer delivered robust quarterly results with net profit rising to 1.89 billion rupees from 1.58 billion rupees year-over-year. Revenue increased to 6.42 billion rupees compared to 5.89 billion rupees in the same period last year. EBITDA grew to 2.3 billion rupees from 1.89 billion rupees, while EBITDA margin expanded to 35.8% from 32.15% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762943918769,
            "Source": "earnings"
        },
        {
            "Title": "Pfizer Announces Multiple Drug Development Updates Including Phase 3 Vaccine Trials and FDA Approval",
            "Summary": "Pfizer announced several key developments in its drug pipeline. The company will launch Phase 3 trials for its 25-valent pneumococcal vaccine in 2026. Additionally, Pfizer received FDA approval to restart enrollment for Osivelotor studies targeting sickle cell disease outside Sub-Saharan Africa. The pharmaceutical company also indicated it plans to provide its 2026 forecast by late 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762401060322,
            "Source": "global"
        },
        {
            "Title": "Pfizer CEO Announces Domestic Medicine Production Focus, Receives Three-Year Tariff Grace Period",
            "Summary": "Pfizer Inc's CEO confirmed the company will concentrate on producing medicines domestically in the United States. The pharmaceutical company has been granted a three-year grace period from 232 tariffs, which will allow it to avoid these trade-related costs during this transition period.",
            "Sentiment": "positive",
            "PublishDate": 1759249357693,
            "Source": "global"
        },
        {
            "Title": "Pfizer Announces $70 Billion Investment in Research and Domestic Production, Plans Direct-to-Consumer Drug Sales Platform",
            "Summary": "Pfizer Inc announced a $70 billion investment focused on research and domestic production. The pharmaceutical company also revealed plans to launch a direct-to-consumer drug sales platform called Trumprx that will offer discounted medications.",
            "Sentiment": "positive",
            "PublishDate": 1759242525503,
            "Source": "global"
        },
        {
            "Title": "Pfizer Reports Strong Q1 Results with 27% Jump in Net Profit",
            "Summary": "Pfizer delivered robust quarterly performance with net profit rising to 1.9 billion rupees from 1.5 billion rupees year-over-year. Revenue grew to 6 billion rupees compared to 5.6 billion rupees in the same period last year. The company's EBITDA increased to 2.1 billion rupees from 1.8 billion rupees, while EBITDA margin expanded to 34.83% from 31.62% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1755086447956,
            "Source": "earnings"
        },
        {
            "Title": "Pfizer Launches 20-Valent Pneumococcal Conjugate Vaccine for Adults in India",
            "Summary": "Pfizer has introduced a 20-valent pneumococcal conjugate vaccine for adults in the Indian market. The vaccine is designed to provide broad protection against pneumococcal illness.",
            "Sentiment": "positive",
            "PublishDate": 1754920855910,
            "Source": "global"
        },
        {
            "Title": "Pfizer Limited Schedules Board Meeting on August 13 to Approve Quarterly Financial Results",
            "Summary": "Pfizer Limited has scheduled a Board of Directors meeting on August 13, 2025 to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company has closed its trading window for insiders from June 30, 2025 until 48 hours after the results are made public on August 13, 2025, in accordance with insider trading regulations and the company's internal code of conduct.",
            "Sentiment": "neutral",
            "PublishDate": 1754572962972,
            "Source": "corporate_action"
        },
        {
            "Title": "Pfizer: Q4 Profit Soars 85%, Stock Surges 12%",
            "Summary": "Pfizer's Q4 net profit jumped 85% to Rs 330.94 crore, with revenue up 8.3% to Rs 591.91 crore. EBITDA rose 20% to Rs 227.50 crore, with margin expanding to 38.4%. The company announced a final dividend of Rs 35 per share. Stock price surged over 12% to Rs 4,990.",
            "Sentiment": "positive",
            "PublishDate": 1747720839000,
            "Source": "earnings"
        },
        {
            "Title": "Pfizer Ltd: Shares Surge 11% on Record Dividend Announcement",
            "Summary": "Pfizer Ltd's shares rose 11% after announcing Q1 results and a total dividend of ₹165 per share, its highest payout in 12 years. The company reported 8% revenue growth and 20% EBITDA increase year-on-year. The dividend includes a special payout for the company's 75th anniversary in India.",
            "Sentiment": "positive",
            "PublishDate": 1747714465000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pfizer Announces Dividends and Q4 Financial Results",
            "Summary": "Pfizer has recommended a final dividend of 35 rupees per equity share, along with special dividends of 100 rupees and 30 rupees per equity share. For Q4, the company reported revenue of 5.92 billion rupees, up from 5.47 billion year-over-year. EBITDA increased to 2.28 billion rupees from 1.89 billion, with EBITDA margin improving to 38.43% from 34.65%. Profit before tax (PBT) rose to 2.53 billion rupees from 2.44 billion. The company also reported an exceptional item of 1.73 billion rupees. Net profit for Q4 significantly increased to 3.31 billion rupees, compared to 1.79 billion year-over-year and 1.28 billion quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747675795000,
            "Source": "result"
        },
        {
            "Title": "Pfizer Ltd: Share Price Surges on Marketing Pact with Mylan Pharmaceuticals",
            "Summary": "Pfizer Ltd's shares rose over 8% after signing a 5-year sales and marketing agreement with Mylan Pharmaceuticals for two CNS therapy brands, Ativan and Pacitane, in India. This comes despite Pfizer reporting a 2% drop in Q3 net profit to Rs 127.6 crore and a marginal 0.4% decrease in revenue to Rs 538 crore.",
            "Sentiment": "positive",
            "PublishDate": 1740379531000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pfizer Ltd Enters Marketing and Supply Agreement with Mylan Pharmaceuticals",
            "Summary": "Pfizer Ltd has announced a marketing and supply agreement with Mylan Pharmaceuticals for the sale of two of Pfizer's brands. This agreement likely involves Mylan taking over the marketing and distribution of these Pfizer products, potentially expanding their reach or improving supply chain efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1740127190000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pfizer: Diversity Fellowship Program Revised After Legal Challenge",
            "Summary": "Pfizer has resolved a lawsuit by conservative group Do No Harm, which alleged discrimination in its diversity fellowship program. The company will stop accepting new fellows and has opened the program to all applicants regardless of race. This settlement follows a recent appeals court decision that revived the case.",
            "Sentiment": "neutral",
            "PublishDate": 1738362152000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pfizer Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Pfizer's Q3 EBITDA decreased to 1.4 billion rupees from 1.52 billion rupees year-over-year. The company's EBITDA margin also declined to 26.77% from 28.25% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738323760000,
            "Source": "earnings"
        },
        {
            "Title": "Pfizer Reports Q3 Financial Results",
            "Summary": "Pfizer announced its Q3 financial results. The company reported a net profit of 1.27 billion rupees, compared to 1.3 billion rupees year-over-year and 1.6 billion rupees quarter-over-quarter. Revenue for Q3 remained stable at 5.4 billion rupees, unchanged from the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738323714000,
            "Source": "earnings"
        },
        {
            "Title": "Pfizer: Q2 Results Show Subdued Growth, Awaiting New Drug Pipeline",
            "Summary": "Pfizer's Q2 results indicate subdued growth. The company is awaiting commercialization of its New Chemical Entity (NCE) pipeline. Systematix has reviewed the results, suggesting a period of modest performance as Pfizer looks to future drug developments for growth.",
            "Sentiment": "neutral",
            "PublishDate": 1730713055000,
            "Source": "result"
        },
        {
            "Title": "Pfizer Reports Q2 EBITDA Growth and Margin Improvement",
            "Summary": "Pfizer announced its Q2 financial results, showing an increase in EBITDA to 1.9 billion rupees from 1.8 billion rupees year-over-year. The company also improved its EBITDA margin to 32.09% from 31.61% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730122573000,
            "Source": "result"
        },
        {
            "Title": "Pfizer Reports Q2 2023 Financial Results",
            "Summary": "Pfizer has announced its financial results for the second quarter of 2023. The company reported a net profit of 1.6 billion rupees, showing an increase from 1.48 billion rupees year-over-year and 1.5 billion rupees quarter-over-quarter. Revenue for Q2 stood at 5.9 billion rupees, up from 5.75 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730122527000,
            "Source": "result"
        },
        {
            "Title": "Pfizer: Activist Investor Starboard Value Takes $1 Billion Stake",
            "Summary": "<p><span class='neutral'>Activist investor</span> Starboard Value has acquired a <span class='positive'>$1 billion stake</span> in Pfizer, seeking changes to <span class='positive'>improve performance</span>. Starboard has approached <b>former Pfizer executives Ian Read and Frank D'Amelio</b> for assistance. Pfizer faces <span class='negative'>challenges</span> with <span class='negative'>falling COVID-19 product sales</span> and <span class='negative'>competition</span> for key drugs. The company recently warned of potential <span class='negative'>revenue decline</span> and announced <span class='neutral'>cost-cutting measures</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728263072000,
            "Source": "normal_news"
        }
    ]
}