{
    "Symbol": "PFOCUS",
    "ISIN": "INE367G01038",
    "News": [
        {
            "Title": "Prime Focus Shareholders Approve Director Appointments",
            "Summary": "Prime Focus Limited shareholders approved three director appointments through postal ballot on February 06, 2026, with overwhelming support exceeding 99% for all resolutions.",
            "Sentiment": "positive",
            "PublishDate": 1770387677094,
            "Source": "stocks"
        },
        {
            "Title": "Prime Focus submits Q3FY26 monitoring report",
            "Summary": "Prime Focus Limited submitted its quarterly monitoring agency report for Q3FY26 under SEBI regulations, covering utilization of Rs. 5,552.02 crore preferential issue proceeds with Rs. 175.40 crore invested during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1770212633277,
            "Source": "stocks"
        },
        {
            "Title": "Prime Focus Authorizes KMPs for Regulatory Disclosures",
            "Summary": "Prime Focus Limited's board authorized three Key Managerial Personnel to determine materiality and disclose events to stock exchanges under SEBI regulations during January 27, 2026 meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1769538181934,
            "Source": "stocks"
        },
        {
            "Title": "Prime Focus Q3FY26: Revenue up 34%, profit ₹13.64 cr",
            "Summary": "Prime Focus Limited reported strong Q3FY26 consolidated results with revenue rising 34% YoY to ₹1,212.13 crores and net profit of ₹136.40 crores, marking a turnaround from previous year's loss.",
            "Sentiment": "positive",
            "PublishDate": 1769536303205,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prime Focus Stock Surges 86% Amid Ramayana Project Buzz",
            "Summary": "Prime Focus shares rally 86% in one year despite 18% decline in Nifty Media Index, driven by profit turnaround, improved cash flows, and expectations from ₹4,000 crore Ramayana project.",
            "Sentiment": "positive",
            "PublishDate": 1769179937102,
            "Source": "stocks"
        },
        {
            "Title": "Prime Focus Board Meeting Set for January 23, 2026",
            "Summary": "Prime Focus Limited has scheduled a board meeting on January 23, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768916975981,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prime Focus Subsidiary Launches AI Unit in Abu Dhabi",
            "Summary": "Prime Focus announces that its indirect subsidiary has established a wholly-owned artificial intelligence unit in Abu Dhabi, marking the company's expansion into AI services in the Middle East region.",
            "Sentiment": "positive",
            "PublishDate": 1767019822975,
            "Source": "stocks"
        },
        {
            "Title": "Prime Focus Forms AI Subsidiary in UAE Market",
            "Summary": "Prime Focus Limited announces incorporation of Brahma AI ME Ltd, a wholly-owned subsidiary in Abu Dhabi Global Market focused on AI business in UAE with USD 1.00 initial subscription.",
            "Sentiment": "positive",
            "PublishDate": 1767019089879,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prime Focus completes PF Studio divestment to DNEG",
            "Summary": "Prime Focus Limited has successfully transferred its entire equity shareholding in wholly-owned subsidiary Prime Focus Studios Private Limited to material subsidiary DNEG S.a.r.l. with effect from December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765811680208,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prime Focus Completes Brahma AI Divestment to DNEG",
            "Summary": "Prime Focus Limited has successfully completed the divestment of its entire equity shareholding in Brahma AI India Technologies Private Limited to DNEG S.a.r.l., effective December 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765381114925,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prime Focus Clarifies ₹5,552 Crore Strategic Acquisition News Already Disclosed",
            "Summary": "Prime Focus Limited responded to BSE regarding news about a ₹5,552 crore cash-plus-share-swap preferential issue, clarifying that this transaction was already announced on July 3, 2025 and concluded on November 19, 2025. The company stated it has kept stock exchanges informed at various stages as required under listing regulations and is unaware of reasons for recent share price/volume movements.",
            "Sentiment": "neutral",
            "PublishDate": 1765364423758,
            "Source": "stock"
        },
        {
            "Title": "Prime Focus Limited Receives Trading Approval for 46.27 Crore Preferential Equity Shares",
            "Summary": "Prime Focus Limited has received trading approval from BSE and NSE for 46,26,68,572 equity shares of Re. 1/- each issued at a premium of Rs. 119/- on a preferential basis to promoter and non-promoter categories. The shares are listed and admitted for trading on both exchanges effective from November 20, 2025, with distinctive numbers from 312830977 to 775499548.",
            "Sentiment": "positive",
            "PublishDate": 1763568904203,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Submits Monitoring Report for Rs. 5,552 Crore Preferential Issue",
            "Summary": "Prime Focus Limited submitted its monitoring agency report for the quarter ended September 30, 2025, covering the utilization of Rs. 5,552.02 crore raised through preferential equity issue. The company completed a share swap transaction by allotting equity shares to investors for acquisition of DNEG S.a.r.l. shares and invested Rs. 390.51 crore of unutilized proceeds in liquid mutual funds.",
            "Sentiment": "neutral",
            "PublishDate": 1763066395157,
            "Source": "earnings"
        },
        {
            "Title": "Prime Focus Limited Appoints New CFO and Expands Board with Two New Directors",
            "Summary": "Prime Focus Limited announced key leadership changes with the appointment of Ms. Shalini Govil-Pai as Independent Director and Mr. Nishant Fadia as Non-Executive Director. Mr. Vikas Rathee has been appointed as Chief Financial Officer. Mr. Fadia stepped down from his CFO position after 25 years with the company to join the board. Mr. Rathee, who previously served as CFO from 2014-2018, will continue as CFO of DNEG, the company's principal operating subsidiary. Co-founder Mr. Merzin Tavaria resigned from the board but will continue as President of Global Production and Operations at DNEG India Media Services Limited. The company also allotted 393,999 equity shares under its ESOP scheme, increasing paid-up share capital from Rs. 77,55,96,548 to Rs. 77,59,90,547.",
            "Sentiment": "positive",
            "PublishDate": 1762998735987,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Q2 Net Profit Drops 89% to 36 Million Rupees Despite Revenue Growth",
            "Summary": "Prime Focus reported quarterly net profit of 36 million rupees compared to 334 million rupees in the same period last year. Revenue increased to 10.43 billion rupees from 8.85 billion rupees year-over-year. EBITDA declined to 2.54 billion rupees from 3.32 billion rupees, while EBITDA margin compressed to 24.35% from 37.52% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762965454895,
            "Source": "earnings"
        },
        {
            "Title": "PrimeFocus Limited Receives Listing Approval for 46.27 Crore Equity Shares on Preferential Basis",
            "Summary": "PrimeFocus Limited has received listing approval from both BSE and NSE for 46,26,68,572 fully paid-up equity shares of Re. 1/- each allotted on a preferential basis. BSE granted approval on November 3, 2025, while NSE provided approval on November 4, 2025. The shares were issued at a premium of Rs. 119/- and bear distinctive numbers from 312830977 to 775499548. The shares were allotted to both promoter and non-promoter categories. Trading approval will be granted only after the company files confirmation letters from NSDL/CDSL about crediting the shares to respective beneficiary accounts and admitting the capital to the depository system.",
            "Sentiment": "positive",
            "PublishDate": 1762273548654,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Limited Shareholders Approve Key Leadership and Auditor Appointments at 28th AGM",
            "Summary": "Prime Focus Limited shareholders approved two key appointments at their 28th Annual General Meeting held on September 30, 2025. The company re-appointed Mr. Naresh Malhotra as Chairman and Whole-Time Director for a three-year term from May 1, 2026 to April 30, 2029. Shareholders also appointed M/s. D M Zaveri & Co. as Secretarial Auditors for a five-year term covering financial years 2025-26 to 2029-30. Mr. Malhotra, a promoter of the company, is described as a pioneer in the Indian Media and Entertainment industry, known for producing the film Shahenshah and establishing India's first digital audio studio. D M Zaveri & Co. is a firm of practicing company secretaries with over 24 years of experience specializing in corporate laws, secretarial audits, and compliance services.",
            "Sentiment": "neutral",
            "PublishDate": 1759245939259,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prime Focus Schedules Board Meeting to Discuss DNEG Minority Investor Exit Strategy",
            "Summary": "Prime Focus will hold a board meeting on October 3, 2025, to discuss an exit strategy for a minority investor in DNEG. The meeting is specifically focused on addressing the departure arrangements for this minority stakeholder in the subsidiary company.",
            "Sentiment": "neutral",
            "PublishDate": 1759160066838,
            "Source": "corporate_action"
        },
        {
            "Title": "A2R Holdings Acquires 10.24 Crore Equity Shares in Prime Focus Limited Through Preferential Allotment",
            "Summary": "A2R Holdings acquired 10,24,47,901 equity shares of Prime Focus Limited on September 23, 2025, through a preferential allotment for consideration other than cash. The acquisition increased A2R Holdings' shareholding from 52.87% to 53.27%. A2R Holdings belongs to the promoter group of Prime Focus Limited, with persons acting in concert including Mr. Namit Malhotra and Mr. Naresh Malhotra. Prime Focus Limited's total equity share capital expanded from 58,75,59,017 shares to 77,54,99,548 shares following the allotment. The allotment also included 8,54,92,630 equity shares to non-promoter allottees, resulting in the overall promoter and promoter group shareholding decreasing from 62.82% to 60.80%. Prime Focus Limited shares are listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758861098364,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Allots 18.79 Crore Equity Shares at INR 120 Each, Increases DNEG Stake to 88.28%",
            "Summary": "Prime Focus Limited allotted 18,79,40,531 equity shares at INR 120 per share on September 23, 2025, raising INR 2,255.29 crores through preferential allotment. The allotment included promoter A2R Holdings receiving 10.24 crore shares and six non-promoter entities receiving the remaining shares. The company's paid-up share capital increased from INR 58.76 crores to INR 77.55 crores. Through this transaction and a related party deal, Prime Focus acquired an additional 12.53% direct stake in step-down subsidiary DNEG, while its subsidiary PF World Limited acquired 1.03% from A2R Holdings. The combined transactions increased Prime Focus's total shareholding in DNEG to 88.28%. DNEG, a Luxembourg-based visual effects and animation company, reported USD 425.7 million in turnover and USD 935.9 million in total assets. The allotment received shareholder approval in July 2025 and regulatory approvals from BSE and NSE in September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758655252253,
            "Source": "corporate_action"
        },
        {
            "Title": "A2R Holdings Acquires 15.95 Crore Shares in Prime Focus Limited Through Preferential Allotment",
            "Summary": "A2R Holdings acquired 15,95,37,479 equity shares of Prime Focus Limited on September 17, 2025, through a preferential allotment. The acquisition increased A2R Holdings' stake in Prime Focus from 48.75% to 52.87%. The shares were allotted at Re. 1/- each as consideration other than cash through a share swap arrangement. A2R Holdings belongs to the promoter group of Prime Focus Limited, with Mr. Namit Malhotra and Mr. Naresh Malhotra acting as persons in concert. Prime Focus Limited's total equity share capital increased from 30,99,36,976 shares to 58,75,59,017 shares after the allotment. The allotment also included 11,51,90,562 equity shares to non-promoter allottees, resulting in the overall promoter group shareholding decreasing from 67.61% to 62.82%. Prime Focus Limited is listed on both NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758516451217,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Allots 274.7 Million Equity Shares at INR 120 Per Share Through Preferential Issue",
            "Summary": "Prime Focus Limited allotted 27,47,28,041 equity shares at INR 120 per share to 11 investors through preferential allotment. The allotment includes promoter A2R Holdings receiving 15.95 crore shares and non-promoter Novator Capital Limited receiving 9.70 crore shares, among others. The total consideration value amounts to INR 32,967,364,920. Following this allotment, the company's paid-up equity share capital increased from INR 30.99 crore to INR 58.47 crore. The allotment was conducted through a combination of share swap and fund raising, with the company acquiring 18.52% stake in DNEG directly, increasing its total shareholding in DNEG to 74.72%. Post-allotment, A2R Holdings' stake increased to 53.13% while Novator Capital Limited holds 16.58% of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758120994997,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Limited Receives In-Principle Approval for 46.27 Crore Equity Shares Preferential Issue",
            "Summary": "Prime Focus Limited has received in-principle approval from BSE and NSE for the issuance of 46,26,68,572 equity shares of Re. 1/- each on a preferential basis to promoter and non-promoter categories. BSE granted approval on September 11, 2025, while NSE provided approval on September 12, 2025. The BSE approval covers 430,124,822 equity shares at a minimum price of Rs. 120/- to promoters and non-promoters through share swap, plus 32,543,750 equity shares at a minimum price of Rs. 120/- to non-promoters. Both exchanges have specified conditions including compliance with regulatory requirements, obtaining statutory approvals, strengthening internal controls to monitor allottee trading, and filing listing applications within specified timeframes. The exchanges reserve the right to withdraw approval if information is found incomplete or incorrect.",
            "Sentiment": "positive",
            "PublishDate": 1757675344235,
            "Source": "corporate_action"
        },
        {
            "Title": "Augusta Investments and Associates Reduce Stake in Prime Focus Limited to 11.30%",
            "Summary": "Augusta Investments I Pte. Ltd. and its associated entities sold shares in Prime Focus Limited through open market transactions on September 8, 2025. The group, consisting of Augusta Investments I Pte. Ltd., Marina IV (Singapore) Pte. Ltd., Marina Horizon (Singapore) Pte. Ltd., and Augusta Investments Zero Pte. Ltd., disposed of 12 million shares representing 3.87% of the company's voting capital. Their combined shareholding decreased from 15.17% to 11.30% of Prime Focus Limited's total voting capital. The transaction involved shares worth INR 1 each, with Prime Focus Limited's equity share capital remaining at 309,936,976 shares. All entities are Singapore-based investment companies acting in concert, with Ivo Philipps serving as director and authorized signatory for all four entities.",
            "Sentiment": "neutral",
            "PublishDate": 1757402344199,
            "Source": "corporate_action"
        },
        {
            "Title": "Market Veterans Ramesh Damani, Utpal Sheth, and Madhu Kela's Fund Acquire Prime Focus Shares in Block Deal",
            "Summary": "Several prominent market veterans purchased Prime Focus shares in a block deal on Friday. Ramesh Damani acquired 8 lakh shares at ₹142.55 per share, while Utpal Sheth bought 17.5 lakh shares at the same price. Singlarity Large Value Fund I, owned by Madhusudan Kela, purchased 62.5 lakh shares. The sellers included Augusta Investments I Pte. Ltd. (54.4 lakh shares), Marina IV (Singapore) Pte. Ltd. (38.9 lakh shares), and Marina IV LP (9.15 lakh shares). None of these buyers had prior stakes in Prime Focus as per June shareholding data. Prime Focus has a market capitalization of ₹4,900 crore, with promoters holding 67.6% stake as of June. Augusta Investments I Pte. Ltd. previously held 8.86% stake while Marina IV (Singapore) Pte. Ltd. held 7.55%. Prime Focus shares closed at ₹158.37 on Friday, hitting a 10% upper circuit, and have gained 13% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757288510647,
            "Source": "order&deals"
        },
        {
            "Title": "Ramesh Damani, Madhu Kela-owned Singularity AMC Acquire 3.3% Stake in Prime Focus for ₹146.2 Crore",
            "Summary": "Five investors including Ramesh Damani, Madhusudan Kela-owned Singularity AMC, and Utpal Sheth acquired a combined 3.3% stake in Prime Focus Ltd for ₹146.2 crore through block deals. Singularity Large Value Fund I, II and III purchased 62.5 lakh shares (2.01% stake) at ₹142.55 per share, while Ramesh Damani and Utpal Sheth bought 8 lakh and 17.5 lakh shares respectively at the same price. Prime Focus shares closed with a 10% upper circuit at ₹158.37. On the selling side, Marina IV (Singapore) sold 48.06 lakh shares (1.55% stake) and Augusta Investments I offloaded 54.48 lakh shares (1.75% stake). Additionally, Tourism Finance Corporation of India's Non-Executive Director Aditya Kumar Halwasiya acquired 12 lakh shares totaling 1.29% stake worth ₹41.49 crore, while promoter entity Auv Innovations LLP acquired 50 lakh shares (0.8% stake) in Zee Media Corporation at ₹12.37 per share.",
            "Sentiment": "positive",
            "PublishDate": 1757092025159,
            "Source": "order&deals"
        },
        {
            "Title": "Marina IV L.P. and Associates Reduce Stake in Prime Focus Limited by 2.51%",
            "Summary": "Marina IV L.P. and its four associated entities sold 7,789,590 shares of Prime Focus Limited through open market transactions between June 20, 2025 and September 4, 2025. The collective stake of Marina IV L.P. and its persons acting in concert decreased from 21.23% to 18.71% of the company's total share capital. The seller group includes Marina IV L.P. as the primary seller and four Singapore-based entities: Marina IV (Singapore) Pte. Ltd., Marina Horizon (Singapore) Pte. Ltd., Augusta Investments Zero Pte. Ltd., and Augusta Investments I Pte. Ltd. The entities are not part of Prime Focus Limited's promoter group. Prime Focus Limited shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1757062211268,
            "Source": "stock"
        },
        {
            "Title": "Prime Focus Shares Surge 10% to Upper Circuit Following Block Deal Activity",
            "Summary": "Prime Focus shares hit the 10% upper circuit limit at Rs 158.10 on BSE following a block deal involving 47.5 lakh shares representing a 1.53% equity stake. The visual effects company, backed by actor Ranbir Kapoor who reportedly invested Rs 15-20 crore through a preferential share issue, is one of the production houses for the upcoming Ramayana movie. The company had approved issuance of over 46 crore shares with Kapoor among proposed allottees for about 12.5 lakh shares. Prime Focus, founded by Namit Malhotra in 1997, operates subsidiary Double Negative which has won eight Academy Awards for films including TENET and Dune. The stock has gained 60.21% over six months and 36.06% over three months, though declined 1.62% in the past month.",
            "Sentiment": "positive",
            "PublishDate": 1757056578026,
            "Source": "stock"
        },
        {
            "Title": "Prime Focus Limited Clarifies Preferential Share Issue Details and Corrects Valuation Report",
            "Summary": "Prime Focus Limited provided clarifications regarding its proposed preferential issue of equity shares. The company confirmed that while shareholder approval was obtained for issuing up to 46,26,69,444 equity shares, the actual number to be issued is 46,26,68,572 shares, which falls within the approved limit. The company also corrected an error in the valuation report dated July 3, 2025, where the price per share of the target company under the asset approach was incorrectly mentioned as ₹338.55 instead of ₹329.31 per share. However, since the weightage for asset approach is nil, this correction does not impact the fair value of the target company or affect the swap ratio and number of equity shares to be issued. These clarifications were made following discussions with stock exchanges NSE and BSE regarding the company's applications for in-principle approval for the preferential issue.",
            "Sentiment": "neutral",
            "PublishDate": 1755873538985,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Shares Surge 10% After Swinging to Rs 110.47 Crore Profit in Q1",
            "Summary": "Prime Focus shares hit their 10% upper circuit after the visual effects company reported a net profit of Rs 110.47 crore in Q1FY26, compared to a net loss of Rs 158.07 crore in the same quarter last year. Revenue from operations increased 22.8% year-on-year to Rs 976.82 crore. The company also posted quarterly profit versus a loss of Rs 251.62 crore in the previous quarter. The stock has rallied 63.2% over the last three months, with additional momentum from reports that Bollywood actor Ranbir Kapoor invested around Rs 15 crore by acquiring 12.5 lakh shares at Rs 120 each through a preferential equity issuance. Prime Focus is the post-production company behind the upcoming film Ramayana, starring Kapoor, scheduled for release in two parts during Diwali 2026 and 2027. The company owns Double Negative (DNEG), a visual effects studio that has worked on Hollywood films and earned eight Academy Awards.",
            "Sentiment": "positive",
            "PublishDate": 1755159617867,
            "Source": "stock"
        },
        {
            "Title": "Prime Focus Limited Reports Q1 FY26 Results, Appoints New Internal Auditor and Approves Director Re-appointment",
            "Summary": "Prime Focus Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of Rs 696.33 lakhs and a net loss of Rs 535.45 lakhs. On consolidated basis, revenue from operations stood at Rs 9,768.21 lakhs with a net profit of Rs 1,104.69 lakhs. The Board appointed M/s. Shridhar & Associates as Internal Auditors for FY 2025-26 and approved the re-appointment of Mr. Naresh Mahendranath Malhotra as Chairman and Whole-Time Director for three years from May 1, 2026, subject to shareholder approval. The Board also approved Monsoon Studio Private Limited's reclassification from promoter group to public category, pending stock exchange approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1755097058812,
            "Source": "earnings"
        },
        {
            "Title": "Prime Focus Reports Strong Q1 Performance with 618.5M Rupees Net Profit",
            "Summary": "Prime Focus delivered strong quarterly results with net profit of 618.5 million rupees compared to a loss of 1.2 billion rupees in the same period last year. Revenue increased to 9.76 billion rupees from 7.95 billion rupees year-over-year. EBITDA surged to 3.65 billion rupees from 873 million rupees, while EBITDA margin expanded significantly to 37.36% from 10.97% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755093032258,
            "Source": "earnings"
        },
        {
            "Title": "Monsoon Studio Seeks Reclassification from Promoter Group to Public Category at Prime Focus",
            "Summary": "Monsoon Studio Private Limited has requested reclassification from the Promoter Group category to the Public category at Prime Focus Limited. The request was received on August 12, 2025. Monsoon Studio currently holds 0 shares (0% shareholding) in Prime Focus. Prime Focus will undertake necessary steps in compliance with SEBI regulations for this reclassification process.",
            "Sentiment": "neutral",
            "PublishDate": 1755075271699,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Limited Issues Corrigendum for Preferential Share Issue Worth ₹5,552 Crore",
            "Summary": "Prime Focus Limited has issued a corrigendum to its Extra-Ordinary General Meeting notice scheduled for July 26, 2025, correcting clerical errors in share numbers for a proposed preferential issue. The company plans to issue up to 46.27 crore equity shares at ₹120 per share, raising ₹5,552 crore through both cash and share swap arrangements. The issue includes ₹391 crore in cash from 10 allottees and ₹5,161 crore through share swap with 7 allottees to acquire 31.05% stake in subsidiary DNEG S.a.r.l. This will increase Prime Focus's indirect holding in DNEG from 56.20% to 87.25%. The e-voting period has been revised to July 23-25, 2025. Proceeds will be used for further investment in DNEG consolidation, business expansion, and general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1753158361764,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Plans ₹5,552 Crore Share Issue to Increase DNEG Stake to 87.25%",
            "Summary": "Prime Focus plans to raise ₹5,552 crores through new share issuance. The company aims to increase its stake in DNEG by 31.05% through a share swap arrangement, which would bring its total holding to 87.25%. Prime Focus has stated its goal of achieving complete ownership of DNEG.",
            "Sentiment": "positive",
            "PublishDate": 1753117036919,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Ltd: Strategic DNEG Acquisition Boosts Stake to 88.28%",
            "Summary": "Prime Focus Ltd. to acquire an additional 31.05% stake in DNEG through preferential allotment, increasing total ownership to 88.28%. The company will issue 46.26 crore shares at Rs 120 per share, raising over Rs 5,552 crore. An EGM is scheduled for July 26, 2025, to seek shareholder approval. Novator Capital Ltd. will become a minority shareholder with a 14.40% stake in Prime Focus post-issue.",
            "Sentiment": "positive",
            "PublishDate": 1751624002000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Approves ₹5,552 Crore Share Allotment and DNEG Stake Purchase",
            "Summary": "Prime Focus has announced two significant corporate actions. The company's board has approved a share allotment worth ₹5,552 crore. Additionally, Prime Focus has made a strategic decision to purchase a stake in DNEG. These moves suggest substantial financial activity and potential expansion for the company.",
            "Sentiment": "positive",
            "PublishDate": 1751560519000,
            "Source": "default"
        },
        {
            "Title": "Prime Focus to Discuss Fundraising via Preferential Issue",
            "Summary": "Prime Focus Limited has announced that its board of directors will meet on July 3rd to discuss fundraising through a preferential issue of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1751296092000,
            "Source": "default"
        },
        {
            "Title": "Prime Focus Announces New US Subsidiary for AI Services",
            "Summary": "Prime Focus has announced the formation of a new subsidiary, Brahma AI Services USA Inc, through its step-down subsidiary Brahma AI Holdings Limited. This move suggests an expansion of the company's AI services into the United States market.",
            "Sentiment": "positive",
            "PublishDate": 1750862391000,
            "Source": "default"
        },
        {
            "Title": "Prime Focus Reports Improved Q4 Financial Results",
            "Summary": "Prime Focus has reported its Q4 financial results. The company had an exceptional item of 3.8 billion rupees. Q4 profit before tax (PBT) was 1.2 billion rupees, compared to a loss of 1.15 billion rupees in the same quarter last year. Q4 EBITDA increased to 2.3 billion rupees from 416 million rupees year-over-year. The EBITDA margin improved to 24% from 4.82% in the corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748360380000,
            "Source": "result"
        },
        {
            "Title": "Prime Focus Reports Increased Q4 Loss and Revenue",
            "Summary": "Prime Focus has reported its Q4 financial results. The company's consolidated net loss widened to 2.3 billion rupees, compared to a loss of 603.5 million rupees in the same quarter last year. Sequentially, the loss increased from 602 million rupees in the previous quarter. However, Q4 revenue improved to 9.7 billion rupees from 8.63 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748360199000,
            "Source": "result"
        },
        {
            "Title": "Prime Focus to Invest ₹3000 Crore in Mumbai Entertainment Ecosystem",
            "Summary": "Prime Focus has signed a Memorandum of Understanding (MoU) with the Government of Maharashtra to develop a new global entertainment ecosystem in Mumbai. The proposed investment is approximately ₹3000 crore (about $400 million USD) and will focus on infrastructure development in the city.",
            "Sentiment": "positive",
            "PublishDate": 1746403541000,
            "Source": "default"
        },
        {
            "Title": "Prime Focus to Invest ₹3000 Crore in Mumbai Entertainment Ecosystem",
            "Summary": "Prime Focus has signed a Memorandum of Understanding (MoU) with the Government of Maharashtra to develop a new global entertainment ecosystem in Mumbai. The proposed investment is approximately ₹3000 crore (about $400 million USD) for infrastructure development in the city.",
            "Sentiment": "positive",
            "PublishDate": 1746189905000,
            "Source": "default"
        },
        {
            "Title": "Brahma Acquires Metaphysic, Valuation Reaches $1.43B",
            "Summary": "Brahma has announced the acquisition of Metaphysic to enhance its AI-native product suite development. Following this transaction, Brahma's valuation has reached $1.43 billion. Additionally, UASG will collaborate with the DNEG Group to invest a further $25 million into Brahma.",
            "Sentiment": "positive",
            "PublishDate": 1739935517000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Reports Q3 Financial Results",
            "Summary": "Prime Focus announced its Q3 consolidated financial results. The company reported a net loss of 602 million rupees, compared to a loss of 553 million rupees in the same quarter last year. However, it showed improvement from the previous quarter with a profit of 334 million rupees. Q3 revenue increased to 8.9 billion rupees from 8.4 billion rupees year-over-year. The company also reported other income of 1 billion rupees and employee benefits expense of 6.35 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1739233335000,
            "Source": "earnings"
        },
        {
            "Title": "Prime Focus Reports Other Income and Employee Benefits Expense",
            "Summary": "Prime Focus has reported other income of 1 billion and employee benefits expense of 6.35 billion. This financial update provides insight into the company's revenue sources and operational costs.",
            "Sentiment": "neutral",
            "PublishDate": 1739198152000,
            "Source": "earnings"
        },
        {
            "Title": "Prime Focus Reports Q3 Financial Results",
            "Summary": "Prime Focus Limited has announced its financial results for the third quarter. The company reported a consolidated net loss of 602 million rupees, compared to a loss of 553 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter, where the company posted a profit of 334 million rupees. Revenue for Q3 increased to 8.9 billion rupees from 8.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739191546000,
            "Source": "earnings"
        },
        {
            "Title": "Prime Focus to Consider Q3 Results",
            "Summary": "Prime Focus Limited has announced that it will be considering its financial results for the third quarter on February 10th. This indicates the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1738592251000,
            "Source": "earnings"
        },
        {
            "Title": "Prime Focus Subsidiary DNEG UK Incorporates New Entity Brahma AI Holdings",
            "Summary": "Prime Focus has announced that its subsidiary DNEG UK has incorporated a new entity called Brahma AI Holdings. This suggests a potential expansion or restructuring within the company's artificial intelligence operations.",
            "Sentiment": "neutral",
            "PublishDate": 1734704857000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Focus Reports Q2 EBITDA Improvement",
            "Summary": "Prime Focus has reported a significant turnaround in its Q2 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company achieved an EBITDA gain of 2 billion rupees, compared to a loss of 69 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731594753000,
            "Source": "result"
        }
    ]
}