{
    "Symbol": "PFS",
    "ISIN": "INE560K01014",
    "News": [
        {
            "Title": "PTC India Financial Services Q3FY26 Results",
            "Summary": "PTC India Financial Services reported Q3FY26 net profit of ₹49.09 crores with total income of ₹125.04 crores. Board approved appointment of new independent director.",
            "Sentiment": "positive",
            "PublishDate": 1768917503488,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC India Financial Services Q3 FY26 Call Jan 21",
            "Summary": "PTC India Financial Services Limited announces earnings call on January 21, 2026 at 10:00 AM IST to discuss Q3 and 9M FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768302443654,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC India Financial Services Appoints Two Independent Directors",
            "Summary": "PTC India Financial Services Limited successfully completes postal ballot voting for appointment of Smt. Mini Ipe and Smt. Rashmi Verma as Independent Directors with overwhelming shareholder approval of 99.89% and 99.94% respectively.",
            "Sentiment": "positive",
            "PublishDate": 1767364238283,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC India Financial Services Seeks Shareholder Approval for Two Independent Director Appointments",
            "Summary": "PTC India Financial Services has issued a postal ballot notice seeking member consent for appointing Smt. Mini Ipe and Smt. Rashmi Verma as Independent Directors for 3-year terms. The remote e-voting process runs from December 4, 2025 to January 2, 2026, with results to be declared by January 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764745779120,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Financial Services Appoints Rashmi Verma as Independent Director",
            "Summary": "PTC India Financial Services' Board approved the appointment of Smt. Rashmi Verma as Additional Independent Director for 3 years effective November 24, 2025, subject to shareholder approval. The company will seek shareholder approval through postal ballot for appointments of both Rashmi Verma and Mini Ipe as Non-Executive Independent Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1763973893186,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Financial Services Reports Strong Q2 Sanctions at INR1,048 Crores Despite Lower Disbursements",
            "Summary": "PTC India Financial Services Limited reported quarterly results with loan sanctions of INR1,048 crores and disbursements of INR326 crores. The company achieved its highest sanction numbers in 10 quarters, with 100% disbursements in the private sector. Gross Stage III assets reduced by 75% over the past year to INR193 crores, with net Stage III down 83% to INR47 crores. The Vento Power account was resolved through management change with Enviro Infra Engineers for INR115.6 crores. Revenue stood at INR132 crores with PAT of INR88 crores. Net worth improved to INR2,978 crores from INR2,754 crores in March 2025. Cost of borrowing decreased to 9.49% from 9.67%. Gross NPA reduced to 5.23% from 10.22%, while net NPA fell to 1.32% from 4.13%. Three Independent Directors resigned on September 26, with Ms. Mini Ipe appointed as replacement. The company revised full-year disbursement guidance to INR2,500-3,000 crores from earlier projections. Management expects to resolve the remaining Danu Wind account for INR220-230 crores recovery.",
            "Sentiment": "positive",
            "PublishDate": 1761558431270,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Financial Services Reports Strong Q2 Performance with 278% Profit Growth",
            "Summary": "PTC India Financial Services Limited reported quarterly results for the period ended September 30, 2025, showing significant improvement in financial performance. The company's profit after tax surged to ₹88.14 crore for the quarter compared to ₹24.02 crore in the same period last year. For the six-month period, profit after tax reached ₹224.77 crore versus ₹63.41 crore in the previous year. Total income for the quarter stood at ₹131.86 crore. The company successfully resolved non-performing assets, receiving ₹25 crore from NSL Nagapatnam Power and Infratech Limited and ₹115.61 crore from Vento Power Infra Private Limited. The company also upgraded IL&FS Tamilnadu Power Co. Limited to standard category following regulatory approval. PTC India Financial Services maintains a capital adequacy ratio of 62.63% and a net worth of ₹2,978.16 crore as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761227258333,
            "Source": "earnings"
        },
        {
            "Title": "PTC Financial Services CEO Addresses Board Resignations, Outlines Four-Pillar Transformation Strategy",
            "Summary": "PTC Financial Services CEO R Balaji responded to questions about three independent directors' resignations, stating he was unaware of any issues they cited and that board meetings proceeded harmoniously. The departing directors had claimed functioning impartially was difficult, but Balaji emphasized the company maintains one of the most independent boards in the country. He confirmed ongoing communication with the former directors who raised unspecified concerns. Despite the resignations, four independent directors remain on the board. Balaji outlined the company's transformation strategy built on four pillars: improving systems and processes, building institutional capability, broadening employee talent, and creating a more granular book to withstand economic shocks. The CEO noted that non-retail holding has increased, indicating confidence in the transformation plan, and management remains confident in ongoing efforts and investor support.",
            "Sentiment": "neutral",
            "PublishDate": 1759233045756,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Financial Services Reports Sudden Resignation of Three Independent Directors",
            "Summary": "PTC India Financial Services announced the unexpected resignation of three independent directors. The company expressed surprise at the departures, noting that these directors had not previously raised any concerns with management or the board before their resignation.",
            "Sentiment": "negative",
            "PublishDate": 1759148473587,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Financial Services Appoints Avijit Kishore as Senior Management Personnel",
            "Summary": "PTC India Financial Services Limited appointed Shri Avijit Kishore as Senior Management Personnel, effective September 9, 2025. The appointment was approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee. Kishore brings 19 years of experience in the BFSI sector with expertise across multiple asset classes including microfinance, SME lending, supply chain finance, agri lending, NBFC lending, and securitization. He previously held senior leadership positions at Mahindra Finance, where he led NBFC Lending, SME Lending, and partnerships. His earlier experience includes roles at Jana Small Finance Bank, Axis Bank, and Bharat Financial Inclusion Limited. Kishore holds a Post Graduate Diploma in Forestry Management with specializations in Microfinance, Rural Marketing & Livelihoods from Indian Institute of Forest Management, Bhopal, and a Bachelor's degree in Economics Honours from Patna University.",
            "Sentiment": "positive",
            "PublishDate": 1757399884277,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Financial Services Resolves ₹115.6 Crore Debt Through Vento Power Management Transfer",
            "Summary": "PTC India Financial Services has completed a debt resolution worth ₹115.6 crore related to Vento Power Infra. The resolution was achieved through transferring management control of Vento Power Infra to EIE Renewables.",
            "Sentiment": "positive",
            "PublishDate": 1755692601766,
            "Source": "stock"
        },
        {
            "Title": "PTC India Financial Services Faces Rs 6.4 Lakh Penalty as Regional Director Dismisses Appeals",
            "Summary": "PTC India Financial Services Ltd received orders from the Regional Director dismissing all three appeals against Show Cause Notices issued by the Registrar of Companies. The company must pay penalties totaling Rs 6.40 lakh for violations during FY 2021-22. The violations include failing to facilitate Independent Directors in seeking professional legal advice (Rs 70,000 penalty), delays in sharing documents with Independent Directors for legal opinion (Rs 70,000 penalty), and failure to maintain prescribed composition of the Nomination and Remuneration Committee (Rs 5 lakh penalty). The company states there is no material impact on operations except for the penalty amount, for which provisions have already been created in the books of accounts.",
            "Sentiment": "negative",
            "PublishDate": 1755084340001,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Financial Services Appoints Sanjeev Kumar as Whole Time Director (Operations)",
            "Summary": "PTC India Financial Services Limited has appointed Sanjeev Kumar as Whole Time Director designated as Director (Operations) for a period of 5 years or until his superannuation, effective from June 10, 2025. The appointment was approved by shareholders at the 19th Annual General Meeting held on August 6, 2025. Kumar brings over 30 years of experience in banking and finance, including expertise in retail, corporate, construction and infrastructure finance. He previously served as Chief Executive Officer with IIFCL Projects Limited and has worked with leading institutions including SBI, ICICI Bank, and IIFCL. He also worked for more than 5 years with NHAI as General Manager (Finance) and holds qualifications as a CMA and CAIIB. Kumar is not related to any other Director or Key Managerial Personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1754490344087,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Financial Services Reports 38% Resolution of Gross Stage 3 Assets in Q1 FY26",
            "Summary": "PTC India Financial Services achieved significant progress in resolving stressed assets, with 38% of Gross Stage 3 assets resolved in Q1 FY26. The company successfully closed three major cases - NSL (INR125 crores recovered), Vento (INR115 crores), and IL&FS (upgraded to Standard). Gross Stage 3 assets improved from 15% to 10.22%, while Net Stage 3 reduced from 6.56% to 4.13%. PAT increased to INR137 crores from INR58 crores in the previous quarter. However, total income declined to INR142 crores from INR155 crores due to reduced AUM size. The company disbursed INR138 crores in Q1, entirely to private sector entities, compared to INR296 crores for the entire previous financial year. Management strengthened with new appointments including Director-Operations, Business Head SME, and CIO. The company maintains its annual disbursement target of INR4,000 crores and expects to make up Q1 shortfall in Q2, targeting INR1,000-1,200 crores disbursement in Q2.",
            "Sentiment": "positive",
            "PublishDate": 1754376626134,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Financial Targets ₹1,000 Crore Disbursements by FY26 Through Private Infrastructure Lending",
            "Summary": "PTC India Financial expects steady growth driven by private infrastructure lending and projects disbursements exceeding ₹1,000 crore by FY26. The company is focusing on ESG assets while working to resolve old stressed assets, aiming for improved returns and increased net interest margins.",
            "Sentiment": "positive",
            "PublishDate": 1753896147989,
            "Source": "stock"
        },
        {
            "Title": "PTC India Financial Services Reports 208% Jump in Q1 FY26 PAT to ₹137 Crore",
            "Summary": "PTC India Financial Services Limited reported a profit after tax of ₹137 crore for the quarter ended June 30, 2025, representing a 208% increase compared to ₹44 crore in the same quarter last year. Total income declined 12% to ₹142 crore from ₹161 crore year-over-year. The company's loan assets decreased to ₹4,313 crore from ₹5,581 crore in the previous year quarter. Disbursements fell 76% to ₹138 crore compared to ₹566 crore in the prior year. The infrastructure finance company reported no new slippages during the quarter, with all loan accounts disbursed since FY18 classified as standard. Gross Stage III assets improved to ₹441 crore from ₹767 crore year-over-year. Return on assets increased significantly to 9.77% from 2.77% in the previous year quarter. The company recovered ₹125 crore under the NSL Nagapattinam resolution plan and received investment grade rating upgrade for IL&FS Tamil Nadu Power Company. Capital adequacy ratio stood at 64.96% compared to 41.39% in the prior year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753895089575,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Financial Services Reports Strong Q1 Performance with 136.63 Crore Net Profit",
            "Summary": "PTC India Financial Services Limited reported net profit of Rs 136.63 crore for the quarter ended June 30, 2025, compared to Rs 44.40 crore in the same quarter last year. Total revenue from operations decreased to Rs 141.91 crore from Rs 161.21 crore year-over-year. Interest income declined to Rs 136.65 crore from Rs 159.65 crore in the previous year quarter. The company benefited from a reversal in impairment on financial instruments of Rs 81.59 crore compared to an expense of Rs 4.77 crore last year. Basic earnings per share increased to Rs 2.13 from Rs 0.69. The company received Rs 125 crore from NSL Nagapatnam Power resolution and issued a Letter of Intent for Vento Power Infra resolution worth Rs 115.61 crore. The company upgraded IL&FS Tamilnadu Power Co. Limited to standard category following regulatory approval. PTC India Financial Services maintains a capital adequacy ratio of 64.96% and gross stage 3 ratio of 10.22%.",
            "Sentiment": "positive",
            "PublishDate": 1753886125070,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Financial Services Reports 208% Jump in Quarterly Net Profit",
            "Summary": "PTC India Financial Services reported a net profit of 1.37 billion rupees for the quarter, representing a significant increase from 444 million rupees in the same period last year. However, the company's revenue declined to 1.4 billion rupees compared to 1.63 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753885673956,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Financial Services Issues LOI to Resolve Vento Power Debt",
            "Summary": "PTC India Financial Services has issued a Letter of Intent to Enviro Infra Engineers, the highest bidder, to resolve Vento Power's debt of ₹116 Crore. This action is aimed at addressing the outstanding debt owed by Vento Power.",
            "Sentiment": "positive",
            "PublishDate": 1750751220000,
            "Source": "default"
        },
        {
            "Title": "PTC India Financial Services Receives Full Share of 1.25 Billion Rupees from Resolution Plan",
            "Summary": "PTC India Financial Services has received its full share of 1.25 billion rupees as part of an approved resolution plan. No further details about the resolution plan or its context were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748866191000,
            "Source": "default"
        },
        {
            "Title": "PTC India Financial Services Reports Significant Profit Increase in Q4",
            "Summary": "PTC India Financial Services has announced its Q4 financial results. The company's consolidated net profit rose to 582 million rupees, up from 138 million rupees in the same quarter last year. However, revenue decreased to 1.5 billion rupees from 1.76 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746853960000,
            "Source": "result"
        },
        {
            "Title": "PTC India Financial Services Reports Q3 FY24 Financial Results",
            "Summary": "PTC India Financial Services has announced its Q3 FY24 consolidated financial results. The company reported a net profit of 671.5 million rupees, showing an increase from 504 million rupees year-over-year and 473.4 million rupees quarter-over-quarter. However, revenue for Q3 decreased to 1.58 billion rupees from 2 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738109912000,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Financial Services Reports Q3 Revenue Decline",
            "Summary": "PTC India Financial Services has reported a revenue of 1.58 billion rupees for the third quarter, marking a decrease from 2 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738062853000,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Financial Services Reports Q3 Profit Increase",
            "Summary": "PTC India Financial Services has reported a consolidated net profit of 671.5 million rupees for the third quarter. This represents a year-over-year increase from 504 million rupees and a quarter-over-quarter increase from 473.4 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738062845000,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Financial Services Reports Q2 FY24 Results",
            "Summary": "PTC India Financial Services announced its Q2 FY24 financial results. The company reported a consolidated net profit of 473 million rupees, down from 598 million rupees year-over-year and up from 444 million rupees quarter-over-quarter. Interest income for Q2 stood at 1.6 billion rupees, compared to 1.88 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730122962000,
            "Source": "result"
        }
    ]
}