{
    "Symbol": "PGEL",
    "ISIN": "INE457L01029",
    "News": [
        {
            "Title": "PG Electroplast Plans INR 700-750 Crores Capex",
            "Summary": "PG Electroplast announces capital expenditure plans of INR 700-750 crores focusing on facilities across Greater Noida, Supa, Rajasthan, and Sri City with Q4 typically delivering highest performance.",
            "Sentiment": "positive",
            "PublishDate": 1770175225721,
            "Source": "stocks"
        },
        {
            "Title": "PG Electroplast Reiterates Previous Quarter Guidance",
            "Summary": "PG Electroplast management confirms adherence to guidance provided in the last quarter during recent conference call discussions with stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1770097221351,
            "Source": "stocks"
        },
        {
            "Title": "PG Electroplast Allots 24,000 Shares Under ESOP",
            "Summary": "PG Electroplast Limited allotted 24,000 equity shares under its Employee Stock Option Scheme 2020, increasing paid-up capital to Rs. 28,53,42,658 divided into 28,53,42,658 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1770036719906,
            "Source": "co_actions_results"
        },
        {
            "Title": "PG Electroplast Q3 Net Profit Surges 57% to ₹620M",
            "Summary": "PG Electroplast reports strong Q3 performance with consolidated net profit rising 57% YoY to ₹620 million, while revenue jumped 45% to ₹14 billion compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770035517483,
            "Source": "co_actions_results"
        },
        {
            "Title": "PG Electroplast Board Meet on Feb 2 for Q3FY26 Results",
            "Summary": "PG Electroplast Limited has scheduled its board meeting for February 2, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until February 4, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769249997170,
            "Source": "co_actions_results"
        },
        {
            "Title": "PG Electroplast Acquires 72-Acre Land in Maharashtra",
            "Summary": "PG Electroplast Limited through its step-down subsidiary Next Generation Manufacturers Private Limited has completed acquisition of 72-acre land parcel in Kamargaon, Ahilyanagar, Maharashtra as part of ₹1,000 crore greenfield project expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769154401227,
            "Source": "stocks"
        },
        {
            "Title": "PG Electroplast shares fall 11th straight day",
            "Summary": "PG Electroplast shares declined 3% on Wednesday, extending losses for 11 consecutive sessions - the longest streak in trading history. Retail investors trimmed stakes while mutual funds increased holdings.",
            "Sentiment": "negative",
            "PublishDate": 1768979647404,
            "Source": "stocks"
        },
        {
            "Title": "PG Electroplast Allots 3.54 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "PG Electroplast Limited allotted 3,54,500 equity shares of Rs. 1/- each to PG Electroplast Limited Employees Welfare Trust under the company's Employee Stock Options Scheme-2020. The allotment increased the company's paid-up equity share capital from Rs. 28,49,64,158/- to Rs. 28,53,18,658/-, divided into 28,53,18,658 equity shares of face value Rs. 1/- each.",
            "Sentiment": "neutral",
            "PublishDate": 1765366110732,
            "Source": "corporate_action"
        },
        {
            "Title": "PG Electroplast Addresses Inaccurate Financial Health Article on HDFC Sky Platform",
            "Summary": "PG Electroplast Limited informed stock exchanges that HDFC Securities removed an article titled 'PG Electroplast in Limelight After Red Flags in Financial Health Raise Warnings' from their platform on December 8, 2025, after the company requested rectification of inaccuracies. HDFC Securities acknowledged unintentional glitches in the article and offered sincere apologies to PG Electroplast and its stakeholders for any inconvenience caused.",
            "Sentiment": "neutral",
            "PublishDate": 1765277365540,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Disputes HDFC Sky Article, Demands Correction and Considers Legal Action",
            "Summary": "PG Electroplast has responded to an HDFC Sky article that allegedly contains incorrect claims about the company's financial status, demanding either a correction or retraction of the content. The company has indicated it may pursue legal action if the disputed claims are not addressed, highlighting concerns over potential misinformation affecting its financial reputation.",
            "Sentiment": "negative",
            "PublishDate": 1765165761397,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Receives Credit Ratings from ICRA for Rs. 103 Crore Credit Line",
            "Summary": "ICRA Limited assigned credit ratings to PG Electroplast Limited for Rs. 103 crore credit facilities, with long-term fund-based limits of Rs. 40 crore rated ICRA [A-]4 (Stable) and short-term non-fund-based limits of Rs. 63 crore rated ICRA [A-]1. The ratings assignment provides the company with formal credit assessment for its banking facilities and enhances transparency for stakeholders regarding the company's creditworthiness.",
            "Sentiment": "positive",
            "PublishDate": 1764141906174,
            "Source": "corporate_action"
        },
        {
            "Title": "PG Electroplast Q2FY26 Results: Revenue Declines 2% to Rs 655 Crores Amid AC Business Slowdown",
            "Summary": "PG Electroplast reported consolidated revenue of Rs 655 crores in Q2FY26, down 2% year-on-year, with AC business declining 45% due to early monsoons and GST cut announcement, while washing machine business grew 55%. The company maintained its FY26 guidance of Rs 5,700-5,800 crores revenue and Rs 300-310 crores net profit, with planned CAPEX of Rs 700-750 crores including refrigerator plant setup in Andhra Pradesh.",
            "Sentiment": "neutral",
            "PublishDate": 1763382352541,
            "Source": "earnings"
        },
        {
            "Title": "PG Electroplast Reports QIP Fund Utilization Progress in CRISIL Monitoring Report",
            "Summary": "PG Electroplast submitted its monitoring agency report for the quarter ended September 30, 2025, showing utilization of Rs 759.08 crore out of Rs 1,477.56 crore net proceeds from its December 2024 QIP for subsidiary investments, manufacturing expansion, and debt repayment. The company experienced implementation delays due to bank approval processes and regulatory clearances, with unused proceeds of Rs 718.48 crore deployed in fixed deposits earning 7.84% returns.",
            "Sentiment": "neutral",
            "PublishDate": 1763115512032,
            "Source": "corporate_action"
        },
        {
            "Title": "PG Electroplast Reports Increased AC Demand, Maintains Annual Guidance",
            "Summary": "PG Electroplast has observed an increase in air conditioner demand and continues to maintain its annual guidance. The company's outlook remains steady despite market fluctuations in the consumer appliance sector.",
            "Sentiment": "negative",
            "PublishDate": 1763096165604,
            "Source": "earnings"
        },
        {
            "Title": "PG Electroplast Projects ₹4,905 Cr FY25 Revenue with 38.5% CAGR Growth Strategy",
            "Summary": "PG Electroplast has outlined a multi-year growth plan targeting ₹4,905 crore revenue for FY25, representing a 38.5% compound annual growth rate over nine years. The company plans ₹1,200 crore capex for backward integration and expanding ODM/OEM capabilities across air conditioners, washing machines, TVs, and automotive electronics while focusing on margin improvement through value-added product mix.",
            "Sentiment": "positive",
            "PublishDate": 1763056091704,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Allots 6.13 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "PG Electroplast Limited allotted 6,13,000 equity shares of Rs. 1/- each to PG Electroplast Limited Employees Welfare Trust under the company's Employee Stock Options Scheme-2020. The allotment increased the company's paid-up equity share capital from Rs. 28,43,51,158/- to Rs. 28,49,64,158/-, with total equity shares rising to 28,49,64,158.",
            "Sentiment": "neutral",
            "PublishDate": 1763047047873,
            "Source": "corporate_action"
        },
        {
            "Title": "PG Electroplast Allots 2.75 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "PG Electroplast Limited allotted 2,75,500 equity shares of Rs. 1 each to the PG Electroplast Limited Employees Welfare Trust under the PG Electroplast Employees Stock Options Scheme-2020. The allotment was approved by the Nomination Remuneration Committee on October 31, 2025. Following this allotment, the company's paid-up equity share capital increased from Rs. 28,40,75,658 divided into 28,40,75,658 equity shares to Rs. 28,43,51,158 divided into 28,43,51,158 equity shares, each with a face value of Rs. 1.",
            "Sentiment": "neutral",
            "PublishDate": 1761923836799,
            "Source": "corporate_action"
        },
        {
            "Title": "PG Electroplast Reports High Demand for Air Conditioners in Northern India",
            "Summary": "PG Electroplast reported experiencing high demand for air conditioners in Northern India during an interview. The company highlighted this regional demand trend for their air conditioning products.",
            "Sentiment": "positive",
            "PublishDate": 1759465241627,
            "Source": "stock"
        },
        {
            "Title": "Air Conditioner Sales in North India Recover During Festive Period",
            "Summary": "Air conditioner sales in North India showed strong performance during the festive week, fully recovering previously lost sales. The recovery affects companies including Voltas, Blue Star, and PG Electroplast in the air conditioning sector.",
            "Sentiment": "positive",
            "PublishDate": 1759135125419,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Acquires 50-Acre Land in Sri City for Manufacturing Expansion",
            "Summary": "PG Electroplast has purchased 50 acres of land in Sri City and plans to invest 10 billion rupees over five years. The company will develop manufacturing capacity in phases, with the first phase targeting 1.2 million refrigerator production capacity by December 2026.",
            "Sentiment": "positive",
            "PublishDate": 1759104685290,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Acquires 50-Acre Land in Sri City for ₹1,000 Crore Manufacturing Expansion",
            "Summary": "PG Electroplast Limited acquired a 50-acre land parcel in Sri City, Andhra Pradesh through its wholly owned subsidiary PG Technoplast Private Limited. The company plans to invest ₹1,000 crore over 5 years to develop an integrated manufacturing campus. The first phase will establish a refrigerator plant with 1.2 million units annual capacity, with commercial production expected by December 2026. This represents the largest land acquisition for PG Group and marks their first facility in South India. The facility is strategically located near Chennai port to support future export opportunities and is designed for future expansion into air conditioners, washing machines, and other home appliances. The project is expected to generate over 500 jobs in the first phase.",
            "Sentiment": "positive",
            "PublishDate": 1758889928960,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast's Next Generation Manufacturers Signs ₹1000 Crore Investment MoU with Maharashtra Government",
            "Summary": "Next Generation Manufacturers, associated with PG Electroplast, has signed a Memorandum of Understanding with the Government of Maharashtra for a mega project involving an investment of ₹1000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756686544068,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Partners With Maharashtra Government For ₹1000 Crore Project",
            "Summary": "PG Electroplast has partnered with the Maharashtra Government for a mega project worth ₹1000 crore. The partnership involves Next Generation Manufacturers in this significant investment initiative.",
            "Sentiment": "positive",
            "PublishDate": 1756544287909,
            "Source": "order&deals"
        },
        {
            "Title": "PG Technoplast Appoints Girish Chander as CEO",
            "Summary": "PG Technoplast Private Limited, a wholly owned subsidiary of PG Electroplast Limited, has appointed Girish Chander as Chief Executive Officer effective August 29, 2025. Chander brings 29 years of manufacturing and operations experience, including 21 years in the air-conditioning sector. He holds a B.E. in Production Engineering from PEC Chandigarh and completed a Senior Executive Development Program in Transformational Leadership in 2023. His career includes roles at Vardhman Spinning Mills, Whirlpool India Limited, LG Electronics India Private Limited, Carrier Midea India Private Limited, and Havells India Limited, where he led greenfield factory setups and stabilized operations at the Sricity plant. The Board expects his leadership to enhance operational efficiency and drive the company's next phase of growth.",
            "Sentiment": "positive",
            "PublishDate": 1756384312347,
            "Source": "corporate_governance"
        },
        {
            "Title": "PG Electroplast Forms Manufacturing Partnership with Pax India",
            "Summary": "PG Electroplast has entered into a manufacturing partnership with Pax India. The partnership will focus on manufacturing operations in India.",
            "Sentiment": "positive",
            "PublishDate": 1755665928969,
            "Source": "order&deals"
        },
        {
            "Title": "PG Electroplast Exits F&O Ban as Open Positions Fall Below Regulatory Threshold",
            "Summary": "PG Electroplast shares exited the Futures & Options ban after being restricted since August 12, allowing new derivative positions to be created again. The exit occurred when open positions fell below 80% of the market-wide position limit. Despite the F&O restrictions, shares gained 5% during the ban period, including an 8% rally on August 18 alongside other consumer durable stocks on expectations of lower GST rates before Diwali. The stock had previously fallen over 30% between August 8-11 after the company sharply reduced its full-year guidance across profitability and core business metrics. Company executive Vikas Gupta stated the long-term business outlook remains intact with no downside risk to revised guidance, expecting normalized inventory levels by October-November. Shares closed 2.9% higher at ₹543.9, marking the third consecutive day of gains.",
            "Sentiment": "positive",
            "PublishDate": 1755646307578,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Surges 14% on GST Rate Cut Expectations for Consumer Durables",
            "Summary": "PG Electroplast shares jumped 13.71% to Rs 556.80 following Prime Minister Narendra Modi's Independence Day announcement hinting at GST reforms before Diwali. The proposed changes aim to simplify tax structure and reduce rates on high-tax items like air conditioners and large-screen televisions, currently taxed at 28%. Analysts expect the electronics manufacturer to benefit from increased demand and improved margins if AC GST rates drop to 18%. The stock later traded 12.08% higher at Rs 548.80, with trading volume at 4.3 times the 30-day average. Out of 11 analysts, seven maintain 'buy' ratings with an average 12-month price target implying 33.7% upside. The company joins peers Voltas, Blue Star, and Amber Enterprises expected to benefit from the tax rationalization in consumer electronics segments.",
            "Sentiment": "positive",
            "PublishDate": 1755501027052,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Shares Hit One-Year Low as Quarterly Profit Drops 20%",
            "Summary": "PG Electroplast shares fell to their lowest level in one year following weak quarterly performance. The company reported a 20% decline in consolidated net profit to Rs 67 crore during April-June, while revenue rose 14% to Rs 1,504 crore. Operating profit and margins also declined, with margin falling to 8.1% from 9.9%. The company has reduced its revenue guidance for financial year 2026 to Rs 5,700-5,800 crore from Rs 6,345 crore, lowering growth expectations to 17-18% from 30%. The stock has dropped 40% in August and declined 50.45% year-to-date, though it gained 11.31% over 12 months. Factors affecting performance include lower orders in June and July, increased working capital, deteriorated cash flow, early monsoons impacting air conditioner sales, and supply cost pressures on margins. Of 11 analysts tracking the company, seven maintain buy ratings, three recommend hold, and one suggests sell.",
            "Sentiment": "negative",
            "PublishDate": 1755147996349,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Shares Enter F&O Ban After 36% Decline in Four Sessions",
            "Summary": "PG Electroplast shares entered the Futures & Options ban after falling 36% over four trading sessions, with the stock closing 12.7% lower at ₹514.15. The F&O ban was triggered as the market-wide position limit crossed 95%, preventing new derivative positions until lifted. The stock has declined 50% year-to-date and halved from its January 2025 high of ₹1,054. Trading volume reached 5.1 crore shares worth over ₹2,500 crore, though only 18.5% were marked for delivery. Anand Rathi downgraded the stock while Nuvama maintained its buy rating but cut the price target by 35%. Company executive Vikas Gupta stated he sees no downside risk to revised guidance and that promoters remain committed to the business.",
            "Sentiment": "negative",
            "PublishDate": 1754956294919,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Cuts FY26 Guidance as Early Monsoon Disrupts AC Season",
            "Summary": "PG Electroplast reported Q1 FY26 consolidated revenue of Rs.1,504 crores, up 14% year-on-year, but net profit declined to Rs.66.7 crores from Rs.84.9 crores in Q1 FY25. The company revised its FY26 standalone revenue guidance downward to Rs.5,700-5,800 crores and net profit to Rs.300-310 crores. Early monsoon arrival ended the AC season abruptly, leading to order cancellations of 50-70% across clients for June-August. The company is carrying Rs.1,300 crores of inventory versus Rs.356 crores last year, with Rs.1,200 crores in AC business alone. AC business still grew 15% despite the shortened season, while washing machines grew 36%. The company reduced CAPEX guidance to Rs.700-750 crores from Rs.800-900 crores previously planned. Management expects inventory levels to normalize by December-January and anticipates market recovery from November.",
            "Sentiment": "negative",
            "PublishDate": 1754907708591,
            "Source": "earnings"
        },
        {
            "Title": "PG Electroplast Maintains ₹310 Crore Profit Guidance Despite Weak AC Season, Rules Out Share Buyback",
            "Summary": "PG Electroplast expects to maintain its net profit guidance of ₹310 crore for the financial year ending March 2026, despite a weak summer season that impacted air conditioner sales. Managing Director Vikas Gupta stated that inventory levels should normalize by October-November as the company prepares for peak production months starting in November. The company's shares have gained over 16% in the past year, with current market capitalization at ₹14,546.83 crore. Promoter shareholding declined from 49.37% in March to 43.72% by June due to a block deal and earlier QIP fundraising of ₹1,500 crore. The company faced margin pressure due to increased finance costs, extended lean months, and higher input costs including dollar exchange rates and copper tubing. Gupta indicated promoters may consider increasing their stake when regulatory restrictions end, but ruled out share buybacks due to ongoing capex commitments. The compressor facility project has been delayed with FY27 now appearing as a safer timeline for completion.",
            "Sentiment": "neutral",
            "PublishDate": 1754890957660,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Shares Plunge 30% Over Two Days as Nuvama Slashes Target Price",
            "Summary": "PG Electroplast shares fell 15% on Monday following a 20% drop on Friday, resulting in a combined two-day loss of 30%. The stock declined to Rs 500.50 after Nuvama reduced its target price from Rs 1,100 to Rs 710. The downgrade followed weak quarterly results showing 14% revenue growth while EBITDA contracted 7% due to cost under-absorption. Management lowered its consolidated revenue guidance for FY26 to 18% from 30%, citing challenging market conditions, soft seasonal demand, and excess inventory. EBITDA margin guidance was reduced by 125-150 basis points and PAT guidance cut by 23%. The company also trimmed its capex plan to Rs 7-7.5 billion from Rs 8-9 billion. A block deal saw 79 lakh shares worth Rs 406 crore change hands at Rs 501 per share. Technical analysts warn of further downside, noting the stock has broken down from its consolidation phase with high volumes.",
            "Sentiment": "negative",
            "PublishDate": 1754887289521,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Aims to Restore FY25 Margin Levels by FY28",
            "Summary": "PG Electroplast has set a target to match its FY25 margins by FY28 through operating leverage. The company expects to receive clarity on orders for the next season around September-October 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754882674482,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Expects EBITDA Margins to Decline 1.25-1.5% Due to AC Season End and Inventory Issues",
            "Summary": "PG Electroplast predicts its EBITDA margins will drop by 1.25-1.5% compared to the previous year. The company attributes this decline to the sudden end of the air conditioning season and excess inventory levels. This information was shared during a conference call update.",
            "Sentiment": "negative",
            "PublishDate": 1754882291839,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Shares Plunge 22% After Cutting FY2026 Growth Guidance",
            "Summary": "PG Electroplast shares fell 22% on Friday after the company reduced its growth guidance for financial year 2026. Despite this decline, the stock has been a significant wealth creator, rising from ₹5 in 2020 to ₹980 by end of 2024, reaching a record high of ₹1,054 in January before correcting to ₹600. Mutual fund ownership increased substantially from 3.56% in June 2024 to 13.31% in June 2025, with notable stakes held by ICICI Prudential Smallcap Index Fund, HSBC Midcap Fund, Nippon Life India, Axis MF, and Motilal Oswal Flexicap Fund. Small retail shareholders also increased their presence, with numbers rising from 33,240 to 2.1 lakh over the same period, while their stake grew from 14.34% to 17.29%. Promoters sold 1.5 crore shares through block deals in May, with Government of Singapore and Motilal Oswal AMC among the buyers. The company raised ₹1,500 crore through a QIP in December. Market analyst Dipan Mehta attributed the correction to high PE multiples, expensive valuations, and the stock being over-owned due to the QIP and previous rally. Shares closed 23% lower at ₹567.35, marking the biggest single-day fall on record for the stock.",
            "Sentiment": "negative",
            "PublishDate": 1754648702464,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Management Acknowledges Unpreparedness, Prioritizes Profitability During Consolidation",
            "Summary": "PG Electroplast's management admitted being unprepared for sudden changes during a conference call. The company is currently focusing on profitability while navigating through a consolidation period.",
            "Sentiment": "negative",
            "PublishDate": 1754646777045,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Shares Drop 15% After Slashing FY26 Growth Guidance",
            "Summary": "PG Electroplast shares fell 15% after the company significantly reduced its revenue growth guidance. The company now expects consolidated sales of ₹5,700-5,800 crore, implying 17-19% growth, down from earlier guidance of ₹6,345 crore representing 30.3% growth. Total group revenue guidance was cut to ₹6,550-6,650 crore from ₹7,200 crore previously. Net profit guidance was reduced to ₹300-310 crore (3-7% growth) from earlier expectations of ₹405 crore. Product business growth guidance was lowered to 17-21% with revenue of ₹4,140-4,280 crore, compared to previous guidance of ₹4,770 crore. In quarterly results, net profit declined 21.5% to ₹66.7 crore while revenue increased 14% to ₹1,503.8 crore. EBITDA fell 7% to ₹121.3 crore with margins compressing to 8% from 9.9% previously. Shares closed 10% lower at ₹663.20 and are down over 35% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1754644575017,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Reports 13.9% Revenue Growth Despite Challenging Quarter, Maintains Strong FY26 Guidance",
            "Summary": "PG Electroplast Limited reported quarterly revenues of INR 1,503.85 crores, up 13.9% year-over-year, despite facing challenges from early monsoons that impacted seasonal Room AC sales. EBITDA grew 3.6% to INR 139.42 crores, while net profit declined to INR 66.71 crores from INR 84.93 crores in the previous year. The Product business contributed 77.1% of revenues, with Room ACs growing 15.1% and Washing Machines growing 36.1%. The company maintains strong capital efficiency metrics with RoCE at 25.2% and RoE at 13.6%. Management provided FY26 guidance of INR 5,700-5,800 crores in consolidated revenues (17-19% growth) and net profit of INR 300-310 crores (3-7% growth). The company plans capex of INR 700-750 crores for capacity expansion across multiple facilities including refrigerator campus in South India and washing machine campus in Greater Noida.",
            "Sentiment": "neutral",
            "PublishDate": 1754643559411,
            "Source": "earnings"
        },
        {
            "Title": "PG Electroplast Reports Strong Q1 FY26 Results with 73% Jump in Standalone Profit",
            "Summary": "PG Electroplast Limited reported its quarterly results for the period ended June 30, 2025. On a standalone basis, the company posted revenue from operations of Rs. 35,033.05 lakhs compared to Rs. 33,464.60 lakhs in the same quarter last year. Profit after tax increased significantly to Rs. 3,184.57 lakhs from Rs. 1,838.64 lakhs in the corresponding quarter of the previous year. Basic earnings per share stood at Rs. 1.12 versus Rs. 0.71 in the year-ago period. On a consolidated basis, revenue from operations reached Rs. 150,385.04 lakhs against Rs. 132,068.40 lakhs in the same quarter last year, while consolidated profit after tax was Rs. 6,698.45 lakhs compared to Rs. 8,369.51 lakhs in the previous year. During the quarter, the company allotted 277,000 equity shares under its Employee Stock Option Scheme and utilized Rs. 5,302.02 lakhs from funds raised through Qualified Institutional Buyers issue, with cumulative utilization reaching Rs. 81,209.52 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1754642625652,
            "Source": "earnings"
        },
        {
            "Title": "PG Electroplast Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "PG Electroplast reported mixed quarterly results with revenue increasing to 15 billion rupees from 13.2 billion rupees year-over-year. However, the company experienced a decline in profitability with EBITDA falling to 1.21 billion rupees from 1.3 billion rupees, while EBITDA margin compressed to 8.1% from 9.9%. Consolidated net profit decreased to 670 million rupees compared to 837 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754642068145,
            "Source": "stock"
        },
        {
            "Title": "PG Electroplast Schedules Q1FY26 Earnings Conference Call for August 8, 2025",
            "Summary": "PG Electroplast Limited has scheduled an earnings conference call with analysts and investors on August 8, 2025, to discuss the company's financial performance for the quarter ended June 30, 2025. The call is organized by Axis Capital Limited and will take place at 3:00 PM IST. The management will be represented by Vishal Gupta, Managing Director (Finance), and Pramod Gupta, Chief Financial Officer. The call will begin with a management discussion on earnings performance followed by a Q&A session. The company has stated that no unpublished price sensitive information is intended to be discussed during the interactions.",
            "Sentiment": "neutral",
            "PublishDate": 1754373038360,
            "Source": "earnings"
        },
        {
            "Title": "PG Electroplast: Government of Singapore and Motilal Oswal AMC Acquire Shares in Block Deal",
            "Summary": "The Government of Singapore purchased 1.34% and Motilal Oswal AMC bought 0.56% of PG Electroplast's shares in a block deal. Three promoters sold a total of 5.3% stake. Shares were traded at an average price of ₹754.8 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748394494000,
            "Source": "block_deals"
        },
        {
            "Title": "PG Electroplast: Singapore Government and Motilal Oswal Acquire Shares in Block Deal",
            "Summary": "The Government of Singapore purchased 1.35% stake and Motilal Oswal AMC bought 0.56% stake in PG Electroplast from the promoter Gupta family. The promoters sold a total of 5.3% stake for Rs 1,133 crore. The transactions occurred at around Rs 754.8 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748363135000,
            "Source": "block_deals"
        },
        {
            "Title": "PG Electroplast: Promoters Plan ₹1,177 Crore Stake Sale via Block Deal",
            "Summary": "PG Electroplast promoters to sell 5.62% stake (1.59 crore shares) at ₹740 per share floor price on May 27, 2025. JM Financial managing the deal. Remaining promoter stake subject to 180-day lock-in. Sale aims to improve liquidity and institutional participation.",
            "Sentiment": "neutral",
            "PublishDate": 1748317750000,
            "Source": "block_deals"
        },
        {
            "Title": "PG Electroplast: Large Block Trade on BSE",
            "Summary": "A significant block trade occurred for PG Electroplast on the Bombay Stock Exchange (BSE). The trade involved approximately 7,500,000 shares at an average price of Rs 754.8 per share. The total value of the transaction was Rs 566.1 crore. Multiple blocks were traded to complete this large transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1748317745000,
            "Source": "block_details"
        },
        {
            "Title": "PG Electroplast: Promoter Family Offers 5.6% Stake Worth Rs 1,177 Crore in Block Deal",
            "Summary": "The Gupta family, promoters of PG Electroplast Ltd., will sell 1.59 crore shares (5.6% stake) via block deal on Tuesday. The floor price is set at Rs 740 per share, a 4% discount to Monday's closing. A 180-day lock-up applies to the promoters' remaining shares. The family currently holds 49.37% equity in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1748274050000,
            "Source": "block_deals"
        },
        {
            "Title": "PG Electro Promoters to Sell 5.62% Stake via Block Deals",
            "Summary": "Promoters of PG Electro are planning to sell 1.59 crore shares, representing a 5.62% stake, through block deals. The floor price is set at 740 per share, which is a 4% discount to the current market price. The total value of the stake sale is estimated at Rs 1176 crores. JM Financial will be the broker for this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1748271615000,
            "Source": "default"
        },
        {
            "Title": "PG Electroplast: Strong Q4 Performance with 77% Revenue Growth",
            "Summary": "PG Electroplast reported a 77% YoY increase in Q4 revenues to Rs 19 billion, driven by strong demand in room AC and washing machine segments. FY2025 consolidated revenues grew 77.3% to Rs 48.70 billion despite declining average selling prices.",
            "Sentiment": "positive",
            "PublishDate": 1747233094000,
            "Source": "earnings"
        },
        {
            "Title": "PG Electroplast: Strong FY26 Outlook with 30-35% Revenue Growth Target",
            "Summary": "PG Electroplast targets 30-35% revenue growth in FY26, with air conditioners expected to contribute ₹4,000 crore and washing machines ₹650 crore. The company plans ₹800-900 crore capex for FY26, including ₹350-400 crore for RAC segment. Compressor production to begin by January 2026, potentially improving margins by 150-200 basis points. Joint venture partner announcement expected in 2-3 weeks.",
            "Sentiment": "positive",
            "PublishDate": 1747205657000,
            "Source": "normal_news"
        },
        {
            "Title": "PG Electroplast: Q4 Profit Doubles, FY25 Revenue Soars 78%",
            "Summary": "PG Electroplast reported a two-fold increase in Q4 FY25 net profit to Rs 146.38 crore, with revenue up 77.4% to Rs 1,909.85 crore. FY25 net profit doubled to Rs 290.92 crore on total income of Rs 4,904.63 crore. The company projects FY26 consolidated sales of Rs 6,345 crore, a 30.3% growth, with expected net profit of Rs 405 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747113921000,
            "Source": "earnings"
        }
    ]
}