{
    "Symbol": "PGHH",
    "ISIN": "INE179A01014",
    "News": [
        {
            "Title": "P&G Hygiene Q3FY26 Profit Jumps 12.2% to ₹301.46 Cr",
            "Summary": "P&G Hygiene and Health Care reports strong Q3FY26 performance with net profit rising 12.2% YoY to ₹301.46 crore. Board declares interim dividend of ₹195 per share including special dividend.",
            "Sentiment": "positive",
            "PublishDate": 1769763703785,
            "Source": "co_actions_results"
        },
        {
            "Title": "P&G Hygiene Board to Consider Interim Dividend Jan 30",
            "Summary": "Procter & Gamble Hygiene and Health Care Limited has scheduled a board meeting on January 30, 2026, to consider declaration of interim dividend for FY2025-26, as announced in regulatory filing.",
            "Sentiment": "positive",
            "PublishDate": 1768978802289,
            "Source": "co_actions_results"
        },
        {
            "Title": "Procter & Gamble Hygiene and Health Care Limited Announces Leadership Change in Healthcare Division",
            "Summary": "Ms. Maitrheyi Jagannathan will cease to be Category Leader, Health Care at Procter & Gamble Hygiene and Health Care Limited effective December 31, 2025, as she leaves to pursue other interests. Mr. Tushar Gupta, currently Senior Director leading brand design and communication for Vicks and Zzzquil in the APAC region, will take over as Category Leader-Health Care effective January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764583229890,
            "Source": "corporate_governance"
        },
        {
            "Title": "Procter & Gamble Hygiene and Health Care Limited Reports Quarterly Financial Results",
            "Summary": "Procter & Gamble Hygiene and Health Care Limited announced its unaudited financial results for the quarter ended September 30, 2025. The Board of Directors approved the results at a meeting held on November 6, 2025. The company operates in two segments: Health Care Products (comprising ointments, creams, cough drops and tablets) and Hygiene Products (comprising feminine hygiene products and other skin care hygiene items). The financial statements include profit and loss, balance sheet, and cash flow statements. The results were reviewed by the Audit Committee and have been subject to limited review by statutory auditors. The company changed its financial year from June 30 to March 31, with the previous financial year 2024-25 covering nine months from July 1, 2024 to March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762420548867,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Decline in Q2 EBITDA and Margins",
            "Summary": "Procter & Gamble Hygiene & Health Care reported Q2 EBITDA of 3.3 billion rupees, down from 3.5 billion rupees in the same period last year. The company's EBITDA margin also decreased to 28.67% from 30.75% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762416813871,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Mixed Q2 Results",
            "Summary": "Procter & Gamble Hygiene & Health Care reported Q2 revenue of 11.5 billion rupees compared to 11.35 billion rupees year-over-year, showing growth. However, net profit declined to 2.1 billion rupees from 2.12 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762416376754,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Executes Rs. 100.06 Crore Block Trade on NSE",
            "Summary": "Procter & Gamble Hygiene & Health Care Ltd. completed a block trade worth Rs. 100.06 crores on the National Stock Exchange. The transaction involved approximately 75,572 shares at a price of Rs. 13,240 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754628668254,
            "Source": "order&deals"
        },
        {
            "Title": "Procter & Gamble Hygiene and Health Care Re-appoints Two Independent Directors for Five-Year Terms",
            "Summary": "Procter & Gamble Hygiene and Health Care Limited's Board of Directors has approved the re-appointment of two Independent Directors for five-year terms. Mr. Krishnamurthy Iyer will serve from December 1, 2025 to November 30, 2030, while Mr. Chittranjan Dua will serve from August 25, 2025 to August 24, 2030. Both re-appointments follow the completion of their first tenure and are subject to shareholder approval at the upcoming annual general meeting. The company confirmed that both directors meet independence criteria under the Companies Act, 2013 and SEBI regulations, are not disqualified from holding director positions, and do not hold any shares in the company. Neither director has any relationship with other company directors.",
            "Sentiment": "neutral",
            "PublishDate": 1753863441841,
            "Source": "corporate_governance"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Strong Q1 Performance with EBITDA More Than Doubling",
            "Summary": "Procter & Gamble Hygiene & Health Care delivered robust quarterly results with EBITDA rising to 2.66 billion rupees from 1.2 billion rupees year-over-year. The company's EBITDA margin expanded significantly to 28.41% compared to 12.7% in the same period last year. Net profit increased to 1.92 billion rupees from 811 million rupees year-over-year, while revenue grew marginally to 9.4 billion rupees from 9.3 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1753862457327,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Plans to Divest Multiple Categories and Brands",
            "Summary": "Procter & Gamble has announced plans to divest multiple categories and brands from its portfolio. The specific categories and brands to be divested are not mentioned in the given news snippet. This move suggests a strategic restructuring of the company's product offerings.",
            "Sentiment": "neutral",
            "PublishDate": 1749112823000,
            "Source": "default"
        },
        {
            "Title": "Procter & Gamble to Cut 7,000 Non-Manufacturing Jobs Worldwide",
            "Summary": "Procter & Gamble has announced plans to eliminate 7,000 jobs globally, which represents 15% of its non-manufacturing workforce. This workforce reduction is part of a restructuring strategy that the company intends to implement over the next two years.",
            "Sentiment": "negative",
            "PublishDate": 1749112467000,
            "Source": "default"
        },
        {
            "Title": "Procter & Gamble Hygiene and Health Care Ltd: Q4 Profit Rises Marginally",
            "Summary": "P&G Hygiene and Health Care reported a 1.1% increase in Q4 profit to Rs 156.10 crore. Revenue decreased by 1.05% to Rs 991.63 crore. Total expenses rose by 11.24% to Rs 791.10 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748356621000,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Recommends Dividend",
            "Summary": "Procter & Gamble Hygiene & Health Care has recommended a dividend of 65 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748352324000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Q4 Results",
            "Summary": "Procter & Gamble Hygiene & Health Care announced its Q4 financial results. The company reported an EBITDA of 2.1 billion rupees, down from 2.57 billion rupees year-over-year. The EBITDA margin decreased to 21.14% from 25.68% in the same period last year. Net profit for Q4 was 1.56 billion rupees, slightly up from 1.5 billion rupees year-over-year, but down from 2.7 billion rupees quarter-over-quarter. Revenue for Q4 was 9.9 billion rupees, compared to 10 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748352281000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Hygiene and Health Care to Consider Q4 Results on May 27",
            "Summary": "Procter & Gamble Hygiene and Health Care has announced that it will consider its fourth quarter results on May 27. This indicates that the company is preparing to release its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1742999530000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Hygiene and Health Care: Q2 Profit Up 17%, Declares Rs 110 Dividend",
            "Summary": "P&G Hygiene and Health Care reported a 17% increase in Q2 FY25 net profit to Rs 269 crore, beating estimates. The company declared an interim dividend of Rs 110 per share, payable by March 7, 2025. Revenue rose 10.1% to Rs 1,247.63 crore, and EBITDA margin expanded to 29.7%.",
            "Sentiment": "positive",
            "PublishDate": 1739268932000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Declares Interim Dividend",
            "Summary": "Procter & Gamble Hygiene & Health Care has announced an interim dividend of 110 rupees per share. This corporate action reflects the company's financial performance and its commitment to returning value to shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1739266735000,
            "Source": "corporate_action"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Q3 Revenue Growth",
            "Summary": "Procter & Gamble Hygiene & Health Care has reported a revenue of 12.5 billion rupees for the third quarter, compared to 11.3 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739266583000,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Improved Q3 EBITDA and Margin",
            "Summary": "Procter & Gamble Hygiene & Health Care has reported its Q3 financial results. The company's EBITDA increased to 3.7 billion rupees from 3.09 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 29.73% from 27.33% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739266464000,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Increased Q3 Net Profit",
            "Summary": "Procter & Gamble Hygiene & Health Care has reported a net profit of 2.6 billion rupees for the third quarter, compared to 2.29 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739266355000,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Hygiene and Health Care to Consider Q3 Results on February 11",
            "Summary": "Procter & Gamble Hygiene and Health Care has announced that it will consider its third-quarter financial results on February 11. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1735374165000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Q2 Financial Results",
            "Summary": "Procter & Gamble Hygiene & Health Care announced its Q2 financial results. The company's EBITDA increased to 2.9 billion rupees from 2.85 billion rupees year-over-year. The EBITDA margin also improved to 25.59% from 25.03% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730274032000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Q2 Revenue",
            "Summary": "Procter & Gamble Hygiene & Health Care has reported its second quarter revenue of 11.35 billion rupees, compared to 11.38 billion rupees in the same quarter of the previous year, showing a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1730274017000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Hygiene & Health Care Reports Slight Increase in Q2 Net Profit",
            "Summary": "Procter & Gamble Hygiene & Health Care announced its second-quarter financial results, reporting a net profit of 2.12 billion rupees, compared to 2.11 billion rupees in the same quarter of the previous year. This represents a marginal year-over-year increase in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1730273989000,
            "Source": "result"
        }
    ]
}