{
    "Symbol": "PGHL",
    "ISIN": "INE199A01012",
    "News": [
        {
            "Title": "P&G Health Declares ₹160 Per Share Dividend",
            "Summary": "Procter & Gamble Health Limited has announced a dividend payment of ₹160 per share for its shareholders, reflecting the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1770369434353,
            "Source": "co_actions_results"
        },
        {
            "Title": "P&G Health Q3 Net Profit Drops 14.6% to ₹776M",
            "Summary": "Procter & Gamble Health reports Q3 standalone net profit of ₹776 million, marking a year-on-year decline from ₹909 million in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1770369196330,
            "Source": "co_actions_results"
        },
        {
            "Title": "P&G Health Board to Consider Interim Dividend on Feb 6",
            "Summary": "Procter & Gamble Health Limited has revised its board meeting agenda for February 6, 2026, to include consideration of interim dividend declaration for FY26, in addition to previously scheduled matters.",
            "Sentiment": "positive",
            "PublishDate": 1768978632687,
            "Source": "co_actions_results"
        },
        {
            "Title": "Procter & Gamble Health Limited Appoints Shashank Srowthy as Executive Director",
            "Summary": "Procter & Gamble Health Limited confirmed the appointment of Shashank Srowthy as Executive Director for five years effective October 1, 2025, following shareholder approval through postal ballot on November 16, 2025. Srowthy brings 14 years of finance experience across PG operations in India, Dubai and Singapore, and holds no shares in the company nor any relationship with existing directors.",
            "Sentiment": "positive",
            "PublishDate": 1763462854734,
            "Source": "corporate_action"
        },
        {
            "Title": "Procter & Gamble Health Limited Reports Quarterly Financial Results",
            "Summary": "Procter & Gamble Health Limited announced its unaudited financial results for the quarter ended September 30, 2025. The company reported revenue from operations of ₹54.5 crores for the quarter, compared to ₹54.7 crores in the previous quarter and ₹51.1 crores in the corresponding quarter of the previous year. Net profit for the quarter stood at ₹88.6 crores, significantly higher than ₹66.2 crores in the previous quarter and ₹82.5 crores in the same quarter last year. For the six-month period ended September 30, 2025, revenue was ₹109.3 crores with net profit of ₹154.8 crores. The company's earnings per share for the quarter was ₹53.34. Cash and cash equivalents increased to ₹279.3 crores as of September 30, 2025, from ₹182.3 crores as of March 31, 2025. The Board of Directors approved these results at a meeting held on November 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762362865514,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Health Reports Higher Q2 Profit and Revenue Growth",
            "Summary": "Procter & Gamble Health reported Q2 net profit of 885.4 million rupees compared to 823.3 million rupees in the same period last year. Revenue increased to 3.25 billion rupees from 3.13 billion rupees year-over-year. EBITDA rose to 1.2 billion rupees from 1.14 billion rupees, while EBITDA margin improved to 37.02% from 36.39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762335765756,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Health Limited Completes Director Appointment Process for Shashank Srowthy",
            "Summary": "Procter & Gamble Health Limited announced that Mr. Shashank Srowthy has been allotted Director Identification Number (DIN) 11317956 by the Ministry of Corporate Affairs. Srowthy was appointed as Additional Director (Executive) effective October 1, 2025. The DIN was allotted through an order dated September 26, 2025, completing the appointment process that was initially announced on September 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759333742341,
            "Source": "corporate_governance"
        },
        {
            "Title": "Procter & Gamble Health Limited Announces CFO Transition with Lokesh Chandak's Resignation and Shashank Srowthy's Appointment",
            "Summary": "Procter & Gamble Health Limited announced a leadership transition in its finance department. Mr. Lokesh Chandak resigned from his position as Director & Chief Financial Officer effective September 30, 2025, to take on a new role within P&G as Senior Director – Finance & Accounting, Feminine Care for Asia Pacific Enterprise Markets, Middle East and Africa. The company appointed Mr. Shashank Srowthy as the new Chief Financial Officer and Additional Executive Director effective October 1, 2025. Srowthy brings 14 years of finance experience and has worked with P&G since 2011 across India, Dubai and Singapore. He holds engineering and management qualifications from Pune University and Jamnalal Bajaj Institute. His appointment as Executive Director requires regulatory approvals from the Central Government and company shareholders. The Board confirmed Srowthy is not disqualified from holding directorship, does not own company shares, and is not related to any existing directors.",
            "Sentiment": "neutral",
            "PublishDate": 1758023259153,
            "Source": "corporate_governance"
        },
        {
            "Title": "Procter & Gamble Health Limited Gets Exchange Approval for Promoter Shareholding Reclassification",
            "Summary": "Procter & Gamble Health Limited received stock exchange approval for reclassifying three erstwhile promoter shareholders - Emedia Export Company mit beschrankter Haftung, Chemitra Gesellschaft mit beschrankter Hafiung and Merck Internationale Beteiligungen GmbH - to public shareholders. Following this reclassification, Procter & Gamble Overseas India BV remains the sole promoter shareholder holding 51.82% stake, while public shareholders hold 48.18%. The company had originally applied for this reclassification in June 2018, with the approval taking effect from December 2018.",
            "Sentiment": "neutral",
            "PublishDate": 1755524967793,
            "Source": "corporate_action"
        },
        {
            "Title": "Procter & Gamble Health Reports Strong Q1 Performance with Net Profit Surging to 662M Rupees",
            "Summary": "Procter & Gamble Health delivered robust quarterly results with net profit reaching 662 million rupees compared to 168 million rupees in the same period last year. Revenue grew to 3.4 billion rupees from 2.84 billion rupees year-over-year. The company's EBITDA increased significantly to 903 million rupees versus 482.5 million rupees previously, while EBITDA margin expanded to 26.7% from 17% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754037144718,
            "Source": "earnings"
        },
        {
            "Title": "P&G Hygiene Shares Surge 11% as Quarterly Profit Doubles to ₹192 Crore",
            "Summary": "Procter & Gamble Hygiene and Health Care Ltd. reported strong quarterly results with net profit doubling to ₹192 crore from ₹81 crore in the same period last year. Revenue grew marginally by 0.6% to ₹937 crore from ₹932 crore. EBITDA increased significantly to ₹266 crore from ₹118 crore, while margins expanded substantially to 28.4% from 12.7%. Managing Director Kumar Venkatasubramanian attributed the performance to executing their integrated growth strategy focused on daily use categories and product superiority. The stock gained 11.06% to reach an intraday high of ₹14,540, later trading 6.1% higher at ₹13,889.",
            "Sentiment": "positive",
            "PublishDate": 1753865694700,
            "Source": "earnings"
        },
        {
            "Title": "India's Defence Minister Calls for Border Demarcation Resolution",
            "Summary": "India's Defence Minister has emphasized the need for a lasting resolution on border demarcation by revitalizing existing mechanisms. The minister stressed the importance of addressing this issue, likely referring to India's border disputes with neighboring countries. However, the article does not provide specific details about which borders or mechanisms are being discussed.",
            "Sentiment": "neutral",
            "PublishDate": 1750999169000,
            "Source": "default"
        },
        {
            "Title": "Procter & Gamble Health Reports Q4 Results and Dividend",
            "Summary": "Procter & Gamble Health announced its Q4 results. The company's net profit increased to 612 million rupees, up from 465.6 million rupees year-over-year, but down from 909 million rupees quarter-over-quarter. Revenue rose to 3.1 billion rupees from 2.52 billion rupees in the same quarter last year. The company has recommended a dividend of 45 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748559786000,
            "Source": "default"
        },
        {
            "Title": "Procter & Gamble Health: Q3 Profit Surges 31%, ₹45 Dividend Proposed",
            "Summary": "P&G Health reported a 31.3% YoY increase in Q3FY25 net profit to ₹61.2 crore. Revenue rose 23.2% to ₹311 crore. EBITDA grew 20.2% to ₹81 crore. The board recommended a dividend of ₹45 per share. Nine-month sales increased 8% to ₹918 crore, with PAT up 27% to ₹234 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748525777000,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Health Reports Q4 Results and Dividend Recommendation",
            "Summary": "Procter & Gamble Health has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA increased to 809 million rupees from 674.4 million rupees year-over-year. However, the EBITDA margin decreased slightly to 26.02% from 26.71% in the same period last year. Additionally, the company has recommended a dividend of 45 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748524566000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Health Reports Q4 Financial Results",
            "Summary": "Procter & Gamble Health announced its Q4 financial results. The company reported a net profit of 612 million rupees, compared to 465.6 million rupees year-over-year and 909 million rupees quarter-over-quarter. Revenue for Q4 was 3.1 billion rupees, up from 2.52 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748524496000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble: Q3 Results Miss Expectations, Quarterly Performance Inconsistent",
            "Summary": "P&G's Q3 results missed expectations across all fronts. The company shows 7% revenue CAGR for FY19-24 and is estimated to maintain this through FY24-27E. While quarterly performance is inconsistent, annual performance remains steady. Ebitda margin improved by 250 bp during FY19-24 to ~23.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1748435345000,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Health to Consider Q4 Results on May 29",
            "Summary": "Procter & Gamble Health has announced that it will consider its fourth quarter results on May 29. This indicates that the company is preparing to release its financial performance for the latest quarter, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1742999669000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Health Declares Dividend of Rs. 80",
            "Summary": "Procter & Gamble Health has announced a dividend of Rs. 80 per share. This declaration represents a significant corporate action, providing a cash return to shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1739351321000,
            "Source": "corporate_action"
        },
        {
            "Title": "Procter & Gamble Health Reports Stable Q3 Revenue",
            "Summary": "Procter & Gamble Health announced its third-quarter revenue of 3.1 billion rupees, which remains unchanged compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739351309000,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Health Reports Improved Q3 EBITDA and Margin",
            "Summary": "Procter & Gamble Health has reported its Q3 financial results. The company's EBITDA increased to 1.23 billion rupees from 1.02 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 39.85% from 32.79% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739351283000,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Health Reports Increased Q3 Net Profit",
            "Summary": "Procter & Gamble Health has announced its financial results for the third quarter. The company reported a net profit of 909 million rupees, which represents an increase from 721 million rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739351241000,
            "Source": "earnings"
        },
        {
            "Title": "Procter & Gamble Health: ₹110 Interim Dividend Declared for FY25",
            "Summary": "Procter & Gamble Health Ltd's board has declared an interim dividend of ₹110 per equity share for FY 2024-25, to be paid by March 7, 2025. The company's shares closed at ₹5,265.75 on the BSE, down 1.25%.",
            "Sentiment": "positive",
            "PublishDate": 1739267664000,
            "Source": "corporate_action"
        },
        {
            "Title": "Procter & Gamble Health to Consider Q3 Results on February 12",
            "Summary": "Procter & Gamble Health has announced that it will be reviewing and considering its financial results for the third quarter on February 12.",
            "Sentiment": "neutral",
            "PublishDate": 1735374112000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Health Reports Strong Q2 Financial Performance",
            "Summary": "Procter & Gamble Health announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.14 billion rupees from 887 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 36.39% from 29.08% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730724289000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Health Reports Q2 Revenue Growth",
            "Summary": "Procter & Gamble Health announced its second-quarter revenue of 3.1 billion rupees, showing a slight increase from 3.05 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730724280000,
            "Source": "result"
        },
        {
            "Title": "Procter & Gamble Health Reports Q2 Net Profit Increase",
            "Summary": "Procter & Gamble Health announced its Q2 financial results, reporting a net profit of 823 million rupees. This represents a year-over-year increase from 656 million rupees and a quarter-over-quarter increase from 168 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730724270000,
            "Source": "result"
        },
        {
            "Title": "P&G: Investing in Quick Commerce to Drive Growth in India",
            "Summary": "<p>Procter & Gamble is <span class='positive'>investing</span> in understanding consumer behavior in <span class='neutral'>quick commerce</span>, focusing on <b>metro and Tier-I cities</b> in India. The company is <span class='positive'>building curated brand experiences</span>, <span class='positive'>optimizing supply chains</span>, and <span class='positive'>leveraging data analytics</span> to <span class='positive'>grow quick commerce at twice the rate</span>. P&G has achieved <span class='positive'>60% fewer touchpoints</span> in its supply chain and <span class='positive'>implemented AI and ML systems</span> for distributor ordering.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728311544000,
            "Source": "normal_news"
        }
    ]
}