{
    "Symbol": "PGIL",
    "ISIN": "INE940H01022",
    "News": [
        {
            "Title": "Pearl Global Industries corrects registered office address",
            "Summary": "Pearl Global Industries Limited issues correction to its registered office address communication, updating the address to Pearl Tower, Plot No. 51, Sector-32, Gurugram-122001, Haryana.",
            "Sentiment": "neutral",
            "PublishDate": 1770629600730,
            "Source": "stocks"
        },
        {
            "Title": "Pearl Global Industries Shares Q3FY26 Call Recording",
            "Summary": "Pearl Global Industries has made available the audio recording of its Q3FY26 earnings conference call held on January 30, 2026, on its website for investor access.",
            "Sentiment": "neutral",
            "PublishDate": 1770460849870,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pearl Global Clarifies Share Price Movement to BSE",
            "Summary": "Pearl Global Industries responds to BSE inquiry on share price volatility, stating no undisclosed price-sensitive information and attributing movement to market circumstances beyond company control.",
            "Sentiment": "neutral",
            "PublishDate": 1770374339748,
            "Source": "stocks"
        },
        {
            "Title": "Pearl Global Q3FY26 Earnings Call on Feb 7, 2026",
            "Summary": "Pearl Global Industries Limited has scheduled its Q3FY26 earnings call for February 7, 2026 at 11:00 AM IST to discuss operational and financial performance for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769754784695,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pearl Global Industries Reports 12.7% Revenue Growth Despite US Tariff Challenges in H1 FY26",
            "Summary": "Pearl Global Industries achieved consolidated revenue of INR 2,541 crores in H1 FY26, growing 12.7% year-on-year, with adjusted EBITDA rising 18.4% to INR 236 crores despite facing 25% penalty tariffs on US exports from India. The company's diversified manufacturing strategy across Vietnam, Indonesia, Bangladesh and Guatemala helped maintain resilience, while US market exposure was reduced from 86% to below 50% as management navigated tariff pressures by shifting production and expanding into Japan, Australia, UK and EU markets.",
            "Sentiment": "positive",
            "PublishDate": 1763455474382,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries Reports Strong Q2 Results, Declares Rs 6 Interim Dividend",
            "Summary": "Pearl Global Industries Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors declared a first interim dividend of Rs 6 per equity share (120% on face value of Rs 5 each) for financial year 2025-26, with record date fixed as November 17, 2025. The dividend will be paid within 30 days to entitled members. The company's standalone other income for the half year included Rs 3,165.75 lakh dividend received from foreign subsidiaries. The company also granted 4,500 ESOPs to eligible employees and allotted 22,500 shares during the quarter on exercise of stock options. The results were approved by the Board at their meeting held on November 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762894321087,
            "Source": "corporate_action"
        },
        {
            "Title": "Pearl Global Industries Reports H1FY26 Revenue Growth of 12.7% to ₹2,541Cr with ₹250Cr Expansion Plan",
            "Summary": "Pearl Global Industries achieved revenue of ₹2,541 crores in H1FY26, marking a 12.7% year-on-year growth. The company reported EBITDA of ₹122 crores with a 9.3% margin. Pearl Global is implementing a ₹250 crore capital expenditure plan to expand capacity in India and Bangladesh. The company has diversified its export base across the US, UK, Japan, and Australia, reducing US market dependence to 50%. Vietnam and Indonesia hubs are showing strong growth performance. The company is focusing on automation, sustainability, and multi-hub manufacturing as part of its strategy for long-term margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762875076710,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries Reports 25% Jump in Q2 Net Profit to 733 Million Rupees",
            "Summary": "Pearl Global Industries reported consolidated net profit of 733 million rupees in Q2, up from 585 million rupees in the same period last year. Revenue increased to 13 billion rupees from 12 billion rupees year-over-year. EBITDA rose to 1.2 billion rupees compared to 967 million rupees previously, while EBITDA margin improved to 9.22% from 8.05% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762865465699,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries Allots 62,150 Equity Shares Under ESOP Plan 2022",
            "Summary": "Pearl Global Industries Limited allotted 62,150 equity shares with a face value of Rs. 5 each on November 6, 2025, to eligible employees of the company and its subsidiaries under the Employee Stock Option Plan 2022. The shares were issued at varying premiums of Rs. 145, Rs. 370, Rs. 670, and Rs. 715 per share. Following this allotment, the company's total issued share capital stands at Rs. 23,02,04,335. The newly issued shares are identical to existing shares in all respects and carry distinctive numbers from 4,59,78,718 to 4,60,40,867.",
            "Sentiment": "neutral",
            "PublishDate": 1762481381212,
            "Source": "corporate_action"
        },
        {
            "Title": "Pearl Global Industries Schedules Earnings Call for Q2 and H1 FY26 Results",
            "Summary": "Pearl Global Industries Limited has announced an analyst and investor earnings call to discuss operational and financial performance for the quarter and half year ended September 30, 2025. The call is scheduled for Wednesday, November 12, 2025, at 2:00 PM IST. Key participants include Managing Director Pallab Banerjee and Group CFO Sanjay Gandhi. The company has provided multiple dial-in numbers including international toll-free options for Hong Kong, Singapore, UK, and USA. Pre-registration is available to avoid wait times.",
            "Sentiment": "neutral",
            "PublishDate": 1762383256322,
            "Source": "earnings"
        },
        {
            "Title": "India's Textile Exports Face Major Decline Due to 50% US Tariffs",
            "Summary": "India's textile and apparel industry faces significant challenges following a 50% US tariff imposition. Pallab Banerjee, Managing Director of Pearl Global Industries, warns that India's $6 billion apparel exports could drop to 10-15% if tariffs remain for three to six months. US brands are demanding Indian exporters either absorb costs by reducing selling prices by 16% or shift manufacturing to other countries. Pearl Global Industries, with manufacturing operations in Bangladesh, Vietnam, Indonesia and Guatemala, can relocate production, but companies without such flexibility will lose business. The company has 50% exposure to the US market, with India representing 25% of total revenue, putting 12.5% of total revenue at risk. The timing impacts new order bookings for spring and summer products. India faces a 25-30% additional tariff disadvantage compared to competing countries like Bangladesh, Indonesia, and Vietnam. Pearl Global Industries shares closed 3.36% lower at Rs 1,235 on the NSE.",
            "Sentiment": "negative",
            "PublishDate": 1756436064318,
            "Source": "stock"
        },
        {
            "Title": "HDFC Mutual Fund Increases Stake in Pearl Global Industries to 7.23%",
            "Summary": "HDFC Mutual Fund increased its shareholding in Pearl Global Industries Limited from 5.10% to 7.23% of the paid-up equity share capital as of August 22, 2025. The increase represents a 2.17% rise in shareholding, with HDFC Mutual Fund acquiring 9,97,306 additional shares through open market transactions. The fund's total holding now stands at 33,23,447 shares. Pearl Global Industries' paid-up equity share capital is Rs. 22,98,93,585 comprising 4,59,78,717 equity shares of Rs. 5 each. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1756131155793,
            "Source": "mutualfunds"
        },
        {
            "Title": "Pearl Global Industries Reports 16.6% Revenue Growth Despite US Tariff Challenges",
            "Summary": "Pearl Global Industries achieved consolidated revenue of INR 1,228 crores in Q1 FY26, marking 16.6% year-on-year growth and the fifth consecutive quarter exceeding INR 1,000 crores. Adjusted EBITDA grew 13.4% with margins at 9.3%. The company faces significant challenges from US tariffs, with India operations subject to 25% reciprocal tariff plus 25% penalty tariff, while other manufacturing locations face 19-20% additional tariffs. Vietnam operations showed strong 75% revenue growth, while Indonesia grew approximately 50%. The company plans to reallocate US orders from India (which represents 16-18% of group revenue) to other manufacturing hubs including Vietnam, Bangladesh, Indonesia and Guatemala. India's standalone operations improved with 47.2% EBITDA growth and margins expanding 250 basis points to 7.3%. Management maintains confidence in their diversified geographic model to navigate trade uncertainties.",
            "Sentiment": "neutral",
            "PublishDate": 1755165669155,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries Reports 3.8% Growth in Q1 Net Profit to 678 Million Rupees",
            "Summary": "Pearl Global Industries reported consolidated net profit of 678 million rupees in Q1, up from 653 million rupees in the same period last year. Revenue increased to 12.27 billion rupees from 10.5 billion rupees year-over-year. EBITDA rose to 1.12 billion rupees compared to 982 million rupees previously, though EBITDA margin declined slightly to 9.15% from 9.34% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1754575183991,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global MD Says US Tariff Hike Forces Immediate Shift of Textile Orders from India",
            "Summary": "Pearl Global Industries faces immediate business impact from US tariff increase on Indian textile exports from 25% to 50%. MD Pallab Banerjee reports that global retailers are moving orders out of India to countries like Bangladesh, Vietnam, and Indonesia where Pearl Global has existing capacity. The company is rushing shipments before August 27 deadline to avoid additional tariffs on goods arriving in US before September 17. Pearl Global has been reducing US dependence and is realigning production - shifting US-bound orders from India while potentially moving non-US production into India. The company's market capitalization stands at ₹5,907.67 crore with shares gaining 37% over the past year.",
            "Sentiment": "negative",
            "PublishDate": 1754548259792,
            "Source": "stock"
        },
        {
            "Title": "Pearl Global Expects Limited Impact from US Tariff Changes, Cites Negotiation Tactics",
            "Summary": "Pearl Global Industries Managing Director Pallab Banerjee stated that proposed US tariff changes are unlikely to significantly affect the company's business. The Gurugram-based clothing exporter derives about 15% of its revenue from US exports. Banerjee described the tariff announcements as negotiation tactics, noting that customers may push the company to move operations to other countries but expects limited overall impact. He explained that tariffs on cotton garments from India, Indonesia, and Vietnam typically range from 12-19%, with synthetics at 26%. A previous 10% baseline tariff appears set to be replaced by a 25% tariff. Updated tariffs for Indonesia and Vietnam have been declared at 19% and 20% respectively. Banerjee noted the timing is challenging as spring-summer orders for Western countries are currently being booked, with some customers delaying orders from late July to early August. The company has a market capitalization of ₹6,966.96 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1753945479258,
            "Source": "stock"
        },
        {
            "Title": "Pearl Global Industries Presents Corporate Update Highlighting Strong Growth and Strategic Expansion",
            "Summary": "Pearl Global Industries Limited submitted its corporate presentation showcasing significant financial growth with revenue reaching Rs. 4,506 crores in FY25, representing a 32% CAGR. The apparel manufacturer operates 25 manufacturing facilities across 5 countries with a total capacity of 93.2 million units per year. Key highlights include achieving 74.3 million pieces shipped in FY25 versus 56.9 million in FY24, adjusted EBITDA margin of 9.2%, and ROCE of 30.5%. The company serves marquee clients including Kohl's, Target, Ralph Lauren, and Gap. PGIL plans Rs. 250 crore capex for FY26, focusing on capacity expansion in Bangladesh and India. The company expects to benefit from the India-UK FTA, positioning to scale UK revenue 2x-3x over 1-2 years. ICRA upgraded the company's credit rating to A- (Stable) for long-term and A2 for short-term facilities. The company maintains a dividend policy of at least 20% of consolidated profit after tax and targets Rs. 6,000 crores revenue by FY28 with 10-12% EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1753175067337,
            "Source": "stock"
        },
        {
            "Title": "Pearl Global Industries: Record Revenue and Profit in FY25",
            "Summary": "Pearl Global Industries Ltd reported highest-ever annual revenue of ₹4,506 crores for FY25, up 31.1% YoY. Adjusted EBITDA grew 29.8% to ₹411 crores, and PAT increased 42% to ₹248 crores. Q4 revenue rose 40.1% to ₹1,229 crores. Second interim dividend of ₹6.50 per share declared. India-UK FTA seen as strategic opportunity for growth.",
            "Sentiment": "positive",
            "PublishDate": 1747816103000,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries Reports Q4 Results and Declares Dividend",
            "Summary": "Pearl Global Industries has announced its Q4 financial results and a dividend declaration. The company's Q4 consolidated net profit increased to 682.4 million rupees, up from 513 million rupees year-over-year. Revenue rose to 12.29 billion rupees from 8.77 billion rupees in the same period last year. EBITDA improved to 1.2 billion rupees, compared to 808.4 million rupees year-over-year, with the EBITDA margin expanding to 9.8% from 9.21%. Additionally, the company declared a second interim dividend of 6.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747757325000,
            "Source": "result"
        },
        {
            "Title": "Pearl Global Industries: UK FTA to Boost Revenue Growth",
            "Summary": "Pearl Global Industries expects significant revenue growth from the India-UK Free Trade Agreement, projecting a 2-3x increase in UK market revenue within 1-2 years. The FTA eliminates up to 12% duties on Indian garment exports to the UK, enhancing competitiveness. The company has doubled its manufacturing capacity in India and is positioned to benefit from global efforts to diversify supply chains away from China.",
            "Sentiment": "positive",
            "PublishDate": 1746751720000,
            "Source": "normal_news"
        },
        {
            "Title": "Pearl Global Industries: Trump Tariffs Trigger 25% Stock Plunge",
            "Summary": "Pearl Global Industries' shares dropped 25% over two sessions following Trump's announcement of reciprocal tariffs on 60 countries. The company's exposure to higher-tariff countries like Bangladesh, Vietnam, and Indonesia through its manufacturing facilities has negatively impacted its stock performance.",
            "Sentiment": "negative",
            "PublishDate": 1743753223000,
            "Source": "normal_news"
        },
        {
            "Title": "Pearl Global Industries Incorporates Subsidiary in Bangladesh",
            "Summary": "Pearl Global Industries has announced the incorporation of a new subsidiary in Bangladesh. This subsidiary is set to establish facilities for knit fabric processing and garment manufacturing in the country.",
            "Sentiment": "positive",
            "PublishDate": 1742861424000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pearl Global Industries Incorporates Subsidiary in Bangladesh",
            "Summary": "Pearl Global Industries has announced the incorporation of a new subsidiary in Bangladesh. This strategic move likely aims to expand the company's operations and presence in the South Asian market.",
            "Sentiment": "positive",
            "PublishDate": 1742826769000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pearl Global Industries: Confident in Mitigating US Reciprocal Tariff Risks",
            "Summary": "Pearl Global Industries' MD Pallab Banerjee expresses confidence in mitigating potential US reciprocal tariff risks. The company's global manufacturing presence, with only 25% revenue from India, serves as a buffer. Banerjee doesn't foresee immediate tariff implementation due to potential inflation concerns in the US. He expects the textile and garment sector to maintain 3-5% annual growth.",
            "Sentiment": "positive",
            "PublishDate": 1740309309000,
            "Source": "normal_news"
        },
        {
            "Title": "Pearl Global Industries: Textile Stock Surges 3,000% in 6 Years",
            "Summary": "Pearl Global Industries' stock price has risen from ₹47 to ₹1,435 over the past six years, representing a 3,000% increase. The company reported a 45.3% YoY revenue increase in Q3 FY25, reaching ₹1,022.5 crore. With a strong order book and global presence, the company is well-positioned for continued growth in the Ready-Made Garment (RMG) export market.",
            "Sentiment": "positive",
            "PublishDate": 1739939203000,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries Reports Strong Q3 Financial Results",
            "Summary": "Pearl Global Industries has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 562.7 million rupees, up from 358 million rupees in the same quarter last year. Revenue also saw substantial growth, reaching 10.23 billion rupees compared to 7 billion rupees in the previous year. Quarter-on-quarter, net profit improved from 584.7 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739320361000,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries Reports Q3 EBITDA Growth",
            "Summary": "Pearl Global Industries has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 913.4 million rupees, up from 654 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 8.93% from 9.29% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739292629000,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries Reports Significant Revenue Growth in Q3",
            "Summary": "Pearl Global Industries has announced its financial results for the third quarter, reporting a substantial increase in revenue. The company's Q3 revenue reached 10.23 billion rupees, compared to 7 billion rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739292621000,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Pearl Global Industries has announced its Q3 consolidated net profit, which stands at 562.7 million rupees. This represents a substantial year-over-year increase from 358 million rupees in the same quarter last year. The company also saw a quarter-over-quarter improvement, up from 584.7 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739292615000,
            "Source": "earnings"
        },
        {
            "Title": "Pearl Global Industries to Increase Stake in PT Pinnacle Apparels",
            "Summary": "Pearl Global Industries has announced a strategic acquisition to increase its stake in PT Pinnacle Apparels to 89.9% through a USD 2.5 million investment. This move signifies a significant expansion of Pearl Global Industries' control over the subsidiary company.",
            "Sentiment": "positive",
            "PublishDate": 1733194941000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pearl Global Industries Reports Strong Q2 Results and Declares Interim Dividend",
            "Summary": "Pearl Global Industries announced its Q2 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 584.7 million rupees, up from 396.8 million rupees in the same quarter last year. Revenue also saw a substantial rise to 12 billion rupees, compared to 9.6 billion rupees in the previous year. Additionally, the company declared an interim dividend of 5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1731455825000,
            "Source": "result"
        },
        {
            "Title": "Pearl Global Industries: Avendus Initiates 'Buy' Rating with 54% Upside",
            "Summary": "<p>Avendus Spark Institutional Equities <span class='positive'>initiated coverage</span> on Pearl Global Industries with a <span class='positive'>'buy' rating</span> and a <span class='positive'>target price of ₹1,350</span>, indicating a <span class='positive'>54% upside</span>. The company is positioned as a <span class='neutral'>proxy for the global Ready-Made Garment trade</span> with a <span class='positive'>diversified production base</span> across multiple countries. Avendus <span class='positive'>projects</span> PGIL's <b>volume</b>, <b>EBITDA</b>, and <b>PAT</b> to grow at approximately <span class='positive'>15%, 25%, and 31% CAGR</span> respectively over FY24-27.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728030827000,
            "Source": "normal_news"
        }
    ]
}