{
    "Symbol": "PHANTOMFX",
    "ISIN": "INE0MLZ01019",
    "News": [
        {
            "Title": "Phantom Digital Effects Acquires Tippett Studio",
            "Summary": "Phantom Digital Effects has completed the acquisition of Tippett Studio. This acquisition is expected to boost PhantomFX's performance starting from the second quarter of the fiscal year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1751614627000,
            "Source": "default"
        },
        {
            "Title": "Phantom Digital Effects Ltd: Small-Cap SME Announces ₹140 Crore Fundraising Plan",
            "Summary": "Phantom Digital Effects Ltd plans to raise ₹140 crore through a combination of Qualified Institutional Placement (QIP) and preferential issue. The company will raise up to ₹80 crore via QIP and ₹59.95 crore through preferential issue of warrants at ₹247 per warrant. The preferential issue includes allotments to both promoter and public investors, including marquee fund houses.",
            "Sentiment": "positive",
            "PublishDate": 1741425957000,
            "Source": "corporate_action"
        },
        {
            "Title": "Phantom Digital Effects Raises ₹139.95 Crore Through QIP and Preferential Issue",
            "Summary": "Phantom Digital Effects, a company with a market capitalization of ₹3.2 billion, has successfully raised ₹139.95 crore through a Qualified Institutional Placement (QIP) and preferential issue. The funds are intended to support the company's global expansion plans and integration of artificial intelligence technologies.",
            "Sentiment": "positive",
            "PublishDate": 1741338479000,
            "Source": "corporate_action"
        },
        {
            "Title": "Phantom Digital Effects Secures Contracts Worth 270 Million Rupees",
            "Summary": "Phantom Digital Effects, a company in the digital effects industry, has announced that it has been awarded contracts valued at 270 million rupees. This news indicates a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1735518093000,
            "Source": "order&deals"
        },
        {
            "Title": "Phantom Digital Effects Secures Contracts Worth 270 Million Rupees",
            "Summary": "Phantom Digital Effects has announced that it has secured new contracts valued at 270 million rupees. This development represents a significant business achievement for the company, potentially boosting its revenue and market position in the digital effects industry.",
            "Sentiment": "positive",
            "PublishDate": 1735313808000,
            "Source": "order&deals"
        }
    ]
}