{
    "Symbol": "PHOENIXLTD",
    "ISIN": "INE211B01039",
    "News": [
        {
            "Title": "Phoenix Mills allots 13,762 shares under ESOP plan",
            "Summary": "The Phoenix Mills Limited allotted 13,762 equity shares under its Employee Stock Option Plan 2018, increasing paid-up capital from ₹ 71,51,96,620 to ₹ 71,52,24,144.",
            "Sentiment": "neutral",
            "PublishDate": 1769605690032,
            "Source": "co_actions_results"
        },
        {
            "Title": "Phoenix Mills Q3FY26 Earnings Call on Jan 29",
            "Summary": "Phoenix Mills Limited announces earnings conference call scheduled for January 29, 2026 at 11:00 AM IST to discuss Q3FY26 and 9M FY26 financial results following board meeting on January 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769088486140,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nuvama Sets Buy Rating on Phoenix Mills at ₹2,228",
            "Summary": "Nuvama Securities has issued a buy recommendation for Phoenix Mills with a target price of ₹2,228 per share, indicating positive outlook for the retail real estate developer.",
            "Sentiment": "positive",
            "PublishDate": 1768189595497,
            "Source": "stocks"
        },
        {
            "Title": "Nomura Cuts Phoenix Mills Rating to Reduce",
            "Summary": "Nomura downgrades Phoenix Mills with a reduced target price of ₹1,450, signaling concerns about the retail real estate developer's near-term prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768189577913,
            "Source": "stocks"
        },
        {
            "Title": "Phoenix Mills Reports Strong Q3 FY26 Performance",
            "Summary": "Phoenix Mills delivered robust operational execution in Q3 FY26 with portfolio consumption rising 20% YoY to ₹4,787 crores and gross residential sales surging to ₹140 crores from ₹58 crores in Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1768176621051,
            "Source": "co_actions_results"
        },
        {
            "Title": "Phoenix Mills Q3 Update: Strong Growth Across Segments",
            "Summary": "Phoenix Mills reports 20% YoY retail consumption growth to ₹4,787 cr in Q3 FY26, office occupancy improves to 77%, and residential sales surge 141% YoY to ₹140 cr.",
            "Sentiment": "positive",
            "PublishDate": 1767981055934,
            "Source": "co_actions_results"
        },
        {
            "Title": "Phoenix Mills Q3 FY26 Residential Sales Surge 141%",
            "Summary": "The Phoenix Mills reported gross residential sales of approximately ₹140.00 crores in Q3 FY26, marking a significant 141% increase from ₹58.00 crores recorded in Q3 FY25, demonstrating strong growth in residential segment.",
            "Sentiment": "positive",
            "PublishDate": 1767976388362,
            "Source": "co_actions_results"
        },
        {
            "Title": "Phoenix Mills Q3 FY26 Consumption Rises 20% to ₹4,787 Cr",
            "Summary": "The Phoenix Mills Limited reported consumption of approximately ₹4,787 crores in Q3 FY26, marking a significant 20% increase compared to the corresponding quarter of the previous fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1767976366528,
            "Source": "co_actions_results"
        },
        {
            "Title": "Phoenix Mills Q3 FY26: 20% YoY consumption growth",
            "Summary": "The Phoenix Mills Limited reports strong Q3 FY26 performance with retail consumption at ₹4,787 cr (up 20% YoY), office occupancy improving to 77%, and residential sales reaching ₹140 cr versus ₹58 cr in Q3 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1767976122800,
            "Source": "stocks"
        },
        {
            "Title": "Phoenix Mills hits fresh 52-week high in December",
            "Summary": "Phoenix Mills stock breaks out from symmetrical triangle pattern and moves in upward channel, gaining over 13% in three months with experts targeting ₹1,950-2,000 levels.",
            "Sentiment": "positive",
            "PublishDate": 1766706141105,
            "Source": "stocks"
        },
        {
            "Title": "Phoenix Mills Subsidiary Acquires 70% Stake in Solar Power Company for Rs 7.02 Crore",
            "Summary": "Classic Mall Development Company Limited, a wholly owned subsidiary of The Phoenix Mills Limited, has entered into agreements to acquire 70,19,386 Class A equity shares of Torrent Urja22 Private Limited for Rs 7,01,93,860 to purchase renewable energy from their captive solar power plant. The acquisition enables Classic Mall to become a captive user of solar power and comply with Electricity Act requirements by holding minimum 26% shareholding for captive status.",
            "Sentiment": "positive",
            "PublishDate": 1764319604984,
            "Source": "order&deals"
        },
        {
            "Title": "The Phoenix Mills Seeks Shareholder Approval for Leadership Restructuring and Director Remuneration",
            "Summary": "The Phoenix Mills Limited has issued a postal ballot notice seeking shareholder approval to redesignate Mr. Shishir Shrivastava from Managing Director to Non-Executive Vice Chairman for two years from October 1, 2025 to September 30, 2027. The company also seeks approval to pay remuneration including commission to Non-Executive Directors for five financial years starting from April 1, 2025, not exceeding one percent of net profits annually.",
            "Sentiment": "neutral",
            "PublishDate": 1764318453864,
            "Source": "corporate_governance"
        },
        {
            "Title": "The Phoenix Mills Allots 6,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "The Phoenix Mills Limited allotted 6,000 equity shares of ₹2 each to employees under its Employee Stock Option Plan 2018, following approval from the Compensation Committee. The company's paid-up equity share capital increased from ₹71,51,84,620 to ₹71,51,96,620, consisting of 35,75,98,310 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764246440465,
            "Source": "corporate_action"
        },
        {
            "Title": "Phoenix Mills Increases Stake in Island Star Mall Developers to 58.33%",
            "Summary": "Phoenix Mills acquired 62,66,737 equity shares of its material subsidiary Island Star Mall Developers Private Limited from Canada Pension Plan Investment Board for Rs. 275.73 crores. The acquisition increased Phoenix Mills' shareholding from 55.57% to 58.33%, while CPP Investments' stake decreased from 44.43% to 41.67%.",
            "Sentiment": "neutral",
            "PublishDate": 1763142162283,
            "Source": "order&deals"
        },
        {
            "Title": "Phoenix Mills Acquires Additional 44.43% Stake in ISMDPL for Rs 2,757 Crores",
            "Summary": "The Phoenix Mills Limited entered into a Share Purchase Agreement to acquire 62,66,737 equity shares of Island Star Mall Developers Private Limited (ISMDPL) from Canada Pension Plan Investment Board (CPP Investments) for Rs 275,73,64,597. This acquisition is part of a framework agreement executed in July 2025 to provide complete exit to CPP Investments from its 49% equity shareholding in ISMDPL. Following the transaction, Phoenix Mills will hold 100% shareholding in ISMDPL, making it a wholly owned subsidiary. ISMDPL operates Phoenix MarketCity Bengaluru and has three subsidiaries managing mall properties in Pune, Bengaluru, and Indore. ISMDPL reported standalone turnover of Rs 28,362.73 lakhs and consolidated turnover of Rs 91,973.14 lakhs as of March 31, 2025. The transaction completion is expected within five days from the execution date.",
            "Sentiment": "positive",
            "PublishDate": 1762996015121,
            "Source": "order&deals"
        },
        {
            "Title": "Phoenix Mills Increases Stake in ISMDPL to 55.57% Following CPP Investments Exit",
            "Summary": "The Phoenix Mills Limited's shareholding in its material subsidiary Island Star Mall Developers Private Limited (ISMDPL) increased from 51% to 55.57% after ISMDPL completed a buyback of 2,03,40,909 equity shares from Canada Pension Plan Investment Board (CPP Investments) for Rs. 895 crores. Phoenix Mills did not participate in the buyback. This transaction is part of a framework agreement executed in July 2025 to provide a complete exit to CPP Investments from its 49% equity stake in ISMDPL through various transaction modes. ISMDPL operates Phoenix MarketCity Bengaluru and has three subsidiaries managing mall and commercial developments in Pune, Bengaluru, and Indore. ISMDPL reported standalone turnover of Rs. 28,362.73 lakhs and consolidated turnover of Rs. 91,973.14 lakhs as of March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762928871629,
            "Source": "corporate_action"
        },
        {
            "Title": "Phoenix Mills Invests Rs 5.93 Crore in Solar Power Company for Renewable Energy Requirements",
            "Summary": "Phoenix Mills Limited and its subsidiary Offbeat Developers Private Limited have entered into agreements with JSW Neo Energy Limited and O2 Renewable Energy XXVIII Private Limited to invest Rs 5.93 crore in equity shares and convertible debentures. The investment includes Rs 2.82 million by Phoenix Mills for equity shares and Rs 25.38 million for convertible debentures, while Offbeat will invest Rs 3.11 million in equity and Rs 27.99 million in debentures. The companies will acquire up to 45% shareholding in O2 Renewable XXVIII, which was incorporated in July 2024 to develop solar power projects. Additionally, both companies signed a Power Purchase Agreement to procure solar power from O2 Renewable XXVIII to meet their captive renewable energy requirements. The acquisition aims to comply with Electricity Act 2003 requirements for maintaining minimum 26% shareholding for captive user status. The transaction is expected to complete within 90 business days and does not involve related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1762384088452,
            "Source": "order&deals"
        },
        {
            "Title": "Phoenix Mills Reports 22% Revenue Growth in Q2 FY26, Announces Leadership Transition",
            "Summary": "Phoenix Mills reported strong quarterly results with revenue of Rs. 1,115 crore, up 22% year-on-year, and EBITDA of Rs. 667 crore, up 29%. For the first half of FY26, revenue reached Rs. 2,068 crore, reflecting 14% growth, while consolidated EBITDA stood at Rs. 1,231 crore, up 17%. The retail portfolio showed robust performance with retailer sales of Rs. 7,335 crore in H1 FY26, up 13% year-on-year. The company announced the elevation of Shishir Shrivastava to Vice Chairman, transitioning from his role as Group CEO and Managing Director. Net debt declined by Rs. 500 crore in H1 FY26 to Rs. 2,200 crore, with net debt to EBITDA ratio remaining healthy at less than 1x. The office portfolio achieved over one million square feet of gross leasing, with occupancy improving from 67% to over 77%. Residential sales crossed Rs. 287 crore in the first half, surpassing full-year FY25 sales.",
            "Sentiment": "positive",
            "PublishDate": 1762381744243,
            "Source": "earnings"
        },
        {
            "Title": "Phoenix Mills Signs 59.3 Million Rupee Deal with JSW Neo Energy and O2 Renewable",
            "Summary": "Phoenix Mills has entered into an agreement with JSW Neo Energy and O2 Renewable worth 59.3 million rupees. The deal involves these three companies, though specific details about the nature of the agreement were not disclosed.",
            "Sentiment": "neutral",
            "PublishDate": 1762328995835,
            "Source": "order&deals"
        },
        {
            "Title": "The Phoenix Mills Reports Strong Q2 Growth with Net Profit Rising to 3 Billion Rupees",
            "Summary": "The Phoenix Mills delivered robust quarterly performance with consolidated net profit increasing to 3 billion rupees from 2.2 billion rupees year-over-year. Revenue grew to 11.2 billion rupees compared to 9.2 billion rupees in the same period last year. EBITDA rose to 6.7 billion rupees from 5.2 billion rupees year-over-year, while EBITDA margin improved to 59.79% from 56.39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762128836928,
            "Source": "earnings"
        },
        {
            "Title": "Phoenix Mills Expects Double-Digit Growth in Retail Portfolio for FY26",
            "Summary": "Phoenix Mills anticipates double-digit growth in its retail portfolio for FY26. This outlook was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1761994248813,
            "Source": "stock"
        },
        {
            "Title": "Phoenix Mills Reports Strong Q2 Performance with 36% Jump in Net Profit",
            "Summary": "Phoenix Mills delivered robust quarterly results with consolidated net profit rising to 3 billion rupees from 2.2 billion rupees year-over-year. Revenue increased to 11.2 billion rupees compared to 9.2 billion rupees in the same period last year. The company's EBITDA grew to 6.7 billion rupees from 5.2 billion rupees, while EBITDA margin expanded to 59.79% from 56.39% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761912449170,
            "Source": "earnings"
        },
        {
            "Title": "Phoenix Mills Reports 13% Year-on-Year Growth in Retailer Consumption",
            "Summary": "Phoenix Mills reported that retailer consumption increased by 13% year-on-year in Q2 FY26. The company announced this growth figure for its retail operations during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760314492906,
            "Source": "stock"
        },
        {
            "Title": "Phoenix Mills Reports Strong Growth Across Business Segments in Q2 & H1 FY26",
            "Summary": "The Phoenix Mills Limited reported robust performance across its business segments. Retail operations showed retailer consumption growth of 13% YoY in Q2 FY26 and 12% YoY in H1 FY26, with Phoenix Palladium Mumbai, Phoenix Citadel Indore, and other key malls leading the growth. Commercial offices demonstrated strong leasing momentum with gross leasing of 7.20 lakh sq. ft. completed during H1 FY26, while occupancy increased to 76% in September 2025 from 67% in March 2025. The hospitality segment showed mixed results - The St. Regis Mumbai delivered 2% YoY growth in Q2 FY26 with occupancy at 85% and ARR at Rs. 17,711, while Courtyard by Marriott Agra saw occupancy decline to 60% in Q2 FY26. The residential segment performed exceptionally well, with gross sales of Rs. 139 cr in Q2 FY26 compared to Rs. 27 cr in Q2 FY25, and H1 FY26 sales of Rs. 287 cr already surpassing full year FY25 sales.",
            "Sentiment": "positive",
            "PublishDate": 1760096339020,
            "Source": "stock"
        },
        {
            "Title": "Phoenix Mills Receives Approval for Voluntary Strike-off of Three Wholly Owned Subsidiaries",
            "Summary": "The Ministry of Corporate Affairs has approved the voluntary strike-off of three non-material wholly owned subsidiaries of The Phoenix Mills Limited. The subsidiaries are Enhance Holdings Private Limited, Sangam Infrabuild Corporation Private Limited, and Bartraya Mall Development Company Private Limited. These companies have ceased to be wholly owned subsidiaries of Phoenix Mills following the approval.",
            "Sentiment": "neutral",
            "PublishDate": 1759238168763,
            "Source": "corporate_action"
        },
        {
            "Title": "The Phoenix Mills Promotes Shishir Shrivastava to Non-Executive Vice Chairman",
            "Summary": "The Phoenix Mills has promoted Shishir Shrivastava to the position of Non-Executive Vice Chairman. This represents a leadership change within the company's executive structure.",
            "Sentiment": "positive",
            "PublishDate": 1759148843774,
            "Source": "corporate_governance"
        },
        {
            "Title": "Phoenix Mills Shareholders Approve Canada Pension Plan Investment Board's Exit from Subsidiary",
            "Summary": "The Phoenix Mills Limited shareholders approved a resolution regarding Canada Pension Plan Investment Board's exit from the company's subsidiary, Island Star Mall Developers Private Limited. The postal ballot voting was conducted through remote e-voting from August 15 to September 13, 2025. Out of 90,192 total shareholders on record as of August 8, 2025, the resolution received 98.59% votes in favor from valid votes cast. A total of 939 remote e-voting confirmations were received covering 15.91 crore shares, with 32 invalid confirmations excluded. The final tally showed 871 confirmations supporting the resolution (15.30 crore shares) and 36 against (21.94 lakh shares). The scrutinizer declared the ordinary resolution passed with the required majority.",
            "Sentiment": "neutral",
            "PublishDate": 1757785265376,
            "Source": "corporate_action"
        },
        {
            "Title": "Phoenix Mills Executes ₹76.98 Crore Block Trade on NSE",
            "Summary": "Phoenix Mills Ltd. completed a block trade worth ₹76.98 crores on the National Stock Exchange. The transaction involved approximately 508,242 shares at a price of ₹1,514.60 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756961826484,
            "Source": "order&deals"
        },
        {
            "Title": "Pallazzio Hotels Acquires 45% Stake in O2 Renewable Through Equity and CCD Allotment",
            "Summary": "Pallazzio Hotels, a subsidiary of Phoenix Mills, has acquired a 45% stake in O2 Renewable XXX. The acquisition was completed through equity and compulsory convertible debenture (CCD) allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1756485664357,
            "Source": "order&deals"
        },
        {
            "Title": "CCI Approves Phoenix Mills' Acquisition of Island Star Mall Developers",
            "Summary": "The Competition Commission of India has approved Phoenix Mills' planned takeover of Island Star Mall Developers. The regulatory clearance allows the company to proceed with the acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1755613654349,
            "Source": "order&deals"
        },
        {
            "Title": "Phoenix Mills Seeks Shareholder Approval for CPP Investments' Exit from Material Subsidiary",
            "Summary": "The Phoenix Mills Limited has issued a postal ballot notice seeking shareholder approval for Canada Pension Plan Investment Board (CPP Investments) to exit from Island Star Mall Developers Private Limited (ISMDPL), the company's material subsidiary. CPP Investments will receive Rs. 5,449.16 crore for its 49% stake in ISMDPL through various modes including dividend declaration, share buyback, or selective capital reduction. The transaction will be paid in four tranches over three years, enabling Phoenix Mills to gain 100% control of ISMDPL. The e-voting period runs from August 15 to September 13, 2025. ISMDPL operates retail and commercial properties across Bengaluru, Pune, and Indore with a combined retail area of 4.4 million sq.ft. and office space of 2.2 million sq.ft., generating Rs. 617 crore EBITDA in the latest results.",
            "Sentiment": "positive",
            "PublishDate": 1755187380002,
            "Source": "corporate_action"
        },
        {
            "Title": "Phoenix Mills Acquires CPP Investments' 49% Stake in ISMDPL for Rs 5,449 Crores",
            "Summary": "The Phoenix Mills Limited announced its board has approved acquiring CPP Investments' 49% stake in Island Star Mall Developers Private Limited (ISMDPL) for Rs 5,449 crores, payable over 36 months in four tranches. The transaction will give Phoenix Mills 100% ownership of the platform, which generated Rs 617 crores EBITDA in FY25 and comprises 4.4 million sq ft of operational retail space, 2.2 million sq ft of completed offices, and planned expansions. The company reported quarterly results showing 12% year-on-year retail consumption growth, though rental income grew only 4% due to planned repositioning at MarketCity malls and demolition of retail blocks at Phoenix Palladium. Hotel portfolio revenue increased 11% to Rs 130 crores with EBITDA growing 19% to Rs 58 crores. Group EBITDA reached Rs 544 crores, up 6%, while net debt to EBITDA improved and cost of debt reduced to 7.92%. The acquisition will be funded through ISMDPL's cash flows, dividends, buybacks, and available leverage headroom, with the transaction subject to shareholder and regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1753710845962,
            "Source": "earnings"
        },
        {
            "Title": "Phoenix Mills Shares Jump 6% on Quarterly Results and Rs 5,449 Crore Joint Venture Acquisition",
            "Summary": "Phoenix Mills shares rose 5.79% to Rs 1,532 following the release of quarterly results and acquisition announcement. The company reported a 2.2% year-on-year increase in net profit to Rs 320 crore, while revenue from operations grew 5% to Rs 953 crore. Phoenix Mills will acquire Canada Pension Plan Investment Board's 49% stake in joint venture Island Star Mall Developers for over Rs 5,449 crore, to be paid over 36 months in four tranches. This acquisition will increase Phoenix Mills' ownership from 51% to 100%, making it a wholly owned subsidiary. The stock has delivered approximately 147% returns over three years but remained flat over the past year. Technical indicators show the RSI at 36.0 and the stock trading below 5 out of 8 key moving averages.",
            "Sentiment": "positive",
            "PublishDate": 1753425800282,
            "Source": "stock"
        },
        {
            "Title": "Phoenix Mills Plans Multi-Asset Growth Strategy Across Retail and Residential Segments",
            "Summary": "Phoenix Mills is pursuing a comprehensive growth strategy focused on expanding its retail footprint and repositioning its brand. The company's plan includes launching new malls and leveraging strong residential sales performance. The strategy aims to drive long-term EBITDA growth and boost consumption across its multi-asset portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1753369130269,
            "Source": "stock"
        },
        {
            "Title": "Phoenix Mills Re-appoints Rajesh Kulkarni as Whole-time Director for Five Years",
            "Summary": "The Phoenix Mills Limited's Board of Directors approved the re-appointment of Rajesh Kulkarni as Whole-time Director for a five-year term from May 27, 2026 to May 26, 2031, subject to shareholder approval. The decision was made based on the Nomination and Remuneration Committee's recommendation. Kulkarni brings 34 years of experience in design and project management and has been with the company for 19 years. He has led the delivery of landmark real estate mixed-use developments including malls, hotels, and commercial office spaces, focusing on timely delivery, design excellence, and cost efficiency. Kulkarni is not related to any other company director and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1753361653950,
            "Source": "corporate_governance"
        },
        {
            "Title": "Phoenix Mills to Acquire Canada Pension Plan's 49% Stake in Island Star Mall Developers for Rs 5,449 Crores",
            "Summary": "Phoenix Mills has approved a Framework Agreement to acquire Canada Pension Plan Investment Board's 49% equity stake in Island Star Mall Developers Private Limited (ISMDPL) for Rs 5,449.16 crores. The transaction will make ISMDPL a wholly owned subsidiary of Phoenix Mills, increasing its shareholding from 51% to 100%. The consideration will be paid in four tranches over three years through various modes including dividend declaration, share buyback, selective capital reduction, or direct acquisition. ISMDPL operates Phoenix MarketCity Bengaluru and has three subsidiaries managing mixed-use developments in Pune, Bengaluru, and Indore. The company reported consolidated turnover of Rs 919.73 crores for the latest fiscal year. The transaction requires shareholder approval and regulatory clearances including Competition Commission of India approval. Phoenix Mills views this as a strategic opportunity to consolidate ownership in high-performing assets and strengthen its position in India's commercial and retail real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1753359426214,
            "Source": "order&deals"
        },
        {
            "Title": "Phoenix Mills Reports Growth in Q1 Financial Results",
            "Summary": "Phoenix Mills reported Q1 consolidated net profit of 2.4 billion rupees compared to 2.3 billion rupees in the same period last year. Revenue increased to 9.5 billion rupees from 9 billion rupees year-over-year. EBITDA rose to 5.6 billion rupees versus 5.3 billion rupees, while EBITDA margin improved to 59.21% from 58.73% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753358970603,
            "Source": "earnings"
        },
        {
            "Title": "Phoenix Mills Reports Q1 Results, Approves Acquisition of Remaining 49% Stake in Island Star Mall",
            "Summary": "The Phoenix Mills Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The Board approved an arrangement for the company to acquire the remaining 49% stake in its material subsidiary Island Star Mall Developers Private Limited from Canada Pension Plan Investment Board. Currently, Phoenix Mills holds 51% and CPP Investments holds 49% shareholding in ISMDPL. Post completion of the proposed transaction, Phoenix Mills will hold 100% shareholding and ISMDPL will become a wholly owned subsidiary. The arrangement is subject to shareholder approval and necessary regulatory approvals. Additionally, the Board approved the re-appointment of Mr. Rajesh Kulkarni as Whole-time Director for five years effective from May 27, 2026 to May 26, 2031, subject to shareholder approval. The company operates through three reportable segments: Property & related services, Hospitality services, and Residential Business, with 46 subsidiaries and 5 associates as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753358937470,
            "Source": "earnings"
        },
        {
            "Title": "Phoenix Mills Ltd. Sees Rs. 15.60 Crore Block Trade on NSE",
            "Summary": "Phoenix Mills Ltd. witnessed a block trade worth Rs. 15.60 crores on the National Stock Exchange. The transaction involved approximately 106,043 shares executed at a price of Rs. 1,470.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753161362387,
            "Source": "order&deals"
        },
        {
            "Title": "Phoenix Mills Schedules Earnings Call for July 24 to Discuss Q1 Results",
            "Summary": "The Phoenix Mills Limited will host an earnings conference call on July 24, 2025, at 6:00 PM IST to discuss financial results for the quarter ended June 30, 2025. The call will be attended by Managing Director Shishir Shrivastava, Group CFO Kailash B Gupta, and Group President Varun Parwal. The company's board meeting is scheduled for the same day to consider and approve unaudited standalone and consolidated financial results. The results will be announced after the board meeting concludes, and a results presentation will be shared prior to the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1753158226838,
            "Source": "earnings"
        },
        {
            "Title": "Motilal Oswal Midcap Fund Reduces Phoenix Mills Stake by 1.19%",
            "Summary": "Motilal Oswal Midcap Fund has reduced its stake in The Phoenix Mills by 1.19% during Q1. The fund has decreased its holding in the real estate and retail company.",
            "Sentiment": "neutral",
            "PublishDate": 1752851296329,
            "Source": "stock"
        },
        {
            "Title": "Phoenix Mills Approves Removal of Non-Material Subsidiaries",
            "Summary": "Phoenix Mills has approved the removal of certain non-material subsidiaries from its corporate structure. The company has not provided specific details about which subsidiaries are being removed or the reasons behind this decision.",
            "Sentiment": "neutral",
            "PublishDate": 1752499157000,
            "Source": "default"
        },
        {
            "Title": "Phoenix Mills Reports 12% YoY Increase in Q1 FY26 Retail Sales and Significant Growth in Residential Sales",
            "Summary": "Phoenix Mills has reported strong performance in the first quarter of fiscal year 2026. The company's retail sales increased by 12% compared to the same period last year. Additionally, gross residential sales reached 1.68 billion rupees, a substantial increase from 500 million rupees in the previous year. This growth in both retail and residential segments indicates positive momentum for Phoenix Mills in the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1751889851000,
            "Source": "default"
        },
        {
            "Title": "Phoenix Mills Ltd. Block Trade: 334,356 Shares at Rs. 1618.00",
            "Summary": "A block trade of approximately 334,356 shares of Phoenix Mills Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 1618.00 per share. The total value of the transaction was Rs. 54.10 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1750652826000,
            "Source": "block_details"
        },
        {
            "Title": "Phoenix Mills Ltd. Block Trade: 147,123 Shares at Rs. 1591.30",
            "Summary": "A block trade of approximately 147,123 shares of Phoenix Mills Ltd. occurred on the National Stock Exchange (NSE). The total value of the trade was Rs. 23.41 Crores, with shares priced at Rs. 1591.30 each.",
            "Sentiment": "neutral",
            "PublishDate": 1750050167000,
            "Source": "block_details"
        },
        {
            "Title": "Phoenix Mills Ltd: Block Trade of Rs. 53.12 Crores on NSE",
            "Summary": "A block trade of approximately 326,690 shares of Phoenix Mills Ltd. occurred on the National Stock Exchange (NSE) for a total value of Rs. 53.12 crores. The trade was executed at a price of Rs. 1625.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1749527513000,
            "Source": "block_details"
        },
        {
            "Title": "Phoenix Mills Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 632,478 shares of Phoenix Mills Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 1602.00 per share. The total value of the transaction was Rs. 101.32 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1749443414000,
            "Source": "block_details"
        },
        {
            "Title": "Phoenix Mills Expects Rental Growth and Consumption Boost from Mall Revamps",
            "Summary": "Phoenix Mills executives anticipate significant rental and consumption growth in the coming quarters. The revamping of the Courtyard retail zone at Phoenix Palladium is expected to drive meaningful increases over the next 12-18 months. The company also foresees strong consumption growth in Indore by FY27, attributed to improved mall access following highway completion. Overall, Phoenix Mills is optimistic about stronger rental growth as more stores in their malls mature and scale up.",
            "Sentiment": "positive",
            "PublishDate": 1746155601000,
            "Source": "default"
        },
        {
            "Title": "Phoenix Mills Reports Q4 Financial Results and Dividend",
            "Summary": "Phoenix Mills announced its Q4 consolidated net profit of 2.7 billion rupees, down from 3.27 billion rupees year-over-year and slightly up from 2.6 billion rupees quarter-over-quarter. Q4 revenue was reported at 10.2 billion rupees, a decrease from 13.1 billion rupees year-over-year. The company has recommended a dividend of 2.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746144780000,
            "Source": "default"
        },
        {
            "Title": "Phoenix Mills: Q4 Profit and Revenue Drop, Margin Widens; Dividend Declared",
            "Summary": "Phoenix Mills reported a 17.7% YoY decline in Q4FY25 net profit to ₹268.8 crore. Revenue fell 22.2% to ₹1,016.3 crore. EBITDA margin widened to 55%. Total consumption grew 15% YoY to ₹3,248 crore. The company declared a final dividend of ₹2.50 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746026509000,
            "Source": "earnings"
        }
    ]
}