{
    "Symbol": "PICCADIL",
    "ISIN": "INE546C01010",
    "News": [
        {
            "Title": "Piccadily Agro Grants 2,690 Stock Options to Employees",
            "Summary": "Piccadily Agro Industries approves grant of 2,690 stock options under Employee Stock Plan 2024 at exercise price of Rs. 10 per option with 3-year exercise period.",
            "Sentiment": "positive",
            "PublishDate": 1769253358341,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piccadily Agro Allots 71,705 ESOP Shares",
            "Summary": "Piccadily Agro Industries allotted 71,705 equity shares under ESOP Plan 2024, increasing paid-up capital from Rs.98,49,77,110 to Rs.98,56,94,160 following board approval on January 21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769251855616,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piccadily Agro Q3 Net Profit Surges 92% to ₹48.10 Cr",
            "Summary": "Piccadily Agro Industries reports strong Q3 performance with net profit jumping to ₹48.10 crores from ₹25.00 crores year-on-year, marking significant growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1768979437378,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piccadily Agro Shares Jump 13.9% on New Plant Launch",
            "Summary": "Indri whisky maker Piccadily Agro Industries shares hit over one-month high after commencing commercial production at its Chhattisgarh facility with 200 KL daily capacity from Dec. 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767247587609,
            "Source": "stocks"
        },
        {
            "Title": "Piccadily Agro Starts Chhattisgarh Distillery Operations",
            "Summary": "Piccadily Agro Industries commences commercial production at its new Chhattisgarh distillery unit with 200 KLPD capacity from December 31, 2025, strengthening manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1767178593543,
            "Source": "stocks"
        },
        {
            "Title": "Piccadily Agro Appoints New Chief HR Officer",
            "Summary": "Piccadily Agro Industries Limited has appointed Mr. Madabosi Sreenivasan Venkatesh as Chief Human Resources Officer effective December 17, 2025, bringing over 33 years of HR leadership experience.",
            "Sentiment": "positive",
            "PublishDate": 1766469717839,
            "Source": "stocks"
        },
        {
            "Title": "Piccadily Agro Forms Wholly Owned Food Subsidiary",
            "Summary": "Piccadily Agro Industries incorporates Piccadily Food Essentials Limited as wholly owned subsidiary with ₹1.00 lakh paid-up capital, receiving incorporation certificate on December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766076550223,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piccadily Launches Mumbai Duty-Free Whisky Edition",
            "Summary": "Piccadily Agro Industries unveils Indri City Series Mumbai edition, a limited Red Wine Cask single malt exclusively for Ospree Duty Free at ₹9,960, expanding premium whisky portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1765437373409,
            "Source": "stocks"
        },
        {
            "Title": "Piccadily Agro Industries Receives NSE Approval for Listing 28.49 Lakh Equity Shares from Debenture Conversion",
            "Summary": "Piccadily Agro Industries Limited obtained in-principle approval from NSE for listing 28,49,448 equity shares of Rs. 10 each arising from conversion of compulsory convertible debentures issued on preferential basis. The shares will be listed and admitted for trading upon confirmation from depositories NSDL/CDSL for credit to beneficiary accounts.",
            "Sentiment": "positive",
            "PublishDate": 1764925283048,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Industries Receives BSE Approval to List 28.49 Lakh Shares from Convertible Debentures",
            "Summary": "Piccadily Agro Industries has obtained BSE approval to list 28,49,448 shares issued at ₹734 each following conversion of convertible debentures. The listing approval affects existing shareholders through potential dilution and provides liquidity for debenture holders who converted their holdings to equity.",
            "Sentiment": "neutral",
            "PublishDate": 1764401836906,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Industries Receives BSE Approval for Listing 6.37 Lakh Equity Shares from Warrant Conversion",
            "Summary": "Piccadily Agro Industries Limited obtained BSE listing approval for 6,36,942 equity shares of Rs. 10 each issued at a premium of Rs. 775 to promoters following conversion of convertible warrants. The company must file additional approvals from NSE and confirmation letters from NSDL/CDSL within seven working days to receive trading approval, with non-compliance attracting fines as per SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1764400362550,
            "Source": "corporate_action"
        },
        {
            "Title": "Camikara Becomes First Indian Rum to Win 'Rum Brand Of The Year' at Spirits Business Awards 2025",
            "Summary": "Piccadilly Agro Industries' Camikara rum brand won the 'Rum Brand Of The Year' title at the Spirits Business Awards 2025, becoming the first Indian rum to achieve this recognition. The award was secured by outperforming established global rum brands, marking a significant milestone for the Indian spirits industry.",
            "Sentiment": "positive",
            "PublishDate": 1764223136784,
            "Source": "stock"
        },
        {
            "Title": "Piccadily Agro Industries Grants 976 Stock Options to Employees Under ESOP 2024",
            "Summary": "Piccadily Agro Industries' Nomination and Remuneration Committee approved the grant of 976 stock options to eligible employees under the Piccadily Agro Employee Stock Plan 2024, with each option exercisable at Rs. 10 per share. The options will vest after at least one year subject to service or performance milestones and can be exercised within three years from the vesting date to reward employee performance and attract talent.",
            "Sentiment": "positive",
            "PublishDate": 1763466655710,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Industries Publishes Quarterly Financial Results",
            "Summary": "Piccadily Agro Industries Limited has published its un-audited financial results for the quarter and half year ended September 30, 2025. The company informed BSE and NSE about the publication of these results in Business Standard newspapers (both English and Hindi editions) on November 10, 2025, in compliance with SEBI listing regulations. The communication was signed by Company Secretary and Compliance Officer Niraj Kumar Sehgal.",
            "Sentiment": "neutral",
            "PublishDate": 1762755722278,
            "Source": "earnings"
        },
        {
            "Title": "Piccadily Agro Industries Reports 6.8% Growth in Q2 Net Profit to 266 Million Rupees",
            "Summary": "Piccadily Agro Industries reported Q2 net profit of 266 million rupees compared to 249 million rupees in the same period last year. Revenue increased to 2.3 billion rupees from 2 billion rupees year-over-year. EBITDA rose to 468 million rupees from 425 million rupees, though EBITDA margin declined to 20.11% from 21.22% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762527257314,
            "Source": "earnings"
        },
        {
            "Title": "Piccadily Agro Industries' Indri Diwali Collector's Edition 2025 Wins 'Best World Whisky' at Las Vegas Global Spirits Awards",
            "Summary": "Piccadily Agro Industries' Indri Diwali Collector's Edition 2025 received the 'Best World Whisky' award with a score of 99.1 points at the Las Vegas Global Spirits Awards. This achievement represents India's second global whisky triumph.",
            "Sentiment": "positive",
            "PublishDate": 1759491692550,
            "Source": "stock"
        },
        {
            "Title": "Piccadily Agro Industries Wins Interim Injunction Against Radico Khaitan Over Vodka Trademark Dispute",
            "Summary": "Piccadily Agro Industries Limited filed a commercial suit against Radico Khaitan Limited for trademark infringement over vodka brands. Piccadily registered the trademark 'CASHMERE' in 2015 for luxury vodka and 'CASHMIR' in 2023, launching its first luxury vodka under the CASHMIR brand on May 23, 2025. Radico Khaitan subsequently launched a vodka under the brand 'KASHMYR' on July 28, 2025, in the same category at a similar price point. The District Court of Karnal issued an interim order on September 23, 2025, restraining Radico Khaitan and its affiliates from manufacturing, selling, advertising, or using the mark 'KASHMYR' or any deceptively similar mark to Piccadily's registered trademarks until final adjudication. Piccadily expects no financial implications from the litigation, while the quantum of claims remains sub judice.",
            "Sentiment": "positive",
            "PublishDate": 1758709475416,
            "Source": "stock"
        },
        {
            "Title": "Piccadily Agro Industries Schedules Board Meeting to Consider Conversion of 6.37 Lakh Warrants into Equity Shares",
            "Summary": "Piccadily Agro Industries Limited has scheduled a Board of Directors meeting for September 24, 2025, to consider the conversion of 6,36,943 convertible warrants into an equal number of equity shares. The board will also discuss other business matters during the meeting. The company has informed stock exchanges BSE and NSE about this scheduled meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1758286096358,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Converts CCDs to Raise ₹211.99 Crore",
            "Summary": "Piccadily Agro converted 28.49 lakh Compulsorily Convertible Debentures (CCDs) into equity shares at ₹744 per share, raising ₹211.99 crore. Authum Investment & Infrastructure received 4.03 lakh shares valued at ₹30 crore as part of this conversion.",
            "Sentiment": "positive",
            "PublishDate": 1757488476011,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Industries Reports Strong Q3 FY25 Results with 46% EBITDA Growth",
            "Summary": "Piccadily Agro Industries Limited reported total income of ₹208.3 crore for Q3 FY25, representing 8.5% year-on-year growth. EBITDA increased 46.1% to ₹50.9 crore with margin expansion to 24.4% from 18.1% in the previous year. PAT reached ₹25.0 crore, showing 32.1% growth excluding exceptional items from Q3 FY24. For nine months FY25, total income grew 13.8% to ₹618.9 crore while EBITDA surged 45.2% to ₹123.1 crore. The company's premium alcohol beverage brands achieved 51.87% volume growth, with flagship brand Indri single malt witnessing 43.54% sales volume growth. Revenue from distillery vertical increased 18.5% to ₹183.9 crore, while sugar vertical revenue declined 40.6% to ₹21.8 crore. The company expanded its presence to 28 countries and launched new products including Indri Diwali Edition and Camikara 3YO across 17 states. Promoters infused ₹50 crore through preferential allotment and appointed Natwar Agarwal as CFO.",
            "Sentiment": "positive",
            "PublishDate": 1757130915576,
            "Source": "earnings"
        },
        {
            "Title": "Piccadily Agro Industries Schedules Board Meeting to Consider Conversion of Compulsory Convertible Debentures",
            "Summary": "Piccadily Agro Industries Ltd has scheduled a Board of Directors meeting for September 10, 2025, to consider the conversion of 28,49,448 Compulsory Convertible Debentures (CCDs) into equity shares. Each debenture would be converted into one equity share for the Non-Promoter/Public Shareholder Category. The board will also discuss other agenda items as determined by the directors.",
            "Sentiment": "neutral",
            "PublishDate": 1757068709567,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Plans Major Capacity Expansion to Boost Revenue by 50%",
            "Summary": "Piccadily Agro announced plans to triple its ethanol capacity and double its malt and barrel storage by the first half of FY2026. The company expects this expansion to potentially increase revenue by around 50% in the near future, according to its annual report.",
            "Sentiment": "positive",
            "PublishDate": 1756883567013,
            "Source": "stock"
        },
        {
            "Title": "Piccadily Agro's Indri Whisky Achieves Record 2.04 Million Bottle Sales in 2024",
            "Summary": "Piccadily Agro Industries Limited announced that its Indri single malt whisky sold 2.04 million bottles in calendar year 2024, making it India's largest-selling single malt and the fastest-selling Indian single malt globally. The International Wine & Spirits Record (IWSR) certified Indri as the No.1 malt whisky in India. Sales comprised 1,24,000 cases domestically and 46,000 cases in overseas markets. CEO Praveen Malviya attributed the success to liquid quality and customer satisfaction, emphasizing the use of Indian ingredients and local barley. The company launched Indri in 2022 and operates manufacturing facilities in Indri, Haryana across 168 acres, producing malt, alcohol, ethanol, and sugar products.",
            "Sentiment": "positive",
            "PublishDate": 1756278325522,
            "Source": "stock"
        },
        {
            "Title": "Piccadily Agro Industries Reports Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Piccadily Agro Industries Ltd published its unaudited financial results for the quarter ended June 30, 2025 in Business Standard newspapers in both English and Hindi on August 14, 2025. The company reported total income from operations of Rs. 22,899.88 lakhs for the quarter, compared to Rs. 20,838.08 lakhs in the same quarter last year. Net profit after tax stood at Rs. 1,846.74 lakhs for the current quarter versus Rs. 1,381.60 lakhs in the corresponding quarter of the previous year. Basic earnings per share was Rs. 1.95 compared to Rs. 1.46 in the same quarter last year. The company's equity share capital remained at Rs. 9,501.13 lakhs. The results were reviewed by the audit committee and approved by the board of directors in meetings held on August 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755157612740,
            "Source": "earnings"
        },
        {
            "Title": "Piccadily Agro Industries Reports Strong Q1 Growth with Revenue Up to 2.29B Rupees",
            "Summary": "Piccadily Agro Industries delivered strong quarterly performance with revenue rising to 2.29 billion rupees compared to 2.1 billion rupees in the same period last year. EBITDA increased to 384 million rupees from 280 million rupees year-over-year, while EBITDA margin expanded to 16.75% from 13.44%. Net profit grew to 189 million rupees versus 143 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754992125601,
            "Source": "earnings"
        },
        {
            "Title": "Piccadily Agro Industries Launches Indri City Series Dubai Duty Free Limited Edition Whisky",
            "Summary": "Piccadily Agro Industries Limited announced the global launch of its Indri Single Malt Indian Whisky 'City Series' with an exclusive Dubai Duty Free edition. The limited release features two single cask expressions - Sauternes Cask (210 bottles) and Oloroso Sherry Cask (348 bottles) - both bottled at 58.5% ABV and individually numbered. Priced at approximately USD 150, the whiskies are available at Dubai International Airport's duty-free terminals. This marks the first international release of the City Series, following a successful Bengaluru Duty Free edition. The Dubai edition is designed as a tribute to the city's cultural heritage and modern elegance, targeting global travelers and whisky collectors. The launch is part of Indri's premium travel retail strategy, with the company positioning itself as the fastest growing single malt whisky brand in 2024.",
            "Sentiment": "positive",
            "PublishDate": 1754376644413,
            "Source": "stock"
        },
        {
            "Title": "Multiple Companies Announce Special Window for Physical Share Transfer Re-lodgement",
            "Summary": "Several companies including Piccadily Agro Industries Limited and Piccadily Sugar and Allied Industries Limited have announced a special window from July 7, 2025 to January 6, 2026 for re-lodgement of transfer requests for physical share certificates. This facility applies to transfer deeds lodged prior to April 1, 2019 that were rejected, returned or not attended due to deficiencies in documents or processes. The shares re-lodged for transfer will be processed only in dematerialised form during this window period. Shareholders can submit their transfer requests to the respective companies' Registrar and Share Transfer Agents during this period.",
            "Sentiment": "neutral",
            "PublishDate": 1753352682053,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Industries Launches Indri Agneya Single Malt Whisky",
            "Summary": "Piccadily Agro Industries Limited announced the launch of Indri Agneya, a lightly peated single malt Indian whisky. The product is matured in Sherry and Bourbon casks, offering a complex flavor profile with notes of nuttiness, ripe fruit, and gentle smokiness. Named after the Sanskrit word meaning 'belonging to fire,' Agneya is crafted in Indri village, Haryana, using indigenous 6-row barley gently kilned over peat smoke. Master Blender Surrinder Kumar stated the product aims to push boundaries and explore untapped space between familiar and unexpected whisky profiles. The whisky is available in Haryana at ₹3,800 and will be rolled out across premium retail outlets in India, global travel retail, and select international markets. Piccadily operates in distillery and sugar segments, with its flagship Indri brand becoming the fastest growing single malt whisky brand in 2024.",
            "Sentiment": "positive",
            "PublishDate": 1753349788687,
            "Source": "stock"
        },
        {
            "Title": "Piccadily Agro Industries: Indian Whisky Wins Global Awards",
            "Summary": "Indri Single Malt by Piccadily Agro Industries Ltd. won 'Best World Whiskey' at Miami Global Spirit Awards 2025 and 'India Whisky of the Year' at New York International Spirits Competition 2025. The brand has accumulated over 65 global awards in two years and achieved 100,000 cases in sales volume. Piccadily Agro Industries shares were up 4.09% on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1752743638000,
            "Source": "normal_news"
        },
        {
            "Title": "Piccadily Agro Industries: NSE Listing Set for July 2, 2025",
            "Summary": "Piccadily Agro Industries Limited will list on NSE on July 2, 2025, under symbol PICCADIL. The dual listing aims to enhance liquidity and attract institutional investors. The company, known for premium spirits like Indri Single Malt Whisky, is currently trading at ₹619.70 on BSE, up 8.30%.",
            "Sentiment": "positive",
            "PublishDate": 1751363012000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Approved for NSE Trading",
            "Summary": "Piccadily Agro has been approved for trading on the National Stock Exchange (NSE) starting from July 2, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1751351733000,
            "Source": "default"
        },
        {
            "Title": "Piccadily Agro Industries: Indian Rum Wins Gold at Global Spirits Awards",
            "Summary": "Camikara 3YO, produced by Piccadily Agro Industries, becomes the first Indian rum to win a gold medal at the Rum & Cachaça Masters Awards 2025 in London. This achievement places India among premium rum producers and challenges perceptions of Indian rums.",
            "Sentiment": "positive",
            "PublishDate": 1750831281000,
            "Source": "normal_news"
        },
        {
            "Title": "Piccadily Agro Industries Limited: Indian Rum Wins Gold at Global Competition",
            "Summary": "Camikara 3YO, produced by Piccadily Agro Industries Limited, has won a Gold Medal at the Rum & Cachaça Masters Awards 2025 in London. This marks the first time an Indian rum has achieved this recognition, positioning India in the premium rum market. Camikara is marketed as India's first pure cane juice aged rum, made without molasses or additives.",
            "Sentiment": "positive",
            "PublishDate": 1750673200000,
            "Source": "normal_news"
        },
        {
            "Title": "Piccadily Agro Industries: Raises ₹50 Crore Through Warrant Conversion at Premium",
            "Summary": "Piccadily Agro Industries Limited has raised ₹50 crore by converting share warrants to equity at ₹744 per share, a premium to the current market price of ₹576.50. The conversion, completed by June 12, 2025, increased the company's paid-up capital to ₹95.01 crore. Funds will be used for capacity expansion in premium alcoholic beverages.",
            "Sentiment": "positive",
            "PublishDate": 1750148439000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Industries Targets 1 Million Cases of Whistler Barrel Aged Blended Malt Whisky",
            "Summary": "Piccadily Agro Industries has set a goal to achieve sales of 1 million cases of their Whistler Barrel Aged Blended Malt Whisky over the next 3 years.",
            "Sentiment": "positive",
            "PublishDate": 1748995730000,
            "Source": "default"
        },
        {
            "Title": "Piccadily Agro Industries Sets Ambitious Whisky Production Goal",
            "Summary": "Piccadily Agro Industries has announced a target to produce 1 million cases of Whistler Barrel Aged Blended Malt Whisky within the next three years. This goal represents a significant production ambition for the company's whisky brand.",
            "Sentiment": "positive",
            "PublishDate": 1748952666000,
            "Source": "default"
        },
        {
            "Title": "Piccadily Agro Industries: Launches Luxury Vodka 'Cashmir'",
            "Summary": "Piccadily Agro Industries Limited, known for Indri-Trini single malt and Camikara rum, has introduced Cashmir, a premium vodka made from organic Indian winter wheat and Kashmir Valley glacial waters. Priced between ₹1500-₹2000, it will be available in select Indian cities and international markets.",
            "Sentiment": "positive",
            "PublishDate": 1747995692000,
            "Source": "normal_news"
        },
        {
            "Title": "Piccadily Agro Industries Ltd: Strong FY25 Results with 21.5% Profit Growth",
            "Summary": "Piccadily Agro Industries Ltd reported robust FY25 results with profit before tax up 21.5% to ₹144.2 crore. EBITDA rose 25.4% to ₹191.4 crore. Revenue grew 8% to ₹893 crore, driven by 40% growth in IMFL division. The company plans expansion, including new capacities at Indri facility and a project in Chhattisgarh for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1747821932000,
            "Source": "earnings"
        },
        {
            "Title": "Piccadily Agro Industries Reports Q4 Financial Results",
            "Summary": "Piccadily Agro Industries has released its Q4 financial results. The company reported revenue of 2.72 billion rupees, down from 2.85 billion rupees year-over-year. EBITDA was 660.7 million rupees, slightly lower than the previous year's 672.3 million rupees. However, the EBITDA margin improved to 24.32% from 23.62% year-over-year. Net profit for Q4 stood at 403.8 million rupees, compared to 435 million rupees in the same quarter last year and 250.5 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747757414000,
            "Source": "result"
        },
        {
            "Title": "Piccadily Agro Industries Ltd: Luxury Whisky Experience Centre Opens in Haryana",
            "Summary": "Piccadily Agro Industries Ltd launched a new whisky Experience Centre at its distillery in Indri, Haryana, offering guided tours, tastings, and interactive exhibits. The facility features traditional Northern Indian haveli-inspired design with sustainable elements. The company's Indri Single Malt Whisky, launched in 2022, has gained recognition with over 40 accolades.",
            "Sentiment": "positive",
            "PublishDate": 1743591318000,
            "Source": "normal_news"
        },
        {
            "Title": "Piccadily Agro Industries Reports Q3 Financial Results",
            "Summary": "Piccadily Agro Industries has released its financial results for the third quarter. The company reported a net profit of 250 million rupees, which is a decrease from 453 million rupees in the same quarter last year. However, the company's revenue increased to 2 billion rupees from 1.92 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738737080000,
            "Source": "earnings"
        },
        {
            "Title": "Piccadily Agro Industries: Q3 Results Announcement on February 5",
            "Summary": "Piccadily Agro Industries Ltd. will announce its Q3 FY2025 results on February 5, 2025. The board meeting will consider and approve the unaudited standalone and consolidated financial results for the quarter and nine months ended December 31, 2024. The trading window for designated persons is closed from January 1 until 48 hours after the results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1738578171000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Industries to Consider Q3 Results on February 5",
            "Summary": "Piccadily Agro Industries has announced that it will be considering its third quarter (Q3) financial results on February 5. This meeting is likely to involve the company's board of directors reviewing and potentially approving the financial statements for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738240251000,
            "Source": "earnings"
        },
        {
            "Title": "Piccadily Agro Industries: Penny Stock Soars 142x in Four Years",
            "Summary": "Piccadily Agro Industries Ltd shares have risen from ₹5.52 to ₹782.50 in four years, turning a ₹1 lakh investment into ₹1.42 crore. The stock has shown resilience despite recent market volatility, with a 170% return in the past year. The company, India's largest independent manufacturer of malt spirits, is expected to benefit from the government's ethanol blending program.",
            "Sentiment": "positive",
            "PublishDate": 1737779130000,
            "Source": "normal_news"
        },
        {
            "Title": "Piccadily Agro: Rs 1,000 Crore Investment for Expansion and Scottish Distillery",
            "Summary": "Piccadily Agro Industries Limited plans to invest Rs 1,000 crore to expand facilities in India and open a new distillery in Scotland. The company aims to increase production capacity to 460 KLPD, including 60 KLPD of malt spirits. Expansions include enhancing the Indri, Haryana plant, building a new facility in Chhattisgarh, and establishing a distillery in Portavadie, Scotland. The project is expected to complete within 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1731511262000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Industries Secures Rs 312 Crore for Expansion",
            "Summary": "Piccadily Agro Industries has successfully raised Rs 312 crore, which is a significant step towards implementing its ambitious Rs 1000 crore expansion plan. This fundraising effort demonstrates the company's commitment to growth and indicates potential for future development in its agro-industrial operations.",
            "Sentiment": "positive",
            "PublishDate": 1731492178000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piccadily Agro Industries Reports Strong Q2 Revenue Growth",
            "Summary": "Piccadily Agro Industries has announced its second quarter revenue results. The company reported revenue of 2 billion rupees, compared to 1.23 billion rupees in the same quarter of the previous year. This represents a significant year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731058269000,
            "Source": "result"
        },
        {
            "Title": "Piccadily Agro Industries Reports Significant Profit Growth in Q2",
            "Summary": "Piccadily Agro Industries has announced its Q2 financial results, reporting a net profit of 249 million rupees. This represents a substantial increase from the 119 million rupees net profit reported in the same quarter of the previous year, indicating a year-over-year growth of approximately 109%.",
            "Sentiment": "positive",
            "PublishDate": 1731058242000,
            "Source": "result"
        },
        {
            "Title": "Piccadily Agro: Indri Diwali Collector's Edition 2024 Wins Gold at Global Awards",
            "Summary": "Piccadily Agro's Indri Diwali Collector's Edition 2024 whisky has won a Gold Medal at the Whiskies of the World Awards 2024. The limited edition, bottled at 50% ABV, will be available in Gurugram, Haryana from October 25 at Rs 15,000.",
            "Sentiment": "positive",
            "PublishDate": 1729077236000,
            "Source": "normal_news"
        },
        {
            "Title": "Indri Single Malt Launches Travel Retail Exclusive in Bengaluru",
            "Summary": "<p><span class='neutral'>Piccadily Agro Industries'</span> brand <span class='positive'>Indri Single Malt</span> has introduced <b>'The City Series,'</b> a new line of <span class='positive'>travel retail exclusive</span> whiskies. The first release in this series is specifically for <span class='neutral'>Bengaluru Duty-Free</span>, targeting the <span class='positive'>travel retail market</span> and expanding the brand's presence in the <span class='positive'>premium spirits segment</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728348664000,
            "Source": "corporate_action"
        }
    ]
}