{
    "Symbol": "PIDILITIND",
    "ISIN": "INE318A01026",
    "News": [
        {
            "Title": "Pidilite Industries Announces Postal Ballot for Director",
            "Summary": "Pidilite Industries Limited announces postal ballot for appointment of Dr. Naushad Forbes as Independent Director. Remote e-voting commences February 11, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770826427253,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pidilite Ventures to invest Rs 3.75 crore in Buildnext",
            "Summary": "Pidilite's subsidiary Pidilite Ventures will invest up to Rs 3.75 crore in Buildnext Construction Solutions through convertible preference shares, acquiring up to 34% stake in the home design services company.",
            "Sentiment": "positive",
            "PublishDate": 1770643895444,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pidilite Industries Files Investor Presentation",
            "Summary": "Pidilite Industries submitted comprehensive investor presentation showcasing journey from 1959, portfolio evolution across established brands like Fevicol to emerging categories, and growth enablers including digital ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1770379972736,
            "Source": "stocks"
        },
        {
            "Title": "Pidilite Industries Targets Mid-Teens B2B Growth",
            "Summary": "Pidilite Industries expects 1-1.5% price growth through strategic pricing, with domestic B2B segment targeting mid-teens growth and EU trade deal benefits expected by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1770263417331,
            "Source": "stocks"
        },
        {
            "Title": "Pidilite Sets EBITDA Target of 20-24%, Eyes Growth",
            "Summary": "Pidilite Industries announces EBITDA margin target between 20% and 24%, aiming for higher end this year. Company plans to reinvest margin growth into new expansion opportunities for accelerated business growth.",
            "Sentiment": "positive",
            "PublishDate": 1770263391451,
            "Source": "stocks"
        },
        {
            "Title": "Pidilite MD Expects Sustained Double-Digit Growth",
            "Summary": "Pidilite Industries' Managing Director expresses confidence in maintaining double-digit growth momentum while anticipating improved export performance through tariff reductions.",
            "Sentiment": "positive",
            "PublishDate": 1770193248697,
            "Source": "stocks"
        },
        {
            "Title": "Pidilite Q3FY26 Results: Revenue Rises 10.88% YoY",
            "Summary": "Pidilite Industries reports strong Q3FY26 performance with revenue from operations growing 10.88% YoY to ₹3,436.18 crores. Net profit increases 12.48% to ₹601.21 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770123453151,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pidilite Industries Appoints Two Senior Executives",
            "Summary": "Pidilite Industries appointed Mrs. Ami Parikh as President-Legal and Mr. Rajesh Joshi as Chief Business Officer-New Businesses, effective February 2, 2026, bringing 25 and 30 years of experience respectively.",
            "Sentiment": "positive",
            "PublishDate": 1770020757734,
            "Source": "stocks"
        },
        {
            "Title": "Pidilite Appoints Dr. Naushad Forbes as Independent Director",
            "Summary": "Pidilite Industries board appointed Dr. Naushad Darius Forbes as Additional Director (Non-Executive and Independent) for five-year term effective January 21, 2026, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768981215944,
            "Source": "stocks"
        },
        {
            "Title": "Pidilite Q3FY26 Earnings Call Set for February 4",
            "Summary": "Pidilite Industries has scheduled its Q3FY26 results conference call for February 4, 2026, at 4:00 PM IST, with senior management including MD Sudhanshu Vats participating.",
            "Sentiment": "neutral",
            "PublishDate": 1768462833732,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pidilite Ventures completes Pepperfry share swap deal",
            "Summary": "Pidilite's subsidiary PVPL transferred entire Pepperfry shareholding to TCC Concept in 100% share swap transaction, acquiring 2.20% stake in TCC. Parent company reported 8.2% profit growth in Q2.",
            "Sentiment": "neutral",
            "PublishDate": 1767701080042,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pidilite Industries Subsidiary to Invest Up to Rs 51 Million in MagicDecor",
            "Summary": "Pidilite Industries' subsidiary has announced plans to invest up to Rs 51 million in MagicDecor. The investment represents the company's expansion strategy through its subsidiary operations.",
            "Sentiment": "positive",
            "PublishDate": 1764155898564,
            "Source": "order&deals"
        },
        {
            "Title": "Pidilite Industries Announces Leadership Change in HR Department",
            "Summary": "Pidilite Industries announced that Mr. Rahul Gama, Chief Human Resource Officer, has resigned to pursue opportunities outside the organization. His last working day will be January 31, 2026. The company has appointed Mr. Ashish Prasad as the new Chief Human Resource Officer effective November 14, 2025. Prasad is an IIM Ahmedabad graduate with over 28 years of experience in building materials, consumer and retail sectors. He has previously worked with companies including Asian Paints, Teamlease Services, Holcim India-ACC, Ashirvad Pipes, and earlier with Pidilite. His most recent role was Chief Executive Officer at Sintex BAPL.",
            "Sentiment": "neutral",
            "PublishDate": 1762943526732,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pidilite Subsidiary Nina Percept Faces Rs 2.1 Crore GST Penalty",
            "Summary": "Pidilite Industries disclosed that its subsidiary Nina Percept Private Limited received a penalty order of Rs 2,10,40,494 from the Joint Commissioner, Central GST Goa under the Central Goods and Services Tax Act. The order was dated October 31, 2025 and received via email on October 31, 2025. Pidilite stated the order is appealable and the company is reviewing it to evaluate next steps, including exercising its right to appeal to the highest authority as permitted by law. The company indicated there is no material impact on its financials, operations or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1762751190658,
            "Source": "stock"
        },
        {
            "Title": "Pidilite Reports 10.4% Revenue Growth in Q2 FY26 with Strong Consumer Segment Performance",
            "Summary": "Pidilite Industries reported standalone revenue of INR 3,272 crores for Q2 FY26, marking 10.4% value growth. The Consumer and Bazaar segment achieved 10.4% underlying volume growth, entering double-digit territory after five quarters. The B2B business recorded 9.9% underlying volume growth. Export business declined due to geopolitical uncertainty and tariffs in some markets. Gross margins improved by 0.5% due to benign input prices, with VAM consumption at 883 compared to 980 in the previous year. The company increased advertising and sales promotion expenditure by 80% in absolute terms. EBITDA margins remained at the same level as Q2 last year. Domestic subsidiaries reported 10.7% revenue growth with 22.6% EBITDA growth. Consolidated revenues reached INR 3,540 crores with 9.8% growth. Rural markets continue to outperform urban markets, though urban performance has shown improvement. Management expressed confidence in maintaining double-digit underlying volume growth and expects input costs to remain benign for the next 6 months.",
            "Sentiment": "positive",
            "PublishDate": 1762453108613,
            "Source": "earnings"
        },
        {
            "Title": "Pidilite Targets Double-Digit Volume Growth in H2 with Higher EBITDA Margins",
            "Summary": "Pidilite Industries expects to deliver double-digit underlying volume growth in the second half, driven by growth brand initiatives, product innovation, and marketing efforts. The adhesives and construction chemicals manufacturer reported 9.8% growth in consolidated net sales to Rs 3,540 crore for the September quarter, with EBITDA increasing 24%. For the first half, consolidated net sales rose 10.5% to Rs 6,740 crore with 25.2% EBITDA. Managing Director Sudhanshu Vats expects continued momentum with higher EBITDA margins if input costs remain benign, targeting the higher end of the 20-24% EBITDA corridor. The company anticipates improvement from favorable monsoons, GST 2.0 impact, and accelerated construction sector growth. Rural growth continues to outpace urban markets by 100-150 basis points, though urban growth showed pickup in the second quarter. Vats noted that geopolitical volatility has limited direct impact due to lower tariff exposure, with contingency plans in place for supply chain management.",
            "Sentiment": "positive",
            "PublishDate": 1762071055819,
            "Source": "earnings"
        },
        {
            "Title": "Pidilite Industries to Acquire Remaining 40% Stake in Subsidiary PCTWL for Rs 72,720",
            "Summary": "Pidilite Industries has agreed to purchase 7,27,200 equity shares in its subsidiary Pidilite C-Techos Walling Limited (PCTWL) from existing shareholder Chetana Exponential Technologies Private Limited. The cash transaction worth Rs 72,720 will increase Pidilite's shareholding in PCTWL from 60% to 100%, making it a wholly owned subsidiary. PCTWL operates in construction of building works and structural projects using C-Techos wall technology, and manufactures ACC panels. The company was incorporated in March 2020 and reported nil turnover as of March 2025, with previous turnover of Rs 0.47 crores in March 2023. The acquisition is expected to be completed on or before November 11, 2025, and does not constitute a material transaction for Pidilite.",
            "Sentiment": "neutral",
            "PublishDate": 1761851713219,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Reports Double-Digit Volume and Revenue Growth with Healthy Margins",
            "Summary": "Pidilite Industries announced financial results showing net sales growth of 10.4% to Rs 3,272 crores for the quarter and 10.5% to Rs 6,740 crores for the half-year period. The company achieved underlying volume growth of 10.3% for the quarter. Consumer and Bazaar segment revenue grew 10.8% with volume growth of 10.4%, while Business to Business segment grew 8.7% but was impacted by lower exports of industrial products due to higher tariffs. Gross margins improved by 47 basis points due to lower input costs. EBITDA margins remained stable at 24.7% for the quarter. Profit after tax increased to Rs 586 crores for the quarter and Rs 1,236 crores for the half-year. Managing Director Sudhanshu Vats noted the company delivered growth despite challenging macro-economic conditions and expressed optimism about domestic market improvement aided by favorable monsoons and construction sector growth.",
            "Sentiment": "positive",
            "PublishDate": 1761841482902,
            "Source": "earnings"
        },
        {
            "Title": "Pidilite Industries Projects 10-11% Revenue Growth for FY26 with Stable EBITDA Margins",
            "Summary": "Pidilite Industries has projected revenue growth of 10-11% for FY26 while maintaining EBITDA margins at 24-25%. The company's consumer and bazaar segment unit volume growth is expected to rise 10%, while the B2B segment shows 11% improvement. The growth strategy includes new product launches under the Fevicol, Roff, and Dr. Fixit brands. The company plans to achieve a 70% renewable energy mix and continue sustained marketing investments to drive double-digit volume expansion and maintain margin stability through FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761838066842,
            "Source": "stock"
        },
        {
            "Title": "Pidilite Industries Reports Strong Double-Digit Volume Growth",
            "Summary": "Pidilite Industries reported strong double-digit growth in underlying volume.",
            "Sentiment": "positive",
            "PublishDate": 1761835729147,
            "Source": "stock"
        },
        {
            "Title": "Pidilite Industries Anticipates Improved Domestic Market Conditions",
            "Summary": "Pidilite Industries expects better conditions for its domestic operations. The company anticipates favorable market environment for its business activities within India.",
            "Sentiment": "positive",
            "PublishDate": 1761834708897,
            "Source": "stock"
        },
        {
            "Title": "Pidilite Industries Plans to Acquire 727,200 Shares in Pidilite C-Techos Walling",
            "Summary": "Pidilite Industries has announced plans to purchase 727,200 shares in Pidilite C-Techos Walling. The acquisition represents a strategic move by the company to increase its stake in the subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1761833162927,
            "Source": "stock"
        },
        {
            "Title": "Pidilite Industries Reports 8.4% Growth in Q2 Net Profit to ₹5.79 Billion",
            "Summary": "Pidilite Industries reported Q2 consolidated net profit of ₹5.79 billion compared to ₹5.34 billion year-on-year, falling short of analyst estimates of ₹6.08 billion. Revenue grew to ₹35.54 billion from ₹32.34 billion, exceeding estimates of ₹35.25 billion. EBITDA increased to ₹8.51 billion from ₹7.7 billion, slightly below estimates of ₹8.53 billion. EBITDA margin improved marginally to 23.93% from 23.77%, though it remained below the estimated 24.20%.",
            "Sentiment": "neutral",
            "PublishDate": 1761831123264,
            "Source": "earnings"
        },
        {
            "Title": "Pidilite Industries Receives Rs 13.41 Lakh GST Penalty Order",
            "Summary": "Pidilite Industries received a penalty order of Rs 13,41,276 from the State Tax Officer, Mobile Squad Bhilad Division 8 Vapi under the Central Goods and Services Tax Act. The order was dated October 19, 2025 and received via email on October 25, 2025. The company is reviewing the order and evaluating next steps, including exercising its right to appeal to the highest authority. Pidilite stated there is no material impact on the company's financials, operations or other activities.",
            "Sentiment": "neutral",
            "PublishDate": 1761562344530,
            "Source": "stock"
        },
        {
            "Title": "Pidilite Industries Independent Director Piyush Pandey Passes Away",
            "Summary": "Pidilite Industries announced the death of Shri Piyush Pandey, an Independent Director of the company, who passed away on October 24, 2025. The company informed stock exchanges BSE and NSE about this development through an official communication signed by Company Secretary Manisha Shetty.",
            "Sentiment": "negative",
            "PublishDate": 1761320166532,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pidilite Industries Plans ₹34 Crore Investment in Imagimake Play Solutions",
            "Summary": "Pidilite Industries announced plans to invest up to ₹34 crores in Imagimake Play Solutions through the acquisition of Compulsorily Convertible Preference Shares (CCPS) and equity stakes in the company.",
            "Sentiment": "positive",
            "PublishDate": 1760705440334,
            "Source": "order&deals"
        },
        {
            "Title": "Pidilite Shares Drop 50% Due to 1:1 Bonus Issue Price Adjustment",
            "Summary": "Pidilite Industries shares fell to Rs 1,493.35 from Rs 3,037.75, representing an apparent 51% decline that was actually a price adjustment following a 1:1 bonus issue implementation. The company declared a bonus issue giving shareholders one additional share for every share held, with September 23 as the record date. Investors needed to purchase shares by September 22 to qualify for bonus shares. This marks Pidilite's first bonus issue since March 2010, aimed at enhancing retail participation and improving stock liquidity. Over the past year, Pidilite shares declined 9.14%, but gained 5.91% over six months and 1.41% over three months. The stock was trading 1.5% lower at Rs 1,496.25 around 10:30 AM.",
            "Sentiment": "neutral",
            "PublishDate": 1758606110719,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Industries and Time Technoplast Set Monday as Final Day for Bonus Share Eligibility",
            "Summary": "Pidilite Industries and Time Technoplast have set Monday as the last trading session for investors to purchase shares to qualify for their respective bonus issues. Pidilite will issue one free bonus equity share of Rs 1 face value for every fully paid-up equity share held, while Time Technoplast will offer one free bonus equity share of Rs 2 face value for every share held. Both companies have fixed Tuesday, September 23, as the record date to determine eligible shareholders. Under India's T+1 settlement cycle, investors must purchase shares at least one trading day before the record date to qualify. The bonus shares will be credited on Wednesday, September 24, and will be available for trading from September 25. Pidilite Industries manufactures adhesives, sealants, construction chemicals, and industrial chemicals, known for brands like Fevicol and M-Seal. Time Technoplast is a multinational conglomerate manufacturing polymer and composite products including drums, containers, and HDPE pipes.",
            "Sentiment": "neutral",
            "PublishDate": 1758507885893,
            "Source": "corporate_action"
        },
        {
            "Title": "HDFC Bank and Pidilite Industries Emerge as India's Most Consistent Performers with Decade-Long Positive Returns",
            "Summary": "HDFC Bank and Pidilite Industries are the only two companies among over 6,500 listed firms to deliver positive returns every calendar year since 2015. HDFC Bank rose 14% in 2015 while Pidilite gained 2%, with both stocks achieving their strongest performance in 2017 with over 50% gains each. Even during challenging periods in 2018 and 2020, both maintained positive returns between 13-27%. In 2025, HDFC Bank is up 9% while Pidilite has risen 5%. Both stocks outperformed the Nifty 50 between 2015-2019, though they have underperformed the benchmark in recent years despite maintaining positive returns. Analyst sentiment remains strong with HDFC Bank receiving 96% 'buy' ratings from 49 analysts and a consensus price target of Rs 1,115.28 implying 14.2% upside. Pidilite has 61% 'buy' ratings from 18 analysts with a price target of Rs 3,293.11 suggesting 7.8% upside. HDFC Bank trades at 2.6 times price-to-book ratio against its five-year average of 2.8 times, while Pidilite trades at 60 times forward P/E compared to its five-year average of 68 times.",
            "Sentiment": "positive",
            "PublishDate": 1758269619684,
            "Source": "stock"
        },
        {
            "Title": "Pidilite Industries Sets September 23, 2025 as Record Date for 1:1 Bonus Share Issue",
            "Summary": "Pidilite Industries Limited has fixed September 23, 2025 as the record date for determining shareholders eligible for bonus equity shares in a 1:1 ratio. The bonus share issue was approved by shareholders on September 12, 2025. The company communicated this information to stock exchanges NSE and BSE through a regulatory disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1758025667943,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Industries Shareholders Approve Independent Director Appointment, Capital Increase, and Bonus Share Issuance",
            "Summary": "Pidilite Industries announced that shareholders approved three key resolutions through postal ballot voting. The company appointed Sandeep Kataria (DIN: 05183714) as an Independent Director with 99.84% votes in favor. Shareholders also approved increasing authorized share capital to Rs. 125 crores divided into 125 crore equity shares of Re. 1 each, receiving 97.76% approval. The bonus equity share issuance to members was approved with 97.81% votes in favor. The voting period ran from August 13 to September 11, 2025, with results announced on September 12, 2025. Mitesh Dhabliwala served as scrutinizer for the postal ballot process conducted through NSDL's e-voting platform. All three resolutions received requisite majority approval from the company's 5,21,421 shareholders as of the August 8, 2025 cut-off date.",
            "Sentiment": "positive",
            "PublishDate": 1757660866202,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Industries Reports 10.6% Revenue Growth with Special Dividend and Bonus Issue",
            "Summary": "Pidilite Industries delivered strong quarterly results with standalone revenue of INR 3,467 crores, representing 10.6% growth driven by 9.9% underlying volume growth. The company announced a special interim dividend of INR 10 per share and a 1:1 bonus issue to commemorate founder B.K. Parekh's 101st birth anniversary. EBITDA margins improved by 101 basis points to 25.6%, while profit before tax grew 18.5%. Consumer and Bazaar segment achieved 9.3% volume growth, while B2B segment recorded 12.6% growth. Rural markets continued outpacing urban growth. The company's tile adhesive brand Roff and waterproofing portfolio Dr. Fixit showed robust performance. Management expressed confidence in maintaining double-digit volume growth, supported by strong performance across regions and product categories. Consolidated revenues reached INR 3,742 crores with 15.8% EBITDA growth.",
            "Sentiment": "positive",
            "PublishDate": 1755170861458,
            "Source": "earnings"
        },
        {
            "Title": "Pidilite Industries Seeks Shareholder Approval for 1:1 Bonus Issue and Independent Director Appointment",
            "Summary": "Pidilite Industries has issued a postal ballot notice seeking shareholder approval for three resolutions. The company proposes to issue bonus equity shares in a 1:1 ratio, meaning one new bonus share for every existing share held, by capitalizing Rs. 51 crores from its securities premium account. To accommodate this bonus issue, the company also seeks approval to increase its authorized share capital from Rs. 99 crores to Rs. 125 crores. Additionally, shareholders will vote on appointing Sandeep Kataria as an Independent Director for a five-year term from August 30, 2025 to August 29, 2030. Kataria is the Global CEO of Bata Brands and holds a B.Tech from IIT Delhi and is a gold medalist from XLRI Jamshedpur. The remote e-voting period runs from August 13, 2025 at 9:00 AM to September 11, 2025 at 5:00 PM, with results to be declared by September 13, 2025. The bonus issue commemorates the 101st birth anniversary of the company's founder, B K Parekh.",
            "Sentiment": "positive",
            "PublishDate": 1754996229680,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Industries Targets Volume-Led Growth Through C&B Demand and Brand Investments",
            "Summary": "Pidilite Industries is focusing on sustained volume-driven growth strategy. The company is leveraging strong construction and building (C&B) demand along with strategic brand investments. The growth outlook is supported by improving domestic conditions, favorable monsoon impact, and liquidity measures.",
            "Sentiment": "positive",
            "PublishDate": 1754481966555,
            "Source": "stock"
        },
        {
            "Title": "Pidilite Industries Reports 10.6% Sales Growth, Announces 1:1 Bonus Shares and Special Dividend",
            "Summary": "Pidilite Industries reported consolidated net sales of ₹3,742 crore for the quarter ended June 30, 2025, representing a 10.6% increase. The company announced a 1:1 bonus share issue and special interim dividend of ₹10 per share to commemorate founder Shri BK Parekh's 101st birth anniversary. Consolidated profit after tax grew 18.7% to ₹678 crore, while EBITDA increased 15.8% to ₹941 crore with margins improving by 101 basis points. The company achieved underlying volume growth of 9.9% driven by its Consumer & Bazaar division (9.3% volume growth) and B2B segment (12.6% growth). Domestic subsidiaries posted 11.5% sales growth with EBITDA rising 31.7%, while international subsidiaries grew 6.4% with EBITDA up 9%. Managing Director Sudhanshu Vats noted strong volume growth despite challenging macroeconomic conditions and expressed cautious optimism about domestic market improvements. The bonus issue proposal requires shareholder approval. Shares were trading at ₹3,036.50, up 1.30% on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1754476873940,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Industries Reports Strong Quarterly Results, Announces Bonus Issue and Special Dividend",
            "Summary": "Pidilite Industries reported quarterly results that exceeded analyst expectations across key metrics. Net profit rose 18.7% year-on-year to ₹678 crore, beating the CNBC-TV18 poll estimate of ₹617 crore. Revenue increased 10.5% to ₹3,753 crore, slightly above the ₹3,700 crore estimate. EBITDA grew 16% to ₹941 crore, surpassing the ₹874 crore estimate, while EBITDA margin expanded 110 basis points to 25%, above the estimated 23.6%. The board approved a 1:1 bonus share issue with the record date to be determined, and declared a special dividend of ₹10 per share with August 13 as the record date. Following the results announcement, shares traded 1.4% higher at ₹3,037.3.",
            "Sentiment": "positive",
            "PublishDate": 1754472592396,
            "Source": "earnings"
        },
        {
            "Title": "Pidilite Industries Reports 10% Volume Growth in Q1, Exceeds Estimates",
            "Summary": "Pidilite Industries achieved 10% volume growth in Q1, surpassing estimates of 8-10%. The company's Managing Director expressed cautious optimism about improving domestic business conditions, citing favorable monsoons, strong construction demand, lower interest rates, and new liquidity measures as positive factors.",
            "Sentiment": "positive",
            "PublishDate": 1754472523223,
            "Source": "earnings"
        },
        {
            "Title": "Pidilite Industries Announces 1:1 Bonus Issue and Reports Q1 Results",
            "Summary": "Pidilite Industries' board has approved and declared a bonus issue in the ratio of 1:1. The company reported Q1 revenue of 35 billion rupees compared to 31 billion rupees year-over-year, falling short of the estimated 37 billion rupees. Q1 EBITDA reached 9.4 billion rupees versus 8.12 billion rupees year-over-year, exceeding the estimate of 8.74 billion rupees. The EBITDA margin improved to 25.1% from 23.94% year-over-year, surpassing the estimated 23.6%.",
            "Sentiment": "positive",
            "PublishDate": 1754471507279,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Industries Reports Q1 Consolidated Net Profit of 6.7 Billion Rupees, Beating Estimates",
            "Summary": "Pidilite Industries reported a consolidated net profit of 6.7 billion rupees for Q1, representing an increase from 5.7 billion rupees in the same quarter last year. The results exceeded analyst estimates of 6.2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1754470986108,
            "Source": "earnings"
        },
        {
            "Title": "Pidilite Industries to Consider First Bonus Share Issue in 15 Years",
            "Summary": "Pidilite Industries' board will meet on August 6 to consider issuing bonus shares to shareholders, marking the company's first such move since March 2010 when it declared a 1:1 bonus. The board will also review quarterly results alongside the bonus proposal. The adhesive manufacturer last issued free shares 15 years ago and has maintained regular dividend payments of ₹20, ₹16, and ₹11 per share in 2025, 2024, and 2023 respectively. The company conducted a share buyback in 2018 at ₹1,000 per share. For the June quarter, Pidilite is expected to report 9% revenue growth and 7.5% EBITDA growth, with volume growth projected between 8-10%. Shares are trading at ₹2,994, up 4.5% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754456838436,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Industries Board to Consider Special Interim Dividend and Bonus Share Issue on August 6",
            "Summary": "Pidilite Industries has scheduled a Board of Directors meeting for August 6, 2025, to consider unaudited financial results for the first quarter ended June 30, 2025. The board will also evaluate declaring a special interim dividend on equity shares for Financial Year 2025-26 and issuing bonus shares subject to shareholder approval. The company's trading window remains closed until August 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754053478715,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Industries Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Pidilite Industries announced its Q4 financial results, showing significant growth. The consolidated net profit increased to 4.2 billion rupees, up from 3.01 billion rupees year-over-year. Revenue rose to 31.4 billion rupees from 29.02 billion rupees in the same period last year. The company also declared a dividend of 20 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746749103000,
            "Source": "default"
        },
        {
            "Title": "Pidilite Industries: Rs 20 Per Share Dividend Announced for FY2025",
            "Summary": "Pidilite Industries has declared a dividend of Rs 20 per equity share for FY2025, subject to shareholder approval. The company's Q4 results show revenue up 8.2% to Rs 3,141 crore, EBITDA up 9.6% to Rs 632.5 crore, and net profit up 41% to Rs 422.3 crore year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746715943000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pidilite Industries: Q4 Profit Up 40%, Misses Estimates; ₹20 Dividend Declared",
            "Summary": "Pidilite Industries reported Q4 consolidated net profit of ₹427.5 crore, up 40.5% YoY but below estimates. Revenue rose 8.2% to ₹3,141 crore. EBITDA increased 9.6% to ₹623.5 crore with a margin of 20.1%. The company declared a dividend of ₹20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746713682000,
            "Source": "earnings"
        },
        {
            "Title": "Pidilite Industries Reports Q4 Results and Declares Dividend",
            "Summary": "Pidilite Industries announced its Q4 financial results and declared a dividend. The company's Q4 consolidated net profit increased to 4.2 billion rupees from 3.01 billion rupees year-over-year. Revenue rose to 31.4 billion rupees from 29.02 billion rupees. EBITDA improved to 6.3 billion rupees with a margin of 20.15%. The company also declared a dividend of 20 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746713400000,
            "Source": "result"
        },
        {
            "Title": "Pidilite Industries to Consider Q4 Results on May 8",
            "Summary": "Pidilite Industries has announced that it will consider its fourth quarter (Q4) financial results on May 8. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1744720805000,
            "Source": "default"
        },
        {
            "Title": "Pidilite Industries Appoints Sudhanshu Vats as Managing Director",
            "Summary": "Pidilite Industries has announced the appointment of Sudhanshu Vats as its new Managing Director. This change in leadership represents a significant development for the company, potentially impacting its future direction and strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1743552734000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pidilite Industries Appoints Sudhanshu Vats as Managing Director",
            "Summary": "Pidilite Industries has announced the appointment of Sudhanshu Vats as the company's new Managing Director. This change in leadership represents a significant development for the company, potentially impacting its future direction and management strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1743509782000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pidilite Industries: Rural Paint Market Expansion Strategy Unveiling This Summer",
            "Summary": "Pidilite Industries is entering the rural paint market, targeting untapped potential in small towns and villages. The company is piloting its paint business in four southern states and will reveal a comprehensive strategy by summer. Pidilite acknowledges potential margin dilution but sees significant growth opportunities in the rural sector due to rising per capita incomes and increasing demand for home improvements.",
            "Sentiment": "positive",
            "PublishDate": 1742801006000,
            "Source": "normal_news"
        },
        {
            "Title": "Pidilite Industries: Analysts Divided on Growth Prospects Amid Near-Term Instability",
            "Summary": "Pidilite Industries held an analyst meet, resulting in mixed views. Nuvama maintains a 'Buy' rating with a ₹3,660 target, citing growth potential in core business, tile adhesives, and waterproofing. Citi, however, recommends 'Sell' with a ₹2,800 target, noting potential near-term demand instability. Pidilite aims for double-digit underlying volume growth in the medium term. The stock is currently trading at ₹2,749.95, up 0.76% but down 4% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1742362557000,
            "Source": "normal_news"
        }
    ]
}