{
    "Symbol": "PIGL",
    "ISIN": "INE557Z01018",
    "News": [
        {
            "Title": "Power & Instrumentation Q3 FY26 earnings call Feb 17",
            "Summary": "Power & Instrumentation (Gujarat) Limited announces Q3 & 9M FY26 earnings conference call scheduled for February 17, 2026 at 1:00 PM IST, hosted by Kirin Advisors under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1770885373656,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power & Instrumentation Allots 6.78 Lakh Equity Shares",
            "Summary": "Power & Instrumentation (Gujarat) Limited allotted 6,78,000 equity shares upon conversion of warrants at Rs. 83.75 per share to promoter group entities, increasing paid-up capital to Rs. 18,70,09,000.",
            "Sentiment": "neutral",
            "PublishDate": 1769844545783,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Subsidiary Gets CPRI Approval for 11kV Busduct System",
            "Summary": "Peaton Electricals Company Limited, a subsidiary of Power & Instrumentation (Gujarat) Limited, received approval from Central Power Research Institute for its 11kV, 3000 Amp segregated phase busduct systems. The certification validates the busduct system for use in critical power infrastructure projects across industries, strengthening PIGL's position in the electrical infrastructure segment and opening new opportunities in industrial and infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1764250499893,
            "Source": "stock"
        },
        {
            "Title": "Power Instrumentation Gujarat Reports Strong Q2FY26 Performance, Secures ₹133.67 Cr New Orders",
            "Summary": "Power Instrumentation (Gujarat) Limited posted consolidated revenue of ₹70.91 crores and net profit of ₹4.71 crores in Q2FY26, while securing three significant contracts worth ₹133.67 crores including rural electrification and solar projects. The company also acquired additional 35.82% stake in Peaton Electrical Company Limited, raising its holding to 51.06% to strengthen backward integration in electrical infrastructure components.",
            "Sentiment": "positive",
            "PublishDate": 1763198870407,
            "Source": "earnings"
        },
        {
            "Title": "Power Infra Cons Private Limited Acquires Convertible Warrants in Power and Instrumentation (Gujarat) Limited",
            "Summary": "Power Infra Cons Private Limited, a promoter group entity, has acquired convertible warrants in Power and Instrumentation (Gujarat) Limited through preferential allotment. The acquisition involved 1,40,000 fully convertible warrants at Rs. 83.75 per warrant, representing 0.78% of total share capital and 0.66% of diluted share capital. Each warrant can be converted into one equity share of Rs. 10 face value within 18 months from the allotment date of November 6, 2025. Following this transaction, the acquirer's total holding increased to 16,50,000 shares and warrants, representing 9.16% of total share capital and 7.79% of diluted share capital. The target company's equity share capital stands at Rs. 17,77,29,000 comprising 1,77,72,900 equity shares, with total diluted share capital of Rs. 21,16,89,000 after considering warrant conversions.",
            "Sentiment": "neutral",
            "PublishDate": 1762597301936,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Instrumentation Gujarat Allots 2.5 Lakh Equity Shares Through Warrant Conversion",
            "Summary": "Power Instrumentation (Gujarat) Limited's Board of Directors approved the allotment of 2,50,000 equity shares of Rs. 10 each at a premium of Rs. 73.75 per share. The allotment resulted from the conversion of 2,50,000 convertible warrants out of a total 50,96,000 convertible warrants that were issued on September 21, 2024. The shares were allotted on a preferential basis to both promoter group and non-promoter group entities. The board meeting was held at the company's registered office in Ahmedabad.",
            "Sentiment": "neutral",
            "PublishDate": 1762442023557,
            "Source": "corporate_action"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Wins ₹21.39 Crore Factory Shed Project Contract",
            "Summary": "Power & Instrumentation (Gujarat) has secured a ₹21.39 crore order from ATS Techno Limited for a factory shed project. The contract encompasses design, supply, installation, testing, and commissioning services, with completion scheduled within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1760679768809,
            "Source": "order&deals"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Secures ₹102.78 Crore Orders for Distribution Infrastructure Project",
            "Summary": "Power & Instrumentation (Gujarat) has received orders worth ₹102.78 crores from Ajmer Vidyut Vitran Nigam Limited under the RDSS (Revamped Distribution Sector Scheme). The orders encompass supply, setup, installation, testing, and commissioning of distribution infrastructure in Dungarpur and Salumbar circles.",
            "Sentiment": "positive",
            "PublishDate": 1760072021334,
            "Source": "order&deals"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Limited Wins ₹68.22 Crore Distribution Infrastructure Order",
            "Summary": "Power & Instrumentation (Gujarat) Limited has secured a ₹68.22 crore order from Ajmer Vidyut Vitran Nigam Limited for a distribution infrastructure project in Rajasthan. The project is scheduled to be completed within 15 months. The company's market capitalization stands at ₹290 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759909442679,
            "Source": "order&deals"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Limited Wins INR 4.09 Crore Arbitration Award Against Chennai Port Trust",
            "Summary": "Power & Instrumentation (Gujarat) Limited received a favorable arbitration award of INR 4.09 crore plus 18% annual interest from the Arbitral Tribunal in a dispute with Chennai Port Trust. The award relates to an agreement dated March 21, 2014, for providing power supply arrangements for Navy at Madhusudan Jetty in Chennai Port Trust. The interest is applicable from September 15, 2025, until the actual payment date. The company stated this will have a positive impact on its financial position.",
            "Sentiment": "positive",
            "PublishDate": 1758011628713,
            "Source": "stock"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Acquires Additional 35.82% Stake in Peaton Electrical for Rs 12.54 Crore",
            "Summary": "Power & Instrumentation (Gujarat) Limited has acquired an additional 35.82% stake in Peaton Electrical Company Limited for Rs 12.54 crore through cash consideration. This acquisition increases PIGL's total shareholding from 15.24% to 51.06%, making Peaton Electrical a subsidiary. Peaton Electrical, incorporated in November 2006, manufactures LT panels, bus trunking systems, compact substations and other electrical materials. The company reported turnover of Rs 25.38 crore in FY 2022-23, Rs 23.63 crore in FY 2023-24, and Rs 36.04 crore in FY 2024-25. The transaction is classified as a related party transaction conducted at arm's length and has been approved by the Audit Committee and Board of Directors. Both companies plan to collaborate on product development, new technologies, and supply relationships in the electrical materials business. Peaton Electrical's existing promoters will continue managing operations post-acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1757597170825,
            "Source": "order&deals"
        },
        {
            "Title": "Power and Instrumentation (Gujarat) Limited Secures Rs. 9.5 Crore Solar Project Contract",
            "Summary": "Power and Instrumentation (Gujarat) Limited received a work order worth Rs. 9.5 crore from Sadashiv Projects India Private Limited for a 5 MWP solar ground-mounted project. The contract covers design, engineering, supply, and testing services for solar installations at various locations in Gujarat. The project is scheduled for completion within 6 months. The contract value excludes GST and involves a domestic entity with no related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1756363978905,
            "Source": "order&deals"
        },
        {
            "Title": "Power and Instrumentation (Gujarat) Limited Reports 40% Net Profit Growth in Q1 FY26",
            "Summary": "Power and Instrumentation (Gujarat) Limited reported strong quarterly results with net profit growing 40.18% year-on-year to ₹2.62 crores. Total revenue increased to ₹41.55 crores from ₹26.00 crores in the previous year quarter. EBITDA rose to ₹4.28 crores compared to ₹3.65 crores. The company secured significant orders worth ₹57.89 crores from Nyati Engineers and Consultants Private Limited for electrification of Udaipur Airport, Rajasthan, and ₹70.55 crores from Ajmer Vidyut Vitran Nigam Limited for distribution infrastructure. The company appointed Mr. Kasivishwanath as President of operations, bringing over two decades of experience in manufacturing and EPC sectors. PIGL is planning to increase its stake in Peaton Electricals Company Limited from 15% to 60%, which has secured a Siemens license for manufacturing low-voltage switchboards. The company celebrated 50 years of operations and has completed over 35 airport projects throughout its history.",
            "Sentiment": "positive",
            "PublishDate": 1755159559615,
            "Source": "earnings"
        },
        {
            "Title": "Power and Instrumentation (Gujarat) Limited Schedules Q1 FY26 Earnings Conference Call",
            "Summary": "Power and Instrumentation (Gujarat) Limited has announced a conference call to discuss Q1 FY26 earnings, scheduled for August 20, 2025 at 4:00 PM IST. The call will be hosted by Arihant Capital Markets Limited. The company's management team, including Managing Director Mr. Padmaraj Pillai and Chief Financial Officer Mr. Rohit Maheshwari, will represent the company during the earnings discussion. The company has provided dial-in numbers for participants and advised joining 5-10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1755092553198,
            "Source": "earnings"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Reports Mixed Q1 Results with Higher EBITDA but Lower Margins",
            "Summary": "Power & Instrumentation (Gujarat) reported Q1 EBITDA of 40 million rupees compared to 31 million rupees in the same period last year, representing a year-over-year increase. However, the company's EBITDA margin declined to 9.77% from 12.44% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755005925552,
            "Source": "earnings"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Reports 38% Jump in Quarterly Net Profit",
            "Summary": "Power & Instrumentation (Gujarat) reported a net profit of 25.8 million rupees for Q1, representing a 38% increase from 18.7 million rupees in the same period last year. The company's revenue grew significantly to 413 million rupees compared to 255 million rupees year-over-year, marking a 62% increase.",
            "Sentiment": "positive",
            "PublishDate": 1755002879022,
            "Source": "earnings"
        },
        {
            "Title": "Power and Instrumentation Secures ₹71 Crore Order",
            "Summary": "Power and Instrumentation has secured an order worth ₹71 crore. The company has a market capitalization of ₹227 crore.",
            "Sentiment": "positive",
            "PublishDate": 1754904549199,
            "Source": "order&deals"
        },
        {
            "Title": "Power and Instrumentation (Gujarat) Limited Secures Rs. 1.53 Crore Work Order for Udaipur Air Terminal",
            "Summary": "Power and Instrumentation (Gujarat) Limited has received a work order worth Rs. 1.53 crore from Nyati Engineering & Construction Private Limited for electrical work at Udaipur Air Terminal in Rajasthan. The order covers design, supply, installation, testing, and commissioning of the power supply system, with a completion timeline of 6 months. This brings the company's total cumulative value of work orders for the Udaipur Air Terminal project to Rs. 57.89 crore. The contract is with a domestic entity and does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1753198015898,
            "Source": "order&deals"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Appoints New Operations President",
            "Summary": "Power & Instrumentation (Gujarat) has named Kasivishwanath as the new Operations President for their EPC project management and growth strategy. The project is valued at over ₹1,000 crore. Kasivishwanath is described as an industry expert.",
            "Sentiment": "positive",
            "PublishDate": 1752246008000,
            "Source": "default"
        },
        {
            "Title": "Power & Instrumentation (Gujarat) Secures ₹17.07 Crore Solar EPC Project",
            "Summary": "Power & Instrumentation (Gujarat) has been awarded a contract for a 5MW Solar EPC (Engineering, Procurement, and Construction) project valued at ₹17.07 crore. This order represents a significant business opportunity for the company in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1737115560000,
            "Source": "order&deals"
        },
        {
            "Title": "Power And Instrumentation Expands Stake in Peaton Electricals, Acquires Siemens License",
            "Summary": "Power And Instrumentation is increasing its stake in Peaton Electricals from 15% to 60%. Additionally, Peaton Electricals has obtained a license from Siemens for manufacturing switchboards, potentially expanding its product offerings and market reach.",
            "Sentiment": "positive",
            "PublishDate": 1734998939000,
            "Source": "corporate_action"
        },
        {
            "Title": "Power and Instrumentation Expands Stake in Peaton Electricals, Secures Siemens License",
            "Summary": "Power and Instrumentation is increasing its stake in Peaton Electricals from 15% to 60%. Additionally, Peaton Electricals has obtained a license from Siemens for manufacturing switchboards.",
            "Sentiment": "positive",
            "PublishDate": 1734955836000,
            "Source": "corporate_action"
        },
        {
            "Title": "Power & Instrumentation Completes Key Project for Nuclear Fuel Complex",
            "Summary": "<p><span class='positive'>Power & Instrumentation</span> has <span class='positive'>successfully completed</span> a <span class='positive'>significant project</span> for the <b>Nuclear Fuel Complex (NFC)</b>, Kota, which is part of the Government of India's <b>Department of Atomic Energy</b>. This <span class='positive'>achievement</span> demonstrates the company's <span class='positive'>capability</span> in handling <span class='neutral'>critical projects</span> in the <span class='neutral'>nuclear energy sector</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728286043000,
            "Source": "corporate_action"
        },
        {
            "Title": "Power & Instrumentation Receives Commendation from NFC",
            "Summary": "<p><span class=\"positive\">Power & Instrumentation</span> has been <span class=\"positive\">recognized</span> by <b>NFC</b> (Nuclear Fuel Complex) for their <span class=\"positive\">outstanding performance</span>. This <span class=\"positive\">commendation</span> highlights the company's <span class=\"positive\">excellence</span> in their field of operation, likely related to power systems and instrumentation services in the <span class=\"neutral\">nuclear sector</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728285349000,
            "Source": "normal_news"
        }
    ]
}