{
    "Symbol": "PIIND",
    "ISIN": "INE603J01030",
    "News": [
        {
            "Title": "PI Industries Q3FY26 Results: Revenue Drops 29% YoY",
            "Summary": "PI Industries reported Q3FY26 consolidated revenue of ₹13,757 million, down 28% YoY. Net profit rose to ₹3,113 million vs ₹3,727 million last year. Board declared interim dividend of ₹5 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1770905039580,
            "Source": "co_actions_results"
        },
        {
            "Title": "PI Industries Board Meet on Feb 12 for Q3 Results",
            "Summary": "PI Industries Limited has scheduled a board meeting on February 12, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770230926215,
            "Source": "co_actions_results"
        },
        {
            "Title": "PI Industries Unveils New Corporate Logo Design",
            "Summary": "PI Industries Limited announced adoption of new corporate logo reflecting evolution into global life sciences company, maintaining PI brand name while showcasing expanded capabilities across multiple domains.",
            "Sentiment": "positive",
            "PublishDate": 1769696312122,
            "Source": "stocks"
        },
        {
            "Title": "PI Industries Adopts New Corporate Logo Design",
            "Summary": "PI Industries Limited announces adoption of refreshed corporate logo as part of brand identity update. The new design features stylized 'pi' in blue with yellow dot, maintaining company tagline.",
            "Sentiment": "neutral",
            "PublishDate": 1768826815745,
            "Source": "stocks"
        },
        {
            "Title": "PI Industries appoints Kamali Rajesh as Global CPO",
            "Summary": "PI Industries Limited announces senior management changes with Ms. Kamali Rajesh appointed as Global Chief People Officer and Mr. Balasubramaniam Aiyaswamy ceasing as CPO, both effective January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768821601866,
            "Source": "stocks"
        },
        {
            "Title": "PI Industries faces ₹3.90 cr GST demand order",
            "Summary": "PI Industries receives GST demand order worth ₹3.90 crores from Bhatinda tax authorities for FY 2021-22, primarily due to disallowed input tax credits. Company plans to contest the order.",
            "Sentiment": "negative",
            "PublishDate": 1767719713980,
            "Source": "stocks"
        },
        {
            "Title": "Kumiai Projects 5% Revenue Drop, 32% Profit Decline",
            "Summary": "Kumiai Chemical Industry, a key client of Pi Industries, forecasts a 5% revenue decline and 32% operating profit drop for FY26, potentially impacting Pi Industries' business outlook.",
            "Sentiment": "negative",
            "PublishDate": 1765519956440,
            "Source": "co_actions_results"
        },
        {
            "Title": "PI Industries Reports 16% Revenue Decline in Q2 FY26 Amid Global Agrochemical Downturn",
            "Summary": "PI Industries reported revenue of Rs. 18,723 million in Q2 FY26, marking a 16% decline from the previous year due to global crop protection industry headwinds, excessive rainfall in domestic markets, and regulatory disruptions in biologicals. The company expects recovery from Q4 FY26 based on customer delivery schedules and improved Rabi season prospects, while maintaining its long-term growth strategy across AgSciences, Pharma CRDMO, and Specialty Chemicals segments.",
            "Sentiment": "neutral",
            "PublishDate": 1763540100635,
            "Source": "corporate_governance"
        },
        {
            "Title": "PI Industries Reports Mixed Q2 Performance with Revenue Growth but Profit Decline",
            "Summary": "PI Industries announced its quarterly results with revenue from operations reaching ₹17,526 million compared to ₹17,691 million in the previous quarter. The company reported a profit of ₹4,911 million for the current quarter versus ₹4,643 million in the prior quarter. For the half-year period, revenue increased to ₹35,217 million from ₹41,432 million in the previous year, while profit declined to ₹9,554 million from ₹10,569 million. The company operates in agrochemicals manufacturing and distribution as its primary business segment. Total expenses for the quarter were ₹12,183 million. The Board of Directors approved these unaudited standalone and consolidated financial results at their meeting. Basic earnings per share stood at ₹32.36 for the quarter compared to ₹30.61 in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762874796343,
            "Source": "earnings"
        },
        {
            "Title": "PI Industries Reports 19.5% Decline in Q2 Net Profit to 4.09 Billion Rupees",
            "Summary": "PI Industries reported Q2 consolidated net profit of 4.09 billion rupees, down from 5.08 billion rupees in the same quarter last year. Revenue declined to 18.72 billion rupees from 22.2 billion rupees year-over-year. EBITDA decreased to 5.43 billion rupees from 6.28 billion rupees, while EBITDA margin improved to 29.02% from 28.32% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762856822846,
            "Source": "earnings"
        },
        {
            "Title": "PI Industries Schedules Q2 FY26 Earnings Conference Call for November 12, 2025",
            "Summary": "PI Industries Limited has scheduled an earnings conference call with analysts and investors for Wednesday, November 12, 2025 at 11:30 AM IST. The call will follow the announcement of unaudited financial results for the quarter and half year ended September 30, 2025. The session will begin with a management discussion on Q2 FY26 results, followed by a Q&A session. Senior management team members will represent the agri-sciences company during the call. Participants can pre-register through a provided link or use various toll-free dial-in numbers from different countries including Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762380658725,
            "Source": "corporate_action"
        },
        {
            "Title": "PI Industries Senior Management Personnel Ms. Shilpa Sachdeva Ceases Role",
            "Summary": "PI Industries Limited announced that Ms. Shilpa Sachdeva will cease to be part of the Senior Management Personnel effective October 26, 2025. The change is attributed to realignment and reallocation of roles and responsibilities within the organization. The company disclosed this information to stock exchanges BSE and NSE in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761549911738,
            "Source": "corporate_governance"
        },
        {
            "Title": "Kumiai Chemicals Raises Financial Outlook for PI Industries",
            "Summary": "Kumiai Chemicals has increased its financial outlook related to PI Industries. The announcement indicates an upward revision in financial projections.",
            "Sentiment": "positive",
            "PublishDate": 1760082055523,
            "Source": "stock"
        },
        {
            "Title": "PI Industries Block Trade Worth Rs. 71.70 Crores Executed on NSE",
            "Summary": "PI Industries Ltd. witnessed a block trade on the National Stock Exchange involving approximately 200,277 shares at Rs. 3,580 per share, totaling Rs. 71.70 crores. The transaction represents a significant institutional or bulk trading activity in the company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1759826707280,
            "Source": "order&deals"
        },
        {
            "Title": "PI Industries Shareholders Approve All 10 Resolutions at 78th Annual General Meeting",
            "Summary": "PI Industries Limited held its 78th Annual General Meeting on August 14, 2025, through video conferencing. All 10 resolutions presented to shareholders were passed with the required majority. Key approvals included adoption of financial statements for the year ended March 31, 2025, confirmation of interim dividend of Rs. 6.00 per share and declaration of final dividend of Rs. 10.00 per share. Shareholders also approved the re-appointment of Mayank Singhal as Vice Chairperson & Managing Director and Rajnish Sarna as Joint Managing Director. Board appointments included Lisa J. Brown's re-appointment as Independent Director, Vegulaparanan Kasi Viswanathan's appointment as Independent Director, and Dr. Tanjore Soundararajan Balganesh's appointment as Non-Executive Non-Independent Director. Additional resolutions covered auditor appointments and remuneration ratification. The voting results showed strong shareholder support across all categories including promoter groups, institutional investors, and public shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1755187400767,
            "Source": "corporate_action"
        },
        {
            "Title": "PI Industries Maintains Margin Expectations for FY26",
            "Summary": "PI Industries has kept its margin expectations unchanged for FY26. This information was shared during a conference call update.",
            "Sentiment": "neutral",
            "PublishDate": 1755077715885,
            "Source": "stock"
        },
        {
            "Title": "PI Industries Reports Decline in Q1 Financial Performance",
            "Summary": "PI Industries reported Q1 EBITDA of 5.2 billion rupees, down from 5.85 billion rupees year-over-year, though slightly below the estimated 5.26 billion. EBITDA margin decreased to 27.46% from 28.29% year-over-year, but exceeded the estimated 25%. Consolidated net profit fell to 4 billion rupees from 4.5 billion rupees year-over-year, while surpassing the estimated 3.89 billion. Revenue declined to 19 billion rupees from 20.7 billion rupees year-over-year, falling short of the estimated 21.05 billion.",
            "Sentiment": "negative",
            "PublishDate": 1755005844598,
            "Source": "earnings"
        },
        {
            "Title": "PI Industries Reports Sharp Decline in Chemical Exports",
            "Summary": "PI Industries experienced significant drops in chemical exports, with an 88% yearly decline and an 84% monthly decrease reported.",
            "Sentiment": "negative",
            "PublishDate": 1754976438146,
            "Source": "stock"
        },
        {
            "Title": "PI Industries: Shares Surge on Key Customer's Positive Outlook",
            "Summary": "PI Industries' stock rose up to 4% after its major customer, Kumiai Chemical Industries, increased its revenue guidance by 9% and EBITDA forecast by 34% for the year ending October 2025. Kumiai expects higher sales and profits, particularly from advanced overseas shipments in Agricultural Chemicals and Agriculture-Related Business segments.",
            "Sentiment": "positive",
            "PublishDate": 1749017327000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries Q4 Results and Dividend Announcement",
            "Summary": "PI Industries reported its Q4 financial results. The company's consolidated net profit was 3.3 billion rupees, down from 3.7 billion rupees year-over-year. Revenue increased to 17.9 billion rupees from 17.4 billion rupees in the same period last year. EBITDA rose slightly to 4.6 billion rupees from 4.53 billion rupees, while the EBITDA margin decreased to 25.57% from 27.85%. The company also recommended a dividend of 10 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747664991000,
            "Source": "result"
        },
        {
            "Title": "PI Industries Ltd. Sees Block Trade of Rs. 55.92 Crores on NSE",
            "Summary": "A significant block trade occurred for PI Industries Ltd. on the National Stock Exchange (NSE). Approximately 153,547 shares were traded at a price of Rs. 3641.80 per share, totaling Rs. 55.92 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1744789339000,
            "Source": "block_details"
        },
        {
            "Title": "PI Industries: US Tariff Pause Boosts Stock",
            "Summary": "PI Industries shares rose over 7% after the US announced a 90-day pause on reciprocal tariffs, potentially including India. The company's significant export revenue, particularly to North America, is a key factor in this positive market response.",
            "Sentiment": "positive",
            "PublishDate": 1744350528000,
            "Source": "normal_news"
        },
        {
            "Title": "Kumiai Forecasts Decline in Axeev Sales, Impacting PI Industries",
            "Summary": "Kumiai, a partner of PI Industries, has projected a decrease in sales of Axeev (Pyroxysulfone) by 5 billion yen in 2025. This forecast could potentially affect PI Industries' business operations and financial performance, as Axeev is likely a significant product in their portfolio.",
            "Sentiment": "negative",
            "PublishDate": 1741331499000,
            "Source": "corporate_action"
        },
        {
            "Title": "PI Industries' Key Customer Kumiai Reports Strong Earnings",
            "Summary": "Kumiai, a key customer of PI Industries, has reported strong earnings with a 36% year-over-year increase in operating income. This positive performance by Kumiai could potentially have favorable implications for PI Industries' business relationship and future prospects.",
            "Sentiment": "positive",
            "PublishDate": 1741328282000,
            "Source": "earnings"
        },
        {
            "Title": "PI Industries and C-CAMP Announce Strategic Partnership for Biocontrol Technologies",
            "Summary": "PI Industries and the Centre for Cellular and Molecular Platforms (C-CAMP) have formed a strategic partnership to drive innovation in biocontrol technologies. This collaboration aims to develop new solutions in the field of biological pest control, potentially leading to more sustainable agricultural practices.",
            "Sentiment": "positive",
            "PublishDate": 1740215749000,
            "Source": "corporate_action"
        },
        {
            "Title": "PI Industries Lowers FY25 Revenue Growth Forecast",
            "Summary": "PI Industries has revised its revenue growth guidance for the fiscal year 2025 downward. The management has reduced the forecast from high single-digit growth to low single-digit growth. This adjustment suggests a more conservative outlook for the company's financial performance in the coming fiscal year.",
            "Sentiment": "negative",
            "PublishDate": 1738901506000,
            "Source": "earnings"
        },
        {
            "Title": "PI Industries Declares Dividend of 6 Rupees per Share",
            "Summary": "PI Industries has announced a dividend of 6 rupees per equity share for its shareholders. This corporate action represents a distribution of the company's profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1738847073000,
            "Source": "corporate_action"
        },
        {
            "Title": "PI Industries: Q3 Profit Drops 17%, Misses Estimates",
            "Summary": "PI Industries reported a 17% decline in Q3 consolidated net profit to Rs 373 crore, falling short of analyst expectations. Revenue remained nearly flat at Rs 1,901 crore. The company's EBITDA decreased by 7.5% to Rs 512 crore, with margins narrowing to 26.9%. An interim dividend of Rs 6 per share was announced.",
            "Sentiment": "negative",
            "PublishDate": 1738844494000,
            "Source": "earnings"
        },
        {
            "Title": "PI Industries: Shares Marginally Up as Sensex Rises",
            "Summary": "PI Industries shares rose 0.5% to Rs 3498.65 amid a broader market uptick. The stock opened at Rs 3526.20 and fluctuated between Rs 3553.05 and Rs 3494.10. The company reported consolidated sales of Rs 2343.2000 crore for Q2 FY2025, up 9.41% QoQ and 8.29% YoY, with a net profit of Rs 508.2 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1737522906000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Share Price Dips Amid Broader Market Decline",
            "Summary": "PI Industries' share price fell 1.41% to Rs 3544.95 during Tuesday's trading session as the Sensex dropped 402.59 points. The stock hit a high of Rs 3617.00 and a low of Rs 3521.00, with a trading volume resulting in a turnover of Rs 1.07 crore on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1737447483000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Rises 1.13% Amid Sensex Gains",
            "Summary": "PI Industries shares traded at Rs 3592.90, up 1.13% as of 11:32AM IST on Monday. The stock's trading volume was 1973 shares with a turnover of Rs 0.71 crore. The company's P/E ratio stood at 30.72, and price-to-book value at 6.74.",
            "Sentiment": "neutral",
            "PublishDate": 1737352986000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Share Price Fluctuates Amid Sensex Gains",
            "Summary": "PI Industries' share price decreased 0.19% to Rs 3453.40 during Thursday's trade, with a trading volume of 4264 shares valued at Rs 1.47 crore on the NSE. The stock hit a high of Rs 3512.50 and a low of Rs 3447.00 during the session.",
            "Sentiment": "neutral",
            "PublishDate": 1737013387000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Fluctuates Amid Market Rise",
            "Summary": "PI Industries shares traded 0.22% lower at Rs 3446.80-3528.80 range during Wednesday's session. The Nifty50 and BSE Sensex were up 66.91 and 309.38 points respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1736923045000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Declines 2.53% in Tuesday's Trading",
            "Summary": "PI Industries shares fell 2.53% to Rs 3486.65 during Tuesday's trading session, with a high of Rs 3509.95 and a low of Rs 3405.00. Technical indicators suggest a bearish trend, with the stock trading below its 50-DMA and 200-DMA.",
            "Sentiment": "negative",
            "PublishDate": 1736835712000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Declines 1.08% Amid Market Volatility",
            "Summary": "PI Industries stock fell 1.08% to Rs 3621.50 during morning trading on Friday. The stock saw a gap up start but later declined. Trading volume was 2,972 shares with a turnover of Rs 1.07 crore. The stock's P/E ratio is 31.00 and price-to-book value is 6.74. It's currently trading below its 200-day and 50-day moving averages, indicating a bearish trend.",
            "Sentiment": "negative",
            "PublishDate": 1736486533000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Rises 1.73% Amid Market Decline",
            "Summary": "PI Industries shares increased by 1.73% to Rs 3694.35, despite the Sensex falling by 242.3 points. The stock opened at Rs 3649.50 and reached an intraday high of Rs 3730.00. The company reported consolidated sales of Rs 2343.2000 crore for the quarter ended 30-Sep-2024, up 9.41% from the previous quarter and 8.29% year-over-year. Net profit stood at Rs 508.2 crore, a 5.76% increase from the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1736397617000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Customs Demand of ₹83 Crore Over Classification Dispute",
            "Summary": "PI Industries received an order from Customs Commissioner demanding ₹82.83 crore, including ₹38.91 crore in differential customs duty and ₹43.91 crore in penalties, due to a classification dispute for imported materials from 2018 to 2022. The company plans to challenge the order and states it won't materially impact financials.",
            "Sentiment": "neutral",
            "PublishDate": 1736360399000,
            "Source": "order&deals"
        },
        {
            "Title": "PI Industries: Stock Trades at Rs 3,619.10 on BSE",
            "Summary": "PI Industries shares traded at Rs 3,619.10 on BSE, up 0.68% from the previous close. The company has a market value of Rs 54,846.10 crore. The stock's 52-week range is Rs 3,060.00 to Rs 4,801.40.",
            "Sentiment": "neutral",
            "PublishDate": 1736312429000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Dips Amid Market Decline",
            "Summary": "PI Industries shares fell 0.43% to Rs 3650.40 as the Sensex dropped 426.4 points. The stock opened at Rs 3679.75 and fluctuated between Rs 3681.60 and Rs 3650.00. The company's market capitalization stands at Rs 55528.83 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1736140547000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Marginal Stock Movement Amid Market Gains",
            "Summary": "PI Industries shares traded 0.06% higher at Rs 3724.05, with a day range of Rs 3647.40 to Rs 3724.05. The company reported Q2 FY2025 consolidated sales of Rs 2343.2 crore, up 9.41% QoQ and 8.29% YoY. Net profit stood at Rs 508.2 crore, up 5.76% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1735718632000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Share Price Dips Slightly Amid Sensex Gains",
            "Summary": "PI Industries' share price decreased 0.33% to Rs 3736.45 during Friday's trade. The stock had a trading volume of 7586 shares with a value of Rs 2.83 crore on NSE. The company reported consolidated sales of Rs 2343.2 crore for Q2 FY2025, up 9.41% QoQ and 8.29% YoY. Net profit for the quarter stood at Rs 508.2 crore, up 5.76% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1735288192000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Dips Amid Market Rise",
            "Summary": "PI Industries shares fell 1.0% to Rs 3751.25 during Thursday's trading session, despite the Sensex rising. The stock opened at Rs 3789.20 and fluctuated between Rs 3802.45 and Rs 3729.45. The company's market capitalization stands at Rs 56885.95 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1735198087000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Shares Rise Marginally Amid Market Gains",
            "Summary": "PI Industries shares increased by 0.17% to Rs 3808.70 in Monday's trade. The stock hit an intraday high of Rs 3851.00 and low of Rs 3800.00. Trading volume was 3,923 shares with a value of Rs 1.49 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1734938879000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Trades at Rs 3858.00 on BSE",
            "Summary": "PI Industries stock traded at Rs 3858.00 on BSE, down 0.44% from previous close. The company's market value stood at Rs 58669.40 crore. Promoters held 46.09%, FIIs 19.02%, and DIIs 15.27% as of September 30, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1734677429000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Rises Amid Market Fluctuations",
            "Summary": "PI Industries' stock price increased by 0.71% to Rs 3859.05 during Thursday's trading session. The company reported consolidated sales of Rs 2343.2 crore for Q2 FY2025, up 9.41% QoQ and 8.29% YoY. Net profit stood at Rs 508.2 crore, a 5.76% increase YoY.",
            "Sentiment": "positive",
            "PublishDate": 1734590256000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Fluctuates Amid Market Volatility",
            "Summary": "PI Industries shares traded at Rs 3900.05, fluctuating between Rs 3942.00 and Rs 3877.00. The company reported Q2 FY2025 consolidated sales of Rs 2343.2000 crore, up 9.41% QoQ and 8.29% YoY. Net profit stood at Rs 508.2 crore, up 5.76% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1734498953000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Stock Rises Amid Market Decline",
            "Summary": "PI Industries shares increased 0.66% to Rs 3927.00 despite overall market decline. The stock saw trading volume of 2,753 shares with a value of Rs 1.08 crore. It has a P/E ratio of 33.45 and a price-to-book ratio of 6.74. The company reported Q2 FY2025 consolidated sales of Rs 2343.2000 crore, up 9.41% QoQ and 8.29% YoY. Net profit stood at Rs 508.2 crore, up 5.76% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1734419260000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries: Jefferies Cuts Target Price After Customer Lowers Revenue Guidance",
            "Summary": "Jefferies reduced PI Industries' target price to Rs 4,865 from Rs 5,100 due to Kumiai Chemical Industry lowering its revenue guidance for Pyroxasulfone sales. PI Industries' revenue and EPS estimates for FY2026-27 were lowered by 3-5%. Despite this, Jefferies maintains a 'buy' rating, citing potential growth from new products and inventory normalization.",
            "Sentiment": "neutral",
            "PublishDate": 1734322486000,
            "Source": "normal_news"
        },
        {
            "Title": "PI Industries' Key Customer Kumiai Chemicals Issues Weak Guidance",
            "Summary": "Kumiai Chemicals, a key customer of PI Industries, has provided weak financial guidance for the upcoming year. The company expects a 1% decrease in net sales, with agricultural chemicals and agriculture-related sales projected to decline by 4%. Operating income is anticipated to drop by 8%, while profit after tax (PAT) is forecasted to decrease by 20%.",
            "Sentiment": "negative",
            "PublishDate": 1734071817000,
            "Source": "earnings"
        },
        {
            "Title": "PI Industries: Stock Fluctuates Amid Market Decline",
            "Summary": "PI Industries shares traded 0.81% lower at Rs 4000.00-4082.10 range. Q2 FY2025 results show net sales of Rs 2343.20 crore, up 9.41% QoQ and 8.29% YoY. Net profit at Rs 508.2 crore, up 5.76% YoY. Market cap stands at Rs 61066.54 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1734071083000,
            "Source": "normal_news"
        }
    ]
}