{
    "Symbol": "PILANIINVS",
    "ISIN": "INE417C01014",
    "News": [
        {
            "Title": "Pilani Investment Q3FY26 Results: Mixed Performance",
            "Summary": "Pilani Investment reports Q3FY26 standalone profit of ₹971.43 lakhs vs ₹2,676.24 lakhs YoY, while consolidated results show loss of ₹1,439.24 lakhs due to associate company impact.",
            "Sentiment": "neutral",
            "PublishDate": 1770464736035,
            "Source": "co_actions_results"
        },
        {
            "Title": "Essel Mining Acquires 0.09% Stake in Pilani Investment",
            "Summary": "Essel Mining & Industries Limited acquired 10,000 equity shares (0.09% stake) in Pilani Investment and Industries Corporation Limited for ₹5.36 crores through market purchase on December 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767092632837,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pilani Investment Gets CRISIL Rating Reaffirmation",
            "Summary": "CRISIL reaffirmed A1+ rating on ₹2,000 cr commercial paper and assigned/reaffirmed AA+/Stable rating on enhanced ₹1,000 cr NCD programme for Pilani Investment & Industries Corporation.",
            "Sentiment": "positive",
            "PublishDate": 1766060938569,
            "Source": "stocks"
        },
        {
            "Title": "Pilani Investment Clarifies Recent Volume Surge",
            "Summary": "Pilani Investment & Industries addresses BSE inquiry about increased trading volume, confirms all regulatory disclosures are up-to-date and reveals recent promoter group trading activities.",
            "Sentiment": "neutral",
            "PublishDate": 1766041483165,
            "Source": "stocks"
        },
        {
            "Title": "Pilani Investment Seeks Shareholder Approval for Rs 1,000 Crore Debenture Issuance",
            "Summary": "Pilani Investment and Industries Corporation Limited has issued a postal ballot notice seeking member approval for issuing unsecured redeemable non-convertible debentures worth up to Rs 1,000 crore on private placement basis. The e-voting period runs from November 16, 2025 to December 15, 2025, with the debentures to be issued within the company's overall borrowing limit of Rs 3,500 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763115447906,
            "Source": "corporate_action"
        },
        {
            "Title": "Pilani Investment Reports 14.6% Drop in Quarterly Profit Despite Strong Revenue Growth",
            "Summary": "Pilani Investment and Industries Corporation Limited reported a standalone net profit of Rs 700.85 lakhs for the quarter ended September 30, 2025, compared to Rs 9,492.20 lakhs in the same period last year. Total revenue from operations increased to Rs 18,639.33 lakhs from Rs 14,074.95 lakhs year-over-year. Interest income rose to Rs 5,265.07 lakhs from Rs 6,077.91 lakhs, while dividend income surged to Rs 8,305.05 lakhs from Rs 7.91 lakhs. Finance costs increased significantly to Rs 8,886.51 lakhs from Rs 1,949.55 lakhs. The company's total assets grew to Rs 19,89,628.15 lakhs as of September 30, 2025, from Rs 18,40,527.09 lakhs in March 2025. Commercial paper repayments of Rs 70,000 lakhs were completed during the quarter, with Rs 1,77,500 lakhs remaining outstanding. The company maintains credit ratings of CARE A1+ and CRISIL A1 for short-term instruments.",
            "Sentiment": "neutral",
            "PublishDate": 1762586996534,
            "Source": "earnings"
        },
        {
            "Title": "Pilani Investment Board Approves Q1 2025 Results and Rs. 1,000 Crore Debenture Issuance",
            "Summary": "Pilani Investment and Industries Corporation Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 6,111.17 lakhs and net profit after tax of Rs. 432.28 lakhs. Basic and diluted earnings per share stood at Rs. 3.90. The Board also approved the issuance of Redeemable Non-Convertible Debentures up to Rs. 1,000 crores on a private placement basis, subject to shareholder approval. The company's main business involves investment and financing activities in India. Pilani Investment received fresh Certificate of Registration as a Core Investment Company from RBI dated May 27, 2025, following approval for conversion from Non-Banking Financial Company status.",
            "Sentiment": "positive",
            "PublishDate": 1754662144817,
            "Source": "earnings"
        },
        {
            "Title": "Pilani Investment Board to Consider Fund Raising Through Non-Convertible Debentures",
            "Summary": "Pilani Investment and Industries Corporation Limited updated its board meeting agenda for August 8, 2025. In addition to reviewing unaudited financial results for the quarter ended June 30, 2025, the board will consider a proposal to raise funds through the issuance of Non-Convertible Redeemable Debentures. This represents an addition to the previously announced meeting agenda communicated on July 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754399500362,
            "Source": "corporate_action"
        },
        {
            "Title": "Pilani Investment Opens Special Window for Re-lodgement of Physical Share Transfer Requests",
            "Summary": "Pilani Investment and Industries Corporation Limited has announced a special window for re-lodgement of physical share transfer requests that were rejected or returned prior to April 1, 2019. The window is open from July 7, 2025 to January 6, 2026, following SEBI Circular No SEBI/HO/MIRSD/MIRSD-PoD/P/CIR/2025/97 dated July 2, 2025. All transfers will be processed and credited to transferees in demat mode only. Eligible shareholders must have a demat account and provide a copy of the Client Master List along with requisite documents. The company has published this notice in Financial Express and Aajkal newspapers and made the information available on its website.",
            "Sentiment": "neutral",
            "PublishDate": 1753178727996,
            "Source": "corporate_action"
        },
        {
            "Title": "Pilani Investment Recommends 15 Rupees Per Share Dividend",
            "Summary": "Pilani Investment and Industries Corporation has recommended a dividend of 15 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748267122000,
            "Source": "result"
        },
        {
            "Title": "Pilani Investment and Industries Corp Reports Q4 Financial Results",
            "Summary": "Pilani Investment and Industries Corp has reported its Q4 financial results. The company's net profit for the quarter was 179 million rupees, compared to 297.8 million rupees year-over-year and 268 million rupees quarter-over-quarter. The Q4 revenue was 550 million rupees, compared to 626.1 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748267064000,
            "Source": "result"
        },
        {
            "Title": "Pilani Investment and Industries Corp Reports Q3 Financial Results",
            "Summary": "Pilani Investment and Industries Corp has reported its Q3 financial results. The company's net profit for the quarter stood at 268 million rupees, compared to 278 million rupees in the same quarter last year and 949 million rupees in the previous quarter. Revenue for Q3 was 609 million rupees, slightly down from 615 million rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738756855000,
            "Source": "earnings"
        },
        {
            "Title": "Pilani Investment and Industries Corporation Applies for Conversion to Core Investment Company",
            "Summary": "Pilani Investment and Industries Corporation has submitted an application to the Reserve Bank of India (RBI) to convert from a Non-Banking Financial Company (NBFC) to a Core Investment Company (CIC). This move indicates a potential shift in the company's business model and regulatory status.",
            "Sentiment": "neutral",
            "PublishDate": 1733918134000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pilani Investment and Industries Corp Reports Q2 Revenue Growth",
            "Summary": "Pilani Investment and Industries Corporation has reported a revenue of 1.4 billion rupees for the second quarter, compared to 1.24 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731325263000,
            "Source": "result"
        },
        {
            "Title": "Pilani Investment and Industries Corp Reports Q2 Profit Increase",
            "Summary": "Pilani Investment and Industries Corporation has reported a net profit of 949 million rupees for the second quarter, showing an increase from 823 million rupees year-over-year and 298 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731325208000,
            "Source": "result"
        }
    ]
}