{
    "Symbol": "PILITA",
    "ISIN": "INE600A01035",
    "News": [
        {
            "Title": "PIL Italica Reports Q3 FY26 Financial Results",
            "Summary": "PIL Italica Lifestyle reported Q3 FY26 results with revenue of ₹2,981.32 lakhs and net profit of ₹71.98 lakhs for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768905613814,
            "Source": "co_actions_results"
        },
        {
            "Title": "PIL Italica Board Meet Set for Jan 20 for Q3 Results",
            "Summary": "PIL Italica Lifestyle Limited has scheduled a board meeting on January 20, 2026, to review Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768030260484,
            "Source": "co_actions_results"
        },
        {
            "Title": "PIL Italica Lifestyle Reports 26.63% Revenue Growth in Q2 FY26",
            "Summary": "PIL Italica Lifestyle Limited reported total income of ₹2,776.77 lakhs for the quarter ended September 30, 2025, representing a 26.63% increase compared to ₹2,192.89 lakhs in the same quarter last year. For the half-year period, total income reached ₹5,181.12 lakhs, up 20.04% from ₹4,316.01 lakhs in the previous year. However, EBITDA declined 11.62% to ₹216.45 lakhs in Q2, with EBITDA margin compressing to 7.80% from 11.17% in the prior year quarter. Profit after tax increased 4.97% to ₹114.88 lakhs in Q2. The company operates manufacturing facilities in Udaipur and Silvassa, with a pan-India distribution network of 4,046 dealers including 357 direct dealers and 197 distributors across 22 states. The board approved these unaudited financial results in a meeting held on October 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761650243143,
            "Source": "earnings"
        },
        {
            "Title": "PIL Italica Lifestyle Reports 44% Jump in Quarterly Profit to ₹154.52 Lakh",
            "Summary": "PIL Italica Lifestyle Limited reported unaudited financial results for the quarter ended June 30, 2025. The company posted a net profit of ₹154.52 lakh compared to ₹107.19 lakh in the previous quarter, marking a significant increase. Revenue from operations stood at ₹2,404.35 lakh versus ₹2,691.68 lakh in the preceding quarter. Year-over-year comparison shows profit increased from ₹151.20 lakh in the same quarter last year, while revenue grew from ₹2,119.66 lakh. The company operates primarily in manufacturing of plastic articles and finance segments. Basic and diluted earnings per share were ₹0.07 for the quarter. Total expenses decreased to ₹2,197.78 lakh from ₹2,510.43 lakh in the previous quarter. The board meeting was held on July 29, 2025, and the results were reviewed by the Audit Committee with a limited review conducted by statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1753786507254,
            "Source": "earnings"
        }
    ]
}