{
    "Symbol": "PINELABS",
    "ISIN": "INE15B701018",
    "News": [
        {
            "Title": "Pine Labs Invests ₹129 Cr in Subsidiary SFNPL",
            "Summary": "Pine Labs Limited invested ₹128.99 crore in its wholly owned subsidiary Synergistic Financial Networks Private Limited through a rights issue subscription, maintaining 100% ownership.",
            "Sentiment": "neutral",
            "PublishDate": 1769785986952,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pine Labs Partners with Pan Asia Bank in Sri Lanka",
            "Summary": "Pine Labs announces strategic partnership with Pan Asia Bank to deploy API-first Credit Card Management System in Sri Lanka, marking second major banking client in the region within few months.",
            "Sentiment": "positive",
            "PublishDate": 1769598482538,
            "Source": "stocks"
        },
        {
            "Title": "Pine Labs Reports Q3 Profit Turnaround",
            "Summary": "Pine Labs achieved consolidated net profit of ₹420 million in Q3, marking significant turnaround from ₹570 million loss in same quarter previous year, demonstrating strong operational recovery.",
            "Sentiment": "positive",
            "PublishDate": 1769590320243,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pine Labs Partners with UAE's Wio Bank for Payments",
            "Summary": "Pine Labs announces strategic partnership with Wio Bank to modernise merchant acquiring infrastructure using Credit+ platform, enabling faster onboarding and real-time settlements.",
            "Sentiment": "positive",
            "PublishDate": 1769416631761,
            "Source": "stocks"
        },
        {
            "Title": "Pine Labs Invests ₹64 Cr in Subsidiary BTPL",
            "Summary": "Pine Labs Limited invested ₹63.99 crores in wholly owned subsidiary BrokenTusk Technologies Private Limited through rights issue subscription, maintaining 100% ownership while strengthening working capital.",
            "Sentiment": "positive",
            "PublishDate": 1769169945219,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pine Labs Q3FY26 Earnings Call Set for January 28",
            "Summary": "Pine Labs Limited announces board meeting and investor conference call scheduled for January 28, 2026, to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768899364713,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBI Approves Setu's Agya Technologies Acquisition",
            "Summary": "Reserve Bank of India has approved Setu's complete acquisition of Agya Technologies, which has now been recognized as a Non-Banking Financial Company - Account Aggregator (NBFC-AA). The transaction is expected to close soon.",
            "Sentiment": "positive",
            "PublishDate": 1768898821422,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pine Labs Gets First 'Buy' Rating Post-Listing",
            "Summary": "Jefferies initiates coverage on Pine Labs with 'buy' rating and ₹300 price target, projecting 28.50% upside. Expects 23% revenue CAGR over FY25-28 and EBITDA margin expansion to 27% by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1766586699218,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Initiates Buy Rating on Pine Labs",
            "Summary": "Jefferies has initiated coverage on Pine Labs with a Buy rating and set a target price of ₹300.00 per share for the fintech company.",
            "Sentiment": "positive",
            "PublishDate": 1766548311828,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Initiates Pine Labs Coverage",
            "Summary": "Morgan Stanley has initiated coverage on Pine Labs with an 'Equal-weight' rating and set a price target of ₹260.00 per share for the fintech company.",
            "Sentiment": "neutral",
            "PublishDate": 1766461738811,
            "Source": "stocks"
        },
        {
            "Title": "Pine Labs Board Approves Secretarial Auditors",
            "Summary": "Pine Labs Limited board meeting on December 17, 2025 approved appointment of M/s. Makarand M. Joshi Co. as secretarial auditors for FY 2025-26 to FY 2029-30, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1765962053464,
            "Source": "stocks"
        },
        {
            "Title": "Setu Launches Bill-Paying Feature on AI Platforms Claude and ChatGPT",
            "Summary": "Setu, a Pine Labs company, has launched a new bill-paying feature that is now available on AI platforms Claude and ChatGPT. The integration allows users to access bill payment services directly through these conversational AI interfaces, expanding Setu's digital payment capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765289802291,
            "Source": "stock"
        },
        {
            "Title": "Pine Labs Reports Record Q2 FY26 Results with 18% Revenue Growth and Second Consecutive Profitable Quarter",
            "Summary": "Pine Labs achieved record-breaking quarterly results with net revenues of INR 650 crores (18% YoY growth), adjusted EBITDA of INR 122 crores (64% YoY growth), and delivered its second consecutive quarter of positive PAT at INR 6 crores. The fintech platform processed nearly 50 billion GTV across 1.9 million touchpoints serving over 1 million merchants, with contribution margins growing 21% YoY despite being traditionally weaker quarters.",
            "Sentiment": "positive",
            "PublishDate": 1765263193302,
            "Source": "earnings"
        },
        {
            "Title": "Pine Lab Reports Strong Q2 Turnaround with 60 Million Rupees Net Profit",
            "Summary": "Pine Lab achieved a consolidated net profit of 60 million rupees in Q2, marking a significant turnaround from a 320 million rupees loss in the same period last year. The company's revenue grew to 6.5 billion rupees from 5.5 billion rupees year-over-year, while EBITDA more than doubled to 750 million rupees with margins expanding to 11.54%.",
            "Sentiment": "positive",
            "PublishDate": 1764806719392,
            "Source": "earnings"
        }
    ]
}