{
    "Symbol": "PIONEEREMB",
    "ISIN": "INE156C01018",
    "News": [
        {
            "Title": "Pioneer Embroideries Seeks Shareholder Approval for Key Management Appointments via Postal Ballot",
            "Summary": "Pioneer Embroideries Limited has issued a postal ballot notice seeking shareholder approval for appointing Saurabh Maheshwari as Managing Director at Rs. 4,50,000 per month and Vishal Sekhani as Executive Director at Rs. 2,25,000 per month, both effective from October 14, 2025. The e-voting process runs from December 5, 2025 to January 3, 2026, with results to be announced by January 7, 2026, as the company strengthens its leadership structure in the textile manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1764577150691,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pioneer Embroideries Receives Affirmed Credit Rating with Revised Negative Outlook",
            "Summary": "Pioneer Embroideries Limited received an affirmed credit rating of IND BBB-/Negative/IND A3 for its bank loan facilities from India Ratings and Research Private Limited. The rating agency revised the company's outlook to negative while maintaining the existing rating level.",
            "Sentiment": "negative",
            "PublishDate": 1764070356876,
            "Source": "stock"
        },
        {
            "Title": "Pioneer Embroideries Reports Mixed Q2 Results with Standalone Loss and Revenue Decline",
            "Summary": "Pioneer Embroideries Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported standalone net sales of Rs 8,253.68 lakh for the quarter compared to Rs 8,590.74 lakh in the previous quarter, showing a decline. The company posted a standalone net loss of Rs 378.50 lakh for the quarter versus a profit of Rs 107.78 lakh in the previous quarter. For the half year, standalone net sales reached Rs 16,844.42 lakh compared to Rs 18,948.35 lakh in the previous year. The half year standalone net loss was Rs 270.73 lakh against a profit of Rs 92.05 lakh in the previous year. On a consolidated basis, the company reported quarterly net sales of Rs 8,253.68 lakh and a net loss of Rs 379.99 lakh. The Board also approved the draft Notice of Postal Ballot incorporating proposed resolutions. The company operates in the textiles segment and has subsidiaries including Hakoba Lifestyle Limited, Pioneer Realty Limited, and Ficra Lace (India) Limited.",
            "Sentiment": "negative",
            "PublishDate": 1763028189297,
            "Source": "earnings"
        },
        {
            "Title": "Pioneer Embroideries Promoters Pledge 53 Lakh Shares to Union Bank of India",
            "Summary": "Promoters of Pioneer Embroideries Limited have pledged a total of 52,99,000 shares to Union Bank of India on October 28, 2025. Raj Kumar Sekhani pledged 9,06,082 shares representing 2.94% of total share capital, while Pioneer E-com Fashions LLP pledged 43,93,918 shares representing 14.26% of total share capital. Both pledges were made as security against loans. The disclosures were made under SEBI regulations for substantial acquisition of shares and takeovers to BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761887457515,
            "Source": "corporate_action"
        },
        {
            "Title": "Pioneer E-Com Fashions LLP Releases 43.94 Lakh Pledged Shares of Pioneer Embroideries Limited",
            "Summary": "Pioneer E-Com Fashions LLP released 43,93,918 pledged shares of Pioneer Embroideries Limited from Kotak Mahendra Bank Limited on October 9th, 2025. The shares were previously pledged with the bank and have now been released. The company has submitted the required disclosure under SEBI regulations to both BSE and NSE exchanges. Pioneer Embroideries Limited trades under scrip code 514300 on BSE and symbol PIONEEREMB on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1760440872115,
            "Source": "corporate_action"
        },
        {
            "Title": "Pioneer Embroideries Appoints New Managing Director and Executive Director",
            "Summary": "Pioneer Embroideries Limited announced key leadership changes with Mr. Saurabh Maheshwari appointed as Managing Director and Mr. Vishal Sekhani as Executive Director, both effective October 14, 2025. The appointments were approved by the Board of Directors on September 25, 2025, following recommendations from the Nomination & Remuneration Committee. Both positions carry five-year terms ending October 13, 2030, subject to member approval. Maheshwari, a Chartered Accountant with 25 years of textile sector experience and 20 years with the company, has served as Executive Director since May 2021. He replaces Mr. Harsh Vardhan Bassi, whose tenure as Managing Director ends October 13, 2025. Sekhani, an M.Com and Chartered Accountant who joined the company in February 2012, has handled various roles including finance, unit management, marketing expansion, and e-commerce development. He is the son of Director Mr. Raj Kumar Sekhani.",
            "Sentiment": "positive",
            "PublishDate": 1758791623862,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pioneer Embroideries Managing Director Harsh Vardhan Bassi Resigns Due to Personal Reasons",
            "Summary": "Harsh Vardhan Bassi has resigned from his position as Managing Director of Pioneer Embroideries Limited, effective October 13, 2025, citing personal reasons. Bassi confirmed there are no material reasons for his resignation beyond those mentioned in his resignation letter. The company has notified stock exchanges BSE and NSE of this leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1758531443841,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pioneer Embroideries Reports Q1 FY2026 Results with Exceptional Gains from Asset Sale",
            "Summary": "Pioneer Embroideries Limited reported quarterly results for the period ended June 30, 2025. The company posted a standalone net profit of ₹107.78 lakh compared to ₹21.81 lakh in the same quarter last year. Net sales declined to ₹8,590.74 lakh from ₹9,588.19 lakh year-over-year. The company recorded exceptional gains of ₹441.80 lakh, primarily from the sale of land and building assets at Naroli for ₹649.41 lakh, as manufacturing operations moved to a new unit at Degoan, Dhule. This was partially offset by an expense of ₹207.61 lakh related to prior year liability recognition. On a consolidated basis, net profit attributable to owners was ₹106.77 lakh versus ₹20.50 lakh in the previous year quarter. The company operates in the textiles segment and has subsidiaries including Hakoba Lifestyle Limited, Pioneer Realty Limited, and Crystal Lace (India) Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754988432157,
            "Source": "earnings"
        }
    ]
}