{
    "Symbol": "PIRAMALFIN",
    "ISIN": "INE202B01038",
    "News": [
        {
            "Title": "Piramal Finance Q3 Net Profit Surges to ₹4B",
            "Summary": "Piramal Finance reports consolidated net profit of ₹4.00 billion in Q3, marking significant growth from ₹386 million in the previous year, while revenue increased to ₹29.20 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769177288071,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piramal Finance Q3 FY26 earnings call on Jan 23",
            "Summary": "Piramal Finance Limited has scheduled an earnings conference call on January 23, 2026, at 5:00 PM IST to discuss Q3 and 9M FY2026 results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1768564888580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piramal Finance Secures $350M Multilateral Funding",
            "Summary": "Piramal Finance Limited raises $350 million from IFC and ADB for affordable housing and MSME lending, marking its first borrowing from development finance institutions with potential to reach $500 million.",
            "Sentiment": "positive",
            "PublishDate": 1768367936421,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Finance Secures $350M From IFC, ADB",
            "Summary": "Piramal Finance Limited raises $350 million funding from International Finance Corporation and Asian Development Bank, with discussions ongoing for additional $150 million from development financial institutions.",
            "Sentiment": "positive",
            "PublishDate": 1768366617594,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Finance secures $350M, targets $150M more",
            "Summary": "Piramal Finance has raised $350 million from IFC and ADB as part of its $500 million fundraising plan for FY26, with $150 million more in advanced talks from development finance institutions.",
            "Sentiment": "positive",
            "PublishDate": 1768351410624,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Finance gets CRISIL AA+/Stable rating",
            "Summary": "CRISIL assigns AA+/Stable rating to Piramal Finance's ₹24,000 crore bank facilities and NCDs, while reaffirming A1+ rating on ₹12,000 crore commercial paper programme. Company has total outstanding borrowings of ₹75,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767534097954,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Finance amends employee welfare trust deeds",
            "Summary": "Piramal Finance Limited executed amended trust deeds on December 30, 2025, reconstituting two employee trusts following merger with Piramal Enterprises, establishing ESOP schemes for employee benefits.",
            "Sentiment": "neutral",
            "PublishDate": 1767096133179,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Finance to Sell Shriram Life Stake for ₹600 Cr",
            "Summary": "Piramal Finance Limited agrees to divest 14.72% stake in Shriram Life Insurance Company for ₹600 crores to Sanlam Emerging Markets. The strategic divestment deal is expected to conclude by March 2026 following regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1766125544023,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piramal Finance Gets Stock Exchange Approval for NCD Modification",
            "Summary": "Piramal Finance Limited receives in-principle approval from NSE and BSE to modify coupon rate clauses in its Non-Convertible Debentures under two ISINs, executing addendum on December 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765456397482,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piramal Finance Denies Economic Times Report on Gold Loan Segment Entry",
            "Summary": "Piramal Finance categorically denied an Economic Times article claiming the company is eyeing Keertana for entry into the gold loan segment, stating the news is factually incorrect. The company clarified that recent stock price movements are market-driven and confirmed no pending material announcements that could impact share price behavior.",
            "Sentiment": "neutral",
            "PublishDate": 1765267072583,
            "Source": "stock"
        },
        {
            "Title": "Piramal Finance Allots Rs 197.23 Crore NCDs Through Private Placement",
            "Summary": "Piramal Finance's Committee of Directors approved the allotment of 19,723 secured, rated, listed, redeemable non-convertible debentures worth Rs 197.23 crore on private placement basis. The NCDs, each with a face value of Rs 1 lakh, will be listed on the wholesale debt market segments of NSE and BSE for capital raising purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1764682665795,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Finance Reports Strong H1 Performance, On Track for FY26 Targets",
            "Summary": "Piramal Finance reported consolidated PAT of Rs 603 crore in H1 FY26, tracking toward its full-year guidance of Rs 1,300-1,500 crore, with growth AUM rising 37% YoY and total AUM growing 22% YoY. The company has already exceeded its FY26 growth AUM target of 30% and is progressing toward its 25% total AUM growth target for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1764115890606,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Finance Seeks Shareholder Approval for Four Director Appointments via Postal Ballot",
            "Summary": "Piramal Finance has issued a postal ballot notice seeking member approval for appointing Shikha Sharma as Non-Executive Director and three others - Anjali Bansal, Rajiv Mehrishi, and Asheeet Mehta - as Independent Directors for five-year terms. The e-voting period runs from November 23, 2025, to December 22, 2025, with results to be announced by December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763637162550,
            "Source": "corporate_governance"
        },
        {
            "Title": "Piramal Finance Completes Amalgamation of Six Subsidiary Companies",
            "Summary": "Piramal Finance Limited has completed the amalgamation of six transferor companies with Piramal Investment Advisory Services Private Limited as the transferee company, effective November 18, 2025. The scheme was approved by the National Company Law Tribunal Mumbai Bench and filed with the Registrar of Companies, resulting in the dissolution of the transferor entities without winding up.",
            "Sentiment": "neutral",
            "PublishDate": 1763464942196,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Finance Approves Rs 675 Crore NCD Issuance on Private Placement Basis",
            "Summary": "Piramal Finance's Committee of Directors approved the issuance of secured, rated, listed, redeemable Non-Convertible Debentures with a base size of Rs 175 crores and greenshoe option up to Rs 500 crores, totaling Rs 675 crores. The NCDs carry a 9.30% annual coupon rate and will be listed on BSE and NSE within three working days of issue closure, secured through first ranking pari-passu charge on company's hypothecated assets.",
            "Sentiment": "neutral",
            "PublishDate": 1763383064735,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Finance Enhances Interest Rates on Non-Convertible Debentures by 25 Basis Points",
            "Summary": "Piramal Finance's Committee of Directors approved a modification to increase the coupon rate by 25 basis points on NCDs with ISINs INE516Y07014 and INE516Y07063. The enhancement affects the interest rate clause in the Information Memorandum and related documents for these specific debenture issues.",
            "Sentiment": "positive",
            "PublishDate": 1763113595728,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Finance Limited Completes Share Allotment Following NCLT-Approved Scheme of Arrangement",
            "Summary": "Piramal Finance Limited has completed a share allotment to existing shareholders of Piramal Enterprises Limited in a 1:1 ratio on September 25, 2025, following an NCLT-approved Scheme of Arrangement. The scheme involved the transfer of shares between Piramal Enterprises Limited and Piramal Finance Limited. Trading for Piramal Finance Limited shares commenced on November 7, 2025. The company is listed on BSE Limited and National Stock Exchange of India Limited. Key stakeholders include Ajay G. Piramal and various Piramal family trusts and entities, with Anutham Realty Private Limited holding the largest stake at 24.90% of the diluted share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1762894236087,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Finance Schedules Committee Meeting to Consider NCD Document Modifications",
            "Summary": "Piramal Finance Limited has announced that its Committee of Directors will meet on November 14, 2025, to consider and approve modifications in clauses mentioned in the Information Memorandum and other relevant documents related to Non-Convertible Debentures. The modifications pertain to NCDs issued under ISINs INES16Y07014 and INE516Y07063 on a private placement basis. The company has informed BSE and NSE about this scheduled committee meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1762877959753,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Finance Targets Doubling AUM to ₹1.5 Lakh Crore in 3 Years Through AI-Driven Growth Strategy",
            "Summary": "Piramal Finance has announced plans to double its Assets Under Management (AUM) to ₹1.5 lakh crore over the next three years using an AI-driven growth model. The company expects retail lending to grow at a CAGR of 24-26%, with retail now comprising over 60% of its portfolio. The company has reduced its operating expense to AUM guidance by 25 basis points as part of its profitability focus. Piramal Finance is strengthening risk management through its in-house AI bot called 'Arya' for credit and collections processes. The company aims to become AI-native and retail-led while targeting a return on AUM of over 3%. Management describes the company as well-capitalized and positioned for predictable, technology-enabled expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762875960110,
            "Source": "stock"
        }
    ]
}