{
    "Symbol": "PITTIENG",
    "ISIN": "INE450D01021",
    "News": [
        {
            "Title": "Pitti Engineering Q3 Revenue Rises to ₹4.8B",
            "Summary": "Pitti Engineering reports Q3 consolidated revenue growth to ₹4.8 billion from ₹4.15 billion year-on-year, while net profit slightly declines to ₹282 million from ₹288 million in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1770300602358,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pitti Engineering Board Meet Set for Feb 5, 2026",
            "Summary": "Pitti Engineering Limited has scheduled a board meeting on February 5, 2026, to consider and approve unaudited financial results for Q3 FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769154699151,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pitti Engineering Reports Record Quarterly Revenue of INR 499 Crores with 17.5% EBITDA Growth",
            "Summary": "Pitti Engineering achieved its highest quarterly revenue of INR 499 crores in Q2 H1 FY26, marking 10% year-on-year growth, while EBITDA grew 17.5% to INR 78 crores with stable margins at 16.3%. The company expects capacity utilization to reach 80% by end of FY27 and targets lamination sales of 90,000-94,000 tons over the next three years, driven by strong demand in traction motors, railways, data centers and renewable energy sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763203722464,
            "Source": "earnings"
        },
        {
            "Title": "Pitti Engineering Reports Strong Q2 Results and Appoints New Registrar",
            "Summary": "Pitti Engineering Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 39,622.49 lakhs for the quarter and Rs 77,869.78 lakhs for the half-year. Net profit for the quarter stood at Rs 3,557.00 lakhs and Rs 5,395.25 lakhs for the half-year. On a consolidated basis, revenue from operations was Rs 45,056.43 lakhs for the quarter and Rs 96,302.00 lakhs for the half-year, with net profit of Rs 4,272.88 lakhs for the quarter and Rs 6,303.80 lakhs for the half-year. The Board also approved the appointment of MUFG Intime India Private Limited as the new Registrar and Transfer Agent, replacing XL Softech Systems Limited. MUFG was selected for its skilled professionals, electronic solutions for share-related services, strong digital system for handling shareholder queries, and technologically advanced infrastructure. The effective date of transition will be communicated after receiving necessary approvals and executing tripartite agreements.",
            "Sentiment": "positive",
            "PublishDate": 1762567913603,
            "Source": "earnings"
        },
        {
            "Title": "Pitti Engineering Plans ₹500 Crore Hyderabad Facility Investment to Drive 20%+ Revenue Growth",
            "Summary": "Pitti Engineering aims to sustain revenue growth of over 20% through expansion of machined component exports and renewable energy projects. The company is investing ₹500 crore in a new Hyderabad facility for precision castings and machining operations. Pitti Engineering targets a higher share of high-margin engineered components and plans to diversify into wind, rail, and defense sectors to drive long-term profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762528878201,
            "Source": "stock"
        },
        {
            "Title": "Pitti Engineering Reports Growth in Q2 Financial Performance",
            "Summary": "Pitti Engineering reported consolidated net profit of 401 million rupees in Q2, up from 380 million rupees year-over-year. Revenue increased to 4.77 billion rupees from 4.3 billion rupees in the same period last year. EBITDA rose to 777 million rupees compared to 661 million rupees year-over-year, while EBITDA margin improved to 16.26% from 15.39% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762521810783,
            "Source": "earnings"
        },
        {
            "Title": "Pitti Engineering Receives Favorable Tax Order from Income Tax Commissioner",
            "Summary": "Pitti Engineering has received a positive order from the Income Tax Commissioner. The company announced this development, though specific details about the nature or financial impact of the tax order were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1755708328548,
            "Source": "stock"
        },
        {
            "Title": "Pitti Engineering Reports 17% Revenue Growth to INR 457 Crores in Q1 FY26, Announces INR 150 Crore Capacity Expansion",
            "Summary": "Pitti Engineering Limited reported consolidated revenue of INR 457 crores for Q1 FY26, marking 17% year-on-year growth from INR 391 crores. EBITDA increased 30% to INR 75 crores with margins improving to 16.5% from 14.8%. Profit after tax grew 17% to INR 23 crores. Exports accounted for 31% of total revenue. The company announced a INR 150 crore capital expenditure over 18 months to expand sheet metal capacity from 90,000 to 108,000 metric tons, machine hour capacity from 648,000 to 720,000 hours, and casting capacity from 18,600 to 24,600 metric tons. Sheet metal volumes were 16,000 metric tons for the quarter. The company expects to operate near peak capacity by Q4 FY26 and maintains 15% top line growth guidance for FY26. Management highlighted strong demand from data centers and secured a second platform with existing customer expected to generate over INR 20 crores annual revenue. The company faces potential impact from US tariffs affecting approximately 10% of total revenue but remains optimistic about order visibility.",
            "Sentiment": "positive",
            "PublishDate": 1755088274254,
            "Source": "earnings"
        },
        {
            "Title": "Pitti Engineering Targets ₹1,500+ Crore Revenue by FY27",
            "Summary": "Pitti Engineering expects to achieve revenue exceeding ₹1,500 crore by FY27. The company has a ₹1,300 crore order book and anticipates growth driven by increasing demand in electric vehicle and railway sectors, along with higher machined components business.",
            "Sentiment": "positive",
            "PublishDate": 1754582903629,
            "Source": "stock"
        },
        {
            "Title": "Pitti Engineering Approves ₹150 Crore Capex Plan for Manufacturing Expansion",
            "Summary": "Pitti Engineering Limited's Board approved quarterly results for Q1 FY2026 and sanctioned a ₹150 crore capital expenditure plan to expand manufacturing capacities across the company and its wholly owned subsidiaries, Pitti Industries Private Limited and Dakshin Foundry Private Limited. The expansion will increase sheet metal capacity from 90,000 MT to 108,000 MT, machine hours from 648,000 to 720,000, and foundry capacity from 18,600 MT to 24,000 MT. Current utilization rates stand at 70% for sheet metal, 82% for machining hours, and 69% for casting capacity. The project will be funded through internal accruals and debt, with completion expected within 18 months. On a standalone basis, the company reported revenue from operations of ₹38,247.29 lakhs and profit after tax of ₹1,757 lakhs for the quarter ended June 30, 2025. On a consolidated basis, revenue from operations was ₹45,656.43 lakhs with profit after tax of ₹2,288.24 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1754574576556,
            "Source": "earnings"
        },
        {
            "Title": "Pitti Engineering Approves ₹1.50 Billion Capacity Expansion, Reports Strong Q1 Growth",
            "Summary": "Pitti Engineering has approved ₹1.50 billion for capacity expansion. The company reported quarterly consolidated net profit of ₹229 million compared to ₹194 million in the same period last year. Revenue increased to ₹4.57 billion from ₹3.91 billion year-over-year. EBITDA rose to ₹753 million from ₹580 million, with EBITDA margin improving to 16.50% from 14.82% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754573435312,
            "Source": "stock"
        },
        {
            "Title": "Pitti Engineering Focuses on Profitable Product Mix",
            "Summary": "Pitti Engineering is shifting its focus towards a more profitable product mix, specifically between machine and casting lamination assemblies. This strategic pivot was discussed during a recent company conference call, indicating a deliberate effort to improve profitability through product portfolio optimization.",
            "Sentiment": "positive",
            "PublishDate": 1745466028000,
            "Source": "default"
        },
        {
            "Title": "Pitti Engineering Outlines Growth and Margin Targets",
            "Summary": "Pitti Engineering expects an EBITDA margin of 16.5% to 17% for the current fiscal year, with plans to increase it by 75-100 basis points over the next 12-18 months. The company is targeting sales of Rs 2,000 crore for FY '26 with a volume target of 68,000 tonnes. For FY '27, Pitti Engineering aims to reach a peak capacity of 72,000 tonnes, potentially resulting in sales of Rs 2,100-2,200 crore.",
            "Sentiment": "positive",
            "PublishDate": 1745465786000,
            "Source": "default"
        },
        {
            "Title": "Pitti Engineering Targets 10-15% Revenue Growth",
            "Summary": "Pitti Engineering has announced its growth targets during a conference call. The company aims for a 10% to 15% revenue growth, accompanied by a 10% volume growth. Additionally, their machine components business is expected to reach a revenue of Rs 750 crore within the next 18 to 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1745465480000,
            "Source": "default"
        },
        {
            "Title": "Pitti Engineering Reports Q4 FY2023 Financial Results",
            "Summary": "Pitti Engineering announced its Q4 FY2023 consolidated financial results. The company reported a net profit of 361.4 million rupees, down from 460 million rupees year-over-year but up from 287.6 million rupees quarter-over-quarter. Revenue for Q4 increased to 4.69 billion rupees from 3.36 billion rupees in the same quarter last year. The company has recommended a final dividend of 1.50 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745281620000,
            "Source": "default"
        },
        {
            "Title": "Pitti Engineering Reports Q4 FY23 Results and Declares Dividend",
            "Summary": "Pitti Engineering has announced its Q4 FY23 financial results. The company's revenue increased to 4.69 billion rupees from 3.36 billion rupees year-over-year. EBITDA rose to 800.7 million rupees from 519 million rupees, with the EBITDA margin improving to 17.08% from 15.45%. However, consolidated net profit decreased to 361.4 million rupees from 460 million rupees year-over-year. The company has recommended a final dividend of 1.50 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745241126000,
            "Source": "result"
        },
        {
            "Title": "Pitti Engineering Expands Sheet Metal Production Capacity",
            "Summary": "Pitti Engineering has announced an expansion of its manufacturing capacity. The company's sheet metal production capacity has been increased to 72,000 metric tons. This expansion represents a significant boost to the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1743466020000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pitti Engineering Expands Sheet Metal Production Capacity",
            "Summary": "Pitti Engineering has announced an expansion of its manufacturing capacity. The company's sheet metal production capacity has been increased to 72,000 MT.",
            "Sentiment": "positive",
            "PublishDate": 1743438408000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pitti Engineering Reports Strong Q3 Financial Results",
            "Summary": "Pitti Engineering has announced its Q3 consolidated financial results. The company's net profit increased to 288 million rupees, up from 157 million rupees in the same quarter last year. Revenue also saw significant growth, reaching 4.15 billion rupees compared to 3 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739492269000,
            "Source": "earnings"
        },
        {
            "Title": "Pitti Engineering Reports Q3 EBITDA Growth",
            "Summary": "Pitti Engineering has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 669 million rupees, up from 515 million rupees in the same quarter of the previous year. However, the EBITDA margin decreased slightly to 16.13% from 17.05% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739450832000,
            "Source": "earnings"
        },
        {
            "Title": "Pitti Engineering Reports Strong Q3 Financial Performance",
            "Summary": "Pitti Engineering has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 288 million rupees from 157 million rupees in the same quarter last year. Revenue also saw substantial growth, rising to 4.15 billion rupees from 3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739450827000,
            "Source": "earnings"
        },
        {
            "Title": "Pitti Engineering Reports Strong Q2 Financial Performance",
            "Summary": "Pitti Engineering has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 425 million rupees to 661 million rupees. Additionally, the EBITDA margin improved from 14.66% to 15.39%.",
            "Sentiment": "positive",
            "PublishDate": 1731504414000,
            "Source": "result"
        },
        {
            "Title": "Pitti Engineering Reports Strong Q2 Financial Results",
            "Summary": "Pitti Engineering has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 380 million rupees, up from 220 million rupees in the same quarter last year and 194 million rupees in the previous quarter. Revenue also saw substantial growth, reaching 4.3 billion rupees compared to 3 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1731504367000,
            "Source": "result"
        }
    ]
}