{
    "Symbol": "PIXTRANS",
    "ISIN": "INE751B01018",
    "News": [
        {
            "Title": "PIX Transmissions Reports Decline in Q2 Financial Performance",
            "Summary": "PIX Transmissions reported Q2 consolidated net profit of 235M rupees compared to 405M rupees year-over-year, with revenue declining to 1.4B rupees from 1.6B rupees. The company's EBITDA dropped to 344M rupees from 505M rupees, while EBITDA margin compressed to 24.76% from 31.74% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1763134035107,
            "Source": "earnings"
        },
        {
            "Title": "PIX Transmissions Appoints Shekhar Jogwar as General Manager (Quality)",
            "Summary": "PIX Transmissions Limited announced the appointment of Shekhar Jogwar as General Manager (Quality), effective November 1, 2025. Jogwar will assume the role of Quality Excellence Transformation. He holds a B.E. degree from Marathwada University and brings over 30 years of experience in quality excellence, transformation, and product development. The company informed stock exchanges BSE and NSE about this senior management appointment as required under SEBI listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1761998979364,
            "Source": "corporate_governance"
        },
        {
            "Title": "PIX Transmissions Reports Mixed Q1 Results with Revenue Decline and Margin Compression",
            "Summary": "PIX Transmissions reported quarterly consolidated net profit of 276 million rupees, showing minimal growth from 274 million rupees in the same period last year. However, revenue declined to 1.21 billion rupees from 1.29 billion rupees year-over-year. The company's EBITDA dropped significantly to 276 million rupees from 345 million rupees, while EBITDA margin compressed to 22.69% from 26.54% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754660636899,
            "Source": "earnings"
        },
        {
            "Title": "Pix Transmissions Approves Q1 Results and Puts Rs 30 Crore Solar Project on Hold",
            "Summary": "Pix Transmissions Ltd. approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, during a board meeting held on August 8, 2025. The board also decided to place the company's captive solar power project in abeyance due to operational challenges in execution. The solar project was originally approved in February 2025 with a capital expenditure of Rs 30 crore. The board meeting lasted from 3:00 PM to 5:10 PM IST, and the financial results along with the auditor's limited review report have been uploaded on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754660171142,
            "Source": "earnings"
        }
    ]
}