{
    "Symbol": "PLASTIBLEN",
    "ISIN": "INE083C01022",
    "News": [
        {
            "Title": "Plastiblends Q3 EBITDA Falls 14.9% to ₹97 Crores",
            "Summary": "Plastiblends India Q3 EBITDA declined to ₹97 crores from ₹114 crores YoY, with EBITDA margin compressing to 5.2% from 6.2% despite revenue growth to ₹185 crores.",
            "Sentiment": "negative",
            "PublishDate": 1768382936856,
            "Source": "co_actions_results"
        },
        {
            "Title": "Plastiblends India Reports 4% Revenue Growth to Rs 19,261 Lakhs in Q2, Net Profit Rises 17.87% Year-on-Year",
            "Summary": "Plastiblends India Limited announced its quarterly results for the quarter ended September 30, 2025. Revenue from operations increased 3.92% year-on-year to Rs 19,261 lakhs compared to Rs 18,535 lakhs in the same quarter last year. Net profit grew 17.87% to Rs 744 lakhs from Rs 631 lakhs year-on-year. However, on a sequential basis, revenue declined 3.52% from Rs 19,963 lakhs in Q1, and net profit dropped 16.67% from Rs 892 lakhs. EBITDA margin improved 77 basis points year-on-year to 7.46% from 6.69%. For the half-year period, revenue was Rs 39,224 lakhs compared to Rs 39,692 lakhs in the previous year, while net profit decreased to Rs 1,636 lakhs from Rs 1,716 lakhs. The company cited challenges including slowdown in packaging and consumer goods industries, inventory losses due to raw material price volatility, rising energy and wage costs, and competitive pricing pressures. Chairman S.N. Kabra expressed optimism about future growth opportunities and expects revenue growth to revive in the coming quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760615138992,
            "Source": "earnings"
        },
        {
            "Title": "Plastiblends India Director Shreevallabh Kabra Resigns Due to Advancing Age",
            "Summary": "Shri Shreevallabh Gopilal Kabra has resigned as a Non-Executive Non-Independent Director of Plastiblends India Limited, effective from the close of business hours on July 25, 2025. Kabra cited his advancing age and inability to devote required time as the reason for his resignation. In his resignation letter, he confirmed there are no other material reasons for stepping down beyond those stated. The company disclosed this information to stock exchanges BSE and NSE under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1753446203339,
            "Source": "corporate_governance"
        },
        {
            "Title": "Plastiblends Expects Revenue Growth Recovery in Next Quarter",
            "Summary": "Plastiblends anticipates a rebound in revenue growth for the upcoming quarter. The company attributes this positive outlook to new product innovations and an increased share in export markets. These factors are cited as key drivers for the expected strong recovery.",
            "Sentiment": "positive",
            "PublishDate": 1752574465000,
            "Source": "default"
        },
        {
            "Title": "Plastiblends Reports Q1 Financial Results and Plans Capacity Expansion",
            "Summary": "Plastiblends has reported its Q1 financial results. The company's EBITDA decreased to 135 million rupees from 163 million rupees year-over-year, with EBITDA margin falling to 6.75% from 7.71%. Net profit declined to 89 million rupees from 108 million rupees, while revenue decreased to 1.99 billion rupees from 2.1 billion rupees compared to the same quarter last year. The company is considering increasing manufacturing capacity across different product lines. As of June 30, 2025, capital expenditure and construction work in progress totals 121 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1752574344000,
            "Source": "result"
        },
        {
            "Title": "Plastiblends Announces Dividend and Q4 Results",
            "Summary": "Plastiblends has recommended a dividend of 2.5 rupees per equity share. The company's Q4 EBITDA decreased to 145 million rupees from 157.8 million rupees year-over-year. The Q4 EBITDA margin also declined to 7.26% from 7.93% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745845095000,
            "Source": "result"
        },
        {
            "Title": "Plastiblends Q4 Financial Results",
            "Summary": "Plastiblends reported Q4 net profit of 96 million rupees, down from 107.4 million rupees year-over-year but up from 67 million rupees quarter-over-quarter. Q4 revenue remained stable at 1.99 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1745844925000,
            "Source": "result"
        },
        {
            "Title": "Plastiblends India: Q3 Profit Rises 1.51% Despite Revenue Decline",
            "Summary": "Plastiblends India reported Q3 FY25 results with profit increasing 1.51% YoY to ₹6.71 crore, despite revenue decreasing 6.47% to ₹184.37 crore. Operating income rose 2.86% YoY. EPS increased to ₹2.58, up 1.57% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1737093529000,
            "Source": "earnings"
        },
        {
            "Title": "Plastiblends Approves Expansion of Engineering Plastic Division",
            "Summary": "Plastiblends has approved the expansion of its Engineering Plastic Division located at Palsana. This decision indicates the company's commitment to growth and potentially increasing its production capacity in the engineering plastics sector.",
            "Sentiment": "positive",
            "PublishDate": 1737024528000,
            "Source": "corporate_action"
        },
        {
            "Title": "Plastiblends Reports Slight Increase in Q3 EBITDA and Margin",
            "Summary": "Plastiblends India Limited has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased marginally from 112 million rupees to 114 million rupees year-over-year. The EBITDA margin also saw an improvement, rising from 5.69% to 6.20% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737024441000,
            "Source": "earnings"
        },
        {
            "Title": "Plastiblends Reports Marginal Profit Increase in Q3",
            "Summary": "Plastiblends India Limited has reported a slight increase in net profit for the third quarter, rising to 67 million rupees from 66 million rupees year-over-year. However, the company's revenue decreased to 1.84 billion rupees from 1.97 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1737024426000,
            "Source": "earnings"
        },
        {
            "Title": "Plastiblends India Reports Decline in Q2 EBITDA",
            "Summary": "<p>Plastiblends India's Q2 <span class='neutral'>EBITDA</span> <span class='negative'>decreased</span> to <b>98 million rupees</b> from <b>144 million rupees</b> year-over-year. The company's <span class='neutral'>EBITDA margin</span> also <span class='negative'>fell</span> to <b>5.28%</b> from <b>6.85%</b> in the same period last year.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728639249000,
            "Source": "result"
        },
        {
            "Title": "Plastiblends India Reports Q2 Revenue Decline",
            "Summary": "<p><span class=\"neutral\">Plastiblends India</span> has reported a <span class=\"neutral\">revenue</span> of <b>1.85 billion rupees</b> for the <span class=\"neutral\">second quarter</span>, down from <b>2.1 billion rupees</b> in the same period last year, representing a <span class=\"negative\">year-over-year decrease</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728639187000,
            "Source": "result"
        },
        {
            "Title": "Plastiblends India Reports Decline in Q2 Net Profit",
            "Summary": "<p><span class=\"neutral\">Plastiblends India</span> has reported a <span class=\"neutral\">net profit</span> of <b>63 million rupees</b> for the second quarter, down from <b>95 million rupees</b> in the same period last year, representing a <span class=\"negative\">year-over-year decrease</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728639153000,
            "Source": "result"
        },
        {
            "Title": "Plastiblends India Ltd Schedules Board Meeting for Q2 Results",
            "Summary": "<p><span class=\"neutral\">Plastiblends India Ltd</span> has announced a <b>board meeting</b> to be held on <span class=\"neutral\">October 11, 2023</span>. The primary agenda of this meeting is to <b>consider and approve</b> the <span class=\"neutral\">financial results</span> for the <span class=\"neutral\">second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727978438000,
            "Source": "corporate_action"
        }
    ]
}