{
    "Symbol": "PLATIND",
    "ISIN": "INE0PT501018",
    "News": [
        {
            "Title": "Platinum Industries Q3FY26 Results & New Subsidiary",
            "Summary": "Platinum Industries reported Q3FY26 consolidated revenue of ₹1,046.68 million with net profit of ₹123.28 million. Board approved incorporation of Rivadu Lifesciences subsidiary with ₹25 lakh capital.",
            "Sentiment": "positive",
            "PublishDate": 1770899377020,
            "Source": "co_actions_results"
        },
        {
            "Title": "Platinum Industries Promoter Parul Krishna Rana Sells 30,000 Shares in Open Market",
            "Summary": "Parul Krishna Rana, Promoter and Director of Platinum Industries Limited, sold 30,000 equity shares (0.05% stake) through open market transaction on 25th November 2025. The sale reduced her shareholding from 24.52% to 24.47%, while the promoter group's total holding decreased marginally from 70.08% to 70.03%.",
            "Sentiment": "neutral",
            "PublishDate": 1764309660177,
            "Source": "corporate_action"
        },
        {
            "Title": "Platinum Industries Promoter Krishna Rana Sells 45,893 Equity Shares in Open Market",
            "Summary": "Krishna Dushyant Rana, promoter and managing director of Platinum Industries Limited, sold 45,893 equity shares through open market transactions on November 21, 2025. The sale reduced his shareholding from 45.63% to 45.55%, while the combined promoter group holding decreased from 70.17% to 70.09% of the company's total equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763971285106,
            "Source": "corporate_action"
        },
        {
            "Title": "Platinum Industries Promoter Krishna Dushyant Rana Sells 79,107 Shares Through Open Market",
            "Summary": "Krishna Dushyant Rana, Promoter and Managing Director of Platinum Industries Limited, sold 79,107 equity shares through open market transactions on November 19, 2025. His shareholding decreased from 45.78% to 45.63%, while the promoter group's total holding reduced from 70.31% to 70.17% in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763702927758,
            "Source": "corporate_action"
        },
        {
            "Title": "Platinum Industries Promoter Krishna Rana Sells 1.5 Lakh Equity Shares in Open Market",
            "Summary": "Krishna Dushyant Rana, Promoter and Managing Director of Platinum Industries Limited, sold 1,50,000 equity shares (0.27% stake) through open market transactions on November 18, 2025. Following the sale, Rana's shareholding decreased from 46.05% to 45.78%, while the promoter group's total holding reduced from 70.58% to 70.31% in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763555241867,
            "Source": "corporate_action"
        },
        {
            "Title": "Platinum Industries Promoters Sell 2.25 Lakh Shares in Open Market",
            "Summary": "Promoters Krishna Dushyant Rana and Parul Krishna Rana sold 50,000 and 1,75,000 shares respectively of Platinum Industries Limited through open market transactions on November 17, 2025. The combined promoter group shareholding decreased from 70.99% to 70.58% following the share sale totaling 2,25,000 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763530277884,
            "Source": "corporate_action"
        },
        {
            "Title": "Platinum Industries Reports 24% Revenue Growth in Q2 FY26 with Strong Export Performance",
            "Summary": "Platinum Industries Limited, a specialty chemicals manufacturer, achieved 24% revenue growth in Q2 FY26 with consolidated revenue reaching INR 1,153.8 million, driven by its PVC and CPVC additives business across 30+ countries. The company is expanding globally with a 60,000 MTPA facility in Egypt by June 2026 and holds 13% market share as India's third-largest PVC additives player, focusing on eco-friendly lead-free stabilizers.",
            "Sentiment": "positive",
            "PublishDate": 1763477051584,
            "Source": "earnings"
        },
        {
            "Title": "Platinum Industries Reports IPO Fund Utilization Progress in Q2 Monitoring Report",
            "Summary": "Platinum Industries Limited submitted its monitoring agency report showing utilization of Rs 1,386.62 million from its Rs 2,118.29 million IPO proceeds for manufacturing facilities in Egypt and Palghar, with Rs 1,079.20 million remaining deployed in fixed deposits and bank accounts. The specialty chemicals company is progressing on capital expenditure for PVC stabilizer manufacturing plants while maintaining Rs 162.30 million unutilized for general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1763118523892,
            "Source": "corporate_action"
        },
        {
            "Title": "Platinum Industries Reports Quarterly Results with Fire-Related Exceptional Loss",
            "Summary": "Platinum Industries Limited announced quarterly results for the period ended September 30, 2025, with auditors issuing qualified opinions due to a fire incident at subsidiary Platinum Polymers and Additives that caused Rs. 103.35 million in losses and Rs. 98.19 million in insurance receivables. The Board also approved fresh equity share issuance by subsidiary Platinum Oleo Chemicals Private Limited, maintaining shareholding above 51%.",
            "Sentiment": "negative",
            "PublishDate": 1763058002818,
            "Source": "earnings"
        },
        {
            "Title": "Platinum Industries Reports Decline in Q2 Profitability and Margins",
            "Summary": "Platinum Industries reported Q2 consolidated net profit of 115M rupees compared to 143M rupees year-over-year, with EBITDA declining to 136M rupees from 151M rupees. The company's EBITDA margin compressed to 13.82% from 15.16% year-over-year, while revenue remained relatively stable at 984M rupees versus 996M rupees.",
            "Sentiment": "negative",
            "PublishDate": 1763056140175,
            "Source": "earnings"
        },
        {
            "Title": "Platinum Industries Limited Receives Rs 5.38 Lakh RBI Penalty for FEMA Compliance Violation",
            "Summary": "Platinum Industries Limited received a compounding order from the Reserve Bank of India's Foreign Exchange Department imposing a penalty of Rs 5.38 lakh. The penalty was levied for the company's failure to submit Part I of Form ODI within prescribed timelines when making an overseas direct investment in its subsidiary, violating Foreign Exchange Management Act Regulations, 2004. The company received the order via email on October 28, 2025. Platinum Industries stated that the penalty has no material impact on its financial position, operations, or other business activities.",
            "Sentiment": "negative",
            "PublishDate": 1761657741246,
            "Source": "stock"
        },
        {
            "Title": "Platinum Industries Receives Government Approval for In-House R&D Unit in Maharashtra",
            "Summary": "Platinum Industries Limited received approval from the Ministry of Science and Technology for its In-house R&D Unit located in Palghar, Maharashtra. The Department of Scientific and Industrial Research (DSIR) granted recognition for the period from September 4, 2025, to March 31, 2028. The approval enables the company to avail custom duty exemptions for its R&D facility under government notifications, along with other intangible benefits. The approval letter was dated September 16, 2025, and received by the company on September 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758621290119,
            "Source": "stock"
        },
        {
            "Title": "Platinum Industries Appoints Ashok Bothra as Chief Financial Officer",
            "Summary": "Platinum Industries Limited appointed Mr. Ashok Bothra as Chief Financial Officer and Key Managerial Personnel effective September 06, 2025. The Board of Directors approved the appointment in their meeting held on the same date. Bothra is a member of the Institute of Chartered Accountants of India with a PG Diploma in Forex Risk Management and export & import management. He brings over 27 years of experience across accounts & finance, cost control, taxation, business strategy, M&A, and investor relations.",
            "Sentiment": "positive",
            "PublishDate": 1757160168056,
            "Source": "corporate_governance"
        },
        {
            "Title": "Platinum Industries Reports 12.4% Revenue Growth Despite 26% Decline in Profit for Q1 FY26",
            "Summary": "Platinum Industries Limited announced its Q1 FY26 results showing revenue growth of 12.4% year-on-year to ₹1,153.82 million and 19.55% quarter-on-quarter growth. However, profit after tax declined 26.28% year-on-year to ₹130.76 million due to higher employee costs and product mix shift towards lower-margin offerings. EBITDA margin contracted to 13.14% from 19.94% in the previous year, though it improved from 8.48% in the previous quarter. The company commenced Phase 1 operations at its Palghar facility, adding 12,000 TPA of non-lead-based CPVC additive capacity. Platinum Industries is India's third-largest PVC stabilizer manufacturer with 13% market share, serving over 30 countries. The company is also preparing to commission a 60,000 TPA plant in Egypt's Suez Economic Zone to enhance access to Europe, MENA, and Latin America markets.",
            "Sentiment": "neutral",
            "PublishDate": 1755599940812,
            "Source": "earnings"
        },
        {
            "Title": "Platinum Industries Reports Strong Q1 Results with 19.8% Revenue Growth and Key Management Appointments",
            "Summary": "Platinum Industries Limited reported quarterly results for the period ended June 30, 2025, showing revenue from operations of Rs. 1,028.82 million on standalone basis and Rs. 1,153.82 million on consolidated basis. The company's standalone profit increased to Rs. 125.18 million compared to Rs. 170.98 million in the same quarter last year. Basic earnings per share stood at Rs. 2.28 for the quarter. The board appointed Mr. Anand Shankar Mahadware as Strategy Business Director for Innovation and New Product Development as Senior Managerial Personnel, and re-appointed M/s Ashish Bhavsar & Associates as Cost Auditors for 2025-26. The company disclosed that a fire incident occurred at the Palghar plant of subsidiary M/s Platinum Polymers and Additives after June 30, 2025, temporarily halting operations. IPO proceeds utilization continued with Rs. 1,185.61 million remaining unutilized as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755177049254,
            "Source": "earnings"
        },
        {
            "Title": "Platinum Industries Schedules Board Meeting for Q1 Financial Results on August 14, 2025",
            "Summary": "Platinum Industries Limited has scheduled a Board of Directors meeting on August 14, 2025 to consider and approve the unaudited financial results for the first quarter ended June 30, 2025. The trading window for company securities will remain closed until 48 hours after the results declaration. The trading window closure was already in effect from July 1, 2025 for designated persons and their immediate relatives.",
            "Sentiment": "neutral",
            "PublishDate": 1754659686939,
            "Source": "earnings"
        },
        {
            "Title": "Platinum Industries Commences Commercial Production at Palghar Facility",
            "Summary": "Platinum Industries has started commercial production at its Palghar facility. The company has begun operations at this manufacturing location.",
            "Sentiment": "positive",
            "PublishDate": 1754656825697,
            "Source": "stock"
        },
        {
            "Title": "Platinum Industries Reports Q4 Financial Results",
            "Summary": "Platinum Industries has released its Q4 financial results. The company's EBITDA decreased to 81.83 million rupees from 151.1 million rupees year-over-year. The EBITDA margin fell to 8.48% from 18.8% in the same period. Revenue increased to 965.1 million rupees from 803.51 million rupees year-over-year. Consolidated net profit declined to 63.65 million rupees from 106.2 million rupees year-over-year and 116.5 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747150479000,
            "Source": "result"
        },
        {
            "Title": "Platinum Industries Reports Q2 EBITDA Decline",
            "Summary": "Platinum Industries has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 151 million rupees, down from 162 million rupees in the same quarter last year. The EBITDA margin also decreased significantly, falling to 15.16% from 26.6% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731505525000,
            "Source": "result"
        },
        {
            "Title": "Platinum Industries Reports Strong Q2 Financial Results",
            "Summary": "Platinum Industries has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The consolidated net profit for Q2 reached 143 million rupees, up from 116 million rupees in the same quarter last year and 178 million rupees in the previous quarter. Revenue also saw a substantial increase, rising to 996 million rupees from 609 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731505454000,
            "Source": "result"
        }
    ]
}