{
    "Symbol": "PLAZACABLE",
    "ISIN": "INE0INJ01017",
    "News": [
        {
            "Title": "Plaza Wires Reports Quarterly Results with GST Demand Challenge",
            "Summary": "Plaza Wires Limited approved its unaudited financial results for the quarter ended September 30, 2025, showing revenue from operations of INR 737.54 million and profit after tax of INR 5.15 million. The company faces a GST demand of INR 11.51 crores from authorities regarding disallowed credits, against which it has filed an appeal and believes it has a strong case on merits.",
            "Sentiment": "neutral",
            "PublishDate": 1763134599297,
            "Source": "earnings"
        },
        {
            "Title": "Red Tape Limited and Suraj Industries Limited Release Quarterly Financial Results",
            "Summary": "Red Tape Limited announced its unaudited consolidated and standalone financial results for the quarter ended June 30, 2025. The results were reviewed by the audit committee and approved by the board of directors on August 14, 2025. The complete financial results are available on stock exchange websites and the company's website. Separately, Suraj Industries Limited also released its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company operates two business segments: liquor operations and trading operations, with no operations in the trading segment during the quarter. The results were reviewed by the audit committee and approved by the board of directors on August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755498058179,
            "Source": "earnings"
        },
        {
            "Title": "Plaza Wires Limited Approves Quarterly Results and Appoints New Auditors",
            "Summary": "Plaza Wires Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs. 653.60 million and profit of Rs. 10.80 million. The company appointed M/s Deepak Mittal & Co. as Cost Auditors for FY 2025-26 and M/s Sarika Jain & Associates as Secretarial Auditors for a five-year term from April 1, 2025 to March 31, 2030. The company faces a GST demand of Rs. 11.51 crore from authorities, against which it has filed an appeal. Basic earnings per share stood at Rs. 0.25 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755183865077,
            "Source": "earnings"
        }
    ]
}