{
    "Symbol": "PNB",
    "ISIN": "INE160A01022",
    "News": [
        {
            "Title": "PNB Keeps MCLR Rates Unchanged for February 2026",
            "Summary": "Punjab National Bank maintains all MCLR rates unchanged effective February 1, 2026, with one-year rate at 8.75% and overnight rate at 7.95%. RLLR and Base Rate also remain stable.",
            "Sentiment": "neutral",
            "PublishDate": 1769869888454,
            "Source": "stocks"
        },
        {
            "Title": "PNB Q3FY26 Net Profit Rises 13.13% to INR5,100 Crores",
            "Summary": "Punjab National Bank reported strong Q3FY26 results with net profit growing 13.13% YoY to INR5,100 crores. GNPA improved to 3.19% from 4.09% last year, while bank made additional floating provisions of INR955 crores for ECL transition.",
            "Sentiment": "positive",
            "PublishDate": 1769512436222,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Issues Strike Notice for January 27, 2026",
            "Summary": "Punjab National Bank informs stakeholders about potential bank strike called by United Forum of Bank Unions and All India Bank Officers Association on January 27, 2026, which may affect branch operations.",
            "Sentiment": "negative",
            "PublishDate": 1769178214611,
            "Source": "stocks"
        },
        {
            "Title": "PNB cuts deposit rates to defend margins amid RBI cuts",
            "Summary": "Punjab National Bank reduced deposit rates by 20 bps effective January 1, 2026, as domestic NIM fell to 2.65% in Q3FY26 from 3.09% a year earlier. The bank expects margin stabilization through strategic repricing.",
            "Sentiment": "neutral",
            "PublishDate": 1768905650315,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB shares fall 5% post Q3 results on margin concerns",
            "Summary": "Punjab National Bank shares declined 5% over two sessions despite 13% YoY profit growth to ₹5,100 crore, as investors focused on 8 bps NIM contraction and reduced FY26 guidance to 2.6%.",
            "Sentiment": "negative",
            "PublishDate": 1768892370275,
            "Source": "co_actions_results"
        },
        {
            "Title": "CLSA Sets ₹145 Target for PNB with Outperform Rating",
            "Summary": "CLSA maintains Outperform rating on Punjab National Bank with target price of ₹145, reflecting positive outlook on the public sector bank's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768880990785,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Maintains Buy on PNB at ₹145 Target",
            "Summary": "Motilal Oswal Securities maintains its Buy recommendation on Punjab National Bank with a target price of ₹145, reflecting continued confidence in the public sector bank's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768880967208,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Maintains Underweight on PNB at ₹100",
            "Summary": "Morgan Stanley continues its underweight rating on Punjab National Bank with a target price of ₹100, reflecting cautious outlook on the public sector bank's performance prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768880944903,
            "Source": "stocks"
        },
        {
            "Title": "Citi Maintains 'Sell' Rating on PNB, Raises Target",
            "Summary": "Citigroup maintains its 'Sell' rating on Punjab National Bank while increasing the target price to ₹115.00, reflecting updated valuation parameters for the public sector banking stock.",
            "Sentiment": "negative",
            "PublishDate": 1768880917519,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Raises PNB Target Price to ₹150",
            "Summary": "Global brokerage firm Jefferies maintains its 'Buy' rating on Punjab National Bank while raising the target price to ₹150 per share, signaling continued confidence in the public sector bank's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768880891701,
            "Source": "stocks"
        },
        {
            "Title": "PNB Q3FY26 Earnings Call Recording Now Available",
            "Summary": "Punjab National Bank has made available the audio/video recording of its earnings call with analysts and investors for Q3FY26 results discussion held on January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768842189083,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Revises Q4 Deposit Growth Forecast to 8.5%-9%",
            "Summary": "Punjab National Bank adjusts Q4 deposit growth expectations to 8.5%-9% from earlier 9%-10% guidance while maintaining FY26 NIM targets at 2.8%-2.9%.",
            "Sentiment": "neutral",
            "PublishDate": 1768814250862,
            "Source": "stocks"
        },
        {
            "Title": "PNB Q3FY26: PAT Up 13% to ₹5,100 Cr, NII Falls 4.5%",
            "Summary": "Punjab National Bank reported 13% YoY net profit growth to ₹5,100 crore in Q3FY26, but NII declined 4.5% to ₹10,533 crore. Credit growth at 10.9% missed guidance while asset quality improved with gross NPAs at 3.19%.",
            "Sentiment": "neutral",
            "PublishDate": 1768811737227,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB 9-Month GNPA 3.2% vs FY Guidance Under 3%",
            "Summary": "Punjab National Bank's 9-month GNPA at 3.2% approaches full-year guidance of under 3%, while NNPA at 0.32% remains within under 0.35% target, showing strong asset quality trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1768811165121,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Q3FY26 Earnings Call Set for January 19, 2026",
            "Summary": "Punjab National Bank announces earnings call with analysts and investors on January 19, 2026, at 4:00 PM IST to discuss Q3FY26 financial results. Senior management including MD & CEO to participate.",
            "Sentiment": "neutral",
            "PublishDate": 1768311025377,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Board Meeting Set for January 19 to Review Q3FY26",
            "Summary": "Punjab National Bank has scheduled its Board meeting for January 19, 2026, to consider and approve Q3FY26 financial results. Trading window remains closed until January 21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768310119095,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBI Penalizes PNB ₹1.27 Lakh for Currency Chest Issue",
            "Summary": "Reserve Bank of India imposed ₹1,27,150 penalty on Punjab National Bank following minor shortage of notes at currency chest. Bank states penalty has no significant financial impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1767947295661,
            "Source": "stocks"
        },
        {
            "Title": "PNB Penalized ₹1.27 Lakh by RBI for Currency Shortage",
            "Summary": "Punjab National Bank receives monetary penalty from Reserve Bank of India for shortage of notes at currency chest, with minimal financial impact expected on operations.",
            "Sentiment": "negative",
            "PublishDate": 1767941452911,
            "Source": "stocks"
        },
        {
            "Title": "PNB Attributes Margin Decline to Repo Rate Cut",
            "Summary": "Punjab National Bank explains that recent margin compression is attributed to the repo rate cut, while maintaining its double-digit growth targets for the coming months.",
            "Sentiment": "neutral",
            "PublishDate": 1767846029758,
            "Source": "stocks"
        },
        {
            "Title": "PNB Auctions ₹760 Cr Bad Loans Including Gammon India",
            "Summary": "Punjab National Bank offers non-performing loans worth ₹760 crore for sale to ARCs, featuring major accounts like Gammon India (₹514 cr) and Simbhaoli Sugars (₹226 cr), following earlier ₹2,500 cr auction.",
            "Sentiment": "neutral",
            "PublishDate": 1767832163244,
            "Source": "stocks"
        },
        {
            "Title": "PNB Penalized ₹4.85 Lakh by RBI for Currency Shortage",
            "Summary": "Punjab National Bank disclosed receiving a monetary penalty of ₹4.85 lakh from the Reserve Bank of India for shortage of notes at its currency chest facility on January 6, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1767710896565,
            "Source": "stocks"
        },
        {
            "Title": "PNB Q3: Global Business Grows 9.6% YoY to ₹28.92T",
            "Summary": "Punjab National Bank reports 9.60% YoY growth in global business to ₹28.92 lakh crore with advances jumping 11.00% and credit-deposit ratio rising to 74.21% in Q3FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767356574708,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB reports ₹2,434 crore fraud against SREI promoters",
            "Summary": "Punjab National Bank reports borrowal fraud of ₹2,434 crore to RBI involving erstwhile SREI promoters, makes 100% provision for both SEFL and SIFL outstanding amounts totaling the fraud value.",
            "Sentiment": "negative",
            "PublishDate": 1766757867457,
            "Source": "stocks"
        },
        {
            "Title": "PNB Added to BSE Bankex Index with $15M Impact",
            "Summary": "Punjab National Bank gets included in BSE Bankex index rejig today at 3pm, marking a significant development for the public sector bank with USD 15 million addition.",
            "Sentiment": "positive",
            "PublishDate": 1766555690726,
            "Source": "stocks"
        },
        {
            "Title": "PNB Gets Rating Reaffirmation from Brickwork Ratings",
            "Summary": "Brickwork Ratings reaffirmed Punjab National Bank's BWR AA-/Stable rating for Basel III Additional Tier 1 Bonds worth ₹3,000 crores, citing improved asset quality and strong government support.",
            "Sentiment": "positive",
            "PublishDate": 1765805148739,
            "Source": "stocks"
        },
        {
            "Title": "CARE Ratings Reaffirms Punjab National Bank's AAA Ratings, Withdraws Some Bond Ratings Post-Redemption",
            "Summary": "CARE Ratings reaffirmed Punjab National Bank's AAA stable ratings on infrastructure bonds, Basel III Tier 1 and Tier 2 bonds, and A1+ rating on certificates of deposit, while withdrawing ratings on bonds that have been redeemed. The rating action reflects PNB's comfortable capitalization levels supported by internal accruals and capital infusions including equity raise in FY25, though asset quality remains moderate compared to peer banks with GNPA at 3.45% as of September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765202233333,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab National Bank Faces Rs 15.37 Crore Penalty from SAFEMA Appellate Tribunal",
            "Summary": "Punjab National Bank has been imposed a monetary penalty of Rs 15.37 crore by the Appellate Tribunal under SAFEMA following an appeal against a 2019 FIU-India order under the Prevention of Money Laundering Act. The penalty relates to violations during the review period from April 2016 to November 2017, with the bank stating no material impact on its financial position as the amount has been fully provided for in accounts.",
            "Sentiment": "negative",
            "PublishDate": 1765197054795,
            "Source": "stock"
        },
        {
            "Title": "Punjab National Bank Faces Rs 15.37 Crore Penalty from Appellate Tribunal Under SAFEMA",
            "Summary": "Punjab National Bank has been imposed a monetary penalty of Rs 15.37 crore by the Appellate Tribunal under SAFEMA following an appeal against FIU-India's order related to Prevention of Money Laundering Act violations during April 2016 to November 2017. The bank states there is no material impact on its financial position or operations, having already implemented corrective measures and system checks to address the non-compliances.",
            "Sentiment": "negative",
            "PublishDate": 1765015774616,
            "Source": "corporate_governance"
        },
        {
            "Title": "ICRA Reaffirms Punjab National Bank's AAA Ratings, Withdraws Ratings on Redeemed Bonds",
            "Summary": "ICRA reaffirmed Punjab National Bank's ratings across multiple instruments including Basel III Tier I bonds (ICRA AAA/Stable), infrastructure bonds, and certificates of deposit, while withdrawing ratings on Rs. 1,000 crore Basel III Tier II bonds and Rs. 1,800 crore infrastructure bonds due to full redemption. The rating agency cited PNB's sovereign ownership, robust deposit franchise, comfortable capitalization levels, and improved asset quality indicators with gross NPA declining to 3.45% as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764944951127,
            "Source": "stock"
        },
        {
            "Title": "Punjab National Bank Announces Senior Management Changes with New CRO Appointment",
            "Summary": "Punjab National Bank appointed Shri Pratap Reshian Mallick as Group Chief Risk Officer and elevated Shri Surindar Pal Singh and Shri Sunil Kumar Chawla to General Manager positions. Shri Sanjay Varshneya, Chief General Manager of Financial Inclusion Division, retired due to superannuation, with all changes effective from December 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764600713584,
            "Source": "corporate_governance"
        },
        {
            "Title": "Punjab National Bank Announces Senior Management Promotions",
            "Summary": "Punjab National Bank promoted three senior managers to Chief General Manager positions across IT Division, Regional Rural Bank operations, and Business Administration divisions. The promotions of Manish Agrawal, Sanjeev Kumar Dhupar, and Sudhir Dalal took effect on November 25, 2025, representing internal advancement of experienced banking professionals with 18-31 years of service.",
            "Sentiment": "positive",
            "PublishDate": 1764080801182,
            "Source": "corporate_governance"
        },
        {
            "Title": "Canara Bank Appoints Sunil Kumar Chugh as Executive Director",
            "Summary": "The Central Government appointed Sunil Kumar Chugh, Chief General Manager at Punjab National Bank, as Executive Director of Canara Bank for three years effective November 24, 2025. Chugh brings over three decades of banking experience across five public sector banks with expertise in corporate credit, retail banking, and stressed assets management.",
            "Sentiment": "neutral",
            "PublishDate": 1764001641646,
            "Source": "corporate_governance"
        },
        {
            "Title": "Punjab National Bank Appoints Amit Kumar Srivastava as Executive Director",
            "Summary": "Punjab National Bank appointed Amit Kumar Srivastava as Executive Director for three years effective November 24, 2025, following government notification under Banking Companies Act. Srivastava, who previously served as Group Chief Risk Officer at PNB, brings over 31 years of banking experience across branch banking, treasury management, and risk management.",
            "Sentiment": "positive",
            "PublishDate": 1764001042541,
            "Source": "corporate_governance"
        },
        {
            "Title": "Moody's Upgrades Punjab National Bank's Credit Ratings by One Notch",
            "Summary": "Moody's Rating Agency upgraded Punjab National Bank's Baseline Credit Assessment and Adjusted Baseline Credit Assessment by one notch following adoption of new methodology for bank ratings globally. The bank's revised ratings include Counterparty Risk Rating of Baa3/P-3, Bank Deposits of Baa3/P-3, and Baseline Credit Assessment of ba1 with stable outlook.",
            "Sentiment": "positive",
            "PublishDate": 1763470935777,
            "Source": "stock"
        },
        {
            "Title": "PNB Chairman K.G. Ananthakrishnan Completes Tenure",
            "Summary": "Punjab National Bank announced that K.G. Ananthakrishnan has ceased to be the Part-Time Non-Official Director and Non-Executive Chairman of the bank upon completion of his tenure on November 6, 2025. His appointment was pursuant to a Department of Financial Services, Ministry of Finance notification dated November 7, 2022. The bank informed stock exchanges BSE and NSE about this development in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762492626591,
            "Source": "corporate_governance"
        },
        {
            "Title": "Punjab National Bank Announces Senior Management Changes",
            "Summary": "Punjab National Bank has announced changes in senior management assignments effective November 1, 2025. Ronee Mousumi Majumdar has been appointed as General Manager of HO Credit Review and Monitoring Division, moving from her previous role as HO Chief Credit Review and Monitoring. She holds a B.Sc. in Chemistry and CAIIB certification with over 33 years of banking experience. NVSP Reddy has been designated as General Manager and Executive Secretary to MD & CEO, transitioning from Deputy General Manager of HO Board Coordination Division. He is a mechanical engineering graduate with CAIIB certification and over 29 years of experience at the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1761990980852,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Chief General Manager Suresh Kumar Rana Retires from BARM Division",
            "Summary": "Punjab National Bank announced that Suresh Kumar Rana, Chief General Manager of BARM Division at Head Office, vacated his position on October 31, 2025, due to superannuation. The bank informed stock exchanges BSE and NSE about this senior management change as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761924252103,
            "Source": "corporate_governance"
        },
        {
            "Title": "Punjab National Bank Reduces MCLR Rates by 5 Basis Points Across All Tenors",
            "Summary": "Punjab National Bank announced a reduction in its Marginal Cost of Funds Based Lending Rates (MCLR) across all tenors, effective November 1, 2025. The overnight MCLR decreased from 8.00% to 7.95%, one-month from 8.25% to 8.20%, three-month from 8.45% to 8.40%, and six-month from 8.65% to 8.60%. The bank also reduced rates for longer tenors, with cuts of 5 basis points each. The Repo Linked Lending Rate (RLLR) remains unchanged at 8.35% including a base spread of 0.10%, and the Base Rate continues at 9.50%.",
            "Sentiment": "positive",
            "PublishDate": 1761917701784,
            "Source": "stock"
        },
        {
            "Title": "Punjab National Bank Reports 14% Growth in Net Profit for Q2 FY26, Improves Asset Quality",
            "Summary": "Punjab National Bank reported net profit of INR 4,904 crores for Q2 FY26, up 14% from INR 4,303 crores in the same period last year. Operating profit increased to INR 7,227 crores from INR 6,853 crores year-on-year. The bank's global business stood at INR 27.87 trillion with 10.6% growth, while global deposits reached INR 16.17 trillion (10.9% growth) and advances grew to INR 11.7 trillion (10.1% growth). Asset quality improved significantly with gross NPA reducing to 3.45% from 4.48% in September 2024, and net NPA declining to 0.36% from 0.46%. The bank maintains a provision coverage ratio of 96.91%. Return on assets improved to 1.05% from 1.02% last year, while return on equity stands at 17.95%. The bank has sanctioned credit lines worth INR 1.78 lakh crores pending disbursement. Management expects NIM improvement of 5 basis points in Q3 and 10 basis points in Q4 due to deposit repricing benefits. The bank targets credit growth of 11-12% for the full year and expects to achieve gross NPA below 3% by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1761570352360,
            "Source": "earnings"
        },
        {
            "Title": "Belgian Court Approves Mehul Choksi's Extradition to India in Rs 13,000 Crore PNB Scam Case",
            "Summary": "A Belgian court has ruled that fugitive diamantaire Mehul Choksi faces no risk of unfair trial or ill-treatment if extradited to India for his role in the Rs 13,000 crore Punjab National Bank scam. The Court of Appeals in Antwerp upheld arrest warrants issued by a Mumbai special court, allowing Choksi's extradition. Choksi and his nephew Nirav Modi are accused of swindling Rs 13,000 crore through fraudulent letters of undertaking in collusion with bank officials at PNB's Brady House branch. A specially prepared cell at Mumbai's Arthur Road Jail has been readied for Choksi, featuring amenities including TV, newspapers, natural light, and videoconferencing facilities. India provided assurances to Belgian authorities regarding Choksi's safety, prison arrangements, and human rights. Choksi has been imprisoned in Antwerp since April, with multiple bail petitions rejected. He had fled to Antigua and Barbuda before the scam was detected and obtained citizenship there, though he remains an Indian citizen.",
            "Sentiment": "neutral",
            "PublishDate": 1761213807386,
            "Source": "stock"
        },
        {
            "Title": "Punjab National Bank Reduces Stake in Canara HSBC Life Insurance from 23% to 13% Through IPO",
            "Summary": "Punjab National Bank divested its stake in Canara HSBC Life Insurance Company Limited from 23% to 13% through an Offer for Sale in Initial Public Offer. The bank sold 9.5 crore shares at Rs 106 per share, generating cash consideration of Rs 1,007 crores. The sale agreement was entered on October 17, 2025. Canara HSBC Life Insurance reported a net worth of Rs 1,516.90 crores, income of Rs 10,725.90 crores, expenses of Rs 10,597.80 crores, and profit after tax of Rs 117 crores for the financial year ending March 31, 2025. The transaction does not constitute a related party transaction and the buyers are public investors.",
            "Sentiment": "neutral",
            "PublishDate": 1761131693083,
            "Source": "corporate_action"
        },
        {
            "Title": "PNB Expects $1 Billion Impact from RBI's New Credit-Loss Rules",
            "Summary": "Punjab National Bank CEO Ashok Chandra estimates the bank will face a ₹90 billion ($1 billion) impact when transitioning to the Reserve Bank of India's new Expected Credit Loss framework. The RBI's draft rules require banks to shift from the current incurred-loss model to a forward-looking system that anticipates potential future losses. Under the new framework, banks must classify loans into three stages of credit risk and provide for expected losses based on exposure quality. The changes take effect from April 2027 and align India's system with global IFRS 9 norms. Most of PNB's impact will come from Stage 2 assets, which could reduce the bank's capital ratio by about 0.85 percentage points. PNB expects to absorb the impact through earnings as India's banking sector prepares for more risk-sensitive provisioning requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1760962123376,
            "Source": "stock"
        },
        {
            "Title": "Punjab National Bank Reports 14% Growth in Q2 Net Profit to 49 Billion Rupees",
            "Summary": "Punjab National Bank reported a net profit of 49 billion rupees for Q2, representing a year-over-year increase from 43 billion rupees. The bank's revenue grew to 318.7 billion rupees compared to 299 billion rupees in the same period last year. Asset quality showed improvement with Gross Non-Performing Assets (GNPA) declining to 3.45% from 3.78% quarter-over-quarter, while Net Non-Performing Assets (NNPA) decreased to 0.36% from 0.38% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760918875830,
            "Source": "earnings"
        },
        {
            "Title": "Punjab National Bank Revises Net Interest Margin Guidance to 15 Basis Points Increase by March 2026",
            "Summary": "Punjab National Bank announced that it expects its net interest margin to increase by 15 basis points by March 2026. The bank's management shared this updated guidance with analysts during a conference call following the release of its second-quarter earnings results.",
            "Sentiment": "positive",
            "PublishDate": 1760788225607,
            "Source": "stock"
        },
        {
            "Title": "Punjab National Bank Reports Quarterly Financial Results for September 2025",
            "Summary": "Punjab National Bank's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The bank reported interest earned of Rs. 31,964 crore for the quarter, compared to Rs. 29,875 crore in the same period last year. Net profit after tax stood at Rs. 4,904 crore for the quarter versus Rs. 3,252 crore in the previous year. The bank's gross NPAs decreased to 3.78% from 4.48% year-over-year, while net NPAs improved to 0.97% from 1.02%. Total deposits increased to Rs. 16,29,131 crore from Rs. 15,77,020 crore in the previous year. The bank maintained a capital adequacy ratio of 17.19% and redeemed Basel III compliant Tier II Bonds worth Rs. 994 crore during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760775969367,
            "Source": "earnings"
        },
        {
            "Title": "Punjab National Bank Schedules Board Meeting for October 18, 2025 to Approve Quarterly Results",
            "Summary": "Punjab National Bank has scheduled a Board of Directors meeting on October 18, 2025 to consider and approve the unaudited financial results for the quarter ending September 30, 2025. The trading window for bank shares will remain closed until October 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760331390026,
            "Source": "corporate_action"
        },
        {
            "Title": "PNB Raises Credit Growth Forecast to 11-12%",
            "Summary": "Punjab National Bank has revised its credit growth forecast upward to 11-12%, increasing from the previous projection of 10.3%. This represents an improvement in the bank's growth expectations.",
            "Sentiment": "positive",
            "PublishDate": 1759725191108,
            "Source": "stock"
        },
        {
            "Title": "PNB Reports 11% Growth in Global Business to ₹27.88 Lakh Crore",
            "Summary": "Punjab National Bank reported provisional business figures showing global business of ₹27,87,839 crore, up 10.6% year-on-year from ₹25,20,246 crore and 2.5% quarter-on-quarter from ₹27,19,276 crore. Domestic business reached ₹26,83,034 crore, rising 10.4% year-on-year and 2.5% quarter-on-quarter. Global deposits stood at ₹16,17,041 crore, increasing 10.9% year-on-year and 3.4% quarter-on-quarter. Global advances rose to ₹11,70,798 crore, reflecting 10.3% year-on-year growth and 3.7% quarter-on-quarter increase. The bank's global Credit-Deposit ratio was 72.40%, compared to 72.82% a year earlier and 71.09% in the previous quarter. PNB shares closed at ₹114.45, up 1.69%.",
            "Sentiment": "positive",
            "PublishDate": 1759489086666,
            "Source": "stock"
        },
        {
            "Title": "Nirav Modi's Brother-In-Law Granted Pardon in PNB Fraud Case, Becomes Approver",
            "Summary": "A CBI court granted Maiank Mehta, brother-in-law of businessman Nirav Modi, a pardon in the Punjab National Bank fraud case, making him an approver. Special CBI Judge A V Gujarathi approved Mehta's plea on condition that he makes full disclosure of circumstances and other persons involved. Mehta, a British citizen and Hong Kong resident, is accused under criminal conspiracy, cheating, and criminal breach of trust charges. He voluntarily came to India in September 2021 and had previously received pardon in related money laundering cases. The prosecution did not object to his plea. The court directed Mehta, currently abroad, to present himself for proceedings. The PNB scam involves allegations that Nirav Modi and Mehul Choksi siphoned over Rs 13,000 crore using fraudulent Letters of Undertaking and foreign letters of credit by bribing bank officials at PNB's Brady House branch in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1758953209935,
            "Source": "stock"
        },
        {
            "Title": "Punjab National Bank Sets Record Dates for Basel III Tier-II Bond Interest and Principal Payments",
            "Summary": "Punjab National Bank announced record dates for payment of interest and principal on two Basel III Tier-II bond series. For Series XXII bonds with 7.25% annual interest rate, the record date is October 14, 2025, with payment due on September 29, 2025. For the 8.34% annual bond series, the record date is October 13, 2025 (adjusted from October 11 due to bank holidays), with payment due on October 24, 2025 (adjusted from October 26 due to bank holidays). The bank has a call option to exercise on the Series XXII bonds.",
            "Sentiment": "neutral",
            "PublishDate": 1758104187110,
            "Source": "corporate_action"
        }
    ]
}