{
    "Symbol": "PNBGILTS",
    "ISIN": "INE859A01011",
    "News": [
        {
            "Title": "PNB Gilts Gets RBI Nod for New Additional Director",
            "Summary": "PNB Gilts Ltd receives Reserve Bank of India approval for appointment of Bibhu Prasad Mahapatra as Additional Director, effective January 29, 2026, following board resolution from November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1769765692617,
            "Source": "stocks"
        },
        {
            "Title": "PNB Gilts Gets A1+ Rating Reaffirmation from ICRA",
            "Summary": "ICRA Limited reaffirmed [ICRA] A1+ credit ratings for PNB Gilts' Rs. 1000 crore Commercial Paper and Inter-Corporate Deposit programmes on January 29, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769760064083,
            "Source": "stocks"
        },
        {
            "Title": "PNB Gilts Reports Strong Q3 Turnaround with ₹53.90 Cr Profit",
            "Summary": "PNB Gilts swings to ₹53.90 crore net profit in Q3 from ₹10.10 crore loss last year, while revenue grows 16.67% to ₹420 crore, marking a significant operational turnaround.",
            "Sentiment": "positive",
            "PublishDate": 1768794816724,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Gilts Board Meet Set for Jan 17 to Review Q3 Results",
            "Summary": "PNB Gilts Limited has scheduled a board meeting on January 17, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768213501850,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Gilts CFO Chandra Prakash Resigns Due to Transfer Back to Parent Bank",
            "Summary": "Chandra Prakash resigned as Chief Financial Officer and Chief Information Security Officer of PNB Gilts Ltd effective November 28, 2025, due to his transfer back to Punjab National Bank for another assignment. The Board will appoint his successor within stipulated timelines and inform stock exchanges accordingly.",
            "Sentiment": "neutral",
            "PublishDate": 1764326850648,
            "Source": "corporate_governance"
        },
        {
            "Title": "CRISIL Reaffirms Credit Ratings for PNB Gilts' Commercial Paper and Bank Loan Facilities",
            "Summary": "CRISIL Ratings Limited reaffirmed its CRISIL A1+ rating for PNB Gilts Limited's Rs. 1000 crore Commercial Paper programme and assigned the same rating to Rs. 2100 crore bank loan facilities. The rating reaffirmation affects the subsidiary of Punjab National Bank and indicates maintained creditworthiness for its debt instruments and borrowing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1764322910869,
            "Source": "corporate_action"
        },
        {
            "Title": "PNB Gilts Director Amit Kumar Srivastava Resigns Following Elevation to Executive Director at Punjab National Bank",
            "Summary": "Amit Kumar Srivastava resigned as Non-Executive Non-Independent Director of PNB Gilts Limited effective November 26, 2025, following his appointment as Executive Director of Punjab National Bank through a gazette notification dated November 24, 2025. The resignation affects PNB Gilts' board composition as Srivastava was a promoter-nominated director who ceased his role as Group Chief Risk Officer at PNB upon assuming the Executive Director position.",
            "Sentiment": "neutral",
            "PublishDate": 1764157072669,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Gilts Appoints Anju Mittal as Additional Director Subject to RBI Approval",
            "Summary": "PNB Gilts Limited appointed Smt. Anju Mittal, General Manager of Punjab National Bank's Compliance Division, as Additional Director (Non-Executive Non-Independent) effective upon RBI approval or DIN allotment. The appointment follows nomination from parent company PNB and recommendation by the Nomination and Remuneration Committee, with Mittal bringing 32 years of banking experience in core banking, risk management, and compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1763991051799,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Gilts Appoints Bhibhu Prasad Mahapatra as Additional Director",
            "Summary": "PNB Gilts Limited has appointed Bhibhu Prasad Mahapatra, Executive Director of Punjab National Bank, as Additional Director (Non-Executive Non-Independent) subject to Reserve Bank of India approval. The appointment follows nomination from parent company Punjab National Bank and recommendation from the Nomination and Remuneration Committee, with Mahapatra bringing over 36 years of banking experience across compliance, forex, trade finance, and MSME sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763467989693,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Gilts Reports Reduced Net Loss and Lower Revenue in Q2",
            "Summary": "PNB Gilts reported a net loss of 454 million rupees in Q2, which is lower than the previous year's loss of 1.15 billion rupees. The company's revenue for Q2 was 4.4 billion rupees, down from 5 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1760619681958,
            "Source": "earnings"
        },
        {
            "Title": "PNB Gilts Reports Strong Q1 2025 Results with 113% Profit Jump, Appoints New Auditor",
            "Summary": "PNB Gilts Limited reported unaudited financial results for the quarter ended June 30, 2025, showing significant improvement in profitability. The company posted a profit of Rs 16,007.07 lacs compared to Rs 5,344.12 lacs in the same quarter last year, representing a 113% increase. Total revenue from operations rose to Rs 56,326.51 lacs from Rs 44,027.94 lacs year-over-year, driven primarily by higher net gains on securities of Rs 15,668.92 lacs versus Rs 3,118.19 lacs previously. The Board appointed M/s. Pranav Kumar & Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to 2029-30, subject to shareholder approval. The company scheduled its 29th Annual General Meeting for September 17, 2025, and set September 10, 2025 as the record date for final dividend eligibility for FY 2024-25. Earnings per share increased to Rs 8.89 from Rs 2.97 in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1753260086231,
            "Source": "earnings"
        },
        {
            "Title": "PNB Gilts Reports 27% Revenue Growth in Q1",
            "Summary": "PNB Gilts reported quarterly revenue of 5.6 billion rupees compared to 4.4 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1753259353034,
            "Source": "earnings"
        },
        {
            "Title": "PNB Gilts Reports 200% Jump in Quarterly Net Profit to 1.6 Billion Rupees",
            "Summary": "PNB Gilts posted a net profit of 1.6 billion rupees in its quarterly results, representing a significant increase from 534 million rupees in the same period last year. The company's profit grew by approximately 200% year-over-year, indicating strong financial performance during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753258966282,
            "Source": "earnings"
        },
        {
            "Title": "ARCL Approves Waiver of Penalty for PNB Gilts",
            "Summary": "ARCL (Asset Reconstruction Company Limited) has granted approval to waive a penalty imposed on PNB Gilts. The specific details of the penalty or the reason for its waiver are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751633662000,
            "Source": "default"
        },
        {
            "Title": "PNB Gilts Reports Q4 FY23 Financial Results and Dividend",
            "Summary": "PNB Gilts announced its Q4 FY23 financial results. Net profit increased to 750.2 million rupees, up from 681.3 million rupees year-over-year, but down from a loss of 101.1 million rupees quarter-over-quarter. Revenue decreased to 4.19 billion rupees from 4.74 billion rupees year-over-year. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746403571000,
            "Source": "default"
        },
        {
            "Title": "PNB GILTS Reports Q4 Results and Recommends Dividend",
            "Summary": "PNB GILTS has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue decreased to 4.19 billion rupees from 4.74 billion rupees year-over-year. However, Q4 standalone net profit increased to 750.2 million rupees from 681.3 million rupees year-over-year, while showing a loss of 101.1 million rupees quarter-over-quarter. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1746201603000,
            "Source": "result"
        },
        {
            "Title": "PNB Gilts Appoints Pareed Sunil as New Managing Director & CEO",
            "Summary": "PNB Gilts has announced the appointment of Pareed Sunil as its new Managing Director and Chief Executive Officer. This leadership change represents a significant development in the company's corporate governance structure.",
            "Sentiment": "neutral",
            "PublishDate": 1740575181000,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB GILTS Reports Q3 Financial Results",
            "Summary": "PNB GILTS announced its Q3 financial results, reporting a net loss of 101 million rupees, an improvement from the 155 million rupees loss in the same quarter last year. However, this represents a significant decline from the 1.14 billion rupees profit in the previous quarter. The company's revenue for Q3 stood at 3.6 billion rupees, down from 3.83 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738076909000,
            "Source": "earnings"
        },
        {
            "Title": "PNB GILTS Reports Profitable Q2 FY2024",
            "Summary": "PNB GILTS has announced a net profit of 1.15 billion rupees for the second quarter, marking a significant turnaround from a loss of 411 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729755237000,
            "Source": "result"
        },
        {
            "Title": "PNB GILTS Board Meeting Scheduled for Q2 Results",
            "Summary": "<p>PNB GILTS has announced a <span class='neutral'>board meeting</span> to be held on <b>October 24</b> to <span class='neutral'>consider and approve</span> the <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the current <span class='neutral'>fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728570015000,
            "Source": "corporate_action"
        }
    ]
}