{
    "Symbol": "PNBHOUSING",
    "ISIN": "INE572E01012",
    "News": [
        {
            "Title": "Multiple Companies Report Q3FY26 Financial Results",
            "Summary": "Several listed companies including Credo Brands, MAN Industries, Route Mobile, and others announced their quarterly financial results for Q3FY26, showing mixed performance across sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1770800732704,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Housing Finance Meets Investors at Axis Conference",
            "Summary": "PNB Housing Finance participated in Advantage India - Axis Capital's flagship conference on February 10, 2026, with senior management engaging 16 institutional investors in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1770742055455,
            "Source": "stocks"
        },
        {
            "Title": "PNB Housing Finance seeks shareholder approval for key appointments",
            "Summary": "PNB Housing Finance Limited has issued a postal ballot notice seeking member approval for appointment of new Managing Director & CEO, nominee director, and sitting fee payment through remote e-voting from February 11 to March 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770737371349,
            "Source": "stocks"
        },
        {
            "Title": "PNB Housing Finance schedules investor meet at Goldman Sachs",
            "Summary": "PNB Housing Finance Limited announces participation in Goldman Sachs 2026 Asia Financials Corporate Day on February 2, 2026, featuring one-on-one and group meetings with investors in virtual format from Gurugram.",
            "Sentiment": "neutral",
            "PublishDate": 1769601694672,
            "Source": "stocks"
        },
        {
            "Title": "PNB Housing Finance Maintains Growth & NIM Guidance",
            "Summary": "PNB Housing Finance reaffirms retail book growth forecast at 17-18% and maintains Net Interest Margin guidance at 3.6-3.7% during recent concall, signaling steady business outlook.",
            "Sentiment": "positive",
            "PublishDate": 1769053640101,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Housing Finance Reports ₹237.43 Cr Fraud Case",
            "Summary": "PNB Housing Finance Limited disclosed a fraud involving M/s. Sarv Realtors Private Limited worth ₹237.43 crores. The account was already written-off in FY 2022-23, ensuring no material impact on current financials.",
            "Sentiment": "negative",
            "PublishDate": 1769021688006,
            "Source": "stocks"
        },
        {
            "Title": "PNB Housing Finance Q3 FY26 Net Profit Rises 7.67%",
            "Summary": "PNB Housing Finance reported net profit of ₹520.35 crores for Q3 FY26, up 7.67% YoY. Nine-month profit reached ₹1,635.44 crores, marking 18.01% growth with strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769005830026,
            "Source": "co_actions_results"
        },
        {
            "Title": "Motilal Oswal Sets ₹1,250 Target for PNB Housing",
            "Summary": "Motilal Oswal maintains BUY rating on PNB Housing Finance with ₹1,250 target price, citing resilient performance and new leadership appointment strengthening execution capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1768982225446,
            "Source": "stocks"
        },
        {
            "Title": "PNB Housing Finance Board Meet Set for Jan 21, 2026",
            "Summary": "PNB Housing Finance Limited announces Board meeting on January 21, 2026 to consider Q3 FY26 financial results. Trading window closed from January 1, 2026 until 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768305299662,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Housing Finance Grants ESOPs and RSUs to Employees",
            "Summary": "PNB Housing Finance Limited granted 2,00,000 ESOPs at ₹932.85 exercise price and 32,508 RSUs at ₹10.00 exercise price to eligible employees under its employee benefit schemes on December 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766592269963,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNB Housing Finance Faces ₹107.92 Cr IT Demand",
            "Summary": "PNB Housing Finance receives income tax demand of ₹107.92 crores for AY 2019-20 and 2020-21 following disallowance of revenue expenses. Company plans rectification application citing errors in order.",
            "Sentiment": "negative",
            "PublishDate": 1766508294183,
            "Source": "stocks"
        },
        {
            "Title": "PNB Housing Finance Elevates Mukesh Agarwal to Function Head",
            "Summary": "PNB Housing Finance Limited announced the elevation of Mukesh Agarwal as Function Head, effective December 15, 2025. Agarwal, currently Chief Sales Officer-Retail, brings 21 years of finance experience.",
            "Sentiment": "positive",
            "PublishDate": 1765812179805,
            "Source": "stocks"
        },
        {
            "Title": "PNB Housing Finance Board Approves Ajai Kumar Shukla as MD & CEO",
            "Summary": "PNB Housing Finance's Board formally approved Mr. Ajai Kumar Shukla's appointment as Managing Director and CEO effective December 18, 2025, for a five-year term, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1765528619900,
            "Source": "stocks"
        },
        {
            "Title": "PNB Housing Finance Raises Rs 245 Crore Through Non-Convertible Debentures",
            "Summary": "PNB Housing Finance Limited allotted 24,500 secured, rated, redeemable non-convertible debentures of Rs 1 lakh each, raising Rs 245 crore through private placement on December 05, 2025. The debentures carry a 7.28% coupon rate with maturity on June 05, 2028, and will be listed on NSE's Wholesale Debt Market segment.",
            "Sentiment": "positive",
            "PublishDate": 1764917297608,
            "Source": "corporate_action"
        },
        {
            "Title": "PNB Housing Finance Announces Leadership Change in Internal Audit Function",
            "Summary": "Ajay Kumar Mohanty, Head-Internal Audit & Chief of Internal Vigilance at PNB Housing Finance Limited, has retired from service effective November 29, 2025. Vipin Malhotra, a seasoned finance and audit professional with over 23 years of experience and multiple certifications including CA, CIA, CISA, and CFE, will head the Internal Audit function from November 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764421742820,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Finance Gets Credit Rating Reaffirmation and Enhancement from ICRA",
            "Summary": "ICRA reaffirmed PNB Housing Finance's ICRA [AA-] (Stable) rating and assigned the same rating for enhanced long-term bank facilities of Rs. 10,000 crore, up from Rs. 5,000 crore. The rating reflects the company's established track record in mortgage financing with assets under management of Rs. 83,879 crore and expected support from promoter Punjab National Bank which holds a 28% stake.",
            "Sentiment": "positive",
            "PublishDate": 1764253701980,
            "Source": "stock"
        },
        {
            "Title": "PNB Housing Finance Gets Credit Rating Upgrade to INDAAA from India Ratings",
            "Summary": "PNB Housing Finance received a credit rating upgrade from India Ratings on its Non-Convertible Debentures and Bank Loans from INDAA to INDAAA with Stable Outlook, citing improved profitability, asset quality, and reduced concentration risks. The company reported Retail Loan Assets of ₹79,439 crores with 17% YoY growth, Gross NPA at 1.04%, and Return on Assets at 2.65% in H1 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763620769159,
            "Source": "stock"
        },
        {
            "Title": "PNB Housing Finance Gets Credit Rating Upgrade to IND AAA/Stable from India Ratings",
            "Summary": "India Ratings upgraded PNB Housing Finance's Non-Convertible Debentures and Bank Loans worth INR 114.55 billion to IND AAA/Stable from IND AA+/Stable, citing expected timely support from parent Punjab National Bank. The upgrade reflects PNBHF's position among India's top housing financiers, consistent improvement in profitability and asset quality, and the lifting of proposed restrictions on overlapping business lines between banks and subsidiaries by RBI.",
            "Sentiment": "positive",
            "PublishDate": 1763383095491,
            "Source": "stock"
        },
        {
            "Title": "PNB Housing Finance Shareholders Approve Appointment of D. Surendran as Non-Executive Director",
            "Summary": "PNB Housing Finance Limited shareholders approved the appointment of Mr. D. Surendran (DIN: 10174317) as Nominee Non-Executive Director through postal ballot with 99.0101% votes in favor. The e-voting process conducted from October 15 to November 13, 2025, saw participation from 1,127 voters representing 20,94,50,930 equity shares out of total 26,05,08,563 shares.",
            "Sentiment": "positive",
            "PublishDate": 1763113375757,
            "Source": "corporate_action"
        },
        {
            "Title": "Ajai Shukla Emerges as Frontrunner for PNB Housing Finance CEO Position",
            "Summary": "Ajai Shukla, Chief Business Officer at Tata Capital Housing Finance, has emerged as the leading candidate for the CEO position at PNB Housing Finance. The PNB Housing board has submitted a shortlist of candidates to the Reserve Bank of India and National Housing Bank for approval, with regulatory clearances currently in process. Other contenders include Jatul Anand, Executive Director at PNB Housing Finance, and Sachinder Bhinder, CEO of Aavas Financiers. Shukla brings over two decades of experience in retail lending and housing finance. The CEO search follows Girish Kousgi's resignation as Managing Director and CEO, who stepped down on July 31, 2025, citing personal reasons, with his resignation taking effect on October 28.",
            "Sentiment": "neutral",
            "PublishDate": 1762327229458,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Finance Shortlists Four Candidates for MD & CEO Role",
            "Summary": "PNB Housing Finance has shortlisted four candidates for the position of Managing Director and Chief Executive Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1762131813066,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Finance Reports Strong Q2 Performance with 17% Loan Book Growth and Negative Credit Costs",
            "Summary": "PNB Housing Finance Limited reported robust quarterly results with retail loan book growing 17% year-on-year to INR 79,439 crores. The company achieved disbursements of nearly INR 6,000 crores, marking 20% sequential growth. Affordable and Emerging market segments grew 34% year-on-year, contributing 38% of retail loan book. Gross NPA improved to 1.04% from 1.24% in the previous year. The company recorded credit cost reversal of 53 basis points due to recoveries of INR 59 crores from written-off pool and ECL release of INR 70 crores from corporate loan foreclosure. Return on assets reached 2.73% for the quarter. Cost of borrowing declined 7 basis points to 7.69%. Net interest margin stood at 3.67% with spread improving to 2.26%. Profit after tax grew 24% year-on-year to INR 582 crores. The Affordable housing business (Roshni) showed 121% year-on-year growth with loan book of INR 6,531 crores. Company maintains growth guidance of 17-18% and plans to add 40-50 branches annually. Management indicated CEO selection process is ongoing with disclosures to be made to stock exchanges first.",
            "Sentiment": "positive",
            "PublishDate": 1761854463036,
            "Source": "earnings"
        },
        {
            "Title": "PNB Housing Finance CEO Girish Kousgi Steps Down, Interim Leadership Appointed",
            "Summary": "PNB Housing Finance announced that Managing Director and CEO Girish Kousgi vacated his office on October 28, 2025. Kousgi had submitted his resignation on July 30, which was accepted by the board. Executive Director Jatul Anand will lead the management team temporarily under Board Chairman D. Surendran's guidance while regulatory approvals for a new MD & CEO are processed. Kousgi will also step down from boards of subsidiaries PHFL Home Loans and PEHEL Foundation. The company reported strong quarterly results with profit rising 24% year-on-year to ₹582 crore and gross non-performing assets improving to 1.04% from 1.24%. Shares closed 1.01% higher at ₹937 on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761670386571,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Appoints Jatul Anand as Interim Leader While Seeking CEO Approvals",
            "Summary": "PNB Housing has appointed Executive Director Jatul Anand to lead the team on an interim basis. The company is working on obtaining regulatory approvals for a new Managing Director and CEO position.",
            "Sentiment": "neutral",
            "PublishDate": 1761658690746,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Finance CEO Selection Process Underway, Target Price Hiked by Motilal Oswal",
            "Summary": "PNB Housing Finance announced that its Board-led CEO selection process is in progress, with formal disclosure expected soon. The senior leadership team is maintaining business continuity and steady performance during the interim period. Management confirmed that the company's core mortgage strategy will remain unchanged under the new CEO, with no significant strategic modifications anticipated. Motilal Oswal has increased the target price for the stock following the quarterly review.",
            "Sentiment": "neutral",
            "PublishDate": 1761630848695,
            "Source": "stock"
        },
        {
            "Title": "PNB Housing Targets 17-18% Loan Growth, Plans 250 Affordable Housing Branches by Year-End",
            "Summary": "PNB Housing expects loan growth of 17-18% this year with net interest margin forecasted to remain between 3.6-3.7% in the second half. The company aims to maintain its operating expenses to assets ratio at 1-1.1%. PNB Housing plans to expand to 250 branches in affordable housing by year-end and targets a portfolio composition by FY27 of 15% affordable housing, 65% prime, and the remaining in emerging sector.",
            "Sentiment": "positive",
            "PublishDate": 1761622463186,
            "Source": "stock"
        },
        {
            "Title": "PNB Housing Finance Sets Ambitious Growth Targets for FY27",
            "Summary": "PNB Housing Finance has announced strategic targets for FY27, aiming to achieve a loan book of ₹1.25 lakh crore and return on equity of 18 percent. The company plans to grow its affordable and emerging markets segments at a 20 percent compound annual growth rate. Additionally, the housing finance company targets maintaining gross non-performing assets below 1 percent and net interest margin between 3.6-3.7 percent.",
            "Sentiment": "positive",
            "PublishDate": 1761580635671,
            "Source": "stock"
        },
        {
            "Title": "PNB Housing Finance Reports 24% Jump in Net Profit to Rs 582 Crore",
            "Summary": "PNB Housing Finance reported a 24% increase in net profit to Rs 582 crore for the second quarter ended September 2025, compared to Rs 470 crore in the same quarter of the previous year. Total income grew to Rs 2,131 crore from Rs 1,880 crore year-on-year, while interest income rose to Rs 2,017 crore from Rs 1,780 crore. Net interest income increased 14% to Rs 765 crore against Rs 669 crore in the year-ago quarter. The net interest margin remained stable at 3.67% compared to 3.68% in the previous year's second quarter. Asset quality improved with gross NPAs declining to 1.04% from 1.24% at the end of September 2024. The affordable and emerging market segment contributed 50% of total retail disbursements. The company maintained a strong capital adequacy ratio of 29.80%, with Tier I capital at 29.21%.",
            "Sentiment": "positive",
            "PublishDate": 1761576185883,
            "Source": "earnings"
        },
        {
            "Title": "PNB Housing Finance Reports Strong Q2 FY26 Performance with 12% Disbursement Growth",
            "Summary": "PNB Housing Finance Limited reported quarterly disbursements of INR 5,995 crore, marking 12% year-over-year growth. The company's loan book reached INR 79,771 crore, up 15% annually. Affordable and Emerging Markets segments drove growth with 25% disbursement increase and now contribute 50% of retail disbursements. Net Interest Margin stood at 3.67% while spread improved to 2.26%. Asset quality remained stable with Gross NPA at 1.04% compared to 1.06% in the previous quarter. Return on Assets increased to 2.73% on an annualized basis. The company recovered INR 59 crore from written-off accounts during the quarter. Cost of borrowing improved to 7.69% from 7.76% in the previous quarter. The retail loan book grew 17% year-over-year with Affordable and Emerging Markets segments contributing 38% of the retail portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1761572767782,
            "Source": "earnings"
        },
        {
            "Title": "PNB Housing Finance Reports 24% Jump in Quarterly Net Profit to 5.81 Billion Rupees",
            "Summary": "PNB Housing Finance reported consolidated net profit of 5.81 billion rupees for the quarter, representing a year-over-year increase from 4.7 billion rupees. The company's revenue also grew to 21.28 billion rupees compared to 18.78 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1761572257755,
            "Source": "earnings"
        },
        {
            "Title": "PNB Housing Finance Independent Director Pavan Kaushal Completes Tenure",
            "Summary": "PNB Housing Finance Limited announced that Mr. Pavan Kaushal's tenure as Independent Director concluded on October 26, 2025. The Board of Directors expressed appreciation for his outstanding service and contributions during his time as a member of the Board and Board Committees. The company disclosed this information to BSE and NSE exchanges under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761487452948,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Finance Seeks Shareholder Approval for Director Appointment via Postal Ballot",
            "Summary": "PNB Housing Finance Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. D. Surendran as Nominee Non-Executive Director. Mr. Surendran was appointed as Additional Director on August 23, 2025, and has been nominated by Punjab National Bank. The remote e-voting period runs from October 15 to November 13, 2025. He brings 35 years of banking experience, having worked with Canara Bank in various positions across multiple states. The appointment is for a term not exceeding five years and requires Reserve Bank of India permission. Results will be announced by November 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760442522313,
            "Source": "corporate_action"
        },
        {
            "Title": "PNB Housing Finance Participates in Morgan Stanley Virtual Investor Meet",
            "Summary": "PNB Housing Finance Limited participated in the Morgan Stanley India Financials Virtual Investor Group Meet on September 17, 2025. The company's senior executives including Executive Director Jatul Anand, CFO Vinay Gupta, Chief Business Officer Valli Sekar, and Head of Financial Planning & Analysis Chaitanya Yadav attended the virtual meeting held in Gurgaon. The discussions covered growth updates, short-term business strategy, asset quality, and return profile of the company. The meeting included 36 institutional investors and fund managers including Franklin Templeton, GIC, Kotak Mahindra Asset Management, SBI Pension Funds, and Premji Investments among others. The company confirmed that no unpublished price sensitive information was shared during the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1758131734797,
            "Source": "stock"
        },
        {
            "Title": "PNB Housing to Announce New CEO Within Two Weeks",
            "Summary": "PNB Housing will announce its new CEO within two weeks. The company has confirmed that its ongoing guidance remains unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1758087783060,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Receives Approval to Issue NCDs Worth Up to ₹50 Billion",
            "Summary": "PNB Housing has obtained approval to issue Non-Convertible Debentures (NCDs) with a value of up to ₹50 billion rupees. This approval enables the housing finance company to raise funds through debt instruments in the capital markets.",
            "Sentiment": "positive",
            "PublishDate": 1757082619778,
            "Source": "corporate_action"
        },
        {
            "Title": "PNB Housing Board to Consider ₹5,000 Crore NCD Fundraising",
            "Summary": "PNB Housing's board will discuss raising up to ₹5,000 crore through Non-Convertible Debentures (NCDs) on September 5. The board meeting will focus on this potential debt fundraising initiative.",
            "Sentiment": "neutral",
            "PublishDate": 1756483446407,
            "Source": "corporate_action"
        },
        {
            "Title": "PNB Housing Finance Appoints D. Surendran as Non-Executive Nominee Director",
            "Summary": "PNB Housing Finance Limited appointed D. Surendran as Additional Director (Non-Executive Nominee Director) effective August 23, 2025. The appointment was made on recommendations from the Nomination and Remuneration Committee. Surendran, nominated by Punjab National Bank, holds a five-year term and will serve until the next general meeting or three months from appointment date, whichever is earlier. He brings 35 years of banking experience, having started with Canara Bank in 1990 and progressing through various roles. He has served as Executive Director of Punjab National Bank since March 2025 and holds membership in several board committees. Surendran holds degrees in Agriculture, Masters in Science, and Postgraduate Diploma in Software Engineering, along with certification from the Indian Institute of Bankers.",
            "Sentiment": "positive",
            "PublishDate": 1755948974736,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Finance Approves INR 5 Dividend, Authorizes Rs 10,000 Crore Debt Issuance at AGM",
            "Summary": "PNB Housing Finance Limited held its 37th Annual General Meeting on August 21, 2025, where shareholders approved several key resolutions. The company declared a dividend of INR 5 per equity share of face value Rs 10 each for the financial year ended March 31, 2025, with payment scheduled for September 8, 2025. Shareholders re-appointed Mr. Dilip Kumar Jain as a non-executive nominee Director and appointed Vinod Kothari & Company as Secretarial Auditor for a five-year term from FY 2025-26 to FY 2029-30. The Board received authorization to issue Non-Convertible Debentures or bonds up to Rs 10,000 Crore on a private placement basis until the next AGM. Additionally, shareholders approved alterations to the company's Memorandum of Association to enable offering unsecured loans within the regulatory framework.",
            "Sentiment": "positive",
            "PublishDate": 1755873500920,
            "Source": "corporate_action"
        },
        {
            "Title": "PNB Housing Finance Block Trade Worth Rs. 67.27 Crores Executed on NSE",
            "Summary": "PNB Housing Finance Ltd. witnessed a block trade on the National Stock Exchange worth Rs. 67.27 crores. The transaction involved approximately 823,669 shares at a price of Rs. 816.75 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755597340141,
            "Source": "order&deals"
        },
        {
            "Title": "PNB Housing Finance MD & CEO Girish Kousgi Resigns, Company Holds Investor Call to Address Leadership Transition",
            "Summary": "PNB Housing Finance held an investor call on August 4, 2025, following the resignation of MD & CEO Girish Kousgi. Kousgi decided to step down to pursue new career opportunities and will continue working until October 28, 2025, to facilitate transition. The Board appointed Jatul Anand as Executive Director for Prime and Emerging Business to serve as interim head if needed. The company reported strong financial metrics with gross NPA at 1.06% as of June 2025, net NPA at 0.69%, capital adequacy at 28.7%, and collection efficiency above 99%. The Board emphasized that the exit is not driven by internal challenges but reflects individual career progression. The company maintains its retail-focused strategy with 99% of loan assets in retail segment and continues guidance for 18% growth. The nomination and remuneration committee has initiated a search process for a new CEO, considering both internal and external candidates. Board members assured that the company's transformation strategy remains intact and is embedded across all leadership layers.",
            "Sentiment": "neutral",
            "PublishDate": 1754733053194,
            "Source": "corporate_governance"
        },
        {
            "Title": "GIC Private Limited Reduces Stake in PNB Housing Finance to 3.23% Through Open Market Sale",
            "Summary": "GIC Private Limited, acting on behalf of the Government of Singapore and Monetary Authority of Singapore, sold 1,630,002 equity shares of PNB Housing Finance Limited through open market transactions. The sale reduced their combined holding from 3.857% to 3.231% of the total share capital. Following the transaction, the Government of Singapore holds 7,015,255 shares (2.693%) and the Monetary Authority of Singapore holds 1,400,614 shares (0.538%). The transaction was completed on August 4, 2025, with PNB Housing Finance's total equity share capital remaining at 260,452,282 shares. GIC had previously held 14,033,627 equity shares (5.388%) and has been reducing its position through multiple non-reportable tranches before this disclosure-triggering sale.",
            "Sentiment": "neutral",
            "PublishDate": 1754482784365,
            "Source": "corporate_action"
        },
        {
            "Title": "PNB Housing Finance Searches for New CEO as Girish Kousgi Steps Down",
            "Summary": "PNB Housing Finance will consider both internal and external candidates to replace managing director and CEO Girish Kousgi. Jatul Anand, recently promoted to executive director, will serve as interim head while the search continues. The company has also appointed Valli Sekar as chief business officer for affordable business. Both officials assumed their new roles from August 2. The company's share price declined 3.64% to Rs 778.65 following a previous 17% drop after Kousgi's resignation announcement.",
            "Sentiment": "negative",
            "PublishDate": 1754354765066,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Finance Enters F&O Ban Following 17% Stock Plunge After CEO Resignation",
            "Summary": "PNB Housing Finance shares entered the Futures & Options ban after experiencing their biggest single-day decline in over four-and-a-half years. The stock fell 17% following the resignation of MD & CEO Girish Kousgi, who cited personal reasons for stepping down. The F&O ban was triggered when the market-wide position limit crossed 95%, meaning no new derivative positions can be created until the stock exits the ban. Trading volumes surged dramatically with over 3.2 crore shares traded compared to the usual 20-day average of 9-10 lakh shares, with shares worth over ₹2,717 crore changing hands. Promoter Punjab National Bank confirmed the resignation was for personal reasons and stated the new MD & CEO will be an external candidate. The stock closed at ₹811.15, turning negative for the year with an 11% decline year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1754265183042,
            "Source": "stock"
        },
        {
            "Title": "PNB Housing Finance CEO Girish Kousgi Resigns, Company Announces Leadership Restructuring",
            "Summary": "PNB Housing Finance announced significant leadership changes with CEO Girish Kousgi's resignation effective October 28, 2025. Kousgi submitted his resignation on July 30, which was accepted by the board on July 31. He will also step down from boards of subsidiaries PHFL Home Loans and Services Ltd. and PEHEL Foundation. The company appointed Jatul Anand as Executive Director for Prime and Emerging Business segment covering Sales, Credit, Product, and Collections, while Valli Sekar was named Chief Business Officer for Affordable Business vertical. Punjab National Bank's MD and CEO Ashok Chandra clarified that Kousgi's departure was a personal decision, not due to internal challenges or business issues. The board recognized Kousgi's transformative leadership during a period of significant organizational change.",
            "Sentiment": "neutral",
            "PublishDate": 1754204063226,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Finance Appoints Jatul Anand as Executive Director and Valli Sekar as Chief Business Officer",
            "Summary": "PNB Housing Finance Limited announced two key leadership appointments effective August 02, 2025. Jatul Anand, previously Chief Credit & Collections Officer, has been designated as Executive Director (not a board member) and will oversee Prime and Emerging Business operations including sales, credit, product and collections. Valli Sekar has been appointed as Chief Business Officer - Affordable Business, taking charge of the company's affordable business segment. Anand brings 22 years of experience and has been with the company since 2013, holding qualifications from the Institute of Chartered Accountants of India. Sekar has 25 years of overall experience and joined PNB Housing Finance in 2022, where she was instrumental in establishing the affordable business division. Both appointments aim to strengthen the company's leadership across its business segments.",
            "Sentiment": "positive",
            "PublishDate": 1754151575534,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing Finance Schedules Investor Call Following MD & CEO Resignation",
            "Summary": "PNB Housing Finance has scheduled an investor call on August 4, 2025, at 08:00 AM IST to address the resignation of Mr. Girish Kousgi, MD and CEO. Board members and the management team will participate in the call to provide clarifications to investors regarding the resignation. The company has provided dial-in details for universal access, India toll-free numbers, and international toll-free numbers for Hong Kong, Singapore, UK, and USA. The call is being organized on shorter notice to address investor concerns about the leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1754030127285,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB MD Dismisses Concerns Over PNB Housing CEO Resignation, Cites Personal Reasons",
            "Summary": "Ashok Chandra, Managing Director and CEO of Punjab National Bank, stated that Girish Kousgi's resignation as Managing Director and CEO of PNB Housing Finance was due to personal family commitments in Bengaluru, not business-related issues or internal concerns. Punjab National Bank holds more than 28% stake in the housing finance company and has no plans to increase its stake. The PNB Housing board has engaged an external HR firm to find a replacement CEO. When questioned about multiple senior leadership departures including Chief Sales Officer Dilip Vethi Swaran and business head Anujai Saxena, Chandra maintained that Kousgi's exit was purely personal. He assured that the company faces no significant challenges and expressed confidence in PNB Housing Finance's continued growth trajectory.",
            "Sentiment": "neutral",
            "PublishDate": 1754029429315,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNB Housing's Girish Kousgi Steps Down Due to Family Obligations",
            "Summary": "Girish Kousgi has stepped down from his position at PNB Housing, citing family obligations in Bengaluru as the reason for his departure. The company clarified that there was no pressure from promoters or shareholders regarding the resignation. PNB Housing's board scheduled an investor meeting to provide further details about the development.",
            "Sentiment": "neutral",
            "PublishDate": 1754025148925,
            "Source": "stock"
        },
        {
            "Title": "PNB Housing Finance Sees Rs 150 Crore Block Trade on NSE",
            "Summary": "PNB Housing Finance Ltd. witnessed a block trade worth Rs 150 crores on the National Stock Exchange. The transaction involved approximately 1,798,521 shares executed at a price of Rs 834 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754022070064,
            "Source": "order&deals"
        },
        {
            "Title": "PNB Housing Finance Sees Rs. 100.61 Crore Block Trade on NSE",
            "Summary": "PNB Housing Finance Ltd. witnessed a block trade worth Rs. 100.61 crores on the National Stock Exchange. The transaction involved approximately 1,200,179 shares at a price of Rs. 838.30 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754021665401,
            "Source": "order&deals"
        }
    ]
}