{
    "Symbol": "PNC",
    "ISIN": "INE392B01011",
    "News": [
        {
            "Title": "PNC Reports Q3 Loss Despite Revenue Growth",
            "Summary": "Prithish Nandy Communications posted Q3 loss of Rs 1021.81 lakh despite total income of Rs 991.12 lakh, with content write-down of Rs 1756.09 lakh as exceptional item.",
            "Sentiment": "negative",
            "PublishDate": 1770913166750,
            "Source": "co_actions_results"
        },
        {
            "Title": "British Nandy Communications Board Meet on Feb 12",
            "Summary": "British Nandy Communications Ltd has scheduled a board meeting for February 12, 2026, to review and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770029900935,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNC Signs Licensing Deal with Shemaroo Entertainment",
            "Summary": "Pritish Nandy Communications Limited announces licensing agreement with Shemaroo Entertainment Limited for satellite and digital rights of 18 film titles, demonstrating strategic content monetization efforts.",
            "Sentiment": "positive",
            "PublishDate": 1766732252138,
            "Source": "co_actions_results"
        },
        {
            "Title": "PNC Wins ₹2.47 Cr Court Order Against Saboo Films",
            "Summary": "Pritish Nandy Communications secures favorable court ruling in 20-year commercial recovery suit, awarded ₹1.50 cr principal plus ₹97.30 lakh interest from Saboo Films.",
            "Sentiment": "positive",
            "PublishDate": 1766570490375,
            "Source": "stocks"
        },
        {
            "Title": "Pritish Nandy Communications Announces Final Season of Four More Shots Please on Prime Video",
            "Summary": "Pritish Nandy Communications announced that Prime Video will premiere the fourth and final season of its International Emmy-nominated series Four More Shots Please on December 19, concluding a decade-long journey. The series will premiere exclusively on Prime Video in India and more than 240 countries and territories worldwide, featuring returning cast members Sayani Gupta, Kirti Kulhari, Bani J, and Maanvi Gagroo along with new additions to the cast.",
            "Sentiment": "positive",
            "PublishDate": 1764925806508,
            "Source": "stock"
        },
        {
            "Title": "Pritish Nandy Communications Reports Q2 Loss of Rs 89.98 Lakh Despite Half-Year Revenue Growth",
            "Summary": "Pritish Nandy Communications posted a loss before tax of Rs 89.98 lakh in Q2 with total income of Rs 451.82 lakh, while half-year revenue grew to Rs 2585.20 lakh from Rs 2302.63 lakh in the previous year. The company has upcoming content releases including Season 4 of Four More Shots Please on Amazon Prime Video in January 2026 and is developing Season 2 of Netflix's The Royals.",
            "Sentiment": "negative",
            "PublishDate": 1763146782276,
            "Source": "earnings"
        },
        {
            "Title": "Pritish Nandy Communications Approves Quarterly Results and Appoints New Company Secretary",
            "Summary": "Pritish Nandy Communications' Board approved unaudited standalone and consolidated financial results for the quarter and nine months ended December 31, 2024. The company appointed Ms. Priyanka Shah as Company Secretary & Compliance Officer and Key Managerial Personnel effective February 7, 2025. The company operates in two segments: content segment generating revenue of Rs 302.93 crore and wellness segment with Rs 373.49 crore for the latest quarter. The company received an arbitration award of Rs 3.52 crore plus Rs 35 lakh interest against White Feather Films, with the Bombay High Court restraining the proprietor from disposing properties valued at Rs 12 crore. The company has initiated recovery proceedings for Rs 1.5 crore from Saboo Films and Bharat Film Works, with management considering both amounts fully recoverable.",
            "Sentiment": "neutral",
            "PublishDate": 1757137343144,
            "Source": "earnings"
        },
        {
            "Title": "PNC Reports 11.27% Revenue Growth in Q1 with Doubled Profit",
            "Summary": "Pritish Nandy Communications (PNC) reported Q1 revenue of Rs 2133.38 lakh, representing 11.27% year-over-year growth from Rs 1917.14 lakh. The company's profit after tax increased to Rs 62.30 lakh compared to Rs 36.04 lakh in the same quarter last year. PNC has completed principal photography for Season 4 of its Emmy-nominated series 'Four More Shots Please!' for Amazon Prime Video India, scheduled for release during the current financial year. Season 1 of the company's Netflix original series 'The Royals' premiered globally on May 9, 2025, with Netflix announcing a second season. Production for Season 2 of 'The Royals' is expected to commence during the current year. The company has additional series and films in development for streaming platforms, with one or more projects likely to enter production later this financial year.",
            "Sentiment": "positive",
            "PublishDate": 1754570840763,
            "Source": "earnings"
        },
        {
            "Title": "Pritish Nandy Communications Reports Q1 Profit Turnaround with 62.30 Crore Net Income",
            "Summary": "Pritish Nandy Communications Ltd reported a net profit of ₹62.30 crore for Q1 FY2025-26, marking a significant turnaround from a loss of ₹41.34 crore in the previous quarter. Revenue from operations increased to ₹2,119.42 crore compared to ₹778.94 crore in the prior quarter. The company's Board approved the quarterly results and re-appointed Mrs Rina Pritish Nandy as Director. The company appointed Mr V N Deodhar as Secretarial Auditor for five years and finalized the 32nd Annual General Meeting notice. The company has ongoing legal proceedings for recovery of ₹3.18 crore from White Feather Films through arbitration, with Bombay High Court restraining the proprietor from disposing properties valued at ₹12 crore. Additionally, recovery proceedings for ₹1.5 crore from Saboo Films Pvt Ltd and Bharat Film Works are ongoing before City Civil Court. Earnings per share improved to ₹0.43 from negative ₹0.29 in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754568997852,
            "Source": "earnings"
        }
    ]
}