{
    "Symbol": "PNCINFRA",
    "ISIN": "INE195J01029",
    "News": [
        {
            "Title": "PNC Infratech Gets Completion Certificate for Expressway",
            "Summary": "PNC Infratech's subsidiary Awadh Expressway Private Limited receives Provisional Completion Certificate for Rs. 1513.0 crores Kanpur Lucknow Expressway project under Bharatmala Pariyojana.",
            "Sentiment": "positive",
            "PublishDate": 1770295392762,
            "Source": "stocks"
        },
        {
            "Title": "PNC Infratech Board Meet Set for Feb 9 for Q3 Results",
            "Summary": "PNC Infratech Limited has scheduled a board meeting on February 9, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769521694708,
            "Source": "co_actions_results"
        },
        {
            "Title": "Nirmal Bang Upgrades PNC Infratech to Buy Rating",
            "Summary": "Nirmal Bang raises PNC Infratech rating to Buy with target price of ₹302, signaling positive outlook for the infrastructure company's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1767930766140,
            "Source": "stocks"
        },
        {
            "Title": "PNC Infratech Forms New Subsidiary for Renewable Energy",
            "Summary": "PNC Infratech Limited incorporated PNC REI Private Limited as a wholly owned subsidiary with ₹15.00 lakh authorized capital to operate as a Special Purpose Vehicle for renewable energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1767176174529,
            "Source": "stocks"
        },
        {
            "Title": "PNC Infratech Gets Rating Reaffirmation for Units",
            "Summary": "PNC Infratech announces CARE Ratings reaffirmation of credit ratings for two subsidiary companies' long-term bank facilities totaling over ₹1,035 crores with stable outlook.",
            "Sentiment": "positive",
            "PublishDate": 1765890483971,
            "Source": "stocks"
        },
        {
            "Title": "PNC Infratech Reports 26% Revenue Decline in H1 FY26, Cuts Growth Guidance to 5%",
            "Summary": "PNC Infratech's standalone revenue dropped to Rs 2,119 crore in H1 FY26 from previous year, with the company revising its annual growth guidance from 15-20% to 5% due to delayed appointed dates for 4 major HAM projects worth Rs 4,000 crore and subdued NHAI awarding activity. The infrastructure company maintains an unexecuted order book of over Rs 20,000 crore and expects Rs 6,000 crore in new orders by end of FY26, with appointed dates now received for 3 out of 4 delayed HAM projects.",
            "Sentiment": "negative",
            "PublishDate": 1763535601649,
            "Source": "earnings"
        },
        {
            "Title": "PNC Infratech Reports Q2 FY26 Financial Results with Asset Divestment Progress",
            "Summary": "PNC Infratech Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company's Board of Directors approved the unaudited standalone and consolidated financial results. On the operational front, PNC Infratech, along with its subsidiary PNC Infra Holdings Limited, completed the sale of its equity stake in PNC Bareilly Nainital Highways Private Limited to Vertis Infrastructure Trust on July 31, 2025. This follows the first tranche completed on May 22, 2025, involving the sale of equity stakes in 10 National Highway HAM assets. With these transactions, a total of 11 assets have been successfully transferred to VIT. The company expects to divest its 12th and final asset, PNC Challakere (Karnataka) Highways Private Limited, in H2 FY26 upon fulfillment of remaining conditions. The financial results include three joint operations and multiple subsidiary companies in the infrastructure development sector.",
            "Sentiment": "neutral",
            "PublishDate": 1762965263219,
            "Source": "earnings"
        },
        {
            "Title": "PNC Infratech Q2 Net Profit Surges 159% Despite Revenue Decline",
            "Summary": "PNC Infratech reported Q2 consolidated net profit of 2.16 billion rupees, significantly higher than 834.5 million rupees in the same period last year. However, the company's revenue declined to 11.28 billion rupees from 14.27 billion rupees year-over-year. EBITDA decreased to 2.53 billion rupees from 3.56 billion rupees, while EBITDA margin compressed to 22.44% from 24.98% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762945325338,
            "Source": "earnings"
        },
        {
            "Title": "PNC Infratech's Subsidiary Sonauli Gorakhpur Highways Gets Credit Rating Reaffirmed by Care Ratings",
            "Summary": "Care Ratings Limited has reaffirmed the credit rating for Sonauli Gorakhpur Highways Private Limited, a subsidiary of PNC Infratech Limited. The long-term bank facilities worth Rs. 757 crore have been rated CARE A: Stable. The rating action was classified as 'Reaffirmed' in the report dated October 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761848138398,
            "Source": "stock"
        },
        {
            "Title": "PNC Infratech Promotes Ashish Jain to Executive Director",
            "Summary": "PNC Infratech Limited promoted Ashish Jain from Deputy Director to Executive Director, categorizing him as Senior Management Personnel effective October 25, 2025. The promotion was approved by the Board of Directors through Circular Resolution based on the Nomination and Remuneration Committee's recommendation. Jain, aged 56 years, holds a bachelor's degree in mechanical engineering from Nagpur University and joined the company on October 1, 2007. His responsibilities include overseeing project development, deployment of machines and machine management. Prior to joining PNC Infratech, he pursued consultancy practice.",
            "Sentiment": "positive",
            "PublishDate": 1761406441288,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNC Infratech Secures ₹297.01 Crore Airport Project from Airports Authority of India",
            "Summary": "PNC Infratech has received approval from the Airports Authority of India for the Lal Bahadur Shastri International Airport project valued at ₹297.01 crores. The project is scheduled to be completed within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1760605719490,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Incorporates Wholly Owned Subsidiary for Renewable Energy Projects",
            "Summary": "PNC Infratech Limited has incorporated a wholly owned subsidiary named PNC Renewable Energy Private Limited on October 13, 2025. The new subsidiary has an authorized capital of Rs. 1 crore consisting of 10 lakh equity shares of Rs. 10 each, with the same amount as subscribed and paid-up capital. PNC Infratech acquired 100% shareholding at Rs. 10 per share through cash consideration. The subsidiary will focus on renewable energy sector projects and related activities. The newly incorporated entity is yet to commence business operations and currently has no turnover. As a wholly owned subsidiary, it qualifies as a related party, with any future transactions to be conducted at arm's length.",
            "Sentiment": "positive",
            "PublishDate": 1760364114450,
            "Source": "corporate_action"
        },
        {
            "Title": "PNC Infratech Secures ₹495.54 Crore Bridge Project in Bihar",
            "Summary": "PNC Infratech has won a ₹495.54 crore contract from BSRDC for a high-level bridge and approach road project in Bihar. The project execution is scheduled to be completed within 3 years.",
            "Sentiment": "positive",
            "PublishDate": 1758500522427,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Secures Rs. 495.54 Crore Bridge Construction Contract in Bihar",
            "Summary": "PNC Infratech Limited received a Letter of Acceptance from Bihar State Road Development Corporation for constructing a high-level bridge and approach road on Hathouri-Atrar-Bavangama-Aurai Road in Bihar. The project is valued at Rs. 495.54 crores and spans 21.30 km, to be executed under EPC mode over 1095 days (3 years). The company has no related party interest in the awarding entity.",
            "Sentiment": "positive",
            "PublishDate": 1758287812072,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Subsidiary Completes Highway Project Ahead of Schedule in Uttar Pradesh",
            "Summary": "PNC Infratech Limited announced that its subsidiary, Yamuna Highways Private Limited, received a Provisional Completion Certificate for a four-laning highway project in Uttar Pradesh. The project involves four-laning of NH 5308 from Mathura Bypass to Gaju Village, covering a design length of 32.982 km, executed under Hybrid Annuity Mode. The project achieved provisional completion on August 30, 2025, ahead of its scheduled completion date of March 19, 2025. The Provisional Completion Certificate was issued by the Independent Engineer on September 15, 2025, declaring the project fit for commercial operations. The project has a bid cost of Rs. 885.0 crores plus price index multiple amounts as per the concession agreement with National Highways Authority of India (NHAI). The appointed date for the project was March 20, 2023, with a completion period of 730 days.",
            "Sentiment": "positive",
            "PublishDate": 1758188888580,
            "Source": "stock"
        },
        {
            "Title": "SEBI Approves PNC Infratech's Acquisition Plan for Jaiprakash Associates Limited",
            "Summary": "SEBI has approved PNC Infratech's plan to acquire Jaiprakash Associates Limited. The regulatory clearance allows PNC Infratech to proceed with the acquisition of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758028034398,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Receives Appointed Date for Bharatpur Flyover Construction Project",
            "Summary": "PNC Infratech Limited announced that it has received the Appointed Date of August 25, 2025, for its EPC project involving the construction of a flyover from Heeradas Chouraha to Kumher Gate Chouraha in Bharatpur City, Rajasthan. The project is awarded by PWD-Rajasthan and has a construction period of 24 months from the Appointed Date. The communication regarding the declaration was received from the office of Superintending Engineer, PWD Circle - Bharatpur.",
            "Sentiment": "positive",
            "PublishDate": 1757668442407,
            "Source": "stock"
        },
        {
            "Title": "PNC Infratech Wins ₹495.54 Crore Bridge Construction Contract in Bihar",
            "Summary": "PNC Infratech has secured a contract to construct a high level bridge and approach road in Bihar. The project is valued at ₹495.54 crore plus GST and has a completion timeline of 1095 days.",
            "Sentiment": "positive",
            "PublishDate": 1757051078027,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Wins Rs. 297 Crore Airport Runway Development Contract in Varanasi",
            "Summary": "PNC Infratech has emerged as the L1 bidder for the Lal Bahadur Shastri International Airport runway development project in Varanasi, valued at Rs. 297.01 crore. Being the L1 bidder means the company has submitted the lowest qualifying bid for the infrastructure project.",
            "Sentiment": "positive",
            "PublishDate": 1756820916512,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Secures 300 MW Solar Power Project Contract from NHPC Limited",
            "Summary": "PNC Infratech Ltd received a Letter of Award from NHPC Limited for setting up a 300 MW solar power project with 150MW/600MWh energy storage systems. The project was secured through competitive bidding with a tariff of Rs. 3.13/kWh. The company has 24 months from the effective date of the Power Purchase Agreement to commence supply, with the operation period spanning 25 years. The project involves an Inter State Transmission System connected solar power facility.",
            "Sentiment": "positive",
            "PublishDate": 1755246095618,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Sets September 22, 2025 as Record Date for Final Dividend",
            "Summary": "PNC Infratech Limited has fixed September 22, 2025 as the record date for determining shareholder eligibility for final dividend payment for the financial year ended March 31, 2025. The dividend payment, as recommended by the Board of Directors, requires approval from shareholders at the 26th Annual General Meeting scheduled for September 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755155853414,
            "Source": "corporate_action"
        },
        {
            "Title": "PNC Infratech Reports Q1 FY26 Results and Completes Strategic Asset Divestment",
            "Summary": "PNC Infratech's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 1,136.46 crores and net profit of Rs 80.77 crores for the quarter. On a consolidated basis, revenue was Rs 1,422.80 crores with net profit of Rs 431.31 crores. The Board appointed M/s Gaurav Jain & Associates as Cost Auditors for FY 2025-26 and Mr. Deepak Gupta as scrutinizer for the upcoming 26th Annual General Meeting. Post-quarter, the company successfully completed the sale of its equity stake in PNC Bareilly Nainital Highways Private Limited to Vertis Infrastructure Trust for an Enterprise Value of Rs 716.2 crores. This marks completion of 11 out of 12 assets under the strategic divestment initiative announced in January 2024. The final asset, PNC Challakere Karnataka Highways Private Limited, is expected to be divested in H1 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755079448836,
            "Source": "earnings"
        },
        {
            "Title": "PNC Infratech Reports Decline in Q1 Financial Performance",
            "Summary": "PNC Infratech reported Q1 consolidated net profit of Rs 4.3 billion, down from Rs 5.7 billion in the same period last year. The company's EBITDA fell to Rs 3.67 billion from Rs 9.7 billion year-on-year, with EBITDA margin declining to 25.82% from 44.69%. Revenue for the quarter stood at Rs 14.2 billion compared to Rs 21.7 billion in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755078583156,
            "Source": "earnings"
        },
        {
            "Title": "PNC Infratech Completes Transfer of 11th SPV to Vertis Infrastructure Trust for Rs 716.2 Crores",
            "Summary": "PNC Infratech Limited and its subsidiary PNC Infra Holdings Limited have transferred their entire stake in PNC Bareilly Nainital Highways Private Limited to Vertis Infrastructure Trust. This marks the completion of eleven out of twelve Special Purpose Vehicles identified for transfer under a Share Purchase Agreement executed on January 15, 2024. The transaction was concluded at an Enterprise Value of Rs 716.2 crores, including Rs 153.48 crores received against equity and debentures and Rs 239.35 crores against unsecured loans. The company expects to receive additional receivables of approximately Rs 80 crores from the buyer. The transferred SPV contributed Rs 6,752.32 lakhs in revenue and had a net worth of negative Rs 3,409.47 lakhs. One remaining asset, PNC Challakere Karnataka Highways Private Limited, is expected to be transferred in H1 of FY26. The transaction was approved by shareholders through a Special Resolution in September 2024.",
            "Sentiment": "positive",
            "PublishDate": 1754044373663,
            "Source": "corporate_action"
        },
        {
            "Title": "PNC Infratech Transfers Stake in PNC Bareilly Nainital to Vertis Infrastructure Trust for ₹7.16 Billion",
            "Summary": "PNC Infratech has transferred its stake in PNC Bareilly Nainital to Vertis Infrastructure Trust for ₹7.16 billion rupees. The transaction involves the transfer of ownership in the subsidiary to the infrastructure trust.",
            "Sentiment": "neutral",
            "PublishDate": 1754043997777,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Secures Rs 3,489 Crore Mining Services Contract from South Eastern Coalfields",
            "Summary": "PNC Infratech Limited received a Letter of Acceptance from South Eastern Coalfields Limited for a mining services project valued at Rs 3,488.86 crores (inclusive of 18% GST). The company emerged as the lowest bidder for the project involving handling, transport and other mining services including hiring of heavy earth moving machinery for overburden removal and coal extraction at Gevra OCP Expansion Project in Chhattisgarh. The contract is to be executed over five years and involves loading and transportation of extracted coal to different destinations. The promoter group has no interest in the awarding entity and the contract does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1754042764476,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infra Secures 35 Billion Rupee Contract",
            "Summary": "PNC Infra has secured a contract worth 35 billion rupees. The company's market capitalization currently stands at 80 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1754042343961,
            "Source": "stock"
        },
        {
            "Title": "PNC Infratech Wins Rs 2,957 Crore Mining Contract from South Eastern Coalfields Limited",
            "Summary": "PNC Infratech Limited has emerged as the L1 (lowest) bidder for a Rs 2,956.66 crore contract from South Eastern Coalfields Limited. The contract involves handling, transport and mining services including hiring of heavy earth moving machinery for overburden removal, coal extraction by surface miner, and loading and transportation of extracted coal to different destinations at Gevra OCP Expansion Project in Chhattisgarh. The project is to be executed over a five-year period. The contract amount is exclusive of GST and financial bids were opened on July 28, 2025. The company confirmed that promoters have no interest in the awarding entity and the contract does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753707437959,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Emerges as Lowest Bidder for ₹29.57 Billion Project",
            "Summary": "PNC Infratech has been identified as the lowest bidder for a project valued at ₹29.57 billion. The company's competitive bid positions it favorably to secure this significant infrastructure contract.",
            "Sentiment": "positive",
            "PublishDate": 1753706533239,
            "Source": "stock"
        },
        {
            "Title": "PNC Infratech: Secures Major NHPC Solar Power Project as Lowest Bidder",
            "Summary": "PNC Infratech has been declared as one of the lowest bidders for NHPC's 1,200 MW solar power project with 600 MW/2400 MWh energy storage. The company secured a 300 MW solar project with 150 MW/600 MWh storage at Rs 3.13/kWh tariff. Project supply to begin within 24 months of PPA signing, with a 25-year PPA tenure. The stock rose 5% to Rs 327 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1752729157000,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Emerges as Lowest Bidder for NHPC Tender",
            "Summary": "PNC Infratech has emerged as one of the lowest bidders in a tender floated by NHPC. The order under consideration is priced at 3.13 Rupees per kilowatt-hour.",
            "Sentiment": "positive",
            "PublishDate": 1752711122000,
            "Source": "default"
        },
        {
            "Title": "PNC Infratech: Secures 300 MW Solar Project from NHPC as Lowest Bidder",
            "Summary": "PNC Infratech has been declared one of the lowest bidders for a 300 MW ISTS-connected solar power project with a 150 MW / 600 MWh energy storage system from NHPC. The project, to be executed within 24 months, has a quoted tariff of ₹3.13 per kilowatt hour and will operate for 25 years after completion.",
            "Sentiment": "positive",
            "PublishDate": 1752670661000,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Secures 300 MW Solar Project with Energy Storage",
            "Summary": "PNC Infratech has been selected as one of the lowest bidders in NHPC's tender for a 300 MW solar project that includes a 150 MW energy storage system. The project is set to operate for 25 years at a rate of 3.13 rupees per kWh.",
            "Sentiment": "positive",
            "PublishDate": 1752662961000,
            "Source": "default"
        },
        {
            "Title": "PNC Infratech Secures ₹240 Crore Flyover Project in Bharatpur",
            "Summary": "PNC Infratech has been awarded a contract worth ₹240 crore by the Public Works Department (PWD) of Rajasthan for a flyover project in Bharatpur city. The project involves the construction of a flyover, which is a significant infrastructure development for the area.",
            "Sentiment": "positive",
            "PublishDate": 1749436825000,
            "Source": "default"
        },
        {
            "Title": "PNC Infratech Ltd: Wins ₹240 Crore Flyover Project in Rajasthan",
            "Summary": "PNC Infratech Ltd received a Letter of Acceptance from PWD-Rajasthan for constructing a flyover in Bharatpur city. The EPC contract, valued at ₹239.94 crore, is to be completed within 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1749305815000,
            "Source": "order&deals"
        },
        {
            "Title": "PNC Infratech Reports Decline in Q4 Financial Performance",
            "Summary": "PNC Infratech has reported its Q4 financial results. The company's EBITDA decreased to 3.62 billion rupees from 7.36 billion rupees year-over-year. The EBITDA margin fell to 21.26% from 28.31% in the same period. Revenue declined to 17 billion rupees from 26 billion rupees year-over-year. Consolidated net profit dropped to 755 million rupees from 3.9 billion rupees compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748594622000,
            "Source": "result"
        },
        {
            "Title": "PNC Infratech Wins Arbitration Award Against NHAI",
            "Summary": "PNC Infratech has received a favorable arbitration award of Rs. 485 crore, plus 12% annual interest, against the National Highways Authority of India (NHAI) for the Agra Bypass EPC project.",
            "Sentiment": "positive",
            "PublishDate": 1747621050000,
            "Source": "default"
        },
        {
            "Title": "PNC Infratech Secures 2.40 Billion Rupee Flyover Project in Bharatpur",
            "Summary": "PNC Infratech has won an Engineering, Procurement, and Construction (EPC) project for a flyover in Bharatpur. The project has been quoted at a price of 2.40 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745367652000,
            "Source": "default"
        },
        {
            "Title": "PNC Infratech Wins 2.40B Rupee Flyover Project in Bharatpur",
            "Summary": "PNC Infratech has been awarded an Engineering, Procurement, and Construction (EPC) project for a flyover in Bharatpur. The project has a quoted price of 2.40 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745333146000,
            "Source": "default"
        },
        {
            "Title": "PNC Infratech Reports Decline in Q3 Revenue",
            "Summary": "PNC Infratech, an infrastructure construction company, has reported a significant decrease in its third-quarter revenue. The company's revenue for Q3 stood at 14.7 billion rupees, compared to 20.5 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739180735000,
            "Source": "earnings"
        },
        {
            "Title": "PNC Infratech Reports Mixed Q3 Results",
            "Summary": "PNC Infratech, an infrastructure company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 3.78 billion rupees from 4.32 billion rupees year-over-year. However, the EBITDA margin improved to 25.76% from 21.11% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739180699000,
            "Source": "earnings"
        },
        {
            "Title": "PNC Infratech Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "PNC Infratech, an infrastructure construction company, has reported a consolidated net profit of 814 million rupees for the third quarter, down from 1.85 billion rupees in the same period last year. This represents a significant year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1739180615000,
            "Source": "earnings"
        },
        {
            "Title": "PNC Infratech's Disqualification Period Reduced by Government",
            "Summary": "The government has reduced the disqualification period for PNC Infratech from one year to four months. This decision suggests a less severe penalty for the company, potentially allowing them to resume normal business operations sooner than initially expected.",
            "Sentiment": "positive",
            "PublishDate": 1738935623000,
            "Source": "corporate_governance"
        },
        {
            "Title": "PNC Infratech to Consider Q3 Results on February 10",
            "Summary": "PNC Infratech has announced that it will consider its third quarter financial results on February 10. This indicates the company is preparing to disclose its performance for the latest fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738158836000,
            "Source": "earnings"
        },
        {
            "Title": "PNC Infratech: Share Price Surges on Early Highway Project Completion",
            "Summary": "PNC Infratech's share price rose over 11% after its subsidiary completed a highway project in Uttar Pradesh two months ahead of schedule. The company is eligible for an early completion bonus of Rs 4.428 crore. The project, valued at Rs 738 crore, spans 33.018 km and is now fit for commercial operations.",
            "Sentiment": "positive",
            "PublishDate": 1733892964000,
            "Source": "corporate_action"
        },
        {
            "Title": "PNC Infra Q2 Results: Diversification Strategy Highlighted",
            "Summary": "IDBI Capital has released a review of PNC Infra's Q2 results, emphasizing the company's diversification strategy as a key factor.",
            "Sentiment": "neutral",
            "PublishDate": 1731916659000,
            "Source": "result"
        },
        {
            "Title": "PNC Infratech: Q2 Profit Plunges 44%, Revenue Down 25%",
            "Summary": "PNC Infratech reported a 43.6% YoY decline in Q2 FY25 net profit to ₹83.5 crore. Revenue fell 25.3% to ₹1,427 crore. EBITDA decreased 10.9% to ₹356.4 crore, with margin improving to 25%. Standalone Q2 figures: revenue ₹1,149 crore, EBITDA ₹134 crore, PAT ₹81 crore.",
            "Sentiment": "negative",
            "PublishDate": 1731414548000,
            "Source": "result"
        },
        {
            "Title": "PNC Infra Wins Contract Worth 380 Crore",
            "Summary": "PNC Infra has been declared the lowest bidder (L1) for a contract valued at 380 crore rupees. This indicates the company has likely secured a significant infrastructure project, pending final confirmation.",
            "Sentiment": "positive",
            "PublishDate": 1730188268000,
            "Source": "corporate_action"
        },
        {
            "Title": "PNC Infratech: Legal Challenge to One-Year Tender Ban",
            "Summary": "PNC Infratech filed three writ petitions in Delhi High Court against the Ministry of Road Transport & Highways' one-year ban on tender participation. The ban, linked to a CBI bribery investigation, affects the company and two of its SPVs. PNC seeks immediate relief and stay on the disqualification order. The news caused a 20% drop in the company's stock price.",
            "Sentiment": "negative",
            "PublishDate": 1729507153000,
            "Source": "normal_news"
        },
        {
            "Title": "PNC Infratech: Disqualified from MoRTH Bids for One Year",
            "Summary": "PNC Infratech hit 20% lower circuit after being disqualified from Ministry of Road Transport & Highways bids for one year starting Oct. 18, 2024, due to ongoing CBI bribery investigation. JM Financial downgraded the stock to 'Hold' with a target of Rs 410. The company's order inflow estimates have been reduced, impacting revenue and earnings forecasts for FY26/27.",
            "Sentiment": "negative",
            "PublishDate": 1729488025000,
            "Source": "normal_news"
        }
    ]
}