{
    "Symbol": "PNGJL",
    "ISIN": "INE953R01016",
    "News": [
        {
            "Title": "P N Gadgil Jewellers Files Q3FY26 Monitoring Report",
            "Summary": "P N Gadgil Jewellers submitted its quarterly monitoring agency report for Q3FY26, showing complete utilization of IPO proceeds worth ₹849.43 crore with no material deviations from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1770635455956,
            "Source": "co_actions_results"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Strong Q3FY26 Results",
            "Summary": "P N Gadgil Jewellers Limited announced Q3FY26 results with revenue from operations of ₹32,533.43 million and net profit of ₹1,662.74 million for the quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770629757202,
            "Source": "co_actions_results"
        },
        {
            "Title": "Jewellery Stocks Thrive Despite Gold at ₹1.55 Lakh",
            "Summary": "Rising gold prices to ₹1,55,000 on MCX Future pressured jewellery demand, but organised players like Kalyan, Senco and P N Gadgil sustained 40-50% revenue growth through lightweight, studded jewellery and store expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769232975339,
            "Source": "stocks"
        },
        {
            "Title": "P N Gadgil Jewellers Appoints New CFO and Director",
            "Summary": "P N Gadgil Jewellers Limited announces key leadership appointments including Deepak Kumar Vijay as CFO and Aditya Saurabh Gadgil as Additional Director, strengthening management team.",
            "Sentiment": "positive",
            "PublishDate": 1769160119933,
            "Source": "stocks"
        },
        {
            "Title": "PNG Jewellers Appoints Ranbir Kapoor as Brand Ambassador",
            "Summary": "P N Gadgil Jewellers Limited announces Bollywood actor Ranbir Kapoor as new brand ambassador to strengthen national presence and amplify its 193-year legacy across Indian markets.",
            "Sentiment": "positive",
            "PublishDate": 1769073115022,
            "Source": "stocks"
        },
        {
            "Title": "P N Gadgil Targets 78-80 Stores By FY End",
            "Summary": "P N Gadgil Jewellers aims to reach 78-80 stores by fiscal year end, updating its previous expansion plan of 12-14 new store openings in Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767851626979,
            "Source": "stocks"
        },
        {
            "Title": "PN Gadgil Q3 Revenue Grows 35.6% to ₹3,302 Cr",
            "Summary": "PN Gadgil Jewellers reports 35.6% revenue growth driven by festive demand. E-commerce surges 138%, Dhanteras records highest single-day sales of ₹277 cr. Stock declines 2% post-update.",
            "Sentiment": "positive",
            "PublishDate": 1767851532702,
            "Source": "co_actions_results"
        },
        {
            "Title": "P N Gadgil Jewellers Opens 67th Store in Kharghar",
            "Summary": "P N Gadgil Jewellers Limited opened its new store at Shree Krishna Paradise, Kharghar, Navi Mumbai on January 04, 2026, expanding its retail network to 67 stores across Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1767540829757,
            "Source": "stocks"
        },
        {
            "Title": "P N Gadgil Jewellers Appoints Sara Tendulkar as Ambassador",
            "Summary": "P N Gadgil Jewellers officially announces Sara Tendulkar as brand ambassador for Litestyle by PNG, with two-year partnership starting December 2025 and campaigns launching March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766993027298,
            "Source": "stocks"
        },
        {
            "Title": "PNG Jewellers Opens 66th Store in Pune's Viman Nagar",
            "Summary": "P N Gadgil Jewellers Limited inaugurated its new store at Ideal Landmark Complex, Viman Nagar, Pune on December 21, 2025, expanding its retail network to 66 stores nationwide.",
            "Sentiment": "positive",
            "PublishDate": 1766324401839,
            "Source": "stocks"
        },
        {
            "Title": "PN Gadgil Jewellers CFO Kiran Firodiya Resigns",
            "Summary": "PN Gadgil Jewellers announces resignation of Whole-time Director and CFO Kiran Prakash Firodiya effective January 23, 2026, due to personal reasons after 6 years with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1766054814374,
            "Source": "stocks"
        },
        {
            "Title": "PNG Jewellers Reports Strong Q2 FY26 Results with 127% Jump in Net Profit",
            "Summary": "PNG Jewellers delivered exceptional quarterly results with net profit surging 127% year-over-year to INR 79.3 crores and revenue at INR 2,177.6 crores, driven by record festive sales of INR 428 crores during Navratri. The company expanded beyond Maharashtra with new stores in Madhya Pradesh and Uttar Pradesh, targeting 78-80 stores by March 2026 while maintaining strong margins despite rising gold prices.",
            "Sentiment": "positive",
            "PublishDate": 1763483677026,
            "Source": "earnings"
        },
        {
            "Title": "P. N. Gadgil Jewellers Plans Aggressive Growth Through Store Expansion and Premium Product Launch",
            "Summary": "P. N. Gadgil Jewellers is targeting aggressive growth through rapid store expansion across Western India. The company is launching new high-margin diamond and bridal collections while strengthening its omni-channel presence. The jeweller is focusing on brand premiumization and enhancing retail profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762963166283,
            "Source": "stock"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Strong Q2 Growth with Revenue Rising to 21.5B Rupees",
            "Summary": "P N Gadgil Jewellers reported Q2 revenue of 21.5 billion rupees compared to 20 billion rupees in the same period last year. The company's EBITDA increased significantly to 1.06 billion rupees from 570 million rupees year-over-year, with EBITDA margin improving to 4.95% from 2.85%. Net profit more than doubled to 797 million rupees versus 323 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762940807899,
            "Source": "earnings"
        },
        {
            "Title": "P N Gadgil Jewellers Reports ₹606 Crore Diwali Sales with 74% Growth",
            "Summary": "P N Gadgil Jewellers achieved ₹606 crore in sales during Diwali, representing a 74% year-over-year growth. The jewelry retailer's performance during the festive season demonstrates significant business expansion compared to the previous year's Diwali period.",
            "Sentiment": "positive",
            "PublishDate": 1761542952216,
            "Source": "stock"
        },
        {
            "Title": "P N Gadgil Jewellers Reports 31% Revenue Growth to ₹21,733 Million in Q2 FY26",
            "Summary": "P N Gadgil Jewellers Ltd reported a 31% year-over-year revenue increase to ₹21,733 million for Q2 FY26. The retail segment grew by 29%, while e-commerce revenue surged 113.2%. The company plans to open 13-15 new stores in H2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1759903827062,
            "Source": "earnings"
        },
        {
            "Title": "P N Gadgil Jewellers Reports ₹618 Crore Festive Sales with 65% Growth",
            "Summary": "P N Gadgil Jewellers achieved total sales of ₹618 crore during the Navratri and Dussehra festivals, representing a 65% year-over-year increase. The company's Navratri sales reached ₹428 crore, marking a 66% growth compared to the previous year. Dussehra generated ₹190 crore in single-day sales, up 64% year-over-year, which the company described as record single-day festive sales.",
            "Sentiment": "positive",
            "PublishDate": 1759483286447,
            "Source": "stock"
        },
        {
            "Title": "P N Gadgil Jewellers Opens New Store in Maharashtra, Expands to 64 Locations",
            "Summary": "P N Gadgil Jewellers Limited opened a new store in Borhadewadi, Moshi, Pimpri-Chinchwad, Maharashtra on October 1, 2025. The store opened at 12:15 PM, bringing the company's total store count to 64. The jewellery retailer notified stock exchanges BSE and NSE about this expansion as part of regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1759309368762,
            "Source": "stock"
        },
        {
            "Title": "P N Gadgil Jewellers Opens New Store in Mumbai, Expands to 63 Outlets",
            "Summary": "P N Gadgil Jewellers has opened a new store in Dadar, Mumbai, bringing the company's total number of outlets to 63. This represents the company's continued retail expansion strategy in the jewelry sector.",
            "Sentiment": "positive",
            "PublishDate": 1759232393266,
            "Source": "stock"
        },
        {
            "Title": "PNG Jewellers Opens Second Store in Uttar Pradesh with Kanpur Launch",
            "Summary": "PNG Jewellers inaugurated its new store in Kanpur on Birhana Road, marking its second location in Uttar Pradesh following a recent Lucknow launch. The large-format store offers the company's complete range of gold, diamond, silver, and platinum jewellery, including bridal collections Pratha, Golden Katha, Eiina, and Saptam. The launch includes promotional offers of 50% off on gold jewellery making charges, 100% off on diamond jewellery making charges, and 0% deduction on gold exchange. Chairman and Managing Director Dr. Saurabh Gadgil stated this expansion reinforces the company's commitment to growing beyond Maharashtra into new markets. Bollywood actor Sushmita Sen attended the inauguration. PNG Jewellers operates with a 193-year legacy and continues its expansion across Maharashtra and Uttar Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1759049327658,
            "Source": "stock"
        },
        {
            "Title": "PNG Jewellers Opens First Store in Lucknow, Expanding into Uttar Pradesh",
            "Summary": "PNG Jewellers launched its first store in Lucknow, Uttar Pradesh, located at Gomati Nagar on September 27. The Maharashtra-based jeweller with 193 years of legacy is expanding its national footprint beyond Maharashtra. The large-format store offers the company's complete range of gold, diamonds, silver, and platinum jewellery, including collections like Golden Katha, Pratha, Eiina, and Saptam. The store opening features promotional offers including 50% off on gold jewellery making charges, 100% off on diamond jewellery making charges, and 0% deduction on gold exchange. Bollywood actor Sushmita Sen inaugurated the store. Dr. Saurabh Gadgil stated that Uttar Pradesh represents an important part of the company's growth strategy and customer community expansion. This launch is part of PNG Jewellers' Navratri expansion across Maharashtra and Uttar Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1758963756085,
            "Source": "stock"
        },
        {
            "Title": "PNG Jewellers Launches LiteStyle Brand in Solapur Store",
            "Summary": "PNG Jewellers expanded its LiteStyle lightweight fine jewellery sub-brand by launching a new shop-in-shop counter at their Solapur store. LiteStyle targets young, style-conscious women with a curated range of gold and diamond jewellery designed for daily wear, balancing affordability and elegance. The brand focuses on minimalist, pocket-friendly designs suitable for everyday use beyond traditional occasions. Actress Meera Jagannath attended the inauguration, describing LiteStyle as jewellery for independent and confident women. To mark the launch, PNG Jewellers is offering up to 50% off on LiteStyle jewellery making charges.",
            "Sentiment": "positive",
            "PublishDate": 1758781914994,
            "Source": "stock"
        },
        {
            "Title": "PNG Jewellers Opens New Store in Kolhapur with Navratri Celebration",
            "Summary": "PNG Jewellers opened a new store in Kolhapur, marking the expansion with a grand Navratri celebration that emphasized cultural connection and business growth.",
            "Sentiment": "positive",
            "PublishDate": 1758692666109,
            "Source": "stock"
        },
        {
            "Title": "PNG Jewellers Plans Major Festive Expansion with 10 New Outlets During Navratri 2025",
            "Summary": "PNG Jewellers announced plans to open 6 new standalone stores and 4 LiteStyle shop-in-shop counters during Navratri 2025. The 193-year-old jewellery brand will launch outlets across Mumbai, Pune, Kolhapur, Lucknow, Kanpur, and Nagpur between September 22 and October 1, 2025. To commemorate the expansion, the company is offering up to 50% off on gold jewellery making charges and up to 100% off on diamond jewellery making charges at new PNG showrooms, with up to 50% off on LiteStyle jewellery making charges at shop-in-shop locations. Chairman and Managing Director Dr. Saurabh Gadgil described this as a landmark achievement reflecting the company's commitment to expanding accessibility while maintaining values of purity, craftsmanship, and innovation.",
            "Sentiment": "positive",
            "PublishDate": 1758511081559,
            "Source": "stock"
        },
        {
            "Title": "PN Gadgil Jewellers Sees ₹5,441 Crore Worth of Shares Become Tradeable as Lock-in Period Expires",
            "Summary": "PN Gadgil Jewellers' one-year shareholder lock-in period ended on September 18, making 85.7 million shares (63% of outstanding equity) worth ₹5,441 crore eligible for trading. The company's promoters hold 83.11% stake, exceeding the 75% Minimum Public Shareholding threshold. With a market capitalization of ₹8,630 crore, the company has three years to achieve 25% public shareholding. Mutual funds hold 4.27% stake while 1.9 lakh small retail shareholders own 9.5%. The stock trades 31% above its IPO price of ₹480 per share from its market debut last year.",
            "Sentiment": "neutral",
            "PublishDate": 1758159027589,
            "Source": "stock"
        },
        {
            "Title": "P N Gadgil Jewellers Opens New Store in Indore, Expands Network to 58 Outlets",
            "Summary": "P N Gadgil Jewellers Limited opened a new store on August 23, 2025, at Satguru Elite, M.G. Road, Indore, Madhya Pradesh. The store opening took place at 6:30 PM, bringing the company's total store count to 58. The jewellery retailer informed stock exchanges BSE and NSE about this expansion as part of regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1755957864956,
            "Source": "stock"
        },
        {
            "Title": "P N Gadgil Jewellers Reports 97% Jump in Q1 FY26 Profit Despite Gold Price Surge",
            "Summary": "P N Gadgil Jewellers delivered strong quarterly results with consolidated revenue growing 3% year-over-year to Rs 1,715 crores. The company achieved significant margin expansion with gross profit surging 63% and gross margin improving from 8.3% to 13.2%. EBITDA grew 85.4% to Rs 122 crores while PAT increased 97% to Rs 69.3 crores, resulting in a PAT margin of 4%. The performance came despite a 35% year-on-year surge in gold prices. Key growth drivers included a 41.6% increase in studded jewellery sales, which now represents 10% of total retail sales, and strong festive sales with record Akshaya Tritiya sales of Rs 139.5 crores. The company added two new LiteStyle stores, bringing total store count to 55. Management plans to add 20-23 stores over the next three quarters and expand beyond Maharashtra into Central and North India, starting with Indore, Kanpur and Lucknow. The retail segment contributed 70.3% of total sales with 19% year-over-year growth, while e-commerce revenue surged 126% and franchise revenue rose 109%. Customer engagement remained robust with transaction volumes up 23% and footfall increasing 25% despite higher gold prices.",
            "Sentiment": "positive",
            "PublishDate": 1755604006615,
            "Source": "earnings"
        },
        {
            "Title": "PN Gadgil Jewellers Targets Rs 9,500 Crore Revenue with 4% PAT Margin in FY26",
            "Summary": "PN Gadgil Jewellers is targeting revenue of Rs 9,000-9,500 crore in FY26, with franchisee business expected to contribute around 12% of total business and Rs 1,000 crore in revenue. The company aims to maintain a 4% PAT margin throughout the year. Chairman and Managing Director Saurabh Vidyadhar Gadgil stated the company is avoiding lab-grown diamonds due to lack of consumer demand, focusing instead on natural diamonds. High gold prices have increased customer exchanges of old gold for new jewellery, now accounting for 40-45% of transactions, which benefits the company through making charges. The company plans a Qualified Institutional Placement (QIP) to reduce promoter holdings from 86% to 75% to comply with SEBI requirements, with funds primarily supporting expansion. The company maintains 100% hedging to protect against gold price volatility and notes that higher diamond ratios help reduce cost of goods. Shares closed 1.09% lower at Rs 565.",
            "Sentiment": "positive",
            "PublishDate": 1755403511761,
            "Source": "stock"
        },
        {
            "Title": "PN Gadgil Jewellers Opens New Store in Jalgaon, Reaches 57 Total Outlets",
            "Summary": "PN Gadgil Jewellers has expanded its retail presence by opening a new store in Jalgaon, Maharashtra. This expansion brings the company's total outlet count to 57 stores.",
            "Sentiment": "positive",
            "PublishDate": 1755269502378,
            "Source": "stock"
        },
        {
            "Title": "P N Gadgil Jewellers Opens New Store in Nashik, Expands to 56 Outlets",
            "Summary": "P N Gadgil Jewellers Limited opened a new store under the Franchise Owned, Company Operated (FOCO) model at Sharanpur Road, Nashik, Maharashtra on August 12, 2025. The store opening brings the company's total store count to 56. The company notified stock exchanges BSE and NSE about this expansion as part of its disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1754998669123,
            "Source": "stock"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Strong Q1FY26 Performance with 96% PAT Growth",
            "Summary": "P N Gadgil Jewellers submitted its quarterly investor presentation showing robust financial performance. The company achieved revenue of ₹17,145.6 million with 96.3% year-on-year growth in profit after tax to ₹693.4 million. EBITDA increased 85.4% to ₹1,228.5 million with margins expanding to 7.2%. The jeweller expanded its store count to 55 locations, adding 16 new stores during the quarter. Revenue segments showed varied performance with retail growing 19.4%, e-commerce surging 125.9%, and franchisee revenue increasing 108.7%. The company launched its LiteStyle brand for lightweight jewellery targeting working professionals aged 25-35. P N Gadgil operates across Maharashtra and Goa with one international store in California, positioning itself as the second largest organized jewellery player in Maharashtra by store count.",
            "Sentiment": "positive",
            "PublishDate": 1754995634469,
            "Source": "stock"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Revenue Growth and Margin Expansion in Q1",
            "Summary": "P N Gadgil Jewellers reported Q1 revenue of 17 billion rupees compared to 16.6 billion rupees in the same period last year. The company's EBITDA increased to 1.08 billion rupees from 644 million rupees year-over-year. EBITDA margin improved to 6.33% versus 3.86% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754986734766,
            "Source": "earnings"
        },
        {
            "Title": "P N Gadgil Jewellers Reports 93% Jump in Quarterly Net Profit to 681 Million Rupees",
            "Summary": "P N Gadgil Jewellers reported a net profit of 681 million rupees in its quarterly results, compared to 353 million rupees in the same period last year, representing a 93% year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1754985831007,
            "Source": "earnings"
        },
        {
            "Title": "P N Gadgil Jewellers: Q1 Revenue Up 2.8% YoY, Retail Segment Shines",
            "Summary": "P N Gadgil Jewellers reported a 2.8% YoY increase in Q1 FY26 total revenue to Rs 1,714 crore. Retail segment grew 19.4% YoY, contributing over 70% of total revenue. Franchise operations surged 109% YoY. Company plans to open 20-25 new stores in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1751947147000,
            "Source": "result"
        },
        {
            "Title": "P N Gadgil Jewellers: Q1 Revenue Up 2.8%, Retail Segment Shines",
            "Summary": "P N Gadgil Jewellers reported Q1 FY26 revenue of ₹1,714 crore, up 2.8% YoY. Retail segment grew 19.4%, franchise operations surged 109%, and e-commerce sales doubled. The company plans to open 20-25 new stores this fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1751889453000,
            "Source": "earnings"
        },
        {
            "Title": "P N Gadgil Jewellers: Q1 Retail Revenue Surges 19%, E-commerce Soars 126%",
            "Summary": "P N Gadgil Jewellers reported a 19% YoY increase in retail business revenue for Q1 FY24. Total revenue jumped 30% to Rs 1,713.7 crore. E-commerce revenue grew 126% YoY, while franchisee operations rose 109%. Studded jewellery sales increased 42% YoY. The company plans to open 20-25 new stores this fiscal year, focusing on Madhya Pradesh and Uttar Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1751888052000,
            "Source": "earnings"
        },
        {
            "Title": "P N Gadgil Jewellers Plans Expansion and Reports Q1 Growth",
            "Summary": "P N Gadgil Jewellers aims to open 7 to 9 new stores in Q2 FY26, which would bring their total store count to 55. The company has already launched two new showrooms in Q1. Their Q1 revenue, excluding refinery operations, saw a 30.4% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1751885235000,
            "Source": "default"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Q1 Retail Growth",
            "Summary": "P N Gadgil Jewellers has reported a 19.4% growth in its retail segment for the first quarter. The company also experienced an 8% increase in same-store sales during the same period.",
            "Sentiment": "positive",
            "PublishDate": 1751885088000,
            "Source": "default"
        },
        {
            "Title": "P N Gadgil Jewellers: Board Approves ₹1,000 Crore Fundraise",
            "Summary": "P N Gadgil Jewellers' board approved raising up to ₹1,000 crore through equity instruments. The company appointed new Whole-time Directors and an Independent Director. Fundraising aims to support growth initiatives and working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1751535386000,
            "Source": "corporate_action"
        },
        {
            "Title": "P N Gadgil Jewellers Board Approves ₹1000 Crore Fundraising via NCDs",
            "Summary": "The Board of Directors of P N Gadgil Jewellers has approved raising funds up to ₹1000 Crore through the issuance of Non-Convertible Debentures (NCDs).",
            "Sentiment": "positive",
            "PublishDate": 1751532392000,
            "Source": "default"
        },
        {
            "Title": "P N Gadgil's Subsidiary Reva Diamond Files for IPO",
            "Summary": "Reva Diamond, a subsidiary of P N Gadgil, has submitted an Initial Public Offering (IPO) application. The IPO is valued at ₹4.5 billion. The funds raised from the IPO will be used to establish 15 brand-specific stores across India.",
            "Sentiment": "positive",
            "PublishDate": 1750172010000,
            "Source": "default"
        },
        {
            "Title": "PNG Jewellers Launches 'Litestyle' Brand for Lightweight Jewellery",
            "Summary": "PNG Jewellers has introduced a new brand called 'Litestyle' to enter the rapidly growing lightweight jewellery market. The company aims to expand its product offerings and capture a share in this emerging segment.",
            "Sentiment": "positive",
            "PublishDate": 1750138434000,
            "Source": "default"
        },
        {
            "Title": "PNG Jewellers: Targets 27-30% Value Growth in FY26",
            "Summary": "PNG Jewellers aims for 27-30% overall value growth in FY26, with 15-16% jewellery volume growth and 10-12% value growth. Q4 FY25 saw 13% rise in net profit to Rs 62 crore and 5% revenue increase to Rs 1,588 crore. Same-store sales grew over 26%, with bullion sales now accounting for 30% of revenue.",
            "Sentiment": "positive",
            "PublishDate": 1747540591000,
            "Source": "earnings"
        },
        {
            "Title": "PN Gadgil Jewellers: Q4 Profit Up 13%, Margin Shrinks Significantly",
            "Summary": "PN Gadgil Jewellers reported a 13% increase in Q4 FY2025 consolidated net profit to Rs 62 crore. Revenue grew 5% to Rs 1,588 crore, while EBITDA fell 76% to Rs 94 crore. Margin narrowed to 5.9% from 25.7%. The company saw a 38% increase in footfalls with a 92.3% conversion rate.",
            "Sentiment": "neutral",
            "PublishDate": 1747323345000,
            "Source": "earnings"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Q4 Financial Results",
            "Summary": "P N Gadgil Jewellers has reported its Q4 financial results. The company's EBITDA for Q4 was 938 million rupees, compared to 878 million rupees in the same quarter last year. The EBITDA margin improved to 5.96% from 5.86% year-over-year. The company's net profit for Q4 was 624 million rupees, up from 546 million rupees in the previous year, but down from 851 million rupees in the previous quarter. Q4 revenue stood at 15.7 billion rupees, an increase from 14.97 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747314840000,
            "Source": "result"
        },
        {
            "Title": "P N Gadgil Jewellers: Record-Breaking Akshaya Tritiya Sales Boost Stock",
            "Summary": "P N Gadgil Jewellers reported its highest-ever single-day festive sales of ₹139.53 crore on Akshaya Tritiya, a 35% increase from last year. Gold sales reached 122 kg, with overall revenue growth across gold, diamond, and silver segments. The company's stock rallied over 7% in response to the news.",
            "Sentiment": "positive",
            "PublishDate": 1746428667000,
            "Source": "normal_news"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Record Sales on Akshaya Tritiya",
            "Summary": "P N Gadgil Jewellers achieved its highest single-day sales of ₹139.53 crore during Akshaya Tritiya, marking a significant growth of approximately 35% compared to the previous year's revenue of ₹103.26 crore on the same occasion.",
            "Sentiment": "positive",
            "PublishDate": 1746403511000,
            "Source": "default"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Record-Breaking Akshaya Tritiya Sales",
            "Summary": "P N Gadgil Jewellers achieved its highest single-day sales of ₹139.53 crore on Akshaya Tritiya, marking a significant growth of approximately 35% compared to the previous year's revenue of ₹103.26 crore on the same occasion.",
            "Sentiment": "positive",
            "PublishDate": 1746254374000,
            "Source": "default"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Revenue Growth in Q4 and Full Year",
            "Summary": "P N Gadgil Jewellers announced a 5.1% increase in consolidated revenue for Q4 compared to the same quarter last year, contributing to a full-year growth of 25.9%. The company's retail segment, which accounts for 81.5% of total revenue, saw a significant 50% growth in Q4 FY25 compared to Q4 FY2024.",
            "Sentiment": "positive",
            "PublishDate": 1744071125000,
            "Source": "earnings"
        },
        {
            "Title": "P N Gadgil Jewellers Reports Strong Q4 and Full-Year Growth",
            "Summary": "P N Gadgil Jewellers announced a 5.1% increase in consolidated revenue for Q4 compared to the same quarter last year, contributing to a full-year growth of 25.9%. The company's retail segment, which represents 81.5% of total revenue, achieved a significant 50% growth in Q4 FY25 compared to Q4 FY2024.",
            "Sentiment": "positive",
            "PublishDate": 1744026034000,
            "Source": "earnings"
        }
    ]
}