{
    "Symbol": "POCL",
    "ISIN": "INE063E01053",
    "News": [
        {
            "Title": "POCL Q3FY26 Monitoring Report Shows Full Compliance",
            "Summary": "Pondy Oxides and Chemicals Limited submitted its Q3FY26 monitoring agency report showing complete utilization of Rs. 50.00 crore from equity shares and Rs. 69.81 crore from warrants with no deviations reported.",
            "Sentiment": "positive",
            "PublishDate": 1769615163743,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pondy Oxides Q3 Net Profit Surges 149% YoY",
            "Summary": "Pondy Oxides & Chemical reported strong Q3 performance with net profit jumping to ₹376 million from ₹151 million year-on-year, while revenue increased to ₹7.76 billion from ₹5 billion in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1769603357344,
            "Source": "co_actions_results"
        },
        {
            "Title": "POCL Board Approves Merger with Subsidiary PFTPL",
            "Summary": "Pondy Oxides & Chemicals Limited board approved scheme of amalgamation with wholly owned subsidiary POCL Future Tech Private Limited on January 28, 2026, subject to NCLT approval.",
            "Sentiment": "positive",
            "PublishDate": 1769602124138,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pondy Oxides Reports Record Quarterly Performance with 84% EBITDA Growth in Q2 FY26",
            "Summary": "Pondy Oxides and Chemicals Limited delivered its strongest quarterly and half-yearly performance in Q2 FY26. Revenue increased 11% year-on-year to INR 635 crores quarterly and 22% to INR 1,231 crores on half-yearly basis. EBITDA surged 84% year-on-year to INR 55 crores quarterly and 83% to INR 98 crores half-yearly, with margins exceeding 8%. PAT jumped 105% year-on-year to INR 36 crores quarterly and 98% to INR 63 crores half-yearly. The company achieved zero net debt with INR 71 crores net cash position. Lead production increased 8% year-on-year to 50,475 metric tons on half-yearly basis, with EBITDA per tonne rising 62% to INR 19,970. Value-added products comprised 70% of lead segment revenue. Phase-1 of lead capacity expansion operated at 50% utilization during Q2, with Phase-2 commissioning planned for second half of FY26. Exports contributed 61% of total revenue. The company targets maintaining 8% plus EBITDA margins and expects INR 35 crores CAPEX in second half for expansion projects.",
            "Sentiment": "positive",
            "PublishDate": 1761129740762,
            "Source": "earnings"
        },
        {
            "Title": "POCL Targets Double-Digit Growth Through 2030 with Expansion and Recycling Strategy",
            "Summary": "POCL projects double-digit volume and EBITDA growth through 2030. The company's growth strategy focuses on capacity expansion, value-added metal recycling, and global diversification to drive long-term sustainability.",
            "Sentiment": "positive",
            "PublishDate": 1760715263161,
            "Source": "stock"
        },
        {
            "Title": "Pondy Oxides and Chemicals Submits Monitoring Agency Reports for Preferential Issue and QIP Proceeds",
            "Summary": "Pondy Oxides and Chemicals Limited submitted monitoring agency reports for the quarter ended September 30, 2025, covering the utilization of proceeds from both their preferential issue and Qualified Institutional Placement (QIP). The reports were prepared by CARE Ratings Limited as the monitoring agency. The company communicated these submissions to NSE and BSE exchanges on October 17, 2025, and made the reports available on their website at www.pocl.com. K. Kumaravel, Director Finance & Company Secretary, signed the communications to the exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1760694584790,
            "Source": "corporate_action"
        },
        {
            "Title": "Pondy Oxides & Chemicals Reports Strong Q2 Performance with Revenue Growth and Margin Expansion",
            "Summary": "Pondy Oxides & Chemicals reported Q2 revenue of 6.35 billion rupees, up from 5.8 billion rupees year-over-year. The company's EBITDA increased significantly to 535 million rupees from 290 million rupees in the same period last year. EBITDA margin improved to 8.43% compared to 5.06% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1760687015699,
            "Source": "earnings"
        },
        {
            "Title": "Pondy Oxides & Chemicals Reports 104% Jump in Net Profit to 356M Rupees",
            "Summary": "Pondy Oxides & Chemicals reported a net profit of 356 million rupees in its quarterly results, compared to 174 million rupees in the same period last year, representing a significant year-over-year increase of 104%.",
            "Sentiment": "positive",
            "PublishDate": 1760686508392,
            "Source": "earnings"
        },
        {
            "Title": "Pondy Oxides Reports Record Q1 FY26 Performance with 36% Revenue Growth and 7% EBITDA Margins",
            "Summary": "Pondy Oxides and Chemicals Limited delivered its best-ever quarterly performance in Q1 FY26, with revenue growing 36% year-on-year to INR 596 crores. EBITDA surged 82% to INR 43 crores, achieving record margins of over 7%, while PAT increased 90% to INR 28 crores with margins of 4.6%. The strong performance was driven by increased production and sales of lead (up 17% and 9% respectively) and copper capacity utilization more than doubling. The company's new 36,000-tonne lead production facility at Thervoykandigai commenced commercial operations at 40-45% utilization, expected to reach 70% in upcoming quarters. Value-added products comprised 71% of the lead segment compared to 50% in the previous year. The company maintains guidance of 7%+ EBITDA margins for the full year and targets 120,000 tonnes of lead production capacity utilization. Phase 2 expansion of 36,000 tonnes is scheduled for the second half of FY26 with estimated capex of INR 20 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753784477009,
            "Source": "earnings"
        },
        {
            "Title": "Pondy Oxides and Chemicals Makes Investor Call Audio Recordings Available",
            "Summary": "Pondy Oxides and Chemicals Limited has made available the audio recordings of their investor call held on July 25, 2025, discussing the unaudited financial results for the quarter ended June 30, 2025. The call took place at 3:30 PM and covered both standalone and consolidated financial results. The recordings can be accessed on the company's website at www.pocl.com through a provided link. The company informed stock exchanges NSE and BSE about the availability of these recordings.",
            "Sentiment": "neutral",
            "PublishDate": 1753446809262,
            "Source": "earnings"
        },
        {
            "Title": "Pondy Oxides Targets Revenue Doubling to ₹4,000 Crores by FY30",
            "Summary": "Pondy Oxides has announced plans to double its revenue to ₹4,000 crores by FY30. The company's growth strategy includes expanding production capacity, increasing its global customer base, implementing backward integration, and diversifying into specialty chemicals and EV battery materials sectors.",
            "Sentiment": "positive",
            "PublishDate": 1753287517763,
            "Source": "stock"
        },
        {
            "Title": "Pondy Oxides Reports No Deviation in Rs 175 Crore QIP Fund Utilization",
            "Summary": "Pondy Oxides and Chemicals Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing proper utilization of proceeds from its Rs 174.99 crore Qualified Institutional Placement. The company raised funds through QIP in December 2024, issuing 20,34,883 equity shares at Rs 860 per share. CARE Ratings Limited, the monitoring agency, reported no deviation from stated objectives and confirmed all utilization aligned with the offer document. Of the total proceeds, Rs 145.66 crore has been utilized across three main purposes: Rs 81.50 crore for working capital requirements (fully utilized), Rs 20.42 crore for capital expenditure toward setting up a recycling and processing unit in Tiruvallur, Tamil Nadu, and Rs 37.71 crore for general corporate purposes (fully utilized). The remaining Rs 29.33 crore is invested in mutual funds and monitoring accounts. The working capital and general corporate purpose components were completed by March 31, 2025, while the capital expenditure project remains ongoing with a target completion by end of fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1753283032367,
            "Source": "corporate_action"
        },
        {
            "Title": "Pondy Oxides Reports Zero Deviation in Rs 132.50 Crore Preferential Issue Fund Utilization",
            "Summary": "Pondy Oxides and Chemicals Limited submitted its monitoring agency report for the quarter ended June 30, 2025, regarding the utilization of Rs 132.50 crore raised through a preferential issue. CARE Ratings Limited, serving as the monitoring agency, reported no deviation from the stated objects of the issue. The preferential issue comprised equity shares worth Rs 50 crore and warrants worth Rs 82.50 crore. Funds from equity shares have been fully utilized across three categories: Rs 20 crore for fixed assets and plant machinery, Rs 20 crore for working capital, and Rs 10 crore for general corporate purposes. For warrants, Rs 17.31 crore has been spent on fixed assets, Rs 28.84 crore on working capital, and Rs 16.28 crore on general corporate purposes, with Rs 12 crore remaining unutilized and invested in mutual funds. The company completed utilization of equity proceeds ahead of the March 31, 2026 deadline, while warrant proceeds utilization is ongoing within the specified timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1753282285718,
            "Source": "corporate_action"
        },
        {
            "Title": "Pondy Oxides and Chemicals Appoints New Secretarial Auditor, Reappoints Internal and Cost Auditors",
            "Summary": "Pondy Oxides and Chemicals Limited's Board of Directors approved three key auditor appointments during their meeting on July 23, 2025. The company appointed KSM Associates as Secretarial Auditor for a five-year term from financial year 2025-26 to 2029-30, subject to shareholder approval at the upcoming Annual General Meeting. The Board also reappointed Kalyanasundaram & Associates as Internal Auditor and Vivekanandan Unni & Associates as Cost Auditor, both for the financial year 2025-26. All appointments were made based on recommendations from the Audit Committee. KSM Associates is described as a Chennai-based company secretaries firm founded in 2006, while Kalyanasundaram & Associates is a chartered accountancy firm operating since 1988, and Vivekanandan Unni & Associates is a cost accounting firm with experience across various industries.",
            "Sentiment": "neutral",
            "PublishDate": 1753281439879,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pondy Oxides and Chemicals Reports 53% Jump in Quarterly Net Profit to Rs 2,755 Lakhs",
            "Summary": "Pondy Oxides and Chemicals Limited reported quarterly results showing net profit of Rs 2,755.39 lakhs on standalone basis and Rs 2,516.50 lakhs on consolidated basis for the quarter ended June 30, 2025. Total income reached Rs 59,794.26 lakhs (standalone) and Rs 60,422.18 lakhs (consolidated). The company's revenue from operations grew to Rs 59,617.02 lakhs standalone, up from Rs 43,677.63 lakhs in the same quarter last year. Basic earnings per share increased to Rs 9.54 from Rs 5.76 year-on-year. The Board of Directors allotted 19,62,328 equity shares upon conversion of 9,81,164 warrants during the quarter. The company operates primarily in Lead and Copper segments, with Lead segment contributing Rs 50,574.18 lakhs and Copper segment Rs 8,857.37 lakhs to consolidated revenue.",
            "Sentiment": "positive",
            "PublishDate": 1753271501786,
            "Source": "earnings"
        },
        {
            "Title": "Pondy Oxides & Chemicals Reports Q4 Results and Dividend",
            "Summary": "Pondy Oxides & Chemicals has announced its Q4 financial results and a dividend recommendation. The company's Q4 EBITDA increased to 271 million rupees from 202 million rupees year-over-year, while the EBITDA margin decreased to 5.24% from 5.66%. Net profit for Q4 rose to 180 million rupees from 123 million rupees year-over-year and 151 million rupees quarter-over-quarter. Q4 revenue grew to 5.2 billion rupees from 3.6 billion rupees year-over-year. The company has recommended a dividend of 3.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747396425000,
            "Source": "result"
        },
        {
            "Title": "Pondy Oxides Advanced Lead Smelter Plant Progress Update",
            "Summary": "Pondy Oxides' board reviewed the progress of their new advanced lead smelter plant in Thervoykandigai, Tamil Nadu. The plant will have a total capacity of 72,000 MT per annum. The first phase, with a capacity of 36,000 MT, is scheduled to begin trial production in early March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1737936728000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pondy Oxides & Chemicals Reports Q3 Revenue Growth",
            "Summary": "Pondy Oxides & Chemicals has reported a revenue of 5 billion rupees for the third quarter, compared to 4.5 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737708484000,
            "Source": "earnings"
        },
        {
            "Title": "Pondy Oxides & Chemicals Reports Q3 EBITDA and Margin",
            "Summary": "Pondy Oxides & Chemicals has reported its Q3 financial results. The company's EBITDA for the quarter was 253 million rupees, compared to 254 million rupees in the same quarter last year. The EBITDA margin for Q3 was 5.03%, down from 5.58% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737708465000,
            "Source": "earnings"
        },
        {
            "Title": "Pondy Oxides & Chemicals Reports Q3 Net Profit Increase",
            "Summary": "Pondy Oxides & Chemicals has reported a net profit of 151 million rupees for the third quarter, compared to 125 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737708394000,
            "Source": "earnings"
        },
        {
            "Title": "Pondy Oxides and Chemicals Ltd: Raises Rs 175.44 Crore Through QIP",
            "Summary": "Pondy Oxides and Chemicals Ltd. successfully raised Rs 175.44 crore through a qualified institutional placement (QIP). The company allotted 20.34 lakh shares at Rs 860 per share, a 4.75% discount to the floor price. This fundraising is part of a larger Rs 250 crore QIP initiative announced in October.",
            "Sentiment": "positive",
            "PublishDate": 1734711365000,
            "Source": "corporate_action"
        }
    ]
}