{
    "Symbol": "PODDARMENT",
    "ISIN": "INE371C01013",
    "News": [
        {
            "Title": "Poddar Pigments Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Poddar Pigments Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a net profit of Rs 8.51 lakh for the quarter, compared to Rs 3.98 lakh in the same period last year. For the half year, net profit increased to Rs 17.43 lakh from Rs 9.15 lakh in the previous year. Total comprehensive income for the quarter was Rs 1.74 lakh versus Rs 39.15 lakh last year, while half-year comprehensive income reached Rs 1,925.63 lakh. The company operates in the masterbatches business segment. The results were reviewed by the Audit Committee and approved by the Board on November 6, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762460362612,
            "Source": "earnings"
        },
        {
            "Title": "Poddar Pigments Signs Solar Power Plant Agreement for Renewable Energy Initiative",
            "Summary": "Poddar Pigments has signed an agreement with IB Vogt Solar India to install a 3.51 MWp solar power plant in Jaisalmer, Rajasthan. The solar installation will be used for captive consumption as part of the company's renewable energy and sustainability initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762259556248,
            "Source": "stock"
        },
        {
            "Title": "Poddar Pigments Limited Announces Leadership Changes in Compliance Officer Role",
            "Summary": "Poddar Pigments Limited's Board of Directors approved the resignation of Shri Dharmendra Kumar as Compliance Officer and appointed Shri Rajeev Kumar as Company Secretary and Compliance Officer, both effective September 30, 2025. Dharmendra Kumar resigned due to other commitments within the organization. Rajeev Kumar is an associate member of the Institute of Company Secretaries of India with over 11 years of experience in listed and unlisted companies. The board meeting was held on September 30, 2025, from 12:00 PM to 1:55 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1759221727559,
            "Source": "corporate_governance"
        },
        {
            "Title": "Poddar Pigments Reports 45% Drop in Net Profit as Revenue Declines 7.4% in Q1 FY2026",
            "Summary": "Poddar Pigments Limited, a masterbatch manufacturer, reported total income of Rs. 93.33 crores in Q1 FY2026, down from Rs. 100.82 crores in the same quarter last year. Net profit fell significantly to Rs. 4.17 crores from Rs. 7.61 crores year-on-year. While gross profit margin improved to 30.3% from 28.8%, EBITDA margin declined to 9.0% from 12.5%, and net profit margin dropped to 4.5% from 7.6%. Cost of materials consumed decreased by 9.5% to Rs. 63.61 crores, but employee benefit expenses rose 6.4% to Rs. 10.06 crores. The company operates solely in the masterbatches segment and reported no exceptional items during the quarter. The Board approved these results on August 11, 2025, and scheduled the 34th Annual General Meeting for September 26, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754904438447,
            "Source": "earnings"
        }
    ]
}