{
    "Symbol": "POKARNA",
    "ISIN": "INE637C01025",
    "News": [
        {
            "Title": "Pokarna Q3 Net Profit Drops 59.68% to ₹204M",
            "Summary": "Pokarna Limited reports consolidated net profit of ₹204 million in Q3, marking a significant 59.68% decline from ₹506 million in the same quarter previous year.",
            "Sentiment": "negative",
            "PublishDate": 1770201966021,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pokarna Ltd Merges With Subsidiary Pokarna Stone",
            "Summary": "Pokarna Ltd announces merger with subsidiary Pokarna Stone to improve operations and strengthen market position in the consumer durables sector.",
            "Sentiment": "positive",
            "PublishDate": 1767160945871,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pokarna Ltd Independent Director Completes Tenure",
            "Summary": "Mrs. Jayshree Rajesh Sanghani ceased as Independent Director of Pokarna Limited on December 23, 2025, after completing her 5-year consecutive term as mandated by regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766481898805,
            "Source": "stocks"
        },
        {
            "Title": "Pokarna Limited Reports Net Loss of Rs 233.91 Lakhs in Q2 FY2025",
            "Summary": "Pokarna Limited reported a net loss of Rs 233.91 lakhs for the quarter ended September 30, 2025, compared to a net loss of Rs 166.40 lakhs in the same quarter last year. Total revenue decreased to Rs 679.31 lakhs from Rs 1,288.12 lakhs year-over-year. The company's revenue from operations fell to Rs 497.16 lakhs from Rs 952.25 lakhs in the corresponding quarter. For the half-year period, the company recorded a net loss of Rs 459.67 lakhs versus Rs 534.53 lakhs in the previous year. The Board also reconstituted the Nomination and Remuneration Committee and Corporate Social Responsibility Committee. The company operates in two reportable segments: Granites and Quartz Surfaces.",
            "Sentiment": "negative",
            "PublishDate": 1762975960208,
            "Source": "earnings"
        },
        {
            "Title": "Pokarna Reports Sharp Decline in Q2 Financial Performance",
            "Summary": "Pokarna reported quarterly consolidated net profit of 93.3 million rupees, down from 449.5 million rupees in the same period last year. Revenue fell to 1.18 billion rupees from 2.51 billion rupees year-over-year. EBITDA decreased to 237.9 million rupees compared to 861 million rupees previously. The company's EBITDA margin compressed to 20.08% from 34.27% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1762947158031,
            "Source": "earnings"
        },
        {
            "Title": "Pokarna Limited Q1FY26 Earnings Call: Company Navigates US Tariff Uncertainty While Expanding Global Footprint",
            "Summary": "Pokarna Limited held its quarterly earnings conference call discussing unaudited financial results for the quarter ended June 30, 2025. Chairman Gautam Chand Jain highlighted that the business environment remains challenging due to uncertainty around US tariff announcements, which has constrained demand and disrupted the value chain. US customers are deferring large-scale home improvement projects in favor of lower-cost options. India now faces a 25% tariff in the US market, effective from shipments after August 7th, compared to the previous 10% rate. The company is focusing on diversifying its geographic presence, with encouraging demand from non-US markets including Czech Republic, Canada, France, Mexico, and Russia. Pokarna plans to open an Experience Center in Hyderabad within 6 months to strengthen brand visibility. The company expects its KREOS product line to begin contributing this fiscal year, with initial contributions from the Chromia line also anticipated. New expansion capacity is expected to add approximately Rs. 500 crore in additional turnover when fully operational, with production starting in financial year 2026-27. The company maintains it will revisit pricing structures with customers based on the tariff situation while continuing to focus on product innovation and customer retention.",
            "Sentiment": "neutral",
            "PublishDate": 1754304757903,
            "Source": "earnings"
        },
        {
            "Title": "Pokarna Focuses on Long-Term Growth Strategy Amid Global Market Challenges",
            "Summary": "Pokarna is implementing a strategic approach to navigate global market challenges by focusing on premium designs, securing raw materials, and expanding technology-driven quartz exports. The company faces demand issues and uncertainty regarding U.S. tariffs but remains committed to long-term value growth.",
            "Sentiment": "neutral",
            "PublishDate": 1753960662129,
            "Source": "stock"
        },
        {
            "Title": "Pokarna Limited Announces Rs. 0.60 Final Dividend with September 3, 2025 Record Date",
            "Summary": "Pokarna Limited has set September 3, 2025 as the record date for payment of a final dividend of Rs. 0.60 per equity share for financial year 2024-25. The dividend represents 30% on equity shares with a face value of Rs. 2 each. The dividend payment is subject to shareholder approval at the upcoming Annual General Meeting. Once approved, the dividend will be paid within statutory timelines as per the Companies Act, 2013.",
            "Sentiment": "positive",
            "PublishDate": 1753872264127,
            "Source": "corporate_action"
        },
        {
            "Title": "Pokarna Limited Reports Q1 FY26 Results, Appoints New Independent Director",
            "Summary": "Pokarna Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 487.16 lakhs compared to Rs 598.47 lakhs in the same quarter last year. The company posted a net loss of Rs 225.76 lakhs versus a loss of Rs 368.13 lakhs in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations stood at Rs 17,096.17 lakhs against Rs 19,256.21 lakhs in the year-ago quarter, while net profit was Rs 2,829.44 lakhs compared to Rs 3,309.27 lakhs in the same period last year. The company operates in two segments - Granites and Quartz Surfaces. Additionally, the Board appointed Mr. Gautam Damodar Sawang as Additional Non-Executive Independent Director for a 3-year term, subject to shareholder approval. The company also announced its 34th Annual General Meeting scheduled for September 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753871319529,
            "Source": "earnings"
        },
        {
            "Title": "Pokarna Ltd Schedules Q1 FY26 Earnings Conference Call for August 1, 2025",
            "Summary": "Pokarna Ltd, an exporter of natural granite and the country's largest exporter of premium quartz surfaces through its wholly owned subsidiary, will host a conference call for investors and analysts on August 1, 2025, at 11:00 AM IST. The call will discuss Q1 FY26 performance and future opportunities, with the company's senior management team participating. The company has provided multiple dial-in numbers for different regions including India, Singapore, Hong Kong, USA, and UK, with pre-registration available for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753428121427,
            "Source": "earnings"
        },
        {
            "Title": "Pokarna Reports Significant Increase in Q4 Net Profit and Revenue",
            "Summary": "Pokarna has reported its Q4 financial results. The consolidated net profit for the quarter was 589 million rupees, compared to 155 million rupees year-over-year and 506 million rupees quarter-over-quarter. The company's Q4 revenue stood at 2.63 billion rupees, up from 1.64 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748559772000,
            "Source": "default"
        },
        {
            "Title": "Pokarna Reports Strong Q4 Financial Results",
            "Summary": "Pokarna has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.01 billion rupees from 410 million rupees in the same quarter last year. The EBITDA margin improved to 38.49% from 25.36%. Revenue grew to 2.63 billion rupees from 1.64 billion rupees. Consolidated net profit rose to 589 million rupees, up from 155 million rupees year-over-year and 506 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748529806000,
            "Source": "result"
        },
        {
            "Title": "Pokarna Reports Q3 EBITDA and Margin Results",
            "Summary": "Pokarna, a company in the stone industry, has reported its Q3 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) at 776 million rupees, compared to 861 million rupees in the same quarter last year. Despite the year-over-year decrease in EBITDA, the company's EBITDA margin improved slightly to 34.69% from 34.26% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738228351000,
            "Source": "earnings"
        },
        {
            "Title": "Pokarna Reports Decline in Q3 Revenue",
            "Summary": "Pokarna Limited has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 2.24 billion rupees, compared to 2.51 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738228316000,
            "Source": "earnings"
        },
        {
            "Title": "Pokarna Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Pokarna Limited has announced its financial results for the third quarter, reporting a consolidated net profit of 506 million rupees. This represents an increase from the 449 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1738228266000,
            "Source": "earnings"
        },
        {
            "Title": "Pokarna Ltd: Targets 15-25% US Revenue Growth for FY25",
            "Summary": "Pokarna anticipates significant growth in the US market, aiming for a 15-25% revenue increase in the fiscal year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1734778404000,
            "Source": "normal_news"
        },
        {
            "Title": "Pokarna Reports Over 90% Revenue from US Market",
            "Summary": "According to CNBC TV18, Pokarna Limited, an Indian company, generates more than 90% of its revenue from the United States market.",
            "Sentiment": "positive",
            "PublishDate": 1734676844000,
            "Source": "earnings"
        },
        {
            "Title": "Pokarna Expects Over 30% Revenue Growth in Quartz Business for FY25",
            "Summary": "Pokarna Limited has announced that its quartz business is projected to achieve more than 30% revenue growth in the fiscal year 2025. This information was reported by CNBC TV18, indicating a positive outlook for the company's quartz segment.",
            "Sentiment": "positive",
            "PublishDate": 1734676715000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pokarna Ltd: Multibagger Stock Nears Record High with Expansion Plans",
            "Summary": "Pokarna Ltd's share price is trading close to its record high at ₹1070 levels on BSE, up 122% year-to-date. The company announced a ₹440 crore investment for capacity expansion at its Mekaguda, Telangana facility. Analysts expect up to 25% rise in share price in one year and up to 15% CAGR in the long term.",
            "Sentiment": "positive",
            "PublishDate": 1731483106000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pokarna Restarts Production Line at Unit II of PESL",
            "Summary": "<p><span class='positive'>Pokarna</span> has <span class='positive'>restarted</span> a production line at Unit II of Pokarna Engineered Stone Limited (PESL) located in Mekaguda, Telangana. This indicates a <span class='positive'>resumption</span> of <span class='neutral'>manufacturing activities</span> at the facility.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728637071000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pokarna Announces Temporary Shutdown of Production Line at Unit II",
            "Summary": "<p><span class='neutral'>Pokarna Limited</span> has announced a <span class='negative'>temporary shutdown</span> of a production line at <b>Unit II</b> of <span class='neutral'>Pokarna Engineered Stone Limited (PESL)</span>. The company expects the production line to <span class='positive'>resume operations</span> by <b>October 7, 2024</b>. Meanwhile, operations at <b>Unit I</b> of PESL <span class='positive'>continue without any impact</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728046054000,
            "Source": "corporate_action"
        }
    ]
}