{
    "Symbol": "POLICYBZR",
    "ISIN": "INE417T01026",
    "News": [
        {
            "Title": "PB Fintech Revives $1 Billion Fundraising Plans",
            "Summary": "PB Fintech is reportedly reviving its $1 billion fundraising initiative, according to Bloomberg reports, signaling the company's renewed focus on capital expansion.",
            "Sentiment": "positive",
            "PublishDate": 1770372283773,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech Block Trade Worth Rs. 121.78 Crores",
            "Summary": "PB Fintech witnessed a significant block trade on NSE involving 806,489 shares at Rs. 1510.00 per share, totaling Rs. 121.78 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1770353694837,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech Block Trade Worth Rs. 101.91 Crores",
            "Summary": "PB Fintech executed a significant NSE block trade involving 669,886 shares at Rs. 1521.30 per share, totaling Rs. 101.91 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1770350011980,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech Sees Rs 61.88 Cr NSE Block Trade",
            "Summary": "PB Fintech executed a significant block trade on NSE worth Rs 61.88 crores involving 392,488 shares at Rs 1,576.70 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770281649187,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech Block Trade Worth Rs. 55.54 Crores",
            "Summary": "PB Fintech witnessed a significant NSE block trade of Rs. 55.54 crores involving 368,905 shares at Rs. 1505.60 per share, indicating substantial institutional activity in the fintech stock.",
            "Sentiment": "neutral",
            "PublishDate": 1770093203568,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech Q3FY26 IPO proceeds monitoring report",
            "Summary": "PB Fintech submits Q3FY26 monitoring agency report showing ₹2,211.28 million unutilized IPO proceeds out of ₹36,126.85 million total, with no deviations from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1770040262212,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech Board to Meet on Feb 5 for QIP Fund Raise",
            "Summary": "PB Fintech Limited has scheduled a board meeting for February 5, 2026, to consider raising funds through Qualified Institutions Placement for pursuing inorganic growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1770034662136,
            "Source": "co_actions_results"
        },
        {
            "Title": "Arihant Capital: No Budget Updates on Commission Caps",
            "Summary": "Arihant Capital confirms no updates on commission caps in budget from PB Fintech, indicating regulatory stability for the fintech sector.",
            "Sentiment": "neutral",
            "PublishDate": 1769935180548,
            "Source": "union_budget"
        },
        {
            "Title": "PB Fintech Board Meet on Feb 2 for Q3FY26 Results",
            "Summary": "PB Fintech Limited has scheduled its Board of Directors meeting for February 02, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769526113898,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech Sees ₹20.27 Cr NSE Block Trade",
            "Summary": "PB Fintech Limited witnessed a block trade on NSE worth ₹20.27 crores involving 124,996 shares at ₹1,622.00 per share, indicating continued institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768798057107,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech NSE Block Trade Worth ₹18.95 Crores",
            "Summary": "PB Fintech executed a fresh NSE block trade involving 117,178 shares at ₹1,617.30 per share, totaling ₹18.95 crores in transaction value.",
            "Sentiment": "positive",
            "PublishDate": 1768536300672,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech launches Pensionbazaar retirement platform",
            "Summary": "PB Fintech unveils Pensionbazaar, a comprehensive retirement planning platform offering NPS, annuities, and health insurance solutions. PFRDA Chairperson S Ramann formally launched the initiative.",
            "Sentiment": "positive",
            "PublishDate": 1768308759036,
            "Source": "stocks"
        },
        {
            "Title": "PFRDA Backs Pensionbazaar Launch, Seeks Tax Reforms",
            "Summary": "PFRDA and PB Fintech collaborate to expand pension coverage beyond government employees through digital platforms and regulatory flexibility, while seeking tax-neutral treatment for annuities in upcoming Budget.",
            "Sentiment": "positive",
            "PublishDate": 1768296788059,
            "Source": "stocks"
        },
        {
            "Title": "Policybazaar launches online home loan insurance",
            "Summary": "Policybazaar introduces online home loan insurance offering up to 72% cost savings over traditional bank-bundled policies through direct-to-consumer model and GST exemption benefits.",
            "Sentiment": "positive",
            "PublishDate": 1767856699544,
            "Source": "stocks"
        },
        {
            "Title": "PB Fintech Sees ₹72.91 Cr NSE Block Trade",
            "Summary": "PB Fintech Limited witnessed a massive block trade on NSE worth ₹72.91 crores involving 412,613 shares at ₹1,767.10 per share, indicating heightened institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767673270298,
            "Source": "co_actions_results"
        },
        {
            "Title": "EV Insurance Purchases Rise 2.5x as Add-ons Go Mainstream",
            "Summary": "Policybazaar report reveals EV insurance purchases grew 2.5 times year-on-year with premiums jumping 200%, while add-on adoption reached mainstream levels with 74% choosing Roadside Assistance.",
            "Sentiment": "positive",
            "PublishDate": 1767452730668,
            "Source": "stocks"
        },
        {
            "Title": "GST Relief Drives 30% Jump in Health Insurance Coverage",
            "Summary": "Health insurance coverage in India surged 31% to ₹19 lakh average cover after GST removal, with higher-value policies and multi-year plans gaining significant traction among consumers.",
            "Sentiment": "positive",
            "PublishDate": 1767331659461,
            "Source": "stocks"
        },
        {
            "Title": "Delhi, Bengaluru Lead Health Insurance Bookings",
            "Summary": "Delhi and Bengaluru topped health insurance bookings in 2025, while Tier-3 cities accounted for 70% of total purchases. Heart conditions, cancer, and cataract were leading claim reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1767278715828,
            "Source": "stocks"
        },
        {
            "Title": "RBI Flags High-Cost Insurance Distribution Strategies",
            "Summary": "RBI's financial stability report highlights structural pressures from high-cost distribution strategies in insurance sector, with premium growth driven by acquisition costs rather than efficiency.",
            "Sentiment": "negative",
            "PublishDate": 1767258357722,
            "Source": "stocks"
        },
        {
            "Title": "PB Fintech: Young Indians Drive Home Loan Growth",
            "Summary": "PB Fintech data reveals 16% of new home loan borrowers are under 30 in 2025, up from 9% in 2022. Housing loans grew 12% YoY with average ticket size rising to ₹37 lakh. Secured credit cards surged 62% while unsecured cards fell 21%.",
            "Sentiment": "positive",
            "PublishDate": 1767071454330,
            "Source": "stocks"
        },
        {
            "Title": "Policybazaar reports surge in protection-focused insurance",
            "Summary": "Health insurance average sum insured jumped 31% to ₹19 lakh post-GST exemption, while term insurance grew 37% in 2025. Tier 3 cities now account for 70% of health insurance purchases, with digital payments dominating transactions.",
            "Sentiment": "positive",
            "PublishDate": 1766980431633,
            "Source": "stocks"
        },
        {
            "Title": "PB Fintech Sees ₹58.70 Cr NSE Block Trade at ₹1888.40",
            "Summary": "PB Fintech Limited witnessed a significant block trade on NSE involving approximately 310,840 shares worth ₹58.70 crores at ₹1888.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1766376292700,
            "Source": "co_actions_results"
        },
        {
            "Title": "Citi Upgrades PB Fintech to Buy with ₹2,225 Target",
            "Summary": "Citigroup upgrades PB Fintech to 'Buy' rating with target price of ₹2,225, showing positive outlook compared to BofA's neutral stance at ₹1,980.",
            "Sentiment": "positive",
            "PublishDate": 1766375093390,
            "Source": "stocks"
        },
        {
            "Title": "UBS Maintains 'Sell' Rating on PB Fintech at ₹1,660",
            "Summary": "UBS continues its 'Sell' recommendation on PB Fintech with a price target of ₹1,660, reflecting the brokerage's cautious stance on the fintech company's prospects.",
            "Sentiment": "negative",
            "PublishDate": 1765943273781,
            "Source": "stocks"
        },
        {
            "Title": "Citi Initiates Buy Rating on PB Fintech at ₹2,225",
            "Summary": "Citi has issued a Buy recommendation for PB Fintech with a target price of ₹2,225, indicating positive analyst sentiment for the fintech company's stock prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765943045915,
            "Source": "stocks"
        },
        {
            "Title": "PB Fintech Sees ₹19.70 Cr NSE Block Trade",
            "Summary": "PB Fintech Limited witnessed a significant block trade on NSE worth ₹19.70 crores involving 107,928 shares at ₹1,824.90 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765867927379,
            "Source": "co_actions_results"
        },
        {
            "Title": "PB Fintech Grants 18,782 Stock Options to Employee",
            "Summary": "PB Fintech's NRC approved grant of 18,782 stock options under ESOP 2021 to subsidiary employee at ₹1,597.24 exercise price with 5-year vesting schedule.",
            "Sentiment": "neutral",
            "PublishDate": 1765547485634,
            "Source": "co_actions_results"
        },
        {
            "Title": "InfoEdge Increases Stake in PB Fintech to 12.43% Through Subsidiary Merger",
            "Summary": "InfoEdge (India) Limited received 2,99,48,003 equity shares (6.47% stake) in PB Fintech through a scheme of amalgamation with subsidiary Makesense Technologies Limited, approved by the National Company Law Tribunal on December 6, 2025. The acquisition increases InfoEdge's total shareholding in PB Fintech to 12.43% including holdings through its wholly-owned subsidiaries, consolidating its investment position in the fintech company.",
            "Sentiment": "neutral",
            "PublishDate": 1765274877279,
            "Source": "corporate_action"
        },
        {
            "Title": "InfoEdge Receives 2.99 Crore PB Fintech Shares Through Subsidiary Merger",
            "Summary": "InfoEdge (India) Limited received 2,99,48,003 equity shares of PB Fintech Limited representing 6.47% stake following the merger of its subsidiary Makesense Technologies with PB Fintech. The company's total shareholding in PB Fintech, including wholly owned subsidiaries, now stands at 12.43%.",
            "Sentiment": "neutral",
            "PublishDate": 1765029774053,
            "Source": "corporate_action"
        },
        {
            "Title": "PBFintech Allots 6.82 Lakh Equity Shares Under Employee Stock Option Plan",
            "Summary": "PBFintech allotted 6,82,752 equity shares of Rs. 2 face value each to eligible employees upon exercise of vested options under ESOP 2021, increasing the company's paid-up share capital from Rs. 92.40 crore to Rs. 92.53 crore. The newly allotted shares rank equally with existing equity shares and the company is completing formalities for listing these shares on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1765013242266,
            "Source": "corporate_action"
        },
        {
            "Title": "PB Fintech Grants 35.11 Lakh Stock Options Under ESOP 2024 Scheme",
            "Summary": "PB Fintech's Nomination and Remuneration Committee approved the grant of 35,11,256 stock options convertible into equal equity shares with face value of Rs. 2 each under the ESOP 2024 scheme. The options carry an exercise price of Rs. 1,589.67 per option (10% discount to 90-day volume weighted average price) and will vest after 4 years, subject to share price reaching 150% of grant date price.",
            "Sentiment": "positive",
            "PublishDate": 1764685660415,
            "Source": "corporate_action"
        },
        {
            "Title": "PB Fintech Corrects ESOP Allotment Disclosure, Issues 6.11 Lakh Equity Shares",
            "Summary": "PB Fintech issued a corrigendum correcting an inadvertent error in its November 07, 2025 disclosure regarding the allotment of 6,11,713 equity shares under its ESOP 2021 plan to eligible employees. The allotment increased the company's paid-up share capital from Rs. 92,27,60,550 to Rs. 92,39,83,976, with the new shares ranking pari passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763733679634,
            "Source": "corporate_action"
        },
        {
            "Title": "New World Fund Reduces Stake in PB Fintech by 2.10%",
            "Summary": "New World Fund, Inc. sold 9,214,138 shares of PB Fintech Ltd through open market transactions, reducing its shareholding from 5.05% to 2.96%. The transaction was completed on November 12, 2025, representing a significant reduction in the fund's position in the financial technology company.",
            "Sentiment": "neutral",
            "PublishDate": 1763452340108,
            "Source": "corporate_action"
        },
        {
            "Title": "New World Fund Reduces PB Fintech Stake to 2.96% Through Open Market Sale",
            "Summary": "New World Fund sold 2.09% stake in PB Fintech through open market transactions on November 12, reducing its holding from 5.05% to 2.96% by offloading 92.14 lakh shares. The stake sale occurred amid PB Fintech's strong quarterly performance showing 165% jump in net profit to ₹135 crore and 38.2% revenue growth to ₹1,613 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763107465803,
            "Source": "corporate_action"
        },
        {
            "Title": "PB Fintech Sees Rs. 54.25 Crore Block Trade on NSE",
            "Summary": "PB Fintech Ltd. witnessed a block trade worth Rs. 54.25 crores on the National Stock Exchange. The transaction involved approximately 309,459 shares executed at a price of Rs. 1,753.20 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1763014264413,
            "Source": "order&deals"
        },
        {
            "Title": "Children Account for 43% of Pollution-Linked Health Insurance Claims as Treatment Costs Rise 11%",
            "Summary": "Policybazaar data reveals children under 10 represent 43% of all pollution-related health insurance claims, making them the most affected demographic. Pollution-related ailments now constitute 8% of all hospitalization claims, with costs rising 11% for respiratory treatments and 6% for cardiac complications. Post-Diwali claims increased from 6.4% in 2022 to 9% in 2025, representing a 14% relative increase. While Delhi accounts for 38% of pollution-linked claims, cities like Hyderabad (8.34%) and Bengaluru (8.23%) now report higher claim ratios than Delhi. The average claim size for pollution-related ailments stands at ₹55,000, with daily hospitalization costs averaging ₹19,000. Health impacts extend beyond respiratory issues to include cardiac conditions, hypertension, skin problems, and eye infections, with cases of asthma, COPD, arrhythmia, eczema, and conjunctivitis prominently featured in claims.",
            "Sentiment": "negative",
            "PublishDate": 1762933253280,
            "Source": "stock"
        },
        {
            "Title": "PB Fintech Shares Worth Rs. 18.76 Crores Traded in NSE Block Deal",
            "Summary": "PB Fintech Ltd. saw a block trade on the NSE involving approximately 105,114 shares at a price of Rs. 1,784.90 per share, totaling Rs. 18.76 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1762931981478,
            "Source": "order&deals"
        },
        {
            "Title": "PB Fintech Faces 18% Commission Cut from Health and General Insurers",
            "Summary": "Health and general insurers are reducing commissions paid to Policy Bazaar by 18%. This commission cut directly impacts PB Fintech, the parent company of Policy Bazaar, affecting its revenue from health insurance policy sales.",
            "Sentiment": "negative",
            "PublishDate": 1762412380401,
            "Source": "stock"
        },
        {
            "Title": "PB Fintech Reports Strong Q2 Performance with 40% Premium Growth and Improved Profitability",
            "Summary": "PB Fintech Limited reported total premium of ₹7,605 crores for Q2, up 40% year-on-year and 15% quarter-on-quarter, driven by online protection business growth of 44% and health insurance growth of 60%. Consolidated revenue grew 38% to ₹1,614 crores, with core insurance revenue up 36%. The company's consolidated profit after tax increased 165% to ₹135 crores, representing 1.77% of insurance premium. Core credit revenue declined 22% year-on-year but showed 4% quarter-on-quarter growth, indicating bottoming out. Renewal trail revenue on 12-month rolling basis reached ₹774 crores. PB Partners agent aggregator platform now has over 380,000 advisors across 19,000 PIN codes. UAE insurance premium grew 64% and remained profitable for three consecutive quarters. The company maintained its focus on growth while managing GST changes implemented in September, with management expressing confidence in constructive discussions with insurance partners regarding commission structures.",
            "Sentiment": "positive",
            "PublishDate": 1762297543536,
            "Source": "earnings"
        },
        {
            "Title": "PB Fintech Maintains FY27 Profit Target of INR 1,000 Crore, Eyes 3% Margins by 2030",
            "Summary": "PB Fintech has reaffirmed its profit goal of INR 1,000 crore by FY27, with management stating no changes to this target. The company plans new initiatives to achieve break-even by FY27 and expects profit margins of approximately 3% by 2030. PB Fintech also aims to reach INR 1 trillion in premium revenue by 2030, though this timeline may be adjusted due to potential GST changes.",
            "Sentiment": "positive",
            "PublishDate": 1761795593905,
            "Source": "stock"
        },
        {
            "Title": "PB Fintech Reports Strong Quarterly Growth with Net Profit Rising to 1.35 Billion Rupees",
            "Summary": "PB Fintech reported consolidated net profit of 1.35 billion rupees compared to 507 million rupees in the same quarter last year. The company's revenue increased to 16.13 billion rupees from 11.67 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761739571528,
            "Source": "earnings"
        },
        {
            "Title": "Policybazaar Reports 38% Surge in High-Value Health Plans Following GST Exemption",
            "Summary": "Policybazaar recorded a 38% increase in high-sum insured health policies after the removal of GST on term life and health insurance. The average health cover size rose from ₹13 lakh to ₹18 lakh, with 45% of buyers now choosing coverage between ₹15-25 lakh compared to only 18% opting for plans below ₹10 lakh. Tier-II cities showed increased adoption, with customers choosing ₹15-25 lakh coverage rising from 44.1% to 48.6%. The platform saw an 11.5% increase in high-sum purchases among customers aged 61 and above. Day-1 pre-existing disease add-ons increased by 25% and critical illness riders by 20%. Policy renewal rider attachments rose by 50%. For NRIs, the GST removal simplified the term insurance purchase process, eliminating the requirement to pay premiums through NRE accounts and submit annual international address proof documentation.",
            "Sentiment": "positive",
            "PublishDate": 1761725833442,
            "Source": "stock"
        },
        {
            "Title": "Insurance Payments Surge 35% During Festive Season as Digital Payment Methods Gain Ground",
            "Summary": "Policybazaar data reveals insurance payments increased 35% year-on-year and 14% week-on-week between September 22 and October 14, coinciding with 0% GST reform and festive spending. UPI remained the dominant payment method at 53.5% of monthly subscriptions, growing 18% post-September 22. Motor and two-wheeler insurance UPI transactions each recorded 17% growth. Credit card usage for term insurance payments rose 21%, supported by cashback offers and EMI facilities. Netbanking continued as the preferred mode for higher-value policies, with term insurance payments increasing 49% and investment-linked plans rising 37%. Monthly premium plan adoption surged, with health insurance monthly instalments growing 307%. Vehicle-related insurance led the festive growth, driven by new vehicle purchases and family protection considerations.",
            "Sentiment": "positive",
            "PublishDate": 1760613635884,
            "Source": "stock"
        },
        {
            "Title": "PB Fintech Sees Rs. 168.11 Crore Block Trade on NSE",
            "Summary": "PB Fintech Ltd. witnessed a block trade worth Rs. 168.11 crores on the National Stock Exchange. The transaction involved approximately 990,778 shares at a price of Rs. 1,696.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1760606936407,
            "Source": "order&deals"
        },
        {
            "Title": "PB Fintech Block Trade Worth Rs. 75.13 Crores Executed on NSE",
            "Summary": "PB Fintech Ltd. witnessed a block trade on the National Stock Exchange involving approximately 448,596 shares at a price of Rs. 1,674.80 per share. The total transaction value amounted to Rs. 75.13 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1760521528930,
            "Source": "order&deals"
        },
        {
            "Title": "Policybazaar Reports Record Insurance Demand Following GST Exemption on Protection Policies",
            "Summary": "Policybazaar experienced a significant surge in insurance purchases after the government eliminated GST on pure protection policies. The GST Council reduced tax rates on term insurance and standard health insurance plans from 18% to 0%, while investment-linked products like ULIPs and endowment policies remain taxed at existing rates. Following the zero-GST implementation, term insurance demand increased 2.5 times compared to pre-announcement levels, while health insurance saw a 2.2x rise. The trend later stabilized at 1.8x for term insurance and 1.7x for health insurance. The GST removal reduces effective premium costs for policyholders and is expected to improve affordability, particularly benefiting first-time buyers. The purchase increase also coincided with the Navratri festive period, which typically sees heightened financial planning activity.",
            "Sentiment": "positive",
            "PublishDate": 1760433173997,
            "Source": "stock"
        },
        {
            "Title": "PB Fintech Indicates Potential Business Shift Due to Commission Structure Changes",
            "Summary": "PB Fintech stated that business could shift to companies offering higher commissions. The company indicated that insurers and Policybazaar may renegotiate commission reductions. Insurance companies are considering fully or partially reversing commission cuts for Policy Bazaar.",
            "Sentiment": "neutral",
            "PublishDate": 1759988524775,
            "Source": "stock"
        },
        {
            "Title": "PB Fintech Reduces Commissions by 18%, Falls Short of 6% Estimate",
            "Summary": "PB Fintech has reduced its commissions by 18%, which is below the estimated 6% reduction that was anticipated.",
            "Sentiment": "negative",
            "PublishDate": 1759311803132,
            "Source": "stock"
        },
        {
            "Title": "PB Fintech Reports Record Health Insurance Renewal Levels",
            "Summary": "PB Fintech has achieved record levels in health insurance renewals. The company attributes this growth to increasing popularity of modular and high-cover insurance plans among customers.",
            "Sentiment": "positive",
            "PublishDate": 1759148131365,
            "Source": "stock"
        },
        {
            "Title": "PB Fintech May Reduce Agent and Bank Commissions by 5-8%",
            "Summary": "PB Fintech is considering reducing commissions paid to agents, aggregators, and banks by 5-8%. This potential commission cut would affect the company's distribution partners across these channels.",
            "Sentiment": "negative",
            "PublishDate": 1758791260868,
            "Source": "stock"
        }
    ]
}