{
    "Symbol": "POLYMED",
    "ISIN": "INE205C01021",
    "News": [
        {
            "Title": "Poly Medicure Q3FY26 Earnings Call on Feb 6, 2026",
            "Summary": "Poly Medicure Limited announces earnings call on February 6, 2026 at 4:00 PM IST to discuss Q3FY26 and nine months financial results ended December 31, 2025 under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769882223057,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poly Medicure Sees ₹157.18 Cr NSE Block Trade",
            "Summary": "Poly Medicure witnessed a significant NSE block trade worth ₹157.18 crores involving 953,661 shares at ₹1,648.20 per share, indicating substantial institutional activity in the healthcare company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1768551288328,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poly Medicure clarifies volume movement",
            "Summary": "Poly Medicure Limited responds to BSE inquiry about significant trading volume increase, stating no material information pending disclosure and attributing movement to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1767780578251,
            "Source": "stocks"
        },
        {
            "Title": "PolyMedicure Reports 5.7% Revenue Growth, Completes Two Strategic Acquisitions Worth Rs 280 Crores",
            "Summary": "PolyMedicure achieved consolidated revenue of Rs 444 crores in Q2 FY26 with 5.7% year-on-year growth, while completing acquisitions of Italy-based Citieffe Group and Netherlands-based Pendra Care Group. The company guided for H2 revenue of Rs 1,080-1,090 crores (25% increase over H1) and maintained operating EBITDA margin guidance of 25-27%, despite facing headwinds in European markets and US tariff challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1763099037387,
            "Source": "earnings"
        },
        {
            "Title": "PolyMedicure Limited Completes Major Acquisition Using QIP Proceeds",
            "Summary": "PolyMedicure Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing utilization of proceeds from its Qualified Institutional Placement (QIP) issue. The company raised Rs 99,999.98 lakh through the QIP conducted from August 19-22, 2024, with net proceeds of Rs 98,534.37 lakh. During the reported quarter, the company completed a significant acquisition through its step-down subsidiary RisoR Holdings B.V., acquiring the entire share capital of Pendra Care Group (comprising Pendracare Holdings B.V. and Welling Medical B.V.) for approximately Rs 15,163.32 lakh. Of this acquisition cost, Rs 15,093.34 lakh was funded from QIP proceeds. The QIP proceeds are allocated across three objectives: Rs 49,973.16 lakh for setting up manufacturing facilities, Rs 25,026.84 lakh for pursuing inorganic initiatives, and Rs 23,534.37 lakh for general corporate purposes. CRISIL Ratings Limited, the monitoring agency, reported no deviations from the stated objectives and confirmed all utilization was as per the placement document.",
            "Sentiment": "positive",
            "PublishDate": 1762949488343,
            "Source": "corporate_action"
        },
        {
            "Title": "Poly Medicure Reduces FY26 Revenue Growth Target to 15-16%",
            "Summary": "Poly Medicure has lowered its revenue growth forecast for FY26 to 15-16%, down from its previous target of 20%. The company has revised its growth expectations downward by approximately 4-5 percentage points.",
            "Sentiment": "negative",
            "PublishDate": 1762832724944,
            "Source": "stock"
        },
        {
            "Title": "Poly Medicure Reports 5% Growth in Q2 Net Profit to 918.3 Million Rupees",
            "Summary": "Poly Medicure reported Q2 consolidated net profit of 918.3 million rupees compared to 874.5 million rupees in the same period last year. Revenue increased to 4.44 billion rupees from 4.2 billion rupees year-over-year. EBITDA remained flat at 1.15 billion rupees, while EBITDA margin declined to 25.84% from 27.42% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762596194179,
            "Source": "earnings"
        },
        {
            "Title": "Poly Medicure Acquires Full Ownership of Medistream SA, Gains Complete Control of Citieffe Group",
            "Summary": "Poly Medicure has acquired full ownership of Medistream SA in Switzerland. Through this acquisition, the company now holds 100% ownership of Citieffe Group and its subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1762445571092,
            "Source": "order&deals"
        },
        {
            "Title": "PolyMedicure Schedules Earnings Call for Q2 FY26 Results",
            "Summary": "PolyMedicure Limited has announced an earnings call scheduled for November 10, 2025, at 5:30 p.m. IST to discuss the company's unaudited financial results for the quarter and half-year ended September 30, 2025. The call will be coordinated by ICICI Securities Limited along with company officials. Key company representatives participating include Managing Director Himanshu Baid, Chief Financial Officer Naresh Vijayvergiya, and President Strategy and Corporate Development Rahul Gautam.",
            "Sentiment": "neutral",
            "PublishDate": 1762367045012,
            "Source": "earnings"
        },
        {
            "Title": "Poly Medicure Acquires Italian Orthopedic Company Citieffe Group for EUR 31 Million",
            "Summary": "Poly Medicure Limited acquired 100% of Citieffe Group, an Italian trauma and extremity orthopedic products manufacturer, for EUR 31 million enterprise value. The acquisition includes EUR 18.8 million equity valuation, EUR 4.2 million shareholder loan repayment, and EUR 8 million debt assumption. Citieffe, established in 1962 and based in Bologna, Italy, generated EUR 17.3 million revenue in 2024 with 15% growth and EUR 3.1 million EBITDA. The company operates at 60% capacity utilization with gross margins exceeding 90%. Citieffe has direct sales presence in Italy, US, and Mexico, holding 12% market share in Italy and Mexico. The acquisition provides Poly Medicure entry into the orthopedic space, specifically the $12 billion trauma and extremity segment growing at 6-7% annually. Key synergies include adding plates to Citieffe's product portfolio, US market expansion, potential manufacturing outsourcing to India, and leveraging Poly Medicure's distribution network. The existing management team, led by CEO Pascal Govi, will continue operations with performance-linked incentives over five years.",
            "Sentiment": "positive",
            "PublishDate": 1759316816657,
            "Source": "order&deals"
        },
        {
            "Title": "Poly Medicure Schedules Investor Call for September 25, 2025 on Citieffe Group Acquisition",
            "Summary": "Poly Medicure Limited has announced an investor and analyst conference call scheduled for September 25, 2025 at 4:00 PM India time to discuss the proposed acquisition of Citieffe Group. The call will be represented by Managing Director Himanshu Baid and President of Strategy & Corporate Development Rahul Gautam. The company has provided dial-in details and registration links for participants to join the discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1758713304434,
            "Source": "order&deals"
        },
        {
            "Title": "Poly Medicure Acquires Italy's Citieffe Group for EUR 23 Million to Enter Global Orthopaedic Market",
            "Summary": "Poly Medicure Limited has acquired 100% of Citieffe Group, a vertically integrated trauma and extremity fixation systems company founded in 1962. The acquisition involves an equity valuation of EUR 18.8 million, with total upfront payout of EUR 23 million and enterprise value of EUR 31 million. Citieffe reported revenue of EUR 17.3 million and EBITDA of EUR 3.1 million for CY24, representing 15% and 14% year-on-year growth respectively. The company operates manufacturing facilities in Bologna, Italy, and has direct sales presence in Italy, USA, and Mexico, generating 85% of revenue from these markets. Citieffe holds 45 patents and maintains a 12% market share as the #2 independent player in Italy's trauma market. The transaction will be funded through cash balances and internal accruals, with closure expected within 4-8 weeks. Existing management, including CEO Pascal Govi, will continue post-acquisition. The deal provides Poly Medicure entry into the global orthopaedic market, particularly the trauma and extremities segment valued at USD 12 billion globally.",
            "Sentiment": "positive",
            "PublishDate": 1758705756188,
            "Source": "order&deals"
        },
        {
            "Title": "Poly Medicure Approves Acquisition of Medistream SA and Full Ownership of Citieffe Group",
            "Summary": "Poly Medicure has approved the purchase of Medistream SA and its subsidiaries through Poly Medicure B.V. The company will acquire full ownership of Citieffe Group through this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758703228113,
            "Source": "order&deals"
        },
        {
            "Title": "Poly Medicure Completes Acquisition of PendraCare Group, Secures 90% Economic Rights",
            "Summary": "Poly Medicure Limited has completed the acquisition of PendraCare Group through its wholly-owned step-down subsidiary RisoR Holdings B.V. The company now owns 90% of economic rights in PendraCare Group, with Wellinq Medical B.V. and PendraCare Holding B.V. becoming step-down subsidiaries of Poly Medicure Limited. The Share Purchase Agreement was signed on September 23rd, 2025, and all conditions have been fulfilled, officially closing the acquisition. The transaction was executed between RisoR Holdings B.V. and Wellinq Holdings B.V., both based in Amsterdam, Netherlands.",
            "Sentiment": "positive",
            "PublishDate": 1758641261143,
            "Source": "order&deals"
        },
        {
            "Title": "Poly Medicure Acquires 90% Stake in PendraCare to Cut Cardiology Catheter Costs by 25-30%",
            "Summary": "Medical device manufacturer Poly Medicure announced the acquisition of a 90% stake in Netherlands-based PendraCare Group for Rs 188.5 crore enterprise value, with the remaining 10% to be acquired in 2030. Managing Director Himanshu Baid stated the acquisition will reduce critical cardiology catheter costs in India by 25-30% through local manufacturing, as currently most devices are imported. The deal provides immediate access to US and European markets, leveraging PendraCare's manufacturing setup in Europe and regulatory approvals. Products include angiographic, guiding and diagnostic catheters used for angiography and angioplasty procedures. With approximately 20 lakh angiographies performed annually in India, Poly Medicure expects €3-4 million synergy between companies over two to three years and margins improving to over 25%. The company projects domestic business growth exceeding 30%, though faces challenges from GST rationalization effective September 22. Poly Medicure shares closed 1.47% higher at Rs 2,025.",
            "Sentiment": "positive",
            "PublishDate": 1757759498630,
            "Source": "order&deals"
        },
        {
            "Title": "Poly Medicure Ltd. Executes Rs. 23.27 Crore Block Trade on NSE",
            "Summary": "Poly Medicure Ltd. completed a block trade on the National Stock Exchange worth Rs. 23.27 crores. The transaction involved approximately 116,048 shares at a price of Rs. 2,004.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757477363627,
            "Source": "order&deals"
        },
        {
            "Title": "Poly Medicure Acquires 90% Stake in Netherlands-Based PendraCare Group for EUR 14.2 Million",
            "Summary": "Poly Medicure Limited acquired 90% of PendraCare Group, a Netherlands-based interventional cardiology company, for EUR 11 million equity consideration plus EUR 3.2 million inter-group loan liabilities. The acquisition includes taking over EUR 2.9 million net debt, valuing the deal at 1.8x EV/revenue and 13x EV/EBITDA. PendraCare generated EUR 9.9 million revenue and EUR 1.4 million EBITDA in calendar year 2024, with 74% gross margins. The company operates FDA-approved facilities in Netherlands with capacity for 1.5 million units annually, currently producing 700,000-800,000 units. PendraCare specializes in guiding and diagnostic catheters for interventional cardiology, serving 35+ countries through 50+ distributor relationships. Poly Medicure expects EUR 3-4 million incremental EBITDA synergies over 3-4 years and projects PendraCare could reach EUR 25 million revenue by 2030. The remaining 10% stake held by CEO Sander Hartman will be acquired in 2030 based on 2029 EBITDA performance. The acquisition supports Poly Medicure's global cardiology expansion strategy and provides European manufacturing footprint with regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1757416251950,
            "Source": "order&deals"
        },
        {
            "Title": "Poly Medicure Sets September 18, 2025 as Record Date for ₹3.50 Final Dividend",
            "Summary": "Poly Medicure Limited has announced September 18, 2025 as the record date for a final dividend of ₹3.50 per equity share for FY 2024-25. The company's share transfer books will remain closed from September 19 to September 25, 2025. The dividend is subject to shareholder approval at the Annual General Meeting scheduled for September 25, 2025. The dividend applies to equity shares with a face value of ₹5 each.",
            "Sentiment": "positive",
            "PublishDate": 1757054208003,
            "Source": "corporate_action"
        },
        {
            "Title": "Poly Medicure Makes Audio Recording of PendraCare Group Acquisition Conference Call Available",
            "Summary": "Poly Medicure Limited has made available the audio recording of an analyst/investor conference call held on September 4, 2025, at 4:00 PM Indian time. The call discussed the company's proposed acquisition of PendraCare Group. The recording is accessible on the company's website and was made available in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1757044272949,
            "Source": "order&deals"
        },
        {
            "Title": "GST Cuts Make Home Medical Devices Cheaper, Diagnostic Test Prices Remain Uncertain",
            "Summary": "The GST Council reduced taxes on life-saving drugs from 12% to zero and cut GST on medical equipment including diagnostic kits, glucose monitors, and surgical devices from 12% to 5%. Poly Medicure's Managing Director Himanshu Baid expects the changes to boost demand for home healthcare products and reduce treatment costs. However, Metropolis Healthcare's Executive Chairperson Ameera Shah indicated that diagnostic test prices for consumers may not see significant drops, as GST wasn't directly applicable to consumers previously. The tax cuts create a more level playing field between organized and unorganized players, potentially improving margins for organized diagnostic companies. Both executives highlighted the GST reduction on insurance from 18% to 5% as a major consumer benefit. Poly Medicure shares traded at ₹2,119.30 and Metropolis Healthcare at ₹2,250.",
            "Sentiment": "positive",
            "PublishDate": 1756970508246,
            "Source": "stock"
        },
        {
            "Title": "Poly Medicure Establishes Netherlands Subsidiary to Acquire 90% Stake in PendraCare Group",
            "Summary": "Poly Medicure has incorporated a wholly owned step-down subsidiary in the Netherlands. This subsidiary will acquire 90% economic rights in PendraCare Group through a share purchase agreement.",
            "Sentiment": "positive",
            "PublishDate": 1756902462443,
            "Source": "order&deals"
        },
        {
            "Title": "GST Council Plans Tax Reduction on Medical Devices from 12% to 5%",
            "Summary": "The GST Council is planning to reduce tax rates on many medical devices from 12% to 5% to address duty-related issues. A meeting has been scheduled for September 3-4 to discuss this proposal. This potential tax reduction could benefit medical device companies like Poly Medicure by lowering their tax burden and potentially making their products more affordable.",
            "Sentiment": "positive",
            "PublishDate": 1756714906693,
            "Source": "sectoral"
        },
        {
            "Title": "Poly Medicure Expects Medical Device Demand Surge from Proposed GST Rate Cuts",
            "Summary": "Poly Medicure's Managing Director Himanshu Baid stated that proposed GST reforms could significantly boost demand for medical devices. Current GST rates are 5% for life-saving items, 12% for consumables, and 18% for equipment. Baid expects the 12% rate may drop to 5%, making products 6-7% cheaper and increasing demand for locally made devices. The Indian MedTech market is valued at $15 billion, with $8 billion from imports. The healthcare sector is growing 12-15% annually, with increased preference for domestic products over the last 4-5 years. India exported $700 million worth of medical devices to the US, which may face pressure from potential tariffs. Poly Medicure has limited US exposure at 3-4% of total exports but is building new product lines for the US market expected by FY27. The company is diversifying its export markets across Europe, Asia, and Latin America.",
            "Sentiment": "positive",
            "PublishDate": 1756574046778,
            "Source": "stock"
        },
        {
            "Title": "Poly Medicure Acquires 100% Stake in Himalayan Mineral Waters for ₹33.15 Crore",
            "Summary": "Poly Medicure's resolution plan worth ₹33.15 crore for Himalayan Mineral Waters has received approval from the National Company Law Tribunal (NCLT). The acquisition will give Poly Medicure complete ownership of Himalayan Mineral Waters, adding manufacturing assets and expected synergy benefits to the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1755692596513,
            "Source": "order&deals"
        },
        {
            "Title": "Poly Medicure Reports 5% Revenue Growth to Rs 403 Crores in Q1 FY26, Domestic Business Up 20%",
            "Summary": "Poly Medicure Limited reported consolidated revenue of Rs 403 crores for Q1 FY26, marking 5% growth. Domestic revenue grew 20% to Rs 126 crores, while international revenue declined 1% to Rs 275 crores due to challenges in European markets. The company achieved gross profit of Rs 276 crores with 68.4% margin, up 170 basis points year-on-year. Operating EBITDA was Rs 106 crores at 26.3% margin, slightly down from 27% last year. Net profit increased to Rs 93 crores from Rs 74 crores, delivering 21% net margin. The renal business segment grew 46% to Rs 44 crores, with 130 dialysis machines sold by July 31st. The company launched cardiology products including drug-eluting stents, with 1,350 stents implanted. Poly Medicure signed two contract manufacturing agreements with US and Hong Kong-based companies for vascular access and pain management products. The company established a wholly-owned subsidiary in Brazil and added 22 sales associates in Q1, targeting 100 new hires for FY26. Management maintained domestic revenue growth guidance of 30% for FY26 but revised international growth guidance to 5-10% from earlier 12-15% due to European market challenges and global trade uncertainties.",
            "Sentiment": "neutral",
            "PublishDate": 1755177954707,
            "Source": "earnings"
        },
        {
            "Title": "Poly Medicure Reports No Deviations in QIP Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Poly Medicure Limited reported no deviations in the utilization of funds raised through its Qualified Institutions Placement (QIP) for the quarter ended June 30, 2025. The company had raised Rs 99,999.98 lakh by allotting 53,19,148 equity shares to qualified institutional buyers at Rs 1,880 per share. The Audit Committee reviewed the fund utilization at its meeting held on August 8, 2025, and confirmed there were no deviations from the stated objects in the placement document. Out of the total funds raised, Rs 12,772.45 lakh has been utilized till June 30, 2025, with Rs 98,534.37 lakh remaining unutilized and transferred to a monitoring account. The funds were allocated for capital expenditure for manufacturing facilities, pursuing inorganic initiatives, and general corporate purposes. CRISIL Ratings Limited serves as the monitoring agency for the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1755152583051,
            "Source": "corporate_action"
        },
        {
            "Title": "Polymedicare Cuts Export Growth Guidance to 5-10% from Previous 15-18%",
            "Summary": "Polymedicare has revised its export guidance downward, reducing the projected growth range from 15-18% to 5-10%. The company has lowered its export expectations significantly.",
            "Sentiment": "negative",
            "PublishDate": 1754895655117,
            "Source": "stock"
        },
        {
            "Title": "Poly Medicure Reports Revenue Growth to 4B Rupees in Q1 Results",
            "Summary": "Poly Medicure reported Q1 revenue of 4 billion rupees compared to 3.85 billion rupees in the same period last year. The company's EBITDA increased to 1.06 billion rupees from 1.03 billion rupees year-over-year. However, EBITDA margin declined to 26.32% from 26.98% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754644531058,
            "Source": "earnings"
        },
        {
            "Title": "Poly Medicure Reports 26% Jump in Quarterly Net Profit to 931 Million Rupees",
            "Summary": "Poly Medicure announced consolidated net profit of 931 million rupees for the quarter, representing a year-on-year increase from 740 million rupees in the same period last year. The medical device company's quarterly earnings showed growth of approximately 26% compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754643854226,
            "Source": "earnings"
        },
        {
            "Title": "European Commission to Bar Chinese Companies from Medical Device Tenders",
            "Summary": "The European Commission has announced that Chinese companies will be excluded from public tenders for medical devices valued at over 5 million euros. This decision affects Poly Medicure, though the specific impact on the company is not detailed in the provided information.",
            "Sentiment": "negative",
            "PublishDate": 1750399509000,
            "Source": "default"
        },
        {
            "Title": "Poly Medicure Reports Strong Q4 Results and Dividend Announcement",
            "Summary": "Poly Medicure has reported its Q4 consolidated net profit at 918.3 million rupees, up from 684 million rupees year-over-year and 852.3 million rupees quarter-over-quarter. The company's Q4 revenue increased to 4.4 billion rupees from 3.7 billion rupees in the previous year. Additionally, Poly Medicure has recommended a dividend of 3.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746576775000,
            "Source": "default"
        },
        {
            "Title": "Poly Medicure Reports Strong Q4 Results and Announces Dividend",
            "Summary": "Poly Medicure has reported impressive Q4 financial results, with revenue increasing to 4.4 billion rupees from 3.7 billion year-over-year. The company's EBITDA rose to 1.19 billion rupees, up from 964.6 million, with an improved EBITDA margin of 27.1%. Consolidated net profit for Q4 reached 918.3 million rupees, up from 684 million year-over-year and 852.3 million quarter-over-quarter. Additionally, the company has recommended a dividend of 3.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746550742000,
            "Source": "result"
        },
        {
            "Title": "US Imposes 245% Tariffs on Chinese-Made Syringes and Needles",
            "Summary": "The United States has implemented a significant tariff increase of 245% on syringes and needles manufactured in China. This move is likely to impact the global medical supply chain and potentially benefit non-Chinese manufacturers of these medical devices.",
            "Sentiment": "positive",
            "PublishDate": 1744787393000,
            "Source": "default"
        },
        {
            "Title": "Poly Medicure: Secures MDR Certification for 54 Products in Europe",
            "Summary": "Poly Medicure Ltd has received Medical Device Regulation (MDR) certification for 54 of its products in Europe, covering multiple medical specialties. This certification ensures compliance with EU safety and quality standards, potentially strengthening the company's position in the European market, which currently contributes to half of its export revenue.",
            "Sentiment": "positive",
            "PublishDate": 1741689490000,
            "Source": "normal_news"
        },
        {
            "Title": "Poly Medicure Receives MDR Certification for 54 Products",
            "Summary": "Poly Medicure has announced that it has received Medical Device Regulation (MDR) certification for 54 of its products. This certification is a significant achievement for the company, as it allows these products to be sold in the European Union market, ensuring they meet the latest safety and quality standards.",
            "Sentiment": "positive",
            "PublishDate": 1741685480000,
            "Source": "corporate_action"
        },
        {
            "Title": "Poly Medicure Reports Improved Q3 Financial Performance",
            "Summary": "Poly Medicure has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.15 billion rupees, up from 902 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 27%, compared to 26.57% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738572688000,
            "Source": "earnings"
        },
        {
            "Title": "Poly Medicure Forms Joint Venture with Ampin C&I Power for Solar Project",
            "Summary": "Poly Medicure has entered into a joint venture agreement with Ampin C&I Power to establish a solar power project in Haryana. Poly Medicure will own 26% of the joint venture company, which aims to set up a solar power facility in the state.",
            "Sentiment": "positive",
            "PublishDate": 1736727708000,
            "Source": "corporate_action"
        },
        {
            "Title": "Poly Medicure Forms Joint Venture for Solar Power Project",
            "Summary": "Poly Medicure has entered into a joint venture agreement with Ampin C&I Power to establish a solar power project in Haryana. Poly Medicure will own 26% of the joint venture company.",
            "Sentiment": "positive",
            "PublishDate": 1736510843000,
            "Source": "corporate_action"
        },
        {
            "Title": "Poly Medicure Ltd: Domestic Business Projected to Grow Over 20% in Next Three Years",
            "Summary": "Poly Medicure's Managing Director Himanshu Baid forecasts over 20% growth in domestic business for the next 2-3 years, driven by import substitution in medical devices. The company expects to benefit from new government policies and regulations implemented in October 2023. Baid also predicts India's medical device exports to reach $20 billion by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1735797579000,
            "Source": "normal_news"
        },
        {
            "Title": "Poly Medicure: Eyes Expansion in Interventional Cardiology and Global Markets",
            "Summary": "Poly Medicure is focusing on growth in interventional cardiology and expanding its presence in key international markets.",
            "Sentiment": "positive",
            "PublishDate": 1730185747000,
            "Source": "normal_news"
        },
        {
            "Title": "Poly Medicure Reports Strong Q2 Financial Performance",
            "Summary": "Poly Medicure, a medical device company, has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.15 billion rupees, up from 842 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 27.41% from 24.97% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730104785000,
            "Source": "result"
        },
        {
            "Title": "Poly Medicure Reports Strong Q2 Revenue Growth",
            "Summary": "Poly Medicure, a medical devices company, has reported a significant increase in its second quarter revenue. The company's revenue for Q2 reached 4.2 billion rupees, up from 3.37 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730104714000,
            "Source": "result"
        },
        {
            "Title": "Poly Medicure Reports Strong Q2 Profit Growth",
            "Summary": "Poly Medicure, a medical device company, has announced its consolidated net profit for the second quarter. The company reported a net profit of 874 million rupees, compared to 622 million rupees in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730104687000,
            "Source": "result"
        }
    ]
}