{
    "Symbol": "POLYCAB",
    "ISIN": "INE455K01017",
    "News": [
        {
            "Title": "Polycab Allots 2,300 Shares Under ESOP Scheme",
            "Summary": "Polycab India's Finance and Operations Committee approved allotment of 2,300 equity shares under Employee Stock Option Scheme 2018 on February 09, 2026, to eligible employees.",
            "Sentiment": "neutral",
            "PublishDate": 1770643665782,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Schedules Investor Meetings for Feb & March 2026",
            "Summary": "Polycab India Limited announces institutional investor and analyst meetings scheduled for February 11, 2026 with Wasatch Global and March 05, 2026 for Nirmal Bang Investor Conference under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770366028946,
            "Source": "stocks"
        },
        {
            "Title": "Polycab India schedules investor meetings till Feb 2026",
            "Summary": "Polycab India Limited announces comprehensive schedule of institutional investor and analyst meetings from January 30, 2025 to February 26, 2026, including major conferences and one-on-one sessions.",
            "Sentiment": "neutral",
            "PublishDate": 1769522018201,
            "Source": "stocks"
        },
        {
            "Title": "Polycab India Issues Postal Ballot for Director Changes",
            "Summary": "Polycab India Limited has issued a postal ballot notice seeking member approval for five resolutions, including re-appointment of independent director Mrs. Manju Agarwal and designation changes for executive directors to Joint Managing Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1769183180398,
            "Source": "stocks"
        },
        {
            "Title": "Polycab India Gets Buy Rating with ₹9,600 Target",
            "Summary": "Motilal Oswal maintains BUY rating on Polycab India despite margin pressure from raw material costs. Strong 46% revenue growth in Q3FY26 driven by cables & wires segment expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768982257392,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prabhudas Lilladher sets ₹9,744 target for Polycab",
            "Summary": "Brokerage firm maintains buy rating on Polycab India with revised target price of ₹9,744, citing strong domestic W&C growth of 59% YoY and positive FMEG segment performance with 2.9% EBIT margin.",
            "Sentiment": "positive",
            "PublishDate": 1768896071029,
            "Source": "stocks"
        },
        {
            "Title": "Polycab shares surge 5% on strong Q3 revenue beat",
            "Summary": "Polycab shares gained 5% after reporting 46% revenue growth in Q3, beating estimates despite margin pressures. Brokerages maintain bullish outlook with Citi raising target to ₹9,500.",
            "Sentiment": "positive",
            "PublishDate": 1768797522392,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Expects 2-4% Price Rise Due to BEE Regulations",
            "Summary": "Polycab India anticipates 2% to 4% price increase from January 1st due to new BEE regulations. Export margins at 15% EBITDA outperform domestic margins of 9-12% for cables and 15-16% for wires.",
            "Sentiment": "positive",
            "PublishDate": 1768796911728,
            "Source": "stocks"
        },
        {
            "Title": "Polycab Shares Q3 FY26 Earnings Call Audio Recording",
            "Summary": "Polycab India Limited has uploaded the audio recording of its Q3 FY26 earnings conference call held on January 16, 2026, discussing performance for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768577769739,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Reports Record Q3FY26 Revenue of ₹76,361 Mn",
            "Summary": "Polycab India Limited delivered exceptional Q3FY26 performance with highest-ever quarterly revenue of ₹76,361 million, marking 46% YoY growth. EBITDA grew 34% YoY to ₹9,661 million while PAT increased 36% YoY to ₹6,302 million.",
            "Sentiment": "positive",
            "PublishDate": 1768560000404,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Reports Record Q3 FY26 Results",
            "Summary": "Polycab India achieves highest ever quarterly revenue of ₹76,361 Mn, up 46% YoY, with EBITDA growing 34% and PAT rising 36% in Q3 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1768559297281,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Q3FY26 Results: Revenue Jumps 46.18% YoY",
            "Summary": "Polycab India reported strong Q3FY26 results with consolidated revenue rising 46.18% YoY to ₹76,361.28 cr. Net profit surged 35.71% to ₹6,301.68 cr, while the company redesignated two executive directors as joint managing directors.",
            "Sentiment": "positive",
            "PublishDate": 1768558744897,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Q3FY26 Revenue Jumps 46% to ₹76,361 Crores",
            "Summary": "Polycab India reported strong Q3FY26 results with revenue rising 46.16% YoY to ₹76,361.28 crores and net profit growing 35.71% to ₹6,216.90 crores. The company also announced key leadership changes.",
            "Sentiment": "positive",
            "PublishDate": 1768558580458,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Q3FY26 Revenue Jumps 46.2% to ₹76,361 Cr",
            "Summary": "Polycab India Limited reported strong Q3FY26 results with revenue rising 46.2% YoY to ₹76,361.28 crores and net profit growing 35.7% to ₹6,216.90 crores. The company also announced key leadership changes.",
            "Sentiment": "positive",
            "PublishDate": 1768558029665,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Q3 Results: 46% Revenue Growth, Margins Pressured",
            "Summary": "Polycab India reported 46% revenue growth to ₹7,636 crores in Q3, but EBITDA margins compressed to 12.66% due to higher finance costs and advertising expenses. Stock fell 2.8% post-results.",
            "Sentiment": "neutral",
            "PublishDate": 1768557509102,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab India Q3: EBITDA Up 34% to ₹966 Cr, Margin Drops",
            "Summary": "Polycab India Q3 EBITDA grew 34% to ₹966 crores from ₹720 crores YoY, though EBITDA margin compressed to 12.7% from 13.8% despite strong revenue growth of 46%.",
            "Sentiment": "neutral",
            "PublishDate": 1768557157646,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab shares fall 3% on Rs 590 cr block deal",
            "Summary": "Polycab India shares dropped nearly 3% following a large block deal worth Rs 590 crore involving 7.98 lakh shares. A domestic mutual fund reportedly sold its stake at Rs 7,387.50 per share.",
            "Sentiment": "negative",
            "PublishDate": 1768369975055,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Shares Drop 3% on $135M Block Deal Activity",
            "Summary": "Polycab India shares declined up to 3% following a significant $135 million block trade on NSE, with shares offered at 2.7% discount by likely domestic mutual fund seller.",
            "Sentiment": "negative",
            "PublishDate": 1768366480165,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab India Sees ₹562.20 Cr NSE Block Trade",
            "Summary": "Polycab India witnessed a significant block trade on NSE worth ₹562.20 crores involving 764,902 shares at ₹7,350 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768363062824,
            "Source": "co_actions_results"
        },
        {
            "Title": "JPMorgan Initiates Overweight on Polycab & KEI Industries",
            "Summary": "JPMorgan initiated overweight coverage on Polycab (target ₹8,900, 17% upside) and KEI Industries (target ₹5,250, 20% upside), citing strong cable sector tailwinds and earnings upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1768281775091,
            "Source": "stocks"
        },
        {
            "Title": "Polycab Allots 8,650 Shares Under ESOP Scheme",
            "Summary": "Polycab India Limited's Finance and Operations Committee allotted 8,650 equity shares of ₹10.00 face value each to eligible employees under the Employee Stock Option Performance Scheme 2018 on January 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768225500120,
            "Source": "co_actions_results"
        },
        {
            "Title": "JPM Initiates Overweight Rating on Polycab",
            "Summary": "JPMorgan initiates overweight rating on Polycab India with target price of ₹8,900, signaling positive outlook for the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1768189798050,
            "Source": "stocks"
        },
        {
            "Title": "Polycab Appoints Shashi Amin as CEO-B2B Channel",
            "Summary": "Polycab India Limited has appointed Mr. Shashi Amin as Director (Non-Board Member) and CEO-B2B Channel & Corporate Communication effective January 05, 2026, following strategic leadership restructuring.",
            "Sentiment": "positive",
            "PublishDate": 1767609716941,
            "Source": "stocks"
        },
        {
            "Title": "Polycab India Block Trade Worth ₹610.34 Crores",
            "Summary": "Polycab India witnessed a significant block trade on NSE involving 792,644 shares at ₹7,700 per share, totaling ₹610.34 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767585407195,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab India Q3FY26 Earnings Call on Jan 16",
            "Summary": "Polycab India Limited announces earnings conference call scheduled for January 16, 2026 at 4:00 PM IST to discuss third quarter FY26 financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1767450980586,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab clarifies increased trading volume",
            "Summary": "Polycab India Limited responds to BSE inquiry about increased trading volume, stating all necessary disclosures made and increase is market-driven with no withheld price-sensitive information.",
            "Sentiment": "neutral",
            "PublishDate": 1766052951711,
            "Source": "stocks"
        },
        {
            "Title": "Polycab India Block Trade Worth ₹544.32 Crores",
            "Summary": "Polycab India witnessed a significant NSE block trade of ₹544.32 crores involving 756,782 shares at ₹7,192.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1765943620921,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polycab Receives 'B' Rating from CDP for Climate Action",
            "Summary": "Polycab India Limited achieves 'B' rating from Carbon Disclosure Project for both Climate Change and Water Security stewardship in 2025, demonstrating strong environmental performance.",
            "Sentiment": "positive",
            "PublishDate": 1765519659815,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Maintains Overweight on Polycab",
            "Summary": "Morgan Stanley maintains its Overweight rating on Polycab with a target price of ₹8,672, indicating positive outlook for the cables sector company.",
            "Sentiment": "positive",
            "PublishDate": 1765424759668,
            "Source": "stocks"
        },
        {
            "Title": "Polycab India Allots 150 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Polycab India Limited's Finance and Operations Committee allotted 150 equity shares of face value ₹10 each to eligible employees who exercised options under the Employee Stock Option Performance Scheme 2018. The allotment was approved in a committee meeting held on December 8, 2025, affecting participating employees in the company's stock option program.",
            "Sentiment": "neutral",
            "PublishDate": 1765185121489,
            "Source": "corporate_action"
        },
        {
            "Title": "Polycab India Allots 200 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Polycab India's Finance and Operations Committee allotted 200 equity shares of face value ₹10 each to eligible employees who exercised options under the Employee Stock Option Performance Scheme 2018. The allotment was approved at the committee meeting held on November 13, 2025, and communicated to BSE and NSE for record purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1763055280545,
            "Source": "corporate_action"
        },
        {
            "Title": "Polycab India Appoints Niyant Maru as Chief Financial Officer",
            "Summary": "Polycab India Limited announced a change in Key Managerial Personnel with the appointment of Niyant Maru as Chief Financial Officer effective October 28, 2025. Maru had previously been serving as Executive President - Finance since October 17, 2025. He is designated as a Whole-Time Key Managerial Personnel and is authorized to make material disclosures to stock exchanges. The company notified BSE and NSE of this leadership change.",
            "Sentiment": "neutral",
            "PublishDate": 1761654275041,
            "Source": "corporate_governance"
        },
        {
            "Title": "Polycab Sets EBITDA Margin Targets for FMEG Segment and Long-Term Business",
            "Summary": "Polycab announced its target to achieve 8-10% EBITDA margins in its FMEG (Fast Moving Electrical Goods) segment by FY30. The company maintains its long-term margin target of 11-13% over the next 5 years, even though current results are exceeding this range. These targets were communicated during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1760930939979,
            "Source": "stock"
        },
        {
            "Title": "Polycab India Reports Strong Q2 Results with 17.8% Revenue Growth and Appoints Interim CFO",
            "Summary": "Polycab India Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. Consolidated revenue from operations increased to ₹64,772.11 million in Q2 FY26 from ₹54,984.23 million in the previous year, representing 17.8% growth. Net profit rose to ₹6,929.59 million from ₹4,452.08 million year-over-year. For the six-month period, consolidated revenue reached ₹1,23,831.87 million compared to ₹1,01,964.53 million in the previous year. The company's Wires and Cables segment generated ₹56,911.30 million in Q2 revenue, while FMEG contributed ₹4,521.84 million and EPC ₹4,023.90 million. The Board also appointed Mr. Niyant Maru as Executive President - Finance effective October 17, 2025, who will be designated as Chief Financial Officer from October 28, 2025 for a fixed term of nine months. This appointment follows the resignation of the previous CFO. Earnings per share (basic) stood at ₹45.54 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1760688734664,
            "Source": "earnings"
        },
        {
            "Title": "Polycab India Quarterly Results Expected to Show Strong Growth in Revenue and Profitability",
            "Summary": "Polycab India Ltd., a wires and cables manufacturer, is set to announce its September quarter results. Market expectations indicate revenue growth of 18% to ₹6,474 crore, with EBITDA projected to increase 45% to ₹915 crore. EBITDA margin is expected to expand by 260 basis points to 14.1%, while net profit may jump 46% to ₹651 crore. The anticipated 20% revenue growth is expected to be driven by the Wires & Cables segment, supported by domestic demand momentum, healthy pricing, and positive channel sentiment from rising copper prices. The FMEG business is projected to grow 15%, with weakness in fans potentially offset by growth in other segments. Key focus areas include management's full-year guidance, demand outlook for domestic and export markets, and capacity expansion plans. Polycab shares are trading at ₹7,593, up 4% over the past month and year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1760685772181,
            "Source": "earnings"
        },
        {
            "Title": "Polycab India Schedules Q2 Financial Results Review for October 17",
            "Summary": "Polycab India has announced that it will review its Q2 financial results on October 17. The company has set this date for the quarterly results review.",
            "Sentiment": "neutral",
            "PublishDate": 1759742795848,
            "Source": "earnings"
        },
        {
            "Title": "Polycab India Promoters Sell 1.51% Stake Worth ₹1,695 Crore in Block Deal",
            "Summary": "Polycab India witnessed a block deal where 22.73 lakh shares representing 1.51% equity changed hands at ₹7,458 per share, valued at ₹1,695 crore. The sellers included promoter group members Inder T. Jaisinghani, Ramesh T. Jaisinghani, Ajay T. Jaisinghani, Girdhari Thakurdas Jaisinghani, Nikhil Ramesh Jaisinghani and Bharat Jaisinghani. The promoters will observe a 90-day lock-in period on further share sales. Promoters held 51.07% stake in the company at the end of June quarter. The electrical goods company reported strong June quarter results with net profit rising 50% to ₹600 crore and revenue increasing 25.7% to ₹5,651 crore. EBITDA grew 47.1% to ₹858 crore with margins expanding to 14.5%.",
            "Sentiment": "neutral",
            "PublishDate": 1758770696334,
            "Source": "order&deals"
        },
        {
            "Title": "Polycab India Promoters to Sell 0.81% Stake for ₹888 Crore in Block Deal",
            "Summary": "Polycab India promoter entities plan to sell up to 0.81% equity stake through a block deal valued at ₹887.6 crore. The floor price is set at ₹7,300 per share, representing a 3.09% discount to the last traded price. Seven promoter group members including Inder T. Jaisinghani, Ajay T. Jaisinghani, and others are participating as sellers. The promoters will observe a 90-day lock-in period on further share sales post-transaction. Polycab reported strong quarterly results with net profit rising 50% to ₹600 crore, surpassing estimates of ₹518 crore. Revenue grew 25.7% to ₹5,906 crore, beating projections of ₹5,651 crore. EBITDA increased 47.1% to ₹858 crore with margins expanding over 200 basis points to 14.5%. Shares closed at ₹7,522.40, down 1.52%.",
            "Sentiment": "neutral",
            "PublishDate": 1758724885984,
            "Source": "order&deals"
        },
        {
            "Title": "Polycab India Block Trade Worth Rs. 100.71 Crores Executed on NSE",
            "Summary": "Polycab India Ltd. executed a block trade on the National Stock Exchange involving approximately 149,094 shares at a price of Rs. 6,754.50 per share. The total transaction value amounted to Rs. 100.71 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1754987496812,
            "Source": "order&deals"
        },
        {
            "Title": "Polycab India CFO Gandharv Tongia Resigns, Effective October 2025",
            "Summary": "Gandharv Tongia has resigned from his position as Executive Director & CFO of Polycab India Limited, citing personal reasons. His resignation will be effective from close of business hours on or before October 27, 2025. The Board and Management acknowledged his contributions during his tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754417010538,
            "Source": "corporate_governance"
        },
        {
            "Title": "Polycab India Reports Record Q1 FY26 Results with 26% Revenue Growth and 47% EBITDA Jump",
            "Summary": "Polycab India delivered its highest-ever Q1 revenue and profitability with consolidated revenue growing 26% year-on-year, driven primarily by robust performance in the Wires and Cables business. EBITDA surged 47% with margins expanding 210 basis points to 14.5%. PAT reached ₹6 billion, reflecting 49% growth with margins improving 170 basis points to 10.2%. The Wires and Cables segment recorded 31% revenue growth supported by over 25% volume growth, while FMEG business achieved 18% growth and delivered its second consecutive profitable quarter. The company maintained a strong balance sheet with net cash position of ₹31 billion and working capital cycle of 43 days. Solar products emerged as the largest contributor within FMEG portfolio with over 2x growth. The company won two BharatNet orders worth ₹80 billion to be executed over next 3 years. International business grew 24% contributing 5.2% to consolidated revenue, with exports benefiting from favorable tariff positioning compared to competitors.",
            "Sentiment": "positive",
            "PublishDate": 1753443589142,
            "Source": "earnings"
        },
        {
            "Title": "Polycab India: Q1 Net Profit Soars 50% YoY, Revenue Up 26%",
            "Summary": "Polycab India reported a 50% YoY increase in Q1 FY26 consolidated net profit to Rs 592 crore. Revenue from operations grew 26% YoY to Rs 5,906 crore. PAT margins expanded by 170 bps YoY to 10.2%, while EBITDA margin improved by 210 bps YoY to 14.5%. Growth was driven by strong performance in Wires & Cables segment and FMEG business.",
            "Sentiment": "positive",
            "PublishDate": 1752810680000,
            "Source": "earnings"
        },
        {
            "Title": "Polycab India: Q1 Profit Soars 50%, Revenue Up 26%",
            "Summary": "Polycab India reported a 50% YoY increase in Q1FY26 net profit to Rs 592 crore. Revenue from operations grew 26% YoY to Rs 5,906 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752744322000,
            "Source": "earnings"
        },
        {
            "Title": "Polycab India Reports Strong Q1 Financial Results",
            "Summary": "Polycab India has announced its Q1 financial results, showing significant year-over-year growth. The company's EBITDA increased to 8.58 billion rupees from 5.83 billion rupees in the previous year, surpassing estimates of 7.62 billion rupees. EBITDA margin improved to 14.52% from 12.42%, exceeding the estimated 13.5%. Revenue rose to 59 billion rupees from 47 billion rupees, beating expectations of 56.51 billion rupees. Consolidated net profit grew to 5.9 billion rupees from 3.96 billion rupees, also surpassing the estimated 5.2 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752743675000,
            "Source": "result"
        },
        {
            "Title": "Polycab India Ltd: Q1 Results Anticipated, Stock Dips Ahead of Announcement",
            "Summary": "Polycab India Ltd's shares are trading lower ahead of Q1 results announcement. Analysts expect 20% revenue growth to ₹5,651 crore, 31% EBITDA growth to ₹762 crore, and 29% net profit increase to ₹518 crore. Key focus areas include updated guidance on Project LEAP, demand outlook, and capacity addition plans.",
            "Sentiment": "neutral",
            "PublishDate": 1752736692000,
            "Source": "earnings"
        },
        {
            "Title": "Polycab to Review Q1 Results on July 17",
            "Summary": "Polycab has announced that it will review its first quarter (Q1) results on July 17. The company has not provided any additional details about the expected financial performance or the specific time of the review.",
            "Sentiment": "neutral",
            "PublishDate": 1751276128000,
            "Source": "default"
        },
        {
            "Title": "Polycab India Ltd: Jefferies Hikes Target Price, Shares Hit Five-Month High",
            "Summary": "Polycab India shares rose nearly 6% after Jefferies increased its target price to Rs 7,150. The company will trade ex-dividend tomorrow. Jefferies reaffirmed its 'Buy' rating, citing strong growth in Cables & Wires business, FMEG turnaround, and robust order book. Polycab has secured large infrastructure projects and aims for 8-10% FMEG operating margins by fiscal 2030.",
            "Sentiment": "positive",
            "PublishDate": 1750672105000,
            "Source": "normal_news"
        },
        {
            "Title": "Polycab India Ltd: Last Day to Buy Shares for Record Dividend",
            "Summary": "June 23 is the last day to buy Polycab India Ltd shares to qualify for a record Rs 35 per share dividend. The record date is set for June 24, with the total dividend payout amounting to Rs 526 crore. Jefferies maintains a 'buy' rating on Polycab, raising the target price to Rs 7,050.",
            "Sentiment": "positive",
            "PublishDate": 1750647889000,
            "Source": "corporate_action"
        },
        {
            "Title": "Polycab India Signs ₹64.48 Billion Deal with BSNL for BharatNet Program",
            "Summary": "Polycab India has entered into a significant agreement with BSNL (Bharat Sanchar Nigam Limited) worth ₹64.48 billion. The deal is aimed at enhancing the BharatNet program, which is likely a national broadband initiative. This partnership suggests a major infrastructure project involving telecommunications equipment or services.",
            "Sentiment": "positive",
            "PublishDate": 1750161217000,
            "Source": "default"
        },
        {
            "Title": "Polycab India Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 95,346 shares of Polycab India Ltd. occurred on the National Stock Exchange (NSE) for Rs. 57.75 crores. The trade was executed at a price of Rs. 6057.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1750138521000,
            "Source": "block_details"
        }
    ]
}