{
    "Symbol": "POLYPLEX",
    "ISIN": "INE633B01018",
    "News": [
        {
            "Title": "Polyplex Board Meeting Set for February 13, 2026",
            "Summary": "Polyplex Corporation Limited announces board meeting on February 13, 2026 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025 under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769687190754,
            "Source": "co_actions_results"
        },
        {
            "Title": "Polyplex Corporation Reports 72% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "Polyplex Corporation's Q2 consolidated net profit declined sharply to 247 million rupees from 878 million rupees year-over-year, while revenue increased marginally to 17.9 billion rupees from 17.4 billion rupees. The company's EBITDA fell significantly to 1.02 billion rupees from 1.9 billion rupees, with EBITDA margin compressing to 5.72% from 10.98% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1763074700309,
            "Source": "earnings"
        },
        {
            "Title": "Polyplex Corporation Plans ₹1,000+ Cr Capacity Expansion Across U.S. and India Plants",
            "Summary": "Polyplex Corporation announced capacity expansion plans in specialty films and packaging solutions with capital expenditure exceeding ₹1,000 crores for facilities in the U.S. and India. The company targets 12-15% revenue CAGR through value-added product mix while focusing on sustainability initiatives including recycled PET and green energy adoption.",
            "Sentiment": "positive",
            "PublishDate": 1763056207595,
            "Source": "stock"
        },
        {
            "Title": "Polyplex Corporation Declares Rs. 2 Interim Dividend, Reports Mixed Q2 Results",
            "Summary": "Polyplex Corporation declared an interim dividend of Rs. 2 per share for FY2025-26 with record date November 21, 2025, while reporting standalone quarterly profit of Rs. 1,613 lakh versus Rs. 2,209 lakh in the previous year. The company also appointed Rakesh Aggarwal as Business Head in senior management and released unaudited financial results showing revenue from operations at Rs. 37,260 lakh for the quarter ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763055227905,
            "Source": "corporate_action"
        },
        {
            "Title": "Polyplex Corporation to Consider Interim Dividend Declaration in Board Meeting",
            "Summary": "Polyplex Corporation Limited has announced that its Board of Directors will consider the declaration of an interim dividend for Financial Year 2025-26 during their board meeting scheduled for November 13, 2025. The meeting was initially planned to review unaudited financial results for the quarter and half-year ended September 30, 2025, and the interim dividend consideration has been added to the agenda.",
            "Sentiment": "positive",
            "PublishDate": 1762568263198,
            "Source": "corporate_action"
        },
        {
            "Title": "Polyplex Corp Announces Strategic Capacity Expansion and Film Portfolio Diversification Plans",
            "Summary": "Polyplex Corp has outlined plans for strategic capacity expansion and diversification of its value-added film portfolio. The company's strategy focuses on expanding its global footprint, implementing cost optimization measures, and developing specialty films. These initiatives are aimed at achieving long-term margin stability through enhanced operational efficiency and product diversification.",
            "Sentiment": "positive",
            "PublishDate": 1755102875051,
            "Source": "stock"
        },
        {
            "Title": "Polyplex Corporation Reports Mixed Results with Standalone Profit but Consolidated Loss",
            "Summary": "Polyplex Corporation Limited released its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported a profit of Rs. 2,209 lakh compared to Rs. 653 lakh in the same quarter last year, with revenue from operations at Rs. 39,194 lakh. However, on a consolidated basis, the company posted a net loss of Rs. 5,981 lakh versus a profit of Rs. 9,713 lakh in the previous year quarter. Consolidated revenue from operations stood at Rs. 1,73,867 lakh. The company's earnings per share on standalone basis was Rs. 7.04 while consolidated EPS showed a loss of Rs. 6.15. The results were approved by the Board of Directors on August 12, 2025. Additionally, Polyplex (Thailand) received an arbitration notice from a minority shareholder regarding the purchase of shares valued at approximately Rs. 34,506 lakh, though management believes it has no obligation to purchase these shares.",
            "Sentiment": "negative",
            "PublishDate": 1755017670516,
            "Source": "earnings"
        },
        {
            "Title": "Polyplex Wins Arbitration Dispute in Thailand, Claims 3.54 Billion Rupees",
            "Summary": "Polyplex, a minority stakeholder in EcoBlue, has won an arbitration dispute in a Thai court. The company is now claiming 3.54 billion rupees as a result of the favorable ruling. The arbitration proceedings were initiated to resolve a conflict between Polyplex and EcoBlue.",
            "Sentiment": "positive",
            "PublishDate": 1750755542000,
            "Source": "default"
        },
        {
            "Title": "Polyplex Corporation Reports Q4 Results and Dividend Recommendation",
            "Summary": "Polyplex Corporation has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 101 million rupees from 84.2 million rupees year-over-year, but decreased from 578 million rupees quarter-over-quarter. Q4 revenue rose to 17.4 billion rupees from 16.8 billion rupees year-over-year. However, Q4 EBITDA decreased to 639 million rupees from 965.7 million rupees year-over-year, with EBITDA margin falling to 3.67% from 5.75%. The company has recommended a dividend of 4.25 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748446792000,
            "Source": "result"
        },
        {
            "Title": "Investor Dolly Khanna Acquires 1.16% Stake in Polyplex Corp",
            "Summary": "According to the shareholding pattern for Q4, renowned investor Dolly Khanna has acquired a 1.16% stake in Polyplex Corp. This information was revealed in the company's latest shareholding disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1745207042000,
            "Source": "default"
        },
        {
            "Title": "Polyplex Corp's US Unit Commences Commercial Operations of Thin Film Line",
            "Summary": "Polyplex Corporation has announced that its subsidiary in the United States has begun commercial operations of a new thin film production line. This development signifies an expansion of the company's manufacturing capabilities in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1743034465000,
            "Source": "corporate_action"
        },
        {
            "Title": "Polyplex Corporation's US Subsidiary Commences Thin Film Line Operations",
            "Summary": "Polyplex Corporation has announced that its subsidiary in the United States has begun commercial operations of a new thin film production line. This development represents an expansion of the company's manufacturing capabilities in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1742990997000,
            "Source": "corporate_action"
        },
        {
            "Title": "Polyplex Corp Unit Initiates Trial Runs for New Projects",
            "Summary": "Polyplex Corporation's subsidiary has commenced trial runs for new projects. The capital expenditure for these projects amounts to $124 million.",
            "Sentiment": "positive",
            "PublishDate": 1742559186000,
            "Source": "corporate_action"
        },
        {
            "Title": "Polyplex Corporation Reports Significant Profit Increase in Q3",
            "Summary": "Polyplex Corporation has announced its Q3 financial results, showing a substantial increase in net profit. The company's consolidated net profit rose to 578 million rupees, compared to 46 million rupees in the same period last year. Revenue also saw growth, reaching 17 billion rupees, up from 15 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739751415000,
            "Source": "earnings"
        },
        {
            "Title": "Polyplex Corporation Reports Strong Q3 Financial Results",
            "Summary": "Polyplex Corporation has announced its Q3 financial results, showing significant year-over-year improvements. The company's consolidated net profit increased from 46 million rupees to 578 million rupees. Revenue grew from 15 billion rupees to 17 billion rupees. EBITDA rose from 495 million rupees to 1.21 billion rupees, with the EBITDA margin expanding from 3.31% to 7.04%.",
            "Sentiment": "positive",
            "PublishDate": 1739544589000,
            "Source": "earnings"
        },
        {
            "Title": "Polyplex Corp Approves New BOPET Film Plant Investment",
            "Summary": "Polyplex Corporation has approved the establishment of a new Biaxially Oriented Polyethylene Terephthalate (BOPET) manufacturing film plant. The investment required for this project is estimated to be approximately 5.58 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736468291000,
            "Source": "corporate_action"
        },
        {
            "Title": "Polyplex Corp Approves New BOPET Film Manufacturing Plant",
            "Summary": "Polyplex Corporation has approved the establishment of a new BOPET (Biaxially Oriented Polyethylene Terephthalate) film manufacturing plant. The investment required for this project is estimated to be approximately 5.58 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736423682000,
            "Source": "corporate_action"
        },
        {
            "Title": "Polyplex Corporation Reports Strong Q2 Results and Declares Interim Dividend",
            "Summary": "Polyplex Corporation has announced its Q2 financial results, showing significant year-over-year improvements. The consolidated net profit rose to 878 million rupees from 279 million rupees in the previous year. Revenue increased to 17.4 billion rupees from 15.7 billion rupees. EBITDA grew to 1.9 billion rupees from 1.21 billion rupees, with the EBITDA margin expanding to 10.98% from 7.67%. The company also declared an interim dividend of 9 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1731455984000,
            "Source": "result"
        }
    ]
}