{
    "Symbol": "PONNIERODE",
    "ISIN": "INE838E01017",
    "News": [
        {
            "Title": "Ponni Sugars Q3FY26 Profit Surges 293% YoY",
            "Summary": "Ponni Sugars (Erode) reports strong Q3FY26 results with net profit jumping to ₹947 lakhs from ₹241 lakhs YoY. Revenue rises 30.8% to ₹15,135 lakhs driven by improved sugar segment performance.",
            "Sentiment": "positive",
            "PublishDate": 1769762831574,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ponni Sugars Shareholders Approve Material Related Party Transaction MoU with Seshasayee Paper",
            "Summary": "Ponni Sugars (Erode) Limited shareholders approved a comprehensive MoU with Seshasayee Paper and Boards Limited for material related party transactions through postal ballot e-voting conducted from November 5 to December 4, 2025. The resolution passed with 99.97% votes in favor, with 106 members voting for and 4 members voting against the proposal.",
            "Sentiment": "positive",
            "PublishDate": 1764921744545,
            "Source": "corporate_action"
        },
        {
            "Title": "Ponni Sugars Seeks Shareholder Approval for Rs 60 Crore Annual Related Party Transaction Deal with Seshasayee Paper",
            "Summary": "Ponni Sugars (Erode) Limited has issued a postal ballot notice seeking shareholder approval for a comprehensive MoU with Seshasayee Paper and Boards Limited (SPB) for related party transactions worth up to Rs 60 crores per financial year from January 2026 to December 2030. The transactions include purchase/sale of bagasse, sugar, fuel, power, water and other products, along with services and shared expenses. SPB holds 32.35% stake in Ponni Sugars and is considered a related party. The company's RPTs with SPB are expected to exceed 10% of turnover in Q4 of the current financial year, making it a material transaction requiring shareholder approval. The remote e-voting period runs from November 5 to December 4, 2025. The bagasse supply arrangement has strategic importance as SPB promoted Ponni Sugars' establishment in 1984 to secure raw materials for pulp and paper production.",
            "Sentiment": "neutral",
            "PublishDate": 1762305588120,
            "Source": "corporate_action"
        },
        {
            "Title": "Ponni Sugars Reports 17% Rise in Net Profit to ₹1,456 Lakhs in Q2",
            "Summary": "Ponni Sugars (Erode) Limited reported a net profit after tax of ₹1,456 lakhs for the quarter ended September 30, 2025, compared to ₹1,234 lakhs in the same quarter of the previous year. Total income from operations increased to ₹11,471 lakhs from ₹9,810 lakhs year-on-year. For the six-month period, net profit reached ₹1,928 lakhs versus ₹1,828 lakhs in the corresponding period last year, while total income rose to ₹17,843 lakhs from ₹15,849 lakhs. Basic earnings per share improved to ₹16.93 from ₹13.41 in the same quarter last year. However, total comprehensive income showed a loss of ₹3,122 lakhs for the quarter compared to a profit of ₹856 lakhs in the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761390076738,
            "Source": "earnings"
        },
        {
            "Title": "Ponni Sugars Erode: Q3 Profit Plunges 79.31% Amid Revenue Decline",
            "Summary": "Ponni Sugars Erode reported Q3 FY25 results with profit falling 79.31% YoY to ₹2.41 crore. Revenue decreased 6.98% YoY to ₹115.74 crore. Operating income declined 86.67% YoY. EPS dropped to ₹2.8, down 79.34% YoY. SG&A expenses increased 7.12% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737178535000,
            "Source": "earnings"
        },
        {
            "Title": "Ponni Sugars Reports Decline in Q3 Profit and Revenue",
            "Summary": "Ponni Sugars has reported a significant decrease in its consolidated net profit for the third quarter, dropping to 24 million rupees from 117 million rupees in the same period last year. The company's revenue also declined to 1.15 billion rupees from 1.24 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737102683000,
            "Source": "earnings"
        }
    ]
}