{
    "Symbol": "POONAWALLA",
    "ISIN": "INE511C01022",
    "News": [
        {
            "Title": "Poonawalla Fincorp Approves ₹500 Crore NCD Issue",
            "Summary": "Poonawalla Fincorp has approved the issuance of up to ₹500 crore worth of secured, redeemable, rated, listed non-convertible debentures through private placement to raise funds.",
            "Sentiment": "positive",
            "PublishDate": 1770023003490,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Launches Five AI Solutions",
            "Summary": "Poonawalla Fincorp deploys AI across competitive intelligence, compliance, data quality, customer insights and software development to strengthen decision-making and execution capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1769568832959,
            "Source": "stocks"
        },
        {
            "Title": "Poonawalla Fincorp Allots 91,607 ESOP Shares",
            "Summary": "Poonawalla Fincorp's board committee approved allotment of 91,607 equity shares under Employee Stock Option Schemes, increasing paid-up capital to ₹1,625.44 crores with 812.72 crore shares outstanding.",
            "Sentiment": "neutral",
            "PublishDate": 1769098808941,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp schedules investor meet in Asia",
            "Summary": "Poonawalla Fincorp has scheduled institutional investor meetings from January 26-30, 2026 in Hong Kong and Singapore. The company will conduct physical meetings with institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768917173986,
            "Source": "stocks"
        },
        {
            "Title": "Poonawalla Fincorp Shares Rise 3.47% on Q3 Results",
            "Summary": "Poonawalla Fincorp shares gained 3.47% to ₹492.60 intraday following strong Q3 results. Company reported 102% QoQ profit growth and approved ₹5,500 crore equity raise for expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1768795463449,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Q3FY26: AUM up 77.6% YoY to ₹55,017 cr",
            "Summary": "Poonawalla Fincorp reports strong Q3FY26 results with AUM growth of 77.6% YoY to ₹55,017 crore, PAT doubling QoQ to ₹150 crore, and stable asset quality with GNPA at 1.51%.",
            "Sentiment": "positive",
            "PublishDate": 1768563074228,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Q3 Asset Quality Improves Further",
            "Summary": "Poonawalla Fincorp's Q3 asset quality shows continued improvement with Gross Stage 3 declining to 1.51% from 1.59% QoQ and Net Stage 3 reducing to 0.80% from 0.81% QoQ, reflecting strong risk management.",
            "Sentiment": "positive",
            "PublishDate": 1768562557775,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Q3 FY26 Results Show Strong Growth",
            "Summary": "Poonawalla Fincorp reported robust Q3 FY26 results with net profit of ₹150.22 crores, up from ₹18.73 crores YoY. Board approved fundraising plans worth ₹25,500 crores and appointed new executive director.",
            "Sentiment": "positive",
            "PublishDate": 1768561993727,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Q3FY26 Profit Surges 702% YoY",
            "Summary": "Poonawalla Fincorp reported strong Q3FY26 results with net profit jumping 702% YoY to ₹150.22 crores. Board approved ₹5,500 crore equity fundraising and appointed Vikas Pandey as Executive Director.",
            "Sentiment": "positive",
            "PublishDate": 1768561851729,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Plans Fund Raising via Share Issue",
            "Summary": "Poonawalla Fincorp is considering raising funds through share issuance, with the proposal being evaluated on January 16. The financial services company is exploring equity financing options.",
            "Sentiment": "neutral",
            "PublishDate": 1768271620753,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Board to Meet on Jan 16 for Fundraising",
            "Summary": "Poonawalla Fincorp has scheduled a board meeting on January 16, 2026, to consider raising funds through equity shares via QIP and issuing non-convertible debt securities worth up to ₹20,000 crores during FY 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1768237681423,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Board Meet on Jan 16 for Fundraising",
            "Summary": "Poonawalla Fincorp's board will meet on January 16, 2026, to consider raising funds through equity shares via QIP and issuing non-convertible debt securities up to ₹20,000 crores for FY2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1768235286019,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Block Trade Worth ₹24.52 Crores",
            "Summary": "Poonawalla Fincorp witnessed a significant NSE block trade involving 509,789 shares valued at ₹24.52 crores, executed at ₹480.95 per share, indicating institutional interest in the financial services company.",
            "Sentiment": "neutral",
            "PublishDate": 1767593309141,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp gains on 77% AUM growth in Q3",
            "Summary": "Poonawalla Fincorp shares rose 2% after reporting 77.5% YoY AUM growth to ₹55,000 crore in Q3 FY25, with strong liquidity position of ₹6,450 crore and robust sequential growth of 15.3%.",
            "Sentiment": "positive",
            "PublishDate": 1767585713638,
            "Source": "stocks"
        },
        {
            "Title": "Poonawalla Fincorp Reports 77.5% AUM Growth in Q3 FY26",
            "Summary": "Poonawalla Fincorp achieved remarkable 77.5% yearly growth in AUM for Q3 FY26, maintaining strong liquidity of ₹6,450 crore with robust risk management strategy and diversified portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767585336455,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp AUM Surges 77.5% YoY to ₹55,000 Cr",
            "Summary": "Poonawalla Fincorp reports strong Q3 FY26 performance with AUM growing 77.5% year-on-year to ₹55,000 crore and maintaining robust liquidity position of ₹6,450 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767582287336,
            "Source": "stocks"
        },
        {
            "Title": "Poonawalla Fincorp Earnings Call on Jan 16 at 5 PM",
            "Summary": "Poonawalla Fincorp scheduled earnings call for January 16, 2026 at 5:00 PM IST following Q3FY26 results announcement. Call includes international dial-in numbers and DiamondPass express join option.",
            "Sentiment": "neutral",
            "PublishDate": 1767002072547,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Approves ₹750 Cr NCD Issuance",
            "Summary": "Poonawalla Fincorp's Finance Committee approves issuance of secured, redeemable, rated, listed non-convertible debentures worth ₹750 crore through private placement with base issue of ₹500 crore and green shoe option of ₹250 crore.",
            "Sentiment": "positive",
            "PublishDate": 1766128253746,
            "Source": "co_actions_results"
        },
        {
            "Title": "Poonawalla Fincorp Gets CRISIL AAA Rating on ₹10K Cr NCDs",
            "Summary": "CRISIL assigns AAA/Stable rating to Poonawalla Fincorp's ₹10,000 crore NCDs and enhances bank facility rating to ₹15,285 crore, reflecting strong promoter support and healthy capitalization.",
            "Sentiment": "positive",
            "PublishDate": 1765560854804,
            "Source": "stocks"
        },
        {
            "Title": "Poonawalla Fincorp Designates Two Senior Executives",
            "Summary": "Poonawalla Fincorp's Board designates Manish Verma (Head IR & Corporate Communications) and Vadakke Madathil Maneesh Kumar (Head Operations) as Senior Management Personnel effective December 11, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765457978640,
            "Source": "stocks"
        },
        {
            "Title": "Poonawalla Fincorp Fully Implements Credit AI System",
            "Summary": "Poonawalla Fincorp has successfully completed the full implementation of its Credit AI technology across its personal loan division, marking a significant technological advancement in the company's lending operations.",
            "Sentiment": "positive",
            "PublishDate": 1765375700583,
            "Source": "stocks"
        },
        {
            "Title": "Poonawalla Fincorp Completes Credit AI Implementation in Personal Loan Division",
            "Summary": "Poonawalla Fincorp has fully implemented its Credit AI system in the personal loan division. The implementation affects the company's personal lending operations and represents a technological advancement in their credit assessment processes.",
            "Sentiment": "positive",
            "PublishDate": 1765337584543,
            "Source": "stock"
        },
        {
            "Title": "Poonawalla Fincorp Independent Director Bontha Prasada Rao Steps Down After Completing Second Tenure",
            "Summary": "Mr. Bontha Prasada Rao (DIN: 01705080) ceased to hold the position of Independent Director and chairperson of certain Board committees at Poonawalla Fincorp with effect from close of business hours on December 09, 2025. His departure follows the completion of his second tenure as an Independent Director, with the Board acknowledging his valuable contributions and guidance during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1765284922455,
            "Source": "corporate_governance"
        },
        {
            "Title": "Poonawalla Fincorp Allots 49,390 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Poonawalla Fincorp's Nomination and Remuneration Committee allotted 49,390 equity shares of Rs. 2 face value each under Employee Stock Option Schemes on November 22, 2025. The allotment increases the company's paid-up equity share capital to Rs. 1,625,173,630 consisting of 812,586,815 equity shares, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763803661860,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Faces Rs 16.39 Lakh Income Tax Penalty for FY 2018-19",
            "Summary": "Poonawalla Fincorp received an order from Commissioner of Income Tax (Appeals) sustaining a penalty of Rs 16,39,570 under section 270A of the Income Tax Act, 1961, related to disallowance of education cess deduction of Rs 93,84,000 claimed in revised tax return for FY 2018-19. The company states the matter pertains to the period prior to its acquisition and confirms no material impact on financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1763364276595,
            "Source": "stock"
        },
        {
            "Title": "Poonawalla Fincorp Denies Anonymous Allegations, Reports Matter to Authorities",
            "Summary": "Poonawalla Fincorp Limited has issued an official statement addressing anonymous email and WhatsApp communications containing allegations against the company and its leadership. The NBFC described these communications as frivolous, malicious, unsubstantiated, and misleading attempts to harm the company's reputation. The company has reported the matter to regulatory authorities and the Cyber Crime Cell, requesting an investigation into the source and motives. Poonawalla Fincorp characterized the complaint as defamatory and urged stakeholders not to be influenced by unverified information. The company reaffirmed its commitment to integrity, transparency, and corporate governance standards. Poonawalla Fincorp is a Cyrus Poonawalla Group-promoted NBFC focused on consumer and MSME lending, with an AUM of ₹47,701 crore and 5,081 employees as of September 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762136929631,
            "Source": "corporate_governance"
        },
        {
            "Title": "Poonawalla Fincorp Allots 92,707 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Poonawalla Fincorp's Nomination and Remuneration Committee allotted 92,707 equity shares of Rs. 2 face value each under the company's Employee Stock Option Schemes on November 1, 2025. The allotted shares will rank equally with existing equity shares in all respects. Following this allotment, the company's issued, subscribed and paid-up equity share capital increased to Rs. 162.51 crores, consisting of 81.25 crore equity shares of Rs. 2 each.",
            "Sentiment": "neutral",
            "PublishDate": 1761994614378,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Raises ₹1,010 Crore Through Non-Convertible Debentures",
            "Summary": "Poonawalla Fincorp has raised ₹1,010 crore through non-convertible debentures via private placement. The fundraising consists of ₹1,000 crore in fully paid debentures and ₹10 crore in partly paid debentures. The debentures carry a coupon rate of 7.90% per year. The company plans to list these debentures on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1761897563457,
            "Source": "stock"
        },
        {
            "Title": "Poonawalla Fincorp Approves ₹2,000 Crore Non-Convertible Debenture Issuance",
            "Summary": "Poonawalla Fincorp's Finance Committee approved the issuance of secured, redeemable, rated, listed non-convertible debentures worth ₹2,000 crore through private placement. The issue comprises 2,00,000 NCDs with a face value of ₹1,00,000 each, structured in two series under PFL NCD series 'G2' and 'G3' for FY 2025-26. Each series has a base issue size of ₹1,000 crore, with the G3 series being partly-paid debentures. The NCDs will be listed on BSE Limited and secured by first ranking pari passu charge on hypothecated properties. The company will pay an additional 2% coupon rate over the applicable rate for any delays in interest or principal payments exceeding three months.",
            "Sentiment": "neutral",
            "PublishDate": 1761638690878,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Reports 68% YoY AUM Growth, Launches Multiple AI Initiatives in Q2 FY26",
            "Summary": "Poonawalla Fincorp's assets under management grew 68% year-on-year to Rs. 47,701 crores in Q2 FY26, with 15.6% quarter-on-quarter growth. The company's gross NPA improved to 1.59% from 1.84% in the previous quarter, while Stage 1 assets rose to 97.1%. Net interest margin increased to 8.4% from 8.32%. The promoter infused Rs. 1,500 crores through preferential issue during the quarter. Cost of borrowing dropped 35 basis points to 7.69% as NCD share in total borrowings increased to 27% from 7% a year ago. New product disbursements reached Rs. 750 crores in September 2025, contributing 17% to total disbursements versus 11% in the previous quarter. The company expanded its gold loan branches to 160 from 80 last quarter, targeting 400 branches by March 2026. Consumer durable dealer distribution points increased to 10,000 from 3,000 in June 2025. The company launched 45 AI projects across operations, with 16 currently live. Profit after tax stood at Rs. 74 crores despite significant investments in new businesses and technology. The erstwhile STPL book reduced to 2% of total AUM from 4% in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761565964803,
            "Source": "earnings"
        },
        {
            "Title": "Poonawalla Fincorp Deploys Five New AI Solutions Across HR, Governance, and Compliance Operations",
            "Summary": "Poonawalla Fincorp Limited announced the deployment of five new AI-powered solutions as part of its digital transformation initiative. The solutions include an Early Warning System for workforce risk prediction, a Travel Bot for operational mobility, Regintel for compliance intelligence, an ER Governance Tool for employee relations, and AI-driven Suspicious Transaction Reporting for financial crime compliance. Managing Director & CEO Arvind Kapil stated the company now has 45 AI projects in total, with 13 successfully completed. The new systems are designed to shift operations from reactive to predictive approaches, focusing on areas including anti-money laundering compliance, employee attrition prediction, travel automation, and regulatory query management. Poonawalla Fincorp is a Cyrus Poonawalla Group-promoted NBFC with AUM of ₹47,701 crore and 5,081 employees as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761533800951,
            "Source": "stock"
        },
        {
            "Title": "Poonawalla Fincorp Reports Strong Turnaround with Q2 Profit of 742 Million Rupees",
            "Summary": "Poonawalla Fincorp posted a consolidated net profit of 742 million rupees in Q2, marking a significant turnaround from a loss of 4.7 billion rupees in the same period last year. The company's revenue grew substantially to 15.42 billion rupees compared to 9.9 billion rupees year-over-year, representing strong top-line growth alongside the return to profitability.",
            "Sentiment": "positive",
            "PublishDate": 1760919246365,
            "Source": "earnings"
        },
        {
            "Title": "Poonawalla Fincorp Plans Expansion with 400 New Branches and 6 Product Launches",
            "Summary": "Poonawalla Fincorp is targeting accelerated AUM growth through an expansion strategy that includes opening 400 new branches and launching 6 new products. The company is implementing an AI-first lending model and focusing on technology-led efficiency to drive scalability in its next phase of growth.",
            "Sentiment": "positive",
            "PublishDate": 1760715327525,
            "Source": "stock"
        },
        {
            "Title": "Poonawalla Fincorp Fully Utilizes ₹1,500 Crore Preferential Issue Proceeds",
            "Summary": "Poonawalla Fincorp Limited has fully utilized the entire ₹1,499.98 crore raised through a preferential issue to promoter Rising Sun Holdings Private Limited. The monitoring agency report by CARE Ratings Limited for the quarter ended September 30, 2025, shows complete deployment of funds across three objectives: ₹1,259.98 crore for prepaying/repaying borrowings, ₹230 crore for AUM growth and lending activities, and ₹10 crore for general corporate purposes. The preferential issue was conducted from September 17-18, 2025, with no deviations from the original objects and no unutilized funds remaining at quarter end.",
            "Sentiment": "positive",
            "PublishDate": 1760711560573,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Reports Strong Q2 Performance with 74.20 Crore Net Profit",
            "Summary": "Poonawalla Fincorp Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported a net profit after tax of ₹74.20 crores for the quarter, compared to a loss of ₹471.04 crores in the same quarter last year. For the half year, net profit reached ₹136.80 crores versus a loss of ₹179.40 crores in the previous year. Total income for the quarter was ₹1,542.77 crores, up from ₹996.50 crores year-on-year. Interest income grew to ₹1,402.23 crores from ₹910.74 crores. The company's loan book expanded to ₹43,909.93 crores from ₹32,694.96 crores as of March 2025. During the half year, the company raised ₹1,499.98 crores through preferential issue to Rising Sun Holdings Private Limited and issued commercial papers and non-convertible debentures. Earnings per share improved to ₹0.95 for the quarter and ₹1.76 for the half year.",
            "Sentiment": "positive",
            "PublishDate": 1760699413792,
            "Source": "earnings"
        },
        {
            "Title": "Poonawalla Fincorp Raises ₹3,002 Crore Through Non-Convertible Debentures",
            "Summary": "Poonawalla Fincorp has allotted 300,000 secured, redeemable, rated, listed non-convertible debentures with a face value of ₹100,000 each, raising a total of ₹3,002.10 crores through private placement. The issuance comprises two series: PFL NCD Series 'G1' FY 2025-26 worth ₹2,500 crores with a tenure of 1 year and 161 days offering 7.55% annual interest, and a re-issuance under PFL NCD Series 'D1' FY 2025-26 worth ₹500 crores with a residual tenure of 1 year and 344 days offering 7.5285% annual interest. Both series were allotted on October 15, 2025, with maturity dates of March 25, 2027, and September 24, 2027, respectively. The debentures are secured by first ranking pari passu charge on hypothecated properties and will be listed on BSE's debt market segment. In case of payment delays exceeding three months, the company will pay an additional 2% over the applicable coupon rate until the default is resolved.",
            "Sentiment": "positive",
            "PublishDate": 1760521079907,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Approves ₹3,000 Crore Non-Convertible Debentures Issue",
            "Summary": "Poonawalla Fincorp has approved the issuance of ₹3,000 crore worth of rated non-convertible debentures through private placement. Each debenture will have a face value of ₹1 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1760082084202,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Reports Strong Q2 FY26 Growth with AUM Rising 67.70% Year-on-Year",
            "Summary": "Poonawalla Fincorp reported its Q2 FY26 update showing significant growth in assets under management (AUM). The company's AUM increased by 67.70% year-on-year and 15.40% quarter-on-quarter, reaching approximately ₹47,625 crore. The company maintains solid liquidity of about ₹6,200 crore.",
            "Sentiment": "positive",
            "PublishDate": 1759721954945,
            "Source": "earnings"
        },
        {
            "Title": "Poonawalla Fincorp Allots 3.31 Crore Shares to Promoter Entity for Rs 1,500 Crore",
            "Summary": "Poonawalla Fincorp Limited has allotted 3,31,48,102 equity shares to Rising Sun Holdings Private Limited, a promoter entity, at Rs 452.51 per share through a preferential issue. The allotment, valued at Rs 1,499.98 crore, increases the company's paid-up share capital from Rs 155.84 crore to Rs 162.47 crore, with total equity shares rising from 77.92 crore to 81.24 crore shares. The company received in-principle approval from NSE and BSE for this preferential issue. The newly allotted shares carry the same rights as existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758115687838,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Sees Rs. 89.90 Crore Block Trade on NSE",
            "Summary": "Poonawalla Fincorp Ltd. witnessed a block trade worth Rs. 89.90 crores on the National Stock Exchange. The transaction involved approximately 2,038,720 shares at a price of Rs. 440.95 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1757998019077,
            "Source": "order&deals"
        },
        {
            "Title": "Poonawalla Fincorp Raises ₹1,000 Crore Through Non-Convertible Debentures",
            "Summary": "Poonawalla Fincorp Limited has allotted 100,000 secured, redeemable, rated, listed, non-convertible debentures with a face value of ₹100,000 each, totaling ₹1,000 crore through private placement. The debentures, designated as PFL NCD Series 'F1' FY2025-26, carry a coupon rate of 7.58% per annum and have a tenure of 2 years and 364 days, maturing on September 8, 2028. The debentures will be listed on the debt market segment of BSE Limited and are secured by a first ranking pari passu charge on hypothecated properties. The company's Finance Committee approved the allotment on September 10, 2025. In case of payment delays exceeding three months, the company will pay an additional 2% over the applicable coupon rate until the default is resolved.",
            "Sentiment": "positive",
            "PublishDate": 1757491299764,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Modifies Key Information Document for Non-Convertible Debentures Due to RBI Holiday Change",
            "Summary": "Poonawalla Fincorp Limited's Finance Committee approved a modified draft of the Key Information Document for non-convertible debentures under Series F1 FY2025-26. The modification was necessary following the Reserve Bank of India's announcement changing a public holiday from Friday, September 05, 2025 to Monday, September 08, 2025. The Finance Committee passed the resolution by circulation on September 05, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757070601884,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Approves Private Placement of NCDs Worth Up to ₹1500 Crore",
            "Summary": "Poonawalla Fincorp has approved a private placement of Non-Convertible Debentures (NCDs) with a maximum value of ₹1500 crore. The company has given the green light for this debt fundraising initiative through private placement route.",
            "Sentiment": "positive",
            "PublishDate": 1756976682244,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Denies CEO Role Aimed At Improving Financial Records",
            "Summary": "Poonawalla Fincorp has denied that a CEO role was aimed at improving the company's financial records. The company has issued a statement refuting these claims.",
            "Sentiment": "neutral",
            "PublishDate": 1756126848070,
            "Source": "corporate_governance"
        },
        {
            "Title": "Poonawalla Fincorp Raises ₹350 Crore Through Non-Convertible Debentures",
            "Summary": "Poonawalla Fincorp Limited has allotted 35,000 secured, redeemable, rated, listed, non-convertible debentures with a face value of ₹1,00,000 each, totaling ₹350 crore, through private placement. The debentures, designated as PFL NCD Series 'E1' FY2025-26, carry an interest rate of 7.52% per annum and have a tenure of 2 years and 6 months, maturing on February 25, 2028. The issue comprised a base size of ₹150 crore with a green shoe option of ₹200 crore. The debentures will be listed on the Debt Market Segment of BSE Limited and are secured by a first ranking pari passu charge on hypothecated properties. In case of payment delays exceeding three months, the company will pay an additional 2% over the applicable coupon rate until the default is resolved.",
            "Sentiment": "positive",
            "PublishDate": 1756114563474,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Raises ₹500 Crore Through Secured NCDs",
            "Summary": "Poonawalla Fincorp has raised up to ₹500 crore through a private placement of secured rated non-convertible debentures (NCDs).",
            "Sentiment": "positive",
            "PublishDate": 1755686823497,
            "Source": "stock"
        },
        {
            "Title": "Poonawalla Fincorp Exercises Call Option on Rs 2 Crore Perpetual Bonds for September 2025 Redemption",
            "Summary": "Poonawalla Fincorp Limited has decided to exercise its call option on 40 unsecured non-convertible perpetual bonds worth Rs 2 crore, with each bond valued at Rs 5 lakh. The bonds carry a 12.10% interest rate and were originally issued on September 18, 2015. The company will redeem these bonds on September 18, 2025, with September 3, 2025 set as the record date. The bonds will be redeemed at face value along with accrued interest. The company has the right to exercise this call option after the bonds have run for a minimum period of 10 years from the issue date. If the call option had not been exercised, the coupon rate would have stepped up by 100 basis points to 13.10% annually. The redemption amount will be paid to bondholders by crediting their bank accounts linked to their demat accounts, and the bonds will be fully extinguished after payment.",
            "Sentiment": "neutral",
            "PublishDate": 1755194880636,
            "Source": "corporate_action"
        },
        {
            "Title": "Poonawalla Fincorp Reports 53% YoY AUM Growth, Credit Costs Improve to 2.61%",
            "Summary": "Poonawalla Fincorp's AUM grew 53% year-on-year and 15.8% quarter-on-quarter to Rs. 41,273 crores. Total disbursements increased 13.6% quarter-on-quarter to Rs. 10,651 crores. Credit costs improved by 53 basis points to 2.61% for all businesses, while credit costs for 12 core products excluding STPL stood at 1.43%. The company's NCD share in total borrowings increased from 7% to 24% during the quarter. Net interest margin moderated due to portfolio recalibration, with management expecting NIMs to return to around 9% within 3-4 quarters. The Board approved Rs. 1,500 crores equity capital infusion from promoters at Rs. 452.5 per share. New business launches including Prime PL, Gold Loans, Consumer Durables, Commercial Vehicle Loans, and Education Loans showed healthy momentum. The company expanded its gold loan network to 80 operational branches across Gujarat, Haryana, Rajasthan and Maharashtra, targeting 400 branches by March 2026. GNPA remained stable at 1.84% with net NPA at 0.85%. The company is investing significantly in AI initiatives with 35 projects identified, of which 8 are completed.",
            "Sentiment": "positive",
            "PublishDate": 1753973482184,
            "Source": "earnings"
        },
        {
            "Title": "Poonawalla Fincorp Deploys Four AI Solutions Across Operations and Finance Departments",
            "Summary": "Poonawalla Fincorp Limited, a Cyrus Poonawalla Group-promoted NBFC focused on Consumer and MSME lending, announced the deployment of four AI-led solutions as part of its enterprise-wide digital transformation. The solutions include an Agentic AI powered Data Quality Index (DQI) for operational data integrity, an AI-powered Infrastructure Management Solution to streamline property acquisition for 400 phase-wise branch expansion across Tier 2 and Tier 3 cities, a proprietary Fin-Bot for financial intelligence that delivers precision-driven financial analysis, and an AI-powered Invoice Management System for automated invoice reading and validation. The Infrastructure Management Solution reduces document validation time to under 5 minutes compared to the previous 2-3 day turnaround. Managing Director & CEO Arvind Kapil emphasized that AI is being built as a long-term capability across the organization to enable faster decisions, sharper insights, and stronger outcomes.",
            "Sentiment": "positive",
            "PublishDate": 1753928208900,
            "Source": "stock"
        },
        {
            "Title": "Poonawalla Fincorp Reports 79% Drop in Net Profit Despite Revenue Growth",
            "Summary": "Poonawalla Fincorp reported consolidated net profit of 626 million rupees in Q1, down significantly from 2.92 billion rupees in the same quarter last year. However, the company's revenue grew to 13.14 billion rupees compared to 9.77 billion rupees in the previous year's corresponding quarter, representing a 34% increase.",
            "Sentiment": "negative",
            "PublishDate": 1753662634572,
            "Source": "earnings"
        }
    ]
}