{
    "Symbol": "POWERGRID",
    "ISIN": "INE752E01010",
    "News": [
        {
            "Title": "POWERGRID Credit Profile Revised by Fitch Ratings",
            "Summary": "Fitch Ratings revised POWERGRID's stand-alone credit profile to 'bbb' from 'bbb+' due to analytical recalibration under new criteria. Long-term IDRs remain unchanged at 'BBB-' with stable outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1770917408818,
            "Source": "stocks"
        },
        {
            "Title": "POWERGRID Wins Maharashtra Transmission Project",
            "Summary": "Power Grid Corporation of India Limited has been declared successful bidder for Maharashtra's Pune Region-I transmission project under TBCB, receiving Letter of Intent on February 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770829262784,
            "Source": "co_actions_results"
        },
        {
            "Title": "Powergrid Acquires SR And ER Power Transmission Ltd",
            "Summary": "Power Grid Corporation of India has completed the acquisition of SR And ER Power Transmission Ltd, expanding its transmission infrastructure portfolio through strategic consolidation.",
            "Sentiment": "positive",
            "PublishDate": 1770128057516,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Grid Corporation Block Trade Worth ₹26.85 Crores",
            "Summary": "Power Grid Corporation of India executed a significant NSE block trade involving 952,064 shares at ₹282.05 per share, totaling ₹26.85 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1770095708971,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Grid Commissions 4.5GW Khavda Transmission Project",
            "Summary": "POWERGRID Khavda II-C Transmission Limited successfully commissioned the 4.5GW renewable energy evacuation transmission scheme at Khavda PS under Phase-II, Part C on 31st January, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770036088570,
            "Source": "stocks"
        },
        {
            "Title": "POWERGRID Schedules Q3FY26 Investor Meet on Feb 2",
            "Summary": "Power Grid Corporation of India announces analysts and institutional investors meet for February 2, 2026, at 12:00 Noon IST in Mumbai to present Q3FY26 and 9MFY26 results under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770032513893,
            "Source": "co_actions_results"
        },
        {
            "Title": "POWERGRID Withdraws from PTC India Board",
            "Summary": "POWERGRID's Board approved withdrawal of nominee director from PTC India Limited and relinquishment of promoter rights following Ministry of Power directive dated 16th January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769799206347,
            "Source": "stocks"
        },
        {
            "Title": "POWERGRID Q3FY26 Revenue Jumps 8.7% to ₹11,005 Cr",
            "Summary": "Power Grid Corporation reports strong Q3FY26 results with revenue of ₹11,005.28 crore, up 8.7% YoY. Board approves ₹3.25 interim dividend and ₹32,000 crore borrowing proposal for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769789948952,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Grid Q3 Outlook: Muted Growth Expected",
            "Summary": "Power Grid Corporation of India expected to report modest Q3 performance with marginal revenue and profit growth offset by margin pressure from competitive bidding shift.",
            "Sentiment": "neutral",
            "PublishDate": 1769425947677,
            "Source": "co_actions_results"
        },
        {
            "Title": "POWERGRID Promotes 12 Senior Officials to Executive Director",
            "Summary": "Power Grid Corporation of India's board approved promotion/appointment of 12 senior officials as Executive Directors effective January 25, 2026, including CEOs of POWERTEL, PESL, and EESL subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1769357947428,
            "Source": "stocks"
        },
        {
            "Title": "POWERGRID Board Meet Jan 30 for Q3FY26 Results",
            "Summary": "POWERGRID announces Board meeting on January 30, 2026 to consider Q3FY26 unaudited financial results and second interim dividend declaration with record date set for February 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769172819726,
            "Source": "co_actions_results"
        },
        {
            "Title": "POWERGRID Approves ₹914 Cr Cold Spare Equipment Plan",
            "Summary": "Power Grid Corporation's Committee of Directors approves procurement of cold spare transformers and reactors worth ₹913.99 crore across three regional power committees with 30-month implementation timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768921234355,
            "Source": "stocks"
        },
        {
            "Title": "6 Strong Stocks Trading Near 52-Week Lows",
            "Summary": "Power Grid, ABB India, Sun Pharma and three other fundamentally strong companies are trading close to their 52-week lows despite solid business fundamentals and growth metrics.",
            "Sentiment": "neutral",
            "PublishDate": 1768915985860,
            "Source": "stocks"
        },
        {
            "Title": "Power Grid Subsidiary Commissions Rajasthan Project",
            "Summary": "POWERGRID Bhadla Sikar Transmission Limited successfully commissioned 8.1GW solar evacuation transmission system in Rajasthan on January 14, 2026, with commercial operation notification received.",
            "Sentiment": "positive",
            "PublishDate": 1768585433315,
            "Source": "stocks"
        },
        {
            "Title": "POWERGRID Wins 3 GW Karnataka Transmission Projects",
            "Summary": "Power Grid Corporation of India secures major renewable energy transmission projects in Karnataka worth 3 GW capacity at Davanagere and Bellary locations with 24-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767943175205,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Grid secures Karnataka transmission project",
            "Summary": "Power Grid Corporation secured an inter-state transmission project in Karnataka to evacuate 3 GW renewable energy from Davanagere and Bellary under BOOT model, driving shares up 2%.",
            "Sentiment": "positive",
            "PublishDate": 1767942366448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Grid Corp Sees ₹39.77 Cr NSE Block Trade",
            "Summary": "Power Grid Corporation of India witnessed a significant block trade on NSE worth ₹39.77 crores involving 1,514,925 shares at ₹262.55 per share, indicating institutional interest in the transmission utility stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767939062922,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Grid wins Karnataka renewable energy project",
            "Summary": "Power Grid Corporation of India secures inter-state transmission project for 3 GW renewable energy integration in Karnataka's Davanagere and Bellary regions under TBCB framework.",
            "Sentiment": "positive",
            "PublishDate": 1767935205190,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Grid Corp Sees ₹21.58 Cr NSE Block Trade",
            "Summary": "Power Grid Corporation of India witnessed a significant block trade on NSE worth ₹21.58 crores involving 817,608 shares at ₹264.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767778095693,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Grid achieves 50% green energy milestone",
            "Summary": "Power Grid Corporation of India Limited has achieved a major sustainability milestone by meeting 50% of its energy consumption through green energy initiatives including rooftop solar installations and Solar PV plant at Nagda.",
            "Sentiment": "positive",
            "PublishDate": 1767273474635,
            "Source": "stocks"
        },
        {
            "Title": "Power Grid wins 2,000 MWh battery storage project",
            "Summary": "Power Grid Corporation of India secured a major 2,000 MWh battery energy storage project in Andhra Pradesh under competitive bidding, receiving the Letter of Award on December 29.",
            "Sentiment": "positive",
            "PublishDate": 1767150529353,
            "Source": "stocks"
        },
        {
            "Title": "Power Grid Gets Nod to Merge 13 Units Into 2",
            "Summary": "Power Grid Corporation of India receives approval to consolidate 13 business units into 2 entities, aimed at improving operational efficiency and streamlining corporate structure.",
            "Sentiment": "positive",
            "PublishDate": 1766373264211,
            "Source": "stocks"
        },
        {
            "Title": "POWERGRID Subsidiary Launches Khavda Phase-II Project",
            "Summary": "Power Grid Corporation of India's subsidiary has commenced the Khavda Phase-II Part-B Interstate Transmission Project, marking a significant infrastructure development milestone.",
            "Sentiment": "positive",
            "PublishDate": 1766063755707,
            "Source": "stocks"
        },
        {
            "Title": "POWERGRID Commissions WRES-XXV Project",
            "Summary": "Power Grid Corporation successfully commissioned the Western Region Expansion Scheme-XXV project on November 12, 2025, with commercial operation notification received on December 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765958920833,
            "Source": "stocks"
        },
        {
            "Title": "Power Grid Approves ₹1,227 Cr HVDC System Upgrade",
            "Summary": "Power Grid Corporation board approves ₹1,226.93 crore investment for Bhadrawati HVDC back-to-back system upgrade with 36-month completion timeline, strengthening transmission infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1765958647099,
            "Source": "stocks"
        },
        {
            "Title": "POWERGRID Wins SR-ER Grid Project Under TBCB",
            "Summary": "Power Grid Corporation receives Letter of Intent for Inter-Regional Strengthening project between Southern and Eastern grids on BOOT basis with 765kV transmission lines.",
            "Sentiment": "positive",
            "PublishDate": 1765815070073,
            "Source": "co_actions_results"
        },
        {
            "Title": "PowerGrid Plans Major Subsidiary Merger Restructuring",
            "Summary": "Power Grid Corporation announces board meeting on December 20, 2025, to approve amalgamation of 13 wholly owned subsidiaries into 2 other subsidiaries. Trading window closed from December 11-22.",
            "Sentiment": "neutral",
            "PublishDate": 1765384866428,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Grid Corporation Fined Rs 10.86 Lakh by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "Power Grid Corporation of India Limited received fines of Rs 5,42,800 each from BSE and NSE for non-compliance with board composition requirements during the quarter ended September 30, 2025. The company has requested waiver of the fines, citing that director appointments vest with the President of India and the matter has been taken up with the Ministry of Power for filling vacant Independent Director positions.",
            "Sentiment": "negative",
            "PublishDate": 1764411215260,
            "Source": "corporate_governance"
        },
        {
            "Title": "POWERGRID Partners with Nepal Electricity Authority for Cross-Border Transmission Infrastructure",
            "Summary": "POWERGRID entered into Joint Venture and Shareholders Agreements with Nepal Electricity Authority on October 29, 2025, to form two JVCs for developing high-capacity cross-border power transmission infrastructure. The partnership will develop 400kV transmission links between Inaruwa-New Purnea and Lamki-Bareilly, with POWERGRID holding 51% stake in the Indian JVC and 49% in the Nepalese JVC.",
            "Sentiment": "positive",
            "PublishDate": 1763797777494,
            "Source": "order&deals"
        },
        {
            "Title": "Power Grid Approves Rs 3,800 Crore Bond Issuance Plan",
            "Summary": "Power Grid's committee of directors approved raising up to Rs 3,800 crore through private placement bonds, with a base size of Rs 1,000 crore and green shoe option of Rs 2,800 crore. The bonds will be redeemable at par in 10 equal annual installments with yearly interest payments.",
            "Sentiment": "positive",
            "PublishDate": 1763379633216,
            "Source": "corporate_action"
        },
        {
            "Title": "PowerGrid Reports Flat Revenue Growth Despite Rs 4,587 Crore Capitalization in Q2 FY26",
            "Summary": "PowerGrid Corporation of India reported total income of Rs 23,115 crores and profit after tax of Rs 7,197 crores for the first half of FY26. The company capitalized Rs 4,587 crores worth of projects compared to Rs 4,006 crores in the previous year. Despite project commissioning, revenue remained relatively flat due to older projects completing their 12-year depreciation cycle, reducing revenue by approximately 9% from depreciation and interest components. The company faces challenges with right-of-way acquisition delays but expects to commission Rs 20,000 crores worth of projects by March 2026. PowerGrid has projects worth Rs 1,52,000 crores in hand, with Rs 1,03,000 crores from TBCB projects. The company guided for capex of Rs 28,000 crores in FY26, Rs 35,000 crores in FY27, and Rs 45,000 crores in FY28. Equipment supply constraints exist for transformers and HVDC equipment, with delivery times exceeding one year for transformers.",
            "Sentiment": "neutral",
            "PublishDate": 1762986152429,
            "Source": "earnings"
        },
        {
            "Title": "POWERGRID Schedules Board Meeting for Non-Convertible Debenture Issue",
            "Summary": "Power Grid Corporation of India Limited has scheduled a Committee of Directors meeting for November 17, 2025, to consider issuing unsecured, non-convertible, non-cumulative, redeemable, taxable bonds under the POWERGRID Bond-LXXXIII (83) Issue through private placement. The company's trading window will remain closed from November 12-19, 2025, and will reopen on November 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762891843916,
            "Source": "corporate_action"
        },
        {
            "Title": "PowerGrid Corporation Changes Joint Statutory Auditors for FY 2025-26",
            "Summary": "PowerGrid Corporation of India Limited announced changes to its joint statutory auditors for Financial Year 2025-26. The Comptroller and Auditor General of India (CAG) appointed M/s. ASA & Associates LLP, New Delhi, as joint statutory auditors effective November 8, 2025, replacing M/s. Rama K Gupta & Co., New Delhi. The outgoing auditor firm resigned with immediate effect due to being allotted another statutory audit assignment by CAG for the same financial year. ASA & Associates LLP was formed in 1991 and is a first-generation CA firm with head office in Delhi and branches at 8 locations in India, having more than 34 years of experience with over 30 partners/directors. The appointment term is for one year covering FY 2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1762615768361,
            "Source": "corporate_governance"
        },
        {
            "Title": "Power Grid Corporation Sets Ex-Dividend Date for Rs 4.5 Per Share Interim Dividend",
            "Summary": "Power Grid Corporation of India declared a first interim dividend of Rs 4.50 per equity share for financial year 2025-26, representing 45% of the face value of Rs 10 per share. The company's board approved this dividend during a meeting held on November 3, 2025, alongside unaudited financial results for the quarter and half-year ended September 30, 2025. The record date and ex-dividend date are both set for November 10, meaning investors must purchase shares before this date to be eligible for the dividend. The dividend payment will be disbursed to eligible shareholders on December 1. Other companies including Ajanta Pharma, Aurionpro Solutions, Godfrey Phillips India, Route Mobile, and Transcorp International are also trading ex-dividend on the same date.",
            "Sentiment": "neutral",
            "PublishDate": 1762483610305,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Grid Announces Multi-Year Capital Expenditure and Capitalization Guidance",
            "Summary": "Power Grid has provided guidance for its capital expenditure and capitalization plans across multiple fiscal years. For FY26, the company projects capitalization of INR 20,000 crores and capital expenditure of INR 28,000-30,000 crores. FY27 guidance includes capital expenditure of INR 35,000 crores and capitalization of INR 25,000-26,000 crores. For FY28, the company expects capital expenditure to reach INR 45,000 crores with capitalization of INR 28,000 crores. These projections were shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1762401111515,
            "Source": "stock"
        },
        {
            "Title": "PowerGrid Reports Strong H1 FY26 Performance with Record Works in Hand",
            "Summary": "PowerGrid Corporation of India presented its investor update showing total income of ₹23,115 crore and profit after tax of ₹7,197 crore for H1 FY26. The company maintains system availability of 99.83% and operates 1,81,054 circuit kilometers of transmission lines with 1,87,516 MVA transformation capacity. PowerGrid commissioned 857 circuit kilometers of transmission lines and 30,555 MVA transformation capacity during the period. The company achieved record works in hand of ₹1,52,287 crore, with TBCB works showing 48% CAGR growth from FY20-H1FY26. Major developments include successful testing of India's first insulated cross arms for 400kV lines and launch of the country's first 220kV mobile GIS bay. PowerGrid received in-principle approval for Sasaram HVDC project upgradation at ₹3,440 crore cost. The company maintains strong credit ratings of AAA from domestic agencies and investment grade ratings from international agencies. Debt-to-equity ratio stands at 58:42 with return on net worth at 7.27%.",
            "Sentiment": "positive",
            "PublishDate": 1762268720999,
            "Source": "stock"
        },
        {
            "Title": "Powergrid Plans ₹1.3 Lakh Crore Capital Investment Over Five Years",
            "Summary": "Powergrid has announced plans for a massive capital expenditure of ₹1.3 lakh crore over five years. The investment aims to meet rising power demand and support renewable energy integration. The company's focus areas include digital grid modernization and green energy corridors. Powergrid maintains sustained dividend growth and holds Aaa credit ratings.",
            "Sentiment": "positive",
            "PublishDate": 1762267767886,
            "Source": "stock"
        },
        {
            "Title": "Power Grid Corp Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Power Grid Corp announced Q2 consolidated results showing net profit of 35.7 billion rupees, down from 38 billion rupees in the same period last year. Revenue increased to 114.8 billion rupees compared to 113 billion rupees year-over-year. EBITDA declined to 91 billion rupees from 97 billion rupees, while EBITDA margin compressed to 79.42% from 86.02% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762178109176,
            "Source": "earnings"
        },
        {
            "Title": "Power Grid Corp Announces Rs 4.50 Interim Dividend and Plans Rs 60 Billion SBI Funding",
            "Summary": "Power Grid Corporation has announced an interim dividend of Rs 4.50 per share for its shareholders. Additionally, the company plans to secure up to Rs 60 billion in funding from State Bank of India (SBI).",
            "Sentiment": "positive",
            "PublishDate": 1762175263257,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Grid Corp Reports Decline in Q2 Financial Performance",
            "Summary": "Power Grid Corp reported quarterly results showing EBITDA of 80 billion rupees compared to 88 billion rupees in the same period last year. The EBITDA margin decreased to 80.09% from 85.64% year-over-year. Net profit fell to 35.5 billion rupees from 37 billion rupees, while revenue declined to 99.99 billion rupees from 102.6 billion rupees compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762174815293,
            "Source": "earnings"
        },
        {
            "Title": "Power Grid Corporation to Announce Q2 Results on November 3, Board to Consider Interim Dividend",
            "Summary": "Power Grid Corporation of India will announce its financial results for the quarter and half-year ended September 30, 2025, on November 3, 2025. The Board of Directors will also consider declaring the first interim dividend for financial year 2025-26, with the record date set for November 10. The company will host an earnings call on November 4 at 4 p.m. IST. In the previous quarter, Power Grid reported a 3% decline in net profit to Rs 3,630.5 crore, while revenue increased 1.7% to Rs 11,196.20 crore. The stock has declined 0.47% in the past five sessions and is down 7.17% year-to-date, closing at Rs 288.15 on Friday.",
            "Sentiment": "neutral",
            "PublishDate": 1762049798261,
            "Source": "earnings"
        },
        {
            "Title": "Power Grid Corporation Block Trade Worth Rs. 120.98 Crores on NSE",
            "Summary": "Power Grid Corporation of India Ltd. executed a block trade on NSE involving approximately 4,163,114 shares at Rs. 290.60 per share, totaling Rs. 120.98 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1761281481027,
            "Source": "order&deals"
        },
        {
            "Title": "Power Grid Corporation Acquires SR WR Power Transmission Limited for Rs. 11.29 Crore",
            "Summary": "Power Grid Corporation of India Limited has acquired SR WR Power Transmission Limited for approximately Rs. 11.29 crore through a tariff-based competitive bidding process. The acquisition includes 50,000 equity shares at Rs. 10 per share along with the company's assets and liabilities. POWERGRID emerged as the successful bidder and acquired 100% shareholding in the project SPV, which was incorporated on July 1, 2025. The acquired entity will establish inter-regional power transmission infrastructure between Southern and Western grids under a build, own, operate and transfer (BOOT) model. The project involves 765 kV double circuit transmission lines traversing Karnataka and Maharashtra states with associated line bays. SR WR Power Transmission Limited operates in the same business as POWERGRID - power transmission - and has not yet started commercial operations or recorded any turnover. The acquisition requires future approvals from Central Electricity Regulatory Commission for transmission license and adoption of transmission charges.",
            "Sentiment": "positive",
            "PublishDate": 1760700873902,
            "Source": "order&deals"
        },
        {
            "Title": "Power Grid Corporation Sees Rs. 83.83 Crore Block Trade on NSE",
            "Summary": "Power Grid Corporation of India executed a block trade worth Rs. 83.83 crores on the National Stock Exchange. The transaction involved approximately 2,943,301 shares at a price of Rs. 284.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759473961532,
            "Source": "order&deals"
        },
        {
            "Title": "POWERGRID Secures Inter-State Transmission System Project Contract",
            "Summary": "POWERGRID has won a bid for an inter-state transmission system project. The company successfully secured this infrastructure contract in the power transmission sector.",
            "Sentiment": "positive",
            "PublishDate": 1759238217045,
            "Source": "stock"
        },
        {
            "Title": "POWERGRID Approves ₹705 Crore Investment in Communication System and Emergency Restoration Infrastructure",
            "Summary": "POWERGRID's Committee of Directors on Investment on Projects approved two infrastructure projects worth ₹705.51 crore. The first project involves implementing a VOIP communication system for grid operations across five regions (NR, NER, SR, WR, ER) at ₹209.68 crore, scheduled for commissioning by August 23, 2026. The second project focuses on disaster preparedness through procurement of 20 sets (300 towers) of Emergency Restoration System under Make in India initiative at ₹495.83 crore, to be commissioned by April 19, 2027.",
            "Sentiment": "positive",
            "PublishDate": 1758904332212,
            "Source": "stock"
        },
        {
            "Title": "Power Grid Corporation Acquires Davanagere Power Transmission Limited for Rs 6.53 Crore",
            "Summary": "Power Grid Corporation of India Limited has acquired Davanagere Power Transmission Limited (DPTL) on September 24, 2025, for approximately Rs 6.53 crore. The acquisition was completed through tariff-based competitive bidding, where POWERGRID emerged as the successful bidder. DPTL is a project special purpose vehicle established to develop transmission system strengthening at Davanagere for integration of renewable energy generation in Karnataka. The project involves augmentation works at an under-construction sub-station in Karnataka and will operate on a build, own, operate and transfer (BOOT) basis. POWERGRID acquired 100% shareholding including 50,000 equity shares at Rs 10 each, along with DPTL's assets and liabilities. DPTL was incorporated on June 26, 2025, by the Bid Process Coordinator - REC Power Development and Consultancy Limited and has not yet started commercial operations. The acquisition price is subject to adjustment based on DPTL's audited accounts as of the acquisition date.",
            "Sentiment": "positive",
            "PublishDate": 1758723030926,
            "Source": "order&deals"
        },
        {
            "Title": "Power Grid Corporation Wins Inter-State Transmission Project in Madhya Pradesh",
            "Summary": "Power Grid Corporation of India Limited has been declared the successful bidder for an inter-state transmission system project under tariff-based competitive bidding. The project involves augmentation of transformation capacity and implementation of line bays at Mandsaur substation for renewable energy interconnection on a Build, Own, Operate and Transfer basis. The company received the Letter of Intent on September 19th, 2025. The project comprises augmentation works at the under-construction Mandsaur substation in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1758284931573,
            "Source": "stock"
        },
        {
            "Title": "Power Grid Corporation Block Trade Worth ₹191.73 Crores Executed on NSE",
            "Summary": "Power Grid Corporation of India executed a block trade on the National Stock Exchange involving 6,644,685 shares at ₹288.55 per share, totaling ₹191.73 crores. The transaction represents a significant volume of shares traded at the specified price point.",
            "Sentiment": "neutral",
            "PublishDate": 1758175541926,
            "Source": "order&deals"
        },
        {
            "Title": "Power Grid Wins Inter-State Transmission Project Despite Share Price Decline",
            "Summary": "Power Grid Corporation of India secured a contract to establish an inter-state transmission system across Uttar Pradesh and Madhya Pradesh, receiving the Letter of Intent on September 16 under tariff-based competitive bidding. The project includes setting up a 765 kV sub-station at Prayagraj and transmission lines across both states to strengthen the inter-regional transmission system. Despite this project win, shares fell 0.64% to ₹286.50 on NSE due to investor caution following disappointing quarterly results. Net profit rose 7.1% to ₹3,653 crore but missed estimates of ₹3,784 crore. Revenue declined 1.4% to ₹9,928 crore, falling short of ₹11,147 crore expectations. EBITDA dropped 7.2% to ₹8,117 crore with margins narrowing to 81.76% from 86.85%. Transmission revenue remained flat at ₹10,695 crore, while consultancy revenue doubled to ₹405.9 crore and telecom revenue increased 18% to ₹289.5 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1758099421050,
            "Source": "order&deals"
        }
    ]
}