{
    "Symbol": "POWERMECH",
    "ISIN": "INE211R01019",
    "News": [
        {
            "Title": "Power Mech Projects Q3FY26 QIP Monitoring Report",
            "Summary": "Power Mech Projects Limited submitted monitoring agency report for Q3FY26 showing Rs. 28.78 crore utilization towards coal washery installation, with Rs. 142.92 crore remaining unutilized from Rs. 350 crore QIP.",
            "Sentiment": "neutral",
            "PublishDate": 1769764912766,
            "Source": "stocks"
        },
        {
            "Title": "Power Mech Projects Surges 5% on ₹3,126 Cr BESS Order",
            "Summary": "Power Mech Projects shares jumped 5% after subsidiary PM Green secured a ₹3,126 crore order from WBSEDCL for 250 MW/1,000 MWh Battery Energy Storage System at Goaltore with 15-year O&M contract.",
            "Sentiment": "positive",
            "PublishDate": 1767943873649,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Mech Projects wins ₹3,126 cr BESS order",
            "Summary": "Power Mech Projects' subsidiary PM Green secures major battery storage contract from WBSEDCL for 250 MW/1,000 MWh facilities in West Bengal under BOO model with 100% off-take guarantee.",
            "Sentiment": "positive",
            "PublishDate": 1767936572168,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Mech Projects Wins ₹1,563 Cr WBSEDCL Contract",
            "Summary": "Power Mech Projects secures major 250 MW/1,000 MWh energy storage project from WBSEDCL worth ₹1,563 crores, with potential to reach ₹3,126 crores including expansion option.",
            "Sentiment": "positive",
            "PublishDate": 1767922575906,
            "Source": "co_actions_results"
        },
        {
            "Title": "Power Mech Wins ₹1,563 Cr BESS Order from WBSEDCL",
            "Summary": "Power Mech Projects' subsidiary PM Green secured a major Battery Energy Storage System contract worth ₹1,563 crores from West Bengal State Electricity Distribution Company Limited for 1 GWh capacity.",
            "Sentiment": "positive",
            "PublishDate": 1767895490512,
            "Source": "co_actions_results"
        },
        {
            "Title": "PowerMech Projects Reports 19% Revenue Growth in Q2 FY26, Targets INR 10,000 Crores New Orders",
            "Summary": "PowerMech Projects Limited reported total income of INR 1,249 crores for Q2 FY26, marking a 19% increase from INR 1,046 crores in Q2 FY25, with EBITDA rising 18% to INR 158 crores and PAT growing 12% to INR 78 crores. The company secured new orders worth INR 1,042 crores during the quarter and maintains its target of securing INR 10,000 crores in new orders by March 2026, having already achieved approximately 49% of this annual target.",
            "Sentiment": "positive",
            "PublishDate": 1763647326589,
            "Source": "earnings"
        },
        {
            "Title": "PowerMech Projects Seeks Shareholder Approval for Employee Stock Option Plan and Increased Borrowing Limits",
            "Summary": "PowerMech Projects Limited has issued a postal ballot notice seeking shareholder approval for implementing an Employee Stock Option Plan-2026 involving 10,00,000 options and increasing borrowing powers from ₹5,000 crores to ₹7,500 crores. The e-voting period runs from November 21, 2025, to December 20, 2025, with resolutions aimed at employee retention and meeting increased fund requirements for expansion and operations.",
            "Sentiment": "positive",
            "PublishDate": 1763625529515,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Mech Projects Revises FY26 Revenue Target to ₹6,200-6,300 Crore, Projects Strong Growth Through FY27",
            "Summary": "Power Mech Projects has adjusted its FY26 revenue forecast to ₹6,200-6,300 crore, down from its original target of ₹6,500 crore, though still representing 18% growth. The company projects accelerated growth of 20-25% in FY27, targeting revenue of ₹7,500-8,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763091866764,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects Reports Record Order Book, Targets Double-Digit Growth in FY26",
            "Summary": "Power Mech Projects announced strong execution visibility backed by a record order book. The company is diversifying its operations into industrial, civil, and railway projects while pursuing aggressive bidding strategies for renewable energy and water infrastructure works. Management is focusing on working capital optimization and scaling overseas subsidiary operations. The company expressed confidence in achieving double-digit growth in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762960794917,
            "Source": "stock"
        },
        {
            "Title": "Power Mech Projects Reports 16.5% Growth in Q2 Net Profit to 781.1 Million Rupees",
            "Summary": "Power Mech Projects reported consolidated net profit of 781.1 million rupees in Q2, up from 670.7 million rupees in the same period last year. Revenue increased to 12.38 billion rupees from 10.35 billion rupees year-over-year. EBITDA rose to 1.47 billion rupees compared to 1.24 billion rupees previously. However, EBITDA margin declined slightly to 11.88% from 11.94% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762783692882,
            "Source": "earnings"
        },
        {
            "Title": "PowerMech Projects Submits QIP Monitoring Report for Quarter Ended September 2025",
            "Summary": "PowerMech Projects Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its Qualified Institutional Placement (QIP) worth Rs. 350 crores. CARE Ratings Limited, serving as the monitoring agency, reported that the company utilized Rs. 32 crore during the quarter towards payments for washery installation. The net proceeds from the QIP were Rs. 343 crores, with Rs. 103.40 crores already utilized for working capital debt prepayment and general corporate purposes. The remaining amount of Rs. 240 crores is designated for coal washery installation by financial year 2026. The company has Rs. 171.70 crores outstanding in fixed deposits and monitoring accounts. CARE Ratings noted delays in receiving approvals for coal washery installation for the Tasra MDO project, with approvals expected by June 2025. No deviations from the disclosed objects were reported.",
            "Sentiment": "neutral",
            "PublishDate": 1762204556960,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Mech Projects Wins ₹2500+ Crore BHEL Contract for Singareni Thermal Power Project",
            "Summary": "Power Mech Projects has secured a contract worth over ₹2500 crores from BHEL for EPC (Engineering, Procurement, and Construction) work at the Singareni Super Thermal Power Project. The project is scheduled to be completed within 38 months.",
            "Sentiment": "positive",
            "PublishDate": 1760505892415,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures ₹371 Crore Contract",
            "Summary": "Power Mech Projects has secured a contract worth ₹371 crore. The company announced this new business win, which represents a significant order for the organization.",
            "Sentiment": "positive",
            "PublishDate": 1756359920162,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Reports 28% Revenue Growth to INR 1,304 Crores in Q1 FY26",
            "Summary": "Power Mech Projects Limited reported total income of INR 1,304 crores for Q1 FY26, representing a 28% increase from INR 1,016 crores in Q1 FY25. EBITDA grew 48% to INR 182 crores, while PAT increased 31% to INR 81 crores. EBITDA margin improved from 12.1% to 13.95%. The quarterly performance was significantly boosted by exceptional revenues of INR 288.53 crores from the Uttarakhand Riverbed Mineral project, which contributed INR 55 crores to PAT. The company secured fresh orders worth INR 1,270 crores during the quarter and maintains a total order backlog of INR 53,972 crores. Key new orders included the Telangana Yadadri project worth INR 972 crores and a solar project in Bihar worth INR 159 crores. The company has set a revenue target of INR 6,500 crores for FY26, representing 25% growth, and aims to secure INR 10,000 crores in new orders. Mining operations commenced at the Kotre Basantpur MDO project in April 2025, while the Kalyaneswari Tasra project produced 7.61 lakh tons of coal. The company faces challenges including limited washery capacity constraining coal offtake and delayed payments in water projects.",
            "Sentiment": "positive",
            "PublishDate": 1755601243311,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects Expands Into Battery Storage, Sets ₹6,500 Crore Revenue Target for FY26",
            "Summary": "Power Mech Projects is expanding into battery energy storage and green energy sectors, with management recently traveling to China to explore battery supply partnerships. The company has set a revenue target of ₹6,500 crore for FY26, representing 25% annual growth, while maintaining EBITDA margins at FY25 levels. Power Mech aims to secure ₹10,000 crore in new orders by March 2026, having already secured ₹1,882 crore. The company provided long-term margin guidance of 22% by 2028, with average margins of 15-16% expected until then. For mining operations specifically, the company anticipates 22% margins at peak capacity by 2028 and 10-15% margins in the interim period.",
            "Sentiment": "positive",
            "PublishDate": 1755054871148,
            "Source": "stock"
        },
        {
            "Title": "Power Mech Projects Releases Q1 FY26 Investor Presentation Showing 28% Revenue Growth",
            "Summary": "Power Mech Projects Limited released an investor presentation for the quarter ended June 30, 2025. The company reported total revenue of Rs. 1,304 crores in Q1 FY26, representing 28% year-over-year growth from Rs. 1,016 crores in Q1 FY25. EBITDA increased 48% to Rs. 182 crores with margin expansion to 13.95% from 12.10% in the previous year. PAT after non-controlling interest was Rs. 53 crores compared to Rs. 58 crores in Q1 FY25. The company maintains a strong order book of Rs. 53,972 crores as of June 30, 2025, including two major MDO contracts worth Rs. 9,294 crores and Rs. 30,383 crores executable over 25 and 28 years respectively. Power Mech operates across power, infrastructure, mining, and international markets with 164 ongoing projects including 61 O&M/AMC projects domestically and 22 overseas projects.",
            "Sentiment": "positive",
            "PublishDate": 1754926061632,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects Reports Mixed Q1 Results with Revenue Growth but Lower Profit",
            "Summary": "Power Mech Projects reported Q1 revenue of 12.93 billion rupees, up from 10.07 billion rupees year-over-year. EBITDA increased to 1.71 billion rupees from 1.14 billion rupees, with EBITDA margin improving to 13.22% from 11.28%. However, consolidated net profit declined to 525 million rupees compared to 601.3 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754652239586,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects Approves Q1 2025 Results and Key Board Appointments",
            "Summary": "Power Mech Projects Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company made three significant leadership appointments: Bontha Prasada Rao as Independent Director for a 3-year term, Rohit Sajja as Wholetime Director for 5 years, and re-appointed Kishore Babu Sajja as Managing Director for another 5-year term starting April 1, 2026. Bontha Prasada Rao, aged 71, brings extensive experience as the former Chairman and Managing Director of BHEL from 2009 to 2015. Rohit Sajja, who holds an MBA from Oxford University, serves as President (Business Development & Operations) and is the son of Managing Director Kishore Babu Sajja. All appointments are subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1754651966808,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Mech Projects: Secures Orders Worth Rs 551 Crore",
            "Summary": "Power Mech Projects has won two new orders totaling Rs 551.35 crore. The larger order, valued at Rs 498.39 crore, is from SJVN Thermal for a power project in Bihar. The second order, worth Rs 52.96 crore, is from Jhabua Power for O&M services in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1752553116000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures Multiple Orders Worth 5.5 Billion Rupees",
            "Summary": "Power Mech Projects has announced securing multiple orders with a total value of 5.5 billion rupees. The company has not provided specific details about the nature of these orders or the clients involved.",
            "Sentiment": "positive",
            "PublishDate": 1752538923000,
            "Source": "default"
        },
        {
            "Title": "Power Mech Projects: Secures ₹551 Crore O&M Contracts",
            "Summary": "Power Mech Projects has won two operation and maintenance contracts totaling ₹551.35 crore. The larger order of ₹498.39 crore is from SJVN Thermal for a power project in Bihar, while a ₹52.96 crore contract is from Jhabua Power for a unit in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1752505131000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures Multiple Contracts Worth 5.5 Billion Rupees",
            "Summary": "Power Mech Projects has announced winning multiple contracts with a total value of 5.5 billion rupees. The nature and specifics of these contracts are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752498648000,
            "Source": "default"
        },
        {
            "Title": "Power Mech Projects Secures Solar Power Orders Worth 1.59 Billion Rupees",
            "Summary": "Power Mech Projects has secured solar power orders from Bihar State Power Generation Company. The total order value is 1.59 billion rupees. No further details about the specific nature of the orders or project timelines were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750983028000,
            "Source": "default"
        },
        {
            "Title": "Power Mech Projects: Secures ₹159 Crore Solar Contracts in Bihar",
            "Summary": "Power Mech Projects has won solar power contracts worth ₹159 crore from Bihar State Power Generation Company Limited under PM-KUSUM scheme. The projects, totaling 13.66 MW capacity, will be executed in three locations: Rajoun, Sakahara, and Sambhuganj. The company will design, install, and maintain grid-connected distributed solar power plants with a 25-year PPA.",
            "Sentiment": "positive",
            "PublishDate": 1750948839000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures Solar Power Contracts Worth 1.59 Billion Rupees",
            "Summary": "Power Mech Projects has won solar power contracts from Bihar State Power Generation Company. The contracts are valued at 1.59 billion rupees. The news indicates a significant business development for Power Mech Projects in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1750946096000,
            "Source": "default"
        },
        {
            "Title": "Power Mech Projects Targets Significant Growth and Order Inflow",
            "Summary": "Power Mech Projects has announced ambitious growth targets for the upcoming year. The company is aiming for a 20% to 25% growth, with expected revenue between Rs. 7,800 crore to Rs. 8,000 crore. They anticipate a significant increase in order inflow, particularly from the power sector across various segments including O&M, mechanical, civil construction, and BOP EPC. For the current year, Power Mech Projects is targeting an order inflow of around Rs. 10,000 crore and projecting approximately 25% revenue growth, which is roughly 42% of their existing order book of Rs. 14,387 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748315623000,
            "Source": "default"
        },
        {
            "Title": "Power Mech Projects Sets Revenue Growth and Margin Targets",
            "Summary": "Power Mech Projects expects to achieve 25% year-on-year revenue growth. The company anticipates stable margins with potential upside depending on the mining segment's contribution. Power Mech has set a revenue target of Rs 6,500 crore for FY '26, contingent on the progress of their MDO business. The EBITDA margin is expected to remain consistent with FY '25 levels.",
            "Sentiment": "positive",
            "PublishDate": 1748315468000,
            "Source": "default"
        },
        {
            "Title": "Power Mech Projects Reports Q4 Financial Results and Dividend",
            "Summary": "Power Mech Projects announced its Q4 consolidated net profit of 1.2 billion rupees, up from 844.1 million rupees year-over-year and 820 million rupees quarter-over-quarter. The company's Q4 revenue increased to 18.5 billion rupees from 13.02 billion rupees year-over-year. Additionally, the company has recommended a dividend of 1.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747955872000,
            "Source": "default"
        },
        {
            "Title": "Power Mech Projects Recommends Dividend",
            "Summary": "Power Mech Projects has recommended a dividend of 1.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747921715000,
            "Source": "result"
        },
        {
            "Title": "Power Mech Projects Reports Q4 Financial Results",
            "Summary": "Power Mech Projects has announced its Q4 financial results. The company's EBITDA increased to 2.16 billion rupees from 1.5 billion rupees year-over-year. The EBITDA margin improved to 11.66% from 11.49% in the same period. Consolidated net profit rose to 1.2 billion rupees from 844.1 million rupees year-over-year and 820 million rupees quarter-over-quarter. Revenue for Q4 grew to 18.5 billion rupees from 13.02 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747921674000,
            "Source": "result"
        },
        {
            "Title": "Power Mech Projects: Q4 Profit Surges 54%, Dividend Declared",
            "Summary": "Power Mech Projects reported a 53.8% YoY increase in Q4 net profit to ₹129.8 crore. Revenue jumped 42.4% to ₹1,853.3 crore. EBITDA rose 44.3% to ₹215.7 crore with margins at 11.6%. The company declared a final dividend of ₹1.25 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1747920781000,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects: Secures ₹972 Crore Township Project in Telangana",
            "Summary": "Power Mech Projects Ltd. has won a ₹971.98 crore integrated township project from Telangana Power Generation Corporation Ltd. at Yadadri Thermal Power Station, Nalgonda district. The project includes construction of residential quarters, public buildings, infrastructure development, and road construction.",
            "Sentiment": "positive",
            "PublishDate": 1747117297000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures 972 Crore Rupee Order",
            "Summary": "Power Mech Projects has announced winning a significant order valued at 972 crore rupees. This substantial contract is likely to boost the company's project portfolio and potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1747111584000,
            "Source": "default"
        },
        {
            "Title": "Power Mech Projects Secures Major Orders Worth 13.97 Billion Rupees",
            "Summary": "Power Mech Projects has announced two significant order wins. The company has secured an order worth 4.25 billion rupees from an Adani Power subsidiary. Additionally, it has obtained another order valued at 9.72 billion rupees. These orders represent a substantial boost to Power Mech Projects' order book and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1743466432000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures 9.72 Billion Rupees Order",
            "Summary": "Power Mech Projects has announced securing a significant order worth 9.72 billion rupees. This substantial contract is likely to boost the company's project portfolio and potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1743170125000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures 4.25 Billion Rupee Order from Adani Power Subsidiary",
            "Summary": "Power Mech Projects has announced securing a significant order worth 4.25 billion rupees from a subsidiary of Adani Power. This order represents a major business development for Power Mech Projects and potentially indicates growth in the power sector.",
            "Sentiment": "positive",
            "PublishDate": 1743166824000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures ₹579 Crore Order from BHEL",
            "Summary": "Power Mech Projects has been awarded a significant contract worth ₹579 crore from Bharat Heavy Electricals Limited (BHEL). The contract involves providing civil, structural, and architectural works for the 2x800MW DVC Koderma (KTPS) Phase-II Project located in Jharkhand. This order represents a major project in the power sector infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1742775280000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects: Secures Rs 579 Crore Contract from BHEL for Jharkhand Power Plant",
            "Summary": "Power Mech Projects Ltd. has won a Rs 579 crore contract from BHEL for civil, structural, and architectural works at the 2x800 MW DVC Koderma Phase-II project in Jharkhand. The project includes extensive infrastructure development and is expected to be completed within three years.",
            "Sentiment": "positive",
            "PublishDate": 1742623813000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures ₹579 Crore Order from BHEL",
            "Summary": "Power Mech Projects has been awarded a significant contract worth ₹579 crore from Bharat Heavy Electricals Limited (BHEL). The contract involves providing civil structural and architectural works for the 2X800MW DVC Koderma (KTPS) Phase-II Project located in Jharkhand. This order represents a substantial project in the power sector infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1742578137000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Ltd: Secures ₹164.63 Crore Order from BHEL",
            "Summary": "Power Mech Projects Ltd. received a ₹164.63 crore order from Bharat Heavy Electricals Ltd. for the 2 x 800 MW DVC Koderma TPS Phase-II EPC project. The order includes design, engineering, supply, civil works, erection, and commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1740471002000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Secures Order Worth 165 Crore Rupees",
            "Summary": "Power Mech Projects Limited has announced that it has won a new order valued at 165 crore rupees. The company, which operates in the power and infrastructure sectors, has not provided specific details about the nature or scope of the order in this brief announcement.",
            "Sentiment": "positive",
            "PublishDate": 1740467117000,
            "Source": "order&deals"
        },
        {
            "Title": "Power Mech Projects Pursuing Renewable Energy Partnerships",
            "Summary": "Power Mech Projects is seeking a partnership with Dalmia Cement to install solar and wind power plants. The company is also planning to start its own captive power plants, solar power plants, and wind power plants, indicating a strategic focus on renewable energy sources.",
            "Sentiment": "positive",
            "PublishDate": 1739418270000,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Mech Projects Forecasts EBITDA Margin Growth",
            "Summary": "Power Mech Projects anticipates an increase in EBITDA margin by 1% to 1.5% over the next three to four years. The company further expects an additional 1.5% improvement in EBITDA margin upon reaching peak-rated capacity within two to three years, as reported in a concall update.",
            "Sentiment": "positive",
            "PublishDate": 1739418206000,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects Targets Rs 5,200 Crore Revenue for Current Year",
            "Summary": "Power Mech Projects has announced its revenue target of Rs 5,200 crore for the current fiscal year during a conference call. The company is expecting a growth rate of at least 25% in the fourth quarter to achieve this target.",
            "Sentiment": "positive",
            "PublishDate": 1739418093000,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects Revises Revenue Targets for 2026 and 2027",
            "Summary": "Power Mech Projects has adjusted its revenue targets due to delays in MDO (Mine Developer and Operator) projects. The company now aims for Rs 7,500 crore in 2026 and Rs 9,500 crore in 2027, including MDO operations. The revised expectations are Rs 7,000-7,500 crore for 2026 and approximately Rs 9,000 crore for 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1739418048000,
            "Source": "corporate_action"
        },
        {
            "Title": "Power Mech Projects Reports 21.8% Revenue Growth in Q3",
            "Summary": "Power Mech Projects has announced its financial results for the third quarter, reporting a revenue of 13.4 billion rupees. This represents a significant increase from the 11 billion rupees reported in the same quarter of the previous year, indicating a year-over-year growth of approximately 21.8%.",
            "Sentiment": "positive",
            "PublishDate": 1739180968000,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects Reports Q3 Financial Results",
            "Summary": "Power Mech Projects has announced its Q3 financial results. The company's EBITDA increased to 1.51 billion rupees, up from 1.34 billion rupees in the same quarter last year. However, the EBITDA margin decreased to 11.29% from 12.09% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739180953000,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects Reports 39.7% Increase in Q3 Net Profit",
            "Summary": "Power Mech Projects has announced its financial results for the third quarter, reporting a consolidated net profit of 866 million rupees. This represents a significant increase of 39.7% compared to the same period last year when the company reported a net profit of 620 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739180916000,
            "Source": "earnings"
        },
        {
            "Title": "Power Mech Projects to Consider Q3 Results on February 10",
            "Summary": "Power Mech Projects has announced that it will consider its third quarter (Q3) financial results on February 10. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738757375000,
            "Source": "result"
        },
        {
            "Title": "Power Mech Projects Secures 294 Crore Rupee Order",
            "Summary": "Power Mech Projects has announced winning a new order valued at 294 crore rupees. This significant contract represents a positive development for the company's business operations and financial prospects.",
            "Sentiment": "positive",
            "PublishDate": 1735710260000,
            "Source": "order&deals"
        }
    ]
}