{
    "Symbol": "POWERINDIA",
    "ISIN": "INE07Y701011",
    "News": [
        {
            "Title": "Hitachi Energy India Block Trade Worth Rs. 20.50 Cr",
            "Summary": "Hitachi Energy India executed a significant block trade on NSE worth Rs. 20.50 crores involving approximately 9,557 shares at Rs. 21,449.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770350768659,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hitachi Energy Q3 Net Profit Surges 89.78% YoY",
            "Summary": "Hitachi Energy reported strong Q3 performance with net profit rising to ₹2.60 billion from ₹1.37 billion year-on-year, while revenue grew 28.40% to ₹20.80 billion, exceeding analyst estimates.",
            "Sentiment": "positive",
            "PublishDate": 1770292202221,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hitachi Energy Receives ₹26.07 Cr Tax Demand",
            "Summary": "Hitachi Energy India receives income tax assessment order for AY 2022-23 with total demand of ₹26.07 crores including interest. Company plans to appeal the order calling it arbitrary and unjustified.",
            "Sentiment": "negative",
            "PublishDate": 1769241765036,
            "Source": "stocks"
        },
        {
            "Title": "Hitachi Energy India Q3FY26 Results on Feb 5, 2026",
            "Summary": "Hitachi Energy India Limited has scheduled its board meeting and analyst conference call for February 5, 2026, to discuss Q3FY26 financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769004741068,
            "Source": "co_actions_results"
        },
        {
            "Title": "Hitachi Energy ESG Rating Improves to 62 for 2025",
            "Summary": "Hitachi Energy India Limited receives improved ESG rating of 62 for 2025, up from 60 in 2024, as assigned by NSE Sustainability Ratings & Analytics Limited using publicly available information.",
            "Sentiment": "positive",
            "PublishDate": 1768579867113,
            "Source": "stocks"
        },
        {
            "Title": "Hitachi Energy ESG Rating Improves to 72.9",
            "Summary": "Hitachi Energy India receives upgraded ESG rating of 72.9 from 70.1, reflecting improved environmental, social and governance performance as assessed by SEBI-registered rating agency.",
            "Sentiment": "positive",
            "PublishDate": 1767702588312,
            "Source": "stocks"
        },
        {
            "Title": "Hitachi Energy Faces ₹1.41 Cr GST Demand from Karnataka",
            "Summary": "Hitachi Energy India receives fresh GST demand of ₹75.49 lakh plus interest and penalty from Karnataka tax authorities for FY 2021-22, totaling ₹1.41 crores. Company to appeal the order.",
            "Sentiment": "negative",
            "PublishDate": 1765462817878,
            "Source": "stocks"
        },
        {
            "Title": "GE Power India Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "GE Power India reported quarterly net profit of 304 million rupees, down from 660 million rupees year-over-year, despite revenue increasing to 2.8 billion rupees from 2.2 billion rupees. The company's EBITDA more than doubled to 2.8 billion rupees with margin expansion to 9.98% from 4.69%, while previous results included an exceptional item of 5.8 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1763074599726,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy CEO Projects Sustained Double-Digit Growth in Operating Profit",
            "Summary": "Hitachi Energy India expects to maintain double-digit growth in margin and operational profitability in upcoming quarters, according to CEO N Venu. The company reported strong quarterly results with margin expanding to 16.3% from 7.1% year-over-year, Ebitda rising to Rs 299 crore from Rs 110 crore, revenue growing 17.9% to Rs 1,833 crore, and net profit jumping to Rs 264 crore from Rs 52.3 crore. Venu cited multiple growth drivers including domestic revenue growth, energy transition tailwinds, manufacturing localization, robust export momentum, and an expanded services business unit. The company has recorded over 60,000 installed payments and expects to grow faster than market average. Hitachi Energy achieved its double-digit Ebitda growth target ahead of the two-year timeline previously guided.",
            "Sentiment": "positive",
            "PublishDate": 1762503858324,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India Attributes Recent Volume Surge to Market Forces",
            "Summary": "Hitachi Energy India responded to BSE's inquiry about significant volume increases in its securities across exchanges. The company stated it has disclosed all material information and price-sensitive events as required under SEBI regulations. Management believes the volume surge is purely market-driven and confirmed no material information has been withheld that could impact share price or volume behavior.",
            "Sentiment": "neutral",
            "PublishDate": 1762415784053,
            "Source": "stock"
        },
        {
            "Title": "Hitachi Energy India Shares Jump 14% on Strong Q2 Results with Fourfold Profit Growth",
            "Summary": "Hitachi Energy India shares surged 14% to Rs 20,399 after reporting strong July-September quarter results. Net profit jumped 405.6% year-on-year to Rs 264.4 crore, with PAT margin expanding to 13.8% from 3.4% in the same quarter last year. Revenue grew 23.3% to Rs 1,915.2 crore, while operating EBITDA increased 130.5% to Rs 291.6 crore with margins improving to 15.2%. Orders rose 13.6% year-on-year to Rs 2,217.1 crore. For the first half, revenue reached Rs 3,435.6 crore compared to Rs 2,881.2 crore in the previous year, with PAT rising to Rs 396 crore from Rs 62.7 crore. The company cited India's strong domestic demand and government focus on grid upgrades and market reforms as growth drivers.",
            "Sentiment": "positive",
            "PublishDate": 1762241609297,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India Sees Rs. 15.46 Crore Block Trade on NSE",
            "Summary": "Hitachi Energy India Ltd. executed a block trade worth Rs. 15.46 crores on the National Stock Exchange. The transaction involved approximately 7,843 shares at a price of Rs. 19,710.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762229785967,
            "Source": "order&deals"
        },
        {
            "Title": "Hitachi Energy India Reports Strong Q2 Performance with Net Profit Surging to 2.64 Billion Rupees",
            "Summary": "Hitachi Energy India delivered robust quarterly results with net profit jumping to 2.64 billion rupees from 523 million rupees in the same period last year. Revenue grew to 18.32 billion rupees compared to 15.53 billion rupees year-over-year. EBITDA increased significantly to 2.99 billion rupees from 1.1 billion rupees, while EBITDA margin expanded to 16.99% from 7.28% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762168913550,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India Clarifies ₹2,000 Crore Chennai Investment Structure",
            "Summary": "Hitachi Energy India Ltd has clarified that its ₹2,000 crore investment in Chennai is designated for a wholly owned subsidiary rather than a publicly listed company. The company made this clarification to provide transparency about the investment structure and ownership details of the Chennai facility.",
            "Sentiment": "neutral",
            "PublishDate": 1760681552817,
            "Source": "stock"
        },
        {
            "Title": "Hitachi Energy India Shareholders Approve Jan Niklas Persson's Appointment as Non-Executive Director",
            "Summary": "Hitachi Energy India Limited shareholders approved the appointment of Mr. Jan Niklas Persson (DIN: 11239092) as a Non-Executive and Non-Independent Director through a postal ballot process. The resolution was passed on September 21, 2025, with 99.66% of votes cast in favor and only 0.34% against. The voting process was conducted entirely through remote e-voting from August 23 to September 21, 2025. Out of 98,525 total shareholders, 865 members holding 3,74,94,449 equity shares participated in the voting. The promoter and promoter group, holding 3,17,86,256 shares, voted unanimously in favor with 100% support. Public institutional investors showed 97.64% support while public non-institutional investors demonstrated 99.91% approval. The resolution received the requisite majority as confirmed by scrutinizer S Kannan in his report dated September 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758547607329,
            "Source": "corporate_governance"
        },
        {
            "Title": "GE Power India Board Approves Durgapur Unit Demerger to JSW Energy",
            "Summary": "GE Power India's board has approved the demerger of its Durgapur unit to JSW Energy through a share-swap arrangement. The transaction involves the transfer of the Durgapur operations from GE Power India to JSW Energy in exchange for shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758213627906,
            "Source": "order&deals"
        },
        {
            "Title": "Hitachi Energy India Expands Mysuru Facility with World's First Fossil-Free Transformer Pressboard Production Line",
            "Summary": "Hitachi Energy India has expanded its Mysuru facility to enhance global supply of transformer-grade pressboard. The expansion includes the world's first fossil-free production line for this product category.",
            "Sentiment": "positive",
            "PublishDate": 1756455943250,
            "Source": "stock"
        },
        {
            "Title": "Hitachi Energy India Reports Record Orders of Rs 11,339 Crores in Q1 FY26, Revenue Grows 15.3%",
            "Summary": "Hitachi Energy India Limited announced quarterly results with all-time high orders of Rs 11,339.2 crores, representing 365% year-on-year growth, and revenue of Rs 1,529.8 crores, up 15.3% year-on-year. The company achieved record order backlog of Rs 29,135 crores. Key orders include a major HVDC project from Adani Energy Solutions for the Bhadla-Fatehpur 6,000 megawatt transmission line, awarded to consortium of Hitachi Energy India and BHEL. The company also secured orders from POWERGRID for 30 units of 765 kV transformers and various renewable energy projects. Profit before tax stood at Rs 176.9 crores and profit after tax at Rs 131.6 crores. Operational EBITDA reached Rs 170.2 crores with 11.1% margin. The transmission segment led order growth at 625%, followed by rail and metro at 845%. Export orders maintained 25% contribution to order book. The company is investing Rs 2,000 crores in capacity expansion across multiple business units. Management expects one to two HVDC projects to be finalized in the current financial year and anticipates two to three HVDC projects annually in coming years to manage India's transmission network complexity.",
            "Sentiment": "positive",
            "PublishDate": 1754470941464,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India Reports QIP Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Hitachi Energy India Limited submitted its monitoring agency report for the utilization of proceeds from its Qualified Institutional Placement (QIP) for the quarter ended June 30, 2025. The company raised Rs 2,520.82 crore gross proceeds through the issue of 21,90,688 equity shares at Rs 11,507 per share, with net proceeds of Rs 2,476.29 crore. The funds are allocated for three purposes: Rs 1,513.28 crore for capital expenditure including expansion and development of business units, Rs 350 crore for working capital requirements, and Rs 613.01 crore for general corporate purposes. During the quarter, only Rs 24.58 crore was utilized for capital expenditure related to capacity increase, equipment addition and civil works. The remaining Rs 2,451.71 crore remains unutilized and is invested in fixed deposits across various banks earning returns between 5.07% to 5.85%. Crisil Ratings Limited, the monitoring agency, reported no deviation from disclosed objects and confirmed utilization is as per the offer document disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1753896129458,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitachi Energy India Reports ₹29,125 Cr Order Book with Multi-Segment Growth Strategy",
            "Summary": "Hitachi Energy India has outlined an aggressive growth strategy backed by an order book worth ₹29,125 crores. The company is experiencing momentum in its transmission and rail segments while strategically expanding into exports, digital solutions, and energy storage segments as part of its multi-pronged growth approach.",
            "Sentiment": "positive",
            "PublishDate": 1753888373550,
            "Source": "stock"
        },
        {
            "Title": "Hitachi Energy India Appoints Seema Siddiqui as Communications & Government Relations Manager",
            "Summary": "Hitachi Energy India Limited announced the appointment of Ms. Seema Siddiqui as Communications & Government Relations Manager and Senior Management Personnel, effective August 1, 2025. The Board of Directors approved her appointment on July 30, 2025, based on the Nomination and Remuneration Committee's recommendation. Siddiqui will serve as a Country Management Committee member and will replace Ms. Manashwi Banerjee, who is transitioning to a new role within the Hitachi Energy group. Siddiqui brings over 18 years of corporate communications experience from companies including Microsoft, Schneider Electric, Dassault Systèmes, PwC, and ReNew. She holds a Master's degree in Applied Communication from Coventry University, United Kingdom.",
            "Sentiment": "positive",
            "PublishDate": 1753877512938,
            "Source": "corporate_governance"
        },
        {
            "Title": "Hitachi Energy India Reports 365% Jump in Orders to INR 11,339 Crore in Q1FY26",
            "Summary": "Hitachi Energy India Limited reported orders of INR 11,339.2 crore for Q1FY26, marking a 365.4% year-on-year increase, driven by the large Bhadla-Fatehpur HVDC project win and a bulk order from POWERGRID for 30 units of 765kV transformers. Revenue grew 15.3% to INR 1,529.8 crore. The company achieved significant profitability improvements with PBT rising 1075.3% to INR 176.9 crore and PAT increasing 1163.1% to INR 131.6 crore. Operational EBITDA margin stood at 11.1%. The company maintains a record order backlog of INR 29,125.3 crore, providing revenue visibility for multiple quarters. Service orders grew 91% year-on-year, while exports contributed 24.7% of orders excluding HVDC. The transmission segment led order intake, followed by rail & metro and data center segments.",
            "Sentiment": "positive",
            "PublishDate": 1753874993056,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India Reports Strong Q1 Results with 365% Order Growth and Record Backlog",
            "Summary": "Hitachi Energy India Limited reported quarterly results with orders surging 365% year-on-year to INR 11,339.2 crore, driven by the large Bhadla-Fatehpur HVDC project win and bulk transformer orders from POWERGRID. Revenue grew 15.3% to INR 1,529.8 crore. The company achieved significant profitability improvements with profit before tax rising 1075% to INR 176.9 crore and profit after tax increasing 1163% to INR 131.6 crore. Operational EBITDA margin stood at 11.1%. Order backlog reached a record INR 29,125.3 crore. Service orders grew 91% year-on-year, while exports contributed 24.7% of orders excluding HVDC. The company maintains INR 2,451.71 crore in unutilized funds from its previous equity raise, with INR 2,425 crore deposited with banks.",
            "Sentiment": "positive",
            "PublishDate": 1753873606574,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy: India's First 400 kV Eco-Friendly Power Transformer Launched",
            "Summary": "Hitachi Energy has flagged off India's first 400 kV class three-phase synthetic ester fluid-filled power transformer for Power Grid Corporation of India. The 315 MVA rating transformer, developed and manufactured at Hitachi Energy's facility in Vadodara, offers higher temperature operation, greater load capacities, reduced operational costs, and enhanced safety from fire hazards.",
            "Sentiment": "positive",
            "PublishDate": 1752586507000,
            "Source": "normal_news"
        },
        {
            "Title": "Hitachi Energy India: Secures Major 765 kV Transformer Order from Power Grid Corp",
            "Summary": "Hitachi Energy India has won an order from Power Grid Corporation of India for 30 units of 765 kV, 500 MVA single-phase transformers. The equipment will be manufactured at their Vadodara facility, supporting the 'Make in India' initiative. These transformers will help transmit electricity to about 30 million households once operational.",
            "Sentiment": "positive",
            "PublishDate": 1750992474000,
            "Source": "order&deals"
        },
        {
            "Title": "Hitachi Energy India to Supply 765 kV Transformers to Power Grid Corporation",
            "Summary": "Hitachi Energy India has secured an order to deliver 765 kV transformers to Power Grid Corporation of India Limited. This equipment will contribute to the expansion of India's national power grid.",
            "Sentiment": "positive",
            "PublishDate": 1750983042000,
            "Source": "default"
        },
        {
            "Title": "Hitachi Energy India to Supply 765 KV Transformers to Power Grid Corporation of India",
            "Summary": "Hitachi Energy India has announced that it will supply 765 KV transformers to Power Grid Corporation of India. This supply is intended to support grid expansion efforts in India. No further details about the contract, such as its value or timeline, were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750937649000,
            "Source": "default"
        },
        {
            "Title": "Hitachi Energy India: Secures Major Transformer Order from Power Grid Corp",
            "Summary": "Hitachi Energy India has won an order from Power Grid Corporation of India Ltd for 30 units of 765 kV, 500 MVA single-phase transformers. The equipment will be manufactured at their Vadodara facility, aligning with the 'Make in India' initiative. These transformers will help power approximately 30 million Indian households and support the country's growing energy demands.",
            "Sentiment": "positive",
            "PublishDate": 1750934435000,
            "Source": "order&deals"
        },
        {
            "Title": "Hitachi Energy India: Stock Soars 2,000% in Five Years Amid Strong Financial Performance",
            "Summary": "Hitachi Energy India's stock has rallied over 2,000% in the last five years. The company reported a 62% increase in Q4 FY2025 net profit to Rs 183.9 crore, with total income rising to Rs 1,921.85 crore. FY2025 net profit surged to Rs 383.98 crore. The company announced a Rs 2,000 crore capex plan for the next 4-5 years. Analysts maintain a largely positive outlook, with a target price of Rs 16,787.",
            "Sentiment": "positive",
            "PublishDate": 1750842204000,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy: Double-Digit EBITDA Margins Sustainable Yearly",
            "Summary": "Hitachi Energy's CEO Venu Nuguri confirms confidence in maintaining double-digit EBITDA margins annually, supported by a robust order book of Rs 19,000 crore and sustainable order conversion. The company focuses on high-growth segments like transmission, renewables, and data centers, with potential growth in energy storage. Exports contribute 25% of revenue, with a possibility of slight increase.",
            "Sentiment": "positive",
            "PublishDate": 1747789228000,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy Outlines Growth Plans and Financial Targets in Concall",
            "Summary": "Hitachi Energy shared several updates in a recent concall. The company's product development and growth plan is expected to take 3 to 5 years. They are conducting pilots with industrial and data center customers to reach a goal of Rs 2,000 crore in orders. The company aims to leverage its largest ever backlog for revenue and margin growth. Gross margins are reported to be around 38% to 40%, and they expect to maintain a double-digit EBITDA margin for the overall year. Hitachi Energy plans to increase orders from Rs 500-600 crore to Rs 2,000 crore over 3 to 4 years.",
            "Sentiment": "positive",
            "PublishDate": 1747366629000,
            "Source": "default"
        },
        {
            "Title": "Hitachi Energy India: Q4 Profit Soars 62% on Strong Execution",
            "Summary": "Hitachi Energy India reported a 61.8% increase in Q4 profit to ₹184 crore, with revenue growing 11.1% to ₹1,883.7 crore. EBITDA rose 30.9% to ₹238 crore, and EBITDA margin improved to 12.6%. The company announced a final dividend of ₹6 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747231423000,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India Reports Q4 Results and Dividend",
            "Summary": "Hitachi Energy India has announced its Q4 results and dividend recommendation. The company's Q4 EBITDA increased to 2.4 billion rupees from 1.82 billion rupees year-over-year. The EBITDA margin improved to 12.69% from 10.73% in the same period. Additionally, the company has recommended a dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747227592000,
            "Source": "result"
        },
        {
            "Title": "Hitachi Energy India Reports Q4 FY23 Financial Results",
            "Summary": "Hitachi Energy India has announced its financial results for the fourth quarter. The company's net profit increased to 1.8 billion rupees, up from 1.14 billion rupees year-over-year and 1.4 billion rupees quarter-over-quarter. Revenue for Q4 rose to 18.8 billion rupees, compared to 16.95 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747227496000,
            "Source": "result"
        },
        {
            "Title": "Hitachi Energy India to Consider Q4 Results on May 14",
            "Summary": "Hitachi Energy India has announced that it will consider and approve its financial results for the fourth quarter on May 14. This announcement indicates the company is preparing to disclose its performance for the latest fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1746537308000,
            "Source": "default"
        },
        {
            "Title": "Hitachi Energy India: Double-Digit Revenue Growth Target for FY26",
            "Summary": "Hitachi Energy India aims for double-digit revenue growth in FY26, backed by a Rs 19,000 crore order pipeline. The company downplays impact of US tariffs due to minimal US market exposure. It recently secured a major HVDC transmission contract with BHEL for the Bhadla-Fatehpur project, expecting revenue ramp-up from the second year onwards. Two more similar projects are upcoming for bidding.",
            "Sentiment": "positive",
            "PublishDate": 1744037923000,
            "Source": "normal_news"
        },
        {
            "Title": "Hitachi Energy India Closes Qualified Institutions Placement at ₹11,507 per Share",
            "Summary": "Hitachi Energy India has approved the closure of its Qualified Institutions Placement (QIP) of equity shares. The company has set the issue price at ₹11,507 per equity share for the QIP.",
            "Sentiment": "neutral",
            "PublishDate": 1741876569000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitachi Energy India: QIP Oversubscribed, May Partially Exercise Green Shoe Option",
            "Summary": "Hitachi Energy India's Rs 2,000 crore QIP was oversubscribed 2 times. The company may partially exercise the green shoe option to increase the issue size up to Rs 3,000 crore. Major subscribers include Norges Bank, HDFC Life, SBI Life, ICICI Prudential Life Insurance, and Motilal Oswal. The indicative price is Rs 11,507 per share.",
            "Sentiment": "positive",
            "PublishDate": 1741754268000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitachi Energy India: QIP Launched with Floor Price at ₹12,112.50",
            "Summary": "Hitachi Energy India has launched a Qualified Institutional Placement (QIP) with a floor price of ₹12,112.50 per share, which is 4.7% lower than the previous closing price. The company's stock price dipped 4% during intraday trading, reaching a low of ₹12,217. The Fund Raise Committee may offer a discount of up to 5% on the floor price.",
            "Sentiment": "neutral",
            "PublishDate": 1741676536000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitachi Energy India: QIP Issue Launched with ₹12,112.50 Floor Price",
            "Summary": "Hitachi Energy India has initiated a Qualified Institutions Placement (QIP) of equity shares with a floor price of ₹12,112.50 per share. The company may offer up to 5% discount. This follows strong Q3 results with PAT rising nearly five times YoY to ₹137.4 crore and an all-time high order backlog of ₹18,994.4 crore. The company became debt-free as of December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1741629473000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitachi Energy Ltd: Goldman Sachs Bullish on Strong Order Inflows and Capacity Expansion",
            "Summary": "Hitachi Energy shares rose nearly 8% as Goldman Sachs issued a 'buy' rating with a target price of Rs 13,350. The company is experiencing strong order inflows, expanding production capacity, and plans to indigenously manufacture 80-90% of HVDC project components. Hitachi Energy holds a 50% share of the domestic market.",
            "Sentiment": "positive",
            "PublishDate": 1741160099000,
            "Source": "normal_news"
        },
        {
            "Title": "Hitachi Energy India: Penny Stock Soars 78,566% in Five Years",
            "Summary": "Hitachi Energy India's stock price has risen from ₹15 to over ₹11,800 in five years, representing a 78,566% increase. The company reported a 498.1% year-on-year increase in Q3 FY2024 PAT to ₹137.4 crore. Revenue for the first nine months of FY2024 grew to ₹4,520.3 crore from ₹3,547.6 crore in the previous year. The company recently secured a significant HVDC order for renewable energy transmission.",
            "Sentiment": "positive",
            "PublishDate": 1740382063000,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India: Seeks to Boost Borrowing Limit to Rs 11,500 Crore",
            "Summary": "Hitachi Energy India is seeking shareholder approval to increase its borrowing limit from Rs 6,500 crore to Rs 11,500 crore. The proposed increase focuses on non-fund based limits, raising them by Rs 5,000 crore to Rs 10,000 crore, while fund-based limits remain at Rs 1,500 crore. This move is driven by anticipated business growth and new high-value projects requiring increased non-fund based facilities.",
            "Sentiment": "positive",
            "PublishDate": 1740072134000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hitachi Energy Secures LOI for HVDC Link in Rajasthan",
            "Summary": "Hitachi Energy has received a Letter of Intent (LOI) from Rajasthan Part I Power Transmission to design and execute a High Voltage Direct Current (HVDC) link. This project aims to transmit renewable energy from Bhadla III in Rajasthan to Fatehpur, enhancing the region's power transmission capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1739155384000,
            "Source": "order&deals"
        },
        {
            "Title": "Hitachi Energy India: Strong Q3 Performance Fuels High Single-Digit Growth Expectations",
            "Summary": "Hitachi Energy India reported a significant increase in Q3 net profit to Rs 137 crore, up from Rs 23 crore last year. The company expects high single-digit quarter-over-quarter growth in order inflow. Q3 saw record orders of Rs 11,594.3 crore, driven by a large HVDC order. The order backlog stands at Rs 19,000 crore, providing revenue visibility for upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1738650919000,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India: Shares Surge 20% on Strong Q3 Results",
            "Summary": "Hitachi Energy India's shares hit 20% upper circuit after Q3 results. Revenue up 27% YoY, EBITDA up 145% YoY. Record order inflow of ₹11,594 crore, 7x higher than last year. Management expects more HVDC orders in coming months. EBITDA margin improved to 10.3% from 5.3% last year.",
            "Sentiment": "positive",
            "PublishDate": 1738215327000,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India Reports Significant Profit Growth in Q3",
            "Summary": "Hitachi Energy India has announced its financial results for the third quarter. The company's net profit increased substantially to 1.37 billion rupees, compared to 229.7 million rupees in the same quarter last year and 522.9 million rupees in the previous quarter. Revenue also saw growth, reaching 16.2 billion rupees, up from 12.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738197240000,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India: Q3 PAT Surges 5x, Achieves Record Order Backlog",
            "Summary": "Hitachi Energy India reported a fivefold increase in Q3 FY2025 PAT to ₹137.4 crore. The company achieved its highest-ever order backlog of ₹18,994.4 crore. Revenue grew 31% YoY to ₹1672.4 crore. Operational EBITDA margin reached 10.1%. The company secured a large HVDC order, driving total quarterly orders to ₹11,594.3 crore. Hitachi Energy India became debt-free as of December 31, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1738153202000,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy India to Consider Q3 Results",
            "Summary": "Hitachi Energy India has announced that it will consider its third quarter financial results on January 29. This indicates the company is preparing to release its latest earnings report, which will provide insights into its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737549288000,
            "Source": "earnings"
        },
        {
            "Title": "Hitachi Energy to Raise 4,200 Crore Rupees Through QIP",
            "Summary": "Hitachi Energy has announced plans to raise funds worth 4,200 crore rupees (approximately $505 million) through a Qualified Institutional Placement (QIP). This fundraising initiative suggests that the company is looking to strengthen its financial position, potentially for expansion, debt reduction, or other strategic purposes. QIPs are a way for listed companies to raise capital quickly from institutional investors without the need for submitting extensive paperwork to market regulators.",
            "Sentiment": "positive",
            "PublishDate": 1737333508000,
            "Source": "corporate_action"
        }
    ]
}