{
    "Symbol": "PPAP",
    "ISIN": "INE095I01015",
    "News": [
        {
            "Title": "PPAP Automotive Schedules Q3FY26 Earnings Call",
            "Summary": "PPAP Automotive Limited announces earnings conference call on February 16, 2026 at 1:00 PM IST to discuss Q3FY26 and 9MFY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770786496223,
            "Source": "co_actions_results"
        },
        {
            "Title": "PPAP Automotive Executes Settlement Agreement for PTI Stake Sale",
            "Summary": "PPAP Automotive Limited has executed settlement agreement on January 7, 2026, for sale of 50% stake in joint venture PTI to Tokai Kogyo Co. Ltd for ₹100 crores, with completion expected by February 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767777645534,
            "Source": "co_actions_results"
        },
        {
            "Title": "PPAP Automotive Reports 5.2% Revenue Decline in H1 FY26, Guides for Recovery in Second Half",
            "Summary": "PPAP Automotive's consolidated revenue fell 5.2% year-on-year to INR 253.6 crores in H1 FY26, with EBITDA down 21.9% to INR 22 crores and a PAT loss of INR 2.3 crores due to subdued automotive demand and delayed battery business approvals. The company secured new lifetime orders worth INR 707 crores and expects recovery in H2 FY26 with new model launches including Tata Sierra, Renault Duster, and Maruti Suzuki eVitara, guiding for full-year revenue of INR 575-600 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763379569059,
            "Source": "earnings"
        },
        {
            "Title": "PPAP Automotive Secures INR 707 Crore Lifetime Orders in H1FY26, Order Backlog at INR 4,171 Crore",
            "Summary": "PPAP Automotive secured lifetime orders worth INR 707 crore in H1FY26, including a significant INR 460 crore order from Tata Motors for plastic and rubber extrusion components. The company's robust order backlog of INR 4,171 crore provides strong long-term revenue visibility while expanding partnerships across both ICE and EV segments with major OEMs.",
            "Sentiment": "positive",
            "PublishDate": 1763057350929,
            "Source": "earnings"
        },
        {
            "Title": "PPAP Automotive Reports Mixed Quarterly Performance, Declares Rs 1 Interim Dividend",
            "Summary": "PPAP Automotive Limited posted standalone net profit of Rs 194.90 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 38.04 lakhs in the previous quarter, while consolidated results showed a loss of Rs 4.56 lakhs. The Board declared an interim dividend of Rs 1 per equity share and approved grant of 46,032 employee stock options under ESOP 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1763051257508,
            "Source": "earnings"
        },
        {
            "Title": "PPAP Automotive Schedules Board Meeting to Consider Quarterly Results and Interim Dividend",
            "Summary": "PPAP Automotive Limited has announced a board meeting scheduled for November 13, 2025, to consider and approve the company's un-audited financial results for the quarter and half year ended September 30, 2025. The board will also deliberate on declaring an interim dividend. The company has set November 19, 2025, as the record date for determining shareholder entitlement for any interim dividend payment for the financial year ending March 31, 2026. If declared, the interim dividend will be paid within 30 days to eligible shareholders whose names appear in the register of members or beneficial owners as of the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1762811491095,
            "Source": "corporate_action"
        },
        {
            "Title": "PPAP Automotive Gets Credit Rating Reaffirmation from CRISIL",
            "Summary": "PPAP Automotive Limited received a credit rating reaffirmation from CRISIL on October 29, 2025. The rating agency assigned CRISIL A-/Stable (Reaffirmed) for long-term facilities and CRISIL A2+ (Reaffirmed) for short-term facilities. The ratings cover total bank loan facilities worth Rs. 200 crore across multiple banks including ICICI Bank, HDFC Bank, Axis Bank, HSBC Bank, and State Bank of India. The facilities include cash credit, bank guarantees, letters of credit, and proposed fund-based bank limits. The rating letter remains valid until March 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1761907977685,
            "Source": "stock"
        },
        {
            "Title": "PPAP Automotive Announces Rs. 1.5 Final Dividend for FY 2024-25 with Tax Deduction Guidelines",
            "Summary": "PPAP Automotive Limited's Board of Directors recommended a final dividend of Rs. 1.5 per equity share (15% on face value of Rs. 10) for FY 2024-25, subject to shareholder approval at the 30th Annual General Meeting. The dividend will be paid within 30 days of AGM approval after deducting tax at applicable rates. The company has communicated detailed tax deduction guidelines to shareholders, noting that dividends are taxable in shareholders' hands since April 2020. For resident shareholders, no tax will be deducted if total dividend doesn't exceed Rs. 10,000 during FY 2025-26, while standard TDS rate is 10% with valid PAN or 20% without valid PAN. Non-resident shareholders face varying rates from 10% to 30% depending on category and treaty benefits. Shareholders must submit required documents by September 19, 2025, to avail beneficial tax rates. The company emphasized that physical shareholders must update PAN, bank details, and KYC information for electronic dividend payment as mandated by SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1757671835540,
            "Source": "corporate_action"
        },
        {
            "Title": "PPAP Automotive Reports 4.9% Revenue Decline in Q1 FY26 Amid Industry Headwinds",
            "Summary": "PPAP Automotive Limited reported consolidated revenue of Rs. 116.6 crores in Q1 FY26, declining 4.9% year-over-year due to subdued automotive demand and project delays by OEMs. The company's Parts business operated at 62% capacity utilization, while margins came under pressure from lower volumes. However, the aftermarket business showed strong growth of 27% year-over-year. PPAP secured new lifetime orders worth Rs. 86 crores, including Rs. 11 crores from EV programs, maintaining its total order book at Rs. 3,439 crores. The Commercial Toolroom business order book increased 30% year-over-year. Management maintains FY26 revenue guidance of Rs. 600 crores, expecting gradual recovery from Q2 onwards as new model launches commence and production ramps up.",
            "Sentiment": "neutral",
            "PublishDate": 1755516999802,
            "Source": "earnings"
        },
        {
            "Title": "PPAP Automotive Sets Record Date for Dividend Distribution",
            "Summary": "PPAP Automotive Limited has set Wednesday, 17th September, 2025 as the record date for determining shareholders eligible to receive dividends, subject to approval at the upcoming Annual General Meeting on 25th September, 2025. If approved, dividend payments will be made within 30 days of the AGM.",
            "Sentiment": "positive",
            "PublishDate": 1754998478782,
            "Source": "corporate_action"
        },
        {
            "Title": "PPAP Automotive Reports Net Loss of ₹38 Crore in Q1 2025-26 Results",
            "Summary": "PPAP Automotive Limited reported a standalone net loss of ₹38.04 lakh for the quarter ended June 30, 2025, compared to a profit of ₹142.01 lakh in the same quarter last year. Revenue from operations declined to ₹11,143.99 lakh from ₹11,867.78 lakh year-over-year. On a consolidated basis, the company posted a net loss of ₹227.13 lakh versus a profit of ₹10.42 lakh in the corresponding quarter of the previous year. Consolidated revenue increased to ₹11,662.85 lakh from ₹12,267.67 lakh. The company's earnings per share turned negative at ₹(0.27) on standalone basis and ₹(1.61) on consolidated basis. During the quarter, PPAP allotted 28,557 shares under its Employee Stock Option Plan 2022. The Board approved these unaudited financial results in a meeting held on August 8, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754649906742,
            "Source": "earnings"
        },
        {
            "Title": "Ppap Automotive Reports Q4 Profit and Recommends Dividend",
            "Summary": "Ppap Automotive announced its Q4 consolidated net profit of 24 million rupees, compared to a loss of 82 million rupees in the same quarter last year and a profit of 18 million rupees in the previous quarter. The company's Q4 revenue increased to 1.5 billion rupees from 1.36 billion rupees year-over-year. Additionally, the company has recommended a dividend of 1.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747613599000,
            "Source": "default"
        },
        {
            "Title": "PPAP Automotive Provides Financial Guidance for FY26",
            "Summary": "PPAP Automotive has announced financial guidance for FY26. The company projects a PAT (Profit After Tax) of 20 to 25 crore, compared to FY25 PAT of 7.1 crore. Revenue guidance for FY26 is set at 600 to 660 crore, versus FY25 revenue of 554 crore. EBITDA guidance for FY26 is estimated at 75 to 80 crore, compared to FY25 EBITDA of 57.2 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747492411000,
            "Source": "default"
        },
        {
            "Title": "PPAP Automotive Recommends Dividend",
            "Summary": "PPAP Automotive has recommended a dividend of 1.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747399893000,
            "Source": "result"
        },
        {
            "Title": "PPAP Automotive Reports Improved Q4 Financial Results",
            "Summary": "PPAP Automotive has reported its Q4 financial results. The company's EBITDA increased to 155 million rupees from 113 million rupees year-over-year. The EBITDA margin improved to 10.56% from 8.35% in the same period last year. PPAP Automotive's consolidated net profit for Q4 was 24 million rupees, compared to a loss of 82 million rupees year-over-year and a profit of 18 million rupees quarter-over-quarter. The company's Q4 revenue rose to 1.5 billion rupees from 1.36 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747399848000,
            "Source": "result"
        },
        {
            "Title": "PPAP Automotive Establishes New Subsidiary for Industrial Products",
            "Summary": "PPAP Automotive has incorporated a wholly owned subsidiary named Avinya Industrial Products Ltd. This new entity is intended to expand the company's manufacturing and trading operations in the industrial products sector.",
            "Sentiment": "positive",
            "PublishDate": 1743485678000,
            "Source": "corporate_action"
        },
        {
            "Title": "PPAP Automotive Incorporates New Subsidiary for EPDM Rubber Business",
            "Summary": "PPAP Automotive has incorporated a new subsidiary named Avinya Sealing Systems Limited. The new unit has been established with the specific objective of carrying out the EPDM (Ethylene Propylene Diene Monomer) rubber business.",
            "Sentiment": "positive",
            "PublishDate": 1740366269000,
            "Source": "corporate_action"
        },
        {
            "Title": "PPAP Automotive Secures Order Worth 118 Crore Rupees",
            "Summary": "PPAP Automotive has won a new order valued at 118 crore rupees. This significant order is likely to boost the company's revenue and potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1734323682000,
            "Source": "order&deals"
        }
    ]
}