{
    "Symbol": "PPL",
    "ISIN": "INE050001010",
    "News": [
        {
            "Title": "Prakash Pipes Declares 10% Interim Dividend",
            "Summary": "Prakash Pipes Limited announces 10% interim dividend with record date December 24, 2025, alongside strategic solar power acquisition and ₹75 crore inter-corporate loan approval.",
            "Sentiment": "positive",
            "PublishDate": 1766037516105,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prakash Pipes Reports ₹9 Crores Net Profit in Q2, Plans Registered Office Relocation",
            "Summary": "Prakash Pipes Limited reported net sales of ₹181 crores and net profit of ₹9 crores for the quarter ended September 30, 2025, with half-year net profit reaching ₹20 crores and EPS of 8.22. The company's board approved shifting its registered office within Amritsar limits effective December 1, 2025, while its PVC Pipes division achieved higher sales volume of 10,659 MT despite prolonged monsoon impact.",
            "Sentiment": "positive",
            "PublishDate": 1763136165282,
            "Source": "earnings"
        },
        {
            "Title": "Prakash Pipes Sets September 16, 2025 as Record Date for FY 2024-25 Dividend",
            "Summary": "Prakash Pipes Limited has fixed September 16, 2025 as the record date to determine shareholder eligibility for dividend payment for financial year 2024-25. The dividend is subject to approval by members at the Annual General Meeting scheduled for September 30, 2025. The company communicated this information to BSE, where it trades under code 542684, and NSE under symbol PPL.",
            "Sentiment": "neutral",
            "PublishDate": 1757403605203,
            "Source": "corporate_action"
        },
        {
            "Title": "Prakash Pipes Gets Exchange Approval for Aircon Systems Reclassification, Receives BSE Warning",
            "Summary": "Prakash Pipes Limited received approval from NSE and BSE for reclassifying Aircon Systems (India) Private Limited from promoter group to public group category. The reclassification shows Aircon Systems holding nil shares post-reclassification. The company submitted its initial application on October 26, 2024. BSE issued a warning letter to Prakash Pipes for non-compliance with disclosure requirements, noting the company submitted a physical application on October 28, 2024, but only filed through the required Listing Centre on July 28, 2025. The warning cited violation of regulations requiring disclosure of reclassification applications within 24 hours of submission. Post-reclassification shareholding structure shows promoter holding at 44.41% and public holding at 55.59%.",
            "Sentiment": "neutral",
            "PublishDate": 1757066656148,
            "Source": "corporate_action"
        },
        {
            "Title": "Prakash Pipes Reports 59% Decline in Q1 Net Profit to 103 Million Rupees",
            "Summary": "Prakash Pipes reported Q1 net profit of 103 million rupees, down from 254 million rupees in the same period last year. The company's EBITDA fell to 163 million rupees from 329 million rupees year-over-year, with EBITDA margin declining to 8.01% from 16.06%. Revenue remained relatively stable at 2 billion rupees compared to 2.05 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755162037392,
            "Source": "earnings"
        },
        {
            "Title": "Prakash Pipes Reports Q4 Results and Declares Dividend",
            "Summary": "Prakash Pipes has reported its Q4 financial results. The company's EBITDA for Q4 was 175 million rupees, compared to 302 million rupees in the same quarter last year. The EBITDA margin decreased to 9.58% from 18.32% year-over-year. Q4 revenue increased to 1.83 billion rupees from 1.65 billion rupees in the previous year. Additionally, the company has declared a dividend of 2.4 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748595872000,
            "Source": "result"
        },
        {
            "Title": "Prakash Pipes Reports Q4 Net Profit of 103 Million Rupees",
            "Summary": "Prakash Pipes has reported a net profit of 103 million rupees for the fourth quarter, compared to 254 million rupees in the same quarter of the previous year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1748595765000,
            "Source": "result"
        },
        {
            "Title": "Prakash Pipes: Dolly Khanna Increases Stake, Mukul Agrawal Reduces in Q4",
            "Summary": "Dolly Khanna increased her stake in Prakash Pipes by 37 basis points to 4.08% in Q4 2025, while Mukul Agrawal reduced his holding to 2.36%. The small-cap stock has shown a 1263% rally over five years but is down 24% YTD.",
            "Sentiment": "neutral",
            "PublishDate": 1744276457000,
            "Source": "normal_news"
        },
        {
            "Title": "Dolly Khanna Increases Stake in Prakash Pipes",
            "Summary": "Investor Dolly Khanna has increased her stake in Prakash Pipes by 0.4% during the fourth quarter. Following this addition, her total shareholding in the company now stands at 4.08%.",
            "Sentiment": "positive",
            "PublishDate": 1744183190000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prakash Pipes Reports Q3 Revenue Increase",
            "Summary": "Prakash Pipes has announced its third-quarter revenue results. The company reported revenue of 1.9 billion rupees, compared to 1.58 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739169450000,
            "Source": "earnings"
        },
        {
            "Title": "Prakash Pipes Reports Q3 EBITDA Growth",
            "Summary": "Prakash Pipes has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 358 million rupees, up from 299 million rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 18.61% from 18.90% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739169400000,
            "Source": "earnings"
        },
        {
            "Title": "Prakash Pipes Reports Stable Q3 Net Profit",
            "Summary": "Prakash Pipes has reported a net profit of 231 million rupees for the third quarter, which remains unchanged compared to the same period last year (year-over-year).",
            "Sentiment": "neutral",
            "PublishDate": 1739169360000,
            "Source": "earnings"
        },
        {
            "Title": "Prakash Pipes Reports Q2 Revenue Growth",
            "Summary": "Prakash Pipes has announced its second quarter revenue, which stands at 2 billion rupees. This represents an increase from 1.7 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731578183000,
            "Source": "result"
        },
        {
            "Title": "Prakash Pipes Reports Strong Q2 Financial Performance",
            "Summary": "Prakash Pipes has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 241 million rupees to 315 million rupees. Additionally, the EBITDA margin expanded from 14.12% to 15.72%.",
            "Sentiment": "positive",
            "PublishDate": 1731578177000,
            "Source": "result"
        },
        {
            "Title": "Prakash Pipes Reports Q2 Net Profit Increase",
            "Summary": "Prakash Pipes has reported a net profit of 243 million rupees for the second quarter, compared to 226 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731578140000,
            "Source": "result"
        },
        {
            "Title": "Dolly Khanna Increases Stake in Prakash Pipes",
            "Summary": "<p><span class=\"positive\">Investor</span> <b>Dolly Khanna</b> has <span class=\"positive\">increased</span> her stake in <b>Prakash Pipes</b> by <span class=\"neutral\">0.88%</span> during the second quarter. Following this increase, her total shareholding in the company now stands at <span class=\"neutral\">3.79%</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728998533000,
            "Source": "normal_news"
        }
    ]
}