{
    "Symbol": "PPLPHARMA",
    "ISIN": "INE0DK501011",
    "News": [
        {
            "Title": "Piramal Pharma Faces Rs 1 Crore Environmental Penalty",
            "Summary": "Gujarat Pollution Control Board imposes Rs 1 crore interim environmental damage compensation on Piramal Pharma's Dahej facility following earlier closure directions under Water Act provisions.",
            "Sentiment": "negative",
            "PublishDate": 1770819994043,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Pharma Partners for Green Anaesthetic Tech",
            "Summary": "Piramal Critical Care collaborates with Blue-Zone Technologies to develop waste anaesthetic gas capture and recycling technology, starting in Europe with plans for global expansion.",
            "Sentiment": "positive",
            "PublishDate": 1770313935521,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Pharma Independent Director Completes Tenure",
            "Summary": "Mr. Subramanian Ramadorai completes his 5-year term as Independent Director of Piramal Pharma Limited on February 8, 2026, choosing to retire to pursue personal priorities.",
            "Sentiment": "neutral",
            "PublishDate": 1770279716074,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Pharma Acquires Kenalog Brand for $100M",
            "Summary": "Piramal Pharma purchases Kenalog brand for up to $100 million to strengthen injectable portfolio and support global expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1769660179831,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piramal Pharma Reports Q3 Loss of ₹1.36B vs Profit",
            "Summary": "Piramal Pharma swings to consolidated net loss of ₹1.36 billion in Q3 from ₹37 million profit year-on-year, missing analyst estimates of ₹353 million profit significantly.",
            "Sentiment": "negative",
            "PublishDate": 1769660114273,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piramal Pharma Board Meet Set for January 28, 2026",
            "Summary": "Piramal Pharma Limited has scheduled its board meeting for January 28, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768546731338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Piramal Pharma Gets FDA Form-483 for Lexington Unit",
            "Summary": "Piramal Pharma's Lexington facility receives US FDA Form-483 citing four issues following Good Manufacturing Practices inspection from December 3-10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1765463937970,
            "Source": "stocks"
        },
        {
            "Title": "Piramal Pharma Appoints CVC Capital Partner Amit Soni as Independent Director",
            "Summary": "Piramal Pharma's Board approved the appointment of Amit Soni, a Partner at CVC Capital, as Non-Executive Independent Director for a five-year term starting February 9, 2026, subject to shareholder approval. Soni brings over two decades of investment experience, having led CVC's India operations with $980 million deployed across 5 deals and previously worked with General Atlantic on major investments in technology, financial services and healthcare sectors.",
            "Sentiment": "positive",
            "PublishDate": 1765198106591,
            "Source": "corporate_governance"
        },
        {
            "Title": "Piramal Pharma's UK Bioconjugates Facility Receives Updated GMP Certificates from MHRA",
            "Summary": "Piramal Pharma's bioconjugates manufacturing facility in Grangemouth, UK, has been granted updated Good Manufacturing Practice (GMP) certificates from the UK's Medicines and Healthcare products Regulatory Agency (MHRA). The regulatory approval ensures the facility meets current manufacturing standards, supporting Piramal Pharma's pharmaceutical operations and compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763538588100,
            "Source": "stock"
        },
        {
            "Title": "Piramal Pharma Expects Flat Revenue Growth and Moderating EBITDA Margins",
            "Summary": "Piramal Pharma anticipates flat revenue growth for the current year alongside moderating EBITDA margins. The company shared these expectations during a conference call update.",
            "Sentiment": "negative",
            "PublishDate": 1762403490684,
            "Source": "stock"
        },
        {
            "Title": "Piramal Pharma Reports 21% Revenue Decline in Q2FY26 Due to Customer Inventory Destocking",
            "Summary": "Piramal Pharma Limited announced quarterly results for the period ended September 30, 2025, with consolidated revenue from operations declining 21% year-over-year to ₹2,044 crores in Q2FY26. The company attributed the revenue decline primarily to inventory destocking by a customer in one large CDMO order for an on-patent commercial product. Half-year revenue fell 14% to ₹3,977 crores. EBITDA margins stood at 11% for the quarter and 10% for the half-year. The company's net debt reduced by ₹228 crores to ₹3,971 crores compared to FY25, maintaining a net debt to EBITDA ratio below 3x. The CDMO business was impacted by inconsistent recovery in US biopharma funding and uncertainties in global trade policies. However, the company noted a significant pickup in biopharma funding in September and October 2025. The Consumer Healthcare business delivered healthy mid-teen growth, while the Complex Hospital Generics business maintained its leadership position in the US Sevoflurane market with 45% value market share.",
            "Sentiment": "negative",
            "PublishDate": 1762370862169,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Pharma Forecasts 19% CRDMO Sales Growth Through FY2028",
            "Summary": "Piramal Pharma expects to capitalize on growing demand in the Contract Research, Development and Manufacturing Organization (CRDMO) sector. The company projects a compound annual growth rate of approximately 19% for its CRDMO sales over the FY2026-28 period, positioning itself to benefit from favorable market conditions in this segment.",
            "Sentiment": "positive",
            "PublishDate": 1761035576301,
            "Source": "stock"
        },
        {
            "Title": "Piramal Pharma and NewAmsterdam Pharma Partner to Enhance Manufacturing Capabilities",
            "Summary": "Piramal Pharma and NewAmsterdam Pharma have announced a joint investment to improve oral solid dosage manufacturing capabilities. The investment will create over 20 new jobs at the Sellersville site as part of the capacity enhancement initiative.",
            "Sentiment": "positive",
            "PublishDate": 1755776440898,
            "Source": "stock"
        },
        {
            "Title": "Piramal Pharma Subsidiary Invests $190.3 Million in PPL Pharma Inc.",
            "Summary": "A subsidiary of Piramal Pharma has made an investment of $190.3 million in PPL Pharma Inc. The investment represents a significant capital deployment by the pharmaceutical company's subsidiary unit.",
            "Sentiment": "positive",
            "PublishDate": 1755706431201,
            "Source": "stock"
        },
        {
            "Title": "Piramal Pharma Reports Fire at Third-Party Warehouse, Rs 45 Crore Inventory Affected",
            "Summary": "Piramal Pharma Limited experienced a fire incident at a third-party warehouse in Annaram, Telangana during the night of August 6, 2025. The fire affected inventory valued at Rs 45 crores, which is covered by insurance and the claims process has begun. The fire is largely under control and emergency response actions were undertaken promptly. The cause remains under investigation. The company is working with suppliers to restore inventory and with customers to resume supplies.",
            "Sentiment": "negative",
            "PublishDate": 1754575044277,
            "Source": "stock"
        },
        {
            "Title": "Piramal Pharma Maintains FY26 Guidance, Targets $2 Billion Revenue by 2030",
            "Summary": "Piramal Pharma is maintaining its guidance for mid-single-digit revenue growth and mid-teen EBITDA margins. Chairperson Nandini Piramal noted that the company typically experiences a softer April-June quarter, with demand expected to increase in the second half. Despite short-term challenges in the US market due to uneven biotech funding, the company remains confident about achieving its 2030 target of $2 billion in revenue and 25% EBITDA margin. The CDMO business showed mid-teens growth excluding de-stocking events, with broad pickup in growth across the US and UK markets. The company brought a new site online in Digwal, Telangana at the end of April, with registrations expected throughout the year. In the consumer health segment, power brands and e-commerce led growth, with the company focusing on promotions and products that provide value for money to Indian consumers.",
            "Sentiment": "positive",
            "PublishDate": 1753869238388,
            "Source": "stock"
        },
        {
            "Title": "Piramal Pharma Sets Ambitious FY2030 Revenue Target of $2+ Billion",
            "Summary": "Piramal Pharma has outlined strategic goals for FY2030, targeting revenue exceeding $2 billion with a 25% EBITDA margin. The company plans to achieve these targets through expansion of its Contract Development and Manufacturing Organization (CDMO) business, growth in consumer health segment, and innovation in specialty products.",
            "Sentiment": "positive",
            "PublishDate": 1753720351489,
            "Source": "stock"
        },
        {
            "Title": "Piramal Pharma Reports Mixed Q1 Results with Standalone Profit but Consolidated Loss",
            "Summary": "Piramal Pharma Limited reported quarterly results for the three months ended June 30, 2025. On a standalone basis, the company posted revenue from operations of Rs. 969.88 crores and net profit of Rs. 113.14 crores, with earnings per share of Rs. 0.85. However, consolidated results showed revenue from operations of Rs. 1,933.71 crores but a net loss of Rs. 81.70 crores, resulting in negative earnings per share of Rs. 0.62. The consolidated results included an exceptional gain of Rs. 20.74 crores related to settlement proceeds from an insolvency case involving a supplier. The Board meeting was held on July 28, 2025, and the results were reviewed by statutory auditors Deloitte Haskins & Sells LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1753719577113,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Pharma Sells Decommissioned Thane Unit to Global Pharma for Rs 8.50 Crores",
            "Summary": "Piramal Pharma Limited's Administrative Committee approved the sale of its decommissioned unit located at A-159, MIDC, Wagle Industrial Estate, Thane West to Global Pharma for approximately Rs. 8.50 crores plus applicable taxes. The transaction is expected to conclude within 90 days subject to fulfillment of conditions in the sale deed. This follows the termination of a previous memorandum of understanding due to unfulfilled conditions and commercial reasons. The decommissioned unit contributed nil to the company's turnover, income, and net worth in the last financial year, meaning the sale will have no impact on company operations. Global Pharma is unrelated to the promoter/promoter group and the transaction does not qualify as a Related Party Transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1753162099662,
            "Source": "stock"
        },
        {
            "Title": "CARE Ratings Upgrades Piramal Pharma's Credit Ratings to CARE AA with Stable Outlook",
            "Summary": "CARE Ratings Limited upgraded Piramal Pharma Limited's credit ratings across multiple financial instruments. Long-term bank facilities, non-convertible debentures, and issuer rating were upgraded to CARE AA with stable outlook from CARE AA- with positive outlook. Short-term bank facilities and commercial paper ratings were reaffirmed at CARE A1+. The rating upgrade affects the company's long-term and short-term bank facilities, non-convertible debentures, issuer rating, and commercial paper instruments.",
            "Sentiment": "positive",
            "PublishDate": 1753102508764,
            "Source": "stock"
        },
        {
            "Title": "Piramal Pharma Schedules Q1FY26 Earnings Call",
            "Summary": "Piramal Pharma has announced its Q1FY26 earnings call, which is set to take place on July 29, 2025. The call is scheduled from 9:30 AM to 10:15 AM Indian Standard Time (IST).",
            "Sentiment": "neutral",
            "PublishDate": 1752829456000,
            "Source": "default"
        },
        {
            "Title": "Piramal Pharma's Unit Secures $2.4 Million Settlement from Astral",
            "Summary": "Piramal Pharma's subsidiary has reached a settlement agreement with Astral, resulting in a $2.4 million payment to the Piramal unit. No further details about the nature of the settlement or the underlying dispute were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751633002000,
            "Source": "default"
        },
        {
            "Title": "Carlyle Group to Sell Up to 10% Stake in Piramal Pharma",
            "Summary": "The Carlyle Group is planning to sell up to 10% of its stake in Piramal Pharma through block deals. This move indicates a significant change in Carlyle's investment position in the pharmaceutical company. Block deals are large-scale trades between two parties, typically conducted outside the open market.",
            "Sentiment": "neutral",
            "PublishDate": 1751544519000,
            "Source": "default"
        },
        {
            "Title": "Piramal Pharma: FDA Inspection Success Boosts Stock",
            "Summary": "Piramal Pharma's Aurora facility in Canada received zero observations and no action indicated (NAI) designation from USFDA inspection. The company remains confident about meeting its 2030 revenue and margin targets despite near-term biotech funding uncertainty. Q4 net profit increased 51.5% to ₹153.5 crore, with revenue up 7.9% to ₹2,754 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748844704000,
            "Source": "normal_news"
        },
        {
            "Title": "USFDA Inspection at Piramal Pharma's Aurora Facility Concludes Successfully",
            "Summary": "Piramal Pharma announced that the U.S. Food and Drug Administration (USFDA) inspection at the company's facility in Aurora was completed successfully. The inspection resulted in zero Form 483 observations and received a No Action Indicated (NAI) status.",
            "Sentiment": "positive",
            "PublishDate": 1748840107000,
            "Source": "default"
        },
        {
            "Title": "Piramal Pharma: Q4 FY25 Results In Line with Expectations",
            "Summary": "Piramal Pharma's Q4 FY25 sales and EBITDA were in line with expectations. Earnings fell short due to impairment of certain intangible assets. Motilal Oswal maintains a 'Buy' rating on the stock.",
            "Sentiment": "neutral",
            "PublishDate": 1747375159000,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Pharma: Goldman Sachs Sees Strong Profit Growth Potential",
            "Summary": "Goldman Sachs expresses confidence in Piramal Pharma's ability to deliver top-quartile profit growth. Q4 net profit increased 51.6% to Rs 153 crore, with revenue growing 7.9% to Rs 2,754 crore. The company aims for 25% Ebitda margin by FY30. Goldman Sachs maintains a buy rating with a target price of Rs 265 per share.",
            "Sentiment": "positive",
            "PublishDate": 1747366076000,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Pharma: CDMO Growth Slows, Recovery Expected in FY27",
            "Summary": "Piramal Pharma anticipates single-digit growth for its CDMO business in FY26 due to US policy uncertainties. Recovery expected in FY27. Company remains on track for $2 billion revenue and 25% EBITDA margin by FY30. $90 million investment announced for US facilities expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1747309442000,
            "Source": "normal_news"
        },
        {
            "Title": "Piramal Pharma: On Track for FY30 Goals Despite Biotech Funding Uncertainty",
            "Summary": "Piramal Pharma reported a net profit of ₹90 crore in FY25, up from a ₹190 crore loss in FY23. EBITDA margin improved by 500 basis points year-on-year. The company remains confident about meeting its FY30 revenue and margin targets despite near-term uncertainties in biotech funding. The CDMO segment saw 14% year-on-year revenue growth, with innovation-related work exceeding 50% of CDMO revenue. The India consumer healthcare business crossed ₹1,000 crore, with power brands growing around 20%. A $90 million expansion is planned for US facilities.",
            "Sentiment": "positive",
            "PublishDate": 1747302142000,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Pharma Reports Q4 FY23 Financial Results",
            "Summary": "Piramal Pharma announced its Q4 FY23 consolidated financial results. The company reported a net profit of 1.5 billion rupees, up from 1.01 billion rupees year-over-year and 37 million rupees quarter-over-quarter. Revenue for Q4 stood at 27.5 billion rupees, compared to 25.52 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747267588000,
            "Source": "default"
        },
        {
            "Title": "Piramal Pharma Reports Q4 FY2023 Financial Results",
            "Summary": "Piramal Pharma announced its Q4 FY2023 financial results. The company reported a consolidated net profit of 1.5 billion rupees, up from 1.01 billion rupees year-over-year. Quarterly revenue increased to 27.5 billion rupees from 25.52 billion rupees in the same period last year. EBITDA for Q4 was 5.6 billion rupees, slightly higher than the 5.3 billion rupees in the previous year. However, the EBITDA margin decreased marginally to 20.41% from 20.76% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747236324000,
            "Source": "result"
        },
        {
            "Title": "Piramal Pharma: $90 Million Investment in US Facilities Expansion",
            "Summary": "Piramal Pharma is investing $90 million to expand its Lexington and Riverview facilities in the US, aligning with growing customer demand and onshoring trends. The Lexington expansion will be completed by late 2027, while the Riverview facility will be operational by end of 2025. Additionally, the USFDA issued an EIR with VAI status for the company's Turbhe facility.",
            "Sentiment": "positive",
            "PublishDate": 1747105704000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Pharma: $90 Million Investment in US Manufacturing Expansion",
            "Summary": "Piramal Pharma Ltd. plans to invest $90 million to expand manufacturing capabilities at two US facilities in Lexington, Kentucky, and Riverview, Michigan. The expansion addresses increasing US customer demand and the trend of onshoring drug supply. The Lexington site will add 24,000 sq ft of new manufacturing space, including commercial-scale production for injectable drug products, with operations expected to start by late 2027.",
            "Sentiment": "positive",
            "PublishDate": 1747053088000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Pharma Invests $90M in US Facility Expansions",
            "Summary": "Piramal Pharma announces continued investment in the USA, with $90 million allocated for expansions of two US sites. The company is adding commercial-scale sterile injectables capabilities to its Lexington, Kentucky facility.",
            "Sentiment": "positive",
            "PublishDate": 1747049650000,
            "Source": "default"
        },
        {
            "Title": "US FDA Issues EIR for Piramal Pharma Facility",
            "Summary": "Piramal Pharma has announced that the US FDA has issued an Establishment Inspection Report (EIR) for their manufacturing facility. The EIR comes with a Voluntary Action Indicated (VAI) status, which marks the successful closure of the inspection.",
            "Sentiment": "positive",
            "PublishDate": 1747027919000,
            "Source": "default"
        },
        {
            "Title": "Piramal Pharma to Consider Q4 Results on May 14",
            "Summary": "Piramal Pharma Limited has announced that it will consider its fourth quarter (Q4) financial results on May 14. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1745930694000,
            "Source": "default"
        },
        {
            "Title": "Piramal Pharma Begins Commercial Production of Sevoflurane in Telangana",
            "Summary": "Piramal Pharma has announced the commencement of commercial production of Sevoflurane at its facility located in Telangana. Sevoflurane is an inhalational anesthetic agent used for induction and maintenance of general anesthesia. This development marks an important milestone for the company's pharmaceutical manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1743563698000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Critical Care's Neoatricon® Receives MHRA Approval in UK",
            "Summary": "Brepco Biopharma and Piramal Critical Care have announced that Neoatricon®, a paediatric formulation for treating hypotension in neonates, infants, and children, has received approval from the Medicines and Healthcare products Regulatory Agency (MHRA) in the United Kingdom.",
            "Sentiment": "positive",
            "PublishDate": 1742516454000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Critical Care's Neoatricon® Receives MHRA Approval in UK",
            "Summary": "Brepco Biopharma and Piramal Critical Care have announced that their paediatric formulation Neoatricon® has received approval from the UK's Medicines and Healthcare products Regulatory Agency (MHRA). Neoatricon® is designed for the treatment of hypotension in neonates, infants, and children.",
            "Sentiment": "positive",
            "PublishDate": 1742471320000,
            "Source": "corporate_action"
        },
        {
            "Title": "FDA Inspection at Piramal Pharma's Turbhe Facility Results in Form-483 with 6 Observations",
            "Summary": "The US Food and Drug Administration (FDA) conducted a Good Manufacturing Practice (GMP) inspection at Piramal Pharma's facility in Turbhe. Following the inspection, the FDA issued a Form-483 with six observations. These observations primarily focus on procedural improvements and do not involve data integrity issues.",
            "Sentiment": "neutral",
            "PublishDate": 1739924312000,
            "Source": "corporate_governance"
        },
        {
            "Title": "US FDA Inspection at Piramal Pharma's Turbhe Facility Results in Form-483",
            "Summary": "The US Food and Drug Administration (FDA) conducted a Good Manufacturing Practice (GMP) inspection at Piramal Pharma's facility in Turbhe. Following the inspection, the FDA issued a Form-483 with six observations. These observations primarily focus on areas for procedure improvements and do not relate to data integrity issues.",
            "Sentiment": "neutral",
            "PublishDate": 1739879066000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Piramal Pharma Reports Q3 FY24 Financial Results",
            "Summary": "Piramal Pharma announced its Q3 financial results. The company reported a consolidated net profit of 37 million rupees, which is lower compared to 101 million rupees in the same quarter last year (YoY) but higher than 226 million rupees in the previous quarter (QoQ). Revenue for Q3 stood at 22.04 billion rupees, showing an increase from 19.58 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738109787000,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Pharma Reports Improved Q3 EBITDA and Margin",
            "Summary": "Piramal Pharma has announced its financial results for the third quarter. The company's EBITDA increased to 3.4 billion rupees from 2.69 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 15.34% from 13.72% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738077449000,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Pharma Reports Q3 Financial Results",
            "Summary": "Piramal Pharma announced its Q3 consolidated net profit of 37 million rupees, showing a decrease from 101 million rupees year-over-year but an increase from 226 million rupees quarter-over-quarter. The company's Q3 revenue rose to 22.04 billion rupees from 19.58 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738077393000,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Critical Care Launches Chlorpromazine Hydrochloride Injection in U.S.",
            "Summary": "Piramal Critical Care, a unit of Piramal Pharma, has announced the U.S. launch of Chlorpromazine Hydrochloride for Injection, USP. This launch expands the company's product portfolio in the U.S. pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1737591024000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Pharma: Launches Chlorpromazine Injection in US Market",
            "Summary": "Piramal Critical Care, a division of Piramal Pharma Ltd, has launched Chlorpromazine Hydrochloride for Injection, USP in the US. The product is available in 25 mg/1 mL and 50 mg/2 mL vial formats, expanding the company's generic injectables portfolio. This launch follows recent introductions of other generic injectables by the company in 2023 and 2024.",
            "Sentiment": "positive",
            "PublishDate": 1737566985000,
            "Source": "normal_news"
        },
        {
            "Title": "Piramal Critical Care Launches Chlorpromazine Hydrochloride Injection in U.S.",
            "Summary": "Piramal Critical Care, a unit of Piramal Pharma, has announced the launch of Chlorpromazine Hydrochloride for Injection, USP in the United States. This launch expands the company's product portfolio in the critical care segment of the U.S. pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1737560609000,
            "Source": "corporate_action"
        },
        {
            "Title": "Piramal Pharma to Consider Q3 Results on January 28",
            "Summary": "Piramal Pharma Limited has announced that it will consider its financial results for the third quarter of the current fiscal year on January 28. This indicates that the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1736774424000,
            "Source": "earnings"
        },
        {
            "Title": "Piramal Pharma: Shares Surge 8% Amid Market Downturn",
            "Summary": "Piramal Pharma's stock rose over 8% on January 13, breaking a three-day losing streak. Jefferies maintained a 'buy' rating and raised the price target to ₹310. The company is expected to show continued momentum in 2025, particularly in Contract Manufacturing. All 10 analysts covering the stock have a 'buy' rating.",
            "Sentiment": "positive",
            "PublishDate": 1736747445000,
            "Source": "normal_news"
        },
        {
            "Title": "Piramal Pharma: $85 Million Capex Plan for FY2024-25",
            "Summary": "Piramal Pharma is deploying $85 million in capex for FY2024-25, focusing on capacity expansion, maintenance, and de-bottlenecking of CDMO sites. $30 million has been invested in the first half. The company aims to exceed $2 billion in revenue by FY30, with plans for expansion in Telangana and Gujarat plants.",
            "Sentiment": "positive",
            "PublishDate": 1730011438000,
            "Source": "normal_news"
        }
    ]
}