{
    "Symbol": "PRABHA",
    "ISIN": "INE0I0M01023",
    "News": [
        {
            "Title": "Prabha Energy Q3FY26 Net Profit Jumps to ₹88.75 Lakhs",
            "Summary": "Prabha Energy Limited reported strong Q3FY26 results with net profit of ₹88.75 lakhs vs loss of ₹23.04 lakhs in Q3FY25. Revenue from operations grew to ₹134.86 lakhs from ₹40.13 lakhs YoY.",
            "Sentiment": "positive",
            "PublishDate": 1770733762080,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prabha Energy Approves Board Changes via Postal Ballot",
            "Summary": "Prabha Energy Limited successfully completed postal ballot voting with 88.55% participation, approving appointment of independent director and management changes for Shanil Paras Savla.",
            "Sentiment": "positive",
            "PublishDate": 1770046501133,
            "Source": "stocks"
        },
        {
            "Title": "Prabha Energy announces postal ballot for key appointments",
            "Summary": "Prabha Energy Limited initiates postal ballot process for appointment of independent director and managing director with e-voting from January 1-30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767086873956,
            "Source": "stocks"
        },
        {
            "Title": "Prabha Energy MD Shail Savla Resigns Dec 31",
            "Summary": "Prabha Energy's Managing Director Shail Manoj Savla resigned effective December 31, 2025, citing personal reasons including pre-occupation and paucity of time.",
            "Sentiment": "neutral",
            "PublishDate": 1766752935123,
            "Source": "co_actions_results"
        },
        {
            "Title": "Deep Industries Acquires 70% Stake in Deep Natural Resources Limited for Rs. 1.13 Crore",
            "Summary": "Deep Industries Limited acquired 350,000 equity shares representing 70% ownership in Deep Natural Resources Limited (DNRL) at Rs. 32.25 per share, making DNRL its subsidiary. The acquisition creates synergy between both oil and gas support services businesses, enhancing operational capabilities and cost optimization for the combined entity.",
            "Sentiment": "neutral",
            "PublishDate": 1764683211431,
            "Source": "corporate_action"
        },
        {
            "Title": "Prabha Energy Limited Commences Commercial CBM Gas Production from North Karanpura Block",
            "Summary": "Prabha Energy Limited has started commercial production of Coal Bed Methane (CBM) gas as joint operator from the North Karanpura CBM Block. The company has begun gas sales through cascades as an early monetization measure while gas evacuation pipeline connection work is ongoing. Upon completion of the connecting gas evacuation pipeline, gas sale volumes are expected to increase significantly. Chairman and Director Prem Singh Sawhney stated this milestone represents the company's commitment to strengthening its position in India's unconventional energy sector and contributing to the country's energy security. The company is strategically positioned to play a leading role in the CBM segment, aligned with the Central Government's plan to increase CBM gas production to 5.0 MMSCMD by FY2027-28.",
            "Sentiment": "positive",
            "PublishDate": 1762305115362,
            "Source": "stock"
        },
        {
            "Title": "Prabha Energy Approves Quarterly Results and Appoints New Independent Director",
            "Summary": "Prabha Energy Limited's Board of Directors approved the company's un-audited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The board also appointed Mrs. Shivangi Digant Shah as an Additional Non-Executive Independent Director for a five-year term from November 4, 2025 to November 3, 2030, subject to shareholder approval. Shah holds a Master's degree in Business Administration from Gujarat University and is an Associate Member of the Institute of Company Secretaries of India, with over seven years of experience in the secretarial and compliance sector. She currently serves as Company Secretary and Compliance Officer of Rajgor Proteins Limited and is not related to any other director of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762256275540,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prabha Energy Limited Commences Commercial CBM Gas Production from North Karanpura Block",
            "Summary": "Prabha Energy Limited has started commercial production of Coal Bed Methane (CBM) gas as joint operator from the North Karanpura CBM Block. The company is selling gas through cascades as an early monetization measure while gas evacuation pipeline work continues. Chairman and Director Prem Singh Sawhney stated that gas sales have recently begun generating revenues, with income expected to steadily rise over time. This production milestone aligns with the company's strategy to strengthen its position in India's unconventional energy sector and contribute to energy security. The company operates a diversified portfolio including CBM, Marginal Gas Fields and NELP blocks, positioning itself to benefit from the government's plan to increase CBM gas production to 5.0 MMSCMD by 2027-28.",
            "Sentiment": "positive",
            "PublishDate": 1755002188398,
            "Source": "stock"
        },
        {
            "Title": "Prabha Energy Completes Distribution of Fractional Share Proceeds from Merger Scheme",
            "Summary": "Prabha Energy Limited has completed the distribution of proceeds to eligible shareholders from fractional shares resulting from its composite scheme of arrangement. The scheme involved the amalgamation of Deep Energy Resources Limited and Savla Oil and Gas Private Limited with Prabha Energy Limited, which became effective on September 22, 2024. Under the arrangement, 11,358 shareholders became entitled to fractional entitlements totaling 6,024 equity shares. These fractional shares were sold on May 16, 2025, at an average price of INR 196.11 per share, generating gross proceeds of INR 1,181,349.99. After deducting expenses of INR 13,316.70, net proceeds of INR 1,168,018.53 were distributed to eligible shareholders on July 16, 2025. The company's Audit Committee and Independent Directors have certified that the proceeds were distributed proportionally to shareholders' fractional entitlements in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753191986276,
            "Source": "corporate_action"
        }
    ]
}