{
    "Symbol": "PRAENG",
    "ISIN": "INE505C01016",
    "News": [
        {
            "Title": "Prajay Engineers Allots 72.69 Lakh Convertible Warrants on Preferential Basis",
            "Summary": "Prajay Engineers Syndicate Limited allotted 72,69,566 convertible warrants at Rs. 23 per warrant to 10 allottees including promoters and non-promoters, with 25% upfront payment received. The warrants are convertible into equity shares within 18 months and will increase the company's paid-up share capital from Rs. 69.94 crore to Rs. 77.21 crore upon full conversion.",
            "Sentiment": "positive",
            "PublishDate": 1763555616937,
            "Source": "corporate_action"
        },
        {
            "Title": "Prajay Engineers Syndicate Reports Quarterly Loss, Approves Unaudited Results",
            "Summary": "Prajay Engineers Syndicate's Board approved unaudited financial results for the second quarter and half year ended September 30, 2025, showing standalone loss of Rs 631.79 lakhs and consolidated loss of Rs 614.28 lakhs for the quarter. The company operates in construction & development and hospitality segments, with ongoing arbitration proceedings related to government agreements affecting operations.",
            "Sentiment": "negative",
            "PublishDate": 1763043127143,
            "Source": "earnings"
        },
        {
            "Title": "Prajay Engineers Syndicate Schedules Board Meeting to Consider Fund Raising and AGM Approval",
            "Summary": "Prajay Engineers Syndicate Limited has scheduled a Board of Directors meeting for September 2, 2025. The board will consider and approve a proposal for raising funds through issuance of equity shares, convertible securities, convertible warrants, or other permitted modes through Preferential Allotment/Private Placement to promoter and non-promoter categories. The meeting agenda also includes appointing an Allotment Committee for fund-raising activities, approving the Annual General Meeting notice, and fixing the AGM date. The fund-raising proposal is subject to regulatory and statutory approvals, including shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1756124700477,
            "Source": "corporate_action"
        },
        {
            "Title": "Prajay Engineers Syndicate Reports Q1 FY2026 Results, Appoints New Internal Auditor",
            "Summary": "Prajay Engineers Syndicate Limited's Board approved unaudited financial results for Q1 FY2025-26 ended June 30, 2025, and appointed M Shanker as Internal Auditor. The company reported a standalone loss of Rs 230.27 lakhs compared to Rs 215.53 lakhs loss in the corresponding quarter last year. Revenue from operations increased to Rs 714.46 lakhs from Rs 249.20 lakhs year-over-year. On a consolidated basis, the company posted a loss of Rs 319.88 lakhs versus Rs 537.27 lakhs loss in the same quarter previous year, while consolidated revenue grew to Rs 1,471.14 lakhs from Rs 470.98 lakhs. The company operates in two segments: Construction and Development, and Hospitality - Hotels and Resorts. Settlement agreements have been executed in disputes with investor entities White Stock Limited and Belclare Limited, with cases before NCLT Hyderabad being disposed of. Arbitration proceedings continue with the Telangana government regarding lease and construction agreements.",
            "Sentiment": "neutral",
            "PublishDate": 1755175173711,
            "Source": "earnings"
        }
    ]
}