{
    "Symbol": "PRAJIND",
    "ISIN": "INE074A01025",
    "News": [
        {
            "Title": "Praj Industries schedules Q3FY26 earnings call",
            "Summary": "Praj Industries announces analysts' call on February 13, 2026 at 12:00 PM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770629160232,
            "Source": "co_actions_results"
        },
        {
            "Title": "Praj Demonstrates Ethanol-to-Jet SAF Technology",
            "Summary": "Praj Industries successfully demonstrates Ethanol-to-Jet pathway for Sustainable Aviation Fuel using Axens Jetanol™ technology at its integrated demo plant, positioning as first company globally to offer end-to-end AtJ solutions.",
            "Sentiment": "positive",
            "PublishDate": 1769684600215,
            "Source": "stocks"
        },
        {
            "Title": "Praj Industries Promoter Group Completes Inter-se Share Transfer of 72 Lakh Shares",
            "Summary": "Dr Pramod Chaudhari acquired 72,00,000 shares (3.917% stake) from Moriyaset Trust through an off-market inter-se transfer on December 9, 2025, increasing his holding from 21.054% to 24.971%. The transaction was conducted among promoter group members due to trust dissolution, with the aggregate promoter group holding remaining unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1765358975043,
            "Source": "corporate_action"
        },
        {
            "Title": "Praj Industries Appoints Kumar Puri as Corporate Head for Health, Safety & Environment",
            "Summary": "Praj Industries Limited appointed Mr. Kumar Puri as Corporate Head-Health, Safety Environment, designated as Senior Management Personnel, effective December 9, 2025. The appointee brings over 23 years of experience in driving safety culture across different industries and holds multiple certifications including chemical engineering degree and industrial safety credentials.",
            "Sentiment": "positive",
            "PublishDate": 1765263698966,
            "Source": "corporate_governance"
        },
        {
            "Title": "Praj Industries Reports Inter-se Share Transfer of 72 Lakh Shares Among Promoter Group",
            "Summary": "Dr. Pramod Chaudhari will acquire 72,00,000 shares (3.917% stake) from Moriyaset Trust within Praj Industries' promoter group on or after December 9, 2025. The transfer is due to dissolution of Moriyaset Trust and falls under SEBI exemption regulations, with overall promoter group holding remaining unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1764675927396,
            "Source": "corporate_action"
        },
        {
            "Title": "Praj Industries Reports Mixed Q2 FY26 Results Amid Domestic Ethanol Headwinds",
            "Summary": "Praj Industries reported consolidated revenue of Rs. 8.42 billion in Q2 FY26 versus Rs. 8.16 billion in Q2 FY25. However, profit before tax declined significantly to Rs. 296.1 million from Rs. 744.4 million, while profit after tax dropped to Rs. 192.8 million from Rs. 538 million year-over-year. The company faces challenges in domestic ethanol segment due to India achieving its EBP20 target and current production capacity meeting requirements. International business is impacted by US tariff scenarios. Order intake for the quarter was Rs. 8.1 billion with 73% from domestic market, comprising 71% from bioenergy, 16% from engineering, and 13% from PHS business. Order backlog stands at Rs. 44.2 billion as of September 30, 2025. The company is pivoting GenX facility strategy toward oil and gas markets due to stalled energy transition projects. Praj successfully commissioned its first alcohol-to-jet SAF demo plant and is executing its first low carbon ethanol project in the USA. Cash in hand is Rs. 4.37 billion.",
            "Sentiment": "neutral",
            "PublishDate": 1762772580691,
            "Source": "earnings"
        },
        {
            "Title": "Praj Industries Reports 64% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "Praj Industries reported Q2 consolidated net profit of 193 million rupees, down from 538 million rupees in the same quarter last year. Revenue increased to 8.42 billion rupees from 8.16 billion rupees year-over-year. EBITDA declined significantly to 320 million rupees from 862 million rupees, while EBITDA margin compressed to 3.81% from 10.56% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762341937565,
            "Source": "earnings"
        },
        {
            "Title": "Praj Industries Provides Low-Carbon Solution for Aemetis California Ethanol Facility",
            "Summary": "Praj Industries has developed a low-carbon solution that is expected to significantly reduce carbon emissions at Aemetis' California ethanol facility. The solution targets environmental impact reduction in ethanol production operations.",
            "Sentiment": "positive",
            "PublishDate": 1759813859764,
            "Source": "stock"
        },
        {
            "Title": "Praj Industries Shares Investor Presentation Highlighting Global Biotech Leadership and Financial Performance",
            "Summary": "Praj Industries Limited submitted an investor presentation to NSE and BSE for distribution to investors. The company, incorporated in 1983, operates as a biotechnology and engineering company with presence across 100+ countries and 1000+ customer references. The presentation highlights the company's 41-year legacy with 5 manufacturing facilities, 1800+ employees, 90+ research scientists, and 400+ patents. Financial highlights show operational revenue of INR 32,280 million in FY25 with 10.06% EBITDA margins. The company reported a 3-year revenue CAGR of 11%, EBITDA CAGR of 16%, and PAT CAGR of 13%. Order book stands at INR 44,480 million as of Q1-FY26 with order intake of INR 7,950 million in Q1-FY26. The company operates across bioenergy, high purity solutions, engineering businesses, and R&D segments, offering solutions for ethanol plants, compressed bio-gas, sustainable aviation fuel, water systems, and renewable chemicals.",
            "Sentiment": "positive",
            "PublishDate": 1757481276996,
            "Source": "stock"
        },
        {
            "Title": "Praj Industries Reports Sharp Decline in Q1 FY26 Results with Revenue Down to Rs 640 Crore",
            "Summary": "Praj Industries reported consolidated revenue of Rs 640 crore for Q1 FY26, down from Rs 699 crore in Q1 FY25. Profit before tax dropped significantly to Rs 9.61 crore compared to Rs 78.88 crore in the previous year, while profit after tax fell to Rs 5.34 crore from Rs 84.1 crore. EBITDA margin hit 4.9%, marking the lowest in 15-16 quarters. The company secured order intake of Rs 795 crore with an order backlog of Rs 4,450 crore. India achieved its EBP20 ethanol blending target ahead of schedule, leading to a slowdown in new greenfield ethanol plant orders due to excess capacity. The company faces challenges from US tariff uncertainty affecting its GenX facility and liquidity issues among domestic customers causing project delays. Management expects profitability improvement from H2 FY26 onwards and maintains commitment to Vision 2030 growth targets despite near-term headwinds.",
            "Sentiment": "negative",
            "PublishDate": 1755512587023,
            "Source": "earnings"
        },
        {
            "Title": "Praj Industries Shareholders Approve All 9 Resolutions at 39th AGM Including Leadership Changes",
            "Summary": "Praj Industries held its 39th Annual General Meeting on August 11, 2025 via video conferencing, where shareholders approved all nine resolutions with requisite majority. Key approvals included adoption of standalone and consolidated financial statements for the year ended March 31, 2025, declaration of Rs. 6 dividend per equity share (300% on Rs. 2 face value), and appointment of Mr. Parth Chaudhari replacing Ms. Parimal Chaudhari who retired by rotation. Shareholders also approved the appointment of Dr. Pramod Chaudhari as Founder Chairman and Mentor-Praj Group for five years from July 1, 2025 to June 30, 2030, which received 77.03% votes in favor. The meeting saw appointment of new auditors including MSKA & Associates as statutory auditors and MSN Associates as secretarial auditors. Remote e-voting was conducted from August 7-10, 2025, with Vikas Khare of KANJ & Co. LLP serving as scrutinizer.",
            "Sentiment": "positive",
            "PublishDate": 1755008883938,
            "Source": "corporate_action"
        },
        {
            "Title": "Praj Industries Reports ₹3,254 Crore Order Book, Expands into SAF and CBG with Zero Debt",
            "Summary": "Praj Industries maintains a robust order book worth ₹3,254 crore and is leveraging its bioenergy expertise for growth initiatives. The company is expanding into Sustainable Aviation Fuel (SAF) and Compressed Biogas (CBG) sectors while also focusing on profitable engineering exports. The company operates with no debt as part of its sustainable expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1754923009629,
            "Source": "stock"
        },
        {
            "Title": "Praj Industries Reports Sharp Decline in Q1 Profitability",
            "Summary": "Praj Industries reported quarterly results showing significant declines across key financial metrics. EBITDA dropped to 314 million rupees from 919.8 million rupees year-over-year, while EBITDA margin compressed to 4.9% from 13.16%. Consolidated net profit fell sharply to 53 million rupees compared to 841.8 million rupees in the same period last year. Revenue also declined to 6.4 billion rupees from 6.99 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754907892421,
            "Source": "earnings"
        },
        {
            "Title": "Praj Industries: Secures Major Bioethanol Project in Paraguay",
            "Summary": "Praj Industries has been selected by Enersur S.A. for a fully integrated BioRefinery Project in Paraguay. The project includes ethanol production along with various co-products. Praj will provide technology licensing, engineering design, core equipment supply, and supervisory support. The plant is expected to be operational by October 2026.",
            "Sentiment": "positive",
            "PublishDate": 1749181530000,
            "Source": "order&deals"
        },
        {
            "Title": "Praj Industries: Secures International Biorefinery Project in Paraguay",
            "Summary": "Praj Industries partners with Enersur SA to develop a fully-integrated biorefinery in Paraguay. The project includes a 600 m³/day anhydrous ethanol plant using corn as feedstock. The agreement was signed during the Paraguayan President's visit to India. The plant is expected to be operational by October 2026.",
            "Sentiment": "positive",
            "PublishDate": 1749128105000,
            "Source": "order&deals"
        },
        {
            "Title": "Paraguay's President Announces $150m Biofuel Plant Deal with Praj Industries",
            "Summary": "Paraguay's President Pena has announced a deal to construct a new $150 million biofuel plant. The project involves national investment and collaboration with Praj Industries. The announcement was reported by Reuters, but no further details about the specific nature of Praj Industries' involvement or the timeline for the plant's construction were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749082106000,
            "Source": "default"
        },
        {
            "Title": "Praj Industries Partners with IATA and ISMA for SAF Certification in India",
            "Summary": "Praj Industries has formed a partnership with the International Air Transport Association (IATA) and the Indian Sugar Mills Association (ISMA) to advance Sustainable Aviation Fuel (SAF) carbon assessment and certification in India. The collaboration aims to determine the carbon intensity of sugarcane-based jet fuel and develop India-specific certification standards that align with ISCC and RSB CORSIA standards.",
            "Sentiment": "positive",
            "PublishDate": 1748995723000,
            "Source": "default"
        },
        {
            "Title": "Praj Industries Partners for SAF Carbon Assessment in India",
            "Summary": "Praj Industries has entered into a partnership to advance Sustainable Aviation Fuel (SAF) carbon assessment and certification in India. The partnership aims to promote sustainable practices in the aviation industry.",
            "Sentiment": "positive",
            "PublishDate": 1748954157000,
            "Source": "default"
        },
        {
            "Title": "Praj Industries Q4 Results and Strategic Partnership",
            "Summary": "Praj Industries reported Q4 consolidated net profit of 398 million rupees, down from 919 million rupees year-over-year and 411 million rupees quarter-over-quarter. Q4 revenue was 8.6 billion rupees, compared to 10 billion rupees in the previous year. Additionally, Praj Industries has formed a partnership with Thyssenkrupp Uhde Ltd to advance polylactic acid production and circular economy initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1745972727000,
            "Source": "default"
        },
        {
            "Title": "Praj Industries: Q4 Profit Plunges 56.7%, ₹6 Final Dividend Declared",
            "Summary": "Praj Industries reported a 56.7% YoY drop in Q4 FY25 net profit to ₹39.8 crore. Revenue fell 15.6% to ₹859.7 crore. EBITDA margin contracted to 8.6%. FY25 revenue was ₹3,228 crore with net profit at ₹218.9 crore. Q4 order intake was ₹1,032 crore with a backlog of ₹4,293 crore. A final dividend of ₹6 per share was proposed.",
            "Sentiment": "negative",
            "PublishDate": 1745935034000,
            "Source": "earnings"
        },
        {
            "Title": "Praj Industries Reports Q4 Financial Results",
            "Summary": "Praj Industries announced its Q4 financial results. The company's EBITDA decreased to 739 million rupees from 1.31 billion rupees year-over-year. The EBITDA margin fell to 8.60% from 12.84% in the same period. Consolidated net profit declined to 398 million rupees from 919 million rupees year-over-year and 411 million rupees quarter-over-quarter. Revenue for Q4 was 8.6 billion rupees, down from 10 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1745930999000,
            "Source": "result"
        },
        {
            "Title": "Praj Industries Inaugurates 300 KLPD Grain-Based Distillery for Keyaan Distilleries",
            "Summary": "Praj Industries has announced the inauguration of a 300 KLPD (Kilo Liters Per Day) grain-based distillery designed and engineered for Keyaan Distilleries. This development showcases Praj Industries' expertise in providing engineering solutions for the distillery sector.",
            "Sentiment": "positive",
            "PublishDate": 1744096690000,
            "Source": "corporate_action"
        },
        {
            "Title": "Praj Industries Reports Q3 Financial Results",
            "Summary": "Praj Industries has announced its Q3 consolidated financial results. The company reported a net profit of 411 million rupees, which is lower compared to 704 million rupees in the same quarter last year (YoY) and 538.2 million rupees in the previous quarter (QoQ). However, the company's revenue increased to 8.53 billion rupees from 8.3 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738284324000,
            "Source": "earnings"
        },
        {
            "Title": "Praj Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Praj Industries has reported a decrease in its Q3 EBITDA, which fell to 727.1 million rupees from 976 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 8.52% from 11.78% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738238420000,
            "Source": "earnings"
        },
        {
            "Title": "Praj Industries Reports Q3 Revenue Growth",
            "Summary": "Praj Industries announced its third quarter revenue of 8.53 billion rupees, showing an increase from 8.3 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738238411000,
            "Source": "earnings"
        },
        {
            "Title": "Praj Industries Reports Q3 Financial Results",
            "Summary": "Praj Industries has announced its consolidated net profit for the third quarter. The company reported a net profit of 411 million rupees, which is lower compared to both the previous year (704 million rupees) and the previous quarter (538.2 million rupees).",
            "Sentiment": "negative",
            "PublishDate": 1738238397000,
            "Source": "earnings"
        },
        {
            "Title": "Praj Industries: Kotak Initiates Coverage with 'Add' Rating",
            "Summary": "Kotak Institutional Equities initiated coverage on Praj Industries with an 'Add' rating and a fair value of Rs 880, citing the company's strong position in decarbonizing mobility. Kotak expects 15%/18%/22% CAGR in revenue/Ebitda/PAT during FY2024-27, with potential growth in compressed bio-gas, sustainable aviation fuel, and global 1G ethanol opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1736404070000,
            "Source": "normal_news"
        },
        {
            "Title": "Praj Industries: India's First Highway with Bio-Bitumen Aims to Save $500 Million",
            "Summary": "India has constructed its first national highway stretch using lignin-based bio-bitumen, developed by Praj Industries in collaboration with CSIR-CRRI, NHAI, and Oriental Structural Engineers. The Nagpur-Mansar Bypass on NH-44 uses up to 15% bio-bitumen blending, potentially saving ₹4,000–4,500 crore in foreign exchange. This sustainable alternative reduces greenhouse gas emissions by up to 70% compared to conventional bitumen.",
            "Sentiment": "positive",
            "PublishDate": 1735030836000,
            "Source": "normal_news"
        },
        {
            "Title": "Praj Industries Introduces Eco-Friendly Construction Material",
            "Summary": "Praj Industries has announced a new green construction material that can be blended up to 15% with traditional materials. This innovative product offers significant environmental benefits, including a 70% reduction in greenhouse gas emissions compared to fossil-based bitumen.",
            "Sentiment": "positive",
            "PublishDate": 1734936243000,
            "Source": "corporate_action"
        },
        {
            "Title": "India's First National Highway Using Bio-Bitumen Inaugurated",
            "Summary": "Hon'ble Minister Shri Nitin Gadkari has inaugurated India's first National Highway that utilizes bio-bitumen developed by Praj Industries. This marks a significant milestone in sustainable road construction and showcases Praj Industries' innovation in creating eco-friendly alternatives for infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1734936207000,
            "Source": "corporate_action"
        },
        {
            "Title": "Praj Industries: Share Price Surges 14% on Ambitious Growth Plan",
            "Summary": "Praj Industries' stock rose 14% intraday after announcing plans to triple revenue by 2030. The company aims to focus on biopolymers, sustainable aviation fuel, and energy transition to achieve this growth target.",
            "Sentiment": "positive",
            "PublishDate": 1732268975000,
            "Source": "normal_news"
        },
        {
            "Title": "Praj Industries Targets Revenue Growth and Export Expansion by 2030",
            "Summary": "Praj Industries has announced ambitious growth plans. The company's current annual revenue is approximately Rs 3,400 crore, with a goal to reach Rs 10,000 crore by 2030. Additionally, Praj aims to increase its export share from the current 29% to 50% by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1732250669000,
            "Source": "corporate_action"
        },
        {
            "Title": "Praj Industries Invests Rs 400 Crore in Advanced Manufacturing Facility",
            "Summary": "Praj Industries has announced an investment of Rs 400 crore in a new 123-acre advanced manufacturing facility located in Mangalore, Karnataka. The company expects this facility to generate an annual revenue potential of Rs 2000-2500 crore when operating at full capacity.",
            "Sentiment": "positive",
            "PublishDate": 1732250588000,
            "Source": "corporate_action"
        },
        {
            "Title": "Praj Industries Targets Tripling Revenue by 2030",
            "Summary": "Praj Industries has announced ambitious growth plans, aiming to triple its revenue by 2030. The company sees new opportunities on the horizon that will drive this significant expansion. This forward-looking statement suggests confidence in the company's future prospects and potential for substantial business growth.",
            "Sentiment": "positive",
            "PublishDate": 1732250473000,
            "Source": "corporate_action"
        },
        {
            "Title": "Praj Industries Reports Improved Q2 EBITDA and Margin",
            "Summary": "Praj Industries has announced its Q2 financial results. The company's EBITDA increased to 862 million rupees from 840 million rupees year-over-year. Additionally, the EBITDA margin improved to 10.56% from 9.52% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729860665000,
            "Source": "result"
        },
        {
            "Title": "Praj Industries Reports Q2 Revenue Decline",
            "Summary": "Praj Industries, an Indian engineering company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 8.16 billion rupees, showing a decrease from 8.82 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1729860656000,
            "Source": "result"
        },
        {
            "Title": "Praj Industries Reports Q2 FY24 Financial Results",
            "Summary": "Praj Industries, an Indian engineering company, has announced its consolidated net profit for the second quarter of the fiscal year 2024. The company reported a net profit of 538 million rupees, which represents a year-over-year decrease from 623 million rupees in the same quarter last year. However, it shows a quarter-over-quarter increase from 841 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729860643000,
            "Source": "result"
        },
        {
            "Title": "Praj Industries: Launches India's First Biopolymer Demo Plant",
            "Summary": "Praj Industries unveiled India's first demonstration facility for biopolymers near Pune on October 13, 2024. The facility showcases indigenous Polylactic Acid (PLA) technology with production capacities of 100 tonnes per annum for Lactic Acid, 60 tonnes for lactide, and 55 tonnes for PLA. This initiative aligns with the government's Bio-E3 Policy and Bio-RIDE scheme, addressing India's plastic waste challenge.",
            "Sentiment": "positive",
            "PublishDate": 1729142281000,
            "Source": "normal_news"
        },
        {
            "Title": "Praj Industries Unveils India's First Biopolymer Demonstration Facility",
            "Summary": "Praj Industries has launched India's first demonstration facility for biopolymers, specifically Polylactic Acid (PLA), in Pune. This initiative positions the company as a leader in the bioplastics industry, showcasing their commitment to sustainable and eco-friendly materials.",
            "Sentiment": "positive",
            "PublishDate": 1729131257000,
            "Source": "corporate_action"
        }
    ]
}