{
    "Symbol": "PRAKASH",
    "ISIN": "INE603A01013",
    "News": [
        {
            "Title": "Prakash Industries Reports Mixed Q2 Results, Announces CFO Change",
            "Summary": "Prakash Industries posted quarterly net sales of ₹723 crores with profit after tax of ₹62 crores, while half-year results showed net sales of ₹1,760 crores and PAT of ₹153 crores with EPS of ₹8.54. The company announced Deepak Mishra will cease as CFO on November 30, 2025, with Prashant Gupta taking over from December 1, 2025, citing extended monsoon impact on quarterly performance despite positive outlook from GST reforms and infrastructure activity resumption.",
            "Sentiment": "negative",
            "PublishDate": 1763111113186,
            "Source": "earnings"
        },
        {
            "Title": "Prakash Industries Reports Delhi High Court Sets Aside Previous Single Judge Bench Ruling",
            "Summary": "Prakash Industries Limited informed stock exchanges that the Division Bench of Delhi High Court set aside a ruling from the Single Judge Bench dated July 19, 2022, through a judgment dated October 17, 2025. The company received the certified true copy of the court judgment and stated it is seeking legal remedy against the order. The company trades on BSE under code 506022 and on NSE under symbol PRAKASH.",
            "Sentiment": "neutral",
            "PublishDate": 1762476268714,
            "Source": "corporate_governance"
        },
        {
            "Title": "Dolly Khanna Increases Stake in Prakash Industries to 2.94% During Q2",
            "Summary": "Investor Dolly Khanna increased her stake in Prakash Industries to 2.94% during Q2, adding 0.67% to her existing position in the company.",
            "Sentiment": "positive",
            "PublishDate": 1760001095934,
            "Source": "stock"
        },
        {
            "Title": "Prakash Industries Sets September 17, 2025 as Record Date for 2024-25 Dividend Distribution",
            "Summary": "Prakash Industries Limited has fixed Wednesday, September 17, 2025, as the record date to determine shareholder eligibility for receiving dividends for the financial year 2024-25. The company communicated this decision to BSE Ltd. through a formal notification dated September 9, 2025. The record date will establish which shareholders are entitled to receive the declared dividend payment.",
            "Sentiment": "neutral",
            "PublishDate": 1757408497055,
            "Source": "corporate_action"
        },
        {
            "Title": "Prakash Industries Reports Mixed Q1 Results with Improved Margins Despite Revenue Decline",
            "Summary": "Prakash Industries reported Q1 results showing revenue of 10 billion rupees, down from 11.7 billion rupees in the previous year. However, the company demonstrated improved profitability with EBITDA rising to 1.38 billion rupees from 1.32 billion rupees year-over-year. EBITDA margin expanded significantly to 13.3% from 11.3% in the same period last year. Net profit increased marginally to 914 million rupees compared to 905 million rupees previously. On the operational front, the company extracted 2.28 lakh metric tonnes during the quarter and projects total extraction to exceed 1 million tonnes for the full fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1754899822281,
            "Source": "stock"
        },
        {
            "Title": "Prakash Industries: Dolly Khanna and Mukul Mahavir Agrawal Increase Stakes",
            "Summary": "Investors Dolly Khanna and Mukul Mahavir Agrawal have increased their stakes in Prakash Industries. Dolly Khanna raised her stake by 0.2%, while Mukul Mahavir Agrawal boosted his stake by 0.3%. No specific timeframe or additional details about the transactions were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1752570063000,
            "Source": "default"
        },
        {
            "Title": "Prakash Industries Reports Q4 Results and Declares Dividend",
            "Summary": "Prakash Industries has announced its Q4 financial results. The company's EBITDA increased to 1.32 billion rupees from 1.23 billion rupees year-over-year, with EBITDA margin improving to 15.58% from 13.81%. Revenue decreased to 8.45 billion rupees from 8.9 billion rupees year-over-year. Net profit slightly increased to 908 million rupees from 890 million rupees. The company has also declared a dividend of 1.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747991182000,
            "Source": "result"
        },
        {
            "Title": "Prakash Industries: Dolly Khanna Increases Stake in Small-Cap Stock",
            "Summary": "Ace investor Dolly Khanna raised her stake in Prakash Industries from 1.28% to 2.07% during the March 2025 quarter, increasing her holdings by 79 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1744191662000,
            "Source": "normal_news"
        },
        {
            "Title": "Investor Dolly Khanna Increases Stake in Prakash Industries",
            "Summary": "Renowned investor Dolly Khanna has increased her stake in Prakash Industries by 0.8% during the fourth quarter. Following this addition, her total shareholding in the company now stands at 2.07%.",
            "Sentiment": "positive",
            "PublishDate": 1744180892000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prakash Industries Expects Cost Reductions from Coal Mine Supplies",
            "Summary": "Prakash Industries has announced that supplies of coal from their mine are expected to result in significant cost reductions and improved efficiencies in their plant operations. This development is likely to have a positive impact on the company's operational costs and overall performance.",
            "Sentiment": "positive",
            "PublishDate": 1739759109000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prakash Industries Begins Coal Extraction from Bhaskarpara Mine",
            "Summary": "Prakash Industries has announced the commencement of coal extraction from its Bhaskarpara commercial coal mine. The company has started dispatching coal to its integrated steel plant located in Champa, Chhattisgarh. This development is significant for the company's operations and supply chain management.",
            "Sentiment": "positive",
            "PublishDate": 1739759076000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prakash Industries Reports Q3 EBITDA of 1.25B Rupees",
            "Summary": "Prakash Industries has announced its Q3 financial results. The company's EBITDA for the quarter stands at 1.25 billion rupees, compared to 1.23 billion rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin has decreased from 13.95% to 13.47% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739012475000,
            "Source": "earnings"
        },
        {
            "Title": "Prakash Industries Reports Increased Q3 Profit and Revenue",
            "Summary": "Prakash Industries has announced its financial results for the third quarter. The company's net profit increased to 837 million rupees, up from 806 million rupees in the same period last year. Revenue also saw growth, rising to 9.3 billion rupees from 8.8 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739012469000,
            "Source": "earnings"
        },
        {
            "Title": "Prakash Industries: Dolly Khanna Increases Stake in Q3",
            "Summary": "Ace investor Dolly Khanna raised her stake in Prakash Industries by 0.11% during Q3 FY25, now holding 1.28% of the company. The stake is worth approximately ₹35 crore at current market prices. Prakash Industries' stock has shown negative performance over various time periods.",
            "Sentiment": "neutral",
            "PublishDate": 1736745897000,
            "Source": "normal_news"
        },
        {
            "Title": "Prakash Industries Secures 30-Year Coal Mining Lease in Chhattisgarh",
            "Summary": "Prakash Industries has announced that the Government of Chhattisgarh has executed and registered a mining lease in favor of the company. The lease grants Prakash Industries the right to mine coal at the Bhaskarpara commercial coal mine in Surajpur district for a period of 30 years.",
            "Sentiment": "positive",
            "PublishDate": 1732492512000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prakash Industries Secures 30-Year Coal Mining Lease in Chhattisgarh",
            "Summary": "Prakash Industries has announced that the Government of Chhattisgarh has executed and registered a mining lease in favor of the company. The lease grants Prakash Industries the right to mine coal at the Bhaskarpara Commercial Coal Mine in Surajpur district for a period of 30 years.",
            "Sentiment": "positive",
            "PublishDate": 1732276912000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prakash Industries Reports Q2 Revenue Growth",
            "Summary": "Prakash Industries has announced its Q2 revenue of 10.7 billion rupees, compared to 8.89 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731573065000,
            "Source": "result"
        },
        {
            "Title": "Prakash Industries Reports Q2 EBITDA and Margin",
            "Summary": "Prakash Industries announced its Q2 financial results. The company's EBITDA increased slightly to 1.31 billion rupees from 1.28 billion rupees year-over-year. However, the EBITDA margin decreased to 12.20% from 14.43% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731572995000,
            "Source": "result"
        },
        {
            "Title": "Prakash Industries Reports Q2 Net Profit of 904M Rupees",
            "Summary": "Prakash Industries has announced its financial results for the second quarter. The company reported a net profit of 904 million rupees, showing a slight increase from 894 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731572949000,
            "Source": "result"
        },
        {
            "Title": "Prakash Industries Secures 30-Year Mining Lease for Bhaskarpara Coal Mine",
            "Summary": "Prakash Industries has announced that the Government of Chhattisgarh has approved a mining lease for the Bhaskarpara Commercial Coal Mine. The lease covers an area of 932 hectares and is valid for a period of 30 years, allowing the company to mine coal in the specified region.",
            "Sentiment": "positive",
            "PublishDate": 1731501801000,
            "Source": "corporate_action"
        }
    ]
}