{
    "Symbol": "PRAKASHSTL",
    "ISIN": "INE696K01024",
    "News": [
        {
            "Title": "Prakash Steelage Reports Quarterly Financial Results for September 2025",
            "Summary": "Prakash Steelage Limited announced its unaudited financial results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs 2,505.89 lakhs compared to Rs 1,925.02 lakhs in the same quarter last year. Net profit after tax was Rs 8.72 lakhs for the current quarter versus Rs 27.73 lakhs in the corresponding quarter of the previous year. For the half-year period, revenue from operations reached Rs 4,148.89 lakhs compared to Rs 3,602.00 lakhs in the previous year, with net profit after tax of Rs 46.78 lakhs versus Rs 36.22 lakhs. The company's basic and diluted earnings per share remained at Rs 0.00 for the quarter. The Board of Directors approved these results at their meeting held on November 13, 2025, with the results being reviewed by the Audit Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1763026507424,
            "Source": "earnings"
        },
        {
            "Title": "Prakash Steelage Limited Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Prakash Steelage Limited's Board of Directors approved un-audited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs. 1,676.98 lakhs and other income of Rs. 91.53 lakhs, totaling Rs. 1,768.51 lakhs. Net profit after tax stood at Rs. 38.06 lakhs, with basic and diluted earnings per share at Rs. 0.02. Total expenses were Rs. 1,621.41 lakhs, resulting in profit before tax of Rs. 48.06 lakhs. The company's paid-up equity share capital remains at Rs. 1,750.00 lakhs with a face value of Re. 1 per share. The results were reviewed by the Audit Committee and approved at the board meeting held on August 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754903443381,
            "Source": "earnings"
        }
    ]
}