{
    "Symbol": "PRAXIS",
    "ISIN": "INE546Y01022",
    "News": [
        {
            "Title": "Praxis Home Retail CEO Ashish Bhutda Resigns",
            "Summary": "Praxis Home Retail Limited announces resignation of CEO and Whole Time Director Mr. Ashish Bhutda with immediate effect from February 02, 2026, to pursue opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1770042585293,
            "Source": "stocks"
        },
        {
            "Title": "Praxis Home Retail Reports Q3 FY26 Loss of ₹1,589 Lakh",
            "Summary": "Praxis Home Retail Limited reported a net loss of ₹1,589.10 lakh for Q3 FY26 compared to ₹833.16 lakh loss in Q3 FY25. Total income from operations declined to ₹3,036.51 lakh from ₹3,398.73 lakh year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770008886397,
            "Source": "co_actions_results"
        },
        {
            "Title": "Praxis Home Retail Closes Two Stores, Faces BSE Fine",
            "Summary": "Praxis Home Retail shuts down Hyderabad and Kolkata stores contributing ₹12.07 crores revenue, while BSE imposes ₹3.60 lakh fine for listing compliance delay.",
            "Sentiment": "negative",
            "PublishDate": 1768222918113,
            "Source": "stocks"
        },
        {
            "Title": "Mathew Cyriac Increases Stake in Praxis Home Retail",
            "Summary": "Mathew Cyriac and PAC acquire additional encumbrance in Praxis Home Retail Limited, maintaining 19.36% total holding while reducing voting rights to 1.54% through share restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1767940922034,
            "Source": "co_actions_results"
        },
        {
            "Title": "Praxis Home Retail Category Head Resigns",
            "Summary": "Praxis Home Retail Limited announces resignation of Mr. Ketan Gandhalikar, Category Head, effective January 02, 2026, citing personal reasons and better opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1767426701139,
            "Source": "stocks"
        },
        {
            "Title": "Praxis Home Retail Appoints New Independent Director",
            "Summary": "Praxis Home Retail Limited appointed Mr. Ravi Venkatraman as Additional Independent Director for five years effective December 30, 2025, following board approval on December 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767022497811,
            "Source": "stocks"
        },
        {
            "Title": "Praxis Home Retail: Major Shareholding Changes Filed",
            "Summary": "2015 Grover Family Trust and CMS Computers Ltd report significant equity transactions in Praxis Home Retail under SEBI takeover regulations, with combined holding dropping to 1.56%.",
            "Sentiment": "neutral",
            "PublishDate": 1765378949416,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mathew Cyriac Reduces Stake in Praxis Home Retail Limited Through Share Encumbrance Changes",
            "Summary": "Mathew Cyriac and Elimath Advisors Private Limited reduced their encumbered shareholding in Praxis Home Retail Limited by 2,36,56,000 shares (12.79%) on November 28, 2025, while maintaining their overall 19.36% stake. The transaction involved changes in share encumbrance structure, with voting rights holding decreasing from 14.34% to 1.54% while encumbered shares increased from 5.02% to 17.82%.",
            "Sentiment": "neutral",
            "PublishDate": 1764826510114,
            "Source": "corporate_action"
        },
        {
            "Title": "Praxis Home Retail Faces Legal Challenge Over Lease Agreement Worth ₹219.55 Crore",
            "Summary": "Praxis Home Retail Limited is facing legal proceedings at the National Company Law Tribunal, Mumbai Bench. Aegis Resolution Services Private Limited, acting as Resolution Professional for Ojas Tradeleaseand Mall Management Private Limited, has filed an interlocutory application challenging a lease deed executed on March 23, 2022. The lease agreement provided for monthly rent of ₹2,00,000 or 4% revenue share (whichever is higher) with a 21-year lock-in period. The Resolution Professional seeks to declare the lease as onerous and detrimental, requesting its annulment and demanding ₹219.55 crore in alleged losses and damages from Praxis Home Retail. The matter was heard on November 10, 2025, with the next hearing scheduled for December 4, 2025. Praxis Home Retail is seeking legal advice and states it cannot currently quantify the financial implications of this litigation.",
            "Sentiment": "negative",
            "PublishDate": 1762891735047,
            "Source": "stock"
        },
        {
            "Title": "Praxis Home Retail Allots 901,526 Equity Shares from Warrant Conversion, Forfeits Remaining 36.06 Lakh Warrants",
            "Summary": "Praxis Home Retail Limited converted 901,526 warrants into equity shares on November 10, 2025, following a warrant holder's exercise on November 5, 2025. The company had originally allotted 45,07,629 warrants on May 9, 2024, with an 18-month conversion period ending November 8, 2025. The remaining 36,06,103 warrants lapsed due to non-exercise within the conversion period and have been forfeited. The conversion was executed at Rs. 43.26 per warrant, with the company appropriating Rs. 4.88 crores from the initial warrant consideration against the allotment value of Rs. 3.90 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762772062464,
            "Source": "corporate_action"
        },
        {
            "Title": "Praxis Home Retail Faces Legal Challenge Over Lease Deed Validity",
            "Summary": "An Interlocutory Application has been filed against Praxis Home Retail Limited by Aegis Resolution Services Private Limited, the Resolution Professional of Ojas Tradlease and Mall Management Private Limited, before the National Company Law Tribunal Mumbai Bench. The application seeks directions to declare a lease deed dated March 23, 2022, between Ojas Tradlease and Mall Management Private Limited and Praxis Home Retail Limited as fraudulent and onerous, and to direct Praxis Home Retail Limited to compensate for losses. The application has not yet been admitted by the NCLT. Praxis Home Retail Limited is seeking legal advice and plans to defend its position in the matter. The company stated that financial implications will be assessed based on the outcome of NCLT proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1762204978194,
            "Source": "stock"
        },
        {
            "Title": "Praxis Home Retail Re-appoints Director and Names New Secretarial Auditor at AGM",
            "Summary": "Praxis Home Retail Limited shareholders approved key appointments at their 14th Annual General Meeting held on September 29, 2025. The company re-appointed Mr. Samsun Samuel as Non-Executive Director, who brings over 25 years of experience across manufacturing, consulting, IT and supply chain industries. Samuel has worked with organizations including Best Buy, Staples, Lowes, Future Group, and Wipro, and serves as CEO of Future Consumer Limited. The meeting also approved the appointment of Mr. Anant Gude as Secretarial Auditor for a five-year term from financial year 2025-26 to 2029-30. Gude is a practicing company secretary with over 40 years of experience specializing in secretarial audits and corporate compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1759284372537,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mangal Bhanshali's Stake in Praxis Home Retail Diluted from 12.98% to 9.49% Following Rights Issue",
            "Summary": "Mangal Bhanshali disclosed a change in shareholding of Praxis Home Retail Ltd. due to a rights issue. Bhanshali held 1,75,47,494 shares representing 12.98% of voting capital before the rights issue allotment on August 26, 2025. Following the allotment of 4,98,00,000 rights equity shares, Bhanshali's holding percentage reduced to 9.49% of voting capital while maintaining the same number of shares. The company's total equity share capital after the rights issue stands at 18,49,15,902 shares. Bhanshali is not part of the promoter group and the shares are listed on both BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757396137929,
            "Source": "corporate_action"
        },
        {
            "Title": "Praxis Home Retail Limited Announces Quarterly Financial Results",
            "Summary": "Praxis Home Retail Limited's Board of Directors approved the company's unaudited financial results for the quarter ended June 30, 2025, along with a Limited Review Report from statutory auditors. The board meeting was held on August 14, 2025, commencing at 16:20 Hours IST and concluding at 17:23 Hours IST. The financial results and review report have been submitted to BSE and NSE, and are available on the company's website at www.praxisretail.in. The company secretary Charu Srivastava signed off on the regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1755177867861,
            "Source": "earnings"
        },
        {
            "Title": "Praxis Home Retail Limited Completes Rights Issue Dispatch and Provides Application Guidelines",
            "Summary": "Praxis Home Retail Limited has completed the dispatch of abridged letter of offer and application forms for its rights issue of equity shares with face value of ₹5 each at an issue price of ₹10 per share. The company completed the dispatch through email and speed post on August 2, 2025. Shareholders who have not received application forms can obtain them from the company's website, registrar's website, lead managers' websites, or stock exchange websites. The rights issue is in the ratio of 11 rights equity shares for every 30 fully paid-up equity shares held on the record date of March 20, 2025. The issue opens on August 7, 2025 and closes on August 18, 2025. The company has provided detailed procedures for application submission, payment methods through ASBA facility, and renunciation options for eligible shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1754295710290,
            "Source": "corporate_action"
        },
        {
            "Title": "Praxis Home Retail Sets Rights Issue Schedule for August 7-18, 2025",
            "Summary": "Praxis Home Retail Limited's Committee of Directors approved the schedule for its upcoming rights issue. The issue will open on August 7, 2025, and close on August 18, 2025. The last date for on-market renunciation of rights entitlement is August 12, 2025. The company will dispatch the Letter of Offer and Abridged Letter of Offer to eligible shareholders as of the record date of March 20, 2025. The board retains the right to extend the issue period, but it will not remain open for more than 30 days from the opening date. No withdrawal of applications will be permitted after the closing date.",
            "Sentiment": "neutral",
            "PublishDate": 1753899403349,
            "Source": "corporate_action"
        },
        {
            "Title": "Praxis Home Retail Approves Terms for Rights Issue",
            "Summary": "Praxis Home Retail has approved the terms for a rights issue. The company will offer new shares at a price of 10 rupees per share. The rights entitlement ratio is set at 11 rights shares for every 30 equity shares currently held by shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1741875823000,
            "Source": "corporate_action"
        },
        {
            "Title": "Future Enterprises' Resolution Professional Files Claim Against Praxis Home Retail",
            "Summary": "The Resolution Professional (RP) of Future Enterprises has filed an application against Praxis Home Retail and its promoter. The RP is claiming a refund of 457.7 million rupees from the company. However, Praxis Home Retail believes that the RP's claim is incorrect.",
            "Sentiment": "negative",
            "PublishDate": 1736468138000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Future Enterprises' Resolution Professional Files Claim Against Praxis Home Retail",
            "Summary": "The Resolution Professional (RP) of Future Enterprises has filed an application against Praxis Home Retail and its promoter. The RP is claiming a refund of 457.7 million rupees from the company. However, Praxis Home Retail believes that the RP's claim is incorrect.",
            "Sentiment": "negative",
            "PublishDate": 1736434121000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Praxis Home Retail Reports Reduced Q2 Loss",
            "Summary": "Praxis Home Retail Limited has reported a significant reduction in its net loss for the second quarter, narrowing from 138 million rupees in the previous year to 26 million rupees. However, the company's revenue has declined from 590 million rupees to 263 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731308453000,
            "Source": "result"
        }
    ]
}