{
    "Symbol": "PRECWIRE",
    "ISIN": "INE372C01037",
    "News": [
        {
            "Title": "Precision Wires Board Meet on Feb 14 for Q3 Results",
            "Summary": "Precision Wires India Limited has scheduled a board meeting for February 14, 2026, to consider Q3FY26 unaudited financial results, declare second interim dividend, and discuss expansion projects.",
            "Sentiment": "neutral",
            "PublishDate": 1770385626730,
            "Source": "co_actions_results"
        },
        {
            "Title": "Precision Wires Updates RTA Contact Details",
            "Summary": "Precision Wires India announces change in RTA mail address to investor.helpdesk@in.mpms.mufg.com and adds new helpline number +91 8655693811 for investor communications.",
            "Sentiment": "neutral",
            "PublishDate": 1767702111410,
            "Source": "stocks"
        },
        {
            "Title": "Precision Wires India Limited Receives Credit Rating Reaffirmation from CARE Ratings",
            "Summary": "CARE Ratings Limited reaffirmed Precision Wires India Limited's credit ratings with Long Term Bank Facilities rated CARE A+ (Stable) for ₹346.08 crore and Short Term Bank Facilities rated CARE A1 for ₹995.00 crore. The ratings reflect enhanced facility limits from previous amounts of ₹219.22 crore for long-term and ₹783.50 crore for short-term facilities.",
            "Sentiment": "positive",
            "PublishDate": 1764070681913,
            "Source": "stock"
        },
        {
            "Title": "Precision Wires India Declares 35% Interim Dividend with Record Date Set for November 18, 2025",
            "Summary": "Precision Wires India Limited's Board of Directors approved an interim dividend of 35% (₹0.35 per equity share of face value ₹1 each) for financial year 2025-26. The company fixed November 18, 2025 as the record date for determining shareholder eligibility for the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1763067897174,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Wires India Declares 35% Final Dividend, Secures Rs 457 Crores in Fresh Banking Facilities",
            "Summary": "Precision Wires India Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company declared a final dividend of 35% (Rs 0.35 per fully paid equity share of Re 1 each), payable by December 11, 2025, with November 18, 2025 as the record date. The company secured significant financing arrangements including an additional secured term loan of Rs 222 million from ICICI Bank Limited. Kotak Mahindra Bank Limited sanctioned fresh fund-based/non-fund-based facilities of Rs 282 crores, becoming the third secured lender with cumulative facilities now totaling Rs 282 crores. DBS Bank India Limited sanctioned fresh unsecured facilities of Rs 75 crores, bringing their total unsecured facilities to Rs 175 crores. The company reported no deviation in utilization of proceeds raised through equity shares and convertible warrants issued on preferential basis, with funds allocated for capital expenditure (90%) and working capital purposes (10%) remaining unutilized.",
            "Sentiment": "positive",
            "PublishDate": 1762934369372,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Wires India Reports 84% Jump in Q2 Net Profit to 356M Rupees",
            "Summary": "Precision Wires India reported quarterly net profit of 356 million rupees compared to 193 million rupees in the same period last year. Revenue increased to 12 billion rupees from 10.4 billion rupees year-over-year. EBITDA rose to 589 million rupees from 362 million rupees, while EBITDA margin improved to 4.8% from 3.5% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762933710103,
            "Source": "earnings"
        },
        {
            "Title": "Precision Wires India Limited Receives Three Star Export House Certification",
            "Summary": "Precision Wires India Limited has been granted the status of 'Three Star Export House' by the Directorate General of Foreign Trade, Ministry of Commerce & Industry, Government of India. The company received the certificate on September 15, 2025. This certification recognizes the company's export performance and provides various benefits for international trade operations.",
            "Sentiment": "positive",
            "PublishDate": 1757942653730,
            "Source": "stock"
        },
        {
            "Title": "Precision Wires India Reports Strong Q1 Growth, Announces ₹70 Crore Capacity Expansion Plans",
            "Summary": "Precision Wires India delivered strong quarterly performance with net profit rising to ₹271 million from ₹222 million year-over-year, while revenue increased to ₹11 billion from ₹9.5 billion. EBITDA grew to ₹471 million from ₹422 million, though EBITDA margin slightly declined to 4.27% from 4.43%. The company announced significant expansion investments totaling ₹70 crore across multiple facilities. This includes ₹33 crore to boost copper rod production capacity, with ₹28 crore allocated for Zaroli and ₹5 crore for Valvada facilities. Additionally, the company plans to invest ₹37 crore in 2026 for Silvassa expansion, which will increase capacity by 4,400 MT and bring total capacity to approximately 65,400 MT per year by Q4 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1754735330419,
            "Source": "earnings"
        },
        {
            "Title": "Precision Wires India Approves ₹70 Crore Expansion Plan, Reports Q1 Results",
            "Summary": "Precision Wires India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company announced significant expansion plans totaling ₹70 crores across multiple projects. This includes ₹33 crores for expanding copper rod manufacturing capacity, with ₹28 crores allocated to Zaroli and ₹5 crores to Valvada. Additionally, a new ₹37 crore expansion and modernization project at Silvassa is planned for 2026, expected to increase capacity by 4,400 MT per annum by Q4 2026-2027. Upon completion, the overall installed capacity will reach approximately 65,400 MT per year. The financial results were reviewed by S. R. Divatia & Co., who found no material misstatements and confirmed compliance with Indian Accounting Standards.",
            "Sentiment": "positive",
            "PublishDate": 1754726812237,
            "Source": "earnings"
        },
        {
            "Title": "Precision Wires India Says U.S. Tariff Announcement Has Minimal Impact",
            "Summary": "Precision Wires India stated that the U.S. tariff announcement will have little effect on the company's operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754052186650,
            "Source": "stock"
        },
        {
            "Title": "Precision Wires India Leases New Premises in Silvassa for Storage and Future Manufacturing",
            "Summary": "Precision Wires India Limited has leased new premises at Survey No. 912/2, Dokmardi, Amli, Silvassa in the Union Territory of Dadra & Nagar Haveli and Daman & Diu. The facility is located near the company's existing Silvassa operations. The company plans to use this premises for product storage initially and may later relocate some manufacturing operations to this location.",
            "Sentiment": "positive",
            "PublishDate": 1754052102550,
            "Source": "stock"
        },
        {
            "Title": "Precision Wires India Raises Rs 62.65 Crore Through Preferential Allotment to Non-Promoter Investors",
            "Summary": "Precision Wires India Limited has completed a preferential allotment to three non-promoter investors, raising Rs 62.65 crore. The company allotted 13.83 lakh equity shares at Rs 151 per share, generating Rs 20.88 crore. Additionally, 27.67 lakh convertible warrants were issued at Rs 151 per warrant, with 25% payment (Rs 10.44 crore) received upfront and the remaining Rs 31.32 crore due upon conversion. The three investors are Saraswati Commercials India Limited (largest allocation), Sapientia Holdings LLP, and Trishakti Power Holding Private Limited. The company received in-principle approvals from BSE and NSE on July 23, 2025, and will file for listing and trading of the equity shares as per regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1753792499648,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Wires India Submits Fourth Addendum to Valuation Report for Preferential Share Allotment",
            "Summary": "Precision Wires India Limited has submitted a fourth addendum to the valuation report for their proposed preferential allotment of equity shares. The addendum consolidates all valuation methods into a single document and includes minor corrections by the valuer. The fair market value per share has been determined at INR 150.44 based on the higher of 90-day and 10-day volume weighted average prices as per SEBI regulations. The valuation was conducted using multiple approaches including Market Approach and Cost Approach, with the Market Price method receiving 100% weightage. The company is described as the largest producer of winding wires in South Asia with manufacturing operations in Silvassa. The valuation report was prepared by registered valuer CA Gaurang Shah and covers equity shares and convertible share warrants to be issued by the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753360087384,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Wires India Receives Exchange Approval for Rs 62.7 Crore Preferential Issue",
            "Summary": "Precision Wires India Limited has received in-principle approval from NSE and BSE for a preferential issue to non-promoters. The approval covers 13,83,000 equity shares at Rs 151 per share and 27,67,000 warrants convertible to equity shares at a minimum price of Rs 151. Both exchanges granted approval on July 23, 2025, subject to conditions including filing listing applications, obtaining statutory approvals, and compliance with regulatory requirements. The exchanges have advised the company to strengthen internal controls to monitor trades by proposed allottees and obtain undertakings from allottees confirming they will not engage in intra-day trading until allotment.",
            "Sentiment": "positive",
            "PublishDate": 1753344551703,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Wires India Ltd.: Q4 Profit and Revenue Surge, Stock Jumps 10%",
            "Summary": "Precision Wires India Ltd. reported strong Q4 results with revenue up 19% to Rs 1,046 crore, EBITDA rising 36% to Rs 50.6 crore, and net profit increasing 35% to Rs 29.6 crore. The company's stock price surged 10.11% to Rs 182.60 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747630353000,
            "Source": "earnings"
        },
        {
            "Title": "Precision Wires India Expands Capacity and Reports Q4 Results",
            "Summary": "Precision Wires India has revised its winding wires expansion project capacity from 6,100 MT/year to 6,800 MT/year, increasing the project cost from Rs 64 cr to Rs 67 cr. The company has also increased its borrowing limit from Rs 1,500 cr to Rs 2,500 cr. For Q4, Precision Wires India reported an EBITDA of 506M rupees (vs 373M YoY), with an EBITDA margin of 4.84% (vs 4.25% YoY). The company's Q4 net profit stood at 296M rupees (vs 219M YoY), while revenue reached 10.46B rupees (vs 8.78B YoY).",
            "Sentiment": "positive",
            "PublishDate": 1747483589000,
            "Source": "result"
        },
        {
            "Title": "Precision Wires India to Consider Fund Raising via QIP",
            "Summary": "Precision Wires India has announced a board meeting scheduled for May 17 to consider fund raising options. The company will specifically discuss the possibility of raising funds through a Qualified Institutional Placement (QIP).",
            "Sentiment": "neutral",
            "PublishDate": 1747053300000,
            "Source": "default"
        },
        {
            "Title": "Precision Wires India Reports Q3 EBITDA Growth",
            "Summary": "Precision Wires India has reported its Q3 financial results. The company's EBITDA increased to 368 million rupees, up from 333 million rupees in the same quarter last year. However, the EBITDA margin decreased to 3.76% from 4.17% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739363193000,
            "Source": "earnings"
        },
        {
            "Title": "Precision Wires India Reports Q3 Financial Results",
            "Summary": "Precision Wires India has announced its financial results for the third quarter. The company's net profit increased to 189 million rupees, up from 180 million rupees in the same period last year. Revenue also saw significant growth, reaching 9.79 billion rupees compared to 8 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739363187000,
            "Source": "earnings"
        },
        {
            "Title": "Precision Wires Approves Revised Expansion Project",
            "Summary": "Precision Wires has approved a revised expansion project with an estimated capacity of 6,100 MT per annum. This decision indicates a significant increase in the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1731311998000,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Wires India Reports Q2 EBITDA Growth",
            "Summary": "Precision Wires India announced its Q2 financial results. The company's EBITDA increased to 362 million rupees from 310 million rupees year-over-year. However, the EBITDA margin decreased slightly to 3.50% from 3.76% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731311994000,
            "Source": "result"
        },
        {
            "Title": "Precision Wires India Reports Q2 Revenue Growth",
            "Summary": "Precision Wires India has announced its second quarter revenue, which increased to 10.3 billion rupees from 8.25 billion rupees in the same quarter last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731311932000,
            "Source": "result"
        },
        {
            "Title": "Precision Wires India Reports Q2 Net Profit Increase",
            "Summary": "Precision Wires India has announced its second quarter financial results. The company's net profit for Q2 has risen to 193 million rupees, compared to 163 million rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731311890000,
            "Source": "result"
        }
    ]
}