{
    "Symbol": "PRECAM",
    "ISIN": "INE484I01029",
    "News": [
        {
            "Title": "Precision Camshafts Board Meet on Feb 11 for Q3FY26",
            "Summary": "Precision Camshafts Limited has scheduled its board meeting for February 11, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770266206344,
            "Source": "co_actions_results"
        },
        {
            "Title": "Precision Camshafts announces auditor name change",
            "Summary": "Precision Camshafts Limited informs stakeholders that its statutory auditors M S K A & Associates have converted to LLP structure, now operating as M S K A & Associates LLP with effect from January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768903231211,
            "Source": "stocks"
        },
        {
            "Title": "Vijay Kedia exits Precision Camshafts in Q3FY26",
            "Summary": "Ace investor Vijay Kedia has likely exited his 1.05% stake in small-cap auto components manufacturer Precision Camshafts during Q3FY26. The stock has declined 7% over two days following the disclosure.",
            "Sentiment": "negative",
            "PublishDate": 1767953793359,
            "Source": "co_actions_results"
        },
        {
            "Title": "Precision Camshafts clarifies price movement",
            "Summary": "Precision Camshafts Limited responds to NSE inquiry about significant price and volume movement, stating no undisclosed information exists and attributing changes to market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1767069880950,
            "Source": "stocks"
        },
        {
            "Title": "Precision Camshafts Launches 14 MWp Solar Plant",
            "Summary": "Precision Camshafts commissioned a 14 MWp captive solar power plant in Mangalwedha, Solapur, expanding total solar capacity to 29 MWp to reduce electricity costs and carbon emissions.",
            "Sentiment": "positive",
            "PublishDate": 1766122769746,
            "Source": "stocks"
        },
        {
            "Title": "Precision Camshafts Reports INR 42.65 Crore Loss Due to German Subsidiary Write-off",
            "Summary": "Precision Camshafts Limited reported a loss of INR 42.65 crores for Q2 FY26 compared to a profit of INR 25.6 crores in the previous quarter, primarily due to exceptional items worth INR 49.7 crores from impairment of its German subsidiary MFT GmbH which has entered liquidation. The company secured new business orders worth INR 1,500 crores from Maruti Suzuki, Hyundai India, Mahindra, and UzAuto, with production starting in calendar year 2026 and plans to invest INR 120 crores for these projects.",
            "Sentiment": "negative",
            "PublishDate": 1764908637629,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Submits Q2 FY26 Investor Presentation Showing Mixed Performance",
            "Summary": "Precision Camshafts Limited submitted its investor presentation for the quarter ended September 30, 2025, showing standalone total income of ₹181.60 crores with negative PAT, while consolidated performance reached ₹238.82 crores in total income. The presentation reveals the company's diversified operations across camshafts manufacturing, casting, and subsidiaries including MEMCO and MFT, with camshafts casting contributing 69% of volume in Q1 FY26 versus 58% in Q2 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1764563632937,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Camshafts Reports Loss in Q2 FY26 Due to Subsidiary Impairment",
            "Summary": "Precision Camshafts Limited reported a net loss of Rs 365.04 lakhs for the quarter ended September 30, 2025, compared to a profit of Rs 1,831.88 lakhs in the same quarter last year. Revenue from operations declined to Rs 14,046.56 lakhs from Rs 16,789.36 lakhs year-on-year. The company recognized an impairment loss of Rs 5,775.57 lakhs on its investment and loans to German step-down subsidiary MFT Motoren und Fahrzeugtechnik GmbH, which filed for insolvency and liquidation proceedings. A provisional liquidator was appointed on September 8, 2025. For the half-year period, the company reported a loss of Rs 1,701.98 lakhs versus a profit of Rs 3,636.65 lakhs in the previous year. The company paid a final dividend of Rs 1.00 per equity share during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762885763942,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Reports Mixed Q2 Results with Higher Profit but Lower Revenue",
            "Summary": "Precision Camshafts reported Q2 consolidated net profit of 131.6 million rupees compared to 84 million rupees in the same period last year. However, revenue declined to 1.98 billion rupees from 2.25 billion rupees year-over-year. EBITDA dropped to 131.4 million rupees from 228.2 million rupees, while EBITDA margin compressed to 6.63% from 10.14% in the previous year.",
            "Sentiment": "mixed",
            "PublishDate": 1762863330044,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Shareholders Approve Disposal of Material Subsidiary Through Insolvency",
            "Summary": "Precision Camshafts Limited shareholders approved the disposal of 100% shareholding in a material subsidiary through insolvency proceedings via special resolution passed by postal ballot. The remote e-voting process ran from September 16, 2025 to October 15, 2025. Out of 62,864,792 votes polled representing 66.18% of outstanding shares, 62,853,162 votes (99.98%) were cast in favor while 11,630 votes (0.02%) were against the resolution. The voting included promoter and promoter group holding 62,092,363 shares, public institutions with 406,807 shares, and public non-institutions with 32,486,665 shares. All promoter group votes and public institution votes were unanimously in favor, while public non-institutional investors showed 98.26% support. The scrutinizer confirmed the resolution secured the requisite majority and was passed as a special resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1760614597084,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Camshafts Seeks Shareholder Approval to Dispose 100% Stake in German Subsidiary Through Insolvency Proceedings",
            "Summary": "Precision Camshafts Limited has issued a postal ballot notice seeking shareholder approval for disposing of its 100% shareholding in material subsidiary MFT Motoren und Fahrzeugtechnik GmbH, Germany, by initiating insolvency proceedings. The company holds MFT through its wholly-owned subsidiary PCL (International) Holding B.V., Netherlands. MFT is facing persistent financial difficulties due to economic slowdown in Europe, with significantly reduced customer call-offs causing severe cash flow impact from June to August 2025. The subsidiary is unable to sustain operations due to acute liquidity constraints, making insolvency proceedings necessary under German law. E-voting will be conducted from September 16 to October 15, 2025, with results to be announced by October 17, 2025. Upon completion of insolvency and liquidation, MFT will cease to exist and no longer be a subsidiary of Precision Camshafts.",
            "Sentiment": "negative",
            "PublishDate": 1757920452793,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Camshafts Reports 11% QoQ Growth Despite European Market Challenges",
            "Summary": "Precision Camshafts Limited reported quarterly results showing consolidated total income of Rs. 221 crores, up 10.7% quarter-on-quarter, with standalone business income reaching Rs. 164 crores, up 11.2% QoQ. The company achieved an EBITDA margin of 18.5% on consolidated basis and 26% on standalone basis. Net profit increased to Rs. 25.6 crores compared to Rs. 18 crores in the same quarter last year. The automotive component manufacturer faced headwinds in European operations, with subsidiary MFT experiencing critical liquidity issues due to a 30% drop in customer demand and 20-30% sudden volume drops from European customers. However, strong domestic business growth helped offset these challenges. The company's e-mobility initiatives showed mixed results, with EMOSS in Netherlands facing reduced customer forecasts while new orders for diesel to electric vehicle conversions were received in India. MEMCO subsidiary reported Rs. 13 crores revenue with growth from existing customers and addition of 2-3 new customers. The company expects new business acquired from customers in India and overseas to start production by mid-2026, with electric heavy commercial vehicle business projected to contribute to revenues from FY'27.",
            "Sentiment": "neutral",
            "PublishDate": 1756364758063,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Uploads Q1 FY26 Earnings Call Audio Recording",
            "Summary": "Precision Camshafts Limited has made available the audio recording of their earnings call for Q1 FY26 (quarter ended June 30, 2025) on their company website. The earnings call was held on August 26, 2025, and the audio recording was uploaded the same day. The company trades on NSE under the symbol PRECAM and on BSE under scrip code 539636. The audio recording is accessible at the company's website and covers the company's performance for the quarter ended June 30, 2025. The company operates in the auto components industry, specifically in camshaft manufacturing.",
            "Sentiment": "neutral",
            "PublishDate": 1756208502507,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Reports Mixed Q1 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Precision Camshafts Limited reported consolidated revenue of Rs 195.00 crore for the quarter ended June 30, 2025, marking a 2.4% year-on-year increase. The automotive components company showed strong operational performance with profit before tax rising 40.6% to Rs 27.22 crore. However, net profit declined significantly by 53.5% to Rs 18.82 crore, while total comprehensive income fell 74% to Rs 13.94 crore. Earnings per share dropped 53.5% to Rs 1.98. On a standalone basis, the company recorded revenue of Rs 136.70 crore, profit before tax of Rs 33.96 crore, and net profit of Rs 25.63 crore. The Board of Directors approved these results on August 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755060764216,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Reports 42% Profit Growth Despite 17% Revenue Decline in Q1 FY2026",
            "Summary": "Precision Camshafts Limited reported mixed quarterly results with standalone revenue declining 16.6% to Rs 136.70 crore and consolidated revenue falling 25.9% to Rs 195.00 crore. Despite the revenue decline, profitability improved significantly with standalone profit after tax increasing 42.4% to Rs 25.63 crore and consolidated profit after tax growing 62% to Rs 18.82 crore. The strong profitability was primarily driven by a substantial increase in other income, which jumped 294.5% on standalone basis to Rs 27.35 crore. EBITDA margins expanded significantly with standalone margins improving to 31.4% from 20.3% and consolidated margins rising to 21.5% from 12.2%. The company reported no exceptional items during the quarter, unlike previous periods which included compensation received from customers and impairment charges.",
            "Sentiment": "neutral",
            "PublishDate": 1754911746316,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Limited Completes 33rd AGM with All Six Resolutions Passed",
            "Summary": "Precision Camshafts Limited held its 33rd Annual General Meeting on July 30, 2025, via video conferencing with 46 attendees. The company had 57,588 shareholders on the record date of July 23, 2025. All six resolutions were passed with requisite majority, including adoption of audited financial statements for the year ended March 31, 2025, declaration of final dividend of ₹1 per equity share, re-appointment of director Ravindra R. Joshi, appointment of Ruchi Bhave as Secretarial Auditor for five years, ratification of Cost Auditors' remuneration for FY2026, and approval of promoter group remuneration exceeding prescribed limits. The voting was conducted through remote e-voting and e-voting during the AGM, with scrutinizer Jayavant B. Bhave overseeing the process.",
            "Sentiment": "neutral",
            "PublishDate": 1753943829677,
            "Source": "corporate_action"
        },
        {
            "Title": "Precision Camshafts Reports Q4 Results and Declares Dividend",
            "Summary": "Precision Camshafts announced its Q4 consolidated net profit of 404.4 million rupees, compared to a profit of 33.5 million rupees year-over-year and a loss of 63.6 million rupees quarter-over-quarter. Q4 revenue was 1.9 billion rupees, down from 2.56 billion rupees in the same quarter last year. The company reported an exceptional item of 336.9 million rupees. Q4 profit before tax (PBT) was 193.6 million rupees, up from 48.2 million rupees year-over-year. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748390421000,
            "Source": "default"
        },
        {
            "Title": "Precision Camshafts Reports Q4 Financial Results and Dividend Announcement",
            "Summary": "Precision Camshafts has released its Q4 financial results. The company reported a consolidated net profit of 404.4 million rupees, up from 33.5 million rupees year-over-year but down from a loss of 63.6 million rupees quarter-over-quarter. Q4 revenue was 1.9 billion rupees, compared to 2.56 billion rupees in the same quarter last year. EBITDA for Q4 was 256.3 million rupees with a margin of 13.46%, up from 216.7 million rupees and 8.46% margin year-over-year. The company's profit before tax (PBT) for Q4 was 193.6 million rupees, up from 48.2 million rupees year-over-year. An exceptional item of 336.9 million rupees was reported. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748357784000,
            "Source": "result"
        },
        {
            "Title": "CAMS Reports Q4 Results and Declares Dividend",
            "Summary": "CAMS announced its Q4 consolidated net profit of 1.14 billion rupees, down from 1.25 billion rupees in the previous quarter. Revenue also decreased to 3.6 billion rupees from 3.7 billion rupees quarter-over-quarter. The company recommended a final dividend of 19 rupees per equity share. Additionally, CAMS acknowledged communications from the market regulator regarding regular operations.",
            "Sentiment": "neutral",
            "PublishDate": 1746490239000,
            "Source": "default"
        },
        {
            "Title": "Precision Camshafts: Vijay Kedia Reduces Stake Amid 53% YTD Stock Decline",
            "Summary": "Investor Vijay Kedia trimmed his stake in Precision Camshafts from 2.10% to 1.05% in Q1 2025. The company's stock has fallen 53% year-to-date, following weak Q4 2024 results showing a net loss of ₹6.36 crore. The stock is currently trading at ₹169.72, 56% below its December 2024 high.",
            "Sentiment": "negative",
            "PublishDate": 1744792839000,
            "Source": "normal_news"
        },
        {
            "Title": "Precision Camshafts: Q3 FY25 Reports ₹6.36 Crore Loss, Revenue Down 24.51%",
            "Summary": "Precision Camshafts announced Q3 FY25 results with a loss of ₹6.36 crore, compared to a profit of ₹24.46 crore in Q3 FY24. Revenue decreased by 24.51% year-over-year and 13.56% quarter-over-quarter. Operating income fell by 151.17% QoQ and 115.65% YoY. EPS declined to ₹-0.75, a 159.06% YoY decrease.",
            "Sentiment": "negative",
            "PublishDate": 1739566534000,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Reports Q3 Net Loss of 64 Million Rupees",
            "Summary": "Precision Camshafts has reported a consolidated net loss of 64 million rupees for the third quarter, compared to a profit of 245 million rupees in the same period last year. The company's revenue also declined to 1.9 billion rupees from 2.58 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739405836000,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Reports Significant Decline in Q3 EBITDA",
            "Summary": "Precision Camshafts has reported a substantial decrease in its Q3 EBITDA, which fell to 82 million rupees from 282 million rupees year-over-year. The company's EBITDA margin also declined sharply, dropping to 4.19% from 10.96% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739368389000,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Reports Q3 Net Loss and Revenue Decline",
            "Summary": "Precision Camshafts Limited has reported a consolidated net loss of 64 million rupees for the third quarter, compared to a profit of 245 million rupees in the same period last year. The company's revenue also decreased to 1.9 billion rupees from 2.58 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739368383000,
            "Source": "earnings"
        },
        {
            "Title": "Precision Camshafts Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Precision Camshafts has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 228 million rupees from 277 million rupees in the same quarter last year. The EBITDA margin also declined to 10.14% from 10.89% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731499434000,
            "Source": "result"
        },
        {
            "Title": "Precision Camshafts Reports Stable Q2 Net Profit",
            "Summary": "Precision Camshafts Limited has announced its Q2 consolidated net profit of 84 million rupees, which remains unchanged year-over-year. However, it shows a decrease from the previous quarter's profit of 116 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731499414000,
            "Source": "result"
        },
        {
            "Title": "Precision Camshafts: Vijay Kedia Boosts Stake in Rising Small-Cap Stock",
            "Summary": "Ace investor Vijay Kedia increased his stake in Precision Camshafts Ltd. to 2.10% during Q3 2024. The auto component manufacturer's stock has surged 26% in one week and 45% in six months. The company is debt-free with 65.37% promoter holding.",
            "Sentiment": "positive",
            "PublishDate": 1729237898000,
            "Source": "normal_news"
        },
        {
            "Title": "Kedia Securities Acquires 1.05% Stake in Precision Camshafts",
            "Summary": "<p>Kedia Securities has emerged as a <span class='positive'>shareholder</span> in Precision Camshafts, holding a <span class='neutral'>1.05% stake</span> as reported in the company's <b>Q2</b> <span class='neutral'>shareholding pattern</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728884136000,
            "Source": "normal_news"
        },
        {
            "Title": "Investor Vijay Kedia Reduces Stake in Precision Camshafts",
            "Summary": "<p><span class=\"neutral\">Vijay Kishanlal Kedia</span>, a notable <b>investor</b>, has <span class=\"negative\">decreased</span> his <b>shareholding</b> in <span class=\"neutral\">Precision Camshafts</span> from <span class=\"neutral\">1.16%</span> to <span class=\"neutral\">1.05%</span> during the <b>second quarter</b> of the financial year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728883937000,
            "Source": "normal_news"
        }
    ]
}