{
    "Symbol": "PREMIERENE",
    "ISIN": "INE0BS701011",
    "News": [
        {
            "Title": "Premier Energies forms JV with BA Prerna Renewables",
            "Summary": "Premier Energies Limited announces strategic joint venture with BA Prerna Renewables through HeliosAnthos Energies, holding 51% stake to strengthen EPC capabilities in renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1770729984975,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Energies Q3 FY26 Results Show Record Performance",
            "Summary": "Premier Energies reported record revenue and profits in Q3 FY26, with strong order book of INR13,723 crores. Company expanded capacity by 400MW cells and 350MW modules while maintaining industry-leading utilization rates.",
            "Sentiment": "positive",
            "PublishDate": 1769684484930,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Energies Commissions 400 MW Solar Cell Facility",
            "Summary": "Premier Energies Limited successfully commissioned a 400 MW Solar Photovoltaic Cell manufacturing facility at E-City Maheshwaram, Telangana, expanding total cell capacity to 3.6 GW through brownfield expansion.",
            "Sentiment": "positive",
            "PublishDate": 1769096354993,
            "Source": "stocks"
        },
        {
            "Title": "Premier Energies Q3FY26 Earnings Call on Jan 23",
            "Summary": "Premier Energies Limited announces earnings call scheduled for January 23, 2026 at 11:00 AM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768545413278,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Energies clarifies capacity expansion plans",
            "Summary": "Premier Energies Limited issued clarification stating its 7.4 GW cell and 6 GW module capacity expansion plans with ₹11,000 crore capex were already disclosed through previous regulatory filings and press releases.",
            "Sentiment": "neutral",
            "PublishDate": 1768221714462,
            "Source": "stocks"
        },
        {
            "Title": "Premier Energies Board Meet Set for Jan 22, 2026",
            "Summary": "Premier Energies Limited has scheduled a board meeting on January 22, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767882939813,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Energies rises 3% on F&O entry, ₹2,307 cr orders",
            "Summary": "Premier Energies shares gained 3% as stock enters F&O segment and company secured ₹2,307.30 crore orders in Q3 FY26. Orders from domestic IPPs to be executed across FY27-FY28.",
            "Sentiment": "positive",
            "PublishDate": 1767148791851,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Energies and Subsidiaries Receive Credit Rating Upgrades from CARE Ratings",
            "Summary": "CARE Ratings Limited upgraded credit ratings for Premier Energies and its subsidiaries, with Premier Energies Photovoltaic Private Limited upgraded from CARE A- to CARE A+, Premier Energies International Private Limited upgraded from CARE A- to CARE A+, and Premier Energies Global Environment Private Limited upgraded from CARE BBB+ to CARE A-. The rating actions cover bank facilities totaling Rs. 3,476.90 crores across the group companies, with stable outlooks assigned to all entities.",
            "Sentiment": "positive",
            "PublishDate": 1764770605182,
            "Source": "stock"
        },
        {
            "Title": "Premier Energies Allocates Joint Venture Shares to Nuevosol While Retaining 80% Ownership",
            "Summary": "Premier Energies has allocated joint venture shares to Nuevosol while maintaining 80% ownership in the partnership. The joint venture is targeting to raise ₹60 crore for a solar aluminium project.",
            "Sentiment": "positive",
            "PublishDate": 1764262526369,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Energies Reports Record Revenue and Profits in Q2 FY26, Advances Cell Capacity Expansion by 18 Months",
            "Summary": "Premier Energies reported record revenue and profit numbers for the quarter and half-year ended September 30, 2025. The company won new orders worth INR 6,511 crores during the quarter from top-tier independent power producers. Premier Energies announced scaling up its 4.8-gigawatt TOPCon cell project in Naidupeta, Andhra Pradesh to 7 gigawatt, with total cell capacity expected to reach 10.6 gigawatt by September 2026 - advancing their original FY28 target by 18 months. The expansion is being funded entirely through internal accruals with no new debt. The company completed acquisitions of KSolare (inverter business) and Transcon (transformer business). KSolare had revenues of INR 143 crores in FY25, while Transcon's production capacity will increase from 2.5 GVA to 16.75 GVA by April 2026. The new 1.2 gigawatt TOPCon cell line commissioned in Q1 is ramping up and expected to reach full utilization by December. Revenue growth was temporarily impacted by unprecedented rains affecting customer site deliveries and GST rate reductions leading to postponed shipments beyond September 22.",
            "Sentiment": "positive",
            "PublishDate": 1762284640199,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Reports IPO Fund Utilization Progress in Quarterly Monitoring Report",
            "Summary": "Premier Energies Limited submitted its monitoring agency report for IPO proceeds utilization for the quarter ended September 30, 2025. The company raised Rs 12,914 million through fresh issue from its IPO conducted in August 2024. Of the total proceeds, Rs 7,347.35 million has been utilized, with Rs 4,898.25 million invested in Premier Energies Global Environment Private Limited for establishing 4GW solar PV cell and module manufacturing facility, and Rs 2,449.10 million used for general corporate purposes. The company changed the project location from Telangana to Andhra Pradesh with shareholder approval in April 2025. Unutilized proceeds of Rs 5,082.43 million are deployed in fixed deposits and bank accounts. The monitoring was conducted by CRISIL Ratings Limited as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1761904416680,
            "Source": "stock"
        },
        {
            "Title": "Premier Energies Reports Order Book Value of Rs 132.5 Billion",
            "Summary": "Premier Energies reported an order book value of Rs 132.5 billion as of September 30. The announcement indicates the company's current pipeline of confirmed business orders.",
            "Sentiment": "positive",
            "PublishDate": 1761716369437,
            "Source": "stock"
        },
        {
            "Title": "Premier Energies Reports Strong Q2 Results, Expands Solar Manufacturing Capacity to 7 GW",
            "Summary": "Premier Energies Limited announced quarterly results for the period ended September 30, 2025, showing consolidated revenue from operations of ₹18,368.65 million and profit after tax of ₹3,534.39 million. The company approved expansion of its Solar PV Topcon Cell manufacturing facility at Naidupeta, Andhra Pradesh to 7 GW capacity with an investment of ₹502 crore through subsidiary Premier Energies Global Environment Private Limited, to be financed through internal accruals over FY 2026-27. The board appointed Mrs. Niyathi Naidu Madasu as Chief Human Resources Officer for Premier Energies Group. The company also entered agreements to acquire 51% stakes in KSolare Energy Private Limited for up to ₹867 million and Transcon Ind Limited for up to ₹5,003 million. Earnings per share stood at ₹7.81 for the six months ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761661000089,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Schedules Q2 FY26 Earnings Call for October 29, 2025",
            "Summary": "Premier Energies Limited will host an earnings call with investors and analysts on October 29, 2025, at 10:00 AM IST to discuss its unaudited financial results for the quarter and half year ended September 30, 2025. The call will be represented by Managing Director Chiranjeev Singh Saluja, Chief Financial Officer Nand Kishore Khandelwal, and Chief Business Officer Vinay Rustagji. ICICI Securities is coordinating the conference call, with multiple access numbers provided for domestic and international participants including USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1761372064051,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Acquires 51% Stakes in Two Companies for Solar Inverters and Power Transformers",
            "Summary": "Premier Energies Limited's Board approved two strategic acquisitions on October 23, 2025. The company will acquire a 51% stake in KSolare Energy Private Limited for Rs 86.7 crores, with Syrma SGS Technologies acquiring the remaining 49% for Rs 83.3 crores. KSolare, established in 2012, manufactures solar inverters with a production capacity of 500,000 units annually and reported revenues of Rs 342 crores in FY25. Additionally, Premier Energies will acquire a 51% stake in Transcon Ind Limited for Rs 500.3 crores. Transcon, incorporated in August 2025, focuses on manufacturing power transformers and is acquiring a partnership firm operating in transformer manufacturing since 2003. Both acquisitions will be completed through cash consideration within 90 days, subject to closing conditions. The KSolare acquisition aligns with the government's PM Surya Ghar Muft Bijli Yojana and will leverage Premier Energies' distribution network. The Transcon acquisition enables diversification into power transformer manufacturing and creates synergies with the existing solar module business.",
            "Sentiment": "positive",
            "PublishDate": 1761213718390,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Energies Acquires 51% Stake in Transcon Ind Limited for ₹500.3 Crores",
            "Summary": "Premier Energies has approved the purchase of a 51% stake in Transcon Ind Limited for ₹500.3 crores. Following this acquisition, Transcon will become a subsidiary of Premier Energies. The strategic move is aimed at expanding Premier Energies' operations into power transformer manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1761213315261,
            "Source": "order&deals"
        },
        {
            "Title": "DGTR Imposes Anti-Dumping Duties on Solar Cells from China",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has set anti-dumping duties on solar cells imported from China. This decision affects Premier Energies and the broader solar industry's import dynamics.",
            "Sentiment": "neutral",
            "PublishDate": 1759202098825,
            "Source": "sectoral"
        },
        {
            "Title": "Premier Energies Secures $19.95 Million Solar Power Contract in Benin",
            "Summary": "Premier Energies has secured a $19.95 million contract for solar power systems in Benin, West Africa. The contract involves the development of solar power infrastructure in the West African nation.",
            "Sentiment": "positive",
            "PublishDate": 1759130298007,
            "Source": "stock"
        },
        {
            "Title": "Premier Energies Secures ₹2,700 Crore Order",
            "Summary": "Premier Energies has received an order worth ₹2,700 crore. The company announced this significant contract win.",
            "Sentiment": "positive",
            "PublishDate": 1756699519436,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Energies Launches 1.2 GW Solar Cell Production with Advanced N Type Technology",
            "Summary": "Premier Energies has commenced operations for its 1.2 GW N Type G12R solar cell production facility. The company has introduced 620 W DCR Topcon solar modules and is among the first companies in India to utilize G12R N Type cell technology.",
            "Sentiment": "positive",
            "PublishDate": 1755831694034,
            "Source": "stock"
        },
        {
            "Title": "Premier Energies Limited Appoints New Independent Director and Secretarial Auditor",
            "Summary": "Premier Energies Limited appointed Mr. Nishith Hasmukh Mehta as Additional Non-Executive Independent Director for five years from August 12, 2025 to August 11, 2030, subject to shareholder approval. Mr. Jasbir Singh Gujral resigned as Independent Director effective August 12, 2025. The Board recommended M/s P. S. Rao & Associates as Secretarial Auditor for five consecutive financial years from 2025-26 to 2029-30, pending shareholder approval. The company set August 29, 2025 as the record date for dividend eligibility for financial year 2024-25 and scheduled its 30th Annual General Meeting for September 12, 2025 via video conferencing. Mr. Mehta brings 25 years of experience in compliance and risk management, having worked at Bank of America Merrill Lynch, HSBC, and other financial institutions.",
            "Sentiment": "neutral",
            "PublishDate": 1755009383923,
            "Source": "corporate_governance"
        },
        {
            "Title": "Premier Energies Reports Record Q1 Performance with 12% Revenue Growth and 61% EBITDA Jump",
            "Summary": "Premier Energies Limited delivered its strongest quarterly performance with revenue of INR 18,695 million, marking 12% year-on-year growth. EBITDA surged 61% to INR 5,971 million while profit after tax increased 55% to INR 3,078 million. The company successfully commissioned its 1.4 gigawatt module line and 1.2 gigawatt TOPCon cell manufacturing line during the quarter. Management reported strong demand across all segments and confirmed all expansion projects under Mission 2028 remain on track and within budget. The company aims to build 10 gigawatt integrated manufacturing capacity, 12 gigawatt battery energy storage systems, and 3 gigawatt inverter capacity by FY28. Order book stands at INR 86,027 million with 100% domestic exposure. The company has put US expansion plans on hold pending policy clarity, with less than 1% of current order book from the United States. Management expects BESS and inverter manufacturing to begin contributing revenue from FY27.",
            "Sentiment": "positive",
            "PublishDate": 1753872705504,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Makes Audio Recording of Quarterly Results Analyst Call Available",
            "Summary": "Premier Energies Limited has made the audio recording of its analyst call and investor presentation available on its website. The call discussed the company's unaudited financial results for the quarter ended June 30, 2025, and was held on July 28, 2025. The recording can be accessed through a direct link provided on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753705372141,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Reports Strong Q1 FY2026 Results with 55% Jump in Profit",
            "Summary": "Premier Energies Limited reported quarterly results with revenue of INR 18,695 million, representing a 9.9% year-over-year increase. The company's profit after tax (PAT) reached INR 3,078 million, marking a 55.3% year-over-year growth. EBITDA stood at INR 5,971 million with a margin of 31.94%. The solar manufacturer completed commissioning of a 1.4 GW module plant and 1.2 GW TOPCon cell plant at Hyderabad. The company maintains a strong balance sheet with net debt of negative INR 10,570 million and total debt to equity ratio of 0.49. Premier Energies has an order book of INR 86,027 million as of June 30, 2025, with 5,545 MW capacity. The company is expanding toward its Mission 2028 target of 10+ GW integrated capacity across cells, modules, aluminum frames, ingots and wafers, inverters, and BESS solutions.",
            "Sentiment": "positive",
            "PublishDate": 1753536931064,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Reports Strong Q1 Results, Declares Interim Dividend and Allots ESOP Shares",
            "Summary": "Premier Energies Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs. 18,207.42 million and profit after tax of Rs. 3,077.93 million. On a standalone basis, revenue was Rs. 1,869.73 million with profit of Rs. 234.62 million. The Board declared an interim dividend of Rs. 0.25 per equity share for financial year 2025-26, with August 2, 2025 as the record date. The company also allotted 22,20,000 equity shares at a premium of Rs. 320.29 per share to the PEL ESOP Trust under the PEL ESOP Scheme 2021. During the quarter, Premier Energies incorporated three new subsidiaries in India: Premier Energies GWC Private Limited, Premier Energies Storage Solutions Private Limited, and Premier-Green Aluminium Private Limited, though these have not commenced operations.",
            "Sentiment": "positive",
            "PublishDate": 1753535859221,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Energies Schedules Q1 FY26 Earnings Call for July 28, 2025",
            "Summary": "Premier Energies Limited will host an earnings call with investors and analysts on July 28, 2025, at 11:00 AM IST to discuss its unaudited financial results for the quarter ended June 30, 2025. The call will be represented by Managing Director Chiranjeev Singh Saluja, Chief Financial Officer Nand Kishore Khandelwal, and Chief Business Officer Vinay Rustagi. The company has provided multiple access numbers for domestic and international participants, with ICICI Securities coordinating the call.",
            "Sentiment": "neutral",
            "PublishDate": 1753191441292,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Commissions 1.2 GW Topcon Solar Cell Line in Hyderabad",
            "Summary": "Premier Energies has commissioned a 1.2 GW Topcon solar cell production line in Hyderabad. This development is part of the company's plan to expand its cell and module capacities to 8.4 GW and 11.1 GW respectively.",
            "Sentiment": "positive",
            "PublishDate": 1750983013000,
            "Source": "default"
        },
        {
            "Title": "Premier Energies: Commissions 1.2-GW TOPCon Solar Cell Line in Hyderabad",
            "Summary": "Premier Energies Ltd. has successfully commissioned a new 1.2 GW TOPCon solar cell manufacturing line in Hyderabad, increasing its total solar cell capacity from 2 GW to 3.2 GW. The line features 16-busbar architecture and can achieve cell efficiencies exceeding 25%. The company plans to expand its cell and module production capacity to 8.4 GW and 11.1 GW respectively by June 2026.",
            "Sentiment": "positive",
            "PublishDate": 1750958363000,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Energies Launches 1.2 GW TopCon Solar Cell Line in Hyderabad",
            "Summary": "Premier Energies has launched a 1.2 GW TopCon solar cell production line in Hyderabad. This development is part of the company's goal to expand its cell capacity to 8.4 GW and module capacity to 11.1 GW. The news indicates significant growth and investment in solar energy production capabilities by Premier Energies.",
            "Sentiment": "positive",
            "PublishDate": 1750950114000,
            "Source": "default"
        },
        {
            "Title": "Premier Energies: Ambitious 10 GW Solar Capacity Target by FY28",
            "Summary": "Premier Energies aims to reach 10 GW solar production capacity by FY28, driven by strong domestic demand. The company's order book stands at Rs 8,400 crore, equivalent to 5,300 MW. They are exploring opportunities in Europe and awaiting policy clarity for US expansion. Domestic demand is robust, especially in residential rooftop and agricultural solar sectors.",
            "Sentiment": "positive",
            "PublishDate": 1750570373000,
            "Source": "normal_news"
        },
        {
            "Title": "Premier Energies Exploring Battery Manufacturing Opportunities",
            "Summary": "Premier Energies is reportedly exploring opportunities in battery manufacturing. The company appears to be considering expansion into the battery sector, potentially diversifying its energy-related portfolio. However, the news article provides limited details about the specific nature of these opportunities or the company's concrete plans.",
            "Sentiment": "neutral",
            "PublishDate": 1749702656000,
            "Source": "default"
        },
        {
            "Title": "Premier Energies: Major Buyers Revealed in ₹2,629 Crore Block Deal",
            "Summary": "A block deal of 2.5 crore shares (5.54%) of Premier Energies Ltd. occurred on June 10, valued at ₹2,629 crore. Prominent buyers include Goldman Sachs, Morgan Stanley, Citigroup, Axis MF, SBI MF, and Societe Generale. South Asia Growth Fund was the seller. The stock closed 1.9% higher at ₹1,082.8.",
            "Sentiment": "positive",
            "PublishDate": 1749610022000,
            "Source": "block_deals"
        },
        {
            "Title": "Premier Energies: Major Block Deal Attracts Institutional Investors",
            "Summary": "GEF Capital Partners affiliate sold 5.6% stake in Premier Energies for Rs 2,630 crore. Quant Mutual Fund, Premji Invest, SBI Life, and other domestic and foreign investors acquired shares. The stock traded at an average price of Rs 1,051.6 per share.",
            "Sentiment": "positive",
            "PublishDate": 1749569937000,
            "Source": "block_deals"
        },
        {
            "Title": "Premier Energies Ltd: South Asia Growth Fund to Sell 5.5% Stake via Block Deal",
            "Summary": "South Asia Growth Fund II plans to sell 2.5 crore shares (5.5% stake) of Premier Energies Ltd through a block deal on June 10. The floor price is set at ₹1,501 per share, a 1% discount from Monday's close, valuing the transaction at ₹2,628 crore. The deal is expected in the pre-open block window, with a 150-day lock-in period for further sales by the fund.",
            "Sentiment": "neutral",
            "PublishDate": 1749519771000,
            "Source": "block_deals"
        },
        {
            "Title": "Premier Energies: South Asia Growth Fund II to Offload 5.5% Stake via Block Deals",
            "Summary": "South Asia Growth Fund II Holdings plans to sell up to 2.5 crore shares (5.5% stake) of Premier Energies Ltd through block deals. The floor price is set at ₹1,051.50 per share, a 1% discount to the current market price. Premier Energies reported strong Q4 and FY2025 results, with significant revenue and profit growth. The company's order book stands at 5,303 MW, valued at ₹8,445.6 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749477769000,
            "Source": "block_deals"
        },
        {
            "Title": "Premier Energies: JPMorgan Maintains Neutral Stance Amid Mixed Signals",
            "Summary": "JPMorgan maintains a neutral rating on Premier Energies due to improving demand for DCR cells but potential delays in new cell line ramp-ups. The company expects local premiums to sustain and aims to capture 20% market share with 10GW capacity. Management anticipates domestic demand growth through various projects and schemes.",
            "Sentiment": "neutral",
            "PublishDate": 1749456959000,
            "Source": "normal_news"
        },
        {
            "Title": "US Bill to End Clean Energy Tax Credits Early Impacts Solar and Wind Projects",
            "Summary": "The United States has passed a bill that will terminate clean energy tax credits earlier than originally planned. This decision is expected to affect solar and wind energy projects. The news specifically mentions Premier Energies as a potentially impacted company.",
            "Sentiment": "negative",
            "PublishDate": 1747971649000,
            "Source": "default"
        },
        {
            "Title": "Premier Energies: JPMorgan Raises Target Price After Q4 Profit Beat",
            "Summary": "JPMorgan increased Premier Energies' target price to Rs 1,013 for FY2026 after Q4 net profit rose 9% to Rs 277.8 crore, beating estimates. EBITDA margins expanded to 32.6%. Revenue fell 5% to Rs 1,621 crore. The company won orders worth Rs 3,100 crore and announced capacity expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1747713339000,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Forms Joint Venture with Nuevosol for Solar Module Frames",
            "Summary": "Premier Energies has entered into an 80:20 joint venture with Nuevosol to manufacture aluminium frames for solar modules. Premier Energies will hold the majority stake of 80% in the partnership.",
            "Sentiment": "positive",
            "PublishDate": 1747621074000,
            "Source": "default"
        },
        {
            "Title": "Premier Energies: Strong Q4 Results and Ambitious Expansion Plans",
            "Summary": "Premier Energies reported a 43.9% increase in Q4 revenue to ₹1,620.8 crore, with profit after tax up 167% to ₹277.8 crore. The company announced aggressive expansion plans targeting 10 GW cell and 11 GW module capacity by FY2028, with an estimated capex of ₹1,250 crore. Two new joint ventures were formed for solar silicon wafer production.",
            "Sentiment": "positive",
            "PublishDate": 1747620568000,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Reports Strong Q4 Financial Results",
            "Summary": "Premier Energies announced its Q4 financial results, showing significant year-over-year improvements. The company's consolidated net profit increased to 2.77 billion rupees from 1.04 billion rupees in the same quarter last year. Revenue grew to 16 billion rupees from 11.3 billion rupees. EBITDA rose to 5.29 billion rupees from 1.84 billion rupees, with the EBITDA margin expanding to 32.61% from 16.37% in the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747613496000,
            "Source": "default"
        },
        {
            "Title": "Premier Energies: Strong Q4 Margins Offset Weak Revenue",
            "Summary": "Premier Energies reported Q4 FY25 results with revenue down 5% QoQ to Rs 1621 crore, but EBITDA up 3% to Rs 529 crore. Net profit increased 9% to Rs 278 crore. The company won orders worth Rs 3,100 crore, up 40%. Premier announced capacity expansions and new joint ventures for aluminum frame manufacturing and silicon wafer production.",
            "Sentiment": "positive",
            "PublishDate": 1747544578000,
            "Source": "earnings"
        },
        {
            "Title": "Premier Energies Reports Strong Q4 Financial Performance",
            "Summary": "Premier Energies has announced its Q4 financial results. The company's EBITDA increased to 5.29 billion rupees from 1.84 billion rupees year-over-year. The EBITDA margin improved to 32.61% from 16.37% in the same period last year. Consolidated net profit rose to 2.77 billion rupees from 1.04 billion rupees. Revenue for Q4 grew to 16 billion rupees from 11.3 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747495029000,
            "Source": "result"
        },
        {
            "Title": "Premier Energies Ltd: Q4 and FY25 Results Date Announced, Board to Consider Final Dividend",
            "Summary": "Premier Energies Ltd will announce Q4 and FY25 results on May 17, 2025. The board will consider recommending a final dividend. An earnings call is scheduled for May 19. The trading window is closed from April 1 until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1747367628000,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Energies and RENA Technologies Form Strategic Partnership for Solar Cell Innovation",
            "Summary": "Premier Energies and RENA Technologies have announced a strategic technology partnership aimed at developing next-generation solar cell innovations. This collaboration is expected to drive advancements in solar energy technology.",
            "Sentiment": "positive",
            "PublishDate": 1744687996000,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Energies Establishes Subsidiary for Aluminium Frame Manufacturing",
            "Summary": "Premier Energies has announced the incorporation of a new subsidiary called Premier-green Aluminium. This new unit will be dedicated to the manufacturing of aluminium frames.",
            "Sentiment": "positive",
            "PublishDate": 1743725127000,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Energies Incorporates New Subsidiary for Aluminium Frame Manufacturing",
            "Summary": "Premier Energies has announced the incorporation of a new subsidiary named Premier-Green Aluminium. This new unit will be responsible for manufacturing aluminium frames.",
            "Sentiment": "positive",
            "PublishDate": 1743691330000,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Energies Added to FTSE All World Index",
            "Summary": "Premier Energies has been added to the FTSE All World Index, which is expected to result in an inflow of approximately 1.9 billion rupees ($22.2 million) into the stock.",
            "Sentiment": "positive",
            "PublishDate": 1742548525000,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Energies Ltd: JPMorgan Cuts Share Price Target by 20% on Margin Risks",
            "Summary": "JPMorgan has reduced Premier Energies Ltd's price target from ₹1,170 to ₹940, citing near-term margin risks. The brokerage maintains a 'Neutral' rating. Potential margin pressures stem from falling non-DCR module prices, stable wafer prices, and increased Indian cell capacity. Premier Energies' stock has fallen 28% over the past three months and is currently trading around ₹933.50.",
            "Sentiment": "negative",
            "PublishDate": 1742442927000,
            "Source": "normal_news"
        },
        {
            "Title": "Premier Energies: Lock-In Period Ends, 10.6 Crore Shares Eligible for Trading",
            "Summary": "Premier Energies' six-month shareholder lock-in period ends on February 28, 2025, making 10.6 crore shares (23% of outstanding equity) eligible for trading. The stock has fallen 33% from its post-listing high and 31% year-to-date. Kotak Institutional Equities maintains a 'sell' rating with a ₹840 price target.",
            "Sentiment": "neutral",
            "PublishDate": 1740704796000,
            "Source": "corporate_action"
        }
    ]
}