{
    "Symbol": "PREMEXPLN",
    "ISIN": "INE863B01029",
    "News": [
        {
            "Title": "Premier Explosives Q3FY26 Results Show Mixed Performance",
            "Summary": "Premier Explosives reported Q3FY26 net profit of ₹604.02 lakhs vs ₹918.79 lakhs YoY, while nine-month profit rose to ₹3922.96 lakhs. Revenue declined significantly amid challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1770903448430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Explosives Wins $1.93M Rocket Motor Order",
            "Summary": "Premier Explosives Limited secured a USD 1.93 million international purchase order for rocket motor supply, valued at approximately ₹17.68 crores with 12-month delivery timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768997098277,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Explosives Secures INR 73.11 Crore Defence Export Order",
            "Summary": "Premier Explosives Limited received an export order worth INR 73.11 crores from an international client for supply of defence products to be delivered within 12 months. The order represents a significant business development for the company in the defence export sector.",
            "Sentiment": "positive",
            "PublishDate": 1763989682124,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Explosives Reports Strong H1 FY26 Performance with 23% Revenue Growth and INR 1,297 Crore Order Book",
            "Summary": "Premier Explosives Limited delivered robust half-year results with revenue increasing 23% year-on-year to INR 217.7 crores, driven by growth in Defense and Aerospace division, while securing a significant INR 429.56 crore order from Indian Air Force for countermeasures supply in October. The company maintains a strong order book of INR 1,297 crores representing 3.1x of FY25 revenue, with management guiding for full-year revenue of INR 500-600 crores and EBITDA margins of 15-20%, positioning itself as a key player in domestic and export defense markets.",
            "Sentiment": "positive",
            "PublishDate": 1763545238347,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Signs Rs. 500 Crore Investment MOU with Andhra Pradesh Government",
            "Summary": "Premier Explosives Limited signed a non-binding Memorandum of Understanding with Andhra Pradesh Economic Development Board on November 13, 2025, proposing an investment of Rs. 500 crore in the state. The investment is intended for establishing a manufacturing facility for Defence and Aerospace products in Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1763099932397,
            "Source": "stock"
        },
        {
            "Title": "Premier Explosives Reports Mixed Q2 Results with Strong Order Book Growth",
            "Summary": "Premier Explosives Limited reported 20% decline in quarterly revenue to Rs 756 million but achieved 113% surge in profit after tax to Rs 179 million for Q2 FY26. The defense and explosives manufacturer maintains a robust order book of Rs 12,971 million, representing 3.1 times its FY25 revenue, while expanding its product portfolio in missile programs and industrial explosives.",
            "Sentiment": "neutral",
            "PublishDate": 1763068361648,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Plans Revenue Doubling With New Propellant Plant and Export Expansion",
            "Summary": "Premier Explosives reports strong order visibility across defence, mining, and space segments with a new greenfield propellant systems plant set to commence by FY27. The company aims to double revenue over three years through defence indigenisation, technology licensing, and rising export orders from Europe and Middle East.",
            "Sentiment": "positive",
            "PublishDate": 1763052108917,
            "Source": "stock"
        },
        {
            "Title": "Premier Explosives Reports Strong Q2 Performance with 1,787 Lakh Profit Despite Exceptional Charges",
            "Summary": "Premier Explosives Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported revenue from operations of 7,587.57 lakhs for the quarter, with a profit after tax of 1,787.29 lakhs. For the six-month period, revenue reached 21,772.36 lakhs with profit after tax of 3,318.94 lakhs. The company recognized an exceptional expense of 120 lakhs representing ex-gratia compensation to employees affected by an accident at the manufacturing facility. Additionally, the company recorded a purchase discount of 2,246.39 lakhs from a commercial settlement with a supplier related to materials from the previous financial year. The Board of Directors approved these unaudited financial results at their meeting held on November 13, 2025. Earnings per share for the quarter stood at 3.32 rupees.",
            "Sentiment": "positive",
            "PublishDate": 1763030643672,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Secures ₹16.40 Crore Export Order for Commercial Explosives",
            "Summary": "Premier Explosives has received an export order valued at ₹16.40 crores for commercial explosives. The company is required to complete delivery within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1762865474353,
            "Source": "stock"
        },
        {
            "Title": "Premier Explosives Receives SEBI Inquiry on Suspected Insider Trading",
            "Summary": "Premier Explosives Limited received a communication from the Securities and Exchange Board of India (SEBI) seeking information and documents in connection with an inquiry pertaining to suspected insider trading in the company's scrip. The communication was dated November 3, 2025. The company stated it will submit its response to SEBI within the prescribed timelines. This information was disclosed to BSE Limited and National Stock Exchange of India under regulatory requirements.",
            "Sentiment": "negative",
            "PublishDate": 1762256315124,
            "Source": "corporate_governance"
        },
        {
            "Title": "Premier Explosives Secures INR 430 Crore Defence Contract",
            "Summary": "Premier Explosives has secured orders worth INR 429.56 crores from the Defence Ministry for supplying chaffs and flares. The delivery is expected to be completed within a year.",
            "Sentiment": "positive",
            "PublishDate": 1761642647132,
            "Source": "stock"
        },
        {
            "Title": "Premier Explosives Promoters Complete Inter-Se Share Transfer of 6.11% Stake",
            "Summary": "Amarnath Gupta and Kailash Gupta acquired 32,83,485 equity shares (6.11%) of Premier Explosives Limited through an inter-se transfer due to partition of Amarnath Gupta HUF. The transaction occurred on October 17, 2025, with no consideration involved as it was an off-market transfer due to HUF partition. Amarnath Gupta's individual shareholding increased from 24.37% to 30.48%, while Amarnath Gupta HUF's 6.11% stake was reduced to zero. The transaction falls under exemption provisions of SEBI Takeover Regulations, requiring no open offer. The aggregate promoter shareholding remains unchanged. Required regulatory filings were submitted to BSE and NSE, with applicable fees of Rs. 1,77,000 paid to SEBI.",
            "Sentiment": "neutral",
            "PublishDate": 1761195091975,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Explosives: 32.8 Lakh Shares Transferred from HUF to Promoters in Partition Deal",
            "Summary": "Premier Explosives Limited disclosed the transfer of 32,83,485 equity shares from Amarnath Gupta HUF to Mr. Amarnath Gupta jointly with Mrs. Kailash Gupta as part of a HUF partition. The transaction occurred on October 17, 2025, representing 6.11% of the company's total share capital. Following this transfer, the combined holding of Mr. Amarnath Gupta and Mrs. Kailash Gupta increased from 24.37% to 30.48% of Premier Explosives' equity. The company has a total equity share capital of INR 10,75,22,390 consisting of 5,37,61,195 equity shares with a face value of INR 2 each. Both parties are promoters of the company, and the shares are listed on BSE and National Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1760937979205,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Explosives: Promoters Dr. Amarnath Gupta and Dr. Kailash Gupta Increase Shareholding to 30.48% Through Inter-se Transfer",
            "Summary": "Premier Explosives Limited disclosed an inter-se transfer of equity shares between promoters on October 17, 2025. Dr. Amarnath Gupta and Dr. Kailash Gupta acquired 32,83,485 equity shares from Amarnath Gupta HUF through an off-market transaction due to partition of the HUF. Their combined shareholding increased from 1,31,00,915 shares (24.37%) to 1,63,84,400 shares (30.48%). The company's total equity share capital remains INR 10,75,22,390 consisting of 5,37,61,195 equity shares with face value of INR 2 each. The aggregate shareholding of the promoter group remains unchanged as this was an internal transfer between promoter entities.",
            "Sentiment": "neutral",
            "PublishDate": 1760807191924,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Explosives Telangana Plant Authorized to Resume Operations After Pollution Control Board Lifts Closure Order",
            "Summary": "Premier Explosives has received clearance to restart production at its Telangana manufacturing facility. The state Pollution Control Board has revoked its previous closure order, allowing the plant to resume operations.",
            "Sentiment": "positive",
            "PublishDate": 1758027113412,
            "Source": "stock"
        },
        {
            "Title": "Premier Explosives Secures ₹78.3 Million Defense Contract",
            "Summary": "Premier Explosives has secured an order worth ₹78.3 million from the Defence Ministry. The contract represents new business for the explosives manufacturer from the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1757502038703,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Explosives Reports 72% Revenue Growth in Q1 FY2026, Maintains INR 600 Crore Annual Guidance",
            "Summary": "Premier Explosives Limited delivered strong quarterly results with revenue growing 72% year-over-year to INR 142 crores, driven by robust performance in the Defense and Space Services division. Net profit surged 110% to INR 15.3 crores while operating profit increased 35% to INR 20.9 crores. The company maintains a healthy order book of INR 988.5 crores, representing 2.4 times FY2025 revenue, with 87% from defense segment. Premier secured new orders from Brahmos Aerospace for propellant casting and booster assembly, along with international export orders for rocket motors and defense products. The Defense and Space segment now accounts for 86% of revenue, up from 80% previously. However, the propellant plant at Katepally facility remains suspended following an April fire incident, though other manufacturing facilities continue operations. The company is participating in INR 700 crores worth of RFPs for emergency defense procurement and has maintained its FY2026 revenue guidance of INR 600 crores. Premier plans significant capacity expansion with INR 800 crores investment over three phases for a new Odisha greenfield plant and INR 90 crores for existing facilities. The company is exploring a INR 300 crore fundraise through QIP or preferential issue for capex and debt repayment.",
            "Sentiment": "positive",
            "PublishDate": 1755599211508,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives, Danlaw Technologies, and Nihar Info Global Publish Quarterly Financial Results",
            "Summary": "Premier Explosives Limited published its unaudited financial results for the quarter ended June 30, 2025 in Business Standard (English) and Nava Telangana (Telugu) newspapers. Danlaw Technologies India Limited reported total income of Rs 5,506.49 lakhs and profit after tax of Rs 347.12 lakhs for the quarter ended June 30, 2025, compared to Rs 4,751.93 lakhs income and Rs 346.57 lakhs profit in the same quarter last year. The company's earnings per share stood at Rs 7.13 for the quarter. Nihar Info Global Limited reported total income of Rs 5.58 lakhs and net profit after tax of Rs 5.69 lakhs for the quarter ended June 30, 2025. Sundrop Brands Limited (formerly Agro Tech Foods Limited) reported total income of Rs 208.82 crores and net profit after tax of Rs 4.94 crores for the quarter ended June 30, 2025. All companies' results were reviewed by their respective Audit Committees and approved by their Boards of Directors on August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755155921818,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Reports Strong Q1 FY2026 Results, Approves ESOP Scheme and Plans Rs 300 Crore Fundraise",
            "Summary": "Premier Explosives Limited's Board approved unaudited financial results for Q1 FY2026 showing revenue from operations of Rs 14,214.79 lakhs compared to Rs 8,285.81 lakhs in the same quarter last year. Net profit reached Rs 1,531.65 lakhs versus Rs 727.86 lakhs in Q1 FY2025. The company recorded an exceptional expense of Rs 400 lakhs as ex-gratia compensation for employees affected by an accident at the manufacturing facility. Other income increased significantly due to reversal of a Rs 500 lakhs loss provision related to a long-term contract. The Board approved Employee Stock Option Scheme 2025, appointed K V C Reddy & Associates as Secretarial Auditors for five years (FY2025-26 to FY2029-30), and authorized fundraising up to Rs 300 crores through various instruments including equity shares. The 45th Annual General Meeting is scheduled for September 30, 2025, with book closure from September 24-30, 2025, and record date of September 23, 2025 for dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1754995525204,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Schedules Q1 FY26 Results Conference Call for August 13, 2025",
            "Summary": "Premier Explosives Limited has scheduled a conference call for analysts and investors on August 13, 2025, at 11:00 AM IST to discuss Q1 FY26 financial results. The call will be led by Managing Director T.V. Chowdary and CFO Vijay Kumar. Multiple access options are available including universal access numbers and international toll-free lines for participants from Hong Kong, Singapore, UK, and USA. Contact details for registration and participation have been provided through Stellar IR services.",
            "Sentiment": "neutral",
            "PublishDate": 1754485442545,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Secures $21.75 Million Defence Export Order",
            "Summary": "Premier Explosives Limited has secured an export order worth USD 21,750,000 (approximately INR 190.07 Crore) for manufacturing and supplying Defence Explosives, to be delivered over a two-year period. The order comes from an international entity, with no promoter or group company interest in the awarding entity. The contract falls outside related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1754286439242,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Explosives Secures ₹22.36 Crore International Order for Rocket Motors",
            "Summary": "Premier Explosives has secured an international order worth ₹22.36 crore for rocket motors. The company is targeting completion of this order by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1753893669020,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Explosives Secures Rs. 22.36 Crore International Order for Rocket Motors",
            "Summary": "Premier Explosives Limited received a purchase order worth Rs. 22.36 crores from an international entity for the supply of rocket motors. The order is scheduled for delivery on or before March 31, 2026. The company confirmed that promoters or group companies have no interest in the entity that awarded the contract, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753893265217,
            "Source": "stock"
        },
        {
            "Title": "Premier Explosives Receives Reaffirmed Credit Ratings from ICRA Limited",
            "Summary": "Premier Explosives Limited has received reaffirmed credit ratings from ICRA Limited for its bank facilities worth Rs. 357.00 crore, reduced from Rs. 388.20 crore. The long-term rating has been reaffirmed at [ICRA]BBB+(Stable) and the short-term rating at [ICRA]A2. The ratings have been removed from watch with developing implications and assigned a stable outlook. The rating agency issued this reaffirmation through a letter dated July 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753787971214,
            "Source": "stock"
        },
        {
            "Title": "Premier Explosives: Secures ₹105 Crore Export Order for Defence Explosives",
            "Summary": "Premier Explosives Ltd. has received an export order worth $12,240,000 (approximately ₹105 crore) for manufacturing and supplying defence explosives to international clients. The order is to be delivered within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1752650761000,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Explosives Secures 105 Crore Rupees Export Contract",
            "Summary": "Premier Explosives has secured an export contract valued at 105 Crore Rupees. This contract is expected to boost the company's annual revenue by 25%. The news indicates a significant business development for the company in terms of international sales and potential growth.",
            "Sentiment": "positive",
            "PublishDate": 1752645474000,
            "Source": "default"
        },
        {
            "Title": "Premier Explosives Secures Increased International Order",
            "Summary": "Premier Explosives has announced an increase in the value of an order from an international client. The contract value has risen from 6.6 crore to 18.29 crore. This represents a significant expansion of the company's international business.",
            "Sentiment": "positive",
            "PublishDate": 1752124461000,
            "Source": "default"
        },
        {
            "Title": "Premier Explosives Secures New Order Worth 66.2 Million Rupees",
            "Summary": "Premier Explosives has received a new order valued at 66.2 million rupees. No further details about the order or its nature were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750339117000,
            "Source": "default"
        },
        {
            "Title": "Premier Explosives Ltd: Targets 18-20% Margin by FY26, Eyes Rs 700 Crore in New Orders",
            "Summary": "Premier Explosives Ltd aims for 18-20% margin in FY26, driven by a diversified defence portfolio. The company expects new orders worth Rs 700 crore this fiscal year. It received a significant order from BrahMos Aerospace in Q4 FY25. The recent explosion at a Telangana facility is expected to have a limited financial impact of Rs 20-25 crore. The company's 2030 top-line target is Rs 1,000 crore, with margins potentially exceeding 20%.",
            "Sentiment": "positive",
            "PublishDate": 1749518145000,
            "Source": "normal_news"
        },
        {
            "Title": "Premier Explosives Anticipates ₹700 Crore Order Inflow in FY2026",
            "Summary": "Premier Explosives expects to receive orders worth ₹700 crore in the fiscal year 2026. The company's future outlook appears positive based on this anticipated order inflow.",
            "Sentiment": "positive",
            "PublishDate": 1749450793000,
            "Source": "default"
        },
        {
            "Title": "Premier Explosives' Katepally Factory Closure Revoked",
            "Summary": "Premier Explosives has announced that the Telangana Pollution Board has revoked the closure order for its factory located in Katepally. This decision allows the company to resume operations at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1748943508000,
            "Source": "default"
        },
        {
            "Title": "Premier Explosives: Q4 Results Trigger 40% Stock Plunge",
            "Summary": "Premier Explosives reported a 15% YoY revenue decline to ₹74 crore in Q4, with EBITDA falling 37% and net profit halving. The stock is locked in a 10% lower circuit, down 40% from its 52-week high. Full-year revenue met guidance, but margins fell short. The order book stands at ₹750 crore.",
            "Sentiment": "negative",
            "PublishDate": 1747983670000,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Reports Q4 Financial Results",
            "Summary": "Premier Explosives has reported its Q4 financial results. The company's EBITDA decreased to 95.6 million rupees from 150.9 million rupees year-over-year. The EBITDA margin declined to 12.91% from 17.39% in the same period. Revenue fell to 740.8 million rupees from 868 million rupees year-over-year. Consolidated net profit decreased to 37.4 million rupees from 68 million rupees year-over-year, but increased from 92.2 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747922302000,
            "Source": "result"
        },
        {
            "Title": "Premier Explosives: Factory Closure Notice Impacts Stock",
            "Summary": "Premier Explosives received a closure notice from Telangana Pollution Control Board for its Katepally Village factory following a fire and explosion incident on April 29, 2025, resulting in three deaths and six injuries. The company is working to regain operating consent. Stock price fell nearly 6% in response.",
            "Sentiment": "negative",
            "PublishDate": 1747113903000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Premier Explosives Receives Closure Order for Katepally Factory",
            "Summary": "Premier Explosives has been issued closure orders for its Katepally factory by the Telangana Pollution Control Board. This regulatory action suggests potential environmental compliance issues at the facility.",
            "Sentiment": "negative",
            "PublishDate": 1747043549000,
            "Source": "default"
        },
        {
            "Title": "Premier Explosives: Factory Explosion Kills Three, Injures Six, Shares Plummet",
            "Summary": "An explosion at Premier Explosives' Telangana factory resulted in three deaths and six injuries. The incident occurred in a propellant mixing building, causing damage to building and machinery. The company's shares fell nearly 18% following the news. Premier Explosives is assessing the loss and investigating the cause. Assets were reportedly insured.",
            "Sentiment": "negative",
            "PublishDate": 1745994044000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Premier Explosives Secures 189 Million Rupee Export Order",
            "Summary": "Premier Explosives has received an export order valued at 189 million rupees. This order represents a significant business development for the company, potentially boosting its revenue and international market presence.",
            "Sentiment": "positive",
            "PublishDate": 1742342717000,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Explosives Secures Export Order Worth 189 Million Rupees",
            "Summary": "Premier Explosives Limited has announced that it has received an export order valued at 189 million rupees. This order represents a significant business development for the company, potentially boosting its revenue and international presence.",
            "Sentiment": "positive",
            "PublishDate": 1742303977000,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Explosives Secures Export Order Worth 214.5 Million Rupees",
            "Summary": "Premier Explosives has announced receiving an export order valued at 214.5 million rupees. This order represents a significant business development for the company, potentially boosting its revenue and international market presence.",
            "Sentiment": "positive",
            "PublishDate": 1741778283000,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Explosives Forms Joint Venture with Global Munition",
            "Summary": "Premier Explosives has entered into a joint venture agreement with Global Munition. This strategic partnership likely aims to combine the expertise and resources of both companies in the explosives or munitions sector.",
            "Sentiment": "positive",
            "PublishDate": 1741651396000,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Explosives Establishes Joint Venture Company Global Premier Ltd",
            "Summary": "Premier Explosives has incorporated a new joint venture company named Global Premier Ltd. This strategic move suggests the company is expanding its operations or entering into a new business partnership, potentially to enhance its market presence or diversify its product offerings.",
            "Sentiment": "positive",
            "PublishDate": 1741565357000,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Explosives Incorporates Joint Venture Company Global Premier Ltd",
            "Summary": "Premier Explosives has announced the incorporation of a new joint venture company named Global Premier Ltd. This strategic move suggests an expansion of Premier Explosives' business operations through a collaborative partnership.",
            "Sentiment": "positive",
            "PublishDate": 1741351570000,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Explosives: Q3 Profit Soars 439% YoY to ₹9.22 Crore",
            "Summary": "Premier Explosives reported Q3 FY25 results with revenue up 272.35% YoY to ₹165.92 crore. Net profit increased 439.18% YoY to ₹9.22 crore. EPS rose to ₹1.71, up 434.38% YoY. Operating income grew 590.66% YoY despite a 8.65% QoQ decline.",
            "Sentiment": "positive",
            "PublishDate": 1739566488000,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Reports Strong Q3 Results and Secures Export Order",
            "Summary": "Premier Explosives announced impressive Q3 financial results, with consolidated net profit increasing to 92 million rupees from 17 million rupees year-over-year. Revenue also saw a significant jump to 1.66 billion rupees from 445 million rupees in the same period last year. Additionally, the company secured an export order worth 203.6 million rupees for the design and development of rocket motors, to be delivered over a two-year period.",
            "Sentiment": "positive",
            "PublishDate": 1739405885000,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Secures Export Order for Rocket Motors",
            "Summary": "Premier Explosives has received an export order valued at 203.6 million rupees for the design and development of rocket motors. The order is to be fulfilled over a two-year period.",
            "Sentiment": "positive",
            "PublishDate": 1739366299000,
            "Source": "order&deals"
        },
        {
            "Title": "Premier Explosives Reports Significant EBITDA Growth in Q3",
            "Summary": "Premier Explosives has announced its Q3 financial results, showing a substantial increase in EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) from 49 million rupees to 155 million rupees year-over-year. However, the EBITDA margin decreased slightly from 10.95% to 9.31% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739360064000,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Premier Explosives has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 92 million rupees, up from 17 million rupees in the same quarter last year. Revenue also saw a dramatic rise, reaching 1.66 billion rupees compared to 445 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739360059000,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives to Consider Q3 Results",
            "Summary": "Premier Explosives Limited has announced that it will consider its financial results for the third quarter on February 12. This indicates the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1738584625000,
            "Source": "earnings"
        },
        {
            "Title": "Premier Explosives: Fatal Fire at Telangana Factory",
            "Summary": "A fire broke out at Premier Explosives' Telangana factory on January 4, resulting in one death and one severe injury. The incident damaged a pyro technique manufacturing facility. The cause is under investigation, and the company is cooperating with authorities. Damaged assets were insured, and the company aims to resume normal operations soon.",
            "Sentiment": "negative",
            "PublishDate": 1735978882000,
            "Source": "normal_news"
        },
        {
            "Title": "Premier Explosives: New JV Targets Rs 500 Crore Turnover in Three Years",
            "Summary": "Premier Explosives Ltd. has formed a joint venture with Global Munition Ltd. to manufacture defense and aerospace products. The company expects this JV to generate Rs 500 crore in turnover within three years, with an initial Rs 200 crore expected in the first year of operation. Premier Explosives will hold a 49% stake in the venture, funded through internal accruals and fundraising.",
            "Sentiment": "positive",
            "PublishDate": 1734410819000,
            "Source": "corporate_action"
        }
    ]
}