{
    "Symbol": "PREMIERPOL",
    "ISIN": "INE309M01020",
    "News": [
        {
            "Title": "D L Millar Acquires 95,450 Premier Polyfilm Shares",
            "Summary": "D L Millar & Co Ltd, a promoter group company, acquired 95,450 equity shares (0.09%) of Premier Polyfilm Limited through open market transactions on February 4, 2026, increasing its total holding to 13.41%.",
            "Sentiment": "neutral",
            "PublishDate": 1770352951639,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Polyfilm Promoter Group Member Trades Shares",
            "Summary": "Manvi Goenka, promoter group member of Premier Polyfilm Limited, disposed 3,000 shares on 29-01-2026 and acquired 3,000 shares on 30-01-2026 through open market transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1769920268341,
            "Source": "co_actions_results"
        },
        {
            "Title": "DL Millar Acquires 41,891 Premier Polyfilm Shares",
            "Summary": "DL Millar & Co Ltd acquired 41,891 equity shares and disposed 21,815 shares of Premier Polyfilm Limited on January 28, 2026, maintaining 13.18% shareholding as promoter group company.",
            "Sentiment": "neutral",
            "PublishDate": 1769682273979,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Polyfilm Promoter Acquires 20,448 Shares",
            "Summary": "Promoter Shri Amar Nath Goenka acquired 20,448 equity shares (0.02%) of Premier Polyfilm Limited through open market purchase on January 23, 2026, increasing his holding to 5.32%.",
            "Sentiment": "neutral",
            "PublishDate": 1769514873366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Polyfilm Independent Director Resigns",
            "Summary": "Premier Polyfilm Limited announces resignation of Independent Director Mr. Umesh Kumar Agarwalla effective January 12, 2026, citing other professional commitments as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768299221790,
            "Source": "stocks"
        },
        {
            "Title": "Premier Polyfilm Independent Director Resigns",
            "Summary": "Premier Polyfilm Limited announces resignation of Independent Director Mr. Umesh Kumar Agarwalla effective January 12, 2026, citing professional commitments and travel obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1768218386698,
            "Source": "stocks"
        },
        {
            "Title": "Premier Polyfilm faces ₹50,000 NSE fine for XBRL delay",
            "Summary": "Premier Polyfilm Limited received a ₹50,000 fine from NSE for delayed XBRL filing due to technical issues. Board reviewed the matter and applied for waiver while implementing new compliance measures.",
            "Sentiment": "negative",
            "PublishDate": 1768217123896,
            "Source": "stocks"
        },
        {
            "Title": "Premier Polyfilm Q3FY26 Net Profit Jumps 39.13%",
            "Summary": "Premier Polyfilm Limited reported strong Q3FY26 results with net profit rising 39.13% YoY to ₹928 lakhs. Revenue from operations grew 27.59% to ₹8,911 lakhs, while nine-month profit increased 14.16% to ₹2,330 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1768216838760,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Polyfilm Q3FY26 Results & Director Exit",
            "Summary": "Premier Polyfilm reports Q3FY26 net profit of ₹928 lakhs, up 39.1% YoY. Revenue grows 27.6% to ₹8,911 lakhs. Independent Director Umesh Kumar Agarwalla resigns citing professional commitments.",
            "Sentiment": "positive",
            "PublishDate": 1768215518290,
            "Source": "co_actions_results"
        },
        {
            "Title": "Premier Polyfilm Appoints Independent Director, Approves Quarterly Results and Business Expansion Plans",
            "Summary": "Premier Polyfilm Limited's board approved several key decisions during its November 10, 2025 meeting. The company appointed Mrs. Mainka Sharma as Additional Non-Executive Independent Director for a five-year term from November 10, 2025 to November 9, 2030, subject to shareholder approval through postal ballot. The board approved standalone unaudited financial results for the quarter and half-year ended September 30, 2025, showing revenue from operations of Rs 5,817.78 lakhs for the quarter. The company also approved adding warehousing and logistics business to its main object clause in the Memorandum of Association, subject to shareholder approval. Additionally, the board reconstituted various committees including Audit, Nomination Remuneration, and Stakeholders Relationship committees to include the new director, and approved related party transaction limits for financial year 2026-2027. The company manufactures vinyl flooring, PVC sheeting, PVC geomembranes, and PVC artificial leather.",
            "Sentiment": "positive",
            "PublishDate": 1762804930381,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Polyfilm Limited Reports Quarterly and Half-Year Financial Results for Period Ended September 30, 2025",
            "Summary": "Premier Polyfilm Limited's Board of Directors approved unaudited standalone financial results for the quarter and half-year ended September 30, 2025. The company, which manufactures flexible PVC flooring, film and sheets, reported revenue from operations of ₹7,729.56 lakhs for the quarter. Total expenses for the quarter were ₹7,313 lakhs. The company's earnings per share from continuing operations was ₹0.76 for the quarter compared to ₹3.75 in the previous year quarter. For the half-year period, earnings per share was ₹1.34. The company's total assets stood at ₹17,031 lakhs as of September 30, 2025, with total equity of ₹13,200 lakhs. The results were reviewed by the Audit Committee and received a limited review from statutory auditors MARS Associates.",
            "Sentiment": "neutral",
            "PublishDate": 1762777555321,
            "Source": "earnings"
        },
        {
            "Title": "Premier Polyfilm Limited Approves Dividend Payment at Annual General Meeting",
            "Summary": "Premier Polyfilm Limited shareholders approved dividend payment at the company's 33rd Annual General Meeting held on September 24, 2025. The meeting was conducted from 3:30 PM to 3:57 PM. The approved dividend will be disbursed to eligible shareholders on or before October 23, 2025. The company is a manufacturer of vinyl flooring, PVC sheeting, PVC geomembranes, and PVC artificial leather.",
            "Sentiment": "positive",
            "PublishDate": 1758717055310,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Polyfilm Appoints Two Executive Directors and New Secretarial Auditor",
            "Summary": "Premier Polyfilm Limited shareholders approved three key appointments at their meeting on September 24, 2025. Ram Babu Verma was re-appointed as Executive Director for 12 months starting December 27, 2025. The 62-year-old holds degrees in Science, Economics, and MSW with over 36 years of executive experience. Mayank Goenka, aged 27, was appointed as Whole-time Director (Executive Director) for three years from July 23, 2025 to July 22, 2028. He is an engineering graduate from University of Glasgow with five years of project management experience and is the son of Managing Director Amitaabh Goenka. The company also appointed M/s Sumit Bajaj & Associates as Secretarial Auditor for five consecutive financial years from 2025-26 to 2029-30. The firm specializes in corporate laws, SEBI regulations, and compliance audits.",
            "Sentiment": "positive",
            "PublishDate": 1758716680325,
            "Source": "corporate_governance"
        },
        {
            "Title": "Premier Polyfilm Reports Share Inheritance from HUF to Existing Promoter",
            "Summary": "Premier Polyfilm Limited announced the inheritance of 26,71,645 shares from Amar Nath Goenka (HUF) to Amar Nath Goenka, who serves as the Karta and existing promoter. Following this inheritance and the dissolution of the HUF, Amar Nath Goenka (HUF) will cease to be part of the Promoter Group. However, the HUF will remain classified as part of the Promoter Group until the complete inheritance and legal transfer of all shares is finalized. The updated shareholding pattern reflecting the revised Promoter and Promoter Group holdings will be shown in the quarter ending September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757336573758,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Polyfilm Sets Record Date for Final Dividend Payment",
            "Summary": "Premier Polyfilm Limited has set September 17, 2025 as the record date for determining shareholders eligible to receive a final dividend of Rs. 0.15 per equity share for fiscal year 2024-25. The dividend represents 15% of the face value per share. Shareholders holding equity shares on the record date will be entitled to receive the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1753422534975,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Polyfilm Announces Book Closure for 32nd AGM and Dividend Determination",
            "Summary": "Premier Polyfilm Limited has announced a book closure period from September 18, 2025 to September 24, 2025. The closure serves two purposes: conducting the company's 32nd Annual General Meeting scheduled for September 24, 2025, and determining eligible shareholders for dividend distribution for financial year 2024-2025. During this period, the company's register of members and share transfer books will remain closed. The company trades on NSE under symbol PREMIERPOL and on BSE under code 514354.",
            "Sentiment": "neutral",
            "PublishDate": 1753271491966,
            "Source": "corporate_action"
        },
        {
            "Title": "Premier Polyfilm Approves Q1 2025 Results, Schedules 33rd AGM, and Makes Key Leadership Appointments",
            "Summary": "Premier Polyfilm Limited's board approved unaudited financial results for the quarter ended June 30, 2025, and scheduled the 33rd Annual General Meeting for September 24, 2025, via video conferencing. The company reported revenue from operations of Rs 7,444 lakhs for Q1 2025 compared to Rs 8,279 lakhs in the same quarter last year. Net profit for the quarter was Rs 600 lakhs versus Rs 559 lakhs in the previous year. The board made several key appointments: re-appointed Ram Babu Verma as Executive Director for 12 months, appointed Mayank Goenka (son of Managing Director Amitaabh Goenka) as Additional Executive Director, and selected new auditors including Sumit Bajaj & Associates as Secretarial Auditor for 5 years, Cheena & Associates as Cost Auditor, and D D Bansal Associates as Internal Auditor for FY 2025-26. The company's register of members will remain closed from September 18-24, 2025, for AGM purposes and dividend eligibility determination. All appointments are subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1753267145742,
            "Source": "earnings"
        },
        {
            "Title": "Premier Polyfilm Reports Q4 Financial Results",
            "Summary": "Premier Polyfilm has released its Q4 financial results. The company's EBITDA for Q4 was 90 million rupees, compared to 96 million rupees in the same quarter last year. The EBITDA margin decreased to 10.88% from 12.33% year-over-year. Net profit for Q4 was 56 million rupees, down from 67 million rupees in the previous year. However, revenue increased to 828 million rupees from 781 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747482339000,
            "Source": "result"
        }
    ]
}