{
    "Symbol": "PRESTIGE",
    "ISIN": "INE811K01011",
    "News": [
        {
            "Title": "Prestige Estates Q3FY26 QIP Monitoring Report",
            "Summary": "ICRA confirms no deviation in Prestige Estates' ₹5000 crore QIP proceeds utilization for Q3FY26. Company has utilized ₹4678.35 crore with ₹321.65 crore remaining for subsidiary investments.",
            "Sentiment": "positive",
            "PublishDate": 1769703841204,
            "Source": "stocks"
        },
        {
            "Title": "Prestige Estates Q3FY26 Revenue Jumps 59% to ₹11,294M",
            "Summary": "Prestige Estates Projects reported strong Q3FY26 results with revenue rising 59% YoY to ₹11,294 million and net profit declining to ₹458 million from ₹1,317 million in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1769703057261,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prestige Estates Gets NSE Cautionary Email",
            "Summary": "Prestige Estates Projects receives cautionary email from NSE regarding secretarial auditor observations for FY2025, covering governance reporting and compliance issues.",
            "Sentiment": "negative",
            "PublishDate": 1769602156012,
            "Source": "stocks"
        },
        {
            "Title": "Prestige Estates Projects Shares Drop 2.26% on High Volume",
            "Summary": "Prestige Estates Projects shares declined 2.26% to ₹1,390.50 amid high trading volume. The company reported strong Q2 FY26 results with revenue of ₹2,431.70 crores and net profit of ₹445.60 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1769165075534,
            "Source": "stocks"
        },
        {
            "Title": "Prestige Group eyes REIT launch by FY28-29",
            "Summary": "Prestige Group reports 96% occupancy in office portfolio, plans REIT launch after reaching 45 million sq ft of leased assets by FY28-29. Strong demand continues across key markets.",
            "Sentiment": "positive",
            "PublishDate": 1768835007797,
            "Source": "stocks"
        },
        {
            "Title": "Prestige Estates Records Highest Sales of ₹223b in 9M FY26",
            "Summary": "Prestige Estates Projects achieves record-breaking sales of ₹223 billion and collections of ₹132 billion in 9M FY26, with Q3 pre-sales growing 39% YoY to ₹41.80 billion.",
            "Sentiment": "positive",
            "PublishDate": 1768522701706,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prestige Launches ₹5,000 Cr Evergreen Project in Bengaluru",
            "Summary": "Prestige Estates Projects unveils Evergreen at Prestige Raintree Park in Whitefield, Bengaluru, featuring 2,000 apartments across 24 acres with units starting at ₹92 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1768408673265,
            "Source": "stocks"
        },
        {
            "Title": "Prestige Estate: Q3 FY26 Pre-Sales Up 39% To ₹41.8B",
            "Summary": "Prestige Estate reported Q3 FY26 pre-sales of ₹41,836 million, up 39% YoY, with 9M FY26 sales reaching record ₹223,273 million. Collections stood at ₹45,475 million for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768408607814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prestige Estates Forms New Wholly-Owned Subsidiary",
            "Summary": "Prestige Estates Projects Limited incorporated Orange Grove Lands Private Limited as a wholly-owned subsidiary on January 9, 2026, with ₹1.00 lakh paid-up capital for real estate development activities.",
            "Sentiment": "positive",
            "PublishDate": 1768040100563,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prestige Estates Forms New Wholly-Owned Subsidiary",
            "Summary": "Prestige Estates Projects Limited incorporated Stellar Prism Private Limited as a wholly-owned subsidiary on January 9, 2026, with ₹1.00 lakh paid-up capital for real estate development business.",
            "Sentiment": "positive",
            "PublishDate": 1768030796349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prestige Estates Launches Two New Development Units",
            "Summary": "Prestige Estates Projects introduces Stellar Builder Dynamics LLP and Stellar Envision LLP as new subsidiaries focused on real estate development, commencing operations from January 8, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767940118279,
            "Source": "stocks"
        },
        {
            "Title": "Prestige Estates Forms Two New Real Estate Subsidiaries",
            "Summary": "Prestige Estates Projects Limited incorporated two wholly owned subsidiaries - Stellar Builder Dynamics LLP and Stellar Envision LLP on January 8, 2026, for real estate development with ₹1.00 lakh contribution each.",
            "Sentiment": "positive",
            "PublishDate": 1767937059925,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prestige Group Acquires 16.38-Acre Land in Chennai",
            "Summary": "Prestige Group through Canopy Living LLP signed agreement to purchase 16.38-acre land parcel in Padi, Chennai, strategically located near Anna Nagar residential micro-market.",
            "Sentiment": "positive",
            "PublishDate": 1767867992196,
            "Source": "stocks"
        },
        {
            "Title": "Prestige Estates Projects Block Trade Worth ₹19.96 Cr",
            "Summary": "Prestige Estates Projects witnessed a significant NSE block trade of ₹19.96 crores involving 123,303 shares at ₹1,619.00 per share, indicating institutional interest in the realty major.",
            "Sentiment": "neutral",
            "PublishDate": 1767588292504,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prestige Estates Projects Block Trade Worth ₹48.84 Cr",
            "Summary": "Prestige Estates Projects executed a significant NSE block trade involving 305,435 shares at ₹1,599.00 per share, totaling ₹48.84 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767241643516,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prestige Group Acquires 25 Acres in Chennai",
            "Summary": "Prestige Group expands Chennai portfolio with 25-acre land acquisition in Medavakkam, featuring 5 million sq ft development potential and estimated revenue exceeding ₹5,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1766415632371,
            "Source": "stocks"
        },
        {
            "Title": "Prestige Estates Unit Acquires Bharatnagar Buildcon Stake",
            "Summary": "Prestige Estates Projects subsidiary purchases partnership stake in Bharatnagar Buildcon LLP, securing 66.93% indirect ownership through strategic acquisition worth ₹938.75 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765377114075,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prestige Estates Issues Corporate Guarantee of Up to INR 550 Crores for Subsidiary's Term Loan",
            "Summary": "Prestige Estates Projects Limited has issued a corporate guarantee up to INR 550 crores to secure a term loan facility being availed by its wholly owned subsidiary Prestige Falcon Malls Private Limited from DBS Bank India Limited. The guarantee represents a contingent liability for the company and has been provided on an arm's length basis with no current impact on the parent company.",
            "Sentiment": "neutral",
            "PublishDate": 1764591998894,
            "Source": "corporate_action"
        },
        {
            "Title": "Prestige Estates Projects Reports No Deviation in QIP Fund Utilization for September 2025 Quarter",
            "Summary": "Prestige Estates Projects Limited disclosed its monitoring agency report for the quarter ended September 30, 2025, confirming no material deviation in the utilization of proceeds from its Rs 5000 crore QIP issued in August-September 2024. ICRA Limited, the monitoring agency, verified that fund deployment remains aligned with stated objectives including debt repayment, land acquisition, subsidiary investments, and general corporate purposes, with Rs 420.65 crore remaining unutilized and invested in fixed deposits.",
            "Sentiment": "positive",
            "PublishDate": 1763643861331,
            "Source": "corporate_action"
        },
        {
            "Title": "Prestige Estates Targets Growth With ₹60,000 Crore Project Pipeline Across Major Cities",
            "Summary": "Prestige Estates has outlined its growth strategy with ₹25,000 crore in ongoing projects and ₹35,000 crore in upcoming pipeline. The company is expanding its residential and commercial portfolio across Bengaluru, Mumbai, NCR and Hyderabad. The real estate developer plans to strengthen its hospitality and retail assets through the REIT route while focusing on capital recycling and asset-light expansion to boost return on equity and cash flow stability.",
            "Sentiment": "positive",
            "PublishDate": 1762967368263,
            "Source": "stock"
        },
        {
            "Title": "Prestige Estates Projects Reports Strong Q2 Performance with EBITDA Rising to 9.1B Rupees",
            "Summary": "Prestige Estates Projects delivered robust Q2 results with EBITDA increasing to 9.1 billion rupees from 6.3 billion rupees year-over-year. The company's EBITDA margin expanded significantly to 37.41% compared to 27.4% in the same period last year. Consolidated net profit more than doubled to 4.3 billion rupees from 1.9 billion rupees year-over-year. Revenue grew modestly to 24 billion rupees from 23 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762960606176,
            "Source": "earnings"
        },
        {
            "Title": "Prestige Group Launches ₹2,000 Crore Residential Project in Mumbai's Dahisar-Mira Road Corridor",
            "Summary": "Prestige Group launched Prestige Garden Trails, a residential development in Mumbai's Dahisar-Mira Road corridor. The project spans 5.2 acres with approximately 1 million sq. ft. carpet area, featuring 1,324 residential units across 1, 2, and 3-bedroom apartments. The development has a Gross Development Value of ₹2,000 crore and is strategically located near the upcoming Metro station with connectivity through Western Express Highway and Metro Line 9. The project includes amenities such as landscaped gardens, clubhouse, swimming pool, children's play zones, fitness facilities, and multipurpose courts. Chairman Irfan Razack stated that Mumbai remains a key focus market and the project reflects confidence in demand for quality mid-segment housing. This launch strengthens Prestige Group's Mumbai portfolio, which includes luxury, mid-segment, and commercial developments.",
            "Sentiment": "positive",
            "PublishDate": 1760417979123,
            "Source": "stock"
        },
        {
            "Title": "Prestige Group Launches Second Phase of Ghaziabad Township with 620 Units Worth Rs 2,200 Crore",
            "Summary": "Prestige Estates Projects Ltd launched 620 residential units in the second phase of its Ghaziabad township project, targeting Rs 2,200 crore in revenue. The new phase, called 'Mayflower', is part of 'The Prestige City, Indirapuram' township spread across 62.5 acres. The company entered the Delhi-NCR market in April and has sold almost all units from the first phase, which comprised 3,421 units worth Rs 9,000 crore. Prestige Estates reported strong performance with sales bookings increasing 50% to Rs 6,017.3 crore in the September quarter, driven by robust housing demand. The company achieved record sales of Rs 18,143.7 crore in the first half, up 157% year-on-year, surpassing total sales bookings from the previous fiscal year. Average apartment realization rose 8% to Rs 14,906 per square feet, while plot prices increased 43% to Rs 9,510 per square feet. The group has delivered 307 projects spanning 199 million sq ft and has a pipeline of 132 projects across 200 million sq ft.",
            "Sentiment": "positive",
            "PublishDate": 1760269611944,
            "Source": "stock"
        },
        {
            "Title": "Prestige Estates Issues ₹250 Crore Corporate Guarantee for Subsidiary's Loan Facility",
            "Summary": "Prestige Estates Projects Limited has issued a corporate guarantee to secure a loan facility for its subsidiary, Dollars Hotel and Resorts Private Limited. The guarantee covers a facility of up to ₹250 crores from Canara Bank/Catalyst Trusteeship Limited. The company states that promoter/promoter group has no interest in this transaction and the guarantee was provided on an arm's length basis. The corporate guarantee represents a contingent liability for Prestige Estates, with the company noting no current impact from this guarantee.",
            "Sentiment": "neutral",
            "PublishDate": 1760101180019,
            "Source": "corporate_action"
        },
        {
            "Title": "Prestige Estates Shares Jump Over 5% on Record First-Half Sales Performance",
            "Summary": "Prestige Estates shares surged over 5% to Rs 1,592, with an intraday high of Rs 1,618, following the company's announcement of record-high sales in the first half of the financial year. The company exceeded its full-year FY25 sales in just the first half of FY26, with Bengaluru market contributing 40% of the sales mix in Q2FY26. Nomura maintained its 'buy' rating with a target price of Rs 1,900, noting the company has achieved 69% of its pre-sales guidance. The stock has declined 14% over the past 12 months but benefited from strong real estate market sentiment. Analyst consensus shows 19 out of 21 analysts recommend 'buy' with a 12-month target price of Rs 1,915, suggesting 21% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1759984174629,
            "Source": "stock"
        },
        {
            "Title": "Prestige Estates Projects Sees Rs. 53.46 Crore Block Trade on NSE",
            "Summary": "Prestige Estates Projects Ltd. recorded a block trade worth Rs. 53.46 crores on the National Stock Exchange. The transaction involved approximately 334,003 shares at a price of Rs. 1,600.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759981798975,
            "Source": "order&deals"
        },
        {
            "Title": "Prestige Estate Reports Strong Quarterly Performance with 50% Sales Growth",
            "Summary": "Prestige Estate reported quarterly sales of ₹60.2 billion, representing a 50% increase compared to the same period last year. The company also achieved collections of ₹42.12 billion, marking a 54% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1759930809044,
            "Source": "earnings"
        },
        {
            "Title": "Prestige Estates Subsidiary Faces ₹154 Crore GST Notice",
            "Summary": "Prestige Estates Projects' subsidiary, Prestige Mulund Realty Private Limited, received a show cause notice from the Directorate General of Goods & Services Tax Intelligence (DGGI), Mumbai, alleging non-payment or short-payment of GST. The notice demands ₹153.60 crore in GST along with equivalent penalty and applicable interest under the Central Goods and Services Tax Act, 2017. The subsidiary has 30 days to respond to the Additional/Joint Commissioner, CGST & Central Excise, Mumbai East Commissionerate. Prestige Estates stated the demand is not maintainable and expects no material impact on its financials, operations, or business activities. The company's shares closed at ₹1,547.00, up 0.94% on the BSE.",
            "Sentiment": "negative",
            "PublishDate": 1759772191954,
            "Source": "stock"
        },
        {
            "Title": "Prestige Estates Projects Shareholders Approve All 12 Resolutions at 28th AGM Including Rs 1.80 Final Dividend",
            "Summary": "Prestige Estates Projects Limited held its 28th Annual General Meeting on September 10, 2025, where shareholders approved all 12 proposed resolutions. Key approvals included adoption of audited standalone and consolidated financial statements for the year ended March 31, 2025, declaration of final dividend of Rs 1.80 per equity share for Financial Year 2024-2025, and re-appointment of Mr. Irfan Razack as Director. The company also secured approval for issuing Non-Convertible Debentures on private placement basis and revision in remuneration of Ms. Uzma Irfan as Director. Additionally, shareholders approved remuneration for related parties Mr. Zayd Noaman and Mr. Faiz Rezwan, along with material related party transactions with subsidiaries Prestige Projects Private Limited and Prestige Falcon Mumbai Realty Private Limited. The meeting had 167,120 total shareholders on the cut-off date of September 3, 2025, with 94 shareholders present either in person or through proxy. All resolutions received overwhelming support with most achieving over 90% approval rates.",
            "Sentiment": "positive",
            "PublishDate": 1757607981822,
            "Source": "corporate_action"
        },
        {
            "Title": "Forum Malls Plans to Nearly Double Portfolio with 14 New Shopping Centres by 2029",
            "Summary": "Forum Malls, the retail arm of Prestige Group, plans to open 14 new shopping centres across Delhi, Mumbai, Bengaluru, Chennai and Hyderabad by 2029, nearly doubling its current portfolio of 11 malls. CEO Muhammad Ali stated the company is focusing on tier-I markets where consumers have both means and appetite to spend, unlike tier-II cities where propensity to spend doesn't match metros. The expansion includes India's first athleisure-focused mall covering 800,000 sq ft near Bengaluru's international airport by 2027, featuring global sportswear labels, fitness gear, yoga studios and lifestyle brands. Forum generates 30%-40% of annual sales during the October-December festive period and expects footfall and revenue to rise about 15% in October. The company spends 30%-40% of its annual marketing budget during the festive season, with planning beginning in January.",
            "Sentiment": "positive",
            "PublishDate": 1757576868364,
            "Source": "stock"
        },
        {
            "Title": "Prestige Estates Subsidiary Receives ₹161 Crore GST Show-Cause Notice",
            "Summary": "Prestige Estates Projects' subsidiary, Prestige Office Ventures, received a show-cause notice from the Directorate General of Goods & Services Tax Intelligence, Hyderabad. The notice alleges non-payment or short-payment of goods & services tax and non-reversal of input tax credit during February 2020 to March 2024. Tax authorities have proposed a demand of ₹160.82 crore, along with equivalent penalty and applicable interest. The subsidiary must appear before the additional or joint commissioner within 30 days. Prestige Estates considers the demand not maintainable and expects no material impact on its financials. The company's shares closed at ₹1,588.70, up 1.48% on the day.",
            "Sentiment": "negative",
            "PublishDate": 1756910961762,
            "Source": "stock"
        },
        {
            "Title": "Prestige Estates Issues ₹1,000 Crore Corporate Guarantee for Subsidiary's Loan",
            "Summary": "Prestige Estates has issued a corporate guarantee worth ₹1,000 crore for loan and construction finance availed by its wholly owned subsidiary, Prestige Acres Pvt Ltd. This guarantee provides financial backing for the subsidiary's borrowing requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1756735570863,
            "Source": "stock"
        },
        {
            "Title": "Prestige Group Calls Karnataka's Property Registration Fee Hike 'Unfair' to Homebuyers",
            "Summary": "Prestige Group Chairman and Managing Director Irfan Razack criticized Karnataka government's decision to double property registration fees from 1% to 2%, effective August 31. The change increases total property transaction fees to 7.6% from 6.6%, adding Rs 1 lakh cost for a Rs 1 crore property purchase. Razack called it unfair burden on homebuyers, particularly during a period of reduced registrations due to regulatory challenges like e-khata implementation. Despite the fee hike, he expressed confidence that real estate business won't be significantly impacted due to healthy market conditions. Razack noted strong IT sector performance with increased commercial space leasing to Global Capability Centres in Bengaluru, Pune, Hyderabad and Chennai, indicating continued job creation. He warned of potential market slowdown if prices breach affordability barriers but cited strong economy and positive sentiment as current market drivers. The executive appealed for reinstatement of input tax credit in upcoming GST Council meeting, stating its removal caused 18% cost increase. Prestige Estates Projects shares closed 1.42% higher at Rs 1,584 on NSE.",
            "Sentiment": "negative",
            "PublishDate": 1756726047624,
            "Source": "stock"
        },
        {
            "Title": "Prestige Estates Projects Sets Record Date for ₹1.80 Final Dividend Payment",
            "Summary": "Prestige Estates Projects Limited has set September 3, 2025 as the record date for determining shareholder eligibility for a final dividend of ₹1.80 per equity share for the financial year 2024-25. The Board of Directors recommended this dividend at their meeting on May 29, 2025, subject to shareholder approval at the Annual General Meeting scheduled for September 10, 2025. If approved, the dividend payment will be distributed on or before October 9, 2025, subject to tax deduction at source. The dividend applies to equity shares with a face value of ₹10 each.",
            "Sentiment": "positive",
            "PublishDate": 1755599224743,
            "Source": "corporate_action"
        },
        {
            "Title": "Prestige Estates Expects to Exceed Rs 25,000 Crore Pre-Sales Target in FY26",
            "Summary": "Prestige Estates Projects is targeting pre-sales of over Rs 25,000 crore in FY26, with Chairman and Managing Director Irfan Razack expressing confidence the company will surpass this target. The company achieved sales of Rs 12,126.4 crore in the quarter ended June, representing nearly half of the annual target. Razack indicated the company holds inventory worth Rs 20,000 crore and has a pipeline with Gross Development Value of Rs 42,000 crore, totaling Rs 62,000 crore in potential stock. He identified the mid-market segment (Rs 1-3 crore) as the consistent demand driver and noted that property values have reached a peak, cautioning against rapid price increases that could affect affordability. The company has received clearance for its hospitality arm's IPO draft prospectus and expects to complete the offering by mid-September. Razack welcomed recent RBI rate cuts as beneficial for homebuyers and supported the decision to maintain the repo rate at 5.5%.",
            "Sentiment": "positive",
            "PublishDate": 1754824537984,
            "Source": "stock"
        },
        {
            "Title": "Prestige Group Acquires 102 Acres Across Four Cities for Rs 20,000 Crore Housing Projects",
            "Summary": "Prestige Estates Projects Ltd acquired 102 acres of land across Bengaluru, Hyderabad, Chennai and Mumbai during the April-June quarter to develop residential projects with an estimated gross development value of Rs 20,400 crore. The acquisitions include 65 acres in Hyderabad (28 acres in Tellapur and 37 acres in Pulimamidi), 27 acres across three locations in Bengaluru, 3.48 acres in Chennai's Velachery, and 6.3 acres in Mumbai. The company reported a 26% increase in consolidated net profit to Rs 292.5 crore for the quarter, up from Rs 232.6 crore in the previous year. Total income rose to Rs 2,468.7 crore from Rs 2,024.5 crore. Sales bookings jumped four-fold to Rs 12,126.4 crore in the quarter, primarily driven by strong demand for its Ghaziabad housing project, compared to Rs 3,029.5 crore in the same period last year. The company has set a guidance target of Rs 27,000 crore in sales bookings for the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1754735367007,
            "Source": "stock"
        },
        {
            "Title": "Prestige Estates Maintains FY'26 Pre-Sales Target of ₹25,000-27,000 Crore Despite Strong Q1 Performance",
            "Summary": "Prestige Estates has maintained its pre-sales target of ₹25,000-27,000 crore for FY'26 following strong quarterly results. The company estimates residential revenue recognition at ₹8,000-10,000 crore. Office rental income is projected to reach ₹8,200 million by the end of FY'26. The company expects debt to increase by ₹1,000-1,200 crore in FY'26 without additional monetization measures.",
            "Sentiment": "positive",
            "PublishDate": 1754536964208,
            "Source": "stock"
        },
        {
            "Title": "Prestige Estates Projects Reports No Deviation in QIP Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Prestige Estates Projects Limited submitted a monitoring agency report confirming no deviation in the utilization of proceeds from their Qualified Institutional Placement for the quarter ended June 30, 2025. ICRA Limited, the monitoring agency, confirmed that the utilization of the issuance proceeds is in line with the objects of the issue. The company raised Rs 5,000 crore through the QIP in September 2024, with net proceeds of Rs 4,899.17 crore after issue-related expenses. Out of the total proceeds, Rs 4,546.75 crore has been utilized across four main objectives: Rs 1,500 crore for loan repayment, Rs 1,000 crore for land acquisition, Rs 796.75 crore for investment in subsidiaries and joint ventures, and Rs 1,149.17 crore for general corporate purposes. The remaining Rs 453.25 crore is unutilized and deployed in fixed deposits with banks earning returns between 5.25% to 6.50%. All objects are reported to be on schedule with completion dates ranging from March 2025 to March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1754405939811,
            "Source": "corporate_action"
        },
        {
            "Title": "Prestige Estates Projects Reports 26% Growth in Q1 Net Profit to 2.9 Billion Rupees",
            "Summary": "Prestige Estates Projects reported consolidated net profit of 2.9 billion rupees in Q1, up from 2.3 billion rupees in the same period last year. Revenue increased to 23.1 billion rupees from 18.6 billion rupees year-over-year. EBITDA rose to 8.9 billion rupees compared to 7.96 billion rupees previously. However, EBITDA margin declined to 38.74% from 42.76% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1754404144151,
            "Source": "earnings"
        },
        {
            "Title": "Prestige Estates Projects Sees Rs. 25.71 Crore Block Trade on NSE",
            "Summary": "Prestige Estates Projects Ltd. witnessed a block trade worth Rs. 25.71 crores on the NSE. The transaction involved approximately 157,847 shares at a price of Rs. 1,628.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1754029723208,
            "Source": "order&deals"
        },
        {
            "Title": "Prestige Estates Projects Acquires Remaining 40% Stake in Apex Realty Ventures for Rs 0.4 Crore",
            "Summary": "Prestige Estates Projects Limited acquired the remaining 40% partnership interest in Apex Realty Ventures LLP on July 22, 2025, making it a wholly owned subsidiary. The acquisition was completed for a cash consideration of Rs 0.4 crore. Prestige previously held 60% partnership interest in the entity. Apex Realty Ventures is a Limited Liability Partnership incorporated on March 28, 2019, engaged in real estate development and construction. The company reported a turnover of Rs 724.08 crore for the year ended March 31, 2025. The acquisition allows Prestige to consolidate its stake and hold 100% partnership interest in the entity directly and indirectly through its wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1753177683160,
            "Source": "order&deals"
        },
        {
            "Title": "Prestige Estates Projects Ltd: Record Q1 Sales and Collections, NCR Market Leads",
            "Summary": "Prestige Estates reported record Q1 FY2026 performance with sales up 300% to ₹12,126.4 crore, volumes up 234% to 9.55 million sq ft, and collections up 55% to ₹4,522.7 crore. NCR region contributed 59% of sales, followed by Bengaluru at 21%. The company launched four residential projects, including its first in NCR, and completed five projects, including its first in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1752049142000,
            "Source": "earnings"
        },
        {
            "Title": "Prestige Estates Reports Record Sales and Collections in Latest Quarter",
            "Summary": "Prestige Estates has achieved exceptional performance in its latest quarter. The company sold 4,718 units, covering a sales volume of 9.55 million square feet. The average realization was Rs 13,339 per square foot. Collections surged by 55% year-over-year to Rs 45,227 million, marking the highest collections in a quarter for the company so far. Prestige Estates reported record sales of ₹121.26 billion, representing a 300% increase compared to the same quarter last year. This quarter has been described as the company's best ever in terms of sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1752047114000,
            "Source": "default"
        },
        {
            "Title": "Prestige Estates Acquires Majority Stakes in Two Real Estate Ventures",
            "Summary": "Prestige Estates has taken full control of two major real estate ventures by acquiring majority stakes in Notting Hill and AAA Investments. This move strengthens Prestige Estates' position in the real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1751875651000,
            "Source": "default"
        },
        {
            "Title": "Prestige Estates Launches ₹3,350 Crore Residential Project in Chennai",
            "Summary": "Prestige Estates has launched a new residential project in Chennai with an estimated sales value of ₹3,350 crore. This move is part of the company's strategy to expand its presence in the Chennai real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1751328353000,
            "Source": "default"
        },
        {
            "Title": "Prestige Estates Provides ₹712 Crore Guarantee for Joint Venture Loan",
            "Summary": "Prestige Estates has provided a guarantee of ₹712 crore for a loan taken by one of its joint venture entities. The specific details of the joint venture or the purpose of the loan are not mentioned in the given headline.",
            "Sentiment": "neutral",
            "PublishDate": 1751293165000,
            "Source": "default"
        },
        {
            "Title": "Prestige Estates Launches ₹3,350 Crore Residential Project in Chennai",
            "Summary": "Prestige Estates has announced the launch of a new residential project in Chennai valued at ₹3,350 crore. This move is aimed at increasing the company's presence in the city. The project details, such as its size, location within Chennai, or expected completion date, are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751292933000,
            "Source": "default"
        },
        {
            "Title": "Prestige Estates Forms Joint Venture with Canopy Living LLP",
            "Summary": "Prestige Estates has established a new joint venture partnership with Canopy Living LLP for real estate development. The collaboration aims to combine the expertise of both entities in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1749217772000,
            "Source": "default"
        },
        {
            "Title": "Prestige Estates Projects Ltd: Q4 Results Miss Estimates, FY26 Outlook Promising",
            "Summary": "Prestige Estates Projects Ltd reported weak Q4 results with Ebitda falling 35% YoY and net profit dropping 41%. However, analysts remain optimistic about FY26 growth, citing a strong pre-sales guidance of Rs 27,000 crore, a 60% YoY increase. The company's expansion into Mumbai and Bangalore, along with potential hospitality business IPO, contribute to positive long-term outlook despite near-term challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1748833828000,
            "Source": "earnings"
        },
        {
            "Title": "Prestige Estates Projects: Plans Rs 42,000 Crore Housing Projects for FY26",
            "Summary": "Prestige Estates Projects Ltd. plans to launch 25 residential projects across major cities in FY26, with an estimated gross development value of Rs 42,120 crore. This follows a decline in sales bookings and net profit in FY25 due to delayed project launches.",
            "Sentiment": "positive",
            "PublishDate": 1748774810000,
            "Source": "corporate_action"
        }
    ]
}