{
    "Symbol": "PRICOLLTD",
    "ISIN": "INE726V01018",
    "News": [
        {
            "Title": "Pricol Establishes New Subsidiary with ₹10M Investment",
            "Summary": "Pricol receives approval to establish a new wholly owned subsidiary and commits to invest up to ₹10 million in the new entity to expand its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1769690168419,
            "Source": "stocks"
        },
        {
            "Title": "Pricol Q3FY26 Results: Revenue Up 27.6% to ₹781 Crores",
            "Summary": "Pricol Limited reports strong Q3FY26 performance with revenue rising 27.6% YoY to ₹780.99 crores and net profit growing 24.8% to ₹44.46 crores. Investor call scheduled for January 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769687867609,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pricol schedules Q3FY26 earnings call for Jan 30",
            "Summary": "Pricol Limited has scheduled an investor conference call on January 30, 2026, at 4:00 PM IST to discuss Q3FY26 and nine-month financial results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767615819294,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pricol Limited Receives Credit Rating Upgrade from India Ratings",
            "Summary": "India Ratings upgraded Pricol Limited's long-term credit rating to INDA-/Stable from INDA+/Stable for fund/non-fund based working capital limits of INR 105 crores, while affirming the short-term rating at INDAlt. The rating upgrade affects the company's borrowing capacity and reflects improved creditworthiness for its working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1764735932949,
            "Source": "corporate_action"
        },
        {
            "Title": "Pricol Limited Reports Strong Q2 FY26 Results with 52% Revenue Growth",
            "Summary": "Pricol Limited delivered strong quarterly results with consolidated revenue from operations reaching INR 988 crores, representing 52% growth driven by both organic expansion and the acquisition of Pricol Precision Products Private Limited (injection molding division from Sundaram Auto). EBITDA stood at INR 123.35 crores with a margin of 12.49%, while PAT reached INR 64 crores (6.5% margin) and EPS was INR 5.25 per share. For the half-year, revenue totaled INR 1,865.59 crores with 48.89% growth. The company announced its first dividend of INR 2 per share for the full year. Management highlighted successful navigation of the rare earth magnet crisis but warned of potential impact from a semiconductor crisis caused by Nexperia affecting the automotive industry. The acquired plastics business improved EBITDA from 6.3% to 9.5% with target of 10-10.5%. Company plans CAPEX of INR 250-300 crores for both current and next fiscal year, focusing on capacity expansion across divisions including new land purchases for the plastics business.",
            "Sentiment": "positive",
            "PublishDate": 1762901808066,
            "Source": "earnings"
        },
        {
            "Title": "Pricol Limited Reports Quarterly Results, Declares ₹2 Interim Dividend",
            "Summary": "Pricol Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025, approved by the Board of Directors on November 6, 2025. The company declared an interim dividend of ₹2 per share (200%) for the financial year 2025-26, payable to shareholders on record as of November 14, 2025. The company has changed its financial reporting format from INR Lakhs to INR Crores due to increased operational size. Pricol operates primarily in the automotive components segment and scheduled an investor conference call for November 7, 2025, to discuss the quarterly results. The financial statements received limited review from statutory auditors Sundaram & Srinivasan, Chartered Accountants.",
            "Sentiment": "positive",
            "PublishDate": 1762431679587,
            "Source": "earnings"
        },
        {
            "Title": "PRICOL Reports 42% Jump in Q2 Net Profit to 640M Rupees",
            "Summary": "PRICOL delivered strong quarterly results with consolidated net profit rising to 640 million rupees from 451 million rupees year-over-year. Revenue grew significantly to 9.9 billion rupees compared to 6.5 billion rupees in the same period last year. EBITDA increased to 1 billion rupees from 773 million rupees year-over-year, though EBITDA margin compressed to 10.12% from 11.88% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762431261176,
            "Source": "earnings"
        },
        {
            "Title": "Pricol Limited Schedules Investor Conference Call for November 7, 2025",
            "Summary": "Pricol Limited has scheduled an investor conference call on Friday, November 7, 2025, at 4:00 PM IST to discuss the financial results for the quarter and half year ended September 30, 2025. The management team will be represented by Managing Director Vikram Mohan, CEO & Executive Director P.M. Ganesh, Director of Strategy Siddharth Manoharan, and CFO Priyadarsi Bastia. The conference call is organized by Valorem Advisors and includes multiple dial-in options including universal numbers and international toll-free numbers for USA, UK, Singapore, and Hong Kong. The company confirmed that no unpublished price sensitive information will be shared during the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1761114833299,
            "Source": "stock"
        },
        {
            "Title": "Pricol Signs MoU with BOE Varitronix for LCD/TFT Optical Bonding Localization in India",
            "Summary": "Pricol has signed a Memorandum of Understanding with BOE Varitronix to localize LCD/TFT optical bonding technology in India. This partnership aims to bring manufacturing capabilities for display technology components to the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1759232511088,
            "Source": "stock"
        },
        {
            "Title": "Pricol Limited Reports 45.57% Revenue Growth in Q1 FY26 Earnings Call",
            "Summary": "Pricol Limited held an earnings conference call discussing quarterly results ended June 30, 2025. The company reported revenue from operations of INR 877.66 crores with 45.57% growth, EBITDA of INR 101.8 crores (11.61% margin) with 26.30% growth, and PAT of INR 49.89 crores (5.68% margin) with 9.51% growth. EPS increased to INR 4.09. The subsidiary PRICOL Precision Products achieved INR 205 crores turnover with 7% EBITDA margin, compared to INR 170 crores and 5% EBITDA in the previous year. Management highlighted challenges from rare earth magnet shortages from China affecting Q1 and expected to continue in Q2. The company launched disc brake products for startup EVs and expects growth from mandatory ABS regulation starting January 2026. Revenue mix shows 65% from two-wheelers, 15% commercial vehicles, 10% each from passenger vehicles and off-road vehicles/tractors. Export revenue comprises 7-8% of total sales. The company signed a technology license agreement with Italian firm Domino for two-wheeler handlebar components, expecting revenue in 12-16 months. Management announced plans for INR 500 crores consolidated CAPEX over three years, with INR 250-300 crores allocated to PRICOL Precision.",
            "Sentiment": "positive",
            "PublishDate": 1754310652839,
            "Source": "earnings"
        },
        {
            "Title": "Pricol Limited Reports Q1 FY26 Results with Revenue Growth and Strategic Partnerships",
            "Summary": "Pricol Limited held an investor conference call for its Q1 FY26 unaudited financial results. The company reported revenue from operations of INR 8,776.60 million, with EBITDA of INR 1,018.62 million and an EBITDA margin of 11.61%. Profit after tax stood at INR 498.94 million with a PAT margin of 5.68% and basic EPS of INR 4.09. The company entered into a Technology License Agreement with Italy-based DOMINO S.R.L. for two-wheeler control systems expansion in India and Southeast Asia. Pricol received multiple supplier awards including recognition from Suzuki Motorcycle India Limited for the fourth consecutive year, Ather Energy for Excellence in Business Competitiveness, and Mann + Hummel for Supplier Excellence. The company launched new products across various segments including LCD and TFT display systems for Bajaj, TVSM, Force Motors, TATA Motors, and TATA Hitachi vehicles. As of June 30, 2025, the stock closed at INR 458.90 with a market cap of INR 55,931.42 million.",
            "Sentiment": "positive",
            "PublishDate": 1754033099568,
            "Source": "earnings"
        },
        {
            "Title": "Pricol Focuses on Technology Partnerships and Operational Excellence for Growth",
            "Summary": "Pricol is pursuing sustained growth through technology tie-ups, operational excellence, and strategic market monitoring. The company is navigating supply chain headwinds as part of its growth strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1753980630474,
            "Source": "stock"
        },
        {
            "Title": "PRICOL Reports 46% Revenue Growth to 8.78B Rupees in Q1 Results",
            "Summary": "PRICOL reported quarterly revenue of 8.78 billion rupees compared to 6 billion rupees in the same period last year. The company's consolidated net profit increased to 499 million rupees from 456 million rupees year-over-year. EBITDA rose to 990 million rupees from 805 million rupees, though EBITDA margin declined to 11.28% from 13.35% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753961212041,
            "Source": "earnings"
        },
        {
            "Title": "Government Issues Draft Regulation Requiring 13-Pin Connectors for All Trailers from October 2026",
            "Summary": "The government has issued a draft proposal to change norms for tractors. Under the new regulations, all trailers must be fitted with 13 pin or 13 pole connectors starting from October 1, 2026. This regulatory change affects Pricol, which operates in the automotive components sector.",
            "Sentiment": "neutral",
            "PublishDate": 1753261761413,
            "Source": "stock"
        },
        {
            "Title": "Pricol Signs Five-Year Deal with Domino S.R.L for Advanced Two-Wheeler Handlebars",
            "Summary": "Pricol has entered into a five-year agreement with Domino S.R.L to produce advanced handlebars for two-wheelers. This partnership aims to enhance the manufacturing of sophisticated handlebar components for motorcycles and scooters.",
            "Sentiment": "positive",
            "PublishDate": 1752557720000,
            "Source": "default"
        },
        {
            "Title": "Pricol Ltd: Q4 Profit Drops 16%, Revenue Surges 32%",
            "Summary": "Pricol Ltd reported a 15.9% YoY decline in Q4 net profit to ₹34.9 crore, while revenue increased 31.7% to ₹769 crore. EBITDA rose 7.8% to ₹79.7 crore. The company's subsidiary acquired Sundaram Auto Components' Injection Moulded Plastic Component Solutions Division. Management expects stronger performance from Q2 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1747314971000,
            "Source": "earnings"
        },
        {
            "Title": "Pricol Reports Mixed Q4 FY2023 Results",
            "Summary": "Pricol Limited has announced its Q4 FY2023 financial results. The company's revenue increased to 7.5 billion rupees from 5.66 billion rupees year-over-year. However, net profit decreased to 349 million rupees from 415 million rupees in the same period last year. EBITDA rose to 802 million rupees from 741.4 million rupees, but the EBITDA margin contracted to 10.66% from 13.09% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747312985000,
            "Source": "result"
        },
        {
            "Title": "Pricol Invests in Subsidiaries and Provides Guarantee",
            "Summary": "Pricol has made significant investments in its subsidiaries. The company invested 1.20 billion rupees in Pricol Precision Products and provided a guarantee of up to 2.3 billion rupees for its credit facilities. Additionally, Pricol invested 30 million rupees in PQSI Digital.",
            "Sentiment": "positive",
            "PublishDate": 1738244371000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pricol Reports Improved Q3 EBITDA and Margin",
            "Summary": "Pricol, an automotive components manufacturer, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 751 million rupees, up from 678 million rupees in the same quarter of the previous year. The EBITDA margin also saw a slight improvement, rising to 12.19% from 12.17% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738238531000,
            "Source": "earnings"
        },
        {
            "Title": "Pricol Reports 10.6% Year-over-Year Revenue Growth in Q3",
            "Summary": "Pricol Limited, an automotive components manufacturer, has announced its financial results for the third quarter. The company reported revenue of 6.16 billion rupees, compared to 5.57 billion rupees in the same quarter of the previous year, representing a 10.6% year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738238524000,
            "Source": "earnings"
        },
        {
            "Title": "Pricol Reports Increase in Q3 Consolidated Net Profit",
            "Summary": "Pricol Limited has announced its financial results for the third quarter. The company's consolidated net profit rose to 414.5 million rupees, up from 340 million rupees in the same quarter last year. This represents a year-over-year increase. Additionally, the profit showed improvement compared to the previous quarter, where it stood at 450.7 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738238515000,
            "Source": "earnings"
        },
        {
            "Title": "Pricol Ltd: Approves Wiping Business Divestment to Auto Ignition for ₹20 Crore",
            "Summary": "Pricol Ltd's board has approved the divestment of its wiping business division to Auto Ignition Ltd for ₹20 crore on a slump sale basis. The transaction is expected to be completed by January 31, 2025. The wiping business division generated revenue of ₹66.36 crores in FY24.",
            "Sentiment": "neutral",
            "PublishDate": 1735826177000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pricol Ltd: Subsidiary Acquires Sundaram Auto's Plastic Components Division",
            "Summary": "Pricol's subsidiary, Pricol Precision Products, to acquire Sundaram Auto Components' plastic division for ₹215.3 crore. Pricol to invest ₹120 crore in subsidiary and provide ₹250 crore corporate guarantee. Acquisition to be completed by January 31, 2025. Pricol also plans to invest up to 26% in PQSI Digital.",
            "Sentiment": "positive",
            "PublishDate": 1733220282000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pricol Announces Significant Revenue Addition Through SACL Acquisition",
            "Summary": "Pricol Limited has announced that it will see a consolidated topline addition of approximately 730 crore rupees. This addition is a result of the company's acquisition of SACL (likely Sansera Aerospace Components Limited), which is reported to have healthy financial parameters that are value accretive to Pricol.",
            "Sentiment": "positive",
            "PublishDate": 1733150489000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pricol Approves Investment in PQSI Digital",
            "Summary": "Pricol Limited has approved a proposal to invest up to 26% of the equity capital in PQSI Digital. This strategic move indicates Pricol's interest in expanding its digital capabilities or portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1733138630000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pricol Approves Acquisition and Investment Plans",
            "Summary": "Pricol has approved the acquisition of the Plastic Component Division from Sundaram Auto Components. Additionally, the company plans to invest up to 1.2 billion rupees in Pricol Precision Products.",
            "Sentiment": "positive",
            "PublishDate": 1733138619000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pricol Reports Improved Q2 EBITDA and Margin",
            "Summary": "Pricol, an automotive components manufacturer, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 773 million rupees from 664 million rupees in the same quarter last year. Additionally, Pricol's EBITDA margin improved slightly to 11.88% from 11.80% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730895819000,
            "Source": "result"
        },
        {
            "Title": "Pricol Reports Strong Q2 Financial Results",
            "Summary": "Pricol, an automotive components manufacturer, has announced its Q2 financial results. The company's consolidated net profit increased to 451 million rupees, up from 332 million rupees year-over-year and 456 million rupees quarter-over-quarter. Revenue for Q2 rose to 6.5 billion rupees from 5.62 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730895753000,
            "Source": "result"
        },
        {
            "Title": "Pricol Acquires Remaining Shares in Pricol Electronics",
            "Summary": "<p>Pricol has <span class='positive'>acquired</span> all remaining shares of <b>Pricol Electronics</b> that were previously held by <b>Pricol Asia Pte Ltd</b>.<br/> <b>Pricol Electronics Private Limited</b> was established as an <span class='neutral'>auto component manufacturer</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728487262000,
            "Source": "corporate_action"
        }
    ]
}