{
    "Symbol": "PRIMO",
    "ISIN": "INE607A01022",
    "News": [
        {
            "Title": "Primo Chemicals Board Meet Set for Feb 12, 2026",
            "Summary": "Primo Chemicals Limited has scheduled its board meeting for February 12, 2026, to approve Q3 FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770029993427,
            "Source": "co_actions_results"
        },
        {
            "Title": "Primo Chemicals invests ₹21 cr in 50 MW solar plant",
            "Summary": "Primo Chemicals Limited board approves 26% equity investment in SPV for 50 MW solar power plant under captive mode, expected to save ₹24 crores annually upon commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1768565416737,
            "Source": "co_actions_results"
        },
        {
            "Title": "Primo Chemicals seeks shareholder approval for new director",
            "Summary": "Primo Chemicals Limited announces postal ballot for appointment of Ms. Dipti Jain as Woman Director (Non-Executive Independent) through remote e-voting from January 14 to February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768299317842,
            "Source": "stocks"
        },
        {
            "Title": "Naveen Chopra Sells 25 Lakh Shares in Primo Chemicals Limited",
            "Summary": "Naveen Chopra sold 25,00,000 equity shares of Primo Chemicals Limited through open market transactions, reducing his shareholding from 17.54% to 16.51%. The transaction involved shares worth Rs. 2 each and was disclosed under SEBI takeover regulations to BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1764579428236,
            "Source": "corporate_action"
        },
        {
            "Title": "Flowtech Industrial Projects Increases Stake in Primo Chemicals to 5.01%",
            "Summary": "Flowtech Industrial Projects Private Limited acquired 25,25,000 shares of Primo Chemicals Limited through open market purchases, increasing its shareholding from 3.97% to 5.01%. The acquisition represents 1.04% of Primo Chemicals' total share capital and triggers disclosure requirements under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764574475520,
            "Source": "corporate_action"
        },
        {
            "Title": "Primo Chemicals Appoints New Woman Director and Changes Internal Auditor",
            "Summary": "Primo Chemicals Limited appointed Ms. Dipti Jain as Additional Woman Director (Non-Executive Independent) for a three-year term effective November 14, 2025, subject to shareholder approval. The company also replaced its internal auditor, with M/s H.N. Pradhan Co. resigning due to professional commitments and M/s S.K. Patodia Associates taking over from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763148138211,
            "Source": "corporate_governance"
        },
        {
            "Title": "Primo Chemicals Reports Mixed Performance with Revenue Decline in Q2 FY2025",
            "Summary": "Primo Chemicals Limited posted quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs 8,790.26 lakhs compared to Rs 8,527.29 lakhs in the previous quarter, while reporting a profit after tax of Rs 580.88 lakhs for the half-year period. The company operates in the chemicals segment and owns 49% equity in FlowTech Chemicals (P) Limited, which is treated as an associate concern in their consolidated financial statements.",
            "Sentiment": "negative",
            "PublishDate": 1763134638732,
            "Source": "earnings"
        },
        {
            "Title": "Flowtech Industrial Projects Acquires Additional Stake in Primo Chemicals",
            "Summary": "Flowtech Industrial Projects Private Limited acquired 7,66,550 equity shares of Primo Chemicals Limited through an off-market inter-se transfer from M/s Advance Chemicals on January 23, 2024. The acquisition represents 0.32% of the total share capital. Following this transaction, Flowtech's total holding in Primo Chemicals increased to 96,26,710 shares, representing 3.98% of the company's equity. The acquired shares will rank pari-passu with existing equity shares. Primo Chemicals was formerly known as Punjab Alkalies & Chemicals Limited and is listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761795390060,
            "Source": "corporate_action"
        },
        {
            "Title": "Primo Chemicals Independent Director Teesta Sandhu Resigns Due to Personal Commitments",
            "Summary": "Ms. Teesta Sandhu, Independent Director of Primo Chemicals Limited, resigned from the Board of Directors effective October 23, 2025, citing personal and professional commitments. She will also cease to be a member of the company's Risk Management Committee. Sandhu confirmed there are no other material reasons for her resignation beyond those stated in her resignation letter. She does not hold directorship positions in any other listed entities.",
            "Sentiment": "neutral",
            "PublishDate": 1761308856152,
            "Source": "corporate_governance"
        },
        {
            "Title": "Primo Chemicals Board Approves Secretarial Auditor Appointment, Director Re-appointments, and 51% Stake Acquisition",
            "Summary": "Primo Chemicals Limited's Board approved the appointment of M/s. A. Arora & Co. as Secretarial Auditor for five years (2025-26 to 2029-30), subject to shareholder approval. The board also approved re-appointment of three Independent Directors - Shri Tilak Raj Bajalia, Shri Ashok Goyal, and Shri Kuldip Singh Suhag - for a second five-year term from December 1, 2025 to November 30, 2030. Additionally, the board approved acquisition of the remaining 51% stake in Flow Tech Chemicals Private Limited, a promoter group company. Primo already holds 49% stake in Flow Tech, which manufactures chlorinated paraffin and hydrochloric acid with turnover of Rs. 275.01 crores in 2024-25. The acquisition is expected to be completed by December 31, 2025, with pricing based on fresh valuation. The company's 50th Annual General Meeting is scheduled for September 30, 2025 via video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1755186813645,
            "Source": "corporate_action"
        },
        {
            "Title": "Primo Chemicals Reports Strong Q1 Turnaround with 31M Rupees Net Profit",
            "Summary": "Primo Chemicals delivered strong quarterly results with EBITDA rising to 204 million rupees from 151 million rupees year-over-year, while EBITDA margin improved to 14.37% from 12.39%. The company achieved a consolidated net profit of 31 million rupees, marking a significant turnaround from a loss of 117 million rupees in the same period last year. Revenue grew to 1.4 billion rupees compared to 1.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755181642008,
            "Source": "earnings"
        },
        {
            "Title": "CARE Ratings Reaffirms Primo Chemicals' Credit Ratings, Revises Outlook to Stable",
            "Summary": "CARE Ratings Limited has reviewed and reaffirmed Primo Chemicals Limited's credit ratings for its bank facilities while revising the outlook from negative to stable. The company's long-term bank facilities of Rs. 102.71 crore received a CARE BBB- rating with stable outlook, reduced from the previous amount of Rs. 133.27 crore. Additionally, long-term/short-term bank facilities of Rs. 75 crore were rated CARE BBB-/CARE A3 with stable outlook. All ratings were reaffirmed with the key change being the outlook revision from negative to stable across all facilities.",
            "Sentiment": "positive",
            "PublishDate": 1753282258649,
            "Source": "stock"
        },
        {
            "Title": "Primo Chemicals Reports Q4 Financial Results",
            "Summary": "Primo Chemicals has released its Q4 financial results. The company's revenue increased to 1.56 billion rupees, up from 1.03 billion rupees in the same quarter of the previous year. However, the company reported a net loss of 11.2 million rupees for Q4, compared to a profit of 68 million rupees in the same quarter last year. Sequentially, the company's profit decreased from 19.2 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748621787000,
            "Source": "result"
        },
        {
            "Title": "Primo Chemicals Reports Significant Q3 EBITDA Growth",
            "Summary": "Primo Chemicals has announced its Q3 financial results, showing a substantial increase in EBITDA. The company's EBITDA rose to 187 million rupees, compared to 28 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved significantly, reaching 12.96% versus 3.05% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739523027000,
            "Source": "earnings"
        },
        {
            "Title": "Primo Chemicals Reports Profit in Q3, Revenue Increases",
            "Summary": "Primo Chemicals has reported a significant turnaround in its financial performance for the third quarter. The company posted a net profit of 19 million rupees, compared to a loss of 153 million rupees in the same period last year. Revenue also saw substantial growth, reaching 1.4 billion rupees, up from 914 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739522977000,
            "Source": "earnings"
        },
        {
            "Title": "Primo Chemicals Reports Significant Q2 EBITDA Improvement",
            "Summary": "Primo Chemicals has reported a substantial turnaround in its Q2 EBITDA, moving from a loss of 43.5 million rupees in the previous year to a gain of 106 million rupees. The company's Q2 EBITDA margin stands at 7.89%.",
            "Sentiment": "positive",
            "PublishDate": 1731404236000,
            "Source": "result"
        }
    ]
}