{
    "Symbol": "PRIMESECU",
    "ISIN": "INE032B01021",
    "News": [
        {
            "Title": "Prime Securities Q3FY26 Results Show Mixed Performance",
            "Summary": "Prime Securities reports consolidated revenue of ₹2,938 lakhs for Q3FY26, with profit after tax declining to ₹210 lakhs from ₹820 lakhs in Q3FY25, amid significant business expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1768919585439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prime Securities Board Meet Set for Jan 20, 2026",
            "Summary": "Prime Securities Limited has scheduled a board meeting on January 20, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768228324566,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prime Securities Board Meet on Jan 20 for Q3FY26 Results",
            "Summary": "Prime Securities Limited has scheduled a board meeting on January 20, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768227425212,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prime Securities Allots 2.55 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Prime Securities Limited's Nomination Remuneration Committee approved the allotment of 2,55,000 equity shares of face value INR 5 each to eligible employees under the Employee Stock Option Scheme 2018. The allotment increased the company's paid-up share capital to INR 16,95,01,625, comprising 3,39,00,325 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1763061586735,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities Reports 39% Growth in Fee Income for H1 FY26, Expands Team to 120 Employees",
            "Summary": "Prime Securities Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. Fee and commission income increased to INR 6,896 lakhs in H1 FY26 compared to INR 4,946 lakhs in the same period last year. Total income rose to INR 7,814 lakhs versus INR 5,897 lakhs in the previous year. However, profit after tax declined to INR 2,425 lakhs from INR 2,930 lakhs in H1 FY25. The company significantly expanded its workforce from 35 employees in September 2024 to 120 employees by September 2025, leading to higher employee expenses of INR 2,678 lakhs compared to INR 1,674 lakhs last year. Prime Trigen Wealth, the company's wealth management arm, onboarded over 400 clients and 300 families in its first six months, operating from 8 locations with over 80 employees. The company continues building annuity income flows alongside transactional revenue streams in its investment banking and wealth management verticals.",
            "Sentiment": "neutral",
            "PublishDate": 1760621749450,
            "Source": "earnings"
        },
        {
            "Title": "Fraudsters Impersonate Prime Securities Unit to Scam Over 200 Investors of Rs 40+ Lakh",
            "Summary": "Scammers impersonated TriGen Wealth, a subsidiary of Prime Securities Ltd, to defraud over 200 investors in Maharashtra. A Thane businessman lost over Rs 40 lakh after responding to Facebook ads promoting stock market investments. The fraudsters directed victims to a WhatsApp group called VIP3 TriGen-Fortune Code and asked them to download a fake TriGen-App. The app showed fabricated profits but prevented withdrawals, pressuring users to invest more money. The businessman made multiple transfers between May 26-30, ranging from Rs 10,000 to Rs 15,000 each time. When he attempted to withdraw funds, the app and group administrators disappeared. Prime Securities confirmed no connection to the fraudulent activities and filed complaints with Colaba Police Station and the National Cybercrime Reporting Portal. The company engaged cybersecurity firm CYBLE Inc. and successfully had the fake app removed from Google Play Store. Prime Securities advised investors to verify apps through official company websites only.",
            "Sentiment": "negative",
            "PublishDate": 1755943364871,
            "Source": "stock"
        },
        {
            "Title": "Prime Securities Limited Reports Q1 FY26 Results with Consolidated Net Profit of Rs. 1,210 Lakhs",
            "Summary": "Prime Securities Limited announced unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported total income from operations of Rs. 4,691 lakhs and net profit after tax of Rs. 1,210 lakhs. Basic earnings per share stood at Rs. 3.23 for the quarter. On a standalone basis, total income was Rs. 1,602 lakhs with net profit after tax of Rs. 112 lakhs. The company's equity share capital remained at Rs. 1,681 lakhs. The results were signed by Managing Director & Group CEO N. Jayakumar from Lisbon, Portugal on July 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753350758117,
            "Source": "earnings"
        },
        {
            "Title": "Prime Securities Reports 61% Revenue Growth in Q1 FY26, Launches Wealth Management Business",
            "Summary": "Prime Securities Limited reported consolidated revenue of ₹46.91 crores for the quarter ended June 30, 2025, representing a 61% increase from ₹29.14 crores in the same quarter last year. Profit before tax grew 34% to ₹16.46 crores, while profit after tax increased 25% to ₹10.48 crores. Diluted earnings per share rose 29% to ₹3.15. The company launched a new wealth management vertical through wholly-owned subsidiary Prime Trigen Wealth Limited, which has onboarded over 125 HNI and UHNI families within its first 100 days and expanded to seven locations with a 65-member team. Cash and investments reached an all-time high of ₹247.66 crores. The results include revenue recognition of ₹27.95 crores by subsidiary Prime Research and Advisory Limited under a non-circumvention clause, though client response to formal demand notice remains pending.",
            "Sentiment": "positive",
            "PublishDate": 1753183020885,
            "Source": "earnings"
        },
        {
            "Title": "Prime Securities Reports Q4 Results and Dividend Recommendation",
            "Summary": "Prime Securities has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue was 127.1 million rupees, slightly down from 128.2 million rupees year-over-year. Q4 consolidated net profit decreased to 9.6 million rupees from 16.5 million rupees year-over-year, but increased from 82 million rupees quarter-over-quarter. The company has recommended a dividend of 1.50 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1745512590000,
            "Source": "result"
        },
        {
            "Title": "Prime Securities' Subsidiary Approves Setting Up Alternate Investment Fund",
            "Summary": "Prime Securities' subsidiary, Prime Research And Advisory Ltd (PRAL), has approved the establishment of an Alternate Investment Fund. PRAL plans to invest up to 15 million rupees in Prime Litmus Investment Management (PLIM) and 50 million rupees in Prime Litmus Investment (PLI). PRAL will subscribe to 75% of PLIM and 100% of PLI.",
            "Sentiment": "positive",
            "PublishDate": 1741739449000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities' Subsidiary Approves Setting Up Alternate Investment Fund",
            "Summary": "Prime Securities' subsidiary, Prime Research and Advisory Ltd (PRAL), has approved the establishment of an Alternate Investment Fund. PRAL plans to invest up to 15 million rupees in Prime Litmus Investment Management (PLIM) and 50 million rupees in Prime Litmus Investment (PLI). PRAL will subscribe to 75% of PLIM and 100% of PLI.",
            "Sentiment": "positive",
            "PublishDate": 1741694783000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities Approves Share Buyback at Rs 305 Per Share",
            "Summary": "Prime Securities has approved a share buyback program through a tender offer mechanism. The company will repurchase its own shares at a price of Rs 305 per share. This corporate action aims to return value to shareholders and potentially improve the company's stock performance.",
            "Sentiment": "positive",
            "PublishDate": 1737956073000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities: Q3 Profit Up 3.4% YoY, Revenue Rises 18%",
            "Summary": "Prime Securities reported Q3 FY25 results with profit at ₹8.2 crore, up 3.4% YoY, and revenue at ₹21.14 crore, an 18.03% YoY increase. However, compared to Q2, revenue declined 29.13% and profit fell 52.33%. EPS for Q3 stood at ₹2.75, up 11.79% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1737609393000,
            "Source": "earnings"
        },
        {
            "Title": "Prime Securities Announces Board Meeting to Consider Share Buyback",
            "Summary": "Prime Securities has scheduled a board meeting on January 27 to consider a proposal for buying back fully paid-up equity shares of the company with a face value of Rs. 5 each. This potential share buyback, if approved, would be a significant corporate action that could impact the company's stock and shareholder value.",
            "Sentiment": "neutral",
            "PublishDate": 1737591067000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities Announces Board Meeting to Consider Share Buyback",
            "Summary": "Prime Securities has scheduled a board meeting on January 27 to consider a proposal for buying back fully paid-up equity shares of the company. The shares under consideration have a face value of Rs. 5 each.",
            "Sentiment": "positive",
            "PublishDate": 1737551230000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities Reports Q3 Revenue Increase",
            "Summary": "Prime Securities has announced its third quarter revenue, which stands at 196 million rupees. This represents an increase from the previous year's figure of 163 million rupees for the same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737444629000,
            "Source": "earnings"
        },
        {
            "Title": "Prime Securities Reports Increase in Q3 Consolidated Net Profit",
            "Summary": "Prime Securities has reported a consolidated net profit of 82 million rupees for the third quarter, showing a slight increase from 79 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737444569000,
            "Source": "earnings"
        },
        {
            "Title": "Prime Securities: Acquires Majority Stake in Fintech Platform DhanLAP",
            "Summary": "Prime Securities Limited has acquired a 41.68% strategic stake in Ark Neo Financial Services, the company behind DhanLAP, for ₹70 million. The stake will increase to over 50% through convertible debentures. DhanLAP is a loan-against-securities platform launched in October 2021.",
            "Sentiment": "positive",
            "PublishDate": 1734336761000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities: Acquiring Majority Stake in DhanLAP Operator Ark Neo",
            "Summary": "Prime Securities to acquire 41.68% stake in Ark Neo Financial Services for Rs 2 crore, with plans to invest additional Rs 5 crore via convertible debentures, increasing total stake to over 50%. Total investment of Rs 7 crore aligns with Prime Securities' strategy to expand into technology-driven financial services.",
            "Sentiment": "positive",
            "PublishDate": 1734008336000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities to Acquire Majority Stake in ARK NEO Financial Services",
            "Summary": "Prime Securities has announced plans to acquire up to 51% stake in ARK NEO Financial Services. The total investment for this acquisition is expected to be up to 70 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729611182000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prime Securities Reports Significant Revenue Growth in Q2",
            "Summary": "Prime Securities has announced its financial results for the second quarter, reporting a total income of 298.3 million rupees. This represents a substantial increase from the 154 million rupees reported in the same quarter of the previous year, indicating strong year-over-year growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1729611173000,
            "Source": "result"
        },
        {
            "Title": "Prime Securities Reports Significant Profit Growth in Q2",
            "Summary": "Prime Securities has announced its Q2 consolidated net profit of 172 million rupees, showing a substantial increase from 39.5 million rupees year-over-year and 121 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729611157000,
            "Source": "result"
        },
        {
            "Title": "Prime Securities Approves Overseas Expansion",
            "Summary": "<p><span class=\"positive\">Prime Securities</span> has <span class=\"positive\">approved plans</span> to <span class=\"positive\">establish</span> independent business units in the <b>United Kingdom</b> and the <b>United Arab Emirates</b>. This move is aimed at <span class=\"positive\">expanding</span> the company's <span class=\"positive\">operational footprint</span> in these <span class=\"neutral\">overseas markets</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728399847000,
            "Source": "corporate_action"
        }
    ]
}