{
    "Symbol": "PRINCEPIPE",
    "ISIN": "INE689W01016",
    "News": [
        {
            "Title": "Prince Pipes Q3 FY26: Volume up 3% YoY, revenue ₹573 Cr",
            "Summary": "Prince Pipes reports 3% volume growth in Q3 FY26 with revenue of ₹573 crores. EBITDA improved to ₹28 crores from ₹5 crores YoY. Company launched new CPVC and water tank variants.",
            "Sentiment": "positive",
            "PublishDate": 1770727170250,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prince Pipes Board Meet Set for Feb 10 Q3FY26 Results",
            "Summary": "Prince Pipes and Fittings Limited has scheduled a board meeting on February 10, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769593754511,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prince Pipes Credit Ratings Reaffirmed at CRISIL A+/Negative and A1+ for Rs 768 Crore Bank Facilities",
            "Summary": "CRISIL reaffirmed Prince Pipes and Fittings Limited's credit ratings at A+/Negative for long-term and A1+ for short-term on bank facilities worth Rs 768 crore. The ratings reflect strong market position in domestic plastic pipe industry but remain under pressure due to subdued operating performance with reducing margins from 11.97% to 6.5%.",
            "Sentiment": "negative",
            "PublishDate": 1765273174005,
            "Source": "stock"
        },
        {
            "Title": "Prince Pipes Receives ₹23.85 Lakh GST Demand Order for FY2021-22",
            "Summary": "Prince Pipes and Fittings Limited received a GST demand order of ₹23,85,356 from Central Tax authorities for FY2021-22, related to disallowed GST credits due to differences between GSTR-1 declarations and E-way bills issued during FY2020-21. The company considers the demand not maintainable and is evaluating options including filing an appeal, expecting no significant impact on its financial operations.",
            "Sentiment": "negative",
            "PublishDate": 1764323174684,
            "Source": "stock"
        },
        {
            "Title": "Prince Pipes Reports Muted Volume Growth Amid Industry Challenges in Q2 FY26",
            "Summary": "Prince Pipes and Fittings Limited reported revenue of INR 595 crores with 42,761 metric tonnes volume and 9% EBITDA margin for Q2 FY26, while facing industry-wide PVC demand decline of 9% due to volatile resin prices and weak construction activity. The company successfully commissioned Phase 2 operations at its Bihar manufacturing unit and expects gradual demand recovery in H2 FY26 with anticipated antidumping duty implementation to improve market sentiment.",
            "Sentiment": "neutral",
            "PublishDate": 1763112139364,
            "Source": "earnings"
        },
        {
            "Title": "Prince Pipes Plans Aggressive Expansion with Bihar Plant Phase 2 and New Display Centers",
            "Summary": "Prince Pipes has made its Bihar plant's Phase 2 operational and is establishing display centers in Jammu & Kashmir and Uttar Pradesh to strengthen its Eastern India supply chain and product portfolio. The company delivered piping solutions for Navi Mumbai Airport and targets 15% annual volume growth through new CPVC, plumbing, and bathware product lines. The expansion strategy focuses on regional market penetration and margin enhancement.",
            "Sentiment": "positive",
            "PublishDate": 1762528823497,
            "Source": "stock"
        },
        {
            "Title": "Prince Pipes and Fittings Reports Mixed Q2 Results with Revenue Decline but EBITDA Growth",
            "Summary": "Prince Pipes and Fittings reported Q2 net profit of 146 million rupees compared to 147 million rupees in the same period last year. Revenue decreased to 5.95 billion rupees from 6.22 billion rupees year-over-year. However, EBITDA increased to 551 million rupees from 457 million rupees, with EBITDA margin improving to 9.27% from 7.35% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762513494351,
            "Source": "earnings"
        },
        {
            "Title": "Prince Pipes Reports 4% Revenue Decline Despite Volume Growth in Latest Results",
            "Summary": "Prince Pipes and Fittings reported revenue of ₹580 crores, down 4% year-on-year, while volume increased 4% to 43,735 metric tons. The company posted EBITDA of ₹40 crores with a 7% margin and PAT of ₹5 crores. Management cited challenging demand conditions due to inflationary pressures and PVC resin price volatility. The company expects high single-digit to low double-digit volume growth for FY26 and anticipates margin improvement from Q2 onwards. Bihar plant capacity will reach 60,000 tons by September 2025 with expected 60-70% utilization. Capex spending totaled ₹75 crores in Q1 with ₹160-170 crores planned for the remainder of FY26. The bathware segment targets ₹50-60 crores revenue for FY26. CPVC revenue contribution has grown from 15% to over 25% in the past five years. Working capital improved to 93 days from 98 days in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755065902089,
            "Source": "earnings"
        },
        {
            "Title": "Prince Pipes Projects High Single-Digit to Low Double-Digit Volume Growth for FY26",
            "Summary": "Prince Pipes expects volume growth between high single-digit and low double-digit for FY26. The company anticipates sequential margin improvement with Q2 performing better than Q1 and H2 better than H1. Prince Pipes targets EBITDA margins of 12% by Q3/Q4 FY26 and aims for bathware revenue of Rs. 50-60 crores in FY26. The company foresees breakeven in 4-6 quarters. For the Bihar plant, the volume target is 20-25K tonnes in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754623547096,
            "Source": "stock"
        },
        {
            "Title": "Prince Pipes Outlines Multi-Pronged Growth Strategy to Tap ₹80,000 Crore Domestic Piping Market",
            "Summary": "Prince Pipes has announced a comprehensive growth strategy targeting the ₹80,000 crore domestic piping market. The company's expansion plans include scaling up its Bihar plant operations, developing premium bathware products, launching advanced plumbing initiatives, forming global technology partnerships, and strengthening nationwide distribution networks.",
            "Sentiment": "positive",
            "PublishDate": 1754486662254,
            "Source": "stock"
        },
        {
            "Title": "Prince Pipes and Fittings Approves Quarterly Results and Sets AGM Date for September 11, 2025",
            "Summary": "Prince Pipes and Fittings Limited's Board of Directors approved the unaudited standalone financial results for the quarter ended June 30, 2025. The company scheduled its 38th Annual General Meeting for September 11, 2025, to be conducted through video conferencing. The Register of Members and Share Transfer Books will remain closed from September 5-11, 2025. The record date for final dividend payment for FY 2024-2025 has been set as September 4, 2025. The company appointed M/s. Sanjay Dholakia & Associates as scrutinizer for the e-voting process at the upcoming AGM. The board meeting was held on August 6, 2025, lasting from 12:40 p.m. to 3:45 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1754478653020,
            "Source": "earnings"
        },
        {
            "Title": "Prince Pipes Reports 80% Drop in Quarterly Profit to ₹48.21 Million",
            "Summary": "Prince Pipes and Fittings Limited reported a net profit of ₹48.21 million for the quarter ended June 30, 2025, compared to ₹246.75 million in the same quarter last year, representing an 80% decline. Revenue from operations decreased to ₹5,804.16 million from ₹6,044.72 million year-over-year. The company's earnings per share fell to ₹0.44 from ₹2.23 in the previous year quarter. Employee costs for the quarter were reduced by ₹44.60 million due to a writeback of excess staff incentive provision from an earlier period. The board meeting to approve these results was held on August 6, 2025, with the results being reviewed by statutory auditors.",
            "Sentiment": "negative",
            "PublishDate": 1754478001617,
            "Source": "earnings"
        },
        {
            "Title": "Prince Pipes Expands Capacity with New Bihar Plant",
            "Summary": "Prince Pipes has commissioned Phase 1 of its new plant in Bihar, adding 24,000 metric tons to its production capacity. This brings the company's total capacity to 397,500 metric tons. The company expects double-digit volume growth in the current financial year. Prince Pipes' CPVC product range has received GreenPro certification. The company aims to maintain a 12% EBITDA margin in the long term.",
            "Sentiment": "positive",
            "PublishDate": 1748412182000,
            "Source": "default"
        },
        {
            "Title": "Prince Pipes and Fittings Reports Q4 Financial Results",
            "Summary": "Prince Pipes and Fittings has released its Q4 financial results. The company's EBITDA decreased to 548.4 million rupees from 923 million rupees year-over-year. The EBITDA margin fell to 7.62% from 12.47% in the same period last year. Revenue slightly decreased to 7.2 billion rupees from 7.4 billion rupees year-over-year. Net profit declined to 241.8 million rupees from 547 million rupees in the previous year's Q4. Sequentially, the company reported a loss of 204.2 million rupees compared to the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747827468000,
            "Source": "result"
        },
        {
            "Title": "Prince Pipes and Fittings Launches New Production Facility in Bihar",
            "Summary": "Prince Pipes and Fittings has commenced commercial production at a new facility in Begusarai, Bihar. The unit is expected to have an annual production capacity of 60,000 metric tons. This new facility is strategically positioned to cater to the eastern markets of India.",
            "Sentiment": "positive",
            "PublishDate": 1742381644000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prince Pipes & Fittings: Q3 FY25 Reports Loss of ₹20.42 Crore, Revenue Down 6.61%",
            "Summary": "Prince Pipes & Fittings announced Q3 FY25 results with a loss of ₹20.42 crore, compared to a profit of ₹37.63 crore in Q3 FY24. Revenue decreased by 6.61% YoY to ₹577.72 crore. Operating income fell by 144.47% YoY. EPS declined to ₹-1.85. Selling, general & administrative expenses increased by 20.85% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739345756000,
            "Source": "earnings"
        },
        {
            "Title": "Prince Pipes and Fittings Reports Q3 Revenue Decline",
            "Summary": "Prince Pipes and Fittings, a major player in the piping industry, has reported its third-quarter revenue. The company's revenue for Q3 stood at 6 billion rupees, showing a decrease from 6.2 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739265607000,
            "Source": "earnings"
        },
        {
            "Title": "Prince Pipes and Fittings Reports Significant Drop in Q3 EBITDA",
            "Summary": "Prince Pipes and Fittings experienced a substantial decline in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 29 million rupees from 756 million rupees in the same quarter of the previous year. The EBITDA margin also decreased significantly, dropping to 0.50% from 12.22% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739265465000,
            "Source": "earnings"
        },
        {
            "Title": "Prince Pipes and Fittings Reports Q3 Net Loss",
            "Summary": "Prince Pipes and Fittings has reported a net loss of 204 million rupees for the third quarter, compared to a profit of 376 million rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1739265414000,
            "Source": "earnings"
        },
        {
            "Title": "Prince Pipes and Fittings Reports Significant Drop in Q2 EBITDA",
            "Summary": "Prince Pipes and Fittings experienced a substantial decline in its Q2 EBITDA, which fell to 456 million rupees from 942 million rupees year-over-year. The company's EBITDA margin also decreased significantly, dropping to 7.33% from 14.35% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730967693000,
            "Source": "result"
        },
        {
            "Title": "Prince Pipes and Fittings Reports Q2 Revenue Decline",
            "Summary": "Prince Pipes and Fittings announced its second quarter revenue for the current fiscal year. The company reported revenue of 6.2 billion rupees, which represents a decrease from the 6.56 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1730967616000,
            "Source": "result"
        },
        {
            "Title": "Prince Pipes and Fittings Reports Significant Drop in Q2 Net Profit",
            "Summary": "Prince Pipes and Fittings, an Indian piping systems manufacturer, has reported a substantial decrease in its second-quarter net profit. The company's net profit for Q2 stood at 147 million rupees, down from 706 million rupees in the same period last year, marking a significant year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1730967587000,
            "Source": "result"
        }
    ]
}