{
    "Symbol": "PRITIKAUTO",
    "ISIN": "INE583R01029",
    "News": [
        {
            "Title": "Pritika Auto Q3FY26 Revenue Rises 37% to ₹11,037 Lakhs",
            "Summary": "Pritika Auto Industries reported Q3FY26 revenue of ₹11,037.51 lakhs, up 37% YoY. Net profit reached ₹405.06 lakhs vs ₹299.44 lakhs in Q3FY25. Board approved ₹34.50 crore corporate guarantee.",
            "Sentiment": "positive",
            "PublishDate": 1770456205028,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pritika Auto Promoter Acquires 1 Lakh Shares",
            "Summary": "Pritika Industries Limited, promoter of Pritika Auto Industries, purchased 1,00,000 equity shares from open market, increasing holding to 2,35,00,238 shares (14.11% stake).",
            "Sentiment": "positive",
            "PublishDate": 1766577010480,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pritika Auto Industries Reports Strong Q2FY26 Performance with 35.8% Revenue Growth",
            "Summary": "Pritika Auto Industries Limited achieved consolidated revenue of ₹116.45 crore in Q2FY26, marking 35.8% year-on-year growth, while EBITDA increased 23.9% to ₹18.61 crore. The company targets 15-20% revenue growth for FY26, supported by robust demand from existing clients and strategic expansion into Railways and Defence sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763192331853,
            "Source": "earnings"
        },
        {
            "Title": "Pritika Auto Industries Reports Mixed Performance in Q2 FY2026 Results",
            "Summary": "Pritika Auto Industries Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 1,156.37 lakhs for the quarter, with a net loss of Rs 588.98 lakhs before exceptional items. For the half-year period, revenue stood at Rs 2,547.89 lakhs with a net loss of Rs 130.73 lakhs before exceptional items. On a consolidated basis, quarterly revenue was Rs 1,644.53 lakhs with profit before tax of Rs 862.24 lakhs, while half-year consolidated revenue reached Rs 3,127.72 lakhs with profit before tax of Rs 1,606.61 lakhs. The company operates in automotive component manufacturing and has subsidiaries including Pritika Engineering Components Limited and Meeta Castings Limited. The Board of Directors approved these unaudited financial results in their meeting held on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762850957798,
            "Source": "earnings"
        },
        {
            "Title": "Pritika Auto Industries Appoints Bishwanath Choudhary as Independent Director for Five-Year Term",
            "Summary": "Pritika Auto Industries Limited appointed Mr. Bishwanath Choudhary as an Independent Director for a five-year term, effective from June 24, 2025. The appointment was approved by shareholders at the company's 45th Annual General Meeting held on September 20, 2025. Mr. Choudhary, aged around 70 years, is a Fellow member of the Institute of Company Secretaries of India and Institute of Cost Accountants of India, and holds an MBA. He has 47 years of experience in Finance and Corporate matters in Steel and Infrastructure Industry and works as a Freelance Consultant. He is registered as an Insolvency Professional and Valuer with the Insolvency & Bankruptcy Board of India. The appointee is not related to any director or key managerial personnel of the company and is not debarred from holding office of Independent Director by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1758544642681,
            "Source": "corporate_governance"
        },
        {
            "Title": "Pritika Auto Industries Amends Memorandum of Association and Reappoints Director at 45th AGM",
            "Summary": "Pritika Auto Industries Limited made significant amendments to its Memorandum of Association at its 45th Annual General Meeting held on September 20, 2025. The changes included complete deletion of existing clauses III(C) 42 to III(C) 65 from the Object Clause, replacement of the Liability Clause to limit member liability to unpaid amounts on shares held, and alteration of the Capital Clause to set share capital at Rs. 40 crores divided into 20 crore equity shares of Rs. 2 each. Additionally, the company reappointed Mr. Narinder Kumar Tyagi as director, who was retiring by rotation. Mr. Tyagi, aged 61, is a Chartered Accountant with 34 years of experience and serves as the company's CFO. He is not related to any other director or key management personnel of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758544238013,
            "Source": "corporate_action"
        },
        {
            "Title": "Pritika Auto Industries Reports 36% Jump in Q1 FY26 Profit, Production Volumes Rise 20%",
            "Summary": "Pritika Auto Industries Limited, a leading tractor components manufacturer, reported strong Q1 FY26 results with profit after tax increasing 36.26% to Rs. 6.09 crore compared to Rs. 4.47 crore in Q1 FY25. Production volumes grew 19.87% to 12,386 tons from 10,333 tons year-on-year. Net revenue jumped 29.06% to Rs. 114.61 crore driven by higher volumes and improved realization per ton. EBITDA rose 20.93% to Rs. 17.44 crore, though EBITDA margin declined 102 basis points to 15.22%. Basic EPS stood at Rs. 0.26. Chairman & Managing Director Harpreet Singh Nibber highlighted the strong start to FY26 with recovering demand momentum. The company is targeting 15-20% revenue growth for FY26, supported by expansion into Railways and Defence sectors alongside existing tractor and commercial vehicle clients. Pritika operates manufacturing facilities in Punjab and Himachal Pradesh with total capacity exceeding 72,000 metric tons per annum, supplying to major OEMs including M&M Swaraj, TAFE, Escorts, and Ashok Leyland.",
            "Sentiment": "positive",
            "PublishDate": 1756098207635,
            "Source": "earnings"
        },
        {
            "Title": "Pritika Auto Industries Reports Strong Q1 FY2026 Results, Approves Key Auditor Appointments and Corporate Changes",
            "Summary": "Pritika Auto Industries Ltd approved unaudited financial results for Q1 FY2026 ending June 30, 2025, showing revenue from operations of Rs. 11,371.84 lakhs compared to Rs. 8,789.22 lakhs in the same quarter last year. The company reported profit of Rs. 406.75 lakhs for the quarter. The Board reappointed M/s. A.K. Sood & Associates as Internal Auditor for FY 2025-26, appointed M/s Verma Khushwinder & Co. as Cost Auditor, and proposed M/s S.K. Sikka & Associates as Secretarial Auditor for five years subject to shareholder approval. The company also approved increasing authorized share capital from Rs. 36.50 crores to Rs. 40 crores, amendments to the Memorandum of Association, and scheduled the 45th Annual General Meeting for September 20, 2025 via video conferencing. The consolidated results showed revenue of Rs. 11,461.00 lakhs with profit of Rs. 609.47 lakhs for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755074591840,
            "Source": "earnings"
        },
        {
            "Title": "Pritika Auto Industries Announces Voluntary Delisting from Calcutta Stock Exchange",
            "Summary": "Pritika Auto Industries Limited has announced its voluntary delisting of shares from The Calcutta Stock Exchange Limited. The company published a notice in Hindi newspaper 'Dainik Savera Times' on July 29, 2025, regarding the delisting. The company informed the National Stock Exchange of India Limited and BSE Limited about the newspaper publication. Pritika Auto Industries trades under the symbol PRITIKAUTO on NSE and scrip code 539359 on BSE, while its CSE scrip code is 18096.",
            "Sentiment": "neutral",
            "PublishDate": 1753767951406,
            "Source": "corporate_action"
        },
        {
            "Title": "Pritika Auto Industries Ltd: Q3 Revenue Up 14%, Announces Rights Issue",
            "Summary": "Pritika Auto Industries reported a 13.86% YoY increase in Q3 FY25 revenue to ₹80.65 crore, with PAT up 11.03% to ₹4.42 crore. The company approved a rights issue to raise up to ₹49.90 crore and started production for a major tractor manufacturer, expecting ₹51.50 crore annual business. EBITDA grew 15.19% YoY with improved margins.",
            "Sentiment": "positive",
            "PublishDate": 1739865759000,
            "Source": "result"
        },
        {
            "Title": "Pritika Auto Industries Begins Commercial Production of New Components",
            "Summary": "Pritika Auto Industries has announced the commencement of commercial production for new components. This development marks a significant step in the company's expansion of its product line and manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1736134701000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pritika Auto Industries Limited: Secures ₹11 Crore Annual Order for Tractor Components",
            "Summary": "Pritika Auto Industries Limited has begun commercial production of new tractor components for a major multinational manufacturer. The order, valued at approximately ₹11 crores annually, includes Intermediate Housing and Axle Housing components with a long-term visibility of 4-5 years.",
            "Sentiment": "positive",
            "PublishDate": 1733295267000,
            "Source": "order&deals"
        },
        {
            "Title": "Pritika Auto Begins Commercial Production of Tractor Components",
            "Summary": "Pritika Auto has announced the commencement of commercial production for tractor components. The company expects these components to generate an annual revenue of 11 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733284089000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pritika Auto Industries Ltd: Commences Production of Critical Tractor Components for Global Manufacturer",
            "Summary": "Pritika Auto Industries Ltd has started commercial production of Hydraulic Lift Housing and Axle Housing for a leading multinational tractor manufacturer. The new order is valued at approximately ₹18 crore annually with a long-term contract of 4-5 years. The company recently raised capital through preferential and rights issues for expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1732691403000,
            "Source": "order&deals"
        },
        {
            "Title": "Pritika Auto Industries Aims to Expand in HCV Segment",
            "Summary": "<p><span class='neutral'>Pritika Auto Industries</span> has announced plans to <span class='positive'>increase</span> its presence in the <b>Heavy Commercial Vehicle (HCV)</b> segment. Currently, this segment contributes about <span class='neutral'>7%</span> to the company's overall production volumes. The company sees <span class='positive'>potential for growth</span> in this area and is <span class='positive'>strategically focusing</span> on <span class='positive'>expanding</span> its market share in the HCV sector.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728276582000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pritika Auto Industries Plans Global Expansion",
            "Summary": "<p><span class='positive'>Pritika Auto Industries</span> has announced plans to establish <span class='positive'>manufacturing facilities</span> that meet <span class='positive'>global standards</span>. This <b>strategic move</b> aims to create opportunities for <span class='positive'>partnerships</span> with <span class='positive'>international Original Equipment Manufacturers (OEMs)</span>. The company also intends to allocate a portion of its <span class='neutral'>capital expenditure (CAPEX)</span> towards developing its <span class='positive'>export market</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728276542000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pritika Auto Targets 100,000 Tons Annual Capacity by FY27",
            "Summary": "<p>Pritika Auto has announced plans for <span class='positive'>capacity expansion</span>, aiming to achieve an <b>installed capacity</b> of <span class='positive'>100,000 tons per annum</span> by the fiscal year 2027.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728276526000,
            "Source": "corporate_action"
        },
        {
            "Title": "Pritika Auto Industries Secures Rs 30 Crore Annual Order from Major Tractor OEM",
            "Summary": "<p><span class='positive'>Pritika Auto Industries</span> has finalized a <span class='positive'>significant order</span> worth <b>Rs 30 crore per annum</b> from a <span class='positive'>leading Original Equipment Manufacturer (OEM)</span> in the <span class='neutral'>tractor industry</span>. The order involves supplying approximately <b>250 tons of components per month</b>, driven by <span class='positive'>strong demand</span> from <span class='neutral'>domestic OEMs</span> in the tractor sector.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727950034000,
            "Source": "corporate_action"
        }
    ]
}