{
    "Symbol": "PRIVISCL",
    "ISIN": "INE959A01019",
    "News": [
        {
            "Title": "Privi Speciality Chemicals Q3FY26 Results",
            "Summary": "Privi Speciality Chemicals reported strong Q3FY26 performance with consolidated revenue of ₹60,464.10 lakhs and net profit of ₹7,485.41 lakhs. Board approved ₹50 crore equity investment in subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1770645991129,
            "Source": "co_actions_results"
        },
        {
            "Title": "Privi Speciality Chemicals Board Meet on Feb 09",
            "Summary": "Privi Speciality Chemicals schedules board meeting on February 09, 2026 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769692475745,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Mutual Fund crosses 5% stake in Privi Specialty",
            "Summary": "SBI Mutual Fund acquired 22.40 lakh shares of Privi Speciality Chemicals on December 31, 2025, increasing its total holding to 9.38% of the company's paid-up share capital through market purchases.",
            "Sentiment": "neutral",
            "PublishDate": 1767351087692,
            "Source": "co_actions_results"
        },
        {
            "Title": "Privi Speciality Shares Fall 13% Post Block Deal",
            "Summary": "Privi Speciality Chemicals shares dropped 13% after ₹1,086 crore block deal involving 38.8 lakh shares at ₹2,799 per share, representing 9.93% equity stake transfer.",
            "Sentiment": "negative",
            "PublishDate": 1767107049181,
            "Source": "co_actions_results"
        },
        {
            "Title": "Privi Speciality Chemicals Withdraws Amalgamation Scheme for Two Subsidiaries",
            "Summary": "Privi Speciality Chemicals' Board approved the withdrawal of the amalgamation scheme involving Privi Fine Sciences Private Limited and Privi Biotechnologies Private Limited based on stock exchange observations. The company plans to refile the application shortly and expects no adverse impact from the withdrawal, with the primary effect being a delay in filings.",
            "Sentiment": "neutral",
            "PublishDate": 1763191217891,
            "Source": "corporate_action"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Record Q2 Performance with 26% Revenue Growth",
            "Summary": "Privi Speciality Chemicals achieved record quarterly results with total income of Rs. 678.82 crores (26% YoY growth) and EBITDA of Rs. 182.14 crores (59% YoY growth) for Q2 FY26. The company maintains its vision of reaching Rs. 5,000 crores revenue and Rs. 1,000 crores EBITDA over the next three to four years, driven by flagship product growth and new product contributions.",
            "Sentiment": "positive",
            "PublishDate": 1763101954100,
            "Source": "earnings"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Strong Q2 Performance with Revenue Growth and Improved Profitability",
            "Summary": "Privi Speciality Chemicals Limited announced its quarterly results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 37,446.75 lakhs for the quarter compared to Rs. 31,648.70 lakhs in the same quarter last year. Net profit increased to Rs. 11,270.70 lakhs from Rs. 4,880.05 lakhs year-over-year. For the half year, standalone revenue reached Rs. 69,047.43 lakhs versus Rs. 64,327.50 lakhs in the previous year, with net profit rising to Rs. 18,943.61 lakhs from Rs. 8,760.84 lakhs. On a consolidated basis, quarterly revenue was Rs. 52,671.85 lakhs compared to Rs. 41,201.09 lakhs last year, with net profit at Rs. 11,640.16 lakhs versus Rs. 4,760.84 lakhs. The company operates in a single segment of Aroma Chemicals and maintains paid-up equity share capital of Rs. 3,906.27 lakhs with face value of Rs. 10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1762334493836,
            "Source": "earnings"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Strong Q1 FY2026 Results with 22% Revenue Growth",
            "Summary": "Privi Speciality Chemicals, a manufacturer of aroma chemicals and specialty chemicals, reported Q1 FY2026 revenue of Rs. 568 crores, marking 22% year-over-year growth. EBITDA increased 45% to Rs. 141 crores with margins expanding to 24.8% from 20.8% in the previous year. Profit after tax nearly doubled to Rs. 61 crores from Rs. 32 crores. Exports contributed approximately 70% of revenues, with the company operating at optimal capacity utilization across all products. The company is pursuing a merger of Privi Fine Sciences and Privi Biotechnologies to simplify structure and unlock synergies. Management maintains 20% annual growth guidance and targets Rs. 5,000 crore revenue and Rs. 1,000 crore EBITDA within 3-5 years, supported by a Rs. 1,100 crore capex plan over the next 2-3 years. The company serves top 15 global customers in the fragrance and flavor industry and expects limited impact from US tariffs as US exports represent only 7% of revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754918310114,
            "Source": "earnings"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Strong Q1 Performance with 29.6% Revenue Growth and Platinum ESG Rating",
            "Summary": "Privi Speciality Chemicals delivered robust quarterly results with standalone revenue growing 29.6% to Rs 566.4 crore and consolidated revenue up 21.7% to Rs 558.8 crore. The company's profitability surged significantly, with standalone PAT jumping 113.3% to Rs 68.7 crore and consolidated PAT rising 97.1% to Rs 61.9 crore. EBITDA margins improved to 25.2% standalone and 24.8% consolidated, while ROCE increased by 500 basis points and ROE by 670 basis points. The company received EcoVadis Platinum rating, placing it among the top 1% of companies globally for ESG performance. Privi announced a proposed amalgamation scheme to merge Privi Fine Sciences Limited and Privi Biotechnology Private Limited with the parent company to unlock synergies and enhance operational efficiency. The company's capacity expansion Phase 1 is partly completed and will start contributing from Q2, with full completion expected in Q4. Management highlighted strong demand across all product categories and the company's focus on sustainability with 70% of raw materials sourced from renewable sources.",
            "Sentiment": "positive",
            "PublishDate": 1754384748147,
            "Source": "earnings"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Strong Q1 Growth with Revenue Up 22% and Net Profit Doubling",
            "Summary": "Privi Speciality Chemicals delivered robust quarterly performance with revenue rising to 5.6 billion rupees from 4.6 billion rupees in the same period last year. The company's consolidated net profit more than doubled to 619 million rupees compared to 314 million rupees previously. EBITDA increased significantly to 1.32 billion rupees from 944 million rupees, while EBITDA margin expanded to 23.63% from 20.34% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754033520506,
            "Source": "earnings"
        },
        {
            "Title": "Privi Speciality Chemicals Schedules Q1 FY26 Earnings Conference Call for August 5, 2025",
            "Summary": "Privi Speciality Chemicals Limited has announced an earnings conference call scheduled for Tuesday, August 5, 2025, at 4:00 PM IST. The call will discuss the company's operational and financial performance for the quarter ended June 30, 2025 (Q1 FY26). Participants can pre-register for the call, with access numbers provided for various countries including India, USA, UK, Singapore, and Hong Kong. The company's management team will participate in the call to discuss results and answer questions. A transcript of the earnings call will be made available on the company's website within five working days after the call concludes.",
            "Sentiment": "neutral",
            "PublishDate": 1753354506729,
            "Source": "earnings"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Improved Q3 EBITDA and Margin",
            "Summary": "Privi Speciality Chemicals has reported a significant increase in its Q3 EBITDA, rising from 900 million rupees to 1.13 billion rupees year-over-year. The company's EBITDA margin also improved, increasing from 22.29% to 22.98% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739353860000,
            "Source": "earnings"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Privi Speciality Chemicals has reported a consolidated net profit of 444 million rupees for the third quarter, compared to 288 million rupees in the same period last year. This represents a significant year-over-year increase in the company's profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739353806000,
            "Source": "earnings"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Strong Q2 Performance",
            "Summary": "Privi Speciality Chemicals has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.10 billion rupees, up from 742 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 20.68% from 16.29% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1729757045000,
            "Source": "result"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Q2 Revenue Growth",
            "Summary": "Privi Speciality Chemicals has announced its Q2 revenue, which stands at 5.3 billion rupees, compared to 4.5 billion rupees in the same quarter last year. This represents a year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1729756986000,
            "Source": "result"
        },
        {
            "Title": "Privi Speciality Chemicals Reports Q2 Profit Increase",
            "Summary": "Privi Speciality Chemicals has announced its Q2 consolidated net profit of 447 million rupees, compared to 305 million rupees in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729756959000,
            "Source": "result"
        },
        {
            "Title": "Privi Speciality Chemicals Receives US Registration for Pharmaceutical Applications",
            "Summary": "<p>Privi Speciality Chemicals has announced that it has received <span class='positive'>registration</span> in the <b>United States</b>, allowing the company to <span class='positive'>expand</span> its business into <span class='neutral'>pharmaceutical applications</span> in the <b>USA market</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728565138000,
            "Source": "corporate_action"
        },
        {
            "Title": "Privi Speciality Chemicals Receives FDA Certification for Camphor Product",
            "Summary": "<p>Privi Speciality Chemicals has obtained a <span class='positive'>'Certificate of API (Active Pharmaceuticals Ingredient) Product Listing'</span> and a <span class='positive'>'Certificate of Registration'</span> from the <b>U.S. Food and Drug Administration (FDA)</b> for its <span class='neutral'>camphor product</span>. This certification signifies that the company's camphor product <span class='positive'>meets FDA standards</span> for use as an active pharmaceutical ingredient.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728565131000,
            "Source": "corporate_action"
        }
    ]
}