{
    "Symbol": "PROSTARM",
    "ISIN": "INE0BX301013",
    "News": [
        {
            "Title": "Prostarm Info Systems Board Meet on Feb 13, 2026",
            "Summary": "Prostarm Info Systems Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770122875203,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prostarm Sets Up New UPS Manufacturing Unit in Gujarat",
            "Summary": "Prostarm Info Systems announces establishment of new manufacturing facility at Bakrol, Gujarat for UPS assembly with ₹6 crore investment, targeting commercial production by May 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767100998919,
            "Source": "stocks"
        },
        {
            "Title": "Prostarm Info Reports ₹2000 Cr Tender Activity",
            "Summary": "Prostarm Info Systems announces significant bidding activity worth ₹2000 crores today while maintaining current order book of ₹1100 crores, indicating strong business pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1765786684392,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prostarm Info Eyes 20-25% Revenue Growth",
            "Summary": "Prostarm Info Systems expects revenue to grow by around 20% to 25% in the near term, indicating positive business outlook for the technology company.",
            "Sentiment": "positive",
            "PublishDate": 1765786405854,
            "Source": "stocks"
        },
        {
            "Title": "Prostarm Infosystems Seeks Shareholder Approval to Increase Borrowing Limit to Rs 1,000 Crores",
            "Summary": "Prostarm Infosystems has issued a postal ballot notice seeking shareholder approval through special resolutions to increase borrowing limits from Rs 200 crores to Rs 1,000 crores, along with enhanced powers for loans, guarantees and investments. The company cites expanded business operations following its stock exchange listing on June 3, 2025, as the reason for requiring greater financial flexibility and working capital support.",
            "Sentiment": "positive",
            "PublishDate": 1764567753830,
            "Source": "corporate_action"
        },
        {
            "Title": "Prostarm Info Systems Reports Q2 FY26 Results with Sequential Growth Despite Revenue Decline",
            "Summary": "Prostarm Info Systems reported Q2 FY26 revenue of INR 659 million with 20% sequential growth, though H1 FY26 revenue declined to INR 1,208 million from INR 1,923 million in H1 FY25 due to high base effect from large one-time orders. The company secured significant orders including BESS projects from KPTCL and Adani Electricity, while reducing debt substantially from INR 638 million to INR 152 million and commissioning its 1.2 GWh BESS facility in Jhajjar by end of FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763642362157,
            "Source": "earnings"
        },
        {
            "Title": "Prostarm Info Systems Reports Strong Q2 Performance with 845.56 Lakhs Profit and Board Changes",
            "Summary": "Prostarm Info Systems announced quarterly results showing revenue of 6461.16 lakhs and profit of 845.56 lakhs for the quarter ended September 30, 2025, with earnings per share of 1.87. The company also reconstituted its CSR Committee following the resignation of Mr. Raghu Ramesh Thamannashastti, effective November 30, 2025, with new composition taking effect from December 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763136769358,
            "Source": "stock"
        },
        {
            "Title": "ProStarm Info Systems Receives Favorable GST Ruling, Department Ends All Actions",
            "Summary": "ProStarm Info Systems received a positive ruling from Maharashtra's Additional Commissioner regarding GST matters. Following this favorable decision, the GST Department has ended all actions against the company.",
            "Sentiment": "positive",
            "PublishDate": 1761656277602,
            "Source": "stock"
        },
        {
            "Title": "Prostarm Info Systems Whole Time Director Raghu Ramesh Thammannashastri Resigns Due to Health Issues",
            "Summary": "Prostarm Info Systems Limited announced that Mr. Raghu Ramesh Thammannashastri has resigned from his position as Whole Time Director, effective November 30, 2025. The resignation is attributed to health issues and other commitments. Thammannashastri also stepped down from his role as a member of the Corporate Social Responsibility Committee. He confirmed there are no other material reasons for his resignation beyond those stated in his resignation letter dated October 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761320023233,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prostarm Info Systems Secures ₹158.68 Crore Maharashtra Police IT Infrastructure Contract",
            "Summary": "Prostarm Info Systems has been selected for a CCTNS (Crime and Criminal Tracking Network & Systems) project to provide, set up, and manage IT infrastructure for Maharashtra Police. The contract is valued at ₹158.68 crores.",
            "Sentiment": "positive",
            "PublishDate": 1757576330787,
            "Source": "order&deals"
        },
        {
            "Title": "Prostarm Info Systems Incorporates Subsidiary for 150 MW Battery Energy Storage Project in Karnataka",
            "Summary": "Prostarm Info Systems Limited incorporated a wholly owned subsidiary named Prostarm Karnataka BESS Private Limited on September 09, 2025. The subsidiary serves as a Special Purpose Vehicle for setting up a 150 MW/300 MWh Standalone Battery Energy Storage System at the 400kV Doni Substation in Karnataka under Tariff Based Competitive Bidding mode on a Build Own Operate basis. The subsidiary has an authorized capital of ₹15 lakh divided into 1.5 lakh equity shares of ₹10 each, with subscribed capital of ₹5 lakh comprising 50,000 equity shares. Prostarm Info Systems holds 100% shareholding through initial cash subscription. The subsidiary is yet to commence business operations.",
            "Sentiment": "positive",
            "PublishDate": 1757417613404,
            "Source": "corporate_action"
        },
        {
            "Title": "Prostarm Info Systems Secures ₹45.72 Crore Annual Contract for Battery Energy Storage System",
            "Summary": "Prostarm Info Systems has won a contract from Karnataka Power Transmission Corporation for a 150 MW/300 MWh Battery Energy Storage System. The agreement is structured as a 12-year build-own-operate contract with an annual rental payment of ₹45.72 crores.",
            "Sentiment": "positive",
            "PublishDate": 1757051883244,
            "Source": "order&deals"
        },
        {
            "Title": "ProstarM Info Systems Wins Karnataka Power Transmission Corporation Contract Worth 457.2 Million Rupees Annually",
            "Summary": "ProstarM Info Systems has been named the L-1 bidder by Karnataka Power Transmission Corporation for a project valued at 457.2 million rupees annually. Being the L-1 bidder indicates the company submitted the lowest qualifying bid for the contract.",
            "Sentiment": "positive",
            "PublishDate": 1755690904130,
            "Source": "stock"
        },
        {
            "Title": "Prostarm Info Systems Incorporates Wholly Owned Subsidiary for 30MW Battery Energy Storage Project in Bihar",
            "Summary": "Prostarm Info Systems Limited has incorporated a wholly owned subsidiary named Prostarm Bihar Bess Private Limited on August 19, 2025. The subsidiary serves as a Special Purpose Vehicle to set up a 30MW/120 MWh standalone Battery Energy Storage System under Tariff Based Competitive Bidding mode at different GSS locations of BSPTCL in Bihar with Viability Gap Funding support under BOOT model. The subsidiary has an authorized capital of ₹15 lakh divided into 1.5 lakh equity shares of ₹10 each, with subscribed capital of ₹5 lakh comprising 50,000 equity shares. Prostarm holds 100% shareholding through initial capital subscription in cash. The subsidiary is yet to commence business operations.",
            "Sentiment": "positive",
            "PublishDate": 1755596780355,
            "Source": "corporate_action"
        },
        {
            "Title": "Prostarm Info Systems Submits Q1 FY26 Investor Presentation Highlighting Strong Order Book and BESS Expansion",
            "Summary": "Prostarm Info Systems Limited submitted its investor presentation for Q1 FY26 ended June 30, 2025. The company reported revenue of INR 549 million for the quarter with EBITDA margin of 7.29%. The company maintains a strong order book of INR 3,137 million and has secured significant BESS projects including a INR 520 million order from Adani Electricity for 22 MWh capacity and an LOA from Bihar State Power for 120 MWh BOOT project. Prostarm is establishing a 1.2 GWh annual capacity BESS facility in Haryana with INR 250 million capex, expected to be commissioned by end of FY26. The company operates across five business segments: Manufactured Power Solution Products (35% of FY25 revenue), Third Party Power Solution Products (32%), End User Computing (27%), Solar EPC Contracts (5%), and Value-Added Services (1%). With over 17 years of industry experience, the company has 3 manufacturing units, 409 dealers, and over 200,000 installations pan-India.",
            "Sentiment": "positive",
            "PublishDate": 1755517810877,
            "Source": "stock"
        },
        {
            "Title": "Prostarm Info Systems Reports 40.8% Revenue Decline But 155.6% Profit Surge in Q1 FY26",
            "Summary": "Prostarm Info Systems Limited reported mixed quarterly results with consolidated total income falling 40.8% to ₹5,574.82 lakhs from ₹9,415.64 lakhs in the previous year. Despite the revenue decline, the company achieved significant profitability improvements with profit after tax jumping 155.6% to ₹182.80 lakhs compared to ₹71.52 lakhs in the same period last year. Profit before tax increased 169.4% to ₹250.31 lakhs from ₹92.90 lakhs. Earnings per share improved to ₹0.41 from ₹0.17. The company's share capital increased to ₹5,887.46 lakhs from ₹4,287.46 lakhs, indicating potential additional share issuance during the year. The results demonstrate improved operational efficiency and cost management despite lower revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1755320737480,
            "Source": "earnings"
        },
        {
            "Title": "Prostarm Info Systems Reports Q1 FY26 Results, Revises Director Remuneration and Appoints New Auditors",
            "Summary": "Prostarm Info Systems Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of Rs 5,097.63 lakhs compared to Rs 9,381.98 lakhs in the same quarter last year, with net profit of Rs 156.19 lakhs versus Rs 186.02 lakhs year-on-year. Basic earnings per share stood at Rs 0.35 compared to Rs 0.43 in the previous year quarter. On consolidated basis, revenue from operations was Rs 5,491.39 lakhs against Rs 9,377.71 lakhs in the corresponding quarter, with net profit of Rs 182.80 lakhs compared to Rs 71.52 lakhs year-on-year. The Board also approved revision in terms and remuneration of Whole-Time Director Mr. Raghu Ramesh Thammannashastri for a three-year term from October 1, 2025 to September 30, 2028, subject to shareholder approval. Additionally, the company appointed M/s. Sandeep P Parekh & Co as Secretarial Auditors for five years from FY 2025-26 to FY 2029-30 and re-appointed M/s. Y R Doshi & Associates as Cost Auditor for FY 2025-26. The 18th Annual General Meeting is scheduled for September 26, 2025 via video conferencing. During the reporting period, the company completed its IPO of 1.6 crore equity shares at Rs 105 per share, raising Rs 16,800 lakhs, with shares listed on NSE and BSE on June 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755177604855,
            "Source": "earnings"
        },
        {
            "Title": "Prostarm Info Systems Secures Rs 3.70 Crore UPS Supply Contract",
            "Summary": "Prostarm Info Systems Limited received a work order worth Rs 3.70 crores from Electronic Payment & Services Private Limited for supply and installation of UPS with Lithium Ion batteries and Isolation Transformers. The domestic contract includes a 7-year warranty on UPS, battery, and isolation transformer components, with an estimated completion timeline of 4 months. The order value of Rs 3,69,75,000 excludes GST. The company confirmed that promoters and group companies have no interest in the contracting entity, and the transaction does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1754649082167,
            "Source": "stock"
        },
        {
            "Title": "Prostarm Info Systems Secures Rs. 15.98 Crore Annual Battery Storage Project from Bihar State Power Generation Company",
            "Summary": "Prostarm Info Systems Limited received a Letter of Award from Bihar State Power Generation Company Limited to set up a 30MW/120 MWh standalone Battery Energy Storage System. The project carries an annual rental value of Rs. 15.98 crores, calculated at Rs. 4.44 lacs per MW per month. The contract operates under a Build-Own-Operate-Transfer (BOOT) model for 12 years with Viability Gap Funding support. The system will be installed at different Grid Sub-Station locations of BSPTCL in Bihar through Tariff Based Competitive Bidding mode. The company received the award letter on August 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754634384370,
            "Source": "order&deals"
        },
        {
            "Title": "Prostarm Info Systems Reports Q4 Financial Results",
            "Summary": "Prostarm Info Systems has released its Q4 financial results. The company's EBITDA was 113 million rupees, compared to 112 million rupees in the previous quarter. The EBITDA margin decreased to 13.74% from 14.63% quarter-over-quarter. Consolidated net profit was 68 million rupees, down from 76 million rupees in the previous quarter. Revenue increased to 820 million rupees from 764 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1750681534000,
            "Source": "result"
        },
        {
            "Title": "Prostarm Info Systems Reports Q4 Financial Results",
            "Summary": "Prostarm Info Systems has reported its latest quarterly financial results. The company's net profit for Q4 decreased to 68 million rupees from 76 million rupees in the previous quarter. However, Q4 revenue increased to 820 million rupees from 764 million rupees quarter over quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1750681246000,
            "Source": "default"
        }
    ]
}