{
    "Symbol": "PROTEAN",
    "ISIN": "INE004A01022",
    "News": [
        {
            "Title": "Protean eGov Q3FY26 Earnings Call on Feb 12",
            "Summary": "Protean eGov Technologies announces earnings conference call scheduled for February 12, 2026 at 3:30 PM IST to discuss Q3FY26 operational and financial performance with senior management.",
            "Sentiment": "neutral",
            "PublishDate": 1770625885052,
            "Source": "co_actions_results"
        },
        {
            "Title": "Protean eGov clarifies Rs 25 crore Ethiopia order",
            "Summary": "Protean eGov Technologies responds to BSE query on Rs 25 crore Ethiopia Agriculture Ecosystem work order, confirming timely disclosure and market-driven price movements.",
            "Sentiment": "neutral",
            "PublishDate": 1770141825277,
            "Source": "stocks"
        },
        {
            "Title": "Protean eGov CEO Suresh Sethi Resigns, V Easwaran Named",
            "Summary": "Protean eGov Technologies announces Managing Director & CEO Suresh Sethi's resignation effective March 31, 2026, with Executive Director V Easwaran appointed as Interim CEO from April 1, 2026. Shares ended 0.36% higher at ₹703.75.",
            "Sentiment": "neutral",
            "PublishDate": 1768575142592,
            "Source": "stocks"
        },
        {
            "Title": "Protean eGov CEO Suresh Sethi Resigns, V Easwaran Named Interim CEO",
            "Summary": "Protean eGov Technologies announces resignation of Managing Director & CEO Suresh Sethi effective March 31, 2026. Executive Director V Easwaran to assume role as Interim CEO from April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768575094710,
            "Source": "stocks"
        },
        {
            "Title": "Protean eGov CEO Suresh Sethi Resigns, Easwaran Named Interim CEO",
            "Summary": "Protean eGov Technologies announces resignation of Managing Director & CEO Suresh Sethi effective March 31, 2026. Executive Director V Easwaran to take over as Interim CEO from April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768575064629,
            "Source": "stocks"
        },
        {
            "Title": "Protean eGov CEO Suresh Sethi Resigns, V Easwaran Named",
            "Summary": "Protean eGov Technologies announces Managing Director & CEO Suresh Sethi's resignation effective March 31, 2026. Executive Director V Easwaran will take over as Interim CEO from April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768574530223,
            "Source": "stocks"
        },
        {
            "Title": "Protean eGov Wins ₹25 Cr Ethiopia Agriculture DPI Deal",
            "Summary": "Protean eGov Technologies secured a ₹25 crore contract to implement Digital Public Infrastructure for Ethiopia's agriculture ecosystem, marking expansion into international DPI services.",
            "Sentiment": "positive",
            "PublishDate": 1768042389739,
            "Source": "co_actions_results"
        },
        {
            "Title": "Protean Acquires 4.95% Stake in NSDL Payments Bank",
            "Summary": "Protean eGov Technologies invests ₹30.20 crores for strategic stake in NSDL Payments Bank to enhance digital banking solutions and expand distribution network reach across India.",
            "Sentiment": "positive",
            "PublishDate": 1766753502450,
            "Source": "co_actions_results"
        },
        {
            "Title": "Protean eGov Re-designates Senior Executive Role",
            "Summary": "Protean eGov Technologies announces re-designation of Mr. Rakesh Dosi from Executive Vice President (Chief Business Officer) to Chief Business Product Officer, effective December 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766487601455,
            "Source": "stocks"
        },
        {
            "Title": "Protean eGov Shares Conference Call Recording",
            "Summary": "Protean eGov Technologies uploads audio recording of December 22, 2025 conference call discussing acquisition of 4.95% stake in NSDL Payments Bank on company website.",
            "Sentiment": "neutral",
            "PublishDate": 1766404684543,
            "Source": "co_actions_results"
        },
        {
            "Title": "Protean eGov Technologies Executive VP and Chief Digital AI Officer Resigns",
            "Summary": "Metesh Bhati, Executive Vice President and Chief Digital AI Officer at Protean eGov Technologies Limited, resigned on December 5, 2025 due to personal reasons with his last working day being December 8, 2025. The resignation affects the company's senior management structure as Bhati held a key technology leadership position overseeing digital AI operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764935444818,
            "Source": "corporate_governance"
        },
        {
            "Title": "Protean eGov Technologies Grants 2,101 Stock Options to Employees Under ESOP 2017",
            "Summary": "Protean eGov Technologies' Nomination and Remuneration Committee approved the grant of 2,101 stock options to eligible employees under the Employee Stock Option Plan 2017, with exercise prices of Rs. 814.30 for 1,328 options and Rs. 10 for 773 options. The options have a vesting period of 1-4 years from grant date and must be exercised within 3 years of vesting, covering 2,101 equity shares of Rs. 10 face value each.",
            "Sentiment": "positive",
            "PublishDate": 1764338774363,
            "Source": "corporate_action"
        },
        {
            "Title": "Protean eGov Executive Vice President Bertram D'Souza Steps Down as Chief Products Officer",
            "Summary": "Bertram D'Souza has stepped down from his role as Chief Products Officer at Protean eGov while retaining his position as Co Executive Vice President. The leadership change affects the company's product management structure and may impact strategic product development initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1764073547740,
            "Source": "corporate_governance"
        },
        {
            "Title": "Protean eGov Technologies Reports 19% QoQ Revenue Growth, Wins INR 1,370 Crores UIDAI Mandate",
            "Summary": "Protean eGov Technologies delivered strong quarterly results with revenue from operations growing 19% quarter-on-quarter and 14% year-on-year. EBITDA stood at INR 44 crores with a margin of 16.6%, while PAT was INR 24 crores with a 9% margin. The company secured a major INR 1,370 crores mandate from UIDAI to establish district-level Aadhaar Seva Kendras across 188 districts, expected to generate INR 200 crores annual recurring revenue once fully operational. New businesses contributed 17% to operating revenue this quarter, up from 4% last year, driven by CERSAI and BimaSugam RFP execution. The company maintains a strong balance sheet with over INR 800 crores in cash and cash equivalents, zero debt, and an order book of INR 1,600 crores. Tax Services revenue grew 8% sequentially to INR 107 crores, while CRA business reported INR 78 crores revenue with 12% year-on-year growth. The company onboarded 41 lakh new pension subscribers and issued over 1 crore PAN cards during the quarter, maintaining 58% market share in tax services and 98% market share in pension subscriber base.",
            "Sentiment": "positive",
            "PublishDate": 1762781501012,
            "Source": "earnings"
        },
        {
            "Title": "Protean eGov Technologies Reports 19% QoQ Revenue Growth, Wins ₹1,370 Crore UIDAI Contract",
            "Summary": "Protean eGov Technologies reported consolidated revenue of ₹251 crore for Q2 FY26, marking 19% quarter-on-quarter and 14% year-on-year growth. EBITDA stood at ₹44 crore with a margin of 16.6%, while profit after tax was ₹24 crore with a 9.0% margin. The company maintains a debt-free balance sheet with over ₹800 crore in cash equivalents and marketable securities. Tax Services segment retained 58% market share and issued over one crore PAN cards during the quarter. CRA Services posted 12% YoY growth with 41 lakh new subscribers onboarded and 690 corporates added. New businesses contributed 12% of total revenue in H1 FY26 compared to 4% in FY25. The company secured a landmark ₹1,370 crore mandate from UIDAI to establish and operate 188 District-Level Aadhaar Seva Kendras across India over six years, expected to generate ₹200 crore annual recurring revenue post deployment.",
            "Sentiment": "positive",
            "PublishDate": 1762457299387,
            "Source": "earnings"
        },
        {
            "Title": "Protean eGov Technologies Reports Mixed Q2 Performance with Revenue Growth but Profit Decline",
            "Summary": "Protean eGov Technologies Limited announced its quarterly results for the quarter and half year ended September 30, 2025. On a standalone basis, revenue from operations increased to ₹249.50 crores compared to ₹219.46 crores in the previous year quarter. However, profit after tax declined to ₹26.20 crores from ₹30.52 crores year-over-year. For the half year period, revenue grew to ₹459.48 crores versus ₹415.65 crores, while profit after tax remained relatively stable at ₹52.70 crores compared to ₹52.23 crores. The company's consolidated results showed similar trends with quarterly revenue at ₹250.50 crores and profit after tax at ₹23.86 crores. The company granted 1,61,875 new stock options to employees and allotted 60,454 equity shares upon exercise of existing stock options during the period. The results were approved by the Board of Directors and reviewed by statutory auditors BSR Associates LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1762453057715,
            "Source": "earnings"
        },
        {
            "Title": "Protean eGov Technologies Plans Digital Infrastructure Expansion Across Government Ecosystems",
            "Summary": "Protean eGov Technologies aims to strengthen its position as India's digital infrastructure backbone by expanding into Aadhaar, PAN, pension, and skill-tech ecosystems. The company is focusing on developing new government partnerships, cloud-based public service platforms, and enhancing data security capabilities. Protean eGov targets steady margin expansion and recurring revenue growth through platform modernization and citizen service digitization initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1762442133000,
            "Source": "stock"
        },
        {
            "Title": "Protean eGov Technologies Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Protean eGov Technologies Limited has scheduled an earnings conference call for Friday, November 7, 2025, at 3:30 PM IST to discuss the company's operational and financial performance for Q2 FY26. The call will be led by key executives including MD & CEO Suresh Sethi, COO V Easwaran, CFO Sandeep Mantri, and VP-Head IR Pushpa Mani. Multiple dial-in numbers are provided for domestic and international participants, with options for Hong Kong, Singapore, USA, and UK access.",
            "Sentiment": "neutral",
            "PublishDate": 1762185726222,
            "Source": "earnings"
        },
        {
            "Title": "Mukul Mahavir Agrawal Acquires 1.5% Stake in Protean eGov Despite 42% YTD Decline",
            "Summary": "Investor Mukul Mahavir Agrawal has acquired approximately 1.5% stake (over six lakh shares) in Protean eGov Technologies, while Ramesh Damani holds 1.05% stake (more than four lakh shares) according to September quarter shareholding data. The stock fell nearly 20% in May after Protean was not shortlisted for the government's PAN 2.0 project, which contributes 45-50% of company revenue. However, existing PAN services remain unaffected. The company secured a Rs 1,160 crore contract from UIDAI in August to manage Aadhaar Seva Kendras across 188 districts. For the June quarter, Protean reported consolidated revenue of Rs 211 crore (up 7% YoY, down 5% sequentially), EBITDA of Rs 45 crore (up 31% YoY) with 18.8% margins, and profit after tax of Rs 24 crore (up 13% YoY, 17% QoQ). The company maintains over Rs 800 crore in cash and marketable securities with zero debt. Despite steady earnings, the stock has declined 40% over six months and 42% year-to-date, closing at Rs 867 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761202167671,
            "Source": "stock"
        },
        {
            "Title": "Gaurav Ramdev Steps Down As CGMO At Protean eGov Technologies",
            "Summary": "Gaurav Ramdev will step down from his position as Chief Growth and Marketing Officer (CGMO) at Protean eGov Technologies, with his departure effective October 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761198617673,
            "Source": "corporate_governance"
        },
        {
            "Title": "Mukul Mahavir Agrawal Holds 1.48% Stake in Protean Egov Technologies",
            "Summary": "Investor Mukul Mahavir Agrawal holds a 1.48% stake in Protean Egov Technologies during the second quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760950376654,
            "Source": "stock"
        },
        {
            "Title": "Protean eGov Technologies CIO Dharmesh Parekh Resigns Due to Personal Reasons",
            "Summary": "Dharmesh Parekh, Executive Vice President (Chief Information Officer & Head Cloud Services) at Protean eGov Technologies Limited, has resigned due to personal reasons. He submitted his resignation on September 26, 2025, with his last working day scheduled for October 27, 2025. Parekh will be available for transition and handover during this period. The company has disclosed this senior management change to stock exchanges BSE and NSE as required under listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1758892534952,
            "Source": "corporate_governance"
        },
        {
            "Title": "Protean eGov Technologies Wins Rs. 1,370 Crore Aadhaar Seva Kendra Contract",
            "Summary": "Protean eGov Technologies secured a Rs. 1,370 crore contract from UIDAI to establish and operate Aadhaar Seva Kendras in 188 districts across India for six years. The company will manage complete setup and daily operations of these centers, providing Aadhaar enrollment, biometric updates, and related services. The transaction-based revenue model is expected to generate Rs. 180-190 crores annually once fully scaled in 6-12 months. Revenue contribution is projected to begin from Q3 FY2026. Protean and BLS International are the two companies awarded this contract, with Protean covering 188 out of 471 total districts. The contract positions Protean as the only company contributing to scaling up two critical national IDs in India and is expected to be EBITDA-accretive with minimal CAPEX requirements.",
            "Sentiment": "positive",
            "PublishDate": 1756379289725,
            "Source": "order&deals"
        },
        {
            "Title": "Protean eGov Technologies Schedules Business Update Call for INR 1160 Crore Aadhaar Seva Kendra Order Win",
            "Summary": "Protean eGov Technologies Limited has scheduled a business update conference call on August 26, 2025, at 2:30 PM IST to discuss their Aadhaar Seva Kendra (ASK) order win worth approximately INR 1160 crore. The call will be led by key executives including MD & CEO Suresh Sethi, COO V Easwaran, CFO Sandeep Mantri, and VP-Head IR Pushpa Mani. The company noted the significance of the development and scheduled the call on short notice. Dial-in numbers have been provided for both domestic and international participants, with pre-registration available to avoid wait times.",
            "Sentiment": "positive",
            "PublishDate": 1756188376569,
            "Source": "stock"
        },
        {
            "Title": "Protean eGov Technologies Secures INR 1160 Crore Work Order from UIDAI for Aadhaar Service Centers",
            "Summary": "Protean eGov Technologies Limited received a work order worth approximately INR 1160 crores from the Unique Identification Authority of India (UIDAI) on August 25, 2025. The contract involves establishing and running District Level Aadhaar Seva Kendras across 188 districts in India for a period of six years. The company will provide appointment and walk-in based Aadhaar enrollment, updates, and other miscellaneous Aadhaar services at these centers. The contract value is exclusive of taxes and represents a domestic outsourcing project for public service delivery.",
            "Sentiment": "positive",
            "PublishDate": 1756127926644,
            "Source": "order&deals"
        },
        {
            "Title": "Protean eGov Technologies Appoints Dr. Harpreet Singh Anand as Chief Human Resources Officer",
            "Summary": "Protean eGov Technologies Limited appointed Dr. Harpreet Singh Anand as Executive Vice President (Chief Human Resources Officer) effective August 26, 2025. The appointment was approved by the Board of Directors through a circular resolution passed on August 22, 2025. Dr. Anand brings over two decades of leadership experience in Human Resources across BFSI, Fintech, Start-ups, and Technology sectors. He previously served as Head – Human Resources at Kotak Life Insurance and held senior positions at Jio Tesseract, India Post Payments Bank, Aditya Birla Capital, and Pramerica Life Insurance. His expertise includes HR digitization, cultural transformations, performance management systems, and workforce planning. In his new role, Dr. Anand will lead People Strategy, Performance Management, Total Rewards, Talent Acquisition, Employee Experience, and Digital HR Transformation. He holds an Honorary Doctorate in Human Resource Management from Cambridge Digital University, USA, and a B.Tech from Amravati University.",
            "Sentiment": "positive",
            "PublishDate": 1755879376011,
            "Source": "corporate_governance"
        },
        {
            "Title": "Protean eGov Technologies Sets Record Date for Rs. 10 Final Dividend",
            "Summary": "Protean eGov Technologies Limited has fixed August 29, 2025 as the record date for determining shareholder eligibility for final dividend payment. The Board of Directors recommended a final dividend of Rs. 10 per equity share (100% on face value of Rs. 10 each) for the financial year ended March 31, 2025. The dividend recommendation requires shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1755166348236,
            "Source": "corporate_action"
        },
        {
            "Title": "Protean eGov Technologies Reports 7% Revenue Growth and 31% EBITDA Jump in Q1FY26",
            "Summary": "Protean eGov Technologies delivered revenue from operations of INR 211 crores in Q1FY26, representing 7% year-on-year growth. EBITDA surged 31% to INR 45 crores with margin expansion of 284 basis points to 18.8%. Profit after tax grew 13% to INR 24 crores, achieving a PAT margin of 10%. The company secured a significant INR 100 crore mandate from Bima Sugam India Federation to develop insurance digital public infrastructure. Central recordkeeping services business drove growth with 16% revenue increase, adding 32.4 lakh new subscribers and capturing 98% market share in new additions. Tax services gained 80 basis points market share to 59%, issuing 1 crore PAN cards with 54% being paperless. The company maintains a strong balance sheet with over INR 800 crores in cash and cash equivalents and zero debt. Current order book exceeds INR 300 crores from RFP mandates including CERSAI, CKYCRR 2.0, and Bima Sugam projects.",
            "Sentiment": "positive",
            "PublishDate": 1754999970369,
            "Source": "earnings"
        },
        {
            "Title": "Protean eGov Technologies Uploads Q1FY26 Earnings Call Audio Recording",
            "Summary": "Protean eGov Technologies Limited has made available the audio recording of its earnings conference call held on August 7, 2025, to discuss the company's operational and financial performance for Q1FY26. The recording has been uploaded to the company's website. The company notified BSE and NSE about the availability of this recording, with trading symbol PROTEAN and scrip code 544021.",
            "Sentiment": "neutral",
            "PublishDate": 1754576121084,
            "Source": "earnings"
        },
        {
            "Title": "Protean eGov Technologies Approves Q1 FY2026 Results and INR 19 Crore Investment in Dubai Subsidiary",
            "Summary": "Protean eGov Technologies Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and authorized additional investment of up to INR 19 crores in its wholly owned subsidiary, Protean International DMCC in Dubai. The company reported standalone revenue from operations of INR 209.98 crores and profit after tax of INR 26.50 crores for the quarter. On a consolidated basis, revenue was INR 210.84 crores with profit after tax of INR 23.85 crores. The additional equity investment in the Dubai subsidiary will increase its share capital from AED 400,000 to AED 7,946,000, maintaining 100% ownership. The subsidiary serves as a holding company for international business and will provide IT/ITeS services across multiple countries. The company operates primarily in the IT services sector, offering e-governance solutions, system integration, and IT consulting services.",
            "Sentiment": "positive",
            "PublishDate": 1754495478850,
            "Source": "earnings"
        },
        {
            "Title": "Protean eGov Technologies Appoints Sandeep Mantri as Chief Financial & Impact Officer",
            "Summary": "Protean eGov Technologies Limited has designated Sandeep Mantri as Chief Financial & Impact Officer (CFIO) effective August 4, 2025. Mantri, who was serving as Chief Financial Officer, will take on additional responsibilities for CSR and Impact functions following the retirement of Dipali Sheth as Chief Human Resource & Impact Officer on August 1, 2025. Mantri is an alumnus of Berkeley-Haas School of Business and IIM Calcutta, holds qualifications as a Chartered Accountant and Certified Public Accountant (USA), and brings 24 years of work experience across digital, technology, media, manufacturing, and professional consulting sectors. He previously served as EVP and Chief Financial Officer at Datamatics Global Services Limited for 8 years and has worked with Network18 Media & Investments Limited, Syntel Group, and Clariant India.",
            "Sentiment": "neutral",
            "PublishDate": 1754310502064,
            "Source": "corporate_governance"
        },
        {
            "Title": "Protean eGov Technologies Schedules Board Meeting for August 6 to Approve Quarterly Results",
            "Summary": "Protean eGov Technologies Limited has scheduled a Board of Directors meeting on August 6, 2025, to consider and approve the Unaudited Financial Results (Standalone & Consolidated) for the quarter ended June 30, 2025, along with the Limited Review Report of the Statutory Auditors. The company has implemented a trading window closure for its shares from July 1, 2025 to August 8, 2025. The company trades on BSE with scrip code 544021 and on NSE with the symbol PROTEAN.",
            "Sentiment": "neutral",
            "PublishDate": 1753784423415,
            "Source": "corporate_action"
        },
        {
            "Title": "Protean eGov Technologies: Stock Plunges 50% from Peak",
            "Summary": "Protean eGov Technologies stock has fallen nearly 50% from its 52-week high to a fresh low of Rs 785. Analysts advise caution, citing weak technical structure and the company's failure to secure the government's PAN 2.0 project as major setbacks.",
            "Sentiment": "negative",
            "PublishDate": 1752724758000,
            "Source": "normal_news"
        },
        {
            "Title": "Protean eGov Technologies: Secures Rs 100 Crore Contract for Bima Sugam Platform",
            "Summary": "Protean eGov Technologies has won a Rs 100 crore contract from Bima Sugam India Federation to develop and maintain the Bima Sugam digital marketplace platform for insurance products. The 72-month contract was awarded on June 9, 2025, strengthening Protean's position in India's Digital Public Infrastructure space.",
            "Sentiment": "positive",
            "PublishDate": 1749525750000,
            "Source": "order&deals"
        },
        {
            "Title": "Protean eGov Technologies: Secures Rs 100 Crore Contract from Bima Sugam India Federation",
            "Summary": "Protean eGov Technologies Ltd. has won a Rs 100 crore work order from Bima Sugam India Federation to develop and maintain the Bima Sugam Marketplace. The contract is for 72 months and involves comprehensive development, implementation, support, and maintenance of the digital insurance platform.",
            "Sentiment": "positive",
            "PublishDate": 1749475765000,
            "Source": "order&deals"
        },
        {
            "Title": "Protean Secures ₹1 Billion Work Order from BSIF",
            "Summary": "Protean has received a significant work order valued at approximately ₹1 billion from the Bima Sugam India Federation (BSIF). The order was obtained through the Request for Proposal (RFP) process.",
            "Sentiment": "positive",
            "PublishDate": 1749470851000,
            "Source": "default"
        },
        {
            "Title": "Protean eGov Technologies: Core Business Expected to Grow 10-12% CAGR",
            "Summary": "CEO Suresh Sethi projects 10-12% CAGR for Protean's core business. The company is expanding into new digital identity and API services. Protean's PAN card services are expected to continue growing, with current PAN penetration at 35-40% in India. The company was not shortlisted for the PAN 2.0 MSP bid, but this doesn't impact their existing business.",
            "Sentiment": "positive",
            "PublishDate": 1747966735000,
            "Source": "normal_news"
        },
        {
            "Title": "Protean eGov Technologies: CEO Downplays Impact of Missing PAN 2.0 Contract",
            "Summary": "Protean eGov's CEO Suresh Sethi assures that missing out on the PAN 2.0 contract doesn't affect current operations. The company maintains a 57% market share in PAN issuance, with 6-7 crore new PANs issued annually. Protean is diversifying into agri, health, and digital commerce sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1747912114000,
            "Source": "normal_news"
        },
        {
            "Title": "Protean eGov Technologies: Q4 Profit Drops 11%, PAN 2.0 Project Bid Rejected",
            "Summary": "Protean eGov Technologies reported an 11% drop in Q4 FY25 net profit to Rs 20.4 crore, despite a 9.8% revenue increase to Rs 222 crore. The company's bid for the Income Tax Department's PAN 2.0 project was rejected, leading to significant stock price declines earlier in the week.",
            "Sentiment": "negative",
            "PublishDate": 1747885807000,
            "Source": "earnings"
        },
        {
            "Title": "Protean eGov Technologies Reports Q4 Results and Recommends Dividend",
            "Summary": "Protean eGov Technologies has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 204 million rupees from 192.9 million rupees year-over-year. Revenue remained stable at 2.22 billion rupees. However, EBITDA decreased to 178.9 million rupees from 219.3 million rupees, with EBITDA margin falling to 8.05% from 9.87%. The company has recommended a final dividend of 10 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747845969000,
            "Source": "result"
        },
        {
            "Title": "Protean eGov Technologies: Key Investor Sells Stake, Stock Drops Ahead of Q4 Results",
            "Summary": "Massachusetts Institute of Technology sold 0.99% stake in Protean eGov Technologies at ₹1,026 per share. The company's stock has fallen nearly 30% in two days after being excluded from the Income Tax Department's PAN 2.0 project bidding process. Q4 results are due today.",
            "Sentiment": "negative",
            "PublishDate": 1747784957000,
            "Source": "block_deals"
        },
        {
            "Title": "Protean eGov Technologies: Shares Plunge 20% After PAN 2.0 Project Loss",
            "Summary": "Protean eGov Technologies' shares hit the lower circuit of 20% after the company lost contention for the government's PAN 2.0 project. Equirus Securities downgraded the stock to 'sell' with a target price of ₹900, citing potential 75-100% revenue loss from PAN services over 2-3 years. The company derives 45-50% of its revenue from PAN operations.",
            "Sentiment": "negative",
            "PublishDate": 1747699208000,
            "Source": "normal_news"
        },
        {
            "Title": "Protean eGov Tech Sees No Immediate Impact on PAN Business",
            "Summary": "An executive from Protean eGov Tech has stated that the company does not anticipate any immediate impact on its PAN (Permanent Account Number) business, according to a report on CNBC TV18.",
            "Sentiment": "neutral",
            "PublishDate": 1747638526000,
            "Source": "default"
        },
        {
            "Title": "Protean eGov Technologies: Shares Plunge 20% After PAN 2.0 Project Bid Rejection",
            "Summary": "Protean eGov Technologies' stock dropped 19.99% to ₹1,143.20 on NSE after the company was eliminated from the Income Tax Department's PAN 2.0 project bidding process. The company stated that this development should have limited impact on its existing PAN processing services.",
            "Sentiment": "negative",
            "PublishDate": 1747628281000,
            "Source": "corporate_action"
        },
        {
            "Title": "Protean eGov Technologies: Shares Plummet 20% After PAN 2.0 Project Exclusion",
            "Summary": "Protean eGov Technologies shares hit 20% lower circuit after the company was not considered for the next round of the PAN 2.0 project by the Income Tax Department. The company stated the project appears to have limited impact on their ongoing PAN processing services.",
            "Sentiment": "negative",
            "PublishDate": 1747627357000,
            "Source": "normal_news"
        },
        {
            "Title": "Protean Egov Technologies to List on NSE",
            "Summary": "Protean Egov Technologies is scheduled to list on the National Stock Exchange (NSE) on February 6. This listing represents a significant corporate action for the company, potentially increasing its visibility and access to capital markets.",
            "Sentiment": "neutral",
            "PublishDate": 1738714574000,
            "Source": "corporate_action"
        },
        {
            "Title": "Protean Egov Technologies Reports Q3 Financial Results",
            "Summary": "Protean Egov Technologies announced its Q3 financial results. The company reported a net profit of 209.3 million rupees, up from 154 million rupees year-over-year and 305.2 million rupees quarter-over-quarter. Revenue for Q3 stood at 2.02 billion rupees, slightly higher than the 2 billion rupees reported in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738284204000,
            "Source": "earnings"
        },
        {
            "Title": "Protean eGov Technologies Reports Q3 Revenue Growth",
            "Summary": "Protean eGov Technologies has announced its third-quarter revenue results. The company reported revenue of 2.02 billion rupees, showing an increase from 2 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738257227000,
            "Source": "earnings"
        },
        {
            "Title": "Protean eGov Technologies Reports Increased Q3 Net Profit",
            "Summary": "Protean eGov Technologies has reported a net profit of 209.3 million rupees for the third quarter, showing an increase from both the previous year and quarter. The year-over-year growth is from 154 million rupees, while the quarter-over-quarter increase is from 305.2 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738257219000,
            "Source": "earnings"
        },
        {
            "Title": "NSDL E-Governance Malaysia Subsidiary Dissolved",
            "Summary": "Protean eGov Technologies has announced that its subsidiary, NSDL e-Governance (Malaysia) SDN. BHD., which was incorporated in Malaysia, has been dissolved.",
            "Sentiment": "neutral",
            "PublishDate": 1734358222000,
            "Source": "corporate_action"
        }
    ]
}