{
    "Symbol": "PROZONER",
    "ISIN": "INE195N01013",
    "News": [
        {
            "Title": "Prozone Realty Shareholders Approve All Resolutions",
            "Summary": "Prozone Realty Limited successfully completed postal ballot voting with shareholders approving all three resolutions including related party transactions and increased investment limits under Section 186.",
            "Sentiment": "positive",
            "PublishDate": 1770917002799,
            "Source": "stocks"
        },
        {
            "Title": "Prozone Realty Q3 FY26 Results Show Strong Growth",
            "Summary": "Prozone Realty reports 30% YoY growth in operations income to Rs 582.3 mn for Q3 FY26, with EBITDA rising 28% to Rs 254.8 mn. Real estate revenue surged 66% while lease rentals grew 13%.",
            "Sentiment": "positive",
            "PublishDate": 1770488719680,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prozone Realty Auditors Convert to LLP Structure",
            "Summary": "Prozone Realty Limited announces conversion of statutory auditors M S K A & Associates to M S K A & Associates LLP effective January 13, 2026, with auditing services continuing under same terms.",
            "Sentiment": "neutral",
            "PublishDate": 1769079577301,
            "Source": "stocks"
        },
        {
            "Title": "Prozone Realty Submits Application for Promoter Group Reclassification to Public Category",
            "Summary": "Prozone Realty Limited submitted applications to BSE and NSE seeking no-objection for reclassification of four promoter group members including Mr. Ghanshyam Rawat, Ms. Vandana Vaidh, Mrs. Pushpalata Rawat and M/s Rakesh Rawat Family Trust from promoter group to public category. The company filed the applications following board consideration and regulatory requirements under SEBI listing regulations within the mandated five-day timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1763388906278,
            "Source": "corporate_action"
        },
        {
            "Title": "Prozone Realty Approves Wholly-Owned Subsidiary and Promoter Group Reclassification",
            "Summary": "Prozone Realty's Board of Directors approved the incorporation of a wholly-owned subsidiary named Prozone Arcade Pvt Ltd with a cash investment of Rs 1,00,000 for 10,000 equity shares of Rs 10 each. The subsidiary will operate in the construction and real estate sectors. Additionally, the Board approved reclassification requests from promoter group members to public category under SEBI regulations. The reclassification involves Ghanshyam Rawat, Vandana Vaidh (holding 1,620 shares), Pushpalata Rawat, and Rakesh Rawat Family Trust (holding 35,85,796 shares representing 2.35% stake). The applicants confirmed they comply with regulatory conditions including holding less than 10% voting rights, not exercising control, having no special rights, and not representing on the board. The reclassification is subject to approvals from stock exchanges, shareholders and other required authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1763001318538,
            "Source": "corporate_action"
        },
        {
            "Title": "Prozone Realty Reports Mixed Quarterly Results Amid Deputy MD Appointment Rejection",
            "Summary": "Prozone Realty Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported consolidated revenue from operations of Rs 4,618.77 lakhs compared to Rs 4,885.72 lakhs in the same quarter last year. Net profit stood at Rs 341.92 lakhs versus Rs 39.41 lakhs in the previous year quarter. The Ministry of Corporate Affairs rejected the company's application for re-appointment of its Deputy Managing Director under Section 196 of the Companies Act, 2013. The rejected director ceased to hold the position and was redesignated as Non-Executive Director. The company is evaluating legal recourse and determining action for Rs 682 lakhs in remuneration and salary advances paid to the director from February 27, 2020 till the rejection order date. Additionally, subsidiary Hagwood Commercial Developers Private Limited continues contesting cancellation of aviation clearance for its Nagpur residential project, with management believing chances of revalidation are high based on recent court orders.",
            "Sentiment": "neutral",
            "PublishDate": 1762987832223,
            "Source": "earnings"
        },
        {
            "Title": "Prozone Realty Plans Mixed-Use Projects in Tier-2 Cities with Focus on Rental Income Growth",
            "Summary": "Prozone Realty is pursuing long-term value creation through new mixed-use projects in tier-2 cities. The company maintains stable retail occupancy above 90% and plans to launch residential phases to enhance cash flows. The strategy focuses on rental income stability and expansion of the asset portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1762963541087,
            "Source": "stock"
        },
        {
            "Title": "Prozone Realty Reports Q2 Net Profit of 15M Rupees After Previous Year Loss",
            "Summary": "Prozone Realty posted a consolidated net profit of 15 million rupees in Q2, compared to a loss of 13 million rupees in the same quarter last year. The company's Q2 revenue declined to 462 million rupees from 488 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762957145057,
            "Source": "earnings"
        },
        {
            "Title": "Prozone Realty Shareholders Approve Secretarial Auditor Appointment and Managing Director Re-appointment at 18th AGM",
            "Summary": "Prozone Realty Limited held its 18th Annual General Meeting on September 26, 2025, where shareholders approved key resolutions through remote e-voting and e-voting during the meeting. The company appointed HSPN & Associates as Secretarial Auditor for five consecutive years from financial year 2025-26 to 2029-30. Shareholders also approved the re-appointment of Nikhil Chaturvedi as Managing Director for three years effective February 27, 2026. Other approved resolutions included adoption of audited financial statements for the year ended March 31, 2025, and re-appointment of Bipin Gurnani as Director. The meeting had 57,640 shareholders on record date, with 5 promoter group members and 41 public shareholders attending through video conferencing. All resolutions were passed with over 99% approval rates, with voting conducted by scrutinizer Hemant Shetye from HSPN & Associates LLP.",
            "Sentiment": "positive",
            "PublishDate": 1758901950606,
            "Source": "corporate_action"
        },
        {
            "Title": "Prozone Realty Receives Reclassification Requests from Four Promoter Group Members",
            "Summary": "Prozone Realty Limited received requests from four promoter group members seeking reclassification from 'Promoter Group' to 'Public' category. The requests came from Rakesh Rawat Family Trust (holding 35,85,796 shares or 2.35%), Ghanshyam Rawat (0 shares), Pushplata Rawat (0 shares), and Vandana Vaidh (1,620 shares or 0.00%). All applicants stated they have no influence over company business decisions, are not engaged in management or day-to-day affairs, and do not have rights to appoint directors or control policy decisions. The company will process these requests and present them to the Board of Directors within two months for analysis and seek necessary approvals from regulatory authorities including stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1758377782231,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prozone Realty Approves Incorporation of Two Wholly Owned Subsidiaries",
            "Summary": "Prozone Realty Limited's Board of Directors approved the incorporation of two wholly owned subsidiaries in their Board meeting held on August 14, 2025. The proposed entities are named Prozone Dream Realtors Pvt Ltd and Prozone Horizons Pvt Ltd, though alternative names may be used based on availability from the Registrar of Companies, Maharashtra. Both subsidiaries will operate in the construction and real estate sectors. Prozone Realty will hold 100% shareholding in each entity through cash consideration of Rs 1,00,000 for purchasing 10,000 equity shares of Rs. 10 each at par value in each company. The incorporation requires approval from the Ministry of Corporate Affairs, with no additional sectoral approvals needed from government or regulatory bodies.",
            "Sentiment": "neutral",
            "PublishDate": 1755187003378,
            "Source": "corporate_action"
        },
        {
            "Title": "Prozone Realty Reports Strong Q1 FY26 Results with 18.8% Revenue Growth and Return to Profitability",
            "Summary": "Prozone Realty Limited reported operating income of Rs 382.4 million for Q1 FY26, marking an 18.8% increase from Rs 321.9 million in Q1 FY25. The company achieved significant profitability turnaround with profit after tax of Rs 37.8 million compared to a loss of Rs 56.9 million in the previous year quarter. EBITDA surged 150.7% to Rs 212.6 million from Rs 84.8 million year-over-year. Real estate project revenue jumped 222.7% to Rs 74.1 million from Rs 23 million in Q1 FY25. The retail business showed strong performance with retailer sales of Rs 1.91 billion and footfall of over 4.9 million visitors, up 12% from Q1 FY25. Six new stores with 14,154 sq ft opened during the quarter, while 14 new stores covering 74,397 sq ft were signed or under fitout. Ch Sambhaji Nagar mall achieved 94% leasing status with 16.2% footfall growth, while Coimbatore mall reached 96% leasing with 6.2% footfall increase. The residential segment collected Rs 974.9 million in Q1 FY26 with 29 new bookings received. The company operates 4.82 lakh sq ft of retail space across two malls with 118 stores leased.",
            "Sentiment": "positive",
            "PublishDate": 1755184574626,
            "Source": "earnings"
        },
        {
            "Title": "Prozone Realty Reports Q1 FY26 Results; Deputy Managing Director Position Rejected by Government",
            "Summary": "Prozone Realty Limited approved its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 217.13 lakhs and net profit of Rs. 49.97 lakhs, with earnings per share of Rs. 0.03. On a consolidated basis, total income reached Rs. 4,114.79 lakhs with net profit of Rs. 378.26 lakhs and earnings per share of Rs. 0.05. The Ministry of Corporate Affairs rejected the company's application for re-appointment of its Deputy Managing Director, leading to a change in designation to Non-Executive Director. The company is evaluating legal recourse and determining action for Rs. 682 lakhs in remuneration and salary advances paid to the director. Additionally, subsidiary Hagwood Commercial Developers is contesting cancellation of aviation clearance for its Nagpur residential project, with the High Court directing fresh aeronautical studies within six months.",
            "Sentiment": "neutral",
            "PublishDate": 1755168345373,
            "Source": "earnings"
        },
        {
            "Title": "Prozo: Indian Cricketer Rohit Sharma Invests in Supply Chain Firm",
            "Summary": "Indian cricketer Rohit Sharma has made a strategic investment in supply chain firm Prozo. The company has raised $20 million to date from investors including Sixth Sense Ventures and Jafco Asia. Prozo operates 42 tech-enabled warehouses covering 2.2 million square feet and is operating at a revenue run-rate of Rs 250 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750928405000,
            "Source": "normal_news"
        },
        {
            "Title": "Prozone Realty: Stock Surges 20% on Open Offer Announcement",
            "Summary": "Prozone Realty's stock hit a 20% upper circuit at ₹33.14 following an open offer announcement. M/s. Apax Trust is offering to acquire 26% of the company's equity (3.96 crore shares) at ₹25 per share, totaling ₹99.19 crore. The offer price represents a discount to the current market price.",
            "Sentiment": "positive",
            "PublishDate": 1735707439000,
            "Source": "corporate_action"
        }
    ]
}