{
    "Symbol": "PRSMJOHNSN",
    "ISIN": "INE010A01011",
    "News": [
        {
            "Title": "Prism Johnson Q3 Net Profit Rises 8.7% to ₹500M",
            "Summary": "Prism Johnson reports consolidated net profit of ₹500 million for Q3, marking an 8.7% increase from ₹460 million in the same quarter previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770364828746,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prism Johnson wins tax appeal, faces High Court challenge",
            "Summary": "CESTAT set aside Rs.34.10 crore tax demand against Prism Johnson as time-barred, but tax authorities have appealed to Madhya Pradesh High Court with hearing scheduled for February 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769244175910,
            "Source": "stocks"
        },
        {
            "Title": "Prism Johnson Appoints New Senior Management Personnel",
            "Summary": "Prism Johnson Limited designates Anil Madlani as Senior Management Personnel effective January 1, 2026, replacing Rajshekhar Shettar who retired on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767188315254,
            "Source": "stocks"
        },
        {
            "Title": "Prism Johnson Board Approves Office Sale for ₹165.91 Cr",
            "Summary": "Prism Johnson Ltd. board approves sale of Mumbai office premises to Windsor Realty for ₹165.91 crores, with sale deed execution by December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766034882709,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prism Johnson Wins High Court Case on Sales Tax Forms, Expects Refund or Adjustment",
            "Summary": "The Madhya Pradesh High Court at Jabalpur allowed Prism Johnson's writ petition and directed authorities to issue Form C for concessional diesel procurement from July 2017 to March 2021. The differential sales tax amount paid by the company during this period will likely be refunded or adjusted against future liability with no adverse impact on operations.",
            "Sentiment": "positive",
            "PublishDate": 1764351535624,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson's Service Tax Rectification Application Rejected by CESTAT",
            "Summary": "Prism Johnson Limited's Service Tax Rectification of Mistake Application has been rejected by the Principal Bench of CESTAT, New Delhi regarding a Rs. 22.57 crores service tax demand including penalties. The company is proceeding to file a statutory appeal against the order and maintains the claim amount as contingent liability, expecting no material financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1763553015167,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Limited Appoints New Chief Investor Relations Officer",
            "Summary": "Prism Johnson Limited's Board of Directors appointed Mr. Ashish Samal as Chief Investor Relations Officer effective November 8, 2025. The 41-year-old MBA in Finance from IBS Mumbai brings over 16 years of investor relations experience, having previously worked with companies including Suraj Estate Developers, Garware Hitech Films, and several PR firms. He specializes in transparent communication strategies and has led fundraising through equity and warrants while handling pre-IPO roadshows across various sectors. Simultaneously, Ms. Nupur Agarwal resigned from her position as Chief Investor Relations Strategy Officer effective November 7, 2025, after nearly 5 years with the company to pursue other professional opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1762501157411,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prism Johnson Reports Strong Q2 Turnaround with 286% EBITDA Growth",
            "Summary": "Prism Johnson delivered significant improvement in Q2 financial performance. EBITDA surged to 1.89 billion rupees from 490 million rupees year-over-year, representing a 286% increase. EBITDA margin expanded substantially to 10.24% from 3% in the same period last year. Revenue grew to 18.3 billion rupees compared to 16.4 billion rupees year-over-year, marking a 12% increase. The company achieved a consolidated net profit of 16 million rupees, turning around from a loss of 1.03 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762499908431,
            "Source": "earnings"
        },
        {
            "Title": "Prism Johnson Limited Completes Income Tax Survey at Offices and Manufacturing Units",
            "Summary": "Prism Johnson Limited announced that a survey action under Section 133A of the Income Tax Act, 1961 conducted by the Income Tax Department on the company's offices and manufacturing units has been concluded. The company extended full cooperation and assistance during the proceedings. The company stated there is no material impact on business operations due to the survey proceedings that requires disclosure under listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762430646045,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Postpones Board Meeting Following Income Tax Survey at Company Offices",
            "Summary": "Prism Johnson Limited announced that Income Tax Department officials visited some of the company's offices and manufacturing units to conduct a survey action under Section 133A of the Income Tax Act, 1961. The company is providing full cooperation to the tax officials during the ongoing proceedings. Due to this survey, the Board of Directors meeting scheduled for October 31, 2025, which was to consider and approve standalone and consolidated unaudited financial results for the quarter and half year ended September 30, 2025, has been postponed. The company stated there is currently no material impact on business operations and will inform about the revised board meeting date in due course. The trading window for dealing in company securities remains closed from October 1, 2025 until 48 hours after the declaration of the unaudited financial results.",
            "Sentiment": "negative",
            "PublishDate": 1761841532128,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Receives Credit Rating Upgrade with Positive Outlook from India Ratings",
            "Summary": "India Ratings & Research has assigned 'IND A+/Positive' credit rating for Prism Johnson Limited's new bank loan facilities worth ₹300 crores. The rating agency also affirmed existing ratings at 'IND A+/Positive' for non-convertible debentures, long-term issuer rating, and bank loan facilities, while maintaining 'IND A1+' rating for commercial paper. The positive outlook reflects expected improvement in operating profitability in FY26 driven by better cement demand, increased realizations, and cost optimization measures. The company reduced net debt through asset monetization including sale of industrial premises to JSW Steel for ₹1.6 billion and income tax refund of ₹1.5 billion. Prism Johnson operates across three segments - cement (45% revenue), tiles and sanitaryware (35%), and ready-mix concrete (20%) with diversified business profile providing market position strength.",
            "Sentiment": "positive",
            "PublishDate": 1761242642052,
            "Source": "corporate_action"
        },
        {
            "Title": "Prism Johnson Selected as Preferred Bidder for Hinouti-2 Limestone Mining Lease",
            "Summary": "Prism Johnson has been selected as the preferred bidder for the Hinouti-2 limestone block mining lease. The mining lease covers 17.534 hectares and contains estimated reserves of 4.419 million tonnes of limestone.",
            "Sentiment": "positive",
            "PublishDate": 1758620823563,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Selected as Preferred Bidder for Limestone Mining Lease in Madhya Pradesh",
            "Summary": "Prism Johnson has been selected as the preferred bidder for the Piparhat Kubri limestone mining lease located in Madhya Pradesh. The company has secured this mining opportunity which will provide access to limestone resources in the region.",
            "Sentiment": "positive",
            "PublishDate": 1758511138099,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Limited Seeks Shareholder Approval to Raise ₹500 Crores Through Securities Issuance",
            "Summary": "Prism Johnson Limited conducted a postal ballot seeking shareholder approval for raising funds up to ₹500 crores through various securities issuance methods. The fundraising options include equity shares, convertible preference shares, non-convertible debt instruments with warrants, fully convertible debentures, partly convertible debentures, warrants, Global Depository Receipts, American Depository Receipts, Foreign Currency Convertible Bonds, and other eligible securities. The company can raise funds through public issues, private placements, qualified institutional placements, preferential issues, rights issues, or other permissible modes. The postal ballot notice was sent on August 20, 2025, to shareholders registered as of the cut-off date of August 15, 2025. Remote e-voting commenced on August 22, 2025, and concluded on September 20, 2025. Ms. Savita Jyoti was appointed as the scrutinizer for the postal ballot process, with results to be announced within 2 working days.",
            "Sentiment": "neutral",
            "PublishDate": 1758379723393,
            "Source": "corporate_action"
        },
        {
            "Title": "Prism Johnson Wins Preferred Bidder Status for Limestone Mining Lease in Madhya Pradesh",
            "Summary": "Prism Johnson Limited has been declared the 'Preferred Bidder' for a mining lease of the Piparhat Kubri Limestone Block in Madhya Pradesh by the Directorate of Geology and Mining, Mineral Resource Department, Government of Madhya Pradesh on September 19, 2025. The mining lease covers an area of 203.815 hectares in the villages of Piparhat & Kubri, Tehsil Maihar, District Maihar, with limestone reserves of 45.21 million tonnes. The company disclosed this development as part of its regulatory obligations.",
            "Sentiment": "positive",
            "PublishDate": 1758375843654,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Submits Investor Presentation for Analyst Meeting Scheduled September 16-19, 2025",
            "Summary": "Prism Johnson Limited has submitted an investor presentation to stock exchanges for an upcoming Analyst/Institutional Investor Meeting scheduled from September 16 to 19, 2025. The presentation highlights the company as one of India's leading integrated building materials companies with operations across cement, tiles, RMC, and construction chemicals. Key operational details include 5.60 MTPA cement capacity at Satna, 64.2 million m² tile capacity across 11 plants, and 91 RMC plants at 42 cities. The company reported revenue of ₹7,310.21 crores in FY25 with EBITDA of ₹360.83 crores. Recent developments include modernization of tiles plant at Vijaywada, acquisition of 50% stake in Sunbath Sanitary Private Limited, and commissioning of 22.5 MW WHRS and 10 MW solar plant at Satna. The presentation covers company overview, industry outlook, strengths, strategies, and financial summary.",
            "Sentiment": "neutral",
            "PublishDate": 1757921730755,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Increases Outsourced Cement Grinding Capacity to 1.37 MTPA Through RLJ Partnership",
            "Summary": "Prism Johnson Limited announced that RLJ Cement Limited has completed a capacity enhancement of 0.204 MTPA at its Mirzapur Plant in Uttar Pradesh. This expansion increases Prism Johnson's outsourced grinding capacity from 1.17 MTPA to 1.37 MTPA through its supply agreements with multiple grinding units. RLJ's total cement production capacity now stands at 0.50 MTPA following the enhancement. The companies operate under a Non-Exclusive Supply Agreement where RLJ manufactures and supplies cement according to Prism Cement's quality specifications for onward sale to Prism Johnson's customers.",
            "Sentiment": "positive",
            "PublishDate": 1757842166268,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Signs Cement Supply Agreement with Jabalpur Cement Industries",
            "Summary": "Prism Johnson has entered into a cement supply deal with Jabalpur Cement Industries. The cement supply will be sourced from Prism Johnson's Jogidhana plant.",
            "Sentiment": "positive",
            "PublishDate": 1755093230853,
            "Source": "order&deals"
        },
        {
            "Title": "Prism Johnson Increases Stake in Sentini Cermica to 90% Through ₹49.68 Crore Rights Issue",
            "Summary": "Prism Johnson has raised its stake in Sentini Cermica to 90% by investing ₹49.68 crore in a rights issue. This investment converts the joint venture into a subsidiary, strengthening Prism Johnson's presence in the ceramic tiles segment.",
            "Sentiment": "positive",
            "PublishDate": 1754670218769,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Appoints Savita Jyoti Associates as Secretarial Auditor for Five-Year Term",
            "Summary": "Prism Johnson Limited has appointed M/s. Savita Jyoti Associates as its Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-2030. The appointment was approved by shareholders at the company's 33rd Annual General Meeting held on August 7, 2025. Savita Jyoti Associates is a peer-reviewed practicing company secretaries firm based in Hyderabad, founded in 1991 with over 30 years of experience in secretarial and legal fields. The firm provides services including corporate law advisory, audit and certification, restructuring, capital market transactions, and regulatory representation to a diverse portfolio of clients ranging from large corporates to emerging businesses.",
            "Sentiment": "neutral",
            "PublishDate": 1754581215082,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prism Johnson Designates Senior VP as Senior Management Personnel, Approves ₹500 Crore Capital Raising Plan",
            "Summary": "Prism Johnson Limited's Board of Directors designated Mr. Nitesh Mathur, Senior Vice President of Johnson Bath Division, as Senior Management Personnel effective August 7, 2025. Mathur holds an MBA and B.E in Production & Industrial with 27 years of experience in sales and digital marketing. The Board also approved raising capital up to ₹500 crores through various instruments including equity shares, convertible preference shares, non-convertible debt instruments, warrants, and fully or partly convertible debentures. The capital can be raised through public issues, private placements, qualified institutional placements, preferential issues, rights issues, or other permissible modes in one or more tranches. The company will seek shareholder approval for the fund-raising initiative through postal ballot voting. A Fund Raising Committee has been constituted to decide the structure, pricing, terms and conditions of the securities issuance.",
            "Sentiment": "positive",
            "PublishDate": 1754552241031,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prism Johnson Reports Revenue Growth and Reduced Losses in Q1 Results",
            "Summary": "Prism Johnson reported Q1 revenue of 19 billion rupees, up from 17.3 billion rupees in the same period last year. The company's consolidated net loss narrowed to 56 million rupees compared to a loss of 183 million rupees year-over-year. EBITDA increased to 1.68 billion rupees from 1.33 billion rupees, while EBITDA margin improved to 8.76% from 7.56% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754550776231,
            "Source": "earnings"
        },
        {
            "Title": "Prism Johnson Limited Schedules Board Meeting to Consider Capital Raising Proposal",
            "Summary": "Prism Johnson Limited has scheduled a board meeting for August 7, 2025, to consider raising capital through various financial instruments. The proposal includes equity shares, convertible preference shares, non-convertible debt instruments with warrants, and other securities. The fundraising may be conducted through multiple methods including public issues, private placements, qualified institutions placements, preferential issues, or rights issues. The proposal is subject to regulatory approvals and shareholder consent. The company has closed its trading window from July 1, 2025, until 48 hours after the board meeting outcomes are made public.",
            "Sentiment": "neutral",
            "PublishDate": 1754313977437,
            "Source": "corporate_action"
        },
        {
            "Title": "Prism Johnson Plans Mirzapur Cement Plant Capacity Expansion by September 2025",
            "Summary": "Prism Johnson announced plans to increase the capacity of its Mirzapur cement plant from 1.08 MTPA to 1.288 MTPA by September 2025. The company also provided updates on its cement tie-up arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1753255389817,
            "Source": "stock"
        },
        {
            "Title": "Prism Johnson Increases Investment in Subsidiary Raheja QBE General Insurance",
            "Summary": "Prism Johnson has increased its investment in its subsidiary, Raheja QBE General Insurance, through a rights issue. No specific details about the amount of investment or the terms of the rights issue were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750862404000,
            "Source": "default"
        },
        {
            "Title": "Prism Johnson Reports Strong Q4 Financial Performance",
            "Summary": "Prism Johnson has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.87 billion rupees from 1.11 billion rupees in the previous year. The EBITDA margin also improved, rising to 8.9% from 5.44%. Revenue for Q4 grew slightly to 21 billion rupees from 20.4 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747296456000,
            "Source": "result"
        },
        {
            "Title": "Prism Johnson Reports Profitable Q4 FY2023",
            "Summary": "Prism Johnson Limited has reported a consolidated net profit of 1.2 billion rupees for the fourth quarter, compared to a loss of 300 million rupees in the same period last year. This marks a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1747296383000,
            "Source": "result"
        },
        {
            "Title": "RLJ Cement Expanding Capacity at Mirzapur Plant",
            "Summary": "Prism Johnson has announced that RLJ Cement is nearing completion of a 0.36 MTPA capacity enhancement at its Mirzapur plant. The enhanced capacity is expected to be operational by June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1743593157000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prism Johnson Declared Preferred Bidder for Limestone Mining Lease",
            "Summary": "Prism Johnson Limited has been declared the 'preferred bidder' for the mining lease of Jamodi Mahanna Sector I (Part B) & Sector II (Part B) limestone block. This designation suggests that the company is in a favorable position to secure the mining rights for this limestone resource.",
            "Sentiment": "positive",
            "PublishDate": 1742921088000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prism Johnson Appoints Sanjay Roy as New CEO",
            "Summary": "Prism Johnson has approved the appointment of Sanjay Roy as their new Chief Executive Officer. Roy brings experience from his previous role at ACC Limited, which is now part of the Adani Group.",
            "Sentiment": "neutral",
            "PublishDate": 1742810161000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prism Johnson Reports Significant Decline in Q3 EBITDA",
            "Summary": "Prism Johnson's third-quarter EBITDA has dropped substantially from 1.3 billion rupees to 560 million rupees year-over-year. The company's EBITDA margin also decreased significantly, falling from 7.76% to 2.85% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738827115000,
            "Source": "earnings"
        },
        {
            "Title": "Prism Johnson Reports Q3 Revenue Increase",
            "Summary": "Prism Johnson Limited has reported a revenue of 18.2 billion rupees for the third quarter, compared to 17 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738826783000,
            "Source": "earnings"
        },
        {
            "Title": "Prism Johnson Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Prism Johnson Limited has reported a substantial year-over-year increase in its consolidated net profit for the third quarter. The company's net profit rose to 460 million rupees, up from 115 million rupees in the same period last year, marking a significant improvement in financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1738826677000,
            "Source": "earnings"
        },
        {
            "Title": "Prism Johnson Approves Sale of Industrial Premises to JSW Steel",
            "Summary": "Prism Johnson has approved the sale of a portion of its industrial premises at its tile plant to JSW Steel. The deal is valued at 1.65 billion Indian rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738665162000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prism Johnson: Stock Exchanges Seek Clarification on Share Price Movement",
            "Summary": "Prism Johnson's share price dropped over 6% in morning trading as stock exchanges requested clarification on the stock's price movement.",
            "Sentiment": "negative",
            "PublishDate": 1736834455000,
            "Source": "normal_news"
        },
        {
            "Title": "Prism Johnson Reports Q2 Revenue Decline",
            "Summary": "Prism Johnson, a building materials company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 16.4 billion rupees, down from 17.3 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731481218000,
            "Source": "result"
        },
        {
            "Title": "Prism Johnson Reports Q2 Net Loss of 1.03 Billion Rupees",
            "Summary": "Prism Johnson, a building materials company, has reported a consolidated net loss of 1.03 billion rupees for the second quarter. This marks a significant decline from the 1.8 billion rupee profit recorded in the same period last year, indicating a substantial year-over-year change in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1731481171000,
            "Source": "result"
        }
    ]
}