{
    "Symbol": "PRUDMOULI",
    "ISIN": "INE024D01016",
    "News": [
        {
            "Title": "Prudential Sugar Corporation Approves Rs 53.1 Crore Investment for 76% Stake in Senatla EV Products",
            "Summary": "Prudential Sugar Corporation's board approved converting an MOU into a Share Subscription Agreement to acquire 76% equity stake in Senatla EV Products and its holding company for Rs 5,31,00,000. The company also approved its unaudited financial results for the quarter and half year ended September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763046604884,
            "Source": "earnings"
        },
        {
            "Title": "VAB Ventures Sells 4 Lakh Equity Shares of Prudential Sugar Corporation",
            "Summary": "VAB Ventures Limited sold 4,00,000 equity shares of Prudential Sugar Corporation Limited through open market transactions. The sale reduced VAB Ventures' shareholding from 89,13,038 shares (27.64%) to 85,13,038 shares (26.40%) in Prudential Sugar Corporation. VAB Ventures is identified as a promoter of Prudential Sugar Corporation. The transaction was executed on the open market, with Prudential Sugar Corporation's total equity share capital remaining at 3,22,52,000 equity shares of Rs. 10 each. The company has disclosed this transaction in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1758711113821,
            "Source": "corporate_action"
        },
        {
            "Title": "Prudential Sugar Corporation to Acquire 76% Stake in Electric Vehicle Manufacturer for Rs 4 Crores",
            "Summary": "Prudential Sugar Corporation Limited signed a Memorandum of Understanding to acquire a 76% equity stake in Senatla Innovative EV Components Private Limited for approximately Rs 4 crores. The target company manufactures electric two-wheelers and three-wheelers and operates sales networks in Telangana, Andhra Pradesh, and Tamil Nadu. Senatla EV Products Private Limited currently holds the entire Rs 1 crore equity in Senatla Innovative. The investment will be made through subscription of 31,66,666 new equity shares at Rs 12.64 per share. Payment is scheduled in three tranches by December 2025, with due diligence to be completed by September 30, 2025. Senatla Innovative projects achieving Rs 5 crores monthly turnover by March 2026 and Rs 10-15 crores per month by March 2027. Upon completion, Senatla Innovative will become a 76% subsidiary of Prudential Sugar Corporation, while the original promoter will retain 24% ownership.",
            "Sentiment": "positive",
            "PublishDate": 1757594252994,
            "Source": "order&deals"
        },
        {
            "Title": "Prudential Sugar Corporation Reports Q1 FY2026 Results with 26% Decline in Revenue",
            "Summary": "Prudential Sugar Corporation Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue of ₹838.43 lakhs compared to ₹3,493.96 lakhs in the same quarter last year, marking a significant decline. Net profit after tax stood at ₹128.57 lakhs versus ₹17.42 lakhs in the previous year quarter. On a consolidated basis, total revenue was ₹854.59 lakhs with net profit of ₹140.07 lakhs. The board meeting was held on August 13, 2025, where directors approved the financial statements and auditors' review report. The company also acknowledged an advisory letter from NSE regarding non-compliance under SEBI regulations and committed to ensuring prompt compliance in future.",
            "Sentiment": "neutral",
            "PublishDate": 1755084078979,
            "Source": "earnings"
        },
        {
            "Title": "Prudential Sugar Corporation Corrects Shareholding Details for Proposed Allottee in EGM Notice",
            "Summary": "Prudential Sugar Corporation Limited issued a clarification regarding an error in the shareholding details of proposed allottee Mr. Sanyam Dugar in their EGM notice for a preferential issue of equity shares. The company corrected the omitted information, showing Mr. Dugar's pre-issue holding as 4,000 shares (0.01%) and post-issue holding as 1,04,000 shares (0.23%) in the non-promoter category, with 1,00,000 shares proposed to be allotted. The company stated the omission was unintentional and assured stakeholders that necessary care will be taken in future communications to avoid such errors.",
            "Sentiment": "neutral",
            "PublishDate": 1753794538698,
            "Source": "corporate_action"
        }
    ]
}