{
    "Symbol": "PRUDENT",
    "ISIN": "INE00F201020",
    "News": [
        {
            "Title": "Prudent Corporate Posts Strong Q3FY26 Results",
            "Summary": "Prudent Corporate Advisory Services reports 30.1% YoY growth in Q3FY26 net profit to ₹5,505.97 lakhs, driven by 29.9% revenue increase to ₹33,254.12 lakhs and strategic acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1769590422640,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prudent Corporate Board Meet Set for Jan 28, 2026",
            "Summary": "Prudent Corporate Advisory Services schedules board meeting on January 28, 2026 to approve Q3FY26 unaudited financial results. Trading window closed from Jan 1 till 48 hours post results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1768908049185,
            "Source": "co_actions_results"
        },
        {
            "Title": "Wasatch Advisors LP reduces stake in Prudent Corporate",
            "Summary": "Wasatch Advisors LP sold 2,982 shares of Prudent Corporate Advisory Services Ltd through open market transaction on January 7, 2026, reducing its shareholding from 3.33% to 3.29%.",
            "Sentiment": "neutral",
            "PublishDate": 1767941293094,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prudent Corporate Advisory Seeks Shareholder Approval for Rs 75 Lakh Director Remuneration",
            "Summary": "Prudent Corporate Advisory Services Limited has issued a postal ballot notice seeking shareholder approval for payment of commission up to Rs 75 lakh to Mr. Chirag Ashwinkumar Shah, Non-Executive Non-Independent Director, for financial year 2025-26. The proposed commission may exceed 50% of total annual remuneration payable to all other Non-Executive Directors, requiring special resolution approval. The remote e-voting period runs from November 12, 2025 to December 11, 2025. Mr. Shah, a Chartered Accountant with over 20 years of insurance and financial experience, has been associated with the Prudent Group since 2004 and serves on multiple board committees. He did not draw any remuneration from the company during 2024-25 but received Rs 201 lakh from wholly-owned subsidiary Gennext Insurance Brokers Private Limited. The Board approved this proposal based on his significant contributions to strategic decision-making and increased responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1762854901143,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prudent Corporate Advisory Reports 17% YoY AUM Growth in Q2 FY26 Earnings Call",
            "Summary": "Prudent Corporate Advisory Services held its Q2 FY26 earnings conference call on November 6, 2025. The company reported quarterly average AUM growth of 17% year-on-year and 8% quarter-on-quarter, reaching approximately INR 119,000 crores (excluding Indus AUM). Current AUM stands at INR 127,000 crores. Equity AUM grew 13.2% year-on-year to INR 117,650 crores, driven by strong net sales despite negative mark-to-market impact. Monthly SIP book reached INR 1,085 crores with INR 210 crores added over 12 months. The company completed the Indus acquisition, expected to deliver INR 22-23 crores in annual mutual fund commission. Management discussed potential impacts from SEBI's draft consultation paper on mutual fund expense ratios and GST changes affecting insurance business. On insurance, retail health fresh premium grew 33% year-on-year to INR 162.5 crores. The company granted 130,945 ESOP options to 388 employees, expecting a P&L impact of INR 7.10 crores over 12 months. Treasury corpus stands at INR 480 crores for future strategic opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1762811125175,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corporate Advisory Services Reports 24% Rise in Quarterly Profit",
            "Summary": "Prudent Corporate Advisory Services Limited announced its quarterly results for the period ended September 30, 2025. The company reported a consolidated profit after tax of ₹5,353.70 lakhs compared to ₹4,301.87 lakhs in the same quarter last year, representing a 24% increase. Total revenue from operations grew to ₹31,979.03 lakhs from ₹28,607.57 lakhs year-over-year. For the six-month period, consolidated profit after tax increased to ₹10,571.58 lakhs from ₹9,564.52 lakhs in the previous year. The company operates in distribution and sale of financial products including mutual funds, bonds, fixed deposits, structured products, stockbroking, and insurance within India. The company has entered into a business transfer agreement to acquire the mutual fund distribution business of Indus Capital for ₹123.75 crores, with the acquisition date determined as October 1, 2025. Additionally, the company granted 1,30,945 employee stock options at a grant price of ₹2,632 per option under its employee stock option scheme.",
            "Sentiment": "positive",
            "PublishDate": 1762285455465,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corporate Advisory Targets 40% AUM Growth With ₹1.2 Lakh Crore Assets",
            "Summary": "Prudent Corporate Advisory has set a guidance for 40% Assets Under Management (AUM) compound annual growth rate from FY20 to FY25, with total AUM of ₹1.2 lakh crore. The company is expanding its operations through technology-driven wealth distribution, insurance, and stockbroking services. The expansion strategy utilizes a network of over 35,000 channel partners and 142 locations to increase retail market penetration.",
            "Sentiment": "positive",
            "PublishDate": 1762268752865,
            "Source": "stock"
        },
        {
            "Title": "Prudent Corporate Reports Q2 Net Profit Growth to 535M Rupees",
            "Summary": "Prudent Corporate reported Q2 consolidated net profit of 535 million rupees, up from 515 million rupees year-over-year. Revenue increased to 3.2 billion rupees from 2.8 billion rupees in the same period last year. EBITDA rose to 722 million rupees from 687 million rupees year-over-year, though EBITDA margin declined to 22.57% from 24.16% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762259562966,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corporate Targets Rs 2,500 Crore SIP Book by FY29, Acquires Indus Capital",
            "Summary": "Prudent Corporate Advisory Services aims to grow its SIP book from the current Rs 1,060 crore to Rs 2,500 crore within three years. The financial product distributor crossed Rs 1,000 crore in June 2025 with 35 lakh live SIPs and targets Rs 1,200 crore by March 2026. To support this growth, the company acquired Indus Capital, a mutual fund distribution company with over Rs 2,050 crore AUM serving 3,500 families. Chairman Sanjay Shah highlighted the strategic benefits, noting B2C margins of 70% versus B2B margins of 30%. The acquisition, funded through internal cash reserves, is expected to complete by September 2025. Prudent Corporate shares closed at Rs 2,956.10, down 1.29%.",
            "Sentiment": "positive",
            "PublishDate": 1758166873764,
            "Source": "stock"
        },
        {
            "Title": "Prudent Corporate Acquires Indus Capital's Mutual Fund Business Worth ₹2,030 Crore",
            "Summary": "Prudent Corporate has announced the complete transfer of Indus Capital's mutual fund distribution business. The acquired business has assets under management of ₹2,030 crore as of August 30, 2025. The transaction involves Prudent Corporate purchasing Indus Capital's mutual fund distribution operations as part of a sale of current operations.",
            "Sentiment": "positive",
            "PublishDate": 1757321887898,
            "Source": "order&deals"
        },
        {
            "Title": "Prudent Corporate Advisory Services Reports 17.8% Revenue Growth in Q1 FY26 with Strong AUM Expansion",
            "Summary": "Prudent Corporate Advisory Services Limited reported consolidated revenue growth of 17.8% year-on-year in Q1 FY26, with consolidated profit after tax rising 17.1% to INR51.8 crores. The company's assets under management (AUM) grew 8.3% sequentially and 23.4% year-on-year to INR110,194 crores daily average during the quarter. Equity AUM increased 22% year-on-year to INR113,950 crores, driven by net equity sales of INR12,635 crores and mark-to-market gains of INR8,166 crores. The company's SIP book reached INR996 crores and has since crossed INR1,000 crores. Prudent launched insurance distribution as a corporate agent, generating INR11 crores in insurance income during the quarter. The company maintains its yield guidance of 90 basis points for FY26 despite repricing by SBI and Kotak affecting revenues. Employee costs are expected to increase 20% annually due to 15-16% salary hikes. The company opened 7 new branches, bringing the total to 139-140 branches, and recruited over 900 new distributors in the quarter. Management indicated treasury reserves exceed INR500 crores for potential acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1754461275762,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corporate Advisory Reports 40% PAT Growth with ₹1.4L Cr Mutual Fund AUM",
            "Summary": "Prudent Corporate Advisory has reported a 40% surge in profit after tax (PAT) while maintaining mutual fund assets under management (AUM) of ₹1.4 lakh crore. The company is pursuing a digital-led growth strategy focused on Independent Financial Advisors (IFA) and implementing platform integration to expand its reach among India's retail investors.",
            "Sentiment": "positive",
            "PublishDate": 1753887957333,
            "Source": "stock"
        },
        {
            "Title": "Prudent Corporate Reports 17% Growth in Q1 Net Profit to 518 Million Rupees",
            "Summary": "Prudent Corporate announced its Q1 consolidated net profit increased to 518 million rupees compared to 442 million rupees in the same period last year. The company's revenue also grew to 2.94 billion rupees from 2.5 billion rupees year-over-year, representing an 18% increase in revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1753877610583,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corporate Advisory Services Schedules Q1FY26 Results Conference Call for July 31, 2025",
            "Summary": "Prudent Corporate Advisory Services Ltd will hold a conference call to discuss Q1FY26 financial results on Thursday, July 31, 2025 at 11:00 AM IST. The call will be hosted by B&K Securities and will include management representatives: Chairman & Managing Director Sanjay Shah, CEO & Whole Time Director Shirish Patel, Non-executive Director Chirag Shah, Chief Financial Officer Chirag Kothari, and Investor Relations representative Parth Parekh. The company has provided dial-in numbers for domestic and international participants, along with online registration details for investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1753435506435,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corporate Advisory Services: Q4 Profit Rises 16%, FY25 Revenue Jumps 37%",
            "Summary": "Prudent Corporate Advisory Services reported a 16% increase in Q4 net profit to ₹51 crore. FY25 net profit rose 41% to ₹196 crore, with revenue up 37% to ₹1,104 crore. Equity AUM grew 25% to ₹1 lakh crore in FY25. Monthly SIP book increased 35% to ₹981 crore in March.",
            "Sentiment": "positive",
            "PublishDate": 1747119963000,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corporate Announces Dividend",
            "Summary": "Prudent Corporate has recommended a dividend of 2.5 rupees per share to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747060504000,
            "Source": "result"
        },
        {
            "Title": "Prudent Corporate Reports Q4 Financial Results",
            "Summary": "Prudent Corporate announced its Q4 financial results. The company's EBITDA increased to 688 million rupees from 608 million rupees year-over-year. However, the EBITDA margin decreased slightly to 24.29% from 25.36%. The consolidated net profit rose to 517 million rupees from 445.7 million rupees year-over-year and 482 million rupees quarter-over-quarter. Revenue for Q4 grew to 2.8 billion rupees from 2.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747060456000,
            "Source": "result"
        },
        {
            "Title": "Prudent Corporate Advisory Services: SEBI Approves Promoter's Rs 33 Crore Share Gift to Employees",
            "Summary": "Sanjay Shah, promoter of Prudent Corporate Advisory Services, received SEBI approval to gift 1,75,000 equity shares worth Rs 33 crore to 650 employees without classifying them as part of the promoter group. This one-time exemption allows Shah to distribute shares to long-serving employees as a 25th anniversary gesture.",
            "Sentiment": "positive",
            "PublishDate": 1741854888000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prudent Corporate Advisory Services: CMD Gifts ₹34 Crore in Shares to Employees",
            "Summary": "Sanjay Shah, CMD of Prudent Corporate Advisory Services, gifted 175,000 equity shares worth ₹34 crore to 650 employees and personal staff, including household help and drivers, marking his 25th year in business. The gift comes with no retention conditions and has received necessary regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1741842995000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prudent Corporate Advisory Services: SEBI Approves Promoter's Share Gift to Employees",
            "Summary": "Sanjay Shah, promoter of Prudent Corporate Advisory Services, received SEBI approval to gift ₹33 crore worth of shares to 650 employees without reclassifying them as part of the promoter group. This unique move allows Shah to distribute 0.4% of his stake to celebrate 25 years in business.",
            "Sentiment": "positive",
            "PublishDate": 1741740227000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Prudent Corporate Advisory Services: 45% Revenue Growth, 53% Profit Surge in Q3 FY2024",
            "Summary": "Prudent Corporate Advisory Services reported a 45% YoY revenue growth to Rs 820.5 crore in Q3 FY2024. Profit after tax increased by 53% YoY to Rs 143.9 crore. The growth was driven by a 49% rise in mutual fund AUM and a 24% increase in insurance vertical revenues. SIP book grew 44% YoY to Rs 935 crore, with a 3.5% market share of industry SIP flows.",
            "Sentiment": "positive",
            "PublishDate": 1738077704000,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corporate Advisory: Targets ₹1,000 Crore in SIPs by 2025",
            "Summary": "Prudent Corporate Advisory aims to achieve ₹1,000 crore in Systematic Investment Plans (SIPs) by March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1738050901000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prudent Corporate Advisory Services Reports Strong Q3 Financial Results",
            "Summary": "Prudent Corporate Advisory Services has announced its Q3 consolidated financial results. The company's net profit increased to 482 million rupees, up from 357 million rupees year-over-year. This also represents an improvement from the previous quarter's 515 million rupees. Revenue for Q3 rose to 2.85 billion rupees, compared to 2.1 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738023440000,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corporate Advisory Services Reports Strong Q3 Financial Results",
            "Summary": "Prudent Corporate Advisory Services has announced its Q3 financial results. The company's consolidated net profit increased to 482 million rupees, up from 357 million rupees year-over-year. Compared to the previous quarter, net profit decreased slightly from 515 million rupees. Revenue for Q3 grew to 2.85 billion rupees, a significant increase from 2.1 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737980991000,
            "Source": "earnings"
        },
        {
            "Title": "Prudent Corp: AUM Growth and Insurance Cross-Sales Drive Earnings Upgrades",
            "Summary": "Prudent Corp's Q2 review shows an increase in Assets Under Management (AUM) due to mark-to-market gains. Insurance cross-sales have led to earnings upgrades, as reported by ICICI Securities.",
            "Sentiment": "positive",
            "PublishDate": 1730791519000,
            "Source": "result"
        },
        {
            "Title": "Prudent Corporate Targets INR 1,000 Crore Setting by March 2025",
            "Summary": "Prudent Corporate has announced its goal to achieve a setting of INR 1,000 crore by March 2025. The company also indicated that in the near term, the growth of their direct business is expected to outpace the growth of their regular business.",
            "Sentiment": "positive",
            "PublishDate": 1730689153000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prudent Corporate Surpasses ₹1 Lakh Crore AUM Milestone",
            "Summary": "Prudent Corporate has announced that its Assets Under Management (AUM) crossed ₹1 lakh crore on July 26th. This milestone was achieved approximately 18 months ahead of the company's projected timeline, as revealed during a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1730689013000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prudent Corporate Advisory Services Projects Strong SIP Growth",
            "Summary": "Prudent Corporate Advisory Services reports a monthly Systematic Investment Plan (SIP) flow of Rs 726 crore as of March 2024. The company anticipates gross flows from SIPs to reach Rs 8,700 crores in FY25, representing 10% of the FY25 opening Assets Under Management (AUM). This projection was shared in an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1730296147000,
            "Source": "corporate_action"
        },
        {
            "Title": "Prudent Corporate Reports Strong Q2 Financial Performance",
            "Summary": "Prudent Corporate announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 687 million rupees from 432 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 24.16% from 22.88% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730288173000,
            "Source": "result"
        },
        {
            "Title": "Prudent Corporate Reports Q2 Revenue Growth",
            "Summary": "Prudent Corporate has announced its Q2 revenue, which stands at 2.8 billion rupees, showing a significant increase from 1.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730288162000,
            "Source": "result"
        },
        {
            "Title": "Prudent Corporate Reports Q2 Profit Increase",
            "Summary": "Prudent Corporate has announced its Q2 consolidated net profit of 515 million rupees, showing a significant year-over-year increase from 304 million rupees. The company also reported a quarter-over-quarter improvement from 442 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730288152000,
            "Source": "result"
        }
    ]
}