{
    "Symbol": "PSB",
    "ISIN": "INE608A01012",
    "News": [
        {
            "Title": "Punjab & Sind Bank EGM Approves ₹3000 Cr QIP",
            "Summary": "Punjab & Sind Bank shareholders approved raising ₹3000 crore through QIP and appointed Jitendra Asati as Government nominee director at EGM held on January 21, 2026. Both resolutions passed with over 99% approval.",
            "Sentiment": "positive",
            "PublishDate": 1768997067520,
            "Source": "co_actions_results"
        },
        {
            "Title": "Punjab & Sind Bank Q3FY26 Net Profit Rises 19.15%",
            "Summary": "Punjab & Sind Bank reported strong Q3FY26 results with net profit growing 19.15% YoY to ₹336.42 crore. Operating profit increased 22.75% while asset quality improved significantly with gross NPA declining to 2.60%.",
            "Sentiment": "positive",
            "PublishDate": 1768828922956,
            "Source": "co_actions_results"
        },
        {
            "Title": "Punjab & Sind Bank Q3 Net Profit Rises 20% YoY",
            "Summary": "Punjab & Sind Bank reported strong Q3 performance with net profit growing 20% YoY to ₹3.36 billion, while asset quality improved with GNPA and NNPA ratios declining quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768795272870,
            "Source": "co_actions_results"
        },
        {
            "Title": "CBI books Punjab & Sind Bank branch head in ₹1,084 cr scam",
            "Summary": "Central Bureau of Investigation registers FIR against bank branch head and 18 others for operating mule accounts that facilitated money laundering worth over ₹1,000 crore through forged documents.",
            "Sentiment": "negative",
            "PublishDate": 1768572821913,
            "Source": "stocks"
        },
        {
            "Title": "Punjab & Sind Bank Q3FY26 Earnings Call on Jan 20",
            "Summary": "Punjab & Sind Bank schedules earnings call for January 20, 2026 at 5:00 PM to discuss Q3FY26 financial results with analysts and investors following board meeting on January 17.",
            "Sentiment": "neutral",
            "PublishDate": 1768479672717,
            "Source": "co_actions_results"
        },
        {
            "Title": "Punjab & Sind Bank Board Meet Set for Jan 17, 2026",
            "Summary": "Punjab & Sind Bank has scheduled a board meeting on January 17, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed until January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768304728894,
            "Source": "co_actions_results"
        },
        {
            "Title": "PSB Q3 Update: Total business up 12% to ₹2.49 lakh cr",
            "Summary": "Punjab & Sind Bank reported total business of ₹2.49 lakh crore for Q3, with deposits at ₹1.39 lakh crore (9.27% YoY) and advances at ₹1.10 lakh crore (15.25% YoY). CASA ratio improved to 31.02%.",
            "Sentiment": "positive",
            "PublishDate": 1767275225799,
            "Source": "co_actions_results"
        },
        {
            "Title": "Punjab & Sind Bank schedules EGM for QIP approval",
            "Summary": "Punjab & Sind Bank has scheduled an Extraordinary General Meeting for January 21, 2026, to seek shareholder approval for raising equity capital up to ₹3,000 crores through Qualified Institutional Placement.",
            "Sentiment": "positive",
            "PublishDate": 1767075507522,
            "Source": "co_actions_results"
        },
        {
            "Title": "Punjab & Sind Bank Re-appoints Four Statutory Central Auditors for FY 2025-26",
            "Summary": "Punjab & Sind Bank has re-appointed four existing audit firms as Statutory Central Auditors for FY 2025-26 following Reserve Bank of India approval, with M/s Gupta Sharma Associates among the appointed firms. The re-appointments ensure continuity in the bank's statutory audit process and compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765198079093,
            "Source": "corporate_governance"
        },
        {
            "Title": "Punjab & Sind Bank Reports 22.92% Net Profit Growth in Q2, Approves Rs 5,000 Crore Capital Raising Plan",
            "Summary": "Punjab & Sind Bank reported net profit of Rs 295 crore for Q2, marking a 22.92% increase. Total business grew 12.19% year-on-year to Rs 2,41,272 crore with deposits rising 9.42% to Rs 1,35,706 crore. Advances increased 15.97% year-on-year to Rs 1,05,566 crore. Asset quality improved with Gross NPA at 2.92% and Net NPA at 0.83%. The board approved capital raising of Rs 3,000 crore equity and Rs 2,000 crore bonds over one year. The bank expanded digital lending capabilities, with 60% of vehicle loans and 35% of home loans now processed digitally. Management plans to open 200 branches over the next two years and has received board approval for a Gift City branch. Operating profit increased 10.26% while slippages were contained at Rs 164 crore. The bank targets 15-16% advance growth and aims to increase RAM portfolio to 57-58% by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1761654370956,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Targets Double-Digit Credit Growth with Focus on Retail and MSME Segments",
            "Summary": "Punjab & Sind Bank has set a target for double-digit credit growth, focusing on retail, MSME, and RAM (Retail, Agriculture, and MSME) segments. The bank is guiding for continued net interest margin improvement, higher current account and savings account ratio, and stronger digital adoption to expand profitability in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1760639449738,
            "Source": "stock"
        },
        {
            "Title": "Punjab & Sind Bank Approves Q2 2025 Results and Plans Rs 8,000 Crore Capital Raising",
            "Summary": "Punjab & Sind Bank's Board approved quarterly financial results for the period ended September 30, 2025. The bank reported a net profit of Rs 294.52 crore for the quarter, compared to Rs 239.59 crore in the same period last year. The Board also approved plans to raise capital up to Rs 5,000 crore through various instruments by March 2027, including Rs 3,000 crore through equity shares via QIP/FPO/Right Issue and Rs 2,000 crore through Basel III compliant bonds. Additionally, the bank plans to raise Rs 3,000 crore through long-term infrastructure bonds. The bank's gross non-performing assets stood at Rs 3,081.89 crore, representing 4.21% of gross advances, while net NPAs were at 1.46%. The capital adequacy ratio was reported at 17.19% under Basel III norms.",
            "Sentiment": "positive",
            "PublishDate": 1760617494454,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Schedules Board Meeting to Approve Q2 Results and Rs 5,000 Crore Capital Raising Plan",
            "Summary": "Punjab & Sind Bank will hold a board meeting on October 16, 2025, to approve unaudited financial results for the quarter and half-year ended September 30, 2025. The board will also consider raising up to Rs 5,000 crore in capital by March 2027 through multiple instruments: Rs 3,000 crore via equity shares through QIP/FPO/Rights Issue, Rs 2,000 crore through Basel III compliant Additional Tier I or Tier II bonds, and Rs 3,000 crore in Long Term Infrastructure Bonds. The trading window for designated persons remains closed from October 1, 2025, until October 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760361260160,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank Reports Strong Q2 FY26 Growth with Total Business Rising 12.3% YOY",
            "Summary": "Punjab & Sind Bank reported total business of ₹2,41,450 crores in Q2 FY26, representing a 12.3% year-on-year increase and 4.5% quarter-on-quarter growth. The bank's deposits reached ₹1,35,708 crores, showing a 9.4% year-on-year rise and 3.5% quarter-on-quarter increase.",
            "Sentiment": "positive",
            "PublishDate": 1759580124134,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Completes 15th AGM, Approves Dividend and Key Appointments",
            "Summary": "Punjab & Sind Bank held its 15th Annual General Meeting on August 5, 2025, via video conferencing with 62 shareholders in attendance. The bank approved all seven agenda items with requisite majority, including adoption of audited financial statements for 2024-25, declaration of dividend at Rs. 0.07 per equity share (0.70% of face value), and several key appointments. Shareholders approved the appointment of Rajeeva as Executive Director, Vivek Srivastava as RBI Nominee Director, reappointment of Shankar Lal Agarwal as Part-time Non-Official Director, and extension of Swarup Kumar Saha's tenure as MD & CEO. The meeting also approved the appointment of R S Kathuria & Co as Secretarial Auditor for five years from 2025-26 to 2029-30. The dividend will be paid within 30 days to shareholders on record as of July 29, 2025. All resolutions received overwhelming support with approval rates exceeding 99% across all items.",
            "Sentiment": "positive",
            "PublishDate": 1754404032999,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank Identifies Suspected Money Mule Transactions Through Surveillance",
            "Summary": "Punjab & Sind Bank detected suspected money mule transactions during routine surveillance activities. The bank confirmed that these findings have no material impact on its financial position. The bank emphasized its proactive approach to compliance monitoring.",
            "Sentiment": "neutral",
            "PublishDate": 1753803547396,
            "Source": "stock"
        },
        {
            "Title": "Punjab & Sind Bank Reports 70% Jump in Operating Profit, 48% Rise in Net Profit for Q1 FY26",
            "Summary": "Punjab & Sind Bank reported strong quarterly results with operating profit increasing 70.35% to Rs.540 crore and net profit rising 47.80% to Rs.269 crore. Total business grew 10.94% to Rs.2,31,132 crore, comprising deposits of Rs.1,31,182 crore (8.78% growth) and advances of Rs.1,00,000 crore (13.92% growth). Asset quality improved with Gross NPA declining to 3.34% and Net NPA to 0.91%, while slippage ratio remained low at 0.21%. The bank maintained strong capitalization at 17.90% and provision coverage ratio at 91.77%. RAM advances grew 17.18% with retail credit expanding 29%. Treasury operations contributed Rs.208 crore profit. The bank expanded its network with 4 new zonal offices and plans to open over 200 branches. Management confirmed guidance targets remain intact including 15-16% credit growth and 8-10% deposit growth for FY26. CASA ratio stood at 30.6% while retail term deposits showed traction with 11.43% year-on-year growth. The bank has a co-lending portfolio of over Rs.3,000 crore and launched digital lending products for housing, vehicles, MSME and agriculture segments.",
            "Sentiment": "positive",
            "PublishDate": 1753795212380,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Shares Audio Recording of Q1 FY2026 Analyst Meet",
            "Summary": "Punjab & Sind Bank conducted an analyst meet on July 22, 2025, to discuss financial results for the first quarter ended June 30, 2025. The bank has made the audio recording of the meeting available on their website at https://punjabandsindbank.co.in/content/analyst-meet-recordings. This disclosure was made to stock exchanges BSE and NSE in compliance with SEBI regulations, with the communication signed by Company Secretary Saket Mehrotra.",
            "Sentiment": "neutral",
            "PublishDate": 1753197971833,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Publishes Q1 FY26 Financial Results in Newspapers",
            "Summary": "Punjab & Sind Bank published its reviewed unaudited financial results for the quarter ended June 30, 2025 in various newspapers including Financial Express, Business Line, and Jansatta on July 20, 2025. The quarterly results were approved by the Board of Directors in their meeting held on July 19, 2025. The bank informed stock exchanges BSE and NSE about the publication of these results through a formal communication from Company Secretary Saket Mehrotra.",
            "Sentiment": "neutral",
            "PublishDate": 1753160684671,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Reports Lower Fresh Slippages in Q1",
            "Summary": "Punjab & Sind Bank's fresh slippages decreased to 2 billion rupees in Q1, down from 2.7 billion rupees in the previous quarter, representing a quarter-on-quarter improvement of 0.7 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1753015524349,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Reports Strong Q1 Performance with Reduced NPAs and Higher Profits",
            "Summary": "Punjab & Sind Bank reported net profit of 2.7 billion rupees in Q1, up from 1.8 billion rupees year-over-year. Revenue increased to 29 billion rupees from 26.5 billion rupees compared to the same period last year. The bank's asset quality improved with provisions for non-performing assets dropping significantly to 227 million rupees from 3.2 billion rupees quarter-over-quarter. Gross NPA ratio decreased to 3.34% from 3.38% sequentially, while Net NPA ratio fell to 0.91% from 0.96% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752920641868,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Reports Growth in Advances and Deposits",
            "Summary": "Punjab & Sind Bank has announced provisional figures showing a 13.91% increase in gross advances and an 8.78% rise in total deposits as of June 30. The bank has not provided specific monetary values or comparisons to previous periods.",
            "Sentiment": "positive",
            "PublishDate": 1751544605000,
            "Source": "default"
        },
        {
            "Title": "Punjab & Sind Bank: Q1 Business Grows 11% YoY, Advances Near ₹1 Lakh Crore",
            "Summary": "Punjab & Sind Bank reported a 10.9% YoY increase in total business for Q1 FY26, reaching ₹2.31 lakh crore. Gross advances grew 13.9% to ₹99,946 crore, while deposits rose 8.8% to ₹1.31 lakh crore. The bank's credit-deposit ratio improved to 76.19%.",
            "Sentiment": "positive",
            "PublishDate": 1751543829000,
            "Source": "result"
        },
        {
            "Title": "Punjab & Sind Bank: CEO Swarup Kumar Saha's Tenure Extended to 2027",
            "Summary": "The government has extended Swarup Kumar Saha's tenure as MD and CEO of Punjab & Sind Bank until February 28, 2027, or until further notice. This extension goes beyond his initial three-year term that was set to end on June 2, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1748886632000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Punjab & Sind Bank: Q4 Profit Doubles, Asset Quality Improves",
            "Summary": "Punjab & Sind Bank reported a net profit of ₹313 crore in Q4 FY25, up from ₹139 crore year-over-year. Total income rose to ₹3,836 crore. Gross NPAs decreased to 3.38% from 5.43% last year. The bank's board recommended a dividend of 0.07 paise per equity share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1745997764000,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Reports Strong Q4 Financial Results",
            "Summary": "Punjab & Sind Bank has reported significant improvements in its Q4 financial performance. Net profit increased to 3.13 billion rupees, up from 1.39 billion rupees year-over-year and 2.82 billion rupees quarter-over-quarter. Interest earned rose to 31.6 billion rupees from 24.81 billion rupees year-over-year. Provisions increased to 3.74 billion rupees from 1.09 billion rupees quarter-over-quarter. The bank's asset quality improved with Gross Non-Performing Assets (GNPA) decreasing to 3.38% from 3.83% quarter-over-quarter, and Net Non-Performing Assets (NNPA) reducing to 0.96% from 1.25% quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745972688000,
            "Source": "default"
        },
        {
            "Title": "Punjab & Sind Bank Reports Improved Asset Quality in Q4",
            "Summary": "Punjab & Sind Bank has reported improved asset quality for the fourth quarter. The Gross Non-Performing Assets (GNPA) ratio decreased to 3.38% from 3.83% in the previous quarter. The Net Non-Performing Assets (NNPA) ratio also improved, falling to 0.96% from 1.25%. However, provisions increased significantly to 3.74 billion rupees, up from 1.09 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745945998000,
            "Source": "result"
        },
        {
            "Title": "Punjab & Sind Bank Reports Strong Q4 Financial Results",
            "Summary": "Punjab & Sind Bank has announced its Q4 financial results, showing significant year-over-year growth. The bank's interest earned increased to 31.6 billion rupees from 24.81 billion rupees in the previous year. Net profit for Q4 rose to 3.13 billion rupees, up from 1.39 billion rupees year-over-year and 2.82 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745945836000,
            "Source": "result"
        },
        {
            "Title": "Punjab & Sind Bank to Consider Q4 Results",
            "Summary": "Punjab & Sind Bank has announced that it will consider its fourth quarter (Q4) financial results on April 29.",
            "Sentiment": "neutral",
            "PublishDate": 1745415308000,
            "Source": "default"
        },
        {
            "Title": "Punjab & Sind Bank Reports Growth in Gross Advances and Total Deposits",
            "Summary": "Punjab & Sind Bank has announced that its gross advances have reached 1 trillion rupees, marking a 16.39% year-over-year increase. Additionally, the bank's total deposits stand at 1.3 trillion rupees as of March 31.",
            "Sentiment": "positive",
            "PublishDate": 1743639099000,
            "Source": "result"
        },
        {
            "Title": "Punjab & Sind Bank Reports Growth in Advances and Deposits",
            "Summary": "Punjab & Sind Bank has announced its financial performance as of March 31. The bank's gross advances have reached 1 trillion rupees, marking a 16.39% year-over-year increase. Additionally, the bank's total deposits stand at 1.3 trillion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743600322000,
            "Source": "result"
        },
        {
            "Title": "Punjab & Sind Bank Closes QIP, Sets Issue Price at 38.37 Rupees per Share",
            "Summary": "Punjab & Sind Bank has concluded its Qualified Institutional Placement (QIP) and set the issue price at 38.37 rupees per share. The QIP is a method used by listed companies to raise capital from qualified institutional buyers. This move suggests that the bank is seeking to strengthen its capital base, potentially to support growth or meet regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1743120538000,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank Concludes Qualified Institutional Placement",
            "Summary": "Punjab & Sind Bank has closed its Qualified Institutional Placement (QIP) and set the issue price at 38.37 rupees per share. This corporate action aims to raise capital through the sale of shares to qualified institutional buyers.",
            "Sentiment": "neutral",
            "PublishDate": 1743094286000,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank Approves Qualified Institutions Placement",
            "Summary": "Punjab & Sind Bank has authorized the opening of an issue through a Qualified Institutions Placement (QIP). The bank has set the floor price for the issue at 40.38 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1742861347000,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank Initiates Qualified Institutions Placement",
            "Summary": "Punjab & Sind Bank has authorized the opening of a Qualified Institutions Placement (QIP) issue. The bank has set the floor price for the issue at 40.38 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1742828600000,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Reaffirms Punjab & Sind Bank's Certificate of Deposits Rating at A1+",
            "Summary": "Credit rating agency ICRA has reaffirmed Punjab & Sind Bank's Certificate of Deposits rating at A1+. This rating indicates a very strong degree of safety regarding timely payment of financial obligations and carries the lowest credit risk.",
            "Sentiment": "positive",
            "PublishDate": 1741651330000,
            "Source": "corporate_governance"
        },
        {
            "Title": "ICRA Reaffirms Punjab & Sind Bank's Certificate of Deposits Rating at A1+",
            "Summary": "ICRA, a credit rating agency, has reaffirmed Punjab & Sind Bank's Certificate of Deposits rating at A1+. This rating indicates a very strong degree of safety regarding timely payment of financial obligations and carries the lowest credit risk.",
            "Sentiment": "positive",
            "PublishDate": 1741622000000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Punjab & Sind Bank: Plans ₹2,000 Crore QIP in Current Quarter",
            "Summary": "Punjab & Sind Bank aims to raise ₹2,000 crore through QIP in the ongoing quarter. The move will reduce government holding by 3-4% and improve capital adequacy ratio. The bank recently raised ₹3,000 crore through infrastructure bonds and reported a two-fold jump in Q3 net profit to ₹282 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737274512000,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank Reports Strong Q3 FY24 Results",
            "Summary": "Punjab & Sind Bank has announced its Q3 financial results, showing significant improvement. The bank's net profit increased to 2.82 billion rupees from 1.14 billion rupees year-over-year. Interest earned rose to 29.3 billion rupees from 25 billion rupees in the same period last year. The bank's asset quality improved, with Gross Non-Performing Assets (GNPA) decreasing to 3.83% from 4.21% quarter-on-quarter, and Net Non-Performing Assets (NNPA) reducing to 1.25% from 1.46% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1736985904000,
            "Source": "earnings"
        },
        {
            "Title": "Punjab & Sind Bank Reports Strong Q3 FY24 Results",
            "Summary": "Punjab & Sind Bank has reported a significant increase in net profit for Q3, rising to 2.82 billion rupees from 1.14 billion rupees year-over-year. Interest earned increased to 29.3 billion rupees from 25 billion rupees. The bank's asset quality improved, with Gross Non-Performing Assets (GNPA) decreasing to 3.83% from 4.21% quarter-on-quarter, and Net Non-Performing Assets (NNPA) reducing to 1.25% from 1.46%.",
            "Sentiment": "positive",
            "PublishDate": 1736948532000,
            "Source": "earnings"
        },
        {
            "Title": "Five Public Sector Banks to Raise Funds via QIP",
            "Summary": "Four public sector banks (PSBs) in addition to Bank of Maharashtra are planning to raise funds through Qualified Institutional Placement (QIP) in small tranches starting from Q4FY25. The government has approved a Rs 2,000 crore QIP plan for each of these five PSBs. Punjab & Sind Bank is mentioned as one of the banks involved in this fundraising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1736846616000,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank to Consider Q3 Results on January 15",
            "Summary": "Punjab & Sind Bank has announced that it will consider its financial results for the third quarter on January 15. This routine quarterly financial review is a standard practice for publicly traded companies to disclose their performance to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1736521950000,
            "Source": "result"
        },
        {
            "Title": "Punjab & Sind Bank: Raises Rs 3,000 Crore Through Maiden Infrastructure Bonds",
            "Summary": "Punjab & Sind Bank successfully raised Rs 3,000 crore through its first-ever infrastructure bond issuance. The bonds, with a 10-year tenure and 7.74% coupon rate, received bids totaling Rs 6,031 crore against a base issue size of Rs 500 crore. The bonds will be listed on the National Stock Exchange.",
            "Sentiment": "positive",
            "PublishDate": 1734524995000,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank to Raise ₹3,000 Crore Through Long-Term Bonds",
            "Summary": "Punjab & Sind Bank has announced plans to raise funds through the issuance of long-term bonds amounting to ₹3,000 crore. This move is likely aimed at strengthening the bank's capital base and supporting its growth initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1734512026000,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank: Plans ₹3,000 Crore Infrastructure Bond Issuance",
            "Summary": "Punjab & Sind Bank to raise ₹3,000 crore through infrastructure bonds in December 2024. The 10-year bonds are rated 'AA' and will be listed on NSE. The bank aims for 13-14% credit growth this fiscal year. Q2 FY24 saw a 26% increase in net profit to ₹240 crore, with improved asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1733993557000,
            "Source": "corporate_action"
        },
        {
            "Title": "Punjab & Sind Bank Reports Improved Asset Quality in Q2",
            "Summary": "Punjab & Sind Bank has reported improved asset quality metrics for the second quarter. The Gross Non-Performing Assets (GNPA) ratio decreased to 4.21% from 4.72% in the previous quarter. The Net Non-Performing Assets (NNPA) ratio also improved, dropping to 1.46% from 1.59%. However, provisions increased to 1.51 billion rupees from 1.03 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729348357000,
            "Source": "result"
        },
        {
            "Title": "Punjab & Sind Bank Reports Q2 Profit Growth",
            "Summary": "Punjab & Sind Bank has reported a net profit of 2.40 billion rupees for the second quarter, up from 1.89 billion rupees in the same period last year. The bank's interest earned also increased to 27.4 billion rupees from 24.06 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729348351000,
            "Source": "result"
        }
    ]
}