{
    "Symbol": "PSPPROJECT",
    "ISIN": "INE488V01015",
    "News": [
        {
            "Title": "PSP Projects Q3 Net Profit Surges 256% YoY to ₹178M",
            "Summary": "PSP Projects reported consolidated net profit of ₹178 million in Q3, marking a significant 256% increase from ₹50 million in the same quarter of previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769756464058,
            "Source": "co_actions_results"
        },
        {
            "Title": "PSP Projects Receives ESG Rating of 66.9 (Grade B)",
            "Summary": "PSP Projects Limited has been assigned an ESG rating of 66.9 (Grade B) by SES ESG Research Pvt. Ltd., indicating medium risk for 2025. The rating was assigned voluntarily without company engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1769506156931,
            "Source": "stocks"
        },
        {
            "Title": "PSP Projects Q3FY26 Earnings Call Set for Jan 30",
            "Summary": "PSP Projects Limited announces earnings conference call on January 30, 2026 at 4:00 PM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769144275680,
            "Source": "co_actions_results"
        },
        {
            "Title": "PSP Projects Appoints New Joint Statutory Auditors",
            "Summary": "PSP Projects Limited successfully completes postal ballot voting with 99.13% approval for appointing G. K. Choksi & Co. as Joint Statutory Auditors to replace resigned firm.",
            "Sentiment": "positive",
            "PublishDate": 1768824924049,
            "Source": "co_actions_results"
        },
        {
            "Title": "PSP Projects completes postal ballot for auditor appointment",
            "Summary": "PSP Projects Limited successfully completed postal ballot voting on January 16, 2026, with 99.13% approval for appointing G. K. Choksi & Co. as Joint Statutory Auditors to fill casual vacancy.",
            "Sentiment": "positive",
            "PublishDate": 1768824740909,
            "Source": "co_actions_results"
        },
        {
            "Title": "PSP Projects Wins ₹61-Crore Arbitration Award",
            "Summary": "PSP Projects secures favorable arbitration award worth ₹61.44 crore from Bhiwandi Nizampur Municipal Corporation, with payment due within 60 days including accrued interest.",
            "Sentiment": "positive",
            "PublishDate": 1768225349012,
            "Source": "co_actions_results"
        },
        {
            "Title": "PSP Projects Secures ₹614.4 Cr Order from BNCMC",
            "Summary": "PSP Projects has received a significant contract worth ₹614.40 crores from BNCMC, marking a major business development for the construction and infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1768223146916,
            "Source": "co_actions_results"
        },
        {
            "Title": "PSP Projects Wins ₹61.44 Cr Arbitration Award",
            "Summary": "PSP Projects Limited secured a favorable arbitration award of ₹61.44 crores plus interest from Bhiwandi Nizampur City Municipal Corporation, with proceedings concluded on January 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768222588393,
            "Source": "stocks"
        },
        {
            "Title": "PSP Projects Board Meet Set for Jan 30 Q3FY26 Results",
            "Summary": "PSP Projects Limited has scheduled its board meeting for January 30, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1 to February 2, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767943388317,
            "Source": "co_actions_results"
        },
        {
            "Title": "PSP Projects Credit Rating Downgraded by CARE",
            "Summary": "CARE Ratings downgrades PSP Projects' short-term bank facilities rating from CARE A1+ to CARE A1, while reaffirming long-term facilities at CARE A+ with stable outlook.",
            "Sentiment": "negative",
            "PublishDate": 1766482211910,
            "Source": "stocks"
        },
        {
            "Title": "PSP Projects Gets ₹16.88L GST Penalty for FY 2021-22",
            "Summary": "PSP Projects Limited received GST penalty order of ₹16.88 lakh from Gujarat tax authorities for alleged ineligible input tax credit claims on insurance claims for FY 2021-22. Company plans appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766127203045,
            "Source": "stocks"
        },
        {
            "Title": "PSP Projects Seeks Shareholder Approval for New Auditor",
            "Summary": "PSP Projects Limited has issued a postal ballot notice seeking member approval for appointing M/s. G.K. Choksi & Co. as Joint Statutory Auditors following resignation of M/s. Prakash B. Sheth & Co.",
            "Sentiment": "neutral",
            "PublishDate": 1765794397528,
            "Source": "stocks"
        },
        {
            "Title": "PSP Projects Receives INR 14.43 Lakh GST Penalty Order for Alleged Input Tax Credit Violations",
            "Summary": "PSP Projects Limited received a GST penalty order of INR 14,43,100 from the State Tax Officer, Ahmedabad for allegedly claiming ineligible Input Tax Credit from cancelled, non-genuine and non-existent taxpayers for F.Y. 2018-2019. The company states there is no material impact on its financials or operations and plans to file an appeal with the appellate authority.",
            "Sentiment": "negative",
            "PublishDate": 1764662864946,
            "Source": "stock"
        },
        {
            "Title": "PSP Projects Secures Major Rest Houses Construction Contract Worth Up To Rs 5000 Crore",
            "Summary": "PSP Projects has won a contract to construct more than 100 rest houses with potential earnings of up to Rs 5000 crore. The contract value significantly exceeds the company's current market capitalization of Rs 3600 crore, indicating substantial business growth potential.",
            "Sentiment": "positive",
            "PublishDate": 1764314093340,
            "Source": "stock"
        },
        {
            "Title": "PSP Projects Shareholders Approve Director Appointments and Related Party Transactions via Postal Ballot",
            "Summary": "PSP Projects Limited announced the results of its postal ballot voting conducted through remote e-voting, with the last date being November 5, 2025. Shareholders approved nine resolutions including the appointment of Kattunga Srinivasa Rao as Non-Executive Non-Independent Director and Girishkumar Singal as Non-Executive Independent Director. The company also received approval for CEO Pooja Patel's remuneration, amendments to Articles of Association, and multiple material related party transactions for financial year 2025-26. All resolutions passed with overwhelming majority support, with most receiving over 99% approval from voting shareholders. The voting was conducted entirely through electronic means without physical ballot papers, in compliance with regulatory circulars.",
            "Sentiment": "positive",
            "PublishDate": 1762540422576,
            "Source": "corporate_action"
        },
        {
            "Title": "PSP Projects Shareholders Approve Special Rights for Adani Infra and Promoters",
            "Summary": "PSP Projects shareholders have approved the adoption of amended and restated Articles of Association that incorporate special rights for Adani Infra and existing promoters. The approval represents a governance change that grants specific privileges to these stakeholders within the company's organizational structure.",
            "Sentiment": "neutral",
            "PublishDate": 1762349844189,
            "Source": "corporate_governance"
        },
        {
            "Title": "PSP Projects Reports 20% Revenue Growth in Q2FY26, Order Book Reaches Rs 9,883 Crore",
            "Summary": "PSP Projects Limited reported revenue of Rs 694 crore for Q2FY26, marking 20% year-over-year growth and 35% quarter-over-quarter growth. The company's order book stands at Rs 9,883 crore with 51% year-over-year growth, with Adani projects comprising 56% of the outstanding orders. Order inflow for the quarter was Rs 4,011 crore, primarily from Adani Group projects. EBITDA increased 24% to Rs 48 crore with margins at 6.93%, while net profit grew 33% to Rs 15 crore. The company completed a world record concrete pour of 24,000 cubic meters in 54 hours for the Vishv Umiya Dham Temple project, generating Rs 37 crore revenue. Management expects revenue of over Rs 2,000 crore in the second half and projects the order book could reach Rs 14,000-15,000 crore by March 2026. The company has a bid pipeline of approximately Rs 8,500 crore, including Rs 7,000 crore from Adani Group projects. Working capital days increased to 102 days from 65 days due to higher receivables, though management expects improvement in Q3 with mobilization advances from Adani Group.",
            "Sentiment": "positive",
            "PublishDate": 1761648224449,
            "Source": "earnings"
        },
        {
            "Title": "PSP Projects Reports 20% Revenue Growth in Q2FY26, Order Book Reaches ₹9,883 Crore",
            "Summary": "PSP Projects Limited reported revenue of ₹694 crore in Q2FY26, marking a 20% year-over-year growth and 35% quarter-over-quarter increase. For the half-year period, revenue stood at ₹1,206 crore with a modest 1.38% yearly growth. The company's order book reached ₹9,883 crore as of September 30, 2025, representing 51% growth compared to the previous year. Adani projects comprise 56% of the current order book while non-Adani projects account for the balance. The company received order inflows of ₹3,185 crore during the period. PSP Projects achieved a world record by completing a continuous concrete pour of 24,000 cubic meters in 54 hours for the Vishv Umiya Dham Temple foundation in Ahmedabad. Adani Infra has acquired a 34.41% stake in the company and is now classified as a promoter. The company maintains a debt-equity ratio of 0.29 times and has 63 ongoing projects with 248 completed projects to date.",
            "Sentiment": "positive",
            "PublishDate": 1760696007978,
            "Source": "earnings"
        },
        {
            "Title": "PSP Projects Reports 59% Jump in Quarterly Net Profit to 162 Million Rupees",
            "Summary": "PSP Projects reported a consolidated net profit of 162 million rupees for the quarter, representing a significant increase from 102 million rupees in the same period last year. The company's revenue also grew to 7 billion rupees compared to 5.86 billion rupees year-over-year, marking strong financial performance across both profitability and top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1760688797338,
            "Source": "earnings"
        },
        {
            "Title": "PSP Projects Sets World Record for Concrete Pouring in Temple Construction",
            "Summary": "PSP Projects achieved a global record by pouring 24,000 cubic meters of concrete for the Vishv Umiya Dham, described as the world's tallest temple. The company completed the raft foundation work in 54 hours and received recognition in the Golden Book of World Records for this accomplishment.",
            "Sentiment": "positive",
            "PublishDate": 1758187270168,
            "Source": "stock"
        },
        {
            "Title": "PSP Projects Promoter Prahaladbhai S. Patel Sells 1.02 Crore Shares, Reduces Stake to 22.04%",
            "Summary": "Prahaladbhai Shivrambhai Patel, a promoter of PSP Projects Limited, sold 1,01,98,734 equity shares through on-market bulk deals and off-market transactions. The sale occurred over two days - 97,00,000 shares on August 4, 2025, and 4,98,734 shares on August 5, 2025. Following this transaction, Patel's shareholding in the company decreased from 47.76% to 22.04%. The company has a total equity share capital of 3,96,41,791 shares with a face value of INR 10 each. PSP Projects is listed on both BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754544883369,
            "Source": "corporate_action"
        },
        {
            "Title": "PSP Projects Reports Sharp Decline in Q1FY26 Results Due to Labor Shortage",
            "Summary": "PSP Projects Limited reported a significant decline in quarterly performance with revenue dropping 16% to Rs. 513 crores from Rs. 612 crores year-on-year. EBITDA fell 67% to Rs. 24 crores from Rs. 73 crores, while net profit declined to Rs. 13 lakhs from Rs. 34 crores. The company faced a 37% labor shortfall during April-May 2025, which has since improved to 19%. Employee costs increased to 6.8% from the usual 4-5% range due to new hires for Adani projects. The company incurred additional expenses of Rs. 4.5 crores on UP projects and ECL provisions of Rs. 8.68 crores. PSP Projects maintains an order book of Rs. 6,514 crores with 11% year-on-year growth. The company expects new order inflows of Rs. 7,000-8,000 crores from Adani Group, including projects like residential colonies at Mundra (Rs. 1,250 crores), township at Mundra (Rs. 2,300 crores), and Dharavi residential project (Rs. 830 crores). Management expects EBITDA margins to normalize to 8-9% range from Q2FY26. Adani Infra acquired 11.32% stake through open offer completed in June 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754466206179,
            "Source": "earnings"
        },
        {
            "Title": "Adani Infra Acquires 34.41% Stake in PSP Projects, Gains Joint Control",
            "Summary": "Adani Infra has acquired a 34.41% stake in PSP Projects and obtained joint control of the company. This acquisition represents a strategic shift for PSP Projects and is expected to bring changes in leadership and governance structure.",
            "Sentiment": "positive",
            "PublishDate": 1754413725583,
            "Source": "order&deals"
        },
        {
            "Title": "PSP Projects Delays Revenue Forecast, Maintains EBITDA Margin Guidance at 8-9%",
            "Summary": "PSP Projects will provide its revenue forecast after Q2 concludes due to challenges encountered in Q1 and expected difficulties in Q2. The company maintains its EBITDA margin forecast at 8-9%. For FY27, PSP Projects expects revenue to reach ₹4,500 crores. The company estimates FY26 order inflow between ₹7,500-₹8,000 crores and is in discussions for projects worth ₹8,000-₹9,000 crores with Adani Group. Capital expenditure is projected at 3-4% of revenue, potentially increasing to 5% for Adani projects.",
            "Sentiment": "neutral",
            "PublishDate": 1753932409188,
            "Source": "stock"
        },
        {
            "Title": "PSP Projects Revises Q1 FY26 Investor Presentation, Reports 16% Revenue Decline",
            "Summary": "PSP Projects Limited submitted a revised investor presentation for the quarter ended June 30, 2025, with changes to slide 19 titled 'Work on Hand as on 30 June 2025'. The company reported revenue from operations of ₹513 crore in Q1FY26, down 16% year-on-year from ₹612 crore in Q1FY25. EBITDA declined 67% to ₹24 crore with margins dropping to 4.77% from 12%. PAT fell to ₹0.13 crore from ₹34 crore in the previous year. The company maintains an order book of ₹6,514 crore as of June 30, 2025, with Adani projects comprising 27% of the total. Management cited labor shortage of 37% in April and May 2025, currently at 19% shortfall. Employee costs increased to 6.8% due to hiring for new Adani orders and initial construction phases of newly awarded projects. The company completed the Surat Diamond Bourse project worth ₹1,960 crore and has expanded operations across Gujarat, Rajasthan, Karnataka, Uttar Pradesh, Maharashtra and New Delhi.",
            "Sentiment": "negative",
            "PublishDate": 1753882760249,
            "Source": "stock"
        },
        {
            "Title": "PSP Projects Reports Quarterly Results, Schedules AGM and Appoints Auditors",
            "Summary": "PSP Projects Limited's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 51,275.93 lakhs compared to Rs 61,189.20 lakhs in the same quarter last year. Standalone profit after tax declined to Rs 18.93 lakhs from Rs 3,428.02 lakhs year-over-year. On a consolidated basis, the company posted revenue of Rs 51,776.25 lakhs versus Rs 62,306.21 lakhs in the prior year quarter, with consolidated profit after tax at Rs 42.34 lakhs compared to Rs 3,468.44 lakhs previously. The board scheduled the 17th Annual General Meeting for September 27, 2025, via video conferencing. Additionally, the company re-appointed M/s. K V M & Co. as Cost Auditors for FY 2025-26 and appointed M/s. Chirag Shah and Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval.",
            "Sentiment": "negative",
            "PublishDate": 1753868044917,
            "Source": "earnings"
        },
        {
            "Title": "PSP Projects Reports Sharp Decline in Q1 Financial Performance",
            "Summary": "PSP Projects reported significantly weaker Q1 results with consolidated net profit dropping to 4.2 million rupees from 347 million rupees in the previous year. Revenue declined to 5.2 billion rupees from 6.24 billion rupees year-over-year. EBITDA fell to 248 million rupees compared to 740 million rupees in the same period last year, while EBITDA margin compressed to 4.8% from 11.87% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753866401393,
            "Source": "earnings"
        },
        {
            "Title": "PSP Projects Schedules Q1FY26 Earnings Conference Call for July 30, 2025",
            "Summary": "PSP Projects Ltd has scheduled an earnings conference call on July 30, 2025, at 4:00 PM IST to discuss its Q1FY26 unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The call will be led by Chairman, MD and CEO P.S. Patel and Chief Financial Officer Hetal Patel. PSP Projects is a construction company incorporated in 2008, offering diversified construction and allied services across industrial, institutional, government and residential projects. The company operates as an integrated EPC provider covering design, construction, MEP, interior and O&M services across six states including Gujarat, Rajasthan, Karnataka, Uttar Pradesh, Maharashtra and New Delhi.",
            "Sentiment": "neutral",
            "PublishDate": 1753521508315,
            "Source": "earnings"
        },
        {
            "Title": "PSP Projects Schedules Board Meeting for July 30 to Approve Quarterly Financial Results",
            "Summary": "PSP Projects Limited has scheduled a Board of Directors meeting on July 30, 2025 to consider and approve the unaudited Standalone & Consolidated Financial Results for the quarter ended June 30, 2025. The company also announced that the Trading Window for designated persons is closed from July 1, 2025 until 48 hours after the financial results are declared.",
            "Sentiment": "neutral",
            "PublishDate": 1753334299420,
            "Source": "corporate_action"
        },
        {
            "Title": "PSP Projects Reports Decline in Q4 EBITDA and Margin",
            "Summary": "PSP Projects has reported its quarterly results. The company's EBITDA for Q4 decreased to 323 million rupees from 527 million rupees in the same quarter last year. The EBITDA margin also declined to 4.81% from 7.89% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747992095000,
            "Source": "result"
        },
        {
            "Title": "PSP Projects Reports Q4 Financial Results",
            "Summary": "PSP Projects has announced its Q4 financial results. The company reported revenue of 6.7 billion rupees, compared to 6.68 billion rupees in the same quarter last year. The consolidated net profit for Q4 was 65 million rupees, down from 155 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747991902000,
            "Source": "result"
        },
        {
            "Title": "PSP Projects Secures 107.1 Crore Rupee Order",
            "Summary": "PSP Projects has been awarded a new project order valued at 107.1 crore rupees. The company is expected to complete the project within a timeframe of 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1745063337000,
            "Source": "default"
        },
        {
            "Title": "CCI Approves Adani Infra's Acquisition of PSP Projects Shares",
            "Summary": "The Competition Commission of India (CCI) has approved the acquisition of equity shares of PSP Projects by Adani Infra (India). This decision allows Adani Infra to proceed with the purchase of shares in PSP Projects, a move that could potentially impact the ownership structure and control of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1741093139000,
            "Source": "corporate_action"
        },
        {
            "Title": "PSP Projects Secures Orders Worth 1,764 Crore Rupees",
            "Summary": "PSP Projects, a construction company, has announced that it has won new orders valued at 1,764 crore rupees. This significant contract win represents a major business development for the company and is likely to boost its project pipeline and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1740718484000,
            "Source": "order&deals"
        },
        {
            "Title": "PSP Projects Reports Decline in Q3 EBITDA and Margin",
            "Summary": "PSP Projects has reported a significant decrease in its third-quarter EBITDA, which fell to 355 million rupees from 696 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 5.64% from 9.88% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738914455000,
            "Source": "earnings"
        },
        {
            "Title": "PSP Projects Reports Decline in Q3 Revenue",
            "Summary": "PSP Projects, an Indian construction company, has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 6.3 billion rupees, down from 7.04 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738914440000,
            "Source": "earnings"
        },
        {
            "Title": "PSP Projects Reports Significant Decline in Q3 Consolidated Net Profit",
            "Summary": "PSP Projects, a construction company, has reported a substantial decrease in its consolidated net profit for the third quarter. The company's net profit fell to 50 million rupees, down from 310 million rupees in the same period last year, representing a significant year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738914321000,
            "Source": "earnings"
        },
        {
            "Title": "Adani Infra to Acquire Stake in PSP Projects",
            "Summary": "Adani Infrastructure is set to acquire up to 30.07% stake in PSP Projects from Prahaladbhai S. Patel. As a result of this transaction, Adani Infrastructure will be required to make an open offer to other shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1732021033000,
            "Source": "corporate_action"
        },
        {
            "Title": "Adani Infra to Acquire 30.07% Stake in PSP Projects",
            "Summary": "PSP Projects has announced that Adani Infra will be acquiring up to 30.07% of the company's equity share capital. The sale of these shares is valued at 6.85 billion rupees under the Share Purchase Agreement (SPA).",
            "Sentiment": "neutral",
            "PublishDate": 1732021026000,
            "Source": "corporate_action"
        },
        {
            "Title": "PSP Projects: Q2 Performance Expected to Improve in H2",
            "Summary": "Axis Securities reports that PSP Projects' performance is anticipated to improve in the second half of the fiscal year, based on Q2 results review.",
            "Sentiment": "positive",
            "PublishDate": 1730202631000,
            "Source": "result"
        },
        {
            "Title": "PSP Projects Reports Decline in Q2 EBITDA and Margin",
            "Summary": "PSP Projects has reported a significant decrease in its Q2 EBITDA, which fell to 376 million rupees from 725 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 6.42% from 11.70% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729845922000,
            "Source": "result"
        },
        {
            "Title": "PSP Projects Reports Q2 Revenue Decline",
            "Summary": "PSP Projects, an Indian construction company, reported a revenue of 5.86 billion rupees for the second quarter, down from 6.2 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1729845800000,
            "Source": "result"
        },
        {
            "Title": "PSP Projects Reports Significant Decline in Q2 Profit",
            "Summary": "PSP Projects, a construction company, has reported a consolidated net profit of 102 million rupees for the second quarter, down from 385 million rupees in the same period last year. This represents a substantial year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1729845761000,
            "Source": "result"
        },
        {
            "Title": "PSP Projects Schedules Board Meeting for Q2 Results",
            "Summary": "<p>PSP Projects has announced that its <span class='neutral'>board of directors</span> will meet on <b>October 25</b> to <span class='neutral'>consider and approve</span> the company's <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the current <span class='neutral'>fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728652506000,
            "Source": "result"
        },
        {
            "Title": "PSP Projects: Bags ₹249 Crore Residential Tower Project in GIFT City",
            "Summary": "<p>PSP Projects <span class=\"positive\">secured</span> an order worth <span class=\"positive\">₹249 crore</span> to construct a <b>high-rise residential tower</b> 'SIBAN' in GIFT City, Gandhinagar. This <span class=\"positive\">brings</span> the company's total order inflow for the current financial year to <span class=\"positive\">₹1,714.46 crore</span>. The company's shares were <span class=\"positive\">up 4.28%</span> at ₹658.95 as of 12:40 PM on October 8.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728371941000,
            "Source": "normal_news"
        },
        {
            "Title": "PSP Projects Secures 270 Crore Rupee Order",
            "Summary": "<p><span class=\"positive\">PSP Projects</span>, a construction company, has <span class=\"positive\">won</span> a <b>new order</b> worth <span class=\"positive\">270 crore rupees</span> (approximately $32.5 million USD). This <span class=\"positive\">significant contract</span> is likely to <span class=\"positive\">boost</span> the company's project portfolio and potentially <span class=\"positive\">impact</span> its financial performance positively.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728370960000,
            "Source": "corporate_action"
        }
    ]
}