{
    "Symbol": "PTC",
    "ISIN": "INE877F01012",
    "News": [
        {
            "Title": "PTC India Board Meet Feb 14 for Q3 Results & Dividend",
            "Summary": "PTC India Limited has scheduled its board meeting for February 14, 2026, to consider Q3FY26 financial results and potential interim dividend declaration for shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1770739700516,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC India Board Meet on Feb 14 for Q3FY26 Results",
            "Summary": "PTC India Limited has scheduled its Board of Directors meeting for February 14, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769683969410,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC India announces major promoter restructuring",
            "Summary": "NTPC to become sole promoter of PTC India as PFC, POWERGRID and NHPC withdraw nominee directors and relinquish promoter rights following Ministry of Power directive dated January 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769174452775,
            "Source": "stocks"
        },
        {
            "Title": "PTC India Shareholders Approve Three Key Resolutions",
            "Summary": "PTC India Limited shareholders approved three resolutions through postal ballot on January 8, 2026, including re-appointment of Prakash Mhaske and appointment of two new directors with strong majority support.",
            "Sentiment": "positive",
            "PublishDate": 1767961868411,
            "Source": "stocks"
        },
        {
            "Title": "PTC India Partners with NLC for 2000 MW Green Energy",
            "Summary": "PTC India enters joint venture with NLC India Renewables for green energy projects up to 2000 MW capacity, covering solar, wind, hydro, and battery storage systems with 26% stake.",
            "Sentiment": "positive",
            "PublishDate": 1765607657366,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC India Seeks Shareholder Approval for Director Appointments Through Postal Ballot",
            "Summary": "PTC India has issued a postal ballot notice seeking member approval for re-appointment of Prakash Mhaske as Independent Director for a second three-year term and appointment of Sukhdev Singh as Independent Director and Masood Akhtar Ansari as Non-Executive Nominee Director of NTPC. The remote e-voting process will commence on December 10, 2025, and end on January 8, 2026, with results determining the composition of the company's board leadership.",
            "Sentiment": "neutral",
            "PublishDate": 1765271028454,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Appoints NTPC's Masood Akhtar Ansari as Non-Executive Nominee Director",
            "Summary": "PTC India Limited appointed Sh. Masood Akhtar Ansari, Executive Director (Finance) at NTPC Limited, as Non-Executive Nominee Director effective December 1, 2025. Ansari brings over 33 years of finance experience and currently serves on boards of multiple NTPC subsidiaries and joint ventures.",
            "Sentiment": "neutral",
            "PublishDate": 1764228082387,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Board Director Smt. Sangeeta Kaushik Ceases Role Following NTPC Nomination Withdrawal",
            "Summary": "Smt. Sangeeta Kaushik (DIN: 09157948), Nominee Director of NTPC Ltd., ceased to be Director on PTC India Ltd.'s Board effective November 21, 2025, due to withdrawal of her nomination by NTPC Ltd. NTPC will place a new nominee on PTC's Board shortly to fill the vacant director position.",
            "Sentiment": "neutral",
            "PublishDate": 1763742338209,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Reports 11% Volume Growth to 49.22 Billion Units in H1 FY26, Executes 100MW Renewable PPA",
            "Summary": "PTC India achieved 11% trading volume growth to 49.22 billion units in H1 FY26 despite national energy demand growing only 1.07%, while maintaining trading margins at 3.54 paisa per unit and securing 10% increase in trading income. The company executed a 100MW renewable energy PPA expected to be operational by Q1 FY27 and announced a joint venture with NLC Renewable Energy Limited with initial investment of Rs. 500 crores for renewable energy assets.",
            "Sentiment": "positive",
            "PublishDate": 1763461275292,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Independent Director Resigns Due to GST Appellate Tribunal Appointment",
            "Summary": "Shri Arabandi Venu Prasad resigned as Independent Director of PTC India Limited with effect from 13 November 2025, citing his appointment as Member (Technical) of the GST Appellate Tribunal as a full-time engagement. The resignation affects the company's board composition as he confirmed no other material reasons exist for his departure beyond the conflicting professional commitment.",
            "Sentiment": "neutral",
            "PublishDate": 1763046342281,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Board Acknowledges Fine from BSE and NSE for Board Composition Non-Compliance",
            "Summary": "PTC India Limited received fines from BSE and NSE for non-compliance with Regulation 17(1) of SEBI Listing Regulations regarding Board of Directors composition. The company's Board met on November 11, 2025, and acknowledged the non-compliance and consequent fine imposed by the exchanges, which has been paid by the company. The Board noted that its composition has been compliant with the regulation since June 7, 2025. The exchanges had initially communicated about the fine through letters dated August 29, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762931276462,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Forms Joint Venture with NLC India Renewables for 2000MW Green Energy Projects",
            "Summary": "PTC India Limited's Board approved entering into a Joint Venture Agreement with NLC India Renewables Limited to develop Green Energy Projects up to 2000MW including solar, wind, hydro, and battery storage systems on a pan-India basis in phased manner. The proposed JV ratio is NLC India Renewables Limited at 74% and PTC India Limited at 26%. The Board also approved quarterly results for the quarter and half year ended September 30, 2025. Additionally, the Board approved the re-appointment of Shri Prakash Mhaske as Non-Executive Independent Director for a second term of three years effective January 16, 2026, and appointed Shri Sukhdev Singh, IAS (Retd.) 1987 Batch, as Additional Director and Independent Director for three years effective November 11, 2025, both subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1762912618899,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Reports 21% PAT Growth, Targets Energy Trading Expansion and Renewable Volume Doubling",
            "Summary": "PTC India reported a profit after tax of ₹425 crores, marking a 21% year-over-year increase. The company has guided for strong energy trading expansion with FY25 volume projected at 90 billion units, representing a 6% year-over-year growth. PTC India is exploring a green power exchange platform and has entered strategic partnerships for battery energy storage and cross-border power trade. The company aims to double its renewable trading volume by FY28 and is focusing on digitalization, risk hedging, and merchant market participation as key growth drivers.",
            "Sentiment": "positive",
            "PublishDate": 1762876572063,
            "Source": "stock"
        },
        {
            "Title": "PTC India Q2 Profit Falls 12% Despite Revenue and EBITDA Growth",
            "Summary": "PTC India reported a net profit of ₹191 crore for Q2FY26, declining 11.8% from ₹216.6 crore in the previous year. Revenue from operations grew 11.7% to ₹5,458 crore. EBITDA increased 17.7% to ₹274.6 crore with margins improving to 5% from 4.7%, driven by efficiency gains and better contract mix. Shares closed 0.21% lower at ₹165.25 on the NSE ahead of the results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1762872226959,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Reports 15.5% Growth in Q2 Net Profit to 1.34 Billion Rupees",
            "Summary": "PTC India reported quarterly net profit of 1.34 billion rupees compared to 1.16 billion rupees in the same period last year. Revenue increased to 53.27 billion rupees from 47.23 billion rupees year-over-year. EBITDA rose to 979.2 million rupees versus 851 million rupees, while EBITDA margin improved slightly to 1.84% from 1.81%.",
            "Sentiment": "positive",
            "PublishDate": 1762870143769,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Financial Services Shares Jump 15% on Strong Quarterly Results",
            "Summary": "PTC India Financial Services shares surged over 15% following strong quarterly results, marking the biggest single-day jump since July 2024. The company reported profit after tax of ₹88 crore, up from ₹47 crore in the previous quarter, while disbursements rose to ₹326 crore from ₹138 crore. Key performance metrics showed significant improvement: return on assets increased to 6.5% from 3.08%, gross stage 3 loans fell 56% quarter-on-quarter to ₹193 crore, and loan sanctions jumped 408% to ₹1,048 crore - the highest level in 10 quarters. Asset quality improved with gross stage 3 loans down 75% year-on-year and provision coverage ratio rising to 76%. The stock broke above all three key moving averages with trading volumes reaching the highest since December 2023. Despite the rally, the stock has declined 9% year-to-date following three consecutive monthly losses.",
            "Sentiment": "positive",
            "PublishDate": 1761291281414,
            "Source": "stock"
        },
        {
            "Title": "PTC India Financial Services Reports 86% Jump in Quarterly Net Profit",
            "Summary": "PTC India Financial Services reported consolidated net profit of 881 million rupees compared to 473 million rupees in the same quarter last year, marking an 86% increase. However, quarterly revenue declined to 1.3 billion rupees from 1.6 billion rupees in the previous year, representing a 19% decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1761265020514,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Receives SEBI Notice Without Penalties",
            "Summary": "PTC India received a notice from SEBI but no penalties were imposed on the company.",
            "Sentiment": "positive",
            "PublishDate": 1759240857233,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Financial Services Responds to Independent Directors' Mass Resignation",
            "Summary": "PTC India Financial Services issued a clarification following the resignation of three Independent Directors - Seema Bahuguna, Naveen Bhushan Gupta and PV Bharathi on September 30. The company expressed surprise at the resignations and the identical reasons cited, noting that no such grievances were raised during their June 4, 2025 meeting where directors had actually appreciated improved information flow. The company stated that Independent Directors participated openly in all board and committee meetings without raising concerns about functioning difficulties. PTC India Financial referenced past corporate governance issues from January 2022 when three Independent Directors resigned citing alleged violations, leading to SEBI investigations. SEBI passed orders against the then Non-Executive Chairman and MD & CEO in June 2024, though the Securities Appellate Tribunal quashed the order against the former Chairman in December 2024. The company emphasized that corrective steps have been taken including board reconstitution and strengthening compliance functions. Managing Director & CEO R Balaji stated the company remains committed to maintaining high governance standards.",
            "Sentiment": "negative",
            "PublishDate": 1759235364904,
            "Source": "corporate_governance"
        },
        {
            "Title": "Three Independent Directors Resign from PTC India Financial Services Citing Governance Issues",
            "Summary": "Three independent directors - Seema Bahuguna, Naveen Bhushan Gupta, and PV Bharathi - resigned from PTC India Financial Services Ltd.'s board on September 28, citing corporate governance issues. The directors, who joined in November 2022, stated that recent developments at the company made their independent functioning difficult. In their resignation letters, they mentioned working over three years to address company issues by recruiting a new Managing Director, filling vacant board positions, addressing finance and audit matters, and establishing internal controls and policies. The directors noted these efforts helped improve company compliance and performance. However, they did not elaborate on specific factors that led to their resignations. PTC India Financial Services shares closed 3.2% lower at ₹35.33, with the stock declining over 7% in the past month and down 20% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1759108123939,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Financial Services Resolves ₹115.6 Crore Vento Power Infra Debt Through Management Transfer",
            "Summary": "PTC India Financial Services has completed a debt resolution worth ₹115.6 crore related to Vento Power Infra. The resolution was achieved by transferring management control to Eie Renewables.",
            "Sentiment": "positive",
            "PublishDate": 1755734086317,
            "Source": "order&deals"
        },
        {
            "Title": "PTC India Reports 13% Trading Volume Growth Despite 13% Drop in Operational Income",
            "Summary": "PTC India Limited reported mixed quarterly results with trading volume increasing 13% to 23 billion units while total operational income declined 13% to Rs. 111 crore. Standalone profit after tax remained flat at Rs. 105 crore compared to Rs. 106 crore in the previous year. However, consolidated results showed stronger performance with profit after tax from continuing operations surging 61% to Rs. 243 crore. The company's trading volume growth outpaced the national energy demand which declined 1.2%. Cross-border operations continued across Bangladesh, Bhutan, and Nepal, with Nepal commencing both import and export activities. PTC floated expression of interest for 500 MW renewable energy capacity and is consulting on 1,000 MW solar and hybrid projects. The company is evaluating capital allocation options from PTC Energy stake sale proceeds and seeking shareholder approval to participate in electricity futures markets. Management expects power demand to grow 6-8% annually and views upcoming market coupling implementation and Market Based Economic Dispatch as positive developments.",
            "Sentiment": "neutral",
            "PublishDate": 1755151661648,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Reports 13% Volume Growth in Q1 FY26, Targets Renewable Energy Expansion",
            "Summary": "PTC India reported a 13% increase in volume for Q1 FY26. The company is targeting growth in renewable energy, cross-border power, and consulting services. PTC India projects improved EBITDA margins and plans to develop innovative energy solutions.",
            "Sentiment": "positive",
            "PublishDate": 1754577947766,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Reports 44% Jump in Q1 Net Profit Despite Revenue Decline",
            "Summary": "PTC India reported a consolidated net profit of 1.95 billion rupees in Q1, representing a 44% increase from 1.35 billion rupees in the same period last year. However, the company's revenue declined to 40 billion rupees from 44.5 billion rupees year-over-year. EBITDA improved to 2.9 billion rupees compared to 2.4 billion rupees previously, with EBITDA margin expanding to 7.19% from 5.36% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1754573465513,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Shares Surge 5% While IEX Plummets 10% on CERC Market Coupling Policy",
            "Summary": "PTC India shares jumped nearly 5% to Rs. 199.65 following the Central Electricity Regulatory Commission's announcement of market coupling implementation for the Day Ahead Market starting January 2026. The policy will aggregate buy and sell orders from all power exchanges to determine a uniform market clearing price through a centralized algorithm, eliminating individual price discovery by exchanges. Indian Energy Exchange, which holds an 85% share in the spot market and relies on price discovery, saw its stock fall 10% and hit the lower circuit. PTC India benefits from this development through its 22.62% stake in Hindustan Power Exchange as of May 2025. The market coupling policy is expected to level the playing field among energy exchanges, potentially allowing smaller players like HPX to capture significant trading volumes by competing on service quality, innovation, and technology. HPX operates with advanced technology and has backing from BSE and ICICI Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1753332276279,
            "Source": "stock"
        },
        {
            "Title": "PTC India: Energy Storage and PPAs to Drive Growth",
            "Summary": "PTC India's CMD Manoj Jhawar outlines three key growth factors: mutual power purchase agreements, energy storage solutions, and the electricity futures market. The company plans to expand its consulting division and explore grid-scale storage opportunities. PTC India aims to maintain its 31% market share in power trading through its strong balance sheet and industry connections.",
            "Sentiment": "positive",
            "PublishDate": 1751333325000,
            "Source": "normal_news"
        },
        {
            "Title": "PTC India: Q4 Net Profit Soars on Exceptional Gain from Divestment",
            "Summary": "PTC India's Q4 consolidated net profit jumped to Rs 371.87 crore, largely due to a Rs 305.96 crore exceptional gain from divesting PTC Energy Ltd. Trading volume for FY 2024-25 increased to 82.75 BUs. The board recommended a final dividend of Rs 6.70 per share.",
            "Sentiment": "positive",
            "PublishDate": 1748282859000,
            "Source": "earnings"
        },
        {
            "Title": "PTC India: Q4 Net Profit Surges Threefold Despite Revenue Decline",
            "Summary": "PTC India Ltd reported a significant increase in Q4 net profit to ₹343 crore from ₹91.3 crore year-over-year. However, revenue declined 14.3% to ₹3,006.3 crore, and EBITDA fell 16.6% to ₹209.7 crore. The company's EBITDA margin narrowed slightly to 6.98% from 7.16%.",
            "Sentiment": "neutral",
            "PublishDate": 1748274647000,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Reports Q4 Results and Recommends Dividend",
            "Summary": "PTC India has released its quarterly results and announced a dividend. The company recommended a dividend of 6.7 rupees per share. For Q4, PTC India reported a consolidated net profit of 3.4 billion rupees, up from 913 million rupees year-over-year and 1.5 billion rupees quarter-over-quarter. Revenue for Q4 was 30 billion rupees, down from 35 billion rupees year-over-year. The company's Q4 EBITDA was 2 billion rupees with a margin of 6.98%, compared to 2.5 billion rupees and 7.16% margin in the same quarter last year. PTC India also reported an exceptional item of 3 billion rupees and a profit before tax (PBT) of 1.6 billion rupees for Q4, slightly up from 1.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748268155000,
            "Source": "result"
        },
        {
            "Title": "PTC India: ABC Consultants Hired to Find New CMD Amid Restructuring",
            "Summary": "PTC India has engaged ABC Consultants to search for a new Chairman and Managing Director. This comes after the former CMD's removal and amid potential ownership changes, with NHPC considering buying out stakes of other state-owned promoters. The company is also facing ongoing corporate governance issues related to its subsidiary PFS.",
            "Sentiment": "neutral",
            "PublishDate": 1744718243000,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Reports Mixed Q3 Financial Results",
            "Summary": "PTC India announced its Q3 financial results, showing a significant increase in consolidated net profit to 1.8 billion rupees, up from 970 million rupees in the same quarter last year. However, the company's revenue decreased to 32.86 billion rupees from 34.72 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739405817000,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Reports Improved Q3 Financial Performance",
            "Summary": "PTC India has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 3.09 billion rupees, up from 2.59 billion rupees in the same quarter of the previous year. Additionally, PTC India's EBITDA margin improved to 9.05% from 7.28% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739369079000,
            "Source": "earnings"
        },
        {
            "Title": "PTC India Reports Significant Increase in Q3 Net Profit",
            "Summary": "PTC India has announced its financial results for the third quarter. The company's consolidated net profit rose to 1.8 billion rupees, compared to 970 million rupees in the same period last year, marking a substantial year-over-year increase. However, the company's revenue for Q3 decreased to 32.86 billion rupees from 34.72 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739369073000,
            "Source": "earnings"
        },
        {
            "Title": "Nihar Nandan Nilekeni Increases Stake in PTC India",
            "Summary": "Investor Nihar Nandan Nilekeni has increased his shareholding in PTC India by 0.67% during the third quarter. Following this acquisition, Nilekeni's total stake in the company now stands at 2%.",
            "Sentiment": "positive",
            "PublishDate": 1736496389000,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC India Reports Q2 Financial Results",
            "Summary": "PTC India has released its Q2 financial results. The company reported a net profit of 1.16 billion rupees, down from 1.33 billion rupees year-over-year but up from 1.06 billion rupees quarter-over-quarter. Revenue decreased to 47.1 billion rupees from 48.2 billion rupees year-over-year. EBITDA improved to 1.6 billion rupees from 1.2 billion rupees year-over-year, with EBITDA margin increasing to 3.21% from 2.46% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731455683000,
            "Source": "result"
        },
        {
            "Title": "PTC India: Q2 Profit Rises 13% to ₹146 Crore",
            "Summary": "PTC India reported a 12.5% YoY increase in Q2 net profit to ₹146.2 crore. Revenue grew 1.2% to ₹5,128 crore. Trading volume increased by 13% to 24,039 MU. EBITDA rose 4% to ₹306.2 crore with a margin of 6%. H1FY25 consolidated PAT increased to ₹423.26 crore from ₹345.01 crore in H1FY24.",
            "Sentiment": "positive",
            "PublishDate": 1731432294000,
            "Source": "result"
        },
        {
            "Title": "PTC India: Nandan Nilekani's Son Acquires 1.3% Stake",
            "Summary": "<p><span class='neutral'>Nihar Nandan Nilekani</span>, son of Infosys co-founder Nandan Nilekani, has <span class='positive'>acquired</span> a <b>1.32% stake</b> (approximately 39 lakh shares) in <span class='neutral'>PTC India</span> during Q2 2024. This is his <b>first investment</b> in the company.<br/><br/>PTC India is <span class='positive'>majority-owned</span> by public shareholders, with promoters holding 16.22% and public shareholders 83.78%. <span class='neutral'>Foreign portfolio investors</span> hold a <span class='positive'>significant 32% stake</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728990342000,
            "Source": "block_deals"
        },
        {
            "Title": "PTC India: Nihar Nandan Nilekani Acquires 1.32% Stake in Q2",
            "Summary": "<p>Investor <span class='neutral'>Nihar Nandan Nilekani</span> has appeared in the shareholding of <span class='neutral'>PTC India</span>, <span class='positive'>acquiring</span> a <b>1.32%</b> stake during the <span class='neutral'>second quarter</span> of the fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728979303000,
            "Source": "normal_news"
        },
        {
            "Title": "PTC India: Shareholders Approve ₹7.80 Dividend for FY24",
            "Summary": "<p>PTC India shareholders have approved a <span class='positive'>final dividend</span> of <span class='neutral'>₹7.80 per equity share</span> for <b>FY24</b> at the recent <span class='neutral'>annual general meeting</span>. The company will <span class='positive'>pay the dividend</span> to all members as of the <span class='neutral'>record date</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727976236000,
            "Source": "corporate_action"
        }
    ]
}