{
    "Symbol": "PTCIL",
    "ISIN": "INE596F01018",
    "News": [
        {
            "Title": "PTC's Aerolloy Signs MoUs Under PLI Scheme 1.2",
            "Summary": "Aerolloy Technologies, PTC Industries' subsidiary, signed two MoUs with Ministry of Steel under PLI Scheme 1.2 for Titanium Alloys and Super Alloys manufacturing capability.",
            "Sentiment": "positive",
            "PublishDate": 1770710934351,
            "Source": "co_actions_results"
        },
        {
            "Title": "TCIL Blacklists Cisco for Two Years Over Unfair Practices",
            "Summary": "Public sector telecom consultant TCIL has banned Cisco from participating in tenders for two years, alleging unfair practices in Karnataka's KSWAN project bidding process that created monopolistic conditions.",
            "Sentiment": "negative",
            "PublishDate": 1768578053677,
            "Source": "stocks"
        },
        {
            "Title": "PTC Industries arm wins Blue Origin order for BE-4 castings",
            "Summary": "PTC Industries' subsidiary Aerolloy Technologies secured development and supply order from Blue Origin for large superalloy investment castings for New Glenn's BE-4 engines, adding to recent aerospace orders.",
            "Sentiment": "positive",
            "PublishDate": 1767973682409,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC Industries Plans Goldman Sachs Investor Meets",
            "Summary": "PTC Industries Limited announces institutional investor meetings organized by Goldman Sachs scheduled for January 14-15, 2026 in Hong Kong and Singapore, focusing on publicly available information.",
            "Sentiment": "neutral",
            "PublishDate": 1767969662046,
            "Source": "stocks"
        },
        {
            "Title": "PTC Industries Subsidiary Wins Blue Origin Order",
            "Summary": "Aerolloy Technologies Limited, a wholly owned subsidiary of PTC Industries, secured a development and supply contract from Blue Origin for large superalloy investment castings for New Glenn's BE-4 engines.",
            "Sentiment": "positive",
            "PublishDate": 1767968829984,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC Industries soars on Blue Origin rocket order win",
            "Summary": "PTC Industries shares jumped 2.50% after subsidiary Aerolloy Technologies secured development and supply order from Blue Origin for superalloy investment castings for New Glenn rocket's BE-4 engines.",
            "Sentiment": "positive",
            "PublishDate": 1767963391832,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC's Aerolloy Wins Blue Origin Order for BE-4 Engines",
            "Summary": "Aerolloy Technologies, PTC Industries' subsidiary, secures development and supply order from Blue Origin for large superalloy investment castings for New Glenn's BE-4 engines, marking strategic entry into orbital launch systems.",
            "Sentiment": "positive",
            "PublishDate": 1767947387556,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC Industries' Aerolloy Wins Blue Origin Order",
            "Summary": "PTC Industries' subsidiary Aerolloy Technologies secures order from Jeff Bezos' Blue Origin for BE-4 engine parts, supplying superalloy investment castings for orbital-class propulsion equipment.",
            "Sentiment": "positive",
            "PublishDate": 1767947116853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Goldman Sachs Bullish on PTC Industries & Eternal",
            "Summary": "Brokerage houses maintain constructive outlook on select stocks across chemicals, aerospace manufacturing, and quick commerce sectors despite market volatility. HDFC Securities highlights Navin Fluorine's growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1767938419817,
            "Source": "stocks"
        },
        {
            "Title": "Goldman Sachs Maintains Buy Rating on PTC Industries",
            "Summary": "Goldman Sachs maintains its Buy recommendation for PTC Industries with a target price of ₹24,725.00, reflecting continued confidence in the company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1767930897488,
            "Source": "stocks"
        },
        {
            "Title": "PTC Industries Completes PAM Furnace Installation",
            "Summary": "Aerolloy Technologies successfully completes plasma arc melting furnace installation at Lucknow facility with 600-tonne annual capacity for titanium alloy ingots, ready for trials and commissioning.",
            "Sentiment": "positive",
            "PublishDate": 1767860803703,
            "Source": "stocks"
        },
        {
            "Title": "PTC Industries Wins 40-Tonne ISRO Titanium Order",
            "Summary": "PTC Industries secured order from VSSC (ISRO) for converting 40 tonnes of Grade 1 Titanium sponge into Ti-6Al-4V alloy ingots using Double VAR process for aerospace applications.",
            "Sentiment": "positive",
            "PublishDate": 1767770111901,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTC Industries' Aerolloy Technologies Secures Long-Term Supply Agreement with Honeywell Aerospace",
            "Summary": "PTC Industries' wholly owned subsidiary Aerolloy Technologies signed a long-term agreement with Honeywell Aerospace Technologies to supply precision Titanium and Superalloy investment castings for aerospace applications including critical aero-engine components. The agreement leverages Aerolloy's integrated manufacturing capabilities and provides dedicated production capacity for Honeywell programs, ensuring long-term stable revenue visibility and strengthening India's position in the global aerospace supply chain.",
            "Sentiment": "positive",
            "PublishDate": 1764915551527,
            "Source": "stock"
        },
        {
            "Title": "PTC Industries Promoter Group Members Execute Share Transfer Through Gift Transaction",
            "Summary": "Ritika Agarwal transferred 25,593 equity shares (0.17% stake) to Anshoo Agarwal through an off-market gift transaction on November 20, 2025. The transfer occurred between promoter group members of PTC Industries Limited, with Anshoo Agarwal's shareholding increasing from 1.06% to 1.23% while Ritika Agarwal's holding reduced to zero.",
            "Sentiment": "neutral",
            "PublishDate": 1763971922225,
            "Source": "corporate_action"
        },
        {
            "Title": "PTC Industries Expands Gujarat Facility with 50,000+ Sq Ft Addition",
            "Summary": "PTC Industries announced the expansion of its Gujarat manufacturing facility, adding over 50,000 square feet of shop floor area. The expansion will increase the company's production capacity and manufacturing footprint at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1763422827373,
            "Source": "stock"
        },
        {
            "Title": "PTC Industries Reports 83% Revenue Growth in H1FY26, Commissions Advanced Manufacturing Facilities",
            "Summary": "PTC Industries delivered strong H1FY26 performance with total income rising 83.2% YoY to Rs. 2,405.4 million and EBITDA growing 22.9% to Rs. 532.8 million, driven by robust order execution across aerospace and defence segments. The company commissioned advanced VAR400 furnace and VIM facility for titanium and superalloy manufacturing, secured Rs. 110 crore order from BrahMos Aerospace, and became the first Indian company to receive DRDO order for Single Crystal Ready-to-Fit Turbine Blades.",
            "Sentiment": "positive",
            "PublishDate": 1763203676168,
            "Source": "earnings"
        },
        {
            "Title": "PTC Industries Reports Strong Q2 FY2026 Results and Allots Employee Stock Options",
            "Summary": "PTC Industries' Board approved unaudited financial results for the quarter and half-year ended September 30, 2025, showing consolidated revenue of Rs 12,462.54 lakhs and net profit of Rs 1,808.49 lakhs for Q2. The company also allotted 8,423 equity shares under its employee stock option scheme at Rs 402 per share, increasing paid-up share capital to Rs 14,99,25,490.",
            "Sentiment": "positive",
            "PublishDate": 1763057419755,
            "Source": "corporate_action"
        },
        {
            "Title": "PTC Industries Secures DRDO-GTRE Order for Single-Crystal Turbine Blades",
            "Summary": "PTC Industries has secured an order from DRDO-GTRE for single-crystal turbine blades. This development represents a significant breakthrough in defence manufacturing for the company.",
            "Sentiment": "positive",
            "PublishDate": 1761523711815,
            "Source": "stock"
        },
        {
            "Title": "PTC Industries Secures Order from GTRE for Single Crystal Turbine Blades",
            "Summary": "PTC Industries received an order from GTRE for single crystal turbine blades. The company has become the first Indian firm to manage post-cast operations for these components. This development strengthens PTC Industries' partnership with GTRE as part of the Aatmanirbhar Bharat Initiative.",
            "Sentiment": "positive",
            "PublishDate": 1761201655654,
            "Source": "stock"
        },
        {
            "Title": "PTC Industries Signs MoU with Bharat Dynamics to Form Joint Venture for Advanced Propulsion Systems",
            "Summary": "PTC Industries Limited signed a Memorandum of Understanding with Bharat Dynamics Limited to establish a Joint Venture Company for designing, developing and manufacturing complete propulsion systems, guided bombs, and aero-engines for missiles, UAVs and loitering munitions. The agreement is subject to regulatory approvals. The MoU was exchanged at PTC's Titanium & Superalloys Materials Plant inauguration ceremony in Lucknow, attended by Defence Minister Rajnath Singh and Uttar Pradesh Chief Minister Yogi Adityanath. The collaboration aims to reduce dependence on foreign suppliers and enhance domestic manufacturing capabilities including liquid and solid rocket motors, ramjet and turbojet engines. The joint venture will combine Bharat Dynamics' systems expertise with PTC's materials and precision-engineering capabilities to support the Make in India initiative.",
            "Sentiment": "positive",
            "PublishDate": 1761073696968,
            "Source": "order&deals"
        },
        {
            "Title": "PTC Industries Partners with Bharat Dynamics for Advanced Propulsion and Aero-Engine Manufacturing Joint Venture",
            "Summary": "PTC Industries has signed an agreement with Bharat Dynamics to establish a joint venture focused on manufacturing advanced propulsion systems and aero-engines. The partnership aims to combine both companies' capabilities in the aerospace and defense manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1760928998106,
            "Source": "order&deals"
        },
        {
            "Title": "PTC Industries Inaugurates Titanium & Superalloys Plant Through Subsidiary Aerolloy Technologies",
            "Summary": "PTC Industries Limited held the Lokarpan Ceremony for its Titanium & Superalloys Materials Plant through wholly owned subsidiary Aerolloy Technologies Limited on October 18, 2025. The ceremony took place at the U.P. Defence Industrial Corridor in Lucknow and was attended by Defence Minister Rajnath Singh and Uttar Pradesh Chief Minister Yogi Adityanath. The facility features state-of-the-art technologies for producing high-performance Titanium and Superalloy materials for defence, aerospace, and industrial sectors. The plant represents a milestone in India's self-reliance in strategic materials manufacturing and aligns with the Aatmanirbhar Bharat initiative.",
            "Sentiment": "positive",
            "PublishDate": 1760783852073,
            "Source": "stock"
        },
        {
            "Title": "PTC Industries' UK Subsidiary Secures Multi-Million-Pound Clean-Tech Partnership",
            "Summary": "PTC Industries' UK subsidiary Trac Precision Solutions has secured a multi-million-pound partnership with Coolbrook. The partnership involves supplying components for Coolbrook's RotoDynamic Heater, which is described as a breakthrough clean-tech solution.",
            "Sentiment": "positive",
            "PublishDate": 1759405951848,
            "Source": "stock"
        },
        {
            "Title": "PTC Industries' Trac Precision Solutions Announces Strategic Expansion with Advanced Manufacturing Technology Investments",
            "Summary": "Trac Precision Solutions, a wholly owned step-down subsidiary of PTC Industries Limited, announced strategic capital investments to enhance manufacturing capabilities for aerospace and industrial gas turbine customers. The expansion includes introduction of new generation Electrical Discharge Machining (EDM) systems from Sodick for precision manufacturing of turbine blade and vane features, orders for Makino Deep Hole Drilling machines for creating cooling passages in turbine components, and installation of a Modula automated storage and retrieval system. The investments aim to strengthen Trac's aero-engine and power generation capabilities, enabling greater capacity and precision for producing turbine blades and vanes. Managing Director Liam Bevington stated the technology represents industry-leading innovation for demanding blade and vane applications. Chairman & Managing Director Sachin Agarwal emphasized the vision to create globally relevant advanced manufacturing capabilities and support technological self-reliance while strengthening the group's position as a strategic partner for next-generation engine programs.",
            "Sentiment": "positive",
            "PublishDate": 1759232297635,
            "Source": "stock"
        },
        {
            "Title": "PTC Industries Targets 10-15x Revenue Growth Over Five Years, Plans Major Titanium Expansion",
            "Summary": "PTC Industries is targeting 10-15x topline growth over the next five to seven years, with 90-100% revenue growth expected in FY26. Chairman and Managing Director Sachin Agarwal outlined plans for broad-based growth including tripling revenue at the company's Trac Precision arm. The Lucknow-based manufacturer of high-precision castings for aerospace, defense and energy sectors is focusing heavily on titanium expansion, planning 6,000-6,200 TPA capacity in the first phase with expected revenue of Rs 30-40 crore from the titanium stream. The company has an ongoing capex of Rs 1,000 crore for its Lucknow facility and is currently fully funded for this expansion. PTC Industries specializes in manufacturing complex parts from advanced alloys and sees titanium as key for future growth due to its applications in civil aviation and defense sectors.",
            "Sentiment": "positive",
            "PublishDate": 1759135539718,
            "Source": "stock"
        },
        {
            "Title": "Aerolloy Technologies Commissions Large Vacuum Arc Remelting Furnace for Titanium Castings",
            "Summary": "Aerolloy Technologies Limited, a wholly owned subsidiary of PTC Industries Limited, announced the successful commissioning of its Vacuum Arc Remelting (VAR) 400 Furnace at its Aerospace Precision Castings Plant in Lucknow. The facility enables Aerolloy to manufacture some of the largest Titanium castings globally, making it one of only two companies worldwide capable of producing large investment castings in both Titanium alloys and Superalloys. The castings are critical for aeroengines components including Fan Hub Frames, Intermediate Casings, and Turbine Rear Frames, as well as applications in aircraft, submarines, artillery systems, and space platforms. Chairman Sachin Agarwal highlighted that this capability positions Aerolloy to expand its role in the global aerospace supply chain while reducing India's reliance on imported critical castings. The commissioning follows the recent installation of a Vacuum Induction Melting furnace for Superalloy castings, creating an integrated supply chain from materials to precision castings.",
            "Sentiment": "positive",
            "PublishDate": 1758180980252,
            "Source": "stock"
        },
        {
            "Title": "Aerolloy Technologies Opens New Advanced Manufacturing Facility",
            "Summary": "Aerolloy Technologies has opened a new facility specializing in advanced vacuum induction melting of superalloys and large castings. The facility represents an expansion in the company's manufacturing capabilities for specialized metal processing.",
            "Sentiment": "positive",
            "PublishDate": 1756791324182,
            "Source": "stock"
        },
        {
            "Title": "PTC Industries Appoints Baljinder Singh Koura as VP Operations at Aerospace Subsidiary",
            "Summary": "PTC Industries Limited announced the appointment of Baljinder Singh Koura as Vice President – Operations, Aerospace Castings at Aerolloy Technologies Limited, its wholly-owned subsidiary. Koura brings over three decades of leadership experience in operations, manufacturing, supply chain management, and turnaround programmes across aerospace, automotive, and industrial sectors. He has held senior leadership roles with Rolls-Royce, GE Aviation, and Unipol Group, managing operations across the UK, India, Europe, and Mexico. At Aerolloy Technologies, he will lead operational excellence, strengthen plant performance, and support the company's scaling journey in aerospace castings to meet growing demands of global OEMs. Koura holds an MBA from De Montfort University and advanced qualifications in Quality and Environmental Management. The appointment reinforces PTC's focus on strengthening leadership depth as it continues expanding its Strategic Materials Technology Complex and aerospace and defence manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1756100088017,
            "Source": "corporate_governance"
        },
        {
            "Title": "PTC Industries Wins ₹100+ Crore Order from BrahMos Aerospace for Titanium Components",
            "Summary": "PTC Industries has secured an order worth over ₹100 crores from BrahMos Aerospace for supplying titanium parts. The contract involves important titanium components for BrahMos Aerospace's operations.",
            "Sentiment": "positive",
            "PublishDate": 1755762273430,
            "Source": "order&deals"
        },
        {
            "Title": "PTC Industries Reports 113% Revenue Growth in Q1 FY26, Signs MoU with Safran Aircraft Engines",
            "Summary": "PTC Industries delivered strong Q1 FY26 results with total income rising 113% year-over-year to ₹107.7 crores from ₹50.5 crores. EBITDA increased 41% to ₹19.4 crores, though margins compressed to 18.0% from 27.1%. Profit after tax grew 5% to ₹5.2 crores with margins declining to 4.8% from 9.7%. The company's subsidiary Aerolloy Technologies achieved 161% revenue growth with 61.6% EBITDA margins. However, UK subsidiary Trac Precision Solutions reported an EBITDA loss of GBP 4.55 million due to supply chain constraints. Key developments included signing a memorandum of understanding with Safran Aircraft Engines for manufacturing military aircraft engine components, participation in Paris Air Show 2025, and achieving multiple quality certifications including ISO 14001:2015 and ISO 45001:2018. Chairman Sachin Agarwal stated the company remains on track to achieve budgeted revenue and EBITDA targets for the year.",
            "Sentiment": "positive",
            "PublishDate": 1755024681402,
            "Source": "earnings"
        },
        {
            "Title": "PTC Industries and Kineco Aerospace & Defence Form Strategic Partnership",
            "Summary": "PTC Industries has entered into a strategic partnership with Kineco Aerospace & Defence to enhance aerospace components. The collaboration aims to strengthen capabilities in the aerospace sector through combined expertise and resources.",
            "Sentiment": "positive",
            "PublishDate": 1754992097842,
            "Source": "order&deals"
        },
        {
            "Title": "PTC Industries Reports 113% Revenue Growth in Q1 FY26, Driven by Aerolloy Technologies Performance",
            "Summary": "PTC Industries announced strong Q1 FY26 results with total income rising 113.2% year-on-year to Rs 1,077 million. EBITDA grew 41.3% to Rs 194 million, though margin declined to 18.0% from 27.1% in the previous year. Profit after tax increased 5.3% to Rs 52 million. The company's subsidiary Aerolloy Technologies delivered robust performance with revenue increasing 161% and EBITDA rising 186%. During the quarter, Aerolloy Technologies signed an MOU with Safran Aircraft Engines to develop domestic defense aerospace ecosystem in India, including manufacturing components for military aircraft engines. The company participated in Paris Air Show 2025 and engaged in discussions expected to translate into new alliances. Chairman Sachin Agarwal stated the company remains on track to achieve budgeted targets with major capacity expansions progressing on schedule.",
            "Sentiment": "positive",
            "PublishDate": 1754840088322,
            "Source": "earnings"
        },
        {
            "Title": "PTC Industries Reports Mixed Q1 Results with Revenue Surge and Margin Decline",
            "Summary": "PTC Industries reported quarterly results showing revenue of 971 million rupees compared to 469 million rupees in the previous year, representing significant growth. However, EBITDA declined to 88 million rupees from 101 million rupees year-over-year, while EBITDA margin compressed to 9.05% from 21.44%. Consolidated net profit increased to 52 million rupees from 49 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754662760386,
            "Source": "earnings"
        },
        {
            "Title": "PTC Industries Reports Q1 FY2026 Results and Approves Key Management Re-appointments",
            "Summary": "PTC Industries Limited approved its unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs. 9,714.63 lakhs and profit after tax of Rs. 515.56 lakhs, with basic earnings per share of Rs. 3.44. On a standalone basis, revenue from operations was Rs. 5,117.92 lakhs with profit after tax of Rs. 818.11 lakhs and basic earnings per share of Rs. 5.46. The Board also approved the re-appointment of four key executives: Mr. Sachin Agarwal as Chairman & Managing Director for five years (October 2025 to September 2030), and Mr. Alok Agarwal, Mr. Priya Ranjan Agarwal, and Ms. Smita Agarwal as Whole Time Directors for three years (October 2025 to September 2028). These re-appointments are subject to shareholder approval at the upcoming 62nd Annual General Meeting. The company invested Rs. 7,905 lakhs in equity shares of its wholly owned subsidiary Aerolloy Technologies Limited during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754650701323,
            "Source": "earnings"
        },
        {
            "Title": "PTC Industries: Subsidiary Signs MoU for Military Aircraft Engine Components",
            "Summary": "PTC Industries' subsidiary, Aerolloy Technologies Ltd., signed an MoU with Safran Aircraft Engines to cooperate on manufacturing components and materials for military aircraft engines. This collaboration aims to enhance India's capabilities in military aircraft engine manufacturing and aligns with the 'Make in India' initiative.",
            "Sentiment": "positive",
            "PublishDate": 1750813761000,
            "Source": "corporate_action"
        },
        {
            "Title": "PTC Industries' Subsidiary Signs MoU with Safran Aircraft Engines",
            "Summary": "PTC Industries' subsidiary, Aerolloy Technologies, has signed a Memorandum of Understanding (MoU) with Safran Aircraft Engines. The agreement aims to develop the domestic defense aerospace ecosystem in India. This collaboration between the Indian company and the French aircraft engine manufacturer is likely to boost local capabilities in the aerospace sector.",
            "Sentiment": "positive",
            "PublishDate": 1750810108000,
            "Source": "default"
        },
        {
            "Title": "PTC Industries' Subsidiary Signs Agreement with Safran Aircraft Engines",
            "Summary": "PTC Industries' subsidiary AeroLoy Tech has signed an agreement with Safran Aircraft Engines. The partnership aims to develop the local defense and aerospace industry in India. This collaboration is expected to contribute to the growth of India's aerospace sector.",
            "Sentiment": "positive",
            "PublishDate": 1750765419000,
            "Source": "default"
        },
        {
            "Title": "PTC Industries Reports Q4 Financial Results",
            "Summary": "PTC Industries has announced its Q4 consolidated financial results. The company's net profit for the quarter stands at 246 million rupees, compared to 147.2 million rupees year-over-year and 142 million rupees quarter-over-quarter. The Q4 revenue is reported at 1.2 billion rupees, up from 724 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748823141000,
            "Source": "default"
        },
        {
            "Title": "PTC Industries Reports Q4 Financial Results",
            "Summary": "PTC Industries has released its Q4 financial results. The company's EBITDA increased to 287 million rupees from 218.6 million rupees year-over-year. However, the EBITDA margin decreased to 23.56% from 30.19% year-over-year. Consolidated net profit rose to 246 million rupees, up from 147.2 million rupees year-over-year and 142 million rupees quarter-over-quarter. Revenue for Q4 increased to 1.2 billion rupees from 724 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748619041000,
            "Source": "result"
        },
        {
            "Title": "PTC Industries' Subsidiary Secures Major Order from Safran Aircraft Engines",
            "Summary": "PTC Industries has announced that its subsidiary, Aerolloy Technologies, has secured a significant order from Safran Aircraft Engines. This development indicates a positive business opportunity for the company in the aerospace sector.",
            "Sentiment": "positive",
            "PublishDate": 1743148937000,
            "Source": "order&deals"
        },
        {
            "Title": "PTC Industries: Aerospace Facility Expansion and Titanium Sponge Manufacturing MoU",
            "Summary": "PTC Industries, part of Mukul Agrawal's portfolio, highlighted a new 25,000 sqm aerospace castings facility in Lucknow and signed an MoU with Odisha Government for a Titanium Sponge Manufacturing Facility. The company serves civil aviation, defense, and space sectors.",
            "Sentiment": "positive",
            "PublishDate": 1740561667000,
            "Source": "normal_news"
        },
        {
            "Title": "PTC Industries: Stock Surges 179x in Nine Years",
            "Summary": "PTC Industries stock has risen from ₹64.65 to ₹11,635 over nine years, representing a 179-fold increase. The company reported a 76% YoY increase in Q3FY25 net profit to ₹14.24 crore, with revenue growing 20.6% YoY to ₹66.92 crore. Ace investor Mukul Agarwal holds a 1.07% stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1739861761000,
            "Source": "normal_news"
        },
        {
            "Title": "PTC Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "PTC Industries has reported a decrease in its third quarter EBITDA, which fell to 153 million rupees from 189 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 22.80% from 32.10% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739544774000,
            "Source": "earnings"
        },
        {
            "Title": "PTC Industries Reports Strong Q3 Financial Results",
            "Summary": "PTC Industries has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 142 million rupees, up from 81 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 669 million rupees compared to 554 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739544769000,
            "Source": "earnings"
        },
        {
            "Title": "PTC Industries: Aerospace MoU with Odisha Boosts Share Price",
            "Summary": "PTC Industries signed an MoU with the Odisha government to establish an Aerospace-Grade Titanium Sponge Manufacturing Facility. The company's share price jumped nearly 5% in intraday trading, reaching ₹13,988.10. This initiative positions PTC Industries as one of the few companies globally with an integrated Titanium manufacturing value chain.",
            "Sentiment": "positive",
            "PublishDate": 1738306164000,
            "Source": "corporate_action"
        },
        {
            "Title": "PTC Industries: Leveraging Global Titanium Shortages Amid Russia Sanctions",
            "Summary": "PTC Industries aims to capitalize on global titanium supply disruptions caused by sanctions on Russia. The company has commissioned India's first private sector Vacuum Arc Remelting furnace for aerospace-grade titanium alloy production. ICICI Securities has a buy rating with a target price of ₹20,070. PTC plans to expand its titanium alloy capacity to 6,700 tonnes per annum and is developing a new facility in the Uttar Pradesh Defence Industrial Corridor.",
            "Sentiment": "positive",
            "PublishDate": 1737515660000,
            "Source": "normal_news"
        },
        {
            "Title": "PTC Industries: Ambitious Titanium Capacity and Revenue Targets Set for FY26",
            "Summary": "PTC Industries aims to achieve a titanium capacity of 6,500 tonnes and revenue of up to ₹4,000 crore by fiscal year 2026, according to the company's Chairman.",
            "Sentiment": "positive",
            "PublishDate": 1735912792000,
            "Source": "normal_news"
        },
        {
            "Title": "PTC Industries: Subsidiary Achieves Aerospace-Grade Titanium Production Milestone",
            "Summary": "PTC Industries' subsidiary, Aerolloy Technologies, becomes the first Indian private company to produce aerospace-grade titanium alloy ingots using a vacuum arc remelting furnace. The company's stock rose 10% to a 4-month high of ₹14,466 following this announcement. PTC Industries is expanding its aerospace capabilities with new investments and has secured orders from international aerospace companies.",
            "Sentiment": "positive",
            "PublishDate": 1735899676000,
            "Source": "normal_news"
        },
        {
            "Title": "PTC Industries: First Indian Private Firm to Produce Aerospace-Grade Titanium",
            "Summary": "PTC Industries' subsidiary Aerolloy Technologies has commissioned India's first private Vacuum Arc Remelting furnace for aerospace-grade titanium alloy ingots, with 1,500 MT annual capacity. This puts India among select nations capable of manufacturing high-grade titanium alloys for aerospace applications.",
            "Sentiment": "positive",
            "PublishDate": 1735723074000,
            "Source": "normal_news"
        },
        {
            "Title": "PTC Industries Announces New VAR Furnace with 1,500 MT Annual Melting Capacity",
            "Summary": "PTC Industries has reported the acquisition of a new VAR (Vacuum Arc Remelting) furnace. This advanced equipment boasts an impressive annual melting capacity of 1,500 metric tons, significantly enhancing the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1735719848000,
            "Source": "corporate_action"
        }
    ]
}