{
    "Symbol": "PTL",
    "ISIN": "INE034D01049",
    "News": [
        {
            "Title": "PTL Enterprises Q3FY26 Results & Interim Dividend",
            "Summary": "PTL Enterprises reported Q3FY26 net profit of ₹892.79 lakhs and declared 150% interim dividend of ₹1.50 per share. Board also appointed new internal auditor.",
            "Sentiment": "positive",
            "PublishDate": 1770209039829,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTL Enterprises Board Meet on Feb 4 for Q3 Results",
            "Summary": "PTL Enterprises Limited has scheduled its board meeting for February 4, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration with record date set for February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769169723699,
            "Source": "co_actions_results"
        },
        {
            "Title": "PTL Enterprises Reports Strong Quarterly Performance with Revenue of ₹600.18 Crores",
            "Summary": "PTL Enterprises announced unaudited financial results for the quarter and half year ended September 30, 2025, showing revenue from operations of ₹600.18 crores and net profit of ₹2,419.65 crores for the quarter. The company's board approved these results during their meeting on November 13, 2025, with the primary business being income from lease of plant to Apollo Tyres Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1763043574476,
            "Source": "earnings"
        },
        {
            "Title": "PTL Enterprises Reports 6.3% Growth in Q2 Net Profit to 147.7M Rupees",
            "Summary": "PTL Enterprises posted a net profit of 147.7 million rupees in Q2, up from 139 million rupees in the same period last year. Revenue increased to 181 million rupees from 161 million rupees year-over-year. However, EBITDA declined to 144.4 million rupees from 146.2 million rupees, while EBITDA margin compressed to 79.85% from 90.83% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1763036008985,
            "Source": "earnings"
        },
        {
            "Title": "PTL Enterprises Reports 77% Jump in Q1 Net Profit to 92 Million Rupees",
            "Summary": "PTL Enterprises posted a net profit of 92 million rupees in Q1, representing a significant increase from 52 million rupees in the same period last year. The company's revenue remained flat at 161 million rupees compared to the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754569597691,
            "Source": "earnings"
        },
        {
            "Title": "PTL Enterprises Approves Q1 FY26 Results and Announces Board Changes",
            "Summary": "PTL Enterprises Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reported earnings per share of Rs. 2.74 for the quarter. Mr. Birendra Kumar Singh, Independent Director, will cease to be a Board member on August 10, 2025, upon expiry of his second five-year term. He will also step down from his positions on the Audit Committee, Nomination and Remuneration Committee, Committee of Directors (Investments/Loans), and Business Responsibility Committee. The Board has appointed replacement directors to fill these committee positions: Mr. Ranganayakulu Jagarlamudi joins the Audit Committee, Mrs. Sonali Sen joins the Nomination & Remuneration Committee, and Mr. Tapan Mitra joins the Committee of Directors and becomes Chairman of the Business Responsibility Committee. The company's operations primarily comprise income from lease of plant to Apollo Tyres Ltd. The Board meeting was held on August 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754565708255,
            "Source": "earnings"
        },
        {
            "Title": "PTL Enterprises Reports Mixed Q1 Results with Profit Growth Despite Revenue Decline",
            "Summary": "PTL Enterprises posted net profit of 92 million rupees in Q1, representing a year-over-year increase from 82 million rupees. However, the company's revenue declined to 161 million rupees compared to 181 million rupees in the same period last year. The results show improved profitability margins despite lower top-line performance.",
            "Sentiment": "neutral",
            "PublishDate": 1754564104438,
            "Source": "earnings"
        },
        {
            "Title": "PTL Enterprises Approves Q1 Financial Results and Announces Board Changes",
            "Summary": "PTL Enterprises Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company announced that Independent Director Mr. Birendra Kumar Singh will cease to be a Board member on August 10, 2025, following the expiry of his second five-year term. Singh will also step down from his positions on the Audit Committee, Nomination and Remuneration Committee, Committee of Directors (Investments/Loans), and Business Responsibility Committee. The Board has appointed replacements: Mr. Ranganayakulu Jagarlamudi as member of the Audit Committee, Mrs. Sonali Sen as member of the Nomination & Remuneration Committee, and Mr. Tapan Mitra as member of the Committee of Directors and Chairman of the Business Responsibility Committee. The company's primary business segment involves income from lease of plant to Apollo Tyres Ltd. The statutory auditors provided an unmodified conclusion on the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1754563944458,
            "Source": "corporate_action"
        },
        {
            "Title": "PTL Enterprises Reports Q4 Results and Recommends Dividend",
            "Summary": "PTL Enterprises has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue was 160.7 million rupees, slightly down from 161 million rupees year-over-year. However, consolidated net profit increased to 87.6 million rupees, up from 56 million rupees year-over-year and 84 million rupees quarter-over-quarter. Additionally, the company has recommended a final dividend of 1.75 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747237303000,
            "Source": "result"
        }
    ]
}