{
    "Symbol": "PUNJABCHEM",
    "ISIN": "INE277B01014",
    "News": [
        {
            "Title": "Punjab Chemicals Releases Q3 FY26 Call Transcript",
            "Summary": "Punjab Chemicals and Crop Protection Limited has made available the transcript of its earnings conference call for Q3 and nine months ended December 31, 2025, held on January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770209793617,
            "Source": "co_actions_results"
        },
        {
            "Title": "Punjab Chemicals Q3 Net Profit Surges 126% YoY",
            "Summary": "Punjab Chemicals & Crop Protection reported consolidated net profit of ₹138 million in Q3, marking a significant 126% increase from ₹61 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769589600295,
            "Source": "co_actions_results"
        },
        {
            "Title": "Punjab Chemicals Schedules Q3FY26 Results Call",
            "Summary": "Punjab Chemicals and Crop Protection Limited has scheduled a post-results conference call for January 29, 2026, to discuss Q3FY26 financial performance and business developments.",
            "Sentiment": "neutral",
            "PublishDate": 1768990217881,
            "Source": "co_actions_results"
        },
        {
            "Title": "Punjab Chemicals Reports 28% Drop in Q2 Profit to Rs 1,392 Lakhs",
            "Summary": "Punjab Chemicals and Crop Protection Limited reported a net profit of Rs 1,392 lakhs for the quarter ended September 30, 2025, compared to Rs 1,937 lakhs in the same period last year, marking a 28% decline. Revenue from operations decreased to Rs 25,788 lakhs from Rs 26,245 lakhs year-over-year. For the half-year period, profit declined to Rs 3,977 lakhs from Rs 4,863 lakhs in the previous year. The company received favorable final orders from ITAT for assessment years 2008-09 and 2009-10, resulting in interest income of Rs 282 lakhs and reversal of income tax provision of Rs 200 lakhs. The Board approved a final dividend of Rs 3.00 per equity share for FY2025, which was distributed during the quarter. The company operates in the single segment of Performance Chemicals and includes results from its wholly-owned subsidiary SD Agchem (Europe) N.V.",
            "Sentiment": "negative",
            "PublishDate": 1762195567303,
            "Source": "earnings"
        },
        {
            "Title": "Punjab Chemicals Reports 49% Jump in Q2 Net Profit to 185M Rupees",
            "Summary": "Punjab Chemicals and Crop Protection reported Q2 consolidated net profit of 185 million rupees compared to 124 million rupees in the same period last year. Revenue increased to 2.55 billion rupees from 2.4 billion rupees year-over-year. EBITDA rose to 262 million rupees from 256 million rupees, though EBITDA margin declined slightly to 10.3% from 10.6% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762160857876,
            "Source": "earnings"
        },
        {
            "Title": "Punjab Chemicals CFO Vikash Khanna Resigns Due to Personal Commitments",
            "Summary": "Vikash Khanna has resigned from his position as Chief Financial Officer of Punjab Chemicals and Crop Protection Limited due to personal commitments. The resignation was tendered on September 12, 2025, and the management has accepted it. Khanna will be relieved from his duties within the stipulated time as per his appointment terms and company rules. The management has initiated the process to find a replacement for the CFO position.",
            "Sentiment": "neutral",
            "PublishDate": 1757697408688,
            "Source": "corporate_governance"
        },
        {
            "Title": "Punjab Chemicals Appoints Two Independent Directors and New Secretarial Auditors for Five-Year Terms",
            "Summary": "Punjab Chemicals and Crop Protection Limited appointed two new Independent Directors at its 49th Annual General Meeting held on July 29, 2025. Mr. Kapil Kumar Mehan and Mr. Suresh Arora were both appointed for five-year terms from April 30, 2025 to April 29, 2030. Mr. Mehan brings extensive experience in agribusiness, fertilizers, and chemicals sectors, having served as Group CEO of Adventz Group and Managing Director of Coromandel International Limited. Mr. Arora is a retired IPS officer with over four decades of administrative experience, having served as Director General of Police, Punjab and Chief Information Commissioner, Punjab. Additionally, the company appointed M/s P.S. Dua & Associates as Secretarial Auditors for a five-year term from April 1, 2025 to March 31, 2030. Both directors hold no equity shares in the company and are not related to any existing directors.",
            "Sentiment": "positive",
            "PublishDate": 1753804302895,
            "Source": "corporate_governance"
        },
        {
            "Title": "Punjab Chemicals Signs 3 Export MOUs, Plans Rs 60 Crore Expansion",
            "Summary": "Punjab Chemicals and Crop Protection Limited signed 3 exclusive MOUs with overseas customers for high value agrochemical products and intermediates, planning to commercialize these products over the next 12-18 months. The company will invest approximately Rs 60 crore at its existing site to build two new manufacturing blocks, targeting the Japanese and European markets. The expansion aims to cater to increased demand for existing products and new product pipeline. Punjab Chemicals expects sales from this segment to reach Rs 120-150 crore over the next two to three years. The strategic initiative will unfold over two years and is expected to significantly boost the company's revenue. Additionally, the company is searching for a new site to support growing operations. Managing Director Shalil Shroff stated this represents the beginning of a new growth phase, highlighting success in product development, R&D and market access efforts.",
            "Sentiment": "positive",
            "PublishDate": 1753710370811,
            "Source": "stock"
        },
        {
            "Title": "Punjab Chemicals Reports 54% Jump in Q1 Net Profit Despite Margin Decline",
            "Summary": "Punjab Chemicals and Crop Protection reported strong quarterly results with net profit rising to 206 million rupees from 134 million rupees year-over-year, marking a 54% increase. Revenue grew significantly to 3.2 billion rupees compared to 2.4 billion rupees in the same period last year. EBITDA increased to 344 million rupees from 275 million rupees year-over-year. However, EBITDA margin declined to 10.75% from 11.36% in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1753708665777,
            "Source": "earnings"
        },
        {
            "Title": "Punjab Chemicals and Crop Protection Reports Strong Q4 Results and Dividend",
            "Summary": "Punjab Chemicals and Crop Protection announced its Q4 financial results, showing significant year-over-year improvements. The company's revenue increased to 2 billion rupees from 1.96 billion rupees. EBITDA saw a substantial rise to 255 million rupees from 132 million rupees, with the EBITDA margin improving to 12.61% from 6.73%. Consolidated net profit grew to 71 million rupees from 24 million rupees. Additionally, the company approved a dividend of 3 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746002622000,
            "Source": "result"
        },
        {
            "Title": "Punjab Chemicals and Crop Protection Reports Q3 Revenue",
            "Summary": "Punjab Chemicals and Crop Protection has announced its third-quarter revenue results. The company reported revenue of 2.14 billion rupees, compared to 2.1 billion rupees in the same quarter of the previous year, indicating a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1738054099000,
            "Source": "earnings"
        },
        {
            "Title": "Punjab Chemicals and Crop Protection Reports Q3 Financial Results",
            "Summary": "Punjab Chemicals and Crop Protection has released its Q3 financial results. The company's EBITDA for the quarter stood at 193 million rupees, down from 260 million rupees in the same quarter last year. The EBITDA margin also decreased to 9% from 12.15% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738053855000,
            "Source": "earnings"
        },
        {
            "Title": "Punjab Chemicals & Crop Protection: Q2 Profit Drops 31.73% YoY",
            "Summary": "Punjab Chemicals & Crop Protection reported Q2 FY25 results on 28 Jan, 2025. Profit decreased by 31.73% YoY to ₹12.37 crore, while revenue slightly declined by 0.02% to ₹242.13 crore. Operating income fell by 34.87% YoY. EPS for Q2 is ₹10.09, down 31.73% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1738023505000,
            "Source": "earnings"
        },
        {
            "Title": "Punjab Chemicals and Crop Protection Reports Q2 EBITDA Decline",
            "Summary": "Punjab Chemicals and Crop Protection has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 256 million rupees, down from 345 million rupees in the same quarter last year. The EBITDA margin decreased to 10.57% from 14.62% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730102464000,
            "Source": "result"
        },
        {
            "Title": "Punjab Chemicals and Crop Protection Reports Q2 Financial Results",
            "Summary": "Punjab Chemicals and Crop Protection has announced its Q2 financial results. The company reported a consolidated net profit of 124 million rupees, down from 181 million rupees in the same quarter last year. Revenue remained stable at 2.4 billion rupees, unchanged from the previous year's Q2.",
            "Sentiment": "neutral",
            "PublishDate": 1730102423000,
            "Source": "result"
        }
    ]
}