{
    "Symbol": "PURVA",
    "ISIN": "INE323I01011",
    "News": [
        {
            "Title": "Puravankara Q3FY26 Results: Strong Recovery with Profit",
            "Summary": "Puravankara Limited reported consolidated revenue of Rs. 1,069.31 crore and net profit of Rs. 58.34 crore for Q3FY26, marking a strong turnaround from previous quarter losses.",
            "Sentiment": "positive",
            "PublishDate": 1770904582424,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara Opens Special Window for Share Transfer",
            "Summary": "Puravankara Limited announces special window for transfer and dematerialisation of physical securities from February 05, 2026 to February 04, 2027, following SEBI circular dated January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770457667947,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara Q3FY26 Results Call on Feb 13",
            "Summary": "Puravankara Limited has scheduled a conference call on February 13, 2026 at 11:00 AM IST to discuss Q3FY26 and 9MFY26 unaudited financial results with senior management.",
            "Sentiment": "neutral",
            "PublishDate": 1770393505058,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara Launches Phase 5 of Provident Equinox",
            "Summary": "Puravankara has launched Phase 5 of its Provident Equinox project in Bengaluru, with the new phase now registered with Karnataka RERA for regulatory compliance.",
            "Sentiment": "positive",
            "PublishDate": 1769498391186,
            "Source": "stocks"
        },
        {
            "Title": "Puravankara shares surge 12% on strong Q3 performance",
            "Summary": "Puravankara shares rallied 12.4% after reporting 22% YoY growth in collections to ₹1,140 crore and 17% increase in sales to ₹1,414 crore for Q3, breaking five-day losing streak.",
            "Sentiment": "positive",
            "PublishDate": 1768374756714,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara shares surge 11% on strong Q3 performance",
            "Summary": "Puravankara shares jumped over 11% after reporting 22% growth in Q3 collections to ₹1,140 crore and 17% increase in sales value to ₹1,414 crore, while subsidiary wins ₹311 crore construction order.",
            "Sentiment": "positive",
            "PublishDate": 1768365795555,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara Q3FY26: Pre-sales Up 17% YoY to ₹1,414 Cr",
            "Summary": "Puravankara Limited reported strong Q3FY26 performance with pre-sales of ₹1,414 crores (17% YoY growth) and collections of ₹1,140 crores (22% YoY growth). The company expanded portfolio with ₹13,900 crores GDV acquisitions in 9MFY26.",
            "Sentiment": "positive",
            "PublishDate": 1768363143813,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara Q3FY26 Pre-Sales Jump 17% to ₹1,414 Cr",
            "Summary": "Puravankara Limited reports strong Q3FY26 performance with pre-sales rising 17% YoY to ₹1,414 crores and collections growing 22% YoY to ₹1,140 crores. Company expands portfolio through acquisitions worth ₹13,900 crores GDV.",
            "Sentiment": "positive",
            "PublishDate": 1768363088615,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara stock rises on ₹311 Cr order win",
            "Summary": "Puravankara shares jumped nearly 2% after its subsidiary Starworth Infrastructure secured a ₹311.18 crore construction contract from Sattva Group for residential project in Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1768294567398,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara unit bags ₹311 cr Bengaluru project",
            "Summary": "Puravankara's subsidiary Starworth Infrastructure wins major residential construction contract worth ₹311.18 crore for Sattva AANGANE project in Bengaluru, to be executed over 37 months.",
            "Sentiment": "positive",
            "PublishDate": 1768287566316,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara Subsidiary Wins ₹311 Cr Construction Deal",
            "Summary": "Starworth Infrastructure & Construction Limited, wholly owned subsidiary of Puravankara Limited, receives Letter of Intent for residential project construction worth ₹311.18 crores in Bangalore with 37-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1768281892909,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara Subsidiary Wins ₹311.18 Cr Project",
            "Summary": "Puravankara Ltd's subsidiary Starworth Infrastructure has secured a Letter of Intent for a project worth approximately ₹311.18 crores, with completion scheduled within 37 months.",
            "Sentiment": "positive",
            "PublishDate": 1768281716177,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara Reports Code of Conduct Violation",
            "Summary": "Puravankara Limited disclosed violation by immediate relative of designated person under SEBI PIT Regulations. Company imposed penalty and directed profit disgorgement to SEBI fund.",
            "Sentiment": "negative",
            "PublishDate": 1767703866288,
            "Source": "stocks"
        },
        {
            "Title": "Puravankara Provides ₹150 Cr Guarantee to Subsidiary",
            "Summary": "Puravankara Limited has provided a corporate guarantee of ₹150 crores to its wholly owned subsidiary Purva Oak Private Limited for commercial paper issuance, creating a contingent liability.",
            "Sentiment": "neutral",
            "PublishDate": 1767249280986,
            "Source": "stocks"
        },
        {
            "Title": "Puravankara Responds to BSE Volume Query",
            "Summary": "Puravankara Limited addressed BSE's inquiry about increased trading volume, citing recent land acquisition disclosure and confirming compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1766574076997,
            "Source": "stocks"
        },
        {
            "Title": "Puravankara Acquires 53.5-Acre Bengaluru Land for ₹4,800 Cr",
            "Summary": "Puravankara Limited announces acquisition of 53.5-acre land parcel in Anekal Taluk, Bengaluru with 6.4 million sq ft saleable area and potential GDV of over ₹4,800 crores, strengthening presence in emerging residential corridor.",
            "Sentiment": "positive",
            "PublishDate": 1766461843255,
            "Source": "stocks"
        },
        {
            "Title": "Puravankara Issues ₹50 Cr Corporate Guarantee",
            "Summary": "Puravankara Limited provides corporate guarantee of ₹50 crores to wholly owned subsidiary Starworth Infrastructure Construction Limited for credit facility enhancement with Axis Bank Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1766130031367,
            "Source": "stocks"
        },
        {
            "Title": "Puravankara Launches Purva Silversky Project in Bengaluru",
            "Summary": "Puravankara Limited officially launches residential project 'Purva Silversky' at Hebbagodi Village, Bengaluru on December 17, 2025. Project registered with Karnataka RERA under registration number PRM/KA/RERA/1251/310/PR/151225/008338.",
            "Sentiment": "positive",
            "PublishDate": 1765963826292,
            "Source": "stocks"
        },
        {
            "Title": "Puravankara Issues ₹25 Cr Corporate Guarantee",
            "Summary": "Puravankara Limited provides corporate guarantee of ₹25 crores to wholly owned subsidiary Starworth Infrastructure Construction Limited for construction equipment purchases from IDFC First Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1765867147606,
            "Source": "stocks"
        },
        {
            "Title": "Puravankara Subsidiary Wins ₹509.52 Cr Construction Order",
            "Summary": "Starworth Infrastructure Construction Limited, wholly owned subsidiary of Puravankara Limited, secures major turnkey construction contract for Varnam Phase 1 project in Bengaluru Rural District worth ₹509.52 crores.",
            "Sentiment": "positive",
            "PublishDate": 1765379960876,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara's Starworth Gets ₹5.1 Billion Contract Nod",
            "Summary": "Puravankara Limited's subsidiary Starworth Infrastructure receives Letter of Award for a significant ₹5.1 billion contract, marking a major business development for the real estate company.",
            "Sentiment": "positive",
            "PublishDate": 1765377425935,
            "Source": "co_actions_results"
        },
        {
            "Title": "Puravankara Allots Second Tranche of NCDs Worth INR 75 Crores",
            "Summary": "Puravankara Limited has allotted 750 non-convertible debentures worth INR 75 crores as the second tranche of its INR 300 crore fundraising program through private placement to identified investors. The debentures have a face value of INR 10 lakhs each and are part of the company's approved debt fundraising initiative with a 60-month tenure from the first allotment date of June 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763700833869,
            "Source": "corporate_action"
        },
        {
            "Title": "Puravankara Signs Agreement to Lease with IKEA for Retail Space at Purva Zentech Park, Bengaluru",
            "Summary": "Puravankara Limited announced signing an Agreement to Lease with IKEA India for two floors of retail space covering more than 1.2 lakh square feet at Purva Zentech Park on Kanakapura Road, Bengaluru. The space is expected to be handed over in Q1 of calendar year 2026, strengthening Puravankara's commercial real estate portfolio in South Bengaluru's high-growth corridor.",
            "Sentiment": "positive",
            "PublishDate": 1763370108442,
            "Source": "stock"
        },
        {
            "Title": "Puravankara Reports 4% Pre-Sales Growth in Q2 FY26 Despite Revenue Recognition Challenges",
            "Summary": "Puravankara Limited reported pre-sales of Rs 1,322 crores in Q2 FY26, marking a 4% increase from Rs 1,270 crores in Q2 FY25, driven entirely by sustenance sales. The company achieved average price realization of Rs 8,814 per square feet, up 7% year-on-year, with customer collections reaching Rs 1,047 crores, an 8% increase. For H1 FY26, pre-sales totaled Rs 2,445 crores (up 4%) and collections hit Rs 1,904 crores (up 1%). Revenue grew to Rs 663 crores compared to Rs 520 crores last year, but the company reported a loss of Rs 42 crores versus Rs 20 crores in Q2 FY25, attributed to timing of revenue recognition under IndAS and strategic investments in new projects. The company added over 6.36 million square feet of developable area with potential GDP of approximately Rs 9,100 crores, including projects in North Bengaluru, Chembur Mumbai, East Bengaluru, and Malabar Hills. Net debt stands at Rs 2,894 crores with debt per square foot at Rs 859 for residential and Rs 252 for commercial projects. The company expects to launch 15.46 million square feet across Mumbai, Bengaluru, Chennai and Pune in H2 FY26, carrying potential of Rs 5,800 crores plus.",
            "Sentiment": "neutral",
            "PublishDate": 1763029051889,
            "Source": "earnings"
        },
        {
            "Title": "India Ratings Affirms Puravankara at IND A-/Stable, Withdraws Debt Instrument Ratings",
            "Summary": "India Ratings and Research affirmed Puravankara Limited's long-term issuer rating at IND A-/Stable while withdrawing ratings for non-convertible debentures worth INR 1,800 million and commercial paper worth INR 1,800 million. The withdrawal follows full repayment of debt instruments and receipt of no-dues certificate. The rating reflects steady growth in annual collections with strong sustenance sales and improved execution efficiency, though pre-sales remained lower than expected due to delayed project launches. The company faces challenges from high leverage due to delayed equity funding for business development and elevated debt from under-construction commercial real estate projects expected to be commercialized by March 2026. Puravankara reported quarterly pre-sales increase of 4.5% to INR 24.6 billion and stable collections at INR 19.0 billion. The company plans to launch 8.48 million square feet of projects by end-FY26 across its brands. Net debt-to-net working capital ratio increased to 0.91x, with total debt expected to reach INR 41 billion by FY26. The agency expects net debt-to-operational cash flow ratio to remain at 3.5x-4.0x through the cycle.",
            "Sentiment": "neutral",
            "PublishDate": 1762933033695,
            "Source": "corporate_action"
        },
        {
            "Title": "Puravankara Reports ₹1,322 Crore Q2 Sales Growth of 4% YoY with 8% Higher Realization",
            "Summary": "Puravankara achieved ₹1,322 crore in Q2 sales, marking a 4% year-over-year increase, alongside 8% higher realization. The company is expanding operations across Mumbai, Bengaluru, and Pune while focusing on affordable housing, joint ventures, and strategic land acquisitions. Puravankara aims to strengthen its balance sheet and improve operating efficiency for sustainable margin expansion in both residential and commercial segments.",
            "Sentiment": "positive",
            "PublishDate": 1762527753099,
            "Source": "stock"
        },
        {
            "Title": "Puravankara Reports Widened Q2 Net Loss Despite Revenue Growth",
            "Summary": "Puravankara reported a consolidated net loss of 430 million rupees in Q2, significantly higher than the 171 million rupee loss in the same period last year. Revenue increased to 6.44 billion rupees from 4.95 billion rupees year-over-year. EBITDA declined to 1.04 billion rupees from 1.12 billion rupees, while EBITDA margin compressed to 16.15% from 22.6% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762517977586,
            "Source": "earnings"
        },
        {
            "Title": "Puravankara Provides Rs 360 Crore Corporate Guarantee for Subsidiary's Debenture Issue",
            "Summary": "Puravankara Limited has provided a corporate guarantee of Rs 360 crores for its wholly owned subsidiary, Grand Hills Developments Private Limited. The guarantee covers non-convertible debentures issued by Grand Hills Developments on a private placement basis to identified investors. The debentures are listed, rated, rupee denominated, and transferable. Puravankara states that the corporate guarantee represents a contingent liability and currently has no impact on the company, as it is provided for a wholly owned subsidiary that is part of the consolidated group.",
            "Sentiment": "neutral",
            "PublishDate": 1762206699368,
            "Source": "corporate_action"
        },
        {
            "Title": "Puravankara Unit Secures Letter of Approval for ₹2.12 Billion Project",
            "Summary": "Puravankara's subsidiary has received a Letter of Approval (LOA) for a project valued at ₹2.12 billion rupees. The development represents a significant project acquisition for the real estate company's unit.",
            "Sentiment": "positive",
            "PublishDate": 1761523745271,
            "Source": "stock"
        },
        {
            "Title": "Puravankara's Subsidiary Starworth Infrastructure Wins ₹211.53 Crore Construction Contract",
            "Summary": "Starworth Infrastructure & Construction Limited, a wholly owned unlisted material subsidiary of Puravankara Limited, has received a Letter of Award for construction work valued at ₹211.53 crores. The contract involves Core & Shell with Finishes works for a proposed residential project called 'SBR Global Queen's Ville' awarded by SBR Builders. This is a domestic contract for residential building construction, with execution timeline as per the Letter of Award. The contract does not involve any promoter group interest in the awarding entity and does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1761309242988,
            "Source": "order&deals"
        },
        {
            "Title": "Puravankara Reports 4% Growth in Pre-Sales to ₹1,322 Crores in Q2 FY26",
            "Summary": "Puravankara reported pre-sales of ₹1,322 crores in Q2 FY26, representing a 4% increase from ₹1,270 crores in Q2 FY25. The company achieved sales volume of 1.50 million square feet in Q2 FY26 and 2.75 million square feet in H1 FY26. Average realization per square foot increased by 7% to ₹8,814 in Q2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1760077486685,
            "Source": "stock"
        },
        {
            "Title": "Puravankara Limited CFO Deepak Rastogi Resigns, Niraj Kumar Gautam Elevated as Replacement",
            "Summary": "Deepak Rastogi has resigned from his position as Group CFO and Key Managerial Personnel of Puravankara Limited, effective September 23, 2025, citing personal reasons. Niraj Kumar Gautam will be elevated from Deputy CFO to CFO and Key Managerial Personnel, effective September 24, 2025, subject to approval from the Nomination and Remuneration Committee and Board of Directors. Gautam brings over 23 years of experience in corporate finance, capital markets, taxation, and investor relations, having led capital raising efforts exceeding INR 15,000 crore in the real estate and infrastructure sector.",
            "Sentiment": "neutral",
            "PublishDate": 1758633815746,
            "Source": "corporate_governance"
        },
        {
            "Title": "Puravankara Secures Major Malabar Hill Project Worth 27 Billion Rupees",
            "Summary": "Puravankara has secured a project in Malabar Hill valued at 27 billion rupees. This represents a significant project acquisition for the real estate company.",
            "Sentiment": "positive",
            "PublishDate": 1756725584825,
            "Source": "stock"
        },
        {
            "Title": "Puravankara Celebrates 50th Anniversary with Special Commemorative Stamp from India Post",
            "Summary": "Puravankara Limited marked its 50-year milestone with the release of a customized 'My Stamp' by India Post. The Golden Jubilee stamp features the years 1975-2025 and showcases iconic buildings from Mumbai and Bengaluru, representing the cities that shaped the company's journey. Founded in 1975 in Mumbai and later headquartered in Bengaluru, Puravankara has expanded to nine cities. The stamp was unveiled by K. Prakash, Chief Postmaster General of Karnataka Postal Circle. Founder & Chairman Ravi Puravankara emphasized the company's foundation built on trust, transparency, and timely delivery, while Additional Director Amanda Puravankara highlighted the company's commitment to embracing new technologies and green practices. As of June 30, 2025, Puravankara has completed 92 projects measuring approximately 54 million square feet across nine cities, with a total land bank of approximately 30 million square feet and ongoing projects totaling 35.75 million square feet.",
            "Sentiment": "positive",
            "PublishDate": 1755064293820,
            "Source": "stock"
        },
        {
            "Title": "Puravankara Reports Rs 539 Crore Revenue with 6% Pre-Sales Growth in Q1 FY2026",
            "Summary": "Puravankara Limited reported quarterly revenue of Rs 539 crores with a net loss of Rs 69 crores and 15% EBITDA margin. The real estate developer achieved pre-sales value of Rs 1,124 crores, marking 6% year-on-year growth, with sales volume of 1.25 million sq ft and average realization of Rs 8,988 per sq ft (9% YoY improvement). Customer collections reached Rs 857 crores. The company maintains net debt of Rs 2,825 crores with a debt-to-equity ratio of 1.68 and cash balance of Rs 718 crores. Bengaluru contributed 50% of sales, while Mumbai and Pune increased their share to 24% from 15% in the previous quarter. The company plans to launch 12.32 million sq ft of development, including 9.22 million sq ft of new projects. Puravankara secured new business development opportunities including redevelopment of 8 housing societies in Mumbai with GDV of Rs 2,100 crores and partnerships in Bengaluru worth over Rs 4,300 crores combined GDV. The company signed an LOI with IKEA for 80,000 sq ft at Rs 150 per sq ft and plans to deliver 4,500+ units in FY2026.",
            "Sentiment": "neutral",
            "PublishDate": 1754976078394,
            "Source": "earnings"
        },
        {
            "Title": "Puravankara Adopts Land Bank Replenishment Strategy Based on Sales Volume",
            "Summary": "Puravankara has outlined its business strategy to replenish its land bank equivalent to its yearly sales volume of 5-7 billion square feet, rather than targeting specific acquisition figures. This approach aligns land acquisition with actual sales performance.",
            "Sentiment": "neutral",
            "PublishDate": 1754883506963,
            "Source": "stock"
        },
        {
            "Title": "Puravankara Plans to Launch 12.32 Million Square Feet Across Multiple Bangalore Projects in Q3/Q4",
            "Summary": "Puravankara announced plans to launch multiple projects in Bangalore during Q3/Q4, though some delays have occurred due to bylaw changes. The company intends to launch a total of 12.32 million square feet, comprising 9.22 million square feet for new projects and 3.1 million square feet for new phases of existing developments.",
            "Sentiment": "positive",
            "PublishDate": 1754883154685,
            "Source": "stock"
        },
        {
            "Title": "Puravankara Sets Ambitious ₹6,000+ Crore Annual Sales Target by FY28",
            "Summary": "Puravankara has announced plans to achieve annual sales exceeding ₹6,000 crore by FY28. The real estate company's strategy includes aggressive land acquisitions, targeting 15-20% annual volume growth, launching projects in both mid-income and luxury segments, and strengthening execution capabilities to maintain market leadership position.",
            "Sentiment": "positive",
            "PublishDate": 1754665845931,
            "Source": "stock"
        },
        {
            "Title": "Puravankara Reports Sharp Decline in Q1 Financial Performance",
            "Summary": "Puravankara's Q1 results showed significant deterioration across key financial metrics. Revenue dropped to 5.2 billion rupees from 6.6 billion rupees year-over-year. EBITDA fell to 670 million rupees compared to 1.3 billion rupees in the same period last year, with EBITDA margin contracting to 12.79% from 19.91%. The company reported a consolidated net loss of 684 million rupees, substantially higher than the 154 million rupees loss recorded in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754656811253,
            "Source": "earnings"
        },
        {
            "Title": "Starworth Infrastructure Wins 835.2 Million Rupee Contract",
            "Summary": "Starworth Infrastructure has secured a contract worth 835.2 million rupees. The contract appears to be related to Puravankara, though specific project details were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1754483872601,
            "Source": "order&deals"
        },
        {
            "Title": "Puravankara Reports Q1FY26 Operational Update with Growth in Pre-Sales and Price Realization",
            "Summary": "Puravankara has released its operational update for Q1FY26. The company reported pre-sales of Rs 1,124 crores, representing a 6% year-over-year increase. Average price realization grew by 9% compared to the previous year. Customer collections for the quarter reached Rs 857 crore. The company aims to complete 2.2 million square feet of commercial projects this year. Additionally, Puravankara has expanded its portfolio with new acquisitions worth Rs 3,100 crores.",
            "Sentiment": "positive",
            "PublishDate": 1752220317000,
            "Source": "default"
        },
        {
            "Title": "Puravankara Announces Joint Development Agreement for 5.5-Acre Land in East Bengaluru",
            "Summary": "Puravankara has announced a joint development agreement for a 5.5-acre land parcel in East Bengaluru. The project has a potential gross development value of over ₹1,000 crore. This agreement represents a significant real estate development opportunity for the company in the Bengaluru market.",
            "Sentiment": "positive",
            "PublishDate": 1752118933000,
            "Source": "default"
        },
        {
            "Title": "Puravankara Selected for Redevelopment Project in Chembur, Mumbai",
            "Summary": "Puravankara has been selected for a redevelopment project in Chembur, Mumbai. The project has a development potential of over 1.2 million square feet and a Gross Development Value (GDV) of 21 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1752019651000,
            "Source": "default"
        },
        {
            "Title": "Puravankara Selected for Redevelopment Project in Chembur, Mumbai",
            "Summary": "Puravankara has been chosen for a redevelopment project in Chembur, Mumbai. The project has a development potential exceeding 1.2 million square feet and a gross development value of 21 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1751974691000,
            "Source": "default"
        },
        {
            "Title": "Puravankara Ltd: Secures Eight Redevelopment Projects in Mumbai Worth Rs 2,100 Crore",
            "Summary": "Puravankara Ltd has won redevelopment orders for eight residential societies in Mumbai's Chembur suburb, with a gross development value of Rs 2,100 crore. The project will unlock over 1.2 million square feet of development potential across four acres.",
            "Sentiment": "positive",
            "PublishDate": 1751973331000,
            "Source": "order&deals"
        },
        {
            "Title": "Puravankara Ltd: Secures Redevelopment Rights in Mumbai, Boosts Portfolio",
            "Summary": "Puravankara Ltd secured redevelopment rights for eight residential societies in Chembur, Mumbai, with a potential of 1.2 million square feet and an estimated gross development value of ₹2,100 crore. This adds to their existing projects in Mumbai and Pune, bringing their total western region portfolio to 14 million square feet with an expected GDV of ₹18,000 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751875101000,
            "Source": "corporate_action"
        },
        {
            "Title": "Puravankara Plans Redevelopment of 8 Mumbai Societies",
            "Summary": "Puravankara, a real estate company, has announced plans to redevelop 8 societies in Mumbai. The projected value of this redevelopment initiative is estimated at ₹2,100 crore. This move indicates a significant investment in urban renewal and property development in one of India's major metropolitan areas.",
            "Sentiment": "positive",
            "PublishDate": 1751859522000,
            "Source": "default"
        },
        {
            "Title": "Puravankara's Subsidiary Secures ₹2.72 Billion Contract in Bengaluru",
            "Summary": "Starworth Infrastructure, a subsidiary of Puravankara, has been awarded a Letter of Intent for a civil works contract in Bengaluru. The contract is valued at ₹2.72 billion.",
            "Sentiment": "positive",
            "PublishDate": 1750254559000,
            "Source": "default"
        },
        {
            "Title": "Puravankara Ltd: Q4 Loss Widens as Revenue Drops 41%, FY25 Pre-sales Exceed ₹5,000 Crore",
            "Summary": "Puravankara Ltd reported a Q4 FY25 net loss of ₹88 crore, with revenue falling 41% YoY to ₹541.6 crore. EBITDA decreased 73% to ₹30.5 crore. FY25 pre-sales reached ₹5,006 crore with 5.67 million sq ft sold. The company expanded in western India, acquiring four projects with a GDV potential over ₹9,500 crore. Purva Panorama in Thane was launched with an estimated GDV of ₹4,000 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1748618550000,
            "Source": "earnings"
        },
        {
            "Title": "Puravankara Reports Q4 Financial Results",
            "Summary": "Puravankara has released its Q4 financial results. The company reported an EBITDA of 304.5 million rupees, down from 1.13 billion rupees year-over-year. The EBITDA margin decreased to 5.62% from 12.33% in the same period last year. Revenue for Q4 was 5.42 billion rupees, compared to 9.2 billion rupees in the previous year. The company reported a consolidated net loss of 855 million rupees, compared to a loss of 67.6 million rupees year-over-year and a loss of 935 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748612320000,
            "Source": "result"
        }
    ]
}