{
    "Symbol": "PVP",
    "ISIN": "INE362A01016",
    "News": [
        {
            "Title": "PVP Ventures Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "PVP Ventures Limited has scheduled a board meeting on February 12, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770292550532,
            "Source": "co_actions_results"
        },
        {
            "Title": "PVP Ventures subsidiary files compounding application",
            "Summary": "PVP Ventures' material subsidiary Biohygea Global has filed a compounding application before NCLT Chennai for past non-compliances under Companies Act 2013. No material impact expected on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1769857956109,
            "Source": "stocks"
        },
        {
            "Title": "PVP Ventures Sets Record Date for NCD Payment",
            "Summary": "PVP Ventures Limited has fixed February 5, 2026 as the record date for interest payment and partial redemption of principal for its Non-Convertible Debentures, with payment scheduled for February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769857317456,
            "Source": "co_actions_results"
        },
        {
            "Title": "PVP Ventures Appoints Dileep Badey as Additional Director",
            "Summary": "PVP Ventures Limited's Board appointed Mr. Dileep Badey as Additional Director (Executive) and reconstituted three Board committees including Audit, Investment, and NCD committees on January 22, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769068498573,
            "Source": "stocks"
        },
        {
            "Title": "PVP Ventures Appoints New Statutory Auditor and CFO Resigns",
            "Summary": "PVP Ventures' Board appointed M/s. CNGSN Associates LLP as statutory auditors to fill a casual vacancy caused by the resignation of previous auditors M/s. PSDY Associates, subject to shareholder approval. Chief Financial Officer K. Anand Kumar resigned effective December 8, 2025, to pursue other professional opportunities outside the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1765190895708,
            "Source": "corporate_governance"
        },
        {
            "Title": "PVP Ventures CFO K. Anand Kumar Resigns",
            "Summary": "K. Anand Kumar has resigned from his position as Chief Financial Officer of PVP Ventures, with the resignation taking effect from December 8. The departure represents a key leadership change at the company's senior management level.",
            "Sentiment": "neutral",
            "PublishDate": 1765190334496,
            "Source": "corporate_governance"
        },
        {
            "Title": "PVP Ventures Completes First Phase of 7Med India Acquisition, Secures 33.24% Stake",
            "Summary": "PVP Ventures Limited has completed the first phase of its acquisition of 7Med India Private Limited, acquiring 14,939 equity shares representing 33.24% of the company's total paid-up share capital. The acquisition is part of PVP's strategic initiative to diversify and strengthen its presence in the healthcare sector. The company plans to increase its shareholding to 50.62% within twelve months from August 28, 2025. The total transaction involves a combination of primary and secondary stake purchases with an outlay of approximately INR 127 crores for the majority shareholding. 7Med India is among the top five organized players in India's renal care sector, offering dialysis services across its pan-India network, and has reported an EBITDA of approximately INR 10 crore for the current financial year.",
            "Sentiment": "positive",
            "PublishDate": 1762268638536,
            "Source": "order&deals"
        },
        {
            "Title": "PVP Ventures CEO and Whole Time Director Arjun Ananth Resigns",
            "Summary": "Arjun Ananth resigned from his position as CEO and Whole Time Director of PVP Ventures Limited on October 24, 2025, to pursue other opportunities. The Board of Directors approved his resignation on October 25, 2025, with his cessation effective from the close of business hours on the same day. The company stated it is enhancing senior leadership as part of a transformational plan and is in discussions with global talent from reputed institutions for replacement, with announcements expected shortly.",
            "Sentiment": "neutral",
            "PublishDate": 1761369850777,
            "Source": "corporate_governance"
        },
        {
            "Title": "PVP Ventures Appoints ARS & Associates as Secretarial Auditor for Five-Year Term",
            "Summary": "PVP Ventures Limited appointed M/s. ARS & Associates Company Secretaries LLP as its Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. The appointment was approved by shareholders at the company's 34th Annual General Meeting held on September 25, 2025. ARS & Associates is a peer-reviewed firm established in 2016 that provides secretarial and compliance services to enterprises ranging from SMEs to large corporates and listed companies. The firm has no association with any of PVP Ventures' directors.",
            "Sentiment": "neutral",
            "PublishDate": 1758823064149,
            "Source": "corporate_governance"
        },
        {
            "Title": "PVP Ventures Acquires 41.2% Stake in Healthcare Platform 7Med India",
            "Summary": "PVP Ventures has acquired a 41.2% stake in 7Med India Pvt. Ltd., a renal care and healthcare platform. This acquisition will make PVP Ventures the majority owner of the company.",
            "Sentiment": "positive",
            "PublishDate": 1756363266857,
            "Source": "order&deals"
        },
        {
            "Title": "Madras High Court Quashes GST Demand Notices for PVP Ventures in Joint Development Case",
            "Summary": "The High Court of Madras quashed GST demand notices issued to PVP Ventures Limited on July 21, 2025, ruling that no GST is leviable on landowners in joint development arrangements. The court set aside demand notices dated July 22, 2024, and January 17, 2025, which pertained to GST liability raised on the company in relation to a joint development agreement executed with a developer. PVP Ventures had challenged the demand before the court on grounds that GST is not applicable to landowners in joint development arrangements. The court ruled in favor of the company, effectively removing the GST liability that had been imposed by the GST Department.",
            "Sentiment": "positive",
            "PublishDate": 1753451434270,
            "Source": "stock"
        },
        {
            "Title": "SEBI Requests Additional Information from PVP Ventures",
            "Summary": "The Securities and Exchange Board of India (SEBI) has asked PVP Ventures for additional clarifications and supporting documents. No further details about the nature of the clarifications or the context of the request were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749472712000,
            "Source": "default"
        },
        {
            "Title": "PVP Ventures Acquires Majority Stake in Biohygea Global",
            "Summary": "PVP Ventures has acquired a 52% stake in Biohygea Global for 70 million rupees. This acquisition gives PVP Ventures a controlling interest in Biohygea Global.",
            "Sentiment": "neutral",
            "PublishDate": 1745417980000,
            "Source": "default"
        },
        {
            "Title": "PVP Ventures Acquires Majority Stake in Optimus Oncology",
            "Summary": "PVP Ventures has approved the acquisition of a 56.01% stake in Optimus Oncology Pvt. Ltd. for approximately Rs 55 crore. This strategic move is aimed at expanding PVP Ventures' presence in the oncology healthcare sector.",
            "Sentiment": "positive",
            "PublishDate": 1745398555000,
            "Source": "default"
        }
    ]
}