{
    "Symbol": "PVRINOX",
    "ISIN": "INE191H01014",
    "News": [
        {
            "Title": "PVR INOX seeks shareholder approval for director pay",
            "Summary": "PVR INOX Limited announces postal ballot for February 12, 2026, seeking approval for remuneration of Managing Director Ajay Kumar Bijli and Executive Director Sanjeev Kumar through special resolutions.",
            "Sentiment": "neutral",
            "PublishDate": 1770900700283,
            "Source": "stocks"
        },
        {
            "Title": "PVR INOX Plans Major Screen Expansion with ₹400 Cr Investment",
            "Summary": "PVR INOX announces ambitious expansion plans to add almost 100 screens in FY26 and 150 in FY27, backed by ₹350-400 crore investment for new screens, renovations, and maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1770349724936,
            "Source": "stocks"
        },
        {
            "Title": "PVR INOX Q3FY26 Net Profit Jumps to ₹950M",
            "Summary": "PVR INOX Limited reported strong Q3FY26 results with net profit of ₹950 million vs ₹345 million in Q3FY25. Revenue grew 11.15% to ₹17,736 million driven by improved theatrical performance.",
            "Sentiment": "positive",
            "PublishDate": 1770299840289,
            "Source": "co_actions_results"
        },
        {
            "Title": "PVR INOX Board Meet Set for Feb 5 for Q3FY26 Results",
            "Summary": "PVR INOX Limited has scheduled its Board meeting for February 5, 2026, to consider and approve Q3FY26 financial results. Trading window remains closed until 48 hours post-results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769693699596,
            "Source": "co_actions_results"
        },
        {
            "Title": "PVR Inox Exits 4700BC Brand for Rs 226.8 Crore",
            "Summary": "PVR Inox sells entire stake in popcorn brand 4700BC to Marico for Rs 226.8 crore as part of balance sheet strengthening strategy. Multiple pharma recalls and corporate deals also reported.",
            "Sentiment": "neutral",
            "PublishDate": 1769478033805,
            "Source": "co_actions_results"
        },
        {
            "Title": "PVR INOX Sells 4700BC Brand to Marico for Rs 226.8 Cr",
            "Summary": "PVR INOX Limited divests entire 93.27% stake in subsidiary Zea Maize Private Limited, owner of 4700BC brand, to Marico Limited for Rs 226.8 crores. Transaction expected to complete within 30 days.",
            "Sentiment": "positive",
            "PublishDate": 1769415454463,
            "Source": "co_actions_results"
        },
        {
            "Title": "PVR INOX Opens 9-Screen Multiplex in Hyderabad",
            "Summary": "PVR INOX launches new 9-screen cinema at Lakeshore Mall, Kukatpally, featuring PXL and Playhouse formats with advanced audio technology, expanding network to 1,783 screens across 357 properties.",
            "Sentiment": "positive",
            "PublishDate": 1769158262022,
            "Source": "stocks"
        },
        {
            "Title": "Flexible cinema pricing boosts midweek footfalls",
            "Summary": "Multiplex chains' weekly offers like 'Blockbuster Tuesdays' drove higher midweek attendance in 2025, with PVR INOX reporting 22.5 million footfalls and Cinépolis seeing Tuesday admissions rise to 15-16% of weekly visits.",
            "Sentiment": "positive",
            "PublishDate": 1767941876965,
            "Source": "stocks"
        },
        {
            "Title": "PVR Inox Sees Strong Q3 After Dhurandhar Success",
            "Summary": "PVR Inox reports improved Q3 performance driven by Dhurandhar's ₹831 crore success. Company focuses on premium screens expansion with 35-40% occupancy rates while maintaining balanced pricing strategy.",
            "Sentiment": "positive",
            "PublishDate": 1767847221473,
            "Source": "stocks"
        },
        {
            "Title": "PVR INOX shares drop 2% on promoter share pledge",
            "Summary": "PVR INOX shares fell 2% to ₹994.60 after promoter Ajay Kumar Bijli pledged 4 lakh equity shares for personal borrowing. The company also opened India's highest cinema at 11,500 feet in Leh-Ladakh.",
            "Sentiment": "negative",
            "PublishDate": 1767086540357,
            "Source": "stocks"
        },
        {
            "Title": "PVRINOX Opens India's Highest Multiplex in Leh",
            "Summary": "PVRINOX Limited launches a 2-screen multiplex at 11,500 feet in Leh, Ladakh, marking India's highest cinema site. The facility features advanced technology and expands the network to 1,774 screens.",
            "Sentiment": "positive",
            "PublishDate": 1766215576974,
            "Source": "stocks"
        },
        {
            "Title": "PVR INOX Opens 11-Screen Superplex in Hyderabad",
            "Summary": "PVR INOX Limited expands its Inorbit Mall, Cyberabad property into an 11-screen superplex with premium formats including PXL, LUXE, and 4DX, strengthening its network to 1,772 screens across 355 properties.",
            "Sentiment": "positive",
            "PublishDate": 1765610706802,
            "Source": "stocks"
        },
        {
            "Title": "PVR INOX Plans 100-Screen Expansion in FY26 Targeting Tier 3 Markets",
            "Summary": "PVR INOX announced plans to add 100 screens during FY26, focusing expansion efforts on tier 3 markets with affordable ticket pricing strategy. The expansion targets underserved markets and aims to make cinema more accessible through competitive pricing in smaller cities.",
            "Sentiment": "positive",
            "PublishDate": 1763652233773,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Opens 6-Screen Multiplex in Delhi's Pitampura Under Asset Light Model",
            "Summary": "PVR INOX launched a 6-screen multiplex at Elegante Unity One Mall in Pitampura, Delhi, featuring luxury auditoriums with 4K laser projection and Dolby 7.1 sound systems. The opening expands PVR INOX's network to 1,767 screens across 355 properties in 111 cities and represents the company's second cinema developed under its Asset Light Model where capex is shared with developers.",
            "Sentiment": "positive",
            "PublishDate": 1763627136209,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Promoter Ajay Kumar Bijli Pledges 2.5 Lakh Equity Shares to HSBC",
            "Summary": "Ajay Kumar Bijli, Promoter and Managing Director of PVR INOX Limited, has pledged 2,50,630 equity shares representing 0.26% of the company's share capital to HSBC Invest Direct Financial Services (India) Limited for personal borrowing purposes. The pledge was created on October 31st, 2025. Following this transaction, Bijli's total encumbered shareholding stands at 25,44,000 shares, which represents 2.59% of the total share capital. Bijli holds 54,47,205 shares in total, constituting 5.55% of the company's share capital. The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1762408054919,
            "Source": "corporate_action"
        },
        {
            "Title": "PVR INOX Promoter Ajay Kumar Bijli Releases Pledge on 2.5 Lakh Equity Shares",
            "Summary": "Ajay Kumar Bijli, Promoter Managing Director of PVR INOX Limited, released encumbrance on 2,50,630 equity shares that were pledged with Infina Finance Private Limited. The pledge release occurred on October 30, 2025, and was created for personal borrowing purposes. Following this release, Bijli's encumbered shareholding decreased from 25,44,000 shares (2.59% of total share capital) to 22,93,370 shares (2.34% of total share capital). Bijli holds 54.47% of the company's total share capital. The disclosure was made in compliance with SEBI regulations regarding substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1762407503058,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Court Stays Karnataka's ₹200 Cinema Ticket Price Cap for Multiplexes",
            "Summary": "The Supreme Court granted interim relief to multiplex operators by staying Karnataka government's rules capping cinema ticket prices at ₹200. The court restrained the state from implementing the price cap until further orders and directed the Karnataka High Court to decide the multiplexes' plea expeditiously. In July, Karnataka issued draft notification under the Karnataka Cinemas (Regulation) (Amendment) Rules, 2025, mandating ticket prices for all language films not exceed ₹200 per show, inclusive of entertainment tax. The Multiplex Association of India (MAI), film producers, and PVR INOX shareholders challenged the amended rules, arguing the blanket application was unreasonable due to cost variations between multiplexes and single screens.",
            "Sentiment": "positive",
            "PublishDate": 1762166640929,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Reports Strong Q2 Performance with 44.5 Million Footfalls and Revenue of INR 1,843 Crores",
            "Summary": "PVR INOX delivered its highest quarterly revenue, EBITDA and PAT in two years for Q2 ended September 30, 2025. The company welcomed 44.5 million guests, representing 15% year-on-year growth and 31% sequential growth. Revenue reached INR 1,843 crores, EBITDA was INR 327 crores, and PAT stood at INR 127 crores, compared to INR 1,642 crores revenue, INR 207 crores EBITDA, and INR 22 crores PAT in the same period last year. Occupancy improved to 28.7% from 25.7% in Q2 last year. ATP grew 2% year-on-year to INR 262, while F&B SPH was INR 134. The company added 22 new screens while rationalizing eight, bringing total screens to 1,761 across 354 cinemas. Net debt decreased to INR 619 crores, the lowest since merger, down INR 333 crores from March 2025. Hindi films showed strong performance with movies like Saiyaara grossing nearly INR 400 crores and Mahavatar Narsimha around INR 300 crores. Hollywood collections reached INR 500 crores driven by franchise titles. Regional cinema also performed well with Kannada box office growing over 100% year-on-year. The company has 132 screens signed under capital-light model with 44 screens under FOCO and 88 under asset-light model.",
            "Sentiment": "positive",
            "PublishDate": 1761569740532,
            "Source": "earnings"
        },
        {
            "Title": "PVR INOX Opens First Multiplex in Sikkim with 3-Screen Facility at Gangtok",
            "Summary": "PVR INOX launched its first cinema in Sikkim at Westpoint Mall, Gangtok, featuring a 3-screen multiplex with 482 seats. The facility was developed under the Franchise-Owned Company-Operated (FOCO) model in collaboration with Westpoint Infra Pvt. Ltd. The multiplex spans 12,271 sq. ft. and includes state-of-the-art 2K Laser projection, Dolby 7.1 surround sound, and next-gen 3D technology. All seats feature premium leatherette with ergonomic designs across three auditoriums with distinct color themes. With this opening, PVR INOX now operates 1,764 screens across 355 properties in 112 cities in India and Sri Lanka. The launch follows recent FOCO property openings in Raipur, Jabalpur, and Siliguri, supporting the company's expansion strategy in Tier-II and Tier-III markets.",
            "Sentiment": "positive",
            "PublishDate": 1761297020200,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Reports Mixed Q2 FY26 Results with Standalone Loss but Consolidated Profit",
            "Summary": "PVR INOX Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025. On a standalone basis, the company reported a net loss of Rs 512 million for Q2 FY26 compared to a profit of Rs 527 million in Q2 FY25. Revenue from operations increased to Rs 15,327 million from Rs 13,729 million year-over-year. For the six-month period, standalone revenue grew to Rs 31,306 million from Rs 26,700 million, though the company posted a net loss of Rs 1,886 million versus a profit of Rs 1,039 million in the previous year. On a consolidated basis, the company showed better performance with Q2 net profit of Rs 540 million compared to Rs 517 million in Q2 FY25, while six-month consolidated revenue increased to Rs 33,604 million from Rs 28,833 million. The results were reviewed by the Audit Committee and approved by the Board of Directors. The company's trading window will reopen from October 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760689758236,
            "Source": "earnings"
        },
        {
            "Title": "PVR INOX Reports Strong Q2 Performance with Revenue Growth and Return to Profitability",
            "Summary": "PVR INOX delivered strong quarterly results with revenue increasing to 18.2 billion rupees from 16.2 billion rupees year-over-year. The company's EBITDA rose to 6.12 billion rupees compared to 4.79 billion rupees in the previous year, while EBITDA margin improved to 33.55% from 29.55%. The company returned to profitability with a consolidated net profit of 1.06 billion rupees, compared to a loss of 118 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1760689324494,
            "Source": "earnings"
        },
        {
            "Title": "PVR INOX Opens New 4-Screen Multiplex in Siliguri, Expands Network to 1,761 Screens",
            "Summary": "PVR INOX Limited opened a new all-laser 4-screen multiplex at ML Acropolis Mall in Siliguri under its FOCO (Franchise Owned, Company Operated) model. The cinema features 4K laser projection in one auditorium and 2K laser projection in three others, with two auditoriums equipped with Dolby Atmos and two with Dolby 7.1 Surround Sound. The facility spans 25,780 sq. ft. with 931 seats including 824 plush sliders and 107 luxury recliners. This marks PVR INOX's third cinema in Siliguri, expanding its presence to 12 screens in the city. With this launch, PVR INOX operates 1,761 screens across 354 properties in 111 cities in India and Sri Lanka. The multiplex is strategically located on Sevoke Road near popular retail brands and is 17 km from Siliguri Airport.",
            "Sentiment": "positive",
            "PublishDate": 1760518549912,
            "Source": "stock"
        },
        {
            "Title": "Prudential plc Reduces Stake in PVR Inox Limited Through Market Sale",
            "Summary": "Prudential plc and its subsidiary companies sold 70,912 shares (0.07%) of PVR Inox Limited through a market sale on October 10th, 2025. The transaction reduced their total shareholding from 3,133,875 shares (3.19%) to 3,062,963 shares (3.12%). PVR Inox Limited is listed on BSE Ltd. and National Stock Exchange of India Ltd., with an equity share capital of INR 981,999,620. The disclosure was filed by Eastspring Investments (Singapore) Limited on behalf of Prudential plc under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1760433466708,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Opens India's First Luxury Dine-In Cinema in Bengaluru",
            "Summary": "PVR INOX has launched India's first luxury dine-in cinema at M5 Ecity Mall in Bengaluru. This represents a new cinema format combining movie viewing with dining services.",
            "Sentiment": "positive",
            "PublishDate": 1759930151011,
            "Source": "stock"
        },
        {
            "Title": "Competition Commission of India Initiates Investigation Against PVR INOX Over Virtual Print Fee",
            "Summary": "The Competition Commission of India issued a prima facie order on September 30, 2025, initiating an investigation against PVR INOX Limited regarding the levy of Virtual Print Fee under Section 26(1) of the Competition Act, 2002. The company clarified that this is merely a preliminary order to begin investigation and is not conclusive of any rights or obligations. PVR INOX is evaluating its options and seeking legal advice while committing to cooperate with the Commission throughout the process.",
            "Sentiment": "negative",
            "PublishDate": 1759318055106,
            "Source": "stock"
        },
        {
            "Title": "PVR Inox and Prime Focus Shares Drop 5% Following Trump's 100% Tariff on Foreign Films",
            "Summary": "Shares of PVR Inox and Ranbir Kapoor-backed Prime Focus declined 5% following U.S. President Donald Trump's announcement of a 100% tariff on foreign-made films. Trump stated on Truth Social that U.S. movie-making is losing ground to international competition. PVR Inox shares fell to Rs 1,073.50, extending losses with the stock down 36% over the past year and 60% from its peak of Rs 1,707. Prime Focus dropped to Rs 175.94 amid high trading volumes. The company owns Double Negative (DNEG), a visual effects studio that has worked on Hollywood films including TENET, Dune: Part Two, and Oppenheimer. Netflix shares also declined 1.5% in early trading. The White House has not clarified the legal authority or implementation details for the proposed tariffs.",
            "Sentiment": "negative",
            "PublishDate": 1759232905277,
            "Source": "stock"
        },
        {
            "Title": "Karnataka High Court Suspends Movie Ticket Price Cap of Rs 200",
            "Summary": "The Karnataka High Court has halted the implementation of new regulations that would have capped movie ticket prices at Rs 200. The court has suspended these rules until further notice. PVR, a major multiplex chain, is mentioned in relation to this development.",
            "Sentiment": "neutral",
            "PublishDate": 1758607015270,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Promoter Ajay Kumar Bijli Pledges 326,000 Equity Shares to HSBC InvestDirect",
            "Summary": "Ajay Kumar Bijli, Promoter & Managing Director of PVR INOX Limited, has pledged 326,000 equity shares (0.33% of total share capital) in favor of HSBC InvestDirect Financial Services (India) Limited for personal borrowing purposes. The pledge was created on September 11, 2025. Following this transaction, Bijli's total encumbered shareholding increased to 25,44,000 shares, representing 2.59% of the company's total share capital. Bijli continues to hold 54,47,205 shares in total, which accounts for 5.55% of PVR INOX's share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1757679076122,
            "Source": "corporate_action"
        },
        {
            "Title": "PVR INOX Opens 10-Screen Megaplex in Mumbai's Borivali East",
            "Summary": "PVR INOX Ltd. opened a 10-screen megaplex with 1,372 seats at Sky City Mall in Borivali East, Mumbai. The facility spans 43,500 sq ft and includes foyers, lounges, and 10 uniquely designed auditoriums. The megaplex was developed under PVR INOX's Capex model, involving direct investment by the company in building, designing, and operating the cinema destination. The company did not disclose the investment amount. Managing Director Ajay Bijli described it as a design-forward destination combining technology, luxury, and immersive storytelling spaces, reinforcing Mumbai as a cornerstone market for the company.",
            "Sentiment": "positive",
            "PublishDate": 1755867290981,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Opens 8-Screen Multiplex in Bengaluru with India's First Dine-In Auditorium Restaurant",
            "Summary": "PVR INOX has launched an 8-screen multiplex in Bengaluru featuring India's first dine-in auditorium restaurant. The facility has a total capacity of 1,222 seats and is equipped with 4K laser projection technology and Dolby Atmos sound systems.",
            "Sentiment": "positive",
            "PublishDate": 1755259935911,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Opens 10-Screen Megaplex at Sky City Mall in Mumbai, Expands Network to 1,755 Screens",
            "Summary": "PVR INOX Limited has opened a new 10-screen Megaplex at Sky City Mall in Borivali East, Mumbai. The cinema features all-laser projection technology, including IMAX with Laser and 4DX formats, with Dolby 7.1 sound systems. The multiplex offers diverse formats across ten screens: two Insignia auditoriums, one IMAX with Laser, one 4DX auditorium, and six mainstream screens, with a combined capacity of 1,374 seats spread across 43,500 square feet. The facility was developed under PVR INOX's Capex model as a direct investment by the company. With this launch, PVR INOX now operates 1,755 screens across 354 properties in 111 cities in India and Sri Lanka. The multiplex is located in Sky City Mall, developed by Oberoi Realty, which spans one million square feet and is strategically positioned 17 kilometers from Chhatrapati Shivaji Maharaj International Airport.",
            "Sentiment": "positive",
            "PublishDate": 1755187370826,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Reports Strong Q1 FY26 Performance with 12% Growth in Admissions and Highest Ever F&B Spend",
            "Summary": "PVR INOX Limited reported quarterly results with total revenue of INR1,488 crores, EBITDA of INR114 crores, and PAT loss of INR34 crores. The company achieved 12% growth in admissions to 34 million, with average ticket price increasing 8% to INR254. F&B spend per head reached a record INR148, marking 10% year-on-year growth. Advertising revenue hit INR110 crores, the highest post-pandemic quarterly figure with 17% increase. The company opened 20 new screens during the quarter, with 14 under asset-light and FOCO models. Net debt reduced by INR61 crores to INR892 crores. Bollywood box office collections surged 38% year-on-year, while Hollywood movies delivered 72% growth. The company's blockbuster Tuesday initiative offering tickets at INR99 brought nearly 1 million new and lapsed customers. Premium and experiential formats recorded 20% year-on-year growth in admissions. The company signed 55 new screens under FOCO model and 72 under asset-light model, focusing on capital-efficient expansion.",
            "Sentiment": "positive",
            "PublishDate": 1755004685649,
            "Source": "earnings"
        },
        {
            "Title": "PVR Inox Shares Jump to Six-Month High as Quarterly Net Loss Narrows Significantly",
            "Summary": "PVR Inox shares surged 4.78% to Rs 1,085, reaching their highest level since February 10, after the company reported improved quarterly results. The multiplex chain's net loss narrowed to Rs 54 crore from Rs 179 crore in the same period last year. Revenue increased 23.4% to Rs 1,469 crore, while Ebitda rose 58% to Rs 397 crore with margins expanding to 27% from 21.1%. The company's occupancy rate and screen count improved during the April-June period, with 20 new screens opened including 14 under franchise-owned and company-operated models. PVR Inox has signed 55 new screens under FOCO and 72 under asset-light models for expansion over the next 18-24 months. Despite the positive results, BofA maintained an underperform rating with a target price of Rs 945. Among 21 analysts covering the stock, 15 recommend buy, four suggest hold, and two advise sell, with an average 12-month consensus target implying 17.1% upside.",
            "Sentiment": "positive",
            "PublishDate": 1754542571457,
            "Source": "stock"
        },
        {
            "Title": "PVR Inox Reports Strong Q1 Performance Driven by Mid-Budget Hindi Films",
            "Summary": "PVR Inox experienced improved audience turnout in the first quarter, with Executive Director Sanjeev Bijli crediting mid-budget Hindi films including 'Sitaare Zameen Par' and 'Bhool Chuk Maaf' as key drivers. The company attracted 34 million customers during the quarter, with average ticket prices increasing by 10% and higher per-person spending. 'Sitaare Zameen Par' collected over Rs 100 crore domestically while 'Bhool Chuk Maaf' crossed Rs 50 crore. Bijli noted the quarter benefited from summer vacations and a combination of English, regional, and Hindi films. The company continues its re-release program for older films, which currently contributes 5-7% of total admissions. PVR Inox plans to open around 100 screens this financial year, with 50-60% following asset-light and franchise models.",
            "Sentiment": "positive",
            "PublishDate": 1754532756242,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Ends 'Passport' Subscription Program, Expects Higher Ticket Prices from Hollywood Recovery",
            "Summary": "PVR INOX announced the discontinuation of its subscription film passes program called 'Passport'. The company's Co-Executive indicated that Hollywood film releases are recovering, which is expected to boost future ticket prices.",
            "Sentiment": "neutral",
            "PublishDate": 1754480903365,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Executive Expects Higher Attendance in FY26 vs FY24",
            "Summary": "A PVR INOX executive has stated that upcoming movie releases are expected to drive higher attendance levels in FY26 compared to FY24. The executive expressed confidence that future film content will boost cinema attendance for the multiplex operator.",
            "Sentiment": "positive",
            "PublishDate": 1754479864449,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Executive Signals Stable Cost Structure in Near Term",
            "Summary": "PVR INOX executive has indicated that the company's cost structures are expected to remain steady in the short term. The statement suggests operational cost stability for the cinema chain operator in the immediate future.",
            "Sentiment": "neutral",
            "PublishDate": 1754478948379,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Executive States No Plans to Extend Tuesday Ticket Discounts to Additional Weekdays",
            "Summary": "PVR INOX executive has stated that the company does not see a need to extend its Tuesday ticket discount program to another weekday. The statement indicates the multiplex chain will maintain its current discount structure limited to Tuesdays.",
            "Sentiment": "neutral",
            "PublishDate": 1754478061416,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Reports Revenue Growth of 23.1% in Q1 FY26 with Improved Box Office Performance",
            "Summary": "PVR INOX Limited reported total income of INR 14,879 million for Q1 FY26, marking a 23.1% increase from INR 12,086 million in Q1 FY25. The company achieved its highest ever spend per head (SPH) at INR 148, up 10.2% from INR 134 in the previous year. Admissions grew 12.1% to 34.0 million, while average ticket price increased 8.1% to INR 254. EBITDA improved significantly to INR 1,141 million with a 7.7% margin, compared to a negative INR 199 million and -1.6% margin in Q1 FY25. However, the company reported a net loss of INR 335 million, though this was an improvement from the INR 1,366 million loss in the previous year. Box office collections showed strong performance with Bollywood GBOC increasing 38% and Hollywood GBOC rising 72%. The company operates 1,743 screens across 352 cinemas and opened 20 new screens during the quarter. Net debt decreased to INR 8,915 million from INR 9,522 million as of March 2025. PVR INOX expects to open 90-100 new screens in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754470413697,
            "Source": "earnings"
        },
        {
            "Title": "PVR INOX Anticipates Strong Performance in FY'26 Driven by Diverse Film Content",
            "Summary": "PVR INOX expects strong performance in FY'26, citing a robust lineup of films across Hindi, Hollywood, and regional cinema segments. The company's optimistic outlook is based on anticipated content diversity across multiple language categories.",
            "Sentiment": "positive",
            "PublishDate": 1754468919655,
            "Source": "stock"
        },
        {
            "Title": "PVR INOX Reports Q1 Revenue Growth to 15B Rupees, Narrows Net Loss",
            "Summary": "PVR INOX reported quarterly revenue of 15 billion rupees compared to 11.9 billion rupees in the same period last year. The company's net loss narrowed to 540 million rupees from 1.78 billion rupees year-over-year. EBITDA increased to 3.97 billion rupees from 2.5 billion rupees, while EBITDA margin improved to 27% from 21.12% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754468114200,
            "Source": "earnings"
        },
        {
            "Title": "Bollywood Film Saiyaara May Reach Rs 1,000 Crore Worldwide, Says PVR Inox Executive",
            "Summary": "Bollywood film Saiyaara is positioned to potentially reach Rs 1,000 crore in worldwide box office collections, according to Sanjeev Bijli, executive director of PVR Inox Ltd. The film is expected to earn Rs 400-500 crore in India alone. As of Wednesday, Saiyaara attracted over 2 lakh footfalls across PVR Inox screens and has collected Rs 133.75 crore net in India through Tuesday. Bijli noted that Gen Z audiences are driving most of the footfalls, indicating strong youth engagement. The film's performance is boosting confidence in the cinema exhibition business, which has faced challenges from streaming platforms. Bijli expressed optimism about Bollywood's pipeline, suggesting the momentum could continue through the second half of the year with upcoming major releases.",
            "Sentiment": "positive",
            "PublishDate": 1753272018073,
            "Source": "stock"
        },
        {
            "Title": "PVR Inox: Karnataka Caps Movie Ticket Prices at Rs 200",
            "Summary": "Karnataka government issued a notification capping movie ticket prices at Rs 200 across all theatres and multiplexes in the state, including for all language films. This affects PVR Inox, which has over 215 screens in Karnataka, accounting for more than 12% of its total screens. The government will consider objections and suggestions received within 15 days.",
            "Sentiment": "negative",
            "PublishDate": 1752631796000,
            "Source": "corporate_governance"
        },
        {
            "Title": "PVR INOX: Karnataka Government Proposes ₹200 Cap on Movie Ticket Prices",
            "Summary": "The Government of Karnataka has proposed capping movie ticket prices at ₹200 across the state, including multiplexes. This draft notification applies to all theatres, regardless of language, and includes entertainment tax. The public has 15 days to provide feedback on this proposed amendment to the Karnataka Cinemas (Regulation) Rules, 2014. PVR INOX, with 219 screens across 37 cinemas in Karnataka, has not yet officially responded to this proposal.",
            "Sentiment": "negative",
            "PublishDate": 1752621197000,
            "Source": "normal_news"
        },
        {
            "Title": "PVR Inox: 82 New Screens Planned, Capex Reduction Strategy Unveiled",
            "Summary": "PVR Inox plans to open 82 new screens, focusing on tier-2 and tier-3 cities, especially in South India. The company aims to reduce capex intensity through focus and asset-light models. Despite a muted FY24, PVR Inox expects better performance in FY25. The company reduced debt by Rs 482 crore in FY25 and is working on further de-leveraging.",
            "Sentiment": "positive",
            "PublishDate": 1747045106000,
            "Source": "normal_news"
        },
        {
            "Title": "PVR Inox: Q4 Net Loss Narrows, Revenue Dips Slightly",
            "Summary": "PVR Inox reported a consolidated net loss of ₹125 crore in Q4FY25, narrowing from ₹129.50 crore loss YoY. Revenue fell 0.5% to ₹1,249.8 crore. EBITDA increased 1.5% to ₹283.3 crore with margin improvement. Stock price jumped over 5% post-results.",
            "Sentiment": "neutral",
            "PublishDate": 1747036560000,
            "Source": "earnings"
        },
        {
            "Title": "PVR INOX Reports Q4 Financial Results",
            "Summary": "PVR INOX has released its Q4 financial results. The company's EBITDA increased to 2.83 billion rupees from 2.78 billion rupees year-over-year, with the EBITDA margin improving to 22.65% from 22.16%. However, revenue slightly decreased to 12.5 billion rupees from 12.6 billion rupees in the same period last year. The company reported a consolidated net loss of 1.25 billion rupees, a marginal improvement from the 1.3 billion rupees loss in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747035390000,
            "Source": "result"
        },
        {
            "Title": "PVR Inox: Q4 2025 Results Announcement Date Set",
            "Summary": "PVR Inox Ltd. will release Q4 and FY2025 financial results on May 12, 2025. Board meeting scheduled for the same day. Earnings call with management at 4 p.m. Trading window closed for insiders until 48 hours after results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1746847800000,
            "Source": "corporate_action"
        },
        {
            "Title": "PVR INOX: Theatres Remain Open Amid India-Pakistan Tensions",
            "Summary": "PVR INOX confirms its theatres are operational and adhering to government advisories amid escalating India-Pakistan military confrontation. The company prioritizes safety and is prepared to implement any additional measures as directed by authorities.",
            "Sentiment": "neutral",
            "PublishDate": 1746813814000,
            "Source": "normal_news"
        },
        {
            "Title": "PVR INOX to Consider Q4 Results on May 12",
            "Summary": "PVR INOX, a leading cinema exhibition company, has announced that it will consider its fourth quarter (Q4) financial results on May 12. This announcement indicates the company's upcoming earnings report, which will provide insights into its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746186400000,
            "Source": "default"
        }
    ]
}