{
    "Symbol": "PVSL",
    "ISIN": "INE772T01024",
    "News": [
        {
            "Title": "PVSL Reports Q3FY26 Loss, Approves Board Changes",
            "Summary": "Popular Vehicles & Services reported standalone loss of Rs 123.01 million for Q3FY26 vs Rs 134.34 million loss in Q3FY25. Board approved re-appointment of John Paul as director.",
            "Sentiment": "negative",
            "PublishDate": 1770730321829,
            "Source": "co_actions_results"
        },
        {
            "Title": "Popular Vehicles VP Service Resigns by April 2026",
            "Summary": "Popular Vehicles & Services announces resignation of Vice President of Service effective April 30, 2026, citing personal reasons for the departure.",
            "Sentiment": "neutral",
            "PublishDate": 1770357450595,
            "Source": "stocks"
        },
        {
            "Title": "Popular Vehicles Gets BKT Tyre Distribution Rights",
            "Summary": "Popular Vehicles & Services has been appointed as authorized distributor for BKT's 2-wheeler and passenger car radial tyres in Kerala and parts of Karnataka, expanding the company's distribution network.",
            "Sentiment": "positive",
            "PublishDate": 1770129997462,
            "Source": "stocks"
        },
        {
            "Title": "PVSL Q3FY26 Earnings Call Set for February 11, 2026",
            "Summary": "Popular Vehicles and Services Limited announces earnings conference call on February 11, 2026 at 3:00 PM IST to discuss Q3FY26 financial and operational performance with key management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1769756399238,
            "Source": "co_actions_results"
        },
        {
            "Title": "Popular Vehicles Board Meet on Feb 10 for Q3FY26 Results",
            "Summary": "Popular Vehicles and Services Limited has scheduled its board meeting for February 10, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769755185555,
            "Source": "co_actions_results"
        },
        {
            "Title": "Popular Vehicles shuts JCB dealership operations",
            "Summary": "Popular Vehicles and Services Limited closes subsidiary Popular Auto Dealers' JCB dealership operations citing lower margins and business viability challenges, affecting Rs. 23.50 crores revenue.",
            "Sentiment": "negative",
            "PublishDate": 1769615455415,
            "Source": "stocks"
        },
        {
            "Title": "Popular Vehicles Stock Jumps 7% on Strong Q3 Results",
            "Summary": "Popular Vehicles and Services Ltd shares surge 7% after reporting 40% YoY revenue growth in Q3 FY26, driven by 50% increase in new vehicle volumes and robust performance across all segments including commercial vehicles and EVs.",
            "Sentiment": "positive",
            "PublishDate": 1768897593738,
            "Source": "co_actions_results"
        },
        {
            "Title": "Popular Vehicles Extends ₹5 Cr Corporate Guarantee",
            "Summary": "Popular Vehicles and Services Limited provides corporate guarantee of ₹5.00 crores to subsidiary Prabal Motors Private Limited for DBS Bank dealer finance facility and overdraft arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1768819565223,
            "Source": "stocks"
        },
        {
            "Title": "Popular Vehicles Provides ₹40.50 Cr Guarantee to HDFC",
            "Summary": "Popular Vehicles and Services Limited provides corporate guarantee and collateral security worth ₹40.50 crores to HDFC Bank for credit facilities sanctioned to step-down subsidiary Imperion Cars Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1767794028872,
            "Source": "stocks"
        },
        {
            "Title": "Popular Vehicles Gets Credit Rating Affirmed",
            "Summary": "Popular Vehicles and Services subsidiary Popular Auto Dealers receives IND A-/Stable/IND A1 rating affirmation from India Ratings for bank loan facilities.",
            "Sentiment": "positive",
            "PublishDate": 1767701433376,
            "Source": "stocks"
        },
        {
            "Title": "Popular Vehicles Extends ₹5 Cr Guarantee to Subsidiary",
            "Summary": "Popular Vehicles and Services Limited provides corporate guarantee of ₹5 crores to step-down subsidiary Imperion Cars Private Limited for inventory funding facility from Axis Bank.",
            "Sentiment": "neutral",
            "PublishDate": 1767614549745,
            "Source": "co_actions_results"
        },
        {
            "Title": "Popular Vehicles Subsidiary Executes Audi Deal for ₹9.75 Cr",
            "Summary": "Popular Vehicles' subsidiary Imperion Cars executes asset purchase agreement with Olympus Motors for Audi dealerships worth ₹9.75 crore, expanding into Andhra Pradesh and Telangana markets.",
            "Sentiment": "positive",
            "PublishDate": 1767161758537,
            "Source": "co_actions_results"
        },
        {
            "Title": "Popular Vehicles Gets 3 Audi LOIs for South India",
            "Summary": "Popular Vehicles & Services subsidiary Imperion Cars receives three Letters of Intent from Audi India for retail operations across Telangana and Andhra Pradesh, establishing 5 touchpoints including exclusive presence in Visakhapatnam and Vijayawada.",
            "Sentiment": "positive",
            "PublishDate": 1766558123136,
            "Source": "co_actions_results"
        },
        {
            "Title": "Popular Vehicles Subsidiary Faces ₹1.01 Cr GST Demand",
            "Summary": "Popular Vehicles & Services disclosed that its subsidiary Prabal Motors received a GST demand of ₹1.01 crores for alleged excess Input Tax Credit claims during FY2021-22, along with penalty of ₹10.08 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1765965753847,
            "Source": "stocks"
        },
        {
            "Title": "Popular Vehicles and Services Ltd Announces Resignation of Nominee Director",
            "Summary": "Mr. Rakesh Kumar Bhutoria (DIN: 08449728) resigned from his position as Nominee Director of Popular Vehicles and Services Ltd with effect from close of business hours on December 8, 2025, citing personal reasons and increased workload at Banyan Tree. The resignation was formally communicated to BSE and NSE exchanges, with Bhutoria having served on the board for 30 months.",
            "Sentiment": "neutral",
            "PublishDate": 1765259741953,
            "Source": "corporate_governance"
        },
        {
            "Title": "Popular Vehicles Extends Rs 18.75 Crore Corporate Guarantee for Subsidiary's Banking Facility",
            "Summary": "Popular Vehicles and Services Limited continues to provide corporate guarantee to Bank of Baroda for renewal of Dealer Finance Overdraft Facility and Adhoc limit up to Rs 18.75 crores for its wholly owned subsidiary Popular Mega Motors (India) Private Limited. The guarantee facilitates banking facilities for the subsidiary with no immediate impact on the parent company other than disclosure requirements in financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1764763621124,
            "Source": "corporate_action"
        },
        {
            "Title": "Popular Vehicles Extends Rs 30 Crore Corporate Guarantee for Subsidiary's Bank Funding",
            "Summary": "Popular Vehicles and Services Limited has extended a corporate guarantee of Rs 30 crores to Axis Bank for its subsidiary Prabal Motors Private Limited's inventory funding, comprising Rs 25 crores for vehicle inventory renewal and enhancement plus Rs 5 crores for fresh spares inventory funding. The guarantee affects the parent company's financial disclosures while supporting the subsidiary's working capital requirements for its automotive business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763547127113,
            "Source": "corporate_action"
        },
        {
            "Title": "Popular Vehicles Acquires R.K.S Motors Dealership for INR 90 Crores, Expands to Telangana",
            "Summary": "Popular Vehicles and Services Limited acquired R.K.S Motors' authorized Maruti Suzuki dealership in Telangana for approximately INR 90 crores, adding 19 locations and 27 touchpoints to strengthen its geographic footprint beyond Kerala. The company reported quarterly results with total income of INR 1,534.6 crores, up 16.6% quarter-on-quarter, though EBITDA declined 16.5% year-on-year to INR 49.4 crores due to GST rate revision impact and cyber attack on JLR operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763464657045,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles Extends Corporate Guarantees Worth Rs 55 Crores for Subsidiaries",
            "Summary": "Popular Vehicles and Services Limited has extended corporate guarantees totaling Rs 55 crores for its wholly owned subsidiaries. The company provided a guarantee of Rs 17.5 crores to The South Indian Bank Limited for Popular Autoworks Private Limited, covering a dealer finance facility renewal of Rs 10 crores and a new term loan facility of Rs 7.5 crores. Additionally, it extended a guarantee of Rs 37.5 crores to IndusInd Bank Limited for Popular Mega Motors (India) Private Limited for channel financing and adhoc limits. The guarantees are provided for subsidiaries that are part of the consolidated group, with no current impact on the company other than disclosure in financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1762915128349,
            "Source": "corporate_action"
        },
        {
            "Title": "Popular Vehicles Reports 36.5% Sequential Growth in Vehicle Volumes for Q2FY26",
            "Summary": "Popular Vehicles and Services Limited reported new vehicle volumes of 13,012 units for the quarter ended September 30, 2025, marking a 36.5% increase on a quarter-on-quarter basis. Total income reached Rs. 1,534.6 crores, up 16.6% sequentially, while adjusted EBITDA stood at Rs. 53 crores with margins at 3.5%. The company's passenger vehicle segment, including luxury vehicles, recorded 8,498 units with revenue of Rs. 664.3 crores. However, some customers deferred purchases following GST rate cut announcements in September. The company completed divestment of Vision Motors and Kuttukaran Green during the quarter and expanded its network with a new NEXA workshop in Kerala. Management expects stronger volume momentum in Q3 as deferred purchases materialize and cited favorable economic environment supported by GST rate reductions and improved monsoon conditions.",
            "Sentiment": "positive",
            "PublishDate": 1762914379286,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles & Services Reports 18% Revenue Growth, Expands Into EV Distribution",
            "Summary": "Popular Vehicles & Services reported Q2FY26 revenue of ₹2,071 crore, marking an 18% year-over-year increase, while profit after tax grew 22% to ₹82 crore. The company is expanding its service network to 90 dealerships and has entered electric vehicle distribution for Tata and Hyundai. Popular Vehicles plans to launch a used-car e-commerce platform by the end of FY26 and is targeting a 15% volume compound annual growth rate with improved margin mix from aftermarket services and finance partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1762876623046,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles Reports Loss, Approves ESOP Scheme and Board Restructuring",
            "Summary": "Popular Vehicles and Services Limited reported a standalone net loss of Rs 218.69 million for the quarter ended September 30, 2025, compared to a profit of Rs 15.66 million in the same quarter last year. The company's board approved several key decisions including the Popular Vehicles Employee Stock Option Scheme 2025 for eligible employees and subsidiaries. The board recommended appointing Mr. Murali Narayanan as Independent Director and approved incorporation of a new step-down subsidiary under Popular Mega Motors for a luxury dealership brand. The company completed disinvestment of Kuttukaran Green Private Limited for Rs 20 million, recording a gain of Rs 11.57 million. Additionally, the company acquired Maruti Suzuki dealership business from R.K.S Motor Private Limited for Rs 930 million, with Rs 55.5 million paid as advance. Revenue from operations increased to Rs 2,520.90 million from Rs 2,252.46 million in the previous year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762815178855,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Popular Vehicles reported quarterly results showing revenue growth to 15.3 billion rupees from 15.12 billion rupees year-over-year. However, the company experienced a significant decline in profitability with consolidated net profit dropping to 6 million rupees from 76 million rupees in the same period last year. EBITDA also decreased to 453 million rupees from 537 million rupees year-over-year, while EBITDA margin compressed to 2.96% from 3.55% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762781070192,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles and Services Limited Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Popular Vehicles and Services Limited has announced a conference call to discuss its operational and financial performance for the quarter and half year ended 30 September 2025. The earnings call is scheduled for Wednesday, 12 November 2025 at 11:00 AM IST. The management team, including Promoter Managing Director Mr. Naveen Philip, CEO Mr. Raj Narayan, and Group CFO Mr. Abraham Mammen, will present quarterly results and discuss the company's financial and operational performance for Q2 FY26. The company has provided multiple access numbers for participants across different regions including India, Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762201436812,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles And Services to Set Up Nexa Workshop in Kerala with ₹2 Crore Investment",
            "Summary": "Popular Vehicles And Services has received a letter to establish a Nexa workshop in Perumbavoor, Kerala. The workshop will include 2 service bays and 3 bodyshop bays, with a total investment estimated at ₹2 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761646336798,
            "Source": "stock"
        },
        {
            "Title": "Popular Vehicles Provides Rs 2.36 Crore Corporate Guarantee for Subsidiary's Bank Loan",
            "Summary": "Popular Vehicles and Services Limited has provided a corporate guarantee of Rs 2.36 crore to South Indian Bank Limited for a term loan sanctioned to its wholly owned subsidiary, Kuttukaran Cars Private Limited. The company states that no promoters, promoter group members, or directors have any interest in this transaction, and it was conducted on an arm's length basis. The guarantee is expected to have no impact on the company other than disclosure requirements in financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1761566557465,
            "Source": "corporate_action"
        },
        {
            "Title": "Popular Vehicles And Services Reports Mixed Q2 FY26 Results With 1% Revenue Growth",
            "Summary": "Popular Vehicles And Services reported Q2 FY26 revenue growth of 1% year-over-year. The company experienced varied performance across vehicle segments, with luxury car sales rising 14% and commercial vehicle sales increasing 19%. However, passenger vehicle sales declined 11% during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1760680760574,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles and Services Limited Extends Rs. 5 Crore Corporate Guarantee for Subsidiary's Channel Finance Facility",
            "Summary": "Popular Vehicles and Services Limited is extending a corporate guarantee of Rs. 5 crore to Tata Capital Limited for a Channel Finance Facility renewal for its wholly owned subsidiary, Popular Mega Motors (India) Private Limited. The guarantee facilitates the renewal of the channel finance facility with a modified limit of Rs. 5 crore. The company states that promoters, promoter group members, or directors have no interest in this transaction, and it is conducted on an arm's length basis. The guarantee is provided on behalf of the subsidiary which is part of the consolidated group, with no current impact on the company other than disclosure in financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1760528954271,
            "Source": "corporate_action"
        },
        {
            "Title": "Popular Vehicles Approves ₹93 Crore Acquisition of R.K.S. Motor Private Limited",
            "Summary": "Popular Vehicles has approved the purchase of R.K.S. Motor Private Limited for ₹93 crores. R.K.S. Motor has a net worth of ₹37.40 crores. The acquisition deal is scheduled to be finalized by October 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759910886894,
            "Source": "order&deals"
        },
        {
            "Title": "Popular Vehicles and Services Ltd Appoints Neeraj Jain as Independent Director for Five-Year Term",
            "Summary": "Popular Vehicles and Services Ltd has appointed Mr. Neeraj Jain as a Non-Executive Independent Director for a five-year term, effective September 29, 2025. The appointment was approved by shareholders through a special resolution at the company's 41st Annual General Meeting held on September 29, 2025. Mr. Jain is a Chartered Accountant and Company Secretary with over 30 years of leadership experience in finance, supply chain, and business management at Johnson & Johnson and Hindustan Unilever across India, ASEAN, and Asia Pacific regions. He was recognized as one of the 100 most influential CFOs in India in 2016 and among the top 100 CFOs in 2015. The company confirmed that Mr. Jain is not related to any existing directors and is not disqualified from holding the director position.",
            "Sentiment": "positive",
            "PublishDate": 1759240009642,
            "Source": "corporate_governance"
        },
        {
            "Title": "Used Car Prices Drop Less Than New Cars Despite GST Rate Cuts, Says Popular Vehicles MD",
            "Summary": "Used car prices are declining but at a slower pace compared to new vehicles following GST rate reductions on automobiles. Naveen Philip, Managing Director of Popular Vehicles and Services, stated that used cars are experiencing about 50% to 60% of the price reduction seen in new cars. He explained that used car price adjustments take longer due to individual vehicle factors like mileage. Despite new cars becoming more affordable, Philip doesn't expect significant migration from the used car segment, citing India's low car penetration rate of 20-22 cars per 1000 people. He identified two growth drivers: GST price cuts and RBI's interest rate reduction. Initial response shows increased showroom inquiries and bookings, though sustained retail impact requires monitoring through early October. Popular Vehicles shares closed down 1.09% at Rs 146.50 on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1758713853966,
            "Source": "stock"
        },
        {
            "Title": "Popular Vehicles & Services Expands Into Telangana With Maruti Suzuki Partnership",
            "Summary": "Popular Vehicles & Services has entered the Telangana market through a partnership with Maruti Suzuki India Limited. The company describes Maruti Suzuki as its long-standing OEM partner in this expansion initiative.",
            "Sentiment": "positive",
            "PublishDate": 1756686480196,
            "Source": "order&deals"
        },
        {
            "Title": "Popular Vehicles & Services Expands Into Telangana With Maruti Suzuki Partnership",
            "Summary": "Popular Vehicles & Services has expanded its operations into Telangana state through a partnership with Maruti Suzuki. The company describes Maruti Suzuki as a long-time partner in this expansion initiative.",
            "Sentiment": "positive",
            "PublishDate": 1756471540905,
            "Source": "order&deals"
        },
        {
            "Title": "Popular Vehicles and Services Ltd Completes Divestment of Step-Down Subsidiary Vision Motors",
            "Summary": "Popular Vehicles and Services Ltd has completed the divestment of its step-down subsidiary, Vision Motors Private Limited, on August 25, 2025. The company sold its 100% stake in VMPL, which was previously held by Popular Mega Motors (India) Private Limited and its nominee. The board had previously approved this divestment proposal in meetings held on February 12, 2025 and May 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756194019787,
            "Source": "corporate_action"
        },
        {
            "Title": "Popular Vehicles' Subsidiary Prabal Motors Acquires BharatBenz Dealership Operations in Punjab",
            "Summary": "Prabal Motors, a subsidiary of Popular Vehicles & Co, has acquired BharatBenz dealership operations in Punjab from Globe CV. The acquisition expands Prabal Motors' commercial vehicle dealership presence in the region.",
            "Sentiment": "positive",
            "PublishDate": 1755697814408,
            "Source": "order&deals"
        },
        {
            "Title": "Popular Vehicles and Services Ltd Makes Q1 Earnings Call Recording Available Online",
            "Summary": "Popular Vehicles and Services Limited has made the audio recording of their Investor and Analyst Conference Call for the quarter ended June 30, 2025 available on their company website. The company notified BSE and NSE about the availability of the recording, which can be accessed through their investor relations section. The conference call was held on August 18, 2025, and the filing was signed by Company Secretary & Compliance Officer Varun T.V. The company operates across Kerala and Tamil Nadu and is listed on both BSE (scrip code 544144) and NSE (code PVSL).",
            "Sentiment": "neutral",
            "PublishDate": 1755511740161,
            "Source": "stock"
        },
        {
            "Title": "Popular Vehicles and Services Reports Mixed Q1 Performance with 1.3% Revenue Growth",
            "Summary": "Popular Vehicles and Services Limited reported total income of Rs. 1,316 crores for the quarter ended June 30, 2025, representing a 1.3% year-on-year increase. EBITDA stood at Rs. 38.3 crores with margins at 2.9%, while the company posted a loss before tax of Rs. 11.1 crores. The automotive dealership company experienced varied performance across segments: service revenue grew 4.5% year-on-year, 2-wheeler EVs doubled in volume and revenue, and the luxury portfolio recorded growth in volumes and realizations. However, the passenger vehicle segment excluding luxury continued facing challenges from a prolonged slowdown. New vehicle volumes declined 1.5% to 9,532 units, while pre-owned vehicle volumes increased 4.2% to 2,575 units. The company operates across Kerala (58% of revenue), Tamil Nadu (26%), Karnataka (11%), and Maharashtra (5%), with passenger vehicles contributing 55% of revenue and commercial vehicles 38%.",
            "Sentiment": "neutral",
            "PublishDate": 1755327341554,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles and Services Limited Provides Rs. 10 Crore Corporate Guarantee for Step-Down Subsidiary's Term Loan",
            "Summary": "Popular Vehicles and Services Limited has provided a corporate guarantee of Rs. 10 crores to South Indian Bank Limited for a term loan sanctioned to its step-down subsidiary, Prabal Motors Private Limited. The company disclosed that none of the promoters, promoter group members, or directors have any interest in this transaction, and it was conducted on an arm's length basis. The guarantee is provided on behalf of the subsidiary which is part of the consolidated group. The company stated there is no current impact from the guarantee other than disclosure in financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1755181535823,
            "Source": "corporate_action"
        },
        {
            "Title": "Popular Vehicles and Services Reports Quarterly Loss, Approves ESOP Plan and Director Appointment",
            "Summary": "Popular Vehicles and Services Ltd reported a standalone loss of Rs 150.85 million for the quarter ended June 30, 2025, compared to a loss of Rs 3.66 million in the same quarter last year. On a consolidated basis, the company posted a loss of Rs 87.61 million versus a profit of Rs 54.50 million in the previous year quarter. Revenue from operations declined to Rs 5,364.21 million from Rs 5,818.35 million year-over-year on standalone basis, while consolidated revenue increased to Rs 13,108.99 million from Rs 12,914.49 million. The Board approved recommending Mr. Neeraj Jain's appointment as Independent Director at the upcoming 41st Annual General Meeting and seeking shareholder approval for implementing an Employee Stock Option Plan for employees of the company and its subsidiaries. The company is proceeding with divestment plans for subsidiaries Kuttukaran Green Private Limited and Vision Motors Private Limited, with sale transactions expected to close by the half year of FY 2025-26.",
            "Sentiment": "negative",
            "PublishDate": 1755177723368,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles Reports Mixed Q1 Results with Revenue Growth but Higher Losses",
            "Summary": "Popular Vehicles reported quarterly revenue of 13.1 billion rupees, up from 12.9 billion rupees in the same period last year. However, the company's EBITDA declined to 332 million rupees from 450 million rupees year-over-year, while EBITDA margin compressed to 2.53% from 3.48%. The company posted a consolidated net loss of 88 million rupees compared to 55 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1755175257562,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles Expands Ather Operations to Karnataka with Two New Bangalore Facilities",
            "Summary": "Popular Vehicles and Services Ltd's subsidiary, Kuttukaran Cars Private Limited, received two Letters of Intent to establish Ather facilities in Bangalore. The expansion includes one Experience Centre and another facility combining Experience Centre, Service Centre, and warehouse. The service centre will have 5 bays with capacity to service approximately 550 vehicles per month. Operations are expected to begin in the second week of September with total investment estimated at Rs 1.2 crores. This marks the company's entry into Karnataka with Ather, making it the fourth state in their network. The company already operates Ather facilities in Kerala and Tamil Nadu, with upcoming operations in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1754659770232,
            "Source": "stock"
        },
        {
            "Title": "Popular Vehicles and Services Ltd Schedules Q1 FY26 Earnings Conference Call",
            "Summary": "Popular Vehicles and Services Ltd has announced a conference call scheduled for August 18, 2025, at 11:00 AM IST to discuss the company's operational and financial performance for Q1 FY26 (quarter ended June 30, 2025). The management team, including Promoter & Managing Director Naveen Philip, CEO Raj Narayan, and Group CFO Abraham Mammen, will present the quarterly results and discuss financial and operational performance. The call will be accessible through multiple phone numbers including primary numbers for India, international toll-free numbers for Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1754573190866,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles and Services Ltd: Luxury Car Sales Surge 40% in Q1",
            "Summary": "Popular Vehicles reported a 1% YoY revenue growth in Q1 FY26. Luxury car sales jumped 40%, while overall vehicle volumes decreased 1%. Commercial vehicles grew 4%, non-luxury passenger vehicles declined 7%. The company is expanding its network with new Ather EV facilities in Chennai, a True Value outlet in Bengaluru, and BharatBenz facilities in Punjab.",
            "Sentiment": "positive",
            "PublishDate": 1752836842000,
            "Source": "earnings"
        },
        {
            "Title": "Popular Vehicles & Services Subsidiary to Set Up Ather Facilities in Chennai",
            "Summary": "A subsidiary of Popular Vehicles & Services has received a Letter of Intent (LOI) to establish Ather facilities in Chennai. Ather is likely referring to Ather Energy, an electric vehicle manufacturer. The news indicates an expansion of Ather's presence in Chennai through a partnership with Popular Vehicles & Services' subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1752192411000,
            "Source": "default"
        },
        {
            "Title": "Popular Vehicles & Services Subsidiary to Establish Ather Facilities in Chennai",
            "Summary": "A subsidiary of Popular Vehicles & Services has received a letter of intent to set up Ather Energy facilities in Chennai. This development indicates a potential expansion of Ather's presence in the city, likely involving service centers or showrooms for their electric vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1752149542000,
            "Source": "default"
        },
        {
            "Title": "Popular Vehicles And Services to Establish BharatBenz Facilities in Punjab",
            "Summary": "Popular Vehicles And Services has secured a Letter of Intent to set up eight advanced 3S facilities (Sales, Service, and Spare Parts) for BharatBenz in Punjab. The company plans to invest approximately ₹130 million for these integrated facilities.",
            "Sentiment": "positive",
            "PublishDate": 1750166328000,
            "Source": "default"
        },
        {
            "Title": "Popular Vehicles Reports Q4 Net Loss and Revenue Decline",
            "Summary": "Popular Vehicles reported a consolidated net loss of 137 million rupees in Q4, compared to a loss of 201 million rupees in the same quarter last year, showing a year-over-year improvement. However, the loss increased from 98 million rupees in the previous quarter. Q4 revenue declined to 13.7 billion rupees from 14 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748559767000,
            "Source": "default"
        },
        {
            "Title": "Popular Vehicles Reports Q4 Financial Results",
            "Summary": "Popular Vehicles has released its Q4 financial results. The company's EBITDA decreased to 258 million rupees from 627 million rupees year-over-year. The EBITDA margin fell to 1.88% from 4.60% in the same period. Popular Vehicles reported a consolidated net loss of 137 million rupees, an improvement from a loss of 201 million rupees year-over-year, but a decline from a loss of 98 million rupees quarter-over-quarter. Q4 revenue was 13.7 billion rupees, down from 14 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748529525000,
            "Source": "result"
        },
        {
            "Title": "Popular Vehicles and Services Expands Ather Energy Dealerships",
            "Summary": "Popular Vehicles and Services' subsidiary has received four Letters of Intent (LOIs) for establishing Ather Energy 3S (Sales, Service, and Spare parts) facilities in Maharashtra. The company expects these operations to begin in the second quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745415245000,
            "Source": "default"
        },
        {
            "Title": "Popular Vehicles and Services Reports Decline in Q4FY25 and FY25 Revenue",
            "Summary": "Popular Vehicles and Services has reported a decrease in total revenue for both Q4FY25 and FY25. The company's Q4FY25 total revenue decreased by 3% year-over-year. Similarly, the full fiscal year 2025 total revenue fell by approximately 1% compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1744893738000,
            "Source": "default"
        }
    ]
}