{
    "Symbol": "PWL",
    "ISIN": "INE0LP301011",
    "News": [
        {
            "Title": "Physicswallah Reports IPO Fund Utilization Progress",
            "Summary": "Physicswallah Limited utilized ₹285.68 crores from its ₹3,100 crore IPO proceeds during Q3FY26, primarily for offline center expansion and subsidiary acquisition, with ₹2,814.32 crores remaining unutilized.",
            "Sentiment": "neutral",
            "PublishDate": 1770305310818,
            "Source": "stocks"
        },
        {
            "Title": "PhysicsWallah Amends Fair Disclosure Code",
            "Summary": "PhysicsWallah Limited's Board approves amendments to Code of Practices and Procedures for Fair Disclosure of Unpublished Price Sensitive Information on February 05, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770305104922,
            "Source": "stocks"
        },
        {
            "Title": "PhysicsWallah Q3 Net Profit Rises 9% to ₹1B",
            "Summary": "PhysicsWallah reported consolidated net profit of ₹1.00 billion in Q3, up from ₹917 million year-over-year. Revenue grew 33% to ₹10.80 billion from ₹8.10 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1770302868294,
            "Source": "co_actions_results"
        },
        {
            "Title": "PhysicsWallah shares drop 8%, near IPO price",
            "Summary": "PhysicsWallah shares fell 8% on Tuesday, extending three-day losses to 14%. Stock trades at ₹112.78, approaching IPO price of ₹109 amid technical oversold conditions.",
            "Sentiment": "negative",
            "PublishDate": 1768889579905,
            "Source": "stocks"
        },
        {
            "Title": "Nuvama holds Kajaria Ceramics; Goldman covers PhysicsWallah",
            "Summary": "Mixed brokerage views emerge as Nuvama maintains hold on Kajaria Ceramics while Goldman Sachs initiates PhysicsWallah coverage with neutral rating, reflecting selective positioning across sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1766586636221,
            "Source": "stocks"
        },
        {
            "Title": "Goldman Sachs Initiates PhysicsWallah Coverage",
            "Summary": "Goldman Sachs has initiated coverage on PhysicsWallah with a neutral rating and set a target price of ₹135.00 per share for the education sector company.",
            "Sentiment": "neutral",
            "PublishDate": 1766548041792,
            "Source": "stocks"
        },
        {
            "Title": "Physicswallah Subsidiary Acquires Additional Land",
            "Summary": "Penpencil EduServices acquired another 1.16 acres in Ranchi for ₹38 crores on January 17, 2026, following earlier 1.76-acre acquisition, as part of expansion strategy funded by ₹400 crore infusion.",
            "Sentiment": "positive",
            "PublishDate": 1766513237450,
            "Source": "stocks"
        },
        {
            "Title": "Physicswallah Announces Postal Ballot for ESOP Plans",
            "Summary": "Physicswallah Limited has issued a postal ballot notice seeking shareholder approval for ratification of ESOP Plan 2022, adoption of new ESOP Plan 2025 with 3.68 crore options, and amendments to Articles of Association.",
            "Sentiment": "neutral",
            "PublishDate": 1766152914815,
            "Source": "co_actions_results"
        },
        {
            "Title": "Physicswallah Increases Xylem Stake to 77.27%",
            "Summary": "Physicswallah Limited's board approves third amendment to shareholders agreement, increasing stake in Xylem Learning from 64.98% to 77.27% through acquisition of additional 930 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1766063078674,
            "Source": "co_actions_results"
        },
        {
            "Title": "PhysicsWallah Targets 25-30% Growth Rate for Offline Expansion",
            "Summary": "PhysicsWallah announced expectations of achieving 25-30% sustainable growth as part of its offline expansion strategy during a conference call. The edtech company is focusing on physical presence growth alongside its existing digital platform operations.",
            "Sentiment": "positive",
            "PublishDate": 1765261823546,
            "Source": "stock"
        },
        {
            "Title": "PhysicsWallah Plans Marketing Spend Reduction and Expansion with 75 New Centers",
            "Summary": "PhysicsWallah plans to reduce marketing spend to 8-9% of revenue from 9.6% last year while expanding with 75 new centers next year. The company expects Q3 to be its best quarter and anticipates achieving profitability.",
            "Sentiment": "positive",
            "PublishDate": 1765261481734,
            "Source": "stock"
        },
        {
            "Title": "PhysicsWallah Reports Strong Q2 Performance with 74% Jump in Net Profit",
            "Summary": "PhysicsWallah delivered robust quarterly results with consolidated net profit surging to 723 million rupees from 415 million rupees year-over-year, while revenue grew to 10.5 billion rupees from 8.3 billion rupees. The edtech company's EBITDA increased to 1.8 billion rupees and margins expanded to 17.23% from 16.11%, indicating improved operational efficiency and strong business momentum.",
            "Sentiment": "positive",
            "PublishDate": 1765237783738,
            "Source": "earnings"
        },
        {
            "Title": "PhysicsWallah Reports Strong Q2 Performance with EBITDA Growth and Margin Expansion",
            "Summary": "PhysicsWallah achieved Q2 EBITDA of 1.8 billion rupees compared to 1.34 billion rupees in the previous year, representing significant year-over-year growth. The company also improved its margin to 17.23% from 16.11% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1765212683157,
            "Source": "earnings"
        },
        {
            "Title": "Physicswallah Limited Adopts Employee Stock Options Plan 2025 for 3.67 Crore Options",
            "Summary": "Physicswallah Limited's Board of Directors approved the Employee Stock Options Plan 2025, granting 3,67,64,700 stock options exercisable into equity shares of face value Rs. 1/- each, subject to shareholder approval via postal ballot. The plan will benefit eligible employees and directors of the company and its subsidiaries through direct route implementation, with vesting commencing minimum 1 year from grant date over a 4-year period.",
            "Sentiment": "positive",
            "PublishDate": 1765211627549,
            "Source": "corporate_action"
        },
        {
            "Title": "Physicswallah Board Approves Deletion of Articles of Association Part B",
            "Summary": "Physicswallah's Board of Directors approved the alteration of the company's Articles of Association by deleting Part B, subject to shareholder approval via postal ballot and regulatory approvals. The deletion is proposed because the Shareholders Agreement that originally required Part B has terminated and is no longer applicable, allowing the company to align its governance structure with current requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765209136293,
            "Source": "corporate_governance"
        },
        {
            "Title": "Physicswallah Limited Approves INR 469.85 Crore Investment in Four Wholly-Owned Subsidiaries",
            "Summary": "Physicswallah Limited's Audit Committee approved investments totaling INR 469.85 crores across four wholly-owned subsidiaries including PenPencil EduServices (INR 399.85 crores), Finz Fintech (INR 20 crores), Finz Finance (INR 50 crores), and Knowledge Planet Holding (USD 2 million). The investments aim to support corporate requirements, working capital needs, and planned expansions across education and financial services sectors while maintaining 100% ownership in all subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1765204013166,
            "Source": "corporate_action"
        },
        {
            "Title": "Physicswallah Increases Stake in Utkarsh Classes to 75.50% Through Third Tranche Acquisition",
            "Summary": "Physicswallah Limited acquired 25,599 equity shares of subsidiary Utkarsh Classes Edutech Private Limited for INR 26.50 crores, increasing its shareholding from 63.25% to 75.50%. The acquisition is part of a multi-tranche structure under a Share Acquisition Terms Agreement signed in February 2023, with plans to acquire 100% shareholding by March 2028.",
            "Sentiment": "positive",
            "PublishDate": 1765203723506,
            "Source": "order&deals"
        },
        {
            "Title": "Physicswallah Limited Schedules Earnings Conference Call for Q2FY26 Results",
            "Summary": "Physicswallah Limited will host an earnings conference call on December 9, 2025, at 9:00 AM IST to discuss its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The call will be attended by key management representatives including Whole Time Directors Alakh Pandey and Prateek Boob, along with CFO Amit Sachdeva, providing investors and analysts an opportunity to review the company's Q2FY26 financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1764858566870,
            "Source": "earnings"
        }
    ]
}