{
    "Symbol": "PYRAMID",
    "ISIN": "INE0MIS01010",
    "News": [
        {
            "Title": "Pyramid Technoplast Q3FY26 Earnings Call on Feb 10",
            "Summary": "Pyramid Technoplast Limited has scheduled an earnings conference call on February 10, 2026, at 04:30 PM IST to discuss Q3FY26 and nine-month financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770209977407,
            "Source": "co_actions_results"
        },
        {
            "Title": "Pyramid Technoplast Expands Solar Capacity by 7.25 MW",
            "Summary": "Pyramid Technoplast receives approval for 7.25 MW additional solar capacity expansion. Company operationalizes 2.25 MW project in Maharashtra and commences 11 MW capacity in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1770042766174,
            "Source": "stocks"
        },
        {
            "Title": "Pyramid Technoplast Reports 21% Revenue Growth to ₹161 Crore in Q2, Commissions Solar and Recycling Plants",
            "Summary": "Pyramid Technoplast achieved 21% year-on-year revenue growth to ₹161 crore in Q2 with strong volume growth across all drum categories, while commissioning its recycling plant in October and 6MW solar facility. The company expanded production capacity by 22% to 75,754 metric tons per annum with the ramp-up of its Wada plant, though capacity utilization stood at 66% due to initial operational phase.",
            "Sentiment": "positive",
            "PublishDate": 1763379558250,
            "Source": "earnings"
        },
        {
            "Title": "Pyramid Technoplast Reports Financial Results and Key Management Change",
            "Summary": "Pyramid Technoplast Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs. 16,148.78 lakhs for the quarter and Rs. 32,615.01 lakhs for the half-year. Net profit after tax stood at Rs. 615.33 lakhs for the quarter and Rs. 1,406.13 lakhs for the half-year. The company operates in the industrial packaging segment. Additionally, Ms. Puja Sharma resigned from her position as Company Secretary and Compliance Officer with effect from November 11, 2025, citing personal reasons and other professional commitments. The Board of Directors approved these results and the resignation at their meeting held on November 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762860557349,
            "Source": "earnings"
        },
        {
            "Title": "Pyramid Technoplast Reports Higher Q2 EBITDA and Margin Growth",
            "Summary": "Pyramid Technoplast reported Q2 EBITDA of 119 million rupees compared to 95 million rupees in the same period last year. The company's EBITDA margin improved to 7.4% from 7.11% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762853089642,
            "Source": "earnings"
        },
        {
            "Title": "Pyramid Technoplast Commissions 6 MW Solar Power Plant in Gujarat",
            "Summary": "Pyramid Technoplast Limited commissioned a 6 MW captive solar power plant in Gujarat on October 30, 2025. The company plans a total capacity of 15.25 MW, with the remaining capacity to be commissioned in phases through November. The company expects to save approximately 15 crore in power costs once the entire capacity is operational. The total investment in the project exceeds 60 crore, with a payback period of nearly four years. MD Bijay Kumar Agarwal stated that integrating renewable energy into manufacturing will strengthen both the bottom line and environmental footprint, representing a step toward sustainable margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1761824811566,
            "Source": "stock"
        },
        {
            "Title": "Pyramid Technoplast Commences Unit IX Recycling Plant Operations",
            "Summary": "Pyramid Technoplast Limited announced the commencement of operations at its Unit IX recycling plant from October 4, 2025. The facility, built on 4447.80 sq. m of land in Bharuch with a capex of ₹8-10 crores, has an annual recycling capacity of 5,000 metric tons of plastic and plastic products, including HDPE plastic packaging material. The plant will cater to 10-12% of Pyramid's raw material needs, reduce reliance on imports, and has an expected payback period of 4 years. The company is also transitioning its thermal power operations to a renewable solar power plant with approximately 15 MW capacity. Managing Director Bijay Kumar Agarwal stated the facility will lower costs, reduce import reliance, and strengthen the company's ESG profile while contributing to India's sustainability goals.",
            "Sentiment": "positive",
            "PublishDate": 1759501745224,
            "Source": "stock"
        },
        {
            "Title": "Pyramid Technoplast Shareholders Approve All Resolutions at 27th AGM Including Asset Disposal Powers",
            "Summary": "Pyramid Technoplast Limited held its 27th Annual General Meeting on September 25, 2025, where shareholders approved all six resolutions. The company adopted audited financial statements for the year ended March 31, 2025, and declared a dividend of Rs. 0.50 per share (5% on face value of Rs. 10). Shareholders re-appointed Mr. Bijaykumar Agarwal as director, ratified cost auditor remuneration for FY2026, and appointed RA Gala & Associates as secretarial auditors. A special resolution was passed authorizing the sale, lease, transfer, mortgage, or disposal of substantially the whole undertaking under Section 180(1)(a) of the Companies Act, 2013. The meeting was conducted through video conferencing with 38 participants, and voting was done electronically with 39 members holding 2,75,93,637 shares participating in the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1758892041365,
            "Source": "corporate_action"
        },
        {
            "Title": "Pyramid Technoplast Reports Mixed Q1 Results with New Plant Operations and Expansion Plans",
            "Summary": "Pyramid Technoplast Limited reported quarterly revenue of 164 crores, down 4% quarter-on-quarter but up 23% year-on-year. EBITDA increased 18% quarter-on-quarter to 14 crores with 8.6% margin, while net profit stood at 8 crores. The company's Wada plant commenced production on June 28th and expects 50-70 crores revenue contribution for the financial year. Production capacity increased 34% to 68,800 metric tons per annum with 73.4% capacity utilization. IBC segment showed strong performance with 55% volume growth and 42% revenue growth year-on-year, contributing 37% of overall revenue. The company expanded MS Drum capacity at Unit 6 Bharuch from 50,000 to 90,000 units. A 15 megawatt solar power project expected to reduce annual power costs by 10 crores will commence operations in September. The company is also establishing a recycling plant with 5,000 metric tons annual capacity, set to begin production in September. Management maintains double-digit EBITDA margin guidance and expects stronger performance from Q2 onwards driven by the new plant operations and solar power benefits.",
            "Sentiment": "positive",
            "PublishDate": 1755092897109,
            "Source": "earnings"
        },
        {
            "Title": "Pyramid Technoplast Sets September 12, 2025 Record Date for Final Dividend of ₹0.50 Per Share",
            "Summary": "Pyramid Technoplast Limited has announced September 12, 2025 as the record date for determining shareholders eligible for a final dividend of ₹0.50 per equity share for FY 2024-2025. The dividend was recommended by the Board of Directors at their meeting held on May 26, 2025, and is subject to approval by members at the 27th Annual General Meeting scheduled for September 25, 2025. If approved, the final dividend will be paid on or after October 3, 2025. The company trades on BSE with scrip code 543969 and on NSE with symbol PYRAMID.",
            "Sentiment": "positive",
            "PublishDate": 1754651721437,
            "Source": "corporate_action"
        },
        {
            "Title": "Pyramid Technoplast Reports 27% Volume Growth in Q1FY26, Commissions New Maharashtra Unit",
            "Summary": "Pyramid Technoplast Limited reported strong quarterly performance with overall volume growth of 27% year-on-year, achieving 12,612 MTPA production at 73.4% capacity utilization. The industrial packaging company commenced operations at its new Wada unit in Maharashtra on June 20, 2025, adding capacity across polymer drums, IBCs, and MS drums. Revenue reached Rs 164 crores with gross margins improving by 110 basis points to 26%. The company operates 8 manufacturing facilities with total production capacity of 68,801 MTPA. IBC business showed particularly strong growth with 55% volume increase and 42% revenue growth, now contributing 37% to total revenue. A recycling plant and 15.45 MW captive solar power facility are expected to begin operations in September 2025, targeting cost reductions of Rs 10 crores annually. The company plans capital expenditure of Rs 70-80 crores for FY26 and Rs 10-20 crores for FY27, focusing on capacity expansion and green energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754555274146,
            "Source": "earnings"
        },
        {
            "Title": "Pyramid Technoplast Reports Q4 Financial Results",
            "Summary": "Pyramid Technoplast has released its Q4 financial results. The company reported an EBITDA of 114 million rupees, down from 118 million rupees year-over-year. The EBITDA margin decreased to 6.65% from 8.86% in the same period last year. Net profit for Q4 was 66 million rupees, compared to 73 million rupees year-over-year and 68 million rupees quarter-over-quarter. Revenue for Q4 increased to 1.7 billion rupees from 1.3 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748266960000,
            "Source": "result"
        },
        {
            "Title": "Pyramid Technoplast Launches New Unit in Maharashtra",
            "Summary": "Pyramid Technoplast has announced the commencement of operations at its new Unit No. VIII, located in Wada, Palghar District of Maharashtra. This expansion marks a significant development for the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1747228680000,
            "Source": "default"
        },
        {
            "Title": "Pyramid Technoplast Reports Q3 EBITDA Growth",
            "Summary": "Pyramid Technoplast announced its Q3 financial results. The company's EBITDA increased to 108 million rupees from 93 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 7.07% from 7.22% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738587839000,
            "Source": "earnings"
        },
        {
            "Title": "Pyramid Technoplast Reports Q3 EBITDA Growth",
            "Summary": "Pyramid Technoplast has reported its Q3 financial results. The company's EBITDA increased to 108 rupees, up from 93 million in the same quarter last year. However, the EBITDA margin slightly decreased to 7.07% from 7.22% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738587766000,
            "Source": "earnings"
        },
        {
            "Title": "Pyramid Technoplast Reports Increased Q3 Profit and Revenue",
            "Summary": "Pyramid Technoplast has announced its financial results for the third quarter. The company's net profit rose to 68 million rupees, up from 64 million rupees in the same period last year. Revenue also saw significant growth, reaching 1.53 billion rupees compared to 1.28 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738587759000,
            "Source": "earnings"
        }
    ]
}