{
    "Symbol": "QPOWER",
    "ISIN": "INE0SII01026",
    "News": [
        {
            "Title": "Quality Power Reports No IPO Fund Deviation in Q3FY26",
            "Summary": "Quality Power Electrical Equipments confirms no deviation in IPO fund utilization for Q3FY26, with ₹191.45 crore utilized from ₹858.696 crore raised in February 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770456827823,
            "Source": "stocks"
        },
        {
            "Title": "Quality Power Electrical Equipments Q3 Results",
            "Summary": "Quality Power Electrical Equipments reports strong Q3 performance with consolidated net profit rising to 389 million rupees from 138 million rupees year-on-year, while revenue surged to 2.8 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1770212034285,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quality Power Names Nominee Director at Sukrut Electric",
            "Summary": "Quality Power Electrical Equipments nominates Ashish Bhardwaj as nominee director on Sukrut Electric Company's board following share purchase and shareholder agreements.",
            "Sentiment": "neutral",
            "PublishDate": 1769517207023,
            "Source": "stocks"
        },
        {
            "Title": "Quality Power Clarifies Volume Surge to BSE",
            "Summary": "Quality Power Electrical Equipments responds to BSE inquiry about recent trading volume increase, stating no undisclosed information and attributing surge to market-driven factors.",
            "Sentiment": "neutral",
            "PublishDate": 1767342268318,
            "Source": "stocks"
        },
        {
            "Title": "Quality Power President & Head India Operations Resigns",
            "Summary": "Quality Power Electrical Equipments announces resignation of President & Head (India Operations) effective December 31, 2025, under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767183510737,
            "Source": "stocks"
        },
        {
            "Title": "Quality Power Subsidiary Acquires Veeral Controls Stake",
            "Summary": "Quality Power Electrical Equipments subsidiary to acquire 76% stake in Veeral Controls for ₹15.20 crores, strengthening high-current power electronics capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1766717350430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quality Power Electrical Equipments Secures 139 Million Rupees Order",
            "Summary": "Quality Power Electrical Equipments has secured a new order valued at 139 million rupees. The order win represents a significant business development for the electrical equipment company.",
            "Sentiment": "positive",
            "PublishDate": 1764682410499,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Electrical Equipments Secures 260 Million Rupees Order",
            "Summary": "Quality Power Electrical Equipments has secured a new order worth 260 million rupees. This order win represents a significant business development for the electrical equipment company.",
            "Sentiment": "positive",
            "PublishDate": 1763733044149,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Electrical Reports 112% Revenue Growth in Q2FY26 Earnings Call",
            "Summary": "Quality Power Electrical Equipment achieved consolidated revenues of INR 218.9 crores in Q2FY26, marking 112% year-on-year growth with EBITDA margins of 22.5%, while maintaining an order book of INR 830 crores. The company secured landmark HVDC orders including high-voltage smoothing reactors from Rihand-Dadri LCC HVDC project and entered strategic partnership with Hyosung for GIS instrument transformer technology, positioning for significant capacity expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763554192477,
            "Source": "earnings"
        },
        {
            "Title": "Quality Power Electrical Equipments Reports Third Quarter IPO Proceeds Monitoring Update",
            "Summary": "Quality Power Electrical Equipments Limited submitted its third monitoring agency report for IPO proceeds utilization for the quarter ended September 30, 2025, covering Rs 858.696 crore raised through fresh issue and offer for sale. The report shows no deviation from stated objects, with Rs 117 crore fully utilized for Mehru Electrical acquisition, while capital expenditure deployment was deferred within permissible limits as mentioned in the prospectus.",
            "Sentiment": "neutral",
            "PublishDate": 1763145309793,
            "Source": "corporate_action"
        },
        {
            "Title": "Quality Power Reports 112% Revenue Growth in Q2FY26, Secures Rs 8,300 Million Order Backlog",
            "Summary": "Quality Power Electrical Equipments Limited reported strong quarterly results with total revenue of Rs 2,189 million, marking 112.4% year-over-year growth. EBITDA surged 193.4% to Rs 494 million while PAT increased 161.9% to Rs 352 million. For the half-year period, revenue reached Rs 4,130 million (up 126%), with EBITDA at Rs 977 million and PAT at Rs 722 million. The company maintains an order backlog exceeding Rs 8,300 million across the Quality Power Group. Key developments include signing a binding term sheet with Yash Highvoltage Ltd to jointly acquire 100% stake in Sukrutelectric Company at Rs 10.2 crore enterprise value, acquiring 26% stake in Nebeskie Labs through subsidiary, and securing a marquee order for 500kV smoothing reactors for PGCIL's Rihand-Dadri HVDC link project with Hitachi Energy India. The company is expanding capacity at multiple facilities including Bhiwadi plant (45% capacity increase expected), with Cochin and E-5 units expected completion by November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763013413096,
            "Source": "earnings"
        },
        {
            "Title": "Quality Power Electrical Equipment Reports 112% Revenue Growth in Q2 FY2026",
            "Summary": "Quality Power Electrical Equipment Limited achieved highest-ever quarterly total revenues of INR 2,189 million, up 112.4% year-on-year, and highest-ever quarterly EBITDA of INR 494 million, up 193.4% year-on-year for the quarter ended September 30, 2025. The company's consolidated order book stands at approximately Rs 830 crore. Key developments include subsidiary Mehru Electrical entering a co-development partnership with Hyosung T&D India for Gas-Insulated Switchgear technology, and Quality Power increasing its stake in Nebeskie Labs to 26%. The Global Coil Factory at Kupwad remains ahead of schedule with commissioning targeted before June 2026, while the Cochin expansion will go live in December 2025. The company secured breakthrough orders for High Voltage Converter Reactors used in Voltage Source Converter based HVDC systems in the global market.",
            "Sentiment": "positive",
            "PublishDate": 1763001259443,
            "Source": "earnings"
        },
        {
            "Title": "Quality Power Electrical Equipments Reports Strong Q2 Growth with Revenue Doubling Year-over-Year",
            "Summary": "Quality Power Electrical Equipments delivered robust Q2 performance with consolidated net profit rising to 243 million rupees from 117 million rupees year-over-year. Revenue surged to 2.06 billion rupees compared to 943 million rupees in the previous year. EBITDA increased significantly to 362 million rupees from 82 million rupees, while EBITDA margin expanded to 17.59% from 8.70% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762963044704,
            "Source": "earnings"
        },
        {
            "Title": "Quality Power Electrical Equipments Revises Earnings Call Details Due to Technical Issues",
            "Summary": "Quality Power Electrical Equipments Limited issued a revised intimation to stock exchanges regarding its earnings conference call for Q2 FY26. The company corrected technical issues with the conference call link that was not working properly in their earlier communication dated November 10, 2025. The earnings call is scheduled for Thursday, November 13, 2025 at 12:30 PM IST to discuss the company's unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The management team will be represented by CFO Rajesh Jayaraman, CBO Sanjog Mhatre, Senior VP Finance Sarika Jadhav, and Joint Managing Director Bharandharan Pandyan. The conference call is being hosted by Asit C. Mehta Investment Intermediates Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1762902285650,
            "Source": "earnings"
        },
        {
            "Title": "Quality Power Electrical Equipments Relieves General Manager-HR from Duties",
            "Summary": "Quality Power Electrical Equipments Limited has relieved Mr. Sachin S. Kulkarni, General Manager-HR and Senior Managerial Personnel, from his duties with effect from the close of business hours on November 3, 2025. This follows his earlier resignation letter submitted on October 26, 2025. The relief was processed pursuant to the terms of his appointment letter and mutual discussions between the company and the executive.",
            "Sentiment": "neutral",
            "PublishDate": 1762201477635,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quality Power Electrical Equipments' HR Head Sachin Kulkarni Resigns",
            "Summary": "Sachin S. Kulkarni, General Manager-HR at Quality Power Electrical Equipments Limited, has resigned from his position. He submitted his resignation on October 25, 2025, citing personal and professional goals, with his last working day scheduled for January 25, 2026. Kulkarni has been with the organization since January 1, 2018. In his resignation email, he requested early release by October 31, 2025, with compensation in lieu of the three-month notice period. He expressed gratitude to the management and colleagues for their support during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1761472249009,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quality Power Acquires Majority Stake in Sukrut Electrical",
            "Summary": "Quality Power has acquired a 51% ownership stake in Sukrut Electrical Pvt Ltd, giving the company majority control of the electrical services firm.",
            "Sentiment": "positive",
            "PublishDate": 1759816393353,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Co Acquires Majority Stake in Meharu Electrical & Mechanical Engineers",
            "Summary": "Quality Power Co has acquired a 51% ownership stake in Meharu Electrical & Mechanical Engineers, giving the company majority control of the electrical and mechanical engineering firm.",
            "Sentiment": "positive",
            "PublishDate": 1759816005419,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Electrical Equipments Secures ₹139.4 Million Order",
            "Summary": "Quality Power Electrical Equipments has received an order valued at approximately ₹139.4 million. The company announcement indicates a significant business win for the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1759239149011,
            "Source": "stock"
        },
        {
            "Title": "Quality Power Electrical Equipments Secures ₹177 Million Order",
            "Summary": "Quality Power Electrical Equipments has secured a new order worth ₹177 million. The company announced this business development, which represents a significant contract win for the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1758901967484,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Electrical Equipments Secures 110 Million Rupee Order",
            "Summary": "Quality Power Electrical Equipments has secured an order worth approximately 110 million rupees. The company announced this business development, which represents a significant contract value for the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1758901535378,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power's Subsidiary Secures ₹17.70 Crore Letter of Intent for Instrument Transformers",
            "Summary": "Quality Power Electrical Equipments Limited announced that its material subsidiary, Mehru Electrical and Mechanical Engineers Private Limited, has received a Letter of Intent worth ₹17.70 crores for the supply of Instrument Transformers. The contract is with a domestic entity whose name remains undisclosed due to a Non-Disclosure Agreement. The order is expected to be executed within 5-8 months. The company confirmed that promoters have no interest in the entity awarding the contract, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758900194206,
            "Source": "order&deals"
        },
        {
            "Title": "Mehru Electrical Signs Co-Development Agreement with Hyosung for Gas-Insulated Switchgear Technology",
            "Summary": "Mehru Electrical and Mechanical Engineers Pvt. Ltd., a material subsidiary of Quality Power Electrical Equipments Limited, signed a co-development agreement with Hyosung T&D India Pvt. Ltd. for gas-insulated switchgear (GIS) instrument transformers. The collaboration combines Hyosung's global leadership in advanced equipment and eco-friendly gas technologies with Mehru's expertise in manufacturing high-voltage instrument transformers. This positions Mehru as one of the first Indian companies to co-develop GIS instrument transformer technology for global markets. The partnership aims to create world-class GIS components designed and manufactured in India, supporting the Make in India initiative and reducing import dependence. The global GIS market is projected to grow at 7-8% CAGR through 2030. Development and commercialization of initial transformers is expected within 12 months. Products will be tested and certified to IEC/IEEE international standards.",
            "Sentiment": "positive",
            "PublishDate": 1758715653288,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Electrical Equipments Secures INR 11.5 Crore Order for STATCOM Reactor Supply",
            "Summary": "Quality Power Electrical Equipments Limited received a purchase order worth approximately INR 11.5 crores for supplying reactors for a STATCOM project. The order comes from a domestic entity whose name remains undisclosed due to a non-disclosure agreement. The contract involves a single large order for reactor supply to be executed within 12 months. The company confirmed that promoters have no interest in the entity awarding the order, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758027014783,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Subsidiary Wins Rs 75.19 Crore FACTS System Orders from European Client",
            "Summary": "Quality Power's subsidiary has secured orders worth Rs 75.19 crore for FACTS (Flexible AC Transmission Systems) from a European customer. The orders represent a significant business development for the company's subsidiary in the power systems sector.",
            "Sentiment": "positive",
            "PublishDate": 1757340611561,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Electrical Equipments Reports Strong Q1 FY26 Results with Record Margins",
            "Summary": "Quality Power Electrical Equipments Limited reported consolidated revenue of INR194 crores for Q1 FY26, more than doubling from INR80 crores year-on-year. The company achieved a historic EBITDA margin of 34% for its standalone operations, while subsidiary Endoks maintained 27% margins and Mehru delivered 9.5% margins with 47% improvement in profitability post-acquisition. The company has an order backlog of INR775 crores with execution timeline of 12-15 months. Quality Power signed a binding term sheet to acquire Sukrut Electric through joint venture with Yash Highvoltage Limited. The company operates across high voltage electrical equipment and power quality solutions, serving over 100 countries. Management provided revenue guidance of INR700-800 crores for the year and expects consolidated EBITDA margins in high teens (17-20%). The company is expanding manufacturing capacity with a new facility in Sangli expected to generate peak revenue of INR1,500-2,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1755181335316,
            "Source": "earnings"
        },
        {
            "Title": "Quality Power Co Secures New Order Worth 35 Crores",
            "Summary": "Quality Power Co has secured a new order valued at 35 crores. The company announcement indicates a significant business development for the organization.",
            "Sentiment": "positive",
            "PublishDate": 1754635180530,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Electrical Equipments Reports Strong Q1 FY2026 Results with Robust Growth and Strategic Expansion",
            "Summary": "Quality Power Electrical Equipments Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company delivered robust operational performance with standalone revenue of ₹405.22 million and profit after tax of ₹108.67 million, showing significant quarter-over-quarter growth. Consolidated revenue reached ₹1,767.17 million with profit after tax of ₹370.64 million. The company maintains a healthy order backlog of approximately ₹775 crores. Key developments include progress on the Sangli plant construction ahead of schedule, equipment ordering for special CTC cables with backward integration expected by Q3 FY2026, and a 45-day delay in Cochin expansion due to excessive rainfall. The Board approved a strategic acquisition of Sukrut Electric Company Private Limited through a 50:50 joint venture with Yash Highvoltage Limited for €1 million enterprise value. The company secured a prestigious 500kV air-core dry-type smoothing reactor order for the Rihand–Dadri HVDC project. Net debt stands at approximately ₹13 crores excluding a temporary ₹70 crore interest-free promoter loan for strategic acquisitions, while maintaining cash and cash equivalents of around ₹250 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754565477380,
            "Source": "earnings"
        },
        {
            "Title": "Quality Power Subsidiary Increases Stake in Nebeskie Labs from 14.5% to 26%",
            "Summary": "Quality Power Engineering Projects Private Limited, a subsidiary of Quality Power Electrical Equipments Limited, has executed agreements to increase its investment in Nebeskie Labs Private Limited from 14.5% to 26%. The acquisition involves purchasing 3,040 new equity shares for Rs 1.67 crore in cash consideration, with a premium of Rs 5,498 per share. Nebeskie Labs is a technology company that provides digital solutions for Industry 4.0 and AI, with its plug-and-play edge platform Enture enabling factory digitization. The company reported a turnover of Rs 1.09 crore for FY 2025, showing growth from Rs 0.31 crore in FY 2023. The transaction is expected to be completed within 60 days and will make Nebeskie an associate company. Quality Power aims to enhance product development and expand offerings through this acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1753783196321,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Electrical Equipments Secures INR 10 Crore Order for Finland Data Centre Project",
            "Summary": "Quality Power Electrical Equipments Limited has received an order worth approximately INR 10 crore for supplying dry-type Shunt Reactors for a hyperscale data centre project in Finland. The order comes from an international entity and is expected to be executed within 12 months. The reactors will be manufactured at Quality Power's ISO-certified facility in Sangli, India, and are designed to manage reactive power flows and ensure voltage stability for the data centre's grid interconnection. The company's President of Operations, Vivek Moroney, stated that securing this order validates their product capabilities in the European market and marks their strategic entry into large-scale data centre applications globally. Quality Power is a publicly listed Indian multinational specializing in high-voltage power equipment with installations across over 100 countries.",
            "Sentiment": "positive",
            "PublishDate": 1753161211338,
            "Source": "order&deals"
        },
        {
            "Title": "Quality Power Announces New Global Coil Factory in Sangli",
            "Summary": "Quality Power has announced plans to establish a new global coil factory in Sangli. This expansion aims to increase the company's production capabilities. The move suggests a strategic effort to enhance manufacturing capacity and potentially expand market reach.",
            "Sentiment": "positive",
            "PublishDate": 1750757193000,
            "Source": "default"
        },
        {
            "Title": "Quality Power Anticipates 500 Crore Rupees in New Orders for FY26",
            "Summary": "Quality Power has announced expectations of receiving fresh orders worth 500 crore rupees in the fiscal year 2026. The company's current order book stands at 750 crore rupees. Additionally, Quality Power has provided revenue guidance of 7-8 billion rupees for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1748593064000,
            "Source": "default"
        },
        {
            "Title": "Quality Power Electrical Equipments Reports Q4 Results and Dividend",
            "Summary": "Quality Power Electrical Equipments announced its Q4 results and dividend. The company's Q4 consolidated net profit was 194 million rupees, up from 152 million rupees year-over-year and 138 million rupees quarter-over-quarter. Q4 revenue increased to 1.1 billion rupees from 392 million rupees year-over-year. EBITDA for Q4 was 163 million rupees, up from 135 million rupees year-over-year, with an EBITDA margin of 15.08%, down from 34.44% year-over-year. The company recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748361120000,
            "Source": "result"
        },
        {
            "Title": "Quality Power Electrical Equipments Secures 200 Million Rupee Order",
            "Summary": "Quality Power Electrical Equipments has received an order valued at approximately 200 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747404319000,
            "Source": "default"
        },
        {
            "Title": "Quality Power Electrical Equipment Secures 4-Year Framework Order from Israeli Company",
            "Summary": "Quality Power Electrical Equipment has obtained a strategic 4-year framework order from an Israeli company. The order is for the supply of 161kV high voltage coils. No additional details about the order value, specific Israeli company, or delivery timeline were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747403387000,
            "Source": "default"
        },
        {
            "Title": "Quality Power Electrical Equipments Acquires Majority Stake in Mehru Electrical",
            "Summary": "Quality Power Electrical Equipments has acquired a 51% stake in Mehru Electrical for 1.20 billion rupees. This acquisition gives Quality Power a majority ownership in Mehru Electrical, potentially expanding their market presence and product portfolio in the electrical equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1741306877000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quality Power Electrical Equipments Acquires Majority Stake in Mehru Electrical",
            "Summary": "Quality Power Electrical Equipments has acquired a 51% stake in Mehru Electrical for 1.20 billion rupees. This acquisition represents a significant corporate action that gives Quality Power a controlling interest in Mehru Electrical.",
            "Sentiment": "positive",
            "PublishDate": 1741265608000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quality Power Electrical Equipments: Flat Listing on Stock Exchanges",
            "Summary": "Quality Power Electrical Equipments listed at ₹430, a 1.2% premium to its IPO price of ₹425. The stock closed lower at ₹387.9, with a market capitalization of ₹2,969.98 crore. The IPO, which included a fresh issue of ₹225 crore and an offer for sale of 14.9 million shares, was subscribed 1.29 times.",
            "Sentiment": "neutral",
            "PublishDate": 1740442803000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quality Power Electrical Equipments Ltd: Shares List at 1.7% Premium",
            "Summary": "Quality Power Electrical Equipments Ltd. debuted on the BSE at Rs 432.05, a 1.66% premium over its issue price of Rs 425. The Rs 859-crore IPO was subscribed 1.29 times, with retail investors leading the bids. The company plans to use the proceeds for acquisitions, capital expenditure, and strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1740370906000,
            "Source": "normal_news"
        }
    ]
}