{
    "Symbol": "QUADFUTURE",
    "ISIN": "INE0LRY01011",
    "News": [
        {
            "Title": "Quadrant Future Tek Wins Rs 181.57 Cr KAVACH Contract",
            "Summary": "Quadrant Future Tek Limited secured a Rs 181.57 crore contract from Banaras Locomotive Works for supply and installation of 223 onboard KAVACH locomotive equipment units.",
            "Sentiment": "positive",
            "PublishDate": 1770803399513,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quadrant Future Tek Wins ₹230.42 Cr Kavach Order",
            "Summary": "Quadrant Future Tek secures major ₹230.42 crore contract from Integral Coach Factory for 192 onboard Kavach Ver-4.0 systems, strengthening its position in railway safety technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1769661418343,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quadrant Future Tek Wins ₹287.82 Cr KAVACH Contract",
            "Summary": "Quadrant Future Tek Limited secured a major contract worth ₹287.82 crores from Chittaranjan Locomotive Works for supply and installation of 353 onboard KAVACH locomotive equipment units with maintenance services.",
            "Sentiment": "positive",
            "PublishDate": 1768379749214,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quadrant Future Tek Gets ₹287.83 Cr Railway Order",
            "Summary": "Quadrant Future Tek secures major contract from Chittaranjan Locomotive Works for 353 Kavach locomotive equipment units worth ₹287.83 crores, boosting annual revenue by over 100%.",
            "Sentiment": "positive",
            "PublishDate": 1768379414881,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quadrant Future Tek Seeks Shareholder Nod for IPO Fund Use",
            "Summary": "Quadrant Future Tek Limited has issued a postal ballot notice seeking shareholder approval to withdraw ₹8.57 crores from its IPO monitoring account for reimbursement of issue expenses incurred prior to receiving IPO proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1768294815580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quadrant Future Tek Board Approves ₹8.57 Cr IPO Fund Withdrawal",
            "Summary": "Quadrant Future Tek Limited's board approved withdrawal of ₹8.57 crores from IPO monitoring account for expense reimbursement, subject to postal ballot approval with cut-off date January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768045909365,
            "Source": "stocks"
        },
        {
            "Title": "Quadrant Future Tek CEO Abhigyan Kotnala Resigns Due to Personal Reasons",
            "Summary": "Abhigyan Kotnala, Chief Executive Officer of Quadrant Future Tek Limited's Cable Division, resigned from his position effective November 29, 2025, citing family relocation constraints as the reason. The resignation affects the company's key managerial personnel structure, with Kotnala committed to ensuring a smooth handover of responsibilities during the transition period.",
            "Sentiment": "neutral",
            "PublishDate": 1764424000901,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quadrant Future Tek Reports Strong Growth with 20% QoQ Revenue Rise and Massive Order Book Expansion",
            "Summary": "Quadrant Future Tek achieved 20% quarter-on-quarter revenue growth in Q2 FY26, driven by specialty cables and defence orders, while its order book surged to ₹11,564 million from ₹768 million year-on-year. The company is positioned for transformative growth with KAVACH 4.0 railway safety system approval in final stages and expansion into solar and EV cables with BIS approval, targeting rail and renewable sectors under Make-in-India initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1763137071580,
            "Source": "stock"
        },
        {
            "Title": "Quadrant Future Tek Limited Senior Management Personnel Resign",
            "Summary": "Mr. Sagar Tambi, Chief Manager-Supply Chain and Management, and Mr. Ashish Negi, Chief Manager-Operation Excellence, resigned from Quadrant Future Tek Limited effective November 13, 2025, to pursue new opportunities. Both executives were part of the company's senior management personnel and submitted their resignations to explore better career prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1763119560808,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quadrant FutureTek Reports Mixed Q2 Performance with Revenue Decline but Profit Turnaround",
            "Summary": "Quadrant FutureTek Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of INR 343.99 million for Q2 FY2026, down from INR 396.26 million in the same quarter last year. However, the company achieved a profit of INR 158.87 million compared to a loss of INR 36.57 million in Q2 FY2025. For the half-year period, revenue declined to INR 631.32 million from INR 651.37 million year-over-year, while losses widened to INR 293.84 million from INR 129.21 million. The company operates in two segments: specialty cable manufacturing and train control systems manufacturing. Basic earnings per share for Q2 stood at INR 3.96 compared to negative INR 1.20 in the previous year quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763002250912,
            "Source": "earnings"
        },
        {
            "Title": "Quadrant Future Tek Reports Progress in Kavach System Certification with Positive Quality Audit",
            "Summary": "Quadrant Future Tek Ltd provided updates on its Kavach System certification process, reporting good progress in quality and safety measures. The company achieved positive results in its quality audit.",
            "Sentiment": "positive",
            "PublishDate": 1762246075440,
            "Source": "stock"
        },
        {
            "Title": "Quadrant Future Tek Wins ₹129 Crore RailTel Contract for Railway Safety System",
            "Summary": "Quadrant Future Tek has secured a ₹129 crore order from RailTel for implementing the Kavach system across 607 route kilometers of the East Central Railway. The Kavach system is a railway safety technology being deployed on Indian railway networks.",
            "Sentiment": "positive",
            "PublishDate": 1756815007926,
            "Source": "order&deals"
        },
        {
            "Title": "Quadrant Future Tek Reports Death of Promoter Group Member Smt. Parmjeet Kaur",
            "Summary": "Quadrant Future Tek Limited announced the death of Smt. Parmjeet Kaur, who was a member of the company's promoter group. She did not hold any shares in the company. Following her death, she will cease to be part of the promoter group as per regulatory requirements. The company made this disclosure to stock exchanges NSE and BSE on August 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756297226714,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quadrant Future Tek Reports IPO Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Quadrant Future Tek Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing utilization of funds from its Rs. 290 crore IPO conducted in January 2025. The company utilized Rs. 62.54 crore during the quarter, with Rs. 36.97 crore allocated to working capital for specialty cable division and Rs. 24.94 crore for Kavach project requirements. Total unutilized proceeds stand at Rs. 121.62 crore, primarily held in fixed deposits earning 5.75% to 7.40% returns. The company reported net losses of Rs. 19.68 crore in FY25 and Rs. 13.50 crore in Q1FY26, attributed to segmental losses in the Train Control Division. Implementation delays were noted for Electronic Interlocking System development, with funds remaining parked pending product certification. CARE Ratings Limited confirmed no material deviations from the offer document objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1755167281198,
            "Source": "stock"
        },
        {
            "Title": "Quadrant Future Tek Reports Q1FY26 Results, Awaits Kavach 4.0 Certification for Rs. 984 Crore Order Book",
            "Summary": "Quadrant Future Tek Limited reported operational revenue of Rs. 287 million for Q1FY26, marking a 12% year-on-year increase. The company operates in two segments: Specialty Cables and Railway Signalling Systems (Kavach). EBITDA improved to 8.9% from 7.3% in the previous year. The company holds orders worth Rs. 984 crores, including Rs. 829 crores for 1,200 locomotive Kavach systems and Rs. 155 crores for station Kavach systems. The Train Signalling Division reported a segment loss of Rs. 10.09 crores due to team building costs and technical expenses. The company is awaiting Independent Safety Assessor certification for Kavach 4.0 to commence deliveries, with field trials expected to begin shortly. Management has appointed Abhigyan Kotnala as CEO of the cable division and brought back Amit Gaur as CFO. The company has invested Rs. 52 crores in raw materials and work-in-progress for Kavach production and claims capacity to produce 300 locomotives per month.",
            "Sentiment": "positive",
            "PublishDate": 1754376157611,
            "Source": "earnings"
        },
        {
            "Title": "Quadrant Future Tek Submits Q1FY26 Earnings Call Audio Recording",
            "Summary": "Quadrant Future Tek Limited has submitted the audio recording of their earnings conference call held on July 31, 2025, to discuss unaudited financial results for the quarter ended June 30, 2025. The recording has been uploaded to the company's website at www.quadrantfuturetek.com. The company will provide a transcript of the call within prescribed timelines. The submission was made to BSE Limited (Scrip Code: 544336) and National Stock Exchange (NSE Scrip Symbol: QUADFUTURE) by Company Secretary Puneet Khurana.",
            "Sentiment": "neutral",
            "PublishDate": 1753981351851,
            "Source": "earnings"
        },
        {
            "Title": "Quadrant Futuretek Reports Q1 FY2026 Loss, Announces Leadership Changes",
            "Summary": "Quadrant Futuretek Ltd announced its Q1 FY2026 unaudited financial results showing a net loss of INR 134.97 million compared to a loss of INR 92.64 million in the same quarter last year. Revenue from operations increased to INR 287.33 million from INR 255.11 million year-over-year. The company appointed Abhigyan Kotnala as CEO and Amit Gaur as CFO, while accepting resignations from CFO Amit Kumar Jain and Company Secretary Pankaj, both effective July 29, 2025. CS Puneet Khurana was appointed as the new Company Secretary. The board also re-appointed cost auditors and secretarial auditors, and scheduled the 10th Annual General Meeting for September 25, 2025. The company operates in two segments: specialty cables manufacturing and train control systems.",
            "Sentiment": "negative",
            "PublishDate": 1753797785915,
            "Source": "earnings"
        },
        {
            "Title": "Bengal Finance and Investment Acquires 1.55% Stake in Quadrant Future",
            "Summary": "Bengal Finance and Investment, a company associated with investor Ashish Kacholia, has acquired a 1.55% stake in Quadrant Future during the fourth quarter, as revealed in the company's shareholding pattern.",
            "Sentiment": "neutral",
            "PublishDate": 1745206245000,
            "Source": "default"
        },
        {
            "Title": "Quadrant Future Tek Secures Rs. 155.93 Crore Kavach System Project from RailTel",
            "Summary": "Quadrant Future Tek has been awarded a significant project worth Rs. 155.93 crore from RailTel Corporation of India. The project involves the implementation of the Kavach system, which is likely related to railway safety or communication technology.",
            "Sentiment": "positive",
            "PublishDate": 1743034380000,
            "Source": "order&deals"
        },
        {
            "Title": "Quadrant Future Tek Secures Rs. 155.93 Crore Kavach System Project from RailTel",
            "Summary": "Quadrant Future Tek has been awarded a significant project worth Rs. 155.93 crore from RailTel Corporation of India. The project involves the implementation of the Kavach system, which is likely a safety or communication system for railways. This contract represents a major business opportunity for Quadrant Future Tek in the railway infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1742999790000,
            "Source": "order&deals"
        },
        {
            "Title": "Quadrant Future Tek: Shares Surge 114% Post-Listing",
            "Summary": "Quadrant Future Tek shares have skyrocketed 113.7% to Rs 619.65 on the BSE within a week of listing, doubling investor value. The stock debuted at a 29% premium and has surged 67.4% on NSE and 65.7% on BSE from its listing price. The IPO saw robust demand, especially from retail and non-institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1737093389000,
            "Source": "normal_news"
        },
        {
            "Title": "Quadrant Future Tek: Shares List at 29% Premium on Market Debut",
            "Summary": "Quadrant Future Tek shares listed at ₹374 on BSE and ₹370 on NSE, a 29% and 27.59% premium respectively over the IPO price of ₹290. The listing was below street expectations of a 40% pop. The company, focused on train control and signaling systems for Indian Railways, plans to use IPO funds for working capital, capital expenditure, and loan repayment.",
            "Sentiment": "positive",
            "PublishDate": 1736828980000,
            "Source": "normal_news"
        }
    ]
}