{
    "Symbol": "QUESS",
    "ISIN": "INE615P01015",
    "News": [
        {
            "Title": "Quess Corp Receives ₹159.92 Crore IT Demand Order",
            "Summary": "Quess Corp Limited received a final income tax assessment order for AY 2022-23 with a demand of ₹159.92 crore. The company plans to contest the order through legal channels.",
            "Sentiment": "negative",
            "PublishDate": 1769940683865,
            "Source": "stocks"
        },
        {
            "Title": "Quest Corp Uploads Analyst Call Recording",
            "Summary": "Quest Corp Limited has uploaded the recording of its analyst call conducted on January 29, 2026, on the company's investor relations website as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769693290243,
            "Source": "stocks"
        },
        {
            "Title": "Quess Corp Announces ₹5 Per Share Dividend",
            "Summary": "Quess Corp has declared a dividend of ₹5 per share for its shareholders, marking a significant distribution to investors.",
            "Sentiment": "positive",
            "PublishDate": 1769659240796,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quess Corp Q3 Net Profit Rises 31.9% to ₹550 Million",
            "Summary": "Quess Corp reported consolidated net profit of ₹550 million in Q3, up 31.9% YoY from ₹417 million. Revenue declined to ₹39.3 billion from ₹40 billion in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1769659195869,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quess Corp Board Meet Jan 28 for Q3FY26 Results",
            "Summary": "Quess Corp Limited has scheduled a board meeting on January 28, 2026, to consider Q3FY26 financial results and interim dividend declaration. Trading window closed until January 30, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768916858694,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quess Corp CEO: Labour Reforms Drive Gig Hiring Shift",
            "Summary": "Labour reforms are accelerating formalisation of India's gig workforce, making flexible hiring structural rather than cyclical, says Quess Corp CEO Lohan Bhatia in exclusive interview.",
            "Sentiment": "positive",
            "PublishDate": 1767977781626,
            "Source": "stocks"
        },
        {
            "Title": "Quess Corp CBO Mohit Mathur Resigns Due to Personal Reasons",
            "Summary": "Quess Corp Limited announces resignation of Chief Business Officer Mohit Mathur from Origint division effective January 05, 2026, citing personal reasons for departure from senior management position.",
            "Sentiment": "neutral",
            "PublishDate": 1767629776346,
            "Source": "stocks"
        },
        {
            "Title": "Quess Corp Gets DRP Order on FY22 Tax Matter",
            "Summary": "Dispute Resolution Panel issues order on December 23, 2025, directing DCIT to quantify tax liability for FY2021-22. Company plans to contest final assessment order and reassess financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1766581154689,
            "Source": "stocks"
        },
        {
            "Title": "Quess Corp Allots 36,105 Shares Under QSOP-2020",
            "Summary": "Quess Corp Limited allotted 36,105 equity shares under its stock ownership plan following RSU exercise by employees, increasing paid-up share capital to ₹149.20 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766054556227,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quess Corp Elevates Lohit Bhatia to CEO, Announces Key Leadership Changes",
            "Summary": "Quess Corp appointed Lohit Bhatia as CEO effective January 1, 2026, while Guruprasad Srinivasan's role changes from Executive Director & Group CEO to Executive Director, and Neeraj Jain joins as CFO. The leadership realignment aims to strengthen market focus, succession planning, and drive the company's growth strategy as India's largest staffing firm with over 480,000 associates.",
            "Sentiment": "positive",
            "PublishDate": 1764938091197,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quess Corp Faces Rs. 4,000 Fine from BSE and NSE for Nomination Committee Compliance Breach",
            "Summary": "Quess Corp received fines of Rs. 4,000 each from BSE and NSE for non-compliance with SEBI regulations regarding the composition of its Nomination and Remuneration Committee during the September 2025 quarter. The company has rectified the compliance issue and applied for waiver of the penalties, with the Board attributing the deviation to inadvertent procedural errors in calculating independent director representation following the completion of an Independent Director's term.",
            "Sentiment": "negative",
            "PublishDate": 1764936888134,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quess Corp Subsidiary Incorporates New Engineering Services Company in Singapore",
            "Summary": "Quess Corp Limited announced that its foreign material wholly-owned subsidiary, Quesscorp Holdings Pte. Ltd., has incorporated a new wholly-owned subsidiary called Quess Engineering Pte. Ltd. in Singapore on November 12, 2025. The new entity has an issued share capital of SGD 10,000 divided into 10,000 shares of SGD 1 each. Quesscorp Holdings Pte. Ltd. holds 100% shareholding through complete subscription to the share capital. The newly incorporated company is established for overseas staffing business in the engineering services vertical and has yet to commence operations. No government or regulatory approvals were required for this incorporation, and the promoters and promoter group of Quess Corp have no interest in this transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1763014243325,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp Reports Record EBITDA of ₹77 Crores in Q2 FY26, Revenue Grows 3% YoY",
            "Summary": "Quess Corp delivered revenue of ₹3,832 crores in Q2 FY26, up 3% year-on-year, with highest quarterly EBITDA of ₹77 crores, an 11% increase. EBITDA margin crossed 2% mark with operating cash flow conversion at 109%. PAT stood at ₹52 crores with EPS at ₹3.5 per share. The company added over 21,000 associates during the quarter, taking total associate count to 483,115, up 5% year-on-year. General Staffing delivered 21,283 net additions backed by festive hiring momentum in manufacturing and BFSI verticals. Professional Staffing achieved highest ever EBITDA of ₹27 crores with 12.2% margin, driven by focus on profitable growth and rationalization of low-margin contracts. International business reported revenue of ₹290 crores with EBITDA of ₹18 crores. The company closed the quarter with net cash balance of ₹273 crores after paying approximately ₹90 crores in dividends. Management expects to deliver similar H2 growth as H1 with continued focus on operational excellence and margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762339767865,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp Receives ESG Rating of 63.3 from SEBI-Registered Provider",
            "Summary": "Quess Corp Limited disclosed that SESES G Research Private Limited, a SEBI-registered ESG Rating Provider, has voluntarily assigned an ESG rating of 63.3 to the company based on publicly available information. The company clarified that it did not engage SESES G Research for this ESG rating, and the rating information was communicated to Quess Corp by BSE Limited via email dated October 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761853812609,
            "Source": "stock"
        },
        {
            "Title": "Quess Corp Plans Strategic Split Into Three Verticals for HR Tech-Led Global Expansion",
            "Summary": "Quess Corp has announced a strategic restructuring plan to split its operations into three distinct verticals. The company aims to achieve HR technology-led global growth and sustained margin expansion through this reorganization. Post-demerger, Quess plans to focus on automation, digital staffing, and overseas markets to drive double-digit growth.",
            "Sentiment": "positive",
            "PublishDate": 1761754760582,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp Expects Double-Digit EBITDA Margins and Growth in Coming Quarters",
            "Summary": "Quess Corp anticipates achieving steady double-digit operating EBITDA margins in its professional staffing business. The company expects consistent growth over the next two quarters.",
            "Sentiment": "positive",
            "PublishDate": 1761752723090,
            "Source": "stock"
        },
        {
            "Title": "Quess Corp Reports Growth in Q2 Financial Performance",
            "Summary": "Quess Corp reported quarterly financial results showing year-over-year growth across key metrics. The company's EBITDA increased to 768 million rupees from 693 million rupees, while EBITDA margin improved to 2% from 1.87%. Consolidated net profit rose to 516 million rupees compared to 505 million rupees in the previous year. Revenue grew to 38.3 billion rupees from 37 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761751402551,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp Receives Rs. 42.23 Crore Income Tax Refund from Bengaluru Tax Authority",
            "Summary": "Quess Corp Limited received an income tax refund order totaling Rs. 42.23 crore from the Deputy Commissioner of Income Tax in Bengaluru. The refund comprises Rs. 38.75 crore in tax refund and Rs. 3.49 crore in interest for Assessment Year 2024-25. The order was issued under Section 154 of the Income Tax Act, 1961, dated September 1, 2025, and received by the company on October 10, 2025. The company stated there is no impact on its financial, operational, or other activities from this refund.",
            "Sentiment": "positive",
            "PublishDate": 1760168512958,
            "Source": "stock"
        },
        {
            "Title": "Quess Corp CFO Sushanth Pai Resigns Due to Family Commitments",
            "Summary": "Quess Corp Limited announced the resignation of Chief Financial Officer Sushanth Pai from his position as CFO and Key Managerial Personnel. Pai cited urgent family commitments following a recent bereavement as the reason for his departure. The resignation will be effective from the close of business on October 17, 2025. In his resignation letter, Pai expressed gratitude to the management and board for the opportunities provided during his tenure and wished the company continued success.",
            "Sentiment": "neutral",
            "PublishDate": 1760105415827,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quess Corp Targets Rs 350-Crore Ebitda In FY26, Driven By Tier-2, Tier-3 City Growth",
            "Summary": "Quess Corp is targeting an Ebitda of Rs 350 crore and a blended margin of 2% in FY26, with CEO Guruprasad Srinivasan stating the company aims to achieve close to 20% ROE. The staffing and workforce solutions provider completed its demerger in June, creating a simplified structure with four business lines: general staffing, India professional staffing, international business, and an incubated digital platform. The company is now debt-free and has over 42,000 open job mandates, with significant hiring activity in manufacturing, consumer, retail, and telecom sectors. Nearly 37% of hiring is occurring in Tier 2 and Tier 3 cities, driven by e-commerce expansion and related delivery solutions. The Global Capability Centre segment, representing over 10% of India's 1,600 GCCs, is expected to grow 20% year-on-year. While IT services hiring remains soft, Quess Corp's exposure to this segment is limited to 15-16%, with demand from non-tech companies and GCCs compensating for the slowdown. Shares closed 0.94% lower at Rs 264.05.",
            "Sentiment": "positive",
            "PublishDate": 1756436074039,
            "Source": "stock"
        },
        {
            "Title": "IT Services Hiring Remains Stagnant for Six Quarters, Quess Corp Reports Growth in Professional Staffing",
            "Summary": "IT services sector hiring has remained stagnant for six to seven quarters with no active demand expected in the second quarter, according to Quess Corp CEO Guruprasad Srinivasan. The staffing firm reports that 73% of its demand comes from non-IT companies and global capability centres, where technology talent for AI, cloud, and cybersecurity roles commands average wages of Rs 1.25 lakhs with margins of 15-18%. Quess Corp posted a 4% increase in consolidated profit after tax at Rs 51 crore compared to Rs 49 crore in the previous year, driven by growth in professional staffing. The company's general staffing and overseas business remained flat year-over-year, while digital platform business revenue declined by more than half. Professional staffing achieved its best quarterly performance in over 15 years with revenue of Rs 244 crore and a 10.2% margin. The general staffing segment reported revenue of Rs 3,122 crore, remaining flat year-over-year. The company added net 2,000 employees in the quarter, with 6,500 additions in June alone, primarily from manufacturing, banking, financial services, consumer retail and telecom sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1754238336268,
            "Source": "stock"
        },
        {
            "Title": "Quess Corp Reports Q1 FY26 Revenue of ₹3,651 Crores with Professional Staffing Achieving Record Performance",
            "Summary": "Quess Corp Limited reported quarterly revenue of ₹3,651 crores with EBITDA of ₹70 crores and PAT of ₹51 crores. EBITDA margins increased 7 basis points quarter-on-quarter to 1.9%. The company added nearly 2,000 associates on a net basis, ending with 4,61,531 associates. Professional Staffing delivered its strongest quarterly performance in over 15 years with revenue of ₹244 crores and EBITDA of ₹25 crores, achieving double-digit margins of 10.2% for the first time. General Staffing reported revenue of ₹3,122 crores, remaining flat year-on-year amid challenging operating conditions, though June showed recovery signs with 6,500 net additions. The segment added 79 new contracts bringing 9,000-plus new associates and has 42,000 open mandates. Overseas business generated revenue of ₹284 crores, flat year-on-year, with headcount at 5,599 showing 18% year-on-year growth. The company launched Origint, a new GCC-as-a-Service business line, and became the first company to join ONDC as an anchor network participant in the work opportunity domain through its Hamara Jobs platform. Quess was certified as Great Place to Work for the sixth consecutive year and recognized as India's number 1 staffing company for 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754041983499,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp Reports Double-Digit EBITDA Growth and Launches 'Origint' for GCC Market",
            "Summary": "Quess Corp has achieved double-digit EBITDA growth and demonstrated segmental strength across its business operations. The company has launched 'Origint', a new initiative designed to capitalize on India's Global Capability Centre opportunity. Quess Corp is pursuing strategic GCC expansion while strengthening its position in staffing services and digital platforms.",
            "Sentiment": "positive",
            "PublishDate": 1753720378760,
            "Source": "stock"
        },
        {
            "Title": "Quess Corp Reports 4% Profit Growth to ₹509.86 Million in Q1 FY26 Despite Tax Disputes",
            "Summary": "Quess Corp Limited reported a consolidated profit of ₹509.86 million for the quarter ended June 30, 2025, compared to ₹490.23 million in the same period last year. Revenue from operations remained flat at ₹36,514.18 million versus ₹35,868.72 million year-on-year. The company's earnings per share improved to ₹3.42 from ₹3.30 in the previous year. The company faces ongoing tax disputes with contingent liabilities of ₹2,963.84 million related to disallowed deductions under section 80JJAA of the Income Tax Act. Auditors issued a qualified review conclusion due to uncertainty over these tax matters. The company also has a pending provident fund dispute worth ₹716.56 million from 2020. Exceptional items of ₹18.51 million were incurred for demerger-related professional fees and employee benefits. The General Staffing segment contributed the highest revenue at ₹31,220.76 million, while Professional Staffing showed strong growth with revenue of ₹2,441.58 million.",
            "Sentiment": "neutral",
            "PublishDate": 1753716120635,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp: Joins ONDC, Aims to Add 5 Lakh Jobs Annually",
            "Summary": "Quess Corp has joined ONDC as an anchor network participant in the work opportunities domain. Through its Hamara Jobs platform, it will add over 5 lakh verified job listings annually to the ONDC network, focusing on high-demand sectors like logistics, retail, and field services.",
            "Sentiment": "positive",
            "PublishDate": 1751525210000,
            "Source": "normal_news"
        },
        {
            "Title": "Quess Corp Joins ONDC Network to Offer Job Opportunities",
            "Summary": "Quess Corp has joined the Open Network for Digital Commerce (ONDC) network with the aim of providing two million job opportunities. The company's participation in this digital commerce initiative suggests an expansion of its employment services reach.",
            "Sentiment": "positive",
            "PublishDate": 1751520102000,
            "Source": "default"
        },
        {
            "Title": "Quess Corp Subsidiaries Gain Approval for Equity Shares Listing",
            "Summary": "Digitide Solutions Limited and Bluspring Enterprises, subsidiaries of Quess Corp, have received approval from the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) for the listing of their equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1749479891000,
            "Source": "default"
        },
        {
            "Title": "Quess Corp: Launches Origint for Global Capability Centres",
            "Summary": "Quess Corp introduces Origint, a new business line targeting the growing Global Capability Centres (GCC) market. Origint offers end-to-end services for setting up and operating GCCs in India and internationally. The company aims to serve 4-5 GCCs in FY26 and increase professional staffing's EBITDA contribution from 23% to 35% by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1748956114000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp Launches 'Origint' to Target GCC Market",
            "Summary": "Quess Corp has announced the launch of a new business line called 'Origint'. This new venture aims to capitalize on the USD 105 billion market opportunity in the Gulf Cooperation Council (GCC) region. The company is positioning itself to expand its presence in the GCC market through this initiative.",
            "Sentiment": "positive",
            "PublishDate": 1748938772000,
            "Source": "default"
        },
        {
            "Title": "Quess Corp: Q4 Profit Surges 54%, Announces ₹6 Dividend",
            "Summary": "Quess Corp reported a 54% YoY increase in Q4 FY25 profit, with adjusted PAT at ₹210 crore. Revenue rose 9% to ₹14,967 crore. The board approved a ₹6 per share dividend and introduced a new policy to distribute up to 75% of free cash flow to shareholders. Professional Staffing segment showed strong growth, while General Staffing faced some challenges. The company added 45 new GCC clients and has 48,000 job openings for Q1 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1747719078000,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp Reports Q4 Results and Dividend Recommendation",
            "Summary": "Quess Corp has reported its latest quarterly results. The company's Q4 revenue increased to 36.56 billion rupees from 35.37 billion rupees year-over-year. However, the company reported a consolidated net loss of 954.9 million rupees in Q4, compared to a profit of 943.8 million rupees in the same quarter last year and a profit of 416.8 million rupees in the previous quarter. The company's Q4 profit before tax (PBT) rose to 590.8 million rupees from 367.2 million rupees year-over-year. Quess Corp also reported an exceptional item of 1.58 billion rupees. Additionally, the company has recommended a final dividend of 6 rupees per equity share.",
            "Sentiment": "mixed",
            "PublishDate": 1747675882000,
            "Source": "result"
        },
        {
            "Title": "Quess Corp to Consider Q4 Results on May 19",
            "Summary": "Quess Corp has announced that it will consider its fourth quarter (Q4) financial results on May 19. This indicates the company is preparing to disclose its performance for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746800372000,
            "Source": "default"
        },
        {
            "Title": "Quess Corp Announces Share Exchange Ratios for Digitide and Bluspring",
            "Summary": "Quess Corp has announced share exchange ratios for two entities, Digitide and Bluspring. For both companies, the exchange ratio is set at 1:1, meaning shareholders will receive one equity share of Digitide and one equity share of Bluspring for every one share of Quess Corp they hold.",
            "Sentiment": "neutral",
            "PublishDate": 1744636702000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp Announces Leadership Changes and Demerger Timeline",
            "Summary": "Quess Corp has announced new leadership appointments for its demerged entities. Gurmeet Chahal will be the CEO of Digitide Solutions, while Kamal Pal Hoda becomes CEO of Bluspring Enterprises. Suraj Prasad and Prapul Sridhar are appointed as CFOs of Digitide Solutions and Bluspring Enterprises, respectively. Sushanth Pai is the new CFO of Quess Corp. The company has set April 15 as the record date for the spin-off of these units, with trading of the demerged units' shares expected to commence within two months.",
            "Sentiment": "neutral",
            "PublishDate": 1743552578000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quess Corp Announces Record Date for Spin-off and Trading Timeline",
            "Summary": "Quess Corp has set April 15 as the record date for the spin-off of its business units. The company expects the shares of the demerged units to begin trading within two months following the spin-off.",
            "Sentiment": "neutral",
            "PublishDate": 1743520691000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp Announces Key Leadership Changes in Finance Roles",
            "Summary": "Quess Corp has announced several changes in its finance leadership. Suraj Prasad has been appointed as the CFO of Digitide Solutions, while Prapul Sridhar has been elevated to the position of CFO at Bluspring Enterprises. Additionally, Sushanth Pai has been named the new CFO of Quess Corp itself.",
            "Sentiment": "neutral",
            "PublishDate": 1743520683000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quess Corp Announces Leadership for Demerged Entities",
            "Summary": "Quess Corp has announced new leadership appointments for its demerged entities. Gurmeet Chahal has been appointed as the CEO of Digitide Solutions, while Kamal Pal Hoda has been elevated to the position of CEO at Bluspring Enterprises.",
            "Sentiment": "neutral",
            "PublishDate": 1743520666000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quess Corp: NCLT Approves 3-Way Demerger, Stock Surges 6%",
            "Summary": "Quess Corp's share price jumped over 6% in morning trade on BSE following NCLT approval for a 3-way demerger. The stock opened at ₹661.15 and reached ₹674.50, marking its third consecutive session of gains.",
            "Sentiment": "positive",
            "PublishDate": 1741320242000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp Receives NCLT Approval for Three-Way Demerger",
            "Summary": "Quess Corp has obtained approval from the National Company Law Tribunal (NCLT) for its proposed three-way demerger. The company is now proceeding with the next steps, which include share allotment and the listing of new entities resulting from the demerger.",
            "Sentiment": "positive",
            "PublishDate": 1741275962000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp Receives NCLT Approval for Three-Way Demerger",
            "Summary": "Quess Corp has obtained approval from the National Company Law Tribunal (NCLT) for a three-way demerger of its business. This corporate action involves splitting the company into separate entities, potentially to streamline operations or focus on specific business segments.",
            "Sentiment": "positive",
            "PublishDate": 1741275859000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Composite Scheme of Arrangement for Quess Corp, Digitide, and Bluspring",
            "Summary": "The National Company Law Tribunal (NCLT) has approved a composite scheme of arrangement involving Quess Corp, Digitide, and Bluspring. This approval suggests a significant corporate restructuring or reorganization among these entities, which could potentially impact their operations, ownership structure, or business strategies.",
            "Sentiment": "positive",
            "PublishDate": 1741081781000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp: Demerger on Track for Q4 Completion Despite NCLT Delays",
            "Summary": "Quess Corp expects to complete its demerger into three separate listed entities by Q4 FY25, despite NCLT hearing delays. The next hearing is scheduled for February 5. The company's Q3 results showed a YoY margin drop to 3.6% from 3.9%, attributed to sector growth muting, macroeconomic factors, and demerger-related investments.",
            "Sentiment": "neutral",
            "PublishDate": 1738723114000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp: Promoters Increase Stake Through Open Market Purchases",
            "Summary": "Quess Corp's promoters, Ajit Isaac and Fairbridge Capital (Mauritius) Ltd., each acquired 3.77 lakh shares (0.25% stake) from the open market. This increases the promoter holding from the previous 56.57% at the end of December quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738386392000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp Reports Strong Q3 Financial Results and Declares Interim Dividend",
            "Summary": "Quess Corp announced its Q3 financial results, showing significant year-over-year growth. The consolidated net profit increased to 804.9 million rupees from 639 million rupees in the previous year. Revenue rose to 55.19 billion rupees from 48.4 billion rupees. The company declared an interim dividend of 4 rupees per equity share. An exceptional item of 221 million rupees was reported. The profit before tax (PBT) for Q3 stood at 1.11 billion rupees, up from 790 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738197179000,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp: Q3 Profit Jumps 26%, Declares ₹4 Dividend",
            "Summary": "Quess Corp reported a 26% YoY increase in Q3 net profit to ₹80.4 crore. Revenue grew 14% to ₹5,519 crore. The company declared an interim dividend of ₹4 per share. Workforce Management division reached 503,000 associates. Global Technology Solutions and Operating Asset Management segments showed strong growth.",
            "Sentiment": "positive",
            "PublishDate": 1738173325000,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp Reports Q3 Profit Before Tax of 1.11 Billion Rupees",
            "Summary": "Quess Corp has reported a profit before tax (PBT) of 1.11 billion rupees for the third quarter, compared to 790 million rupees in the same period last year, representing a significant year-over-year increase. The company also noted an exceptional item of 221 million rupees, which could impact the overall financial results.",
            "Sentiment": "positive",
            "PublishDate": 1738167349000,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp Declares Interim Dividend of 4 Rupees per Share",
            "Summary": "Quess Corp has announced an interim dividend of 4 rupees per equity share for its shareholders. This corporate action demonstrates the company's decision to distribute a portion of its profits to its investors.",
            "Sentiment": "positive",
            "PublishDate": 1738167336000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quess Corp Reports Q3 EBITDA Growth with Slight Margin Decline",
            "Summary": "Quess Corp has announced its Q3 financial results. The company's EBITDA increased to 1.97 billion rupees from 1.86 billion rupees year-over-year. However, the EBITDA margin decreased to 3.57% from 3.84% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738167330000,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp Reports Strong Revenue Growth in Q3",
            "Summary": "Quess Corp, a leading business services provider, has announced its financial results for the third quarter. The company reported revenue of 55.19 billion rupees, showing a significant increase from 48.4 billion rupees in the same period last year. This year-over-year growth demonstrates the company's robust performance and market position.",
            "Sentiment": "positive",
            "PublishDate": 1738167322000,
            "Source": "earnings"
        },
        {
            "Title": "Quess Corp Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Quess Corp has reported a consolidated net profit of 804.9 million rupees for the third quarter, showing an increase from 639 million rupees in the same period last year. The profit also improved from 923.9 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738167314000,
            "Source": "earnings"
        }
    ]
}