{
    "Symbol": "QUICKHEAL",
    "ISIN": "INE306L01010",
    "News": [
        {
            "Title": "Quick Heal Board Approves Promoter Group Reclassification",
            "Summary": "Quick Heal Technologies' board approved reclassification of Gagan Bharari Enterprises LLP from promoter group to public category, subject to stock exchange approval under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769773953099,
            "Source": "stocks"
        },
        {
            "Title": "Quick Heal Allots 153 Shares Under ESOP Scheme 2021",
            "Summary": "Quick Heal Technologies allotted 153 equity shares on January 30, 2026 under ESOP Scheme 2021 at exercise price of ₹119 per share, increasing total issued shares to 5,42,15,075.",
            "Sentiment": "neutral",
            "PublishDate": 1769753674400,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quick Heal Q3FY26: Revenue ₹71.54 Cr, PAT ₹6.61 Cr",
            "Summary": "Quick Heal Technologies reports Q3FY26 revenue of ₹71.54 crores with PAT of ₹6.61 crores. Company announces senior management appointments and receives ₹64 crore government order.",
            "Sentiment": "positive",
            "PublishDate": 1769704494026,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quick Heal Board Meet Set for Q3FY26 Results",
            "Summary": "Quick Heal Technologies has scheduled a board meeting for January 29, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025. Trading window closure is in effect.",
            "Sentiment": "neutral",
            "PublishDate": 1769064677960,
            "Source": "co_actions_results"
        },
        {
            "Title": "Quick Heal Gets Promoter Group Reclassification Request",
            "Summary": "Gagan Bharari Enterprises LLP, holding 0% stake in Quick Heal Technologies, has requested reclassification from Promoter Group to Public category under SEBI regulations on January 22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769063555120,
            "Source": "stocks"
        },
        {
            "Title": "Quick Heal Technologies VP People Culture Swapna Sangari Resigns Due to Personal Reasons",
            "Summary": "Quick Heal Technologies announced that Ms. Swapna Sangari, Vice President People Culture, has resigned from her position with immediate effect on December 8, 2025, citing personal reasons. The resignation affects the company's senior management structure in the people and culture function.",
            "Sentiment": "neutral",
            "PublishDate": 1765198998124,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quick Heal Technologies VP Head of Delivery Resigns for Professional Growth",
            "Summary": "Mr. Ajit Zanjad, Vice President Head of Delivery at Quick Heal Technologies Limited, resigned from his position effective November 28, 2025, citing professional growth as the reason. The resignation affects the company's senior management structure as Zanjad held a key delivery leadership role within the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1764397894944,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quick Heal Technologies Secures INR 64.25 Crore Cybersecurity Contract with NFSU Research Council",
            "Summary": "Quick Heal Technologies Limited has entered into a 5-year contract worth INR 64.25 crore with NFSU Research and Innovation Council for implementation of Integrated Cyber Security Solutions. The company views this as a major commercial engagement that reinforces its leadership position and expects similar projects to become a consistent part of its business portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1764393443468,
            "Source": "order&deals"
        },
        {
            "Title": "Quick Heal Technologies Grants 48,000 Employee Stock Options",
            "Summary": "Quick Heal Technologies' Nomination and Remuneration Committee approved the grant of 48,000 employee stock options to eligible employees at an exercise price of ₹151 per share. The options are exercisable into equity shares with a face value of ₹10 each, featuring a 4-year vesting schedule with 25% vesting annually and a 3-year exercise window post-vesting.",
            "Sentiment": "positive",
            "PublishDate": 1764327140319,
            "Source": "corporate_action"
        },
        {
            "Title": "Quick Heal Technologies Allots 9,103 Equity Shares Under ESOP Schemes",
            "Summary": "Quick Heal Technologies Limited issued 9,103 equity shares of ₹10 each on November 27, 2025, under its ESOP Scheme 2014 and ESOP Scheme 2021. The shares will be credited to demat accounts and are identical to existing equity shares with no lock-in restrictions.",
            "Sentiment": "neutral",
            "PublishDate": 1764223411402,
            "Source": "corporate_action"
        },
        {
            "Title": "Quick Heal Technologies Allots 32,205 Equity Shares Under ESOP Scheme",
            "Summary": "Quick Heal Technologies Limited has allotted 32,205 equity shares under its ESOP Scheme 2021. The shares were issued on November 5, 2025, with a face value of Rs. 10 each. The shares have been assigned distinctive numbers 7,21,61,177 to 7,21,93,381 and will be credited under a temporary ISIN IN8306L01019 until final trading approval is received, after which they will be transferred to the company's permanent ISIN INE306L01010. The newly issued shares are identical in all respects to the existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762354725375,
            "Source": "corporate_action"
        },
        {
            "Title": "Quick Heal Technologies Reports Strong Q2 FY26 Recovery with 13.6% Revenue Growth",
            "Summary": "Quick Heal Technologies Limited announced its quarterly results with revenue of ₹83.5 crores for Q2 FY26, representing 13.6% year-over-year growth. The company reported EBITDA of ₹9.2 crores with an 11.1% margin, compared to ₹3.1 crores and 4.2% margin in Q2 FY25. Profit after tax increased to ₹7.9 crores from ₹4.2 crores in the previous year. For the half-year period, revenue declined 2.1% to ₹140.8 crores, with PAT dropping 70.7% to ₹2.4 crores. The cybersecurity solutions provider signed an MOU with BHASHINI for AI-powered cybersecurity modules and onboarded its first enterprise customer for the Data Privacy Management Platform. Enterprise revenue grew 30% year-over-year to ₹36.9 crores while consumer revenue increased 8.3% to ₹59.5 crores in Q2. The company operates through two subsidiaries: Quick Heal Technologies America Inc and Seqrite Technologies DMCC.",
            "Sentiment": "positive",
            "PublishDate": 1760549453988,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal Technologies: Ms. Apurva Joshi Completes Second Term as Independent Director, Mr. Kamal Kumar Agarwal Appointed to Committee Positions",
            "Summary": "Ms. Apurva Joshi completed her second term as Independent Woman Director of Quick Heal Technologies Limited on September 23, 2025, after serving for 5 years. Following her retirement, she ceased to hold positions as Chairperson of the Nomination and Remuneration Committee, Risk Management Committee, and Corporate Social Responsibility Committee, as well as Member of Stakeholder Relationship Committee and Audit Committee. The Board appointed Mr. Kamal Kumar Agarwal to replace her in these committee positions effective September 24, 2025. Ms. Joshi holds independent director positions in six other listed companies including Precision Camshafts Limited, Eleganz Interiors Limited, Paramount Speciality Forgings Limited, Fidel Softech Limited, Associated Alcohols & Breweries Limited, and Covidh Technologies Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758632513496,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quick Heal Technologies CEO Vishal Salvi's Resignation Becomes Effective",
            "Summary": "Quick Heal Technologies Limited confirmed that Vishal Salvi's resignation from his position as Chief Executive Officer and Key Managerial Personnel became effective on August 31, 2025. The company had previously announced his resignation on July 9, 2025. Salvi cited pursuing an alternative career path as the reason for his departure. The company has provided the required regulatory disclosures and attached his resignation letter to their stock exchange filing.",
            "Sentiment": "neutral",
            "PublishDate": 1756991538138,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quick Heal Reports Progress in AI and Machine Learning for Product Efficiency",
            "Summary": "Quick Heal has reported major progress in generative AI and machine learning technologies aimed at improving product efficiency. The company highlighted these developments in their annual report, indicating advancement in their technology capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1756884923999,
            "Source": "stock"
        },
        {
            "Title": "Quick Heal Technologies Releases Q1 FY2025-26 Earnings Call Transcript",
            "Summary": "Quick Heal Technologies Limited has made available the transcript of their investor/analyst call for Q1 FY2025-26, which was held on August 8, 2025. The transcript has been posted on the company's website and submitted to stock exchanges as part of disclosure requirements. The provided information contains only the cover letter notification and does not include the actual financial results, operational details, or management commentary from the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1755232418641,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal Technologies Announces Board Changes as Independent Director Completes Term",
            "Summary": "Quick Heal Technologies Limited announced that Mr. Bhushan Gokhale completed his term as an Independent Director on August 11, 2025, after serving for 5 years. Following his retirement, he ceased to be the Chairman of the Stakeholders Relationship Committee and Member of Audit Committee. The company appointed Ms. Amita Mirajkar as the new Chairman of Stakeholders Relationship Committee and member of Audit Committee effective August 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755069834242,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quick Heal Partners with Government's BHASHINI Platform for Multilingual Cybersecurity Education",
            "Summary": "Quick Heal Technologies Limited signed a memorandum of understanding with BHASHINI, the government's multilingual AI platform under the Ministry of Electronics and Information Technology, to provide cybersecurity and data privacy education in regional Indian languages. The partnership aims to address the gap where cybersecurity content remains primarily available in English despite India having over 800 million internet users. Quick Heal's Seqrite brand will integrate BHASHINI's language technology, which includes speech recognition, text translation, text-to-speech, and optical character recognition across 22 Indian languages. This will enable multilingual cybersecurity modules, real-time threat alerts in regional languages, and localised incident response guidance. A key application will be Seqrite's consent and preference management solution providing localised consent notice interfaces aligned with the Digital Personal Data Protection Act 2023. Quick Heal serves over 30,000 enterprises across 70 countries. The company's shares ended at ₹286.60, up by ₹1.50 or 0.53 per cent.",
            "Sentiment": "positive",
            "PublishDate": 1754917543608,
            "Source": "stock"
        },
        {
            "Title": "Quick Heal Technologies Makes Q1 FY2025-26 Earnings Call Recording Available to Investors",
            "Summary": "Quick Heal Technologies Limited has made the audio recording of its Q1 FY2025-26 earnings call available on the company's website. The earnings call was held on August 8, 2025, at 4:00 PM IST. The company disclosed the availability of the recording to stock exchanges NSE and BSE, providing a direct link for investors and analysts to access the audio content. The cybersecurity company fulfilled its transparency obligations by making the call recording publicly accessible within one day of the earnings call.",
            "Sentiment": "neutral",
            "PublishDate": 1754722377289,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal Technologies Appoints New Independent Director and Internal Auditor",
            "Summary": "Quick Heal Technologies Limited made two key appointments on August 07, 2025. Ms. Amita Mirajkar was appointed as Additional Non-Executive Woman Independent Director, subject to approval at the upcoming Annual General Meeting. Mirajkar holds an MBA in Technology Management from University of Phoenix (2013) and BE in Computer Engineering from Maharashtra Institute of Technology (2003). She serves as Vice President at EXL Services and was previously Co-Founder & CEO of Clairvoyant India. Her recognitions include Women in Tech Awards 2024 Finalist by Nasscom and Innovative Data Engineering Project of the year, 2024. Additionally, the company appointed P G BHAGWAT LLP as Internal Auditor. The chartered accountancy firm has over 85 years of experience providing audit, assurance, tax consultancy, and financial services, with expertise in internal audit implementation through effective risk and governance frameworks.",
            "Sentiment": "positive",
            "PublishDate": 1754584617709,
            "Source": "corporate_governance"
        },
        {
            "Title": "Quick Heal Technologies Reports Q1 FY26 Loss with Revenue Decline and Key Leadership Changes",
            "Summary": "Quick Heal Technologies Limited reported quarterly results for the period ended June 30, 2025, showing revenue of ₹57.2 crores, down 18.6% year-over-year from ₹70.3 crores. The company posted a net loss of ₹5.5 crores compared to a profit of ₹4.0 crores in the same quarter last year. EBITDA turned negative at ₹9.7 crores with a margin of -17.0%. The cybersecurity solutions provider faced headwinds in its consumer business and delays in enterprise deal closures. During the quarter, the company launched AntiFraud.AI freemium offering and achieved approximately 2x year-over-year revenue growth in international markets. The board appointed Ms. Amita Mirajkar as Additional Director and Woman Independent Director, and selected P G BHAGWAT LLP as Internal Auditor for FY 2025-26. CEO Vishal Salvi resigned on June 26, 2025, with his departure effective August 31, 2025. The company maintains an order book of ₹24+ crores and deferred revenue of ₹16.6 crores as of June 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754582882942,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal Technologies Secures 180 Million Rupee Order",
            "Summary": "Quick Heal Technologies has received an order valued at 180 million rupees (approximately $2.2 million USD). This represents a significant business deal for the company, which specializes in cybersecurity solutions.",
            "Sentiment": "positive",
            "PublishDate": 1746713021000,
            "Source": "default"
        },
        {
            "Title": "Quick Heal Technologies Reports Q4 Revenue Decline and Net Loss",
            "Summary": "Quick Heal Technologies announced its Q4 financial results. The company reported revenue of 651.4 million rupees, down from 800 million rupees in the same quarter last year. Additionally, Quick Heal posted a consolidated net loss of 32.5 million rupees, compared to a profit of 140 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1746552177000,
            "Source": "result"
        },
        {
            "Title": "Quick Heal Technologies to Consider Q4 Results on May 6",
            "Summary": "Quick Heal Technologies has announced that it will consider its fourth quarter (Q4) financial results on May 6. This indicates the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746022101000,
            "Source": "default"
        },
        {
            "Title": "Quick Heal Technologies Reports Significant Drop in Q3 Profit",
            "Summary": "Quick Heal Technologies has reported a substantial decrease in its consolidated net profit for the third quarter. The company's net profit fell to 1.1 million rupees, compared to 101 million rupees in the same quarter last year and 41.5 million rupees in the previous quarter. Additionally, the company's revenue declined to 706 million rupees from 819 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738714730000,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal Technologies Reports Q3 EBITDA Loss",
            "Summary": "Quick Heal Technologies has reported an EBITDA loss of 37.7 million rupees for the third quarter, compared to a profit of 116 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1738687559000,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal Technologies Reports Decline in Q3 Revenue",
            "Summary": "Quick Heal Technologies has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 706 million rupees, compared to 819 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1738687552000,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal Technologies Reports Significant Drop in Q3 Net Profit",
            "Summary": "Quick Heal Technologies has reported a substantial decrease in its consolidated net profit for the third quarter. The company's net profit fell to 1.1 million rupees, down from 101 million rupees in the same quarter last year. This represents a significant year-over-year decline. However, compared to the previous quarter, there was a slight improvement, with net profit increasing from 41.5 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1738687543000,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal Technologies to Consider Q3 Results on February 4",
            "Summary": "Quick Heal Technologies has announced that it will consider its third quarter (Q3) financial results on February 4. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738068836000,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal Technologies: Enterprise Focus Amid Muted Q2 Results",
            "Summary": "Quick Heal Technologies reported a 67.8% drop in Q2 net profit and a 6.2% decline in revenue. CEO Vishal Salvi emphasized a strategic shift towards enterprise solutions, expecting improvement in financial performance over the next 12 months. The company launched Seqrite Malware Analysis Platform (SMAP) targeting government and law enforcement agencies.",
            "Sentiment": "neutral",
            "PublishDate": 1733544359000,
            "Source": "earnings"
        },
        {
            "Title": "Quick Heal's Seqrite Unveils India Cyber Threat Report 2025 and New Security Solutions",
            "Summary": "Quick Heal Technologies, through its enterprise security brand Seqrite, has released the India Cyber Threat Report 2025, aiming to strengthen India's cybersecurity defenses. The company has also launched a Malware Analysis Platform and a Threat Intelligence Solution, demonstrating its commitment to enhancing the country's cyber resilience.",
            "Sentiment": "positive",
            "PublishDate": 1733357066000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quick Heal's Seqrite Launches India Cyber Threat Report 2025 and New Security Solutions",
            "Summary": "Quick Heal Technologies, through its enterprise security brand Seqrite, has unveiled the India Cyber Threat Report 2025. The company has also launched a Malware Analysis Platform and a Threat Intelligence Solution, aiming to strengthen India's cybersecurity defenses. These initiatives demonstrate Quick Heal's commitment to addressing evolving cyber threats and providing advanced security solutions for businesses and organizations in India.",
            "Sentiment": "positive",
            "PublishDate": 1733314349000,
            "Source": "corporate_action"
        },
        {
            "Title": "Quick Heal Technologies Reports Significant Drop in Q2 EBITDA",
            "Summary": "Quick Heal Technologies has reported a substantial decrease in its Q2 EBITDA, falling to 30.7 million rupees from 109.7 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 4.18% from 14.00% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729183277000,
            "Source": "result"
        },
        {
            "Title": "Quick Heal Technologies Reports Q2 FY2024 Revenue",
            "Summary": "Quick Heal Technologies has reported its revenue for the second quarter. The company's revenue stands at 734.9 million rupees, showing a decrease from 783.6 million rupees year-over-year and an increase from 702.9 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729183265000,
            "Source": "result"
        },
        {
            "Title": "Quick Heal Technologies Reports Q2 FY24 Financial Results",
            "Summary": "Quick Heal Technologies has announced its consolidated net profit for the second quarter. The company reported a net profit of 41.5 million rupees, which represents a significant decrease from 129 million rupees in the same quarter last year (YoY). However, it shows a slight increase from 40.3 million rupees in the previous quarter (QoQ).",
            "Sentiment": "negative",
            "PublishDate": 1729183256000,
            "Source": "result"
        },
        {
            "Title": "Quick Heal Technologies Board Meeting for Q2 Results",
            "Summary": "<p><span class=\"neutral\">Quick Heal Technologies</span> has scheduled a <b>board meeting</b> for <span class=\"neutral\">October 17</span> to consider and approve the company's <span class=\"neutral\">financial results</span> for the <span class=\"neutral\">second quarter</span> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728657477000,
            "Source": "result"
        },
        {
            "Title": "Quick Heal: India's First Antifraud AI Solution Launch",
            "Summary": "<p>Quick Heal is set to introduce India's first <span class='positive'>Antifraud AI solution</span>, aiming to <span class='positive'>enhance</span> <b>cybersecurity</b> measures.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727947067000,
            "Source": "normal_news"
        },
        {
            "Title": "Quick Heal Technologies: CEO Emphasizes Importance of Cybersecurity Regulations",
            "Summary": "<p>Quick Heal Technologies CEO <span class='neutral'>Vishal Salvi</span> stresses the vital role of <span class='positive'>regulatory frameworks</span> in <b>cybersecurity</b>. The company launches <span class='positive'>AI-based fraud prevention solution</span> <b>AntiFraud.AI</b>, available on multiple platforms for Rs 750/year. <br/> Quick Heal aims to <span class='positive'>double its serviceable market</span> in the coming years and <span class='positive'>expand its presence</span> in overseas markets.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727936645000,
            "Source": "normal_news"
        }
    ]
}