{
    "Symbol": "RACE",
    "ISIN": "INE084Q01012",
    "News": [
        {
            "Title": "Race Eco Chain Board Meet Set for Feb 14 Q3FY26 Results",
            "Summary": "Race Eco Chain Limited has scheduled its board meeting for February 14, 2026, to consider and approve Q3FY26 standalone and consolidated unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770463023112,
            "Source": "co_actions_results"
        },
        {
            "Title": "Race Eco Chain invests ₹51 lakh in subsidiary",
            "Summary": "Race Eco Chain Limited invested ₹51 lakh in subsidiary Ganesha Recycling Chain Private Limited through rights issue, maintaining 51% ownership stake in the recycling business entity.",
            "Sentiment": "positive",
            "PublishDate": 1768905873446,
            "Source": "co_actions_results"
        },
        {
            "Title": "Race Eco Chain Approves Major Demerger Scheme",
            "Summary": "Race Eco Chain Limited board approves demerger of Biomass and Restore Bag divisions into two separate listed entities, along with key board changes and corporate office relocation.",
            "Sentiment": "positive",
            "PublishDate": 1765818999764,
            "Source": "co_actions_results"
        },
        {
            "Title": "Race Eco Chain Director Steps Down from Independent Role",
            "Summary": "Mr. Anil Kumar Behl resigns as Independent Director of Race Eco Chain Limited due to personal reasons, effective December 13, 2025, while continuing as Non-Executive Director.",
            "Sentiment": "neutral",
            "PublishDate": 1765627480377,
            "Source": "stocks"
        },
        {
            "Title": "Race Eco Chain Reports Strong Q2 FY26 Performance with 36% Revenue Growth and Strategic Partnership with Ganesha Ecosphere",
            "Summary": "Race Eco Chain delivered robust quarterly results with standalone revenue of ₹460.30 crore (36% YoY growth) and PAT of ₹3.76 crore (140% YoY growth), while forming a joint venture with Ganesha Ecosphere Limited to establish washing plants for premium rPET flakes production. The waste management company is expanding its collection network, launching the RACE App for supply chain digitization, and proposing a three-way business demerger to unlock value across its waste management, biomass, and recycled products segments.",
            "Sentiment": "positive",
            "PublishDate": 1763789956540,
            "Source": "earnings"
        },
        {
            "Title": "Race Eco Chain Reports Quarterly Financial Results for September 2025",
            "Summary": "Race Eco Chain Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company operates in plastic waste, home furnishing, made-up items, bags & garments, and briquettes businesses through three main divisions: Recycle Division (generating Rs. 9,202.73 lakhs in quarterly revenue), Restore Division (Rs. 283.18 lakhs), and Biomass Division (Rs. 124.87 lakhs). The consolidated results include subsidiary companies Ganesha Recycling Chain Private Limited, India Polymers Private Limited, Silverline Eco Thrive Limited, and Vasundhara Envirogreen Private Limited, along with associate company Prime Industries Limited. The company disinvested its 65% stake in India Polymers Private Limited and invested Rs. 5.10 crores in subsidiary Ganesha Recycling Chain Private Limited by subscribing to 510,000 shares at Rs. 10 face value with Rs. 90 premium per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762987129816,
            "Source": "earnings"
        },
        {
            "Title": "Race Eco Chain Reports Strong Q1 Growth with 81% Revenue Jump and Strategic Expansion Plans",
            "Summary": "Race Eco Chain Limited, a waste management and recycling company, reported consolidated revenue of ₹156.73 crore for the quarter ended June 30, 2025, representing an 81% year-over-year increase. The company's consolidated EBITDA grew 108% to ₹2.91 crore, while PAT surged 300% to ₹0.41 crore. The plastic packaging waste segment drove growth with revenue of ₹155.31 crore, up 97% year-over-year. However, the biofuel division faced challenges with revenue declining 95% to ₹0.33 crore due to procurement chain disruptions. The company operates through three segments: waste management, biofuel, and recycled products, with a pan-India presence including 80+ recycler network and 300+ supplier network. Race Eco Chain announced strategic initiatives including a joint venture with Ganesha Ecosphere Limited to set up washing plants for premium rPET flake production and plans for business demerger to separate into three focused entities. The company also launched the RACE App to streamline operations and received the ESG Excellence Award at LIFA Awards 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755597053360,
            "Source": "earnings"
        },
        {
            "Title": "Race Eco Chain Limited Reports Q2 2025 Results and Appoints New Auditors",
            "Summary": "Race Eco Chain Limited's Board approved quarterly financial results for the quarter ended June 30, 2025, in a meeting held on August 12, 2025. The company reported standalone revenue from operations of Rs. 9,881.38 lakhs and consolidated revenue of Rs. 15,672.60 lakhs for the quarter. Standalone profit for the period was Rs. 10.24 lakhs, while consolidated profit reached Rs. 41.3 lakhs. The Board also appointed M/s. SSAR & Associates as Internal Auditor for financial year 2025-2026 and M/s. HKS & Associates LLP as Secretarial Auditor for a five-year term from April 2025 to March 2030, subject to shareholder approval. Additionally, the Board approved the Annual Report for Financial Year 2024-2025. The company operates in plastic waste, home furnishing, madeup, bags & garments, and briquettes businesses across three divisions: Recycle, Restore, and Biomass.",
            "Sentiment": "neutral",
            "PublishDate": 1755000262365,
            "Source": "earnings"
        },
        {
            "Title": "Race Eco Chain Reports Improved Q4 EBITDA and Margin",
            "Summary": "Race Eco Chain has reported its Q4 financial results. The company's EBITDA increased to 34 million rupees, up from 10 million rupees in the same quarter of the previous year. The EBITDA margin also improved, rising to 1.76% from 1.22% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748606579000,
            "Source": "result"
        },
        {
            "Title": "Race Eco Chain Reports Q4 Financial Results",
            "Summary": "Race Eco Chain announced its Q4 consolidated net profit of 15 million rupees, compared to 7 million rupees year-over-year and 16 million rupees quarter-over-quarter. The company's Q4 revenue was 1.9 billion rupees, up from 852 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748606502000,
            "Source": "result"
        },
        {
            "Title": "Race Eco Chain Invests 25.5 Million Rupees in Ganesha Recycling Chain",
            "Summary": "Race Eco Chain has made an investment of 25.5 million rupees in Ganesha Recycling Chain. This investment suggests a strategic move by Race Eco Chain to expand its presence in the recycling industry or to strengthen its existing recycling operations.",
            "Sentiment": "positive",
            "PublishDate": 1744719184000,
            "Source": "corporate_action"
        },
        {
            "Title": "GST Department Conducts Search at Race Eco Chain Office",
            "Summary": "The GST Department has conducted search operations at Race Eco Chain's office due to alleged contraventions of the GST Act regarding excess Input Tax Credit (ITC) claims. In response, the company has paid 19 million rupees towards Integrated Goods and Services Tax (IGST) under protest.",
            "Sentiment": "negative",
            "PublishDate": 1743466332000,
            "Source": "corporate_governance"
        },
        {
            "Title": "GST Department Conducts Search at Race Eco Chain Office",
            "Summary": "The GST Department has conducted search operations at Race Eco Chain's office due to alleged contraventions of the GST Act regarding excess Input Tax Credit (ITC) claims. The company has paid 19 million rupees towards Integrated Goods and Services Tax (IGST) under protest.",
            "Sentiment": "negative",
            "PublishDate": 1743172690000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Race Eco Chain Reports Mixed Q3 Financial Results",
            "Summary": "Race Eco Chain announced its Q3 financial results. The company's EBITDA increased to 30 million rupees from 15 million rupees year-over-year, showing significant growth. However, the EBITDA margin decreased to 1.8% from 2.04% compared to the same period last year, indicating a slight decline in profitability relative to revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1739278293000,
            "Source": "earnings"
        },
        {
            "Title": "Race Eco Chain Reports Significant Growth in Q3 Financial Results",
            "Summary": "Race Eco Chain has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased to 18 million rupees, up from 6 million rupees in the same quarter last year. Revenue also saw a significant boost, reaching 1.68 billion rupees compared to 727 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739278288000,
            "Source": "earnings"
        },
        {
            "Title": "Race Eco Chain and Ganesha Ecosphere Form Joint Venture",
            "Summary": "Race Eco Chain and Ganesha Ecosphere have signed a joint venture agreement. Race Eco Chain will hold a majority stake of 51% equity in the new joint venture.",
            "Sentiment": "positive",
            "PublishDate": 1738581698000,
            "Source": "corporate_action"
        },
        {
            "Title": "RACE ECO CHAIN Reports Significant Profit Growth in Q2",
            "Summary": "RACE ECO CHAIN has reported a substantial increase in net profit for the second quarter, rising from 4 million rupees to 40 million rupees year-over-year. The company's revenue also saw growth, increasing from 862 million rupees to 1 billion rupees in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1731404941000,
            "Source": "result"
        },
        {
            "Title": "Race Eco Chain Approves Investment in Silverline Eco Thrive",
            "Summary": "<p><span class='neutral'>Race Eco Chain</span> has approved an <span class='positive'>investment</span> by subscribing to shares of <span class='neutral'>Silverline Eco Thrive</span>, a company operating in the <span class='positive'>recycling industry</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727978700000,
            "Source": "corporate_action"
        }
    ]
}