{
    "Symbol": "RACLGEAR",
    "ISIN": "INE704B01017",
    "News": [
        {
            "Title": "RACL Geartech Board Meet on Feb 13 for Q3 Results",
            "Summary": "RACL Geartech Limited has scheduled a board meeting on February 13, 2025, to consider Q3FY26 unaudited financial results and interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1770732419681,
            "Source": "co_actions_results"
        },
        {
            "Title": "RACL Geartech Wins Silver ESG Rating from TVS Motors",
            "Summary": "RACL Geartech Limited received Silver rating and Certificate of Appreciation from TVS Motors for ESG practices at TVS Supplier Sustainability Summit 2025 in Bengaluru on December 15, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765890738789,
            "Source": "stocks"
        },
        {
            "Title": "RACL Geartech Reports Strong Q2 FY25-26 Performance with 16.2% Revenue Growth",
            "Summary": "RACL Geartech delivered robust quarterly results with revenue rising 16.2% to INR 122.84 crores and EBITDA growing 38.96% to INR 29.79 crores, while securing new business nominations from premium two-wheeler manufacturers. The company strengthened its market position through a technical collaboration with Germany's ARRK Engineering GmbH and received upgraded credit rating outlook from Care Ratings, moving from stable to positive.",
            "Sentiment": "positive",
            "PublishDate": 1764915255129,
            "Source": "earnings"
        },
        {
            "Title": "RACL Geartech Reports Strong Q2 Performance with 24% Revenue Growth and Board Approves Succession Policy",
            "Summary": "RACL Geartech Limited's Board approved unaudited financial results for the quarter ended September 30, 2025, showing total revenue of Rs. 122.84 crores with 24.25% growth and EBITDA of Rs. 29.79 crores. The Board also approved a Succession Policy for Board and Senior Management Personnel during their meeting on November 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763134674889,
            "Source": "earnings"
        },
        {
            "Title": "RACL Geartech Partners with ARRK Engineering GmbH to Expand Automotive Design and Validation Services",
            "Summary": "RACL Geartech Limited has entered into a strategic technical agreement with ARRK Engineering GmbH, a German engineering services provider. The partnership aims to combine ARRK Engineering's expertise in product design, prototyping, virtual simulation, testing and validation with RACL Geartech's capabilities in mass production of high-precision gears, shafts and precision machined components for automotive and E-Mobility markets. Through this alliance, RACL Geartech will be positioned to offer end-to-end solutions including manufacturing of drive line components and product design, engineering, testing and validation services. The agreement enables RACL to provide concept-to-production solutions to OEMs and Tier-1 suppliers at earlier stages of product development cycles, allowing the company to transition from a component supplier to an end-to-end engineering and industrialization solution provider.",
            "Sentiment": "positive",
            "PublishDate": 1757937680201,
            "Source": "stock"
        },
        {
            "Title": "RACL Geartech Reports 20% EBITDA Growth in Q1 FY26, Secures New Business Orders",
            "Summary": "RACL Geartech Limited, a precision engineering company specializing in automotive components, reported revenue of ₹107.96 crores with 2% year-on-year growth in Q1 FY26. The company achieved stronger profitability with EBITDA rising 20% to ₹26.8 crores and EBITDA margin expanding to 24.83% from 21.1% in the previous year. Profit after tax increased 28% to ₹8.29 crores. Exports contributed ₹65.5 crores, representing 60.31% of revenue, while the export-to-domestic revenue mix shifted from 70:30 to 60:40. The company secured new business nominations including a high-volume order from an Indian two-wheeler manufacturer for premium motorcycles starting January/February 2026, and an order from BRP Canada for 150,000-180,000 parts annually beginning 2026. RACL added two new directors to its board and registered as an approved vendor for BHEL. The company is developing new technologies for electric vehicles and expanding its product portfolio beyond transmission gears. Management maintains its revenue guidance and expects to achieve ₹1000 crore revenue by FY29, with planned capex of ₹50 crores for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1756298996210,
            "Source": "earnings"
        },
        {
            "Title": "RACL Geartech Secures Long-Term Supply Order for Transmission Gears from Indian Premium Motorcycle Manufacturer",
            "Summary": "RACL Geartech has secured a long-term supply order for transmission gears from a leading Indian premium motorcycle manufacturer. This order represents the company's strategic entry into the domestic high-end 2-wheeler market and demonstrates its technological capabilities in the premium motorcycle segment.",
            "Sentiment": "positive",
            "PublishDate": 1755687890776,
            "Source": "order&deals"
        },
        {
            "Title": "RACL Geartech Limited Submits Newspaper Publication of Quarterly Financial Results",
            "Summary": "RACL Geartech Limited submitted newspaper publications of its unaudited financial results for the quarter ended June 30, 2025 to the National Stock Exchange and Bombay Stock Exchange. The company published both standalone and consolidated financial results in Financial Express (English) and Jansatta (Hindi) newspapers, Delhi NCR edition. The submission was made by Company Secretary & Compliance Officer Neha Bahal on August 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754984596738,
            "Source": "earnings"
        },
        {
            "Title": "RACL Geartech Q1 Results: Net Profit Doubles Despite Revenue Decline",
            "Summary": "RACL Geartech reported Q1 consolidated net profit of 82.6 million rupees, nearly doubling from 41.5 million rupees in the same period last year. However, Q1 revenue declined to 1.01 billion rupees from 1.09 billion rupees year-over-year. EBITDA decreased to 188 million rupees from 198.4 million rupees, while EBITDA margin improved to 18.70% from 18.23% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754920950749,
            "Source": "earnings"
        },
        {
            "Title": "Company Appoints Two New Directors and Changes Auditors",
            "Summary": "A company has made several key appointments effective August 11, 2025, subject to member approval at the upcoming Annual General Meeting. Mr. Pravir Kumar has been appointed as Additional Director in the category of Non-Executive Independent Director. Kumar is a 1982 batch IAS officer with a Bachelor's degree in Electrical Engineering from IIT Kanpur, who previously served as Director General Foreign Trade and held various positions in Central and State Governments. Mr. Rakesh Kapoor has been appointed as Additional Director in the capacity of Non-Executive Non-Independent Director. Kapoor brings over 48 years of experience in corporate and financial sectors, including more than 20 years at IFCI Limited and previous service as the company's Independent Director. The company has also appointed M/s. Gupta Nayar & CO. as Statutory Auditor for a 3-year period and M/s. Rosy Jaiswal & Associates as Secretarial Auditor for 5 years. Both newly appointed directors have no relationships with existing directors.",
            "Sentiment": "positive",
            "PublishDate": 1754918796151,
            "Source": "corporate_governance"
        },
        {
            "Title": "RACL Geartech Limited Completes Vendor Registration with BHEL",
            "Summary": "RACL Geartech Limited has successfully completed vendor registration with Bharat Heavy Electricals Limited (BHEL). The company received a unique Vendor Code under the Pre-qualified Material Suppliers category for industrial and heavy equipment. The registration confirms RACL's ability to meet BHEL's technical and quality standards for supplying precision-engineered components. This development strengthens RACL's position as a partner in the Indian manufacturing ecosystem and supports its involvement in critical infrastructure and industrial sectors.",
            "Sentiment": "positive",
            "PublishDate": 1754649092709,
            "Source": "stock"
        },
        {
            "Title": "RACL Geartech Promotes Two Senior Executives to CTO and COO Positions",
            "Summary": "RACL Geartech Limited announced the promotion and redesignation of two senior management personnel effective August 1, 2025. Rajiv Kumar Goel has been promoted from Vice President of Engineering & Product Development to Chief Technical Officer (CTO). Prabh Mehar Singh has been promoted from Vice President of Finance & Business Excellence to Chief Operating Officer (COO). The promotions are part of organizational changes in reporting structure and appraisal process, recognizing their exceptional leadership, dedication and valuable contributions to the company. The changes are subject to ratification in the upcoming Nomination and Remuneration Committee and Board Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1754048998481,
            "Source": "corporate_governance"
        },
        {
            "Title": "RACL Geartech Reports Q4 Financial Results",
            "Summary": "RACL Geartech has released its Q4 financial results. The company reported revenue of 873 million rupees, down from 1.06 billion rupees year-over-year. EBITDA for Q4 was 191 million rupees, compared to 234 million rupees in the previous year. The EBITDA margin remained relatively stable at 21.9% versus 22% year-over-year. Consolidated net profit for Q4 was 65 million rupees, down from 84 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1746611154000,
            "Source": "result"
        },
        {
            "Title": "Racl Geartech Approves Fundraising Through Preferential Equity Issue",
            "Summary": "Racl Geartech has approved a fundraising plan through a preferential equity issue. The company will offer 830,711 shares at 794.50 rupees each to Qualified Institutional Buyers (QIBs), aiming to raise up to 656 million rupees. Additionally, 175,769 shares will be offered at 796.50 rupees each to non-QIBs, with the goal of raising up to 140 million rupees. The total fundraising target is approximately 796 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1744329923000,
            "Source": "corporate_action"
        },
        {
            "Title": "Racl Geartech Collaborates with ZF Rane for Electric Power Steering Components",
            "Summary": "Racl Geartech has announced a strategic partnership with ZF Rane, a ZF Group company, to develop and supply critical components for Electric Power Steering (EPS) systems in the passenger car segment. This collaboration aims to enhance their position in the automotive components market, particularly in the growing field of electric vehicle technologies.",
            "Sentiment": "positive",
            "PublishDate": 1738885451000,
            "Source": "corporate_action"
        },
        {
            "Title": "Racl Geartech Reports Q3 Financial Results and Future Projections",
            "Summary": "Racl Geartech announced its Q3 consolidated net profit of 65 million rupees, down from 120 million rupees year-over-year. Q3 revenue was 1.12 billion rupees, slightly lower than 1.13 billion rupees in the previous year. The company projects an annual budgeted revenue of 5.25 billion rupees (+/- 5%) for FY25-26. Racl Geartech anticipates investing 1.50-1.75 billion rupees over the next 3 years and plans to explore funding options for 1 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738359870000,
            "Source": "earnings"
        },
        {
            "Title": "RACL GEARTECH Announces Revenue Projections and Investment Plans",
            "Summary": "RACL GEARTECH has projected its annual budgeted revenue for FY25-26 at 5.25 billion rupees, with a 5% margin of error. The company anticipates investing 1.50-1.75 billion rupees over the next three years. Additionally, RACL GEARTECH plans to explore funding options for 1 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738325585000,
            "Source": "corporate_action"
        },
        {
            "Title": "RACL GEARTECH Reports Q3 Financial Results",
            "Summary": "RACL GEARTECH announced its Q3 consolidated financial results. The company reported a net profit of 65 million rupees, which is a decrease from 120 million rupees year-over-year. However, it remains stable at 65 million rupees quarter-over-quarter. The Q3 revenue was reported at 1.12 billion rupees, slightly down from 1.13 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738325305000,
            "Source": "earnings"
        },
        {
            "Title": "RACL Geartech Secures New Nomination from BMW for Electric Sports Car Parts",
            "Summary": "RACL Geartech has received a new nomination from BMW AG to supply drive train parts for their upcoming electric sports car. This marks the company's second nomination in the electric vehicle (EV) passenger car segment, aligning with RACL Geartech's strategy to strengthen its EV portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1731933246000,
            "Source": "corporate_action"
        },
        {
            "Title": "RACL GEARTECH Reports Q2 EBITDA Decline",
            "Summary": "RACL GEARTECH's Q2 EBITDA decreased to 190 million rupees from 227 million rupees year-over-year. The company's EBITDA margin also fell to 17.92% from 22.23% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731593567000,
            "Source": "result"
        },
        {
            "Title": "RACL GEARTECH Reports Q2 Financial Results",
            "Summary": "RACL GEARTECH announced its Q2 consolidated financial results. The company reported a net profit of 65 million rupees, down from 102 million rupees year-over-year and up from 42 million rupees quarter-over-quarter. Revenue for Q2 was 1.06 billion rupees, slightly up from 1.02 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731593528000,
            "Source": "result"
        },
        {
            "Title": "RACL Geartech: CARE Ratings Reaffirms 'A-' Rating with Stable Outlook",
            "Summary": "<p><span class='positive'>CARE Ratings</span> has <span class='neutral'>reaffirmed</span> RACL Geartech's long-term rating at '<b>CARE A-</b>' with a <span class='positive'>stable</span> outlook and short-term rating at '<b>CARE A2+</b>'. The ratings reflect the company's <span class='positive'>experienced promoters</span>, <span class='positive'>established market position</span>, and <span class='positive'>diversified revenue mix</span>. However, <span class='negative'>moderate financial risk profile</span> and <span class='negative'>industry cyclicality</span> remain concerns.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728276360000,
            "Source": "normal_news"
        },
        {
            "Title": "RACL Geartech: Credit Ratings Reaffirmed and Assigned by CARE",
            "Summary": "<p>CARE Ratings has <span class='neutral'>reaffirmed</span> RACL Geartech's long-term rating at '<span class='positive'>CARE A-; Stable</span>' for Rs 161.43 crore facilities. For Rs 166.50 crore long-term/short-term facilities, CARE <span class='neutral'>reaffirmed</span> '<span class='positive'>A-; Stable</span>' and <span class='neutral'>assigned</span> '<span class='positive'>CARE A2+</span>' for short-term. Short-term facilities of Rs 9 crore <span class='neutral'>reaffirmed</span> at '<span class='positive'>CARE A2+</span>'.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728118440000,
            "Source": "corporate_action"
        }
    ]
}