{
    "Symbol": "RADAAN",
    "ISIN": "INE874F01027",
    "News": [
        {
            "Title": "Radaan Mediaworks Q2FY26 Loss Widens to ₹152.59 Cr",
            "Summary": "Radaan Mediaworks reported a net loss of ₹152.59 crores for Q2FY26 compared to ₹25.44 crores profit in Q2FY25. Revenue from teleserials increased to ₹189.44 crores. Company cancelled property deal worth ₹1,941.54 crores during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1768304353960,
            "Source": "co_actions_results"
        },
        {
            "Title": "Radaan Mediaworks Reports Quarterly Loss with Going Concern Warnings",
            "Summary": "Radaan Mediaworks India Limited released unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025, with auditors issuing qualified conclusions citing material uncertainty about the company's ability to continue as a going concern. The company faces liquidity challenges with fully eroded net worth, current liabilities exceeding current assets, and Rs. 343.02 lakhs in unpaid statutory dues, while auditors also flagged untested subsidiary investments for impairment.",
            "Sentiment": "negative",
            "PublishDate": 1763141007139,
            "Source": "earnings"
        },
        {
            "Title": "Radaan Mediaworks India Limited Changes R. Sarathkumar's Role from Whole-Time Director to Non-Executive Director",
            "Summary": "Radaan Mediaworks India Limited announced a change in designation for R. Sarathkumar from Whole-Time Director to Non-Executive Director, effective October 15, 2025. The Board of Directors approved this change based on the recommendation of the Nomination and Remuneration Committee. The reason cited for the change was due to other pre-occupied engagements and compliance with Companies Act and SEBI Regulations, with Sarathkumar voluntarily stepping down to the non-executive role with the consent of Board Members. The company disclosed that R. Sarathkumar is the husband of Mrs. R. Radikaa Sarathkumar and father of Mrs. Radikaa Rayane.",
            "Sentiment": "neutral",
            "PublishDate": 1760442888736,
            "Source": "corporate_governance"
        },
        {
            "Title": "Radaan Mediaworks Approves Q1 FY26 Financial Results and Appoints New Secretarial Auditors",
            "Summary": "Radaan Mediaworks India Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company also appointed KRA & Associates as Secretarial Auditors for a 5-year term starting FY 2025-26, subject to shareholder approval at the upcoming Annual General Meeting. KRA & Associates is a Chennai-based firm specializing in secretarial audit, ROC filings, and regulatory compliances. The board meeting was held on August 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755184163007,
            "Source": "earnings"
        },
        {
            "Title": "Radaan Mediaworks Cancels Property Deal with Mrs. R.Radikaa Sarathkumar Due to Construction Delays",
            "Summary": "Radaan Mediaworks India Limited cancelled a deed of sale and construction agreement for an immovable property (3rd floor of a commercial property) purchased from Mrs. R.Radikaa Sarathkumar. The original agreements were executed on September 26, 2018, and the cancellation was registered on August 11, 2025. The cancellation was due to delays in construction completion caused by the Covid-19 pandemic and subsequent economic challenges. The builder could not conclude construction due to delays in finalizing commercial leasing deals for the 1st and 2nd floors. The company's audit committee and board of directors recommended the cancellation in their February 14, 2025 meetings, and shareholders approved the decision through postal ballot on March 25, 2025. The cancellation was executed as per the terms of the original agreement, considering the project delays and impact on the company's cash flow during the pandemic.",
            "Sentiment": "negative",
            "PublishDate": 1754993566229,
            "Source": "stock"
        }
    ]
}