{
    "Symbol": "RADHIKAJWE",
    "ISIN": "INE583V01021",
    "News": [
        {
            "Title": "Radhika Jeweltech Reports 74% Jump in Q2 Net Profit to 184 Million Rupees",
            "Summary": "Radhika Jeweltech reported net profit of 184 million rupees in Q2, representing a significant increase from 106 million rupees in the same period last year. The company's revenue grew to 1.33 billion rupees compared to 1.3 billion rupees year-over-year, showing modest growth in the top line alongside strong profitability improvement.",
            "Sentiment": "positive",
            "PublishDate": 1762761151635,
            "Source": "earnings"
        },
        {
            "Title": "Radhika Jeweltech Reports 39% Jump in Q1 Net Profit to 182 Million Rupees",
            "Summary": "Radhika Jeweltech posted a net profit of 182 million rupees in Q1, marking a significant increase from 131 million rupees in the same period last year. The company's revenue also grew to 991 million rupees compared to 937 million rupees year-over-year, reflecting overall business expansion across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1753791409518,
            "Source": "earnings"
        },
        {
            "Title": "Radhika Jeweltech Reports Q4 Financial Results",
            "Summary": "Radhika Jeweltech has announced its Q4 financial results. The company's EBITDA increased to 195 million rupees from 161.6 million rupees year-over-year. The EBITDA margin improved to 12.47% from 10.52% in the same period last year. Net profit slightly decreased to 111 million rupees from 114.6 million rupees year-over-year. Revenue saw a modest increase to 1.56 billion rupees from 1.54 billion rupees in the previous year's quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748076264000,
            "Source": "result"
        },
        {
            "Title": "Radhika Jeweltech Reports Strong Q3 Financial Results",
            "Summary": "Radhika Jeweltech has announced its financial results for the third quarter. The company's net profit increased to 227 million rupees, up from 157 million rupees in the same period last year. Revenue also saw growth, reaching 2.06 billion rupees compared to 1.8 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737073341000,
            "Source": "earnings"
        },
        {
            "Title": "Radhika Jeweltech Reports Strong Q3 EBITDA Growth",
            "Summary": "Radhika Jeweltech has announced its Q3 financial results, showing significant improvement in EBITDA performance. The company's EBITDA increased to 317 million rupees, up from 215 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 15.37% from 12.24% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737028972000,
            "Source": "earnings"
        },
        {
            "Title": "Radhika Jeweltech Reports Strong Q3 Financial Results",
            "Summary": "Radhika Jeweltech has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 227 million rupees from 157 million rupees in the same quarter last year. Revenue also saw a rise, reaching 2.06 billion rupees compared to 1.8 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1737028963000,
            "Source": "earnings"
        },
        {
            "Title": "Radhika Jeweltech Reports Q2 Financial Results",
            "Summary": "Radhika Jeweltech announced its Q2 financial results. The company's net profit increased to 106 million rupees from 86 million rupees year-over-year. Revenue also saw growth, rising to 1.3 billion rupees from 1.1 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730105462000,
            "Source": "result"
        }
    ]
}