{
    "Symbol": "RADIOCITY",
    "ISIN": "INE919I01024",
    "News": [
        {
            "Title": "Music Broadcast Q3FY26 Shows Strong Recovery",
            "Summary": "Music Broadcast Limited reported significant improvement in Q3FY26 with revenue of ₹46.4 crores and operating EBITDA of ₹15.9 crores, marking a strong sequential turnaround from previous quarter losses.",
            "Sentiment": "positive",
            "PublishDate": 1770382138501,
            "Source": "co_actions_results"
        },
        {
            "Title": "Music Broadcast Q3FY26 Earnings Call on Feb 4, 2026",
            "Summary": "Music Broadcast Limited announces earnings call on February 4, 2026 at 12:00 PM IST to discuss Q3FY26 financial results ended December 31, 2025, with CEO Abraham Thomas and CFO Rajiv Shah participating.",
            "Sentiment": "neutral",
            "PublishDate": 1769753559338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Music Broadcast Completes NCRPS Dividend & Redemption",
            "Summary": "Music Broadcast Limited has processed interim dividend of ₹ 0.01 per NCRPS and redemption at ₹ 120 per share for eligible holders as of record date January 09, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769600941740,
            "Source": "co_actions_results"
        },
        {
            "Title": "Music Broadcast Sets Jan 9 Record Date for Dividend",
            "Summary": "Music Broadcast Limited declares interim dividend of ₹0.01 per NCRPS and approves redemption of 89,69,597 preference shares worth ₹120 each, with record date set for January 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767596377131,
            "Source": "co_actions_results"
        },
        {
            "Title": "Music Broadcast receives ₹89.63 lakh GST demand order",
            "Summary": "Music Broadcast Limited received a GST demand order worth ₹89.63 lakh from Lucknow tax authorities for FY2021-22. The company plans to file an appeal and expects no material financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1766382595907,
            "Source": "stocks"
        },
        {
            "Title": "Music Broadcast Limited Updates Stock Exchanges on Material Litigation Status",
            "Summary": "Music Broadcast Limited disclosed that LPA bearing nos. 16 and 17 of 2024 in Contempt Petition No. 3238 of 2024 along with LPA No. 47 of 2025 in Contempt Petition No. 22810 of 2025 filed before the Division Bench of the Madras High Court are reserved for order as of November 26, 2025. The company stated it will provide further updates on any material developments in this matter, with no other changes in litigation status reported.",
            "Sentiment": "neutral",
            "PublishDate": 1764161902001,
            "Source": "corporate_governance"
        },
        {
            "Title": "Entertainment Network (India) Court Stay Order Continues, Litigation Status Unchanged",
            "Summary": "Entertainment Network (India) announced that an interim stay order granted by the court remains in effect. The status of ongoing litigation involving key management personnel shows no change from previous developments.",
            "Sentiment": "neutral",
            "PublishDate": 1763678833671,
            "Source": "corporate_governance"
        },
        {
            "Title": "Music Broadcast Projects Recovery Through Digital Audio Growth and Diversified Advertising",
            "Summary": "Music Broadcast anticipates a recovery driven by digital audio growth, non-FCT advertising, and brand integration opportunities. The company expects this recovery as advertising spending normalizes across various sectors.",
            "Sentiment": "positive",
            "PublishDate": 1761755136962,
            "Source": "stock"
        },
        {
            "Title": "Music Broadcast Limited Receives Rs 20,000 GST Demand Order from Delhi Tax Authority",
            "Summary": "Music Broadcast Limited (Radio City) received a demand order from the Assistant Commissioner/GSTO of Delhi under Section 73 of IGST/CGST/SGST Act, 2017 for financial year 2021-22. The order dated October 23, 2025 demands a total amount of Rs 20,000, comprising penalties of Rs 10,000 each under CGST and SGST acts, with no tax or interest components. The demand is entirely in the form of penalties.",
            "Sentiment": "negative",
            "PublishDate": 1761319891773,
            "Source": "stock"
        },
        {
            "Title": "Music Broadcast Limited's Chief Innovation Officer Resigns; Company Appeals Madras High Court Order",
            "Summary": "Music Broadcast Limited announced that Alok Barua, Chief Innovation Officer, resigned effective September 22, 2025, to pursue other professional opportunities. Barua submitted his resignation letter on July 24, 2025, stating no material reasons beyond career opportunities. Separately, the company provided an update on material litigation, revealing it has filed an appeal against a Madras High Court order dated August 26, 2025. The Division Bench granted a stay on the single judge's order and directed that the appeal be heard jointly with Phonographic Performance Limited's matter. The interim stay remains in force until the next hearing date.",
            "Sentiment": "neutral",
            "PublishDate": 1758545862960,
            "Source": "corporate_governance"
        },
        {
            "Title": "Music Broadcast Limited Appoints Divya Karani as Independent Director for Five-Year Term",
            "Summary": "Music Broadcast Limited has appointed Ms. Divya Rupchand Karani as a Non-Executive Independent Director for a five-year term from July 24, 2025 to July 23, 2030. The appointment was approved by shareholders at the 26th Annual General Meeting held on September 17, 2025, based on the Board of Directors' recommendation. Ms. Karani brings extensive experience in Communication & Media, Marketing, and Business Leadership across South East Asia, UK, and Asia Pacific. She previously served as CEO of Dentsu South Asia Media for 12 years until 2023 and currently serves as Independent Non-Executive Director on the boards of ZEE Entertainment Enterprises Limited and Jagran Prakashan Limited. She holds no shares in Music Broadcast Limited and has no relationship with other directors.",
            "Sentiment": "positive",
            "PublishDate": 1758115659662,
            "Source": "corporate_governance"
        },
        {
            "Title": "Music Broadcast Limited Receives Court Order on SIMCA Royalty Dispute",
            "Summary": "Music Broadcast Limited disclosed that the Madras High Court issued an order directing the company to produce music logs for SIMCA members from August 2010 to December 2020 and calculate royalty payments at needle-per-hour rates as per individual agreements. The court gave the company four weeks to comply and scheduled the next hearing for September 26, 2025. The order does not require any immediate payment to the petitioner or court. Music Broadcast Limited plans to file an appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1756229606242,
            "Source": "corporate_governance"
        },
        {
            "Title": "Music Broadcast Limited Reports Rs 49 Crore Revenue with 16.1% EBITDA Margin in Q1 FY26",
            "Summary": "Music Broadcast Limited reported revenue of Rs 49 crores and operating EBITDA of Rs 8 crores with a 16.1% margin for the quarter ended June 30, 2025. The company posted a negative PAT of Rs 2 crores while maintaining cash reserves of Rs 354 crores. Performance was impacted by industry-wide volume decline of 2% due to global economic uncertainties and trade tensions affecting advertising spend. Radio City maintained leadership with 41% market share of total radio sector clients and 34% of new clients choosing the platform. Alternative revenue streams contributed 35% of total income, including branded properties, digital ventures, and events. The company has FCT split of 65% and NFCT of 35%, with inventory utilization at 68%. Management indicated cost restructuring measures are underway and expects improved margins in coming quarters. Digital business has been growing at 20-25% annually over the past two years. The company launched music platform Muzartdisco and podcast platform as part of diversification strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1753856492699,
            "Source": "earnings"
        },
        {
            "Title": "Music Broadcast Limited CFO Prashant Domadia Resigns to Pursue Other Opportunities",
            "Summary": "Prashant Domadia, Chief Financial Officer and Key Managerial Personnel of Music Broadcast Limited, has resigned from his position effective August 15, 2025. Domadia tendered his resignation on July 25, 2025, citing his intention to pursue other professional opportunities. The resignation will take effect from the close of business hours on August 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753446802958,
            "Source": "corporate_governance"
        },
        {
            "Title": "Music Broadcast Charts Digital Growth Strategy With AI Innovation and Diversified Revenue Streams",
            "Summary": "Music Broadcast is pursuing a digital-led growth strategy with 10% of advertising revenue now coming from digital platforms. The company is implementing AI-based RJ innovation and has achieved 35% contribution from non-traditional verticals. The company aims to scale monetizable intellectual properties and develop youth-centric platforms as part of its long-term expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1753368760836,
            "Source": "stock"
        },
        {
            "Title": "Music Broadcast Limited Appoints Divya Rupchand Karani as Independent Director",
            "Summary": "Music Broadcast Limited has appointed Ms. Divya Rupchand Karani as an Additional Non-Executive Independent Director for a five-year term effective July 24, 2025. The appointment was made based on the recommendation of the Nomination and Remuneration Committee and approval from the Ministry of Information and Broadcasting. The appointment is subject to shareholder approval at the upcoming Annual General Meeting. Karani brings extensive experience in communication, media, marketing, and business leadership across South East Asia, UK, and Asia Pacific. She previously served as CEO of Dentsu South Asia Media for 12 years until 2023 and currently serves as an Independent Non-Executive Director on the boards of ZEE Entertainment Enterprises Limited and Jagran Prakashan Limited. She holds no shares in Music Broadcast Limited.",
            "Sentiment": "positive",
            "PublishDate": 1753360675204,
            "Source": "corporate_governance"
        },
        {
            "Title": "Music Broadcast Limited Reports Quarterly Results and Appoints New Independent Director",
            "Summary": "Music Broadcast Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 5,000.06 lakhs compared to Rs 4,932.31 lakhs in the previous quarter. The company posted a profit of Rs 257.88 lakhs for the current quarter versus a loss of Rs 3,394.74 lakhs in the previous quarter. Basic and diluted earnings per share stood at Rs 0.07 compared to Rs (1.10) in the previous quarter. Additionally, the Board appointed Ms. Divya Rupchand Karani as an Additional Non-Executive Independent Director for a five-year term effective July 24, 2025, subject to shareholder approval. Ms. Karani brings extensive experience in communication, media, and marketing, having previously served as CEO of Dentsu South Asia Media for 12 years until 2023.",
            "Sentiment": "positive",
            "PublishDate": 1753358845016,
            "Source": "corporate_action"
        },
        {
            "Title": "Music Broadcast Limited Reports Quarterly Results and Appoints New Independent Director",
            "Summary": "Music Broadcast Limited announced its unaudited financial results for the quarter ended June 30, 2025, approved by the Board of Directors on July 24, 2025. The company reported revenue from operations of Rs 5,000.06 lakhs compared to Rs 4,032.46 lakhs in the previous quarter. The company recorded a profit of Rs 257.88 lakhs for the quarter versus a loss of Rs 217.98 lakhs in the previous quarter. Additionally, the Board appointed Ms. Divya Rupchand Karani as an Additional Non-Executive Independent Director for a five-year term, effective July 24, 2025, subject to shareholder approval. Ms. Karani brings extensive experience in communication, media, and marketing, having previously served as CEO of Dentsu South Asia Media for 12 years until 2023.",
            "Sentiment": "positive",
            "PublishDate": 1753357267954,
            "Source": "earnings"
        },
        {
            "Title": "Music Broadcast Limited Schedules Q1 FY26 Earnings Call for July 25, 2025",
            "Summary": "Music Broadcast Limited has scheduled a conference call on July 25, 2025, at 2:00 PM IST to discuss the company's financial performance for the first quarter ended June 30, 2025. The earnings call will be led by CEO Ashit Kukian and Rajiv Shah from the IR team. Participants can pre-register for the call, with both local and international toll-free access numbers provided. The conference call details are available on the company's website at www.radiocity.in.",
            "Sentiment": "neutral",
            "PublishDate": 1753176783700,
            "Source": "earnings"
        },
        {
            "Title": "Music Broadcast Updates on Contempt Petition at Madras High Court",
            "Summary": "Music Broadcast Limited has informed stock exchanges about Contempt Petition No. 3238 of 2024, which has been reserved for order by the Madras High Court. The company stated that there are no new developments regarding key personnel or promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1752241233000,
            "Source": "default"
        },
        {
            "Title": "Music Broadcast Reports Q4 Financial Results",
            "Summary": "Music Broadcast Limited has reported its financial results for the fourth quarter. The company's revenue decreased to 546.7 million rupees from 626.3 million rupees in the same quarter last year. Music Broadcast also reported a net loss of 380.3 million rupees for Q4, compared to a profit of 29.7 million rupees in the same period last year and a profit of 36 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1747757642000,
            "Source": "result"
        },
        {
            "Title": "Music Broadcast: Q3 Profit Surges 40%, Revenue Up 8%",
            "Summary": "Music Broadcast reported Q3 FY25 results with profit rising 40.08% YoY to ₹3.6 crore and revenue increasing 8.17% to ₹65.38 crore. Quarterly revenue grew 19.24% and profit jumped 280.9% compared to Q2. Operating income increased 92.52% YoY. EPS stood at ₹0.11, up 37.5% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1738130534000,
            "Source": "earnings"
        },
        {
            "Title": "Music Broadcast Reports Decline in Q2 EBITDA",
            "Summary": "Music Broadcast Limited has reported a significant decrease in its Q2 EBITDA, which fell to 30 million rupees from 64 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 5.53% from 12.15% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729784153000,
            "Source": "result"
        },
        {
            "Title": "Music Broadcast Reports Increased Q2 Loss and Revenue",
            "Summary": "Music Broadcast Limited reported a net loss of 20 million rupees in Q2, compared to a loss of 3.6 million rupees year-over-year and 26 million rupees quarter-over-quarter. The company's revenue increased to 548 million rupees from 524 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729784053000,
            "Source": "result"
        }
    ]
}