{
    "Symbol": "RADIANTCMS",
    "ISIN": "INE855R01021",
    "News": [
        {
            "Title": "Radiant Cash Management Revises Q3FY26 Call Date",
            "Summary": "Radiant Cash Management Services corrects earnings conference call date to Thursday, February 12, 2026 at 11:00 AM IST to discuss Q3FY26 results, fixing earlier day error.",
            "Sentiment": "neutral",
            "PublishDate": 1770889290157,
            "Source": "co_actions_results"
        },
        {
            "Title": "Radiant Cash Q3FY26 Results: Revenue Drops 2.7% YoY",
            "Summary": "Radiant Cash Management Services reports Q3FY26 standalone revenue of ₹1,027.33 million, down from ₹1,056.17 million in Q3FY25. Net profit declined to ₹100.45 million from ₹122.47 million YoY.",
            "Sentiment": "negative",
            "PublishDate": 1770815173471,
            "Source": "co_actions_results"
        },
        {
            "Title": "Radiant Cash Management Board Meet on Feb 11, 2026",
            "Summary": "Radiant Cash Management Services Limited has scheduled a board meeting for February 11, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770113086721,
            "Source": "co_actions_results"
        },
        {
            "Title": "Radiant Cash Management Services Expands Into Digital Payments Through MOA Amendment",
            "Summary": "Radiant Cash Management Services Limited shareholders approved amendments to the company's Memorandum of Association through a Special Resolution on December 08, 2025, adding new business objects related to payment aggregator and payment gateway services. The amendments enable the company to expand beyond physical cash logistics into digital payments ecosystem, creating a phygital platform that integrates cash management and digital payment processing, subject to regulatory approvals from RBI and other authorities.",
            "Sentiment": "positive",
            "PublishDate": 1765285252715,
            "Source": "corporate_action"
        },
        {
            "Title": "Radiant Cash Management Reports Flat Revenue Growth and Margin Decline in Q2 FY26",
            "Summary": "Radiant Cash Management Services reported standalone revenues of INR 1.02 billion for the quarter, remaining nearly flat compared to the same period last year. EBITDA margins declined to 14.9%, primarily due to losses in the Valuable Logistics segment and increased fixed costs. Cash volume handled during the quarter was INR 0.41 trillion, flat over the previous year. The company's fintech subsidiary Acemoney recovered from previous quarter disruptions, generating revenues of INR 49 million compared to INR 17 million in the prior quarter. Consolidated revenues reached INR 1.07 billion with EBITDA margins at 13.1%, an improvement of 150 basis points sequentially. The company added 10 new clients and 120 new end customers but lost 2,364 points due to railway business reduction and loss of an e-commerce logistics client. Direct business now constitutes 15.7% of standalone revenues. Management expects significant margin improvement in remaining quarters and aims to achieve breakeven in the Valuable Logistics segment during the current financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1763029092388,
            "Source": "earnings"
        },
        {
            "Title": "Radiant Cash Management Services Seeks Shareholder Approval to Expand into Digital Payment Services",
            "Summary": "Radiant Cash Management Services Limited has issued a postal ballot notice seeking shareholder approval to alter its Memorandum of Association to include payment aggregator and payment gateway business activities. The company proposes to add three new object clauses that would enable it to provide online and offline payment systems, facilitate business payments and settlements, and establish integrated platforms for web and mobile payment technologies. The remote e-voting period runs from November 9, 2025, to December 8, 2025, with results to be announced by December 10, 2025. The company aims to integrate digital payment solutions with its existing physical cash logistics infrastructure to create a comprehensive platform for customers. The proposal requires approval through a special resolution via postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1762540918808,
            "Source": "corporate_action"
        },
        {
            "Title": "Radiant Cash Management Services Reports Mixed Quarterly Results and Approves Payment Aggregator Business Entry",
            "Summary": "Radiant Cash Management Services Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company reported standalone revenue of Rs 1,039.87 million for the quarter compared to Rs 1,004.20 million in the previous quarter, with profit after tax of Rs 96.49 million versus Rs 73.41 million. For the six-month period, standalone revenue reached Rs 2,044.07 million with profit after tax of Rs 169.90 million. The Board also approved entering the Payment Aggregator Business, subject to obtaining necessary approvals and licenses from the Reserve Bank of India and other regulatory authorities. The company plans to invest approximately Rs 30 million in this new venture to enhance digital service offerings and expand its phygital payments ecosystem. Additionally, the Board approved amendments to the Memorandum of Association to include payment aggregator and digital payment solutions in its main object clauses, subject to shareholder approval through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1762485553731,
            "Source": "earnings"
        },
        {
            "Title": "Radiant Cash Management Services Reports 4.6% Sequential Revenue Growth in Q2 FY26",
            "Summary": "Radiant Cash Management Services Limited announced its quarterly results with revenue growth of 4.6% sequentially, reaching ₹1,047 million compared to ₹1,001 million in the previous quarter. The company reported EBITDA margins improved by 150 basis points quarter-on-quarter due to cost control measures and narrowing losses in Acemoney. Profit After Tax declined 32.9% sequentially to ₹87 million from ₹130 million in Q2 FY25. The company operates across 28 states and 8 union territories with 75,618 touchpoints covering 14,510 pin codes. Total cash movement for the quarter stood at ₹413 billion. The company added 10 new clients and 120 new end customers in the current financial year. Revenue contribution from tier 2 and 3 cities remained strong at 83.9%.",
            "Sentiment": "neutral",
            "PublishDate": 1762485032966,
            "Source": "earnings"
        },
        {
            "Title": "Radiant Cash Plans Margin Recovery and Expansion Across 14,500+ Pin Codes",
            "Summary": "Radiant Cash aims for steady margin recovery while expanding its footprint across more than 14,500 pin codes and 75,000 touch points. The company focuses on Tier 2 and 3+ cities, which contribute over 80% of its revenue. The company is leveraging technology-led API integration, automation, and strong risk management to improve operational efficiency. Radiant Cash plans to add new clients and value-added services in cash logistics to drive sustainable growth and improve profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762444453998,
            "Source": "stock"
        },
        {
            "Title": "Radiant Cash Reports Decline in Q2 Profitability Despite Stable Revenue",
            "Summary": "Radiant Cash reported quarterly net profit of 96.8 million rupees, down from 122.7 million rupees in the same period last year. Revenue remained flat at 1 billion rupees compared to the previous year. EBITDA decreased to 133 million rupees from 176 million rupees year-over-year. The company's EBITDA margin compressed to 13.31% from 17.2% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762435842752,
            "Source": "earnings"
        },
        {
            "Title": "Radiant Cash Management Issues ₹100 Million Corporate Guarantee for Subsidiary's Bank Credit Facilities",
            "Summary": "Radiant Cash Management Services Limited has issued a corporate guarantee worth ₹100 million on behalf of its subsidiary Aceware Fintech Services Private Limited to secure credit facilities from IDFC FIRST BANK LIMITED. The guarantee was issued on September 24, 2025. Promoters and promoter group have interest in the transaction through their equity shareholding and nominee directorships in the subsidiary. The guarantee will be disclosed as a contingent liability in the company's standalone financial statements, while the subsidiary's actual borrowings will be recorded in the consolidated financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1758720178054,
            "Source": "corporate_action"
        },
        {
            "Title": "Radiant Cash Management Services Triples Inter-Corporate Loan Limit to Aceware Fintech to INR 15 Crores",
            "Summary": "Radiant Cash Management Services Limited has executed an addendum agreement with Aceware Fintech Services Private Limited to increase the inter-corporate loan limit from INR 5 crores to INR 15 crores. The original loan agreement was signed on August 19, 2025, and the addendum was executed on September 16, 2025. The loan is unsecured and repayable on demand. Radiant Cash Management holds a 58.21% shareholding in Aceware Fintech. The total outstanding loan amount as of the disclosure date is INR 5 crores. The transaction is conducted on an arm's length basis and qualifies as a related party transaction. The enhanced loan facility provides Aceware Fintech with additional financial capacity while maintaining all other terms and conditions of the original agreement.",
            "Sentiment": "positive",
            "PublishDate": 1758032900854,
            "Source": "order&deals"
        },
        {
            "Title": "Radiant Cash Management Services Provides INR 5 Crore Inter-Corporate Loan to Aceware Fintech",
            "Summary": "Radiant Cash Management Services Limited has entered into a loan agreement with Aceware Fintech Services Private Limited, providing an inter-corporate loan of up to INR 5 crores. The loan carries a flexible interest rate based on the company's highest borrowing rate plus 0.10% per annum, with a minimum rate not lower than the prevailing government security yield. The unsecured loan has a tenure of one year from first disbursement and is repayable on demand. Radiant holds a 58.21% shareholding in Aceware. The transaction is classified as a related party transaction conducted at arm's length basis. Aceware will use the loan amount for its lawful principal business activities, with the flexibility to make partial repayments during the tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1755613277710,
            "Source": "order&deals"
        },
        {
            "Title": "Radiant Cash Management Services Reports 10.6% Revenue Growth to ₹4,335 Million in FY25",
            "Summary": "Radiant Cash Management Services Limited reported consolidated revenue of ₹4,335 million for FY 2024-25, marking a 10.6% year-on-year growth. The company's consolidated EBITDA stood at ₹772 million with margins improving to 17.8%, while profit after tax reached ₹471 million. The company expanded its network to 77,982 touchpoints across 14,095 pin codes, adding 8,048 new retail touchpoints during the year. Subsidiary Aceware Fintech Services turned profitable with revenues of ₹241 million. The Board recommended a final dividend of ₹2.50 per share for FY25. The company operates across 28 states and 8 union territories, with 62% of revenues coming from Tier 3+ markets.",
            "Sentiment": "positive",
            "PublishDate": 1755521927111,
            "Source": "corporate_action"
        },
        {
            "Title": "Radiant Cash Management Reports Q1 FY26 Results with Strategic Initiative Updates",
            "Summary": "Radiant Cash Management Services Limited announced its Q1 FY26 financial results. The company serviced 247 clients compared to 166 in the same quarter last year, handling total cash of INR 422.4 billion versus INR 407.3 billion previously. Direct client sales now account for 14.3% of standalone revenues, up from 9.0% in the prior year period. The company provided updates on five strategic initiatives: Acemoney subsidiary completed equipment vendor transition and expects to roll out 70,000+ POS machines this financial year, with transaction volumes reaching Rs. 410 crores for the quarter representing 94% sequential growth. Radiant Valuables Logistics division has not yet achieved breakeven but inducted senior professionals for turnaround efforts. Radiant Insta Credit launched marketing campaigns including radio advertisements. Cash Van Operations and Direct Clients showed healthy growth. Network Cash Management performed well with 62%+ revenue share from Tier 3+ locations. Gross cash losses were Rs. 16.4 million, representing less than 0.004% of total cash handled.",
            "Sentiment": "positive",
            "PublishDate": 1755023535407,
            "Source": "earnings"
        },
        {
            "Title": "Radiant Cash Management Services Reports Q1 Results and Appoints New Secretarial Auditors",
            "Summary": "Radiant Cash Management Services Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 984.11 million, total income of Rs 1,006.39 million, and profit after tax of Rs 95.42 million, with earnings per share of Rs 0.89. On a consolidated basis, revenue from operations was Rs 1,000.84 million, total income Rs 1,022.54 million, and profit after tax Rs 57.66 million, with earnings per share of Rs 0.69. The Board also appointed M/s Sandeep and Associates as Secretarial Auditors for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The firm, established in 2006 and led by Mr. S. Sandeep with over two decades of experience, will hold office from the conclusion of the 20th Annual General Meeting till the 25th AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1754397106284,
            "Source": "earnings"
        },
        {
            "Title": "Radiant Cash Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Radiant Cash has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 990.6 million rupees from 973 million rupees year-over-year. Q4 EBITDA rose to 146.4 million rupees from 140 million rupees, with the EBITDA margin improving to 14.77% from 14.43%. Net profit for Q4 grew to 100.4 million rupees, up from 90 million rupees year-over-year and 122.5 million rupees quarter-over-quarter. The company has recommended a final dividend of 2.50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748015704000,
            "Source": "result"
        },
        {
            "Title": "Radiant Cash Management Services Reports Q3 EBITDA Growth",
            "Summary": "Radiant Cash Management Services has reported a significant increase in its Q3 EBITDA, rising to 217 million rupees from 171 million rupees year-over-year. The company's EBITDA margin also improved, reaching 18.72% compared to 17% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739449938000,
            "Source": "earnings"
        },
        {
            "Title": "Radiant Cash Management Services Reports Q3 Financial Results",
            "Summary": "Radiant Cash Management Services has announced its Q3 financial results. The company's consolidated net profit increased to 134 million rupees, up from 118 million rupees in the same quarter last year. Revenue also saw growth, reaching 1.16 billion rupees compared to 1 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739449916000,
            "Source": "earnings"
        },
        {
            "Title": "Radiant Cash Management Services Reports Q2 EBITDA Growth",
            "Summary": "Radiant Cash Management Services has reported a significant increase in its Q2 EBITDA, rising to 176 million rupees from 132 million rupees year-over-year. The company's EBITDA margin also improved, reaching 17.19% compared to 13.47% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731485946000,
            "Source": "result"
        },
        {
            "Title": "Radiant Cash Reports Q2 Revenue Growth",
            "Summary": "Radiant Cash has announced its Q2 revenue of 1 billion rupees, showing an increase from 934 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731485880000,
            "Source": "result"
        },
        {
            "Title": "Radiant Cash Management Services Reports Q2 Profit Growth",
            "Summary": "Radiant Cash Management Services has reported a net profit of 122 million rupees for the second quarter, up from 102 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731485856000,
            "Source": "result"
        }
    ]
}