{
    "Symbol": "RADICO",
    "ISIN": "INE944F01028",
    "News": [
        {
            "Title": "Radico Khaitan Hosts Jim Murray for Rampur 1943 Virasat",
            "Summary": "Radico Khaitan hosted renowned whisky expert Jim Murray for an exclusive tasting of Rampur 1943 Virasat in New Delhi, celebrating a decade of Rampur Indian Single Malt's global recognition.",
            "Sentiment": "positive",
            "PublishDate": 1770896662912,
            "Source": "stocks"
        },
        {
            "Title": "Radico Khaitan Sees ₹99.15 Cr NSE Block Trade",
            "Summary": "Radico Khaitan witnessed a significant block trade on NSE worth ₹99.15 crores involving 359,590 shares at ₹2,757.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770100716198,
            "Source": "co_actions_results"
        },
        {
            "Title": "Radico Khaitan outshines United Spirits in Q3 FY26",
            "Summary": "Radico Khaitan delivered record quarterly volumes of 9.75 million cases with 19.5% revenue growth, while United Spirits faced volume decline amid Maharashtra policy challenges.",
            "Sentiment": "positive",
            "PublishDate": 1769139991516,
            "Source": "stocks"
        },
        {
            "Title": "Radico Khaitan Q3 Net Profit Surges 62% to ₹155 Crores",
            "Summary": "Radico Khaitan reported consolidated net profit of ₹155 crores in Q3, marking a significant 62.3% year-on-year growth from ₹95.5 crores in the corresponding quarter of previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769071226587,
            "Source": "co_actions_results"
        },
        {
            "Title": "Radico Khaitan's Rampur Whiskies Win Gold in New York",
            "Summary": "Two whiskies from Radico Khaitan's Rampur range secured gold medals at The Fifty Best World Whisky Tasting 2025 in New York through blind tasting evaluation by international jury.",
            "Sentiment": "positive",
            "PublishDate": 1768894226589,
            "Source": "stocks"
        },
        {
            "Title": "Radico Khaitan Q3FY26 earnings call on Jan 23",
            "Summary": "Radico Khaitan Limited has scheduled its Q3 FY2026 earnings conference call for January 23, 2026, at 4:00 PM IST to discuss quarterly results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768544457161,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rampur Whisky Ranks 4th in Global Trending List",
            "Summary": "Radico Khaitan's Rampur Indian Single Malt Whisky secures fourth position among world's top trending whiskies for 2026 according to Drinks International Report, marking significant milestone for Indian spirits.",
            "Sentiment": "positive",
            "PublishDate": 1768223634820,
            "Source": "stocks"
        },
        {
            "Title": "Radico Khaitan's Rampur Whiskey Ranks #4 Globally",
            "Summary": "Radico Khaitan's premium Rampur whiskey brand has secured the fourth position among the world's trending whiskies according to the Drinks International Report 2026, marking a significant achievement for the Indian spirits company.",
            "Sentiment": "positive",
            "PublishDate": 1768219471814,
            "Source": "stocks"
        },
        {
            "Title": "Rampur Whisky Ranks #4 in Global Trending List 2026",
            "Summary": "Radico Khaitan's Rampur Indian Single Malt Whisky achieves #4 position among Top Trending World Whiskies 2026 in Drinks International Report, marking significant global recognition for Indian single malts.",
            "Sentiment": "positive",
            "PublishDate": 1768213162717,
            "Source": "stocks"
        },
        {
            "Title": "Radico Khaitan Board Meet Set for Jan 22 for Q3FY26",
            "Summary": "Radico Khaitan Limited has scheduled a board meeting on January 22, 2026, to consider Q3FY26 financial results. Trading window remains closed until January 24, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768199983363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Radico Khaitan Sets Q3 Results Review Date",
            "Summary": "Radico Khaitan has announced it will review its third quarter financial results on January 22, marking an important milestone for investors and stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1768199685330,
            "Source": "co_actions_results"
        },
        {
            "Title": "Radico Khaitan Stock Weakens After Channel Breakdown",
            "Summary": "Radico Khaitan shares decline 7.89% over past month following bearish rectangular channel breakdown below ₹3,060 support level. Technical indicators confirm downward momentum with RSI at 35.8.",
            "Sentiment": "negative",
            "PublishDate": 1768185745432,
            "Source": "stocks"
        },
        {
            "Title": "Radico Khaitan Launches Kohinoor Reserve Dark Rum",
            "Summary": "Radico Khaitan introduces The Kohinoor Reserve Indian Dark Rum in India after successful global launch. Triple-aged premium rum priced at ₹4,350 debuts in UP, expanding to Karnataka and Delhi.",
            "Sentiment": "positive",
            "PublishDate": 1766478200400,
            "Source": "stocks"
        },
        {
            "Title": "Radico Khaitan Allots 15,943 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Radico Khaitan's Nomination, Remuneration and Compensation Committee approved allotment of 15,943 equity shares of Rs. 2 each to eligible employees under ESOP 2006 at exercise prices of Rs. 928.05 and Rs. 926.05 per share. The company's paid-up equity share capital increased to 13,38,93,489 equity shares aggregating to Rs. 26,77,86,978 following this allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1764238612106,
            "Source": "corporate_action"
        },
        {
            "Title": "Radico Khaitan Launches Rampur 1943 Virasat Single Malt",
            "Summary": "Radico Khaitan has launched a new single malt whisky called Rampur 1943 Virasat as part of celebrating its heritage. The product launch represents the company's expansion in the premium whisky segment.",
            "Sentiment": "positive",
            "PublishDate": 1763953826396,
            "Source": "stock"
        },
        {
            "Title": "D'YAVOL Vortex Wins Best New Scotch Whisky at San Francisco Spirits Competition",
            "Summary": "D'YAVOL Vortex received the Best New Scotch Whisky of the Year award and Double Gold at the 2025 San Francisco Spirits Competition. D'YAVOL Spirits is a joint venture between Shah Rukh Khan, Aryan Khan's D'YAVOL Luxury Collective, Radico Khaitan and Nikhil Kamath, focused on developing premium spirits for global markets. Vortex is a blended Scotch combining single malt and single grain whiskies from Scotland's Lowlands, Highlands, Speyside and Islay regions. The product has won multiple international awards including Blended Scotch of the Year at London Spirits Competition 2025 and gold medals at Scotch Whisky Masters 2025, New York World Spirits Competition 2024, and International Wine & Spirits Awards 2024. The D'YAVOL range includes a single estate vodka and blended malt Scotch, sold in India, UAE and UK with expansion plans. Radico Khaitan shares closed at ₹3,272.50, up ₹12.90 or 0.40%.",
            "Sentiment": "positive",
            "PublishDate": 1762864995736,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Launches 1965 Spirit Of Victory Espresso Coffee Rum in Uttar Pradesh",
            "Summary": "Radico Khaitan has introduced a new product called 1965 Spirit Of Victory Espresso Coffee Rum. The company launched the product in Uttar Pradesh and plans to expand to Jharkhand and Haryana. The 750 ML bottle is priced at ₹950.",
            "Sentiment": "positive",
            "PublishDate": 1762493975354,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Reports 38% Volume Growth in Q2 FY26, Driven by Premium Brands and Andhra Pradesh Expansion",
            "Summary": "Radico Khaitan delivered strong quarterly results with total IMFL volume of 9.34 million cases, reflecting 38% year-on-year growth. The Prestige & Above category recorded 22% volume growth and 24% value growth. Magic Moments Vodka maintained 20% volume growth, achieving sales of around 2 million cases during the quarter. After Dark Whisky recorded 115% growth year-on-year in the first half, crossing 1.5 million cases. Royal Ranthambore Whisky delivered 67% growth in Q2. The company's market share in Andhra Pradesh increased from around 10% in the first half of last year to over 30% in Q2 FY26, making it the leading player in the state. EBITDA margin expanded by 126 basis points year-on-year to 15.8%. Net debt reduced by Rs. 146 crores since March 2025. The company launched 6 new brands in Q2 including Morpheus Whisky and Spirit of Kashmyr variants. Management guided for 150 basis point increase in EBITDA margin for the current fiscal and expects to achieve Rs. 500 crores in luxury and semi-luxury portfolio revenue.",
            "Sentiment": "positive",
            "PublishDate": 1762411842959,
            "Source": "earnings"
        },
        {
            "Title": "Radico Khaitan Shares Fall Despite Record Quarterly Performance",
            "Summary": "Radico Khaitan shares declined 0.58% to ₹3,145.60 despite reporting record quarterly volumes and EBITDA. The spirits manufacturer posted 33.8% growth in net sales to ₹1,494 crore, with total IMFL volumes rising 37.8% to 9.34 million cases. EBITDA increased 45.4% to ₹236.1 crore with margins expanding to 15.8% from 14.5%. Net income surged 68.9% to ₹137.8 crore. Prestige and Above brands grew 21.7% in volume to 3.89 million cases but their contribution to overall volumes dropped to 43.6% from 53.2%. Chairman Lalit Khaitan attributed performance to stable raw material costs and operating leverage while noting export challenges from global trade conditions. The stock traded between ₹3,132.20 and ₹3,187 with significant trading volume of ₹73.34 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1761812528614,
            "Source": "earnings"
        },
        {
            "Title": "Radico Khaitan Reports Rs 146 Crore Net Debt Reduction",
            "Summary": "Radico Khaitan has reported a net debt reduction of Rs 146 crore since March 31, 2025. This represents a decrease in the company's overall debt position.",
            "Sentiment": "positive",
            "PublishDate": 1761729174246,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Reports Strong Q2 Growth with 29.6% Revenue Jump to 50.6B Rupees",
            "Summary": "Radico Khaitan delivered robust quarterly results with revenue rising to 50.6 billion rupees from 39.07 billion rupees year-over-year. The company's EBITDA increased to 2.38 billion rupees compared to 1.63 billion rupees in the same period last year, while EBITDA margin improved to 4.70% from 4.18%. Consolidated net profit grew significantly to 1.4 billion rupees versus 806 million rupees year-over-year. Additionally, the board approved a merger plan with fully owned subsidiaries aimed at improving legal structure and reducing costs.",
            "Sentiment": "positive",
            "PublishDate": 1761728735416,
            "Source": "earnings"
        },
        {
            "Title": "Radico Khaitan Receives ESG Rating Score of 64 from CFC Finlease",
            "Summary": "Radico Khaitan Limited received an ESG rating score of 64 from CFC Finlease Private Limited, a SEBI registered ESG Rating Provider. The rating was assigned independently by CFC Finlease based on the company's public disclosures, without any engagement from Radico Khaitan. The company received this intimation on October 25, 2025 at 2:03 pm IST and has disclosed this information to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761467695618,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Expands Super-Premium Morpheus Whisky to Four New States",
            "Summary": "Radico Khaitan is launching its super-premium Morpheus Whisky in Karnataka, Goa, West Bengal and Haryana following strong performance in initial markets of Uttar Pradesh, Rajasthan and Delhi, where it achieved over 90% distribution in A and B category outlets. The company aims to establish presence in more than 12 states by the end of FY 2026. The 750 ml bottle will be priced at ₹1,830 in Karnataka, ₹900 in Haryana and Goa, and ₹1,400 in West Bengal. Morpheus, launched as the company's first entry into the super-premium whisky segment, has exceeded expectations in its debut market of Uttar Pradesh. The whisky is crafted with imported Scotch malts and Indian grain spirits, aged in bourbon barrels, and available in five sizes. Radico Khaitan shares closed at ₹3,116, up ₹118.10 or 3.94%.",
            "Sentiment": "positive",
            "PublishDate": 1760718559239,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan in Trademark Dispute with Piccadily Agro Industries Over 'Kashmyr' Brand",
            "Summary": "Radico Khaitan Limited is engaged in a legal dispute with Piccadily Agro Industries concerning trademark issues. The High Court has temporarily paused a lower court's injunction related to the 'Kashmyr' trademark until the next hearing takes place.",
            "Sentiment": "neutral",
            "PublishDate": 1760002147114,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Launches Jamun SpicyMint Flavor in Magic Moments Range",
            "Summary": "Radico Khaitan has introduced a new Jamun SpicyMint flavor in its Magic Moments product range. The company is initially launching the product in Uttar Pradesh with plans for broader expansion. The new flavor targets young consumers with its unique flavor combination.",
            "Sentiment": "positive",
            "PublishDate": 1759135503005,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Launches Final Two Editions of Rampur Jugalbandi Series at TFWA Cannes 2025",
            "Summary": "Radico Khaitan launched the final two editions of its Rampur Jugalbandi Series at TFWA Cannes 2025. This represents the completion of the company's Rampur Jugalbandi product line at the international trade show.",
            "Sentiment": "positive",
            "PublishDate": 1759120407987,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Shares Rise Despite Court Injunction on KASHMYR Vodka Brand",
            "Summary": "Radico Khaitan shares traded 0.91% higher at ₹2,996.40 despite facing a court injunction restraining use of its KASHMYR vodka brand. The District Court of Karnal granted an interim injunction to Piccadily Agro Industries on September 23, finding KASHMYR deceptively similar to Piccadily's registered trademarks CASHMIR and CASHMERE. The injunction covers manufacturing, selling, advertising or using the KASHMYR mark until final adjudication in July 2025. Piccadily shares gained 0.72% to ₹719.50. The trademark dispute involves luxury vodka products, with Piccadily launching CASHMIR vodka in May 2025 and Radico launching KASHMYR in July 2025 at similar price points. Jefferies maintained its Buy rating on Radico Khaitan with a ₹3,590 target price, citing strong growth momentum. Radico Khaitan's market cap stands at ₹40,120 crore while Piccadily is valued at ₹6,836 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1758776249469,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Shares Decline Despite Rampur Whisky's Global Recognition",
            "Summary": "Radico Khaitan shares traded 0.19% lower at ₹2,847.20 despite the company's Rampur Indian Single Malt whisky being included in the World's 50 Most Admired Whiskies list by Drinks International Magazine. The stock opened at ₹2,852.50 and reached a high of ₹2,876.40 before declining. This marks Rampur's first appearance in the globally respected ranking, which evaluates quality, consistency, price-to-quality ratio, and branding strength based on insights from global experts and trade professionals across 100 bars worldwide. Managing Director Abhishek Khaitan credited the recognition to the company's global strategy focused on authenticity and premiumisation. Radico Khaitan, established in 1943, operates as one of India's largest IMFL manufacturers with distilleries in Rampur, Sitapur, and Aurangabad, exporting to over 100 countries. Trading volume was 0.49 lakh shares worth ₹13.85 crores, with the stock's 52-week high at ₹2,940.",
            "Sentiment": "neutral",
            "PublishDate": 1756712287416,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan's Rampur Indian Single Malt Recognized Among World's 50 Most Admired Whiskies",
            "Summary": "Radico Khaitan's Rampur Indian Single Malt has been included in the World's 50 Most Admired Whiskies list. This recognition highlights the quality and global appeal of the company's premium whisky brand in the international spirits market.",
            "Sentiment": "positive",
            "PublishDate": 1756473449047,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan's The Spirit of Kashmyr Wins National Award Within First Month of Launch",
            "Summary": "Radico Khaitan's new product, The Spirit of Kashmyr, received national recognition within a month of its launch. The Spirit of Kashmyr is described as India's first homegrown vodka in the luxury segment. The product won the 'Best Vodka' title at the 7th ICONIC Awards, presented by Amitabh Kant, former CEO of NITI Aayog and G20 Sherpa. The ICONIC Awards are organized by TV9 Network and celebrate pioneers in luxury, travel & tourism, and allied industries. Amar Sinha, Chief Operating Officer at Radico Khaitan, stated that winning this award marks a significant step in the beverage market and strengthens their resolution to bring world-class offerings from India to the world. The product is inspired by Kashmir and infused with elements like Pampore saffron.",
            "Sentiment": "positive",
            "PublishDate": 1756202924233,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Acquires 47.5% Stake in D'Yavol Spirits for Up to 400 Million Rupees",
            "Summary": "Radico Khaitan will purchase a 47.5% equity stake in D'Yavol Spirits through an investment of up to 400 million rupees. This acquisition gives Radico Khaitan significant ownership in D'Yavol Spirits while maintaining it as a non-wholly owned subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1755009845095,
            "Source": "order&deals"
        },
        {
            "Title": "Radico Khaitan Reports Record Quarterly Performance with 38% Volume Growth and Margin Expansion",
            "Summary": "Radico Khaitan delivered its highest-ever quarterly volumes, net sales and profitability in Q1 FY26. IMFL volumes grew 37.5% year-on-year to 9.72 million cases, driven by strong demand for premium brands. The prestige and above category volumes increased 41%, while value terms grew 43%. EBITDA margin expanded from 13.0% to 15.3% despite higher marketing spend. The company launched Morpheus Super Premium Whisky and The Spirit of Kashmyr luxury vodka to strengthen its premium portfolio. Royal Ranthambore achieved 90% growth, while Magic Moments vodka posted 20% volume growth. Net debt reduced by Rs. 164 crores since March 2025. The company gained market share in Andhra Pradesh from 10% to 28%, becoming the highest in the industry. Management expects 20% plus overall volume growth in FY26 and raised margin expansion guidance to 125-150 basis points annually for the next three years. The UK-India FTA reduced duty on bulk scotch from 150% to 75%, providing significant cost advantages for scotch requirements valued over Rs. 250 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754542997401,
            "Source": "earnings"
        },
        {
            "Title": "Radico Khaitan Targets Over 20% Volume Growth and Near Debt-Free Status",
            "Summary": "Radico Khaitan management expects volume growth of over 20% for FY26. The company plans to achieve nearly debt-free status by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1754123244618,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Reports Net Debt Reduction of Rs 163.7 Crore",
            "Summary": "Radico Khaitan has reported a net debt reduction of Rs 163.7 crore since March 31, 2025. This represents a decrease in the company's overall debt burden.",
            "Sentiment": "positive",
            "PublishDate": 1753952874291,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Reports Strong Q1 Growth with Revenue Up 23% to 53B Rupees",
            "Summary": "Radico Khaitan delivered robust quarterly results with revenue rising to 53 billion rupees from 43 billion rupees in the same period last year. The company's EBITDA increased significantly to 2.32 billion rupees compared to 1.5 billion rupees year-over-year, while EBITDA margin improved to 4.37% from 3.45%. Consolidated net profit nearly doubled to 1.3 billion rupees from 754 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753952412730,
            "Source": "earnings"
        },
        {
            "Title": "Radico Khaitan Launches Luxury Vodka Brand 'The Spirit of Kashmyr'",
            "Summary": "Radico Khaitan Limited launched 'The Spirit of Kashmyr', marking its entry into the luxury vodka segment. The product features two variants - Indian Natural Vodka and Indian Saffron Vodka, crafted with Pampore saffron, Himalayan spring water, and Himalayan grains. The rollout begins in Uttar Pradesh, followed by Goa and Maharashtra. The saffron variant is priced at Rs. 3,000 and the natural variant at Rs. 2,500 in Uttar Pradesh, with smaller 180ml packs available at Rs. 740 and Rs. 620 respectively. The company positions this as India's first homegrown luxury vodka brand, targeting the premium segment dominated by imported brands. Radico Khaitan holds over 60% market share in the vodka segment and operates with 321 million liters capacity across 44 bottling units. The launch strengthens the company's premiumisation strategy and builds on its luxury portfolio that includes brands like Rampur Indian Single Malt and Jaisalmer Indian Craft Gin.",
            "Sentiment": "positive",
            "PublishDate": 1753676399272,
            "Source": "stock"
        },
        {
            "Title": "Radico Khaitan Schedules Q1 FY2026 Earnings Conference Call for August 1, 2025",
            "Summary": "Radico Khaitan Limited has scheduled an earnings conference call with analysts and investors for August 1, 2025 at 4:00 PM IST to discuss Q1 FY2026 financial results. The company will provide universal access numbers for participation and has noted that no unpublished price sensitive information will be discussed during the meeting. The presentation for the conference call will be sent to stock exchanges and made available on the company website on July 31, 2025 after the results announcement. The schedule is subject to changes due to any exigencies from investors or the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753365873654,
            "Source": "earnings"
        },
        {
            "Title": "Radico Khaitan: Rampur Jugalbandi #6 Wins Best World Single Malt at John Barleycorn Awards",
            "Summary": "Radico Khaitan's Rampur Jugalbandi #6 whisky won Best World Single Malt at the John Barleycorn Awards 2025. Rampur Select secured Double Gold in the Single Malt Whisky category, while Jugalbandi #5 earned Gold in the Indian Single Malt, Tokaji Finish category. The awards highlight the growing global recognition of Indian whiskies.",
            "Sentiment": "positive",
            "PublishDate": 1751537139000,
            "Source": "normal_news"
        },
        {
            "Title": "Radico Khaitan: Premium Spirits Debut at Delhi Duty Free",
            "Summary": "Radico Khaitan introduces select premium spirits at Delhi Duty Free, including Rampur Indian Single Malt Barrel Blush, Jugalbandi Indian Single Malts, Kohinoor Reserve Indian Dark Rum, and the exclusive Rampur Select. This marks the company's entry into Indian travel retail market at Indira Gandhi International Airport.",
            "Sentiment": "positive",
            "PublishDate": 1750854998000,
            "Source": "normal_news"
        },
        {
            "Title": "Radico Khaitan: Launches 'Magic Moments Flavours of India' Vodka Range",
            "Summary": "Radico Khaitan introduced 'Magic Moments Flavours of India', a new flavored vodka range featuring Alphonso Mango and Thandaai variants. Initial rollout in Rajasthan and Uttarakhand, with plans for nationwide expansion. Magic Moments is India's largest vodka brand, crossing 7 million cases in FY2025. The company's flavored vodka portfolio grew 25% CAGR over five years.",
            "Sentiment": "positive",
            "PublishDate": 1750674675000,
            "Source": "normal_news"
        },
        {
            "Title": "Radico Khaitan Launches New Vodka Range in Select States",
            "Summary": "Radico Khaitan has introduced a new vodka range called 'Magic Moments Flavours of India'. The range includes Alphonso Mango and Thandaai flavors. The company plans to launch these products initially in Rajasthan and Uttarakhand, followed by Assam, Madhya Pradesh, and Goa.",
            "Sentiment": "positive",
            "PublishDate": 1750636760000,
            "Source": "default"
        },
        {
            "Title": "Radico Khaitan Launches New Vodka Line 'Magic Moments Flavours Of India'",
            "Summary": "Radico Khaitan has introduced a new vodka line called 'Magic Moments Flavours Of India'. The line features two flavors: Alphonso Mango and Thandai. The company plans to launch the product initially in Rajasthan and Uttarakhand, followed by Assam, Madhya Pradesh, and Goa.",
            "Sentiment": "positive",
            "PublishDate": 1750415705000,
            "Source": "default"
        },
        {
            "Title": "Radico Khaitan: 8 Brands Join Global Millionaires' Club",
            "Summary": "Eight of Radico Khaitan's spirits brands have been listed in Drinks International's Millionaires' Club 2025, ranking the company third globally in terms of millionaire brands. This makes Radico Khaitan the only Indian firm among the global top 5 in this category.",
            "Sentiment": "positive",
            "PublishDate": 1749655405000,
            "Source": "normal_news"
        },
        {
            "Title": "Radico Khaitan: Withdraws 'Trikal' Brand Name for Single Malt Whisky",
            "Summary": "Radico Khaitan has withdrawn the brand name 'Trikal' for its new single malt whisky range following criticism. The company stated this decision is a gesture of respect and commitment to honor public sentiment. The withdrawal came after facing challenges in Uttarakhand and backlash on social media due to the product label's resemblance to religious iconography.",
            "Sentiment": "neutral",
            "PublishDate": 1748508391000,
            "Source": "corporate_action"
        },
        {
            "Title": "Radico Khaitan: Withdraws 'Trikāl' Brand Name for New Single-Malt Whiskey",
            "Summary": "Radico Khaitan has decided to withdraw the 'Trikāl' brand name for its new range of single-malt whiskey following criticism from religious groups. The company stated this decision is a gesture of respect and commitment to honor public sentiments.",
            "Sentiment": "neutral",
            "PublishDate": 1748437988000,
            "Source": "corporate_action"
        },
        {
            "Title": "Radico Khaitan Withdraws 'Trikāl' Brand Following Concerns",
            "Summary": "Radico Khaitan has issued a clarification statement regarding their brand 'Trikāl'. The company acknowledged that concerns have been raised about the brand name. After conducting an internal review, Radico Khaitan has decided to withdraw the 'Trikāl' brand. The company states this decision was made as part of being a responsible and sensitive organization.",
            "Sentiment": "neutral",
            "PublishDate": 1748435473000,
            "Source": "default"
        },
        {
            "Title": "Radico Khaitan: Launches Two New Premium Whiskies to Strengthen Portfolio",
            "Summary": "Radico Khaitan introduces Morpheus Super Premium Whisky (₹1200-₹1500) and TRIKĀL Indian Single Malt (₹3,500-₹4,500) to expand its luxury whisky segment. Morpheus targets aspirational consumers, while TRIKĀL aims for the growing Indian single malt market. Initial distribution in Uttar Pradesh, Haryana, and Maharashtra, with plans for wider domestic and international expansion.",
            "Sentiment": "positive",
            "PublishDate": 1748157258000,
            "Source": "corporate_action"
        },
        {
            "Title": "Radico Khaitan Launches Two New Premium Whiskies",
            "Summary": "Radico Khaitan has announced the launch of two new premium whisky products: Trikāl Indian Single Malt and Morpheus Super Premium Whisky. This expansion of their product line represents a move into the high-end whisky market.",
            "Sentiment": "positive",
            "PublishDate": 1748073737000,
            "Source": "default"
        },
        {
            "Title": "Radico Khaitan: Launches Two New Premium Whiskies, Expanding Luxury Portfolio",
            "Summary": "Radico Khaitan has introduced two new premium whiskies: TRIKĀL Indian Single Malt and Morpheus Super Premium Whisky. TRIKĀL is inspired by Indian heritage, while Morpheus blends imported Scotch malts with Indian grain spirits. These launches align with the company's earlier announcement to introduce three new luxury products in India's premium market.",
            "Sentiment": "positive",
            "PublishDate": 1748069816000,
            "Source": "corporate_action"
        },
        {
            "Title": "Radico Khaitan Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Radico Khaitan has announced its Q4 consolidated net profit of 921 million rupees, up from 539 million rupees year-over-year and 955 million rupees quarter-over-quarter. The company's Q4 revenue increased to 44.85 billion rupees from 38.95 billion rupees in the previous year. Additionally, Radico Khaitan has declared a dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746576839000,
            "Source": "default"
        }
    ]
}