{
    "Symbol": "RAILTEL",
    "ISIN": "INE0DD101019",
    "News": [
        {
            "Title": "RailTel Wins Rs 16.99 Crore Order from Lucknow Municipal",
            "Summary": "RailTel Corporation secured a Rs 16.99 crore project management consultancy contract from Lucknow Municipal Corporation for a 5-year period, strengthening its municipal services portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1770813122707,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Faces ₹14.73 Lakh Tax Penalty from Bihar",
            "Summary": "RailTel Corporation received a demand notice imposing penalty of ₹14,73,067 from Deputy Commissioner of State Tax, Patliputra Central, Bihar dated January 31, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1770192442687,
            "Source": "stocks"
        },
        {
            "Title": "RailTel Q3FY26 revenue drops to ₹913.45 crores",
            "Summary": "RailTel Corporation reports Q3FY26 revenue of ₹913.45 crores, down from ₹951.36 crores in Q2FY26, with net profit declining to ₹62.40 crores. Nine-month revenue reached ₹2,608.62 crores.",
            "Sentiment": "negative",
            "PublishDate": 1770125299996,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Board Meeting Set for February 2, 2026",
            "Summary": "RailTel Corporation of India has scheduled a board meeting on February 2, 2026, to consider and approve unaudited financial results for Q3 FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769520232796,
            "Source": "co_actions_results"
        },
        {
            "Title": "Railtel, Spice Islands & Gabion bag ₹32 Cr orders",
            "Summary": "Three Indian companies secure new contracts worth over ₹32 crore combined, spanning international exports, digital infrastructure, and construction solutions across diverse sectors.",
            "Sentiment": "positive",
            "PublishDate": 1769508337553,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Wins ₹27.04 Crore SD-WAN Order from APCPDCL",
            "Summary": "RailTel Corporation secures major contract from Andhra Pradesh Central Power Distribution Corporation for SD-WAN devices supply and installation with 5-year warranty, completion by January 2031.",
            "Sentiment": "positive",
            "PublishDate": 1769490457606,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Wins ₹141 Cr Defence Ministry Contract",
            "Summary": "RailTel Corporation of India Limited secures significant ₹141 crore Annual Maintenance Contract from Ministry of Defence, with completion deadline set for January 30, 2031.",
            "Sentiment": "positive",
            "PublishDate": 1769064441752,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Secures ₹12.3 Crore Contract",
            "Summary": "RailTel Corporation of India has been awarded a new contract worth ₹12.30 crores, marking another business win for the telecom services company.",
            "Sentiment": "positive",
            "PublishDate": 1768794767635,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Receives ₹49.24 Lakh GST Penalty Notice",
            "Summary": "RailTel Corporation disclosed receiving a GST demand notice with penalty of ₹49.24 lakhs from CGST authorities. Company states no material financial impact and plans to file appeals.",
            "Sentiment": "negative",
            "PublishDate": 1768486035934,
            "Source": "stocks"
        },
        {
            "Title": "RailTel Secures ₹89 Cr Order, Cancels ₹609.56 Cr Projects",
            "Summary": "RailTel Corporation receives ₹89 crore order from Central Railway for IP-MPLS network equipment while cancelling multiple work orders worth ₹609.56 crores including Bihar smart classroom project.",
            "Sentiment": "neutral",
            "PublishDate": 1768389643886,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Wins ₹15.99 Cr FSSAI Contract",
            "Summary": "RailTel Corporation of India Limited secures a significant ₹15.99 crore contract from the Food Safety and Standards Authority of India, with completion deadline set for January 5, 2029.",
            "Sentiment": "positive",
            "PublishDate": 1768371790731,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel shares drop as Rs 609 cr orders cancelled",
            "Summary": "RailTel Corporation shares declined after cancellation of three Bihar education project orders worth Rs 609.55 crore, including smart classroom installations and teaching materials supply.",
            "Sentiment": "negative",
            "PublishDate": 1768363701981,
            "Source": "stocks"
        },
        {
            "Title": "RailTel loses Bihar education orders worth ₹609.56 cr",
            "Summary": "RailTel Corporation faces setback as Bihar Education Project Council cancels multiple work orders including smart classroom projects and teaching materials supply contracts.",
            "Sentiment": "negative",
            "PublishDate": 1768357981291,
            "Source": "stocks"
        },
        {
            "Title": "RailTel Faces Order Cancellation in Bihar",
            "Summary": "RailTel Corporation's ₹262.14 crore classroom project order in Bihar has been canceled by BEPC, potentially impacting the company's near-term performance.",
            "Sentiment": "negative",
            "PublishDate": 1768355286653,
            "Source": "stocks"
        },
        {
            "Title": "RailTel Loses ₹262 Cr Bihar Smart Classroom Order",
            "Summary": "RailTel Corporation faces setback as Bihar Education Project Council cancels major work order worth ₹262.14 crores for smart classroom procurement and installation project.",
            "Sentiment": "negative",
            "PublishDate": 1768329459275,
            "Source": "stocks"
        },
        {
            "Title": "RailTel Loses ₹257.50 Cr Bihar Education Order",
            "Summary": "RailTel Corporation announces cancellation of major work order worth ₹257.50 crores from Bihar Education Project Council for smart classroom installations due to unavoidable reasons.",
            "Sentiment": "negative",
            "PublishDate": 1768329431595,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel announces senior management changes",
            "Summary": "RailTel Corporation of India announces re-designation of three Principal Executive Directors who will cease to be part of senior management as per SEBI regulations effective January 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768064523527,
            "Source": "stocks"
        },
        {
            "Title": "RailTel wins Ethiopia data centre project deal",
            "Summary": "RailTel Corporation secures contract to build greenfield data centre in Addis Ababa for Ethiopian Ministry of Foreign Affairs, marking major international expansion milestone with MEA support.",
            "Sentiment": "positive",
            "PublishDate": 1767973405854,
            "Source": "stocks"
        },
        {
            "Title": "RailTel Wins ₹100 Crore Contract Deal",
            "Summary": "RailTel Corporation of India Limited has successfully secured a significant contract worth ₹100 crores, marking another milestone in the company's business expansion efforts.",
            "Sentiment": "positive",
            "PublishDate": 1767849334874,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Wins ₹101.82 Crore IT Infrastructure Contract",
            "Summary": "RailTel Corporation secures contract from Public Financial Management System for IT infrastructure DC & DR services, with project completion scheduled by January 2031.",
            "Sentiment": "positive",
            "PublishDate": 1767849312970,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Secures ₹19.84 Cr Ethiopia Data Centre Order",
            "Summary": "RailTel Corporation wins major international contract from Ministry of External Affairs to establish data centre at Ethiopia's Ministry of Foreign Affairs building in Addis Ababa.",
            "Sentiment": "positive",
            "PublishDate": 1766772057950,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel in Talks with Starlink for Satellite Broadband",
            "Summary": "RailTel Corporation is reportedly in discussions with Starlink to offer retail broadband services to its users through satellite internet technology, marking a potential expansion into satellite-based connectivity solutions.",
            "Sentiment": "positive",
            "PublishDate": 1765943022625,
            "Source": "stocks"
        },
        {
            "Title": "RailTel Wins ₹26.88 Cr IT Infrastructure Order",
            "Summary": "RailTel Corporation secured a major contract worth ₹26.88 crores from V.O. Chidambaranar Port Authority for implementing advanced IT infrastructure, with completion deadline set for August 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765891219387,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Secures ₹148.40 Cr AMC Contract from ORGI",
            "Summary": "RailTel Corporation of India Ltd wins comprehensive AMC services contract worth ₹148.40 crores from Office of Registrar General Census Commissioner, India for servers, storage and network security devices.",
            "Sentiment": "positive",
            "PublishDate": 1765865993521,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Wins ₹35.44 Cr Mumbai Disaster Mgmt Contract",
            "Summary": "RailTel Corporation secures 5-year communication solutions contract from Municipal Corporation of Greater Mumbai for disaster management department, valued at ₹35.44 crores with March 2031 completion.",
            "Sentiment": "positive",
            "PublishDate": 1765517514909,
            "Source": "co_actions_results"
        },
        {
            "Title": "RailTel Secures ₹14 Crore Laptop Supply Contract from Ministry of External Affairs",
            "Summary": "RailTel has won a ₹14 crore order to supply laptops to the Ministry of External Affairs. This contract win adds to RailTel's revenue stream and demonstrates the company's expansion into IT hardware supply services for government departments.",
            "Sentiment": "positive",
            "PublishDate": 1765164409205,
            "Source": "order&deals"
        },
        {
            "Title": "RailTel Secures ₹14.4 Crore Contract",
            "Summary": "RailTel has secured a new contract worth ₹14.4 crore. The contract award represents new business for the telecommunications infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1765129690253,
            "Source": "order&deals"
        },
        {
            "Title": "RailTel Secures Major ICT Network Contract from Central Public Works Department",
            "Summary": "RailTel Corporation of India received a work order from Central Public Works Department for design and implementation of ICT network with operations and maintenance support for 5 years, to be executed by May 31. The contract involves domestic operations for ICT network services, with the work order received on December 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1764846294252,
            "Source": "order&deals"
        },
        {
            "Title": "RailTel Secures Rs 48.78 Crore Contract from Mumbai Metropolitan Region Development Authority",
            "Summary": "RailTel Corporation of India received a work order worth Rs 48,77,92,166 (excluding tax) from Mumbai Metropolitan Region Development Authority for designing, developing and implementing a Regional Information System for Mumbai Metropolitan Region and Urban Observatory. The domestic contract is to be executed by December 28, 2027, strengthening RailTel's position in the regional information systems segment.",
            "Sentiment": "positive",
            "PublishDate": 1764768855715,
            "Source": "order&deals"
        },
        {
            "Title": "RailTel Appoints New Chief Vigilance Officer and Faces Stock Exchange Fines",
            "Summary": "RailTel appointed Ms. Sarika Aggarwal Synrem as Chief Vigilance Officer for 3 years effective November 21, 2025, bringing over two decades of experience in defence finance and governance. Both NSE and BSE imposed fines of Rs. 5,42,800 each on the company for non-compliance with board composition requirements for the quarter ended September 30, 2025, which RailTel attributes to government control over director appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1764336201165,
            "Source": "corporate_governance"
        },
        {
            "Title": "RailTel Corporation Secures ₹65.71 Crore Educational Lab Contract from Gujarat",
            "Summary": "RailTel Corporation of India has won a ₹65.71 crore contract from Sarva Shiksha Abhiyan, Gujarat for educational lab design, installation, and maintenance services. The project has a completion deadline of November 8, 2028.",
            "Sentiment": "positive",
            "PublishDate": 1762493072009,
            "Source": "stock"
        },
        {
            "Title": "RailTel Corp Secures 272 Crore Rupees Contract",
            "Summary": "RailTel Corp has secured a contract worth 272 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762433563828,
            "Source": "stock"
        },
        {
            "Title": "RailTel Reports Strong Q2 FY26 Results with 28% Revenue Growth and Rs. 8,251 Crore Order Book",
            "Summary": "RailTel Corporation achieved operating revenue of Rs. 951 crores in Q2 FY26, marking 28% quarter-on-quarter growth from Rs. 744 crores in Q1. The telecom segment contributed Rs. 367 crores while projects segment added Rs. 584 crores. Profit before tax increased 18% to Rs. 105 crores and profit after tax grew 15% to Rs. 76 crores. The company's total order book stands at Rs. 8,251 crores, with new orders worth Rs. 3,317 crores received during the financial year. Major wins include a Rs. 822 crore order from Bihar State Government for school labs. The board declared an interim dividend of Re. 1 per share. Management maintains revenue growth guidance of 25% and EBIT margin guidance of 11-12%. The company is expanding data center operations with facilities in Gurgaon, Mumbai, and a new 10MW center under development in Noida.",
            "Sentiment": "positive",
            "PublishDate": 1762420158643,
            "Source": "earnings"
        },
        {
            "Title": "RailTel Corporation Secures ₹32.43 Crore Aadhaar Services Contract from Rajasthan Education Council",
            "Summary": "RailTel Corporation of India has won a ₹32.43 crore contract from the Rajasthan Council of School Education. The contract involves Aadhaar enrollment and updates services and will run until October 30, 2030.",
            "Sentiment": "positive",
            "PublishDate": 1761990643800,
            "Source": "stock"
        },
        {
            "Title": "RailTel Corporation Secures ₹136 Crore Defence Contract for Telecom Services",
            "Summary": "RailTel Corporation has secured a ₹136 crore contract from a defence customer for telecom point-to-point lease line services. The project is scheduled for completion by January 29, 2027.",
            "Sentiment": "positive",
            "PublishDate": 1761889900378,
            "Source": "order&deals"
        },
        {
            "Title": "RailTel Corp Sets Revenue Mix Target and Growth Projections for FY25-27",
            "Summary": "RailTel Corp has outlined its strategic revenue composition target of 40% from telecom operations and 60% from project work. The company expects project margins of 4-5% while telecom operations will deliver higher margins, targeting an overall margin of 11%. For FY25-26, RailTel projects 25% revenue growth with EBIT margins of 11-12%. The company anticipates maintaining growth momentum of 20-25% for FY27, though it has identified potential supply chain risks that could impact operations.",
            "Sentiment": "positive",
            "PublishDate": 1761880940270,
            "Source": "stock"
        },
        {
            "Title": "RailTel Reports Strong Q2 Growth with Revenue Up 12.8% and Declares Interim Dividend",
            "Summary": "RailTel Corporation of India delivered robust Q2 performance with net profit rising to 760.7 million rupees from 726.4 million rupees year-over-year. Revenue grew significantly to 9.51 billion rupees compared to 8.43 billion rupees in the same period last year. EBITDA increased to 1.54 billion rupees from 1.29 billion rupees, while EBITDA margin improved to 16.24% from 15.33%. The company recommended an interim dividend of 1 rupee per share for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1761746005623,
            "Source": "corporate_action"
        },
        {
            "Title": "RailTel Corporation Schedules Analyst Conference Call for October 30, 2025",
            "Summary": "RailTel Corporation of India Limited has scheduled an analyst and investor conference call for October 30, 2025 at 4:00 PM IST. The call will be organized by Antique Stock Broking Limited. During the call, management will discuss financial results and operations for the quarter and half year ended September 30, 2025. The management team will be represented by Chairman and Managing Director Sanjai Kumar, Director Finance V Rama ManoharaRao, Director Project Operations & Maintenance Manoj Tandon, and Director Network Planning & Marketing YashpalSinghTomar. The company has provided dial-in details for participants from various countries including India and international locations.",
            "Sentiment": "neutral",
            "PublishDate": 1761650362935,
            "Source": "earnings"
        },
        {
            "Title": "Railtel Corporation Loses ₹209 Crore Work Order from Bihar Education Project Council",
            "Summary": "Railtel Corporation of India had its work order worth ₹209 crore cancelled by the Bihar Education Project Council. The cancellation was attributed to unavoidable reasons, though specific details about these reasons were not disclosed.",
            "Sentiment": "negative",
            "PublishDate": 1761523733663,
            "Source": "stock"
        },
        {
            "Title": "RailTel's Rs 2,098 Crore Bihar Education Project Order Cancelled",
            "Summary": "RailTel Corporation of India received a work order worth Rs 2,09,78,63,937 from Bihar Education Project Council for Implementation for Education Quality Enhancement in Bihar under PM SHRI scheme. The company had previously informed about securing this major order on September 13, 2025. However, the customer has now cancelled the work order due to unavoidable reasons. RailTel communicated this development to stock exchanges on October 24, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761309211421,
            "Source": "stock"
        },
        {
            "Title": "RailTel Schedules Board Meeting on October 29, 2025 for Q2 Results and Interim Dividend Consideration",
            "Summary": "RailTel Corporation of India Limited has scheduled a Board of Directors meeting on October 29, 2025 to consider and approve unaudited financial results for the quarter and half-year ended September 30, 2025, and to declare interim dividend for Financial Year 2025-26. The company has fixed November 4, 2025 as the record date for determining eligibility of members entitled to receive the interim dividend. Any declared interim dividend will be paid within 30 days from the date of declaration. The trading window for designated persons and their immediate relatives has been closed from October 1, 2025 until 48 hours after the declaration of the unaudited financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1761204094754,
            "Source": "corporate_action"
        },
        {
            "Title": "RailTel Corporation Re-appoints Rameshwer Meena as Part-time Government Nominee Director",
            "Summary": "The Ministry of Railways has re-appointed Shri Rameshwer Meena as Part-time Government Nominee Director on RailTel Corporation of India Limited's Board, effective October 17, 2025. Meena, who holds Executive Director position at Railway Board, belongs to the 1992 batch of Indian Railway Service of Signal Engineers and has extensive experience in signalling and telecommunication infrastructure projects. He has worked across various railway divisions including Western Railway, North Central Railway, and Rail Vikas Nigam Ltd. The company confirmed that Meena is not related to any existing directors or key management personnel and holds no shares in RailTel Corporation. He has not been debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1760710785139,
            "Source": "corporate_governance"
        },
        {
            "Title": "RailTel Corporation Secures ₹18 Crore Contract from Karnataka CEG for KSWAN 2.0 Support",
            "Summary": "RailTel Corporation of India Ltd received a Letter of Intent worth ₹18.22 crore from Karnataka's Center for E-Governance for back-to-back OEM support of existing KSWAN 2.0 routers and switches. The contract must be executed by November 8, 2025. The company also secured two other contracts: a ₹70.94 crore project from Nashik Municipal Smart City Development Corporation for city network backbone services to be completed by December 31, 2026, and a ₹32.51 crore order from Panvel Municipal Corporation for connectivity services under the Safe City Project, scheduled for completion by March 19, 2031. RailTel shares closed at ₹384.00, declining 1.78% on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1760016773102,
            "Source": "stock"
        },
        {
            "Title": "RailTel Secures ₹182.2 Million Order",
            "Summary": "RailTel has secured a new order worth ₹182.2 million. The company announcement indicates successful business development for the telecommunications infrastructure provider.",
            "Sentiment": "positive",
            "PublishDate": 1760011085348,
            "Source": "order&deals"
        },
        {
            "Title": "Railtel Corp Awards ₹16.31 Crore Contract to RTNS Technology",
            "Summary": "Railtel Corp has awarded a ₹16.31 crore contract to RTNS Technology Private Limited for supply and installation services. The agreement includes provisions for possible time extension.",
            "Sentiment": "neutral",
            "PublishDate": 1759304355664,
            "Source": "order&deals"
        },
        {
            "Title": "Railtel Corp Secures ₹37.5 Crore Order",
            "Summary": "Railtel Corp has secured a new order worth ₹37.5 crore. The company announcement indicates a business win for the telecommunications infrastructure provider.",
            "Sentiment": "positive",
            "PublishDate": 1759149664705,
            "Source": "order&deals"
        },
        {
            "Title": "RailTel Secures Rs 506 Crore Order from Bihar Education Project Council",
            "Summary": "RailTel Corporation of India Ltd. received a Letter of Acceptance from Bihar Education Project Council for an order worth Rs 50,62,23,040. The contract involves establishment and operationalization of VEs in Government Secondary/Senior Secondary Schools under Samagra Shiksha. This is a domestic supply order to be executed by December 31, 2025. The company received the work order on September 28, 2025. The order does not involve any promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1759085155247,
            "Source": "order&deals"
        },
        {
            "Title": "RailTel Secures ₹970 Crore Contract for Bihar School Labs Setup",
            "Summary": "RailTel Corporation Of India has won a ₹970.08 crore contract for setting up laboratories in Bihar government schools. The project is scheduled for completion by September 2026.",
            "Sentiment": "positive",
            "PublishDate": 1758861130121,
            "Source": "stock"
        },
        {
            "Title": "RailTel Secures Rs. 180.6 Crore Work Order from Dredging Corporation of India",
            "Summary": "RailTel Corporation of India Ltd. has received a work order worth Rs. 18,06,20,011 from Dredging Corporation Of India Limited. The contract involves provision of seamless offshore internet services for DCI vessels and ICCC. This is a domestic order with an execution deadline of January 18, 2026. The work order was received on September 20, 2025. There are no promoter group interests or related party transactions involved in this contract.",
            "Sentiment": "positive",
            "PublishDate": 1758459172047,
            "Source": "order&deals"
        },
        {
            "Title": "RailTel Secures Rs 575 Crore Order for Smart Classrooms in Bihar",
            "Summary": "RailTel Corporation of India Ltd. received a Letter of Acceptance from Bihar State Educational Infrastructure Development Corporation Limited for an order worth Rs 57.49 crore. The contract involves developing hybrid Smart Classrooms and ICT Labs at various colleges and universities in Bihar under the PM-USHA Scheme. The domestic supply order is scheduled for completion by March 16, 2026. The company confirmed that no promoter group entities have any interest in the awarding entity, and the contract does not involve related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758031711105,
            "Source": "order&deals"
        }
    ]
}