{
    "Symbol": "RAINBOW",
    "ISIN": "INE961O01016",
    "News": [
        {
            "Title": "Rainbow Children's Medicare Grants 1 Lakh Stock Options",
            "Summary": "Rainbow Children's Medicare Limited's Nomination and Remuneration Committee approved the grant of 1,00,000 stock options under ESOP 2025 to eligible employees on January 28, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769599251555,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rainbow Childrens Medicare Q3 Net Profit Rises 5.5%",
            "Summary": "Rainbow Childrens Medicare reported consolidated net profit of ₹725 million in Q3, marking a 5.5% increase from ₹687 million in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769598605542,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rainbow Children's Medicare Opens New Bengaluru Facility",
            "Summary": "Rainbow Children's Medicare expands its presence in Bengaluru with the launch of a new 90-bed healthcare facility in Electronic City, strengthening its footprint in Karnataka's capital city.",
            "Sentiment": "positive",
            "PublishDate": 1769579197925,
            "Source": "stocks"
        },
        {
            "Title": "Rainbow Children's Medicare Board Meet on Jan 28",
            "Summary": "Rainbow Children's Medicare Limited has scheduled a board meeting for January 28, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769001317204,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rainbow Childrens Medicare Block Trade Worth ₹34.92 Cr",
            "Summary": "Rainbow Childrens Medicare witnessed a significant block trade on NSE involving 271,788 shares at ₹1,285.00 per share, totaling ₹34.92 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767845626662,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rainbow Children's Medicare Reports 6.5% Revenue Growth Despite Seasonal Headwinds in Q2 FY26",
            "Summary": "Rainbow Children's Medicare achieved revenue of Rs 444.8 crores with 6.5% growth and EBITDA of Rs 148.8 crores despite lower occupancy rates due to reduced seasonal illnesses and early festive season impact. The company completed acquisitions of Prashanthi Hospital in Warangal and Pratiksha Hospital in Guwahati, appointed Abrarali Dalal as Group CEO effective January 2026, and targets 20% revenue growth over the next two years with ongoing expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1763642155040,
            "Source": "earnings"
        },
        {
            "Title": "Rainbow Children's Medicare Grants 5,660 Stock Options to Employees Under ESOP 2025",
            "Summary": "Rainbow Children's Medicare Limited's Nomination and Remuneration Committee granted 5,660 stock options to eligible employees under the Employee Stock Option Scheme 2025 on November 13, 2025. The options are exercisable at a discount of up to 20% from the November 12, 2025 NSE closing price, with vesting period ranging from 1 to 10 years and exercise window of 2 years from vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1763057697275,
            "Source": "corporate_action"
        },
        {
            "Title": "Rainbow Children's Medicare Reports 6.5% Revenue Growth in Q2FY26 Quarterly Results",
            "Summary": "Rainbow Children's Medicare achieved revenue of ₹4,448 million in Q2FY26, up 6.5% from ₹4,175 million in Q2FY25, with EBITDA rising to ₹1,489 million and PAT reaching ₹756 million. The pediatric healthcare chain expanded its network to 22 hospitals across 9 cities with 2,285 beds, including recent acquisitions of Prashanthi Hospital in Warangal and Pratiksha Hospital in Guwahati.",
            "Sentiment": "positive",
            "PublishDate": 1763054363567,
            "Source": "corporate_action"
        },
        {
            "Title": "Rainbow Childrens Medicare Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Rainbow Childrens Medicare Limited has announced an earnings conference call for investors and analysts scheduled for Friday, November 14, 2025 at 10:00 AM IST. The call will discuss the company's financial and operating performance for Q2 H1 FY26. The management participants include Dr. Ramesh Kancharla (Chairman and MD), Mr. Vikas Maheshwari (Group Chief Financial Officer), and Mr. Saurabh Bhandari (Head IR & Business Intelligence). IIFL Capital is hosting the conference call with dial-in numbers provided for India, USA, UK, Singapore, and Hong Kong participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762587453302,
            "Source": "earnings"
        },
        {
            "Title": "Rainbow Children's Medicare Opens 100-Bed Hospital in Rajahmundry",
            "Summary": "Rainbow Children's Medicare has inaugurated a new 100-bed hospital facility in Rajahmundry, Andhra Pradesh. This represents an expansion of the company's healthcare infrastructure in the region.",
            "Sentiment": "positive",
            "PublishDate": 1757508236770,
            "Source": "stock"
        },
        {
            "Title": "Rainbow Childrens Medicare Block Trade Worth Rs. 15.68 Crores Executed on NSE",
            "Summary": "Rainbow Childrens Medicare Ltd. saw a block trade executed on the NSE involving approximately 105,604 shares at a price of Rs. 1,485.00 per share, totaling Rs. 15.68 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1757312562751,
            "Source": "order&deals"
        },
        {
            "Title": "Rainbow Children's Medicare Seeks Shareholder Approval for Rs 35 Crore Loan Facility",
            "Summary": "Rainbow Children's Medicare Limited has issued a postal ballot notice seeking shareholder approval through a special resolution to provide loans up to Rs 35 crores to three companies where certain directors have interests. The borrowing companies are Rainbow Speciality Hospitals Private Limited, Prashanthi Medicare Private Limited, and Pratiksha Women & Child Care Hospital Private Limited. The first two are existing subsidiaries, while the company plans to acquire 76% equity and 100% preference shares in Pratiksha Women & Child Care Hospital. The e-voting period runs from August 29 to September 27, 2025, with results to be announced by September 30, 2025. The loans will be utilized for principal business activities of the borrowing companies.",
            "Sentiment": "neutral",
            "PublishDate": 1756384359759,
            "Source": "corporate_action"
        },
        {
            "Title": "Rainbow Children's Medicare Completes Acquisition of 76% Stake in Pratiksha Women & Child Care Hospital",
            "Summary": "Rainbow Children's Medicare Limited has completed the acquisition of 76% equity share capital and 100% Non-Convertible Redeemable Preference shares in Pratiksha Women & Child Care Hospital Private Limited. The acquisition was completed on August 18, 2025, following the execution of Securities Subscription Agreement and Shareholders' Agreement announced on August 11, 2025. As a result of this acquisition, Pratiksha Women & Child Care Hospital has become a subsidiary of Rainbow Children's Medicare Limited.",
            "Sentiment": "positive",
            "PublishDate": 1755523288744,
            "Source": "order&deals"
        },
        {
            "Title": "Rainbow Children's Medicare Acquires 76% Stake in Pratiksha Hospital for ₹171 Crore",
            "Summary": "Rainbow Children's Medicare Limited has approved the acquisition of 76% equity and 100% preference shares in Pratiksha Women & Child Care Hospital Private Limited for approximately ₹171 crore. The transaction involves ₹129.96 crore for equity shares and ₹41.04 crore for non-convertible redeemable preference shares, funded through cash reserves and internal accruals. Pratiksha Hospital is a 150-bed NABH-accredited facility in Guwahati, Assam, with 100 operational beds and 50 additional beds expected to become operational within six months. Founded in 1995 by Dr. Pramod Kumar Sharma, the hospital specializes in pediatric care, obstetrics, gynecology, and IVF services. This acquisition marks Rainbow's strategic entry into Northeast India, expanding its network to 21 hospitals across 8 cities with approximately 2,185 total beds. The hospital will be rebranded as 'Pratiksha Rainbow Children's Hospital' and integrated into Rainbow's national network. The acquisition is expected to be completed within 30 days and does not require governmental or regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754926214919,
            "Source": "order&deals"
        },
        {
            "Title": "Rainbow Children's Medicare Reports 7% Revenue Growth to ₹353 Crores in Q1 FY26",
            "Summary": "Rainbow Children's Medicare delivered steady financial performance despite seasonal softness in pediatric volumes. Revenue grew 7% to ₹353 crores, EBITDA increased 11% to ₹103.6 crores, and profit after tax surged 35% to ₹53.8 crores. Overall occupancy rate stood at 40.2%. The company acquired 76% stake in Prashanthi Hospital Warangal, entering a new market with 1.1 million population. Outpatient volumes grew 6% while inpatient and delivery volumes declined 1% and 2% respectively. The company maintains strong cash position of ₹735 crores and invested ₹41.5 crores in capital expenditure. Management expects around 350 beds to be added this year through new hospital openings and acquisitions. The company is advancing discussions for a 150-bed greenfield hospital in Pune and targeting late teens to 20% revenue growth guidance.",
            "Sentiment": "positive",
            "PublishDate": 1754308026731,
            "Source": "earnings"
        },
        {
            "Title": "Rainbow Children's Medicare Maintains 18-20% Revenue Growth Target Despite Seasonal Slowdown",
            "Summary": "Rainbow Children's Medicare has reaffirmed its revenue growth guidance of 18-20% for FY26, expecting demand to strengthen in upcoming quarters. The company posted a strong EBITDA margin of 29.4% in Q1 FY26 but will not revise its full-year guidance upward. Chairman and Managing Director Dr. Ramesh Kancharla indicated that margins may face pressure as three new hospitals with approximately 250 beds become operational this year. The company expects pre-Ind AS margins of 24-25% and post-Ind AS margins of 29-30% for FY26. Average revenue per patient is projected to grow 6% year-on-year, consistent with earlier projections. The rise in average revenue per occupied bed has been driven by stronger case mix including pediatric surgical, specialty, and quaternary care services like cardiac transplants and neurosurgeries. Surgical revenues demonstrated strong momentum with at least 15% growth in both volume and value. However, overall hospital occupancy declined to around 40% due to seasonal slowdown in outpatient and pediatric intensive care segments.",
            "Sentiment": "positive",
            "PublishDate": 1753696076868,
            "Source": "earnings"
        },
        {
            "Title": "Rainbow Children's Medicare Reports Q1 FY26 Results; Appoints New Senior Management Personnel",
            "Summary": "Rainbow Children's Medicare Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 3,347.48 million and profit after tax of Rs. 517.20 million, with basic earnings per share of Rs. 5.09. On a consolidated basis, revenue from operations stood at Rs. 3,529.29 million with profit after tax of Rs. 538.05 million and basic earnings per share of Rs. 5.27. The board designated Dr. Pranathi Subrahmanyam Maddirala, Clinical Director of Obstetrics and Fetal Medicine, as Senior Management Personnel. The company also granted 140,810 stock options under ESOP 2025 to eligible employees and completed the acquisition of 76% equity stake in Prashanthi Medicare Private Limited for Rs. 326 million. A final dividend of Rs. 3 per equity share for FY 2024-25 was paid on July 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753528849922,
            "Source": "earnings"
        },
        {
            "Title": "Rainbow Children's Medicare Schedules Q1 FY26 Earnings Call for July 28, 2025",
            "Summary": "Rainbow Children's Medicare Limited has scheduled an earnings conference call for July 28, 2025, at 10:00 AM IST to discuss its Q1 FY26 financial and operating performance. The call will be hosted by IIFL and will feature key management participants including Dr. Ramesh Kancharla (Chairman and MD), Mr. Vikas Maheshwari (Group Chief Financial Officer), and Mr. Saurabh Bhandari (Head IR & Business Intelligence). The conference call is intended for investors and analysts to discuss the company's business strategy and outlook following the declaration of quarterly results. Dial-in numbers have been provided for participants from India and international locations including the USA, UK, Singapore, and Hong Kong.",
            "Sentiment": "neutral",
            "PublishDate": 1753177674281,
            "Source": "earnings"
        },
        {
            "Title": "Rainbow Children's Medicare Acquires Majority Stake in Prashanthi Medicare",
            "Summary": "Rainbow Children's Medicare has acquired 76% of equity shares and 100% of preference shares in Prashanthi Medicare Pvt Ltd. This acquisition represents a significant corporate action for Rainbow Children's Medicare, expanding its ownership and potentially its operational reach in the healthcare sector.",
            "Sentiment": "positive",
            "PublishDate": 1751381004000,
            "Source": "default"
        },
        {
            "Title": "Rainbow Children's Medicare: Q3 Performance Impacted by Execution Delays",
            "Summary": "Rainbow Children's Medicare shares fell over 4% after Q3 results. Revenue was in line but EBITDA margin beat estimates due to cost control. Analysts maintain positive outlook despite delays in new hospital commissioning. Company plans to add 250 beds in 2025 and 200 in 2026, with potential acquisitions being explored.",
            "Sentiment": "neutral",
            "PublishDate": 1739251655000,
            "Source": "earnings"
        },
        {
            "Title": "Rainbow Children's Q3 EBITDA and Margin Results",
            "Summary": "Rainbow Children's reported Q3 EBITDA of 1.34 billion rupees, up from 1.18 billion rupees year-over-year. However, the Q3 EBITDA margin decreased to 33.71% from 35.18% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739156724000,
            "Source": "earnings"
        },
        {
            "Title": "Rainbow Children's Medicare Reports Q3 Profit and Revenue Growth",
            "Summary": "Rainbow Children's Medicare has announced its financial results for the third quarter. The company reported a consolidated net profit of 687 million rupees, up from 621 million rupees in the same period last year. Revenue also increased to 3.98 billion rupees from 3.36 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739156600000,
            "Source": "earnings"
        }
    ]
}