{
    "Symbol": "RAIN",
    "ISIN": "INE855B01025",
    "News": [
        {
            "Title": "Rain Industries clarifies business seasonality ahead of FY25 results",
            "Summary": "Rain Industries Limited provides clarification on seasonal business patterns, noting Q4 typically softer due to industry-specific demand patterns, ahead of annual results announcement on February 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770742416116,
            "Source": "stocks"
        },
        {
            "Title": "Rain Industries Launches €1.7M EU R&D Project",
            "Summary": "Rain Industries initiates three-year 'Use-G' research project for eco-friendly graphite mining in Europe, supported by €1.7 million grant from German Ministry in partnership with leading institutions.",
            "Sentiment": "positive",
            "PublishDate": 1770014308077,
            "Source": "stocks"
        },
        {
            "Title": "Rain Industries responds to stock exchange query",
            "Summary": "Rain Industries clarifies to BSE and NSE that recent trading volume increase is market driven, with no unpublished price sensitive information pending disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1769698775490,
            "Source": "stocks"
        },
        {
            "Title": "Rain Industries Shares Surge 45% in One Month",
            "Summary": "Rain Industries shares have jumped 45% over the past month driven by recovering EBITDA, attractive valuations at 0.7x book value, and increasing institutional participation from ICICI Prudential.",
            "Sentiment": "positive",
            "PublishDate": 1767687741043,
            "Source": "stocks"
        },
        {
            "Title": "Rain Industries schedules board meeting for FY25 results",
            "Summary": "Rain Industries responds to stock exchange queries on price movement, confirms board meeting scheduled for February 27, 2026 to approve FY25 annual results. Company states price movement is market-driven.",
            "Sentiment": "neutral",
            "PublishDate": 1766387272559,
            "Source": "stocks"
        },
        {
            "Title": "Rain Industries Reports Q3 2025 Results, Discusses Carbon Business Recovery and Cement Expansion Plans",
            "Summary": "Rain Industries Limited conducted a Q&A session for Q3 2025 results with management addressing investor questions. The company reported adjusted EBITDA margin of 14.5% on revenue of Rs 44.76 billion. Key highlights include: Carbon segment showing margin recovery in Q2 and Q3 2025 after previous challenges from raw material pricing and Battery Anode Materials impact. Both SEZ and DTA plants operating at approximately 90% capacity following regulatory changes allowing GPC imports. The company announced a Rs 757 crore brownfield cement expansion adding 1.5 million tonnes clinker and 2.3 million tonnes cement capacity, targeting commissioning in Q4 2027 with projected IRR of 14-16%. Net debt to EBITDA ratio improved to 3.3x from 3.9x in Q4 2024. The expansion will include a 7MW Waste Heat Recovery system, targeting 45-50% green power share by 2028. Management expects revenue generation from new Indian carbon distillation operations in latter half of FY26. The company secured CAD 860k government funding for battery materials R&D collaboration with Northern Graphite. No current plans for share buyback as capital allocation focuses on debt reduction and growth investments.",
            "Sentiment": "positive",
            "PublishDate": 1762992560611,
            "Source": "earnings"
        },
        {
            "Title": "Rain Industries Reports Q3 Results and Announces Major Cement Plant Expansion Worth Rs 757 Crores",
            "Summary": "Rain Industries Limited announced its third quarter results ended September 30, 2025, with statutory auditors issuing an unmodified opinion. The company's Board approved a significant expansion of its cement plant at Ramapuram Village, Telangana through wholly owned subsidiary Rain Cements Limited. The expansion will increase clinker capacity by 1.50 million tonnes per annum and cement capacity by 2.30 million tonnes per annum, requiring an investment of Rs 757 crores. The project is targeted for commissioning in Q4 2027 and will be financed through internal accruals supplemented by debt. The expansion includes a 7.0 MW Waste Heat Recovery system and aims to achieve economies of scale while capitalizing on India's projected cement demand growth of 6-8% CAGR between 2024-2030. Additionally, the Board approved expansion of the solar power plant capacity by 10 MW at the same location, to be commissioned by February 28, 2026, financed through internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1762485069386,
            "Source": "earnings"
        },
        {
            "Title": "Rain Industries Reports Strong Q2 Turnaround with 1.06B Rupees Net Profit",
            "Summary": "Rain Industries posted a net profit of 1.06 billion rupees in Q2, marking a significant turnaround from a loss of 1.79 billion rupees in the same period last year. The company's revenue grew to 44.76 billion rupees from 39.34 billion rupees year-over-year. EBITDA increased substantially to 6.27 billion rupees compared to 2.14 billion rupees in the previous year, with EBITDA margin improving from 5.45% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762443698286,
            "Source": "earnings"
        },
        {
            "Title": "RAIN Industries Receives C$860,000 Funding for Eco-Friendly Battery Materials Research",
            "Summary": "RAIN Industries has secured C$860,000 in funding for research and development focused on creating eco-friendly battery anode materials. The two-year project aims to convert graphite by-products into high-quality materials for battery applications.",
            "Sentiment": "positive",
            "PublishDate": 1762166583195,
            "Source": "stock"
        },
        {
            "Title": "Rain Carbon Canada Partners with Green Graphite Technologies to Develop Sustainable Battery Materials",
            "Summary": "Rain Carbon Canada Inc., a subsidiary of Rain Industries Limited, has partnered with Green Graphite Technologies Inc. under a Sustainable Manufacturing Challenge grant from Next Generation Manufacturing Canada (NGen) to develop sustainable graphite anode active materials for lithium-ion batteries. The partnership aims to establish a circular supply chain for critical battery materials to support Canada's growing zero-emission vehicle market, which is projected to grow from 480,000 units in 2024 to 21 million by 2040. Rain Carbon will lead the conversion of feedstock materials through its LIONCOAT carbon precursor materials and application process technology, while GGT will contribute its proprietary GraphPure and GraphRenew purification technologies. The project will utilize Rain Carbon's Hamilton, Ontario facility and GGT's pilot facilities in Kingston and Montreal. By 2030, the partnership aims to result in two new graphite product lines with manufacturing processes designed to reduce waste, increase efficiency, and reduce carbon footprint while creating employment opportunities across the battery materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1760525016377,
            "Source": "stock"
        },
        {
            "Title": "Rain Industries Discusses Q2 2025 Results, Alternative Raw Materials Strategy and Operational Challenges",
            "Summary": "Rain Industries Limited held a management Q&A session addressing quarterly results for Q2 and H1 2025. The company is implementing alternative raw materials across its Carbon and Advanced Materials segments, focusing on diverse Green Petroleum Coke sourcing and innovative logistics solutions. The Carbon segment operated at 68% capacity, Advanced Materials at 63%, and Cement at 70%. Chinese CPC prices surged early in 2025 due to reduced refinery output but retreated by quarter-end, remaining 100-150 USD per ton above earlier levels. The distillation business faces challenges from the Russia-Ukraine conflict, including energy price increases and reduced coal tar availability in Europe. The company expects to begin generating revenue from Indian Carbon distillation activities in late 2026. Rain Industries has no plans to curtail facilities and is considering restarting idle US capacity for 2026. New emission standards for petroleum coke calciners in India took effect with a compliance deadline of December 2025. The company's gross debt stands at approximately one billion USD with a 9% average interest rate, expecting working capital release to reduce debt by around 10% over the next two quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1755524088649,
            "Source": "earnings"
        },
        {
            "Title": "Rain Industries Reports Strong Q1 Turnaround with 607 Million Rupees Profit",
            "Summary": "Rain Industries posted a consolidated net profit of 607 million rupees in Q1, marking a significant turnaround from a loss of 779 million rupees in the same period last year. The company's revenue grew to 44 billion rupees compared to 40.9 billion rupees year-over-year. EBITDA increased substantially to 6.3 billion rupees from 3.7 billion rupees, while EBITDA margin expanded to 14.30% from 9.02% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754525656771,
            "Source": "earnings"
        },
        {
            "Title": "Rain Industries Announces Rs 1 Interim Dividend, Reports 42% Jump in Q2 Adjusted EBITDA",
            "Summary": "Rain Industries Limited will pay an interim dividend of Rs 1.00 per equity share for the financial year ending December 31, 2025, to shareholders on August 29, 2025. The company reported quarterly results with revenue from operations of Rs 44.01 billion, up 17% from the previous quarter and 8% year-over-year. Adjusted EBITDA increased 42% quarter-over-quarter to Rs 6.17 billion and 26% year-over-year. Adjusted net profit after tax stood at Rs 0.50 billion with earnings per share of Rs 1.47. The company operates three business segments: Carbon (revenue Rs 31.9 billion), Advanced Materials (revenue Rs 3.3 billion), and Cement (revenue Rs 8.2 billion). Rain Industries maintains liquidity of $339 million, including $191 million in cash and $148 million in undrawn loan facilities, with no term debt maturities until October 2028.",
            "Sentiment": "positive",
            "PublishDate": 1754497350997,
            "Source": "corporate_action"
        },
        {
            "Title": "Rain Industries Focuses on Margin Improvement Through Strategic Cost Management and R&D Investments",
            "Summary": "Rain Industries is implementing multiple strategies to enhance margins while maintaining volume levels. The company is making price adjustments on CPC (Calcined Petroleum Coke), utilizing alternative raw materials, and controlling energy costs in Europe. Rain Industries is also investing in research and development for biocarbon and advanced materials. The company has no debt maturities scheduled until 2028.",
            "Sentiment": "positive",
            "PublishDate": 1754496770713,
            "Source": "stock"
        },
        {
            "Title": "Rain Industries Sets August 13, 2025 as Record Date for Interim Dividend",
            "Summary": "Rain Industries Limited announced that its Board of Directors has fixed August 13, 2025 as the record date for determining shareholders eligible to receive interim dividend for the financial year ending December 31, 2025. The decision was made during a board meeting held on August 6, 2025. The company trades on NSE under the symbol RAIN and on BSE under scrip code 500339.",
            "Sentiment": "positive",
            "PublishDate": 1754495440543,
            "Source": "corporate_action"
        },
        {
            "Title": "Rain Industries Reports Q2 2025 Results and Declares Interim Dividend of Rs. 1 Per Share",
            "Summary": "Rain Industries Limited announced its unaudited financial results for the second quarter and half year ended June 30, 2025. The company's Board of Directors approved the quarterly results along with a limited review report from statutory auditors S. R. Batliboi & Associates LLP, who issued an unmodified opinion. The Board declared an interim dividend of Rs. 1 per equity share (50% on face value of Rs. 2 per share) for the financial year ending December 31, 2025, with August 13, 2025 set as the record date. On a standalone basis, the company reported revenue from operations of Rs. 243.06 million for Q2 2025 compared to Rs. 304.18 million in Q2 2024. On a consolidated basis, revenue from operations was Rs. 37,680.16 million for Q2 2025 versus Rs. 40,941.49 million in Q2 2024. The consolidated results showed a profit of Rs. 829.95 million for Q2 2025 compared to a loss of Rs. 1,151.04 million in Q2 2024.",
            "Sentiment": "positive",
            "PublishDate": 1754494033595,
            "Source": "earnings"
        },
        {
            "Title": "Rain Industries Receives Affirmed 'IND A/Stable' Credit Rating from India Ratings",
            "Summary": "Rain Industries Limited received an affirmed credit rating of 'IND A/Stable' from India Ratings and Research for its term loan of INR 1,700 million, with no change from the previous year. The rating reflects the company's stable financial position supported by increased green petroleum coke import quota allocation over FY25-FY26, which is expected to improve capacity utilization to 85%-90% from current levels. The company's consolidated revenue declined 15% to INR 153,744 million in 2024, with EBITDA margins falling to 8.18% from 9.33% in 2023. However, the rating agency expects revenue and profitability to improve over the medium term due to economies of scale from higher utilization levels. The company's net leverage increased to 5.43x in 2024 but is expected to normalize below 4.0x in 2025. Rain Industries operates through subsidiaries in carbon, advanced materials, and cement segments, with operations outside India contributing 75%-80% of consolidated revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1753342126470,
            "Source": "stock"
        },
        {
            "Title": "Rain Industries Reports Q4 2023 Financial Results",
            "Summary": "Rain Industries announced its Q4 2023 financial results. The company's EBITDA increased to 3.8 billion rupees from 3.42 billion rupees year-over-year, with EBITDA margin improving to 10.10% from 9.33%. However, the company reported a consolidated net loss of 1.4 billion rupees, slightly lower than the 1.46 billion rupees loss in the same quarter last year. Revenue for Q4 2023 rose to 37.6 billion rupees from 36.7 billion rupees in Q4 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1746716157000,
            "Source": "result"
        },
        {
            "Title": "Rain Industries Reports Q3 Financial Results",
            "Summary": "Rain Industries has reported its financial results for the third quarter. The company posted a consolidated net loss of 1.61 billion rupees, which is an improvement from the 11.2 billion rupee loss in the same quarter last year. However, it represents a slight increase in losses compared to the previous quarter's loss of 1.79 billion rupees. The company's revenue for Q3 stood at 36.76 billion rupees, down from 41 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1740615571000,
            "Source": "earnings"
        },
        {
            "Title": "Rain Industries Reports Significant EBITDA Improvement in Q3",
            "Summary": "Rain Industries has reported a substantial turnaround in its Q3 EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company posted an EBITDA gain of 3.48 billion rupees, compared to a loss of 6.1 billion rupees in the same quarter of the previous year. This represents a significant year-over-year improvement in the company's operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1740502782000,
            "Source": "earnings"
        },
        {
            "Title": "Rain Industries Reports Decline in Q3 Revenue",
            "Summary": "Rain Industries has reported a decrease in its third-quarter revenue. The company's Q3 revenue stood at 36.76 billion rupees, down from 41 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1740502775000,
            "Source": "earnings"
        },
        {
            "Title": "Rain Industries Reports Q3 Consolidated Net Loss of 1.61 Billion Rupees",
            "Summary": "Rain Industries has reported a consolidated net loss of 1.61 billion rupees for the third quarter. This represents an improvement from the loss of 11.2 billion rupees in the same quarter last year. However, compared to the previous quarter, the loss has slightly increased from 1.79 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1740502769000,
            "Source": "earnings"
        },
        {
            "Title": "Rain Carbon to Establish Coal Tar Distillation Facility in APSEZ",
            "Summary": "Rain Carbon, a subsidiary of Rain Industries, plans to set up a coal tar distillation facility in APSEZ (likely Adani Ports and Special Economic Zone). The first phase of the project is scheduled to begin in the second half of 2025 and is estimated to cost $5 million.",
            "Sentiment": "positive",
            "PublishDate": 1738324444000,
            "Source": "corporate_action"
        },
        {
            "Title": "Green Graphite Technologies Receives Funding for EV Battery Graphite Production",
            "Summary": "Green Graphite Technologies Inc., a subsidiary of Rain Industries, has been awarded $682,000 in funding from the Ontario Vehicle Innovation Network's R&D Partnership Fund. The funding aims to advance the company's graphite production capabilities for electric vehicle batteries.",
            "Sentiment": "positive",
            "PublishDate": 1737678140000,
            "Source": "corporate_action"
        },
        {
            "Title": "Green Graphite Technologies Receives Funding for EV Battery Graphite Production",
            "Summary": "Green Graphite Technologies Inc., a subsidiary of Rain Industries, has been awarded $682,000 in funding from the Ontario Vehicle Innovation Network's R&D Partnership Fund. This funding is aimed at advancing the production of graphite for electric vehicle (EV) batteries.",
            "Sentiment": "positive",
            "PublishDate": 1737646289000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rain Industries Reports Decline in Q2 EBITDA",
            "Summary": "Rain Industries experienced a significant decrease in its Q2 EBITDA, which fell to 2.14 billion rupees from 3.6 billion rupees year-over-year. The company's EBITDA margin also declined, dropping to 5.45% from 8.63% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730904893000,
            "Source": "result"
        },
        {
            "Title": "Rain Industries Reports Widened Q2 Loss",
            "Summary": "Rain Industries reported a consolidated net loss of 1.54 billion rupees in Q2, compared to a loss of 657 million rupees year-over-year and 449 million rupees quarter-over-quarter. The company's revenue decreased to 39 billion rupees from 42 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730904794000,
            "Source": "result"
        },
        {
            "Title": "Rain Industries: Subsidiary Partners with Northern Graphite for EV Battery Material",
            "Summary": "<p><span class='positive'>Rain Carbon</span>, a subsidiary of <span class='positive'>Rain Industries</span>, has entered an <b>agreement</b> with <span class='positive'>Northern Graphite</span> to jointly <span class='positive'>develop</span> and <span class='positive'>commercialize</span> natural graphite <b>battery anode material</b> for lithium-ion batteries in <span class='positive'>electric vehicles</span>. The collaboration aims to <span class='positive'>enhance battery performance</span>, including <span class='positive'>extended cycle life</span> and <span class='positive'>faster charging</span>. <br/> Rain Industries' stock <span class='positive'>rose 9.1%</span> following the announcement.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728540257000,
            "Source": "normal_news"
        },
        {
            "Title": "Rain Industries and Northern Graphite Partner on Battery Anode Material",
            "Summary": "<p>A subsidiary of <span class=\"neutral\">Rain Industries</span> has entered into an <span class=\"positive\">agreement</span> with <span class=\"neutral\">Northern Graphite</span> to <b>jointly develop natural graphite battery anode material</b>. This <span class=\"positive\">collaboration</span> aims to <span class=\"positive\">advance</span> the production of components <b>crucial for electric vehicle batteries</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728479244000,
            "Source": "corporate_action"
        }
    ]
}