{
    "Symbol": "RAJESHEXPO",
    "ISIN": "INE343B01030",
    "News": [
        {
            "Title": "Rajesh Exports Responds to BSE Volume Query",
            "Summary": "Rajesh Exports Limited addressed BSE's inquiry about significant trading volume increase, attributing it to market conditions without specific internal factors.",
            "Sentiment": "neutral",
            "PublishDate": 1766480615352,
            "Source": "stocks"
        },
        {
            "Title": "Rajesh Exports Reports Mixed Q1 Results with Standalone Profit but Consolidated Loss",
            "Summary": "Rajesh Exports Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported net sales of Rs 14,265.54 million and a net profit of Rs 176.47 million, with earnings per share of Rs 0.59. However, on a consolidated basis, the company posted net sales of Rs 1,315,417.96 million but recorded a net loss of Rs 95.33 million, resulting in a loss per share of Rs 0.32. The company operates in the gold products segment and has a paid-up equity share capital of Rs 295.26 million with a face value of Re 1 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758296833628,
            "Source": "earnings"
        },
        {
            "Title": "Rajesh Exports Reports Net Loss of ₹162.93 Million in Q4 FY2025",
            "Summary": "Rajesh Exports Limited announced its audited standalone financial results for the quarter and year ended March 31, 2025. The company reported a net loss of ₹162.93 million for Q4 FY2025, compared to a net profit of ₹66.04 million in the previous quarter and a net loss of ₹603.48 million in Q4 FY2024. For the full year, the company posted a net profit of ₹240.52 million versus ₹183.66 million in the previous year. Revenue from operations for Q4 stood at ₹19,148.61 million compared to ₹26,187.08 million in the previous quarter and ₹13,267.50 million in Q4 FY2024. Annual revenue increased to ₹70,270.72 million from ₹54,006.11 million in the previous year. Basic earnings per share for Q4 was negative ₹0.55 compared to positive ₹0.22 in the previous quarter. The company's total assets stood at ₹74,661.42 million as of March 31, 2025. The audit report contained no modified opinion.",
            "Sentiment": "negative",
            "PublishDate": 1754411518724,
            "Source": "earnings"
        },
        {
            "Title": "SEBI Initiates Forensic Accounting Investigation into Rajesh Exports",
            "Summary": "The Securities and Exchange Board of India (SEBI) has informed Rajesh Exports about an assignment for forensic accounting and investigation into the company's affairs. Rajesh Exports has stated that it will seek further details from SEBI and comply with the regulator's instructions, taking necessary steps as per applicable provisions.",
            "Sentiment": "neutral",
            "PublishDate": 1733357009000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Initiates Forensic Accounting Investigation into Rajesh Exports",
            "Summary": "The Securities and Exchange Board of India (SEBI) has informed Rajesh Exports about a forensic accounting and investigation assignment related to the company. Rajesh Exports has stated that they will seek further details from SEBI, follow the regulator's instructions, and take necessary steps in accordance with applicable provisions.",
            "Sentiment": "negative",
            "PublishDate": 1733322346000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rajesh Exports: Q2 Profit Up 0.55%, Revenue Soars 75.81%",
            "Summary": "Rajesh Exports reported Q2 FY2024 results with profit rising 0.55% YoY to ₹45.56 crore and revenue surging 75.81% to ₹66,923.67 crore. QoQ growth shows 284.22% increase in profit and 10.88% in revenue. Operating income up 146.16% QoQ. EPS at ₹1.54, up 0.65% YoY.",
            "Sentiment": "positive",
            "PublishDate": 1731798419000,
            "Source": "result"
        }
    ]
}