{
    "Symbol": "RAJOOENG",
    "ISIN": "INE535F01024",
    "News": [
        {
            "Title": "Rajoo Engineers Q3 Net Profit Surges 59.73% YoY",
            "Summary": "Rajoo Engineers reports strong Q3 performance with net profit rising to ₹14.20 crores from ₹8.89 crores in the previous year, marking significant growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1768900196084,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rajoo Engineers clarifies trading volume surge",
            "Summary": "Rajoo Engineers Limited informed BSE that recent trading volume increase is market-driven with no undisclosed price sensitive information pending.",
            "Sentiment": "neutral",
            "PublishDate": 1767685286264,
            "Source": "stocks"
        },
        {
            "Title": "Rajoo Engineers Introduces Flexible Working Framework for Employee Wellbeing and 24x7 Customer Support",
            "Summary": "Rajoo Engineers Limited has launched a flexible working framework effective November 2025 to improve employee wellbeing while enabling uninterrupted customer support across time zones. The initiative allows employees to manage their schedules responsibly while ensuring constant operational coverage and faster customer response times.",
            "Sentiment": "positive",
            "PublishDate": 1764308942296,
            "Source": "stock"
        },
        {
            "Title": "Rajoo Engineers' Credit Ratings Reaffirmed by CARE, Removed from Rating Watch",
            "Summary": "CARE Ratings reaffirmed Rajoo Engineers Limited's credit ratings across Rs. 67 crore of bank facilities, with long-term facilities rated CARE A-: Positive and short-term rated CARE A2. The ratings were removed from Rating Watch with Developing Implications and assigned positive outlook based on the company's operational and financial performance for FY25 and H1FY26.",
            "Sentiment": "positive",
            "PublishDate": 1764132219448,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Rajoo Engineers Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Ms. Lakshmi Ramakrishnan as Non-Executive Independent Director for a five-year term starting September 23, 2025. The e-voting process will be conducted from November 20, 2025 to December 19, 2025, with Ms. Ramakrishnan bringing 28 years of manufacturing and engineering experience to strengthen the company's board governance.",
            "Sentiment": "positive",
            "PublishDate": 1763441454057,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers Reports 33% Higher QIP Issue Expenses Than Projected in Monitoring Report",
            "Summary": "Rajoo Engineers Limited's monitoring agency CARE Ratings reported that actual issue-related expenses from the Rs. 160 crore QIP remained 33% higher than amounts mentioned in the placement document for the quarter ended September 30, 2025. The company acquired a smaller stake in the target entity than originally envisaged, resulting in lower acquisition costs but higher issue expenses of Rs. 24.20 crore compared to the projected Rs. 16 crore.",
            "Sentiment": "negative",
            "PublishDate": 1763174039994,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers Reports Strong Q2 Performance with 62% Revenue Growth and 100% EBITDA Jump",
            "Summary": "Rajoo Engineers Limited announced its quarterly results with revenue from operations reaching Rs. 92.25 crore, representing a 62.39% year-on-year increase. EBITDA (excluding other income) grew 100% to Rs. 18.31 crore, while EBITDA margin improved to 19.84%, up 374 basis points. Profit after tax increased 87.85% to Rs. 13.59 crore with PAT margin rising 200 basis points to 14.74%. For the half-year period, revenue grew 64.67% to Rs. 177.33 crore with EBITDA increasing 126.81% to Rs. 36.88 crore. The company attributed growth to full capacity production and dispatches driven by a strong order book. Recent developments include raising Rs. 160 crore through a Qualified Institutional Placement, signing a non-binding offer for strategic acquisition in the machinery segment, and investing in a 60% majority stake in Kohli Printing and Converting Machines. The company also received recognition as Gujarat Best Employer Brand 2025 and showcased innovations at K-2025 trade show.",
            "Sentiment": "positive",
            "PublishDate": 1762977132376,
            "Source": "earnings"
        },
        {
            "Title": "Rajoo Engineers Reports Record Order Book and Strategic Expansion Plans",
            "Summary": "Rajoo Engineers has announced a record order book in extrusion machinery. The company is expanding its global presence in packaging and recycling solutions while focusing on automation and research & development partnerships. The company is also pursuing strategic expansion in high-margin thermoforming and multilayer film lines.",
            "Sentiment": "positive",
            "PublishDate": 1762963253426,
            "Source": "stock"
        },
        {
            "Title": "Rajoo Engineers Reports Strong Q2 Performance with 62% Revenue Growth",
            "Summary": "Rajoo Engineers Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of Rs 236.57 lakhs for the quarter compared to Rs 145.72 lakhs in the same period last year, representing significant growth. Net profit after tax increased to Rs 291.87 lakhs for the quarter versus Rs 134.07 lakhs in the previous year. For the half year period, revenue reached Rs 472.85 lakhs with net profit of Rs 291.87 lakhs. The company operates in plastic extrusion plant and machinery manufacturing. During the period, Rajoo Engineers acquired a 60% equity stake in Kohli Printing and Converting Machines Private Limited on September 22, 2025, making it a subsidiary. The company had previously raised Rs 160 crores through a Qualified Institutional Placement by issuing 1,46,78,900 equity shares. The Board had recommended a final dividend of 15% for the previous financial year, which was approved by shareholders and paid in October 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761853879109,
            "Source": "earnings"
        },
        {
            "Title": "Rajoo Engineers Reports Strong Q2 Performance with 92% Jump in Net Profit",
            "Summary": "Rajoo Engineers delivered robust quarterly results with net profit surging to 138.8 million rupees from 72.3 million rupees year-over-year. Revenue grew significantly to 918.8 million rupees compared to 568 million rupees in the same period last year. EBITDA more than doubled to 186.3 million rupees from 91.4 million rupees, while EBITDA margin improved to 20.27% from 16.1% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761841910459,
            "Source": "earnings"
        },
        {
            "Title": "Rajoo Engineers to Debut PROEX Series Blown Film Technology at K-2025 Trade Show",
            "Summary": "Rajoo Engineers Limited will showcase its latest innovations at K-2025 trade show in Hall 16, Booth A55. The company will make its global debut of the PROEX Series High-Performance Blown Film Extrusion Line, which features the advanced RELEX 4.0 extruder offering 30% higher throughput with low energy consumption. The platform includes CSD 4.0 die head, air ring, RANDOMISER 4.0 haul-off, and FLEXIWIND 4.0 automatic winder. Chief Sales Officer Jinesh Shah stated the PROEX marks a global debut in plastic extrusion technology, delivering excellence in efficiency, sustainability, and intelligence. Rajoo Engineers, founded in 1986 and headquartered in Rajkot, specializes in blown films and sheet extrusion lines with a customer base spanning over 78 nations.",
            "Sentiment": "positive",
            "PublishDate": 1759475430676,
            "Source": "stock"
        },
        {
            "Title": "Rajoo Engineers Appoints New Independent Director, Reconstitutes Board Committees",
            "Summary": "Rajoo Engineers Limited appointed Ms. Lakshmi Ramakrishnan as Additional Director (Independent) for a five-year term effective September 23, 2025, subject to shareholder approval. Mr. Laxman Rudabhai Ajagiya will cease to be an Independent Director on September 24, 2025, upon completion of his second five-year term. The board reconstituted its Audit Committee, Nomination and Remuneration Committee, and Stakeholders Relationship Committee following these changes. Ms. Ramakrishnan brings 28 years of experience in manufacturing, engineering and retail sectors, having served as CEO of Essen Speciality Films Pvt. Ltd. from 2004 to 2020, where she managed operations achieving annual turnover exceeding Rs. 100 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758629582978,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rajoo Engineers Acquires 60% Stake in Kohli Printing And Converting Machines",
            "Summary": "Rajoo Engineers has acquired a 60% stake in Kohli Printing And Converting Machines Pvt Ltd, making Kohli a subsidiary. The acquisition is part of Rajoo Engineers' strategy for inorganic growth and expanding its international presence.",
            "Sentiment": "positive",
            "PublishDate": 1758533742461,
            "Source": "order&deals"
        },
        {
            "Title": "Rajoo Engineers Signs Definitive Agreement for Manufacturing Sector Acquisition",
            "Summary": "Rajoo Engineers Limited executed a Definitive Agreement on September 10, 2025, to acquire an undisclosed entity in the manufacturing sector that produces machines for various industries. The acquisition aims to expand Rajoo's inorganic growth strategy and strengthen its market position by offering end-to-end solutions across the value chain. The transaction will be completed through cash consideration within 30 days and does not require governmental or regulatory approvals. Key details including the target entity's name, acquisition cost, shareholding percentage, and background information will be disclosed upon completion due to confidentiality terms. The acquisition is not a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1757499484127,
            "Source": "order&deals"
        },
        {
            "Title": "Rajoo Engineers Appoints Hasmukhlal Ambavibhai Manavadaria as Independent Director Through Postal Ballot",
            "Summary": "Rajoo Engineers Limited completed a postal ballot process through remote e-voting for the appointment of Mr. Hasmukhlal Ambavibhai Manavadaria as a Non-Executive Independent Director. The special resolution was passed on September 8, 2025, with overwhelming shareholder support. Out of 107,997,290 total votes cast representing 60.44% of outstanding shares, 107,994,139 votes (99.997%) were in favor while only 3,151 votes (0.003%) were against the resolution. The company had 56,742 shareholders on the record date of August 7, 2025. CS Nirav D. Vekariya served as the scrutinizer for the voting process. Manavadaria was initially appointed as an Additional Director by the Board on June 17, 2025, and will now serve a five-year term as Independent Director.",
            "Sentiment": "positive",
            "PublishDate": 1757410564016,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rajoo Engineers Limited Wins Gujarat Best Employer Brand 2025 Award",
            "Summary": "Rajoo Engineers Limited received the Gujarat Best Employer Brand 2025 award from the World HRD Congress on August 20, 2025, at Hyatt Ahmedabad. The recognition acknowledges the company's commitment to people, culture, and innovation, placing it among the most respected employers in Gujarat. Mr. Sajjad Sabugar represented the company at the award ceremony. Managing Director Khushboo C. Doshi stated that the company believes its people are its greatest strength and that the honor reaffirms their focus on trust, collaboration, and continuous development. Rajoo Engineers, founded in 1986 and headquartered in Rajkot, is a global manufacturer of blown films and sheet extrusion lines, serving customers across 78 nations.",
            "Sentiment": "positive",
            "PublishDate": 1756102776939,
            "Source": "stock"
        },
        {
            "Title": "Rajoo Engineers Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Rajoo Engineers Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Hasmukhlal Ambavibhai Manavadaria as a Non-Executive Independent Director. The 64-year-old businessman brings nearly three decades of experience in agricultural machinery manufacturing and is the Founder-Partner of Ganga Agro Foods Industries. The e-voting process will run from August 10, 2025, at 9:00 AM to September 8, 2025, at 5:00 PM through NSDL's platform. The cut-off date for eligible shareholders is August 7, 2025. The Board of Directors recommends approval of this special resolution, and CS Nirav D Vekariya has been appointed as the scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1754638587657,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers Installs Advanced Okuma Multus Machine to Enhance Manufacturing Capabilities",
            "Summary": "Rajoo Engineers Limited has installed an Okuma Multus U4000 machine from Japan at their Shree Yantralaya facility. The high-precision multitasking machine delivers advanced 5-axis machining by integrating turning, milling, drilling, and gear cutting into a single automated setup. The installation is part of Rajoo's investment plan announced in 2024 and is designed to advance manufacturing excellence to global standards. Joint Managing Director Utsav Doshi stated the investment represents continuous focus on building world-class capabilities and will bring greater agility and precision to core manufacturing, creating more value for global customers. The machine is expected to help reduce lead times, improve quality, and reduce external dependencies. Rajoo Engineers, founded in 1986 and headquartered in Rajkot, is a global player in blown films and sheet extrusion lines with customers spanning over 78 nations.",
            "Sentiment": "positive",
            "PublishDate": 1754398309488,
            "Source": "stock"
        },
        {
            "Title": "Rajoo Engineers Signs Non-Binding Offer for Strategic Acquisition in Machinery Manufacturing",
            "Summary": "Rajoo Engineers Limited has signed a Non-Binding Indicative Offer (NBIO) to acquire a company in the machinery manufacturing sector. The target company has over three decades of experience and maintains a strong brand reputation in both domestic and international markets. This acquisition is part of Rajoo Engineers' strategy for inorganic growth through forward integration, aimed at strengthening market position and offering end-to-end solutions across the value chain. The combined capabilities are expected to enhance product offerings and expand presence in India and global markets. Rajoo Engineers, based in Rajkot and established in 1986, specializes in blown film and sheet extrusion lines with customers in over 70 countries.",
            "Sentiment": "positive",
            "PublishDate": 1753429043885,
            "Source": "order&deals"
        },
        {
            "Title": "Rajoo Engineers Completes QIP, Raises Funds Through Allocation of 1.47 Crore Shares at Rs 109 Each",
            "Summary": "Rajoo Engineers Limited successfully closed its qualified institutions placement (QIP) on July 21, 2025, after opening on July 15, 2025. The company allocated 1,46,78,900 equity shares to eligible Qualified Institutional Buyers at an issue price of Rs 109 per share, including a premium of Rs 108 per share on face value of Re 1. The issue price represents a discount of 4.74% or Rs 5.42 per share to the floor price of Rs 114.42 per share, calculated according to SEBI ICDR Regulations. The Board of Directors approved the closure, allocation, and finalized confirmation notes to be sent to the institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1753158631737,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers: Plans Rs 180 Crore QIP for Expansion",
            "Summary": "Rajoo Engineers approved a Qualified Institutional Placement to raise Rs 180 crore, with a floor price of ₹114.42 per share. The company will use ₹160 crore for inorganic expansion and the rest for general corporate purposes. GYR Capital Advisors appointed as Book Running Lead Managers.",
            "Sentiment": "positive",
            "PublishDate": 1752720232000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers Launches QIP with Minimum Price of 114.42 Rupees Per Share",
            "Summary": "Rajoo Engineers has initiated a Qualified Institutional Placement (QIP) with a minimum price set at 114.42 rupees per share. This corporate action aims to raise capital from qualified institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1752590586000,
            "Source": "default"
        },
        {
            "Title": "Rajoo Engineers Reports Strong Q1 Financial Results",
            "Summary": "Rajoo Engineers has reported significant year-over-year growth in its latest quarterly results. The company's net profit increased to 144 million rupees from 53 million rupees in the same quarter last year. Revenue rose to 851 million rupees from 509 million rupees. EBITDA grew to 186 million rupees from 71 million rupees, with the EBITDA margin improving to 21.84% from 14% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1752451634000,
            "Source": "default"
        },
        {
            "Title": "Rajoo Engineers Reports Strong Q1 Financial Results",
            "Summary": "Rajoo Engineers has announced its Q1 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 186 million rupees from 71 million rupees in the same quarter last year. The EBITDA margin improved to 21.84% from 14%. Net profit rose to 144 million rupees from 53 million rupees, while revenue grew to 851 million rupees from 509 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1752315046000,
            "Source": "result"
        },
        {
            "Title": "Rajoo Engineers Reports Strong Q4 Financial Results",
            "Summary": "Rajoo Engineers has announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit for Q4 reached 138 million rupees, compared to 62 million rupees in the same quarter last year and 89 million rupees in the previous quarter. Revenue also saw a substantial increase, rising to 899 million rupees from 527 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745540104000,
            "Source": "default"
        },
        {
            "Title": "Rajoo Engineers Reports Strong Q4 Financial Performance",
            "Summary": "Rajoo Engineers has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 195 million rupees from 90 million rupees in the previous year, with EBITDA margin expanding to 21.68% from 17.01%. Net profit rose to 138 million rupees from 62 million rupees year-over-year and 89 million rupees quarter-over-quarter. Revenue for Q4 reached 899 million rupees, up from 527 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1745498386000,
            "Source": "result"
        },
        {
            "Title": "Rajoo Engineers Approves Direct Listing on NSE",
            "Summary": "The board of Rajoo Engineers has approved an application for the direct listing of the company's equity shares on the National Stock Exchange (NSE). This move suggests the company is seeking to expand its presence in the Indian stock market and potentially increase its visibility to investors.",
            "Sentiment": "positive",
            "PublishDate": 1744008180000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers to Raise Up to 2.25 Billion Rupees Through QIP",
            "Summary": "Rajoo Engineers has announced plans to raise funds up to 2.25 billion rupees (approximately $27 million) through a Qualified Institutional Placement (QIP). This fundraising method allows listed companies to issue equity shares, fully and partly convertible debentures, or other securities to qualified institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1741134378000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers to Raise Funds up to 2.25 Billion Rupees via QIP",
            "Summary": "Rajoo Engineers Limited has announced plans to raise funds up to 2.25 billion rupees through a Qualified Institutional Placement (QIP). This fundraising initiative suggests the company is seeking to strengthen its financial position or fund potential growth opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1741087737000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers Reports Mixed Q3 Financial Results",
            "Summary": "Rajoo Engineers has announced its financial results for the third quarter. The company's net profit increased to 88.9 million rupees, up from 57 million rupees in the same quarter last year. However, revenue decreased to 560.8 million rupees from 600 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737333542000,
            "Source": "earnings"
        },
        {
            "Title": "Rajoo Engineers Reports Significant EBITDA Growth in Q3",
            "Summary": "Rajoo Engineers has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased to 108.3 million rupees, up from 77 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 19.32% from 12.81% in the previous year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737129067000,
            "Source": "earnings"
        },
        {
            "Title": "Rajoo Engineers Reports Q3 Revenue Decline",
            "Summary": "Rajoo Engineers has reported a decrease in revenue for the third quarter. The company's revenue stood at 560.8 million rupees, down from 600 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737129062000,
            "Source": "earnings"
        },
        {
            "Title": "Rajoo Engineers Reports 56% Increase in Q3 Net Profit",
            "Summary": "Rajoo Engineers has announced its financial results for the third quarter, reporting a net profit of 88.9 million rupees. This represents a significant increase from the 57 million rupees reported in the same quarter of the previous year, marking a year-over-year growth of approximately 56%.",
            "Sentiment": "positive",
            "PublishDate": 1737129057000,
            "Source": "earnings"
        },
        {
            "Title": "Rajoo Engineers: Last Day to Buy for 1:3 Bonus Issue",
            "Summary": "Rajoo Engineers announced a bonus issue of 1:3, with December 2 as the record date. Today is the last day to buy shares to be eligible for the bonus issue due to T+1 settlement. The company's stock has shown significant returns in recent months.",
            "Sentiment": "positive",
            "PublishDate": 1732847095000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers Invests 300M Rupees in Machine Shop",
            "Summary": "Rajoo Engineers has made a significant investment of 300 million rupees in its machine shop. This substantial capital expenditure suggests the company is expanding or upgrading its manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1731677100000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajoo Engineers Reports Improved Q2 EBITDA and Margin",
            "Summary": "<p>Rajoo Engineers has announced its Q2 financial results. The company's <span class='positive'>EBITDA increased</span> to ₹91.4 million from ₹71.7 million year-over-year. Additionally, the <span class='positive'>EBITDA margin improved</span> to <b>16.10%</b> from <b>13.39%</b> compared to the same period last year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728908407000,
            "Source": "result"
        },
        {
            "Title": "Rajoo Engineers Reports Q2 Revenue Growth",
            "Summary": "<p>Rajoo Engineers has announced its <span class='neutral'>Q2 revenue figures</span>. The company reported revenue of <span class='positive'>568 million rupees</span>, showing an <b>increase</b> from both the previous year (<span class='neutral'>535 million rupees</span>) and the previous quarter (<span class='neutral'>508 million rupees</span>).</p>",
            "Sentiment": "positive",
            "PublishDate": 1728908389000,
            "Source": "result"
        },
        {
            "Title": "Rajoo Engineers Reports Q2 Net Profit Increase",
            "Summary": "<p>Rajoo Engineers has reported a <span class='positive'>net profit</span> of <b>72.3 million rupees</b> for the second quarter, showing an <span class='positive'>increase</span> from <b>53 million rupees</b> year-over-year and <b>53.4 million rupees</b> quarter-over-quarter.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728908380000,
            "Source": "result"
        },
        {
            "Title": "Rajoo Engineers Approves 1:3 Bonus Share Issue",
            "Summary": "<p>Rajoo Engineers has approved the <span class='positive'>issuance</span> of <span class='positive'>bonus equity shares</span> in the ratio of <b>1:3</b>, meaning shareholders will receive <span class='positive'>one additional share</span> for every <b>three shares</b> they currently hold.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728906788000,
            "Source": "corporate_action"
        }
    ]
}