{
    "Symbol": "RAJRATAN",
    "ISIN": "INE451D01029",
    "News": [
        {
            "Title": "Rajratan Investments Increases Stake in Rajratan Global",
            "Summary": "Rajratan Investments Private Limited acquired 33,325 shares of Rajratan Global Wire Limited through open market transactions, increasing its shareholding from 18.44% to 18.50%.",
            "Sentiment": "neutral",
            "PublishDate": 1770481468390,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rajratan Global Wire targets volume growth in FY26",
            "Summary": "Company shifts strategy to volume-led growth over margins, expects 13-14% margins to continue amid competitive market. Chennai plant expansion and Thailand operations driving growth.",
            "Sentiment": "neutral",
            "PublishDate": 1769082236278,
            "Source": "stocks"
        },
        {
            "Title": "RajRatan Global Wire Q3 Results Show Strong Growth",
            "Summary": "RajRatan Global Wire Limited reported impressive Q3 FY26 financial results with consolidated revenue rising 38.07% YoY to ₹302.06 crore and net profit surging 122.24% to ₹20.69 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769079233016,
            "Source": "co_actions_results"
        },
        {
            "Title": "RajRatan Global Wire Re-appoints Yashovardhan Chordia",
            "Summary": "RajRatan Global Wire Limited's Board approves re-appointment of Mr. Yashovardhan Chordia as CEO & Deputy Managing Director for three-year term from April 2026 to April 2029, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768983266514,
            "Source": "stocks"
        },
        {
            "Title": "Rajratan Global Wire Q3 Net Profit Surges 122% YoY",
            "Summary": "Rajratan Global Wire reports consolidated net profit of ₹20.70 crores in Q3, marking a significant 122% year-on-year growth from ₹9.30 crores in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1768981653654,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rajratan Global Wire Board Meet on Jan 21, 2026",
            "Summary": "Rajratan Global Wire Limited has scheduled a board meeting for January 21, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768302289814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rajratan Global Wire postal ballot passes resolutions",
            "Summary": "Rajratan Global Wire Limited successfully passes two special resolutions through postal ballot with 99.9953% approval for alteration of Memorandum and Articles of Association.",
            "Sentiment": "positive",
            "PublishDate": 1767687776853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rajratan Global Wire Seeks Shareholder Approval for Energy Business Expansion",
            "Summary": "Rajratan Global Wire Limited has issued a postal ballot notice seeking shareholder approval through special resolutions to alter its Memorandum and Articles of Association to include conventional and non-conventional energy generation activities. The amendments will enable the company to engage in captive power generation, equipment dealing, research and consultancy services in the energy sector, with e-voting scheduled from December 4, 2025 to January 2, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1764761225893,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajratan Global Wire Invests Rs 14.4 Million in Lilac Ecoenergy",
            "Summary": "Rajratan Global Wire has made an investment of Rs 14.4 million in Lilac Ecoenergy. The investment represents Rajratan Global Wire's strategic move into the energy sector through its stake in Lilac Ecoenergy.",
            "Sentiment": "positive",
            "PublishDate": 1764243560730,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajratan Global Wire Reports 20% Revenue Growth in Q2 with Record Production Volume",
            "Summary": "Rajratan Global Wire Limited reported 20% revenue growth for the quarter with substantial volume growth in both Thailand and India operations. The company achieved EBITDA of close to Rs. 40 crores and crossed 32,000 tons production in one quarter for the first time. Chairman Sunil Chordia attributed the performance to Chennai plant gaining more approvals and good traction in global markets for exports. Current total exports to markets other than India and Thailand stand at 2,200-2,300 tons per month, with plans to reach 40,000 tons export in FY27. Thailand operations are running at 91% utilization while Chennai plant is operating at around 60% capacity. The company is investing Rs. 20-25 crores for Chennai Phase-II expansion to increase capacity to 60,000 tons. A new wire rope facility with Rs. 70 crores investment and 10,000 tons annual capacity is under construction at Pithampur, expected to start production in Q1 of next financial year. Management projects reaching 180,000-200,000 tons with topline of Rs. 2,000 crores over three years.",
            "Sentiment": "positive",
            "PublishDate": 1762507279597,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire Receives Rs 3.27 Crore Investment Promotion Assistance from Madhya Pradesh Government",
            "Summary": "Rajratan Global Wire Limited received Rs 3.27 crore as the next tranche of Investment Promotion Assistance (IPA) from MP Industrial Development Corporation Limited under the Madhya Pradesh Nivesh Protsahayan Yojana, 2014. The company had been sanctioned a total IPA amount of Rs 22.92 crore with an eligibility period of 7 years and yearly sanctioned amount of Rs 3.27 crore. This represents the latest installment of the government assistance scheme for the wire manufacturing company.",
            "Sentiment": "positive",
            "PublishDate": 1761997892095,
            "Source": "stock"
        },
        {
            "Title": "Rajratan Global Wire Reports Strong Q2 Performance, Approves Solar Investment and MOA Amendments",
            "Summary": "Rajratan Global Wire Limited announced its quarterly results for the quarter ended September 30, 2025. The company's Board approved entering into a shareholders agreement for investment up to Rs. 2 crores in a solar power generating company for group captive consumption. The Board also approved amendments to the Memorandum and Articles of Association to include provisions for electricity generation and captive consumption through non-fossil sources like solar power and wind mills, subject to shareholder approval. The financial results show standalone revenue from operations of Rs. 19,541 lakhs for the quarter, with net profit of Rs. 1,249 lakhs. On a consolidated basis, revenue was Rs. 30,844 lakhs with net profit of Rs. 2,056 lakhs. The company's Chennai Greenfield project trial run was completed in April 2025, with manufacturing and operating expenses being charged to the profit and loss statement for the half-year period.",
            "Sentiment": "positive",
            "PublishDate": 1761838940549,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire Projects 15% Volume Growth in FY26 with Revenue Target of ₹540 Cr in H1",
            "Summary": "Rajratan Global Wire expects 15% consolidated volume growth in FY26. The company's Chennai plant is turning profitable at 60% utilization while Thailand operations maintain 91% utilization. Revenue is projected to rise 16% year-on-year to ₹540 crore in H1 FY26 with EBITDA margins near 13%. The growth is supported by export mix improvements and capacity expansion to 1.2 lakh TPA across India and Thailand operations, aimed at achieving higher operating leverage and market share gains.",
            "Sentiment": "positive",
            "PublishDate": 1761838486910,
            "Source": "stock"
        },
        {
            "Title": "Rajratan Global Wire Reports Mixed Q2 Results with Revenue Growth and Margin Decline",
            "Summary": "Rajratan Global Wire reported Q2 consolidated net profit of 205 million rupees compared to 190 million rupees in the same period last year. Revenue increased to 2.9 billion rupees from 2.4 billion rupees year-over-year. EBITDA rose to 400 million rupees from 379 million rupees, though EBITDA margin declined to 13.6% from 15.44% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761810997460,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire Shareholders Approve Director Appointments and Secretarial Auditor Selection",
            "Summary": "Rajratan Global Wire Limited shareholders approved key appointments at their 37th Annual General Meeting. The company re-appointed Mrs. Alka Arora Misra and Mr. Sanjeev Sood as Independent Directors, and appointed Mr. Sandeep Mahajan as a new Independent Director. Mrs. Misra brings over 35 years of Indian Railways experience and serves as founding Vice Chancellor of National Rail and Transport University. Mr. Sood has four decades of manufacturing experience and leads Aditya Birla Group operations in Thailand. Mr. Mahajan serves as Chairman of Assurance International Ltd. with over 30 years of global consumer brands leadership experience. Additionally, shareholders appointed Mr. Palash Jain & Co., Practicing Company Secretaries as Secretarial Auditors for a five-year term from FY 2025-2026 to FY 2029-2030. The AGM lasted 16 minutes, with the scrutinizer report received on August 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755340616887,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rajratan Global Wire Sets Record Date for Annual General Meeting and Dividend",
            "Summary": "Rajratan Global Wire Limited has set August 6th, 2025 as the record date for its Annual General Meeting and dividend payment. The company notified both the National Stock Exchange of India and BSE Limited about this record date for equity shareholders. The communication was signed by Company Secretary & Compliance Officer Shubham Jain on July 22nd, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753181953484,
            "Source": "corporate_action"
        },
        {
            "Title": "Rajratan Global Wire Reports 12% Revenue Growth to Rs 246.51 Crores in Q1 FY26",
            "Summary": "Rajratan Global Wire Limited reported quarterly results showing revenue growth of 12% to Rs 246.51 crores compared to Rs 220.14 crores in the same quarter last year. Total sales volume increased 8% to 28,634 tonnes, with India operations contributing 16,961 tonnes and Thailand operations 11,673 tonnes. EBITDA grew 5% to Rs 30.94 crores, though EBITDA margin declined to 12.55% from 13.40%. Profit after tax decreased 11% to Rs 13.52 crores. The company attributed softer revenue growth to approximately Rs 18-20 crores worth of goods in transit for export orders. India operations generated 64% of revenue while Thailand contributed 36%. The Chennai plant is targeting 50%+ utilization with break-even expected by the third quarter. Chairman Sunil Chordia noted that weak steel prices benefited margins, while the company faced increased competition in Thailand and capacity additions exceeding market growth in India. The company received TPM Excellence Award for its Pithampur facility and is implementing sustainability initiatives including solar power installations.",
            "Sentiment": "neutral",
            "PublishDate": 1753158276248,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire Targets 50%+ Utilization at Chennai Plant, Eyes Q3 Break-Even",
            "Summary": "Rajratan Global Wire aims to achieve over 50% utilization at its new Chennai plant and targets reaching break-even in Q3. The company plans to increase exports to the US and EU markets, benefit from an 8% PLI scheme, and improve freight efficiency through its Chennai location.",
            "Sentiment": "positive",
            "PublishDate": 1753116650529,
            "Source": "stock"
        },
        {
            "Title": "Rajratan Global Wire Limited Reshuffles Board with New Independent Director Appointments",
            "Summary": "Rajratan Global Wire Limited's Board of Directors approved significant changes to its independent director composition. Mrs. Alka Arora Misra was re-appointed as Independent Director for a second five-year term from July 22, 2025, to July 21, 2030. Mr. Sandeep Mahajan was appointed as Independent Director for a first three-year term from July 22, 2025, to July 21, 2028. Both appointments are subject to shareholder approval. Simultaneously, Mr. Rajesh Mittal will retire as Independent Director effective July 21, 2025, after completing his second term. Mrs. Misra brings experience from roles including Chairperson of Odisha Skill Development Authority and board positions at National Highway Logistics Management Limited and Ion Exchange India Ltd. Mr. Mahajan serves as Chairman of Assurance International Ltd and previously held leadership positions at Goodyear India Limited, bringing over three decades of P&L management and sales expertise. Both new appointees confirmed they meet independence criteria under applicable regulations and have not been debarred from directorship.",
            "Sentiment": "neutral",
            "PublishDate": 1753101852615,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rajratan Global Wire Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Rajratan Global Wire reported Q1 revenue of 2.4 billion rupees, up from 2.2 billion rupees in the same period last year. EBITDA increased to 309 million rupees from 295 million rupees year-over-year, though EBITDA margin declined to 12.55% from 13.4%. Consolidated net profit decreased to 135 million rupees compared to 152 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753082989315,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire: Stock Surges 54% in Four Days Following Strong Q4 Results",
            "Summary": "Rajratan Global Wire's stock jumped 54% in four trading sessions after reporting a 63.3% QoQ increase in Q4FY24 consolidated net profit to ₹15 crore. The company anticipates higher sales volumes and improved margins in FY26, driven by increased capacity utilization at its Chennai plant and stronger export activity from India.",
            "Sentiment": "positive",
            "PublishDate": 1745396557000,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire Reports Q4 FY2023 Financial Results",
            "Summary": "Rajratan Global Wire announced its Q4 FY2023 financial results. The company reported a consolidated net profit of 152 million rupees, down from 202 million rupees year-over-year but up from 93.1 million rupees quarter-over-quarter. Q4 revenue increased to 2.5 billion rupees from 2.4 billion rupees in the same quarter last year. The company has recommended a final dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745281613000,
            "Source": "default"
        },
        {
            "Title": "Rajratan Global Wire Reports Q4 FY2023 Financial Results and Dividend",
            "Summary": "Rajratan Global Wire has announced its Q4 FY2023 financial results. The company reported a revenue of 2.5 billion rupees, up from 2.4 billion rupees year-over-year. However, the consolidated net profit decreased to 152 million rupees from 202 million rupees in the same quarter last year. The EBITDA for Q4 was 333.3 million rupees, down from 344.1 million rupees year-over-year, with the EBITDA margin declining to 13.26% from 14.36%. Additionally, the company has recommended a final dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745249028000,
            "Source": "result"
        },
        {
            "Title": "Rajratan Global Wire: Shares Rise 5% on Upcoming Investor Meet Announcement",
            "Summary": "Rajratan Global Wire's stock increased by nearly 5% following the announcement of a virtual investor meet scheduled for March 27, 2025, at the Bharat Connect Conference. The company's Q3 FY2025 results showed a 50% decline in net profit and a 6% drop in revenue year-on-year. Despite the recent rise, the stock remains over 50% below its 52-week high.",
            "Sentiment": "neutral",
            "PublishDate": 1742800868000,
            "Source": "corporate_action"
        },
        {
            "Title": "RAJRATAN GLOBAL WIRE: Q3 Profit Plunges 52.64% Amid Revenue Decline",
            "Summary": "RAJRATAN GLOBAL WIRE reported Q3 FY25 results with profit falling 52.64% YoY to ₹9.32 crore. Revenue decreased 6.16% YoY to ₹218.36 crore. Operating income down 33.05% YoY. EPS at ₹1.83, down 52.84% YoY. Expenses increased, impacting profitability.",
            "Sentiment": "negative",
            "PublishDate": 1737695987000,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire Reports Q3 Revenue Decline",
            "Summary": "Rajratan Global Wire has reported a decrease in its third-quarter revenue. The company's Q3 revenue stood at 2.2 billion rupees, down from 2.3 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737620599000,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Rajratan Global Wire has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 263 million rupees from 342 million rupees in the same quarter last year. Additionally, the EBITDA margin dropped to 12.02% from 14.71% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737620586000,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Rajratan Global Wire has reported a consolidated net profit of 93 million rupees for the third quarter, down from 197 million rupees in the same period last year. This represents a significant year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1737620464000,
            "Source": "earnings"
        },
        {
            "Title": "Rajratan Global Wire: Volume Growth Expected to Decline",
            "Summary": "Rajratan Global Wire anticipates a decrease in volume growth due to ongoing geopolitical tensions.",
            "Sentiment": "negative",
            "PublishDate": 1729584148000,
            "Source": "normal_news"
        },
        {
            "Title": "Rajratan Global Wire Reports Q2 EBITDA Growth",
            "Summary": "Rajratan Global Wire announced its Q2 financial results. The company's EBITDA increased to 379 million rupees from 339 million rupees year-over-year. However, the EBITDA margin slightly decreased to 15.44% from 15.83% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729506594000,
            "Source": "result"
        },
        {
            "Title": "Rajratan Global Wire Reports Q2 Revenue Growth",
            "Summary": "Rajratan Global Wire has announced its Q2 revenue figures. The company reported revenue of 2.4 billion rupees, compared to 2.14 billion rupees in the same quarter last year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729506579000,
            "Source": "result"
        },
        {
            "Title": "Rajratan Global Wire Reports Q2 Financial Results",
            "Summary": "Rajratan Global Wire has announced its Q2 consolidated net profit of 190 million rupees. This represents a slight year-over-year decrease from 195 million rupees, but a quarter-over-quarter increase from 152 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1729506567000,
            "Source": "result"
        }
    ]
}