{
    "Symbol": "RAJRILTD",
    "ISIN": "INE533D01032",
    "News": [
        {
            "Title": "Raj Rayon Q3 Revenue Jumps 30% Despite Profit Drop",
            "Summary": "Raj Rayon Industries reported Q3 revenue growth of 30% to ₹3 billion, though net profit declined 28% to ₹59 million compared to the previous year period.",
            "Sentiment": "neutral",
            "PublishDate": 1770362811008,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raj Rayon Board Meet Set for Feb 6 to Review Q3 Results",
            "Summary": "Raj Rayon Industries has scheduled a board meeting on February 6, 2026, to consider unaudited financial results for Q3 and nine months ended December 31, 2025, under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769754156750,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rajrayon Industries Issues Corrigendum to Correct Financial Statement Errors",
            "Summary": "Rajrayon Industries Limited corrected typographical errors in its quarterly financial statements, changing the classification from 'Audited' to 'Unaudited' for September 30, 2025 results and fixing comparative period references in cash flow statements. The company reported total assets of ₹58,852.96 lakhs and net profit before tax of ₹1,736.18 lakhs for the period, with all other information from the original board meeting outcome remaining unchanged.",
            "Sentiment": "positive",
            "PublishDate": 1763097846175,
            "Source": "earnings"
        },
        {
            "Title": "Raj Rayon Industries Reports Profit Turnaround in Q1 2025, Adopts CSR Policy",
            "Summary": "Raj Rayon Industries Limited reported a profit after tax of ₹607.27 lakhs for the quarter ended June 30, 2025, compared to a loss of ₹347.80 lakhs in the same quarter last year. Revenue from operations increased to ₹26,019.21 lakhs from ₹20,222.39 lakhs year-over-year. The board meeting held on August 5, 2025, approved the unaudited financial results and adopted a corporate social responsibility policy. The company's statutory auditors issued a qualified review report citing concerns about three inoperative bank accounts from the pre-insolvency period that management is working to resolve. Basic earnings per share improved to ₹0.11 from a loss of ₹0.06 in the previous year quarter. The company operates primarily in manufacturing and marketing of textile yarns.",
            "Sentiment": "positive",
            "PublishDate": 1754383745535,
            "Source": "earnings"
        },
        {
            "Title": "Raj Rayon Industries Schedules Board Meeting on August 5 to Approve Quarterly Financial Results",
            "Summary": "Raj Rayon Industries Limited has scheduled a Board of Directors meeting on August 5, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure for insiders and designated persons starting July 1, 2025, which will remain in effect until 48 hours after the declaration of the quarterly financial results. The meeting will also address other business matters with the Chair's permission.",
            "Sentiment": "neutral",
            "PublishDate": 1753764360218,
            "Source": "corporate_action"
        },
        {
            "Title": "Raj Rayon Industries Reports Q4 Profit of 134m Rupees",
            "Summary": "Raj Rayon Industries has reported a net profit of 134 million rupees in the fourth quarter, compared to a loss of 21 million rupees in the same quarter last year. This represents a quarter-on-quarter increase from 82 million rupees. The company's revenue for Q4 was 2.06 billion rupees, down from 2.17 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748559801000,
            "Source": "default"
        },
        {
            "Title": "Raj Rayon Industries Reports Improved Q4 Financial Results",
            "Summary": "Raj Rayon Industries has reported its Q4 financial results. The company's EBITDA increased to 106 million rupees from 69 million rupees year-over-year. The EBITDA margin improved to 5.16% from 3.19% in the same period last year. The company posted a net profit of 134 million rupees, compared to a loss of 21 million rupees in the previous year and a profit of 82 million rupees in the previous quarter. However, Q4 revenue decreased to 2.06 billion rupees from 2.17 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748520778000,
            "Source": "result"
        },
        {
            "Title": "Raj Rayon Industries Reports Significant Profit Growth in Q3",
            "Summary": "Raj Rayon Industries has announced its financial results for the third quarter. The company's net profit increased substantially to 82 million rupees, compared to 20 million rupees in the same period last year. Revenue also saw growth, rising to 2.3 billion rupees from 1.95 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739320523000,
            "Source": "earnings"
        },
        {
            "Title": "Raj Rayon Industries: Penny Stock Surges from ₹0.05 to ₹20 in Five Years",
            "Summary": "Raj Rayon Industries, a penny stock, has shown extraordinary growth, transforming an investment of ₹1 lakh into ₹4 crore over a five-year period. The stock price has increased from ₹0.05 to ₹20 during this time.",
            "Sentiment": "positive",
            "PublishDate": 1738659731000,
            "Source": "normal_news"
        }
    ]
}