{
    "Symbol": "RAJSREESUG",
    "ISIN": "INE562B01019",
    "News": [
        {
            "Title": "Rajshree Sugars Reports Q3 FY26 Loss of ₹918.87 Lakhs",
            "Summary": "Rajshree Sugars & Chemicals posted a net loss of ₹918.87 lakhs in Q3 FY26 compared to ₹2,043.71 lakhs loss in Q3 FY25. Revenue from operations declined to ₹9,798.81 lakhs from ₹8,118.73 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770818851536,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rajshree Sugars Reports January 2026 Operations",
            "Summary": "Rajshree Sugars & Chemicals disclosed operational data for January 2026, showing sugar production across three units with cane crushing of 1,63,807 MTs and sugar production of 14,570 MTs for the month.",
            "Sentiment": "neutral",
            "PublishDate": 1770463084822,
            "Source": "stocks"
        },
        {
            "Title": "Rajshree Sugars Board Meet on Feb 11 for Q3 Results",
            "Summary": "Rajshree Sugars & Chemicals has scheduled its 217th board meeting on February 11, 2026, to consider Q3FY26 unaudited financial results. Trading window closed until February 13.",
            "Sentiment": "neutral",
            "PublishDate": 1770228838460,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rajshree Sugars Reports December 2025 Operations",
            "Summary": "Rajshree Sugars & Chemicals Limited released operational data for December 2025, showing significant year-on-year growth in cane crushing and sugar production across its three manufacturing units.",
            "Sentiment": "positive",
            "PublishDate": 1767784840290,
            "Source": "stocks"
        },
        {
            "Title": "Rajshree Sugars Chemicals Reports Loss of ₹747.73 Lakhs in Latest Quarter",
            "Summary": "Rajshree Sugars Chemicals Limited reported a net loss of ₹747.73 lakhs for the quarter ended September 30, 2025, compared to a profit of ₹1,072.75 lakhs in the same period last year. The company's revenue from operations declined to ₹11,982.84 lakhs from ₹14,597.29 lakhs year-over-year. For the half-year period, the company posted a loss of ₹2,131.92 lakhs versus a profit of ₹1,666.76 lakhs in the previous year. The company operates three business segments: Sugar, Cogeneration, and Distillery. The Sugar segment recorded a loss of ₹1,235.91 lakhs, while Cogeneration and Distillery segments showed profits of ₹367.26 lakhs and ₹403.25 lakhs respectively. Management attributed lower turnover to reduced sugarcane availability due to adverse climatic conditions. The Board approved these results in their meeting held on November 3, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762178089482,
            "Source": "earnings"
        },
        {
            "Title": "Rajshree Sugars & Chemicals Reports September 2025 Operational Performance",
            "Summary": "Rajshree Sugars & Chemicals disclosed its operational metrics for September 2025. The company crushed 1,47,112 MT of cane and produced 13,151 MT of sugar during the month. Sugar sales reached 788 MT, while molasses production totaled 8,844 MT. The company also generated 82.74 lakh units of power.",
            "Sentiment": "neutral",
            "PublishDate": 1759826359015,
            "Source": "stock"
        },
        {
            "Title": "Rajshree Sugars Reports Turnaround to ₹5.94 Crore Profit Despite 41% Revenue Decline",
            "Summary": "Rajshree Sugars & Chemicals Limited turned profitable with a net profit of ₹5.94 crores in Q1 FY2026, compared to a loss of ₹14.14 crores in the same quarter last year. However, the company's total income from operations dropped significantly by 41.31% to ₹140.93 crores from ₹240.12 crores year-on-year. The earnings per share improved to ₹1.79 from negative ₹4.27 in the previous year. The company maintains a paid-up equity share capital of ₹33.14 crores, though it continues to have negative reserves of ₹6.59 crores, indicating accumulated losses on its balance sheet.",
            "Sentiment": "neutral",
            "PublishDate": 1755255888973,
            "Source": "earnings"
        },
        {
            "Title": "Rajshree Sugars Reports Loss of ₹1,414 Lakhs in Q1 FY2026 Due to Lower Sugarcane Availability",
            "Summary": "Rajshree Sugars & Chemicals Limited reported a net loss of ₹1,414.19 lakhs for the quarter ended June 30, 2025, compared to a profit of ₹594.01 lakhs in the same quarter last year. Revenue from operations declined to ₹14,092.87 lakhs from ₹24,011.87 lakhs year-over-year. The company attributed lower turnover to reduced sugarcane availability due to adverse climatic conditions. Basic earnings per share stood at -₹4.27 compared to ₹1.79 in the corresponding quarter. The sugar segment recorded a loss of ₹1,444.88 lakhs, while the distillery segment posted a profit of ₹893.46 lakhs. The cogeneration segment reported a loss of ₹167.97 lakhs. The company operates three business segments: Sugar, Cogeneration, and Distillery, with no subsidiary companies.",
            "Sentiment": "negative",
            "PublishDate": 1755184353966,
            "Source": "earnings"
        },
        {
            "Title": "Rajshree Sugars Appoints Banking Veteran Rajan Balasubramanian as Independent Director",
            "Summary": "Rajshree Sugars & Chemicals Limited appointed Rajan Balasubramanian as Independent Director for a five-year term at its 39th Annual General Meeting held on August 13, 2025. Balasubramanian brings over 36 years of banking experience from State Bank of India, with expertise in corporate credit, trade finance, and stressed asset management. He succeeds S. Krishnaswami, whose tenure concludes on September 29, 2025. The company also reappointed Rajshree Pathy as Non-Executive Non-Independent Director and appointed G. Soundarrajan as Secretarial Auditor for five financial years from FY 2025-26 to FY 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1755158288314,
            "Source": "corporate_governance"
        }
    ]
}