{
    "Symbol": "RAJTV",
    "ISIN": "INE952H01027",
    "News": [
        {
            "Title": "Raj TV Network Board Meet Set for Feb 11, 2026",
            "Summary": "Raj Television Network Limited has scheduled a board meeting on February 11, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770285042431,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raj TV Network Credit Rating Cut to 'IND D'",
            "Summary": "India Ratings downgrades Raj Television Network's bank loan facilities rating to 'IND D' from 'IND BB' following debt servicing delays in November 2025 due to liquidity constraints.",
            "Sentiment": "negative",
            "PublishDate": 1769248680278,
            "Source": "stocks"
        },
        {
            "Title": "Raj Television Network Shareholders Approve Appointment of Two Independent Directors via Postal Ballot",
            "Summary": "Raj Television Network Limited shareholders approved the appointment of Mr. Pechimuthu Udayakumar and Mr. Krishna Singh Balaji Singh as Non-Executive Independent Directors for five-year terms through postal ballot concluded on December 4, 2025. Both special resolutions passed with over 99.99% votes in favor, with the appointments effective from October 18, 2025 to October 17, 2030.",
            "Sentiment": "positive",
            "PublishDate": 1765041144830,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raj Television Network Fined Rs. 2.77 Lakh Each by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "BSE and NSE imposed fines of Rs. 2,77,300 each on Raj Television Network for non-compliance with board composition requirements under SEBI regulations for the quarter ended September 30, 2025. The company has not paid the fines and plans to file waiver applications citing pending government approvals for director appointments, stating the fines have no impact on its operations.",
            "Sentiment": "negative",
            "PublishDate": 1764585718680,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raj Television Network Reports Quarterly Profit of ₹1.66 Crore",
            "Summary": "Raj Television Network Limited reported a net profit of ₹1.66 crore for the quarter ended September 30, 2025, compared to ₹74 lakh profit in the same quarter last year. Revenue from operations declined to ₹18.76 crore from ₹35.93 crore year-over-year. The company's Board of Directors approved the unaudited financial results and decided not to recommend any dividend for the quarter. The company operates commercial satellite television channels and has no separate reportable business segments.",
            "Sentiment": "neutral",
            "PublishDate": 1762873308768,
            "Source": "earnings"
        },
        {
            "Title": "Raj Television Network Seeks Shareholder Approval for Two Independent Director Appointments",
            "Summary": "Raj Television Network Limited has issued a postal ballot notice seeking shareholder approval for the appointment of two Non-Executive Independent Directors. The company proposes to appoint Mr. Pechimuthu Udayakumar (DIN: 03353625) and Mr. Krishna Singh Balaji Singh (DIN: 11121323) for five-year terms from October 18, 2025 to October 17, 2030. Both candidates were initially appointed as Additional Directors by the Board of Directors with effect from October 18, 2025, based on recommendations from the Nomination and Remuneration Committee. The e-voting facility will be available from November 5, 2025 at 9:00 a.m. IST to December 4, 2025 at 5:00 p.m. IST. Mr. Udayakumar brings over 35 years of experience in MSME, petroleum, fertilizer, and financial sectors as former Chairman & Managing Director of NSIC Ltd. Mr. Krishna Singh is Dean and Professor of Surgery at Sri Ramachandra Medical College with over three decades of medical and academic experience. Both directors have submitted declarations confirming their independence criteria and are not related to any existing directors or key managerial personnel.",
            "Sentiment": "neutral",
            "PublishDate": 1762253946531,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raj Television Network Appoints Two New Independent Directors",
            "Summary": "Raj Television Network Limited appointed Mr. Pechimuthu Udayakumar and Mr. Krishna Singh Balaji Singh as Additional Non-Executive Independent Directors effective October 18, 2025. Both appointments are for five consecutive years and require shareholder approval. Udayakumar brings over 35 years of experience in MSME, petroleum, fertilizer, and financial sectors, having served as Chairman & Managing Director of NSIC Ltd. Singh is Dean and Professor of Surgery at Sri Ramachandra Medical College with over three decades in medical education and clinical leadership. Neither director is related to existing board members or debarred by regulatory authorities.",
            "Sentiment": "positive",
            "PublishDate": 1760772693506,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raj Television Network Approves Q2 2025 Results and Re-appoints Four Directors for Five-Year Terms",
            "Summary": "Raj Television Network Limited's Board of Directors met on August 13, 2025, and approved the unaudited financial results for the quarter ended June 30, 2025. The Board also approved the re-appointment of four key directors for five-year terms from April 1, 2026 to March 31, 2031, subject to shareholder approval. The re-appointments include Chairman and Managing Director M. Raajhendhran, and Whole Time Directors M. Rajarathnam, M. Ravindran, and Kannappa Pillai Mani Ragunathan. All four directors are family members, with three being brothers and one being a spouse. The Board also approved the sale of a property in Jubilee Hills, Hyderabad, measuring 683 square yards. The financial results were reviewed by the Audit Committee and audited by N Naresh & Co., Chartered Accountants.",
            "Sentiment": "neutral",
            "PublishDate": 1755097226476,
            "Source": "corporate_action"
        }
    ]
}