{
    "Symbol": "RALLIS",
    "ISIN": "INE613A01020",
    "News": [
        {
            "Title": "Rallis India Appoints Ashok Sharma as Independent Director",
            "Summary": "Rallis India Limited has appointed Mr. Ashok Sharma as Additional Director (Non-Executive, Independent) for a five-year term from February 10, 2026 to February 9, 2031, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1770647571766,
            "Source": "stocks"
        },
        {
            "Title": "Rallis India Surges 15% on HSBC Upgrade to 'Buy'",
            "Summary": "Rallis India shares jumped 15% after HSBC upgraded the stock to 'Buy' with ₹300 price target following Q3 earnings beat. Revenue grew 19.3% to ₹623 crore despite 81.8% decline in net profit.",
            "Sentiment": "positive",
            "PublishDate": 1769060703906,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rallis India Sets Ambitious Growth Targets",
            "Summary": "Rallis India announces aspirational targets to grow seed business to ₹1,000 crores and expand Soil & Plant Health business 4x from ₹225 crores to ₹700-800 crores over five years.",
            "Sentiment": "positive",
            "PublishDate": 1769048541590,
            "Source": "stocks"
        },
        {
            "Title": "Rallis India Q3FY26 Revenue Jumps 19% to ₹623 Cr",
            "Summary": "Rallis India reported Q3FY26 revenue of ₹623 crores, up 19% YoY, but net profit dropped to ₹2 crores from ₹11 crores due to exceptional items including ₹40 crore labour code impact.",
            "Sentiment": "neutral",
            "PublishDate": 1768915499907,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rallis India Q3 FY26 Earnings Call on Jan 21",
            "Summary": "Rallis India Limited schedules analyst and investor meeting for January 21, 2026 at 11:00 AM IST to discuss Q3 and nine months FY26 unaudited financial results under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768046185400,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rallis India Senior Management Personnel Resigns",
            "Summary": "Rallis India Limited announces resignation of Mr. Amol Jadhav as Head - Environment, Health, Safety & Sustainability, effective January 7, 2026, due to personal commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1767795277788,
            "Source": "stocks"
        },
        {
            "Title": "Rallis India Appoints Dr. Devender Kumar as R&D Head",
            "Summary": "Rallis India Limited announces the appointment of Dr. Devender Kumar as Head Research & Development for Seeds Division, effective July 1, 2026, bringing over 23 years of agricultural expertise.",
            "Sentiment": "positive",
            "PublishDate": 1767104531029,
            "Source": "stocks"
        },
        {
            "Title": "Rallis India Appoints Mahesh Girdhar as Independent Director for Five-Year Term",
            "Summary": "Rallis India Limited's Board approved the appointment of Mahesh Girdhar as Additional Director in Independent capacity for a five-year term from December 10, 2025 to December 9, 2030, subject to shareholder approval. Girdhar brings over 30 years of global experience in business operations across environment, renewable energy, and agri-business sectors, having previously held leadership roles at Deepak Fertilisers, Bayer CropScience, and Monsanto.",
            "Sentiment": "positive",
            "PublishDate": 1765188947609,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rallis India Partners with Paryan Alliance for Herbicide-Tolerant Rice Technology",
            "Summary": "Rallis India Limited, a Tata enterprise, announced a partnership with Paryan Alliance to introduce FullPage Herbicide Tolerance Rice Technology in India, featuring advanced herbicide-tolerant seeds and crop protection solutions. The technology aims to reduce water consumption by 25-30%, lower methane emissions, and improve productivity through Direct-Seeded Rice cultivation, with pilot demonstrations and limited commercial sales beginning from Kharif season 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763041715003,
            "Source": "stock"
        },
        {
            "Title": "Rallis India Launches NuCode Brand for Biological Agricultural Solutions",
            "Summary": "Rallis India Limited, a Tata enterprise and leader in the agri-inputs sector, announced the launch of NuCode, a new brand focused on advanced biological solutions for soil and plant health. NuCode, which stands for Nutrition Code, offers farmers a scientifically formulated range of biologicals including bio-fertilizers for soil enrichment, bio-stimulants for plant growth and resilience, and bio-pesticides for eco-friendly crop protection. The products are organized into systematic solution sets designed to replace traditional products with a modern framework-based system. The initiative aims to promote sustainable, science-led farming practices and reduce farmer dependency on chemical inputs. Rallis India is a subsidiary of Tata Chemicals Limited and part of the over US$165 billion Tata Group, with more than 77 years of experience serving rural markets through a distribution network of 7,000 dealers and over 100,000 retailers across India.",
            "Sentiment": "positive",
            "PublishDate": 1762958563023,
            "Source": "stock"
        },
        {
            "Title": "Rallis India Reports 7% Revenue Decline in Q2 FY26 Due to Excessive Rainfall Impact",
            "Summary": "Rallis India Limited reported quarterly revenue of INR 861 crores versus INR 928 crores in the same period last year, marking a 7% decline. The company faced challenges from abnormal rainfall distribution that led to crop losses in key agrochemical-consuming states including Punjab, Maharashtra, UP and Rajasthan. EBITDA stood at INR 154 crores, down 7% from the previous year, while profit after tax increased to INR 102 crores from INR 98 crores. The Crop Care segment declined 3% due to lower domestic performance, though export revenue grew 33%. The Seeds segment saw a significant 29% decline, with revenue dropping from INR 141 crores to INR 101 crores due to supply chain constraints and widespread adoption of illegal HTBt cotton varieties. The company launched two new products during the quarter - 'Deeweed' herbicide and 'Dodrio' fungicide. Export business showed strong performance with 51% growth in the first half, reaching INR 312 crores compared to INR 207 crores in the previous year. Management expects better prospects for the rabi season due to residual moisture from late rains.",
            "Sentiment": "negative",
            "PublishDate": 1761119315313,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India Plans Export and Contract Manufacturing Expansion Through Specialty Crop-Care Growth",
            "Summary": "Rallis India plans to scale its exports and CRAMS (contract manufacturing) operations through specialty crop-care expansion. The company aims to improve margins by shifting its product mix toward high-value agri-inputs and biologicals.",
            "Sentiment": "positive",
            "PublishDate": 1760632376533,
            "Source": "stock"
        },
        {
            "Title": "Rallis India Reports 4% Revenue Decline in Q2 2025 Despite Higher Profit",
            "Summary": "Rallis India's revenue from operations decreased to ₹861 crores in the second quarter ended September 30, 2025, compared to ₹928 crores in the same quarter last year. However, net profit increased to ₹102 crores from ₹98 crores year-over-year. For the half-year period, revenue grew to ₹1,818 crores from ₹1,711 crores, while net profit rose significantly to ₹197 crores from ₹146 crores in the previous year. The company recorded exceptional items of ₹6 crores in the current quarter, comprising profit on sale of flats. Earnings per share for the quarter stood at ₹5.23 compared to ₹5.04 in the same period last year. The company operates in the Agri-Inputs segment and notes that its business is seasonal, with performance impacted by weather conditions and cropping patterns.",
            "Sentiment": "neutral",
            "PublishDate": 1760615590244,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India Reports Strong Q1 Performance with 20% Revenue Growth and 98% PAT Surge",
            "Summary": "Rallis India delivered robust quarterly results with revenue reaching INR 957 crores, up 20% year-on-year, while profit after tax surged to INR 95 crores from INR 48 crores in the previous year. The company achieved double-digit volume-led growth across businesses, with Crop Care growing 16% and Seeds business expanding 38%. EBITDA increased 57% to INR 150 crores. The domestic Crop Care business grew 13%, driven by favorable monsoon conditions and better crop prices, while the Soil and Plant Health segment grew 33%. Export business showed strong recovery with 75% growth, primarily from Americas markets. The company launched 9 new crop protection products and 14 seed products during the quarter. Management expressed optimism about medium to long-term growth prospects, targeting 15-20% EBITDA margins and maintaining a debt-free balance sheet with healthy cash reserves.",
            "Sentiment": "positive",
            "PublishDate": 1753160733893,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India Aims for Margin Improvement and Growth",
            "Summary": "Rallis India has set targets for EBITDA margins of 20% in seeds and 15% in crop protection. The company plans capital spending of approximately Rs 100 crore for plant maintenance, research and development, and a solar plant. Additionally, Rallis India is seeking a 500 basis points gain in margins, targeting an overall EBITDA margin of 15-20% over time. The company also aims for double-digit revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1752636933000,
            "Source": "default"
        },
        {
            "Title": "Rallis India: Q1 Profit Soars 98%, CFO Change Announced",
            "Summary": "Rallis India reported a 98% YoY increase in Q1 net profit to Rs 95 crore. Revenue rose 22% to Rs 957 crore, and EBITDA grew 56.3% to Rs 150 crore. The company announced CFO Subhra Gourisaria's resignation and appointed Bhaskar Swaminathan as the new CFO effective August 7, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1752551929000,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India Reports Strong Q1 Financial Results",
            "Summary": "Rallis India has announced its Q1 financial results, showing significant year-over-year improvements. The company's net profit increased to 950 million rupees from 480 million rupees in the same quarter last year. Revenue rose to 9.6 billion rupees from 7.83 billion rupees. EBITDA grew to 1.5 billion rupees from 960 million rupees, with the EBITDA margin expanding to 15.67% from 12.26%.",
            "Sentiment": "positive",
            "PublishDate": 1752538926000,
            "Source": "default"
        },
        {
            "Title": "Rallis India Targets Double-Digit Growth by FY26",
            "Summary": "Rallis India aims to achieve steady double-digit growth by FY26. The company's strategy focuses on three key areas: expanding its robust seeds business, growing its custom synthesis operations, and enhancing digital and sustainable agricultural solutions.",
            "Sentiment": "positive",
            "PublishDate": 1752510208000,
            "Source": "default"
        },
        {
            "Title": "Rallis India Reports Growth Across Business Segments",
            "Summary": "Rallis India has reported growth in multiple business segments. The company saw a 13% increase in Crop Care B2C, 23% growth in Crop Care B2B, and a significant 38% growth in its Seeds Business. The company remains cautiously optimistic about the upcoming quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752503345000,
            "Source": "default"
        },
        {
            "Title": "Rallis India: Q1 Profit Doubles, Revenue Rises 22%",
            "Summary": "Rallis India reported a 98% sequential increase in consolidated net profit to Rs 95 crore in Q1 FY2025. Revenue from operations grew 22.2% to Rs 957 crore. EBITDA rose 56.3% to Rs 150 crore, with margins improving to 15.7%.",
            "Sentiment": "positive",
            "PublishDate": 1752497928000,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India Reports Strong Q1 Financial Results",
            "Summary": "Rallis India has announced its Q1 financial results. The company's EBITDA increased to 1.5 billion rupees from 960 million rupees year-over-year. The EBITDA margin improved to 15.67% from 12.26% in the same period last year. Net profit rose to 950 million rupees from 480 million rupees year-over-year. Revenue grew to 9.6 billion rupees from 7.83 billion rupees compared to the previous year's Q1.",
            "Sentiment": "positive",
            "PublishDate": 1752497048000,
            "Source": "result"
        },
        {
            "Title": "Rallis India Ltd: Last Day to Buy Shares for Dividend Eligibility",
            "Summary": "June 4 is the last day to buy Rallis India shares to qualify for the final dividend of Rs 2.50 per share for FY2025. The record date is June 5, and the dividend will be paid from June 25. The total dividend payout is approximately Rs 48.62 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1749007207000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rallis India: Domestic Focus After Q4 Loss",
            "Summary": "Rallis India reported a widened net loss of Rs 32 crore in Q4 due to export market pressures. The company is now focusing on its domestic business, which comprises 75% of total operations. CEO Gyanendra Shukla highlighted strong performances in seeds, soil and plant nutrition, and crop care segments domestically. The company plans to address portfolio gaps, particularly in herbicides for the rabi season, to ease pricing pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1745731244000,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India Reports Q4 FY23 Financial Results",
            "Summary": "Rallis India, a Tata Group company, reported a net loss of 320 million rupees in Q4 FY23, compared to a loss of 210 million rupees in the same quarter last year. However, the company showed improvement from the previous quarter, posting a profit of 110 million rupees. Q4 revenue slightly decreased to 4.3 billion rupees from 4.36 billion rupees year-over-year. The company has recommended a dividend of 2.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745453482000,
            "Source": "default"
        },
        {
            "Title": "Rallis India Reports Q4 FY23 Results and Dividend Announcement",
            "Summary": "Rallis India has announced its Q4 FY23 financial results and dividend. The company reported a net loss of 320 million rupees, compared to a loss of 210 million rupees in the same quarter last year. Q4 revenue stood at 4.3 billion rupees, slightly down from 4.36 billion rupees year-over-year. The company's EBITDA showed a loss of 200 million rupees, contrasting with a gain of 60 million rupees in the previous year. Despite the losses, Rallis India has recommended a dividend of 2.5 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1745418284000,
            "Source": "default"
        },
        {
            "Title": "Rallis India Reports Q3 Financial Results and Solar Power Plant Investment",
            "Summary": "Rallis India announced its Q3 financial results, with a net profit of 110 million rupees, down from 240 million rupees year-over-year and 980 million rupees quarter-over-quarter. The company's revenue for Q3 was 5.2 billion rupees, compared to 5.6 billion rupees in the same quarter last year. Additionally, Rallis India plans to invest 200-270 million rupees in setting up a solar power plant.",
            "Sentiment": "neutral",
            "PublishDate": 1737333565000,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India: Q3 Profit Plunges 54.17% Amid Revenue Decline",
            "Summary": "Rallis India reported Q3 FY25 results with profit falling 54.17% YoY to ₹11 crore. Revenue decreased 12.71% YoY to ₹522 crore. Operating income down 53.12% YoY. EPS at ₹0.56, down 55.2% YoY. Analysts' consensus recommendation is to Sell.",
            "Sentiment": "negative",
            "PublishDate": 1737178561000,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India to Invest in Solar Power Plant",
            "Summary": "Rallis India has announced plans to invest between 200 to 270 million rupees in setting up a solar power plant. This capital expenditure demonstrates the company's commitment to renewable energy and potentially aims to reduce long-term energy costs.",
            "Sentiment": "positive",
            "PublishDate": 1737123734000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rallis India: Q3 Profit Plunges 54.2%, Misses Estimates",
            "Summary": "Rallis India's Q3 FY25 net profit fell 54.2% to Rs 11 crore, below analyst estimates of Rs 29 crore. Revenue decreased 12.71% to Rs 522 crore. Domestic business saw volume growth, while exports faced headwinds with a 38% de-growth. Seeds business revenue slightly declined to Rs 30 crore.",
            "Sentiment": "negative",
            "PublishDate": 1737118945000,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Rallis India, a subsidiary of Tata Chemicals, has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 440 million rupees from 620 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 8.43% from 10.37% year-over-year, indicating a contraction in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1737116129000,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India Reports Q3 Financial Results",
            "Summary": "Rallis India has announced its financial results for the third quarter. The company reported a net profit of 110 million rupees, which is lower compared to 240 million rupees in the same quarter last year (YoY). However, it shows a significant decrease from 980 million rupees in the previous quarter (QoQ). The revenue for Q3 stood at 5.2 billion rupees, down from 5.6 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1737116042000,
            "Source": "earnings"
        },
        {
            "Title": "Rallis India Schedules Board Meeting for Q3 Results",
            "Summary": "Rallis India has announced a board meeting scheduled for January 17 to consider and approve the company's financial results for the third quarter of the current fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1736433947000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rallis India Reports Improved Q2 Financial Performance",
            "Summary": "<p>Rallis India, a subsidiary of Tata Chemicals, has announced its <span class='neutral'>Q2 financial results</span>. The company's <span class='neutral'>EBITDA</span> (Earnings Before Interest, Taxes, Depreciation, and Amortization) <span class='positive'>increased</span> to <b>1.7 billion rupees</b> from 1.33 billion rupees in the same quarter last year. Additionally, the <span class='neutral'>EBITDA margin</span> <span class='positive'>improved</span> to <b>17.89%</b> from 15.99% year-over-year.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728994869000,
            "Source": "result"
        },
        {
            "Title": "Rallis India Reports Q2 Revenue Growth",
            "Summary": "<p><span class='neutral'>Rallis India</span>, a subsidiary of <span class='neutral'>Tata Chemicals</span>, has reported its <b>Q2 revenue figures</b>. The company's revenue for the quarter stands at <span class='positive'>9.3 billion rupees</span>, showing an <span class='positive'>increase</span> from <span class='neutral'>8.32 billion rupees</span> <b>year-over-year (YoY)</b> and <span class='neutral'>7.83 billion rupees</span> <b>quarter-over-quarter (QoQ)</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728994858000,
            "Source": "result"
        },
        {
            "Title": "Rallis India Reports Q2 Net Profit Increase",
            "Summary": "<p><span class='neutral'>Rallis India</span>, a subsidiary of <span class='neutral'>Tata Chemicals</span>, has announced its <b>financial results</b> for the second quarter. The company's <span class='positive'>net profit</span> has <span class='positive'>risen</span> to <b>980 million rupees</b>, up from 820 million rupees in the same quarter last year (year-over-year). This also represents an <span class='positive'>increase</span> from 480 million rupees in the previous quarter (quarter-over-quarter).</p>",
            "Sentiment": "positive",
            "PublishDate": 1728994847000,
            "Source": "result"
        },
        {
            "Title": "Rallis India Schedules Q2 Results Board Meeting",
            "Summary": "<p><span class='neutral'>Rallis India</span> has announced that its <span class='neutral'>board of directors</span> will meet on <b>October 15</b> to consider and approve the company's <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728311126000,
            "Source": "corporate_action"
        }
    ]
}