{
    "Symbol": "RAMASTEEL",
    "ISIN": "INE230R01035",
    "News": [
        {
            "Title": "Rama Steel Tubes Appoints New Director, Issues Shares",
            "Summary": "Rama Steel Tubes Limited appointed Rakesh Chaturvedi as Additional Executive Director and approved issuance of 15.35 crore equity shares at ₹10.25 per share for acquiring 21.62% stake in Automech Group.",
            "Sentiment": "positive",
            "PublishDate": 1768913497111,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rama Steel Tubes Executive Director Resigns",
            "Summary": "Rama Steel Tubes Ltd announces resignation of Executive Director Mr. Hari Shankar Singh effective January 08, 2026, citing personal reasons for his immediate departure from the whole-time director position.",
            "Sentiment": "neutral",
            "PublishDate": 1767874402377,
            "Source": "stocks"
        },
        {
            "Title": "Rama Steel Tubes Q3 volumes rise 14%; nine-month volumes surge 23%",
            "Summary": "Rama Steel Tubes reported Q3FY26 sales volume of 58,974.55 tonnes, up 14% YoY. Nine-month volumes increased 23% to 1,71,935.78 tonnes, driven by steady demand for structural steel products.",
            "Sentiment": "positive",
            "PublishDate": 1767338442639,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rama Steel Tubes Credit Rating Placed on Watch",
            "Summary": "ICRA places Rama Steel Tubes' ₹110 crore bank facilities on rating watch with developing implications following board approval of ₹728 crore UAE acquisition of Automech Group.",
            "Sentiment": "neutral",
            "PublishDate": 1766232675489,
            "Source": "stocks"
        },
        {
            "Title": "Rama Steel Tubes Acquires UAE's Automech Group",
            "Summary": "Rama Steel Tubes Limited announces ₹728 crore acquisition of Automech Group, expecting consolidated revenue to rise over 113% to ₹2,200 crores by FY27E with EBITDA margins improving from 4% to 10%.",
            "Sentiment": "positive",
            "PublishDate": 1765461111544,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rama Steel Tubes Approves AED 36 Million Investment and AED 10 Million Loan to UAE Subsidiary",
            "Summary": "Rama Steel Tubes Limited's board approved further investment of AED 36 million in its wholly-owned UAE subsidiary RST International Trading FZE through share acquisition, along with a working capital loan of AED 10 million at 8% annual interest. The equity infusion will support the subsidiary's expansion plans and business opportunities, while the 2-year loan will strengthen liquidity for day-to-day operations.",
            "Sentiment": "positive",
            "PublishDate": 1764078259100,
            "Source": "corporate_action"
        },
        {
            "Title": "ICRA Downgrades Rama Steel Tubes' Credit Rating Due to Weak Operating Performance",
            "Summary": "ICRA Limited downgraded Rama Steel Tubes Limited's credit rating to ICRA BB (Stable) from ICRA BBB- (Stable) for Rs. 110 crore bank facilities, citing weaker-than-expected operating performance in H1 FY2026. The company's operating margins dropped to 1.1% in H1 FY2026 from earlier expectations of 3% recovery, with interest coverage ratio declining to 1.0 times from 2.5 times in FY2025.",
            "Sentiment": "negative",
            "PublishDate": 1764052091911,
            "Source": "stock"
        },
        {
            "Title": "Rama Steel Tubes Reports No Deviation in Rs 87.50 Crore Fund Utilization for Quarter Ended September 2025",
            "Summary": "Rama Steel Tubes Limited received monitoring agency clearance from Brickwork Ratings showing no deviation from stated objectives in utilizing Rs 87.50 crore raised through private placement of equity shares. The funds, intended for business expansion through acquisitions, remain deposited in fixed deposits with Axis Bank at 5.90% interest rate, with the company still evaluating acquisition opportunities.",
            "Sentiment": "neutral",
            "PublishDate": 1763145222158,
            "Source": "corporate_action"
        },
        {
            "Title": "Rama Steel Tubes Reports Quarterly Results and Allots 7.77 Crore Equity Shares",
            "Summary": "Rama Steel Tubes Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025, showing consolidated revenue of ₹20,022 lakhs and net profit of ₹606 lakhs for the quarter. The company allotted 7,77,77,778 equity shares at ₹11.28 per share to non-promoter investors on a preferential basis during the quarter, raising significant capital for business operations.",
            "Sentiment": "positive",
            "PublishDate": 1763144285952,
            "Source": "earnings"
        },
        {
            "Title": "Rama Steel Tubes Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Rama Steel Tubes reported Q2 revenue of 3.2B rupees versus 2.6B rupees year-over-year, with EBITDA rising to 49M rupees from 5.8M rupees and margin improving to 1.53% from 0.22%. However, consolidated net profit declined to 14M rupees from 40M rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1763129272958,
            "Source": "earnings"
        },
        {
            "Title": "Rama Steel Tubes Reports Strong Sales Volume Growth in Q2 and First Half of FY26",
            "Summary": "Rama Steel Tubes reported sales volume of 112,961.24 tons for the first six months of FY26, representing a 28% year-over-year increase. The company's Q2 FY26 sales volume reached 62,742.97 tons, showing growth of 23% year-over-year and 25% quarter-over-quarter. The performance indicates consistent volume expansion across both quarterly and half-yearly periods.",
            "Sentiment": "positive",
            "PublishDate": 1759474668602,
            "Source": "stock"
        },
        {
            "Title": "Rama Steel Allots 77.78 Crore Equity Shares at Rs 11.25 Each to Two Non-Promoter Entities",
            "Summary": "Rama Steel's Acquisition and Allotment Committee approved the allotment of 7,77,77,778 equity shares at Rs 11.25 per share on a preferential basis to two non-promoter entities. EBISU GLOBAL OPPORTUNITIES FUND LIMITED received 4,00,00,000 shares (2.44% stake) and PINE OAK GLOBAL FUND received 3,77,77,778 shares (2.31% stake). The allotment follows shareholder approval through EGM on June 18, 2025 and in-principle approval from BSE and NSE dated September 08, 2025. The company's paid-up equity share capital increased to Rs 163,60,40,979 divided into 163,60,40,979 equity shares of face value Rs 1 each. The new equity shares will rank pari-passu with existing equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1758627123929,
            "Source": "corporate_action"
        },
        {
            "Title": "Rama Steel Tubes Board Approves Re-appointment of Independent Director for Second Term",
            "Summary": "Rama Steel Tubes Limited's Board of Directors approved the re-appointment of Mr. Jai Prakash Gupta as Non-Executive, Independent Director for a second term of 5 consecutive years, effective September 04, 2025. The decision was made during a board meeting held on August 25, 2025, based on recommendations from the Nomination and Remuneration Committee. The re-appointment is subject to shareholder approval. The Board also approved a revised 51st AGM Notice to include this re-appointment as an additional agenda item. Mr. Gupta holds a Diploma in Mechanical Engineering and has over 30 years of experience in the steel pipe industry, including 30 years at Jindal Pipes Limited. He is not related to any other directors of the company and is not debarred from holding directorship positions.",
            "Sentiment": "neutral",
            "PublishDate": 1756122852579,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rama Steel Tubes Reports Q1 FY2026 Results, Announces Leadership Changes and Upcoming AGM",
            "Summary": "Rama Steel Tubes Limited's Board approved quarterly financial results for the quarter ended June 30, 2025, showing standalone revenue of ₹242.67 crores and profit after tax of ₹64.46 crores. The company accepted the resignation of Company Secretary Manish Kumar and appointed Vikas Sharma as the new Company Secretary & Compliance Officer. The Board also appointed Hari Shankar Singh as Additional Executive Director and approved the re-appointment of Naresh Kumar Bansal as Managing Director for five years from October 1, 2025. Additionally, the company appointed new auditors including Arun Kumar Gupta & Associates as Secretarial Auditor for five years, and re-appointed internal and cost auditors for 2025-26. The 51st Annual General Meeting is scheduled for September 30, 2025, with the cut-off date for voting set as September 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755013109934,
            "Source": "earnings"
        },
        {
            "Title": "Rama Steel Tubes Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Rama Steel Tubes reported quarterly results showing revenue growth to 2.7 billion rupees from 2.2 billion rupees year-over-year. However, the company experienced a significant decline in profitability metrics. EBITDA dropped to 16 million rupees from 114 million rupees, while EBITDA margin compressed to 0.59% from 5.28%. Consolidated net profit decreased to 53 million rupees from 64 million rupees compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1755009760872,
            "Source": "earnings"
        },
        {
            "Title": "Rama Steel Tubes Corrects Renewable Energy Purchase Allocation to ₹177.30 Crores",
            "Summary": "Rama Steel Tubes has issued a correction regarding its allocation for renewable energy purchase. The company has stated that the correct amount allocated for this purpose is ₹177.30 crores. This correction suggests that there was a previous miscommunication or error in the reported figures for the company's renewable energy investment.",
            "Sentiment": "neutral",
            "PublishDate": 1751895865000,
            "Source": "default"
        },
        {
            "Title": "Rama Steel Tubes: Joint Venture in 225-MW Solar Project Boosts Share Price",
            "Summary": "Rama Steel Tubes Ltd. shares surged nearly 13% after announcing a joint venture partnership in a 225-MW solar power project under India's PM-KUSUM scheme. The company holds a 10% equity stake in Onix IPP, the project's Special Purpose Vehicle. Power Purchase Agreements have been signed with Maharashtra State Electricity Distribution Company Limited at Rs 3.10 per unit for 25 years.",
            "Sentiment": "positive",
            "PublishDate": 1749189083000,
            "Source": "corporate_action"
        },
        {
            "Title": "RAMA Steel Tubes Enters Renewable Energy Market",
            "Summary": "RAMA Steel Tubes has announced its entry into the renewable energy market by acquiring an interest in a 225 MW PM-KUSUM solar power initiative. This move marks the company's expansion into the solar energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1749111419000,
            "Source": "default"
        },
        {
            "Title": "Rama Steel Tubes Reports Q4 EBITDA Decline",
            "Summary": "Rama Steel Tubes has reported its quarterly results. The company's Q4 EBITDA decreased to 121 million rupees from 136 million rupees in the same quarter last year. The EBITDA margin also declined to 4.12% from 5.05% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748607965000,
            "Source": "result"
        },
        {
            "Title": "Rama Steel Tubes Reports Q4 Financial Results",
            "Summary": "Rama Steel Tubes has announced its quarterly financial results. The company's consolidated net profit for Q4 is 68 million rupees, compared to 71 million rupees year-over-year and 55 million rupees quarter-over-quarter. The Q4 revenue stands at 2.9 billion rupees, up from 2.68 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748607914000,
            "Source": "result"
        },
        {
            "Title": "Rama Steel Tubes Exits Joint Venture with PIR Panchal Constructions",
            "Summary": "Rama Steel Tubes has approved the decision to exit from its joint venture with PIR Panchal Constructions. This strategic move indicates a significant change in the company's business partnerships and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1744199839000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rama Steel Tubes Reports 14% Increase in Quarterly Volume",
            "Summary": "Rama Steel Tubes has announced a 14% year-over-year increase in its quarterly volume. This growth indicates improved performance and potentially stronger demand for the company's products.",
            "Sentiment": "positive",
            "PublishDate": 1743664668000,
            "Source": "result"
        },
        {
            "Title": "Rama Steel Tubes Reports Significant Decline in Q3 EBITDA",
            "Summary": "Rama Steel Tubes has reported a substantial decrease in its Q3 EBITDA, which fell to 50 million rupees from 174 million rupees in the same quarter last year. The company's EBITDA margin also contracted sharply, dropping to 1.81% from 6.64% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739538199000,
            "Source": "earnings"
        },
        {
            "Title": "Rama Steel Tubes Reports Q3 Financial Results",
            "Summary": "Rama Steel Tubes announced its Q3 consolidated net profit of 55 million rupees, showing a decrease from 92 million rupees year-over-year. However, it increased from 41 million rupees quarter-over-quarter. The company's Q3 revenue rose to 2.75 billion rupees from 2.6 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739538126000,
            "Source": "earnings"
        },
        {
            "Title": "Government Enforces Quality Control on Stainless Steel Pipes and Tubes",
            "Summary": "The Indian government has issued an order implementing quality control measures for stainless steel pipes and tubes. This regulation mandates that these products must meet Indian standards and display the Bureau of Indian Standards (BIS) mark, ensuring compliance with national quality benchmarks.",
            "Sentiment": "positive",
            "PublishDate": 1739331768000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rama Steel Tubes: Penny Stock Surges 1,800% in Five Years",
            "Summary": "Rama Steel Tubes' shares have risen from ₹0.65 to ₹12.35 over the past five years, marking a 1,800% gain. The company reported increased sales volume, expanded product range, and plans to increase total installed capacity to 500,000 metric tonnes by FY 2025-26. It's diversifying into solar energy and defense sectors, with a growing retail shareholder base.",
            "Sentiment": "positive",
            "PublishDate": 1737529550000,
            "Source": "normal_news"
        },
        {
            "Title": "Rama Steel Tubes Reports 10% Increase in Quarterly Volume",
            "Summary": "Rama Steel Tubes has announced a 10% year-over-year increase in its quarterly volume. This growth indicates improved performance and potentially stronger demand for the company's products in the recent quarter compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1735802026000,
            "Source": "result"
        },
        {
            "Title": "Rama Steel Tubes to Acquire 25% Stake in Bigwin Buildsys Coated",
            "Summary": "Rama Steel Tubes has announced plans to acquire a 25% stake in Bigwin Buildsys Coated Private Limited. This strategic acquisition is aimed at diversifying the company's business into green energy solutions, with a specific focus on solar structures.",
            "Sentiment": "positive",
            "PublishDate": 1733819139000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rama Steel Tubes Incorporates New Subsidiary in Renewable Energy Sector",
            "Summary": "Rama Steel Tubes has announced the incorporation of a new subsidiary named 'Onix IPP Private Limited'. This new unit will operate in the green energy/renewable energy industry, marking the company's expansion into the sustainable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1733120634000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rama Steel Tubes Reports Significant Drop in Q2 EBITDA",
            "Summary": "Rama Steel Tubes experienced a substantial decline in its Q2 EBITDA, falling to 6.7 million rupees from 121 million rupees in the same quarter last year. The company's EBITDA margin also decreased sharply, dropping to 0.26% from 5.98% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731588331000,
            "Source": "result"
        },
        {
            "Title": "Rama Steel Tubes Reports Q2 Revenue Increase",
            "Summary": "Rama Steel Tubes has announced its Q2 revenue, which stands at 2.6 billion rupees, compared to 2.03 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731588154000,
            "Source": "result"
        },
        {
            "Title": "Rama Steel Tubes Reports Q2 Consolidated Net Profit",
            "Summary": "Rama Steel Tubes has reported a consolidated net profit of 40 million rupees for the second quarter, compared to 62 million rupees in the same quarter last year, representing a year-over-year decline. However, the profit has increased from 63.5 million rupees in the previous quarter, showing a quarter-over-quarter improvement.",
            "Sentiment": "neutral",
            "PublishDate": 1731588116000,
            "Source": "result"
        },
        {
            "Title": "Rama Steel Tubes Acquires Stake in Green Energy Company",
            "Summary": "Rama Steel Tubes has acquired a 40% stake in Oram Green Energy Limited, a related party. This acquisition marks the company's expansion into the green energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1730182993000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rama Steel Tubes: Q2 Sales Volume Surges 42%, Stock Dips",
            "Summary": "<p><span class='positive'>Rama Steel Tubes</span> reported Q2FY25 sales volume of <b>50,921.67 tons</b>, <span class='positive'>up 42.32% YoY and 36.28% QoQ</span>. H1FY25 sales volume reached <b>88,287.22 tons</b>, a <span class='positive'>4.83% increase</span> from last year. Despite <span class='positive'>strong performance</span>, the stock was <span class='negative'>down 4.83%</span> at ₹13.59 on NSE.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728291883000,
            "Source": "result"
        },
        {
            "Title": "Rama Steel Tubes Approves Incorporation of Associate Company",
            "Summary": "<p><span class='neutral'>Rama Steel Tubes</span> has approved the <b>incorporation</b> of an <span class='positive'>associate company</span>. This decision represents a <span class='positive'>significant corporate action</span> that could potentially <span class='positive'>expand</span> the company's operations or business interests.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727967056000,
            "Source": "corporate_action"
        }
    ]
}