{
    "Symbol": "RAMAPHO",
    "ISIN": "INE809A01032",
    "News": [
        {
            "Title": "Rama Phosphates Renews FY26 SSP Contract with HURL",
            "Summary": "Rama Phosphates announces contract renewal with Hindustan Urvarak & Rasayan Limited for FY26, strengthening revenue stability and enhancing business prospects in the fertilizer sector.",
            "Sentiment": "positive",
            "PublishDate": 1768402114092,
            "Source": "stocks"
        },
        {
            "Title": "Rama Phosphates Reappoints Independent Director",
            "Summary": "Rama Phosphates Limited's board approved the re-appointment of Mr. Ratneshwar Prasad as Non-Executive Independent Director for a second five-year term starting May 30, 2026, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1768385563292,
            "Source": "stocks"
        },
        {
            "Title": "Rama Phosphates Q3FY26: Net Profit Soars 283% to ₹140.26 Cr",
            "Summary": "Rama Phosphates delivered exceptional Q3FY26 performance with net profit surging 283% YoY to ₹140.26 crores, revenue growing 32% to ₹237.99 crores, and EBITDA margin expanding significantly.",
            "Sentiment": "positive",
            "PublishDate": 1768384293425,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rama Phosphates Gets Credit Rating Outlook Upgrade",
            "Summary": "ICRA upgrades Rama Phosphates' credit outlook from negative to stable while reaffirming A- rating on ₹136 crore facilities across fund-based and non-fund based limits.",
            "Sentiment": "positive",
            "PublishDate": 1766737429971,
            "Source": "stocks"
        },
        {
            "Title": "Rama Phosphates Shareholders Approve Employee Stock Option Plan Through Postal Ballot",
            "Summary": "Rama Phosphates Limited shareholders approved two resolutions through postal ballot voting that concluded on November 26, 2025, establishing an Employee Stock Option Plan 2025 for company employees and extending it to subsidiary and associate company employees. The resolutions received requisite majority approval with promoter and promoter group holding 26,539,388 shares (99.99% of their holdings) voting in favor of both proposals.",
            "Sentiment": "positive",
            "PublishDate": 1764324480784,
            "Source": "corporate_action"
        },
        {
            "Title": "Rama Phosphates Seeks Shareholder Approval for Employee Stock Option Plan 2025",
            "Summary": "Rama Phosphates Limited has issued a postal ballot notice seeking shareholder approval for two special resolutions related to its Employee Stock Option Plan 2025. The first resolution seeks approval for the Rama ESOP 2025 for eligible employees of the company, while the second resolution seeks to extend the plan to employees of subsidiary and associate companies. The plan allows for up to 9,00,000 stock options convertible into equivalent equity shares with a face value of Rs. 5 each. Options will vest between 1-2 years from grant date, with an exercise period of 6 months from vesting. The exercise price will be based on closing market price prior to grant, but not less than face value. Remote e-voting will commence on October 28, 2025 at 9:00 AM and conclude on November 26, 2025 at 5:00 PM, with October 17, 2025 as the cut-off date for eligible voters. The plan aims to reward employee loyalty, motivate performance, and create ownership participation among staff.",
            "Sentiment": "positive",
            "PublishDate": 1761561144738,
            "Source": "corporate_action"
        },
        {
            "Title": "Rama Phosphates Reports 460% Jump in Q2 Net Profit, Declares Interim Dividend",
            "Summary": "Rama Phosphates Ltd reported a net profit of ₹1,728.34 lakhs for Q2 2025, representing a significant increase from ₹308.40 lakhs in Q2 2024. For the half-year period, net profit rose to ₹3,331.66 lakhs compared to ₹987.03 lakhs in the previous year. Revenue from operations increased to ₹24,565.73 lakhs in Q2 2025 from ₹20,945.61 lakhs in Q2 2024. The Board declared a first interim dividend of ₹0.50 per equity share for FY 2025-2026, payable on November 25, 2025. The company also approved an Employee Stock Option Plan 2025 covering up to 9,00,000 options. Promoters holding 26,539,512 equity shares have waived their right to receive the interim dividend. The company operates in fertilizers, micro nutrients, chemicals, and soya/agri segments, with the fertilizer segment contributing the majority of revenue.",
            "Sentiment": "positive",
            "PublishDate": 1760444895336,
            "Source": "earnings"
        },
        {
            "Title": "Rama Phosphates Extends Nimbahera Plant Lease and Increases Manufacturing Capacity",
            "Summary": "Rama Phosphates has extended the lease for its Nimbahera plant by five years, with the new lease period running from December 09, 2026, to December 08, 2031. The company has also increased the manufacturing capacity of the plant to 6.98 lacs MTPA (metric tonnes per annum).",
            "Sentiment": "positive",
            "PublishDate": 1759737192419,
            "Source": "stock"
        },
        {
            "Title": "Rama Phosphates Targets Over ₹1,000 Crore Revenue Through Plant Expansion and Product Diversification",
            "Summary": "Rama Phosphates is pursuing a revenue target of over ₹1,000 crore through expansion of its Dhule plant operations. The company is launching a new product called Urosuper and diversifying its product portfolio to include industrial chemicals. Additionally, the company is implementing technology-driven farmer engagement initiatives as part of its sustainable growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1753287852863,
            "Source": "stock"
        },
        {
            "Title": "Rama Phosphates Reports 13x Jump in Quarterly Profit to Rs 1,603 Lakhs",
            "Summary": "Rama Phosphates Limited reported substantial growth in quarterly results ended June 30, 2025. The company posted a profit from operations of Rs 2,146.32 lakhs compared to Rs 160.68 lakhs in the same quarter last year. Net profit after tax surged to Rs 1,603.32 lakhs from Rs 168.16 lakhs in the previous year quarter. Revenue from operations increased to Rs 19,031.35 lakhs from Rs 15,369.48 lakhs. The company operates in two segments - Fertilizers, Micro Nutrients & Chemicals, and Soya/Agri. Basic and diluted earnings per share rose to Rs 4.53 from Rs 0.48. The company has received environmental clearance for a new Greenfield project at Dhule to manufacture SSP Fertilizer and Sulphuric Acid, with trial production expected to commence in the fourth quarter of FY 2026.",
            "Sentiment": "positive",
            "PublishDate": 1753272556066,
            "Source": "earnings"
        },
        {
            "Title": "Rama Phosphates Reports Q4 Profit Turnaround",
            "Summary": "Rama Phosphates has reported a net profit of 52 million rupees in Q4, compared to a loss of 26 million rupees in the same quarter last year. This represents a significant turnaround for the company. The profit also increased from 37 million rupees in the previous quarter. Revenue for Q4 grew to 2 billion rupees from 1.86 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747267808000,
            "Source": "default"
        },
        {
            "Title": "RAMA PHOSPHATES Reports Strong Q4 Financial Performance",
            "Summary": "RAMA PHOSPHATES has reported significant improvements in its Q4 financial results. The company's EBITDA increased to 174 million rupees from 2 million rupees year-over-year, with EBITDA margin rising to 8.65% from 0.10%. Net profit for Q4 reached 52 million rupees, compared to a loss of 26 million rupees in the previous year and a profit of 37 million rupees in the previous quarter. Revenue for Q4 grew to 2 billion rupees from 1.86 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747232166000,
            "Source": "result"
        },
        {
            "Title": "Rama Phosphates Reports Significant EBITDA Improvement in Q3",
            "Summary": "Rama Phosphates has reported a substantial turnaround in its Q3 EBITDA performance. The company achieved an EBITDA gain of 101 million rupees, compared to a loss of 324 million rupees in the same quarter of the previous year. Additionally, the Q3 EBITDA margin was reported at 5.62%.",
            "Sentiment": "positive",
            "PublishDate": 1739438106000,
            "Source": "earnings"
        },
        {
            "Title": "Rama Phosphates Reports Profit in Q3 FY2024, Revenue Grows",
            "Summary": "Rama Phosphates has reported a net profit of 37 million rupees in the third quarter, compared to a loss of 297 million rupees in the same quarter last year. The company's revenue increased to 1.79 billion rupees from 1.16 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739438006000,
            "Source": "earnings"
        }
    ]
}