{
    "Symbol": "RAMCOCEM",
    "ISIN": "INE331A01037",
    "News": [
        {
            "Title": "Ramco Cements Boosts Ariyalur Plant Capacity to 5.5 MTPA",
            "Summary": "The Ramco Cements Limited enhances cement grinding capacity at Ariyalur Plant from 3.5 MTPA to 5.5 MTPA through de-bottlenecking, with additional expansion plans across multiple facilities targeting 31.14 MTPA cement capacity by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1770643833355,
            "Source": "stocks"
        },
        {
            "Title": "Ramco Cements Q3FY26 Net Profit Surges 19% YoY",
            "Summary": "Ramco Cements reported strong Q3FY26 results with net profit rising 19% YoY to Rs. 386.91 crores, driven by exceptional gains from land sales worth Rs. 505.62 crores despite revenue declining 6% to Rs. 2,101.46 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770641569487,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramco Cements Gets Quartzite Mining Approval Till 2053",
            "Summary": "Ramco Cements received Andhra Pradesh government approval to include quartzite mineral in existing limestone mining lease, valid until March 10, 2053, for manufactured sand and cement additives.",
            "Sentiment": "positive",
            "PublishDate": 1767581722731,
            "Source": "stocks"
        },
        {
            "Title": "Ramco Cements Sells Assets Worth ₹514.90 Crores",
            "Summary": "Ramco Cements completes asset disposal to Prestige Estates Projects on December 22, 2025, exceeding ₹1,000 crores target with total disposals reaching ₹1,016.92 crores. Company plans additional ₹200 crores disposal by February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766396783969,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramco Cements Gets Credit Rating Reaffirmation",
            "Summary": "ICRA reaffirms AA+(Stable) rating on ₹1,300 cr NCDs and assigns new ₹500 cr debenture rating for Ramco Cements on December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766143002372,
            "Source": "stocks"
        },
        {
            "Title": "Ramco Cements' HardWorker Brand Wins Twin Golds",
            "Summary": "The Ramco Cements Limited's construction chemicals brand HardWorker secured two Gold awards at the ET Brand Equity Shark Awards 2025-South Chapter for its innovative marketing campaigns.",
            "Sentiment": "positive",
            "PublishDate": 1765781906763,
            "Source": "stocks"
        },
        {
            "Title": "Ramco Cements Faces Tax Appeals Worth Rs. 11.11 Crores at Madras High Court",
            "Summary": "The Income Tax Department has filed appeals against Ramco Cements at Madras High Court for assessment year 2011-12, disputing Rs. 7.35 crores related to revenue expenditure treated as capital expenditure and Rs. 3.76 crores concerning industrial promotion assistance classification. The company also has similar pending disputes totaling Rs. 29.20 crores at the High Court level.",
            "Sentiment": "negative",
            "PublishDate": 1763452108508,
            "Source": "stock"
        },
        {
            "Title": "Ramco Cements Faces Tax Appeals Worth Rs. 17.82 Crores at Madras High Court",
            "Summary": "The Income Tax Department has filed appeals against Ramco Cements at Madras High Court for assessment year 2015-16, challenging tribunal orders on revenue expenditure classification and industrial promotion assistance treatment. The disputed tax amounts total Rs. 17.82 crores across two issues, with the appeals admitted by the court on 17/11/2025, adding to existing similar disputes worth Rs. 29.20 crores.",
            "Sentiment": "negative",
            "PublishDate": 1763451844055,
            "Source": "stock"
        },
        {
            "Title": "Ramco Cements Reports 187% Jump in Profit Before Tax for Q2FY26 Despite Volume Decline",
            "Summary": "The Ramco Cements Limited reported a profit before tax of ₹100.24 crores for Q2FY26, marking a 187% increase compared to ₹34.97 crores in Q2FY25. Revenue grew 9% year-on-year to ₹2,049.50 crores. However, cement sales volume remained flat at 44.00 lakh tons compared to 44.02 lakh tons in Q2FY25. The company's capacity utilization improved to 68% from 65% in the previous year quarter. EBITDA increased 22% to ₹323.39 crores with margins at 16%. Average cement prices improved 7% year-on-year but declined 3% sequentially. The company benefited from 48% green power usage in Q2FY26 versus 39% in Q2FY25, leading to reduced power costs. Raw material costs increased due to mineral bearing land tax levy of ₹160 per ton of limestone in Tamil Nadu, impacting costs by ₹40 crores for the quarter. The company unveiled 'Hard Worker' as the new brand identity for its construction chemicals product range and plans to achieve 30 MTPA cement capacity by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762362768661,
            "Source": "earnings"
        },
        {
            "Title": "The Ramco Cements Reports Strong Q2 Performance with Net Profit Surging to 743.1M Rupees",
            "Summary": "The Ramco Cements delivered robust quarterly results with net profit increasing significantly to 743.1 million rupees compared to 255.8 million rupees in the same period last year. Revenue grew to 22.34 billion rupees from 20.38 billion rupees year-over-year. EBITDA rose to 3.87 billion rupees versus 3.12 billion rupees previously, while EBITDA margin improved to 17.31% from 15.31% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1762349048777,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Cements Reports Q2 Results and Approves Subsidiary Merger",
            "Summary": "The Ramco Cements Limited announced quarterly results for the period ended September 30, 2025, with standalone revenue from operations of Rs. 2,234.84 crores and net profit after tax of Rs. 74.31 crores. The company's Board of Directors approved a draft scheme of amalgamation of Ramco Windfarms Limited, its wholly owned subsidiary, with the parent company. The merger aims to consolidate wind power generation assets with actual power consumption, simplify corporate structure, and reduce administrative costs. Upon scheme implementation, all assets and liabilities of Ramco Windfarms will transfer to Ramco Cements without issuing new shares or cash payment. The auditors expressed an unmodified opinion on the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762347510823,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Cements Block Trade Worth Rs. 50.87 Crores Executed on NSE",
            "Summary": "The Ramco Cements Ltd. executed a block trade on the National Stock Exchange worth Rs. 50.87 crores. The transaction involved approximately 503,845 shares at a price of Rs. 1,009.55 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1759817912034,
            "Source": "order&deals"
        },
        {
            "Title": "Ramco Cements Wins AI Awards 2025 for Excellence in Innovative AI Solutions",
            "Summary": "Ramco Cements Ltd received the AI Awards 2025 from the Confederation of Indian Industry (CII) in the Innovative Category for Excellence in Best AI Solution Showcase. The award recognizes the company's use of artificial intelligence in driving operational excellence, digital innovation, and sustainable growth across its business ecosystem. The award was presented at the AI Forum 2025 by a jury panel comprising leaders from industry and technology.",
            "Sentiment": "positive",
            "PublishDate": 1757054947481,
            "Source": "stock"
        },
        {
            "Title": "Ramco Cements Launches 8 MW Waste Heat Recovery System, Boosts Total Power Capacity to 53.15 MW",
            "Summary": "The Ramco Cements has launched an 8 MW waste heat recovery system at its Ramasamy Raja Nagar plant. This expansion increases the company's waste heat power generation capacity from 2 MW to 10 MW. The company's total power capacity has grown from 45.15 MW to 53.15 MW following this addition.",
            "Sentiment": "positive",
            "PublishDate": 1756972336834,
            "Source": "stock"
        },
        {
            "Title": "Ramco Cements Targets Revenue Doubling to Rs 16,000 Crore in 4-5 Years",
            "Summary": "Ramco Cements announced ambitious growth plans targeting revenues of Rs 16,000 crore over the next four to five years, nearly doubling from Rs 8,539 crore in FY25. The company plans to expand cement production capacity to 30 million tonnes by March-June 2026 with an investment of Rs 1,000 crore at its Kurnool plant in Andhra Pradesh. The expansion aims to help achieve revenues of Rs 15,000-16,000 crore. Ramco also launched 'Hard Worker', a new construction chemicals brand featuring 20 specialized products including tile adhesives and waterproofing solutions. The company targets Rs 2,000 crore revenue from this division over four to five years, up from Rs 210 crore in FY25. Ramco operates 11 cement plants with 24.44 MnTPA cement capacity and closed FY25 with revenues over Rs 8,500 crore and profits of Rs 417 crore. Shares ended flat at Rs 1,083.10 on Tuesday.",
            "Sentiment": "positive",
            "PublishDate": 1755662606387,
            "Source": "stock"
        },
        {
            "Title": "Ramco Cements Launches 'Hard Worker' Brand for Construction Chemicals, Targets ₹2,000 Cr Revenue in 5 Years",
            "Summary": "The Ramco Cements Limited announced the launch of 'Hard Worker', a new brand identity for its construction chemicals product portfolio. The range includes 20 specialized products such as tile adhesives, waterproofing solutions, bonding agents, and repair mortars, all manufactured in-house at Ramco's facilities. The products are available across Tamil Nadu, Kerala, Karnataka, Andhra Pradesh, Odisha, and West Bengal through Ramco's dealer network. The Construction Chemicals division generated ₹210 crores revenue in FY25, with the company targeting ₹2,000 crores in the next 4-5 years, representing a 10X growth target. Managing Director P.R. Venketrama Raja stated that Hard Worker reinforces their commitment to delivering application-specific solutions. CEO A.V. Dharmakrishnan mentioned plans to expand to 40 products total and become a pan-India player, transforming from a cement manufacturer to a complete construction solution provider. A nationwide 360-degree marketing campaign will be launched spanning TV, digital, outdoor, and in-store branding. The company operates with annual revenue of approximately ₹8,500 crores in FY25 and has 11 cement plants with extensive dealer network of 9,700+ dealers and 24,000+ sub-dealers across India.",
            "Sentiment": "positive",
            "PublishDate": 1755596968379,
            "Source": "stock"
        },
        {
            "Title": "Ramco Cements Resolves Legal Dispute Worth Rs. 1.11 Crores on CENVAT Credit Issue",
            "Summary": "The Ramco Cements Limited has successfully resolved a legal dispute regarding the disallowance of CENVAT Credit on Outward Freight. The company's appeal before CESTAT was remanded back to the Original Authority, the Assistant Commissioner of GST and Central Excise, Villupuram. The Original Authority subsequently dropped further proceedings through an order dated August 11, 2025, resolving the issue worth Rs. 1.11 Crores. Additionally, the company reported that similar pending disputes with different statutory authorities have been reduced from Rs. 8 Crores to Rs. 6.89 Crores.",
            "Sentiment": "positive",
            "PublishDate": 1754979510978,
            "Source": "stock"
        },
        {
            "Title": "Ramco Cements Q1FY26: EBITDA Rises 23% Despite 7% Volume Decline",
            "Summary": "The Ramco Cements reported mixed quarterly results with cement sales volume declining 7% to 4 million tons due to early monsoon rains in Kerala and completion of infrastructure projects in eastern markets. Despite lower volumes, EBITDA increased 23% to Rs. 404 crores driven by 5% improvement in cement prices. Revenue remained flat at Rs. 2,077 crores compared to Rs. 2,097 crores in the previous year. The company faced cost pressures from Tamil Nadu's mineral bearing land tax of Rs. 160 per ton of limestone, impacting costs by Rs. 30 crores. Cement capacity utilization dropped to 68% from 77% in the previous year. Construction chemicals business showed strong growth of 79% with sales volume reaching 1.2 lakh tons. Profit before tax more than doubled to Rs. 116 crores from Rs. 48 crores. The company incurred capex of Rs. 321 crores and plans to achieve 30 MTPA cement capacity by March 2026. Total debt stood at Rs. 4,734 crores with cost of debt improving to 7.64% from 7.92%.",
            "Sentiment": "neutral",
            "PublishDate": 1754574794692,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Cement Targets 30 MTPA Capacity by March 2026",
            "Summary": "Ramco Cement has set a target to achieve 30 million tonnes per annum (MTPA) production capacity by March 2026. The company views this capacity milestone as a foundation for its next phase of growth.",
            "Sentiment": "positive",
            "PublishDate": 1754573441289,
            "Source": "stock"
        },
        {
            "Title": "Ramco Cements Reports Strong Q1 Performance with 177% Jump in Net Profit, Approves Subsidiary Acquisition",
            "Summary": "The Ramco Cements Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported standalone net profit after tax of Rs. 86.01 crores compared to Rs. 30.99 crores in the previous quarter, representing a significant increase. Revenue from operations stood at Rs. 2,070.13 crores for the quarter. On a consolidated basis, net profit attributable to equity shareholders was Rs. 85.03 crores. The company's operating margin improved to 19% from 14% in the previous quarter, while net profit margin increased to 4% from 1%. The Board of Directors approved the acquisition of 28.50% equity stake in Ramco Windfarms Limited, its subsidiary, for Rs. 28.50 lakhs. This acquisition will make Ramco Windfarms a wholly owned subsidiary. The target company operates in electric power generation through windmills and had a turnover of Rs. 803.20 lakhs. The company's earnings per share increased to Rs. 3.64 from Rs. 1.31 in the previous quarter. Exceptional items for the quarter included profit on sale of surplus lands worth Rs. 10.83 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754572623702,
            "Source": "earnings"
        },
        {
            "Title": "The Ramco Cements Reports Strong Q1 Profit Growth Despite Revenue Decline",
            "Summary": "The Ramco Cements reported Q1 net profit of 860 million rupees, representing a significant increase from 355 million rupees in the same period last year. However, revenue declined to 20.7 billion rupees from 20.88 billion rupees year-over-year. The company's EBITDA improved to 3.98 billion rupees compared to 3.19 billion rupees previously, with EBITDA margin expanding to 19.23% from 15.3% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1754569553129,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Cements Opens Fifth Construction Chemical Plant in Odisha",
            "Summary": "Ramco Cements has opened its fifth construction chemical plant in Odisha. This expansion represents a significant development in the company's manufacturing capabilities and market presence in the construction chemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1752666995000,
            "Source": "default"
        },
        {
            "Title": "The Ramco Cements Reports Q4 Financial Results and Dividend",
            "Summary": "The Ramco Cements has reported its quarterly financial results. The company's Q4 net profit was 310 million rupees, compared to 1.21 billion rupees year-over-year and 3.25 billion rupees quarter-over-quarter. Q4 revenue stood at 23.9 billion rupees, down from 26.73 billion rupees in the same quarter last year. The company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747955866000,
            "Source": "default"
        },
        {
            "Title": "Ramco Cements: Q4 Profit Plunges 75%, Misses Estimates",
            "Summary": "Ramco Cements reported Q4 FY25 net profit of ₹31 crore, down 74.5% YoY. Revenue fell 10.5% to ₹2,392 crore. EBITDA decreased 23% to ₹320.8 crore. FY25 sales volume grew 1% to 18.5 million tonnes. Board proposed dividend of ₹2 per share.",
            "Sentiment": "negative",
            "PublishDate": 1747931419000,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Cements Reports Improved Cement Prices in Southern India",
            "Summary": "Ramco Cements has reported that average cement prices have improved in Southern India during the first two months of FY26. No specific figures or additional details were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747928184000,
            "Source": "default"
        },
        {
            "Title": "The Ramco Cements Reports Q4 Results and Dividend Recommendation",
            "Summary": "The Ramco Cements has reported its quarterly results. The company's Q4 EBITDA was 3.2 billion rupees, down from 4.2 billion rupees year-over-year. The EBITDA margin decreased to 13.42% from 15.6% in the same period last year. Net profit for Q4 was 310 million rupees, a significant decrease from 1.21 billion rupees year-over-year and 3.25 billion rupees quarter-on-quarter. Q4 revenue stood at 23.9 billion rupees, down from 26.73 billion rupees year-over-year. Additionally, the company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1747924901000,
            "Source": "result"
        },
        {
            "Title": "Ramco Cements Block Trade: 981,911 Shares at Rs. 950 Each",
            "Summary": "A block trade of 981,911 shares of The Ramco Cements Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 950 per share. The total value of the transaction amounted to Rs. 93.28 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1747034477000,
            "Source": "block_details"
        },
        {
            "Title": "Ramco Cements to Consider Fundraising via Debentures and Commercial Paper",
            "Summary": "The Board of Ramco Cements is scheduled to meet on April 25th to consider fundraising through the issuance of debentures and commercial paper. The company has clarified that there will be no increase in the borrowing limit.",
            "Sentiment": "neutral",
            "PublishDate": 1745310736000,
            "Source": "default"
        },
        {
            "Title": "Cement Price Hike in Southern India",
            "Summary": "Cement manufacturers in southern Indian states have implemented a significant price increase of Rs 40-50 per bag, effective immediately. This marks the first major price hike for cement in the region since April 2024.",
            "Sentiment": "positive",
            "PublishDate": 1744013948000,
            "Source": "normal_news"
        },
        {
            "Title": "Ramco Cements Realizes 4.55 Billion Rupees from Non-Core Asset Disposal",
            "Summary": "Ramco Cements has reported that it has realized 4.55 billion rupees from the disposal of non-core assets for the full fiscal year 2024-2025. This amount falls short of the company's target of 10 billion rupees for the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1743484386000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Cements Urges Tamil Nadu Government to Reconsider Mineral Bearing Land Tax",
            "Summary": "Ramco Cements has proposed to the Government of Tamil Nadu to reconsider its plan to implement a tax on mineral bearing land. This move by the company suggests a potential impact on its operations or financial outlook if such a tax were to be imposed.",
            "Sentiment": "neutral",
            "PublishDate": 1741859475000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ramco Cements Reports Significant Drop in Q3 Profit Before Tax",
            "Summary": "The Ramco Cements has reported a substantial decrease in its third-quarter Profit Before Tax (PBT), which fell to 44 million rupees from 1.35 billion rupees in the same period last year. The company also disclosed an exceptional item amounting to 3.29 billion rupees, which likely impacted the financial results significantly.",
            "Sentiment": "negative",
            "PublishDate": 1738848236000,
            "Source": "earnings"
        },
        {
            "Title": "The Ramco Cements Reports Decline in Q3 EBITDA and Margin",
            "Summary": "The Ramco Cements has reported a decrease in its Q3 EBITDA, which fell to 2.8 billion rupees from 3.95 billion rupees year-over-year. The company's Q3 EBITDA margin also declined, dropping to 14.18% from 18.76% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738848231000,
            "Source": "earnings"
        },
        {
            "Title": "The Ramco Cements Reports Significant Increase in Q3 Net Profit",
            "Summary": "The Ramco Cements has announced its financial results for the third quarter. The company's net profit has substantially increased to 3.25 billion rupees, compared to 934 million rupees in the same quarter of the previous year. However, revenue for Q3 decreased to 19.77 billion rupees from 21.06 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738848226000,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Cements Increases Waste Heat Power Generation Capacity",
            "Summary": "Ramco Cements has expanded its waste heat power generating capacity from 43.15 MW to 45.15 MW, representing a 2 MW increase. This improvement in waste heat recovery demonstrates the company's commitment to energy efficiency and sustainable practices in cement production.",
            "Sentiment": "positive",
            "PublishDate": 1735645681000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Cements Expands Waste Heat Recovery Capacity",
            "Summary": "Ramco Cements has commissioned a 2 MW waste heat recovery turbine at its Alathiyur Cement Plant. This addition increases the plant's waste heat power capacity to 4 MW, demonstrating the company's commitment to energy efficiency and sustainable manufacturing practices.",
            "Sentiment": "positive",
            "PublishDate": 1735645676000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Cements Receives Advances for Land Sales",
            "Summary": "Ramco Cements has reported receiving advances totaling 10.30 crore rupees for ongoing land sales. This indicates that the company is in the process of divesting some of its land assets, which could potentially impact its financial position or strategic direction.",
            "Sentiment": "neutral",
            "PublishDate": 1735629570000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Cements Disposes Shares Worth ₹376 Crore",
            "Summary": "Ramco Cements has announced the disposal of shares it held in other companies, amounting to ₹376 crore. This move suggests a significant divestment strategy by the company, potentially to focus on core operations or to raise capital.",
            "Sentiment": "neutral",
            "PublishDate": 1735629517000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Cements Sells Land for ₹68 Crore",
            "Summary": "Ramco Cements has executed a sale agreement to dispose of certain lands for a consideration of ₹68 crore. This transaction represents a significant corporate action that may impact the company's assets and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1735629446000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Cements Reports Q2 EBITDA and Margin",
            "Summary": "Ramco Cements announced its Q2 financial results. The company's EBITDA was 3 billion rupees, down from 3.99 billion rupees year-over-year, but exceeding estimates of 2.6 billion rupees. The EBITDA margin was 15.31%, lower than the previous year's 17.11%, but higher than the estimated 12.6%.",
            "Sentiment": "neutral",
            "PublishDate": 1731328734000,
            "Source": "result"
        },
        {
            "Title": "Ramco Cements Reports Q2 Revenue Decline",
            "Summary": "The Ramco Cements has reported a revenue of 20.4 billion rupees for the second quarter, down from 23.3 billion rupees in the same period last year. The reported revenue is slightly below the estimated 20.55 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731328598000,
            "Source": "result"
        },
        {
            "Title": "Ramco Cements Reports Q2 Net Profit Decline",
            "Summary": "Ramco Cements announced its Q2 financial results, reporting a net profit of 255.8 million rupees, which is significantly lower than the 1 billion rupees reported in the same quarter last year. This result surpassed market expectations, as analysts had estimated a loss of 100 million rupees. Compared to the previous quarter, the profit increased from 355 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731328541000,
            "Source": "result"
        },
        {
            "Title": "Ramco Cements Ltd: Large Block Trade on NSE",
            "Summary": "<p>A <span class='neutral'>significant</span> <b>block trade</b> of <b>Ramco Cements Ltd</b> shares occurred on the <b>National Stock Exchange (NSE)</b>. Approximately <span class='neutral'>1,000,062 shares</span> were traded at a price of <span class='neutral'>Rs. 870.40</span> per share, totaling <span class='neutral'>Rs. 87.05 crores</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728898359000,
            "Source": "block_deals"
        },
        {
            "Title": "Ramco Cements Increases Cement Prices in Southern States",
            "Summary": "<p><span class=\"neutral\">Ramco Cements</span> has implemented a <span class=\"negative\">price increase</span> of <b>Rs 20-30 per 50kg bag</b> of cement in <span class=\"neutral\">Andhra Pradesh</span>, <span class=\"neutral\">Telangana</span>, and <span class=\"neutral\">Tamil Nadu</span>. The price hike is <span class=\"negative\">effective immediately</span>, as reported by <span class=\"neutral\">NDTV Profit</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727952435000,
            "Source": "corporate_action"
        }
    ]
}