{
    "Symbol": "RAMCOSYS",
    "ISIN": "INE246B01019",
    "News": [
        {
            "Title": "HDFC Mutual Fund Reduces Stake in Ramco Systems by 2.60%",
            "Summary": "HDFC Asset Management Company sold 9,74,596 shares of Ramco Systems through its Flexi Cap Fund on February 03, 2026, reducing total holding to 1.91% of paid-up equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1770374304669,
            "Source": "co_actions_results"
        },
        {
            "Title": "ST Engineering Partners with Ramco Systems for Aviation",
            "Summary": "ST Engineering has entered into a strategic agreement with Ramco Systems to collaborate on aviation solutions, marking a significant partnership in the aerospace technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1770283630289,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramco Systems Allots 28,322 Shares Under ESOP",
            "Summary": "Ramco Systems' board committee approved allotment of 28,322 equity shares under three employee stock option schemes, increasing paid-up capital from ₹37,41,19,250 to ₹37,44,02,470.",
            "Sentiment": "positive",
            "PublishDate": 1769615661773,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramco Systems Q3FY26 Results: Labour Code Impact",
            "Summary": "Ramco Systems reports Q3FY26 results with consolidated revenue of Rs.1,784.96 Mn. Labour Code implementation creates Rs.214.99 Mn exceptional charge, affecting profitability despite operational improvements.",
            "Sentiment": "negative",
            "PublishDate": 1769613787394,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramco Systems Wins Engine Maintenance Contract",
            "Summary": "Powerhouse Engines selects Ramco Systems for comprehensive engine maintenance transformation project, marking significant business development for the IT solutions provider.",
            "Sentiment": "positive",
            "PublishDate": 1766057961886,
            "Source": "stocks"
        },
        {
            "Title": "Ramco Systems Wins Powerhouse Engines MRO Contract",
            "Summary": "Ramco Systems secures contract to implement aviation software at Powerhouse Engines for engine MRO operations transformation, enhancing throughput and reducing turnaround time.",
            "Sentiment": "positive",
            "PublishDate": 1766053254678,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramco Systems Wins 4 Awards at HR Vendors of the Year 2025 for Payroll Solutions",
            "Summary": "Ramco Systems secured 2 Gold, 1 Silver, and 1 Bronze awards in Best Payroll Software and Best Payroll Outsourcing Partner categories at the HR Vendors of the Year 2025 awards in Malaysia and Singapore. The wins highlight the company's AI-powered Ramco Payce payroll software that serves 500+ customers worldwide with global coverage across 150 countries, reinforcing its leadership position in the payroll solutions market.",
            "Sentiment": "positive",
            "PublishDate": 1764133731500,
            "Source": "stock"
        },
        {
            "Title": "Ramco Systems Allots 26,387 Equity Shares Under Employee Stock Option Schemes",
            "Summary": "Ramco Systems' Stakeholders Relationship Committee approved the allotment of 26,387 equity shares of Rs. 10 each following the exercise of stock options across four employee schemes. The exercise included 750 options under ESOS 2009 Plan A, 2,062 options under ESOS 2013, 16,800 options under ESOS 2014, and 6,775 options under ESOS 2022. The company's paid-up equity share capital increased from 3,73,62,661 equity shares to 3,73,89,048 equity shares of Rs. 10 each. The company will apply for listing and trading permissions for the newly allotted shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762281230205,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Systems Reports Mixed Q2 Results with Standalone Profit but Consolidated Loss",
            "Summary": "Ramco Systems Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. On a standalone basis, the company reported a net profit of Rs. 9.44 million for the quarter compared to Rs. 48.82 million in the previous year quarter, while revenue from operations stood at Rs. 876.98 million versus Rs. 909.63 million last year. However, on a consolidated basis, the company posted a net loss of Rs. 25.07 million for the current quarter against a profit of Rs. 47.87 million in the corresponding previous quarter. For the half year period, standalone operations showed a net profit of Rs. 58.26 million compared to a loss of Rs. 267.82 million in the previous year, while consolidated operations reported a net loss of Rs. 19.67 million versus a loss of Rs. 263.90 million previously. The company allotted 46,953 equity shares under Employee Stock Option Schemes during the quarter, increasing paid-up capital to Rs. 373.98 million. The company's subsidiary in Qatar, Ramco System LLC, was voluntarily closed effective October 30, 2025, with no impact on financials as it had not commenced business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1762279807540,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Systems Shuts Down Qatar Subsidiary Due to Lack of Business Activities",
            "Summary": "Ramco Systems has decided to shut down its Qatar subsidiary, Ramco System LLC, effective October 30, 2025. The closure follows the subsidiary's failure to generate any business activities or investments since its establishment.",
            "Sentiment": "negative",
            "PublishDate": 1761904953879,
            "Source": "stock"
        },
        {
            "Title": "Ramco Systems Named Leader in Everest Group's 2025 APAC Multi-Country Payroll Solutions Assessment",
            "Summary": "Ramco Systems has been positioned as a 'Leader' in Everest Group's Multi-Country Payroll (MCP) Solutions PEAK Matrix Assessment 2025 for APAC, marking the fourth consecutive year of this recognition. Everest Group assessed 28 MCP service providers based on market impact, vision, and capability. Ramco was recognized for its strong strategic focus in the Asia-Pacific region over two decades, extensive experience in payroll transformation projects, robust partner network, and advanced technology capabilities including local language support. The company's Payce platform offers AI-powered compliance tracking, real-time analytics, and serves 500+ customers worldwide with global payroll coverage across 150+ countries. The platform integrates with leading HCM providers and can be deployed on-cloud or as a managed service, utilizing robotic process automation, artificial intelligence, and machine learning for touchless payroll experience.",
            "Sentiment": "positive",
            "PublishDate": 1761632737460,
            "Source": "stock"
        },
        {
            "Title": "Ramco Systems Signs MOU with The ePlane Company for Aviation Software Implementation",
            "Summary": "Ramco Systems has signed a Memorandum of Understanding with The ePlane Company (Ubifly Technologies Private Limited) to provide aviation software for lifecycle management of ePlane's e200X eVTOL aircraft. The partnership will enable ePlane to implement Ramco Aviation Software in phases as the e200X progresses through certification and regulatory approvals toward manufacturing and commercial service. The software suite includes modules for engineering, maintenance, supply chain, flight operations, safety, quality, compliance, manufacturing, and finance. ePlane, incubated at IIT Madras, is developing India's first flying electric taxi and holds the first Design Organisation Approval from India's DGCA for an electric aircraft among private Indian companies. The e200X type certification has been under progress since December 2024. Ramco Aviation Software currently serves 24,000+ users managing 4,000+ aircraft globally across 90+ aviation organizations.",
            "Sentiment": "positive",
            "PublishDate": 1761545435699,
            "Source": "order&deals"
        },
        {
            "Title": "Ramco Systems CHRO Rajiv Kumar Gets Approval for Trading Plan to Sell 6,000 Shares",
            "Summary": "Ramco Systems Limited approved a trading plan submitted by Rajiv Kumar, Chief Human Resource Officer, on October 13, 2025. The plan allows Kumar to sell 6,000 equity shares during a 5-day trading period from February 11-17, 2026, with a lower price limit of Rs. 452.52 (80% of previous trading day closing price on NSE). Kumar currently holds 14,250 shares in the company. The trading plan complies with SEBI Prohibition of Insider Trading Regulations and the company's Code of Conduct.",
            "Sentiment": "neutral",
            "PublishDate": 1760368326962,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ramco Systems Selected by Global Engine Maintenance India for Aviation Software Deployment",
            "Summary": "Ramco Systems has been chosen by Global Engine Maintenance India to deploy aviation software for engine teardown processes. The deployment aims to digitize operations and enhance efficiency and compliance in the engine maintenance sector.",
            "Sentiment": "positive",
            "PublishDate": 1760005552759,
            "Source": "order&deals"
        },
        {
            "Title": "Ramco Systems Opens Special Window for Physical Share Transfer Re-lodgement",
            "Summary": "Ramco Systems Limited has opened a special window for re-lodgement of transfer requests for physical shares following SEBI circular SEBI/HO/MIRSD/MIRSD-PoD/P/CIR/2025/97 dated July 2, 2025. The company published public notices in newspapers on August 20, 2025 and September 3, 2025, and shared information on social media platforms including Twitter, LinkedIn, and Facebook. The facility is available from July 7, 2025 to January 6, 2026 for transfer deeds that were lodged prior to April 1, 2019 deadline but were rejected, returned, or not attended due to document deficiencies. The company reported nil requests received, processed, approved, or rejected during the reporting period from the circular date to August 31, 2025. Eligible shareholders must furnish Client Master List along with transfer documents and share certificates when lodging documents with the Registrar and Transfer Agent.",
            "Sentiment": "neutral",
            "PublishDate": 1757073139740,
            "Source": "corporate_action"
        },
        {
            "Title": "UAMCO Selects Ramco Systems for Aviation Software Implementation",
            "Summary": "Ramco Systems announced that United Aerospace Maintenance Company (UAMCO) Ltd has selected its Aviation Software to streamline operations and materials management. UAMCO, a provider of aircraft engine maintenance, repair and overhaul services founded in 2022, will implement Ramco's software solution to enhance operational efficiency and support LEAP engines, including CFM International SA LEAP-1A and LEAP-1B. The software includes modules for Engineering & CAMO, Maintenance, Supply Chain, MRO & Part Sales, Employee Management, Safety, Quality, Compliance and Finance & Accounting. Ramco's business partner AiAppsData played a key role in this engagement. UAMCO CEO John Savvides stated the solution was chosen for its comprehensive maintenance and materials management capabilities. Ramco Aviation Software is used by 24,000+ users to manage 4,000+ aircraft globally across 90+ aviation organizations.",
            "Sentiment": "positive",
            "PublishDate": 1756361128901,
            "Source": "order&deals"
        },
        {
            "Title": "Ramco Systems Reports Strong Q1 Turnaround with 9.4 Million Rupees Net Profit",
            "Summary": "Ramco Systems delivered a significant turnaround in its quarterly results, posting a net profit of 9.4 million rupees compared to a loss of 197 million rupees in the same period last year. Revenue grew to 1.61 billion rupees from 1.36 billion rupees year-over-year. The company's EBITDA surged to 290 million rupees from 34.4 million rupees, while EBITDA margin expanded substantially to 18.01% from 2.51% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754872128538,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Systems Reports 15% YoY Revenue Growth in Q1 FY2026 with USD 18.95M Consolidated Income",
            "Summary": "Ramco Systems announced its quarterly results with consolidated income of USD 19.36 million (Rs. 164.8 crores) for the quarter ended June 30, 2025, representing 15% year-over-year revenue growth. The company reported net profit after tax of USD 0.11 million (Rs. 0.9 crores) and EBITDA of USD 3.83 million. Key operational highlights include quarterly order bookings of USD 15 million (36% increase quarter-over-quarter), recurring revenue of USD 11.08 million, and an unexecuted order book of USD 168.55 million. The company signed two million-dollar-plus deals and onboarded several multinational clients across technology, logistics, and aviation sectors. Ramco maintained its zero-borrowing position and successfully implemented its payroll solution at Air Niugini for over 2,000 employees across four countries. The Board of Directors approved both standalone and consolidated unaudited financial results, which were reviewed by the Audit Committee and Statutory Auditors.",
            "Sentiment": "positive",
            "PublishDate": 1754662435494,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Systems Completes Aviation Software Implementation at Indamer Technics in 45 Days",
            "Summary": "Ramco Systems announced the successful implementation of its Aviation Software at Indamer Technics Private Limited, India's leading aviation services provider. The implementation was completed in 45 days and includes modules for Maintenance, Engineering, Supply Chain Management, Quality, Contract and Quote Management, and Customer Billing and Finance. The software has replaced Indamer Technics' legacy systems with a single integrated solution, delivering benefits including enhanced inventory accuracy, improved billing turnaround time, and streamlined material requirements planning. Indamer Technics specializes in Airbus A320 family MRO services and is strategically located in Nagpur. Ramco Aviation Software is used by over 24,000 users to manage more than 4,000 aircraft globally across 70+ aviation organizations.",
            "Sentiment": "positive",
            "PublishDate": 1753857470109,
            "Source": "stock"
        },
        {
            "Title": "HDFC Bank Declares Rs 5 Special Interim Dividend and 1:1 Bonus Shares; Ramco Systems Announces 28th AGM",
            "Summary": "HDFC Bank's Board declared a Special Interim Dividend of Rs 5 per equity share for FY 2025-26, with record date set for July 25, 2025. The bank also approved issuance of bonus equity shares in 1:1 proportion (one new share for every existing share) with record date of August 27, 2025, subject to regulatory approvals and shareholder approval through postal ballot. Bonus shares will be allotted only in dematerialized form, requiring physical shareholders to dematerialize by August 25, 2025. Separately, Ramco Systems Limited published notices for its 28th Annual General Meeting to be held on August 13, 2025 via video conferencing, with remote e-voting facility available from August 10-12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753156459015,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Systems Partners with MCA Management Consultants",
            "Summary": "Ramco Systems has announced a partnership with MCA Management Consultants. The collaboration aims to combine Ramco's technology solutions with MCA's consulting expertise, though specific details of the partnership were not provided in the brief news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751866673000,
            "Source": "default"
        },
        {
            "Title": "Air Niugini Adopts Ramco Systems' PayCe Solution",
            "Summary": "Papua New Guinea's national airline, Air Niugini, has implemented Ramco Systems' PayCe solution. This adoption marks a technological upgrade for the airline's operations.",
            "Sentiment": "positive",
            "PublishDate": 1750741953000,
            "Source": "default"
        },
        {
            "Title": "Ramco Systems Closes Overseas Branch",
            "Summary": "Ramco Systems has announced the closure of an overseas branch. The closure is attributed to the branch having no business operations for several years.",
            "Sentiment": "neutral",
            "PublishDate": 1749082129000,
            "Source": "default"
        },
        {
            "Title": "Ramco Systems Closes Overseas Branch",
            "Summary": "Ramco Systems has closed an overseas branch due to a lack of business operations over several years.",
            "Sentiment": "negative",
            "PublishDate": 1749044640000,
            "Source": "default"
        },
        {
            "Title": "Ramco Systems Reports Q4 Profit of 53.1 Million Rupees",
            "Summary": "Ramco Systems announced its Q4 financial results. The company reported a consolidated net profit of 53.1 million rupees, compared to a loss of 230 million rupees in the same quarter last year. However, this represents a decrease from the previous quarter's loss of 101.67 million rupees. Revenue for Q4 increased to 1.55 billion rupees from 1.31 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1747873005000,
            "Source": "default"
        },
        {
            "Title": "Ramco Systems Reports Improved Q4 Financial Results",
            "Summary": "Ramco Systems has announced its Q4 financial results. The company's EBITDA increased to 416 million rupees from 21.77 million rupees year-over-year. The EBITDA margin improved to 26.79% from 1.66% in the same period last year. Revenue rose to 1.55 billion rupees from 1.31 billion rupees year-over-year. The company reported a consolidated net profit of 53.1 million rupees, compared to a loss of 230 million rupees in the same quarter last year and a loss of 101.67 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747843792000,
            "Source": "result"
        },
        {
            "Title": "Ramco Systems to Consider Q4 Results on May 21",
            "Summary": "Ramco Systems has announced that it will consider its fourth quarter (Q4) financial results on May 21. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747227740000,
            "Source": "default"
        },
        {
            "Title": "Ramco Systems to Implement Aviation Software at Indamer Technics",
            "Summary": "Ramco Systems has announced that it will implement its aviation software solution at Indamer Technics. This implementation suggests a significant business deal for Ramco Systems in the aviation technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1742192897000,
            "Source": "order&deals"
        },
        {
            "Title": "Ramco Systems: Aviation Software Successfully Implemented at Philippine Airlines",
            "Summary": "Ramco Systems announced successful implementation of its aviation software for Philippine Airlines' domestic PAL Express fleet operations. The software optimizes and digitizes operations for A321, A320, and Q400 aircraft. Despite this news, Ramco Systems' stock showed mixed performance, opening higher but later paring gains.",
            "Sentiment": "positive",
            "PublishDate": 1740641869000,
            "Source": "order&deals"
        },
        {
            "Title": "Philippine Airlines Goes Live with Ramco Aviation System",
            "Summary": "Ramco Systems announced that Philippine Airlines, Inc. has successfully implemented Ramco's Aviation software. This deployment signifies a significant technological upgrade for the airline's operations.",
            "Sentiment": "positive",
            "PublishDate": 1740629872000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Systems Secures Fly Vaayu as New Aviation Software Client",
            "Summary": "Ramco Systems has announced that Fly Vaayu, an aviation company, has chosen to implement Ramco's aviation software to support its growth strategy. This partnership indicates Ramco's expansion in the aviation software market and Fly Vaayu's commitment to technological advancement in its operations.",
            "Sentiment": "positive",
            "PublishDate": 1740033672000,
            "Source": "order&deals"
        },
        {
            "Title": "Air Niugini Selects Ramco Systems' Payroll Solution",
            "Summary": "Ramco Systems announced that Air Niugini, Papua New Guinea's national airline, has chosen Ramco Payce for its payroll transformation. This selection indicates a significant business deal for Ramco Systems in the aviation sector, potentially enhancing their market position in payroll solutions for airlines.",
            "Sentiment": "positive",
            "PublishDate": 1739320265000,
            "Source": "order&deals"
        },
        {
            "Title": "Air Niugini Selects Ramco Systems' PAYCE for Payroll Transformation",
            "Summary": "Ramco Systems has announced that Air Niugini, the national airline of Papua New Guinea, has chosen Ramco PAYCE for its payroll transformation. This selection indicates that Air Niugini will be implementing Ramco's payroll and employee management solution to modernize its payroll processes.",
            "Sentiment": "positive",
            "PublishDate": 1739283829000,
            "Source": "order&deals"
        },
        {
            "Title": "Ramco Systems Strengthens Middle East Presence with New Board Appointment",
            "Summary": "Ramco Systems is bolstering its presence in the Middle East by proposing to appoint Alaga Raja to the board of its subsidiary, Ramco Systems FZ LLC, located in the UAE. This strategic move aims to enhance the company's operations and governance in the region.",
            "Sentiment": "positive",
            "PublishDate": 1739181281000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ramco Systems Reports Increased Q3 Loss and Revenue",
            "Summary": "Ramco Systems has reported a consolidated net loss of 102 million rupees for the third quarter, compared to a loss of 97.4 million rupees in the same period last year. However, the company's revenue increased to 1.57 billion rupees from 1.42 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738743816000,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Systems to Consider Q3 Results on February 5",
            "Summary": "Ramco Systems has announced that it will consider its third quarter (Q3) financial results on February 5. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737638663000,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Systems Acquires New Client Prism Johnson",
            "Summary": "Ramco Systems has announced the acquisition of a new client, Prism Johnson. This development indicates a potential expansion of Ramco Systems' customer base and could lead to increased business opportunities for the company.",
            "Sentiment": "positive",
            "PublishDate": 1734589241000,
            "Source": "order&deals"
        },
        {
            "Title": "Ramco Systems Partners with HIST for Korean Aviation Digital Transformation",
            "Summary": "Ramco Systems has announced a partnership with Hanjin Information Systems & Telecommunication (HIST), a part of the Hanjin Group in Korea. The collaboration aims to enable Korean aviation organizations to digitally transform their Maintenance & Engineering (M&E) and Maintenance, Repair, and Overhaul (MRO) operations.",
            "Sentiment": "positive",
            "PublishDate": 1733395292000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Systems Reports Significant EBITDA Improvement in Q2",
            "Summary": "Ramco Systems has reported a substantial turnaround in its Q2 EBITDA, posting a gain of 166 million rupees compared to a loss of 1.3 billion rupees in the same quarter last year. The company's Q2 EBITDA margin stands at 11.65%.",
            "Sentiment": "positive",
            "PublishDate": 1731073126000,
            "Source": "result"
        },
        {
            "Title": "Ramco Systems Reports Q2 Financial Results",
            "Summary": "Ramco Systems announced its Q2 financial results. The company reported a consolidated net loss of 97 million rupees, an improvement from the 1.46 billion rupee loss in the same quarter last year. However, the loss widened from 197 million rupees in the previous quarter. Revenue for Q2 increased to 1.4 billion rupees, up from 1.27 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731073012000,
            "Source": "result"
        }
    ]
}