{
    "Symbol": "RAMCOIND",
    "ISIN": "INE614A01028",
    "News": [
        {
            "Title": "Ramco Industries Q3FY26 Results: Revenue Up 12.2%",
            "Summary": "Ramco Industries reported Q3FY26 standalone revenue of ₹305.29 crores, up 12.2% YoY. Net profit rose 28.3% to ₹16.59 crores with EPS at ₹1.91.",
            "Sentiment": "positive",
            "PublishDate": 1770800468259,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramco Industries Settles West Bengal Entry Tax Dispute",
            "Summary": "Ramco Industries resolves long-standing entry tax litigation with West Bengal government through settlement scheme, paying ₹2.21 crore while saving ₹74 lakh plus interest and penalties.",
            "Sentiment": "positive",
            "PublishDate": 1769759536634,
            "Source": "stocks"
        },
        {
            "Title": "Ramco Industries Board Meet Set for Feb 11, 2026",
            "Summary": "Ramco Industries has scheduled a board meeting on February 11, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769593728179,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramco Industries Gets Credit Rating Reaffirmation from ICRA, NCD Facility Partially Withdrawn",
            "Summary": "ICRA reaffirmed Ramco Industries' credit ratings for Rs. 500 crores of long-term and short-term facilities with ICRA [AA-] (Stable) and ICRA [A1+] ratings respectively. The rating agency also reaffirmed the company's Rs. 100 crores NCD facility while withdrawing Rs. 60 crores from the earlier Rs. 160 crores NCD rated amount.",
            "Sentiment": "positive",
            "PublishDate": 1764843465483,
            "Source": "stock"
        },
        {
            "Title": "Ramco Industries Gets Credit Rating Reaffirmed by Crisil for Rs. 100 Crore Commercial Paper",
            "Summary": "Crisil Ratings Limited has reaffirmed the Crisil A1+ rating on Ramco Industries Limited's Rs. 100 crore commercial paper programme, indicating very strong degree of safety for timely payment of financial obligations. The rating letter is valid for 60 calendar days for issuance purposes and throughout the life of the commercial paper programme with maximum maturity of one year once issued.",
            "Sentiment": "positive",
            "PublishDate": 1764584330815,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Industries Reports 55% Jump in Q2 Net Profit to 203.6 Million Rupees",
            "Summary": "Ramco Industries delivered strong quarterly results with consolidated net profit rising to 203.6 million rupees from 131.5 million rupees year-over-year. Revenue grew to 3.66 billion rupees compared to 3.53 billion rupees in the same period last year. EBITDA increased to 523.5 million rupees from 414.9 million rupees, while EBITDA margin expanded to 14.32% from 11.75% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762388900415,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Systems Reports Strong Q2 Turnaround with 126M Rupees Net Profit",
            "Summary": "Ramco Systems delivered a significant turnaround in its Q2 results, posting a consolidated net profit of 126 million rupees compared to a loss of 97 million rupees in the same quarter last year. The company's revenue grew to 1.76 billion rupees from 1.42 billion rupees year-over-year. EBITDA more than doubled to 394 million rupees from 166 million rupees, while EBITDA margin expanded substantially to 22.42% from 11.65% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762269179223,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Industries Wins Tax Dispute as High Court Dismisses Department's Appeal on Subsidy Income Treatment",
            "Summary": "Ramco Industries Limited received a favorable outcome in a tax dispute involving Rs 156.04 lakhs. The High Court dismissed the Department's appeal and upheld the Income Tax Appellate Tribunal's order that treated subsidy income as a 'capital receipt'. The company downloaded the High Court order dated September 22, 2025, which resolved the dispute in their favor.",
            "Sentiment": "positive",
            "PublishDate": 1758709482164,
            "Source": "stock"
        },
        {
            "Title": "Ramco Industries Reports Strong Q1 FY2026 Results with 26% Revenue Growth",
            "Summary": "Ramco Industries Limited reported consolidated revenue of ₹52,683 lakhs for the quarter ended June 30, 2025, representing a 26% increase from ₹41,866 lakhs in the same quarter last year. Net profit after tax rose 59% to ₹4,542 lakhs compared to ₹2,859 lakhs in Q1 FY2025. Basic earnings per share increased to ₹7.58 from ₹4.12 year-on-year. The company's total comprehensive income turned positive at ₹8,046 lakhs versus a loss of ₹1,132 lakhs in the previous year quarter. Consolidated results showed higher performance than standalone figures, with consolidated revenue at ₹52,683 lakhs versus standalone revenue of ₹45,888 lakhs. The company maintained its paid-up equity share capital at ₹866 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1754721383296,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Industries Reports Strong Q1 Performance with 18% Revenue Growth",
            "Summary": "Ramco Industries Limited reported quarterly results for the period ended June 30, 2025. The company's standalone revenue from operations increased to Rs 45,888 lakhs compared to Rs 34,132 lakhs in the previous quarter. Net profit after tax rose to Rs 3,258 lakhs from Rs 1,342 lakhs in the prior quarter. On a consolidated basis, revenue reached Rs 52,683 lakhs versus Rs 41,866 lakhs in the previous quarter, with net profit climbing to Rs 4,582 lakhs from Rs 2,859 lakhs. The company operates across three main segments: Building Products, Textiles, and Windmills. Basic and diluted earnings per share on standalone basis stood at Rs 3.75 for the quarter. The Board of Directors approved these results at their meeting held on August 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754308626181,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Industries Reports Mixed Q1 Results with Higher Profitability Despite Revenue Decline",
            "Summary": "Ramco Industries reported Q1 EBITDA of 680 million rupees, up from 568 million rupees in the same period last year. The company's EBITDA margin improved to 12.9% compared to 10.46% year-over-year. Consolidated net profit increased to 458 million rupees from 394 million rupees in the previous year's corresponding quarter. However, revenue declined to 5.3 billion rupees from 5.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754293158694,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Systems Secures Indamer Technics as New Client",
            "Summary": "Ramco Systems has acquired Indamer Technics as a new client. The announcement indicates a business development for the company's client portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1753856981808,
            "Source": "stock"
        },
        {
            "Title": "Ramco Industries Opens Special Window for Re-lodgement of Rejected Physical Share Transfers",
            "Summary": "Ramco Industries Limited has announced the opening of a special window for re-lodgement of transfer requests for physical shares that were rejected or returned prior to April 1, 2019. The initiative follows a SEBI circular dated July 2, 2025, and is designed to address previously unresolved share transfer issues. The company published newspaper advertisements in 'Makkal Kural' and 'Financial Express' to inform shareholders about this opportunity. The special window specifically targets transfer deeds that were rejected, returned, or not processed due to deficiencies in documents or processes.",
            "Sentiment": "neutral",
            "PublishDate": 1753176843937,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Industries Limited Releases Business Responsibility & Sustainability Report for FY 2024-25",
            "Summary": "Ramco Industries Limited has published its Business Responsibility & Sustainability Report for the financial year 2024-25. The company, incorporated in 1965 and listed on BSE and NSE, reported a turnover of ₹1,387.01 crores with a paid-up capital of ₹8.68 crores. The report covers the company's building products division (79.31% of turnover), textile operations (18.38%), and renewable energy generation (1.20%). The company operates 12 locations nationally and 3 internationally, serving 30 states in India and 12 countries globally with exports contributing 1.1% to turnover. Key sustainability initiatives include targets to reduce environmental performance metrics by 5% by FY 2026, transition to biofuel in one plant, implement Bio-STP in two plants, and generate 3 MW from renewable energy sources. The company maintains zero liquid discharge facilities and has achieved zero Lost Time Injury Frequency Rate for workers in the current year. Employee count stands at 735 permanent employees and 2,405 workers, with comprehensive health insurance and accident coverage provided.",
            "Sentiment": "positive",
            "PublishDate": 1753160315218,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Industries Reports Q4 Financial Results",
            "Summary": "Ramco Industries has announced its Q4 financial results. The company's EBITDA for Q4 was 438 million rupees, compared to 398 million rupees in the same quarter last year. The EBITDA margin for Q4 was 10.47%, down from 10.92% in the previous year. Revenue for Q4 increased to 4 billion rupees from 3.6 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747992553000,
            "Source": "result"
        },
        {
            "Title": "Ramco Industries Reports Q4 Consolidated Net Profit",
            "Summary": "Ramco Industries reported a consolidated net profit of 357 million rupees for the fourth quarter, compared to 440 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1747992516000,
            "Source": "result"
        },
        {
            "Title": "Supreme Court Dismisses Tax Department's Appeal Against Ramco Industries",
            "Summary": "The Supreme Court has dismissed an appeal by the tax department regarding a sales tax liability dispute with Ramco Industries. This ruling appears to be in favor of Ramco Industries, potentially resolving a significant tax-related issue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1741075413000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ramco Industries Reports Q3 Revenue Growth",
            "Summary": "Ramco Industries has reported a revenue of 3.4 billion rupees for the third quarter, showing a year-over-year increase from 3.3 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739174482000,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Industries Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Ramco Industries has announced its third-quarter consolidated net profit, which has risen to 889 million rupees from 260 million rupees in the same period last year. This represents a substantial year-over-year increase in the company's profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739174298000,
            "Source": "earnings"
        },
        {
            "Title": "Ramco Industries Acquires Shares of Ramco Cements",
            "Summary": "Ramco Industries has acquired shares of Ramco Cements worth 293.4 million rupees. This transaction represents a significant investment by Ramco Industries in its affiliate company.",
            "Sentiment": "neutral",
            "PublishDate": 1732234352000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Industries Acquires Shares of Ramco Cements",
            "Summary": "Ramco Industries has acquired 4,66,600 shares of Ramco Cements for a total of 419.5 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731933029000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Industries to Invest in Ramco Cements and Raise Credit Facilities",
            "Summary": "Ramco Industries has announced two significant financial decisions. First, the company plans to invest up to 1.6 billion rupees in Ramco Cements. Second, the company has approved raising credit facilities of up to 1.6 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731316968000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramco Industries Reports Q2 Revenue Growth",
            "Summary": "Ramco Industries has reported a revenue of 3.5 billion rupees for the second quarter, compared to 3.15 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731316611000,
            "Source": "result"
        },
        {
            "Title": "Ramco Industries Reports Improved Q2 Financial Performance",
            "Summary": "Ramco Industries has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 415 million rupees, up from 273 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 11.75% from 8.63% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731316590000,
            "Source": "result"
        },
        {
            "Title": "Ramco Industries Reports Profit in Q2 FY2024",
            "Summary": "Ramco Industries has announced a consolidated net profit of 169 million rupees for the second quarter, compared to a loss of 42 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1731316542000,
            "Source": "result"
        }
    ]
}