{
    "Symbol": "RAMKY",
    "ISIN": "INE874I01013",
    "News": [
        {
            "Title": "Ramky Infrastructure Board Meet on Feb 7, 2026",
            "Summary": "Ramky Infrastructure Limited has scheduled a board meeting for February 07, 2026, to consider and approve unaudited financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770013551258,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramky Infra CEO Projects Strong Revenue Growth of 25-30% Annually by FY27",
            "Summary": "Ramky Infrastructure's CEO expressed confidence that the company will achieve annual revenue growth of 25% to 30% by FY27. This growth projection indicates the management's optimistic outlook on the company's business prospects and expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1765178427650,
            "Source": "stock"
        },
        {
            "Title": "Ramky Infra CEO Expects ₹30 Billion in New Orders by January End",
            "Summary": "Ramky Infra's CEO anticipates securing new orders worth approximately ₹30 billion by the end of January. The company currently holds the lowest bids for two significant projects valued at ₹30 billion, positioning it favorably for contract awards.",
            "Sentiment": "positive",
            "PublishDate": 1765178142489,
            "Source": "stock"
        },
        {
            "Title": "Ramky Infrastructure Wins ET Infra Leadership Award for Wastewater Management Excellence",
            "Summary": "Ramky Infrastructure Limited received the Excellence in Wastewater Management award at The Economic Times Infra Leadership Awards 2025 for its Legacy Leachate Treatment Facility in Hyderabad. The company was recognized for operating India's largest leachate treatment plant with 2 MLD capacity using Low Temperature Evaporator technology based on Mechanical Vapor Recompression System.",
            "Sentiment": "positive",
            "PublishDate": 1764339572373,
            "Source": "stock"
        },
        {
            "Title": "Ramky Infrastructure Reports INR 444 Crore Revenue with INR 9,200 Crore Order Book",
            "Summary": "Ramky Infrastructure Limited conducted its quarterly earnings call reporting revenue of INR 444 crore and maintaining an order book of INR 9,200 crore across industrial solutions, water wastewater, roads, urban solutions and buildings segments. The company expects to close the current year at INR 2,400 crore revenue with EBITDA margins of 21-22%, while targeting international expansion in Middle East and Africa markets.",
            "Sentiment": "positive",
            "PublishDate": 1764053637249,
            "Source": "earnings"
        },
        {
            "Title": "Ramky Infrastructure Shareholders Approve INR 950 Crores Related Party Transactions via Postal Ballot",
            "Summary": "Ramky Infrastructure Limited shareholders approved two material related party transactions through postal ballot - extending INR 150 crores inter-corporate deposit to Numen Growth Partners Private Limited and providing INR 800 crores corporate guarantee to lenders of Srinagar Banihal Expressway Limited. The e-voting process conducted from October 17 to November 15, 2025, saw both resolutions passed with requisite majority, with 97.08% votes in favor of the first resolution and 99.99% for the second.",
            "Sentiment": "positive",
            "PublishDate": 1763376989431,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramky Infrastructure Reports Strong Q2 FY26 Results with 679.15 Million Net Profit",
            "Summary": "Ramky Infrastructure Limited announced quarterly results for the period ended September 30, 2025, with standalone net profit of ₹679.15 million and consolidated net profit of ₹756.29 million. The company's board approved the unaudited financial statements and noted several subsidiary-related arbitration proceedings and project terminations affecting consolidated operations.",
            "Sentiment": "negative",
            "PublishDate": 1763069438591,
            "Source": "earnings"
        },
        {
            "Title": "Ramky Infrastructure Reports Q2FY26 Results with Rs 2,085 Crore New Project Win",
            "Summary": "Ramky Infrastructure Limited announced quarterly results with consolidated revenue of Rs 472 crore and PAT of Rs 76 crore, while securing a major water supply project worth Rs 2,085 crore from HMWSSB under hybrid annuity model. The infrastructure company, now debt-free after completing restructuring obligations in July 2025, maintains an order book of Rs 9,200 crore across water treatment, industrial solutions and urban infrastructure segments.",
            "Sentiment": "positive",
            "PublishDate": 1763050330790,
            "Source": "stock"
        },
        {
            "Title": "Ramky Infrastructure Shareholders Approve Appointment of Independent Woman Director",
            "Summary": "Ramky Infrastructure Limited shareholders approved the appointment of Ms. Malvika Joshi as Independent Woman Director for a five-year term through postal ballot. The Board initially appointed her on September 29, 2025, followed by shareholder approval through e-voting conducted from October 3 to November 1, 2025. The resolution passed with overwhelming support, receiving 99.9975% votes in favor from 150 members representing 5,50,37,084 shares, while only 12 members with 1,362 shares voted against. The scrutinizer confirmed the special resolution was passed with requisite majority, and Ms. Joshi's tenure as Independent Woman Director commenced from September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762255110410,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramky Infrastructure Seeks Enhanced Shareholder Approval for Material Related Party Transactions Worth INR 72,550 Million",
            "Summary": "Ramky Infrastructure Limited has issued a postal ballot notice seeking enhanced shareholder approval for material related party transactions with two entities. The company is requesting approval for transactions with Numen Growth Partners Private Limited (promoter group member holding 2.41% equity) worth INR 3,850 million for FY 2025-26, and with subsidiary Srinagar Banihal Expressway Limited worth INR 68,700 million including corporate guarantees and claims. The proposed transactions include inter-corporate deposits, operation and maintenance services, and corporate guarantees. Shareholders had previously approved smaller amounts at the AGM held on September 25, 2025, but the company now seeks enhanced limits due to progressing financial requirements. Key new approvals sought include INR 1,500 million ICD to Numen at 14% interest, INR 8,000 million corporate guarantee for SBEL's lenders, and increased ICD limits between Ramky and SBEL. Remote e-voting is scheduled from October 17 to November 15, 2025, with October 10, 2025 as the cut-off date for voting eligibility. Results will be announced by November 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760611593944,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramky Infrastructure Board Approves Corporate Guarantee Extension and Postal Ballot for Related Party Transactions",
            "Summary": "Ramky Infrastructure Limited's Board of Directors approved the extension of a corporate guarantee to bankers for a loan to be availed by subsidiary Srinagar Banihal Expressway Limited (SBEL). The board also approved a postal ballot notice seeking shareholder approval for material related party transactions, including the corporate guarantee for SBEL and approval of a material related party transaction with Numen Growth Partners Private Limited. The company stated that the probability of the corporate guarantee being invoked is very remote due to NHAI annuities being given as security, and expects no impact on its financial statements. The guarantee will be backed by future annuities receivable from NHAI.",
            "Sentiment": "neutral",
            "PublishDate": 1760169165033,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramky Infrastructure Subsidiary Secures INR 2,085 Crore Water Supply Project from Hyderabad Metropolitan Water Board",
            "Summary": "Mallannasagar Water Supply Limited, a subsidiary of Ramky Infrastructure Limited, has executed a Concessionaire Agreement with Hyderabad Metropolitan Water Supply and Sewerage Board on September 18, 2025. The project involves the HMWSSB Godavari Drinking Water Supply Scheme Phase-II & Phase-III, which includes filling Osmansagar & Himayathsagar Reservoirs with Godavari Water for Musi River rejuvenation. The contract operates under a Hybrid Annuity Model with a total value of INR 2,085 crores. The project timeline includes construction within 2 years and Manning, Operation and Maintenance for 10 years from completion. This is a domestic contract and does not constitute a related party transaction, as Ramky Infrastructure Limited and its promoters have no interest in HMWSSB.",
            "Sentiment": "positive",
            "PublishDate": 1758368755341,
            "Source": "order&deals"
        },
        {
            "Title": "Ramky Infrastructure Subsidiary Secures INR 2,085 Crore Water Supply Project in Hyderabad",
            "Summary": "Mallannasagar Water Supply Limited, a subsidiary of Ramky Infrastructure Limited, has executed a Concessionaire Agreement with Hyderabad Metropolitan Water Supply and Sewerage Board for the Godavari Drinking Water Supply Scheme. The project involves filling Osmansagar and Himayathsagar Reservoirs with Godavari Water for Musi River rejuvenation under a Hybrid Annuity Model. The contract includes construction within 2 years and Manning, Operation and Maintenance for 10 years from completion of construction. The total project value is INR 2,085 Crores and is domestic in nature between unrelated parties.",
            "Sentiment": "positive",
            "PublishDate": 1758201594388,
            "Source": "order&deals"
        },
        {
            "Title": "Ramky Infrastructure Reports Strong Q1 2025 Results, Exits Debt Restructuring",
            "Summary": "Ramky Infrastructure Limited reported quarterly results for the period ended June 30, 2025. On a standalone basis, the company posted revenue from operations of ₹3,540.80 million and net profit after tax of ₹555.83 million. Basic earnings per share stood at ₹8.03. On a consolidated basis, revenue from operations was ₹3,792.41 million with net profit after tax of ₹770.35 million, resulting in basic EPS of ₹10.75. The company's board approved the unaudited financial statements and recommended the re-appointment of Isaac Wesley Vijaya Kumar as Non-executive Director. Additionally, Ramky executed a Restructuring Exit Agreement with lenders on July 11, 2025, ending the Trust & Retention Account mechanism and formally exiting the debt restructuring process that began in 2015. The company also wrote back excess provisions of ₹123.63 million during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754654697934,
            "Source": "earnings"
        },
        {
            "Title": "Ramky Infra Reports Mixed Q1 Results with Revenue Decline and Profit Growth",
            "Summary": "Ramky Infrastructure reported quarterly results showing EBITDA of 758 million rupees compared to 1.16 billion rupees in the same period last year, with EBITDA margin declining to 19.99% from 20.4%. The company's consolidated net profit increased to 744 million rupees from 676 million rupees year-over-year. However, revenue dropped significantly to 3.8 billion rupees from 5.7 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754653570114,
            "Source": "earnings"
        },
        {
            "Title": "Ramky Infrastructure Completes Debt Restructuring",
            "Summary": "Ramky Infrastructure has signed an agreement to exit restructuring and has completed a debt restructure of ₹3,859.81 crore. The company has successfully concluded this financial process, which is likely to have a significant impact on its financial position.",
            "Sentiment": "positive",
            "PublishDate": 1752245570000,
            "Source": "default"
        },
        {
            "Title": "Ramky Infrastructure Reports Increased Q3 Profit and Revenue",
            "Summary": "Ramky Infrastructure has announced its Q3 financial results. The company's consolidated net profit rose to 564 million rupees, up from 365 million rupees in the same quarter last year. Revenue also increased to 4.59 billion rupees, compared to 4.41 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739320435000,
            "Source": "earnings"
        },
        {
            "Title": "Ramky Infrastructure Reports Improved Q3 EBITDA and Margin",
            "Summary": "Ramky Infrastructure has reported an increase in its Q3 EBITDA to 896 million rupees, up from 769 million rupees in the same quarter last year. The company's EBITDA margin also improved, rising to 19.52% from 17.45% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739282167000,
            "Source": "earnings"
        },
        {
            "Title": "Ramky Infrastructure Reports Increased Q3 Profit and Revenue",
            "Summary": "Ramky Infrastructure has announced its Q3 financial results, showing significant growth. The company's consolidated net profit rose to 564 million rupees, up from 365 million rupees in the same quarter last year. Revenue also increased to 4.59 billion rupees from 4.41 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739282161000,
            "Source": "earnings"
        },
        {
            "Title": "Ramky Infrastructure to Consider Q3 Results",
            "Summary": "Ramky Infrastructure has announced that it will consider its third quarter (Q3) financial results on February 11. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738757530000,
            "Source": "earnings"
        },
        {
            "Title": "Ramky Infrastructure Secures 2.15 Billion Rupee Contract from HMWSSB",
            "Summary": "Ramky Infrastructure has received a letter of acceptance from the Hyderabad Metropolitan Water Supply and Sewerage Board (HMWSSB) for a contract valued at 2.15 billion rupees, excluding GST. This new project represents a significant business opportunity for the company in the water infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1735172442000,
            "Source": "order&deals"
        },
        {
            "Title": "Ramky Infrastructure Limited: Secures ₹215 Crore Contract for Sewage Treatment in Hyderabad",
            "Summary": "Ramky Infrastructure received a ₹215.08 crore contract from HMWSSB for operating and maintaining sewage treatment plants in Hyderabad for five years. The company also received warning letters from NSE and BSE for non-compliance with risk management committee meeting regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1735049059000,
            "Source": "order&deals"
        },
        {
            "Title": "Ramky Infrastructure Secures 2.15 Billion Rupee Contract from HMWSSB",
            "Summary": "Ramky Infrastructure has received a Letter of Acceptance from the Hyderabad Metropolitan Water Supply and Sewerage Board (HMWSSB) for a contract valued at 2.15 billion rupees, excluding GST. This development represents a significant new project for the company in the water infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1735040888000,
            "Source": "order&deals"
        },
        {
            "Title": "NSE Issues Warning to Ramky Infrastructure Over Risk Management Committee Meetings",
            "Summary": "The National Stock Exchange (NSE) has sent a warning letter to Ramky Infrastructure regarding the intervals between their Risk Management Committee meetings. This action suggests that the company may not have been adhering to the required frequency of these important governance meetings, as stipulated by regulatory guidelines.",
            "Sentiment": "negative",
            "PublishDate": 1734912633000,
            "Source": "corporate_governance"
        },
        {
            "Title": "NSE Issues Warning to Ramky Infrastructure Over Risk Management Committee Meeting Intervals",
            "Summary": "The National Stock Exchange (NSE) has sent a warning letter to Ramky Infrastructure regarding the intervals between their Risk Management Committee meetings. This action suggests that the company may not have been conducting these important meetings as frequently as required by regulatory standards.",
            "Sentiment": "negative",
            "PublishDate": 1734702179000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ramky Infrastructure Reports Q2 Financial Results",
            "Summary": "Ramky Infrastructure's Q2 EBITDA decreased to 1.3 billion rupees from 1.80 billion rupees year-over-year. The company's Q2 EBITDA margin also declined to 24.40% from 31.02% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731511865000,
            "Source": "result"
        },
        {
            "Title": "Ramky Infrastructure Reports Q2 FY24 Financial Results",
            "Summary": "Ramky Infrastructure announced its Q2 FY24 financial results. The company reported a consolidated net profit of 781 million rupees, down from 1.13 billion rupees year-over-year and up from 676 million rupees quarter-over-quarter. Revenue for Q2 stood at 5.3 billion rupees, compared to 5.8 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731511814000,
            "Source": "result"
        }
    ]
}