{
    "Symbol": "RAMRAT",
    "ISIN": "INE207E01023",
    "News": [
        {
            "Title": "Ram Ratna Wires authorizes KMPs for materiality",
            "Summary": "Ram Ratna Wires Limited has authorized four Key Managerial Personnel effective April 01, 2026, for determining materiality of events and making disclosures to stock exchanges under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770384451383,
            "Source": "stocks"
        },
        {
            "Title": "Ram Ratna Wires Q3FY26 profit jumps 75.6% YoY",
            "Summary": "Ram Ratna Wires reported strong Q3FY26 results with net profit rising 75.6% YoY to ₹3,213.72 lakhs. Revenue grew 42.1% to ₹1,24,961.76 lakhs driven by robust performance across segments.",
            "Sentiment": "positive",
            "PublishDate": 1770383972550,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ram Ratna Wires Board Meet Set for Feb 6, 2026",
            "Summary": "Ram Ratna Wires Limited has scheduled its Board meeting for February 06, 2026, to consider and approve Q3FY26 unaudited standalone and consolidated financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769593468705,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ram Ratna Wires Allots 48,000 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Ram Ratna Wires Limited allotted 48,000 equity shares with face value of Rs. 5 each to eligible employees under the RRWL Employee Stock Option Plan-2023 at an exercise price of Rs. 100 per share. The allotment increased the company's paid-up share capital from Rs. 23,31,32,680 to Rs. 23,33,72,680, with total issued shares rising to 4,66,74,536.",
            "Sentiment": "positive",
            "PublishDate": 1764226565847,
            "Source": "corporate_action"
        },
        {
            "Title": "Ram Ratna Wires Seeks Shareholder Approval for 1:1 Bonus Share Issue and Capital Increase",
            "Summary": "Ram Ratna Wires Limited has issued a postal ballot notice seeking shareholder approval to increase authorized share capital from Rs 27 crores to Rs 50 crores and issue bonus equity shares in 1:1 ratio to existing members. The e-voting process runs from November 19, 2025 to December 18, 2025, with the bonus issue aimed at rewarding shareholders and increasing share liquidity.",
            "Sentiment": "positive",
            "PublishDate": 1763446364974,
            "Source": "corporate_action"
        },
        {
            "Title": "Ram Ratna Wires Announces 1:1 Bonus Issue with December 26 Record Date",
            "Summary": "Ram Ratna Wires, which has delivered 136% returns over two years, announced a 1:1 bonus share issue with December 26 as the record date for shareholder eligibility. The company reported strong quarterly results with PAT of Rs 21.8 crore (29.9% YoY growth) and revenue of Rs 1,163.4 crore (23.8% YoY growth), while the stock has gained 10.73% year-to-date despite recent volatility.",
            "Sentiment": "positive",
            "PublishDate": 1763102069809,
            "Source": "corporate_action"
        },
        {
            "Title": "Ram Ratna Wires Plans Capacity Expansion and Diversification into Renewable Energy Cables",
            "Summary": "Ram Ratna Wires announced plans to expand capacity in copper and aluminium conductors to boost domestic and export sales. The company is investing in renewable energy cables and electric vehicle applications. Ram Ratna Wires reported strong order visibility from infrastructure and energy sectors, which is expected to support steady margin improvement.",
            "Sentiment": "positive",
            "PublishDate": 1762960487121,
            "Source": "stock"
        },
        {
            "Title": "Ram Ratna Wires Announces 1:1 Bonus Share Issue and Reports Strong Quarterly Results",
            "Summary": "Ram Ratna Wires Limited's Board approved a 1:1 bonus share issue, offering one new equity share of Rs. 5 each for every existing share held by members. The bonus issue, subject to shareholder approval through postal ballot, will be funded from Securities Premium Account (Rs. 483.90 lakhs) and Retained Earnings (Rs. 1,847.43 lakhs). Record date is set for December 26, 2025, with bonus shares expected to be credited by January 10, 2026. The company also approved increasing authorized share capital from Rs. 27 crores to Rs. 50 crores. For the quarter ended September 30, 2025, standalone revenue from operations reached Rs. 1,44,720.74 lakhs compared to Rs. 93,044.94 lakhs in the previous year quarter. Net profit stood at Rs. 2,162.45 lakhs versus Rs. 1,888.06 lakhs. On consolidated basis, revenue was Rs. 1,16,339.30 lakhs with net profit of Rs. 2,181.22 lakhs. The company operates in two main segments: Enamelled Wires and Strips, and Copper Tubes and Pipes.",
            "Sentiment": "positive",
            "PublishDate": 1762952986697,
            "Source": "corporate_action"
        },
        {
            "Title": "Ram Ratna Wires Reports Strong Q2 Performance with 54% Jump in EBITDA",
            "Summary": "Ram Ratna Wires delivered robust quarterly results with EBITDA rising to 555 million rupees from 361 million rupees year-over-year. The company's EBITDA margin improved to 4.77% compared to 3.84% in the same period last year. Consolidated net profit increased to 213 million rupees from 175 million rupees year-over-year. Revenue grew significantly to 11.6 billion rupees from 9.39 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762951683373,
            "Source": "earnings"
        },
        {
            "Title": "Ram Ratna Wires Board to Consider Bonus Share Proposal",
            "Summary": "Ram Ratna Wires announced that its board will consider a proposal for issuing bonus shares on November 12.",
            "Sentiment": "positive",
            "PublishDate": 1762521822663,
            "Source": "corporate_action"
        },
        {
            "Title": "Ram Ratna Wires Receives Approval for Bhiwadi Plant Under Rajasthan Investment Promotion Scheme 2024",
            "Summary": "Ram Ratna Wires has received approval for its Bhiwadi plant under the Rajasthan Investment Promotion Scheme 2024. The approval enables the company to proceed with its manufacturing facility in Bhiwadi under the state government's investment promotion initiative.",
            "Sentiment": "positive",
            "PublishDate": 1762512151374,
            "Source": "stock"
        },
        {
            "Title": "Ram Ratna Wires: Promoter Group Entities Complete Share Transfer via Amalgamation Scheme",
            "Summary": "Ram Ratna Research and Holding Private Limited disclosed a share transfer involving 14,75,372 shares (3.16% stake) of Ram Ratna Wires Limited. The transaction occurred through a scheme of amalgamation between Ram Ratna Research and Holdings Private Limited and Jag-Bid Finvest Private Limited with Hemlata Home Solutions Private Limited, approved by the National Company Law Tribunal Mumbai Bench on September 11, 2025, and executed on October 1, 2025. Following the transaction, Jag-Bid Finvest Private Limited's shareholding reduced to zero from 3.16%. The overall promoter and promoter group holding remains unchanged at 3,21,39,492 equity shares, representing 68.93% of Ram Ratna Wires' total equity share capital of INR 23,31,32,680, as all entities involved belong to the same promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1759493500270,
            "Source": "corporate_action"
        },
        {
            "Title": "Ram Ratna Wires Announces Multi-Pronged Growth Strategy to Boost Profitability by FY27",
            "Summary": "Ram Ratna Wires has launched a comprehensive growth plan targeting improved profits by FY27. The strategy includes expanding production capacity, transitioning to green energy operations, increasing export activities, and capitalizing on rising demand from the electric vehicle sector.",
            "Sentiment": "positive",
            "PublishDate": 1754579148366,
            "Source": "stock"
        },
        {
            "Title": "Ram Ratna Wires Reports Mixed Q1 Results with Revenue Growth Despite Profit Decline",
            "Summary": "Ram Ratna Wires reported consolidated net profit of 155 million rupees in Q1, down from 166 million rupees in the same period last year. However, the company's revenue increased to 9.8 billion rupees compared to 8.9 billion rupees year-over-year, showing growth in top-line performance.",
            "Sentiment": "neutral",
            "PublishDate": 1754566818511,
            "Source": "earnings"
        },
        {
            "Title": "RAM RATNA WIRES Reports Q4 Financial Results",
            "Summary": "RAM RATNA WIRES has released its Q4 financial results. The company's EBITDA increased to 454 million rupees from 368 million rupees year-over-year. The EBITDA margin improved to 4.74% from 4.58% in the same period last year. Consolidated net profit for Q4 was 180 million rupees, compared to 199.5 million rupees year-over-year and 181 million rupees quarter-on-quarter. Q4 revenue rose to 9.6 billion rupees from 8 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1750685118000,
            "Source": "result"
        },
        {
            "Title": "Ram Ratna Wires: Capacity Expansion Aims to Double Revenue in Two Years",
            "Summary": "Ram Ratna Wires Ltd. has nearly doubled its total capacity to 65,000 tonnes with a new Bhiwandi facility, potentially doubling revenue in the next two years. The company expects significant growth from Q3 onwards, particularly in copper tube production. Margins are expected to remain steady at 4-5%, but absolute EBITDA is anticipated to increase significantly.",
            "Sentiment": "positive",
            "PublishDate": 1750123607000,
            "Source": "normal_news"
        },
        {
            "Title": "RAM RATNA WIRES Reports Q4 Results and Dividend Recommendation",
            "Summary": "RAM RATNA WIRES has announced its quarterly results and dividend recommendation. The company's Q4 consolidated net profit was 158 million rupees, compared to 176 million rupees year-over-year and 164 million rupees quarter-over-quarter. Q4 revenue increased to 9.6 billion rupees from 8 billion rupees year-over-year. EBITDA for Q4 rose to 454 million rupees from 367 million rupees year-over-year, with EBITDA margin improving to 4.74% from 4.58%. The company has recommended a dividend of 2.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748523920000,
            "Source": "result"
        },
        {
            "Title": "Ram Ratna Wires: Q3 Profit Surges 42.58% YoY, Revenue Up 27.24%",
            "Summary": "Ram Ratna Wires reported Q3 FY25 results with profit rising to ₹16.44 crore, up 42.58% YoY. Revenue increased by 27.24% YoY to ₹888.67 crore. EPS grew to ₹3.73, up 42.37% YoY. However, QoQ performance showed a slight decline with revenue down 5.44% and profit down 2.32%.",
            "Sentiment": "positive",
            "PublishDate": 1738217075000,
            "Source": "earnings"
        },
        {
            "Title": "RAM RATNA WIRES Reports Significant EBITDA Growth in Q3",
            "Summary": "RAM RATNA WIRES has reported a substantial increase in its Q3 EBITDA, rising to 390 million rupees from 259 million rupees year-over-year. The company's EBITDA margin also improved, reaching 4.38% compared to 3.71% in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738143931000,
            "Source": "earnings"
        },
        {
            "Title": "RAM RATNA WIRES Reports Increased Q3 Consolidated Net Profit",
            "Summary": "RAM RATNA WIRES has reported a significant increase in its consolidated net profit for the third quarter. The company's net profit rose to 164 million rupees, up from 115 million rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738143832000,
            "Source": "earnings"
        },
        {
            "Title": "RAM RATNA WIRES Reports Q3 Revenue Growth",
            "Summary": "RAM RATNA WIRES has reported a significant increase in its third-quarter revenue. The company's revenue for Q3 stood at 8.8 billion rupees, compared to 6.98 billion rupees in the same period last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738143831000,
            "Source": "earnings"
        },
        {
            "Title": "RAM RATNA WIRES Selected for PLI Scheme in White Goods Sector",
            "Summary": "RAM RATNA WIRES has been selected under the Production Linked Incentive (PLI) Scheme for White Goods, specifically for air conditioners (ACs) and LED lights. The company has committed to an investment of Rs. 253 crore as part of this scheme.",
            "Sentiment": "positive",
            "PublishDate": 1737356337000,
            "Source": "corporate_action"
        },
        {
            "Title": "RAM RATNA WIRES Reports Q2 Financial Results",
            "Summary": "RAM RATNA WIRES has reported its Q2 financial results. The company's EBITDA for Q2 increased to 361 million rupees, up from 315 million rupees in the same quarter last year. However, the EBITDA margin decreased to 3.84% from 4.17% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730126385000,
            "Source": "result"
        },
        {
            "Title": "RAM RATNA WIRES Reports Q2 Profit and Revenue Growth",
            "Summary": "RAM RATNA WIRES has announced its Q2 financial results. The company's consolidated net profit increased to 168 million rupees, up from 137 million rupees year-over-year and 138 million rupees quarter-over-quarter. Revenue also saw significant growth, reaching 9.39 billion rupees compared to 7.57 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730126315000,
            "Source": "result"
        },
        {
            "Title": "RAM RATNA WIRES to Acquire 60% Stake in TEFABO PRODUCT",
            "Summary": "<p>The board of <span class='neutral'>RAM RATNA WIRES</span> has <span class='positive'>approved</span> the <span class='positive'>acquisition</span> of <b>60%</b> of the share capital of <span class='neutral'>TEFABO PRODUCT</span>, a company specializing in <span class='neutral'>manufacturing</span> fabricated components and assemblies.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728915335000,
            "Source": "corporate_action"
        }
    ]
}