{
    "Symbol": "RANASUG",
    "ISIN": "INE625B01014",
    "News": [
        {
            "Title": "Rana Sugars Credit Rating Continues Under Watch",
            "Summary": "Infomerics maintains IVR BBB- rating under watch with developing implications for Rana Sugars' ₹165.80 crore facilities amid ongoing regulatory investigations by SEBI, ED, and IT Department.",
            "Sentiment": "negative",
            "PublishDate": 1765458728163,
            "Source": "stocks"
        },
        {
            "Title": "Rana Sugars Reports Q2 FY26 Loss of Rs 412.95 Lakhs Despite Revenue Growth",
            "Summary": "Rana Sugars Limited posted a net loss of Rs 412.95 lakhs for the quarter ended September 30, 2025, compared to Rs 1,478.05 lakhs loss in the same quarter last year, with revenue from operations rising to Rs 53,090.41 lakhs. The company's board approved the unaudited quarterly and half-yearly financial results, showing improved performance across its sugar, distillery and power segments despite continuing losses.",
            "Sentiment": "neutral",
            "PublishDate": 1763465664619,
            "Source": "earnings"
        },
        {
            "Title": "Rana Sugars Limited Independent Director Resigns Due to Legal Practice Commitments",
            "Summary": "Mr. Harneet Singh Oberoi resigned as Independent Director of Rana Sugars Limited effective November 15, 2025, citing preoccupation with his legal profession and practice making it difficult to fulfill board duties. The resignation affects the company's board composition, with Oberoi confirming no material reasons beyond his stated professional commitments for the departure.",
            "Sentiment": "neutral",
            "PublishDate": 1763205487893,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rana Sugars Reports Q2 FY26 Loss of Rs 412.95 Lakhs Despite Revenue Growth",
            "Summary": "Rana Sugars Limited posted a net loss of Rs 412.95 lakhs for the quarter ended September 30, 2025, compared to Rs 1,478.05 lakhs loss in the same quarter last year, with total income rising to Rs 3,891.85 lakhs from Rs 3,073.50 lakhs. The company's board approved the unaudited quarterly and half-yearly financial results along with segment reporting for sugar, distillery, and power business segments.",
            "Sentiment": "negative",
            "PublishDate": 1763115771433,
            "Source": "earnings"
        },
        {
            "Title": "Rana Sugars Appoints Sanjay Kumar Goyal as Senior Vice President",
            "Summary": "Rana Sugars Limited has appointed Mr. Sanjay Kumar Goyal as Senior Vice President in the category of Senior Management Personnel, effective November 7, 2025. The appointment was approved by the Board of Directors on November 6, 2025, based on the recommendation of the Nomination and Remuneration Committee. Goyal is a qualified Chartered Accountant with approximately 30 years of experience in multi-functional fields within the Corporate Sector, including accounting, budgeting, MIS, SAP, strategy, finance, auditing, and project implementation.",
            "Sentiment": "positive",
            "PublishDate": 1762503264171,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rana Sugars Reports Loss of Rs 253.18 Lakhs in Q1 FY26, Appoints New Independent Director",
            "Summary": "Rana Sugars Limited reported a net loss of Rs 253.18 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 189.90 lakhs in the same quarter last year. Revenue from operations increased to Rs 53,090.41 lakhs from Rs 46,203.92 lakhs year-on-year. The company's sugar segment recorded a loss of Rs 1,841.25 lakhs, while power and distillery segments showed profits of Rs 451.24 lakhs and Rs 1,169.77 lakhs respectively. Basic earnings per share stood at negative Rs 0.16. The Board also appointed Mr. Anil Singh Negi as Additional Director in the Independent Director category for a five-year term, subject to shareholder approval. Mr. Negi is a Company Secretary with over three decades of experience in company law and securities regulations.",
            "Sentiment": "negative",
            "PublishDate": 1755181031225,
            "Source": "earnings"
        },
        {
            "Title": "Rana Sugars Ltd: Q3 Profit Soars, Stock Jumps 5% Amid Market Weakness",
            "Summary": "Rana Sugars Ltd reported a significant increase in Q3 FY25 net profit to ₹14.20 crore, up from ₹5.5 crore year-over-year. Revenue rose 16% to ₹390.35 crore. The stock opened 8% higher and reached intraday highs of ₹15.35, gaining over 12% despite overall market weakness.",
            "Sentiment": "positive",
            "PublishDate": 1740987740000,
            "Source": "earnings"
        }
    ]
}