{
    "Symbol": "RANEHOLDIN",
    "ISIN": "INE384A01010",
    "News": [
        {
            "Title": "Rane Holdings Q3FY26 Earnings Call Set for Feb 17",
            "Summary": "Rane Holdings Limited announces earnings conference call scheduled for February 17, 2026 at 15:00 IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770723809712,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rane Holdings announces KMP changes in subsidiary",
            "Summary": "Rane Holdings Limited announces key managerial personnel changes at wholly owned subsidiary Rane Steering Systems Private Limited, with new Company Secretary appointment effective February 04, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770125255561,
            "Source": "stocks"
        },
        {
            "Title": "Rane Holdings subsidiary faces ₹4.91 cr tax demand",
            "Summary": "Rane Steering Systems receives tax order for ₹4.91 crores including penalty and interest from Haryana tax authorities for employee secondment and input tax issues during FY22.",
            "Sentiment": "negative",
            "PublishDate": 1766731742730,
            "Source": "stocks"
        },
        {
            "Title": "Rane Holdings Gets Credit Rating Reaffirmation",
            "Summary": "ICRA Limited reaffirms ICRA AA- (Stable) rating for Rane Holdings' ₹100 crore bank facilities, maintaining stable outlook across term loans and credit facilities.",
            "Sentiment": "positive",
            "PublishDate": 1766051198204,
            "Source": "stocks"
        },
        {
            "Title": "Rane Holdings Reports Strong Q2FY26 Results with 53.2% Revenue Growth and Major Order Wins",
            "Summary": "Rane Holdings achieved consolidated revenue of Rs 1,409.8 crores with 53.2% YoY growth and PAT of Rs 31.3 crores in Q2FY26, while maintaining EBITDA margin of 7.6%. The company's subsidiaries secured significant new orders worth Rs 511 crores across steering, safety systems, and automotive components, strengthening their position with major OEM customers including Tata Motors, Volvo, and Escorts Kubota.",
            "Sentiment": "positive",
            "PublishDate": 1763142454943,
            "Source": "earnings"
        },
        {
            "Title": "Rane Holdings Reports Strong Q2 Performance with 4,739 Lakh Standalone Profit",
            "Summary": "Rane Holdings Limited posted standalone profit of Rs. 4,739 lakhs for the quarter ended September 30, 2025, with total income reaching Rs. 7,653 lakhs. The company's consolidated results showed profit of Rs. 3,126 lakhs for the quarter, with earnings per share of Rs. 16.45 on both basic and diluted basis.",
            "Sentiment": "mixed",
            "PublishDate": 1763104908229,
            "Source": "earnings"
        },
        {
            "Title": "Rane Holdings Limited Schedules Earnings Conference Call for Q2 FY26 Results",
            "Summary": "Rane Holdings Limited has announced an earnings conference call scheduled for November 18, 2025, at 15:00 hours IST to discuss unaudited financial results for the quarter ended September 30, 2025. The call will be hosted by management of Rane Group of Companies, including Rane (Madras) Limited and Rane Holdings Limited. Key participants include Chairman Harish Lakshman, President-Finance and Group CFO P.A. Padmanabhan, and other senior executives. The presentation and transcript will be made available on the company's website. Rane Group is headquartered in Chennai and manufactures auto components including steering and suspension systems, brake components, engine components, occupant safety systems, and light metal casting components for various industry segments including passenger vehicles, commercial vehicles, farm tractors, two-wheelers, three-wheelers, railways, and stationary engines.",
            "Sentiment": "neutral",
            "PublishDate": 1762889196709,
            "Source": "earnings"
        },
        {
            "Title": "Rane Holdings Subsidiary Receives Reduced Tax Demand of Rs 1.09 Lakhs",
            "Summary": "Rane Steering Systems Private Limited, a wholly owned subsidiary of Rane Holdings Limited, received a final order from Assistant Commissioner (ST), Chennai (South) Division imposing a total demand of Rs 1.09 lakhs (including tax, interest and penalty). This represents a significant reduction from the previous demand of Rs 20.21 crores mentioned in a show cause notice dated September 29, 2025. The order relates to differences in Input Tax Credit (ITC) appearing in GSTR-2A and ITC availed in GSTR-3B. The authority accepted the company's explanations and submissions after reviewing the documents. The company plans to pay the demand within the statutory timeline and does not intend to pursue the matter further.",
            "Sentiment": "positive",
            "PublishDate": 1762800386582,
            "Source": "stock"
        },
        {
            "Title": "Rane Holdings Approves Rs 25 Crore Inter-Corporate Loan to Subsidiary",
            "Summary": "Rane Holdings Limited's Finance Committee approved funding support of up to Rs 25 crores to its wholly-owned subsidiary Rane Steering Systems Private Limited through a short-term inter-corporate loan. The loan will be disbursed in one or more tranches for general corporate purposes and operational expenses. The agreement is structured as a short-term loan of up to 1 year with rollover option based on mutual agreement. Interest is payable monthly with quarterly reset. The transaction is conducted at arm's length between the parent company and its 100% owned subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1762332039651,
            "Source": "corporate_action"
        },
        {
            "Title": "Rane Holdings' Subsidiary Faces Rs 6.74 Crore Tax Demand After Appeal Dismissal",
            "Summary": "Rane Steering Systems Private Limited, a wholly owned subsidiary of Rane Holdings Limited, received an order from the Income Tax Department National Faceless Appeal Centre dismissing the company's appeal against an order under Section 147 of the Income Tax Act. The order disallows certain revenue expenses under Section 37 of the Income Tax Act and adds them back to income for Assessment Year 2015-16 (Financial Year 2014-15). This results in a tax demand of Rs 6.74 crore. The subsidiary plans to file a statutory appeal/stay order within the prescribed time limits.",
            "Sentiment": "negative",
            "PublishDate": 1757432745849,
            "Source": "stock"
        },
        {
            "Title": "Rane Holdings Infuses ₹50 Crore in Subsidiary Rane Steering Systems",
            "Summary": "Rane Holdings has invested ₹50 crore in its wholly-owned subsidiary Rane Steering Systems through a rights issue of 20 lakh shares priced at ₹250 each. The capital infusion is intended to strengthen the subsidiary's capital base for operational and growth requirements. The company maintains 100% ownership of Rane Steering Systems following this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1755599405169,
            "Source": "corporate_action"
        },
        {
            "Title": "Rane Holdings Secures Over ₹330 Crore in New Orders with Strategic Capacity Expansion",
            "Summary": "Rane Holdings has secured new orders worth over ₹330 crore from diversified original equipment manufacturers (OEMs). The company is implementing strategic capacity enhancements as part of its growth acceleration strategy in the global automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1755013690921,
            "Source": "order&deals"
        },
        {
            "Title": "Rane Holdings Reports Strong Q1 Performance with Consolidated Profit Rising to Rs 5,749 Lakhs",
            "Summary": "Rane Holdings Limited announced its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 2,573 lakhs and profit of Rs 681 lakhs, with earnings per share of Rs 4.77. On a consolidated basis, revenue from operations reached Rs 1,34,082 lakhs with profit of Rs 5,749 lakhs and earnings per share of Rs 35.57. The consolidated results included exceptional income of Rs 1,546 lakhs primarily from land sale and insurance claims. The company's subsidiary Rane (Madras) Limited entered into an agreement to sell 3.48 acres of land in Velachery for Rs 36,118 lakhs and has received an advance of Rs 10,000 lakhs. The Board approved an investment of Rs 5,000 lakhs in wholly owned subsidiary Rane Steering Systems Private Limited through a rights issue.",
            "Sentiment": "positive",
            "PublishDate": 1754986526769,
            "Source": "earnings"
        },
        {
            "Title": "Rane Holdings Reports 38% Revenue Growth in Q1 Despite Margin Compression",
            "Summary": "Rane Holdings reported Q1 revenue of 13.1 billion rupees, representing a significant increase from 8.3 billion rupees in the same period last year. The company's EBITDA rose to 1.01 billion rupees compared to 732 million rupees year-over-year. However, EBITDA margin declined to 7.61% from 8.81% in the previous year's corresponding quarter, indicating margin pressure despite strong revenue growth.",
            "Sentiment": "neutral",
            "PublishDate": 1754985847426,
            "Source": "earnings"
        },
        {
            "Title": "Rane Holdings Reports 288% Jump in Quarterly Net Profit to 508 Million Rupees",
            "Summary": "Rane Holdings reported a consolidated net profit of 508 million rupees for the quarter, representing a significant increase from 131 million rupees in the same period last year. This marks a year-over-year growth of 288% in quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1754985296783,
            "Source": "earnings"
        },
        {
            "Title": "Rane Holdings' Subsidiary Fully Repays Rs. 50 Crore Loan",
            "Summary": "Rane Holdings Limited announced that its wholly owned subsidiary, Rane Steering Systems Private Limited, has fully repaid a Rs. 50 crore loan borrowed from the company. The subsidiary, formerly known as Rane NSK Steering Systems Private Limited, has no outstanding balance remaining on the loan.",
            "Sentiment": "positive",
            "PublishDate": 1754655016507,
            "Source": "stock"
        },
        {
            "Title": "Rane Holdings Reports Q4 Financial Results",
            "Summary": "Rane Holdings announced its Q4 financial results. The company's EBITDA increased to 953 million rupees from 833 million rupees year-over-year. However, the EBITDA margin decreased to 6.94% from 9.58% compared to the same period last year. Revenue for Q4 grew significantly to 14 billion rupees from 8.7 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748592179000,
            "Source": "result"
        },
        {
            "Title": "Rane Holdings Reports Q4 Results and Dividend Declaration",
            "Summary": "Rane Holdings announced its quarterly results, with consolidated net profit at 94 million rupees compared to 314 million rupees in the same period last year. The company also declared a dividend of 38 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748592146000,
            "Source": "result"
        },
        {
            "Title": "Rane Holdings Sells Tamil Nadu Land for 505 Million Rupees",
            "Summary": "Rane Holdings has sold a parcel of land in Tamil Nadu to Estancia IT Park Pvt Ltd for 505 million rupees. This transaction represents a significant corporate action involving the sale of a company asset.",
            "Sentiment": "neutral",
            "PublishDate": 1743767628000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rane Holdings to Provide Additional Funding to RSSL",
            "Summary": "Rane Holdings has announced its decision to provide additional funding support of up to 250 million rupees to RSSL (presumably Rane Steering Systems Limited, a subsidiary). This move indicates a significant financial commitment from the parent company to support its subsidiary's operations or growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1739536408000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rane Holdings Reports Significant Drop in Q3 Net Profit",
            "Summary": "Rane Holdings announced its Q3 financial results, revealing a substantial decrease in consolidated net profit from 390 million rupees to 32 million rupees year-over-year. However, the company's revenue saw a notable increase, rising from 8.37 billion rupees to 12 billion rupees in the same period.",
            "Sentiment": "negative",
            "PublishDate": 1738826993000,
            "Source": "earnings"
        },
        {
            "Title": "Rane Holdings Reports Q2 Results with Exceptional Item",
            "Summary": "Rane Holdings has reported an exceptional item of 2.1 billion rupees in its financial results. The company's Q2 profit before tax (PBT) is 344 million rupees, compared to 365 million rupees in the previous comparable period.",
            "Sentiment": "neutral",
            "PublishDate": 1730794825000,
            "Source": "result"
        },
        {
            "Title": "Rane Holdings Reports Improved Q2 EBITDA and Margin",
            "Summary": "Rane Holdings announced its Q2 financial results, showing an increase in EBITDA to 812 million rupees from 703 million rupees year-over-year. The company's EBITDA margin also improved to 8.86% from 7.57% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730794351000,
            "Source": "result"
        },
        {
            "Title": "Rane Holdings Reports Q2 Revenue",
            "Summary": "Rane Holdings announced its second quarter revenue of 9.2 billion rupees, compared to 9.28 billion rupees in the same quarter last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1730794348000,
            "Source": "result"
        },
        {
            "Title": "Rane Holdings Reports Significant Profit Increase in Q2",
            "Summary": "Rane Holdings has announced a substantial increase in consolidated net profit for the second quarter. The company's net profit rose to 1.85 billion rupees, up from 511 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730794326000,
            "Source": "result"
        }
    ]
}