{
    "Symbol": "RATEGAIN",
    "ISIN": "INE0CLI01024",
    "News": [
        {
            "Title": "RateGain Grants 40,183 SAR Units Under Employee Scheme",
            "Summary": "RateGain Travel Technologies approved grant of 40,183 Stock Appreciation Rights units under SAR Scheme 2022, with prices ranging from Rs.651.5 to Rs.667.45 per unit and 4-year vesting period.",
            "Sentiment": "positive",
            "PublishDate": 1770616146706,
            "Source": "stocks"
        },
        {
            "Title": "RateGain UK Unit Prepays USD 19 Million Loan",
            "Summary": "RateGain Travel Technologies' UK subsidiary prepaid USD 19 million loan to HSBC and Citibank, reducing outstanding debt to USD 99.75 million from USD 125 million facility.",
            "Sentiment": "positive",
            "PublishDate": 1770309320460,
            "Source": "stocks"
        },
        {
            "Title": "Plutus Wealth Management discloses stake changes in RateGain",
            "Summary": "Plutus Wealth Management LLP and its PACs disclosed substantial acquisition/sale transactions in RateGain Travel Technologies Limited, with combined holdings changing from 6.39% to 6.38% during January 22-23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769514838038,
            "Source": "co_actions_results"
        },
        {
            "Title": "RateGain Expands AI Concierge Partnership",
            "Summary": "RateGain Travel Technologies strengthens partnerships with Sojern and Red Roof to implement AI concierge solutions across 700 hotel locations for enhanced guest services.",
            "Sentiment": "positive",
            "PublishDate": 1769493765031,
            "Source": "stocks"
        },
        {
            "Title": "RateGain Travel clarifies volume surge compliance",
            "Summary": "RateGain Travel Technologies responds to BSE inquiry about trading volume increase, confirms regulatory compliance and states no undisclosed price-sensitive information pending disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1769154847773,
            "Source": "stocks"
        },
        {
            "Title": "RateGain Travel Tech Strengthens Leadership Team",
            "Summary": "RateGain Travel Technologies enhances its global people and culture leadership structure to support the company's next phase of growth and expansion initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1768807940339,
            "Source": "stocks"
        },
        {
            "Title": "RateGain Allots 22,081 Shares Under SAR Scheme",
            "Summary": "RateGain Travel Technologies allotted 22,081 equity shares to employees under Stock Appreciation Rights Scheme 2022, increasing paid-up capital to ₹11.81 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768479739750,
            "Source": "co_actions_results"
        },
        {
            "Title": "RateGain Partners with Sunlight Air for AI Pricing",
            "Summary": "RateGain Travel Technologies announces partnership with Philippines-based Sunlight Air to provide AI-powered pricing intelligence through AirGain platform for Southeast Asia expansion.",
            "Sentiment": "positive",
            "PublishDate": 1768457170086,
            "Source": "stocks"
        },
        {
            "Title": "Sojern Named Best Digital Marketing Agency for Hotels",
            "Summary": "RateGain's subsidiary Sojern wins top honor at 2026 HotelTechAwards, strengthening the company's position in AI-powered hospitality marketing solutions globally.",
            "Sentiment": "positive",
            "PublishDate": 1768284358116,
            "Source": "stocks"
        },
        {
            "Title": "Sojern Wins Top Digital Marketing Award at HotelTech",
            "Summary": "RateGain Travel Tech's subsidiary Sojern has been recognized as the leading digital marketing agency for hotels at the 2026 HotelTechAwards, highlighting its AI-driven marketing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1768284172747,
            "Source": "stocks"
        },
        {
            "Title": "RateGain partners with Aztech Digital for Europe expansion",
            "Summary": "RateGain Travel Technologies announces exclusive partnership with Aztech Digital to expand AI voice solution UNO VIVA in Greece and Cyprus, targeting significant operational improvements and revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1767850411201,
            "Source": "stocks"
        },
        {
            "Title": "RateGain Allots 22,278 Equity Shares Under SAR Scheme",
            "Summary": "RateGain Travel Technologies allotted 22,278 equity shares to employees under Stock Appreciation Rights Scheme-2022, increasing paid-up share capital to ₹11.81 crores on December 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765972433850,
            "Source": "co_actions_results"
        },
        {
            "Title": "RateGain Elevated to Favored Partner by Trip.com",
            "Summary": "RateGain Travel Technologies has been recognized by Trip.com as a Favored Connectivity Partner for 2025, elevating from its previous Preferred Partner status after a decade-long collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1765863162488,
            "Source": "stocks"
        },
        {
            "Title": "RateGain's UNO Channel Manager Wins Global Award 2025",
            "Summary": "RateGain Travel Technologies' UNO Channel Manager has been awarded World's Best Hotel Channel Manager 2025 at the World Travel Tech Awards for redefining speed, reliability, and control in hotel distribution.",
            "Sentiment": "positive",
            "PublishDate": 1765430686635,
            "Source": "stocks"
        },
        {
            "Title": "RateGain Integrates UNO Booking Engine with PayU to Enhance India's Swadeshi Tech Ecosystem",
            "Summary": "RateGain Travel Technologies announced integration of its UNO Booking Engine with PayU, India's leading fintech platform, to deliver AI-powered booking and digital payment experiences for Indian hotels. The collaboration strengthens India's Swadeshi technology ecosystem by combining AI-driven personalization, real-time booking capabilities with secure payment options including UPI, wallets, cards, and PayLater to help hotels increase direct bookings and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1765258208600,
            "Source": "stock"
        },
        {
            "Title": "RateGain Launches Rev-AI Clarity Revenue Assistant for Car Rental Industry",
            "Summary": "RateGain Travel Technologies Limited launched Rev-AI Clarity, an AI-powered revenue assistant designed specifically for car rental operators to convert complex demand, pricing, and performance data into conversational insights. The product enables revenue teams to receive instant, decision-ready intelligence on pricing recommendations, demand forecasting, and performance metrics, integrating seamlessly with RateGain's existing Rev-AI suite.",
            "Sentiment": "positive",
            "PublishDate": 1764826532044,
            "Source": "stock"
        },
        {
            "Title": "Singapore Airlines Extends Partnership with RateGain for Four More Years",
            "Summary": "RateGain Travel Technologies announced the renewal of its partnership with Singapore Airlines for another long-term contract, extending their successful seven-year collaboration with AirGain pricing intelligence platform that began in January 2018. The partnership extension allows Singapore Airlines to continue leveraging AI-driven pricing insights and real-time competitive intelligence to maintain its market leadership and optimize revenue opportunities across global markets.",
            "Sentiment": "positive",
            "PublishDate": 1764221271381,
            "Source": "order&deals"
        },
        {
            "Title": "RateGain Travel Technologies Forms Strategic Alliance With Arpón Enterprise",
            "Summary": "RateGain Travel Technologies has entered into a strategic alliance with Arpón Enterprise to integrate Property Management System (PMS) and channel manager solutions. The partnership aims to enhance revenue generation and improve operational efficiency for hotels through combined technology offerings.",
            "Sentiment": "positive",
            "PublishDate": 1764047933042,
            "Source": "order&deals"
        },
        {
            "Title": "RateGain Partners with HotelIQ to Integrate Real-Time Rate Shopping Solution",
            "Summary": "RateGain Travel Technologies announced a strategic partnership with HotelIQ to integrate its Navigator rate shopping solution into HotelIQ's business intelligence platform for hotels worldwide. The collaboration enables hotels to access real-time competitor rate data directly within HotelIQ's platform, eliminating the need for separate tools and providing comprehensive visibility across 1,100+ sources and 800+ OTAs.",
            "Sentiment": "positive",
            "PublishDate": 1763702942379,
            "Source": "stock"
        },
        {
            "Title": "RateGain Travel Technologies Unveils New Logo to Reflect AI-Focused Strategy",
            "Summary": "RateGain Travel Technologies revealed a new logo that represents its transformation into an AI-focused travel technology leader. The new identity is designed to signify innovation, clarity, precision, and agility as the company repositions itself in the travel tech sector.",
            "Sentiment": "positive",
            "PublishDate": 1763530315406,
            "Source": "stock"
        },
        {
            "Title": "RateGain Promoter Bhanu Chopra Increases Stake Through Open Market Purchase",
            "Summary": "Bhanu Chopra, promoter of RateGain Travel Technologies Limited, acquired 1,43,700 shares (0.12%) through open market transactions on November 14, 2025. His shareholding increased from 37.67% to 37.79% of the company's total voting capital of 11,80,79,758 fully paid-up equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1763385312445,
            "Source": "corporate_action"
        },
        {
            "Title": "Tigerair Taiwan Partners with RateGain to Strengthen Pricing Intelligence Across Key Asian Markets",
            "Summary": "RateGain Travel Technologies Limited announced that Tigerair Taiwan has selected AirGain, RateGain's competitive benchmarking product, to enhance its pricing intelligence and competitive positioning in Asia's travel market. Taiwan's only low-cost carrier will leverage AirGain's real-time insights and VUE dashboard to deliver competitive fares while protecting profitability. The AirGain VUE platform transforms complex airfare data into unified competitive insights, demand shifts, and pricing variances through an intuitive dashboard with real-time monitoring across OTAs and airline websites. The partnership includes AI-powered Route Performance Digest, an automated daily report highlighting anomalies and route-level performance gaps. RateGain works with 3,200+ customers and 700+ partners in 100+ countries, processing electronic transactions, price points, and travel intent data for hotels, airlines, and other travel companies.",
            "Sentiment": "positive",
            "PublishDate": 1763012628172,
            "Source": "order&deals"
        },
        {
            "Title": "RateGain Travel Tech Raises FY26 Revenue Growth Forecast to 55-60%",
            "Summary": "RateGain Travel Tech has updated its FY26 financial guidance, boosting revenue growth forecast to 55-60% year-over-year. The company maintains its organic growth projection at 6-8% for FY26. Management anticipates full-year EBITDA margin of 16-17% and expects EBITDA exit rate to reach 17-18% by March 2026. The guidance updates were provided following a conference call, with management's approach characterized as cautiously conservative.",
            "Sentiment": "positive",
            "PublishDate": 1762919253617,
            "Source": "stock"
        },
        {
            "Title": "RateGain Travel Technologies Submits QIP Monitoring Report for Quarter Ended September 2025",
            "Summary": "RateGain Travel Technologies Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its Qualified Institutional Placement (QIP). The QIP was conducted from November 15-20, 2023, raising gross proceeds of Rs 6,000 million and net proceeds of Rs 5,862.91 million. CRISIL Ratings Limited, serving as the monitoring agency, reported no utilization of QIP proceeds during the quarter. The entire amount of Rs 5,862.91 million remains unutilized and is parked in fixed deposits with HDFC Bank. The company announced the acquisition of Sojern Group on September 30, 2025, which will be funded through the QIP proceeds. The funds are intended for strategic investments, acquisitions, and inorganic growth as disclosed in the original offer document.",
            "Sentiment": "neutral",
            "PublishDate": 1762865429125,
            "Source": "corporate_action"
        },
        {
            "Title": "RateGain Travel Technologies Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "RateGain Travel Technologies Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the results in a meeting held on November 11, 2025. The company operates in the information technology services segment, providing innovative solutions to clients in the hospitality and travel industry. The results include both standalone and consolidated financial statements along with cash flow statements. The company has also completed an acquisition of Sojern Inc., a US-based AI-powered hospitality and travel marketing platform company, for USD 250 million on November 8, 2025, funded through a secured term loan of USD 125 million and internal funds of USD 125 million.",
            "Sentiment": "neutral",
            "PublishDate": 1762845207537,
            "Source": "earnings"
        },
        {
            "Title": "RateGain Travel Tech Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "RateGain Travel Tech announced its Q2 financial results showing revenue growth to 2.95 billion rupees from 2.77 billion rupees year-over-year. However, the company experienced a decline in profitability with EBITDA dropping to 535 million rupees from 602 million rupees compared to the same period last year. The EBITDA margin also compressed to 18.2% from 21.71% year-over-year. Consolidated net profit decreased slightly to 510 million rupees from 522 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762842400645,
            "Source": "earnings"
        },
        {
            "Title": "RateGain Travel Technologies Grants 2,817 Stock Appreciation Rights Units",
            "Summary": "RateGain Travel Technologies Limited granted 2,817 Stock Appreciation Rights (SAR) units under its SAR Scheme-2022. The SAR units are priced at Rs. 649 per unit and follow a 4-year vesting schedule with 10% vesting in year 1, 20% in year 2, 30% in year 3, and 40% in year 4. The exercise period is within three years from the date of vesting. The grant was approved by the company's Nomination and Remuneration Committee on November 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762807693391,
            "Source": "corporate_action"
        },
        {
            "Title": "RateGain Travel Technologies Completes Acquisition of Sojern Inc.",
            "Summary": "RateGain Travel Technologies Limited has completed the acquisition of Sojern Inc. and its subsidiaries on November 6, 2025. The acquisition was executed through RateGain's wholly owned subsidiary, RateGain Merger Sub, Inc., following definitive agreements entered into previously. Sojern Inc. is now a wholly owned subsidiary of RateGain Technologies Limited, UK and a wholly owned step-down subsidiary of RateGain Travel Technologies Limited. The company had previously disclosed this acquisition plan in September and October 2025 filings.",
            "Sentiment": "positive",
            "PublishDate": 1762382096279,
            "Source": "order&deals"
        },
        {
            "Title": "RateGain Partners with FLYR to Integrate Hotel Pricing Solutions Globally",
            "Summary": "RateGain Travel Technologies Limited announced a strategic partnership with FLYR, a Revenue Management System provider in the United States. Under this agreement, FLYR will offer RateGain's software products, including the Navigator platform, to hotel customers worldwide. The partnership combines RateGain's Navigator with FLYR's platform to deliver real-time rate intelligence and actionable insights for hotel pricing decisions. FLYR Hospitality will offer these solutions to hotel customers with support from RateGain's product resources and demonstration environments. The collaboration aims to help hotels access more insights, make faster decisions, and improve commercial outcomes through AI-driven revenue and business intelligence capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1761879013831,
            "Source": "order&deals"
        },
        {
            "Title": "RateGain Travel Technologies Expands Partnership with Royal Orchid Hotels and Iconiqa Hotels & Resorts",
            "Summary": "RateGain Travel Technologies has expanded its partnership with Royal Orchid Hotels and Iconiqa Hotels & Resorts. The collaboration aims to enhance guest experience through the implementation of RateGain's AI-powered Uno Suite technology, which is designed to increase direct bookings and revenue for the hotel partners.",
            "Sentiment": "positive",
            "PublishDate": 1761630778066,
            "Source": "stock"
        },
        {
            "Title": "RateGain Travel Technologies Wins Service Tax Appeal, Rs 5.97 Crore Demand Dropped",
            "Summary": "RateGain Travel Technologies Limited received a favorable order from the Customs, Excise and Service Tax Appellate Tribunal (CESTAT) that sets aside a service tax demand of Rs. 5,97,36,178 plus interest and penalties. The demand was related to alleged non-payment of service tax under the reverse charge mechanism on certain foreign payments. The company had appealed against the Commissioner of Service Tax's demand order, and CESTAT allowed the appeal in favor of the company. This matter was previously disclosed as pending litigation during the company's IPO. The company states there is no impact on its financial, operational or other activities from this development.",
            "Sentiment": "positive",
            "PublishDate": 1760092012260,
            "Source": "stock"
        },
        {
            "Title": "RateGain Travel Technologies Partners with Sunrise Airways for Pricing Optimization in Caribbean Market",
            "Summary": "RateGain Travel Technologies has entered into a collaboration with Sunrise Airways to enhance the airline's pricing strategy for Caribbean operations. Sunrise Airways has selected RateGain's AirGain solution for instant fare optimization. The partnership aims to improve competitiveness and cost-effectiveness in air travel for the airline.",
            "Sentiment": "positive",
            "PublishDate": 1759901557263,
            "Source": "stock"
        },
        {
            "Title": "RateGain Launches AI-Powered Social Media Tool for Hotels",
            "Summary": "RateGain has introduced an AI-driven social media tool designed to improve guest interaction for hotels. The new technology aims to enhance how hotels engage with their guests through social media platforms.",
            "Sentiment": "positive",
            "PublishDate": 1759728955174,
            "Source": "stock"
        },
        {
            "Title": "RateGain Travel Technologies Acquires Sojern for $250 Million to Strengthen AI-Led Hospitality Platform",
            "Summary": "RateGain Travel Technologies Limited has entered into a definitive agreement to acquire Sojern, Inc. and its subsidiaries for $250 million through its wholly-owned subsidiary RateGain Merger Sub, Inc. Sojern, founded in 2007 and headquartered in the USA, offers AI-powered hospitality and travel marketing platforms, serving over 13,000 customers worldwide with annual gross revenue of $172.2 million in 2024. The acquisition aims to enhance RateGain's AI-first strategy by combining Sojern's demand-generation capabilities with RateGain's existing distribution, analytics, and revenue optimization solutions. The transaction will be funded through a mix of RateGain's internal cash reserves ($125 million) and debt ($125 million). The deal is expected to complete within 45-90 days subject to regulatory approvals including anti-trust approvals under US competition laws. RateGain has also approved additional investment in its UK subsidiary and issuance of corporate guarantee up to $150 million for loan facilities. The company has scheduled a business update call for October 6, 2025, and announced a board meeting to consider raising funds through equity shares, convertible securities, or warrants.",
            "Sentiment": "positive",
            "PublishDate": 1759284332052,
            "Source": "order&deals"
        },
        {
            "Title": "RateGain Travel Technologies Appoints Amarpreet Singh as Chief Customer Officer",
            "Summary": "RateGain Travel Technologies Limited announced the appointment of Amarpreet Singh as Chief Customer Officer. Singh will lead the company's global customer organization and build a tech-augmented delivery model focused on implementation, onboarding, and value realization across RateGain's platforms. He will use AI to transform customer journeys, automate support, reduce churn, and create growth opportunities while collaborating with Sales, Product, and Engineering teams. Singh brings over two decades of experience from senior roles at Cvent, WNS, Gwynniebee, Sitel and HCL, where he led global teams and drove automation-led success. At Cvent, he managed worldwide support, services, and implementation with strong results in retention, customer satisfaction, and net promoter scores. Singh will be based in India and work with RateGain's global teams to strengthen customer engagement across the AI-powered travel platform.",
            "Sentiment": "positive",
            "PublishDate": 1758778464668,
            "Source": "corporate_governance"
        },
        {
            "Title": "RateGain Integrates Distribution Capabilities with Oracle Hospitality OPERA Cloud Distribution",
            "Summary": "RateGain Travel Technologies Limited announced the integration of its UNO Channel Manager with Oracle Hospitality OPERA Cloud Distribution. The collaboration allows OPERA Cloud customers to connect with RateGain's network of 400+ global demand partners. The integration provides hotels with near real-time control over distribution strategy, enabling precise rate and inventory management, reducing manual errors, eliminating overbookings, and maintaining rate parity. RateGain's Founder and Managing Director Bhanu Chopra stated the solution delivers a single intelligent hub for hoteliers to maximize revenue and optimize efficiency. RateGain works with 3,200+ customers and 700+ partners in 100+ countries, including 26 of the top 30 hotel chains and 25 of the top 30 online travel agents.",
            "Sentiment": "positive",
            "PublishDate": 1758173632828,
            "Source": "stock"
        },
        {
            "Title": "RateGain Wins Excellence Award for AI Voice Agent UNO VIVA at CII National AI Awards 2025",
            "Summary": "RateGain Travel Technologies Limited won the Excellence in Best AI Solution Showcase award for its AI-powered voice agent UNO VIVA at the CII National AI Awards 2025 held during the Global AI Summit in New Delhi. UNO VIVA is described as the industry's first CRS-integrated AI voice agent for hotel revenue teams, featuring real-time responses, end-to-end reservation handling, multilingual support in 30+ languages, and call analytics capabilities. The solution aims to reduce revenue leakage from voice calls and help hotels maximize direct revenue. RateGain is a global provider of AI-powered SaaS solutions for travel and hospitality, working with 3,200+ customers and 700+ partners across 100+ countries.",
            "Sentiment": "positive",
            "PublishDate": 1757051468364,
            "Source": "stock"
        },
        {
            "Title": "Payless Costa Rica Reports 21% Booking Increase Using RateGain's AI Pricing Technology",
            "Summary": "Payless Costa Rica achieved a 21% increase in bookings and 16.5% revenue growth after implementing RateGain Travel Tech's AI pricing solution. The system delivered 94% accuracy in 60-day forecasts and automated over 5,500 daily rate updates for the car rental company.",
            "Sentiment": "positive",
            "PublishDate": 1756965323651,
            "Source": "stock"
        },
        {
            "Title": "RateGain Launches First MCP Integration for Hospitality Booking Engine with AI Assistant Compatibility",
            "Summary": "RateGain has launched the first MCP integration for booking engines in the hospitality industry. The integration is compatible with Claude and other AI assistants, representing a technological advancement in hospitality booking systems.",
            "Sentiment": "positive",
            "PublishDate": 1756790292021,
            "Source": "stock"
        },
        {
            "Title": "RateGain Travel Tech Partners With Profitroom for Middle East and Africa Hotel Distribution",
            "Summary": "RateGain Travel Tech has formed a partnership with Profitroom to enhance hotel distribution services in the Middle East and Africa regions.",
            "Sentiment": "positive",
            "PublishDate": 1756358567580,
            "Source": "stock"
        },
        {
            "Title": "Avis Fargo Achieves 14% Daily Revenue Increase Using RateGain's AI Pricing Technology",
            "Summary": "Avis Fargo reported a 14% increase in revenue per day after implementing RateGain Travel's AI-powered pricing tool for its car rental operations. The artificial intelligence solution appears to have optimized pricing strategies, resulting in improved daily revenue performance for the car rental company.",
            "Sentiment": "positive",
            "PublishDate": 1755150334142,
            "Source": "stock"
        },
        {
            "Title": "RateGain Partners with Air Astana to Improve Pricing Strategy for Central Asia and Global Routes",
            "Summary": "RateGain has entered into a partnership with Air Astana to enhance pricing flexibility and market responsiveness across Central Asia and worldwide routes. The collaboration aims to improve the airline's pricing capabilities in its operational markets.",
            "Sentiment": "positive",
            "PublishDate": 1754975673607,
            "Source": "stock"
        },
        {
            "Title": "RateGain Travel Technologies Releases Q1 FY26 Earnings Call Transcript",
            "Summary": "RateGain Travel Technologies Limited has made available the transcript of its earnings conference call held on August 7, 2025, discussing quarterly financial results for the period ended June 30, 2025. The company has published the full transcript on its investor relations website along with an earnings presentation that was filed with stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1754914862248,
            "Source": "earnings"
        },
        {
            "Title": "RateGain Travel Maintains FY26 Margin Guidance at 15-17%, Targets 20% Organic Growth",
            "Summary": "RateGain Travel has maintained its FY26 margin guidance between 15-17% and stated it prefers not to change this guidance quarterly, while working to exceed these targets. The company aims to reestablish double-digit growth in upcoming years and is targeting 20% organic growth.",
            "Sentiment": "positive",
            "PublishDate": 1754623569737,
            "Source": "stock"
        },
        {
            "Title": "RateGain Travel Tech Reports Mixed Q1 Results with Revenue Growth but Margin Decline",
            "Summary": "RateGain Travel Tech reported Q1 revenue of 2.73 billion rupees, up from 2.6 billion rupees in the same period last year. The company's EBITDA remained nearly flat at 497 million rupees compared to 498 million rupees year-over-year, while EBITDA margin compressed to 18.20% from 19.14% in the previous year. Consolidated net profit increased to 469 million rupees from 454 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754552414529,
            "Source": "earnings"
        },
        {
            "Title": "RateGain Travel Technologies Schedules Board Meeting for August 7 to Approve Quarterly Results",
            "Summary": "RateGain Travel Technologies Limited has scheduled a Board of Directors meeting for August 7, 2025, to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has closed its trading window for designated persons from July 1, 2025, until 48 hours after the financial results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1753956221022,
            "Source": "corporate_action"
        },
        {
            "Title": "RateGain Appoints Parijat Tiwari as EVP & GM for Enterprise Connectivity Division",
            "Summary": "RateGain has appointed Parijat Tiwari as Executive Vice President and General Manager to lead Enterprise Connectivity & Smart Distribution. Tiwari previously held the position of Senior Vice President at Paytm before joining RateGain in this leadership role.",
            "Sentiment": "positive",
            "PublishDate": 1753161368326,
            "Source": "corporate_governance"
        },
        {
            "Title": "RateGain Travel Technologies Partners with Cloudbeds for AI-Powered Hospitality Distribution",
            "Summary": "RateGain Travel Technologies has formed a partnership with Cloudbeds to enhance hospitality distribution using AI technology. This collaboration aims to improve the distribution capabilities in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1751349889000,
            "Source": "default"
        },
        {
            "Title": "Tezjet Partners with RateGain to Enhance Pricing and Route Profitability",
            "Summary": "Tezjet, an airline operating in Central Asia, has partnered with RateGain to improve its pricing flexibility and route profitability. RateGain's technology will be utilized to enhance Tezjet's operations in the Central Asian market.",
            "Sentiment": "positive",
            "PublishDate": 1750999555000,
            "Source": "default"
        },
        {
            "Title": "RateGain Launches Real-Time Insight Solutions for Hotel Commercial Teams",
            "Summary": "RateGain has introduced new real-time insight solutions designed for hotel commercial teams. These solutions aim to help monitor distribution efficiency in the hospitality industry.",
            "Sentiment": "positive",
            "PublishDate": 1749706401000,
            "Source": "default"
        }
    ]
}