{
    "Symbol": "RATNAVEER",
    "ISIN": "INE05CZ01011",
    "News": [
        {
            "Title": "Ratnaveer Reports No QIP Fund Deviation in Q3FY26",
            "Summary": "Ratnaveer Precision Engineering confirms no deviation in utilisation of Rs.185.50 crores QIP proceeds for quarter ended December 31, 2025, with Rs.29.50 crores utilised across working capital and corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1769868977238,
            "Source": "stocks"
        },
        {
            "Title": "Ratnaveer Board Meet Set for Jan 31 to Review Q3 Results",
            "Summary": "Ratnaveer Precision Engineering Limited has scheduled a board meeting on January 31, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769606238399,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ratnaveer Corrects EGM Notice Error on Warrants Issue",
            "Summary": "Ratnaveer Precision Engineering corrects typographical error in EGM notice, clarifying it is issuing only warrants, not equity shares. Company provides valuation clarifications to NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1768916948632,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ratnaveer Precision Engineering Shareholding Disclosure",
            "Summary": "Astorne Capital VCC-Arven reduces stake in Ratnaveer Precision Engineering from 7.12% to 4.84% through open market transactions totaling 15 lakh shares between December 11-24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766741981867,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ratnaveer Allots Equity Shares, Issues New Warrants",
            "Summary": "Ratnaveer Precision Engineering allotted 20.28 lakh equity shares at ₹143 each and approved issuance of 72.32 lakh warrants to promoters at ₹159 per warrant. EGM scheduled for January 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765539847953,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ratnaveer Precision Engineering To Review Fundraising Options",
            "Summary": "Ratnaveer Precision Engineering has scheduled to examine fundraising options on December 12. The company is exploring potential capital raising opportunities through this planned review process.",
            "Sentiment": "neutral",
            "PublishDate": 1765288096447,
            "Source": "stock"
        },
        {
            "Title": "Astorne Capital and Beacon Stone Capital Acquire 8.84% Stake in Ratnaveer Precision Engineering",
            "Summary": "Astorne Capital VCC-Arven and Beacon Stone Capital VCC-Beacon Stone I acquired 4,689,655 shares representing 8.84% voting rights in Ratnaveer Precision Engineering Ltd through a Qualified Institutional Placement on December 4, 2025. The acquisition increased the target company's equity share capital from 53,049,389 to 65,842,491 shares, with the investors holding no prior stake in the engineering company.",
            "Sentiment": "neutral",
            "PublishDate": 1765193549244,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnaveer Precision Engineering Raises ₹185.5 Crore Through QIP at ₹145 Per Share",
            "Summary": "Ratnaveer Precision Engineering completed its Qualified Institutional Placement by allotting 1,27,93,102 equity shares to eligible QIBs at ₹145 per share, raising ₹185.5 crore with a 4.89% discount to floor price. The QIP increased the company's paid-up equity share capital from ₹53.05 crore to ₹65.84 crore, with six major institutional investors receiving allocations ranging from 11.86% to 23.45% of the issue.",
            "Sentiment": "positive",
            "PublishDate": 1764872653492,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnaveer Precision Engineering Opens QIP Issue with Floor Price of Rs. 152.46 per Share",
            "Summary": "Ratnaveer Precision Engineering's Fund Raising Committee authorized the opening of a Qualified Institutional Placement on December 01, 2025, setting a floor price of Rs. 152.46 per equity share of face value Rs. 10 each. The company may offer up to 5% discount on the floor price, with the final issue price to be determined in consultation with book running lead managers.",
            "Sentiment": "positive",
            "PublishDate": 1764610713780,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports Record Quarterly Results with 25% Revenue Growth",
            "Summary": "Ratnaveer Precision Engineering Limited announced quarterly results with revenue of Rs. 287 crores, EBITDA of Rs. 30.26 crores, and PAT of Rs. 15.35 crores, representing approximately 25% year-on-year revenue growth. The company completed Rs. 48 crores CAPEX in February and plans additional Rs. 68 crores CAPEX starting December, targeting completion by July 2026. Management projects revenue targets of Rs. 1,100 crores for current year, Rs. 1,500 crores for FY27, and Rs. 1,800 crores for FY28. The company operates across three product categories: fasteners (nuts, bolts, washers), tubes and pipes, and sheet metal components, serving automotive, railway, marine, aviation, and defense industries. Value-added products currently contribute 8% of revenue, expected to reach Rs. 200 crores out of Rs. 1,500 crores target revenue. The company plans QIP funding of up to Rs. 211 crores for working capital requirements and is exploring acquisition opportunities in aviation and automobile sectors. A new copper-clad laminates project is planned with Rs. 45 crores investment, targeting Rs. 108 crores revenue with 20% EBITDA margins.",
            "Sentiment": "positive",
            "PublishDate": 1763025443248,
            "Source": "earnings"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports No Deviation in Rs 29 Crore Fund Utilization",
            "Summary": "Ratnaveer Precision Engineering Limited confirmed no deviation or variation in the use of proceeds from its preference issue (warrants) during the quarter ended September 30, 2025. The company raised approximately Rs 29 crores through the preference issue on September 5, 2024, of which Rs 28.87 crores has been received from investors. The funds were allocated for meeting working capital requirements/expansion of business (Rs 15.66 crores), business expansion (Rs 6.67 crores), and general corporate purposes (Rs 6.67 crores). The fund utilization was reviewed by the company's Audit Committee, which confirmed compliance with the objects approved by shareholders in the Extraordinary General Meeting held on July 26, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1762202727509,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnaveer Precision Engineering Designates Seven Officials as Senior Management Personnel",
            "Summary": "Ratnaveer Precision Engineering Limited's Board of Directors approved the designation of seven officials as Senior Management Personnel effective November 3, 2025. The appointments include Ajay K Panchal as GM-Accounts Finance, Ashok R Chavda as Manager-Procurement, Nayee Prakashraj M as DGM-QA&QC, Pravinkumar Patel as DGM-Operation, Rajanikanta Ratha as DGM-Production, Satish Garg as Vice President-Marketing, and Agotariya Vimal V as Head-Business Development and Operations. All designations were made based on recommendations from the Nomination and Remuneration Committee and comply with SEBI regulations. The officials will continue in their existing full-time employment roles with expanded senior management responsibilities covering areas including finance, procurement, quality assurance, operations, production, marketing, and business development.",
            "Sentiment": "positive",
            "PublishDate": 1762171587079,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports 25.6% Jump in Q2 Net Profit to 154.3 Million Rupees",
            "Summary": "Ratnaveer Precision Engineering reported Q2 net profit of 154.3 million rupees compared to 122.8 million rupees in the same period last year. Revenue increased to 2.86 billion rupees from 2.30 billion rupees year-over-year. EBITDA rose to 283 million rupees from 245 million rupees, though EBITDA margin declined to 9.90% from 10.65% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762168157051,
            "Source": "earnings"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports No Deviation in Warrant Proceeds Usage for Quarter Ended June 30, 2025",
            "Summary": "Ratnaveer Precision Engineering Limited confirmed no deviation or variation in the use of proceeds from warrants issued on preferential basis for the quarter ended June 30, 2025. The company raised approximately Rs. 29 crores through preference issue warrants on September 5, 2024, of which Rs. 7.25 crores has been received from investors. The funds were allocated for meeting working capital requirements (Rs. 15.66 crores), expansion of business (Rs. 6.67 crores), and general corporate purposes (Rs. 6.67 crores). During the quarter, Rs. 0.58 crores was utilized for working capital and Rs. 6.67 crores for general corporate purposes. The Audit Committee reviewed the statement and provided no comments on the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1753709776844,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports Mixed Q1 Results with Revenue Growth and Margin Decline",
            "Summary": "Ratnaveer Precision Engineering reported Q1 results showing revenue growth to 2.6 billion rupees from 2.04 billion rupees year-over-year. Net profit increased to 150 million rupees compared to 125 million rupees in the previous year. EBITDA rose to 271 million rupees from 246 million rupees year-over-year. However, EBITDA margin declined to 10.24% from 12.04% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753703614163,
            "Source": "earnings"
        },
        {
            "Title": "Ratnaveer Precision Engineering Schedules Board Meeting for July 28 to Approve Quarterly Financial Results",
            "Summary": "Ratnaveer Precision Engineering Limited has scheduled a Board of Directors meeting for July 28, 2025, to consider and approve the unaudited standalone financial results for the first quarter ended June 30, 2025. The company's trading window for securities will remain closed until July 30, 2025, following the 48-hour period after declaration of the financial results. The meeting notice was signed by Managing Director Vijay Ramanlal Sanghavi and the information will be uploaded on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1753258934665,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnaveer Precision Engineering Plans ₹2.11 Billion Fundraising",
            "Summary": "Ratnaveer Precision Engineering is seeking to raise ₹2.11 billion through funding. The company has not provided specific details on how the funds will be used or the method of fundraising.",
            "Sentiment": "positive",
            "PublishDate": 1749212529000,
            "Source": "default"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports Significant Q4 EBITDA Growth",
            "Summary": "Ratnaveer Precision Engineering has reported a substantial increase in its Q4 EBITDA, rising to 167 million rupees from 46 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 8.24% compared to 3.24% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747234228000,
            "Source": "result"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports Strong Q4 Results",
            "Summary": "Ratnaveer Precision Engineering has announced its Q4 financial results. The company's net profit increased to 107 million rupees, up from 56 million rupees year-over-year and 113 million rupees quarter-over-quarter. Revenue for Q4 reached 2 billion rupees, compared to 1.42 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747234162000,
            "Source": "result"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports Q3 Financial Results",
            "Summary": "Ratnaveer Precision Engineering has announced its Q3 financial results. The company's net profit increased to 113 million rupees, up from 93 million rupees year-over-year and 122 million rupees quarter-over-quarter. Revenue for Q3 rose to 2.55 billion rupees, compared to 1.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738109867000,
            "Source": "earnings"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports Q3 Financial Results",
            "Summary": "Ratnaveer Precision Engineering has announced its Q3 financial results. The company reported a net profit of 113 million rupees, showing an increase from 93 million rupees year-over-year and 122 million rupees quarter-over-quarter. Revenue for Q3 stood at 2.55 billion rupees, up from 1.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738065172000,
            "Source": "earnings"
        },
        {
            "Title": "Ratnaveer Precision Engineering Reports Strong Q2 Financial Results",
            "Summary": "Ratnaveer Precision Engineering Ltd. has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's net profit increased to 122 million rupees, up from 79 million rupees in the same quarter last year and 125 million rupees in the previous quarter. Revenue also saw substantial growth, reaching 2.29 billion rupees compared to 1.42 billion rupees year-over-year and 2.04 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731284249000,
            "Source": "result"
        }
    ]
}