{
    "Symbol": "RATNAMANI",
    "ISIN": "INE703B01027",
    "News": [
        {
            "Title": "Ratnamani Q3 FY26 Results Show Mixed Performance",
            "Summary": "Ratnamani Metals & Tubes reports consolidated growth driven by subsidiaries while standalone operations face challenges from lower carbon steel demand in Q3 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1770457798275,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ratnamani Metals Board Meet on Feb 6 for Q3FY26 Results",
            "Summary": "Ratnamani Metals & Tubes has scheduled its board meeting for February 6, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1 to February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769833785825,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ratnamani Metals Gets ESG Rating of 58 from NSE",
            "Summary": "Ratnamani Metals & Tubes receives voluntary ESG rating of 58 from NSE Sustainability Ratings & Analytics Limited based on BRSR and public domain information for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1767952237000,
            "Source": "stocks"
        },
        {
            "Title": "Ratnamani Metals Reports Strong Q2 Performance with 23% Consolidated Revenue Growth",
            "Summary": "Ratnamani Metals achieved consolidated revenue of INR 1,191 crores in Q2, reflecting 23% growth, while standalone revenue reached INR 940 crores with 5% increase, driven by strong performance from subsidiaries RTL and RFSS. The company maintains EBITDA guidance of 16-18% despite domestic market challenges and expects to reach INR 7,500 crores consolidated revenue in next 2-3 years through ongoing expansion projects.",
            "Sentiment": "positive",
            "PublishDate": 1763042777110,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports 23% Consolidated Revenue Growth in Q2 2025-26",
            "Summary": "Ratnamani Metals & Tubes Limited reported consolidated revenue of ₹1,191.69 crores for Q2 2025-26, marking a 23% year-on-year growth compared to ₹971.33 crores in Q2 2024-25. On a standalone basis, revenue grew 5% to ₹939.56 crores from ₹897.51 crores. The company maintained EBITDA margins at 20% on consolidated basis and 18.5% on standalone basis. Consolidated PAT increased to ₹156.04 crores from ₹99.35 crores, while standalone PAT rose to ₹108.19 crores from ₹102.46 crores. Key operational milestones included commissioning of Phase I of the Odisha spiral welded pipe plant, with Phase II expected by year-end. The company pioneered hydrogen-compliant carbon steel welded pipes supply in India and received API Monogram certification for its Kutch plant. Subsidiary RaviTechnoforge achieved ₹95.6 crores revenue with 40% growth, while Ratnamani Finow Spooling Solutions recorded ₹110 crores revenue. The Saudi Arabia subsidiary obtained commercial registration to establish stainless steel manufacturing facilities.",
            "Sentiment": "positive",
            "PublishDate": 1762830903396,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports 5.6% Decline in Q2 Net Profit to ₹108 Crore",
            "Summary": "Ratnamani Metals & Tubes Limited reported a net profit of ₹108.19 crore for the quarter ended September 30, 2025, compared to ₹102.46 crore in the same period last year. Revenue from operations increased to ₹939.56 crore from ₹927.11 crore year-on-year. For the half-year period, net profit rose to ₹253.15 crore from ₹207.72 crore in the previous year, while revenue grew to ₹2,071.96 crore from ₹2,039.55 crore. The company's earnings per share for the quarter stood at ₹15.44. During the quarter, the company acquired 40,000 equity shares of subsidiary Ratnamani Trade EU AG from minority shareholder Technoenergy AG for EUR 4,00,000, making it a wholly-owned subsidiary. The company also amended its agreement with Ravi Technoforge Private Limited, capping its shareholding at 75% and reducing it from 80.017% to 75.00%.",
            "Sentiment": "neutral",
            "PublishDate": 1762528751837,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Strong Q2 Growth with 36% Jump in Net Profit",
            "Summary": "Ratnamani Metals & Tubes delivered robust quarterly performance with consolidated net profit rising to 1.36 billion rupees from 1 billion rupees year-over-year. Revenue increased to 11.92 billion rupees compared to 9.7 billion rupees in the same period last year. EBITDA grew to 2.12 billion rupees from 1.54 billion rupees, while EBITDA margin improved to 17.73% from 15.8% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762513512207,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals & Tubes Grants 5.74 Lakh Employee Stock Options Under ESOS 2024 Scheme",
            "Summary": "Ratnamani Metals & Tubes Limited's Nomination and Remuneration Committee approved the grant of 5,74,578 employee stock options to eligible employees under the Ratnamani Employee Stock Option Scheme 2024 (RMTL ESOS 2024) under Grant II. The exercise price is set at Rs. 1,836 per option, determined using a pricing formula that allows up to 25% discount from market price, with the closing price on November 4, 2025 on NSE taken as reference. Each option covers one equity share of face value Rs. 2. The options will vest between a minimum period of 1 year and maximum period of 5 years from the grant date, and vested options can be exercised within 1 year of vesting. The scheme complies with SEBI regulations and was authorized by shareholders at the 40th Annual General Meeting held on August 27, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1762435340719,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnamani Metals & Tubes Schedules Conference Call to Discuss Q2 FY26 Financial Results",
            "Summary": "Ratnamani Metals & Tubes Limited has announced a conference call scheduled for Monday, November 10, 2025, at 4:00 P.M. IST to discuss the company's financial results for the second quarter and half-year ended September 30, 2025, along with future business outlook. The virtual conference call will be attended by CEO Manoj P. Sanghvi and CFO Vimal Katta on behalf of the company. The management will refer to publicly available documents during discussions and confirmed that no unpublished price-sensitive information will be shared during the call. Interested participants can join the conference call by dialing provided numbers or through a Diamond Pass link for express joining.",
            "Sentiment": "neutral",
            "PublishDate": 1761913706990,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals Acquires Remaining 40% Stake in Swiss Subsidiary for 400,000 Euros",
            "Summary": "Ratnamani Metals and Tubes Limited has completed the acquisition of the remaining 40% stake in its subsidiary Ratnamani Trade EU AG, making it a wholly-owned subsidiary. The company purchased 40,000 shares at 10 Euros each for a total of 400,000 Euros from Technoenergy AG, Switzerland. The acquisition was completed on September 24, 2025. Ratnamani Trade EU AG operates as an exclusive trading house to import and distribute stainless steel products in Europe manufactured by RMTL. The subsidiary was incorporated on December 14, 2023, and reported a turnover of 86,33,485.29 Euros during 2024-25 and 26,62,381.20 Euros in the first quarter ended June 30, 2025. The transaction is classified as a related party transaction since Technoenergy AG is a joint venture partner in another RMTL subsidiary, Ratnamani Finow Spooling Solutions Private Limited, holding a 49% stake.",
            "Sentiment": "positive",
            "PublishDate": 1758801563498,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnamani Metals Increases Stake in Subsidiary Ravi Technoforge to 75% Through Rights Issue",
            "Summary": "Ratnamani Metals & Tubes Limited has adjusted its shareholding in subsidiary Ravi Technoforge Private Limited to 75% through a rights issue subscription. The company subscribed to 30,48,669 equity shares at Rs. 100 per share, investing Rs. 30.49 crores. This follows a Master Amendment Agreement that caps Ratnamani's maximum stake at 75% while ensuring existing shareholders maintain at least 25%. Previously, Ratnamani held 80.017% stake through earlier acquisitions in October 2022 and August 2024. Ravi Technoforge manufactures precision forged bearing rings and components, reporting revenue of Rs. 287.62 crores and net profit of Rs. 10.07 crores for FY 2024-25. The subsidiary has manufacturing capacity of 39,000 MTPA and serves industrial and mobility applications with over 1,600 part approvals.",
            "Sentiment": "positive",
            "PublishDate": 1758206449973,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnamani Metals Acquires Remaining 40% Stake in Swiss Subsidiary for EUR 400,000",
            "Summary": "Ratnamani Metals & Tubes Limited executed a Share Purchase Agreement with Technoenergy AG, Switzerland on September 6, 2025, to acquire 40,000 shares for EUR 400,000, making Ratnamani Trade EU AG a wholly owned subsidiary. The company previously held 60% ownership in the Swiss entity. Ratnamani Trade EU AG operates as an exclusive trading house for importing and distributing stainless steel products in Europe manufactured by RMTL. The subsidiary, incorporated on December 14, 2023, reported turnover of EUR 86.33 million in 2024-25 and EUR 26.62 million in the first quarter ended June 30, 2025. The transaction is classified as a related party transaction since Technoenergy AG holds a 49% stake in another RMTL subsidiary. The acquisition is expected to be completed by September 30, 2025, and aims to strengthen RMTL's European market presence and customer service capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1757161318181,
            "Source": "order&deals"
        },
        {
            "Title": "Ratnamani Metals & Tubes Incorporates Non-Profit Foundation for CSR Activities",
            "Summary": "Ratnamani Metals & Tubes Limited has incorporated Ratnamani Foundation, a Section 8 non-profit company, on September 5, 2025. The foundation was established jointly with two subsidiaries - Ravi Technoforge Private Limited and Ratnamani Finow Spooling Solutions Private Limited. The foundation will serve as an implementing agency for Corporate Social Responsibility activities of the company and its subsidiaries, focusing on promotion of commerce, art, science, sports, education, research, social welfare, healthcare, charity, and environmental protection as outlined in Schedule VII of the Companies Act, 2013. The foundation is structured as a company limited by guarantee with no share capital involved. The entity will seek exemptions from the Income Tax Department and is required to apply any profits toward promoting its objectives while prohibiting dividend payments to members.",
            "Sentiment": "neutral",
            "PublishDate": 1757071084995,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnamani Metals & Tubes Incorporates Saudi Arabia Subsidiary for Steel Tubes Manufacturing",
            "Summary": "Ratnamani Metals & Tubes Limited has incorporated a subsidiary company named 'Ratnamani Middle East Company, LLC' in Dammam, Kingdom of Saudi Arabia on August 25, 2025. The subsidiary is structured as a joint venture with Saudi Electrical Materials Company Limited, a SESCO group company. Ratnamani holds 75% shareholding with an investment of Saudi Riyal 15,00,000 for 75 shares. The subsidiary has authorized and paid-up share capital of Saudi Riyal 20,00,000 divided into 100 shares. The joint venture aims to provide critical tubing solutions to consumers in Saudi Arabia, Gulf Cooperation Council countries, and globally. The subsidiary will focus on manufacturing seamless steel tubes and pipes locally, which are currently being imported by consumers in the region. The company has not yet commenced business operations.",
            "Sentiment": "positive",
            "PublishDate": 1756211069203,
            "Source": "corporate_action"
        },
        {
            "Title": "Ratnamani Metals & Tubes Appoints Two New Business Heads for Steel Divisions",
            "Summary": "Ratnamani Metals & Tubes Limited appointed Manjindersingh M. Randhawa as Business Head for the Stainless Steel Division and Dhirendra Mohan Sharma as Business Head for Carbon Steel Line Pipes Products, both effective August 1, 2025. The appointments were approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee. Randhawa holds a BE in Production Engineering and MBA in Marketing, bringing 28 years of experience in seamless stainless steel and nickel alloys manufacturing. He previously served as Plant Head at the company's Indrad facility and was instrumental in setting up the Kutch plant. Sharma has an MBA in Marketing from Kurukshetra University and 32 years of marketing experience. He joined Ratnamani in 2015 as General Manager Marketing and was responsible for domestic carbon steel line pipes sales across water, city gas distribution, and oil and gas segments. Both positions are full-time employment roles under the senior management category.",
            "Sentiment": "positive",
            "PublishDate": 1754041127013,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Mixed Q1 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Ratnamani Metals & Tubes reported Q1 revenue of 11.5 billion rupees, down from 11.8 billion rupees in the same period last year. However, the company showed strong profitability with consolidated net profit rising to 1.32 billion rupees from 1 billion rupees year-over-year. EBITDA increased to 1.88 billion rupees from 1.6 billion rupees, while EBITDA margin improved significantly to 16.34% from 13.86% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754034005961,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals & Tubes Ltd.: NSE Block Trade of Rs. 72.69 Crores",
            "Summary": "A significant block trade has occurred on the National Stock Exchange (NSE) involving Ratnamani Metals & Tubes Ltd. The transaction amounted to approximately Rs. 72.69 crores, with about 250,057 shares changing hands. The shares were traded at a price of Rs. 2907.10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1752036228000,
            "Source": "block_details"
        },
        {
            "Title": "EU Reinstates Anti-Dumping Duties on Tube and Pipe Fittings",
            "Summary": "The European Union has reinstated anti-dumping duties on tube and pipe fittings imported from Korea, Malaysia, and Russia following a review. This decision affects the trade of these products within the EU market. The reinstatement suggests that the EU found evidence of continued or renewed dumping practices from these countries in the tube and pipe fitting industry.",
            "Sentiment": "neutral",
            "PublishDate": 1751600118000,
            "Source": "default"
        },
        {
            "Title": "Ratnamani Metals and Tubes to Issue NCDs Worth Up to 5 Billion Rupees",
            "Summary": "The board of Ratnamani Metals and Tubes has recommended the issuance of Non-Convertible Debentures (NCDs) up to a value of 5 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1747406398000,
            "Source": "default"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Q4 Results and Dividend Recommendation",
            "Summary": "Ratnamani Metals & Tubes has announced its Q4 financial results and dividend recommendation. The company's Q4 EBITDA increased to 3 billion rupees from 2.46 billion rupees year-over-year. The EBITDA margin improved to 17.62% from 16.42% in the same period last year. Additionally, the company has recommended a dividend of 14 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747403008000,
            "Source": "result"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Q4 Financial Results",
            "Summary": "Ratnamani Metals & Tubes has announced its Q4 consolidated financial results. The company's net profit for the quarter stood at 2 billion rupees, compared to 1.92 billion rupees year-over-year and 1.3 billion rupees quarter-over-quarter. Revenue for Q4 was reported at 17.15 billion rupees, up from 14.96 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747402920000,
            "Source": "result"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Q3 Financial Results",
            "Summary": "Ratnamani Metals & Tubes has announced its Q3 consolidated financial results. The company reported a net profit of 1.31 billion rupees, slightly down from 1.33 billion rupees in the same quarter last year. Revenue for Q3 decreased to 13.2 billion rupees from 15.57 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739405830000,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Q3 EBITDA and Margin",
            "Summary": "Ratnamani Metals & Tubes has reported its Q3 financial results. The company's EBITDA for the quarter was 2.03 billion rupees, compared to 2 billion rupees in the same quarter last year. The EBITDA margin for Q3 was 15.49%, down from 15.93% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739368476000,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Q3 Financial Results",
            "Summary": "Ratnamani Metals & Tubes announced its Q3 consolidated financial results. The company reported a net profit of 1.31 billion rupees, slightly lower than the 1.33 billion rupees in the same quarter last year. Revenue for Q3 decreased to 13.2 billion rupees from 15.57 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739368467000,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals & Tubes to Consider Q3 Results on February 12",
            "Summary": "Ratnamani Metals & Tubes has announced that it will consider its third quarter financial results on February 12. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737981483000,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals: Middle East Demand Boosts Order Book",
            "Summary": "Ratnamani Metals & Tubes has seen an increase in its order book due to rising demand for oil and gas products in the Middle East.",
            "Sentiment": "positive",
            "PublishDate": 1734423238000,
            "Source": "order&deals"
        },
        {
            "Title": "Ratnamani Metals Projects Revenue Growth for FY26",
            "Summary": "According to a company executive, Ratnamani Metals expects its revenue for the fiscal year 2026 to be in the range of 6,000 to 6,500 crore rupees, as reported by CNBC TV18.",
            "Sentiment": "positive",
            "PublishDate": 1734409643000,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals Provides Revenue and Margin Guidance for FY25",
            "Summary": "An executive from Ratnamani Metals has announced the company's financial projections for the fiscal year 2025. The revenue guidance is set between ₹5,000 crore and ₹5,500 crore, with an expected profit margin range of 16-18%.",
            "Sentiment": "positive",
            "PublishDate": 1734409625000,
            "Source": "earnings"
        },
        {
            "Title": "Ratnamani Metals & Tubes: Nalanda India Fund Sells 1.1% Stake in Block Deal",
            "Summary": "Nalanda India Fund sold 7.85 lakh shares (1.1% stake) of Ratnamani Metals & Tubes for ₹261.8 crore at ₹3,335 per share. SBI MF and Tata MF were the major buyers. Ratnamani's stock closed at ₹3,325.3, down 1.27% on NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1733357687000,
            "Source": "block_deals"
        },
        {
            "Title": "Ratnamani Metals & Tubes: SBI and Tata Mutual Funds Acquire Significant Stake",
            "Summary": "SBI Mutual Fund and Tata Mutual Fund purchased a combined 1.12% stake in Ratnamani Metals & Tubes Ltd. for Rs 262 crore. SBI MF's holding increased to 2.28%. Nalanda India Fund sold 7.85 lakh shares.",
            "Sentiment": "positive",
            "PublishDate": 1733335302000,
            "Source": "block_deals"
        },
        {
            "Title": "Ratnamani Metals & Tubes Ltd: Block Trade of 151,558 Shares",
            "Summary": "A block trade of approximately 151,558 shares of Ratnamani Metals & Tubes Ltd occurred on the National Stock Exchange (NSE). The transaction was valued at Rs. 50.65 crores, with each share priced at Rs. 3,342.00.",
            "Sentiment": "neutral",
            "PublishDate": 1733297879000,
            "Source": "block_deals"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Q2 EBITDA Decline",
            "Summary": "Ratnamani Metals & Tubes reported a significant decrease in Q2 EBITDA, falling to 1.5 billion rupees from 2.45 billion rupees year-over-year. The company's EBITDA margin also declined, dropping to 15.80% from 21.65% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731587674000,
            "Source": "result"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Q2 Revenue Decline",
            "Summary": "Ratnamani Metals & Tubes has reported a revenue of 9.7 billion rupees for the second quarter, down from 11.31 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731587505000,
            "Source": "result"
        },
        {
            "Title": "Ratnamani Metals & Tubes Reports Q2 Net Profit Decline",
            "Summary": "Ratnamani Metals & Tubes announced its Q2 consolidated net profit of 1 billion rupees, showing a decrease from 1.64 billion rupees year-over-year. However, it represents a slight increase from 1.1 billion rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731587443000,
            "Source": "result"
        }
    ]
}