{
    "Symbol": "RAYMONDREL",
    "ISIN": "INE1SY401010",
    "News": [
        {
            "Title": "Raymond Realty to participate in Dolat Capital Conference",
            "Summary": "Raymond Realty Limited will participate in the Dolat Capital Corporate Conference 2026 on February 18, 2026, at Grand Hyatt Mumbai through one-to-one and group meetings with investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770722744196,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Realty Eyes Rs 40,000 Cr Revenue Target",
            "Summary": "Raymond Realty reports strong project performance matching planned expectations, with optimistic sales outlook and new Thane projects through JDA model expected to drive growth.",
            "Sentiment": "positive",
            "PublishDate": 1769570386613,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Realty invests Rs 10,000 in new subsidiary",
            "Summary": "Raymond Realty Limited's board approved Rs 10,000 investment in newly incorporated wholly owned subsidiary Chembur Realty Limited for real estate business operations.",
            "Sentiment": "positive",
            "PublishDate": 1769503423465,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Realty Targets 20% Booking Value Growth",
            "Summary": "Raymond Realty confirms it is set to achieve a 20% increase in booking value this year, signaling strong growth momentum in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1769502627314,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Realty Q3 Net Profit Surges to ₹668M",
            "Summary": "Raymond Realty reported consolidated net profit of ₹668 million in Q3, marking a significant jump from ₹30 million in the same quarter last year, representing over 2000% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1769502582076,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Realty seeks shareholder approval for ESOP 2025",
            "Summary": "Raymond Realty Limited announces postal ballot for approval of Employee Stock Option Plan 2025, covering 16.80 lakh options worth 2.52% equity stake. E-voting scheduled from January 23 to February 21, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769097103078,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Realty Q3FY26 Results Call on Jan 27",
            "Summary": "Raymond Realty Limited has scheduled a conference call on January 27, 2026 at 5:00 PM IST to discuss Q3FY26 and nine-month financial performance ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768989391154,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Realty Launches ₹5,000 Cr Wadala Project",
            "Summary": "Raymond Realty unveils 'The Address by GS, Wadala' spanning 5.62 acres in central Mumbai with 1.7 lakh sq ft recreational space, targeting ₹5,000 crore potential revenue.",
            "Sentiment": "positive",
            "PublishDate": 1768986391341,
            "Source": "stocks"
        },
        {
            "Title": "J.K. Investors pledges Raymond Realty shares",
            "Summary": "J.K. Investors (Bombay) Limited has pledged 5 lakh shares of Raymond Realty Limited to Bajaj Finance Limited as collateral for loans, increasing total encumbered shares to 19.37 lakh.",
            "Sentiment": "neutral",
            "PublishDate": 1768402852472,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Realty Board Approves ESOP 2025 Plan",
            "Summary": "Raymond Realty Limited's Board unanimously approved the Raymond Realty Employees Stock Option Plan 2025, covering up to 16,80,588 equity shares with exercise price of ₹404.80 following demerger from Raymond Limited.",
            "Sentiment": "positive",
            "PublishDate": 1767888203221,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Realty Passes Key Resolutions via Postal Ballot",
            "Summary": "Raymond Realty Limited successfully passes two resolutions through postal ballot - appointment of Virendrasingh Bisht as Independent Director and ratification of cost auditors' remuneration for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1765545704696,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Realty Hosts Investor Conference Meeting",
            "Summary": "Raymond Realty Limited conducted an investor conference meeting on December 11, 2025, presenting its portfolio expansion plans, financial performance, and growth strategy to analysts and institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1765464656707,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Realty's Mumbai BKC Project Shows 20 Billion Rupee Revenue Potential",
            "Summary": "Raymond Realty announced that its Mumbai GS project in Bandra Kurla Complex (BKC) has an estimated revenue potential of 20 billion rupees. The project represents a significant revenue opportunity for the real estate developer in one of Mumbai's prime commercial districts.",
            "Sentiment": "positive",
            "PublishDate": 1764633523506,
            "Source": "stock"
        },
        {
            "Title": "J.K. Investors Releases Pledge on 6.2 Lakh Raymond Realty Shares",
            "Summary": "J.K. Investors (Bombay) Limited released pledge encumbrance on 6,20,000 shares (0.93% stake) of Raymond Realty Limited that were pledged to Bajaj Finance Limited as loan collateral. The release reduces J.K. Investors' total pledged shareholding in Raymond Realty from 9.83% to 3.85% of the company's share capital.",
            "Sentiment": "positive",
            "PublishDate": 1764304482543,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Realty Seeks Shareholder Approval for Independent Director Appointment and Cost Auditor Remuneration",
            "Summary": "Raymond Realty Limited has issued a postal ballot notice seeking shareholder approval for two resolutions. The company proposes to appoint Shri Virendrasingh Bisht (DIN: 11350463) as an Independent Director for a five-year term from October 28, 2025, to October 27, 2030. Bisht, aged 65, is a law graduate with over forty years of legal experience, including serving as a Judge at Bombay High Court and as Judicial Member at National Company Law Tribunal Mumbai. The second resolution seeks ratification of remuneration up to Rs 1,32,000 (plus applicable taxes) payable to M/s R. Nanabhoy & Co., Cost Accountants, for conducting cost audit for financial year 2025-26. The remote e-voting period runs from November 13, 2025, at 9:00 AM to December 12, 2025, at 5:00 PM. Results will be declared within two working days of the voting conclusion. The cut-off date for eligible shareholders is November 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762927360120,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Realty Establishes Chembur Realty as Fully Owned Subsidiary",
            "Summary": "Raymond Realty has formed Chembur Realty as a fully owned subsidiary. The new subsidiary will focus on real estate operations.",
            "Sentiment": "neutral",
            "PublishDate": 1761747767416,
            "Source": "stock"
        },
        {
            "Title": "Raymond Realty Reports 20% Revenue Growth in Q2FY26, Appoints New Independent Director",
            "Summary": "Raymond Realty Limited reported total income of ₹706 crores in Q2FY26 versus ₹589 crores in Q2FY25, marking 20% year-on-year growth. EBITDA increased 7% to ₹101 crores from ₹95 crores in the previous year. The company achieved booking value of ₹455 crores compared to ₹562 crores in Q2FY25, while collections stood at ₹409 crores versus ₹476 crores. The company maintains net cash surplus of ₹48 crores and has a portfolio gross development value of approximately ₹40,000 crores. During the quarter, Raymond Realty launched two new residential towers - Address by GS Season 3 and Invictus Tower B in Thane. The company operates through an asset-light model with six Joint Development Agreements totaling ₹14,000 crores potential revenue. The Board also appointed Virendrasingh Bisht as Independent Director for five years, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1761640773008,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Realty Approves Incorporation of Wholly Owned Subsidiary for Real Estate Projects",
            "Summary": "Raymond Realty Limited's Board of Directors approved the incorporation of a wholly owned subsidiary named Chembur Realty Limited to explore new real estate projects, particularly under the redevelopment model, and to mitigate project-specific risks. The subsidiary will have an authorized share capital of Rs. 1,00,000 divided into 10,000 equity shares of Rs. 10 each. Raymond Realty will subscribe to 1,000 equity shares worth Rs. 10,000 in cash upon incorporation, giving it 100% ownership. The new entity will be incorporated in Maharashtra and will operate in the real estate industry.",
            "Sentiment": "positive",
            "PublishDate": 1760106959310,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Realty Completes Income Tax Survey with Full Cooperation",
            "Summary": "Raymond Realty has completed an income tax survey and provided full cooperation with the tax authorities during the process.",
            "Sentiment": "neutral",
            "PublishDate": 1759319244484,
            "Source": "stock"
        },
        {
            "Title": "Raymond Realty Reports Q1 FY26 Results, Maintains 20% Growth Guidance Despite Lower Inventory",
            "Summary": "Raymond Realty Limited held its quarterly earnings conference call discussing results for the quarter ended June 30, 2025. The company reported revenue of approximately INR400 crores for Q1 compared to INR500 crores in the same quarter last year. Management attributed the decline to low inventory levels, with 91% of Thane inventory and 50% of Bandra inventory sold out at the start of the year. The company is launching two new buildings in Thane this week worth INR1,100 crores with 318 units. Management confirmed they remain on track to achieve their 20% year-on-year growth guidance for booking values and maintain 20% EBITDA margins. Several new JDA projects are planned for launch in Q3 and Q4, including Bandra 2 and Wadala 1. The company's JDA pipeline is valued at INR14,000 crores with Raymond's share at approximately INR11,500 crores. Management expects Q2 to follow a similar trajectory as Q1 but anticipates stronger performance in the second half driven by new launches.",
            "Sentiment": "neutral",
            "PublishDate": 1754991898375,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Realty Targets ₹400 Billion GDV Through Capital-Light Expansion Strategy",
            "Summary": "Raymond Realty aims to achieve approximately ₹400 billion in Gross Development Value (GDV) through new projects and capital-light expansion. The company is targeting 20% annual growth by leveraging its strong cash position and brand presence in Mumbai Metropolitan Region (MMR) and Pune markets. Raymond Realty holds a 100-acre landbank in Thane with revenue potential of ₹250 billion for long-term growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1754406074935,
            "Source": "stock"
        },
        {
            "Title": "Raymond Realty Plans New Project Launches in Second Half",
            "Summary": "Raymond Realty has announced plans to increase its business activity through new project launches scheduled for the second half of the year.",
            "Sentiment": "positive",
            "PublishDate": 1754405321781,
            "Source": "stock"
        },
        {
            "Title": "Raymond Realty Reports 23% Revenue Decline in First Quarter Post-Demerger",
            "Summary": "Raymond Realty reported a 23% year-on-year revenue decline to ₹374 crore in the first quarter of FY26, its first quarterly results since listing as a separate entity following demerger from Raymond Ltd. Total income fell to ₹392 crore from ₹498 crore. EBITDA dropped 39% to ₹41 crore with margins compressing to 10.5% from 13.5%. The company attributed the decline to low inventory levels in mature projects and natural sales tapering. Booking value decreased significantly to ₹306 crore from ₹611 crore, primarily from sales of The Address by GS 2.0 and Ten X Era in Thane. Collections stood at ₹374 crore versus ₹483 crore last year. Managing Director Harmohan Sahni indicated the performance was in line with expectations and expects stronger activity in the second half with new project launches. The company maintains a portfolio with gross development value of ₹40,000 crore, including 100 acres in Thane with ₹25,000 crore potential revenue and six Joint Development Agreements worth ₹14,000 crore. Raymond Realty remains debt-free with net cash surplus of ₹233 crore and plans to launch three to four JDA projects over the next six to nine months. Shares ended at ₹728, up 4.79%.",
            "Sentiment": "negative",
            "PublishDate": 1754396575335,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Realty Reports Strong Q1 Performance with Profit More Than Doubling",
            "Summary": "Raymond Realty posted consolidated net profit of Rs 16.5 crore in the June quarter, more than doubling from Rs 7.4 crore in the same period last year. Revenue surged to Rs 374.35 crore from Rs 129.68 crore year-on-year. EBITDA increased 35% to Rs 23.68 crore versus Rs 17.52 crore, though margins compressed to 6.3% from 13.5%. The stock closed 4.3% higher at Rs 724.65 on the NSE, outperforming the benchmark Nifty which fell 0.3%. Despite the quarterly gains, shares have declined 25.23% over the past 12 months. One analyst maintains a 'buy' rating with the average 12-month price target suggesting 24.6% potential upside.",
            "Sentiment": "positive",
            "PublishDate": 1754394554049,
            "Source": "earnings"
        }
    ]
}