{
    "Symbol": "RAYMONDLSL",
    "ISIN": "INE02ID01020",
    "News": [
        {
            "Title": "Raymond Lifestyle uploads Q3 FY26 investor call",
            "Summary": "Raymond Lifestyle Limited has made available the audio recording of its investor conference held on January 27, 2026, discussing Q3 and nine-month financial performance ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769529213177,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Lifestyle Board Meet Set for Jan 27, 2026",
            "Summary": "Raymond Lifestyle Limited has scheduled a board meeting on January 27, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed for designated persons until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768826844439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Lifestyle Appoints Satyaki Ghosh as CEO",
            "Summary": "Raymond Lifestyle Limited announces the appointment of Satyaki Ghosh as Chief Executive Officer on January 19, 2026. Ghosh brings over 25 years of experience across FMCG, textiles, retail, and consumer businesses.",
            "Sentiment": "positive",
            "PublishDate": 1768819642368,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Lifestyle Appoints Satyaki Ghosh as CEO",
            "Summary": "Raymond Lifestyle Limited announces the appointment of Satyaki Ghosh as Chief Executive Officer effective January 19, 2026. Ghosh brings over 25 years of experience across FMCG, textiles, and retail sectors.",
            "Sentiment": "positive",
            "PublishDate": 1768817107812,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Lifestyle Appoints Shantilal Pokharna as Director",
            "Summary": "Raymond Lifestyle Limited shareholders approved the appointment of Mr. Shantilal Pokharna as Non-Executive Non-Independent Director through postal ballot with 99.75% votes in favor on January 15, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768492445218,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Lifestyle Appoints Shantilal Pokharna as Director",
            "Summary": "Raymond Lifestyle Limited successfully completed postal ballot voting for appointing Mr. Shantilal Pokharna as Non-Executive Non-Independent Director. The special resolution passed with 99.75% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1768492083960,
            "Source": "stocks"
        },
        {
            "Title": "J.K. Investors Creates Fresh Pledge on Raymond Shares",
            "Summary": "J.K. Investors (Bombay) Limited pledged 2 lakh additional Raymond Lifestyle shares to Bajaj Finance as loan collateral, increasing total pledged holding to 9.37% from 9.04%.",
            "Sentiment": "neutral",
            "PublishDate": 1768402051008,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Lifestyle Grants 11.04 Lakh Stock Options",
            "Summary": "Raymond Lifestyle Limited's Nomination and Remuneration Committee approved the grant of 11,04,470 stock options to eligible employees at ₹1,040.69 per option under the RLL ESOP 2025 scheme.",
            "Sentiment": "positive",
            "PublishDate": 1767968050045,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Lifestyle Appoints Prasad Chathuar as CFO",
            "Summary": "Raymond Lifestyle Limited appoints Prasad Chathuar as Chief Financial Officer effective January 5, 2026. Chathuar brings 28 years of consumer industry experience, previously serving as CFO at Bajaj Electricals.",
            "Sentiment": "positive",
            "PublishDate": 1767620669632,
            "Source": "stocks"
        },
        {
            "Title": "J.K. Investors Releases Encumbrances on Raymond Shares",
            "Summary": "J.K. Investors (Bombay) Limited filed regulatory disclosure for release of encumbrances from Raymond Lifestyle Limited shares under SEBI takeover regulations on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766467056124,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Lifestyle Seeks Shareholder Approval for Director",
            "Summary": "Raymond Lifestyle Limited announces postal ballot for appointment of Mr. Shantilal Pokharna as Non-Executive Non-Independent Director. Remote e-voting from Dec 17, 2025 to Jan 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765891923099,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Lifestyle Appoints Amit Agarwal as President-Chairman's Office",
            "Summary": "Raymond Lifestyle Limited has appointed Amit Agarwal as President-Chairman's Office and classified him as Senior Management Personnel effective December 3, 2025. Agarwal, a Chartered Accountant with over 34 years of experience, joined Raymond group in 2020 as Group CFO and was instrumental in the demerger of lifestyle and realty business, their listing, and achieving zero net debt position.",
            "Sentiment": "positive",
            "PublishDate": 1764768262058,
            "Source": "corporate_governance"
        },
        {
            "Title": "J.K. Investors Discloses Release of Encumbrances on Raymond Lifestyle Shares",
            "Summary": "J.K. Investors (Bombay) Limited filed a disclosure with stock exchanges regarding the release of encumbrances on shares of Raymond Lifestyle Limited under SEBI takeover regulations. The disclosure was submitted to BSE and NSE as required under substantial acquisition and takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763469726413,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Lifestyle Reports 8% Revenue Growth in Q2 FY26 Despite Export Headwinds",
            "Summary": "Raymond Lifestyle Limited reported total income of INR 1,865 crores for Q2 FY26, marking 8% year-on-year growth, with EBITDA of INR 259 crores and margin of 13.9%. The branded textile segment led performance with 10% revenue growth to INR 937 crores and improved EBITDA margin of 20%. Branded apparel segment grew 11% to INR 491 crores but saw margin compression to 5.2% due to increased marketing spend and new store costs. The company opened 19 stores and closed 31 underperforming locations during the quarter, ending with 1,663 total stores. Export business faced challenges from US tariff pressures, with garmenting exports showing reduced margins despite 4% revenue growth. Management highlighted strong domestic demand driven by festive season and wedding bookings, while expressing optimism about GST rate reductions and income tax cuts boosting consumer spending. The company maintains net debt of INR 246 crores with working capital at 105 days.",
            "Sentiment": "positive",
            "PublishDate": 1762295805132,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Lifestyle Reports Mixed Q2 Results Amid US Tariff Challenges",
            "Summary": "Raymond Lifestyle reported quarterly revenue of 18.3 billion rupees, up from 17 billion rupees year-over-year. The company's EBITDA increased to 2.26 billion rupees from 2.1 billion rupees, though EBITDA margin declined slightly to 12.33% from 12.57%. Net profit showed strong growth, rising to 752 million rupees from 422 million rupees. However, the company cited high US tariffs as negatively impacting global competitiveness, leading to order delays and reduced profit margins from major international customers.",
            "Sentiment": "neutral",
            "PublishDate": 1761715168454,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Realty Board Approves Formation of Chembur Realty Limited for New Projects",
            "Summary": "Raymond Realty's board has approved the creation of a new entity called Chembur Realty Limited, which will be focused on new real estate projects. This corporate restructuring move appears to be part of the company's expansion strategy in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1760106994363,
            "Source": "stock"
        },
        {
            "Title": "Raymond Lifestyle Completes Income Tax Survey with Full Cooperation",
            "Summary": "Raymond Lifestyle has completed an income tax survey. The company provided full cooperation during the process.",
            "Sentiment": "neutral",
            "PublishDate": 1759319593106,
            "Source": "stock"
        },
        {
            "Title": "Tax Officials Survey Raymond Lifestyle Offices and Factories",
            "Summary": "Tax officials are conducting a survey at Raymond Lifestyle's offices and factories. The company is fully cooperating with the tax authorities during this process.",
            "Sentiment": "neutral",
            "PublishDate": 1758876313400,
            "Source": "stock"
        },
        {
            "Title": "Raymond Lifestyle Expects Half of Product Portfolio to Benefit from Lower GST Rates",
            "Summary": "Raymond Lifestyle announced that approximately 50% of its product categories will benefit from reduced GST rates. The company expects this tax reduction to have a positive impact on a significant portion of its product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1758523737200,
            "Source": "stock"
        },
        {
            "Title": "Raymond Lifestyle CFO Expects Revenue Growth From GST Cuts Despite Potential Price Drops",
            "Summary": "Raymond Lifestyle's CFO anticipates revenue growth following GST cuts. While apparel prices may decline slightly due to the tax reduction, the company expects volume growth to offset the price impact and drive overall revenue expansion.",
            "Sentiment": "positive",
            "PublishDate": 1756979993896,
            "Source": "stock"
        },
        {
            "Title": "Raymond Lifestyle Reports 18% Revenue Growth to Rs 1,475 Crores in Q1 FY26",
            "Summary": "Raymond Lifestyle Limited delivered its highest Q1 performance with total income of Rs 1,475 crores, marking 18% year-on-year growth driven by volume growth in Branded Textile and Branded Apparel segments. EBITDA grew 36% to Rs 122 crores with 8.2% margin. The Branded Textile segment led growth with 27% increase to Rs 716 crores, benefiting from higher wedding dates and consumer awareness, while EBITDA nearly doubled to Rs 103 crores. Branded Apparel revenue rose 22% to Rs 370 crores across all brands and channels. However, the Garmenting segment declined to Rs 197 crores from Rs 252 crores due to US tariff uncertainties, posting an EBITDA loss of Rs 8 crores. The company closed 35 underperforming stores during the quarter while maintaining a total store count of 1,675. Net debt stood at Rs 55 crores as of June 30, 2025, with working capital days increasing to 90 from 83 due to inventory build-up for the festive season. Management expressed optimism about the India-UK Free Trade Agreement providing zero-duty access for 99% of Indian exports and expects fiscal 2026 to be a stronger recovery year.",
            "Sentiment": "positive",
            "PublishDate": 1755100859798,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Lifestyle Independent Director Mahendra Doshi Passes Away",
            "Summary": "Raymond Lifestyle Limited announced the passing of Mr. Mahendra Doshi, an Independent Director, on August 06, 2025. Doshi served on the company's board for over 10 years and held key positions including Chairman of the Stakeholders Relationship Committee and member of the Corporate Social Responsibility Committee and Investment & Finance Committee. He contributed significantly to the company with his expertise in finance, capital markets, and business administration. The company described his departure as sudden and untimely, noting his wisdom, integrity, and commitment to governance.",
            "Sentiment": "negative",
            "PublishDate": 1754497965857,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raymond Lifestyle Targets Higher Festive Season Sales and Expands Product Lines Under 'Lifestyle 2.0'",
            "Summary": "Raymond Lifestyle is targeting higher sales in branded textiles during the festive season. The company is expanding its branded apparel and Ethnix segments while focusing on garment recovery through varied orders. Under its 'Lifestyle 2.0' initiative, Raymond Lifestyle is introducing new product lines in ethnic wear, sleepwear, and innerwear categories.",
            "Sentiment": "positive",
            "PublishDate": 1754493392612,
            "Source": "stock"
        },
        {
            "Title": "Raymond Lifestyle Reports Record Q1 Revenue of ₹1,475 Cr with 18% Growth",
            "Summary": "Raymond Lifestyle Limited achieved record quarterly revenue of ₹1,475 crores for the quarter ended June 30, 2025, marking an 18% year-over-year increase. The company's EBITDA grew 36% to ₹122 crores with margins improving to 8.2% from 7.1% in the previous year. However, the company reported a pre-tax loss of ₹25 crores and net loss of ₹20 crores. Branded Textiles segment led growth with 27% revenue increase to ₹716 crores and EBITDA nearly doubling to ₹103 crores. Branded Apparel segment grew 22% to ₹370 crores. The Garmenting business faced challenges with 22% revenue decline to ₹197 crores due to US tariff uncertainties. The company operates 1,675 stores, adding 22 new stores while closing 35 underperforming locations during the quarter. Net debt stood at ₹55 crores. Management cited strong wedding bookings and improved consumer awareness as growth drivers, while noting continued impact from discretionary spending pressures and geopolitical tensions.",
            "Sentiment": "positive",
            "PublishDate": 1754492133485,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Lifestyle Reports Improved Q1 Performance with Higher Revenue and Reduced Losses",
            "Summary": "Raymond Lifestyle reported quarterly results showing revenue growth to 14.3 billion rupees from 12.2 billion rupees year-over-year. The company's EBITDA increased to 770 million rupees compared to 597 million rupees in the previous year, with EBITDA margin improving to 5.38% from 4.89%. The consolidated net loss narrowed to 198 million rupees from a loss of 232 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754490901129,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Realty Reports Strong Q1 Revenue Growth Despite Margin Decline",
            "Summary": "Raymond Realty reported Q1 consolidated net profit of 165 million rupees, up from 74 million rupees in the same period last year. Revenue surged to 3.7 billion rupees compared to 1.3 billion rupees year-over-year. EBITDA increased to 236 million rupees from 175 million rupees, though EBITDA margin declined to 6.33% from 13.51% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754393234280,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Lifestyle Reports Q4 Net Loss and Revenue Decline",
            "Summary": "Raymond Lifestyle experienced a net loss of 450 million rupees in Q4, an improvement from the 1.3 billion rupee loss in the same quarter last year. However, it's a decline from the previous quarter's loss of 642 million rupees. The company's revenue for Q4 was 14.9 billion rupees, down from 16.8 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1747095806000,
            "Source": "default"
        },
        {
            "Title": "Raymond Lifestyle: Q4 Loss Due to Cyberattack and Weak Demand",
            "Summary": "Raymond Lifestyle reported a Q4 FY25 net loss of ₹45 crore, with revenue down 11.3% YoY to ₹1,494.2 crore. EBITDA fell 94.6% to ₹13.2 crore. A ransomware attack disrupted operations, causing supply chain delays and impacting sales. The branded textile segment saw a 21% revenue decline, while the branded apparel segment's revenue slightly decreased. The company maintains a net cash surplus of ₹90 crore.",
            "Sentiment": "negative",
            "PublishDate": 1747053894000,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Lifestyle Reports Significant Drop in Q4 EBITDA and Revenue",
            "Summary": "Raymond Lifestyle experienced a substantial decline in its Q4 financial performance. The company's EBITDA fell to 136 million rupees from 2.5 billion rupees year-over-year, with EBITDA margin dropping to 0.91% from 14.62%. The consolidated net loss for Q4 was 450 million rupees, compared to 1.3 billion rupees in the previous year and 642 million rupees in the previous quarter. Revenue also decreased to 14.9 billion rupees from 16.8 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747049076000,
            "Source": "result"
        },
        {
            "Title": "Raymond Lifestyle to Consider Q4 Results on May 12",
            "Summary": "Raymond Lifestyle has announced that it will consider its fourth quarter (Q4) financial results on May 12. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746541035000,
            "Source": "default"
        },
        {
            "Title": "Raymond Lifestyle: Cyber Attack Impacts IT Assets, Customer Operations Unaffected",
            "Summary": "Raymond Lifestyle Ltd. experienced a cybersecurity incident affecting some IT assets. Core systems and operations remain unaffected. The company's technical team and cybersecurity experts are taking actions to mitigate the impact. Customer and store operations continue to run normally. The company is investigating and implementing containment and remediation measures.",
            "Sentiment": "neutral",
            "PublishDate": 1739962326000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raymond Lifestyle: Q3 Profit Plunges 60.49% Despite Revenue Growth",
            "Summary": "Raymond Lifestyle reported Q3 FY25 results with a 60.49% YoY decline in profit to ₹64.17 crore, despite a 1.62% increase in revenue to ₹1754.21 crore. Operating income fell 55.39% YoY. EPS decreased to ₹10.58, down 60.32% YoY. Analysts maintain a Strong Buy rating.",
            "Sentiment": "negative",
            "PublishDate": 1738303708000,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Lifestyles Reports Decline in Q3 Net Profit",
            "Summary": "Raymond Lifestyles has reported its financial results for the third quarter. The company's consolidated net profit decreased to 942 million rupees, compared to 1.6 billion rupees in the same period last year. However, revenue slightly increased to 17.5 billion rupees from 17.2 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738223789000,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Lifestyle: Anticipates Strong Growth in Wedding Wear Market",
            "Summary": "Raymond Lifestyle expects 12-13% growth in the wedding wear market over the next 2-3 years.",
            "Sentiment": "positive",
            "PublishDate": 1734342615000,
            "Source": "normal_news"
        },
        {
            "Title": "Raymond Lifestyles Targets 325 Ethnix Stores with ₹1-1.5 Crore Revenue per Store",
            "Summary": "Raymond Lifestyles' Group CFO has announced plans to expand their Ethnix brand to 325 stores over the next 3-4 years. Each store is expected to generate revenue between ₹1 crore to ₹1.5 crore.",
            "Sentiment": "positive",
            "PublishDate": 1734333100000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Lifestyle Anticipates Extended Wedding Season",
            "Summary": "Raymond Lifestyle has announced that the wedding season is expected to extend up to May 2025, according to a report by CNBC TV18. This extended period could potentially impact the company's sales and operations in the textile and fashion industry.",
            "Sentiment": "positive",
            "PublishDate": 1734333004000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Lifestyles Expects Significant Revenue from Wedding Season",
            "Summary": "Raymond Lifestyles' Group CFO has stated that the company anticipates generating revenue between ₹3500 crore to ₹3800 crore from the upcoming wedding season, as reported by CNBC TV18.",
            "Sentiment": "positive",
            "PublishDate": 1734332996000,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Lifestyle Sets Revenue Target for Ethnix Brand",
            "Summary": "Raymond Lifestyle has announced a revenue target of 3 to 3.5 billion rupees for its Ethnix brand over the next 2-3 years, as reported by CNBC TV18.",
            "Sentiment": "positive",
            "PublishDate": 1734332980000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Lifestyle: Proxy Advisors Oppose Gautam Singhania's Appointment as Chairman",
            "Summary": "Corporate governance advisory firms SES and IiAS recommend shareholders vote against Gautam Singhania's appointment as executive chairperson of Raymond Lifestyle. Concerns include premature appointment, remuneration policies, and potential reputational risks. The e-voting period is from November 5 to December 4.",
            "Sentiment": "negative",
            "PublishDate": 1733190102000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raymond Lifestyle: Wedding Season Boom Expected to Drive Strong H2 Performance",
            "Summary": "Raymond Lifestyle anticipates a significant boost in business during the upcoming wedding season, with an expected consumer spend of Rs 6 lakh crore over the next five months. The company foresees a shift from casual to ceremonial and formal wear, particularly in their Ethnix by Raymond brand. CEO Sunil Kataria cites a backlog of weddings and rural recovery as positive triggers for the second half of the financial year.",
            "Sentiment": "positive",
            "PublishDate": 1732081954000,
            "Source": "normal_news"
        },
        {
            "Title": "Raymond Lifestyle: Margins Set to Recover by FY25 End",
            "Summary": "Raymond Lifestyle's MD Sunil Kataria expects Ebitda margins to bounce back by the end of FY25, despite a 21% YoY drop in Q2. The company plans to increase production capacity from 6.5 million to 10 million units. Q2 revenue fell 5.3% YoY to Rs 1,708 crore, with net profit down 69.8% to Rs 42 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1730957986000,
            "Source": "result"
        },
        {
            "Title": "Raymond Lifestyle: Q2 Profit Plunges 70% Amid Subdued Demand",
            "Summary": "Raymond Lifestyle reported a 69.72% YoY decline in Q2 FY25 consolidated net profit to Rs 42.18 crore. Revenue from operations fell 5.27% to Rs 1,708.26 crore. The company cited subdued demand, weaker consumer sentiment, and higher inflationary pressures as key factors. Textile segment revenue dropped 8.48%, while apparel segment saw a marginal 1% increase.",
            "Sentiment": "negative",
            "PublishDate": 1730871414000,
            "Source": "result"
        },
        {
            "Title": "Raymond Lifestyle Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Raymond Lifestyle's Q2 EBITDA decreased to 2.1 billion rupees from 2.6 billion rupees year-over-year. The company's Q2 EBITDA margin also fell to 12.57% from 14.43% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730856948000,
            "Source": "result"
        },
        {
            "Title": "Raymond Lifestyle Reports Q2 Financial Results",
            "Summary": "Raymond Lifestyle has reported its Q2 financial results. The company experienced an exceptional items loss of 594 million rupees in Q2. The consolidated profit before tax for Q2 was 1.12 billion rupees, down from 2 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730856821000,
            "Source": "result"
        },
        {
            "Title": "Raymond Lifestyle Reports Q2 Revenue Decline",
            "Summary": "Raymond Lifestyle, a division of Raymond Ltd., reported a revenue of 17 billion rupees for the second quarter, down from 18 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1730856813000,
            "Source": "result"
        },
        {
            "Title": "Raymond Lifestyle Reports Q2 Financial Results",
            "Summary": "Raymond Lifestyle experienced a loss of 594 million rupees in exceptional items for Q2. The company's consolidated profit before tax for Q2 was 1.12 billion rupees, down from 2 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730856750000,
            "Source": "result"
        },
        {
            "Title": "Raymond Lifestyle: Massive Expansion with 9,000 New Hires",
            "Summary": "Raymond Lifestyle plans to add 900 new stores over the next three years, hiring about 9,000 workers. The company aims to increase its garmenting capacity and is receiving inquiries from global clients looking to shift production to India. Raymond is also exploring the fast fashion space in India.",
            "Sentiment": "positive",
            "PublishDate": 1729582395000,
            "Source": "normal_news"
        },
        {
            "Title": "Raymond Lifestyle: Potential 36% Upside as Motilal Oswal Initiates Coverage",
            "Summary": "Motilal Oswal initiated coverage on Raymond Lifestyle with a 'Buy' rating and a price target of ₹3,200, implying a 36% upside. The company's strong presence in men's wear, branded apparels, and potential for growth in new categories are highlighted. Despite recent valuation increases, the stock is still trading at lower multiples compared to peers. Motilal expects 11%, 14%, and 15% revenue, EBITDA, and profit CAGR over FY24-27.",
            "Sentiment": "positive",
            "PublishDate": 1729487457000,
            "Source": "normal_news"
        },
        {
            "Title": "Mukul Mahavir Agrawal Increases Stake in Raymond Lifestyle",
            "Summary": "Investor Mukul Mahavir Agrawal has increased his stake in Raymond Lifestyle from 1.18% to 1.31% during the second quarter of the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1729143657000,
            "Source": "normal_news"
        }
    ]
}