{
    "Symbol": "RAYMOND",
    "ISIN": "INE301A01014",
    "News": [
        {
            "Title": "Raymond Limited Schedules 3rd EGM for Feb 20, 2026",
            "Summary": "Raymond Limited announces its 3rd Extraordinary General Meeting for FY 2025-26 to be held on February 20, 2026, through video conference, with e-voting facility available from February 17-19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769598529892,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Eyes Growth Through Product & Regional Expansion",
            "Summary": "Raymond expresses optimism about future growth prospects, focusing on new product development and geographical expansion while advancing strategic programs from RFQ stage to contract completion for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1769572098330,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Realty Q3 profit jumps to Rs 67 cr",
            "Summary": "Raymond Real Estate Ltd reported consolidated net profit of Rs 66.79 crore in Q3, up from Rs 3.01 crore year-ago. Total income rose to Rs 765.97 crore from Rs 93.26 crore in corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1769511412357,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Q3FY26 Results: Revenue Jumps 18% to ₹580 Cr",
            "Summary": "Raymond Limited reports strong Q3FY26 performance with total income rising 18% YoY to ₹580 crores, driven by robust growth in aerospace & defense (49%) and precision technology segments.",
            "Sentiment": "positive",
            "PublishDate": 1769500117046,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond MD Reports Strong Q3 Performance Growth",
            "Summary": "Raymond's Managing Director highlights continued strong momentum in current quarter driven by robust performance across aerospace & defense, precision technology, and auto components business divisions.",
            "Sentiment": "positive",
            "PublishDate": 1769498366009,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Board Approves Merger with Everblue Apparel",
            "Summary": "Raymond's board has approved a merger with its wholly owned subsidiary Everblue Apparel to simplify corporate structure and enhance management focus, with no impact on shareholding structure.",
            "Sentiment": "positive",
            "PublishDate": 1769498315725,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Lifestyle Q3 Net Profit Drops 33% YoY",
            "Summary": "Raymond Lifestyle reported consolidated net profit of ₹429 million in Q3, down from ₹642 million in the same quarter last year, marking a 33.18% year-on-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1769494592672,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Lifestyle Appoints Satyaki Ghosh as CEO",
            "Summary": "Raymond Lifestyle Limited announces appointment of Mr. Satyaki Ghosh as Chief Executive Officer effective January 19, 2026. Ghosh brings over 25 years of experience in FMCG, textiles, and retail sectors.",
            "Sentiment": "positive",
            "PublishDate": 1768816205602,
            "Source": "stocks"
        },
        {
            "Title": "Raymond Board Meeting Set for January 27, 2026",
            "Summary": "Raymond Limited announces board meeting on January 27, 2026, to consider Q3FY26 unaudited financial results. Trading window closed for designated persons until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768807047818,
            "Source": "co_actions_results"
        },
        {
            "Title": "J.K. Investors pledges Raymond shares to Bajaj Finance",
            "Summary": "J.K. Investors (Bombay) Limited pledged 5 lakh Raymond Limited shares to Bajaj Finance Limited as collateral for loans, increasing total encumbered shares to 4.60% of share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1768402419647,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Demerger Creates Three Focused Entities",
            "Summary": "Gautam Singhania discusses Raymond's strategic demerger into Lifestyle, Real Estate, and Engineering divisions to unlock shareholder value and build future-ready businesses.",
            "Sentiment": "positive",
            "PublishDate": 1768206595155,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond subsidiaries receive CARE credit ratings",
            "Summary": "CARE Ratings assigns credit ratings to Raymond's subsidiaries JK Maini Precision Technology and JK Maini Global Aerospace for bank facilities worth ₹950 cr and ₹500 cr respectively.",
            "Sentiment": "positive",
            "PublishDate": 1767196525142,
            "Source": "stocks"
        },
        {
            "Title": "Raymond withdraws credit ratings for subsidiaries",
            "Summary": "Raymond Limited announces withdrawal of CARE credit ratings for JK Files and Engineering Limited and Ring Plus Aqua Limited following their amalgamation under composite scheme approved by NCLT.",
            "Sentiment": "neutral",
            "PublishDate": 1767112230148,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raymond Appoints Rakesh Tiwary as Group CFO",
            "Summary": "Raymond has appointed Rakesh Tiwary as Group CFO, bringing extensive financial leadership experience from major corporations. Tiwary previously served as CFO at multiple Adani group companies and held leadership positions at JSW Steel, Reliance Industries, and Indian Oil Corporation.",
            "Sentiment": "neutral",
            "PublishDate": 1764806770347,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raymond Limited Appoints Chaturvedi Shah LLP as New Statutory Auditors",
            "Summary": "Raymond Limited's Board of Directors approved the appointment of M/s. Chaturvedi Shah LLP as Statutory Auditors with effect from December 2, 2025, following the resignation of previous auditor Walker Chandiok Co LLP. The new auditors will hold office until the conclusion of the 101st Annual General Meeting, subject to member approval under Section 139 of the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1764688622627,
            "Source": "corporate_governance"
        },
        {
            "Title": "J.K. Investors Releases Pledge on 5.9 Million Raymond Shares Worth ₹619.9 Million",
            "Summary": "J.K. Investors (Bombay) Limited released pledged shares of Raymond Limited totaling 5,899,522 shares (8.86% of total share capital) that were held as collateral with Bajaj Finance Limited. The release reduces J.K. Investors' pledged shareholding in Raymond from previous levels while maintaining their overall 29.83% promoter stake in the textile company.",
            "Sentiment": "positive",
            "PublishDate": 1763469378834,
            "Source": "corporate_action"
        },
        {
            "Title": "Andhra Pradesh Secures Rs 1,201 Crore Investment from Raymond Group for Three Manufacturing Projects",
            "Summary": "Chief Minister N. Chandrababu Naidu virtually laid the foundation stone for three Raymond Group manufacturing projects worth Rs 1,201 crore in Anantapur district, covering apparel, auto components, and aerospace manufacturing. The projects are expected to generate 6,500 direct and indirect jobs and become operational by 2027, contributing to the state's goal of attracting Rs 20 lakh crore in investments and creating 20 lakh jobs.",
            "Sentiment": "positive",
            "PublishDate": 1763200319733,
            "Source": "order&deals"
        },
        {
            "Title": "Raymond Limited Reports 10% Revenue Growth in Q2 FY26, Aerospace Business Shows Strong Performance",
            "Summary": "Raymond Limited reported total income of INR 564 crores in Q2 FY26, reflecting 10% growth compared to INR 512 crores in Q2 FY25. EBITDA stood at INR 79 crores with a margin of 14.1% versus INR 77 crores and 15.1% margin in the previous year. For H1 FY26, total income reached INR 1,119 crores, an 11% year-on-year increase from INR 1,011 crores. The Aerospace and Defense segment delivered strong performance with revenue of INR 81 crores (15% growth) and EBITDA of INR 17 crores (34% growth) in Q2. The Precision Technology and Auto Components segment reported revenue of INR 409 crores (10% growth) with EBITDA of INR 57 crores (57% growth), including a one-time gain of INR 13 crores. The company remains net debt-free with cash and cash equivalents of INR 999 crores. Management highlighted successful onboarding of global customers, completion of audit compliance by major OEMs, and positive FAI approvals for critical engine components.",
            "Sentiment": "positive",
            "PublishDate": 1762186883585,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Lifestyle Reports 78% Profit Surge Despite Stock Decline",
            "Summary": "Raymond Lifestyle reported a 78% increase in net profit to ₹75 crore for the September quarter, compared to ₹42 crore in the same period last year. Revenue grew 7.3% to ₹1,832.4 crore from ₹1,708 crore, driven by strong domestic demand. EBITDA increased 5.3% to ₹226 crore, though margins declined slightly to 12.3% from 12.6%. The textile segment benefited from strong volume growth and increased wedding dates, while garmenting and B2B export segments faced challenges from order deferrals and margin pressure due to US tariffs. The company's stock fell 2% following the earnings announcement.",
            "Sentiment": "positive",
            "PublishDate": 1761719598677,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Plans to Double Aerospace Business in 4-5 Years with INR 100 Crore Annual Capex",
            "Summary": "Raymond announced plans to double its aerospace business over the next 4-5 years through an annual capital expenditure of INR 100 crore. The company targets maintaining aerospace profit margins between 22-25% for the long term. Raymond expects to keep consolidated EBITDA margins between 14-15%.",
            "Sentiment": "positive",
            "PublishDate": 1761708999641,
            "Source": "stock"
        },
        {
            "Title": "Raymond Group Targets ₹10,000 Crore Revenue by FY27 Through Multiple Growth Initiatives",
            "Summary": "Raymond Group has set a target to achieve ₹10,000 crore in consolidated revenue by FY27. The company plans to reach this goal through several strategic initiatives including scaling aerospace and auto exports, unlocking value through an engineering demerger, and monetizing land assets in Thane. The Thane land monetization is expected to generate ₹2,000 crore in cash inflows for the company.",
            "Sentiment": "positive",
            "PublishDate": 1761580600928,
            "Source": "stock"
        },
        {
            "Title": "Raymond Limited Reports 10% Revenue Growth in Q2 FY26 Despite Margin Compression",
            "Summary": "Raymond Limited announced its quarterly results for the second quarter ended September 30, 2025, showing total income of ₹564 crore compared to ₹512 crore in Q2 FY25, representing 10% year-on-year growth. EBITDA reached ₹79 crore versus ₹77 crore in the previous year, growing 3% with margin at 14.1% compared to 15.1% in Q2 FY25. The Aerospace & Defence segment generated ₹81 crore revenue (15% increase) with EBITDA of ₹17 crore (34% growth) and 21% margin. Precision Technology & Auto Components segment recorded ₹409 crore revenue (9.9% increase) with EBITDA of ₹57 crore (57.3% growth) and 13.9% margin. The company remains net debt-free with ₹27 crore cash surplus. Performance was driven by production ramp-up at aerospace OEM, newly approved parts entering production, robust domestic demand for auto components, and strong demand for hybrid products in European markets. EBITDA margin compression was attributed to decline in other income, while the outlook faces challenges from U.S. tariff-related scheduling delays.",
            "Sentiment": "positive",
            "PublishDate": 1761570955389,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Announces Q2 FY26 Results Date and Earnings Call Schedule",
            "Summary": "Raymond Ltd. will announce its second quarter FY26 results on October 27, with the board meeting scheduled to consider approval of unaudited standalone and consolidated financial results for the half-year ended September 30. The company will host an earnings call with investors and analysts on October 28 at 5:30 p.m. to discuss quarterly performance. In the previous quarter (Q1FY26), Raymond reported a consolidated profit decline of 8.8% to Rs 20.62 crore compared to Rs 22.62 crore in Q1FY25, while total income increased 11.2% to Rs 555.32 crore from Rs 499.52 crore. Raymond shares have remained nearly flat over the past five trading sessions, rising 0.2%, but have declined 6.57% over the past month. The stock closed at Rs 575.90 on Friday, down 0.52%.",
            "Sentiment": "neutral",
            "PublishDate": 1761373727143,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Chairman Calls EVs 'Politically Hyped', Compares Them to Toy Cars",
            "Summary": "Gautam Hari Singhania, Managing Director and Chairman of Raymond Group, criticized Electric Vehicles as being politically hyped and compared them to toy cars, stating he had a battery-operated car at age four. Speaking at the NDTV World Summit, Singhania discussed India's motorsport ecosystem challenges, noting his daughter races in Belgium due to better infrastructure. He mentioned supercar deliveries take 2-3 years and prefers driving at 7 a.m. in Mumbai. Singhania highlighted defense opportunities from the Russian-Ukraine war and confirmed Raymond is working on multiple products. The company decided against US operations due to uncertainties, focusing instead on India's growing middle class demand for affordable luxury. He disagreed with labeling Raymond as a luxury brand, stating they operate in the mainstream market.",
            "Sentiment": "neutral",
            "PublishDate": 1760701552791,
            "Source": "stock"
        },
        {
            "Title": "Raymond Group to invest ₹1,000 crore in Andhra Pradesh aerospace and automotive manufacturing",
            "Summary": "The Andhra Pradesh government approved two investments totaling ₹1,000 crore from Raymond Group for manufacturing facilities in Sri Satya Sai district. JK Maini Global Aerospace Limited will invest ₹510 crore in an aerospace manufacturing facility to produce precision components for global OEMs and Tier-1 suppliers, creating 1,400 jobs. JK Maini Precision Technology Ltd will invest ₹430 crore in an automotive component manufacturing unit at Gudipalli, generating 4,096 jobs. Both facilities are scheduled to begin operations by May 2027. The state will provide ₹700 crore in incentives under industrial and aerospace policies. The projects were approved by the State Investment Promotion Board chaired by Chief Minister N. Chandrababu Naidu. This represents Andhra Pradesh's first aerospace investment under its new Aerospace Policy.",
            "Sentiment": "positive",
            "PublishDate": 1760516439534,
            "Source": "stock"
        },
        {
            "Title": "Raymond Completes Income Tax Department Survey with Full Cooperation",
            "Summary": "Raymond has confirmed the completion of an Income Tax Department survey at the company. The company stated that it extended full cooperation during the survey process.",
            "Sentiment": "neutral",
            "PublishDate": 1759318472528,
            "Source": "stock"
        },
        {
            "Title": "Raymond Lifestyle Shares Drop 4% Following Income Tax Department Survey at Company Facilities",
            "Summary": "Raymond Lifestyle shares declined 4.2% to Rs 1,200.55 on BSE after the company disclosed that Income Tax Department officials conducted a survey at some of its offices and manufacturing units in India under Section 133A of the Income Tax Act, 1961. The company stated that proceedings are underway and it is extending full cooperation to officials. The announcement triggered investor sell-off due to uncertainty around potential financial or compliance implications. Raymond Lifestyle shares have fallen 49.62% over the past year and are down 41.59% year-to-date, though they gained 16.85% over the last six months and 4.61% in recent months. The stock was trading 3.65% lower at Rs 1,207.60 around 2:40 pm.",
            "Sentiment": "negative",
            "PublishDate": 1758880759695,
            "Source": "stock"
        },
        {
            "Title": "Raymond Group Chairman Uses Wedding Invitations as Economic Health Indicator",
            "Summary": "Raymond Group Chairman and Managing Director Gautam Singhania shared his unique method for measuring economic health by counting wedding invitations he receives, which he considers a good indication of economic activity. As the Raymond Group celebrates 100 years, Singhania expressed pride in the company's diversification into three distinct businesses: lifestyle, real estate, and engineering auto. He described Raymond as not just shareholder-owned but as a national asset, expressing confidence the company will exist for centuries. Singhania praised the government's GST rate cuts as a timely move to boost consumption, stating the company sees very positive demand forecasts for the next two quarters. He noted Raymond's product range spans from Rs 300 per meter to Rs 10 lakh, positioning the company to adapt to evolving apparel industry trends driven by new generations.",
            "Sentiment": "positive",
            "PublishDate": 1757574411537,
            "Source": "stock"
        },
        {
            "Title": "Raymond Limited Recommends Two Independent Directors Pending Security Clearance",
            "Summary": "Raymond Limited's Nomination and Remuneration Committee has recommended the appointment of Mr. Tikka Singh and Mr. Ajoy Mehta as Independent Directors for five-year terms. The appointments require regulatory approvals, including security clearance from the Ministry of Home Affairs through the Ministry of Civil Aviation, as Raymond operates non-scheduled air transport services. The Board of Directors will consider the appointments after receiving necessary approvals from the Ministry of Home Affairs. The proposed appointments comply with stock exchange requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1755523294500,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raymond Limited Reports Q1 FY26 Results; Completes Engineering Business Restructuring",
            "Summary": "Raymond Limited held a conference call discussing quarterly results ended June 30, 2025. The company reported consolidated total income of INR555 crores with EBITDA of INR87 crores and 15.7% EBITDA margin. The aerospace and defence segment achieved revenue of INR87 crores (37% year-on-year growth) with EBITDA of INR21 crores and 23.7% margin. Precision technology and auto components segment recorded revenue of INR398 crores (12% growth) with EBITDA of INR42 crores and 10.6% margin. The company completed restructuring of its engineering business, receiving NCLT approval on July 4, 2025, creating two new subsidiaries: JK Maini Global Aerospace Limited for aerospace and defence, and JK Maini Precision Technology Limited for precision engineering and auto components. Raymond maintains debt-free status with net cash surplus of INR157 crores. The company signed agreements with Safran Aircraft Engines and Pratt & Whitney during the Paris Air Show. Management expects high-teen growth in aerospace and early-teen growth in industrial business, with plans to double aerospace business in 3-4 years.",
            "Sentiment": "positive",
            "PublishDate": 1755097122425,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Explores Vietnam, Bangladesh, Ethiopia Production Shift Amid US Tariff Concerns",
            "Summary": "Raymond Ltd. is evaluating strategic alternatives to mitigate potential US tariff impacts on its garment business. Group CFO Amit Agarwal stated that 50-55% of the company's garment revenue comes from the US market, with 30% of production already based at their Ethiopian plant, which benefits from a lower 10% duty rate. The company generates Rs 550 crore from garments, with Rs 400 crore from India and Rs 150 crore from Ethiopia. Raymond has capacity to shift an additional Rs 50-75 crore worth of production from India to Ethiopia and is considering exporting fabrics to Bangladesh and Vietnam for garment manufacturing. Agarwal noted timing challenges for US retailers due to upcoming Thanksgiving and Christmas sales, with production cycles spanning 5-6 months. He expects the situation to stabilize by the end of the second quarter of FY26. The executive emphasized that 85% of Raymond's business remains in India and anticipates a stronger domestic performance this year driven by festive and wedding seasons. Raymond shares closed 1.59% lower at Rs 633.",
            "Sentiment": "neutral",
            "PublishDate": 1754708079436,
            "Source": "stock"
        },
        {
            "Title": "Raymond Targets Long-Term Growth Through Aerospace Partnerships and EV Expansion",
            "Summary": "Raymond is pursuing long-term growth through multiple strategic initiatives. The company is leveraging China+1 opportunities and has established strategic partnerships with aerospace companies Safran and Pratt & Whitney. Raymond is expanding into electric vehicle and hybrid automotive parts manufacturing. The company has secured aerospace orders spanning 12-15 years, supported by a backlog of over 16,000 aircraft.",
            "Sentiment": "positive",
            "PublishDate": 1754494076144,
            "Source": "stock"
        },
        {
            "Title": "Raymond Lifestyle Reports Narrowed Loss Despite Revenue Growth in Q1",
            "Summary": "Raymond Lifestyle Ltd. reported a narrowed net loss of Rs 19.82 crore in Q1 compared to Rs 23.21 crore in the same period last year. The company's revenue increased 17.2% to Rs 1,430.43 crore from Rs 1,220.12 crore year-over-year. EBITDA improved 29% to Rs 77 crore versus Rs 59.72 crore, with margins expanding to 5.4% from 4.9%. The stock closed 4.3% lower at Rs 1,175 on the National Stock Exchange before the results announcement. Three analysts maintain 'buy' ratings on the stock, though the average 12-month price target suggests a potential downside of 34.4%.",
            "Sentiment": "neutral",
            "PublishDate": 1754490961933,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Limited Schedules Q1FY26 Earnings Conference Call for August 7, 2025",
            "Summary": "Raymond Limited has announced a conference call scheduled for August 7, 2025 at 5:30 pm IST to discuss the company's financial performance for the first quarter ended June 30, 2025. The call will be hosted by Antique Stock Broking Limited and will feature senior management including Group CFO Amit Agarwal, Engineering Business MD Gautam Maini, President Corporate Commercial S L Pokharna, and other key executives from finance, corporate development, and investor relations teams.",
            "Sentiment": "neutral",
            "PublishDate": 1753877499714,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Group CFO Says India-UK FTA Will Double UK Export Revenue in 18-24 Months",
            "Summary": "Raymond Group CFO Amit Agarwal stated that the India-UK Free Trade Agreement will significantly boost India's textile sector growth through integrated supply chains. The FTA will help Indian exporters compete equally with Bangladesh, Vietnam, and Indonesia, which already have zero-duty benefits. Agarwal noted that thin textile margins and high duties previously limited exports to high-value products only. Raymond expects to benefit from its integrated supply chain and lead time advantages. The company anticipates its UK export revenue to double over the next 18-24 months. Agarwal views this agreement as opening doors for future EU negotiations and strengthening export capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1753686618562,
            "Source": "stock"
        },
        {
            "Title": "Raymond: Real Estate Subsidiary Set for Stock Market Debut",
            "Summary": "Raymond's real estate subsidiary, Raymond Realty Ltd (RRL), is listing on stock exchanges on July 1. This follows a demerger where Raymond shareholders received one RRL share for each Raymond share held. SBI Securities projects RRL's listing price between Rs 897 and Rs 1,430. Raymond's stock surged 7% on this news, with its current price at Rs 756.10.",
            "Sentiment": "positive",
            "PublishDate": 1751343747000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Ltd: Shares Surge 14% Ahead of Raymond Realty Listing",
            "Summary": "Raymond Ltd shares closed 14.21% higher at Rs 713.1 on NSE, anticipating the July 1 listing of its demerged realty arm, Raymond Realty. The company plans to launch six new residential projects in Mumbai Metropolitan Region this fiscal, targeting premium and luxury segments. The demerger aims to increase shareholder value and focus on real estate business.",
            "Sentiment": "positive",
            "PublishDate": 1751278122000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond to Establish Aerospace and Other Subsidiaries",
            "Summary": "Raymond has announced plans to establish its aerospace division as a subsidiary. The company will also create separate subsidiaries for its automotive components and engineering businesses. This restructuring indicates a strategic move to potentially streamline operations or focus on specific business segments.",
            "Sentiment": "positive",
            "PublishDate": 1749703306000,
            "Source": "default"
        },
        {
            "Title": "Raymond Ltd: Realty Demerger Boosts Stock to Upper Circuit",
            "Summary": "Raymond Ltd's shares hit 5% upper circuit at Rs 584.25 after completing the demerger of Raymond Realty. The real estate arm exits with Rs 399 crore net cash surplus, Q4FY25 revenue of Rs 766 crore, and EBITDA of Rs 194 crore. Raymond Realty's potential revenue now close to Rs 40,000 crore. Separate listing expected by Q2 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1747292104000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Ltd: Successful Demerger Boosts Stock to Upper Circuit",
            "Summary": "Raymond Ltd's shares hit upper circuit, rising 4.99% to ₹551.20 following successful demerger of real estate business. Engineering segment reports 95% YoY income growth to ₹601 crore in Q4 FY25. Demerged real estate business posts ₹766 crore revenue. Raymond Realty expands portfolio with new JDAs, potential revenue nearing ₹40,000 crore. Both entities remain cash surplus post-demerger.",
            "Sentiment": "positive",
            "PublishDate": 1747220240000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Ltd: Shares Adjust Post Real Estate Business Demerger",
            "Summary": "Raymond Ltd shares adjusted downward as the company's real estate arm, Raymond Realty, was demerged in a 1:1 ratio. The ex-date and record date were set for May 14. Raymond Realty will be listed separately on NSE and BSE, with the listing date to be announced later. The demerger aims to capitalize on the real estate business's growth potential.",
            "Sentiment": "neutral",
            "PublishDate": 1747197918000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Reports Mixed Q4 Results",
            "Summary": "Raymond, an Indian textile company, has reported its Q4 financial results. The consolidated net profit decreased to 1.33 billion rupees from 2.3 billion rupees year-over-year, but increased from 721.3 million rupees quarter-over-quarter. Revenue significantly increased to 5.57 billion rupees from 2.66 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747095746000,
            "Source": "default"
        },
        {
            "Title": "Raymond Ltd: Q4 Profit Drops 42%, Real Estate Arm Shows Strong Growth",
            "Summary": "Raymond Ltd's Q4 FY25 consolidated net profit fell 42% to Rs 133 crore. Revenue increased 109% to Rs 557 crore. EBITDA rose 88.6% to Rs 55 crore, but margin contracted to 9.8%. The demerged real estate arm, Raymond Realty Ltd, saw 13% revenue growth to Rs 766 crore with 25.3% margin.",
            "Sentiment": "neutral",
            "PublishDate": 1747069084000,
            "Source": "earnings"
        },
        {
            "Title": "Raymond Reports Mixed Q4 Results",
            "Summary": "Raymond, an Indian textile company, has reported its Q4 financial results. The company's revenue increased significantly to 5.57 billion rupees, up from 2.66 billion rupees in the same quarter last year. However, the consolidated net profit decreased to 1.33 billion rupees, compared to 2.3 billion rupees year-over-year. Sequentially, the net profit improved from 721.3 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747069080000,
            "Source": "result"
        },
        {
            "Title": "Raymond Ltd: Q4 and FY25 Results Announcement Scheduled for May 12",
            "Summary": "Raymond Ltd will announce its Q4 and FY25 results on May 12, 2025. The company will host an earnings call on May 13. Trading window for designated persons is closed until 48 hours after results declaration. In Q3 FY25, Raymond reported a 61% YoY drop in consolidated net profit to Rs 72.28 crore, while total income rose 35.55% YoY to Rs 985.35 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1746853800000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond to Consider Q4 Results on May 12",
            "Summary": "Raymond, a company, has announced that it will consider its fourth quarter (Q4) financial results on May 12.",
            "Sentiment": "neutral",
            "PublishDate": 1746541690000,
            "Source": "default"
        },
        {
            "Title": "Raymond Announces 6th Major Joint Development Agreement",
            "Summary": "Raymond has announced its 6th major joint development agreement for a project with an estimated gross development value of approximately Rs. 5,000 crore. This move signifies Raymond's continued expansion in the real estate sector through strategic partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1743479312000,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Approves Scheme of Arrangement Between Raymond and Raymond Realty",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the scheme of arrangement between Raymond and its subsidiary, Raymond Realty Ltd. This corporate action suggests a restructuring or reorganization between the parent company and its real estate arm.",
            "Sentiment": "positive",
            "PublishDate": 1743088206000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raymond Ltd: Expands Real Estate Portfolio with Rs 10,000 Crore JDA Projects in Mumbai",
            "Summary": "Raymond Ltd is pursuing joint development agreements (JDAs) in Mumbai, with projects worth Rs 10,000 crore in Mahim, Bandra, and Sion. The company aims to boost growth through this capital-efficient model. Raymond expects 35-40% of pre-sales to come from outside Thane next year, up from the current 30%. The Mahim redevelopment project sales are set to begin in Q3 or Q4 of next year.",
            "Sentiment": "positive",
            "PublishDate": 1742893525000,
            "Source": "normal_news"
        },
        {
            "Title": "Raymond Ltd: Nawaz Modi Singhania Resigns from Board of Directors",
            "Summary": "Nawaz Modi Singhania has resigned as director of Raymond Ltd, effective March 19, 2025. The company did not disclose specific reasons for her departure. This follows her removal from boards of JK Investors, Raymond Consumer Care Ltd, and Smart advisory-finserve last year.",
            "Sentiment": "neutral",
            "PublishDate": 1742401147000,
            "Source": "corporate_governance"
        }
    ]
}