{
    "Symbol": "RBA",
    "ISIN": "INE07T201019",
    "News": [
        {
            "Title": "Restaurant Brands Asia Q3FY26 Loss Widens to ₹70.38 Cr",
            "Summary": "Restaurant Brands Asia reported standalone net loss of ₹70.38 crore for Q3FY26 vs ₹186.28 crore loss in Q3FY25. Revenue grew 16.55% to ₹577.32 crore driven by expansion.",
            "Sentiment": "negative",
            "PublishDate": 1770142729631,
            "Source": "co_actions_results"
        },
        {
            "Title": "Restaurant Brands Asia allots 70,830 ESOP shares",
            "Summary": "Restaurant Brands Asia Limited allotted 70,830 equity shares under ESOP Scheme 2015, increasing paid-up capital to Rs. 5,82,81,77,350. The allotment was approved by the Nomination and Remuneration Committee on February 3, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770117060786,
            "Source": "co_actions_results"
        },
        {
            "Title": "Restaurant Brands Asia Open Offer at ₹70 per Share",
            "Summary": "Lenexis Foodworks and consortium launch mandatory open offer to acquire up to 20,80,61,717 equity shares of Restaurant Brands Asia at ₹70 per share for total consideration of ₹1,456.43 crores under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769585017999,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI MF crosses 5% threshold in Restaurant Brands Asia",
            "Summary": "SBI Mutual Fund acquired 50,85,000 shares of Restaurant Brands Asia on January 23, 2026, increasing its total holding to 5.4272% of the company's paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1769573967101,
            "Source": "co_actions_results"
        },
        {
            "Title": "Restaurant Brands Asia Board Meet on Feb 3, 2026",
            "Summary": "Restaurant Brands Asia Limited has scheduled a board meeting for February 3, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769528323058,
            "Source": "co_actions_results"
        },
        {
            "Title": "Inspira Global Acquires RBA for ₹70/Share",
            "Summary": "Inspira Global to acquire controlling stake in Restaurant Brands Asia at ₹70 per share with ₹1,500 crore investment, marking Everstone's complete exit from Burger King India operator.",
            "Sentiment": "positive",
            "PublishDate": 1768925930014,
            "Source": "co_actions_results"
        },
        {
            "Title": "Restaurant Brands Asia Board Approves Major Capital Restructuring",
            "Summary": "Restaurant Brands Asia Limited's board approved increasing authorized share capital to ₹900 crores and a preferential issue worth ₹1,500 crores to new acquirers, marking a significant ownership change.",
            "Sentiment": "positive",
            "PublishDate": 1768925149058,
            "Source": "co_actions_results"
        },
        {
            "Title": "Restaurant Brands Asia Board to Meet Jan 20 for Fundraising",
            "Summary": "Restaurant Brands Asia shares gain 1.9% as board schedules meeting on January 20 to consider fundraising via equity, debt securities. Everstone Capital reportedly reviving exit efforts.",
            "Sentiment": "positive",
            "PublishDate": 1768489756747,
            "Source": "co_actions_results"
        },
        {
            "Title": "Restaurant Brands Asia Receives Rs 2.1 Lakh Fine for Food Safety Violations",
            "Summary": "Restaurant Brands Asia Limited received an order from Additional District Magistrate, Surajpur, directing payment of Rs 2,10,000 fine for violations under Food Safety and Standards Act related to packaging and labelling regulations. The company stated there is no material impact on its financial, operations and other activities from this regulatory action.",
            "Sentiment": "negative",
            "PublishDate": 1764859642824,
            "Source": "stock"
        },
        {
            "Title": "Restaurant Brands Asia Allots 1.5 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Restaurant Brands Asia's Nomination and Remuneration Committee approved the allotment of 1,50,000 equity shares with face value of Rs. 10 each under the BK Employee Stock Option Scheme 2015. The allotment increases the company's issued and paid-up equity share capital from Rs. 53,30,00,700 to Rs. 54,45,00,700, with the new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764766502941,
            "Source": "corporate_action"
        },
        {
            "Title": "Jaman Sai Investments Reduces Stake in Restaurant Brands Asia to 6.50%",
            "Summary": "Jaman Sai Investments Ltd sold shares in Restaurant Brands Asia Limited through secondary market transactions, reducing their holding from 8.56% to 6.50% as of November 20, 2025. The sale involved 37,897,965 shares out of the company's total paid-up equity capital of 582,300,070 shares, representing a 2.06% decrease in shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1764310402665,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia Reports 15.6% Revenue Growth with Sustained Traffic Gains in India",
            "Summary": "Restaurant Brands Asia delivered revenue of Rs. 568 crores with 15.6% growth, driven by 2.8% same-store sales growth and new restaurant additions. The company maintained positive traffic growth for 10 consecutive quarters in dine-in operations, with ADS at Rs. 120,000. Gross margins improved 60 basis points to 68.3% due to supply chain efficiencies and delivery profitability improvements. Restaurant EBITDA stood at Rs. 59 crores (10.4% margin) while company EBITDA reached Rs. 28.4 crores (5% margin). The company added 14 restaurants and expects to reach 580 locations by year-end. Digital transactions now account for 91% of all transactions. Indonesia operations showed mixed results with Burger King business recovering but Popeyes facing challenges. Management continues exploring strategic options for Indonesia while focusing on utility cost reduction initiatives in India.",
            "Sentiment": "positive",
            "PublishDate": 1762304163484,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia Reports No Material Deviation in QIP Fund Utilization for Q2 FY2026",
            "Summary": "Restaurant Brands Asia Limited submitted its monitoring agency report for Q2 FY2026 regarding the utilization of proceeds from its Qualified Institutions Placement (QIP). ICRA Limited, the monitoring agency, reported no material deviation from the stated objectives of the INR 500 crore QIP issue conducted in March 2025. The company raised net proceeds of INR 480.09 crore, which was INR 1.09 crore higher than estimated due to lower issue-related expenses. The funds are being utilized for three main purposes: prepayment of outstanding borrowings (INR 72 crore), capital expenditure for new restaurant setups (INR 325 crore), and general corporate purposes (INR 83.09 crore). As of September 30, 2025, INR 284.97 crore of unutilized proceeds were deployed in various fixed deposits and mutual funds, earning returns between 6.93% to 7.65%. All implementation timelines remain on schedule with completion targeted for Fiscal 2026-2027.",
            "Sentiment": "neutral",
            "PublishDate": 1761853246265,
            "Source": "corporate_action"
        },
        {
            "Title": "Burger King India Reports 15.6% Revenue Growth with Same-Store Sales Up 2.8%",
            "Summary": "Restaurant Brands Asia Limited, formerly Burger King India Limited, reported standalone revenue of Rs. 5,687 million for the second quarter of FY26, representing a 15.6% increase year-over-year. The company achieved same-store sales growth of 2.8% and gross margins of 68.3%, up 80 basis points from the previous year. Standalone EBITDA reached Rs. 813 million, growing 16.3% year-over-year. The restaurant count expanded to 533 stores with 14 new additions during the quarter. The company experienced positive traffic growth in both dine-in and delivery channels, attributed to value offerings, menu innovations, and technology investments. Management cited supply chain efficiencies for margin expansion and expressed confidence about growth prospects for the second half of the year, noting favorable GST reforms and benign inflation outlook.",
            "Sentiment": "positive",
            "PublishDate": 1761849912424,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia Reports Quarterly Loss, Appoints New Senior Management Personnel",
            "Summary": "Restaurant Brands Asia Limited reported a standalone loss of ₹202.42 million for the quarter ended September 30, 2025, compared to a loss of ₹165.81 million in the same period last year. Revenue from operations increased to ₹5,686.53 million from ₹4,921.22 million year-over-year. On a consolidated basis, the company posted a loss of ₹643.29 million versus ₹654.54 million in the previous year, with consolidated revenue rising to ₹7,034.25 million from ₹6,324.28 million. The Board approved the appointment of Mr. Subramaniam Pillai, currently Chief Operations Officer, as Senior Management Personnel effective October 30, 2025. Pillai has been with the company since 2014 and has over 25 years of experience in Operations and Training.",
            "Sentiment": "neutral",
            "PublishDate": 1761838454487,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia Shareholders Approve Capital Clause Amendment at Annual General Meeting",
            "Summary": "Restaurant Brands Asia Limited shareholders approved an amendment to the Capital Clause of the company's Memorandum of Association at the 12th Annual General Meeting held on August 21, 2025. The authorized share capital has been increased to ₹700 crore, divided into 70 crore equity shares of ₹10 each. The company cited the introduction of the RBAL Employee Stock Option Scheme 2024 and shares issued through Qualified Institutions Placement in March 2025 as reasons for the increase. The amendment was necessary due to expected dilution from stock option schemes and the minimal difference between current paid-up share capital and previous authorized share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1755871549669,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia Reports 12.6% Revenue Growth in Q1 FY26 with Strong India Performance",
            "Summary": "Restaurant Brands Asia Limited reported quarterly revenue growth of 12.6% to INR 552 crores, driven by same-store sales growth of 2.6% and addition of 63 net new restaurants. Restaurant EBITDA increased 23% to INR 53.6 crores, while Company EBITDA grew 28.6% to INR 22.5 crores. The India business showed strong dine-in traffic growth supported by value promotions including '2 for 79' and '2 for 99' offerings, premium Korean burger range, and cafe expansion to 480 locations. Digital transformation reached 93% of restaurants with self-ordering kiosks, with 90% of sales now processed digitally. The company's app saw 50% growth in installs and 60% increase in orders quarter-on-quarter. In Indonesia, Burger King achieved positive restaurant-level EBITDA for the first time in several quarters, with ADS growing 5% year-over-year from November 2024 to July 2025. The company closed 4 additional restaurants in Indonesia and reduced corporate overheads by 25% (INR 15 crores), targeting further 10% reduction. Management maintains guidance of adding 60-80 restaurants annually to reach approximately 800 by FY29, with gross profit margin target of 70% by FY29.",
            "Sentiment": "positive",
            "PublishDate": 1754312378943,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia Reports No Deviation in QIP Fund Utilization for Q1 FY2026",
            "Summary": "Restaurant Brands Asia Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing compliant utilization of proceeds from its INR 500 crore Qualified Institutions Placement (QIP). ICRA Limited, the monitoring agency, confirmed no deviation from the stated objects of the issue. The company utilized INR 186.67 crore during the quarter: INR 72 crore for debt repayment, INR 30.65 crore for capital expenditure toward new restaurant setup, INR 64.11 crore for general corporate purposes (primarily salary payments of INR 63.30 crore), and INR 19.91 crore for issue-related expenses. The remaining INR 313.33 crore of unutilized funds were deployed in fixed deposits and mutual funds, generating returns between 7.65% to 9.62%. All project timelines remain on schedule with completion expected during fiscal 2026-2027.",
            "Sentiment": "positive",
            "PublishDate": 1753968448140,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia Reports Quarterly Loss of ₹115.69 Million, Revenue Rises 33% Year-over-Year",
            "Summary": "Restaurant Brands Asia Limited reported a standalone loss of ₹115.69 million for the quarter ended June 30, 2025, compared to a loss of ₹269.45 million in the same period last year. Revenue from operations increased 33% year-over-year to ₹6,522.92 million from ₹4,904.94 million. On a consolidated basis, the company posted a loss of ₹454.30 million versus ₹521.89 million in the previous year quarter, with consolidated revenue rising 8% to ₹6,977.23 million. The company's operations span India and Indonesia through its subsidiary PT Sari Burger Indonesia. Basic earnings per share improved to -₹0.20 from -₹0.54 year-over-year on a standalone basis, and to -₹0.72 from -₹0.99 on a consolidated basis.",
            "Sentiment": "neutral",
            "PublishDate": 1753959252993,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia Schedules Q1 FY26 Results Conference Call for July 31",
            "Summary": "Restaurant Brands Asia Limited has scheduled an investors' conference call on July 31, 2025 at 5:30 PM IST to discuss the unaudited financial results for Q1 FY26. Key executives including the Group CEO, CFO, and other senior management will be present on the call. The company will discuss both standalone and consolidated financial results for the quarter ended June 30, 2025. Senior leadership participating includes Whole-time Director & Group CEO Rajeev Varman, Group CFO Sumit Zaveri, and other executives from India and Indonesia operations.",
            "Sentiment": "neutral",
            "PublishDate": 1753445660982,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia: Dolat Capital Downgrades to 'Sell' After Q4 Results",
            "Summary": "Restaurant Brands Asia reported 5.9% YoY revenue growth to Rs 6.3 billion in Q4 FY25. Gross margin expanded by 100 bps to 65.3%. Ebitda margin remained flat at 11.6%, with Ebitda growing 5.7% YoY to Rs 732 million. The company posted an adjusted net loss of Rs 604 million. Dolat Capital downgraded the stock to 'Sell' following recent price increases.",
            "Sentiment": "negative",
            "PublishDate": 1747713632000,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia: Q4 Loss Narrows, Revenue Grows on Store Expansion",
            "Summary": "Restaurant Brands Asia reported a narrowed Q4 FY25 net loss of ₹60.4 crore, down from ₹92 crore year-over-year. Revenue increased 5.9% to ₹632.5 crore. EBITDA rose 6.1% to ₹73.2 crore. Burger King India added 58 outlets, reaching 513 stores. The company plans to expand to 800 restaurants by FY29.",
            "Sentiment": "positive",
            "PublishDate": 1747658142000,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia Reports Q4 Financial Results",
            "Summary": "Restaurant Brands Asia has released its Q4 financial results. The company's EBITDA increased to 750 million rupees from 552 million rupees year-over-year. EBITDA margin improved to 15.31% from 12.57% in the same period. The company reported a net loss of 254 million rupees, compared to a loss of 310 million rupees year-over-year and a loss of 186 million rupees quarter-over-quarter. Revenue for Q4 rose to 4.9 billion rupees from 4.39 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747656085000,
            "Source": "result"
        },
        {
            "Title": "Investors Seek Stake in Burger King India",
            "Summary": "According to ET Now, investors are showing interest in acquiring a stake in Burger King India, a subsidiary of Restaurant Brands Asia. This news suggests potential changes in ownership or investment structure for the fast-food chain's Indian operations.",
            "Sentiment": "positive",
            "PublishDate": 1745917510000,
            "Source": "default"
        },
        {
            "Title": "Restaurant Brands Asia: MIT Invests ₹92 Crore in ₹500 Crore QIP",
            "Summary": "Massachusetts Institute of Technology (MIT) emerged as the largest investor in Restaurant Brands Asia's ₹500 crore Qualified Institutional Placement, investing ₹92 crore. The funds will be used for opening new stores, reducing debt, and strengthening the balance sheet. RBA operates 510 stores across Burger King, Popeyes, and Tim Hortons brands in India.",
            "Sentiment": "positive",
            "PublishDate": 1743465055000,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia: QIP Closes at Rs 60 Per Share",
            "Summary": "Restaurant Brands Asia Ltd. completed its qualified institutional placement (QIP) at Rs 60 per share, a 3.72% discount to the floor price. The company aimed to raise up to Rs 500 crore. Shares will be credited on March 27 and start trading on April 1. Proceeds will be used for debt prepayment and capital expenditure.",
            "Sentiment": "neutral",
            "PublishDate": 1743000003000,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia Announces Qualified Institutions Placement",
            "Summary": "Restaurant Brands Asia has announced the opening of a Qualified Institutions Placement (QIP). The company has set the floor price for the QIP at 62.32 rupees per share. This move suggests that the company is looking to raise capital through institutional investors.",
            "Sentiment": "neutral",
            "PublishDate": 1742861510000,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia: QIP Launch with Floor Price Set",
            "Summary": "Restaurant Brands Asia Ltd. has launched a qualified institutional placement (QIP) with a floor price of Rs 62.32 per share, potentially raising up to Rs 500 crore. The company may offer a discount of up to 5% on the floor price. This comes amid challenges in the fast-food industry, including legal disputes and competition from quick-commerce companies.",
            "Sentiment": "neutral",
            "PublishDate": 1742818526000,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia Reports Increased Q3 Net Loss and Revenue",
            "Summary": "Restaurant Brands Asia has reported a net loss of 186.3 million rupees for the third quarter, compared to a loss of 64 million rupees in the same period last year. The loss has also increased from 165.8 million rupees in the previous quarter. However, the company's revenue has grown to 4.95 billion rupees, up from 4.45 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738197270000,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia: Burger King Operator's Q3 Loss Widens Despite Revenue Growth",
            "Summary": "Restaurant Brands Asia reported a net loss of ₹50.3 crore in Q3 FY2025, wider than the ₹36 crore loss in Q3 FY2024. Revenue increased 5.8% to ₹639 crore. EBITDA rose 1.6% to ₹69.4 crore, but margins declined. The company added 69 stores in India year-on-year, reaching 510 stores. Same-store sales growth was down 0.5%. In Indonesia, 15 underperforming stores were closed.",
            "Sentiment": "neutral",
            "PublishDate": 1738150270000,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia to Consider Q3 Results on February 1",
            "Summary": "Restaurant Brands Asia has announced that it will be considering its third quarter (Q3) financial results on February 1. This indicates that the company is preparing to review and potentially approve its financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737554839000,
            "Source": "earnings"
        },
        {
            "Title": "Restaurant Brands Asia: Board Approves ₹500 Crore QIP and Employee Stock Option Scheme",
            "Summary": "Restaurant Brands Asia Ltd. (RBA) has approved a ₹500 crore qualified institutions placement (QIP) and launched the RBAL Employee Stock Option Scheme 2024. The ESOS will offer up to 1.04 crore stock options to eligible employees. The board seeks shareholder approval via postal ballot for the QIP, ESOS, and increased borrowing limits.",
            "Sentiment": "positive",
            "PublishDate": 1734688310000,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia: Board to Consider Fundraising Options",
            "Summary": "Restaurant Brands Asia's board will meet on December 20, 2024, to discuss potential fundraising methods including preferential issue and qualified institutions placement. The company may also convene an EGM or postal ballot for shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1734499510000,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia: Board to Consider Fundraising Options",
            "Summary": "Restaurant Brands Asia's board will meet on December 20, 2024, to discuss potential fundraising methods including preferential issue and qualified institutions placement. The board will also consider calling an EGM or initiating a postal ballot for shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1734451991000,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia Reports Q2 EBITDA Growth",
            "Summary": "Restaurant Brands Asia has announced its Q2 financial results. The company's EBITDA increased to 699 million rupees from 634 million rupees in the same quarter last year. Additionally, the EBITDA margin improved slightly to 14.22% from 14.00% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730121481000,
            "Source": "result"
        },
        {
            "Title": "Restaurant Brands Asia Reports Q2 Revenue Growth",
            "Summary": "Restaurant Brands Asia has announced its second quarter revenue of 4.92 billion rupees, showing an increase from 4.5 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1730121474000,
            "Source": "result"
        },
        {
            "Title": "Restaurant Brands Asia Reports Increased Q2 Net Loss",
            "Summary": "Restaurant Brands Asia has reported a net loss of 166 million rupees for the second quarter, which is an increase from the 93 million rupee loss in the same quarter last year. The loss has also widened compared to the previous quarter's loss of 269 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1730121467000,
            "Source": "result"
        }
    ]
}