{
    "Symbol": "RBLBANK",
    "ISIN": "INE976G01028",
    "News": [
        {
            "Title": "RBL Bank alerts on Feb 12 nationwide strike impact",
            "Summary": "RBL Bank informs exchanges about potential branch disruptions due to one-day nationwide bank strike called by central trade unions on February 12, 2026, with bank employees likely to participate.",
            "Sentiment": "neutral",
            "PublishDate": 1770815359525,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank Allots 1,54,262 Shares Under ESOP Scheme",
            "Summary": "RBL Bank allotted 1,54,262 equity shares to employees under its ESOP scheme on February 09, 2026, increasing paid-up share capital to Rs. 617,65,21,720.",
            "Sentiment": "neutral",
            "PublishDate": 1770717744164,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank Open Offer Corrigendum by Emirates NBD",
            "Summary": "Emirates NBD Bank issues corrigendum to its open offer for RBL Bank, adding SEBI regulatory approvals as required statutory conditions for the ₹116,364,204,040 acquisition deal.",
            "Sentiment": "neutral",
            "PublishDate": 1770116814184,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank Allots 3.41 Lakh Shares Under ESOP Scheme",
            "Summary": "RBL Bank allotted 3,41,431 equity shares to employees under ESOP scheme on February 02, 2026, increasing paid-up share capital from Rs. 617.16 crore to Rs. 617.50 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1770021405702,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank alerts on nationwide strike impact Jan 27",
            "Summary": "RBL Bank discloses potential branch disruptions due to nationwide bank strike called by United Forum of Bank Unions for January 27, 2026, affecting employees affiliated with AIBEA and AIBOA.",
            "Sentiment": "neutral",
            "PublishDate": 1769186967778,
            "Source": "stocks"
        },
        {
            "Title": "BNP Paribas sells ₹178 cr RBL Bank stake to BofA",
            "Summary": "French bank BNP Paribas offloaded 60 lakh RBL Bank shares worth ₹178 crore via bulk deal, while BofA Securities acquired similar stake. RBL Bank reported 555% jump in Q3 net profit.",
            "Sentiment": "neutral",
            "PublishDate": 1769011550442,
            "Source": "co_actions_results"
        },
        {
            "Title": "CCI Approves Emirates NBD's RBL Bank Stake Purchase",
            "Summary": "Competition Commission of India grants regulatory approval for Emirates NBD Bank's proposed acquisition of stake in RBL Bank, marking a significant development in the Indian banking sector.",
            "Sentiment": "positive",
            "PublishDate": 1768914233793,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank Shares Drop 7% on Rising Credit Costs",
            "Summary": "RBL Bank shares fell over 7% following Q3 results showing 40 bps rise in credit costs to 2.5%, higher provisions at ₹639 crore, and net profit missing estimates at ₹214 crore versus expected ₹260+ crore.",
            "Sentiment": "negative",
            "PublishDate": 1768798565937,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank Targets 75-78% Provisioning Coverage Ratio",
            "Summary": "RBL Bank announces strategic plan to achieve provisioning coverage ratio of 75% to 78% with minimum comfort level of 65%, targeting completion in the next quarter.",
            "Sentiment": "positive",
            "PublishDate": 1768797652322,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank Plans Aggressive Branch Expansion to 1,000 by FY28",
            "Summary": "RBL Bank outlines ambitious growth strategy targeting 600 branches by March, 800 by next March, and 1,000 by FY28. Credit costs expected to remain stable with potential improvements in H2.",
            "Sentiment": "positive",
            "PublishDate": 1768797598184,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank Expects NIM Improvement Despite Rate Cuts",
            "Summary": "RBL Bank anticipates slight net interest margin improvement through better term deposit pricing and high-yield asset focus, while credit card delinquencies expected to normalize by September.",
            "Sentiment": "neutral",
            "PublishDate": 1768797572423,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank Q3 Net Profit Surges 555% to ₹214 Crore",
            "Summary": "RBL Bank reports exceptional Q3FY26 performance with net profit jumping 555% YoY to ₹214 crore, while asset quality improves with GNPA declining to 1.88%. Analysts maintain positive outlook.",
            "Sentiment": "positive",
            "PublishDate": 1768795336384,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank grants 81,000 stock options to employees",
            "Summary": "RBL Bank's Nomination and Remuneration Committee approved granting 81,000 stock options to eligible employees under ESOP 2013 and ESOP 2018 at ₹312.00 per option on January 16, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768550969005,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank Cuts Savings Deposit Rates by 50 Bps",
            "Summary": "RBL Bank reduces savings deposit rates from 6.5% to 6% for balances between ₹25 lakh and ₹3 crore, effective January 15, 2025. Stock trades 1.3% higher at ₹309.65.",
            "Sentiment": "neutral",
            "PublishDate": 1768377300429,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank Q3FY26 Earnings Call Set for January 17",
            "Summary": "RBL Bank announces investor conference call on January 17, 2026 at 14:30 IST to discuss Q3FY26 financial results for quarter ended December 31, 2025, led by MD & CEO R Subramaniakumar.",
            "Sentiment": "neutral",
            "PublishDate": 1768314771284,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank seeks shareholder approval for director appointments",
            "Summary": "RBL Bank initiates postal ballot for re-appointing Chandan Sinha as Independent Director and appointing Jaideep Iyer as Executive Director with ₹2.76 crore annual remuneration. Remote e-voting opens January 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768302662002,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank Board Meet Set for Jan 17 to Review Q3 Results",
            "Summary": "RBL Bank has scheduled its Board of Directors meeting for January 17, 2026, to consider and approve Q3FY26 financial results. Trading window remains closed until January 19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768213012878,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank Block Trade Worth ₹15.66 Crores on NSE",
            "Summary": "RBL Bank witnessed a significant block trade on NSE involving 504,434 shares valued at ₹15.66 crores, executed at ₹310.45 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767942391895,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank Q3 Update | Advances rise 13%, deposits grow 12%",
            "Summary": "RBL Bank reports provisional Q3FY26 results with total deposits reaching ₹119,721 crores (12% YoY growth) and gross advances at ₹104,502 crores (13% YoY growth). Stock surged 5.50% on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1767369292584,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank's Foreign Shareholding Cap Request Rejected",
            "Summary": "RBL Bank's application to temporarily cap foreign shareholding at 24% was not approved by authorities, though the proposed Emirates NBD transaction remains unaffected with sufficient headroom available.",
            "Sentiment": "neutral",
            "PublishDate": 1767238997992,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank seeks foreign shareholding cap for Emirates NBD deal",
            "Summary": "RBL Bank applies to RBI and GoI for temporary 24% foreign shareholding cap amid Emirates NBD's proposed investment through preferential equity issue. Executive Director Rajeev Ahuja to retire in February 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767187790992,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank Awaits RBI, Govt Nod for Emirates NBD Deal",
            "Summary": "RBL Bank still awaits RBI and government approval for 24% foreign shareholding cap to facilitate Emirates NBD's $3 billion acquisition of 60% stake, with deal closure expected by April.",
            "Sentiment": "neutral",
            "PublishDate": 1767184009746,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBL Bank Confirms Emirates NBD 51% Stake Rules",
            "Summary": "RBL Bank confirms that Emirates NBD can maintain at least 51% stake under new shareholding regulations, providing clarity on ownership structure compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1767183387818,
            "Source": "stocks"
        },
        {
            "Title": "Jaideep Iyer to succeed Rajeev Ahuja as RBL ED",
            "Summary": "RBL Bank announces leadership transition with Jaideep Iyer set to replace retiring ED Rajeev Ahuja from February 21. Bank also appoints interim CFO and sees digital banking head resignation.",
            "Sentiment": "neutral",
            "PublishDate": 1767141998064,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank Executive Director Rajeev Ahuja to Retire",
            "Summary": "RBL Bank's Executive Director Rajeev Ahuja will retire on February 21, 2026, after completing his RBI-approved term. The board praised his pivotal role in the bank's transformation and growth.",
            "Sentiment": "neutral",
            "PublishDate": 1767089327940,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank ECL Impact Expected at 10-15% of Net Worth",
            "Summary": "RBL Bank management projects Expected Credit Loss (ECL) impact to range between 10-15% of current net worth, as disclosed during Citi conference discussions.",
            "Sentiment": "neutral",
            "PublishDate": 1765944161602,
            "Source": "stocks"
        },
        {
            "Title": "CITI Sets Buy Rating on RBL Bank with ₹390 Target",
            "Summary": "CITI Research has issued a Buy recommendation for RBL Bank with a price target of ₹390, indicating positive outlook on the private sector bank's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765943544697,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank CFO Buvanish Tharashankar Steps Down",
            "Summary": "RBL Bank announces the departure of Chief Financial Officer Buvanish Tharashankar from his position at the private sector bank.",
            "Sentiment": "neutral",
            "PublishDate": 1765806662806,
            "Source": "stocks"
        },
        {
            "Title": "RBL Bank Allots 2.05 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "RBL Bank allotted 2,05,948 equity shares of Rs. 10 face value each to eligible employees on December 8, 2025, following exercise of vested stock options under the bank's ESOP scheme. The allotment increased the bank's paid-up share capital from Rs. 616.77 crore to Rs. 616.98 crore, with total equity shares rising to 61,69,77,364.",
            "Sentiment": "positive",
            "PublishDate": 1765193819246,
            "Source": "corporate_action"
        },
        {
            "Title": "RBL Bank Board Approves Re-appointment of Chairman Chandan Sinha as Independent Director",
            "Summary": "RBL Bank's Board approved the re-appointment of Part-time Chairman Chandan Sinha as Non-Executive Independent Director for a second three-year term from May 21, 2026 to May 20, 2029, subject to shareholder approval. The decision ensures continuity in leadership as Sinha, a former RBI Executive Director with over 35 years of central banking experience, will complete eight continuous years on the Bank's Board.",
            "Sentiment": "positive",
            "PublishDate": 1765184111665,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBL Bank's Independent Director Dr. Somnath Ghosh Completes Term",
            "Summary": "Dr. Somnath Ghosh completed his term as Non-Executive Independent Director of RBL Bank on December 6, 2025, and ceased to be a director of the bank. The Board of Directors acknowledged his valuable contributions during his tenure with the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1765027582534,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBL Bank Allots 5.12 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "RBL Bank allotted 5,12,645 equity shares of Rs. 10 face value each to eligible employees following exercise of vested stock options under the bank's ESOP scheme. The allotment increased the bank's paid-up share capital from Rs. 616.26 crore to Rs. 616.77 crore, with total equity shares rising to 61,67,71,416.",
            "Sentiment": "neutral",
            "PublishDate": 1763976327537,
            "Source": "corporate_action"
        },
        {
            "Title": "RBL Bank Allots 28.7 Lakh Equity Shares Under ESOP Scheme",
            "Summary": "RBL Bank allotted 28,70,117 equity shares of Rs. 10 face value each to eligible employees following exercise of vested stock options under the bank's ESOP scheme. The share allotment increased the bank's paid-up share capital from Rs. 613.39 crore to Rs. 616.26 crore, expanding the total equity base to 61.63 crore shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763634217508,
            "Source": "corporate_action"
        },
        {
            "Title": "RBL Bank Grants 7.08 Lakh Stock Options to Employees Under ESOP 2018",
            "Summary": "RBL Bank's Nomination and Remuneration Committee approved the grant of 7,08,900 stock options to eligible employees at an exercise price of Rs. 318.65 per option on November 15, 2025. The options will vest over three years (30%, 30%, 40%) and are exercisable within five years from vesting date, providing employee incentives and potential equity dilution for existing shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1763207840137,
            "Source": "corporate_action"
        },
        {
            "Title": "RBL Bank Shareholders Approve Amalgamation with Emirates NBD India Branch and Capital Restructuring",
            "Summary": "RBL Bank held an Extraordinary General Meeting on November 12, 2025, where shareholders approved six key resolutions. The bank received approval for increasing authorized share capital, issuing equity shares through preferential allotment on private placement basis, and amendments to Articles of Association including special director nomination rights for identified shareholders. Shareholders also approved a 24% cap on aggregate foreign ownership and the scheme of amalgamation with Emirates NBD Bank India Branch as the transferor bank. All resolutions were passed with requisite majority through remote e-voting and physical voting. Members expressed appreciation for securing one of the largest foreign investments in the bank, which is expected to accelerate future growth and strengthen the balance sheet. The meeting was attended by 112 members in person and 2 through proxies, with key directors including Part-time Chairman Chandan Sinha and Managing Director CEO R. Subramaniakumar present.",
            "Sentiment": "positive",
            "PublishDate": 1762995987803,
            "Source": "corporate_action"
        },
        {
            "Title": "RBL Bank Appoints Suyog Karmarkar as Head of Strategic Initiatives and Transformation",
            "Summary": "RBL Bank Limited announced the appointment of Suyog Sanjay Karmarkar as Head-Strategic Initiatives and Transformation, effective November 6, 2025. Karmarkar will be classified as part of the bank's senior management. He brings over two decades of experience across strategy, M&A, and turnaround management with deep expertise in financial services, consulting, and cross-border operations. Previously, he worked with Prudential Financial (US) and was a Partner with EY's Strategy and Transactions practice, advising corporates, banks, and investors on turnaround and special situations. Karmarkar holds an MBA from Purdue University and a BE from Sardar Patel College of Engineering (Mumbai University).",
            "Sentiment": "positive",
            "PublishDate": 1762453517310,
            "Source": "corporate_governance"
        },
        {
            "Title": "Societe Generale Buys Rs 101 Crore Stake in RBL Bank as Mahindra & Mahindra Exits",
            "Summary": "Societe Generale purchased 31.61 lakh equity shares worth Rs 101 crore in RBL Bank at Rs 320.65 per share, representing a 1% discount to the previous closing price. This occurred alongside Mahindra & Mahindra's complete exit from RBL Bank, selling its 3.45% stake of 2.11 crore shares for Rs 678 crore at the same price, generating a 62.5% gain on investment. RBL Bank shares closed 0.5% higher at Rs 325.50 and hit a fresh 52-week high of Rs 332. The stock has rallied 90% over the past 12 months. RBL Bank reported a 20% decline in net profit to Rs 179 crore for the September quarter, with net interest margin improving marginally to 4.51%. Emirates NBD Bank has proposed an open offer to acquire 26% stake in RBL Bank at Rs 280 per share, with the offer period scheduled from December 12-26.",
            "Sentiment": "positive",
            "PublishDate": 1762442170103,
            "Source": "order&deals"
        },
        {
            "Title": "M&M to Sell Entire 3.45% RBL Bank Stake for ₹682 Crore via Block Deal",
            "Summary": "Mahindra & Mahindra is selling its complete 3.45% stake in RBL Bank for ₹682 crore through a block deal at a floor price of ₹317 per share. The transaction will generate a 64% return on M&M's ₹417 crore investment made in July 2023 when it acquired the stake at ₹197 per share. M&M's managing director Anish Shah had previously indicated no intention to invest further in RBL Bank beyond understanding the sector better. Separately, Emirates NBD Bank is investing ₹26,853 crore to acquire a 60% stake in RBL Bank through preferential equity issuance at ₹280 per share, with the board approving allotment of 96 crore new equity shares. RBL Bank shares closed at ₹322.3, gaining 16.9% in the past month, 63.5% in six months, and 104.3% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1762397346415,
            "Source": "order&deals"
        },
        {
            "Title": "Emirates NBD Launches ₹11,636 Crore Open Offer to Acquire 26% Stake in RBL Bank at ₹280 Per Share",
            "Summary": "Emirates NBD Bank PJSC has proposed an open offer to acquire 26% stake in RBL Bank at ₹280 per share, with shareholders able to tender shares from December 12-26 subject to SEBI approval. The total open offer size is ₹11,636 crore assuming full acceptance. The Dubai-based bank has agreed to invest $3 billion to acquire a majority stake in RBL Bank through this open offer followed by a preferential allotment that will bring Emirates NBD's total stake to 60%. This represents the largest acquisition of an Indian bank by a foreign financial institution and the biggest FDI in India's banking sector. Investors expect limited participation in the open offer as RBL Bank's current market price of ₹324 is significantly higher than the offer price. RBL Bank plans to approach the government to raise its FDI limit from 49% to 74% to facilitate the transaction. The partnership aims to provide RBL Bank with growth capital for expanding corporate lending and retail businesses, while strengthening its digital payments ecosystem and distribution network.",
            "Sentiment": "positive",
            "PublishDate": 1762393419395,
            "Source": "order&deals"
        },
        {
            "Title": "M&M Expected to Sell 3.45% RBL Bank Stake Worth Rs 682 Crore",
            "Summary": "Mahindra & Mahindra Ltd. is expected to sell a 3.45% stake in RBL Bank worth up to Rs 682 crore through a block deal. The transaction is set at a floor price of Rs 317 per share, representing a 2.1% discount to the last closing price. An undisclosed seller announced the block deal arrangement.",
            "Sentiment": "neutral",
            "PublishDate": 1762345300542,
            "Source": "order&deals"
        },
        {
            "Title": "Emirates NBD Bank Announces Open Offer for RBL Bank Shares at INR 280 Per Share",
            "Summary": "Emirates NBD Bank has announced an open offer to acquire up to 415,586,443 equity shares of RBL Bank Limited, representing 26% of the expanded voting share capital. The offer price is set at INR 280 per equity share with a face value of INR 10 each. The total consideration amounts to INR 116,364,204,040, assuming full acceptance, and will be paid in cash. The public announcement was made on October 18, 2025, with the detailed public statement issued on October 27, 2025. J.P. Morgan India Private Limited has issued a corrigendum dated November 4, 2025, regarding this open offer announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1762235996067,
            "Source": "order&deals"
        },
        {
            "Title": "RBL Bank Ratings Placed on Watch with Positive Implications Following Emirates NBD's $3 Billion Investment Proposal",
            "Summary": "CARE Ratings has placed RBL Bank's Tier II bonds rating of CARE AA- on Rating Watch with Positive Implications following Emirates NBD PJSC's proposal to invest $3 billion (₹26,853 crore) through a preferential issue to acquire a 60% controlling stake. The transaction includes a mandatory open offer for an additional 26% stake and amalgamation of Emirates NBD's Indian branches with RBL Bank, expected to bring total capital infusion of ₹29,253 crore. RBL Bank's net worth is expected to increase from ₹15,356 crore to over ₹44,000 crore upon completion. The bank reported advances of ₹1,00,529 crore and deposits of ₹1,16,667 crore as of September 30, 2025, with a capital adequacy ratio of 15.02%. The transaction is subject to regulatory and shareholder approvals. CARE also reaffirmed the Certificate of Deposit rating at CARE A1+.",
            "Sentiment": "positive",
            "PublishDate": 1761924671456,
            "Source": "corporate_action"
        },
        {
            "Title": "RBL Bank Shareholders Approve Remuneration for Managing Director and Executive Director via Postal Ballot",
            "Summary": "RBL Bank shareholders approved two ordinary resolutions through remote e-voting. The first resolution approved remuneration for Managing Director & CEO R. Subramaniakumar (DIN: 07825083), while the second approved remuneration for Executive Director Rajeev Ahuja (DIN: 00003545). The remote e-voting period ran from October 1, 2025 at 10:00 a.m. to October 30, 2025 at 5:00 p.m. Both resolutions were passed with requisite majority, with over 99% of votes cast in favor of each resolution. The bank had 354,820 total shareholders on the record date of September 26, 2025. The postal ballot notice was dispatched to 341,872 members who had registered their email addresses. S.N. Viswanathan served as the scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1761852811555,
            "Source": "corporate_governance"
        },
        {
            "Title": "Emirates NBD Bank Launches Open Offer to Acquire 26% Stake in RBL Bank at ₹280 Per Share",
            "Summary": "Emirates NBD Bank (P.J.S.C.) has announced an open offer to acquire up to 415,586,443 equity shares of RBL Bank Limited, representing 26% of the expanded voting share capital, at ₹280 per share. The total consideration amounts to ₹116,364 crores assuming full acceptance. The offer is part of a larger transaction where Emirates NBD will subscribe to up to 60% of RBL Bank's total paid-up share capital through a preferential issue of 959,045,636 equity shares at the same price of ₹280 per share, totaling ₹268,533 crores. The combined transaction will give Emirates NBD control of RBL Bank with shareholding between 51-74% of the total paid-up share capital. The offer price of ₹280 represents the highest negotiated price under the investment agreement and is above the 60-day volume weighted average market price of ₹270.97. The transaction is subject to various regulatory approvals including RBI, Competition Commission of India, and DPIIT approvals. Emirates NBD intends to operate in India through RBL Bank as a subsidiary and plans to amalgamate its existing India branch operations with RBL Bank. The open offer is mandatory under SEBI takeover regulations and is not conditional on minimum acceptance levels.",
            "Sentiment": "neutral",
            "PublishDate": 1761630709288,
            "Source": "order&deals"
        },
        {
            "Title": "RBL Bank to Seek Government Approval to Raise FDI Limit for Emirates NBD Deal",
            "Summary": "RBL Bank plans to approach the Department for Promotion of Industry and Internal Trade (DPIIT) to raise its foreign direct investment ceiling from 49% to 74%. This increase is required to facilitate Emirates NBD Bank's acquisition of a 60% stake in RBL Bank through a $3 billion investment, representing the largest acquisition of an Indian bank by a foreign financial institution. The application will be submitted after shareholder approval at an Extraordinary General Meeting scheduled for November 12. While Indian private sector banks can have up to 74% foreign ownership, investments above 49% require government approval beyond the automatic route. Emirates NBD will invest through a preferential allotment at ₹280 per share, followed by an open offer for an additional 26%. The transaction aims to provide RBL Bank with growth capital for expanding corporate lending and retail businesses, while strengthening its digital payments ecosystem and distribution network.",
            "Sentiment": "positive",
            "PublishDate": 1761610912852,
            "Source": "order&deals"
        },
        {
            "Title": "RBL Bank Denies Reports of Negotiations with Zerodha for Client Onboarding",
            "Summary": "RBL Bank has clarified that contents of a Financial Express article dated October 25, 2025, titled 'RBL in talks to onboard 160 million Zerodha clients' are incorrect. The bank stated that while it routinely explores business and partnership opportunities as part of its growth trajectory, the specific claims in the article are false. RBL Bank confirmed it is not aware of any undisclosed information that would explain recent trading movements and maintains compliance with disclosure requirements under SEBI Listing Regulations. The clarification was provided in response to BSE's inquiry about the news report.",
            "Sentiment": "neutral",
            "PublishDate": 1761562898457,
            "Source": "stock"
        },
        {
            "Title": "RBL Bank Shares Drop 3.3% After 12% Surge Following Emirates NBD Investment Deal",
            "Summary": "RBL Bank shares experienced profit booking, declining 3.3% to ₹313.9 after gaining nearly 12% following Emirates NBD's announcement to invest up to ₹26,853 crore for a 60% stake acquisition. The investment involves preferential equity issuance at ₹280 per share with 96 crore new equity shares approved by the board. RBL Bank reported quarterly results with net interest income meeting estimates and net interest margin expanding to 4.51%. Pre-provision operating profit grew due to reduced operating expenses, but higher provisions led to a 20% decline in profit after tax compared to the previous year. The stock has gained 4.5% over five trading sessions, 18.2% in the past month, 65.9% in six months, and 101.5% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1761202901125,
            "Source": "stock"
        },
        {
            "Title": "Fitch Ratings: RBL Bank Acquisition Will Not Impact Emirates NBD's Credit Rating",
            "Summary": "Fitch Ratings has stated that RBL Bank's acquisition will not affect the credit rating of Emirates NBD. The rating agency has assessed that the transaction will have no impact on Emirates NBD's current rating status.",
            "Sentiment": "neutral",
            "PublishDate": 1761129771697,
            "Source": "order&deals"
        },
        {
            "Title": "RBL Bank Shares in Focus After Q2 Results and Emirates NBD's $3 Billion Investment for 60% Stake",
            "Summary": "RBL Bank reported quarterly results with net interest income meeting expectations and net interest margin rising to 4.51% from 4.50%. However, profit after tax declined 20% year-on-year due to higher provisioning despite moderated operating expenses. In a separate major development, Emirates NBD will acquire a 60% stake in RBL Bank through a preferential equity issue worth Rs 26,853 crore at Rs 280 per share, involving 96 crore new shares. This transaction represents the largest foreign direct investment in India's financial services sector and the biggest equity fundraise by an Indian bank. Emirates NBD will also make a mandatory open offer for an additional 26% stake at the same price. The capital infusion is expected to triple RBL Bank's net worth from over Rs 15,000 crore to about Rs 42,000 crore. Both boards approved the amalgamation of Emirates NBD's India branches with RBL Bank, subject to RBI approval. RBL Bank shares closed at Rs 300, down 2.3%, but are up 90% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1760933861480,
            "Source": "stock"
        },
        {
            "Title": "RBL Bank Targets 4.75-4.80% NIM by March with Quarterly Improvements",
            "Summary": "RBL Bank expects its Net Interest Margin (NIM) to increase by 10-15 basis points each quarter, with a target of reaching 4.75-4.80% NIM by March. The bank anticipates that credit card slippages will remain elevated for 1-2 quarters before stabilizing.",
            "Sentiment": "positive",
            "PublishDate": 1760931750731,
            "Source": "stock"
        }
    ]
}