{
    "Symbol": "RBMINFRA",
    "ISIN": "INE0NA301016",
    "News": [
        {
            "Title": "6 Micro-Cap Stocks Win Orders Worth ₹220 Crores",
            "Summary": "Six micro-cap companies including RBM Infracon secured fresh orders totaling ₹220 crores across engineering, infrastructure, and industrial sectors, indicating strong business traction.",
            "Sentiment": "positive",
            "PublishDate": 1768840296962,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBM Infracon Expands into Aerospace Sector",
            "Summary": "RBM Infracon's board approves memorandum changes to include aircraft, drone, and aerospace engineering sectors, marking strategic business diversification.",
            "Sentiment": "positive",
            "PublishDate": 1766500618096,
            "Source": "stocks"
        },
        {
            "Title": "ED Conducts Search Operations at RDB Infra Leadership Residences and Office",
            "Summary": "The Enforcement Directorate conducted search and seizure operations at the residences of RDB Infra's Managing Director and CFO, along with the RDB Group's Gurugram office on November 20, 2025. The operations target key executives and corporate premises of the infrastructure company, indicating potential regulatory scrutiny of the firm's activities.",
            "Sentiment": "negative",
            "PublishDate": 1763802796931,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBM Infracon Secures 7.9 Crore Rupee Order",
            "Summary": "RBM Infracon, a company with a market capitalization of 285 crore rupees, has won a new order worth 7.9 crore rupees. The company operates in the SME (Small and Medium Enterprise) sector.",
            "Sentiment": "positive",
            "PublishDate": 1741686381000,
            "Source": "order&deals"
        },
        {
            "Title": "RBM Infracon Secures 21 Crore Rupee Order",
            "Summary": "RBM Infracon, a company with a market capitalization of 190 crore rupees, has won a new order worth 21 crore rupees. This development is significant for the small and medium enterprise (SME) sector.",
            "Sentiment": "positive",
            "PublishDate": 1740982903000,
            "Source": "order&deals"
        },
        {
            "Title": "RBM Infracon Takes Over ONGC Nandej Oil Field Project",
            "Summary": "RBM Infracon has announced that it is taking over the ONGC Nandej Oil Field Project. The total contract value for this project is reported to be 34.98 billion rupees. This represents a significant business development for RBM Infracon, potentially impacting its future operations and financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1737073161000,
            "Source": "order&deals"
        },
        {
            "Title": "RBM Infracon Secures ONGC Nandej Oil Field Project",
            "Summary": "RBM Infracon has announced that it is taking over the ONGC Nandej Oil Field Project. The total contract value for this project is reported to be 34.98 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1737040406000,
            "Source": "order&deals"
        },
        {
            "Title": "RBM Infracon Denies Acquisition Rumors",
            "Summary": "RBM Infracon has issued a statement refuting rumors about the company's alleged plans to acquire another company. The company has declared these rumors to be baseless, emphasizing that there is no truth to the speculation.",
            "Sentiment": "neutral",
            "PublishDate": 1732890418000,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBM Infracon Secures ₹22.77 Crore Order",
            "Summary": "RBM Infracon, an infrastructure company, has won a new order valued at ₹22.77 crore. This development was reported as an update for small and medium enterprises (SME).",
            "Sentiment": "positive",
            "PublishDate": 1729842929000,
            "Source": "corporate_action"
        },
        {
            "Title": "RBM Infracon Signs MoU for Green Hydrogen Project",
            "Summary": "<p><span class='positive'>RBM Infracon</span> has announced the signing of a <span class='neutral'>Memorandum of Understanding (MoU)</span> with <span class='positive'>Greenzo Energy India</span>. The agreement aims to <b>develop and implement green hydrogen generation facilities</b> with a total capacity of <span class='neutral'>15 MW</span>. The project involves a total <span class='positive'>investment</span> of <span class='neutral'>200 crore rupees</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728026886000,
            "Source": "corporate_action"
        }
    ]
}