{
    "Symbol": "RBZJEWEL",
    "ISIN": "INE0PEQ01016",
    "News": [
        {
            "Title": "RBZ Jewellers Gets BBB+ Stable Credit Rating from CARE",
            "Summary": "CARE Ratings assigned and reaffirmed BBB+ Stable rating for RBZ Jewellers' bank facilities worth ₹299.00 crore, with enhanced limits for long-term facilities.",
            "Sentiment": "positive",
            "PublishDate": 1770911628316,
            "Source": "stocks"
        },
        {
            "Title": "RBZ Jewellers Board Meet Set for Feb 13, 2026",
            "Summary": "RBZ Jewellers Limited has scheduled a board meeting on February 13, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769849652310,
            "Source": "co_actions_results"
        },
        {
            "Title": "RBZ Jewellers Receives Favorable Income Tax Appeal Order, Tax Demand Reduced by 99.78%",
            "Summary": "RBZ Jewellers received an order from the National Faceless Appeal Centre under Section 250 of the Income Tax Act for financial year 2022-23, with their appeal being partly allowed and majorly in the company's favor. The original tax addition of INR 2,617.26 lakh was substantially reduced by 99.78% to INR 5.65 lakh, with the company stating no expected impact on its financials or operations.",
            "Sentiment": "positive",
            "PublishDate": 1765025283372,
            "Source": "stock"
        },
        {
            "Title": "RBZ Jewellers Reports Strong Q2 FY26 Results with 24% Revenue Growth and 105% EBITDA Jump",
            "Summary": "RBZ Jewellers achieved revenue of INR 145 crores in Q2 FY26, marking 24% year-on-year growth, with EBITDA rising 105% to INR 28 crores and PAT growing 130% to INR 19 crores despite gold prices touching lifetime highs. The company plans retail expansion with new stores in Rajkot and Surat by Q4 FY26, targeting to become a major Gujarat retail player while maintaining strong performance across wholesale and job work segments.",
            "Sentiment": "positive",
            "PublishDate": 1763380976672,
            "Source": "earnings"
        },
        {
            "Title": "RBZ Jewellers Reports 15% Revenue Growth to ₹5,301Mn in H1FY26 with Retail Expansion Plans",
            "Summary": "RBZ Jewellers achieved revenue of ₹5,301 million in H1FY26, marking a 15% year-on-year increase, with an EBITDA margin of 18.6%. The company's retail division now accounts for approximately 60% of total sales with volumes exceeding 1,300 kg. RBZ has expanded its presence across 20 states and 72 cities, capturing a 1% share in the organized wholesale gold jewellery market. The company plans to expand its 'Harit Zaveri Jewellers' retail chain and aims to double production capacity to over 2 tons through automation and 3D printing technology to drive higher-margin growth.",
            "Sentiment": "positive",
            "PublishDate": 1762877469066,
            "Source": "stock"
        },
        {
            "Title": "RBZ Jewellers Reports Strong Quarterly Performance with Revenue of ₹14,508 Lakhs",
            "Summary": "RBZ Jewellers Limited announced its unaudited standalone financial results for the quarter ended September 30, 2025. The company reported revenue from operations of ₹14,508.35 lakhs compared to ₹7,558.29 lakhs in the previous quarter. Net profit for the quarter stood at ₹1,856.37 lakhs versus ₹712.28 lakhs in the prior quarter. For the half-year period, revenue reached ₹22,066.64 lakhs with net profit of ₹2,568.64 lakhs. The company's earnings per share for the quarter was ₹4.64 compared to ₹1.78 in the previous quarter. Total assets increased to ₹47,819.15 lakhs from ₹35,198.00 lakhs. The board meeting was held on November 11, 2025, where these results were approved along with other routine business matters.",
            "Sentiment": "positive",
            "PublishDate": 1762872665221,
            "Source": "earnings"
        },
        {
            "Title": "RBZ Jewellers Reports Strong Q2 Performance with Revenue Growth to 1.45B Rupees",
            "Summary": "RBZ Jewellers reported quarterly revenue of 1.45 billion rupees, up from 1.2 billion rupees in the same period last year. The company's EBITDA increased to 282 million rupees from 139 million rupees year-over-year. EBITDA margin improved significantly to 19.44% compared to 11.9% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762855454665,
            "Source": "earnings"
        },
        {
            "Title": "RBZ Jewellers Reports 130% Jump in Net Profit to 186 Million Rupees",
            "Summary": "RBZ Jewellers reported a net profit of 186 million rupees in its quarterly results, compared to 81 million rupees in the same period last year, representing a significant year-over-year increase of 105 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1762854916809,
            "Source": "earnings"
        },
        {
            "Title": "RBZ Jewellers Reports 8% Revenue Decline in Q1 FY26, Maintains Full-Year Guidance",
            "Summary": "RBZ Jewellers Limited reported an 8% year-on-year decline in revenue for Q1 FY26, primarily due to absence of major festivals and wedding-related demand during the quarter. The company attributed 45% of the quarterly decline to pre-ponement of demand in Q4 FY25 as Akshaya Tritiya fell in April. EBITDA for the quarter was INR 13 crores, down 8% year-on-year, while EBITDA margins improved marginally by 9 basis points to 17.2%. PAT stood at INR 7 crores with margins at 9.39%. In segmental performance, retail revenue was INR 45 crores (slightly higher than last year), wholesale revenue declined 20% to INR 29 crores, while job work revenue grew 8%. The company maintains its full-year guidance of INR 700 crores revenue and INR 45 crores PAT. RBZ participated in IIJS exhibition in Mumbai during July-August, receiving strong response in B2B segment with significant advance order bookings for the upcoming festival and wedding season. The company plans to open retail stores in Surat and Rajkot, with one expected in Q4 FY26 and another in Q1 FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1755518958838,
            "Source": "earnings"
        },
        {
            "Title": "RBZ Jewellers Publishes Q1 FY26 Financial Results in Newspapers",
            "Summary": "RBZ Jewellers Limited published its unaudited financial results for the quarter ended June 30, 2025 in newspapers. The results were published in Business Standard (English) and Jai Hind (Gujarati) newspapers and are available on the company's website at www.rbzjewellers.com. The company informed BSE and NSE about the newspaper publication through a regulatory filing dated August 14, 2025, signed by Company Secretary Heli Akash Garala.",
            "Sentiment": "neutral",
            "PublishDate": 1755169600743,
            "Source": "earnings"
        },
        {
            "Title": "RBZ Jewellers Reports 17% Drop in Quarterly Revenue, Appoints New Secretarial Auditors",
            "Summary": "RBZ Jewellers Ltd. reported revenue from operations of ₹7,558.29 lakhs for the quarter ended June 30, 2025, compared to ₹8,244.82 lakhs in the same period last year. Despite the revenue decline, profit for the period increased to ₹712.28 lakhs from ₹907.92 lakhs in the previous year quarter. The company's board approved the appointment of M/s. Vasant Patel & Associates as Secretarial Auditors for a five-year term from the 17th to 22nd Annual General Meeting, subject to shareholder approval. The company operates in a single business segment of jewellery products and maintains a paid-up equity share capital of ₹4,000 lakhs. Earnings per share stood at ₹1.78 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755000476230,
            "Source": "earnings"
        },
        {
            "Title": "RBZ Jewellers Reports Strong Q4 Financial Results",
            "Summary": "RBZ Jewellers has announced its Q4 financial results, showing significant year-over-year growth. The company's net profit increased to 86 million rupees, up from 27 million rupees in the same quarter last year. This also represents a quarter-over-quarter increase from 131 million rupees. Revenue for Q4 reached 1.4 billion rupees, compared to 862 million rupees in the previous year, indicating substantial growth in sales.",
            "Sentiment": "positive",
            "PublishDate": 1747095774000,
            "Source": "default"
        },
        {
            "Title": "RBZ Jewellers Reports Strong Q4 Financial Results",
            "Summary": "RBZ Jewellers has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 146 million rupees from 47 million rupees in the previous year, with the EBITDA margin rising to 10.63% from 5.47%. Net profit for Q4 grew to 86 million rupees, up from 27 million rupees year-over-year and 131 million rupees quarter-over-quarter. Revenue for the quarter reached 1.4 billion rupees, compared to 862 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747061228000,
            "Source": "result"
        },
        {
            "Title": "RBZ Jewellers Reports Employee Fraud Incident",
            "Summary": "RBZ Jewellers has disclosed an incident of fraud committed by an employee. The estimated financial impact of this fraudulent activity is reported to be 19.8 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1741091504000,
            "Source": "corporate_governance"
        },
        {
            "Title": "RBZ Jewellers Reports Strong Q3 EBITDA Growth",
            "Summary": "RBZ Jewellers has announced its Q3 financial results, showing significant improvement in EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA increased to 218 million rupees, up from 120 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 11.25% from 10.36% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739266425000,
            "Source": "earnings"
        },
        {
            "Title": "RBZ Jewellers Reports Strong Q3 Financial Results",
            "Summary": "RBZ Jewellers has announced its financial results for the third quarter. The company's net profit increased significantly to 131 million rupees, up from 68 million rupees in the same period last year. Revenue also saw substantial growth, reaching 1.94 billion rupees compared to 1.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739266361000,
            "Source": "earnings"
        },
        {
            "Title": "RBZ Jewellers Reports Significant Revenue Growth in Q2",
            "Summary": "RBZ Jewellers has announced its Q2 revenue, which stands at 1.2 billion rupees, compared to 740 million rupees in the same quarter last year. This represents a substantial year-over-year increase in the company's revenue.",
            "Sentiment": "positive",
            "PublishDate": 1731570221000,
            "Source": "result"
        },
        {
            "Title": "RBZ Jewellers Reports Q2 EBITDA and Margin Decline",
            "Summary": "RBZ Jewellers has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 140 million rupees, down from 143 million rupees in the same quarter last year. The EBITDA margin has also decreased to 11.96% from 19.34% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731570157000,
            "Source": "result"
        },
        {
            "Title": "RBZ Jewellers Reports Q2 Net Profit of 81M Rupees",
            "Summary": "RBZ Jewellers has announced its financial results for the second quarter. The company reported a net profit of 81 million rupees, compared to 85 million rupees in the same period last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731570091000,
            "Source": "result"
        }
    ]
}