{
    "Symbol": "RCF",
    "ISIN": "INE027A01015",
    "News": [
        {
            "Title": "RCF Board Meet on Feb 12 for Q3FY26 Results & Dividend",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited has scheduled its board meeting for February 12, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770221301512,
            "Source": "co_actions_results"
        },
        {
            "Title": "RCF Announces Senior Management Changes in Feb 2026",
            "Summary": "Rashtriya Chemicals & Fertilizers announces superannuation of two Executive Directors - Gopalan Seshadri and Vikram K Jawale - effective February 1, 2026, under SEBI regulation compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1769921007270,
            "Source": "stocks"
        },
        {
            "Title": "RCF announces senior management changes effective Jan 1",
            "Summary": "Rashtriya Chemicals & Fertilizers appoints two new General Managers while two senior executives retire through superannuation, marking significant leadership transitions across key departments.",
            "Sentiment": "neutral",
            "PublishDate": 1767266639546,
            "Source": "stocks"
        },
        {
            "Title": "RCF Appoints Ms. Nazhat J. Shaikh as New CMD",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited announces leadership transition with Ms. Nazhat J. Shaikh assuming charge as Chairman & Managing Director from January 1, 2026, following Shri S.C. Mudgerikar's superannuation.",
            "Sentiment": "neutral",
            "PublishDate": 1767248286964,
            "Source": "stocks"
        },
        {
            "Title": "RCF Fined Rs 10.85 Lakh by NSE and BSE for Regulatory Non-Compliance",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited received fines of Rs 5,42,800 each from NSE and BSE for non-compliance with Regulation 17(1) of SEBI LODR Regulations for the quarter ended September 30, 2025. The company is filing applications for waiver of the fines imposed by both stock exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1764334969539,
            "Source": "corporate_governance"
        },
        {
            "Title": "RCF Appoints Ms. Nazhat J. Shaikh as Additional CMD for Six Months",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited announced that Ms. Nazhat J. Shaikh, Director (Finance), has been entrusted with additional charge of Chairman and Managing Director for six months effective January 1, 2026. The appointment is subject to DoPT approval and will continue until a regular incumbent joins or further orders are issued, whichever is earliest.",
            "Sentiment": "neutral",
            "PublishDate": 1764067131510,
            "Source": "corporate_governance"
        },
        {
            "Title": "RCF Reports 33% Profit Growth in Q2 Despite Margin Compression",
            "Summary": "Rashtriya Chemicals and Fertilizers Ltd reported net profit of ₹105.4 crore, up 33.4% year-on-year, with revenue rising 23.4% to ₹5,292 crore driven by better realisations and demand. EBITDA margin declined to 4.1% from 4.7% due to higher input and production costs, while shares closed down 0.97% at ₹150.50.",
            "Sentiment": "positive",
            "PublishDate": 1763119950697,
            "Source": "earnings"
        },
        {
            "Title": "RCF Receives Approval to Transfer 7,104 sq.m. Land to MCGM for TDR Certificates",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited (RCF) received approval from the Department of Fertilizers to transfer 7,104 square meters of land located in Maravali Village, Chembur, Mumbai to the Municipal Corporation of Greater Mumbai (MCGM). The land transfer will be conducted in exchange for Transferable Development Right (TDR) Certificates, with the company also receiving approval for the sale and utilization of these TDR certificates. The approval was granted through a letter dated October 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761308746518,
            "Source": "stock"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Limited Announces Retirement of Two Senior Management Personnel",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited announced the retirement of two senior management personnel. Shri Rajiv Pande, Executive Director (HSE Corporate), and Shri Anil Usha Ramdas Deo, General Manager (Acids), have superannuated effective October 01, 2025. The company disclosed this change in senior management in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1759309280674,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Kochi Approves Resolution Plan for Fact-RCF Building Products Limited",
            "Summary": "NCLT Kochi has accepted the resolution plan for Fact-RCF Building Products Limited. RCF states that this development will have no significant effect on the company.",
            "Sentiment": "neutral",
            "PublishDate": 1759240051924,
            "Source": "stock"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Raises Rs 395 Crore Through Non-Convertible Debentures",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited's Debenture Allotment Committee approved and allotted 39,500 non-convertible debentures worth Rs 395 crore on private placement basis. The 7.60% listed, rated, unsecured, redeemable, non-cumulative, taxable bonds have a face value of Rs 1 lakh each and a tenure of 3 years and 10 months, maturing on July 25, 2029. Interest will be paid annually. The NCDs will be listed on the WDM segment of BSE and NSE. The funds will be used for augmentation of long-term working capital and capital expenditure including recoupment of already incurred capital expenditure. Key investors include The Jammu and Kashmir Bank Limited (10,000 NCDs), UCO Bank (7,500 NCDs), A.K. Capital Services Limited and Reliance General Insurance Company Limited (5,000 NCDs each).",
            "Sentiment": "positive",
            "PublishDate": 1758778903742,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Schedules Committee Meeting to Consider Rs 400 Crore Bond Issuance",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited has scheduled a Debenture Allotment Committee meeting on September 25, 2025, to consider issuing Unsecured, Redeemable, Non-Cumulative, Taxable, Non-Convertible Bonds through private placement. The total issue size is Rs 400 crore, comprising a base issue size of Rs 300 crore with an option to retain oversubscription of Rs 100 crore. The company has implemented a trading window closure for designated persons and their immediate relatives from September 18, 2025, to September 28, 2025, in accordance with its Insider Trading Code.",
            "Sentiment": "neutral",
            "PublishDate": 1758110221420,
            "Source": "corporate_action"
        },
        {
            "Title": "RCF Begins Commercial Operations of 100 MTPD Liquid Carbon Dioxide Plant at Trombay Unit",
            "Summary": "RCF has commenced commercial operations of its 100 metric tonnes per day liquid carbon dioxide plant at its Trombay unit. The plant is now operational and producing liquid carbon dioxide at the specified capacity.",
            "Sentiment": "positive",
            "PublishDate": 1757894998455,
            "Source": "stock"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Commences Commercial Operation of New CO2 Plant",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited has commenced commercial operation of a new Liquid Carbon Dioxide (CO2) Plant at its Trombay Unit on September 12, 2025. The plant has a production capacity of 100 MTPD (metric tons per day). The company announced this development through a regulatory communication to stock exchanges BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1757682225357,
            "Source": "stock"
        },
        {
            "Title": "RCF Appoints Ms. Sipra Bajpai as Independent Director for Three-Year Term",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited (RCF) appointed Ms. Sipra Bajpai as an Independent Director on its Board for a three-year period effective September 11, 2025, or until further orders, whichever is earlier. The appointment was approved through a Circular Resolution passed by the Board of Directors. Ms. Bajpai holds a Master's degree in Commerce and Bachelor's degree in Law from FM University, Balasore, Odisha. She has been serving as the State Secretary of the Bharatiya Janata Party (BJP) in Odisha since 2019, where she has contributed to strengthening the party's organizational structure and coordinating grassroots campaigns. The company disclosed that there are no relationships between directors and confirmed she is not debarred from holding the office of Director.",
            "Sentiment": "neutral",
            "PublishDate": 1757590947265,
            "Source": "corporate_governance"
        },
        {
            "Title": "Proposal Suggests Reducing GST on Fertilizers from 18% to 5%",
            "Summary": "A proposal has been made to lower the Goods and Services Tax (GST) rate on fertilizers from the current 18% to 5%. This development relates to RCF and could impact the fertilizer industry's tax structure.",
            "Sentiment": "positive",
            "PublishDate": 1755854269312,
            "Source": "sectoral"
        },
        {
            "Title": "Rashtriya Chemicals & Fertilizers Reports 405% Jump in Q1 Net Profit Despite Revenue Decline",
            "Summary": "Rashtriya Chemicals & Fertilizers reported Q1 net profit of 541 million rupees, marking a significant increase from 107 million rupees in the same period last year. However, the company's revenue declined to 33.7 billion rupees from 43.96 billion rupees year-over-year. EBITDA improved to 1.6 billion rupees compared to 1.16 billion rupees previously, while EBITDA margin expanded to 4.69% from 2.64% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1754998979098,
            "Source": "earnings"
        },
        {
            "Title": "China Eases Urea Export Restrictions to India Amid Improving Relations",
            "Summary": "China has relaxed its urea export policies to India as diplomatic tensions between the two countries show signs of improvement. This development affects RCF and could impact India's fertilizer supply chain and agricultural sector.",
            "Sentiment": "positive",
            "PublishDate": 1754990140758,
            "Source": "stock"
        },
        {
            "Title": "RCF Under CCI Investigation, Evaluating Legal Options",
            "Summary": "RCF is facing an investigation by the Competition Commission of India (CCI). The company is currently reviewing the CCI's order and considering its legal response options.",
            "Sentiment": "negative",
            "PublishDate": 1754916061277,
            "Source": "stock"
        },
        {
            "Title": "GST Council May Consider 12% Uniform Tax Rate on Fertilizers and Inputs",
            "Summary": "The GST Council could potentially consider implementing a uniform 12% tax rate on fertilizers and inputs by September. This development relates to RCF and could impact the taxation structure for fertilizer products and related inputs.",
            "Sentiment": "neutral",
            "PublishDate": 1754468906303,
            "Source": "sectoral"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Schedules Board Meeting for Q1 Results and Debenture Issuance",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited has scheduled a Board of Directors meeting for August 12, 2025 to consider and approve unaudited financial results for the first quarter ended June 30, 2025, and the issuance of secured/unsecured non-convertible debentures on private placement basis. The company has notified that the trading window for designated persons and their immediate relatives will remain closed until August 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754310494990,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Announces Senior Management Changes with Multiple Promotions and Retirements",
            "Summary": "Rashtriya Chemicals and Fertilizers Ltd announced multiple changes in senior management effective August 1, 2025. The company promoted Shri Nitin Hirde to Executive Director (Thai), who has 35 years of experience and joined RCF as Management Trainee in 1990. Mrs Mrudula Godbole was promoted to General Manager (Finance), bringing over 25 years of fertilizer industry experience since joining RCF in 1996. Shri Girish Temgire was promoted to General Manager (Corp. Cord & Tr. Projects), while Shri Anil R. Deo was promoted to General Manager (SAP, CAN/PAP). The changes also include three superannuations: Shri Anil R. Deo from Executive Director (IPD/Commercial), Shri Atul B. Patil, and Sanjeev S. Doshi from Chief General Manager positions in HR and Marketing respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1754042732765,
            "Source": "corporate_governance"
        },
        {
            "Title": "DIPAM Seeks New Bids for RCF Offer For Sale",
            "Summary": "The Department of Investment and Public Asset Management (DIPAM) has requested new bids for an Offer For Sale (OFS) of Rashtriya Chemicals and Fertilizers Limited (RCF). This indicates a potential disinvestment process for the company, though specific details about the size or timing of the offer are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751610870000,
            "Source": "default"
        },
        {
            "Title": "Rashtriya Chemicals And Fertilizers Allocates NCDs Worth 3 Billion Rupees",
            "Summary": "Rashtriya Chemicals And Fertilizers has allocated 30,000 Non-Convertible Debentures (NCDs) with a total value of 3 billion rupees. No additional details about the terms, purpose, or timing of this allocation were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751262408000,
            "Source": "default"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Ltd: Government Rejects Gas Cost Request, Causing ₹204 Crore Hit",
            "Summary": "Rashtriya Chemicals and Fertilizers Ltd (RCF) faces a ₹204.14 crore financial setback as the Department of Fertilizers denies recognition of EPMC/Spot gas costs for Trombay urea production in FY 2021-22 and 2022-23. RCF plans to make another representation against this decision. Q4 net profit declined 23.8% YoY to ₹73 crore, with revenue down 4% to ₹3,729.7 crore.",
            "Sentiment": "negative",
            "PublishDate": 1750858330000,
            "Source": "normal_news"
        },
        {
            "Title": "RCF Reports ₹204 Crore Loss Due to Gas Cost Recognition Denial",
            "Summary": "Rashtriya Chemicals and Fertilizers (RCF) has reported a loss of ₹204 crore after the Department of Fertilizers (DOF) denied recognition of gas costs for urea production. The company has requested a review of this decision, citing a breach of the gas pooling principle. RCF argues that this denial goes against established practices and principles in the fertilizer industry.",
            "Sentiment": "negative",
            "PublishDate": 1750854662000,
            "Source": "default"
        },
        {
            "Title": "Rashtra Chemicals and Fertilizers to Review Bond Issuance Proposal",
            "Summary": "Rashtra Chemicals and Fertilizers is planning to review a proposal for issuing bonds worth 3 billion rupees. The company aims to complete this review by June 30.",
            "Sentiment": "neutral",
            "PublishDate": 1750770221000,
            "Source": "default"
        },
        {
            "Title": "Rashtriya Chemicals & Fertilizers Q4 Results and Dividend Announcement",
            "Summary": "Rashtriya Chemicals & Fertilizers reported its Q4 financial results. The company's revenue decreased to 37.3 billion rupees from 38.8 billion rupees year-over-year. EBITDA declined to 1.78 billion rupees from 1.95 billion rupees, with the EBITDA margin dropping to 4.79% from 5.04%. Net profit fell to 726.5 million rupees from 976.5 million rupees year-over-year, but increased from 796.5 million rupees quarter-on-quarter. The company also declared a final dividend of 1.32 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748346082000,
            "Source": "result"
        },
        {
            "Title": "Government Directs RCF to Increase Fertilizer Production",
            "Summary": "The government has instructed Rashtriya Chemicals and Fertilizers (RCF) to boost its fertilizer production. No specific details about the production increase or timeline were provided in the brief news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748335974000,
            "Source": "default"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers to Acquire Shares in TFL Rights Issue",
            "Summary": "Rashtriya Chemicals and Fertilizers (RCF) has agreed to acquire 19,99,99,630 equity shares with a face value of Rs.10 per share, totaling Rs.199,99,96,300, by subscribing to the rights issue of TFL.",
            "Sentiment": "neutral",
            "PublishDate": 1745599244000,
            "Source": "default"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Approves New Unit Formation and Loan to Joint Venture",
            "Summary": "The board of Rashtriya Chemicals and Fertilizers has approved the formation of a new unit in India. Additionally, the company has received initial board approval for a 2 billion rupee loan to a joint venture.",
            "Sentiment": "positive",
            "PublishDate": 1743685451000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashtriya Chemicals & Fertilizers Reports Significant Profit Increase in Q3",
            "Summary": "Rashtriya Chemicals & Fertilizers has reported a substantial increase in net profit for the third quarter, rising to 797 million rupees from 105 million rupees in the same period last year. However, the company's revenue decreased to 45.2 billion rupees from 49 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739405879000,
            "Source": "earnings"
        },
        {
            "Title": "Rashtriya Chemicals & Fertilizers Reports Significant Q3 EBITDA Growth",
            "Summary": "Rashtriya Chemicals & Fertilizers has reported a substantial increase in its Q3 EBITDA, which rose to 1.79 billion rupees from 835 million rupees in the same period last year. The company's EBITDA margin also improved, reaching 3.96% compared to 1.70% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739360109000,
            "Source": "earnings"
        },
        {
            "Title": "Rashtriya Chemicals & Fertilizers Reports Significant Profit Increase in Q3",
            "Summary": "Rashtriya Chemicals & Fertilizers has reported a substantial increase in net profit for the third quarter, rising to 797 million rupees from 105 million rupees in the same period last year. However, the company's revenue decreased to 45.2 billion rupees from 49 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739360104000,
            "Source": "earnings"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Ltd: Q3 Results Announcement Scheduled for February 12",
            "Summary": "RCF to release Q3 and nine-month financial results on February 12, 2025. Trading window for designated persons suspended until February 14. Company's market cap exceeds Rs 8,000 crore. Recent stock performance shows decline across various time frames.",
            "Sentiment": "neutral",
            "PublishDate": 1739257549000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashtriya Chemicals Commences Commercial Production of Nano Urea at Trombay Unit",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited has announced the start of commercial production of nano urea at its Trombay unit. Nano urea is an innovative fertilizer product that can potentially improve nutrient use efficiency and reduce environmental impact compared to conventional urea.",
            "Sentiment": "positive",
            "PublishDate": 1738714670000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashtriya Chemicals Begins Commercial Production of Nano Urea at Trombay Unit",
            "Summary": "Rashtriya Chemicals and Fertilizers Limited has announced the commencement of commercial production of nano urea at its Trombay unit. This development marks a significant step in the company's production capabilities and potentially its market offerings in the fertilizer sector.",
            "Sentiment": "positive",
            "PublishDate": 1738669027000,
            "Source": "corporate_action"
        },
        {
            "Title": "Cabinet May Approve DAP Subsidy Increase for RCF",
            "Summary": "According to ET Now Swadesh, the Cabinet is considering approving a Diammonium Phosphate (DAP) subsidy increase of 150-200 rupees per bag for Rashtriya Chemicals and Fertilizers Limited (RCF).",
            "Sentiment": "positive",
            "PublishDate": 1735709649000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashtriya Chemicals and Fertilizers Ltd: Sells 13,286 Tonnes of Sulphur-Coated Urea in 2023",
            "Summary": "RCF has sold 13,286 tonnes of 'urea gold' (sulphur-coated urea) in seven states since starting commercial production in 2023. The product contains 17% sulphur and 37% nitrogen. RCF-Trombay plant has dispatched 13,844 tonnes so far. The company is promoting the product through farmer meetings and training programs.",
            "Sentiment": "positive",
            "PublishDate": 1734086254000,
            "Source": "normal_news"
        },
        {
            "Title": "Indian Government Seeks Approval for Additional Fertilizer Subsidy Funding",
            "Summary": "The Indian government is seeking approval for additional spending of 65.9 billion rupees to support fertilizer subsidies. This request is specifically related to Rashtriya Chemicals & Fertilizers, a state-owned company in the fertilizer sector. The move suggests an increased focus on supporting agricultural inputs and potentially addressing rising costs or demand in the fertilizer market.",
            "Sentiment": "neutral",
            "PublishDate": 1733987959000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashtriya Chemicals & Fertilizers Reports Improved Q2 Financial Performance",
            "Summary": "Rashtriya Chemicals & Fertilizers has announced its Q2 financial results, showing significant improvement in EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased to 2 billion rupees from 1.06 billion rupees year-over-year, while the EBITDA margin rose to 4.70% from 2.55%.",
            "Sentiment": "positive",
            "PublishDate": 1731503452000,
            "Source": "result"
        },
        {
            "Title": "Rashtriya Chemicals & Fertilizers Reports Q2 Revenue Increase",
            "Summary": "Rashtriya Chemicals & Fertilizers has reported a revenue of 42.9 billion rupees for the second quarter, compared to 41.5 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731503344000,
            "Source": "result"
        },
        {
            "Title": "Rashtriya Chemicals & Fertilizers Reports Q2 Net Profit Increase",
            "Summary": "Rashtriya Chemicals & Fertilizers has reported a net profit of 786 million rupees for the second quarter, showing a year-over-year increase from 516 million rupees and a quarter-over-quarter increase from 107 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731503301000,
            "Source": "result"
        },
        {
            "Title": "RCF: Rs 1,000 Crore Order to L&T Boosts Share Price",
            "Summary": "<p><span class=\"positive\">Rashtriya Chemicals & Fertilizer Ltd (RCF)</span> awarded a <span class=\"positive\">Rs 1,000+ crore order</span> to <b>L&T Energy Hydrocarbon</b> for setting up a <span class=\"neutral\">1,200 MTPD complex fertiliser plant</span> at RCF, ThaI. The project has a <span class=\"neutral\">27-month execution timeline</span>. RCF's share price <span class=\"positive\">surged 8%</span> to Rs 184.90 following the announcement.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728534705000,
            "Source": "normal_news"
        },
        {
            "Title": "RCF Approves 10 Billion Rupee Contract with L&T for New Fertilizer Plant",
            "Summary": "<p><span class='neutral'>Rashtriya Chemicals and Fertilizers (RCF)</span> has <span class='positive'>approved</span> a purchase order with <span class='neutral'>Larsen & Toubro (L&T)</span> to <span class='positive'>set up</span> a <b>new complex fertilizer plant</b>. The plant will have a <span class='positive'>capacity</span> of <b>1200 MTPD</b> (Metric Tonnes Per Day) on a <span class='neutral'>DAP</span> (Diammonium Phosphate) basis. The project will be <span class='neutral'>executed</span> on an <span class='neutral'>LSTK</span> (Lump Sum Turnkey) basis at RCF's Thai facility. The deal is <span class='positive'>valued</span> at <b>10 billion rupees</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728472345000,
            "Source": "corporate_action"
        }
    ]
}