{
    "Symbol": "RCOM",
    "ISIN": "INE330H01018",
    "News": [
        {
            "Title": "Reliance Communications Debt Hits ₹404.10 Billion",
            "Summary": "Reliance Communications reports total debt of ₹404.10 billion as of December 31, highlighting the telecom company's significant financial obligations in the competitive telecommunications sector.",
            "Sentiment": "negative",
            "PublishDate": 1767789830843,
            "Source": "stocks"
        },
        {
            "Title": "Central Bank declares RTL loan accounts as fraud",
            "Summary": "Central Bank of India declares Reliance Telecom Limited loan accounts worth ₹18.40 crores as fraud, citing fund diversion and non-compliance with sanction terms.",
            "Sentiment": "negative",
            "PublishDate": 1766484832346,
            "Source": "stocks"
        },
        {
            "Title": "Union Bank Classifies Reliance Communications and Subsidiary RTL Loan Accounts as Fraud",
            "Summary": "Union Bank of India has classified loan accounts of Reliance Communications Limited (Rs. 1,324.86 crores outstanding) and its subsidiary Reliance Telecom Limited (Rs. 35.76 crores outstanding) as fraud based on forensic audit findings. Both companies are currently under corporate insolvency resolution process, with resolution plans approved by creditor committees and awaiting NCLT approval, while the bank has reported the matter to RBI and law enforcement agencies.",
            "Sentiment": "negative",
            "PublishDate": 1765281169280,
            "Source": "stock"
        },
        {
            "Title": "Reliance Communications Independent Director Priyanka Agarwal Resigns",
            "Summary": "Ms. Priyanka Agarwal resigned from her position as Independent Director of Reliance Communications Limited effective December 01, 2025, citing personal and unavoidable circumstances. The resignation affects the board composition of the telecom company, which has been under corporate insolvency resolution process since June 2019 with its affairs managed by Resolution Professional Mr. Anish Niranjan Nanavaty.",
            "Sentiment": "neutral",
            "PublishDate": 1764758277472,
            "Source": "corporate_governance"
        },
        {
            "Title": "ED Freezes Assets of Reliance Communications and Reliance Realty Under Money Laundering Act",
            "Summary": "The Enforcement Directorate has temporarily frozen several assets belonging to Reliance Communications and Reliance Realty under the Prevention of Money Laundering Act. The companies expect this action to have a negative impact on their operations.",
            "Sentiment": "negative",
            "PublishDate": 1763692295256,
            "Source": "stock"
        },
        {
            "Title": "Reliance Communications and Subsidiary Face SFIO Investigation for FY2008-24 Period",
            "Summary": "The Serious Fraud Investigation Office has ordered an investigation into Reliance Communications Limited and its subsidiary Reliance Communication Infrastructure Limited covering financial years 2008-09 to 2023-24, with extensive documentation required by November 28, 2025. The companies have committed to full cooperation with authorities, with management stating no expected impact on business operations as only information and details are being sought.",
            "Sentiment": "negative",
            "PublishDate": 1763646491625,
            "Source": "corporate_governance"
        },
        {
            "Title": "IDBI Bank Labels Reliance Communications Loan Account as Fraud During Insolvency Process",
            "Summary": "IDBI Bank has classified Reliance Communications Limited's loan account as fraudulent. The company is undergoing a corporate insolvency resolution process. Legal steps have been reported to the RBI and law enforcement agencies regarding this matter.",
            "Sentiment": "negative",
            "PublishDate": 1762244420403,
            "Source": "corporate_governance"
        },
        {
            "Title": "ED Attaches Rs 4,462 Crore Land in RCom Bank Fraud Investigation",
            "Summary": "The Enforcement Directorate attached 132 acres of land at Dhirubhai Ambani Knowledge City in Navi Mumbai valued at Rs 4,462.81 crore in the Reliance Communications bank loan fraud case. This follows earlier asset attachments worth Rs 3,000 crore linked to the Anil Ambani group, bringing total seizures to over Rs 7,545 crore. The investigation stems from a CBI FIR naming Anil Ambani, RCom, and others for fraud, conspiracy, and corruption related to loans exceeding Rs 40,000 crore taken from Indian and foreign banks between 2010 and 2012. Five loan accounts have been declared fraudulent by lending banks. ED findings reveal Rs 13,600 crore was diverted through loan evergreening, Rs 12,600 crore was transferred to related companies, and over Rs 1,800 crore was moved through fixed deposits and mutual funds before reinvestment in group companies. The investigation also uncovered misuse of bill discounting schemes and international fund transfers.",
            "Sentiment": "negative",
            "PublishDate": 1762182657605,
            "Source": "stock"
        },
        {
            "Title": "Bank of Maharashtra Classifies Reliance Communications Account as Fraud",
            "Summary": "Bank of Maharashtra has classified Reliance Communications Limited's loan account as fraud, citing misappropriation of funds and criminal breach of trust. The bank identified that Letter of Credit discounting was used for round tripping of loans to related parties and for repayment of outstanding LCs, constituting potential evergreening and diversion of funds. The classification was based on forensic audit findings showing circular routing of funds between RCOM and its subsidiary RITL worth Rs 2,779.38 crores. The bank has reported the matter to the Reserve Bank of India and will file police/CBI complaints as per RBI directions. RCOM is currently under corporate insolvency resolution process since June 2019, with a resolution plan approved by creditors awaiting tribunal approval. The company states it will have protection under the Insolvency and Bankruptcy Code against liabilities for offences committed prior to the insolvency process once the resolution plan is approved.",
            "Sentiment": "negative",
            "PublishDate": 1761397187689,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay High Court Dismisses Anil Ambani's Challenge to SBI's Fraud Classification of RCom Loan",
            "Summary": "The Bombay High Court dismissed Anil Ambani's petition challenging State Bank of India's decision to classify Reliance Communications Ltd.'s loan account as fraudulent. SBI's order designated RCom's account as fraudulent and directed that Ambani be reported to the Reserve Bank of India under fraud risk management guidelines. Ambani argued he was denied a personal hearing and key documents, claiming the classification violated principles of natural justice and had drastic civil consequences. The division bench found the petition lacked merit. SBI and RBI opposed the plea, stating repeated notices were served on Ambani without satisfactory explanation. Ambani may now approach the Supreme Court. In contrast, Canara Bank previously withdrew its similar fraud classification order after Ambani filed a petition.",
            "Sentiment": "negative",
            "PublishDate": 1759507684539,
            "Source": "stock"
        },
        {
            "Title": "Reliance Communications Appoints Independent Director and Secretarial Auditors",
            "Summary": "Reliance Communications Limited shareholders approved the appointment of Smt. Priyanka Agarwal as an Independent Director for a 5-year term effective December 09, 2024, at the 21st Annual General Meeting held on September 30, 2025. Agarwal, aged 39 years, is a Fellow Member of ICSI and Registered Valuer with 15 years of experience in Corporate Laws, FEMA, and Corporate Restructuring. The shareholders also approved the appointment of M/s. Ashita Kaul & Associates as Secretarial Auditors for a 5-year term from FY 2025-26 to 2029-30. The firm is led by Ms. Ashita Kaul, who has over 22 years of experience in secretarial audit and corporate advisory services. The company remains under corporate insolvency resolution process with its affairs managed by Resolution Professional Mr. Anish Niranjan Nanavaty since June 28, 2019.",
            "Sentiment": "neutral",
            "PublishDate": 1759241290648,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Communications Schedules 65th Committee of Creditors Meeting",
            "Summary": "Reliance Communications Limited has scheduled its 65th Committee of Creditors (CoC) meeting for September 18, 2025, as part of its ongoing corporate insolvency resolution process. The company has been under corporate insolvency resolution process under the Insolvency and Bankruptcy Code, 2016, with its affairs managed by Resolution Professional Mr. Anish Niranjan Nanavaty since June 28, 2019, following an order from the National Company Law Tribunal, Mumbai Bench.",
            "Sentiment": "neutral",
            "PublishDate": 1758091198618,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Communications Receives Show Cause Notice from Central Bank of India Over Fraud Classification",
            "Summary": "Reliance Communications disclosed that it received a show cause notice from Central Bank of India. The bank is proposing to classify the company's account as fraud based on findings from a forensic audit report.",
            "Sentiment": "negative",
            "PublishDate": 1757524677294,
            "Source": "stock"
        },
        {
            "Title": "ED Files Money Laundering Charges Against Anil Ambani in Reliance Com Case",
            "Summary": "The Enforcement Directorate has filed money laundering charges against Anil Ambani in connection with Reliance Communications.",
            "Sentiment": "negative",
            "PublishDate": 1757488442987,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bank Of Baroda Declares RCom And Anil Ambani Loan Accounts As 'Fraud'",
            "Summary": "Bank of Baroda has declared loan accounts of Reliance Communications Ltd. and Anil Ambani as 'fraud'. RCom stated the loans relate to the period before its corporate insolvency resolution process and must be resolved as part of a resolution plan or liquidation under the Insolvency and Bankruptcy Code. A resolution plan has been approved by the committee of creditors and awaits National Company Law Tribunal approval. The company is under resolution professional control and Ambani is no longer a director. RCom is seeking legal advice regarding Bank of Baroda's action. Ambani is under Enforcement Directorate investigation for alleged loan fraud involving his group entities, estimated at Rs 17,000 crore. The ED has sought details from 12-13 banks regarding loans to Reliance Housing Finance, Reliance Communications, and Reliance Commercial Finance.",
            "Sentiment": "negative",
            "PublishDate": 1757009798259,
            "Source": "stock"
        },
        {
            "Title": "Reliance Communications Receives Share Reclassification Request from Reliance Capital",
            "Summary": "Reliance Communications has received a request from Reliance Capital Limited to reclassify promoter shares to the 'Public' category. This reclassification would change the shareholding structure by moving shares from the promoter category to public shareholding.",
            "Sentiment": "neutral",
            "PublishDate": 1757000798223,
            "Source": "corporate_action"
        },
        {
            "Title": "Bank of India Declares RCom and Anil Ambani Loan Accounts Fraudulent Over ₹725 Crore",
            "Summary": "Bank of India has declared loan accounts of Reliance Communications (RCom), its Reliance Telecom subsidiary, Anil Ambani and some directors as fraudulent, involving outstanding loans of ₹725 crore. The bank alleges that RCom invested the sanctioned funds in mutual funds and fixed deposits instead of using the money to purchase spectrum as intended. The loans were provided in 2015 and 2016 for ongoing capex, operational expenditure and repayment of existing liabilities. A forensic audit by BDO India found suspected fraudulent activities, with the accounts turning non-performing on June 30, 2017. State Bank of India had previously declared RCom's account fraudulent. Anil Ambani's spokesperson denied all allegations and stated the bank did not follow principles of natural justice, claiming he was deprived of a personal hearing. The CBI recently searched premises linked to the Anil Dhirubhai Ambani Group in connection with an alleged bank loan fraud case.",
            "Sentiment": "negative",
            "PublishDate": 1756080406138,
            "Source": "stock"
        },
        {
            "Title": "CBI Files Case Against Reliance Communications and Anil Ambani in Rs 2,000 Crore Bank Fraud",
            "Summary": "The CBI has filed a case against Reliance Communications (RCOM) and conducted searches at premises linked to the company and its Promoter Director Anil Ambani. The case relates to an alleged bank fraud that caused losses exceeding Rs 2,000 crore to the State Bank of India. The entities were classified as fraud on June 13 under RBI's Master Directions on Fraud Risk Management. The bank reported the fraud classification to RBI on June 24, 2025, and initiated the process of lodging a complaint with CBI.",
            "Sentiment": "negative",
            "PublishDate": 1755931626670,
            "Source": "stock"
        },
        {
            "Title": "Reliance Communications Reports Rs 2,217 Crore Loss in Q1 FY26 Amid Ongoing Insolvency Process",
            "Summary": "Reliance Communications Limited reported a total comprehensive loss of Rs 2,217 crore for the quarter ended June 30, 2025, compared to Rs 1,919 crore loss in the same period last year. Revenue from operations declined to Rs 61 crore from Rs 75 crore year-on-year. The company continues under corporate insolvency resolution process with Mr. Anish Niranjan Nanavaty as Resolution Professional. The company did not provide interest on borrowings of Rs 1,164 crore and foreign exchange variations of Rs 57 crore for the quarter. Assets held for sale including wireless spectrum, towers, and optical fiber continue to be classified at March 2018 values. The company faces ongoing legal proceedings regarding telecom license renewals and AGR dues, with various matters pending before Supreme Court, NCLT, and TDSAT. Auditors have drawn multiple qualifications regarding going concern assumptions, asset valuations, and compliance with accounting standards.",
            "Sentiment": "negative",
            "PublishDate": 1755078541925,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Communications Schedules 62nd Committee of Creditors Meeting",
            "Summary": "Reliance Communications Limited has scheduled its 62nd Committee of Creditors (CoC) meeting for August 8, 2025. The company remains under corporate insolvency resolution process under the Insolvency and Bankruptcy Code, 2016, with its affairs managed by Resolution Professional Mr. Anish Niranjan Nanavaty since June 28, 2019, following an order from the National Company Law Tribunal, Mumbai Bench.",
            "Sentiment": "neutral",
            "PublishDate": 1754550294210,
            "Source": "corporate_action"
        },
        {
            "Title": "Enforcement Directorate Conducts Search Operation at Reliance Communications Office",
            "Summary": "Enforcement Directorate officials conducted a search, seizure and freezing operation at Reliance Communications Limited's office in Navi Mumbai on July 24, 2025, under Section 17(1) of the Prevention of Money Laundering Act, 2002. The operation resulted in the seizure of two laptops and email dumps of the CFO and Company Secretary. Reliance Communications stated that the company continues to operate in normal course of business and that the action will not affect its financials and operations. The company is undergoing corporate insolvency resolution process under the Insolvency and Bankruptcy Code, 2016, with its affairs being managed by Resolution Professional Mr. Anish Niranjan Nanavaty since June 28, 2019.",
            "Sentiment": "negative",
            "PublishDate": 1753495233299,
            "Source": "stock"
        },
        {
            "Title": "SBI Reclassifies Reliance Communications and Anil Ambani as 'Fraud', Files CBI Complaint",
            "Summary": "State Bank of India has classified Reliance Communications and promoter director Anil D. Ambani as 'fraud' on June 13, following RBI's Master Directions on Fraud Risk Management. The bank reported this classification to RBI on June 24 and is lodging a complaint with CBI. SBI's credit exposure in RCom includes Rs 2,227.64 crore in fund-based principal outstanding amount plus accrued interest from August 26, 2016, and Rs 786.52 crore in non-fund-based bank guarantee. This marks the second fraud classification - the bank had previously classified the account as fraud in November 2020 but reversed it in September 2023 following a Supreme Court judgment requiring borrowers be given representation opportunity. RCom is currently undergoing Corporate Insolvency Resolution Process with NCLT approval pending for a resolution plan filed in March 2020. SBI has also initiated Personal Insolvency Resolution Process against Anil Ambani.",
            "Sentiment": "negative",
            "PublishDate": 1753146798010,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Communications Ltd: NCLT to Decide on ₹550 Crore Refund Plea Against Ericsson in June",
            "Summary": "The National Company Law Tribunal (NCLT) will decide in June on Reliance Communications Ltd's plea seeking a ₹550 crore refund from Ericsson. RCom argues the payment made in 2019 was preferential treatment to an operational creditor. Ericsson's counsel called the plea 'frivolous'. The hearing is scheduled for June 11 and 12.",
            "Sentiment": "neutral",
            "PublishDate": 1746088606000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Communications: Court to Hear Petition for Ericsson Payment Refund",
            "Summary": "NCLT Mumbai bench to hear RCom's resolution professional's petition seeking refund of ₹550 crore paid to Ericsson in 2019. The RP argues the payment was preferential treatment to an operational creditor. Ericsson opposes the refund, citing a Supreme Court order.",
            "Sentiment": "neutral",
            "PublishDate": 1746031741000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Communications: Total Debt Reaches ₹40,413 Crore",
            "Summary": "Reliance Communications disclosed a total financial indebtedness of ₹40,413 crore as of March 31, 2025, excluding accrued interest of ₹30,116 crore on loans and ₹3,361 crore on NCDs. The company is currently undergoing corporate insolvency resolution process.",
            "Sentiment": "negative",
            "PublishDate": 1743754872000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anil Ambani: Bombay HC Imposes ₹25,000 Cost for Seeking Urgent Hearing",
            "Summary": "The Bombay High Court imposed a ₹25,000 cost on Anil Ambani for seeking an urgent hearing on his petition challenging an Income Tax notice. The court cited 'artificial urgency' as the reason. Ambani later withdrew the petition after the tax department passed its order.",
            "Sentiment": "negative",
            "PublishDate": 1743671641000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Communications Reports Subsidiary Dissolutions and Financial Loss",
            "Summary": "Reliance Communications has announced the striking off of Anupam Global Soft and the dissolution of Lagerwood Investments, two of its subsidiaries. The company stated that these actions will not impact its operations. Additionally, Reliance Communications reported a consolidated net loss of 490 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1743466141000,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Communications Reports Financial Loss and Corporate Restructuring",
            "Summary": "Reliance Communications has announced the striking off of Anupam Global Soft and the dissolution of Lagerwood Investments. The company states that these actions will have no impact on its operations. Additionally, Reliance Communications reported a consolidated net loss of 490 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1743424923000,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Communications Accounts Classified as Fraud by Canara Bank",
            "Summary": "Reliance Communications and its subsidiary have received letters from Canara Bank classifying their accounts as fraudulent. This development could have significant implications for the company's financial standing and relationships with lenders.",
            "Sentiment": "negative",
            "PublishDate": 1731675780000,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Communications: Canara Bank Issues Fraud Notice for Loan Misuse",
            "Summary": "Canara Bank has issued a fraud notice to Anil Ambani's Reliance Communications Ltd. for misusing loans worth Rs 1,050 crore. A forensic audit revealed extensive fund diversion, including unauthorized repayments to other banks and transfers to related parties. The loans were classified as non-performing assets in 2017. This notice follows recent allegations of fake bank guarantees against another Ambani-owned company, Reliance Power.",
            "Sentiment": "negative",
            "PublishDate": 1731675353000,
            "Source": "normal_news"
        }
    ]
}