{
    "Symbol": "RECLTD",
    "ISIN": "INE020B01018",
    "News": [
        {
            "Title": "REC Subsidiary Sold to Power Grid for ₹13.02 Cr",
            "Summary": "REC Limited's subsidiary RECPDCL has completed the sale of Bellary Davanagere Power Transmission Limited to Power Grid Corporation of India Limited for ₹13.02 crore through competitive bidding process.",
            "Sentiment": "neutral",
            "PublishDate": 1770897810919,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC Ltd Executive Director Chandra Sekhar Sakhamuri Steps Down",
            "Summary": "REC Limited announces cessation of Executive Director Shri Chandra Sekhar Sakhamuri, IAS, effective February 11, 2026, due to repatriation to his parent cadre in Tamil Nadu under regulatory disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770796527294,
            "Source": "stocks"
        },
        {
            "Title": "Government Plans PFC-REC Merger",
            "Summary": "The government is considering combining Power Finance Corporation (PFC) and Rural Electrification Corporation (REC), two major power sector financing institutions.",
            "Sentiment": "neutral",
            "PublishDate": 1770013619244,
            "Source": "stocks"
        },
        {
            "Title": "REC Declares Dividend of ₹4.60 Per Share",
            "Summary": "Rural Electrification Corporation (REC) has announced a dividend payment of ₹4.60 per share for its shareholders, reflecting the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1769685160389,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC Q3 Net Profit Rises to ₹40.43 Billion",
            "Summary": "Rural Electrification Corporation reports Q3 standalone net profit of ₹40.43 billion, showing marginal growth from ₹40.30 billion in the previous year, though falling short of analyst estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1769685120146,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC Board to Consider 3rd Interim Dividend on Jan 29",
            "Summary": "REC Limited has scheduled a board meeting on January 29, 2026, to consider the declaration of a third interim dividend for FY26, following regulatory compliance under SEBI guidelines.",
            "Sentiment": "positive",
            "PublishDate": 1769162215873,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC Limited Subsidiary Struck Off Company Register",
            "Summary": "REC Limited announces that its project-specific subsidiary Rajgarh III Power Transmission Limited has been struck off from the Register of Companies on January 20, 2026, ceasing operations.",
            "Sentiment": "neutral",
            "PublishDate": 1768917146542,
            "Source": "stocks"
        },
        {
            "Title": "REC Ltd Block Trade Worth ₹36.87 Crores on NSE",
            "Summary": "REC Ltd witnessed a significant block trade on NSE involving 1,010,993 shares worth ₹36.87 crores at ₹364.70 per share, indicating substantial institutional activity in the rural electrification financing company.",
            "Sentiment": "neutral",
            "PublishDate": 1768891328481,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC to announce Q3 FY25 results on January 29",
            "Summary": "Rural Electrification Corporation Limited has scheduled its board meeting to consider and approve the third quarter financial results for FY25 on January 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768804890951,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC Transfers Two Power Transmission Subsidiaries",
            "Summary": "REC successfully transfers two power transmission subsidiaries to winning bidders, with operations scheduled to cease on January 9, 2026, marking completion of strategic divestment process.",
            "Sentiment": "neutral",
            "PublishDate": 1767968112418,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC Limited Sells Two Power Transmission SPVs",
            "Summary": "REC Limited subsidiary RECPDCL transfers Velgaon and Jejuri Hinjewadi Power Transmission subsidiaries to Ceigall India and Tata Power respectively for ₹2.64 crores total consideration.",
            "Sentiment": "neutral",
            "PublishDate": 1767961837371,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC Limited Earns 'Excellent' Rating for Third Year",
            "Summary": "REC Limited achieved 'Excellent' rating in MoU Performance for FY25 from Department of Public Enterprises, marking three consecutive years of excellence in operational and financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1767883192710,
            "Source": "stocks"
        },
        {
            "Title": "REC Incorporates Munak Power Transmission Limited",
            "Summary": "REC Limited officially incorporated Munak Power Transmission Limited on January 5, 2026, as a wholly owned subsidiary through RECPDCL to develop 400 KV substation and transmission lines for 800 MW power evacuation from DCRTPP, Yamunanagar.",
            "Sentiment": "positive",
            "PublishDate": 1767772616832,
            "Source": "stocks"
        },
        {
            "Title": "REC Ltd Sees ₹26.46 Cr NSE Block Trade at ₹379.60",
            "Summary": "REC Limited witnessed a significant block trade on NSE involving approximately 697,074 shares worth ₹26.46 crores at ₹379.60 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767348484112,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC, PFC shares surge 7% and 6% in best week",
            "Summary": "State-run power financiers REC and PFC recorded their best weekly performance in eight months with gains of 7% and 6% respectively, marking three consecutive days of advances despite poor 2024 performance.",
            "Sentiment": "positive",
            "PublishDate": 1767333423568,
            "Source": "stocks"
        },
        {
            "Title": "REC Creates Three New Transmission Subsidiaries",
            "Summary": "REC's power development unit establishes three fully owned transmission subsidiaries to handle state-level infrastructure projects, expanding the company's transmission capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1766754076243,
            "Source": "stocks"
        },
        {
            "Title": "REC Forms New Power Transmission Unit",
            "Summary": "REC establishes Apta Power Transmission as an indirect subsidiary unit under REC Power Development and Consultancy, expanding its power sector operations.",
            "Sentiment": "positive",
            "PublishDate": 1766717308083,
            "Source": "stocks"
        },
        {
            "Title": "REC Limited Incorporates New Subsidiary for Power Project",
            "Summary": "REC Limited announces incorporation of Musalgaon Power Transmission Limited as wholly owned subsidiary through RECPDCL for Maharashtra transmission project worth ₹5.00 lakhs authorized capital.",
            "Sentiment": "positive",
            "PublishDate": 1766229612395,
            "Source": "co_actions_results"
        },
        {
            "Title": "REC Forms Subsidiary for Power Transmission Project",
            "Summary": "REC Limited establishes Ambernath Power Transmission Limited as wholly owned subsidiary to execute 400/220 KV GIS transmission project, expanding infrastructure capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1766153855482,
            "Source": "stocks"
        },
        {
            "Title": "REC Limited Promotes Hemant Kumar to Executive Director Position",
            "Summary": "REC Limited announced the promotion of Hemant Kumar to Executive Director effective December 2, 2025, subject to assumption of charge. Kumar, who holds degrees in Science and Finance, was previously serving as Chief General Manager (Finance & Accounts) before his promotion to the senior management position.",
            "Sentiment": "positive",
            "PublishDate": 1764672540516,
            "Source": "corporate_governance"
        },
        {
            "Title": "REC Limited Appoints Dinesh Garg as Company Secretary Following Superannuation",
            "Summary": "REC Limited announced the appointment of Dinesh Garg as Company Secretary and Compliance Officer, replacing J.S. Amitabh who ceased his role due to superannuation on December 1, 2025. Garg brings over two decades of experience in corporate governance, regulatory compliance, and stakeholder management across public and private sector organizations.",
            "Sentiment": "neutral",
            "PublishDate": 1764591645961,
            "Source": "corporate_governance"
        },
        {
            "Title": "REC Establishes Two Fully Owned Subsidiaries for Network Expansion",
            "Summary": "REC has introduced two fully owned subsidiaries as part of network expansion projects.",
            "Sentiment": "positive",
            "PublishDate": 1762517017545,
            "Source": "stock"
        },
        {
            "Title": "REC Shares Rally After Management Rules Out Further Loan Prepayments",
            "Summary": "REC Limited experienced early loan repayments worth ₹49,000 crore between July and September 2025, with ₹11,413 crore coming from the Kaleshwaram Irrigation Project in Telangana executed by BHEL. These prepayments reduced loan book growth to 6.6% from a potential 16.6%. Management assured analysts that no such prepayments are expected in the remaining two quarters of the financial year ending March 2026, leading to a stock price rally on October 29. REC shares had declined since the company reported earnings on October 17. The company maintains its target of achieving a ₹10 lakh crore loan book by March 2030, requiring a compounded annual growth rate of over 13%. REC has a market capitalization of approximately ₹97,560 crore and a loan book of over ₹5.82 lakh crore as of March 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761725115636,
            "Source": "stock"
        },
        {
            "Title": "REC Maintains 11-12% Growth Target for FY26 Despite Q2 Decline",
            "Summary": "REC reported a 7% year-over-year decline in Q2 FY26 but maintains its loan growth target of 11-12% for FY26. The company expects to achieve this target as the power sector remains robust. REC anticipates that H2 performance will surpass H1 performance. The company has set a long-term goal of reaching a ₹10 lakh crore loan book by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1761717990364,
            "Source": "stock"
        },
        {
            "Title": "REC Limited's Subsidiary Sells Two Power Transmission Units for ₹8.33 Crore",
            "Summary": "REC Power Development and Consultancy Limited (RECPDCL), a wholly owned subsidiary of REC Limited, has sold its entire shareholding in two project-specific subsidiaries on October 17, 2025. Ananthapuram II Power Transmission Limited was sold to Shivalaya Construction Limited for ₹7.70 crore, while SR WR Power Transmission Limited was transferred to Power Grid Corporation of India Limited for ₹0.63 crore. Both transactions included taxes and reimbursement of expenses. The subsidiaries were sold at par value along with all assets and liabilities through a tariff-based competitive bidding process. The buyers do not belong to the promoter or promoter group, and the transactions are not classified as related party transactions. Both subsidiaries had negligible contribution to turnover and net worth during the last financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1760711221061,
            "Source": "corporate_action"
        },
        {
            "Title": "REC Limited Reports Strong Q2 Results, Declares ₹4.60 Interim Dividend",
            "Summary": "REC Limited's Board approved unaudited financial results for the quarter ended September 30, 2025. The company reported standalone net profit of ₹4,425.86 crores for the quarter and ₹8,876.88 crores for the six-month period. On a consolidated basis, net profit stood at ₹4,414.93 crores for the quarter and ₹8,880.64 crores for six months. The Board declared a second interim dividend of ₹4.60 per equity share with record date of October 27, 2025, and payment by November 14, 2025. The company also appointed Dinesh Garg as Company Secretary & Compliance Officer effective December 1, 2025, replacing J.S. Amitabh who retires on November 30, 2025. REC's total income for the quarter was ₹15,094.61 crores standalone and ₹15,162.38 crores consolidated.",
            "Sentiment": "positive",
            "PublishDate": 1760707681329,
            "Source": "corporate_action"
        },
        {
            "Title": "REC Ltd Schedules Q2 Results Announcement for October 17, Board to Consider Interim Dividend",
            "Summary": "State-owned REC Ltd will announce its second quarter results on October 17, 2025. The Board of Directors will review unaudited standalone and consolidated financial results for the quarter and six-month period ending September 30. The board will also consider declaring a second interim dividend for FY26. The trading window for designated persons remains closed from October 1 to October 19. REC shares have declined 25.58% year-to-date and dropped 31.25% over the past year. The stock hit a 52-week high of Rs 573.3 in December 2024 and a 52-week low of Rs 348.6 in August 2025. Shares were trading 1.61% higher at Rs 376.25 on Wednesday.",
            "Sentiment": "neutral",
            "PublishDate": 1760521582886,
            "Source": "earnings"
        },
        {
            "Title": "REC Limited Appoints Thangarajan Subash Chandira Bosh as Director (Projects)",
            "Summary": "REC Limited has appointed Shri Thangarajan Subash Chandira Bosh as Director (Projects) effective October 3, 2025. The appointment was made through a Ministry of Power order and will run until May 31, 2029 or until further orders, whichever is earlier. Bosh brings over 35 years of power sector experience and previously served as Executive Director at REC and Chief Executive Officer of REC Power Development & Consultancy Limited. He has been involved in major national electrification initiatives including the Deen Dayal Upadhyaya Gram Jyoti Yojana and Pradhan Mantri Sahaj Bijli Har Ghar Yojana. The company confirmed he is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1759499127676,
            "Source": "corporate_governance"
        },
        {
            "Title": "REC Establishes Two New Power Transmission Subsidiaries",
            "Summary": "REC has introduced two new fully owned subsidiaries: Kempegowda Power Transmission Ltd. and Barmer HVDC Power Transmission Ltd. Both companies appear to focus on power transmission operations.",
            "Sentiment": "positive",
            "PublishDate": 1759234856004,
            "Source": "stock"
        },
        {
            "Title": "REC Sells Rajgarh Neemuch Power Transmission Subsidiary for ₹5 Crore",
            "Summary": "REC has completed the sale of its subsidiary Rajgarh Neemuch Power Transmission to OR Infra Projects Limited for ₹5 crore. The transaction involves the divestment of REC's power transmission subsidiary to the acquiring company.",
            "Sentiment": "neutral",
            "PublishDate": 1759163097991,
            "Source": "order&deals"
        },
        {
            "Title": "REC Limited Incorporates Bellary Davanagere Power Transmission Limited as Subsidiary for Renewable Energy Transmission Project",
            "Summary": "REC Limited announced the incorporation of Bellary Davanagere Power Transmission Limited as a wholly owned subsidiary of REC Power Development and Consultancy Limited (RECPDCL). The new company was incorporated on September 25, 2025, with an authorized and paid-up capital of ₹5,00,000. The subsidiary was established to handle transmission system strengthening for integration of additional renewable energy potential at Davanagere (0.25 GW) and Bellary (2.75 GW). RECPDCL has been appointed as Bid Process Coordinator for selecting a bidder through Tariff Based Competitive Bidding guidelines. After the selection process, the company will be transferred to the successful bidder along with all assets and liabilities. The incorporation follows a Ministry of Power notification dated August 19, 2025, allocating an inter-state transmission project.",
            "Sentiment": "neutral",
            "PublishDate": 1758806068144,
            "Source": "corporate_action"
        },
        {
            "Title": "REC Sells Complete Stake in Davanagere Power Transmission to Power Grid Corporation for ₹5 Crore",
            "Summary": "REC has sold its entire 100% stake in Davanagere Power Transmission to Power Grid Corporation for ₹5 crore. This transaction represents a complete divestment of REC's ownership in the power transmission company.",
            "Sentiment": "neutral",
            "PublishDate": 1758719097488,
            "Source": "order&deals"
        },
        {
            "Title": "REC Limited Appoints Prince Dhawan as Executive Director",
            "Summary": "REC Limited has appointed Shri Prince Dhawan, IAS as Executive Director effective September 23, 2025. Dhawan is an IAS Officer from AGMUT cadre (2012 Batch) with Bachelor's and Master's degrees from IIT Delhi and a Master's in Public Administration from Harvard University's Kennedy School of Government. He previously served as Managing Director (DTC) & Special Commissioner (Transport) for the Government of NCT of Delhi. This represents a change in the company's senior management at one level below the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1758642930405,
            "Source": "corporate_governance"
        },
        {
            "Title": "REC Limited Reports Record Quarterly Profit of ₹4,451 Crores in Q1 FY26, Achieves Highest Ever Disbursements",
            "Summary": "REC Limited recorded its highest ever quarterly net profit of ₹4,451 crores in Q1 FY26, marking a 29% growth year-on-year. The company achieved record quarterly disbursements of ₹59,508 crores, up 36% from the previous year. The loan book reached ₹5.85 lakh crores, representing a 10% increase. Net interest income grew 17% to ₹5,247 crores. The company resolved one stressed asset (TRN Energy worth ₹1,504 crores), bringing gross NPA down to 1.05% and net NPA to 0.24%. REC sanctioned over ₹1 lakh crores worth of projects during the quarter, with distribution sector accounting for 43% of sanctions and renewable energy at 20%. The Board approved an interim dividend of ₹4.60 per share. Net interest margin improved to 3.74% from 3.64% in the previous year, while yield increased to 10.08%. The company maintains a comfortable capital adequacy ratio of 23.98% against the required 15%. REC became the first Indian public sector NBFC to receive ISO 31000:2018 certification for risk management practices. Management targets 12% loan growth for the year and expects to become a net zero NPA company by end of the financial year.",
            "Sentiment": "positive",
            "PublishDate": 1754481778800,
            "Source": "earnings"
        },
        {
            "Title": "REC Reports 10% Loan Book Growth, Expects Provision Reversals of Rs 700-800 Crores",
            "Summary": "REC's total loan book reached Rs 5,84,568 crores as of June 30, 2025, marking a 10% increase from the previous year. The company expects potential provision reversals of Rs 700-800 crores during the year from resolution of stressed assets. REC projects 12% loan growth for the year ahead.",
            "Sentiment": "positive",
            "PublishDate": 1754020255058,
            "Source": "stock"
        },
        {
            "Title": "REC Targets Net Zero NPA Status by FY26 End",
            "Summary": "REC announced its expectation to achieve net zero non-performing assets (NPAs) by the end of FY26. This target was shared during a conference call update, indicating the company's strategic focus on improving asset quality and eliminating bad loans from its portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1754019834191,
            "Source": "stock"
        },
        {
            "Title": "REC Reports 29% Jump in Net Profit to 44.5 Billion Rupees",
            "Summary": "REC reported net profit of 44.5 billion rupees compared to 34.42 billion rupees in the same quarter last year, marking a year-over-year increase. The company's revenue also grew to 142 billion rupees from 125 billion rupees in the corresponding period of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753352710702,
            "Source": "earnings"
        },
        {
            "Title": "REC Limited Declares ₹4.60 Interim Dividend, Reports Strong Q1 Performance with 29% Profit Growth",
            "Summary": "REC Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing net profit of ₹4,451.02 crores compared to ₹3,442.45 crores in the same quarter last year. The company declared an interim dividend of ₹4.60 per equity share with record date of August 1, 2025, and payment by August 21, 2025. Interest income on loan assets increased to ₹14,192.33 crores from ₹12,500.37 crores year-on-year. The company also set August 14, 2025 as record date for final dividend of ₹2.60 per share for FY 2024-25, subject to shareholder approval. Additionally, the Board appointed M/s. Agarwal S. & Associates as Secretarial Auditor for five years from 2025-26 to 2029-30 and amended the Code of Conduct for insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1753352656677,
            "Source": "corporate_action"
        },
        {
            "Title": "REC Limited Schedules Board Meeting to Consider Q1 FY2026 Results and Interim Dividend",
            "Summary": "REC Limited has scheduled a Board of Directors meeting for July 24, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025, and to consider declaring an interim dividend for financial year 2025-26. The company has implemented a trading window closure from July 1 to July 26, 2025, during which designated persons and their immediate relatives are prohibited from trading in REC's equity shares and other listed securities. The trading window will reopen on July 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753161107299,
            "Source": "corporate_action"
        },
        {
            "Title": "REC Creates Two New Subsidiaries for Maharashtra Transmission Projects",
            "Summary": "REC (Rural Electrification Corporation) has established two new subsidiary companies for local transmission projects in Maharashtra. These subsidiaries are specifically created to handle transmission projects within the state. The move indicates REC's expansion into regional power infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1751897164000,
            "Source": "default"
        },
        {
            "Title": "REC Power Development Adds New Subsidiary",
            "Summary": "REC Power Development has added SR WR Power Transmission as a new subsidiary to its corporate structure.",
            "Sentiment": "positive",
            "PublishDate": 1751372707000,
            "Source": "default"
        },
        {
            "Title": "REC Reports Outstanding Dues from Two SPVs and Sanctions Loan to KIPCL",
            "Summary": "REC has informed the Principal Secretary of Irrigation about total dues of ₹1,393.65 crore from two Special Purpose Vehicles (SPVs). The overdue amounts are ₹319.74 crore from TSWRIDC and ₹229.75 crore from KIPCL, outstanding since March 31, 2025. Additionally, REC has sanctioned a ₹30,000 crore loan to KIPCL.",
            "Sentiment": "neutral",
            "PublishDate": 1751256330000,
            "Source": "default"
        },
        {
            "Title": "REC Establishes New Wholly Owned Subsidiary RECPDCL",
            "Summary": "REC (Rural Electrification Corporation) has launched a new wholly owned subsidiary named REC Power Development and Consultancy Limited (RECPDCL). This new entity appears to be focused on power development and consultancy services, as suggested by its name.",
            "Sentiment": "positive",
            "PublishDate": 1751028562000,
            "Source": "default"
        },
        {
            "Title": "REC Establishes New Subsidiary: Ananthapuram II Power Transmission Limited",
            "Summary": "REC has established a fully owned subsidiary named Ananthapuram II Power Transmission Limited. This new entity is focused on power transmission operations.",
            "Sentiment": "positive",
            "PublishDate": 1750942751000,
            "Source": "default"
        },
        {
            "Title": "REC Ltd: Board Approves ₹1.55 Lakh Crore Fundraising Plan and SPV Strike-Off",
            "Summary": "REC Ltd's board approved a ₹1.55 lakh crore fundraising plan through private placement of bonds/debentures, subject to shareholder approval. The company also decided to strike off its subsidiary Rajgarh III Power Transmission Ltd following project de-notification by the Ministry of Power.",
            "Sentiment": "neutral",
            "PublishDate": 1749093860000,
            "Source": "corporate_action"
        },
        {
            "Title": "REC Ltd: Board Approves ₹1.55 Lakh Crore Bond Fundraise",
            "Summary": "REC Ltd's board has approved raising up to ₹1.55 lakh crore through private placement of bonds or debentures, subject to shareholder approval. The company also plans to strike off its subsidiary Rajgarh III Power Transmission Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1749035854000,
            "Source": "corporate_action"
        },
        {
            "Title": "REC Proposes ₹1.55 Trillion Fund Raise and Eliminates Rajgarh III Project",
            "Summary": "REC has announced plans to raise funds totaling up to ₹1.55 trillion. Additionally, the company will eliminate the Rajgarh III power transmission project. No further details about the fund-raising method or reasons for the project elimination were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1749033057000,
            "Source": "default"
        },
        {
            "Title": "REC Incorporates Three New Subsidiary Companies",
            "Summary": "REC (Rural Electrification Corporation) has incorporated three new subsidiary companies. No further details about the names, purposes, or structures of these subsidiaries were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1747838366000,
            "Source": "default"
        },
        {
            "Title": "REC Ltd: AUM Growth Guidance Cut, Stock Falls",
            "Summary": "REC Ltd reduced its AUM growth guidance for FY26 to 11-13% from 15-17%. Q4 net profit rose 5.5% YoY to ₹4,236 crore. Final dividend of ₹2.6/share proposed. Joint venture with BHEL approved for renewable energy projects. Stock down 3.2% at ₹288.8 following guidance cut.",
            "Sentiment": "negative",
            "PublishDate": 1747203865000,
            "Source": "earnings"
        },
        {
            "Title": "REC Reports Q4 Results and Forms JV with BHEL",
            "Summary": "REC Limited has announced its Q4 financial results, with revenue increasing to 151.6 billion rupees from 126 billion rupees year-over-year. The company's standalone net profit rose to 42.36 billion rupees. REC also recommended a final dividend of 2.60 rupees per equity share. Additionally, the company has formed a 50:50 joint venture with Bharat Heavy Electricals Limited (BHEL) for the development of renewable energy and other power projects.",
            "Sentiment": "positive",
            "PublishDate": 1746704685000,
            "Source": "default"
        }
    ]
}