{
    "Symbol": "REDINGTON",
    "ISIN": "INE891D01026",
    "News": [
        {
            "Title": "Redington Board Meeting Set for Feb 4, 2026",
            "Summary": "Redington Limited has scheduled a board meeting on February 4, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3 FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769791472877,
            "Source": "co_actions_results"
        },
        {
            "Title": "Redington Receives ₹148 Crore Tax Demand Order",
            "Summary": "Redington Limited has received a tax demand order worth ₹148 crores from tax authorities, marking a significant regulatory development for the trading company.",
            "Sentiment": "negative",
            "PublishDate": 1767233961394,
            "Source": "stocks"
        },
        {
            "Title": "Redington faces ₹148.33 cr GST demand from authorities",
            "Summary": "Redington Limited received GST assessment order demanding ₹148.33 crores for FY2019-2022 period due to disallowed input tax credits, though company expects no material financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1767177574281,
            "Source": "stocks"
        },
        {
            "Title": "Redington Limited Reports Best Q2 Performance with 17% Revenue Growth to INR 29,118 Crores",
            "Summary": "Redington Limited delivered its best quarterly performance with revenue of INR 29,118 crores, marking 17% growth year-on-year. The company achieved quarterly profit of INR 388 crores with PAT at 1.33% for the group and 1.57% excluding Arena. Growth was driven across all business segments with India growing 23%, UAE 23%, and Saudi Arabia 10%. The newly formed Software Solutions Group (SSG) showed strong performance with 48% growth, contributing 16% to topline. Mobility business grew 18% contributing 35% of revenue, while ESG business grew 11% contributing 32%. The company maintained efficient working capital management at 31 days and controlled opex growth at 9%. Arena subsidiary continued facing challenges with INR 37 crores loss, though the company divested Connect Vodafone contract to reduce Turkish lira exposure. Redington was awarded number 1 IT distributor in India by VAR India for the third consecutive year.",
            "Sentiment": "positive",
            "PublishDate": 1762930288336,
            "Source": "earnings"
        },
        {
            "Title": "Redington Management Targets 30-50% Growth for Software Solutions Group",
            "Summary": "Redington management anticipates PC business growth may increase in the second half if current trends continue. The company plans 30-50% growth for its Software Solutions Group over the next 6-12 quarters, an increase from 20-23% growth last year. Management expects full benefits from the Vodafone Connect sale by Q4 and next fiscal year. The company remains optimistic about business growth in India, UAE, and KSA for the next 2-3 quarters, particularly in mobility.",
            "Sentiment": "positive",
            "PublishDate": 1762484062020,
            "Source": "stock"
        },
        {
            "Title": "Redington Limited Reports Q2 FY26 Financial Results with Board Approval",
            "Summary": "Redington Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company's standalone revenue from operations was ₹15,105.12 crores for Q2 and ₹27,572.28 crores for H1. Consolidated revenue reached ₹25,027.60 crores for Q2 and ₹46,177.89 crores for H1. Standalone profit after tax was ₹531.78 crores for H1, while consolidated PAT was ₹583.18 crores for the same period. During the quarter, step-down subsidiary Arena Connect entered into a definitive agreement with Datagate for assignment of Device Distribution and Supply Agreement with Vodafone for USD 8 million consideration. The results were reviewed by statutory auditors Deloitte Haskins & Sells and will be available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762376439060,
            "Source": "earnings"
        },
        {
            "Title": "Redington India Reports Strong Q2 Growth with Net Profit Rising 32% to 3.88 Billion Rupees",
            "Summary": "Redington India delivered robust quarterly results with consolidated net profit increasing to 3.88 billion rupees from 2.93 billion rupees in the same period last year. Revenue grew to 29 billion rupees compared to 24.9 billion rupees year-over-year. EBITDA rose to 5.89 billion rupees from 4.58 billion rupees, while EBITDA margin improved to 2.03% from 1.84% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762347016584,
            "Source": "earnings"
        },
        {
            "Title": "Redington Limited Wins GST Appeal, INR 91.74 Cr Demand Quashed",
            "Summary": "Redington Limited received a favorable order from the Joint Commissioner (ST), GST Appeals, Chennai, quashing a GST demand of INR 91.74 crores (including interest and penalty) for financial year 2020-2021. The demand was originally raised by the Deputy Commissioner (CT), which Redington had contested in February 2025. The company stated there is no impact on its financial, operational or other activities from this development.",
            "Sentiment": "positive",
            "PublishDate": 1761452998394,
            "Source": "stock"
        },
        {
            "Title": "Arena Connect Assigns Vodafone Distribution Agreement to Datagate for USD 8 Million",
            "Summary": "Arena Connect Teknoloji Sanayi ve Ticaret A.Ş., a subsidiary of Redington Limited's step-down subsidiary, has entered into a definitive agreement with Datagate Bilgisayar Malzemeleri Ticaret A.Ş. for the assignment of a Device Distribution and Supply Agreement with Vodafone. The agreement is valued at approximately USD 8 million and will be effective from October 1, 2025. Datagate is an information technology distribution company based in Turkey and is not related to Redington's promoter group. Arena's revenue as of March 31, 2025 was approximately USD 420.40 million, representing 3.6% of consolidated annual revenue.",
            "Sentiment": "neutral",
            "PublishDate": 1758339743078,
            "Source": "order&deals"
        },
        {
            "Title": "Indian Markets Decline After Three-Day Rally; Redington Surges 8.8%",
            "Summary": "Indian equity benchmarks fell on Friday, with BSE Sensex dropping 0.5% to 82,580 and NSE Nifty 50 declining 0.4% to 25,314.30, ending a three-day rally. Market breadth favored sellers with 1,108 stocks declining versus 1,094 advancing on NSE. Redington emerged as a standout performer, surging 8.8% to Rs 313.40 with trading volume exceeding eight times its 20-day average. The stock's relative strength index reached 70, suggesting overbought conditions, while trading at 16.3 times estimated earnings per share. Redington has gained 26% over five days and 61% over the past 12 months. Other stocks in focus included Gujarat Mineral Development Corporation and Netweb Technologies.",
            "Sentiment": "neutral",
            "PublishDate": 1758257048941,
            "Source": "stock"
        },
        {
            "Title": "Redington Stock Surges 16% on iPhone 17 Launch Excitement",
            "Summary": "Redington Ltd shares jumped 16% to Rs 280 following excitement around the iPhone 17 launch, with pre-orders underway and sales beginning September 19. The company serves as Apple's supply chain partner for IT and mobility products across India, Middle East, Turkey, Africa, and South Asia through a distribution agreement dating back to 2007. Redington reported 12% year-on-year growth in net profit to Rs 275 crore and 22% revenue growth to Rs 25,952 crore for the June quarter, driven by the premium mobility segment and large deal wins in India and UAE. Technical indicators show mixed signals with MACD readings below zero line and RSI at 43.8, while the stock trades below key moving averages. The stock has gained 40% year-to-date and was trading at Rs 276.40, up 14.5% from previous close.",
            "Sentiment": "positive",
            "PublishDate": 1758007254173,
            "Source": "stock"
        },
        {
            "Title": "Redington Shares Surge 16% in Biggest Single-Day Gain Since March 2021",
            "Summary": "Redington Ltd. shares gained 15.9% on Tuesday, September 16, marking the company's largest single-day increase since March 2021. Trading volume reached 7 crore shares by 12:30 PM, significantly higher than the 20-day average of 8.7 lakh shares, representing the highest volumes since February 2023. Block deals worth ₹239 crore involving 85.6 lakh shares occurred during the session. The stock broke above its 50 and 200-day moving averages, with shares hitting an intraday high of ₹279.69. Redington reported quarterly results in July showing net profit growth of 12% to ₹275 crore and revenue increase of 22% to ₹25,952 crore, though margins contracted to 1.6% from 1.7% year-over-year. The stock has gained 39.9% year-to-date, marking its best annual performance since 2021.",
            "Sentiment": "positive",
            "PublishDate": 1758006849064,
            "Source": "stock"
        },
        {
            "Title": "Redington and CrowdStrike Form Distribution Partnership for Indian Cybersecurity Market",
            "Summary": "Redington has entered into a new distribution agreement with CrowdStrike aimed at accelerating cybersecurity transformation across India. The partnership will enable broader distribution of CrowdStrike's cybersecurity solutions through Redington's network in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1756915962949,
            "Source": "stock"
        },
        {
            "Title": "Redington Limited Reports 22% Revenue Growth in Q1 FY26 Despite Margin Pressures and Turkey Subsidiary Challenges",
            "Summary": "Redington Limited delivered strong quarterly results with revenues growing 22% and profits up 12% year-on-year. Excluding Arena (Turkey subsidiary), revenue grew 24% and profits increased 15%. India showed robust performance with 24% growth, while UAE and Saudi Arabia posted 35% and 32% growth respectively. The Mobility Solutions Group led with 44% growth, and Cloud Solutions continued momentum with 41% growth. However, gross margins declined by 60 basis points to 5.1% due to large deals in Technology Solutions Group, market pressures, and Arena-related issues. The company faced significant challenges in Turkey where subsidiary Arena took $8 million in provisions due to customers filing for concordat (debt restructuring). Working capital improved to 37 days from 39 days in the previous year. Management maintains confidence in achieving operating profit targets of 2.3-2.5% and PAT above 1.3% for the full year, while reviewing strategic options for the Turkey business.",
            "Sentiment": "neutral",
            "PublishDate": 1754410982031,
            "Source": "earnings"
        },
        {
            "Title": "Redington's Turkish Subsidiary Receives Competition Authority Approval to Continue Vodafone Distribution Agreement Negotiations",
            "Summary": "Redington Limited announced that its step-down subsidiary Arena Bilgisayar Sanayi ve Ticaret A.Ş has received approval from the Turkish Competition Authority to continue non-binding negotiations regarding the transfer of a Device Distribution and Supply Agreement. The agreement involves Arena's subsidiary Arena Connect Teknoloji Sanayi ve Ticaret A.Ş. and Vodafone Dağıtım, Servis ve İçerik Hizmetleri A.Ş. The company stated that any further progress leading to the conclusion of negotiations and definitive arrangements will be communicated in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1754322549674,
            "Source": "stock"
        },
        {
            "Title": "Redington Limited Reports Strong Q1FY26 Results with 22% Revenue Growth and Highest Ever Q1 Revenue",
            "Summary": "Redington Limited achieved its highest ever revenue in any Q1, with global revenue growing 22% year-on-year to ₹26,002 crores in Q1FY26. EBITDA increased 6% to ₹450 crores while PAT grew 12% to ₹275 crores. The SISA (Singapore, India & South Asia) business segment showed strong performance with revenue growing 23%, EBITDA up 19%, and PAT increasing 29%. ROW (Rest of World) excluding Arena recorded 25% revenue growth, though EBITDA declined 4% and PAT dropped 5%. Key operational metrics improved with working capital days reducing to 37 days from 39 days year-on-year. The Mobility Solutions Group (MSG) grew 44% and Cloud Solutions Group (CSG) expanded 41%. Net debt to equity ratio stood at 0.23x. The company shared these results through an earnings presentation for an analyst/investor conference call scheduled for July 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753862973610,
            "Source": "earnings"
        },
        {
            "Title": "Redington India Reports 26% Revenue Growth to 269B Rupees in Q1",
            "Summary": "Redington India reported Q1 revenue of 269 billion rupees, representing a significant increase from 213 billion rupees in the same period last year. The company's EBITDA rose to 4 billion rupees from 3.7 billion rupees year-over-year. However, EBITDA margin declined to 1.54% compared to 1.75% in the previous year, indicating lower profitability despite higher absolute earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1753862014106,
            "Source": "earnings"
        },
        {
            "Title": "Redington India Reports 12% Growth in Quarterly Net Profit to 2.75 Billion Rupees",
            "Summary": "Redington India posted a consolidated net profit of 2.75 billion rupees in its latest quarterly results, representing an increase from 2.46 billion rupees in the same period last year. This marks a year-over-year growth of approximately 12% in the company's bottom line performance.",
            "Sentiment": "positive",
            "PublishDate": 1753861484977,
            "Source": "earnings"
        },
        {
            "Title": "Redington Ltd: Q4 Profit Soars to Rs 209 Crore, Dividend Announced",
            "Summary": "Redington Ltd reported a standalone profit of Rs 209.45 crore for Q4 FY2025, up from Rs 160.57 crore in the previous year. Annual profit increased to Rs 1,443.78 crore. The board recommended a final dividend of Rs 6.80 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747752072000,
            "Source": "earnings"
        },
        {
            "Title": "Redington (India) Announces Dividend and Reports Q4 Results",
            "Summary": "Redington (India) has recommended a dividend of 6.8 rupees per equity share. The company reported an exceptional item of 6.3 billion rupees. For the fourth quarter, Redington's profit before tax (PBT) was 5.2 billion rupees, compared to 3.8 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747666643000,
            "Source": "result"
        },
        {
            "Title": "Redington (India) Reports Q4 Financial Results",
            "Summary": "Redington (India) has announced its Q4 financial results. The company's EBITDA increased to 5.97 billion rupees from 4.59 billion rupees year-over-year. The EBITDA margin improved to 2.26% from 2.05% in the same period. Consolidated net profit rose to 6.7 billion rupees from 3.26 billion rupees year-over-year and 4 billion rupees quarter-over-quarter. Revenue for Q4 increased to 264.4 billion rupees from 224.3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747666566000,
            "Source": "result"
        },
        {
            "Title": "Redington to Consider Q4 Results on May 19",
            "Summary": "Redington, a company, has announced that it will consider its fourth quarter (Q4) financial results on May 19.",
            "Sentiment": "neutral",
            "PublishDate": 1747225839000,
            "Source": "default"
        },
        {
            "Title": "Redington Receives Tax Demand Order for 1.75 Billion Rupees",
            "Summary": "Redington, an Indian company, has been issued a tax demand order for 1.75 billion rupees (approximately $21 million USD) by the tax authorities. This represents a significant financial obligation for the company and may impact its financial position.",
            "Sentiment": "negative",
            "PublishDate": 1742903210000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Redington: Share Price Hits Record High on Subsidiary Divestment Update",
            "Summary": "Redington's stock reached a new all-time high following an announcement about divestment by its step-down subsidiary Arena Bilgisayar Sanayi Ve Ticaret A.S. The company's shares have risen 20% year-to-date despite overall market downturn.",
            "Sentiment": "positive",
            "PublishDate": 1739513550000,
            "Source": "corporate_action"
        },
        {
            "Title": "Redington Announces 46.87 Billion Rupee Investment Plan for Saudi Arabia",
            "Summary": "Redington has unveiled a significant investment plan of 2 billion Saudi Arabian Riyals (equivalent to 46.87 billion Indian Rupees) for the Kingdom of Saudi Arabia. This announcement was made at the LEAP 2025 event, suggesting a strategic expansion or development initiative by the company in the Saudi market.",
            "Sentiment": "positive",
            "PublishDate": 1739159139000,
            "Source": "corporate_action"
        },
        {
            "Title": "Redington Reports Q3 Profit Growth and Appoints New CEO",
            "Summary": "Redington, a technology products and solutions provider, announced its Q3 financial results. The company's consolidated net profit increased to 4.03 billion rupees from 3.48 billion rupees year-over-year. Revenue also saw growth, rising to 267 billion rupees from 234 billion rupees in the same period last year. Additionally, Redington appointed V S Hariharan as the new Managing Director and Group CEO.",
            "Sentiment": "positive",
            "PublishDate": 1738801295000,
            "Source": "earnings"
        },
        {
            "Title": "Redington Appoints V S Hariharan as Managing Director and Group CEO",
            "Summary": "Redington, a technology products and services distributor, has announced the appointment of V S Hariharan as its new Managing Director and Group CEO. This leadership change represents a significant corporate governance decision for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1738762949000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Redington Ltd: Q3 Profit Surges 16% on Cloud and Tech Solutions Growth",
            "Summary": "Redington Ltd reported a 15.8% YoY increase in Q3 FY25 net profit to ₹403 crore. Revenue rose 13.7% to ₹26,716 crore. Cloud business grew 42% YoY, while technology solutions segment saw 28% YoY growth. The company appointed VS Hariharan as new MD and Group CEO for a five-year term starting February 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1738759363000,
            "Source": "earnings"
        },
        {
            "Title": "Redington Reports Improved Q3 EBITDA and Margin",
            "Summary": "Redington, an IT products and services distributor, has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 6.03 billion rupees, up from 5.17 billion rupees in the same quarter of the previous year. Additionally, Redington's EBITDA margin improved slightly to 2.26% from 2.20% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738759335000,
            "Source": "earnings"
        },
        {
            "Title": "Redington Reports Strong Q3 Financial Results",
            "Summary": "Redington, a technology products distributor, has announced its financial results for the third quarter. The company's consolidated net profit increased to 4.03 billion rupees, up from 3.48 billion rupees in the same period last year. Revenue also saw growth, rising to 267 billion rupees from 234 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738759328000,
            "Source": "earnings"
        },
        {
            "Title": "Redington to Consider Q3 Results on February 5",
            "Summary": "Redington Limited has announced that it will consider its third quarter financial results on February 5. This indicates the company is preparing to release its earnings report for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738240519000,
            "Source": "earnings"
        },
        {
            "Title": "Redington and Tunga Aerospace Partner for UAV Innovation in India",
            "Summary": "Redington, an IT distribution and supply chain solutions provider, has formed a partnership with Tunga Aerospace to drive innovation in Unmanned Aerial Vehicles (UAVs) in India. This collaboration aims to advance the development and application of UAV technology in the country, potentially boosting India's capabilities in this emerging sector.",
            "Sentiment": "positive",
            "PublishDate": 1735033048000,
            "Source": "corporate_action"
        },
        {
            "Title": "Redington Anticipates Profitability Boost from Lower Interest Rates",
            "Summary": "Redington, an IT distribution company, expects that a decrease in interest rates could positively impact their profitability, as stated in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1730344815000,
            "Source": "normal_news"
        },
        {
            "Title": "Redington Anticipates Strong Q3 Performance",
            "Summary": "Redington expects improved Q3 results due to India's festive season, NPI momentum, deal backlog, and CSG momentum. The company forecasts significant double-digit growth in India, potentially around 24-25%, as per their concall update.",
            "Sentiment": "positive",
            "PublishDate": 1730344505000,
            "Source": "result"
        },
        {
            "Title": "Redington Ltd Block Trade on NSE",
            "Summary": "A block trade of approximately 1,027,159 shares of Redington Ltd was executed on the National Stock Exchange (NSE) for Rs. 17.94 crores. The average price per share in this transaction was Rs. 174.69.",
            "Sentiment": "neutral",
            "PublishDate": 1730261400000,
            "Source": "block_deals"
        },
        {
            "Title": "Redington (India) Reports Q2 Financial Results",
            "Summary": "Redington (India) has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 4.58 billion rupees, compared to 4.82 billion rupees in the same quarter last year. The EBITDA margin has decreased from 2.17% to 1.84% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730208684000,
            "Source": "result"
        },
        {
            "Title": "Redington India Reports Q2 FY2024 Financial Results",
            "Summary": "Redington India Limited announced its Q2 financial results. The company reported a consolidated net profit of 2.9 billion rupees, down from 3.03 billion rupees year-over-year but up from 2.5 billion rupees quarter-over-quarter. Revenue for Q2 increased to 248.9 billion rupees from 222 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730208622000,
            "Source": "result"
        }
    ]
}