{
    "Symbol": "REDTAPE",
    "ISIN": "INE0LXT01019",
    "News": [
        {
            "Title": "REDTAPE Reports Strong Q3FY26 Results",
            "Summary": "REDTAPE Limited delivered robust Q3FY26 performance with revenue of ₹785.85 crore, up 18.70% YoY, and net profit of ₹105.72 crore, marking 42.74% growth despite ongoing IT search proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1770887428968,
            "Source": "co_actions_results"
        },
        {
            "Title": "Redtape shares drop 7% after promoter clarification",
            "Summary": "Redtape shares declined 7% following promoter clarification on stake monetisation reports. Company states no disclosure-worthy event occurred yet but continues exploring strategic opportunities.",
            "Sentiment": "negative",
            "PublishDate": 1768367452029,
            "Source": "co_actions_results"
        },
        {
            "Title": "Redtape Clarifies on Stake Sale Reports",
            "Summary": "Redtape Limited issues clarification stating no disclosable event has occurred regarding founders' stake sale reports, maintaining regulatory compliance under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768349752500,
            "Source": "stocks"
        },
        {
            "Title": "RedTape Clarifies No Stake Sale by Founders",
            "Summary": "RedTape officially clarifies that no announcement regarding stake sale has been made by the company's founders, addressing market speculation and ensuring transparency for investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768317116110,
            "Source": "stocks"
        },
        {
            "Title": "RedTape shares surge 16% on KKR, Blackstone stake talks",
            "Summary": "RedTape Limited shares jumped 16% after reports emerged that private equity giants KKR and Blackstone are evaluating proposals to acquire stake in the fashion retailer valued at $510 million.",
            "Sentiment": "positive",
            "PublishDate": 1768309923483,
            "Source": "co_actions_results"
        },
        {
            "Title": "RedTape founders seek stake sale to Blackstone, KKR",
            "Summary": "Indian footwear company RedTape's founding family explores selling majority or entire 71.8% stake worth up to $509 million to private equity giants Blackstone and KKR through Ernst & Young.",
            "Sentiment": "neutral",
            "PublishDate": 1768300098739,
            "Source": "co_actions_results"
        },
        {
            "Title": "RedTape Shares Surge 12% on Stake Sale Reports",
            "Summary": "RedTape shares jumped over 12% following Reuters report that founders are exploring stake sale, engaging with private equity giants Blackstone and KKR for potential transaction.",
            "Sentiment": "positive",
            "PublishDate": 1768298271236,
            "Source": "co_actions_results"
        },
        {
            "Title": "Redtape Co-Founders Approach Blackstone, KKR for Stake",
            "Summary": "Redtape co-founders have reached out to private equity giants Blackstone and KKR to gauge interest in acquiring their stake in the footwear company, according to Reuters reports.",
            "Sentiment": "neutral",
            "PublishDate": 1768297772075,
            "Source": "co_actions_results"
        },
        {
            "Title": "Redtape Founding Family Hires EY for Stake Sale",
            "Summary": "Redtape's founding family has appointed Ernst & Young as financial adviser for potential stake divestment in the footwear company, signaling possible ownership restructuring ahead.",
            "Sentiment": "neutral",
            "PublishDate": 1768297750682,
            "Source": "co_actions_results"
        },
        {
            "Title": "Redtape Founders Explore $509M Stake Sale",
            "Summary": "Redtape's founders are actively seeking potential buyers for a significant stake sale valued at up to $509 million, according to Reuters reports indicating major ownership restructuring plans.",
            "Sentiment": "neutral",
            "PublishDate": 1768297729313,
            "Source": "co_actions_results"
        },
        {
            "Title": "REDTAPE Promoter Completes 22.52% Stake Transfer",
            "Summary": "Rashid Ahmed Mirza successfully acquired 12.44 crore equity shares from wife Yasmin Mirza on December 22, 2025, increasing his holding from 13.29% to 35.81% through gift transfer under SEBI exemption.",
            "Sentiment": "neutral",
            "PublishDate": 1765801450400,
            "Source": "co_actions_results"
        },
        {
            "Title": "RedTape Limited Reports Q2 FY26 Results with 9.85% Growth in Consolidated PAT",
            "Summary": "RedTape Limited reported consolidated profit after tax of INR 27 crores for Q2 FY26, marking a 9.85% growth, with total standalone income at INR 501 crores and strengthened retail presence through 513 exclusive stores across 328 cities. The company maintained capital-light business model while expanding footprint in metro and emerging markets, with management expressing confidence about upcoming Q3 and Q4 performance driven by early Diwali and marriage season benefits.",
            "Sentiment": "positive",
            "PublishDate": 1763979035022,
            "Source": "earnings"
        },
        {
            "Title": "Red Tape Limited Reports Strong Q2 FY26 Growth with 19.54% Revenue Jump and Strategic Expansion",
            "Summary": "Red Tape Limited delivered robust quarterly results with standalone revenue rising 19.54% to ₹50,104 lakh and EBITDA growing 21.68% to ₹8,261 lakh, while expanding its retail footprint to 623 stores across 20 states. The footwear and lifestyle brand strengthened its market presence through strategic store additions, brand diversification including Ozark outdoor segment, and improved operational efficiency driving higher profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1763306630015,
            "Source": "earnings"
        },
        {
            "Title": "RedTape Reports Strong Q2 Growth with 18% Revenue Rise and 10% Profit Jump",
            "Summary": "RedTape posted robust quarterly results with net profit rising 10% to ₹27.5 crore and revenue growing 18% to ₹492 crore, driven by sustained demand across categories. Despite EBITDA margin compression to 14.8% from 15.5% due to higher costs, the strong financial performance led to positive market reaction with shares trading 1.5% higher.",
            "Sentiment": "positive",
            "PublishDate": 1763112711625,
            "Source": "earnings"
        },
        {
            "Title": "RedTape Limited Shareholders Approve Expansion of Business Scope Through Memorandum Amendment",
            "Summary": "RedTape Limited shareholders approved the alteration of the Main Object Clause in the Memorandum of Association at the 4th Annual General Meeting held on September 26, 2025. The change expands the company's operational scope to include business activities across multiple segments including beauty, fitness, personal healthcare, wellness products, electronics, and general merchandise. The company can now operate through various channels including franchisee agreements, e-commerce platforms, physical stores, and online portals both in India and abroad. The Board stated that the current Objects Clause was restrictively scoped and needed to be comprehensive to enable the company to pursue new projects and activities that can be advantageously combined with existing operations.",
            "Sentiment": "positive",
            "PublishDate": 1758988690240,
            "Source": "corporate_action"
        },
        {
            "Title": "Red Tape Shares Under Scrutiny as Income Tax Investigation Enters Third Day",
            "Summary": "Red Tape shares are expected to be in focus following an ongoing Income Tax Department investigation across six locations in Noida and Greater Noida, including the company's head office and Mirza International's corporate office. The investigation began Thursday with simultaneous raids conducted by teams from across the country under Kanpur Income Tax Department leadership. Officials have seized documents and digital data from computers, laptops, CCTV cameras, pen drives, and mobile phones, with specialized teams of chartered accountants, technical experts, and data analysts now conducting a detailed forensic audit. The investigation has reportedly uncovered evidence of undisclosed income worth several crores of rupees. Officials are examining WhatsApp chats, messages, transaction details, and previously deleted data recovered through digital forensic procedures. Red Tape shares closed flat at Rs 138.40 on BSE on Friday.",
            "Sentiment": "negative",
            "PublishDate": 1757905231706,
            "Source": "stock"
        },
        {
            "Title": "REDTAPE Limited Board Approves Business Expansion Through Memorandum Amendment",
            "Summary": "REDTAPE Limited's Board of Directors approved alterations to the company's Memorandum of Association on August 28, 2025, expanding business activities by adding Sub-clause 5 to the main Object Clause. The amendment enables the company to engage in diverse business operations including e-commerce, manufacturing, trading, and distribution of various products ranging from electronics to wellness and beauty products through multiple channels including online portals, franchises, and physical stores. The changes require shareholder approval at the upcoming Annual General Meeting. The Board also updated its list of Key Managerial Personnel authorized to determine materiality of events for stock exchange disclosures, following the redesignation of Chief Financial Officer Mr. Abhinav Jain. The authorized personnel include Managing Director Mr. Shuja Mirza, Whole-time Director Mr. Arvind Verma, Chief Financial Officer Mr. Vivek Agnihotri, and Company Secretary Mr. Akhilendra Bahadur Singh.",
            "Sentiment": "positive",
            "PublishDate": 1756364777311,
            "Source": "corporate_action"
        },
        {
            "Title": "REDTAPE Limited Announces Q1 Results and CFO Leadership Changes",
            "Summary": "REDTAPE Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹363.06 crores and consolidated revenue of ₹365.31 crores for the quarter. Standalone profit after tax was ₹39.31 crores while consolidated profit after tax reached ₹37.62 crores. The company made key leadership changes with Mr. Vivek Agnihotri appointed as Chief Financial Officer and Key Managerial Personnel effective August 14, 2025. Mr. Abhinav Jain was re-designated from CFO to Vice President - Finance. Mr. Agnihotri brings over 18 years of corporate experience, having previously worked with companies including Mawana Sugars Limited, KRBL Limited, and Mirza International Limited before joining REDTAPE Limited.",
            "Sentiment": "positive",
            "PublishDate": 1755177091393,
            "Source": "earnings"
        },
        {
            "Title": "REDTAPE Limited Approves Quarterly Financial Results for June 2025",
            "Summary": "REDTAPE Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs 36,306 lakhs and consolidated revenue of Rs 36,831 lakhs for the quarter. Standalone profit for the period was Rs 3,931 lakhs while consolidated profit was Rs 3,762 lakhs. The company's main business involves retailing and trading of merchandise, primarily apparels and footwear. REDTAPE had previously issued bonus equity shares in February 2025 at a ratio of 3:1, increasing paid-up capital to Rs 110.56 crores from Rs 27.63 crores. The results were reviewed by the Audit Committee and will be published in newspapers and on the company website.",
            "Sentiment": "neutral",
            "PublishDate": 1755175113984,
            "Source": "earnings"
        },
        {
            "Title": "REDTAPE Limited Corrects Consolidated Financial Results, Net Profit Decreases by Rs. 24 Lakhs",
            "Summary": "REDTAPE Limited submitted a modification to its consolidated financial results for the fourth quarter and year ended March 31, 2025, due to clerical and typographical errors. The correction resulted in a net decrease of Rs. 24 lakhs in net profit after tax. The company's standalone financial statements remain unaffected by this error. REDTAPE has resubmitted the modified XBRL file to BSE Limited and National Stock Exchange of India Limited. The statutory auditors' opinion from Ashwani & Associates remains unchanged and unmodified. The company described the modification as immaterial but disclosed it to maintain corporate governance standards.",
            "Sentiment": "neutral",
            "PublishDate": 1755104647359,
            "Source": "stock"
        },
        {
            "Title": "REDTAPE Reports Improved Q4 EBITDA and Margin",
            "Summary": "REDTAPE has announced its Q4 financial results. The company's EBITDA for the quarter increased to 813 million rupees, up from 747 million rupees in the same quarter of the previous year. The EBITDA margin also improved, rising to 16.09% from 14.75% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748360644000,
            "Source": "result"
        },
        {
            "Title": "REDTAPE Reports Q4 Financial Results",
            "Summary": "REDTAPE has announced its Q4 consolidated net profit of 415 million rupees, compared to 410 million rupees year-over-year and 731 million rupees quarter-over-quarter. The company's Q4 revenue stood at 5.05 billion rupees, slightly down from 5.1 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748360566000,
            "Source": "result"
        },
        {
            "Title": "REDTAPE Launches New Online Warehouse in Ludhiana",
            "Summary": "REDTAPE has announced the commencement of commercial operations at its newly established online warehouse and operations set-up located in Ludhiana. This development signifies an expansion of the company's e-commerce capabilities and logistics infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1746105870000,
            "Source": "default"
        },
        {
            "Title": "REDTAPE Reports Q3 Revenue Increase",
            "Summary": "REDTAPE announced its third-quarter revenue of 6.6 billion rupees, showing an increase from 6.17 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739347454000,
            "Source": "earnings"
        },
        {
            "Title": "REDTAPE Reports Improved Q3 EBITDA and Margin",
            "Summary": "REDTAPE has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.28 billion rupees from 1.04 billion rupees in the same quarter last year. Additionally, REDTAPE's EBITDA margin expanded to 19.37% from 16.84% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739347445000,
            "Source": "earnings"
        },
        {
            "Title": "REDTAPE Reports Increase in Q3 Consolidated Net Profit",
            "Summary": "REDTAPE has announced its financial results for the third quarter, reporting a consolidated net profit of 731 million rupees. This represents an increase from the 608 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739347327000,
            "Source": "earnings"
        },
        {
            "Title": "RedTape: 3:1 Bonus Share Issue Record Date Set for February 4, 2025",
            "Summary": "RedTape has announced a 3:1 bonus share issue with the record date set for February 4, 2025. The allotment of bonus shares is scheduled for February 5. This is the company's first-ever bonus issue, which will increase the paid-up equity share capital from Rs 27.64 crore to Rs 110.56 crore.",
            "Sentiment": "positive",
            "PublishDate": 1738549776000,
            "Source": "corporate_action"
        },
        {
            "Title": "REDTAPE Approves Interim Dividend of 2 Rupees Per Share",
            "Summary": "REDTAPE has announced the approval of an interim dividend of 2 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1735201131000,
            "Source": "corporate_action"
        },
        {
            "Title": "REDTAPE Announces 3:1 Bonus Share Issue",
            "Summary": "The board of REDTAPE has approved a bonus share issue in the ratio of 3:1, meaning shareholders will receive three additional shares for every one share held.",
            "Sentiment": "positive",
            "PublishDate": 1735201130000,
            "Source": "corporate_action"
        },
        {
            "Title": "Redtape Schedules Board Meeting to Consider Bonus Share Issue",
            "Summary": "Redtape has announced a board meeting scheduled for December 26 to discuss and potentially approve a proposal for issuing bonus equity shares to the company's existing equity shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1734912734000,
            "Source": "corporate_action"
        },
        {
            "Title": "REDTAPE to Consider Bonus Share Issue",
            "Summary": "REDTAPE has announced a board meeting scheduled for December 26 to discuss and potentially approve a proposal for issuing bonus equity shares to the company's existing equity shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1734696326000,
            "Source": "corporate_action"
        },
        {
            "Title": "REDTAPE Reports Q2 EBITDA Growth",
            "Summary": "REDTAPE has announced its Q2 financial results. The company's EBITDA increased to 640.7 million rupees, up from 576 million rupees in the same quarter last year. However, the EBITDA margin decreased to 15.41% from 17.75% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731491161000,
            "Source": "result"
        },
        {
            "Title": "REDTAPE Reports Q2 Financial Results",
            "Summary": "REDTAPE announced its Q2 financial results. The company's consolidated net profit decreased to 250 million rupees from 277 million rupees year-over-year. However, revenue increased to 4.2 billion rupees from 3.25 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731491058000,
            "Source": "result"
        },
        {
            "Title": "Redtape: Stock Hits Record High, Surges 49% in 2 Months",
            "Summary": "<p>Redtape's stock reached a <span class='positive'>record high</span> of Rs 910, <span class='positive'>rising 9% intraday</span> and <span class='positive'>49% over two months</span>. The company plans to <span class='positive'>open 100 new retail outlets</span> across India, focusing on South India expansion. <b>CRISIL</b> revised its outlook to <span class='positive'>'Positive'</span> from 'Stable' on Redtape's long-term bank facilities, citing <span class='positive'>wide market reach</span> and <span class='positive'>adaptation to market trends</span>. The company's revenue <span class='positive'>grew 26% YoY</span> to Rs 1,843 crore in fiscal 2024.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728884366000,
            "Source": "normal_news"
        }
    ]
}