{
    "Symbol": "REFEX",
    "ISIN": "INE056I01025",
    "News": [
        {
            "Title": "Refex Industries Discloses Share Encumbrance Details",
            "Summary": "Refex Industries submits updated disclosure under SEBI regulations for share encumbrance by promoter Refex Holding Private Limited, addressing BSE compliance requirements with complete lender and trustee details.",
            "Sentiment": "neutral",
            "PublishDate": 1770095471068,
            "Source": "stocks"
        },
        {
            "Title": "Refex Industries Q3 FY26 Strong Sequential Recovery",
            "Summary": "Refex Industries reported strong Q3 FY26 recovery with revenue rising 38% sequentially to Rs.583 crores. Company exits low-margin businesses while strengthening core ash handling operations.",
            "Sentiment": "positive",
            "PublishDate": 1769512152585,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Plans to Cut Promoter Pledging",
            "Summary": "Refex Industries announces plans to substantially reduce promoter pledged shares from current 25-26% levels over the next six months, signaling improved financial position.",
            "Sentiment": "positive",
            "PublishDate": 1769050145640,
            "Source": "stocks"
        },
        {
            "Title": "Refex Industries Projects 11-12% EBITDA Margin",
            "Summary": "Refex Industries management provides guidance on sustainable EBITDA margin expectations of 11-12% for standalone operations during recent conference call discussions.",
            "Sentiment": "positive",
            "PublishDate": 1769050115703,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Plans Green Mobility Demerger by April",
            "Summary": "Refex Industries announces completion of Refex Green Mobility Limited demerger by end of April during recent conference call guidance update.",
            "Sentiment": "neutral",
            "PublishDate": 1769050086948,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Wind Business to Drive FY26 Revenue",
            "Summary": "Refex Industries expects substantial revenue from wind business by FY26 end, with deliveries starting February 15th according to management guidance shared during concall.",
            "Sentiment": "positive",
            "PublishDate": 1769050061962,
            "Source": "stocks"
        },
        {
            "Title": "Refex Industries Reports Strong Order Book Growth",
            "Summary": "Refex Industries management expects continued operational momentum in ash and coal handling business with order book of ₹1,500.00 crores driving future growth prospects.",
            "Sentiment": "positive",
            "PublishDate": 1769050032419,
            "Source": "stocks"
        },
        {
            "Title": "Refex Industries Grants 46,809 ESOPs to Employees",
            "Summary": "Refex Industries Limited approved grant of 46,809 employee stock options under its ESOP 2021 scheme with exercise prices of ₹170 for time-based and ₹121 for performance-based options.",
            "Sentiment": "positive",
            "PublishDate": 1768974546096,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Q3 Net Profit Rises 15.3% YoY",
            "Summary": "Refex Industries reported a net profit of ₹68.00 crores in Q3, marking a 15.3% year-on-year increase from ₹59.00 crores in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768971431268,
            "Source": "co_actions_results"
        },
        {
            "Title": "Catalyst Trusteeship pledges 45L Refex shares",
            "Summary": "Catalyst Trusteeship Limited disclosed pledging 45.20 lakh additional shares of Refex Industries, increasing total encumbered shares to 1.74 crore, representing 12.73% of total share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1768969460864,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Board Meet on Jan 21 for Q3FY26 Results",
            "Summary": "Refex Industries has scheduled its Board of Directors meeting for January 21, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-results publication.",
            "Sentiment": "neutral",
            "PublishDate": 1768571656859,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Gets Credit Rating Reaffirmation",
            "Summary": "Acuité Ratings reaffirmed Refex Industries' credit ratings with ACUITE A- (Stable) for ₹165 cr long-term facilities and ACUITE A2+ for ₹135 cr short-term facilities, totaling ₹300 cr bank loan facilities.",
            "Sentiment": "positive",
            "PublishDate": 1767956108316,
            "Source": "stocks"
        },
        {
            "Title": "Refex Industries Wins ₹34.61 Cr NHAI Contract",
            "Summary": "Refex Industries secures major order worth ₹34.61 crores from NHAI for excavation, loading, and transportation of pond ash for road projects with 4-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767851097937,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Wins ₹43.74 Cr NHAI Contract",
            "Summary": "Refex Industries secured a ₹43.74 crore order for transporting pond ash to NHAI road projects with a 4-month execution timeline from a large business conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1767776553002,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Unit Wins 148 MW Wind Turbine Contract",
            "Summary": "Refex Industries subsidiary VRPL secures contract to supply 148 MW wind turbine generators for wind power projects with leading independent power producer in Tamil Nadu.",
            "Sentiment": "positive",
            "PublishDate": 1766071201845,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Wins ₹27.50 Cr NHAI Contract",
            "Summary": "Refex Industries secures major transportation contract worth ₹27.50 crores from a Major Power Producer (PSU) for pond ash transport in NHAI road projects, with formal disclosure filed under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1765943911479,
            "Source": "co_actions_results"
        },
        {
            "Title": "Refex Industries Receives ₹35.29 Lakh CGST Demand",
            "Summary": "Refex Industries receives CGST demand order of ₹35.29 lakh for FY2021-22 related to alleged RCM liability shortfall. Company plans to appeal, citing no material financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1765883281346,
            "Source": "stocks"
        },
        {
            "Title": "Refex Industries Gets ESG Rating of 70 from NSE",
            "Summary": "Refex Industries receives ESG score of 70 for FY2025 from NSE Sustainability Ratings, up from 69 in FY2024, with ratings across Environment (61), Social (77), and Governance (73) pillars.",
            "Sentiment": "positive",
            "PublishDate": 1765798386607,
            "Source": "stocks"
        },
        {
            "Title": "Refex Industries clarifies volume movement to BSE",
            "Summary": "Refex Industries responds to BSE inquiry on volume movement, stating no undisclosed price-sensitive information and attributing market activity to external factors beyond company control.",
            "Sentiment": "neutral",
            "PublishDate": 1765788265373,
            "Source": "stocks"
        },
        {
            "Title": "Refex Industries IT Search Operations Concluded",
            "Summary": "Refex Industries announces completion of Income Tax Department search operations that began December 9, 2025. Company reports full cooperation with authorities and no adverse findings communicated.",
            "Sentiment": "neutral",
            "PublishDate": 1765700751087,
            "Source": "stocks"
        },
        {
            "Title": "Refex Industries' Subsidiary Gets MNRE Approval as Wind Turbine Manufacturer",
            "Summary": "Refex Industries' subsidiary Venwind Refex Power Limited has been listed among approved wind turbine manufacturers by the Ministry of New and Renewable Energy (MNRE), with operations at a facility in Silvassa, Gujarat. This approval represents a significant advancement for the company in the wind energy sector and strengthens its position in India's renewable energy manufacturing landscape.",
            "Sentiment": "positive",
            "PublishDate": 1764668814107,
            "Source": "stock"
        },
        {
            "Title": "Refex Industries Secures ₹31 Crore Order with 5-Month Execution Timeline",
            "Summary": "Refex Industries has received a ₹31 crore order that is scheduled to be completed within 5 months. The order represents a significant business development for the company with a defined execution timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1764572487373,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Wins INR 32.89 Crore NHAI Contract for Pond Ash Transportation",
            "Summary": "Refex Industries has secured a contract worth INR 32.89 crore from NHAI to transport pond ash for road construction projects. The company is required to complete the transportation work within a 5-month timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1764402096671,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Receives ₹10.07 Crore CGST Demand Order for Alleged Input Tax Credit Violations",
            "Summary": "Refex Industries Limited received a demand order from CGST Raipur Commissionerate for ₹10,06,91,418 covering FY2018-19 and FY2019-20, alleging inadmissible Input Tax Credit availment during April 2018 to March 2020. The company believes the demand is not maintainable and plans to file an appeal, stating the order has no material impact on its financials or operations.",
            "Sentiment": "negative",
            "PublishDate": 1764331687108,
            "Source": "stock"
        },
        {
            "Title": "Refex Industries Secures Rs 1 Billion Order",
            "Summary": "Refex Industries has received an order worth Rs 1 billion. This significant order win represents a substantial business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1764288383896,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Secures Contract for Pond Ash Excavation and Transportation Services",
            "Summary": "Refex Industries Limited has secured a domestic contract for excavation, loading and transportation of pond ash/bottom ash services. The contract is valued at approximately Rs 100 crore and involves no related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1764244990676,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Establishes New Subsidiary Venwind Refex Projects Limited",
            "Summary": "Refex Industries has announced the formation of a new subsidiary company named Venwind Refex Projects Limited. The establishment of this subsidiary represents a corporate restructuring or expansion move by Refex Industries into new business operations.",
            "Sentiment": "positive",
            "PublishDate": 1764082101210,
            "Source": "corporate_action"
        },
        {
            "Title": "Refex Industries Subsidiary Acquires Engineering Firm for ₹1 Lakh",
            "Summary": "Venwind Refex Power Limited, a subsidiary of Refex Industries Limited, is acquiring 100% equity shareholding in Refex Engineering Products Private Limited for ₹1,00,000 in cash consideration. The acquisition of the construction-focused company will make REPPL a step-down subsidiary and aims to consolidate wind energy and ancillary business operations for enhanced integration and operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1763699944454,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Allots 2.74 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Refex Industries Limited allotted 2,73,925 equity shares of ₹2 face value each to eligible employees under its Employee Stock Option Scheme 2021, raising ₹1.12 crore from the exercise. The allotment increased the company's paid-up equity share capital from ₹27.37 crore to ₹27.43 crore, with shares priced at ₹20.40 and ₹95.00 per share across different tranches.",
            "Sentiment": "positive",
            "PublishDate": 1763639733412,
            "Source": "corporate_action"
        },
        {
            "Title": "Refex Industries Appoints Gautam Jain as Sr. Vice President - Investor Relations",
            "Summary": "Refex Industries Limited's Board of Directors approved the appointment of Mr. Gautam Jain as Sr. Vice President - Investor Relations in the Senior Managerial Personnel category, effective November 17, 2025. Jain brings approximately 20 years of experience across investor relations, corporate strategy, and communications, with expertise in fund-raising initiatives, analyst management, and institutional investor interactions.",
            "Sentiment": "positive",
            "PublishDate": 1763379484442,
            "Source": "corporate_governance"
        },
        {
            "Title": "Refex Industries Secures INR 65 Crore Transportation Contract from State GENCO",
            "Summary": "Refex Industries Limited has bagged a domestic order worth INR 65 crores for transportation of pond/fly ash to NHAI Road Project from a prominent State GENCO. The contract involves supply and services for transportation of pond/fly ash as part of infrastructure development activities.",
            "Sentiment": "positive",
            "PublishDate": 1763102945208,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Secures Transportation Contract for NHAI Road Project",
            "Summary": "Refex Industries Limited has secured an order for transportation of ash for an NHAI Road Project from a Maharashtra-based entity. The contract is valued at INR 29.12 crores and involves domestic operations. The company confirmed that promoters and group companies have no interest in the entity that awarded the contract, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1763027231310,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Submits Monitoring Agency Reports for Preferential Issue Fund Utilization",
            "Summary": "Refex Industries Limited submitted monitoring agency reports from CARE Ratings Limited for the quarter ended September 30, 2025, covering two preferential issues. The first issue involved 50,00,000 equity shares and 1,25,75,000 warrants totaling Rs. 219.69 crores, with the company receiving 100% of equity share proceeds (Rs. 62.50 crores) and 54.82% of warrant proceeds (Rs. 86.18 crores). The second issue comprised 81,77,068 equity shares and 1,11,70,000 warrants worth Rs. 905.44 crores, with 100% of equity proceeds received (Rs. 382.69 crores) and 25% of warrant proceeds (Rs. 130.68 crores). Funds were allocated across working capital, capital expenditure, subsidiary investments, loan repayments, and general corporate purposes. The monitoring agency reported no deviation from stated objectives, though promoter share pledge increased from 10.37% in Q1FY26 to 30.19% in Q2FY26. Some loan repayments were completed 50 days after the stipulated three-month timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1762999629713,
            "Source": "stock"
        },
        {
            "Title": "Refex Industries Q2 FY2026: Revenue Grows 15% to INR 431 Crores, EBITDA Nearly Doubles",
            "Summary": "Refex Industries reported total income of INR 431 crores for Q2 FY2026, marking a 15% sequential growth driven by ash and coal handling operations. EBITDA nearly doubled to INR 74 crores from the previous quarter, with net profit at INR 52 crores. The company maintains an order book of approximately INR 1,200 crores in coal and ash handling services. Management reported margins of 10-12% for the quarter due to better product mix, with typical margins expected to remain in the 8-11% range. The company is progressing with demerger plans for its mobility vertical into a separate listed entity called Refex Mobility Limited, expected to take 6-7 months. Wind turbine manufacturing revenue is anticipated to begin in Q3 and Q4, with majority revenue expected in Q4. The company has completely wound down its power trading operations and targets 60-65% growth in daily ash handling capacity over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1762905469326,
            "Source": "earnings"
        },
        {
            "Title": "Refex Industries Secures INR 30.12 Crore Transportation Contract from Major Power Producer",
            "Summary": "Refex Industries Limited has secured an order worth INR 30.12 crores for transportation of pond ash from a Major Power Producer (Public Sector Undertaking) to NHAI Road Projects. The contract involves domestic transportation services and falls under the company's supply and services scope. The company has confirmed that promoters, promoter groups, or group companies have no interest in the entity that awarded the contract, and the transaction does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1762527175457,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Reports Strong Q2 Results with 5,208.75 Lakh Net Profit, Discontinues Power Trading Segment",
            "Summary": "Refex Industries Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported revenue from operations of 42,321.46 lakh and net profit of 5,208.75 lakh from continuing operations. The Board approved discontinuation of the Power Trading business segment, which has been classified as discontinued operations. The company also discontinued its Green Mobility segment during the quarter. A draft composite scheme of amalgamation and arrangement involving Refex Green Mobility Limited, Refex Industries Limited, and Refex Mobility Limited was approved by the Board. The company incorporated a wholly-owned subsidiary, Refex Mobility Limited, in September 2025. The results were reviewed by the Audit Committee and approved by the Board at their meeting held on November 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762257214546,
            "Source": "earnings"
        },
        {
            "Title": "Refex Industries Reports 39% Jump in Q2 Net Profit Despite Revenue Decline",
            "Summary": "Refex Industries reported a net profit of 520 million rupees in Q2, representing a 39% increase from 373 million rupees in the same period last year. However, revenue declined to 4.2 billion rupees from 4.3 billion rupees year-over-year. The company's EBITDA surged 72% to 738 million rupees compared to 429 million rupees previously, while EBITDA margin expanded significantly to 17.44% from 10.02% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762256361350,
            "Source": "earnings"
        },
        {
            "Title": "Refex Industries Secures INR 300 Crore Coal Mining Contract in Jharkhand",
            "Summary": "Refex Industries Limited has secured a contract worth INR 300 crore from a large mining entity in Jharkhand for removal of overburden, excavation and transportation of coal. The domestic contract has a duration of 8 months with a potential extension of 4 years. The company confirmed that promoters have no interest in the entity awarding the contract and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1761296982311,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Renewables Sells 74% Stake in Flaunt Solar Energy for ₹74,000",
            "Summary": "Refex Renewables is selling a 74% stake in Flaunt Solar Energy for ₹74,000 at face value. The company will retain a major financial interest in Flaunt Solar Energy through Optionally Convertible Debentures (OCDs).",
            "Sentiment": "neutral",
            "PublishDate": 1760440491081,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Secures ₹475 Crore Order",
            "Summary": "Refex Industries has secured an order valued at ₹475 crores.",
            "Sentiment": "positive",
            "PublishDate": 1758702886249,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Approves Composite Scheme for Merger and Demerger of Green Mobility Business",
            "Summary": "Refex Industries Limited's Board of Directors approved a composite scheme involving the merger of wholly-owned subsidiary Refex Green Mobility Limited into Refex Industries, followed by demerging the Green Mobility Business into Refex Mobility Limited. The scheme aims to create separate focused entities, with Refex Industries continuing its Ash & Coal handling business while the Green Mobility Business operates independently. Refex Green Mobility reported turnover of Rs. 2,897.62 Lakhs and net worth of Rs. 6,840.04 Lakhs as of March 31, 2025, representing 1.18% of Refex Industries' post-merger turnover. The demerger will follow a 1:1 share exchange ratio, with Refex Mobility Limited seeking listing on BSE and NSE. The scheme requires approvals from NCLT, shareholders, creditors, and other regulatory authorities.",
            "Sentiment": "positive",
            "PublishDate": 1758545893682,
            "Source": "corporate_action"
        },
        {
            "Title": "Refex Industries Incorporates Wholly Owned Subsidiary Refex Mobility Limited for Urban Transportation Solutions",
            "Summary": "Refex Industries Limited has incorporated a new wholly owned subsidiary named Refex Mobility Limited on September 12, 2025, with approval from the Ministry of Corporate Affairs. The subsidiary has been established with a subscribed capital of ₹1,00,000, comprising 10,000 fully paid-up equity shares of ₹10 each. Refex Mobility Limited will operate in the mobility business sector, focusing on sustainable urban transportation and energy solutions including passenger services, logistics, sales, leasing, and servicing using electric or other vehicles. The company also plans to develop software and infrastructure solutions. As a newly incorporated entity, the subsidiary has not yet commenced business operations and has no turnover. The incorporation represents Refex Industries' expansion into the mobility sector beyond its main line of business.",
            "Sentiment": "positive",
            "PublishDate": 1757685330359,
            "Source": "corporate_action"
        },
        {
            "Title": "Refex Industries Secures ₹25 Crore Order",
            "Summary": "Refex Industries has secured an order worth ₹25 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756794253302,
            "Source": "order&deals"
        },
        {
            "Title": "Refex Industries Secures INR 47 Crore Pond Ash Transportation Order",
            "Summary": "Refex Industries Limited has secured a one-year contract worth approximately INR 47 crore for transportation of pond ash from a Maharashtra-based company. The domestic order involves scope of supply and services for pond ash transportation. The company published its unaudited financial results for the first quarter ended June 30, 2025, in Business Standard and Dinamani newspapers. The results were approved by the Board of Directors on August 12, 2025, and submitted to BSE and NSE on the same day. The order does not involve any promoter group interest or related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1755084132656,
            "Source": "earnings"
        },
        {
            "Title": "Refex Industries Reports 36% Revenue Decline to ₹395 Cr in Q1 FY26 Due to Monsoon Impact",
            "Summary": "Refex Industries Limited reported consolidated revenue of ₹394.51 crores for Q1 FY26, down from ₹597.21 crores in Q1 FY25. Despite the revenue decline, EBITDA margin improved to 9.80% from 8.14% in the previous year, while net profit dropped to ₹20.37 crores from ₹29.35 crores. The Ash & Coal Handling business contributed ₹347.08 crores to revenue, followed by Green Mobility at ₹17.24 crores and Refrigerant Gas at ₹14.15 crores. Chairman Anil Jain attributed the performance decline to unusually early and intense monsoon conditions with record rainfall that temporarily slowed operations in the Ash & Coal Handling business. The company maintained margins through cost control and operational efficiency. Management expects recovery in coming quarters as monsoon impacts subside and new contracts commence.",
            "Sentiment": "negative",
            "PublishDate": 1755060800720,
            "Source": "earnings"
        },
        {
            "Title": "Refex Industries Reports Q1 FY2026 Results, Declares 25% Interim Dividend and Discontinues Power Trading Business",
            "Summary": "Refex Industries Limited announced its unaudited financial results for Q1 FY2026 ended June 30, 2025. On standalone basis, the company reported revenue from operations of ₹36,525.55 lakhs and net profit of ₹3,314.26 lakhs from continuing operations. The Board declared a 25% interim dividend (₹0.50 per equity share of ₹2 face value) payable by September 11, 2025, with August 19, 2025 as record date. The company appointed nine senior managerial personnel across various functions including HR, finance, legal, and technology. Refex approved discontinuation of its power trading business segment due to compressed margins, high compliance costs, and limited strategic fit with core operations. The power trading segment contributed ₹10,899.87 lakhs (4.48% of turnover) in the last financial year. The business closure is expected by March 31, 2026. The company's authorized share capital was increased from ₹40 crore to ₹100 crore following shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755002400606,
            "Source": "earnings"
        },
        {
            "Title": "Refex Industries Increases Stake in Venwind Refex Power",
            "Summary": "Refex Industries has increased its ownership stake in Venwind Refex Power. The announcement indicates a strategic move by the company to boost its position in the power sector entity.",
            "Sentiment": "positive",
            "PublishDate": 1754920911874,
            "Source": "stock"
        },
        {
            "Title": "Refex Industries Rebrands eVeelz Division as Refex Mobility, Appoints Anirudh Arun as CEO",
            "Summary": "Refex Industries announced the rebranding of its 'Refex eVeelz' division to 'Refex Mobility' and appointed Anirudh Arun as CEO of Refex Green Mobility Limited, a wholly owned subsidiary. The company has grown from 24 company-owned EVs in March 2023 to operating nearly 1,400 EVs, providing B2B and B2B2C mobility solutions to corporates and institutions. The rebranding includes a new company logo, modern app icon, and new vehicle decals under the promise 'Refex = Reliable Fleet. Exceptional Experience.' Ankit Grover has been appointed as Chief Business Officer to drive revenue growth through enterprise partnerships. The leadership team also includes Sasi A as CTO, Meet Goradia as COO, and Sachin Navtosh Jha as Chief of Staff to the Group MD. The company focuses on delivering safe, reliable, and sustainable transportation solutions through electric vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1754899696151,
            "Source": "corporate_governance"
        },
        {
            "Title": "Refex Industries Promoter Pledges 10% Equity Shares to Touchstone Trust Scheme VI",
            "Summary": "Catalyst Trusteeship Limited disclosed that Refex Holding Private Limited, the Promoter-cum-Managing Director of Refex Industries Limited, has pledged 1,29,28,061 equity shares representing 10% of the company's paid-up equity capital. The pledge was created for the benefit of debenture holder Touchstone Trust Scheme VI, acting through Investment Manager Touchstone Capital Limited. The pledge agreement was executed on July 30, 2025, with shares pledged on August 1, 2025. This represents 8.57% of the total diluted share capital. Refex Industries has total equity capital of 12,92,80,607 shares with face value of INR 2 each, and total diluted share capital of 15,08,87,143 shares. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754395127792,
            "Source": "corporate_action"
        },
        {
            "Title": "Refex Industries Secures ₹50 Crore Order From NTPC",
            "Summary": "Refex Industries has received a ₹50 crore order from NTPC. The announcement indicates a significant business development for the company involving the state-owned power generation utility.",
            "Sentiment": "positive",
            "PublishDate": 1754120548931,
            "Source": "order&deals"
        }
    ]
}