{
    "Symbol": "REGAAL",
    "ISIN": "INE0MHO01029",
    "News": [
        {
            "Title": "Regaal Resources Receives ROC Penalty Order",
            "Summary": "Regaal Resources Limited received adjudication order from ROC Kolkata imposing penalties of Rs 1.15 lakh on company and Rs 1.59 lakh on officers for violations under Companies Act 2013.",
            "Sentiment": "negative",
            "PublishDate": 1770817770344,
            "Source": "stocks"
        },
        {
            "Title": "Regaal Resources Receives ROC Show Cause Notice",
            "Summary": "Regaal Resources Limited disclosed receiving a show cause notice from ROC Kolkata for compliance violations including committee constitution delays and allotment irregularities, with potential penalties of Rs 22 lakh for the company and Rs 12 lakh for officers.",
            "Sentiment": "negative",
            "PublishDate": 1770746737289,
            "Source": "stocks"
        },
        {
            "Title": "Regaal Resources Q3FY26 Revenue Rises 25.55% YoY",
            "Summary": "Regaal Resources reported Q3FY26 revenue of Rs. 3,229.70 million, up 25.55% YoY. Net profit stood at Rs. 132.46 million despite exceptional item of Rs. 66.57 million related to SGST subsidy reversal.",
            "Sentiment": "positive",
            "PublishDate": 1770717453156,
            "Source": "co_actions_results"
        },
        {
            "Title": "Regaal Resources Makes ₹8.9M Tax Payment Post-DGGI Search",
            "Summary": "Regaal Resources underwent a DGGI search operation but faced no orders or penalties. The company made a voluntary tax payment of ₹8.9 million following the investigation.",
            "Sentiment": "neutral",
            "PublishDate": 1768349825043,
            "Source": "stocks"
        },
        {
            "Title": "Regaal Resources faces DGGI search, pays ₹88.72L",
            "Summary": "Regaal Resources Limited disclosed that DGGI conducted a search operation at its principal place of business from January 10-12, 2026. The company voluntarily paid ₹88.72 lakh including tax and penalty.",
            "Sentiment": "negative",
            "PublishDate": 1768315607900,
            "Source": "stocks"
        },
        {
            "Title": "REGAAL Resources Faces DGGI Search Operations",
            "Summary": "REGAAL Resources reports that the Directorate General of GST Intelligence conducted search operations at company locations without imposing any fines during the proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1768227076186,
            "Source": "stocks"
        },
        {
            "Title": "Regaal Resources faces DGGI search operation",
            "Summary": "Regaal Resources Limited disclosed that DGGI conducted search operations at its Bihar premises on January 10-11, 2026, under GST Act provisions. One stock register was seized, but no orders or demands have been passed.",
            "Sentiment": "negative",
            "PublishDate": 1768226874844,
            "Source": "stocks"
        },
        {
            "Title": "Regaal Resources faces ₹2.17 cr GST demand order",
            "Summary": "Regaal Resources receives GST demand order of ₹2.17 crores from Bihar authorities for FY22, including tax liability, interest and penalties. Company reviewing demand.",
            "Sentiment": "negative",
            "PublishDate": 1767362354107,
            "Source": "stocks"
        },
        {
            "Title": "Regaal Resources Reports Complete Utilization of Rs 204.23 Crore IPO Proceeds",
            "Summary": "Regaal Resources Limited has utilized Rs 204.23 crore out of Rs 209.99 crore raised through its IPO, according to CARE Ratings' monitoring report for the quarter ended September 30, 2025. The company deployed Rs 158.10 crore for loan repayments and prepayments, Rs 24.83 crore for general corporate purposes including capex and administrative expenses, and Rs 21.30 crore for IPO-related expenses. The IPO was conducted from August 12-14, 2025, with Rs 2.70 crore remaining unutilized in the monitoring account. CARE Ratings noted no deviations from the stated objectives, though highlighted that the company obtained Board approval for fund utilization quantification on September 9, 2025, after payments had commenced on August 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762988754946,
            "Source": "corporate_action"
        },
        {
            "Title": "Regaal Resources Reports Strong Q2 Performance with 71% Profit Growth",
            "Summary": "Regaal Resources Limited announced its quarterly results for the quarter and six months ended September 30, 2025. The company reported a profit of ₹214.79 million for the quarter, representing a 71% increase from ₹125.79 million in the same quarter last year. For the six-month period, profit reached ₹343.81 million compared to ₹297.38 million in the previous year. Total income for the quarter stood at ₹2,202.77 million versus ₹1,856.26 million in the prior year quarter. The company, primarily engaged in manufacturing maize starch and its derivatives and trading of maize, completed its IPO in August 2025, raising ₹2,099.99 million through fresh issue of shares and ₹960.02 million through offer for sale. Earnings per share increased to ₹1.88 for the quarter from ₹1.10 in the previous year. The Board of Directors approved these unaudited standalone financial results in their meeting held on November 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762960174554,
            "Source": "earnings"
        },
        {
            "Title": "Regaal Resources Gets Credit Rating Upgrade to CRISIL A- with Enhanced Bank Facilities",
            "Summary": "CRISIL Ratings upgraded Regaal Resources Limited's long-term rating to CRISIL A-/Stable from CRISIL BBB+/Positive, while enhancing total bank loan facilities to Rs. 625.57 crore from Rs. 385 crore. The upgrade reflects healthy growth in operating performance with revenue of Rs. 247 crore in the first quarter of fiscal 2026 and Rs. 915 crore in fiscal 2025, driven by strong volumetric growth and capacity utilization. The company operates in maize starch extraction with established market position and is expanding capacity by 825 tonnes per day, bringing total capacity to 1,650 tonnes per day operational from April 2026. Operating margins improved to 12.38% in fiscal 2025 from previous volatility due to maize price fluctuations. The company is also adding value-added products including liquid glucose, maltodextrin powder, and dextrose variants. Capital structure remains comfortable with Rs. 243 crore networth as of March 2025, further strengthened by IPO funding of Rs. 210 crore. Key risks include susceptibility to raw material price volatility and moderate risks from ongoing capex of Rs. 450 crore over fiscals 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1762609209040,
            "Source": "corporate_action"
        },
        {
            "Title": "Regaal Resources Plans to Double Crushing Capacity and Expand Product Portfolio",
            "Summary": "Regaal Resources announced plans to double its crushing capacity from 825 TPD by June 2025 to 1,650 TPD by the end of Q4 FY26. The company also plans to introduce new products including maltodextrin, liquid glucose, DAH, and DMH as part of its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1757424921802,
            "Source": "stock"
        },
        {
            "Title": "Regaal Resources Appoints Uirtus Advisors as Investor Relations Advisor",
            "Summary": "Regaal Resources Limited has appointed Uirtus Advisors LLP, based in Kolkata, as their Investor Relations Advisor. The appointment became effective from September 01, 2025. The company informed stock exchanges NSE and BSE about this corporate development through a formal communication signed by Company Secretary and Compliance Officer Tinku Kumar Gupta.",
            "Sentiment": "neutral",
            "PublishDate": 1757415349535,
            "Source": "stock"
        },
        {
            "Title": "Regaal Resources Reports Quarterly Results with Revenue of Rs 2,465.69 Million",
            "Summary": "Regaal Resources Limited approved its unaudited standalone financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 2,465.69 million and profit of Rs 90.67 million for the quarter. Total expenses stood at Rs 2,347.64 million. The company completed its IPO of 29,999,520 equity shares at Rs 102 per share after the quarter ended, with shares listing on NSE and BSE on August 20, 2025. The IPO comprised a fresh issue of Rs 2,088.83 million and offer for sale of Rs 960.02 million. Regaal Resources is primarily engaged in manufacturing maize starch and its derivatives. Basic earnings per share was Rs 1.10 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1757409762975,
            "Source": "earnings"
        },
        {
            "Title": "Regaal Resources Reports Mixed Q1 Results with EBITDA Growth but Lower Margins",
            "Summary": "Regaal Resources reported Q1 net profit of 91 million rupees, down from 92 million rupees in the same period last year. The company's EBITDA increased to 245 million rupees from 239 million rupees year-over-year. However, EBITDA margin declined to 9.9% compared to 12.3% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1757409355153,
            "Source": "earnings"
        },
        {
            "Title": "Regaal Resources Appoints Tinku Kumar Gupta as Company Secretary & Compliance Officer",
            "Summary": "Regaal Resources Limited appointed Mr. Tinku Kumar Gupta as Company Secretary & Compliance Officer effective July 23, 2024. Gupta holds a Master's degree in Commerce from University of Calcutta and is an associate member of the Institute of Company Secretaries of India. He is responsible for secretarial and compliance functions at the company. The appointment aligns with regulatory requirements following the company's share listing on stock exchanges on August 20, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756128356267,
            "Source": "corporate_governance"
        }
    ]
}