{
    "Symbol": "RELAXO",
    "ISIN": "INE131B01039",
    "News": [
        {
            "Title": "Relaxo Footwears cancels 2,200 stock options",
            "Summary": "Relaxo Footwears Limited cancelled 2,200 vested but unexercised stock options from one employee under its 2014 ESOP plan after the prescribed exercise period lapsed.",
            "Sentiment": "neutral",
            "PublishDate": 1769776791670,
            "Source": "co_actions_results"
        },
        {
            "Title": "Relaxo Footwears Q3FY26 Results Show Mixed Performance",
            "Summary": "Relaxo Footwears reports marginal revenue growth of 0.17% YoY to ₹668.03 crore in Q3FY26, but faces margin pressure with EBITDA declining 16.79% and PAT dropping 19.60% compared to previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1769775245879,
            "Source": "co_actions_results"
        },
        {
            "Title": "Relaxo Footwears Reports 7.5% Revenue Decline in Q2 FY26 Amid GST Transition Challenges",
            "Summary": "Relaxo Footwears' revenue dropped to INR 629 crores in Q2 FY26 from INR 679 crores in Q2 FY25, primarily due to demand softness and delayed purchases ahead of GST 2.0 implementation which reduced tax rates on footwear below INR 2,500 from 12% to 5%. The company maintained stable EBITDA margins at 12.9% and improved PAT margins to 5.8%, with management expecting gradual recovery from Q4 FY26 as channel inventory normalizes and the new GST framework enhances competitiveness against unorganized players.",
            "Sentiment": "neutral",
            "PublishDate": 1763555998262,
            "Source": "earnings"
        },
        {
            "Title": "Relaxo Footwears Outlines Growth Strategy Focused on Premium Segments and Operational Efficiency",
            "Summary": "Relaxo Footwears has outlined its growth strategy centered on premium and sportswear segments while expanding its retail network across India and e-commerce sales. The company plans to improve product mix and invest in automation and supply chain efficiency to maintain double-digit volume growth.",
            "Sentiment": "neutral",
            "PublishDate": 1763056127471,
            "Source": "earnings"
        },
        {
            "Title": "Relaxo Footwears' Company Secretary Ankit Jain Withdraws Resignation, Continues in Role",
            "Summary": "Relaxo Footwears Limited announced that Mr. Ankit Jain has withdrawn his resignation as Company Secretary & Compliance Officer on August 13, 2025. Jain had originally submitted his resignation on June 20, 2025, which was scheduled to take effect on August 19, 2025. Following discussions with the Board, VP-HR, and Management, Jain formally withdrew his resignation. The Board of Directors approved his reinstatement based on the Nomination and Remuneration Committee's recommendation. Jain will continue in his position as Company Secretary & Compliance Officer and remain as Key Managerial Personnel and Senior Management Personnel without any break in service.",
            "Sentiment": "positive",
            "PublishDate": 1755101112721,
            "Source": "corporate_governance"
        },
        {
            "Title": "Relaxo Footwears Reports 15% Decline in Net Profit to ₹170 Crores for FY25",
            "Summary": "Relaxo Footwears Limited reported a net profit of ₹170.33 crores for FY2024-25, down from ₹200.47 crores in the previous year. Revenue from operations declined 4.3% to ₹2,789.61 crores compared to ₹2,914.06 crores in FY24. EBITDA decreased to ₹382 crores from ₹406.59 crores. The company sold 17.75 crore pairs of footwear during the year. The Board recommended a final dividend of ₹3 per equity share (300%). The company cited challenging macroeconomic conditions, weak consumer sentiment, and muted discretionary spending as factors affecting performance. Despite challenges, Relaxo launched over 275 new designs and onboarded 70,000+ retailers through its 'Relaxo Parivaar' App platform.",
            "Sentiment": "negative",
            "PublishDate": 1754308661427,
            "Source": "earnings"
        },
        {
            "Title": "Relaxo Footwear Focuses on Margin Recovery Strategy Despite Weak Demand",
            "Summary": "Relaxo Footwear is implementing a margin-driven recovery strategy while facing demand softness in the market. The company is focusing on three key areas for long-term scalable growth: leveraging brand resilience, strengthening retail operations, and improving cost efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1753887491593,
            "Source": "stock"
        },
        {
            "Title": "Relaxo Footwears Company Secretary Ankit Jain Resigns, Effective August 19, 2025",
            "Summary": "Ankit Jain has resigned from his position as Company Secretary and Compliance Officer at Relaxo Footwears Limited. He submitted his resignation letter on June 20, 2025, with the resignation taking effect from the close of business hours on August 19, 2025. Jain cited personal and professional aspirations as the reason for his decision and confirmed there are no other material reasons for his departure. As a Key Managerial Personnel and Senior Management Personnel, his resignation affects the company's compliance and secretarial functions. The company disclosed this information on July 30, 2025, at 15:40 Hours IST.",
            "Sentiment": "neutral",
            "PublishDate": 1753880855942,
            "Source": "corporate_governance"
        },
        {
            "Title": "Relaxo Footwears Restructures Senior Management Hierarchy, Four Executives No Longer Classified as SMPs",
            "Summary": "Relaxo Footwears announced changes to its Senior Management Personnel classification due to internal restructuring of reporting hierarchy. Four executives will no longer be classified as SMPs: Mr. Rakesh Singh Gautam (Vice President - Human Resource), Mr. Supriyam Vatsa (Sr. GM - Finance), Mr. Amit Roy (Sr. GM - Finance), and Mr. Ajay Kumar Agarwal (GM - Finance). The executives will continue their employment with the company under the new reporting structure. The change took effect at the closure of business hours on July 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753879152213,
            "Source": "corporate_governance"
        },
        {
            "Title": "Relaxo Footwears Reports Mixed Q1 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Relaxo Footwears announced its Q1 financial results showing net profit increased to 489 million rupees from 444 million rupees year-over-year. However, revenue declined to 6.55 billion rupees compared to 7.48 billion rupees in the same period last year. The company's EBITDA remained relatively stable at 995 million rupees versus 990 million rupees year-over-year, while EBITDA margin improved to 15.2% from 13.22% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753876552564,
            "Source": "earnings"
        },
        {
            "Title": "Relaxo Footwears Schedules Board Meeting on July 30, 2025 to Approve Quarterly Financial Results",
            "Summary": "Relaxo Footwears Limited has scheduled a Board of Directors meeting on July 30, 2025 to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The company also announced that the trading window for designated persons and their immediate relatives will remain closed until August 1, 2025, continuing from an earlier intimation dated June 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753101822909,
            "Source": "corporate_action"
        },
        {
            "Title": "Relaxo Footwears: Distribution System Revamp Amid Short-Term Challenges",
            "Summary": "Relaxo Footwears is revamping its distribution system, including optimizing the 'Relaxo Parivaar' app to streamline operations. Despite current volume declines, the company expects the system to stabilize in 2-3 quarters with positive results thereafter.",
            "Sentiment": "neutral",
            "PublishDate": 1747113700000,
            "Source": "corporate_action"
        },
        {
            "Title": "Relaxo Footwear Reports Challenges in Mid-Range Segment and Distribution Restructuring",
            "Summary": "Relaxo Footwear experienced a decline in topline performance due to weak demand in the mid-range footwear segment. The company is also undergoing an internal restructuring of its distribution model. These strategic interventions are aimed at strengthening the business and improving agility.",
            "Sentiment": "neutral",
            "PublishDate": 1746856364000,
            "Source": "default"
        },
        {
            "Title": "Relaxo Footwears Recommends Dividend of 3 Rupees per Share",
            "Summary": "Relaxo Footwears has announced a recommendation for a dividend of 3 rupees per equity share. This corporate action represents a return of value to shareholders and may be subject to approval at the company's upcoming general meeting.",
            "Sentiment": "positive",
            "PublishDate": 1746796307000,
            "Source": "result"
        },
        {
            "Title": "Relaxo Footwears Q4 Results: Revenue and Profit Decline",
            "Summary": "Relaxo Footwears reported its Q4 financial results. EBITDA decreased to 1.12B rupees from 1.2B rupees year-over-year, while EBITDA margin slightly improved to 16.12% from 16.11%. Net profit fell to 562M rupees from 614M rupees year-over-year, but increased from 330M rupees quarter-over-quarter. Revenue declined to 6.95B rupees from 7.47B rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1746792306000,
            "Source": "result"
        },
        {
            "Title": "Relaxo Footwears Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Relaxo Footwears has reported a decrease in its third-quarter EBITDA, which fell to 780 million rupees from 868 million rupees in the same period last year. The company's EBITDA margin also declined to 11.69% from 12.20% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738326123000,
            "Source": "earnings"
        },
        {
            "Title": "Relaxo Footwears Reports Decline in Q3 Net Profit and Revenue",
            "Summary": "Relaxo Footwears has reported its Q3 financial results. The company's net profit decreased to 330 million rupees, down from 386 million rupees year-over-year and 367 million rupees quarter-over-quarter. Revenue also declined to 6.7 billion rupees from 7.13 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738326075000,
            "Source": "earnings"
        },
        {
            "Title": "Relaxo Footwears Ltd: Block Trade of 500,371 Shares on NSE",
            "Summary": "A significant block trade of approximately 500,371 shares of Relaxo Footwears Ltd occurred on the National Stock Exchange (NSE). The total value of the transaction was Rs. 34.18 crores, with each share priced at Rs. 683.05.",
            "Sentiment": "neutral",
            "PublishDate": 1733200339000,
            "Source": "block_deals"
        },
        {
            "Title": "Relaxo Footwear Block Trade on NSE",
            "Summary": "A block trade of approximately 907,667 shares of Relaxo Footwear occurred on the National Stock Exchange (NSE) at a price of Rs 680 per share, amounting to a total transaction value of Rs 61.72 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1733133647000,
            "Source": "block_deals"
        },
        {
            "Title": "Relaxo Footwears Q2 EBITDA Slightly Down, Margin Improves",
            "Summary": "Relaxo Footwears reported Q2 EBITDA of 876.6 million rupees, down from 915 million rupees in the same quarter last year. However, the EBITDA margin improved to 12.90% from 12.79% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731069706000,
            "Source": "result"
        },
        {
            "Title": "Relaxo Footwears Reports Q2 Revenue Decline",
            "Summary": "Relaxo Footwears, an Indian footwear company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 6.8 billion rupees, down from 7.15 billion rupees in the same quarter of the previous year, indicating a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731069694000,
            "Source": "result"
        },
        {
            "Title": "Relaxo Footwears Reports Q2 Net Profit Decline",
            "Summary": "Relaxo Footwears has reported a net profit of 367 million rupees for the second quarter, down from 442 million rupees in the same period last year. However, it shows an improvement from the previous quarter's 443.7 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731069667000,
            "Source": "result"
        }
    ]
}