{
    "Symbol": "RELCHEMQ",
    "ISIN": "INE750D01016",
    "News": [
        {
            "Title": "Reliance Chemotex Appoints Brahm Swaroop Sharma as President",
            "Summary": "Reliance Chemotex Industries Limited announces appointment of Mr. Brahm Swaroop Sharma as President and Senior Management Personnel, effective February 11, 2026, bringing 30 years of textile industry experience.",
            "Sentiment": "positive",
            "PublishDate": 1770795519647,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Chemotex VP HR&IR Resigns Effective Feb 7",
            "Summary": "Reliance Chemotex Industries Limited announces resignation of Vice President HR&IR effective February 7, 2026, citing personal circumstances after serving since December 2021.",
            "Sentiment": "neutral",
            "PublishDate": 1770662687119,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Chemotex Board Meet on Feb 11 for Q3FY26",
            "Summary": "Reliance Chemotex Industries has scheduled its board meeting for February 11, 2026, to consider Q3FY26 unaudited financial results. Trading window closed till February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770372959092,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Chemotex Industries Seeks Reclassification of Promoter to Public Shareholder",
            "Summary": "Reliance Chemotex Industries Limited has applied to BSE and NSE for approval to reclassify Mr. Nand Gopal Khaitan from Promoter/Promoter Group category to Public shareholders category. The application was submitted on November 18, 2025, under SEBI LODR Regulations 2015 for removal from the Promoter/Promoter Group list.",
            "Sentiment": "neutral",
            "PublishDate": 1763467344213,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Chemotex Industries Reports Q2 Results and Approves Promoter Reclassification",
            "Summary": "Reliance Chemotex Industries approved unaudited financial results for the quarter ended September 30, 2025, showing net profit of Rs 165.28 lacs compared to Rs 142.43 lacs in the same quarter last year. The Board also approved the reclassification of Mr. Nand Gopal Khaitan from Promoter/Promoter Group to Public Shareholder category, citing his lack of control over company affairs and professional capacity appointment as Director.",
            "Sentiment": "positive",
            "PublishDate": 1763104845027,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Chemotex Industries Receives Promoter Reclassification Request from Nand Gopal Khaitan",
            "Summary": "Reliance Chemotex Industries Limited received a request from promoter Nand Gopal Khaitan seeking reclassification from promoter/promoter group category to public category shareholder. Khaitan holds 100 shares in the company and states he never had control over company affairs either directly or indirectly. He was appointed as director in his professional capacity as a lawyer and senior partner of Khaitan & Co. law firm. Khaitan confirms he and related persons do not hold more than 10% of total voting rights, do not exercise control over company affairs, have no special rights, are not represented on the board of directors, and are not key managerial persons. The company will place this request before its Board of Directors in the upcoming board meeting and will inform stock exchanges of the outcome in compliance with applicable regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762905668831,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Chemotex Industries Appoints New Audit Committee Member",
            "Summary": "Reliance Chemotex Industries Limited announced changes to its Board committee composition. The company appointed Mr. Ameya Shroff (DIN: 05315616) as a member of the Audit Committee, replacing Mr. Nand Khaitan Gopal (DIN: 00020588). The changes were approved by the Board of Directors through circulation and became effective from November 4, 2025. Following the reconstitution, the Audit Committee now comprises Mr. Ram Niwas Sharma (Independent Director) as Chairman, Mrs. Sruthy Sreerag Nath (Independent Director) as Member, and Mr. Ameya Shroff (Whole-time Director) as Member.",
            "Sentiment": "neutral",
            "PublishDate": 1762305099239,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Chemotex Industries President Hari Mohan Vashishth Resigns",
            "Summary": "Reliance Chemotex Industries Limited announced the resignation of Mr. Hari Mohan Vashishth, President and Senior Management Personnel. His resignation was tendered and accepted on October 30, 2025, with his duties ending from the closing business hours of the same day. The company has informed stock exchanges BSE and NSE about this senior management change.",
            "Sentiment": "neutral",
            "PublishDate": 1761851687101,
            "Source": "corporate_governance"
        },
        {
            "Title": "Nand Gopal Khaitan Resigns from Reliance Chemotex Board Over Promoter Misclassification",
            "Summary": "Nand Gopal Khaitan has resigned from his position as Non-Executive Non-Independent Director of Reliance Chemotex. He cited misclassification as a promoter despite holding only 100 shares in the company and lacking control over company matters as the reason for his resignation.",
            "Sentiment": "negative",
            "PublishDate": 1760170147558,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Chemotex Industries Completes 47th AGM, Reappoints Key Directors",
            "Summary": "Reliance Chemotex Industries Ltd. held its 47th Annual General Meeting on September 26, 2025, where shareholders approved all business items. The meeting resulted in the re-appointment of Mr. Rahul Shroff as Director liable to retire by rotation, and Mr. Nand Khaitan as Non-Executive & Non-Independent Director. Additionally, Mr. Ameya Shroff was re-appointed as Whole-time Director for a 3-year term from August 01, 2025 to July 31, 2028. Mr. Rahul Shroff, an MIT alumnus, joined the company in 2008 and has focused on streamlining manufacturing processes and diversifying into industrial and medical textile markets. Mr. Nand Khaitan brings over four decades of experience in corporate law and arbitration. Mr. Ameya Shroff, also an MIT graduate, joined in 2013 and has revamped the company's administrative framework and domestic marketing strategies. Both Rahul and Ameya Shroff are sons of Managing Director Mr. Sanjiv Shroff.",
            "Sentiment": "positive",
            "PublishDate": 1758889958951,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Chemotex Industries Approves Audited Financial Results for Quarter and Year Ended March 31, 2025",
            "Summary": "Reliance Chemotex Industries Ltd. Board of Directors approved the company's audited financial results for the quarter and financial year ended March 31, 2025, along with Statement of Assets and Liabilities and Cash Flow Statement. The board meeting was held on May 30, 2025, via video conferencing from 12:37 PM to 12:55 PM. Chief Financial Officer Chandrasekaran Rajagopalan certified that the auditor's report contains an unmodified opinion regarding the financial results. The company will publish an extract of the results in newspapers and upload the full results on its website. Trading window for designated persons and their immediate relatives will remain closed until June 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757077821933,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Chemotex Industries Reports 42.8% Revenue Growth in Q1 FY2026",
            "Summary": "Reliance Chemotex Industries Limited, a synthetic blended yarn manufacturer based in Udaipur, Rajasthan, reported strong financial performance for Q1 FY2026. Total income increased 42.8% year-on-year to ₹92.75 crore from ₹64.93 crore in the previous year. Net profit rose 15.2% to ₹1.06 crore compared to ₹0.92 crore in Q1 FY2025. EBITDA showed significant growth of 180.9% reaching ₹8.51 crore versus ₹3.03 crore in the prior year period. Earnings per share (both basic and diluted) improved to ₹1.41 from ₹1.22. The unaudited results were approved by the Board of Directors on August 14, 2025, and prepared in accordance with Indian Accounting Standards.",
            "Sentiment": "positive",
            "PublishDate": 1755502493788,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Chemotex Industries Reports Net Profit of Rs 106.33 Lakh for Quarter Ended June 30, 2025",
            "Summary": "Reliance Chemotex Industries Ltd. approved unaudited financial results for the quarter ended June 30, 2025. The company reported total income of Rs 9,275.42 lakh, comprising revenue from operations of Rs 9,236.37 lakh and other income of Rs 39.05 lakh. Total expenses stood at Rs 9,179.91 lakh, resulting in a profit before tax of Rs 95.51 lakh. After accounting for tax expenses, the company achieved a net profit of Rs 106.33 lakh for the quarter, compared to Rs 58.76 lakh in the corresponding quarter of the previous year. The company operates primarily in the yarns business segment. The trading window for insiders remains closed until August 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755156967926,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Chemotex Industries Approves Re-appointment of Executive Director and Continuation of Non-Executive Director",
            "Summary": "Reliance Chemotex Industries' board approved the re-appointment of Mr. Ameya Shroff as whole-time director designated as executive director for a further period of 3 years, effective from August 1, 2025 to July 31, 2028. The board also approved the continuation of Mr. Nand Gopal Khaitan as Non-Executive Non-Independent Director post attaining the age of 75 years, which he will reach on May 21, 2026. Both appointments are subject to shareholder approval. Mr. Ameya Shroff is an MIT alumnus who joined the company in 2013 and has focused on enterprise resource planning, inventory management and domestic marketing. He is the son of Managing Director Mr. Sanjiv Shroff and brother of Executive Director Mr. Rahul Shroff. Mr. Nand Gopal Khaitan is described as a highly respected legal professional with over four decades of experience in corporate law, commercial litigation, and arbitration.",
            "Sentiment": "positive",
            "PublishDate": 1753943813903,
            "Source": "corporate_governance"
        }
    ]
}