{
    "Symbol": "RELIGARE",
    "ISIN": "INE621H01010",
    "News": [
        {
            "Title": "Religare Enterprises schedules Q3FY26 earnings call",
            "Summary": "Religare Enterprises Limited announces earnings call for February 16, 2026, to discuss Q3 and 9M FY26 operational and financial performance under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770734329708,
            "Source": "co_actions_results"
        },
        {
            "Title": "Religare Clarifies MoneyControl Report on Care Health",
            "Summary": "Religare Enterprises addresses MoneyControl report regarding Care Health Insurance demerger, stating no significant events or hidden information exist, with no ongoing regulatory issues.",
            "Sentiment": "neutral",
            "PublishDate": 1770138891088,
            "Source": "stocks"
        },
        {
            "Title": "Religare Allots 150,000 Shares Under ESOP Plan",
            "Summary": "Religare Enterprises allotted 150,000 equity shares under its ESOP Plan 2019, increasing paid-up capital to Rs. 3,32,89,04,790 divided into 33,28,90,479 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1770037011345,
            "Source": "co_actions_results"
        },
        {
            "Title": "Religare's Care Health Insurance Gets Rating Upgrade",
            "Summary": "India Ratings upgrades Care Health Insurance Limited, a material subsidiary of Religare Enterprises, to IND AA-/Stable credit rating, reflecting improved financial strength and business profile.",
            "Sentiment": "positive",
            "PublishDate": 1769755616529,
            "Source": "stocks"
        },
        {
            "Title": "Religare Appoints New Non-Executive Chairperson",
            "Summary": "Religare Enterprises announces appointment of Suresh Mahalingam as Non-Executive Chairperson for Q4 FY26, continuing rotational leadership structure established in February 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767358280821,
            "Source": "stocks"
        },
        {
            "Title": "Religare Unit Faces ₹1 Crore IRDAI Penalty",
            "Summary": "Care Health Insurance, Religare Enterprises' material subsidiary, received a ₹1 crore penalty from IRDAI for violations found during August-September 2021 inspection period.",
            "Sentiment": "negative",
            "PublishDate": 1765891277597,
            "Source": "stocks"
        },
        {
            "Title": "Religare Enterprises Clarifies Significant Volume Movement in Shares",
            "Summary": "Religare Enterprises Limited responded to BSE's inquiry regarding significant movement in share volume, confirming no pending price-sensitive information or announcements that could have caused the increase. The company stated the volume and price movements are purely market-driven and assured compliance with all disclosure obligations under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765353239898,
            "Source": "stock"
        },
        {
            "Title": "Religare Enterprises Raises ₹35 Crores Through Equity Share Issuance",
            "Summary": "Religare Enterprises Ltd issued 19,85,816 equity shares at ₹235 per share (₹10 face value plus ₹225 premium), raising ₹35 crores in total funds. The equity share capital of the company has increased to ₹332.74 crores following this share issuance.",
            "Sentiment": "positive",
            "PublishDate": 1764932028731,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare Enterprises Outlines Growth Strategy Across Business Segments",
            "Summary": "Religare Enterprises targets industry-plus growth for its broking business while planning no price hikes for Care Health Insurance in the current quarter. The company aims for exponential rise in housing finance over the next two years and emphasized focusing on strengthening businesses before considering strategic initiatives like IPOs or demergers.",
            "Sentiment": "positive",
            "PublishDate": 1763217630532,
            "Source": "stock"
        },
        {
            "Title": "Religare Enterprises Reports Q2 FY26 Results Across Healthcare, Broking and Financial Services Portfolio",
            "Summary": "Religare Enterprises Limited presented quarterly results for the period ended September 30, 2025, showcasing performance across its subsidiaries including Care Health Insurance (Rs. 5,104 Cr GWP), Religare Broking (2.5 lakh active clients), and Religare Finvest (CRAR 197.6%). The company completed a Rs. 1,500 crore preferential issue from promoter group and marquee investors, with RBI lifting the Corrective Action Plan on Religare Finvest in July 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763061611555,
            "Source": "earnings"
        },
        {
            "Title": "Religare Enterprises Appoints New CFO and Four Directors in Board Restructuring",
            "Summary": "Religare Enterprises confirmed Pratul Gupta as CFO from interim position and appointed Babu Rao P. as Group Chief Compliance Officer, while adding four new non-executive directors including Dr. Anand Chand Burman and Mohit Burman from Dabur Group, pending RBI approval. The appointments strengthen the company's leadership team with experienced professionals from consumer goods, finance, and legal sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763057979203,
            "Source": "corporate_governance"
        },
        {
            "Title": "Religare Enterprises Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Religare Enterprises reported Q2 revenue growth to 20.6B rupees from 19.5B rupees year-over-year, while consolidated net profit declined to 388M rupees from 513M rupees. EBITDA dropped to 609M rupees from 759M rupees with margin compression to 2.95% from 3.9% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1763047929641,
            "Source": "earnings"
        },
        {
            "Title": "Religare Enterprises Grants 5.73 Lakh Stock Options to Employees",
            "Summary": "Religare Enterprises Limited granted 5,73,174 stock options to eligible employees under its Employee Stock Option Plan 2019. The Nomination and Remuneration Committee approved the grant on November 13, 2025. Each stock option can be converted into one equity share with a face value of Rs. 10 at an exercise price of Rs. 261.70 per share. The options will vest over five years with 20% vesting each year starting from the first year. Employees can exercise these options within eight years from the vesting date. The scheme has been approved by the Board of Directors and shareholders in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763027908603,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare Enterprises Appoints Two Senior Management Personnel",
            "Summary": "Religare Enterprises Limited's Board of Directors approved the appointment of two Senior Management Personnel through a circular resolution on October 31, 2025. Mr. Babu Rao P has been appointed as Group General Counsel with an expected joining date of November 3, 2025, and a term until November 2030. Mr. Indranil Choudhury has been appointed as Group Chief Human Resource Officer with an expected joining date of November 10, 2025, with a term until superannuation age. Mr. Rao brings over 26 years of experience in corporate, banking finance, and capital markets, having previously served at Bajaj Finance Ltd. and Citibank. Mr. Choudhury has over 26 years of experience and previously worked as Group Head-HR ESG at UTI Asset Management Company Ltd. and at HDFC Life Insurance Company Limited.",
            "Sentiment": "positive",
            "PublishDate": 1761927482138,
            "Source": "corporate_governance"
        },
        {
            "Title": "Care Health Insurance Valued at ₹16,000-17,500 Crores; Religare Holds 62.8% Stake",
            "Summary": "Care Health Insurance has been valued between ₹16,000 and ₹17,500 crores. Religare Enterprises holds a 62.8% stake in Care Health Insurance and has a current market capitalization of ₹8,760 crores. Religare allocated rights shares at ₹149 each in September.",
            "Sentiment": "neutral",
            "PublishDate": 1760339652391,
            "Source": "stock"
        },
        {
            "Title": "Religare Enterprises Plans to List Care Health Insurance Subsidiary",
            "Summary": "Religare Enterprises has announced plans to list its subsidiary Care Health Insurance on stock exchanges. The company is moving forward with taking its health insurance arm public through a stock market listing.",
            "Sentiment": "positive",
            "PublishDate": 1760337644178,
            "Source": "stock"
        },
        {
            "Title": "ED Files Chargesheet Against Rashmi Saluja in Rs 179.5 Crore ESOP Scam",
            "Summary": "The Enforcement Directorate has filed a chargesheet against Rashmi Saluja, executive chairperson of Religare Enterprises Ltd, alleging her role as the principal architect in a Rs 179.5 crore Employee Stock Ownership Plan scam. The chargesheet also names Nitin Aggarwal, Nishant Singhal, Pratap Venugopal and Vaibhav Gawli as co-accused. The case originated from Mumbai police investigations into a separate FIR, during which Gawli revealed he was paid Rs 2 lakh to purchase REL shares and file complaints against the Burman family at Saluja's behest. The ED alleges the conspiracy aimed to obstruct the Burman family's takeover of REL to maintain control and secure illegal ESOP benefits. Saluja allegedly misused her authority by approving ESOPs for herself and co-accused in violation of company policy. The ED has frozen shares of CHIL, a REL subsidiary, obtained through these ESOPs and estimates the proceeds of crime at Rs 179.54 crore.",
            "Sentiment": "negative",
            "PublishDate": 1759948124796,
            "Source": "corporate_governance"
        },
        {
            "Title": "Four Companies Acquire Stakes in Religare Enterprises Through Preferential Allotment",
            "Summary": "M.B. Finmart Private Limited, Puran Associates Private Limited, VIC Enterprises Private Limited, and Milky Investment & Trading Company have acquired shareholdings in Religare Enterprises Limited through preferential allotment. The companies collectively hold 29.68% of total shares after the acquisition. The transaction involved 11,914,892 warrants issued at Rs. 235 per warrant on September 12, 2025, convertible into equal number of equity shares within 18 months. Post-acquisition, M.B. Finmart holds 7.10%, Milky Investment holds 4.43%, Puran Associates holds 10.20%, and VIC Enterprises holds 7.95% of the company. All four companies are classified as promoter entities and the authorized signatory for all entities is Abhay Kumar Agarwal.",
            "Sentiment": "neutral",
            "PublishDate": 1757941836317,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare Enterprises Raises INR 1,500 Crore Through Preferential Warrant Allotment",
            "Summary": "Religare Enterprises Limited has allotted 6,38,29,782 convertible warrants at INR 235 per warrant to raise up to INR 1,499.99 crore through preferential allotment. The warrants were issued to 11 investors including both promoter entities (M.B. Finmart Private Limited, Puran Associates Private Limited, Milky Investment and Trading Company, VIC Enterprises Private Limited) and non-promoter entities (JM Financial Credit Solutions Limited, Niralee Properties LLP, individual investors, and The Hindustan Times Limited). Each warrant can be converted into one equity share within 18 months from the allotment date. The company has received INR 375 crore, representing 25% of the total consideration, with the remaining 75% payable upon conversion. The warrants do not carry dividend or voting rights until conversion. The allotment was approved following shareholder approval at an Extraordinary General Meeting held on August 08, 2025, and in-principle approvals from NSE and BSE dated September 02, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757688124582,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare Enterprises Receives Stock Exchange Approval for ₹1,500 Crore Preferential Warrants Issue",
            "Summary": "Religare Enterprises has secured in-principle approval from both NSE and BSE for issuing preferential warrants worth ₹1,500 crore. This approval allows the company to proceed with the warrant issuance process on both major stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1756907329686,
            "Source": "corporate_action"
        },
        {
            "Title": "Care Health Insurance Wins GST Appeal, Rs 21.24 Lakh Tax Liability Set Aside",
            "Summary": "Care Health Insurance Limited, a subsidiary of Religare Enterprises Limited, successfully won an appeal against a GST order. The Office of the Commissioner of GST & Central Excise (Appeals - I) set aside the original order dated August 7, 2024, which had imposed a tax liability of Rs 21,24,804 along with a penalty of Rs 2,16,340. The Appellant Authority granted all consequential reliefs through its order dated August 19, 2025. Care Health Insurance's financials are consolidated with Religare Enterprises Limited.",
            "Sentiment": "positive",
            "PublishDate": 1755875053743,
            "Source": "stock"
        },
        {
            "Title": "Religare Enterprises Revises Lock-in Period for Warrants Following Stock Exchange Discussions",
            "Summary": "Religare Enterprises Limited has revised the lock-in period for warrants and resultant equity shares issued through a preferential allotment, aligning it with SEBI ICDR Regulations in response to stock exchange discussions. The company is issuing up to 6,38,29,782 warrants, each convertible into one fully paid-up equity share with a face value of Rs. 10. The preferential issue was approved by the Board of Directors on July 11, 2025, and by shareholders at an Extraordinary General Meeting on August 08, 2025. The warrants and resultant equity shares will now be subject to lock-in periods as per Chapter V of the SEBI ICDR Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755668981633,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare's Subsidiary RHDFCL Withdraws Credit Rating for ₹100 Crore NCD Issue",
            "Summary": "Religare Enterprises' step-down subsidiary RHDFCL has withdrawn the credit rating for its proposed ₹100 crore non-convertible debentures (NCDs). The rating was withdrawn by Infomerics following the company's request, as no debentures were issued under the proposal.",
            "Sentiment": "neutral",
            "PublishDate": 1755610562358,
            "Source": "stock"
        },
        {
            "Title": "Religare Enterprises Publishes Quarterly Financial Results in Newspapers",
            "Summary": "Religare Enterprises Limited published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025 in national newspapers including Financial Express (English) and Jansatta (Hindi) dated August 14, 2025. The results were approved by the Board of Directors in a meeting held on August 12, 2025 and were published on the stock exchange the same day. The company communicated this publication to NSE and BSE as per regulatory requirements under SEBI Listing Obligations and Disclosure Requirements Regulations, 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1755187409130,
            "Source": "earnings"
        },
        {
            "Title": "Religare Enterprises Reports Q1 FY2026 Results and Key Board Appointments",
            "Summary": "Religare Enterprises Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported a standalone net loss of Rs. 614.83 lakhs compared to Rs. 1,584.31 lakhs in the same quarter last year. On a consolidated basis, the company posted a net profit of Rs. 817.27 lakhs versus Rs. 2,681.20 lakhs in the previous year. The Board also approved the continuation of M/s J C Bhalla & Company as statutory auditors for financial years 2025-26 and 2026-27, appointed M/s PI & Associates as secretarial auditors for five years, and named Mr. Pratul Gupta as Interim Chief Financial Officer. Additionally, the company approved letters of assurance worth Rs. 10 lakhs each to two non-operational subsidiaries for working capital requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1755017652642,
            "Source": "earnings"
        },
        {
            "Title": "Religare Enterprises Conducts EGM for Warrant Issuance via Preferential Allotment",
            "Summary": "Religare Enterprises Limited held its Extra Ordinary General Meeting on August 08, 2025 at 12:00 noon through video conferencing. The meeting was chaired by Mr. Malay Kumar Sinha, Independent Director & Non-Executive Chairperson, with eight directors in attendance including Mr. Praveen Kumar Tripathi, Ms. Preeti Madan, Mr. Ranjan Dwivedi, Mr. Rajender Mohan Malla, Mr. Arjun Lamba, Mr. Gurumurthy Ramanathan, and Mr. Suresh Mahalingam. The primary business transacted was a special resolution regarding the issuance of warrants convertible into equity shares by way of preferential allotment on a private placement basis. The company provided remote e-voting facilities through KFin Technologies Limited, with members able to vote during the meeting if they hadn't voted remotely. Mr. Ankush Agarwal from MAKS & CO. was appointed as scrutinizer for the voting process. The meeting concluded at 12:36 p.m. after a 15-minute e-voting window for attendees. Voting results and the scrutinizer's report will be submitted within two working days and communicated to stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1754670939262,
            "Source": "corporate_action"
        },
        {
            "Title": "Delhi High Court Quashes Fraud Classification of Religare Finvest by 14 Banks",
            "Summary": "The Delhi High Court has quashed the fraud classification of Religare Finvest Limited's account by 14 banks including Central Bank of India, Bank of Baroda, Punjab National Bank, Axis Bank, and others. The court ruled on July 22, 2025, that RFL was not given an opportunity to be heard before the fraud classification, violating principles of natural justice. The court directed all respondent banks to remove the fraud classification from RBI's Central Fraud Registry within two weeks. RFL had challenged the classification through a writ petition, arguing that they received No Dues Certificates from all lenders and that the classification was made without proper hearing. Central Bank of India had already removed the fraud tag in August 2024 during the petition proceedings. The court relied on Supreme Court precedent requiring personal hearings before fraud classification under RBI Master Directions.",
            "Sentiment": "positive",
            "PublishDate": 1754147132581,
            "Source": "stock"
        },
        {
            "Title": "Religare Enterprises Issues Corrigendum for EGM on INR 1,500 Crore Preferential Warrant Issue",
            "Summary": "Religare Enterprises Limited has issued a corrigendum and addendum to its Extraordinary General Meeting notice scheduled for August 8, 2025. The amendments follow observations from NSE dated July 23, 2025, requiring additional details for the company's preferential issue of convertible warrants. The company plans to raise INR 1,500 crores through the issuance of 63,829,782 warrants at INR 235 per warrant. The proceeds will be allocated as follows: INR 600 crores for Care Health Insurance Limited, INR 200 crores for Religare Broking Limited, INR 250 crores for Religare Housing Development Finance Corporation Limited, INR 75 crores for debt repayment, and INR 375 crores for general corporate purposes. Each warrant converts into one equity share, with 25% payment due at allotment and 75% upon conversion. The warrants must be exercised within 18 months of allotment. Post-conversion, promoter shareholding would increase from 25.83% to 29.74%. The funds are expected to be utilized within 12 months of receipt, with a permitted deviation of +/- 10% for each object.",
            "Sentiment": "neutral",
            "PublishDate": 1753978674362,
            "Source": "corporate_action"
        },
        {
            "Title": "CARE Ratings Upgrades Religare Enterprises' ₹500 Cr Credit Facilities",
            "Summary": "CARE Ratings has upgraded the credit rating on Religare Enterprises' ₹500 crore facilities. The upgrade reflects the company's strengthened financial profile and improved growth outlook in its broking business segment.",
            "Sentiment": "positive",
            "PublishDate": 1753802320410,
            "Source": "stock"
        },
        {
            "Title": "India Ratings Re-affirms Care Health Insurance Credit Rating at IND A+/Stable",
            "Summary": "India Ratings & Research Private Limited has re-affirmed the credit rating of Care Health Insurance Limited at IND A+/Stable. Care Health Insurance is a material subsidiary of Religare Enterprises Limited. The rating communication was dated July 24, 2025, and Religare disclosed this information to stock exchanges as required under regulatory obligations.",
            "Sentiment": "positive",
            "PublishDate": 1753446262023,
            "Source": "stock"
        },
        {
            "Title": "RBI Withdraws Corrective Action Plan on Religare Finvest Limited",
            "Summary": "The Reserve Bank of India has withdrawn the Corrective Action Plan imposed on Religare Finvest Limited, a wholly-owned subsidiary of Religare Enterprises Ltd. The CAP was originally imposed on January 18, 2018, due to irregularities observed during inspection. RBI cited the company's compliance with CAP conditions and changes in management and directors as reasons for the withdrawal. The withdrawal is effective immediately, though the company must continue to comply with all prudential requirements.",
            "Sentiment": "positive",
            "PublishDate": 1753275184191,
            "Source": "stock"
        },
        {
            "Title": "Religare Enterprises: Rs 1,500 Crore Fundraise via Preferential Allotment",
            "Summary": "Religare Enterprises announces a Rs 1,500 crore fundraise through preferential allotment of warrants. The Burman family will subscribe to 50% (Rs 750 crore) of the warrants. Other investors include Ashish Kacholia, Hindustan Times group, Ashish Dhawan, and JM Financial. Funds will support business growth across verticals and strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1752285418000,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare Enterprises: Board Approves Rs 1,500 Crore Fundraise",
            "Summary": "Religare Enterprises' board has approved a proposal to raise up to Rs 1,500 crore through preferential allotment of shares. This comes as the Burman Family is considering a fund infusion.",
            "Sentiment": "positive",
            "PublishDate": 1752247588000,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare Enterprises Approves ₹1,500 Crore Fundraising and Share Allocation",
            "Summary": "Religare Enterprises has approved a ₹1,500 crore fundraising through preferential allotment, with promoters contributing half of the amount. Additionally, the company has allocated 53.2 lakh shares to investor Ashish Dhawan.",
            "Sentiment": "positive",
            "PublishDate": 1752245285000,
            "Source": "default"
        },
        {
            "Title": "Religare Enterprises: Board to Consider Fundraising on July 11",
            "Summary": "Religare Enterprises shares surged over 6% as the company announced its board will consider fundraising on July 11. The trading window for the company's shares will be closed from July 1 until 48 hours after Q2 results declaration and during the board meeting.",
            "Sentiment": "positive",
            "PublishDate": 1752129598000,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare Enterprises to Discuss Fund Raising on July 11",
            "Summary": "Religare Enterprises has announced plans to discuss raising funds at a meeting scheduled for July 11. The company has not provided any further details about the potential fund-raising initiative or its purpose.",
            "Sentiment": "neutral",
            "PublishDate": 1752027538000,
            "Source": "default"
        },
        {
            "Title": "Religare to Discuss Preferential Share Issue for Fundraising",
            "Summary": "Religare's Board of Directors is scheduled to meet on July 11 to discuss raising funds through a preferential share issue. This corporate action could potentially impact the company's capital structure and shareholding pattern.",
            "Sentiment": "neutral",
            "PublishDate": 1751995057000,
            "Source": "default"
        },
        {
            "Title": "Religare Enterprises Reports Mixed Q4 Results",
            "Summary": "Religare Enterprises announced its Q4 consolidated financial results. The company reported a net profit of 990.6 million rupees, down from 1.25 billion rupees year-over-year. Compared to the previous quarter, there was a loss of 430.8 million rupees. However, Q4 revenue increased to 20.28 billion rupees from 18.56 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747786901000,
            "Source": "default"
        },
        {
            "Title": "Religare Enterprises: Q4 Profit Drops 16%, Revenue Rises 9%",
            "Summary": "Religare Enterprises reported a 16.4% YoY decline in Q4 net profit to ₹151.3 crore, while revenue increased 9.3% to ₹2,028 crore. The Burman family recently acquired control of the company, now holding over 50% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1747765210000,
            "Source": "earnings"
        },
        {
            "Title": "Religare Enterprises Reports Mixed Q4 Results",
            "Summary": "Religare Enterprises announced its Q4 financial results. The company's revenue increased to 20.28 billion rupees from 18.56 billion rupees year-over-year. However, consolidated net profit decreased to 990.6 million rupees from 1.25 billion rupees year-over-year. Compared to the previous quarter, the company reported a loss of 430.8 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1747757457000,
            "Source": "result"
        },
        {
            "Title": "Religare Enterprises Faces Cash Flow Issues, Seeks Funding Support",
            "Summary": "Religare Enterprises' board has identified a cash flow gap in the coming months and plans to approach the Burman Group for immediate funding support. The board recommends a short-term inter-corporate loan to address the issue. Additionally, the company has engaged Trilegal and Grant Thornton to conduct a governance review of Religare Enterprises and its subsidiaries, Religare Finvest Limited (RFL) and Religare Housing Development Finance Corporation Limited (RHDFCL).",
            "Sentiment": "negative",
            "PublishDate": 1742256152000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Religare Enterprises Board Recommends Short-Term Loan and Initiates Governance Review",
            "Summary": "The board of Religare Enterprises has recommended a short-term inter-corporate loan. Additionally, the company has commissioned a governance review of Religare Enterprises Limited (REL) and its subsidiaries, Religare Finvest Limited (RFL) and Religare Housing Development Finance Corporation Limited (RHDFCL).",
            "Sentiment": "neutral",
            "PublishDate": 1742209149000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Religare Enterprises to Seek Funding Support from Burman Group",
            "Summary": "Religare Enterprises has announced its intention to approach the Burman Group for immediate funding support. This move suggests that the company may be facing financial challenges or seeking capital for strategic initiatives. The details of the potential funding amount or terms have not been disclosed in the provided news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1742209131000,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare Enterprises Faces Cash Flow Challenges and Initiates Governance Review",
            "Summary": "Religare Enterprises' board has identified a cash flow gap expected over the coming months. In response, the company has engaged Trilegal and Grant Thornton to conduct a governance review. This move suggests the company is taking proactive steps to address financial challenges and ensure proper corporate governance practices.",
            "Sentiment": "negative",
            "PublishDate": 1742209127000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Religare Enterprises: Withdrawal of NCLAT Petition Against CCI Order",
            "Summary": "Religare Enterprises has withdrawn its appeal at the NCLAT against a CCI order allowing Burman group entities to acquire a 5.27% stake. This follows the Burman Family gaining a controlling stake exceeding 50% through an open offer. The company's executive chairperson, Rashmi Saluja, was recently ousted as director by shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1741508478000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Religare Enterprises: Board Restructuring and Subsidiary Closure",
            "Summary": "Religare Enterprises appoints four new non-executive directors, pending RBI and shareholder approval. The company decides to shut down MIC Insurance Web Aggregator due to poor performance. Religare will write off loans to MIC and pay outstanding dues. The board also directs removal of Dr. Rashmi Saluja and Rakesh Asthaana from subsidiaries' boards.",
            "Sentiment": "neutral",
            "PublishDate": 1740577223000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Religare Enterprises: Burman Family Takes Control, Plans Capital Infusion and Rebranding",
            "Summary": "The Burman family has officially taken control of Religare Enterprises Ltd (REL) as its new promoter. They plan to infuse ₹2,000 crore by subscribing to preferential shares, increasing their stake to over 50%. A rebranding exercise, including renaming the company and its subsidiaries, is expected. The Burmans aim to strengthen governance and drive sustainable growth in REL's lending, health insurance, and retail broking businesses.",
            "Sentiment": "positive",
            "PublishDate": 1740099446000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Burman Group Acquires Control of Religare Enterprises",
            "Summary": "The Burman Group has announced that it has acquired control of Religare Enterprises and has been designated as its promoters. This development represents a significant change in the ownership and management structure of Religare Enterprises.",
            "Sentiment": "neutral",
            "PublishDate": 1740096494000,
            "Source": "corporate_action"
        },
        {
            "Title": "Religare Enterprises: Burman Family Acquires Control",
            "Summary": "The Burman Group has acquired control of Religare Enterprises and been designated as its promoters. They plan to focus on stability, governance, and growth. This follows a battle involving the ousted chairperson and a US-based investor. The Burman family's stake is set to increase to 53.94% after an open offer at Rs 235 per share.",
            "Sentiment": "positive",
            "PublishDate": 1740065587000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Burman Group Acquires Stake in Religare Enterprises, Becomes Promoter",
            "Summary": "Religare Enterprises has received a letter from the Burman Group regarding a change in control. The Burman Group, now referred to as 'Acquirers', has acquired 0.07% of Religare Enterprises' outstanding paid-up share capital. As a result of this acquisition, the Burman Group has become a promoter of Religare Enterprises.",
            "Sentiment": "neutral",
            "PublishDate": 1740023046000,
            "Source": "corporate_action"
        }
    ]
}