{
    "Symbol": "RELINFRA",
    "ISIN": "INE036A01016",
    "News": [
        {
            "Title": "Reliance Infrastructure Faces ED Attachment Order",
            "Summary": "Reliance Infrastructure receives provisional attachment order from ED for Rs.1,575 crore worth of subsidiary shareholdings related to alleged PMLA violations during 2017-2019.",
            "Sentiment": "negative",
            "PublishDate": 1770397517707,
            "Source": "stocks"
        },
        {
            "Title": "RInfra Q3FY26 monitoring report shows zero deviation",
            "Summary": "Reliance Infrastructure's monitoring agency report for Q3FY26 shows no deviation from stated objectives, with Rs.978.60 crore fully utilized from preferential issue proceeds.",
            "Sentiment": "neutral",
            "PublishDate": 1769870766165,
            "Source": "co_actions_results"
        },
        {
            "Title": "ED Attaches Rs 1,885 Crore Assets of Reliance Group",
            "Summary": "Enforcement Directorate provisionally attaches assets worth Rs 1,885 crores belonging to Reliance Anil Ambani Group in ongoing investigation.",
            "Sentiment": "negative",
            "PublishDate": 1769659305341,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Infrastructure's Secretarial Auditor Resigns",
            "Summary": "Reliance Infrastructure Limited announced the resignation of its Secretarial Auditor Ajay Kumar & Co. effective January 27, 2026, citing urgent personal problems as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1769538994815,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Infrastructure Board Meet on Jan 31, 2026",
            "Summary": "Reliance Infrastructure Limited has scheduled a board meeting for January 31, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769274409274,
            "Source": "co_actions_results"
        },
        {
            "Title": "ED Freezes 13 Bank Accounts Of Reliance Infrastructure",
            "Summary": "Enforcement Directorate freezes 13 bank accounts of Reliance Infrastructure amid ongoing investigation into alleged Foreign Exchange Management Act violations.",
            "Sentiment": "negative",
            "PublishDate": 1765375330601,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Infrastructure Faces ED Lien of ₹77.86 Crore on Bank Accounts",
            "Summary": "The Enforcement Directorate has imposed a lien of ₹77.86 crore on Reliance Infrastructure's bank accounts due to alleged Foreign Exchange Management Act violations. This regulatory action restricts the company's access to the specified funds and may impact its financial operations and liquidity position.",
            "Sentiment": "negative",
            "PublishDate": 1765330784177,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure Unveils Strategic Transformation Plan with New Growth Engines in Solar and Battery Manufacturing",
            "Summary": "Reliance Infrastructure presented its transformation roadmap featuring two gigafactories for integrated solar and battery manufacturing, alongside its existing portfolio spanning power distribution, defence manufacturing, and infrastructure projects. The company reported strengthened financials with zero standalone bank debt, ₹2,289 crore EBITDA in FY25, and ₹16,921 crore net worth as of September 2025, positioning itself to capitalize on India's clean energy transition and defence manufacturing opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1765132768620,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Clarifies ED Asset Attachment of Rs 10,117 Crore, Continues Normal Operations",
            "Summary": "The Enforcement Directorate provisionally attached assets worth Rs 10,117 crore from Reliance Power for alleged PMLA violations, with Rs 8,078 crore pertaining to Reliance Communications which ceased being part of Reliance Group since 2019. Reliance Power clarified that it continues operating normally and will take appropriate legal action to protect shareholder interests, while the company's own attached assets include windmill assets valued at Rs 10.14 crore and real estate assets at Rs 397.46 crore held on long-term lease from Bombay Port Trust.",
            "Sentiment": "neutral",
            "PublishDate": 1764949932350,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure Reports Strong H1 FY26 Performance with Strategic Focus on Defense and Clean Energy",
            "Summary": "Reliance Infrastructure delivered robust quarterly results with revenue of ₹2,572 crore, driven by strong performance across power distribution (BSES serving 5.3 million consumers), Mumbai Metro operations (5 lakh daily ridership), and expanding defense manufacturing capabilities. The company is strategically positioning itself in high-growth sectors including defense manufacturing, renewables, battery systems, and solar manufacturing while maintaining operational excellence in its core infrastructure businesses.",
            "Sentiment": "positive",
            "PublishDate": 1764777156652,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure to Establish Management Board for Enhanced Governance",
            "Summary": "Reliance Infrastructure announced plans to establish a management board aimed at improving corporate governance and oversight mechanisms. The initiative is designed to strengthen the company's management structure and enhance operational supervision.",
            "Sentiment": "positive",
            "PublishDate": 1763607149359,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Infrastructure Receives SFIO Notice, Pledges Full Cooperation",
            "Summary": "Reliance Infrastructure Limited received a notice from the Serious Fraud Investigation Office (SFIO) calling for information. The company has committed to extend full cooperation with the investigation.",
            "Sentiment": "negative",
            "PublishDate": 1763574192627,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure Seeks Shareholder Approval for $600 Million FCCB Issuance and Enhanced Borrowing Powers",
            "Summary": "Reliance Infrastructure Limited has issued a postal ballot notice seeking shareholder approval for issuing Foreign Currency Convertible Bonds and other securities up to $600 million, along with authorization to borrow up to five times its paid-up share capital and free reserves. The e-voting period runs from November 19, 2025 to December 18, 2025, with results to be announced by December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763486118847,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Group Launches First-Ever ESOP Program for 2,500 Employees Across Infrastructure and Power Units",
            "Summary": "Reliance Group announced its first Employee Stock Ownership Plan covering nearly 2,500 employees across Reliance Infrastructure Limited and Reliance Power Limited. The program allows most employees to exercise options at face value of ₹10 per share, recognizing their loyalty and contributions to the group's turnaround journey. The initiative received shareholder approval on November 3, 2024, and aims to expand the group's shareholder base beyond its current 50 lakh investors. The ESOP program is designed to acknowledge past performance while aligning employee aspirations with long-term growth objectives. Both flagship companies are currently bank debt-free, with the group employing over 28,000 people and maintaining assets worth ₹1,07,123 crore and net worth of ₹40,856 crore.",
            "Sentiment": "positive",
            "PublishDate": 1763038298217,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Infrastructure Reports 886% Jump in Q2 Profit Before Tax to ₹2,546 Crore",
            "Summary": "Reliance Infrastructure Limited announced its quarterly results for September 30, 2025, showing consolidated profit before tax of ₹2,546 crore, representing 886% growth from ₹287 crore in Q1 FY26. Consolidated EBITDA reached ₹2,265 crore, marking 202% year-on-year growth compared to ₹1,123 crore in Q2 FY25. Total consolidated income stood at ₹6,309 crore, up 5% from ₹6,036 crore in the previous quarter. The company's consolidated net worth increased by ₹2,066 crore to ₹16,921 crore as of September 30, 2025, up 14% from ₹14,855 crore as of June 30, 2025. The Board approved seeking shareholder authorization for raising up to US $600 million through Foreign Currency Convertible Bonds (FCCBs). The company maintains zero standalone bank debt with standalone net worth at ₹24,340 crore. Delhi Discoms added over 46,224 new consumers in Q2 FY25-26, bringing total consumers to 53.24 lakh, while maintaining transmission distribution losses below 7%. Mumbai Metro One recorded highest ever monthly ridership of 139.81 lakh in September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762915684536,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Infrastructure Reports No Deviation in Rs 3,014 Crore Preferential Issue Proceeds Utilization",
            "Summary": "Reliance Infrastructure Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its preferential issue of convertible warrants worth Rs 3,014.40 crore. The report by Infomerics Valuation and Rating Limited shows no deviation from disclosed objects and no utilization of proceeds during the quarter. The company has received Rs 978.60 crore till September 30, 2025, and has fully utilized all proceeds received till June 30, 2025. The issue comprises 12.56 crore convertible warrants at Rs 240 per warrant. The company's share price stands at Rs 210.25 as of November 3, 2025, below the issue price of Rs 240. The proceeds are allocated for expansion of business operations (Rs 2,260.80 crore) and general corporate purposes (Rs 753.60 crore).",
            "Sentiment": "neutral",
            "PublishDate": 1762878180184,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Infrastructure Grants 51.2 Lakh Employee Stock Options Under 2024 Scheme",
            "Summary": "Reliance Infrastructure Limited's Nomination and Remuneration Committee approved the grant of 51,20,312 employee stock options under the Reliance Infrastructure Employee Stock Option Scheme, 2024. The options cover fully paid-up equity shares with a face value of Rs. 10 each. The company implemented two pricing formulas: options granted at face value of Rs. 10 and options granted at a 20% discount to the closing market price on National Stock Exchange as of November 10, 2025, priced at Rs. 135.70. The vested options can be exercised within a maximum period of 4 years from the vesting date. The granted options will entitle holders to acquire equal number of equity shares upon payment of exercise price and applicable taxes according to the vesting schedule and scheme terms.",
            "Sentiment": "positive",
            "PublishDate": 1762877229120,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Infrastructure Reports 53% Drop in Q2 Net Profit to 19.1 Billion Rupees",
            "Summary": "Reliance Infrastructure reported consolidated net profit of 19.1 billion rupees for Q2, down from 40.8 billion rupees in the same quarter last year. Revenue declined to 62.34 billion rupees from 72.6 billion rupees year-over-year. EBITDA fell to 10.6 billion rupees compared to 16.3 billion rupees in the previous year, with EBITDA margin contracting to 16.92% from 22.53%.",
            "Sentiment": "negative",
            "PublishDate": 1762876530040,
            "Source": "earnings"
        },
        {
            "Title": "Mathew Cyriac Reduces Stake in Reliance Infrastructure to 3.16%",
            "Summary": "Mathew Cyriac and associated entities have restructured their shareholding in Reliance Infrastructure Limited. Mathew Cyriac sold 1.52 crore shares (3.72% stake), while Florintree Insurtech LLP sold 18.97 lakh shares (0.46% stake). Simultaneously, Elimath Advisors Pvt Ltd acquired 69.88 lakh shares (1.71% stake). The combined holding of Mathew Cyriac along with Elimath Advisors Pvt Ltd and Florintree Insurtech LLP decreased from 5.64% to 3.16%. The transactions were conducted through open market operations and completed on October 31, 2025. The disclosure was made as Mathew Cyriac's individual shareholding changed by more than 2%.",
            "Sentiment": "neutral",
            "PublishDate": 1762765805955,
            "Source": "stock"
        },
        {
            "Title": "ED Freezes Reliance Infrastructure Assets Over PMLA Violations",
            "Summary": "The Enforcement Directorate has temporarily frozen assets of Reliance Infrastructure due to violations under the Prevention of Money Laundering Act (PMLA). The company states that this action will not impact its operations or stakeholders. Anil D. Ambani has not been on the company's board for 3.5 years.",
            "Sentiment": "negative",
            "PublishDate": 1762175285901,
            "Source": "stock"
        },
        {
            "Title": "ED Identifies Rs 2,000 Crore Reliance Infrastructure Assets in FEMA Probe",
            "Summary": "The Enforcement Directorate has identified assets worth Rs 2,000 crore linked to Reliance Infrastructure Ltd., owned by Anil Ambani-led Reliance ADA Group, as part of an investigation into alleged Foreign Exchange Management Act violations. The asset attachment process is expected to begin within two weeks. The probe follows ED searches at six locations in Mumbai and Indore connected to Reliance Infrastructure, focusing on alleged fund diversion of Rs 17,000 crore across multiple ADAG companies. ED has received inputs from 30 banks regarding potential lending practice lapses and reviewed a CBI chargesheet alleging quid pro quo arrangements between Yes Bank and ADAG firms. The agency arrested Reliance Power CFO Ashok Kumar Pal in connection with a fake bank guarantee scheme, while Anil Ambani appeared before ED as part of a Prevention of Money Laundering Act probe.",
            "Sentiment": "negative",
            "PublishDate": 1760347587792,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power and Reliance Infrastructure Receive SEBI Show Cause Notices for Alleged Fraudulent Practices",
            "Summary": "Reliance Power Ltd. and Reliance Infrastructure Ltd., both Anil Ambani group companies, received show cause notices from SEBI for alleged violations of fraudulent and unfair trade practices regulations. The notices relate to Reliance Infrastructure's exposure in CLE Private Limited. Reliance Infrastructure noted that the dispute with CLE was settled through mediation conducted by a retired Supreme Court judge, with a settlement agreement of Rs 6,503 crore reached in February. The company stated the settlement has been fully implemented under the Mediation Act, 2023. In July, the Enforcement Directorate raided over 35 premises and searched more than 50 companies linked to the Reliance Anil Ambani Group regarding alleged illegal loan diversion. Reliance Infra denied fund diversion allegations, stating it had a net exposure of Rs 6,500 crore that was disclosed in financial statements over four years. Shares of both companies declined 2.4% and 2.2% respectively, while the BSE Sensex gained 0.7%.",
            "Sentiment": "negative",
            "PublishDate": 1759801578285,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay High Court Rejects Anil Ambani's Challenge to SBI's Fraud Classification",
            "Summary": "The Bombay High Court has rejected Anil Ambani's request challenging State Bank of India's classification of his loan account as fraudulent. The court ruling upholds SBI's decision to categorize Ambani's loan account under fraud classification.",
            "Sentiment": "negative",
            "PublishDate": 1759502106623,
            "Source": "stock"
        },
        {
            "Title": "India's Financial Crime Agency Searches Reliance Infrastructure Over Alleged Foreign Exchange Violations",
            "Summary": "India's financial crime agency has conducted searches at Reliance Infrastructure in connection with alleged violations of foreign exchange laws. The searches are part of an investigation into potential breaches of foreign exchange regulations.",
            "Sentiment": "negative",
            "PublishDate": 1759232504541,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power and Reliance Infra Shares Fall 36% in Three Months Amid Legal Scrutiny",
            "Summary": "Reliance Power and Reliance Infrastructure shares have declined nearly 36% each over the past three months, with both stocks falling on Wednesday. The Enforcement Directorate filed a fresh case under the Prevention of Money Laundering Act against Anil Ambani and Reliance Communications for allegedly defrauding State Bank of India of over Rs 2,900 crore. Bank of Baroda classified Reliance Communications' loan accounts as fraud. Both companies reported profits in the June quarter - Reliance Power posted Rs 44.68 crore profit versus Rs 97.85 crore loss previously, while Reliance Infra reported Rs 59.84 crore profit against Rs 233.74 crore loss last year. However, revenues declined for both companies. Analysts cite technical support levels and note that legal headlines could overshadow operational improvements.",
            "Sentiment": "negative",
            "PublishDate": 1757499992574,
            "Source": "stock"
        },
        {
            "Title": "ED Files Money Laundering Charges Against Anil Ambani in Reliance Infra Case",
            "Summary": "The Enforcement Directorate has filed money laundering charges against Anil Ambani in connection with Reliance Infrastructure. The charges represent legal action by the financial investigation agency against the businessman.",
            "Sentiment": "negative",
            "PublishDate": 1757488449088,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Infrastructure Sells 2% Stake to Dassault Aviation for ₹1.76 Billion",
            "Summary": "Reliance Infrastructure will sell a 2% stake to Dassault Aviation for ₹1.76 billion in their joint venture Dassault Reliance. This transaction will give Dassault Aviation a 51% ownership stake in Dassault Reliance, making it the majority shareholder in the venture.",
            "Sentiment": "neutral",
            "PublishDate": 1757064835975,
            "Source": "order&deals"
        },
        {
            "Title": "Reliance Infrastructure Clarifies No Impact from Bank of Baroda's Fraud Classification of Reliance Communications",
            "Summary": "Reliance Infrastructure Limited clarified that Bank of Baroda's classification of Reliance Communications Limited and Anil D Ambani's loan account as fraud has no impact on its business operations, financial performance, or stakeholders. The company stated that the classification pertains to matters from 10 years ago, and Anil D Ambani has not been on Reliance Infrastructure's board for more than 3.5 years. Reliance Communications is currently managed under a Committee of Creditors led by SBI and overseen by a Resolution Professional, with matters pending before NCLT and judicial forums including the Supreme Court for six years. Reliance Infrastructure emphasized it is a separate and independent listed entity with no business or financial linkage to Reliance Communications. The company operates in infrastructure sectors including power, roads, metro rail, and defense through various Special Purpose Vehicles.",
            "Sentiment": "neutral",
            "PublishDate": 1757054986816,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power and Reliance Infrastructure Clarify No Impact from CBI Action on RCom",
            "Summary": "Reliance Power and Reliance Infrastructure stated that Central Bureau of Investigation action on Reliance Communications has no impact on their business operations, financial performance, shareholders, employees, or stakeholders. The companies emphasized they are separate and independent listed entities with no business or financial linkage to Reliance Communications. Anil Ambani has not been on the Board of Reliance Power for more than three and a half years. Reliance Communications is being managed under supervision of a committee of creditors led by SBI and overseen by a resolution professional. The matter remains pending before the National Company Law Tribunal and other judicial forums including the Supreme Court for six years. Both companies stated they will continue focusing on business plans and remain committed to creating value for stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1756034172371,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure Clarifies No Impact from CBI Action on Reliance Communications",
            "Summary": "Reliance Infrastructure Limited issued a clarification stating that recent Central Bureau of Investigation action on Reliance Communications Limited and Mr. Anil D Ambani has no impact on its business operations, financial performance, shareholders, employees, or stakeholders. The company emphasized it is a separate and independent listed entity with no business or financial linkage to Reliance Communications. The complaint filed by State Bank of India pertains to matters from over 10 years ago when Mr. Ambani was a Non-Executive Director of Reliance Communications with no day-to-day management involvement. Mr. Ambani resigned from Reliance Communications Board in 2019 and has not been on Reliance Infrastructure's Board for more than 3.5 years. Reliance Communications is currently managed under supervision of a Committee of Creditors led by SBI and overseen by a Resolution Professional, with matters pending before NCLT and judicial forums including the Supreme Court for six years. Reliance Infrastructure stated it will continue focusing on business plans and remain committed to creating value for stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1756017038940,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power and Reliance Infrastructure Shares Surge 16% in Three Days on Renewable Energy Developments",
            "Summary": "Shares of Reliance Power and Reliance Infrastructure hit upper circuit limits for three consecutive sessions, gaining 15.7% and reaching Rs 50.08 and Rs 303.70 respectively. Reliance Power's rally was driven by the incorporation of GDL - Reliance Solar Pte Ltd in Bhutan, a 50:50 joint venture between Green Digital Private Limited and Reliance Enterprises Private Limited, giving Reliance Power an indirect 25% stake. Reliance Infrastructure received a Letter of Award from NHPC for a 390 MW solar project with 780 MWh Battery Energy Storage System at a tariff of Rs 3.13/kWh. This addition strengthens Reliance Group's position with over 3 GWp solar capacity and 3.5 GWh storage pipeline, making it India's largest integrated Solar + BESS player.",
            "Sentiment": "positive",
            "PublishDate": 1755757148901,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure Wins 390 MW Solar and Battery Storage Project from NHPC",
            "Summary": "Reliance Infrastructure received a Letter of Award from NHPC for a 390 MW interstate transmission system-connected solar power project with Battery Energy Storage System (BESS). The project will add 700 MWp of solar DC capacity and 780 MWhr of BESS capacity to Reliance Group's portfolio. The winning tariff was INR 3.13/kWh. The tender saw participation from 15 entities with 14 qualifying for e-reverse auction and was oversubscribed by nearly 4 times. With this addition, Reliance Group's combined clean energy pipeline reaches over 3 GWp of Solar DC capacity and over 3.5 GWhr of BESS capacity, making it India's largest player in the integrated Solar + BESS segment. Reliance Power already has nearly 2.5 GWp of Solar and 2.5 GWhr of BESS capacity in its renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1755575459514,
            "Source": "stock"
        },
        {
            "Title": "NCLT Admits Insolvency Proceedings Against Reliance Infrastructure Subsidiary for INR 358.70 Crore Debt",
            "Summary": "The National Company Law Tribunal Mumbai admitted a Corporate Insolvency Resolution Process petition against SU Toll Road Private Limited, a wholly owned subsidiary of Reliance Infrastructure Limited. State Bank of India filed the petition for a default amount of INR 358.70 crore including interest. The company operates a toll road project on the Salem-Ulundurpet section of National Highway 68 in Tamil Nadu under a Build, Operate and Transfer basis with concession validity until January 14, 2033. The tribunal appointed Sanjay Kumar Mishra as Interim Resolution Professional and declared a moratorium on all proceedings against the company. SU Toll Road defaulted on loan repayments starting June 1, 2023, leading to the accounts being classified as Non-Performing Assets in August 2023. Reliance Infrastructure stated that the company's entire exposure is already provided for and no impact is expected.",
            "Sentiment": "negative",
            "PublishDate": 1755540963549,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Infrastructure Reports Zero Deviation in Rs 3,014 Crore Warrant Issue Proceeds Utilization",
            "Summary": "Reliance Infrastructure Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing complete utilization of Rs 978.60 crore received from its preferential warrant issue with no deviations from stated objectives. The company raised Rs 978.60 crore out of the total Rs 3,014.40 crore warrant issue, utilizing funds for business expansion (Rs 293.35 crore) and general corporate purposes (Rs 685.25 crore). During the quarter, the company invested Rs 225 crore in subsidiary Reliance Defence Limited through convertible debentures and allotted 1.25 crore equity shares to promoter entity Risee Infinity Private Limited for Rs 300 crore. Infomerics Valuation and Rating Limited, the monitoring agency, confirmed all proceeds were used according to the offer document with no unutilized funds remaining in escrow accounts.",
            "Sentiment": "positive",
            "PublishDate": 1755187476345,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Infrastructure Wins Rs. 526 Crore Arbitration Award Against Aravali Power Company",
            "Summary": "Reliance Infrastructure has secured a Rs. 526 crore arbitration award against Aravali Power Company. The arbitration proceedings have concluded in favor of Reliance Infrastructure, resulting in this significant monetary award.",
            "Sentiment": "positive",
            "PublishDate": 1755073172542,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure's BSES Joint Venture to Recover Rs 28,483 Crores in Regulatory Assets Following Supreme Court Order",
            "Summary": "The Supreme Court has ordered the recovery of Rs 28,483 crores in regulatory assets for BSES, a joint venture between Reliance Infrastructure (51%) and the Government of Delhi (49%). The court disposed of writ petitions filed by BSES Discoms (BSES Yamuna Power Limited and BSES Rajdhani Power Limited) in 2014, which challenged non-cost reflective tariffs and non-liquidation of regulatory assets. The Supreme Court established ten principles and nine directions for regulatory asset management, mandating that existing regulatory assets must be liquidated within four years from April 1, 2024, to March 31, 2028. The court directed that tariffs should be cost-reflective, regulatory assets should not exceed 3% of Aggregate Revenue Requirement, and future regulatory assets must be liquidated within three years. The Appellate Tribunal for Electricity will monitor implementation through a suo moto petition.",
            "Sentiment": "positive",
            "PublishDate": 1754647992422,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure Subsidiaries to Recover ₹21,413 Crore in Regulatory Assets",
            "Summary": "Reliance Infrastructure's subsidiaries are set to recover ₹21,413 crore in regulatory assets over the next four years. The recovery represents a significant financial development for the company's subsidiary operations.",
            "Sentiment": "positive",
            "PublishDate": 1754629089769,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure and Reliance Power Shares Drop Up to 5% Amid Rs 17,000 Crore Loan Fraud Investigation",
            "Summary": "Shares of Anil Ambani-led companies declined on Thursday, with Reliance Infrastructure falling 4% to Rs 282 and Reliance Power dropping 5% to Rs 45.25. The decline follows an ongoing Enforcement Directorate investigation into a suspected Rs 17,000 crore loan fraud case. Over the past two weeks, Reliance Infrastructure shares have fallen 20% while Reliance Power declined 23%. The ED questioned Anil Ambani on Tuesday regarding the money laundering probe, with Ambani seeking seven days to provide requested documents. The investigation involves loans to three Reliance Group entities - Reliance Home Finance Ltd, Reliance Commercial Finance Ltd, and Reliance Communications - which have turned into non-performing assets. Nearly 20 private and public sector banks, including YES Bank, State Bank of India, UCO Bank, Axis Bank, ICICI Bank, HDFC Bank, Bank of India and Punjab and Sind Bank, had provided these loans. Outstanding amounts include Rs 5,901 crore for RHFL, Rs 8,226 crore for RCFL, and Rs 4,105 crore for RCom. The ED is continuing to question other Reliance Group associates as part of the investigation.",
            "Sentiment": "negative",
            "PublishDate": 1754556588092,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure and Reliance Power Shares Drop Up to 15% Amid ED Probe",
            "Summary": "Shares of Anil Ambani-led Reliance Group companies declined sharply over five trading sessions due to an Enforcement Directorate probe into alleged fraud. Reliance Infrastructure shares fell 14% to Rs 281.25, while Reliance Power dropped 15% to Rs 45.32. The ED issued summons to several top executives including Amitabh Jhunjhunwala and Sateesh Seth in connection with a money laundering investigation. Loans worth Rs 17,000 crore to group firms including Reliance Home Finance, Reliance Commercial Finance, and Reliance Communications have reportedly become non-performing assets involving nearly 20 lenders. The ED conducted searches at 35 locations across Mumbai covering 50 companies and 25 individuals. SEBI submitted findings regarding alleged diversion of Rs 10,000 crore by Reliance Infrastructure through transactions with engineering firm CLE Pvt Ltd. Over the past month, Reliance Infrastructure shares declined 24.82% while Reliance Power fell 31%.",
            "Sentiment": "negative",
            "PublishDate": 1754373175662,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power and Infrastructure Shares Drop Nearly 5% as ED Summons Anil Ambani in Rs 17,000 Crore Loan Fraud Probe",
            "Summary": "Shares of Reliance Power and Reliance Infrastructure declined up to 4.9% following the Enforcement Directorate's summons to Anil Ambani for questioning in an alleged Rs 17,000-crore loan fraud case. Reliance Power dropped 4.16% to Rs 50.65 while Reliance Infrastructure fell nearly 5% to Rs 312. Ambani has been directed to appear before the ED on August 5. The investigation focuses on suspected diversion of loan funds and financial irregularities within the Reliance Group. The ED conducted searches at 35 locations across Mumbai covering 50 companies and 25 individuals under the Prevention of Money Laundering Act. SEBI has submitted findings of its probe alleging Rs 10,000 crore diversion by Reliance Infrastructure through transactions with CLE Pvt Ltd disguised as intercorporate deposits without proper approvals. SEBI's investigation covers FY13 to FY23, during which R Infra had annual dealings with CLE amounting to 25-90% of CLE's total assets. As of March 31, 2022, R Infra's total financial exposure to CLE stood at Rs 8,302 crore. Between FY17 and FY21, R Infra wrote off Rs 10,110 crore under provisions for fair value adjustments and impairment losses. A person close to the Reliance Group disputed the findings, stating the actual exposure was Rs 6,500 crore and that recovery proceedings are underway with a settlement reached to recover the entire amount.",
            "Sentiment": "negative",
            "PublishDate": 1754022123451,
            "Source": "stock"
        },
        {
            "Title": "MMRDA Pays ₹560.21 Crore to Reliance Infrastructure Joint Venture Following Supreme Court Ruling",
            "Summary": "The Mumbai Metropolitan Region Development Authority (MMRDA) has paid ₹560.21 crore to MMOPL, a joint venture involving Reliance Infrastructure, following a Supreme Court ruling. The payment was made in compliance with the court's decision regarding the joint venture company.",
            "Sentiment": "positive",
            "PublishDate": 1753779393259,
            "Source": "stock"
        },
        {
            "Title": "Reliance Group Secures Board Approval to Raise ₹18,000 Crore for Defence and Renewable Energy Expansion",
            "Summary": "Reliance Infrastructure and Reliance Power boards approved raising ₹18,000 crore through equity and debt to fund growth in Defence & Aerospace and Renewable Energy sectors. Over 100 senior leaders attended a leadership meeting to discuss the expansion strategy. Both companies maintain debt-free status with net worths of ₹14,883 crore and ₹16,431 crore respectively, serving 50 lakh public shareholders. Reliance Infrastructure plans defence manufacturing partnerships including Falcon 2000 business jets with Dassault Aviation, MRO operations with Coastal Mechanics, and collaborations with Rheinmetall AG and Diehl Defence. The company also operates BSES power distribution serving 53 lakh Delhi households. Reliance Power operates a 5.3 GW portfolio and secured 3.3 GWh of solar and battery storage projects. The combined group maintains ₹33,000 crore net worth and annual turnover with ₹40,000 crore market capitalization.",
            "Sentiment": "positive",
            "PublishDate": 1753624196086,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure Says ED Action Concluded, No Impact on Business Operations",
            "Summary": "Reliance Infrastructure announced that Enforcement Directorate action has concluded at all company locations. The company stated the action has no impact on its business operations, financial performance, or stakeholders. The company clarified it has no business or financial links to Reliance Communications Limited or Reliance Home Finance Limited, noting the allegations appear to concern transactions of these entities that are over 10 years old. Reliance Communications has been undergoing Corporate Insolvency Resolution Process for over 6 years, while Reliance Home Finance has been resolved pursuant to Supreme Court judgment. The company emphasized that Anil D. Ambani is not on its Board and that any action against the other entities has no bearing on Reliance Infrastructure's governance or operations. The company said it continues to operate normally and remains focused on its business plans.",
            "Sentiment": "neutral",
            "PublishDate": 1753606046390,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure Amends Scheme of Arrangement with Subsidiary, Changes Appointed Date",
            "Summary": "Reliance Infrastructure Limited's Board of Directors approved an amendment to the Scheme of Arrangement with its wholly owned subsidiary Reliance Velocity Limited. The key change involves shifting the Appointed Date from March 31, 2025 to the Effective Date. The amendment is subject to necessary statutory and regulatory approvals as required under applicable law provisions. The Scheme involves the transfer arrangement between Reliance Velocity Limited as the transferor company and Reliance Infrastructure Limited as the transferee company, along with their respective shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1753459667962,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Infrastructure Reports Sharp Decline in Q1 EBITDA and Revenue",
            "Summary": "Reliance Infrastructure reported significantly weaker quarterly results with EBITDA falling to 2.2 billion rupees from 12.1 billion rupees year-over-year, while EBITDA margin compressed to 3.76% from 16.84%. Revenue declined to 59 billion rupees from 72 billion rupees. The company recorded a net loss of 4.34 billion rupees before rate regulated activities, exceptional items and tax, compared to a profit of 4.6 billion rupees in the previous year. However, consolidated net profit was 598 million rupees versus a loss of 2.33 billion rupees year-over-year. Regulatory income stood at 7.2 billion rupees compared to an expense of 5.35 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1753457538052,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Infrastructure Reports Profitable Quarter with ₹287 Crore PBT and Zero Net Debt",
            "Summary": "Reliance Infrastructure Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported consolidated total income of ₹6,036 crore, up 41% from ₹4,268 crore in the previous quarter. Consolidated profit before tax turned positive at ₹287 crore compared to a loss of ₹78 crore in the same quarter last year. The company achieved consolidated EBITDA of ₹1,494 crore, marking 29% year-on-year growth from ₹1,155 crore. Net profit for the quarter stood at ₹59.84 crore versus a loss of ₹233.74 crore in the previous year quarter. The company's consolidated net worth increased to ₹14,855 crore as of March 31, 2025, up 4% from ₹14,287 crore. Reliance Infrastructure reported being debt-free with zero net debt to banks and financial institutions. The company issued 1.25 crore equity shares to a promoter group company through warrant conversion during the quarter. Several subsidiaries face going concern issues due to financial difficulties and ongoing legal proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1753457518626,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Infrastructure and Reliance Power Shares Drop 10% Following ED Raids in Yes Bank Loan Fraud Probe",
            "Summary": "Shares of Reliance Infrastructure and Reliance Power declined 10% over two sessions, hitting 5% lower circuits after the Enforcement Directorate raided 40-50 premises linked to Anil Ambani in a Rs 3,000 crore Yes Bank loan fraud investigation. Reliance Power fell to Rs 56.72 while Reliance Infrastructure dropped to Rs 342.05. The ED is investigating suspected money laundering related to Yes Bank loans sanctioned between 2017-2019, allegedly diverted to shell companies and group entities. The probe covers over 50 companies and 25 individuals, with preliminary findings indicating irregularities in credit approval processes, back-dated documentation, and possible bribery involving Yes Bank officials. Both companies denied involvement in the transactions under investigation, stating the enforcement action has no operational or financial impact on their businesses. They clarified that the allegations appear to concern transactions of Reliance Communications Limited or Reliance Home Finance Limited from over 10 years ago, and emphasized they are separate independent entities with no business linkage to these companies.",
            "Sentiment": "negative",
            "PublishDate": 1753419217038,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure Clarifies No Impact from Enforcement Actions Against RCOM and RHFL",
            "Summary": "Reliance Infrastructure Limited issued a clarification stating that enforcement agency actions related to Reliance Communications Limited and Reliance Home Finance Limited have no impact on its business operations, financial performance, or stakeholders. The company emphasized it is a separate and independent listed entity with no business or financial linkage to RCOM or RHFL. The media reports appear to pertain to allegations concerning transactions of RCOM or RHFL that are over 10 years old. RCOM has been undergoing Corporate Insolvency Resolution Process for over 6 years, while RHFL has been fully resolved pursuant to a Supreme Court judgment. The company noted that Anil D. Ambani is not on the Board of Reliance Infrastructure, and similar allegations are pending before the Securities Appellate Tribunal. Reliance Infrastructure continues to focus on its business plans and remains committed to creating value for all stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1753345261392,
            "Source": "stock"
        },
        {
            "Title": "NCLAT Stays Insolvency Proceedings Against Reliance Infrastructure After Rs 92.68 Crore Payment",
            "Summary": "The National Company Law Appellate Tribunal has stayed insolvency proceedings against Reliance Infrastructure following the company's repayment of Rs 92.68 crore towards tariff under an energy purchase agreement. The Mumbai bench of NCLT had on May 30 directed initiation of corporate insolvency resolution process against Reliance Infrastructure after IDBI Trusteeship filed a petition in April 2022 alleging a default of Rs 88.68 crore plus interest. IDBI Trusteeship had alleged payment defaults on 10 invoices raised between 2017 and 2018 by Dhursar Solar Power Private Limited for supplying solar energy to Reliance Infrastructure. On June 4, NCLAT suspended the NCLT order while hearing the company's appeal, with Reliance Infrastructure stating it had made full payment of Rs 92.68 crore to Dhursar Solar Power Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1752852025279,
            "Source": "stock"
        },
        {
            "Title": "Reliance Infrastructure: NCLAT Stays Insolvency Proceedings",
            "Summary": "The National Company Law Appellate Tribunal (NCLAT) has stayed insolvency proceedings against Reliance Infrastructure. The company claims to have fully paid all outstanding dues, including interest. IDBI Trusteeship, which had alleged a default of about ₹90 crore, has been given time to reconcile payments. The next hearing is scheduled for August 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1752825649000,
            "Source": "corporate_governance"
        }
    ]
}