{
    "Symbol": "RELIANCE",
    "ISIN": "INE002A01018",
    "News": [
        {
            "Title": "Reliance Industries Buys Venezuelan Oil",
            "Summary": "Reliance Industries has purchased 2 million barrels of Venezuelan oil from trader Vitol for April delivery, marking a significant crude oil procurement deal.",
            "Sentiment": "neutral",
            "PublishDate": 1770286563825,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Block Trade Worth Rs. 106 Crores",
            "Summary": "Reliance Industries executed a significant NSE block trade worth Rs. 106.00 crores involving approximately 719,170 shares at Rs. 1473.90 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770090527977,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance's Jio Studios Acquires 50.1% Stake in Sikhya",
            "Summary": "Reliance Strategic Business Ventures acquired 50.1% equity stake in Oscar-winning Sikhya Entertainment for ₹150 crore to strengthen Jio Studios' content portfolio and global reach.",
            "Sentiment": "positive",
            "PublishDate": 1770090418826,
            "Source": "co_actions_results"
        },
        {
            "Title": "High Court to Review Govt's ₹25,000 Crore Claim",
            "Summary": "High Court will examine the government's request to retrieve ₹25,000 crores from Reliance Industries in an upcoming legal proceeding that could have significant financial implications.",
            "Sentiment": "neutral",
            "PublishDate": 1770024514646,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Block Trade Worth Rs. 113.68 Crores",
            "Summary": "Reliance Industries witnessed a significant NSE block trade worth Rs. 113.68 crores involving 818,735 shares at Rs. 1388.50 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769752665688,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Industries Gets Credit Rating Reaffirmed",
            "Summary": "ICRA Limited reaffirms '[ICRA]AAA (Stable)' rating for Non-convertible Debentures and '[ICRA]A1+' rating for Commercial Paper of Reliance Industries Limited on January 29, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769700224832,
            "Source": "stocks"
        },
        {
            "Title": "RIL Gets NCLT Nod for SevenHills Healthcare Deal",
            "Summary": "Reliance Industries receives NCLT approval for resolution plan of SevenHills Healthcare Private Limited through Capri Global Holdings with RIL as equity support provider under insolvency process.",
            "Sentiment": "positive",
            "PublishDate": 1769687577236,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Industries Block Trade Worth ₹50.87 Crores",
            "Summary": "Reliance Industries executed a significant block trade on NSE involving 367,103 shares at ₹1385.60 per share, totaling ₹50.87 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1769495260089,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance vs Bear Cartel: BSE's 3-Day Shutdown in 1982",
            "Summary": "The 1982 battle between Reliance Industries and bear cartel led to BSE shutdown for three days, exposing market vulnerabilities and shaping regulatory reforms in Indian equity markets.",
            "Sentiment": "neutral",
            "PublishDate": 1769411230342,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Merges 16 Subsidiaries Into RNE",
            "Summary": "Reliance Industries has consolidated 16 step-down subsidiaries into Reliance New Energy as part of its strategic restructuring initiative to streamline operations in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1769094598390,
            "Source": "co_actions_results"
        },
        {
            "Title": "RIL to Resume Russian Oil Imports in Feb-March",
            "Summary": "Reliance Industries Ltd is set to restart sanctions-compliant Russian oil imports in February-March after a one-month pause, according to sources cited by Reuters.",
            "Sentiment": "neutral",
            "PublishDate": 1769056103953,
            "Source": "stocks"
        },
        {
            "Title": "CLSA raises RIL target to ₹1,800 on Jio IPO prospects",
            "Summary": "CLSA projects Jio's enterprise value at $190 billion by 2028, raising Reliance Industries target price to ₹1,800 ahead of planned mid-2026 listing that could create top 10 global telecom stock.",
            "Sentiment": "positive",
            "PublishDate": 1768994483226,
            "Source": "stocks"
        },
        {
            "Title": "Motilal Oswal Sets ₹1,750 Target for Reliance Industries",
            "Summary": "Motilal Oswal maintains BUY rating on Reliance Industries with revised target price of ₹1,750, despite soft Q3 performance with flat consolidated EBITDA at ₹460 billion.",
            "Sentiment": "positive",
            "PublishDate": 1768982355798,
            "Source": "co_actions_results"
        },
        {
            "Title": "RIL Shares Hit 5-Year Oversold Low Amid Challenges",
            "Summary": "Reliance Industries shares reach most oversold level in five years with RSI at 24.4, following 11% decline and $29 billion market cap erosion amid retail slowdown and crude oil concerns.",
            "Sentiment": "negative",
            "PublishDate": 1768969172770,
            "Source": "stocks"
        },
        {
            "Title": "RIL shares fall 3.5% to 3-month low post Q3 results",
            "Summary": "Reliance Industries shares dropped 3.50% to ₹1,406.30, hitting a three-month low after reporting flat Q3 FY26 numbers. The stock opened lower and extended losses during trading.",
            "Sentiment": "negative",
            "PublishDate": 1768838372195,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Industries Block Trade Worth ₹23.11 Crores",
            "Summary": "Reliance Industries executed a significant NSE block trade involving 162,312 shares at ₹1,423.90 per share, totaling ₹23.11 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768799166511,
            "Source": "co_actions_results"
        },
        {
            "Title": "CLSA Sets ₹1,650 Target Price for Reliance Industries",
            "Summary": "CLSA maintains outperform rating on Reliance Industries with a target price of ₹1,650, indicating positive outlook for the oil-to-petrochemicals conglomerate.",
            "Sentiment": "positive",
            "PublishDate": 1768798973163,
            "Source": "stocks"
        },
        {
            "Title": "RIL Q3 Results: Revenue Up 11% YoY, Profit Rises Marginally",
            "Summary": "Reliance Industries reports Q3 revenue of ₹2.69 lakh crore (up 11% YoY) and net profit of ₹18,645 crore (up 0.56% YoY), with strong O2C and Jio performance driving EBITDA growth of 6% to ₹50,932 crore. Expert analysis shows results in line with Street expectations.",
            "Sentiment": "positive",
            "PublishDate": 1768794217450,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Executive Warns of Oil Market Oversupply",
            "Summary": "Reliance Industries executive highlights concerns about potential oil market oversupply in 2026 and its impact on crude oil pricing dynamics in the global energy sector.",
            "Sentiment": "negative",
            "PublishDate": 1768577362083,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Refining Capacity Analysis",
            "Summary": "Analysis of Reliance Industries' refining operations highlights potential margin improvements from new capacity additions and unplanned closures, while regional overcapacity poses near-term challenges.",
            "Sentiment": "neutral",
            "PublishDate": 1768574097228,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Forecasts Oil Demand Rise",
            "Summary": "Reliance Industries predicts global oil demand will increase by 0.9 million barrels per day in 2026, driven by increased stockpiles in China and growing demand from India.",
            "Sentiment": "positive",
            "PublishDate": 1768574047424,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Advances Solar & Battery Manufacturing",
            "Summary": "RIL on track to commission 10 GWp solar giga factory, scaling to 20 GWp, while building 40 GWh battery manufacturing capacity with plans to reach 100 GWh annually.",
            "Sentiment": "positive",
            "PublishDate": 1768573945928,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Reports ₹1.17 Trillion Net Debt",
            "Summary": "Reliance Industries disclosed net debt of ₹1.17 trillion as of December 31, highlighting the company's current financial position and debt levels in its latest financial disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1768573460751,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Retail Q3: Profit Up 3% to ₹3,551 Cr",
            "Summary": "Reliance Retail reported 3% YoY profit growth to ₹3,551 crore with 9% revenue increase to ₹86,951 crore in Q3, adding 431 new stores.",
            "Sentiment": "positive",
            "PublishDate": 1768571799597,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Industries Block Trade Worth ₹64.95 Crores",
            "Summary": "Reliance Industries executed a significant block trade on NSE involving 445,406 shares valued at ₹64.95 crores at ₹1,458.30 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768550685349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Industries Block Trade Worth ₹75.66 Crores",
            "Summary": "Reliance Industries executed a significant NSE block trade involving 516,214 shares at ₹1,465.60 per share, totaling ₹75.66 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768547464519,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Industries Block Trade Worth ₹53.38 Crores",
            "Summary": "Reliance Industries executed a significant block trade on NSE involving 363,932 shares at ₹1,466.80 per share, totaling ₹53.38 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768545869630,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Industries Block Trade Worth ₹74.16 Crores",
            "Summary": "Reliance Industries executed a significant block trade on NSE involving 503,239 shares at ₹1,473.60 per share, totaling ₹74.16 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768544114176,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Industries Block Trade Worth ₹41.88 Crores",
            "Summary": "Reliance Industries witnessed a significant block trade on NSE involving 286,134 shares at ₹1,463.50 per share, totaling ₹41.88 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768535912652,
            "Source": "co_actions_results"
        },
        {
            "Title": "RIL Q3 Results Today: 5 Key Things to Track",
            "Summary": "Reliance Industries reports Q3 results today with refining margins expected to surge 30% while retail faces quick commerce losses. Analysts project modest consolidated growth with O2C offsetting retail weakness.",
            "Sentiment": "neutral",
            "PublishDate": 1768532564779,
            "Source": "co_actions_results"
        },
        {
            "Title": "RIL Q3 Preview: O2C, Jio to drive growth amid retail lag",
            "Summary": "Brokerages expect RIL's Q3 revenue to grow 8% YoY with 7% profit growth, driven by strong oil-to-chemicals and digital businesses, while retail remains weak and upstream faces pressure.",
            "Sentiment": "positive",
            "PublishDate": 1768464804876,
            "Source": "co_actions_results"
        },
        {
            "Title": "RIL Q3 Preview: Stable Earnings Expected",
            "Summary": "Reliance Industries expected to report stable Q3FY26 results with 1% revenue growth to ₹2,57,038 cr and 6% net profit rise to ₹19,271 cr, driven by strong O2C performance despite weak oil & gas segment.",
            "Sentiment": "neutral",
            "PublishDate": 1768377713811,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance shares drop 7% in 2026, loses ₹1.4L cr",
            "Summary": "Reliance Industries faces market cap erosion amid Russian crude concerns and retail slowdown. Brokerages remain optimistic on Q3 results and 2026 catalysts including Jio IPO.",
            "Sentiment": "neutral",
            "PublishDate": 1768363674006,
            "Source": "stocks"
        },
        {
            "Title": "RIL Q3 Preview: O2C Growth Expected, Oil & Gas Weak",
            "Summary": "Reliance Industries anticipated to show strong O2C performance in Q3FY26 driven by improved refining margins, while oil and gas segment expected to remain under pressure per Jefferies estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1768308043053,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Industries shares decline 2%, down 8% in 2025",
            "Summary": "Reliance Industries shares fell 2.3% to ₹1,448.00 amid broader weakness, declining 8% year-to-date ahead of Q3FY26 results on January 16. Analysts maintain buy ratings with support at ₹1,440.00-1,450.00.",
            "Sentiment": "negative",
            "PublishDate": 1768296955320,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Affirms Battery Manufacturing Plans On Track",
            "Summary": "Reliance Industries reaffirms its battery storage manufacturing plans remain unchanged, targeting 2026 for cell production with 40 GWh capacity at Jamnagar facility worth ₹75,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768232914475,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries: Battery plans, Venezuela oil talks",
            "Summary": "Reliance Industries denies pausing Li-ion battery plans, seeks US approval for Venezuelan crude imports, and announces ₹7 lakh crore investment in Gujarat over five years.",
            "Sentiment": "neutral",
            "PublishDate": 1768222413551,
            "Source": "stocks"
        },
        {
            "Title": "RIL Denies Battery Manufacturing Plans Paused",
            "Summary": "Reliance Industries refutes Bloomberg report claiming lithium-ion battery cell manufacturing plans were paused due to Chinese technology access issues, stating plans remain unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1768208259935,
            "Source": "stocks"
        },
        {
            "Title": "RIL Affirms Battery Manufacturing Plans on Track",
            "Summary": "Reliance Industries categorically denies reports of halting lithium-ion battery cell production plans in India, reaffirms commitment to world-leading battery storage manufacturing ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1768203332374,
            "Source": "stocks"
        },
        {
            "Title": "RIL shares fall 8% in 2026 ahead of Q3 results",
            "Summary": "Reliance Industries shares declined 8% in 2026, trading at ₹1,451. Goldman Sachs maintains Buy rating with ₹1,835 target. Q3FY26 results due January 16 with mixed segment outlook expected.",
            "Sentiment": "neutral",
            "PublishDate": 1768203285531,
            "Source": "co_actions_results"
        },
        {
            "Title": "RIL Confirms Battery Storage Manufacturing Plans",
            "Summary": "Reliance Industries spokesperson reaffirms commitment to developing comprehensive battery storage manufacturing capabilities, covering production from individual cells to complete containerised energy storage systems.",
            "Sentiment": "positive",
            "PublishDate": 1768199281669,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Pauses Battery Cell Plans After China Tech Deal Fails",
            "Summary": "Reliance Industries has halted lithium-ion battery cell manufacturing plans in India after failing to secure Chinese technology from Xiamen Hithium Energy Storage Technology Co., reflecting challenges in building independent clean-energy supply chains.",
            "Sentiment": "negative",
            "PublishDate": 1768190598005,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Plans ₹7 Lakh Crore Gujarat Investment",
            "Summary": "Mukesh Ambani announces massive ₹7 lakh crore investment commitment in Gujarat over five years, focusing on clean energy, renewable power, AI-ready data centers, and digital infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1768189515514,
            "Source": "stocks"
        },
        {
            "Title": "Reliance halts cell manufacturing plans",
            "Summary": "Reliance Industries has decided to halt its cell manufacturing plans following an unsuccessful attempt to acquire technology from China, marking a significant shift in the company's manufacturing strategy.",
            "Sentiment": "negative",
            "PublishDate": 1768188282599,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Plans ₹7 Trillion Gujarat Investment",
            "Summary": "Reliance Industries Chairman announces massive ₹7 trillion investment commitment in Gujarat over the next five years, marking one of the largest corporate investment pledges in the state.",
            "Sentiment": "positive",
            "PublishDate": 1768187365599,
            "Source": "stocks"
        },
        {
            "Title": "Reliance to buy Venezuelan crude from US at premium",
            "Summary": "Expert questions Reliance Industries' decision to purchase Venezuelan crude oil from the US at higher costs than Middle Eastern alternatives, suggesting political motivations behind the move.",
            "Sentiment": "neutral",
            "PublishDate": 1768153811004,
            "Source": "stocks"
        },
        {
            "Title": "RIL seeks US permit to buy Venezuelan crude oil",
            "Summary": "Reliance Industries is reportedly seeking U.S. authorisation to resume purchasing Venezuelan crude oil, marking a significant shift in the company's energy procurement strategy according to Reuters sources.",
            "Sentiment": "neutral",
            "PublishDate": 1767985844443,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Loses $15B Market Cap in 2026",
            "Summary": "Reliance Industries shares plunge over 6% in early 2026, wiping $15 billion from market value amid weak retail outlook concerns and potential US sanctions on Russian oil purchases.",
            "Sentiment": "negative",
            "PublishDate": 1767963935085,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries Shares Drop 6% Amid Retail Concerns",
            "Summary": "Reliance Industries faces a challenging start to 2026 with shares declining over 6%, wiping $15 billion from market value due to weak retail outlook and US rhetoric on Russian oil purchases.",
            "Sentiment": "negative",
            "PublishDate": 1767957368261,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Industries loses $15 billion market cap",
            "Summary": "Reliance Industries shares fell over 6% in early 2026, wiping $15 billion from market value amid weak retail outlook concerns and potential US legislation targeting Russian oil buyers.",
            "Sentiment": "negative",
            "PublishDate": 1767956332123,
            "Source": "stocks"
        }
    ]
}