{
    "Symbol": "RELIABLE",
    "ISIN": "INE375Y01018",
    "News": [
        {
            "Title": "Reliable Data Services Board Meet on Feb 14, 2026",
            "Summary": "Reliable Data Services Limited schedules 5th board meeting for February 14, 2026 to approve Q3FY26 financial results and appoint new independent director Bhoomika Aditya Gupta.",
            "Sentiment": "neutral",
            "PublishDate": 1770716874509,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliable Data Services Promoter Anshu Jha Sells 12,100 Equity Shares",
            "Summary": "Promoter Anshu Jha sold 12,100 equity shares of Reliable Data Services Limited through open market transactions on November 25, 2025. Following the sale, Jha's shareholding decreased from 26,436 shares (0.26%) to 14,336 shares (0.13%) in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764310056524,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliable Data Services: Promoter Meenakshi Pathak Sells 19,000 Equity Shares",
            "Summary": "Meenakshi Pathak, a promoter of Reliable Data Services Limited, sold 19,000 equity shares through open market transactions on November 20, 2025. Her shareholding decreased from 19,436 shares (0.18%) to 436 shares (0.004%) of the company's total equity capital of Rs. 10.32 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763969681483,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliable Data Services Allots 10 Lakh Convertible Warrants in Kandarp DigiSmart BPO",
            "Summary": "Reliable Data Services Limited has been allotted 10,00,000 convertible warrants of Kandarp DigiSmart BPO Limited at ₹104.50 per warrant on November 17, 2025. The company paid 25% of the warrant price (₹26.125 per warrant) upfront, with the remaining ₹78.375 per warrant payable upon conversion to equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763465950039,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliable Data Services Reports Q2 Results and Reconstitutes Audit Committee",
            "Summary": "Reliable Data Services Limited approved unaudited standalone and consolidated financial results for the quarter ended September 30, 2025, with the board meeting held on November 14, 2025. The company also reconstituted its Audit Committee with new members including Ms. Sudeshana Asis Chaudhury as Chairman and is evaluating two candidates for Independent Director positions.",
            "Sentiment": "neutral",
            "PublishDate": 1763173571420,
            "Source": "earnings"
        },
        {
            "Title": "GST Officials Inspect Reliable Data Services Office, Company Receives Summon",
            "Summary": "GST officials conducted an inspection at Reliable Data Services' office on September 29. The company received a summon on September 30, the day following the inspection.",
            "Sentiment": "negative",
            "PublishDate": 1759324379735,
            "Source": "stock"
        },
        {
            "Title": "Data Services Ltd Sets Record Date for Final Dividend of ₹0.04 Per Share",
            "Summary": "Data Services Ltd has set September 12, 2025 as the record date for determining shareholder eligibility for a final dividend of ₹0.04 per equity share (0.4% on par value of ₹10 per share) for the financial year ended March 31, 2025. The dividend is subject to approval at the Annual General Meeting scheduled for September 29, 2025. If approved, the dividend will be paid within 30 days from the AGM date. The board of directors has recommended this final dividend to eligible shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1756290037495,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliable Data Services Board Approves Quarterly Results, Director Reappointments, and Rs 0.04 Final Dividend",
            "Summary": "Reliable Data Services Ltd held a board meeting on August 14, 2025, approving quarterly financial results for the period ended June 30, 2025. The board recommended a final dividend of Rs 0.04 per equity share, totaling Rs 4,12,900. Key appointments include reappointment of Mr. Anil Kumar Jha as director, and Mr. Pramod Kumar Tiwari and Mrs. Anita Jha as independent directors. The company appointed M/s. KARMV & Co. as statutory auditors and M/s. Neha Mehra & Associates as secretarial auditors for five-year terms from 2025-26 to 2029-30. The Annual General Meeting is scheduled for September 29, 2025, via video conferencing, with book closure from September 19-29, 2025. Standalone quarterly revenue reached Rs 2,840.85 lakhs with operating income of Rs 125.05 lakhs, while consolidated revenue was Rs 3,945.45 lakhs with operating income of Rs 227.26 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1755174795983,
            "Source": "corporate_action"
        }
    ]
}