{
    "Symbol": "RELTD",
    "ISIN": "INE206N01018",
    "News": [
        {
            "Title": "Ravindra Energy Corrects Swap Station Data in Q2-Q3 Update",
            "Summary": "Ravindra Energy Limited corrects operating swap station numbers for Q2-Q3 FY26 and provides comprehensive business update on renewable energy projects and electric vehicle operations.",
            "Sentiment": "neutral",
            "PublishDate": 1769325202832,
            "Source": "stocks"
        },
        {
            "Title": "Ravindra Energy Q3FY26 Business Update Announced",
            "Summary": "Ravindra Energy Limited announces business update for Q3FY26 with 187 MW operational renewable capacity and electric vehicle operations showing 55 units sold in Q3FY26.",
            "Sentiment": "positive",
            "PublishDate": 1768535235703,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ravindra Energy Q3FY26 Results Show Strong Growth",
            "Summary": "Ravindra Energy Limited reported robust Q3FY26 results with standalone revenue rising 162% YoY to ₹1,021.59 million and net profit surging 223% to ₹192.37 million, driven by strong solar segment performance.",
            "Sentiment": "positive",
            "PublishDate": 1768485916992,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ravindra Energy surges 11% on HESCOM solar deal",
            "Summary": "Ravindra Energy shares jumped 11% after securing 13 LoAs from HESCOM to develop 62 MW solar projects in Karnataka under BOO model with ₹225 crore investment and 25-year power purchase agreement.",
            "Sentiment": "positive",
            "PublishDate": 1767957914325,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ravindra Energy Wins 62 MW Solar Projects Worth ₹225 Cr",
            "Summary": "Ravindra Energy Limited secured 13 solar project awards from HESCOM totaling 62 MW capacity with 25-year power purchase agreements. The projects are estimated to cost ₹225 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767945248316,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ravindra Energy Wins 62 MW Solar Projects Worth ₹225 Cr",
            "Summary": "Ravindra Energy Limited secured 13 Letter of Awards from HESCOM for 62 MW solar power projects under Build Own & Operate model with 25-year PPA at ₹2.95 per unit tariff.",
            "Sentiment": "positive",
            "PublishDate": 1767944970412,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ravindra Energy Seeks Shareholder Approval for ₹1,300 Crore Financial Assistance to Associate Entity",
            "Summary": "Ravindra Energy Limited has issued a postal ballot notice seeking shareholder approval for three key resolutions including appointment of Apurva Chandra as independent director and increasing financial assistance limit to Energy In Motion Limited from ₹300 crores to ₹1,300 crores. The company proposes to provide loans, guarantees, and securities to its associate entity EIM, which operates in the electric vehicle business, with e-voting scheduled from December 7, 2025 to January 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765028580927,
            "Source": "corporate_action"
        },
        {
            "Title": "Ravindra Energy Limited Schedules Board Meeting for Committee Reconstitution and Director Appointment",
            "Summary": "Ravindra Energy Limited has scheduled a Board of Directors meeting for December 5, 2025, to reconstitute committees following Robert Taylor's resignation as Independent Director and to approve a postal ballot notice for appointing Apurva Chandra as Independent Director. The meeting addresses governance changes affecting the company's board structure and seeks shareholder approval for the new directorial appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1764680147601,
            "Source": "corporate_action"
        },
        {
            "Title": "Ravindra Energy Independent Director Robert Taylor Resigns",
            "Summary": "Ravindra Energy announced the resignation of Independent Director Robert Taylor from the company's board. The departure affects the company's board composition and independent oversight structure.",
            "Sentiment": "neutral",
            "PublishDate": 1764252670100,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ravindra Energy Reports Business Update with 187.3 MW Operating Capacity and Electric Vehicle Expansion",
            "Summary": "Ravindra Energy Limited announced its business update covering renewable energy and electric vehicle operations. The company's operating capacity stands at 187.3 MW, having commissioned 100 MW AC/135 MW DC under MSKVY Phase 1 and 11 MW of open access projects. Under construction projects include 45 MW AC/58 MW DC with targeted completion by March 2026. The company has 182 MW AC/227 MW DC under development, including 120 MW AC projects from MSEDCL and 62 MW AC from HESCOM. In the electric vehicle segment, Ravindra Energy commissioned two swap stations in JNPA Port and NCR, sold 91 e-tractors with a total order book of 185 e-tractors, and received a contract from India's largest cement company for transporting 50,000 MT per month. For H1 FY2025-26, the EV business generated revenue of Rs 44.7 crore with gross margin of Rs 3.9 crore but reported a loss of Rs 1.7 crore. Consolidated results show total revenue from operations of Rs 143.55 crore and profit after tax of Rs 38.65 crore. The company's net worth stands at Rs 393.8 crore with total external borrowings of Rs 388.67 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762376860463,
            "Source": "stock"
        },
        {
            "Title": "Ravindra Energy Reports Fund Utilization Deviation in Rs. 180 Crore Preferential Issue",
            "Summary": "Ravindra Energy Limited filed a statement showing deviation in fund utilization for its Rs. 180 crore preferential issue of equity shares for the quarter ended September 30, 2025. The company raised Rs. 179.99 crore and reported modifications in fund allocation across three business segments. Investment in Renewable Energy Business was reallocated from Rs. 90 crore to Rs. 95.50 crore, with Rs. 85.50 crore utilized. Investment in Electrical Vehicle Business allocation was reduced from Rs. 60 crore to Rs. 54.50 crore, with Rs. 46.51 crore utilized. General Corporate Purpose allocation remained unchanged at Rs. 30 crore with Rs. 29.98 crore utilized. Total funds utilized stood at Rs. 171.99 crore. The company stated that up to 10% deviation in fund utilization was pre-approved by shareholders, with the Rs. 5.50 crore reallocation falling within this approved limit.",
            "Sentiment": "neutral",
            "PublishDate": 1762364562725,
            "Source": "corporate_action"
        },
        {
            "Title": "Ravindra Energy Appoints Apurva Chandra as Independent Director",
            "Summary": "Ravindra Energy Limited appointed Mr. Apurva Chandra (DIN: 02531655) as an Additional Director under Non-Executive Independent Director category for a five-year term from November 5, 2025 to November 4, 2030. The appointment was made based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval. Chandra is a senior Indian Administrative Service (IAS) officer of the 1988 Maharashtra cadre with over 36 years of experience in public administration, policy formulation and industrial development. He has served as Secretary in multiple ministries including Health Family Welfare, Information Broadcasting, and Labour Employment, and held board positions in government entities like GAIL India Limited, Petronet LNG, and Mahanagar Gas Limited. He holds engineering qualifications from IIT Delhi and additional certifications in business finance and accountancy.",
            "Sentiment": "positive",
            "PublishDate": 1762351028889,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ravindra Energy Reports Mixed Q2 Results with Higher Profit Despite Revenue Decline",
            "Summary": "Ravindra Energy reported Q2 consolidated net profit of 308 million rupees, up from 228 million rupees year-over-year. However, revenue declined to 1.2 billion rupees from 1.63 billion rupees in the same period last year. EBITDA increased to 372 million rupees from 279 million rupees year-over-year, while EBITDA margin improved significantly to 30.95% from 17.14% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762350231409,
            "Source": "earnings"
        },
        {
            "Title": "Ravindra Energy Secures Financing for 120 MW Solar Projects in Maharashtra",
            "Summary": "Ravindra Energy has secured two loans to develop 120 MW of solar projects in Maharashtra. The financing will support the company's solar energy development initiatives in the state.",
            "Sentiment": "positive",
            "PublishDate": 1759508331734,
            "Source": "stock"
        },
        {
            "Title": "Ravindra Energy Secures 120 MW Solar Project Awards from Maharashtra State Electricity Distribution Company",
            "Summary": "Ravindra Energy Limited received two Letter of Awards from Maharashtra State Electricity Distribution Company Limited to develop and operate 120 MW(AC) of decentralized feeder level solar projects in Maharashtra. The projects are spread across 23 sub-stations and include a 25-year Power Purchase Agreement. The projects fall under the 'Mukhyamantri Saur Krushi Vahini Yojana 2.0' scheme for feeder level solarisation under Component C of PM-KUSUM Scheme.",
            "Sentiment": "positive",
            "PublishDate": 1759506980870,
            "Source": "stock"
        },
        {
            "Title": "Ravindra Energy Board Approves Salary Hike for Whole-time Director Dr. Vidya Murkumbi",
            "Summary": "Ravindra Energy Limited's Board of Directors approved an increase in remuneration for Dr. Vidya Murkumbi, Whole-time Director, from Rs. 1.01 Crore to Rs. 3 Crore per annum. The decision was made following approval from shareholders at the 45th Annual General Meeting through a special resolution and recommendation from the Nomination and Remuneration Committee. In addition to her current salary, the company will provide rent-free accommodation as a perquisite. The total compensation including salary and perquisites remains within the revised limit of Rs. 3 Crore.",
            "Sentiment": "positive",
            "PublishDate": 1758989039780,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ravindra Energy Promoter Gifts 2.5 Lakh Shares to Daughter",
            "Summary": "Ravindra Energy Limited promoter Mrs. Supriya Rojekar will gift 2,50,000 equity shares to her daughter Miss. Aryaa Rojekar on September 29, 2025. The shares represent 0.14% of the company's total capital and will be transferred as an off-market gift transaction with no monetary consideration. The acquisition is being made under SEBI regulations governing immediate relative transactions and is exempt from open offer requirements. Miss. Aryaa Rojekar was not previously a promoter or member of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1758521028943,
            "Source": "corporate_action"
        },
        {
            "Title": "Ravindra Energy Submits Investor Presentation Ahead of September 22 Analyst Meeting",
            "Summary": "Ravindra Energy Limited submitted an investor presentation to stock exchanges for an Analyst/Investor Meeting scheduled for September 22, 2025. The company operates in renewable energy and electric vehicle businesses, with Rs 250 crore revenue and Rs 42 crore EBITDA for FY25. The renewable energy division has 158 MWp operational capacity, 87 MWp under construction, and 258 MWp under development, targeting 1 GW by March 2028. The electric vehicle business, through subsidiary EIM (49.5% held), focuses on heavy-duty electric tractors with 125 e-tractors sold and homologation completed for 55-ton EV tractors. The company has signed an exclusive 6-year agreement with China-based FOTON for electric commercial vehicles and plans to establish an assembly plant in Pune with Rs 100 crore first-phase investment. Financial projections show revenue growing from Rs 250 crore in FY25 to Rs 800 crore in FY27, with EBITDA increasing from Rs 42 crore to Rs 127 crore over the same period.",
            "Sentiment": "positive",
            "PublishDate": 1758393208841,
            "Source": "stock"
        },
        {
            "Title": "Ravindra Energy's EIM Proposes 10 Billion Rupee Investment for Electric Truck Manufacturing Partnership with Maharashtra",
            "Summary": "Ravindra Energy's EIM is planning a partnership with Maharashtra state for electric truck manufacturing. The company has proposed an investment of 10 billion rupees for this venture.",
            "Sentiment": "positive",
            "PublishDate": 1756454876834,
            "Source": "stock"
        },
        {
            "Title": "Ravindra Energy Board Approves Fundraising Plan of Up To ₹500 Crores",
            "Summary": "Ravindra Energy's board has approved a plan to raise up to ₹500 crores through equity and convertible securities. The fundraising will involve issuing equity shares and convertible securities to generate capital for the company.",
            "Sentiment": "positive",
            "PublishDate": 1756454548362,
            "Source": "corporate_action"
        },
        {
            "Title": "Bayer CropScience Reports Strong Q1 Performance with ₹1,915 Crores Revenue and ₹279 Crores Net Profit",
            "Summary": "Bayer CropScience Limited, a leading agrochemical and biotechnology company in India, reported quarterly results for the period ended June 30, 2025. The company achieved total income from operations of ₹1,914.6 crores, with net profit before tax at ₹335.2 crores and net profit after tax of ₹278.7 crores. Total comprehensive income stood at ₹278.3 crores. The company's earnings per share (basic and diluted) was ₹62.01. The company's equity share capital was ₹44.9 crores with reserves of ₹2,805.5 crores. The results showed 17.4% year-on-year revenue growth and 9.6% year-on-year increase in net profit. Bayer CropScience operates in manufacturing and sale of crop protection products, seeds, and agricultural solutions.",
            "Sentiment": "positive",
            "PublishDate": 1754742866465,
            "Source": "earnings"
        },
        {
            "Title": "Ravindra Energy Reports Minor Fund Allocation Changes in Rs 180 Crore Preferential Issue",
            "Summary": "Ravindra Energy Limited filed a statement showing minor deviations in fund utilization from its Rs 180 crore preferential issue raised in October 2024. The company utilized Rs 169.98 crores out of the total funds raised. Fund allocation was modified within approved limits: renewable energy business received Rs 93.48 crores (originally Rs 90 crores), electrical vehicle business got Rs 46.52 crores (originally Rs 60 crores), and general corporate purposes used Rs 29.98 crores (originally Rs 30 crores). The modifications fall within the 10% deviation limit pre-approved by shareholders on October 5, 2024. India Ratings and Research Private Limited serves as the monitoring agency for the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1754496670700,
            "Source": "corporate_action"
        },
        {
            "Title": "Ravindra Energy Reports Strong Q1 Growth with Revenue Surging to 1.63B Rupees",
            "Summary": "Ravindra Energy delivered strong quarterly results with consolidated net profit rising to 228 million rupees compared to 56 million rupees in the same period last year. Revenue increased significantly to 1.63 billion rupees from 227 million rupees year-over-year. EBITDA grew to 279 million rupees versus 73 million rupees in the previous year. However, EBITDA margin compressed to 17.14% from 32.24% in the comparable period.",
            "Sentiment": "positive",
            "PublishDate": 1754490845355,
            "Source": "earnings"
        },
        {
            "Title": "Ravindra Energy's Associate Company Completes First Commercial Sale of India's First Battery-Swappable 55-Ton Electric Tractor",
            "Summary": "Ravindra Energy Limited's associate company Energy in Motion Private Limited has received ARAI certification and completed the first commercial sale of its 55-ton electric tractor named 'Ashwa'. The vehicle received CMVR Type Approval Certificate from the Automotive Research Association of India and necessary approvals via the VAHAN portal for commercial sale and registration. This marks the beginning of the company's go-to-market phase and establishes Ashwa as India's first battery-swappable, fully certified 55-ton electric tractor compliant with CMVR norms. Energy in Motion is an associate venture with 49.5% shareholding by Ravindra Energy Limited. The company's business model involves selling electric tractors without battery packs to transporters while providing battery packs, charging infrastructure, and energy supply through long-term contracts.",
            "Sentiment": "positive",
            "PublishDate": 1754056515715,
            "Source": "stock"
        },
        {
            "Title": "Ravindra Energy Sells 79% Stake in Hirehalli Solar Power Project LLP",
            "Summary": "Ravindra Energy has divested its entire 79% stake in Hirehalli Solar Power Project LLP for ₹10.25 crores. As a result of this sale, Hirehalli Solar Power Project LLP is no longer a subsidiary of Ravindra Energy.",
            "Sentiment": "neutral",
            "PublishDate": 1749693971000,
            "Source": "default"
        },
        {
            "Title": "Ravindra Energy Reports Q4 Results and Subsidiary's EV Agreement",
            "Summary": "Ravindra Energy's associate company, Energy in Motion, has signed an exclusive agreement with Beiqi Foton Motor Co. Ltd. to launch electric heavy commercial vehicles in India. For Q4, Ravindra Energy reported consolidated net profit of 129 million rupees, compared to a loss of 634 million rupees year-over-year and a profit of 22 million rupees quarter-over-quarter. Q4 revenue was 1.6 billion rupees, up from 301 million rupees year-over-year. EBITDA for Q4 was 274 million rupees, an increase from 85 million rupees year-over-year, while the EBITDA margin decreased to 17.23% from 28.4% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748360822000,
            "Source": "default"
        },
        {
            "Title": "Ravindra Energy's UAE Subsidiary Receives Final Closure Order",
            "Summary": "Ravindra Energy has announced that its subsidiary, Renuka Energy Resource Holdings FZE, located in the Sharjah Airport International Free Zone, has been issued a final closure order by the Sharjah Airport International Free Zone Authority, which is part of the Government of Sharjah, United Arab Emirates.",
            "Sentiment": "neutral",
            "PublishDate": 1745332781000,
            "Source": "default"
        },
        {
            "Title": "Ravindra Energy Trials Heavy Vehicle Battery Swapping Station",
            "Summary": "Ravindra Energy has initiated a trial for India's first heavy vehicle battery swapping station. The trial, which began on September 24, involves six heavy electric vehicles. The company anticipates a commercial rollout of this technology in May 2025.",
            "Sentiment": "positive",
            "PublishDate": 1739262096000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ravindra Energy Reports Q3 EBITDA and Margin Decline",
            "Summary": "Ravindra Energy has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 72 million rupees, slightly down from 74 million rupees in the same quarter last year. The EBITDA margin saw a significant decrease, dropping to 13.6% from 44.85% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738756200000,
            "Source": "earnings"
        },
        {
            "Title": "Ravindra Energy Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "Ravindra Energy has announced its financial results for the third quarter. The company's consolidated net profit increased to 22 million rupees, up from 4 million rupees in the same period last year. Revenue also saw a substantial rise, reaching 531 million rupees compared to 165 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738756196000,
            "Source": "earnings"
        },
        {
            "Title": "Ravindra Energy Awarded 44 MW Solar Project Contract",
            "Summary": "Ravindra Energy has been awarded a contract to develop 44 MW of solar projects. The company announced that the average Power Purchase Agreement (PPA) tariff for these projects has been set at 3.10 rupees per unit.",
            "Sentiment": "positive",
            "PublishDate": 1737073214000,
            "Source": "order&deals"
        },
        {
            "Title": "Ravindra Energy Awarded 44 MW Solar Project Contract",
            "Summary": "Ravindra Energy has been awarded a contract to develop 44 MW of solar projects. The company has secured a Power Purchase Agreement (PPA) with an average tariff of 3.10 rupees per unit for these projects. This development represents a significant opportunity for Ravindra Energy to expand its renewable energy portfolio and contribute to India's solar power generation capacity.",
            "Sentiment": "positive",
            "PublishDate": 1737033618000,
            "Source": "order&deals"
        },
        {
            "Title": "Ravindra Energy Approves Incorporation of Six Wholly Owned Subsidiaries",
            "Summary": "Ravindra Energy Limited has approved the incorporation of six new wholly owned subsidiary companies. This decision represents a significant expansion of the company's corporate structure, potentially aimed at diversifying operations or streamlining business segments.",
            "Sentiment": "positive",
            "PublishDate": 1736468267000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ravindra Energy Approves Incorporation of Six Wholly Owned Subsidiaries",
            "Summary": "Ravindra Energy Limited has approved the incorporation of six new wholly owned subsidiary companies. This corporate action suggests an expansion or restructuring of the company's operations, potentially to diversify its business or streamline specific functions into separate entities.",
            "Sentiment": "positive",
            "PublishDate": 1736424630000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ravindra Energy: Raises ₹1.79 Billion Through Share Sale",
            "Summary": "Ravindra Energy raised ₹1.79 billion by selling 24.3 million equity shares at ₹74 per share to 29 non-promoter entities. The funds will be used to scale up existing assets and develop decarbonization solutions for corporate clients.",
            "Sentiment": "positive",
            "PublishDate": 1729228655348,
            "Source": "corporate_action"
        },
        {
            "Title": "Mukul Agrawal Acquires 1.21% Stake in Ravindra Energy",
            "Summary": "Investor Mukul Agrawal has appeared in the shareholding pattern of Ravindra Energy Limited, holding a 1.21% stake in the company as of Q2.",
            "Sentiment": "neutral",
            "PublishDate": 1729220734000,
            "Source": "normal_news"
        }
    ]
}