{
    "Symbol": "REMSONSIND",
    "ISIN": "INE474C01023",
    "News": [
        {
            "Title": "Remsons Industries Q3FY26 Revenue Grows 20% YoY",
            "Summary": "Remsons Industries reports strong Q3FY26 performance with revenue up 20% YoY to ₹1,231 million, EBITDA at ₹147 million (18% growth), and net PAT rising 29% to ₹51 million.",
            "Sentiment": "positive",
            "PublishDate": 1770894297062,
            "Source": "stocks"
        },
        {
            "Title": "Remsons Industries Wins ₹60 Cr Gear Shifter Contract",
            "Summary": "Remsons Industries secured a ₹60 crore business award from a leading Commercial Vehicle OEM manufacturer for supply of Gear Shifter with Push Pull Cables over 60 months starting Q1 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1767328746278,
            "Source": "co_actions_results"
        },
        {
            "Title": "Remsons Industries Reports 27% Revenue Growth, Secures Major Orders Worth ₹392 Crores",
            "Summary": "Remsons Industries delivered strong quarterly results with 27% revenue growth to ₹1,155 million, 77% EBITDA growth to ₹133 million, and 29% net profit growth to ₹40 million. The automotive components manufacturer secured significant contracts including ₹300 crores from Stellantis, ₹80 crores from Ford Turkey, and expanded manufacturing capacity with new facilities in Pune and planned NCR expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1763132680608,
            "Source": "earnings"
        },
        {
            "Title": "Remsons Industries Targets Rs. 900 Crore Revenue Through Manufacturing and Operations Enhancement",
            "Summary": "Remsons Industries has set a revenue target of Rs. 900 crore through improvements in manufacturing and operations. The company currently has a market capitalization of Rs. 470 crore.",
            "Sentiment": "positive",
            "PublishDate": 1758618279564,
            "Source": "stock"
        },
        {
            "Title": "Remsons Industries Discovers Additional 80,000 Square Feet of Land in NCR for Expansion",
            "Summary": "Remsons Industries announced the discovery of an additional 80,000 square feet of land in the National Capital Region, which the company plans to use for expansion purposes.",
            "Sentiment": "positive",
            "PublishDate": 1758617916409,
            "Source": "stock"
        },
        {
            "Title": "Remsons Industries Reports 30% Revenue Growth in Q1 FY26, Secures Major Stellantis Contract Worth Over ₹300 Crores",
            "Summary": "Remsons Industries Limited reported consolidated revenue of ₹99.6 crores for Q1 FY26, marking 30% year-on-year growth with 11% EBITDA margin. The company secured a significant contract from Stellantis North America valued at over ₹300 crores for controlled cables supply over seven years, with deliveries starting next financial year. The company acquired 36% stake in electric vehicle startup Astro Motors and inaugurated a new ₹5 crore railway manufacturing facility in Chakan, Pune. Several subsidiaries received international orders including ₹80 crores from Ford Turkey over 10 years and ₹12 crores from a German OEM. ICRA upgraded the company's credit rating from BBB to BBB+ for long-term facilities. The board approved dividend of ₹0.30 per share and the company incurred ₹5 crores capex during the quarter. Management maintains revenue target of ₹900-1,000 crores by FY29 with EBITDA margin expansion to 13-14%. Export growth and UK entity performance were key drivers for quarterly results.",
            "Sentiment": "positive",
            "PublishDate": 1755161845852,
            "Source": "earnings"
        },
        {
            "Title": "Remsons Industries Reports Mixed Q1 Results with Strong Consolidated Growth Despite Standalone Revenue Decline",
            "Summary": "Remsons Industries Limited, an automotive components manufacturer, reported contrasting performance in its quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company faced challenges with revenue from operations declining 7.65% to Rs. 6,626.94 lakhs and net profit falling 11.02% to Rs. 202.18 lakhs, while EPS dropped to Rs. 0.58 from Rs. 0.65. However, consolidated results showed robust growth with revenue from operations surging 30.23% to Rs. 9,963.06 lakhs and net profit jumping 73.11% to Rs. 363.88 lakhs, pushing consolidated EPS up to Rs. 1.04 from Rs. 0.60. The company expanded its business footprint by forming a new subsidiary, Remsons Edge Technologies Private Limited, and acquiring a 35.86% stake in Astro Motors Private Limited. The Board also approved the appointment of M/s. M Baldeva Associates as Secretarial Auditors for a five-year term from FY2025-26 to FY2029-30.",
            "Sentiment": "neutral",
            "PublishDate": 1754897984757,
            "Source": "earnings"
        },
        {
            "Title": "Remsons Industries Reports Strong Q1 Growth with 78% Jump in Net Profit",
            "Summary": "Remsons Industries delivered robust quarterly performance with consolidated net profit rising to 48 million rupees from 27 million rupees year-over-year. Revenue increased to 996 million rupees compared to 765 million rupees in the same period last year. EBITDA grew to 106 million rupees from 65 million rupees, while EBITDA margin improved to 10.6% from 8.49% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754897485628,
            "Source": "earnings"
        },
        {
            "Title": "Remsons Industries Subsidiary Secures INR 3 Crore Order from German OEM for EGR Sensors",
            "Summary": "Remsons-Uni Autonics Private Limited, a subsidiary of Remsons Industries Limited, has received a purchase order worth INR 3.00 crore from a German multi-brand OEM. The contract involves supplying Exhaust Gas Recirculation (EGR) sensors over a 36-month period, with deliveries scheduled to begin in December 2025. The order represents an international contract with no related party involvement or promoter group interest in the awarding entity.",
            "Sentiment": "positive",
            "PublishDate": 1754308009837,
            "Source": "order&deals"
        },
        {
            "Title": "Remsons Industries Unit Secures 30 Million Rupees Order From German OEM",
            "Summary": "Remsons Industries announced that one of its units has received an order worth 30 million rupees from a German original equipment manufacturer (OEM). The order represents new business for the company's manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1754307470490,
            "Source": "order&deals"
        },
        {
            "Title": "Remsons Industries Scales Back Astro Motors Acquisition, Will Hold 35.86% Stake Instead of Majority Control",
            "Summary": "Remsons Industries Limited has modified its acquisition strategy for Astro Motors Private Limited. The company will now acquire a 35.86% stake by subscribing to 62,500 new equity shares for Rs. 10 crore, making Astro an associate company rather than a subsidiary. The board cancelled the previously planned acquisition of 26,400 shares from existing promoters, which would have been paid through the issuance of 3,19,994 new Remsons shares at Rs. 132 per share. The cancellation was attributed to delays in setting up the assembly line. Remsons describes this as a long-term investment in Astro Motors.",
            "Sentiment": "neutral",
            "PublishDate": 1754306957463,
            "Source": "order&deals"
        },
        {
            "Title": "Remsons Industries Receives Revised Valuation Report for Astro Motors Acquisition",
            "Summary": "Remsons Industries Limited provided an update on its acquisition of a 51.01% stake in Astro Motors Private Limited. The company filed applications with BSE and NSE for in-principle approval to issue 3,19,994 equity shares at Rs. 132 per share to Astro Motors' existing promoters in exchange for acquiring 26,400 equity shares from them. Following NSE queries regarding valuation methodology weights, registered valuer Nikhil P. Chandak issued a revised valuation report. The revised report adjusted the weighted average fair value of Remsons' equity shares from Rs. 124.53 to Rs. 131.46 per share due to changes in weights assigned to various valuation methods. The issue price for the proposed preferential share allotment remains unchanged at Rs. 132 per share. The revised valuation used three methods: Market Value Method (55% weight at Rs. 131.72), DCF Method (35% weight at Rs. 159.50), and NAV Method (10% weight at Rs. 31.98).",
            "Sentiment": "neutral",
            "PublishDate": 1754283097400,
            "Source": "order&deals"
        },
        {
            "Title": "Remsons Industries Seeks Shareholder Approval for Rahul Kejriwal's Reappointment as Whole Time Director",
            "Summary": "Remsons Industries Limited has issued a postal ballot notice seeking shareholder approval for the reappointment of Mr. Rahul Kejriwal as Whole Time Director for a five-year term from June 1, 2025 to May 31, 2030. The proposed remuneration is Rs. 65.28 lakh per annum, compared to his previous remuneration of Rs. 61.15 lakh. Kejriwal, aged 46, has been associated with the company for over two decades and was first appointed as director on June 1, 2016. He holds 15,81,430 equity shares and is the son of Chairman & Managing Director Krishna Kejriwal and Whole Time Director Chand Kejriwal. Electronic voting will be conducted from July 31 to August 29, 2025, with results to be announced on August 30, 2025. The company operates as an Original Equipment Manufacturer supplying components to two, three and four-wheeler manufacturers in India and globally.",
            "Sentiment": "neutral",
            "PublishDate": 1753878078559,
            "Source": "corporate_action"
        },
        {
            "Title": "Remsons Industries Signs Technical License Agreement with Brazilian Company",
            "Summary": "Remsons Industries has announced a strategic technical license agreement with Ausus Automotive Systems Do Brasil Ltda, Brazil. The agreement involves technology transfer to support local OEMs (Original Equipment Manufacturers) in Brazil.",
            "Sentiment": "positive",
            "PublishDate": 1751241515000,
            "Source": "default"
        },
        {
            "Title": "Remsons Industries Signs Technical License Deal with Ausus Automotive Systems",
            "Summary": "Remsons Industries has entered into a technical license agreement with Ausus Automotive Systems in Brazil. The deal allows Remsons to share its technology for supporting local Original Equipment Manufacturers (OEMs) in Brazil.",
            "Sentiment": "positive",
            "PublishDate": 1751026084000,
            "Source": "default"
        },
        {
            "Title": "Remsons Industries Secures 800 Million Rupee Order",
            "Summary": "Remsons Industries has secured an order valued at 800 million rupees. No further details about the order or its nature were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751024125000,
            "Source": "default"
        },
        {
            "Title": "Remsons Industries Secures ₹12 Crore Order",
            "Summary": "Remsons Industries has received a new order valued at ₹12 crore. The project is expected to be completed quickly and is anticipated to contribute approximately 10% to the company's quarterly revenue.",
            "Sentiment": "positive",
            "PublishDate": 1749532457000,
            "Source": "default"
        },
        {
            "Title": "Remsons Industries Inaugurates New Manufacturing Facility",
            "Summary": "Remsons Industries has inaugurated a state-of-the-art manufacturing facility for locomotive applications. The new facility is designed to produce components for the railway sector.",
            "Sentiment": "positive",
            "PublishDate": 1748234085000,
            "Source": "default"
        },
        {
            "Title": "Remsons Industries Reports Q4 Revenue Increase",
            "Summary": "Remsons Industries has reported a quarterly revenue of 1.06 billion rupees, compared to 810 million rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1747803511000,
            "Source": "result"
        },
        {
            "Title": "Remsons Industries Reports Q4 Net Profit of Rs 46 Million",
            "Summary": "Remsons Industries has reported a consolidated net profit of Rs 46 million for the fourth quarter, compared to Rs 52 million in the same quarter of the previous year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1747803450000,
            "Source": "result"
        },
        {
            "Title": "Remsons Industries: Secures ₹300+ Crore Orders from Stellantis",
            "Summary": "Remsons Industries has received multiple orders worth over ₹300 crore from Stellantis N.V., North America for supplying control cables for Smart Cars, Jeep models, and three-wheelers. The contract will be executed over seven years, with deliveries starting next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1747284620000,
            "Source": "order&deals"
        },
        {
            "Title": "Remsons Industries Secures Record-Breaking Order Worth ₹300 Crore",
            "Summary": "Remsons Industries has announced receiving orders worth ₹300 crore, which the company states is the largest order in its history. This significant order value is notable considering the company's current market capitalization of ₹430 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747282198000,
            "Source": "default"
        },
        {
            "Title": "Remsons Industries Approves Acquisition of Majority Stake in Astro Motors",
            "Summary": "Remsons Industries has approved the acquisition of a 51.01% stake in Astro Motors. This strategic move represents a significant corporate action that could potentially expand Remsons Industries' business operations and market presence.",
            "Sentiment": "positive",
            "PublishDate": 1744178328000,
            "Source": "corporate_action"
        },
        {
            "Title": "Remsons Industries Board to Consider Fundraising",
            "Summary": "The board of directors of Remsons Industries will meet at a later date to discuss and decide on potential fundraising options for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1741087181000,
            "Source": "corporate_action"
        },
        {
            "Title": "Remsons Industries Reports Q3 Revenue Growth",
            "Summary": "Remsons Industries has announced its third-quarter revenue results. The company reported revenue of 1.03 billion rupees, compared to 822 million rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738910479000,
            "Source": "earnings"
        },
        {
            "Title": "Remsons Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "Remsons Industries has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 84 million rupees to 124 million rupees. Additionally, the EBITDA margin expanded from 10.22% to 12.09%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738910468000,
            "Source": "earnings"
        },
        {
            "Title": "Remsons Industries Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Remsons Industries has reported a consolidated net profit of 40 million rupees for the third quarter, compared to 34 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738910412000,
            "Source": "earnings"
        },
        {
            "Title": "Remsons Industries Acquires Majority Stake in UK's Bee Lighting",
            "Summary": "Remsons Industries' subsidiary, Remsons Holding Ltd., has acquired a 51% stake in Bee Lighting Ltd., a UK-based company, for approximately Rs. 30 crore (£3 million). This acquisition makes Bee Lighting a step-down subsidiary of Remsons Industries and is aimed at diversifying the company's product offerings in the automotive sector.",
            "Sentiment": "positive",
            "PublishDate": 1729347672000,
            "Source": "corporate_action"
        }
    ]
}