{
    "Symbol": "RENUKA",
    "ISIN": "INE087H01022",
    "News": [
        {
            "Title": "Shree Renuka Sugars Cuts Q3 Loss by 81% YoY",
            "Summary": "Shree Renuka Sugars significantly reduced its consolidated net loss to ₹383 million in Q3 from ₹2.04 billion in the previous year, despite revenue declining to ₹22.7 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770296127733,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Renuka Sugars Completes Share Acquisition in Subsidiary KBK Chem-Engineering",
            "Summary": "Shree Renuka Sugars Limited has completed the acquisition of shares in its wholly-owned subsidiary KBK Chem-Engineering Private Limited. The Board of Directors of KBK approved the allotment of 2,49,122 equity shares of Rs. 100 each at an issue price of Rs. 2,302.69 per share, totaling Rs. 573.65 million. The shares were issued on a rights basis to the parent company for cash consideration through conversion of an equivalent loan amount that Shree Renuka Sugars had previously extended to KBK.",
            "Sentiment": "neutral",
            "PublishDate": 1762884148779,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Renuka Sugars Reports Widened Net Loss and Revenue Decline in Q2",
            "Summary": "Shree Renuka Sugars reported a consolidated net loss of 3.69 billion rupees in Q2, significantly higher than the 231 million rupees loss in the same quarter last year. The company's revenue decreased to 24.23 billion rupees from 25.7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762436623361,
            "Source": "earnings"
        },
        {
            "Title": "Sugar Industry Faces Setback as Government Keeps Ethanol Prices Unchanged for 2025-26",
            "Summary": "The government maintained ethanol prices from sugar-based feedstocks at Rs 65.61 per litre for Ethanol Supply Year 2025-26, disappointing sugar companies who sought price parity with maize-based ethanol at Rs 66.07 per litre. Shree Renuka Sugars' Executive Chairman Atul Chaturvedi called the decision a major dampener, noting the industry had invested Rs 35,000-40,000 crore in ethanol capacity based on government incentives. While rice-based ethanol prices increased 3% to Rs 60.32 per litre, sugar mills received no relief despite higher Fair and Remunerative Prices for cane. Price realization from ethanol stands at Rs 37 per kg, below domestic sugar prices of Rs 39-41 per kg across states. The pricing structure may push mills to produce more sugar and less ethanol, potentially creating supply surplus and depressing sugar values with the expected large harvest in late October.",
            "Sentiment": "negative",
            "PublishDate": 1758781126623,
            "Source": "stock"
        },
        {
            "Title": "Shree Renuka Sugars Reports 34% Revenue Decline and Widening Losses in Q1 FY2026",
            "Summary": "Shree Renuka Sugars Limited reported significant deterioration in its quarterly financial performance. Total income from operations fell 34.3% to Rs. 19,174 million compared to Rs. 29,177 million in the same quarter last year. Net loss before tax and exceptional items widened to Rs. 2,928 million from Rs. 1,486 million, while net loss after tax increased to Rs. 2,151 million from Rs. 1,352 million. On a consolidated basis, total income declined 34.3% to Rs. 20,201 million, with consolidated net loss after tax rising to Rs. 2,636 million from Rs. 1,662 million. The company's earnings per share worsened to Rs. (1.01) from Rs. (0.64). The company maintains a negative net worth of Rs. (6,165) million and a debt-to-equity ratio of -1.10, with reserves excluding revaluation reserves at Rs. (14,425) million.",
            "Sentiment": "negative",
            "PublishDate": 1754722370924,
            "Source": "earnings"
        },
        {
            "Title": "Shree Renuka Sugars Reports INR 2,928 Million Loss Before Tax for Quarter Ended June 30, 2025",
            "Summary": "Shree Renuka Sugars Limited reported a loss before tax of INR 2,928 million for the quarter ended June 30, 2025, compared to a profit of INR 659 million in the previous quarter. Revenue from operations declined to INR 19,032 million from INR 25,202 million in the preceding quarter. The company's current liabilities exceed current assets by INR 20,387 million, and it has a negative net worth of INR 6,100 million. On a consolidated basis, the group reported a loss before tax of INR 3,414 million with current liabilities exceeding current assets by INR 32,019 million and negative net worth of INR 19,272 million. The company operates across sugar milling, refinery, distillery, co-generation, and trading segments. All loans and borrowings are secured by corporate guarantee from ultimate holding company Wilmar International Limited, and the company continues to prepare financial results on a going concern basis with support from its holding company.",
            "Sentiment": "negative",
            "PublishDate": 1754571291214,
            "Source": "earnings"
        },
        {
            "Title": "Shree Renuka Sugars Reports Q4 Profit Amid Revenue Decline",
            "Summary": "Shree Renuka Sugars reported a consolidated net profit of 916 million rupees in Q4, compared to a loss of 1.12 billion rupees in the same quarter last year. However, this represents a decline from the previous quarter's loss of 2.03 billion rupees. The company's revenue for Q4 stood at 27 billion rupees, down from 35 billion rupees in the year-ago period.",
            "Sentiment": "neutral",
            "PublishDate": 1747267791000,
            "Source": "default"
        },
        {
            "Title": "Shree Renuka Sugars Reports Q4 Profit and Improved EBITDA",
            "Summary": "Shree Renuka Sugars has reported a significant turnaround in its Q4 financial results. The company posted a net profit of 916 million rupees, compared to a loss of 1.12 billion rupees in the same quarter last year. EBITDA increased to 2.9 billion rupees from 2.58 billion rupees year-over-year, with the EBITDA margin improving to 10.84% from 7.43%. However, revenue decreased to 27 billion rupees from 35 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747234809000,
            "Source": "result"
        },
        {
            "Title": "Shree Renuka Sugars: Maize Supply Critical for India's 30% Ethanol Blending Goal",
            "Summary": "India plans to increase ethanol blending in petrol to 30% by 2030, requiring 15-16 billion litres annually. Sugar sector can provide 7 billion litres, with maize sector needing to contribute 25-30 million tonnes. Dual feedstock distilleries and potential impacts on oilseed sector highlighted.",
            "Sentiment": "neutral",
            "PublishDate": 1745126296000,
            "Source": "normal_news"
        },
        {
            "Title": "Shree Renuka Sugars Reports Increased Q3 Net Loss",
            "Summary": "Shree Renuka Sugars reported a consolidated net loss of 2.04 billion rupees in the third quarter, compared to a loss of 1.72 billion rupees in the same period last year. This represents an increase in losses year-over-year. The company's revenue for Q3 decreased to 26 billion rupees from 30.6 billion rupees in the previous year, indicating a decline in sales.",
            "Sentiment": "negative",
            "PublishDate": 1739320402000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Renuka Sugars Reports Q3 EBITDA Loss",
            "Summary": "Shree Renuka Sugars has reported an EBITDA loss of 15 million rupees in the third quarter, compared to a gain of 2.3 billion rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1739283751000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Renuka Sugars Reports Increased Q3 Net Loss",
            "Summary": "Shree Renuka Sugars has reported a consolidated net loss of 2.04 billion rupees for the third quarter, compared to a loss of 1.72 billion rupees in the same period last year. This represents an increase in losses year-over-year. The company's revenue for Q3 decreased to 26 billion rupees from 30.6 billion rupees in the previous year. Compared to the previous quarter, the net loss has increased from 223 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1739283629000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Renuka Sugars to Consider Q3 Results",
            "Summary": "Shree Renuka Sugars has announced that it will consider its third quarter financial results on February 11. This indicates the company is preparing to disclose its performance for the latest fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738757265000,
            "Source": "earnings"
        },
        {
            "Title": "CARE Ratings Assigns BBB+ Rating to Shree Renuka Sugars' Bank Facilities",
            "Summary": "CARE Ratings Limited has assigned a BBB+ rating to Shree Renuka Sugars' long-term bank facilities and long-term/short-term bank facilities totaling 256 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735032091000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shree Renuka Sugar: Completes Exit from Mauritius Subsidiary",
            "Summary": "Shree Renuka Sugar's subsidiary sold its remaining 17.1% stake in Mauritius-based Shree Renuka Global Ventures Ltd. to Freeway Trading Ltd. for $4,325, completing its exit from the company. The transaction was finalized on Friday, following a previous 82.9% stake sale in 2019.",
            "Sentiment": "neutral",
            "PublishDate": 1732355862000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Renuka Sugars Anticipates Improved Cane Crushing in Upcoming Season",
            "Summary": "Shree Renuka Sugars has announced that they expect an improvement in cane crushing for the forthcoming season. This suggests a positive outlook for the company's sugar production capacity and potentially its financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1730200782000,
            "Source": "normal_news"
        },
        {
            "Title": "Shree Renuka Sugars Reports Strong Q2 Financial Performance",
            "Summary": "Shree Renuka Sugars has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 642 million rupees to 2.3 billion rupees. Additionally, the EBITDA margin expanded from 2.51% to 8.86% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730126146000,
            "Source": "result"
        },
        {
            "Title": "Shree Renuka Sugars Reports Q2 Financial Results",
            "Summary": "Shree Renuka Sugars has reported its Q2 financial results. The company posted a consolidated net loss of 231 million rupees, which is an improvement from the loss of 2 billion rupees in the same quarter last year. However, it represents a decline from the previous quarter's loss of 1.7 billion rupees. The company's revenue for Q2 stood at 25.7 billion rupees, slightly higher than the 25.5 billion rupees reported in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730126047000,
            "Source": "result"
        },
        {
            "Title": "Shree Renuka Sugars Approves Expansion Plan",
            "Summary": "A unit of Shree Renuka Sugars has approved a capital expenditure investment of 184 crore rupees. The investment will be used to expand the cane crushing capacity from 4,000 TCD (Tonnes Crushed per Day) to 7,000 TCD and to set up a 15 MW power plant at the unit's facility.",
            "Sentiment": "positive",
            "PublishDate": 1730080546000,
            "Source": "corporate_action"
        }
    ]
}