{
    "Symbol": "REPCOHOME",
    "ISIN": "INE612J01015",
    "News": [
        {
            "Title": "Repco Home Finance publishes Q3 FY26 results",
            "Summary": "Repco Home Finance Limited has published its unaudited financial results for the third quarter and nine months ended December 31, 2025, in Financial Express and Dinamani newspapers on February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770377256803,
            "Source": "co_actions_results"
        },
        {
            "Title": "Repco Home Finance Q3FY26 Results Show Strong Growth",
            "Summary": "Repco Home Finance reports loan sanctions of Rs. 1,087 crores and net profit of Rs. 109 crores in Q3FY26, with improved asset quality as GNPA drops to 2.92%.",
            "Sentiment": "positive",
            "PublishDate": 1770298848923,
            "Source": "co_actions_results"
        },
        {
            "Title": "Repco Home Finance Declares ₹2 Dividend Per Share",
            "Summary": "Repco Home Finance has announced a dividend of ₹2 per share for its shareholders. The housing finance company's dividend declaration reflects its commitment to rewarding investors.",
            "Sentiment": "positive",
            "PublishDate": 1770298240269,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bandhan MF raises stake in Repco Home Finance to 7.04%",
            "Summary": "Bandhan Mutual Fund acquired 27,000 equity shares of Repco Home Finance on January 29, 2026, increasing its holding from 6.99% to 7.04% through its Small Cap Fund scheme.",
            "Sentiment": "positive",
            "PublishDate": 1770093506202,
            "Source": "mutualfunds"
        },
        {
            "Title": "Repco Home Finance Board Meet on Feb 5 for Q3 Results",
            "Summary": "Repco Home Finance schedules board meeting on February 5, 2026 to consider Q3FY26 unaudited financial results and declare second interim dividend for FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1769235858711,
            "Source": "co_actions_results"
        },
        {
            "Title": "Repco Home Finance seeks shareholder approval for director appointment",
            "Summary": "Repco Home Finance Limited has issued a postal ballot notice seeking member approval for the appointment of Mr. Paiyur Kuppuraman Vaidyanathan as Whole-Time Director with RBI approval already secured.",
            "Sentiment": "positive",
            "PublishDate": 1768216324641,
            "Source": "stocks"
        },
        {
            "Title": "Repco Home Finance Appoints New Whole-time Director",
            "Summary": "Repco Home Finance receives RBI approval for appointing Paiyur Kuppuraman Vaidyanathan as Whole-time Director for two years, effective December 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766148569475,
            "Source": "stocks"
        },
        {
            "Title": "Repco Home Finance Gets Provisional Ratings for SNs",
            "Summary": "ICRA Limited assigns provisional ratings to Repco Home Finance's securitisation notes worth ₹98.26 crores across two series under Pratham122025 trust structure.",
            "Sentiment": "positive",
            "PublishDate": 1765541572765,
            "Source": "stocks"
        },
        {
            "Title": "Repco Home Finance Reports Record Q2 FY2026 Disbursements of Rs. 1,069 Crores",
            "Summary": "Repco Home Finance achieved its highest-ever quarterly disbursements of Rs. 1,069 crores in Q2 FY2026, up from Rs. 867 crores in Q2 FY2025, with loan book growing 8% to Rs. 15,033 crores. The company reported net profit of Rs. 107 crores with ROA at 2.9% and ROE at 13.5%, while targeting Rs. 16,200 crores AUM by FY2026 end and planning to reduce GNPA from Rs. 475 crores to Rs. 450 crores in Q3.",
            "Sentiment": "positive",
            "PublishDate": 1763466704491,
            "Source": "earnings"
        },
        {
            "Title": "Repco Home Finance Reports 8% YoY Loan Book Growth to ₹1,50,334 Million with Improved Asset Quality",
            "Summary": "Repco Home Finance achieved a loan book of ₹1,50,334 million, representing an 8% year-over-year growth. The company's gross non-performing assets (GNPA) improved to 3.16%. The housing finance company is expanding its presence in Tier-2 and Tier-3 markets while focusing on affordable housing and self-employed customer segments. The company is working on strengthening asset quality and operational efficiency to achieve steady return on equity (ROE) improvement.",
            "Sentiment": "positive",
            "PublishDate": 1762960867191,
            "Source": "stock"
        },
        {
            "Title": "Repco Home Finance Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Repco Home Finance reported net profit of 1.06 billion rupees for Q2, down from 1.12 billion rupees in the same period last year. The company's revenue increased to 4.45 billion rupees compared to 4.28 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762954996383,
            "Source": "earnings"
        },
        {
            "Title": "Repco Home Finance Seeks Shareholder Approval for Dr. Gorrepati Venkataiah's Appointment as Independent Director",
            "Summary": "Repco Home Finance Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Dr. Gorrepati Venkataiah as Non-Executive & Independent Director for a three-year term from August 7, 2025 to August 6, 2028. The Board had appointed Dr. Venkataiah as Additional Director on August 7, 2025, based on the Nomination & Remuneration Committee's recommendation. Dr. Venkataiah, aged 71, holds degrees in Veterinary Science and Law, and is a Fellow member of Insurance Institute of India with 3 years of banking experience and 29 years in insurance. The e-voting process will be conducted from September 18 to October 17, 2025. He will receive sitting fees of Rs. 90,000 per meeting and engagement fees of Rs. 75,000 per engagement. The company has appointed G. Ramachandran as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1758034142501,
            "Source": "corporate_action"
        },
        {
            "Title": "Repco Home Finance Shareholders Approve ₹2,500 Crore Fundraising Plan",
            "Summary": "Repco Home Finance shareholders have approved a fundraising plan totaling ₹2,500 crore through private placement. The fundraising will be executed via two instruments: ₹1,500 crore through Non-Convertible Debentures (NCDs) and ₹1,000 crore through Commercial Papers (CPs). Both instruments will be issued on a private placement basis.",
            "Sentiment": "positive",
            "PublishDate": 1756080695913,
            "Source": "corporate_action"
        },
        {
            "Title": "Repco Home Finance Declares ₹4 Dividend per Share for FY 2024-25",
            "Summary": "Repco Home Finance has declared a dividend of ₹4 per share for the financial year 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1755868985311,
            "Source": "corporate_action"
        },
        {
            "Title": "Repco Home Finance Shareholders Approve ₹2,500 Crore Fundraising Plan",
            "Summary": "Repco Home Finance shareholders have approved a fundraising initiative totaling ₹2,500 crore through private placement. The fundraising will be executed via two instruments: ₹1,500 crore through Non-Convertible Debentures (NCDs) and ₹1,000 crore through Commercial Papers (CP). Both instruments will be issued on a private placement basis.",
            "Sentiment": "positive",
            "PublishDate": 1755868591299,
            "Source": "corporate_action"
        },
        {
            "Title": "Repco Home Finance Reports 7% Loan Book Growth, Declares 25% Interim Dividend",
            "Summary": "Repco Home Finance reported quarterly results showing loan book growth of 7% year-on-year to Rs. 14,690 crores. The housing finance company achieved disbursements of Rs. 829 crores compared to Rs. 680 crores in the same quarter last year, with sanctions rising to Rs. 907 crores from Rs. 727 crores. Net profit stood at Rs. 108 crores for the quarter. The company declared a 25% interim dividend. Asset quality improved with gross NPA reducing to 3.3% from 4.3% in June 2025, while net NPA was at 1.19%. ROA and ROE were reported at 2.9% and 14% respectively. NIM was at 5.23% and spread at 3.27%. The company operates through 234 touch points across 12 states and 1 union territory, with Tamil Nadu contributing 60% of disbursements. Management targets reaching Rs. 4,000 crores disbursement and Rs. 16,200 crores AUM by fiscal year end, while aiming to reduce GNPA to 2.5%.",
            "Sentiment": "positive",
            "PublishDate": 1754912948289,
            "Source": "earnings"
        },
        {
            "Title": "Repco Home Targets Non-Salaried Customers for Growth with Strong Capital Position",
            "Summary": "Repco Home expects steady asset quality and growth while focusing on retail housing demand. The company is targeting non-salaried customers as part of its strategy and maintains strong capital reserves to support its operations.",
            "Sentiment": "positive",
            "PublishDate": 1754577924237,
            "Source": "stock"
        },
        {
            "Title": "Repco Home Finance Declares Rs 2.5 Dividend Per Share, Reports Higher Q1 Profit",
            "Summary": "Repco Home Finance announced a dividend of Rs 2.5 per share. The company reported Q1 net profit of Rs 1.1 billion compared to Rs 1.05 billion in the same period last year. Revenue for the quarter stood at Rs 4.35 billion versus Rs 4.1 billion year-on-year, showing growth in both profitability and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754573505086,
            "Source": "corporate_action"
        },
        {
            "Title": "Repco Home Finance Reports Q1 FY26 Results, Declares Rs 2.50 Interim Dividend and Appoints Two New Directors",
            "Summary": "Repco Home Finance Limited announced its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company's standalone net profit increased to Rs 105.44 crores compared to Rs 107.95 crores in the same quarter last year. Revenue from operations stood at Rs 435.51 crores versus Rs 407.83 crores in the previous year quarter. The board declared an interim dividend of Rs 2.50 per equity share (25% of face value of Rs 10) for financial year 2025-26. The company appointed Dr. G. Venkataiah as Additional Director in Non-Executive & Independent capacity for three years from August 7, 2025 to August 6, 2028, subject to shareholder approval. Additionally, Mr. Paiyur Kuppuraman Vaidyanathan, Chief Development Officer, was appointed as Additional Director in Whole-time Director capacity for two years, subject to approval from shareholders and Reserve Bank of India. The company operates primarily in housing-related finance business.",
            "Sentiment": "positive",
            "PublishDate": 1754573343574,
            "Source": "earnings"
        },
        {
            "Title": "Repco Home Finance Sets Book Closure and Record Date for Dividend and Annual General Meeting",
            "Summary": "Repco Home Finance Limited announced that its Register of Members and Share Transfer Books will remain closed from August 16 to August 22, 2025 for dividend payment purposes for financial year 2024-25 and the 25th Annual General Meeting. The record date for determining shareholder eligibility for dividend and AGM participation is August 15, 2025. Any dividend approved by shareholders at the Annual General Meeting will be paid within 30 days of declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1753723977980,
            "Source": "corporate_action"
        },
        {
            "Title": "Repco Home Finance Issues Commercial Papers Worth ₹50 Crore",
            "Summary": "Repco Home Finance has issued commercial papers valued at ₹50 crore. No additional details about the terms, purpose, or timing of the issuance were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750862041000,
            "Source": "default"
        },
        {
            "Title": "Repco Home Finance: Q4 Profit Up 6%, Asset Quality Improves",
            "Summary": "Repco Home Finance reported a 6% year-on-year increase in Q4 net profit to Rs 115 crore. Total income rose 10% to Rs 435 crore. Loan book grew 7% to Rs 14,492 crore. Gross NPA ratio improved to 3.3% from 4.1% a year ago. Annual net profit for FY25 increased 11% to Rs 439 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747411078000,
            "Source": "earnings"
        },
        {
            "Title": "REPCO Home Finance Reports Q4 Results and Declares Dividend",
            "Summary": "REPCO Home Finance has announced its quarterly results and a dividend declaration. The company reported a consolidated net profit of 1.15 billion rupees for Q4, compared to 1.08 billion rupees year-over-year and 1.06 billion rupees quarter-over-quarter. Revenue for Q4 stood at 4.3 billion rupees, up from 3.93 billion rupees in the same quarter last year. Additionally, the company has declared a dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747398527000,
            "Source": "result"
        },
        {
            "Title": "Repco Home Finance Schedules Board Meeting for Q4 Results and Dividend Consideration",
            "Summary": "Repco Home Finance has announced a board meeting on May 16 to review Q4 results, consider dividend recommendations, and discuss potential fund-raising through non-convertible debentures and commercial paper issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1746449893000,
            "Source": "default"
        },
        {
            "Title": "Repco Home Finance: A. Palpandi Appointed as New COO",
            "Summary": "A. Palpandi, former general manager at Repco Home Finance Ltd., has been appointed as the company's new Chief Operating Officer effective immediately. He replaces Thangappan Karunakaran, who recently became the firm's Managing Director and CEO. Palpandi brings over 28 years of experience in banking and housing finance to the role.",
            "Sentiment": "neutral",
            "PublishDate": 1745247012000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Repco Home Finance to Meet HDFC Securities' FII Clients",
            "Summary": "Repco Home Finance has scheduled a meeting with Foreign Institutional Investor (FII) clients of HDFC Securities on March 13. This meeting suggests the company's efforts to engage with potential international investors and discuss business prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1741340550000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Repco Home Finance Reports Increased Q3 Net Profit and Revenue",
            "Summary": "Repco Home Finance announced its Q3 financial results, showing improved performance. The company's consolidated net profit rose to 1.06 billion rupees, up from 994 million rupees year-over-year and 1.09 billion rupees quarter-over-quarter. Revenue also increased to 4.25 billion rupees from 3.87 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739405756000,
            "Source": "earnings"
        },
        {
            "Title": "REPCO Home Finance Reports Q3 Financial Results",
            "Summary": "REPCO Home Finance announced its Q3 consolidated financial results. The company reported a net profit of 1.06 billion rupees, showing an increase from 994 million rupees year-over-year and 1.09 billion rupees quarter-over-quarter. Revenue for Q3 stood at 4.25 billion rupees, up from 3.87 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739370267000,
            "Source": "earnings"
        },
        {
            "Title": "Repco Home Finance: Dolly Khanna Exits Amid Poor Stock Performance",
            "Summary": "Ace investor Dolly Khanna's stake in Repco Home Finance dropped below 1% in Q3 FY25, likely indicating her exit from the company. The stock has shown poor performance, declining 13% in the last month, 18% in three months, and 27% in six months. Khanna has acquired a 1.16% stake in Indian Metals & Ferro Alloys.",
            "Sentiment": "negative",
            "PublishDate": 1736405483000,
            "Source": "normal_news"
        },
        {
            "Title": "Repco Home Finance Reports Q2 Profit Growth",
            "Summary": "Repco Home Finance announced its Q2 financial results. The company's consolidated net profit increased to 1.15 billion rupees, up from 999 million rupees year-over-year and 1.12 billion rupees quarter-over-quarter. Revenue also grew to 4.05 billion rupees from 3.76 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731455680000,
            "Source": "result"
        }
    ]
}