{
    "Symbol": "REPRO",
    "ISIN": "INE461B01014",
    "News": [
        {
            "Title": "Repro India Auditor Firm Converts to LLP Structure",
            "Summary": "Repro India Limited announces that its statutory auditor M S K A & Associates has converted to LLP structure effective January 13, 2026, continuing audit services under new entity name.",
            "Sentiment": "neutral",
            "PublishDate": 1768822395745,
            "Source": "stocks"
        },
        {
            "Title": "Repro India Allots 21,850 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Repro India's Nomination and Remuneration Committee approved the allotment of 21,850 equity shares of Rs. 10 each to eligible employees under the Employee Stock Option Scheme 2010 at an exercise price of Rs. 250 per share. The allotment increases the company's paid-up equity share capital from Rs. 14,32,34,880 to Rs. 14,34,53,380, with the company applying for listing of these shares on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1763997043920,
            "Source": "corporate_action"
        },
        {
            "Title": "Repro India Reports Mixed Q2 Results with Digital Growth Offsetting Long-Run Decline",
            "Summary": "Repro India's digital business vertical grew 13% YoY to Rs 95.3 crores in Q2FY26, while long-run printing revenues declined 43% due to structural changes in NCERT's distribution model. The company settled a long-standing industrial dispute at its Mahape facility with a one-time cost of Rs 18 crores and reported consolidated revenues of Rs 108 crores with improved EBITDA of Rs 8 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763114606573,
            "Source": "earnings"
        },
        {
            "Title": "Repro India Settles 8-Year Worker Strike at Mahape Plant",
            "Summary": "Repro India Limited has resolved a long-standing industrial dispute with workers at its Mahape Plant that began in 2017. The company signed a settlement agreement with Dharmarajya Kamgar Karmachari Mahasangh union, making full and final settlement payments to affected workers. All related legal proceedings and cases filed by the union and workers will be withdrawn, with both parties agreeing to restore normal operations at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1760378019509,
            "Source": "stock"
        },
        {
            "Title": "Repro India Reports 22% Growth in Digital Business Despite Long-Run Vertical Decline",
            "Summary": "Repro India's digital business vertical generated revenue of Rs 94.5 crore in Q1 FY26, marking 22% year-on-year growth. The platform business segment within digital operations grew 38% despite an 8% impact from Flipkart's revenue recognition changes. Over three years, digital business revenue has grown 2.5x and now represents 80% of revenue share. Consolidated Q1 FY26 revenue reached Rs 118 crore with 4% growth, though the long-run vertical declined 34% to Rs 23 crore due to structural changes in NCERT's distribution model. NCERT's decision to directly print and distribute K-12 books has bypassed academic publishers, causing the long-run vertical's revenue to fall over 65% from steady state levels across five quarters. The company processes 43,029 digital books daily with 725 onboarded publishers representing 55% of the Rs 70,000 crore total addressable market. Management is exploring options for the struggling long-run vertical while expanding digital operations across multiple domestic and international platforms including Amazon, Flipkart, and Walmart.",
            "Sentiment": "neutral",
            "PublishDate": 1755159528707,
            "Source": "earnings"
        },
        {
            "Title": "Repro India Approves Q1 FY26 Results and Subsidiary Closure",
            "Summary": "Repro India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported a consolidated loss of Rs 273 lakhs and standalone loss of Rs 355 lakhs for the quarter. Revenue from operations was Rs 11,229 lakhs on consolidated basis and Rs 5,659 lakhs on standalone basis. The Board also approved closure of Repro DMCC, a wholly owned subsidiary in UAE, which has not commenced any business operations since incorporation. The subsidiary closure will have no impact on revenue or business operations as it is non-material and non-operational.",
            "Sentiment": "negative",
            "PublishDate": 1755157554595,
            "Source": "earnings"
        },
        {
            "Title": "ICRA Reaffirms BBB+ Credit Rating for Repro India's Rs 170 Crore Bank Facilities",
            "Summary": "ICRA Limited has reaffirmed the credit rating for Repro India Limited's bank facilities totaling Rs 170 crore. The rating for long-term and short-term working capital loans remains at [ICRA]BBB+(Positive)/[ICRA]A2 with a stable outlook. The facilities include Rs 10 crore long-term fund-based term loan rated [ICRA]BBB+ and Rs 160 crore long-term/short-term bank facilities rated [ICRA]BBB+/[ICRA]A2. ICRA issued a revised rating communication letter to correct an inadvertent error in their previous letter dated January 03, 2025, with the new letter superseding the earlier communication.",
            "Sentiment": "positive",
            "PublishDate": 1753156812027,
            "Source": "stock"
        },
        {
            "Title": "Repro India Reports Q4 Financial Results",
            "Summary": "Repro India announced its Q4 financial results. The company's EBITDA decreased to 84 million rupees from 141 million rupees year-over-year. EBITDA margin fell to 6.83% from 11.14% year-over-year. Consolidated net profit dropped to 11 million rupees from 30 million rupees year-over-year and 12 million rupees quarter-on-quarter. Q4 revenue was 1.23 billion rupees, down from 1.3 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747666424000,
            "Source": "result"
        },
        {
            "Title": "Repro India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Repro India's Q3 EBITDA decreased to 104 million rupees from 131 million rupees year-over-year. The company's EBITDA margin also declined to 8.23% from 11.31% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739370565000,
            "Source": "earnings"
        },
        {
            "Title": "Repro India Reports Mixed Q3 Financial Results",
            "Summary": "Repro India has announced its Q3 financial results. The company reported a consolidated net profit of 12 million rupees, which is a decrease from 40 million rupees in the same quarter last year. Compared to the previous quarter, the company recorded a loss of 45 million rupees. However, Q3 revenue increased to 1.26 billion rupees from 1.15 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739370516000,
            "Source": "earnings"
        },
        {
            "Title": "Repro India Reports Significant Decline in Q2 EBITDA",
            "Summary": "Repro India's Q2 EBITDA has dropped to 37 million rupees from 116 million rupees year-over-year. The company's EBITDA margin has also decreased from 9.94% to 3.54% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731069068000,
            "Source": "result"
        },
        {
            "Title": "Repro India Reports Q2 Revenue Decline",
            "Summary": "Repro India, a printing and publishing company, has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 1.05 billion rupees, down from 1.17 billion rupees in the same quarter of the previous year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731069052000,
            "Source": "result"
        },
        {
            "Title": "Repro India Reports Q2 Net Loss",
            "Summary": "Repro India has reported a consolidated net loss of 44 million rupees for the second quarter, compared to a profit of 19 million rupees in the same quarter last year. However, the company showed a slight improvement from the previous quarter, with a profit of 1.3 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731069038000,
            "Source": "result"
        }
    ]
}