{
    "Symbol": "RESPONIND",
    "ISIN": "INE688D01026",
    "News": [
        {
            "Title": "Responsive Industries Gets Credit Rating Reaffirmed",
            "Summary": "Infomerics reaffirmed Responsive Industries' IVR A/Stable/IVR A1 rating for Rs. 430.27 crore facilities. Company showed strong FY25 performance with revenue growth of ~30%.",
            "Sentiment": "positive",
            "PublishDate": 1770381980823,
            "Source": "stocks"
        },
        {
            "Title": "Responsive Industries Board Meet Set for Feb 13",
            "Summary": "Responsive Industries Limited has scheduled a board meeting for February 13, 2026, to consider Q3FY26 unaudited financial results. Trading window to reopen February 16, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770287895048,
            "Source": "co_actions_results"
        },
        {
            "Title": "Responsive Industries Reconstitutes Board Committees",
            "Summary": "Responsive Industries Limited reconstituted five key board committees including Audit, Nomination & Remuneration, and Stakeholders Relationship committees with new member compositions effective February 04, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770213725569,
            "Source": "stocks"
        },
        {
            "Title": "Responsive Industries CFO Bhavneet Singh Chadha Resigns",
            "Summary": "Responsive Industries announces the resignation of Co-CFO Bhavneet Singh Chadha from his position at the plastic products company.",
            "Sentiment": "neutral",
            "PublishDate": 1768350007644,
            "Source": "stocks"
        },
        {
            "Title": "Responsive Industries Director Ms. Mita Jha Passes Away",
            "Summary": "Responsive Industries Limited announces the sad demise of Non-Executive Independent Director Ms. Mita Jha on December 21, 2025, with the company expressing deep condolences to her family.",
            "Sentiment": "negative",
            "PublishDate": 1768309145362,
            "Source": "stocks"
        },
        {
            "Title": "Responsive Industries CFO Bhavneet Singh Chadha Resigns",
            "Summary": "Responsive Industries Limited announces resignation of Chief Financial Officer Mr. Bhavneet Singh Chadha due to personal reasons, effective January 12, 2026. Company initiating search for replacement.",
            "Sentiment": "neutral",
            "PublishDate": 1768300905949,
            "Source": "stocks"
        },
        {
            "Title": "Responsive Industries Appoints New Independent Director",
            "Summary": "Responsive Industries Limited successfully completes postal ballot process, appointing Mr. Ajay Pratapray Shanghavi as Independent Director for five-year term through January 2030.",
            "Sentiment": "positive",
            "PublishDate": 1767615850658,
            "Source": "stocks"
        },
        {
            "Title": "Responsive Industries Promoters Withdraw Reclassification Application to Remain in Promoter Category",
            "Summary": "Mr. Abhishek Agarwal and Mrs. Saudamini Agarwal have withdrawn their application to reclassify from Promoter to Public category under SEBI LODR Regulations, deciding to continue as promoters of Responsive Industries Limited. The withdrawal application was filed with BSE and NSE on December 04, 2025, reversing their original reclassification request that was approved by shareholders in the 38th Annual General Meeting held on 24.12.2020.",
            "Sentiment": "neutral",
            "PublishDate": 1764845521936,
            "Source": "corporate_governance"
        },
        {
            "Title": "Responsive Industries Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Responsive Industries Limited has initiated a postal ballot process to seek shareholder approval for appointing Mr. Ajay Pratapray Shanghavi as Non-Executive Independent Director for a five-year term from November 11, 2025 to November 10, 2030. The remote e-voting period runs from December 5, 2025 to January 4, 2026, with results to be declared by January 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1764676207526,
            "Source": "corporate_governance"
        },
        {
            "Title": "Responsive Industries Reports Mixed Q2 Results with Higher Profit Despite Revenue Decline",
            "Summary": "Responsive Industries reported Q2 consolidated net profit of 532.6 million rupees, up from 492.8 million rupees year-over-year. However, revenue declined to 3.14 billion rupees from 3.5 billion rupees in the same period last year. EBITDA increased to 766 million rupees from 725 million rupees year-over-year, while EBITDA margin improved significantly to 24.42% from 20.75% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762868324265,
            "Source": "earnings"
        },
        {
            "Title": "Dr. Anita Shantaram Resigns as Independent Director from Responsive Industries Limited",
            "Summary": "Dr. Anita Shantaram (DIN: 00786517) resigned as Non-Executive Independent Director of Responsive Industries Limited effective November 5, 2025, citing personal reasons and unavoidable circumstances. Her resignation also resulted in cessation of membership from the Nomination Remuneration Committee, Stakeholders Relationship Committee, and Corporate Social Responsibility Committee. The Board acknowledged her valuable contributions during her tenure. Dr. Shantaram confirmed there are no material reasons for her resignation other than those mentioned in her resignation letter. She also holds independent director positions at Phoenix Township Ltd, Bharat Enterprises Company Limited, Wire/Lloyds Ropes Limited, and Metals and Energy Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762339755066,
            "Source": "corporate_governance"
        },
        {
            "Title": "Fairpoint Tradecom LLP Creates Pledge on Responsive Industries Shares",
            "Summary": "Fairpoint Tradecom LLP, a promoter group entity of Responsive Industries Limited, has created a pledge on 15,00,000 shares representing 0.56% of total share capital. The pledge was created on September 30, 2025, in favor of Virtue Financial Services Private Limited, a company engaged in activities auxiliary to financial intermediation. The encumbered shares represent 9.25% of total promoter shareholding. Responsive Industries is listed on BSE Limited and National Stock Exchange of India Limited. The borrowed amount is intended for personal use by promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1759476237631,
            "Source": "corporate_action"
        },
        {
            "Title": "Responsive Industries Sets Record Date for Final Dividend Payment",
            "Summary": "Responsive Industries Limited has fixed September 12, 2025 as the record date for determining shareholder eligibility for a final dividend of Re.0.10 per equity share for the financial year ended March 31, 2025. The dividend payment is subject to approval at the company's 43rd Annual General Meeting scheduled for September 19, 2025 at 11:00 A.M. at Hotel Express Inn, Boisar, Maharashtra. Eligible shareholders will receive dividend payments on or after September 24, 2025, following AGM approval.",
            "Sentiment": "positive",
            "PublishDate": 1756215342187,
            "Source": "corporate_action"
        },
        {
            "Title": "Responsive Industries Reports Q1 FY2025 Financial Results with Mixed Performance",
            "Summary": "Responsive Industries Limited announced its unaudited financial results for the first quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 14,911.78 lakhs compared to Rs. 15,146.40 lakhs in the previous quarter and Rs. 12,879.75 lakhs in the same quarter last year. Net profit after tax stood at Rs. 567.48 lakhs versus Rs. 544.28 lakhs in the previous quarter and Rs. 732.56 lakhs in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations was Rs. 33,870.86 lakhs compared to Rs. 38,066.05 lakhs in the previous quarter and Rs. 31,990.48 lakhs in the same quarter last year. Consolidated net profit after tax reached Rs. 4,986.50 lakhs against Rs. 5,424.87 lakhs in the previous quarter and Rs. 4,837.85 lakhs in the year-ago quarter. The company's consolidated results include three subsidiaries: Responsive Industries Limited Hong Kong, Responsive Industries LLC USA, and Axiom Cordages Limited Hong Kong. Basic earnings per share on a consolidated basis was Rs. 1.87 compared to Rs. 2.03 in the previous quarter and Rs. 1.81 in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1753875568693,
            "Source": "earnings"
        },
        {
            "Title": "Responsive Industries Schedules Board Meeting for July 30 to Approve Q1 Financial Results",
            "Summary": "Responsive Industries Limited has scheduled a Board of Directors meeting on July 30, 2025 to consider and approve unaudited financial results (standalone and consolidated) for the first quarter ended June 30, 2025. The trading window for designated persons and their immediate relatives has been closed since July 1, 2025 and will reopen on August 2, 2025, which is 48 hours after the board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753181355589,
            "Source": "corporate_action"
        },
        {
            "Title": "Responsive: Launches No-Code AI Agent Creation Platform",
            "Summary": "Responsive unveils Spring 2025 Release featuring Agent Studio, a no-code environment for building custom AI agents. The release includes an expanded agent library with Analysis and Answering Agents, Guided Projects for field teams, and new quality assurance features like Trace Score and Quality Check.",
            "Sentiment": "positive",
            "PublishDate": 1747754733000,
            "Source": "normal_news"
        },
        {
            "Title": "Responsive Industries Reports Q4 Revenue Growth",
            "Summary": "Responsive Industries has announced its Q4 revenue, which increased to 3.8 billion rupees from 2.9 billion rupees in the same quarter last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1747211423000,
            "Source": "result"
        },
        {
            "Title": "Responsive Industries Reports Q4 Financial Results",
            "Summary": "Responsive Industries has announced its Q4 financial results. The company's EBITDA increased to 789 million rupees from 667 million rupees year-over-year. However, the EBITDA margin decreased to 20.72% from 23.15% compared to the same period last year. The consolidated net profit rose to 542 million rupees from 459 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747211286000,
            "Source": "result"
        },
        {
            "Title": "Responsive Industries to Consider Q4 Results on May 14",
            "Summary": "Responsive Industries has announced that it will consider its fourth quarter (Q4) financial results on May 14. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746186458000,
            "Source": "default"
        },
        {
            "Title": "Responsive Industries Reports Mixed Q3 Financial Results",
            "Summary": "Responsive Industries has released its Q3 financial results, showing an increase in EBITDA but a decrease in EBITDA margin compared to the same period last year. The company's EBITDA rose to 723 million rupees from 664 million rupees year-over-year. However, the EBITDA margin declined to 19.67% from 24.86% in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1739187137000,
            "Source": "earnings"
        },
        {
            "Title": "Responsive Industries Reports Q3 Financial Results",
            "Summary": "Responsive Industries has announced its Q3 financial results. The company's consolidated net profit increased to 469 million rupees from 447 million rupees year-over-year. Revenue also saw significant growth, rising to 3.7 billion rupees from 2.67 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739187131000,
            "Source": "earnings"
        },
        {
            "Title": "Responsive Industries Reports Q2 EBITDA Growth",
            "Summary": "Responsive Industries has reported its Q2 financial results. The company's EBITDA increased to 725 million rupees from 611 million rupees year-over-year. However, the EBITDA margin decreased to 20.75% from 22.78% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729598951000,
            "Source": "result"
        },
        {
            "Title": "Responsive Industries Reports Q2 Revenue Growth",
            "Summary": "Responsive Industries has announced its Q2 revenue, which stands at 3.5 billion rupees, compared to 2.68 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729598943000,
            "Source": "result"
        },
        {
            "Title": "Responsive Industries Reports Q2 Profit Increase",
            "Summary": "Responsive Industries has announced its Q2 consolidated net profit, which has increased to 493 million rupees. This represents a year-over-year growth from 407 million rupees and a quarter-over-quarter increase from 484 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729598932000,
            "Source": "result"
        }
    ]
}