{
    "Symbol": "RGL",
    "ISIN": "INE722H01024",
    "News": [
        {
            "Title": "Renaissance Global Q3FY26 Results Show Strong Recovery",
            "Summary": "Renaissance Global Limited reported consolidated revenue of ₹96,294.23 lakhs in Q3FY26, up from ₹54,636.31 lakhs in Q2FY26. Net profit reached ₹3,320.98 lakhs for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1770927956791,
            "Source": "co_actions_results"
        },
        {
            "Title": "Renaissance Global Appoints Merlin Capital as IR Agency",
            "Summary": "Renaissance Global Limited has appointed Merlin Capital Advisors as its investor relations agency to strengthen investor communication and enhance transparency in capital markets.",
            "Sentiment": "positive",
            "PublishDate": 1770812811225,
            "Source": "stocks"
        },
        {
            "Title": "Renaissance Global schedules Q3 FY26 earnings call",
            "Summary": "Renaissance Global Limited announces post-result conference call for February 13, 2026 at 4:00 PM IST to discuss Q3 & 9M FY26 operational and financial performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770727197688,
            "Source": "stocks"
        },
        {
            "Title": "Renaissance Global Grants 1,07,140 Stock Options",
            "Summary": "Renaissance Global Limited's board committee approved grant of 1,07,140 stock options to eligible employee under RGL ESOP 2021 scheme with Rs. 2 exercise price per option on January 23, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769174555789,
            "Source": "co_actions_results"
        },
        {
            "Title": "Renaissance Global Establishes Wholly-Owned Subsidiary in Dubai",
            "Summary": "Renaissance Global has created a new wholly-owned subsidiary in Dubai. This expansion establishes the company's presence in the UAE market through direct ownership structure.",
            "Sentiment": "positive",
            "PublishDate": 1765012708397,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Reports 62% Surge in Direct-To-Consumer Sales to Rs. 23 Crores",
            "Summary": "Renaissance Global achieved a 62% increase in direct-to-consumer sales, reaching Rs. 23 crores during the holiday season period. The strong performance indicates robust consumer demand and effective direct sales strategy execution for the company.",
            "Sentiment": "positive",
            "PublishDate": 1764906169854,
            "Source": "stock"
        },
        {
            "Title": "Renaissance Global Allots 12,500 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Renaissance Global Limited allotted 12,500 equity shares at Rs. 110 per share to an employee who exercised stock options under the RGLESOP 2021 scheme. The allotment increased the company's paid-up share capital from Rs. 21,46,25,942 to Rs. 21,46,50,942, with the new shares ranking equally with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764334977272,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global's Jean Dousset Opens New York Boutique, Exceeds Launch Expectations",
            "Summary": "Renaissance Global announced the successful opening of its Jean Dousset boutique in New York City, with client appointments and walk-in traffic significantly surpassing projected levels in the premium lab-grown diamond jewelry segment. The company expects the New York store to mirror the success of its Los Angeles flagship location, which contributes approximately ₹25 crore annually and accounts for nearly 30% of the brand's total revenue, with plans to accelerate retail expansion to five locations by 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763981758222,
            "Source": "stock"
        },
        {
            "Title": "Sumit Shah Sells 6.13% Stake in Renaissance Global Limited",
            "Summary": "Sumit Niranjankumar Shah, a promoter of Renaissance Global Limited, sold 85,000 equity shares representing 6.13% of the company through open market transactions on November 19 and 20, 2025. Following the sale, Shah's shareholding in the company decreased from 8.76% to 7.46% of the total voting capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763726529304,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Reports 40% Revenue Growth in Q2 FY26 with Strong D2C Performance",
            "Summary": "Renaissance Global delivered 40% year-over-year revenue growth in Q2 FY26, with direct-to-consumer business expanding 43% and profit before tax rising 69% to 23.7 crores. The company opened its second Jean Dousset boutique in New York City and achieved cost savings of over 40 crores annually while maintaining strong momentum across lab-grown and natural diamond jewelry segments.",
            "Sentiment": "positive",
            "PublishDate": 1763465278135,
            "Source": "earnings"
        },
        {
            "Title": "Renaissance Global Reports Strong Q2FY26 Results with 80% PAT Growth",
            "Summary": "Renaissance Global Limited delivered robust quarterly results with revenue rising 39.5% YoY to ₹546.4 crore and PAT surging 80.1% YoY to ₹20.2 crore for Q2FY26. The branded jewellery company's D2C segment grew 43.1% YoY led by 60.1% growth in U.S. D2C brands, while opening a Jean Dousset boutique in New York City marks expansion into premium lab-grown diamond luxury market.",
            "Sentiment": "positive",
            "PublishDate": 1763054140845,
            "Source": "earnings"
        },
        {
            "Title": "Renaissance Global Limited Schedules Q2 FY26 Earnings Call for November 14, 2025",
            "Summary": "Renaissance Global Limited, a branded jewelry products company, will conduct an earnings conference call for investors and analysts on November 14, 2025 at 04:00 PM IST. The call will discuss the company's Q2 FY26 results, which are scheduled to be declared on November 13, 2025. The conference call will begin with a management discussion on the quarterly results followed by a Q&A session. Renaissance Global operates as a global branded jewelry player, designing, manufacturing and supplying branded jewelry across USA, Canada, UK and Asia. The company has licensing agreements with brands including Disney, Hallmark, NFL and Netflix, and owns brands such as Irasva, Jewelili and Made For You.",
            "Sentiment": "neutral",
            "PublishDate": 1762855427594,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Opens Jean Dousset Jewelry Boutique in NYC, Plans Three More Locations",
            "Summary": "Renaissance Global launched a new Jean Dousset jewelry boutique in New York City on November 15, 2025. The opening represents the company's expansion in the premium lab-grown diamond market. Renaissance Global has announced plans to open three additional boutiques in 2026.",
            "Sentiment": "positive",
            "PublishDate": 1760435418023,
            "Source": "stock"
        },
        {
            "Title": "Niranjan A. Shah Acquires 1,500 Shares in Renaissance Global Limited",
            "Summary": "Niranjan A. Shah acquired 1,500 equity shares of Renaissance Global Limited through open market purchase on February 17, 2025. Shah is identified as a promoter/promoter group member of the company. The acquisition represents 0.00% of the company's total share capital. Prior to this transaction, Shah held no shares in Renaissance Global Limited. The company has a total equity share capital of Rs. 21,44,60,942 comprising 10,72,30,471 shares of Rs. 2 each. The shares are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757083239636,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Reports 43% Revenue Growth to Rs. 550 Crores Despite US Tariff Challenges",
            "Summary": "Renaissance Global Limited, a jewelry manufacturer and retailer, reported quarterly results showing total revenue of Rs. 550 crores, representing 43% year-over-year growth. The company's D2C segment generated Rs. 69 crores (37% growth) while the B2B customer brands segment achieved Rs. 394 crores (67% growth). EBITDA reached Rs. 41 crores with 13% growth, and PAT after exceptional items was Rs. 19 crores, up 20%. The company completed cost optimization initiatives including closure of its Bhavnagar facility, resulting in Rs. 12 crores of operating cost savings and expected annualized savings of Rs. 48-50 crores. Net debt-to-equity ratio improved from 0.31 to 0.19 year-over-year. The company faced challenges from uncompensated US import tariffs but management expressed confidence in navigating the situation through supply chain adjustments and is focusing on scaling its direct-to-consumer business and transitioning to lab-grown diamonds.",
            "Sentiment": "positive",
            "PublishDate": 1755516936792,
            "Source": "earnings"
        },
        {
            "Title": "Renaissance Global Plans D2C Expansion and Brand Scaling for Margin Recovery by FY26",
            "Summary": "Renaissance Global is targeting high-margin growth through direct-to-consumer expansion and scaling its brand portfolio. The company plans to pass through tariff costs and aims to achieve margin recovery by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755016040373,
            "Source": "stock"
        },
        {
            "Title": "Renaissance Global Reports Slight Decline in Q1 EBITDA and Margin",
            "Summary": "Renaissance Global reported Q1 EBITDA of 362 million rupees compared to 365 million rupees in the same period last year. The company's EBITDA margin decreased to 6.83% from 8.21% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755013906419,
            "Source": "earnings"
        },
        {
            "Title": "Renaissance Global Reports 43% Revenue Growth in Q1 FY26 Despite Tariff Headwinds",
            "Summary": "Renaissance Global Limited announced its quarterly results for the period ended June 30, 2025, showing revenue from continuing operations surged 43% to Rs. 530 crore compared to Rs. 372 crore in the same quarter last year. The company's Direct-to-Consumer (D2C) business grew 37% to Rs. 69 crore from Rs. 50 crore. However, profit before tax stood at Rs. 21 crore, an 11% increase from Rs. 19 crore, impacted by approximately Rs. 11 crore adverse effect from uncompensated tariffs on US imports. The company closed its manufacturing unit at Bhavnagar, Gujarat from April 15, 2025, incurring restructuring costs of Rs. 11.97 crore disclosed as exceptional items. The Board approved consultancy fees for non-executive director Mr. Hitesh Shah and scheduled the 36th Annual General Meeting for September 18, 2025. Renaissance Global maintains a Net Debt to Equity ratio of 0.19 with cash and cash equivalents of Rs. 219 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755008826186,
            "Source": "earnings"
        },
        {
            "Title": "Renaissance Global Limited Completes Full Utilization of Rs 163.49 Crore Preferential Issue Proceeds",
            "Summary": "Renaissance Global Limited has fully utilized the entire proceeds of Rs 163.49 crore raised through its RGL Preferential Issue 2024. CRISIL Ratings Limited, serving as the monitoring agency, submitted the final monitoring agency report for the quarter ended June 30, 2025, confirming complete deployment of funds. The proceeds were utilized across four main objectives: Rs 26.63 crore for business growth opportunities including acquisition of Jean Dousset Jewelry LLC and capital expenditure, Rs 88.37 crore for investments in subsidiaries including Verigold Jewellery FZCO in Dubai, Rs 15 crore for fund raising expenses, and Rs 33.49 crore for general corporate purposes. The original issue size was reduced from Rs 168.74 crore due to undersubscription at the time of allotment. The company operates in the gems, jewellery and watches sector with promoters including Niranjan Amritlal Shah, Hitesh Mahendra Shah, Amit Chandrakant Shah, Bhupen Chandrakant Shah, and Sumit Niranjankumar Shah.",
            "Sentiment": "positive",
            "PublishDate": 1754663874189,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Reports Q4 Financial Results",
            "Summary": "Renaissance Global has released its Q4 financial results. The company reported an EBITDA of 382 million rupees, down from 420 million rupees year-over-year. The EBITDA margin decreased to 7.42% from 7.84% in the same period last year. Consolidated net profit for Q4 was 251 million rupees, up from 197 million rupees year-over-year and 243 million rupees quarter-over-quarter. Q4 revenue stood at 5.1 billion rupees, down from 5.37 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748610830000,
            "Source": "result"
        },
        {
            "Title": "Renaissance Global Reduces Debt by Rs 93 Crore in Q4 FY25",
            "Summary": "Renaissance Global has successfully reduced its debt by Rs 93 crore during the fourth quarter of fiscal year 2025. This significant debt reduction is expected to strengthen the company's financial flexibility and improve its balance sheet.",
            "Sentiment": "positive",
            "PublishDate": 1746589485000,
            "Source": "default"
        },
        {
            "Title": "Renaissance Global to Discontinue Bhavnagar Plant Operations",
            "Summary": "Renaissance Global has announced the discontinuation of operations at its Bhavnagar plant. The company expects this move to result in annual cost savings of 150 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1744727342000,
            "Source": "default"
        },
        {
            "Title": "Renaissance Global to Close Bhavnagar Unit Operations",
            "Summary": "The board of Renaissance Global has approved the closure of operations at its Bhavnagar, Gujarat unit. This decision represents a significant change in the company's operational structure.",
            "Sentiment": "negative",
            "PublishDate": 1744637217000,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Approves Investment in VJFZCO",
            "Summary": "Renaissance Global has approved an investment of up to 290 million rupees in VJFZCO. This decision represents a significant financial commitment by the company, potentially indicating plans for expansion or strategic growth.",
            "Sentiment": "positive",
            "PublishDate": 1742472915000,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Reduces Gross Debt by ₹53 Crore in Q4 FY 2025",
            "Summary": "Renaissance Global has announced a significant improvement in its financial position during the ongoing fourth quarter of the fiscal year 2025. The company has successfully reduced its gross debt by approximately ₹53 crore, demonstrating a commitment to strengthening its balance sheet and improving financial stability.",
            "Sentiment": "positive",
            "PublishDate": 1742284193000,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Reports Q3 EBITDA and Margin Decline",
            "Summary": "Renaissance Global has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 510 million rupees, compared to 516 million rupees in the same quarter last year, showing a slight year-over-year decrease. The EBITDA margin also declined to 7.17% from 7.87% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739454945000,
            "Source": "earnings"
        },
        {
            "Title": "Renaissance Global Reports Q3 Financial Results",
            "Summary": "Renaissance Global has announced its Q3 consolidated financial results. The company reported a net profit of 243 million rupees, which is lower compared to 279 million rupees in the same quarter last year (YoY). However, it shows an increase from 112 million rupees in the previous quarter (QoQ). The Q3 revenue stood at 7.1 billion rupees, up from 6.55 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739454893000,
            "Source": "earnings"
        },
        {
            "Title": "Renaissance Global Secures Major Lab-Grown Diamond Jewelry Order",
            "Summary": "Renaissance Global has received an order for 63,250 pieces of lab-grown diamond fashion jewelry from the largest U.S. retailer. This significant order demonstrates the company's strong position in the lab-grown diamond jewelry market and its ability to secure contracts with major retailers.",
            "Sentiment": "positive",
            "PublishDate": 1739172155000,
            "Source": "order&deals"
        },
        {
            "Title": "Renaissance Global Unit to Invest $3M in Jean Dousset Jewelry",
            "Summary": "Renaissance Global's subsidiary is making a strategic investment of $3 million in Jean Dousset Jewelry, a luxury jewelry brand. This move indicates Renaissance Global's expansion into the high-end jewelry market and potential for growth in the luxury sector.",
            "Sentiment": "positive",
            "PublishDate": 1738056229000,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Approves Investment in RD2C Ventures",
            "Summary": "Renaissance Global has approved an investment of up to 270 million rupees in RD2C Ventures Inc. This decision represents a significant financial commitment by the company, potentially aimed at expanding its business interests or strategic partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1737029057000,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Launches WithClarity.in for Customizable Lab-Grown Diamond Jewelry in India",
            "Summary": "Renaissance Global has introduced WithClarity.in, a new platform offering customizable lab-grown diamond jewelry to the Indian market. This launch represents a significant expansion of Renaissance Global's product offerings and a strategic move into the growing lab-grown diamond sector in India.",
            "Sentiment": "positive",
            "PublishDate": 1736924667000,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Approves Additional Investment in VJFZCO",
            "Summary": "Renaissance Global has approved an additional investment of up to 900 million rupees in VJFZCO, a company likely related to its business operations. This decision indicates a significant financial commitment and potential expansion or strengthening of the company's interests in VJFZCO.",
            "Sentiment": "positive",
            "PublishDate": 1735212929000,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Raises ₹163.49 Crore Through Preferential Share Allotment",
            "Summary": "Renaissance Global has successfully raised ₹163.49 crore through a preferential allotment of equity shares. This corporate action indicates a significant capital infusion for the company, which could be used for various purposes such as expansion, debt reduction, or funding new initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1735023346000,
            "Source": "corporate_action"
        },
        {
            "Title": "Renaissance Global Reports Improved Q2 EBITDA and Margin",
            "Summary": "Renaissance Global has announced its Q2 financial results. The company's EBITDA increased to 337 million rupees from 304 million rupees year-over-year. Additionally, the EBITDA margin improved to 8.19% from 6.89% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731508547000,
            "Source": "result"
        },
        {
            "Title": "Renaissance Global Reports Q2 FY24 Financial Results",
            "Summary": "Renaissance Global Limited has announced its consolidated financial results for the second quarter of fiscal year 2024. The company reported a net profit of 112 million rupees, showing a year-over-year increase from 105 million rupees in the same quarter last year. However, there was a quarter-over-quarter decrease from 156 million rupees. Revenue for Q2 stood at 4.1 billion rupees, down from 4.4 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1731508497000,
            "Source": "result"
        },
        {
            "Title": "Renaissance Global Approves 1.72 Billion Rupee Fundraising",
            "Summary": "Renaissance Global has approved raising funds totaling 1.72 billion rupees through the issuance of new shares. This decision indicates a significant capital raising effort by the company.",
            "Sentiment": "positive",
            "PublishDate": 1729695445000,
            "Source": "corporate_action"
        }
    ]
}