{
    "Symbol": "RHETAN",
    "ISIN": "INE0KKN01029",
    "News": [
        {
            "Title": "Rhetan TMT Q3FY26 Results & Corporate Updates",
            "Summary": "Rhetan TMT Limited reported Q3FY26 results with revenue of ₹615.48 lakh and net profit of ₹444.78 lakh. Board approved MOA amendment for commodities trading business and postal ballot process.",
            "Sentiment": "positive",
            "PublishDate": 1770894854644,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rhetan TMT Shareholders Approve Independent Director",
            "Summary": "Rhetan TMT Limited shareholders overwhelmingly approved the regularization of Mr. Swapnil Sharad Shimpri as Non-Executive Independent Director through postal ballot with 99.9999% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1770230963507,
            "Source": "stocks"
        },
        {
            "Title": "Rhetan TMT Board Approves Postal Ballot Process",
            "Summary": "Rhetan TMT Limited's board approved postal ballot notice for regularizing appointment of Additional Independent Director, with e-voting scheduled from January 6 to February 4, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767339933248,
            "Source": "stocks"
        },
        {
            "Title": "Rhetan TMT Limited Appoints Swapnil Sharad Shimpi as Additional Independent Director",
            "Summary": "Rhetan TMT Limited's Board of Directors appointed Mr. Swapnil Sharad Shimpi as an Additional Independent Director effective November 10, 2025. Shimpi, aged 44 years, holds an MBA in Marketing and has been appointed for a term of 5 years, subject to regularization by shareholders at the General Meeting. The company stated that his marketing and analytical skills will help in decision making for the company and shareholders. The Board confirmed that Shimpi has not been debarred from holding the office of Director by SEBI or other authorities.",
            "Sentiment": "positive",
            "PublishDate": 1762779329800,
            "Source": "corporate_governance"
        },
        {
            "Title": "RHETAN TMT Reports Mixed Q2 Results with 26% Net Profit Growth Despite Revenue Decline",
            "Summary": "RHETAN TMT reported quarterly net profit of 28.7 million rupees, representing a 26% increase from 22.7 million rupees in the same period last year. However, revenue declined to 47.5 million rupees from 49.4 million rupees year-over-year. EBITDA dropped significantly to 10.1 million rupees compared to 31.2 million rupees in the previous year, while EBITDA margin contracted sharply to 23.04% from 63.16%.",
            "Sentiment": "neutral",
            "PublishDate": 1762773017505,
            "Source": "earnings"
        },
        {
            "Title": "Rhetan TMT Limited Receives NSE Main Board Listing Approval for 79.69 Crore Equity Shares",
            "Summary": "Rhetan TMT Limited has received approval from the National Stock Exchange of India Limited for listing its 79,68,75,000 equity shares on the NSE Main Board. The equity shares, with a face value of Re. 1 each, will be listed and admitted for trading on NSE starting September 26, 2025, under the symbol 'RHETAN'. The approval covers the company's entire issued, subscribed and fully paid-up equity share capital. NSE confirmed the listing details in its approval letter dated September 24, 2025, specifying that the shares will trade in the EQ series with a market lot of 1.",
            "Sentiment": "positive",
            "PublishDate": 1758723490319,
            "Source": "stock"
        },
        {
            "Title": "Rhetan TMT Limited Reports Quarterly Results and Approves NSE Main Board Listing",
            "Summary": "Rhetan TMT Limited's Board of Directors approved standalone unaudited financial results for the quarter ended June 30, 2025, and decided to list the company's equity shares on the Main Board of National Stock Exchange of India Limited. The company reported revenue from operations of Rs 503.56 lakh for the quarter, compared to Rs 1,934.65 lakh in the same quarter last year. Net profit for the quarter was Rs 75.80 lakh versus Rs 80.67 lakh in the previous year quarter. Total income including other income was Rs 571.29 lakh. The company operates in a single segment manufacturing TMT bars and has a paid-up equity share capital of Rs 7,968.75 lakh with face value of Re 1 per share. Basic and diluted earnings per share stood at Re 0.01 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754907837018,
            "Source": "earnings"
        },
        {
            "Title": "Restoration Hardware: Stock Plunges 40% on Trump's New Tariff Announcement",
            "Summary": "RH shares dropped 40% following President Trump's announcement of new tariffs, particularly affecting Vietnam and China. The company sources 70% of its products from Asia, with over half coming from these two countries. CEO Gary Friedman expressed surprise at the extent of the tariffs during an earnings call.",
            "Sentiment": "negative",
            "PublishDate": 1743694894000,
            "Source": "normal_news"
        },
        {
            "Title": "Rhetan TMT: Stock Split and Bonus Shares Boost Investment Value",
            "Summary": "Rhetan TMT, a BSE SME IPO, implemented a 1:10 stock split and 11:4 bonus share issuance on March 10, 2023. These corporate actions have significantly increased shareholder value, turning an initial ₹1.40 lakh investment into ₹5.49 lakh over two years. The company's shares closed at ₹21.55 on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1733550799000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rhetan TMT: Bonus Issue and Stock Split Announced",
            "Summary": "Rhetan TMT Ltd has declared a bonus issue of 11:4 and proposed a stock split of 1:10. The company's Q2FY25 net profit increased by 234.1% YoY to Rs 2.27 crore, despite a 52.7% decline in net sales. Rhetan TMT is also focusing on sustainability, planning to set up a 2 MW solar power plant in Kadi, Gujarat by 2025.",
            "Sentiment": "positive",
            "PublishDate": 1730361081000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rhetan TMT Reports Significant Q2 EBITDA Growth",
            "Summary": "<p>Rhetan TMT has announced its <span class='neutral'>Q2 financial results</span>, showing <span class='positive'>substantial year-over-year improvement</span>. The company's <span class='neutral'>EBITDA</span> <span class='positive'>increased</span> from 10.4 million rupees to 31 million rupees. Additionally, the <span class='neutral'>EBITDA margin</span> saw a <span class='positive'>dramatic rise</span> from <b>10.03%</b> to <b>63.15%</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728482272000,
            "Source": "result"
        },
        {
            "Title": "Rhetan TMT Reports Q2 Financial Results",
            "Summary": "<p>Rhetan TMT has announced its <span class='neutral'>Q2 financial results</span>. The company's <span class='positive'>net profit increased</span> to <b>23 million rupees</b>, up from 7 million rupees year-over-year and 8.1 million rupees quarter-over-quarter. However, <span class='negative'>Q2 revenue decreased</span> to <b>49.5 million rupees</b> from 105 million rupees in the same quarter last year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728482080000,
            "Source": "result"
        },
        {
            "Title": "Rhetan TMT: Shares Surge 6% on Solar Power Plant Plans",
            "Summary": "<p>Rhetan TMT Ltd's stock <span class='positive'>rose 6%</span> to ₹18.38 after announcing plans to <b>build a 2 MW solar power plant</b> at its Kadi facility in Gujarat. The company aims to <span class='positive'>reduce production costs</span> and <span class='positive'>carbon emissions</span>. Rhetan TMT <b>signed an MoU</b> with the Gujarat government during the Vibrant Gujarat Global Summit 2024 for necessary approvals.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728370072000,
            "Source": "normal_news"
        }
    ]
}