{
    "Symbol": "RHFL",
    "ISIN": "INE217K01011",
    "News": [
        {
            "Title": "RHFL Resolution Professional Clarifies CBI Case Report",
            "Summary": "Reliance Home Finance's Resolution Professional states no CBI notice received regarding reported ₹228 crore fraud case, updates correspondence details for CIRP proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1765385356109,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Home Finance Limited Holds Third Committee of Creditors Meeting Under Insolvency Process",
            "Summary": "Reliance Home Finance Limited conducted its third Committee of Creditors meeting on December 1, 2025, as part of its ongoing Corporate Insolvency Resolution Process. The meeting was held under the supervision of Interim Resolution Professional Umesh Balaram Sonkar and affects the company's creditors and stakeholders involved in the insolvency proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1764592962086,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Home Finance Publishes Form G Inviting Expression of Interest Under CIRP",
            "Summary": "Reliance Home Finance Limited, currently undergoing Corporate Insolvency Resolution Process (CIRP), published Form G on November 15, 2025 in The Financial Express and Navshakti newspapers inviting expressions of interest from potential resolution applicants. The mortgage lending company has set December 25, 2025 as the deadline for issuing the final list of prospective resolution applicants, with resolution plan submissions due by January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763553883435,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Home Finance Limited Schedules Committee of Creditors Meeting Under Insolvency Process",
            "Summary": "Reliance Home Finance Limited has scheduled its 024th Committee of Creditors (CoC) meeting for November 11, 2025, at 5:00 P.M. via video conferencing. The company is currently under Corporate Insolvency Resolution Process (CIRP), which was initiated as previously intimated on September 20, 2025. Umesh Balaram Sonkar serves as the appointed Resolution Professional overseeing the insolvency proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1762849284637,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Home Finance Limited Holds First Committee of Creditors Meeting During Insolvency Process",
            "Summary": "Reliance Home Finance Limited held its first Committee of Creditors meeting on October 15, 2025, at 5:00 PM as part of its ongoing Corporate Insolvency Resolution Process. The meeting was conducted under the supervision of Interim Resolution Professional Umesh Balaram Sonkar. The company had previously initiated the Corporate Insolvency Resolution Process on September 20, 2025. The update was communicated to BSE and NSE exchanges where the company is listed under scrip code 540709 and symbol RHFL respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1760605688359,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Home Finance Schedules First Committee of Creditors Meeting Under Insolvency Process",
            "Summary": "Reliance Home Finance Limited has scheduled its first Committee of Creditors (CoC) meeting for October 15, 2025, at 5:00 PM via video conferencing as part of its ongoing Corporate Insolvency Resolution Process (CIRP). The CIRP commenced on September 16, 2025. Interim Resolution Professional Umesh Balaram Sonkar disclosed the creditor list, showing total claims of ₹152.16 crore from 84 creditors, with ₹103.07 crore admitted from 2 unsecured financial creditors. The two main admitted creditors are Invent Assets Securitisation & Reconstruction Private Limited (₹8.44 crore, 81.87% voting share) and RIMPL Management Private Limited (₹1.87 crore, 18.13% voting share). Additional claims worth ₹4.16 crore remain under verification, while ₹0.75 crore in operational creditor claims were not admitted.",
            "Sentiment": "negative",
            "PublishDate": 1760362007729,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Home Finance Enters Insolvency Process Over ₹7.81 Crore Default",
            "Summary": "The National Company Law Tribunal Mumbai Bench has admitted Reliance Home Finance Limited into Corporate Insolvency Resolution Process following an application by financial creditor Invent Assets Securitisation & Reconstruction Private Limited. The company defaulted on ₹7.81 crore including ₹80.98 lakh in outstanding interest as of December 3, 2024. The debt originated from an inter-corporate loan facility of ₹9.5 crore sanctioned in April 2023 with a 15-month repayment period and 10% annual interest. Mr. Umesh Balaram Sonkar has been appointed as Interim Resolution Professional, with the Board of Directors' powers now suspended. A moratorium has been declared prohibiting legal proceedings, asset transfers, and recovery actions against the company. The financial creditor must pay ₹2 lakh advance to the IRP within seven days to cover initial CIRP costs.",
            "Sentiment": "negative",
            "PublishDate": 1758346130004,
            "Source": "corporate_action"
        },
        {
            "Title": "ED Launches Money Laundering Probe Into Reliance Home Finance and Reliance Commercial Finance",
            "Summary": "The Enforcement Directorate has initiated a money laundering investigation into suspected loan frauds by Reliance Home Finance Ltd. and Reliance Commercial Finance Ltd., based on two CBI FIRs. The probe involves loans totaling Rs 12,524 crore extended by RHFL and RCFL, with the majority disbursed to firms linked to the Reliance Anil Ambani Group. Of these loans, Rs 6,931 crore have been declared non-performing assets. Preliminary findings indicate funds were routed back to other Reliance group companies, suggesting circular lending practices. Yes Bank's Rana Kapoor played a key role in sanctioning these loans, with his family-linked firms also receiving credit facilities. A Grant Thornton audit has identified significant fund diversion and lending policy violations. The ED has conducted searches across 60 companies and 22 individuals. State Bank of India has declared Reliance Communications and Anil Ambani's account as fraud, filing a CBI complaint. SEBI has barred Anil Ambani and senior group executives from securities markets for five years and imposed monetary penalties for alleged fund diversion from Reliance Home Finance.",
            "Sentiment": "negative",
            "PublishDate": 1753714982014,
            "Source": "stock"
        },
        {
            "Title": "SEBI: Rs 130 Crore Demand Notices Issued in Reliance Home Finance Case",
            "Summary": "SEBI has issued demand notices totaling Rs 130 crore to five entities for illegal fund diversion from Reliance Home Finance Ltd. The entities have 15 days to pay or face asset and bank account attachment. This follows SEBI's August order barring Anil Ambani and 24 others from the securities market for five years due to fraudulent fund siphoning.",
            "Sentiment": "negative",
            "PublishDate": 1730754382000,
            "Source": "normal_news"
        }
    ]
}