{
    "Symbol": "RHIM",
    "ISIN": "INE743M01012",
    "News": [
        {
            "Title": "RHI Magnesita India schedules Q3FY26 results call",
            "Summary": "RHI Magnesita India Limited announces investor conference call on February 16, 2026 at 11:00 AM IST to discuss Q3FY26 and nine months ended December 31, 2025 financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1770812750701,
            "Source": "co_actions_results"
        },
        {
            "Title": "RHI Magnesita Board Meeting Set for February 13, 2026",
            "Summary": "RHI Magnesita India Limited announces board meeting on February 13, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until February 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769765042185,
            "Source": "co_actions_results"
        },
        {
            "Title": "RHI Magnesita Appoints Alvaro Martin Rivero as Director",
            "Summary": "RHI Magnesita India Limited's Board approves appointment of Alvaro Martin Rivero as Additional Non-Executive Director effective January 14, 2026, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768373861614,
            "Source": "stocks"
        },
        {
            "Title": "RHI Magnesita India Director Resigns Due to Conflict of Interest",
            "Summary": "Ms. Ticiana Kobel, Non-executive Director of RHI Magnesita India Limited, resigned from the Board effective November 17, 2025, citing an unavoidable conflict arising from her new position on the Supervisory Board of RHI Magnesita GmbH. Her resignation affects her membership in three key Board committees including Nomination Remuneration Committee, Risk Management Committee, and Corporate Social Responsibility Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1763449048213,
            "Source": "corporate_governance"
        },
        {
            "Title": "RHI Magnesita India Reports Record Revenue of ₹1,035 Crore in Q2FY26",
            "Summary": "RHI Magnesita India Limited, a manufacturer and supplier of high-grade refractory products, reported unaudited consolidated financial results for Q2FY26. The company achieved record quarterly revenue of ₹1,035 crore, marking an 8% quarter-on-quarter increase. Shipment volumes reached 141 KT, up 9% QoQ. EBITDA stood at ₹111 crore (7% QoQ increase) and profit after tax was ₹38 crore (9% QoQ increase). Chairman, MD & CEO Parmod Sagar highlighted this as the highest quarterly turnover in company history, with revenue crossing ₹1,000 crore once again. He noted strong performance across all segments despite input cost pressures, with the Ironmaking segment and 4PRO solutions model delivering consistent value. The company also issued a corrigendum correcting a clerical error in their earlier press release, clarifying that the results were unaudited rather than audited consolidated financial results.",
            "Sentiment": "positive",
            "PublishDate": 1762923630458,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita India Reports 30.5% Revenue Growth in Q2 FY26",
            "Summary": "RHI Magnesita India Limited reported consolidated revenue from operations of Rs 1,035.36 crores for the quarter ended September 30, 2025, representing a 19.4% increase compared to Rs 867.07 crores in the same quarter last year. For the half-year period, consolidated revenue reached Rs 1,995.67 crores, up 14.3% from Rs 1,745.82 crores in the previous year. The company's consolidated profit after tax for the quarter was Rs 3,844.75 crores, compared to Rs 4,608.40 crores in the corresponding quarter of the previous year. On a standalone basis, the company achieved revenue of Rs 862.13 crores for the quarter, up 30.5% from Rs 660.99 crores year-on-year. The Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company operates primarily in manufacturing refractories and monolithics. During the period, subsidiary Intermetal Engineers acquired 100% shareholding in Ashwath Technologies Private Limited for Rs 1,411.89 lakhs in August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762771312076,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita India Reports Flat EBITDA but Lower Profit in Q2",
            "Summary": "RHI Magnesita India reported Q2 EBITDA of 1.1 billion rupees, unchanged from the previous year. However, the EBITDA margin declined to 10.6% from 12.35% year-over-year. The company's consolidated net profit dropped to 383 million rupees compared to 459 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1762765311439,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita Parent Company Expects Higher India Market Share in Second Half",
            "Summary": "RHI Magnesita's parent company expects to gain increased market share in India during the second half. The company anticipates growth in its Indian operations during this period.",
            "Sentiment": "positive",
            "PublishDate": 1762762895024,
            "Source": "stock"
        },
        {
            "Title": "RHI Magnesita India Sets Record Date for Rs. 2.50 Final Dividend",
            "Summary": "RHI Magnesita India Limited has set Friday, 12 September 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 2.50 per equity share for FY 2024-25. The dividend payment is subject to shareholder approval at the upcoming Annual General Meeting. Upon declaration at the AGM, dividend disbursement will be made by Friday, 25 October 2025 to eligible shareholders holding shares in both dematerialized and physical form as of the record date. The dividend will be subject to deduction of applicable taxes.",
            "Sentiment": "positive",
            "PublishDate": 1755524953843,
            "Source": "corporate_action"
        },
        {
            "Title": "RHI Magnesita India Reports 9% Revenue Growth in Q1 FY26 Despite Margin Pressures",
            "Summary": "RHI Magnesita India Limited reported revenue of INR 960 crores for Q1 FY26, representing 9% year-on-year growth and 5% sequential growth. Shipment volumes increased 13% year-on-year to 129 kilotons, driven by regained market share across segments. Operating EBITDA stood at INR 103 crores with margins at 10.8%, up from 10.2% in the previous quarter. However, margins declined 51 basis points year-on-year due to elevated raw material costs, particularly alumina prices. The company achieved a 13% increase in shipments and secured price increases from customers. Production increased 9% year-on-year to 85,000 tons with capacity utilization improving to 66%. The company deployed India's first complete robotics solution in a continuous casting plant and enhanced steel flow control capabilities through acquisition of Ashwath Technology. Management expects margin improvement in coming quarters as high-cost inventory is consumed and pricing initiatives take effect, targeting full-year EBITDA margins similar to previous year levels.",
            "Sentiment": "positive",
            "PublishDate": 1755180789657,
            "Source": "earnings"
        },
        {
            "Title": "Rhi Magnesita Plans Capital Expenditure Doubling and Market Share Expansion Across Key Segments",
            "Summary": "Rhi Magnesita announced significant expansion plans during a conference call. The company's capital expenditure is expected to double from last year's levels, with plans to return to FY24 capex levels next year. The company substantially increased its cement market share from 12-13% to 42-43% following the Dalmia acquisition. For FY26, Rhi Magnesita aims to match FY25's EBITDA margin of 13.7% while expecting 8-9% volume growth. In the iron-making segment, the company targets growing market share from the current 13% to 25-30% over the next 2-3 years. Additionally, Rhi Magnesita plans to localize production of high-margin products from recently acquired companies Resco and PDD factories for the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1754969843524,
            "Source": "global"
        },
        {
            "Title": "RHI Magnesita India Uploads Audio Recording of Q1 FY26 Earnings Conference Call",
            "Summary": "RHI Magnesita India Limited has made available the audio recording of its conference call discussing the company's earnings performance for the first quarter ended 30 June 2025. The conference call was held on 11 August 2025, and the recording has been uploaded to the company's website. The company notified both BSE and NSE about the availability of this audio recording.",
            "Sentiment": "neutral",
            "PublishDate": 1754902632631,
            "Source": "earnings"
        },
        {
            "Title": "Rhi Magnesita India Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Rhi Magnesita India reported quarterly net profit of 465 million rupees, down from 816 million rupees in the same period last year. Revenue increased to 8 billion rupees from 7 billion rupees year-over-year. EBITDA declined to 821 million rupees compared to 1.3 billion rupees previously, while EBITDA margin compressed to 10.19% from 18.32% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1754872078680,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita Targets Growth with 30% Market Share and Robotic Steelmaking Innovation",
            "Summary": "RHI Magnesita is pursuing growth strategies including innovative robotic steelmaking technology and the acquisition of Ashwath Tech. The company holds a 30% market share and is focusing on iron-making growth, research-driven productivity improvements, and export initiatives to maintain margins. These efforts are positioned within a refractory market expected to grow at 6-8% CAGR.",
            "Sentiment": "positive",
            "PublishDate": 1754671361548,
            "Source": "stock"
        },
        {
            "Title": "RHI Magnesita India Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "RHI Magnesita India reported Q1 revenue of 8 billion rupees, up from 7 billion rupees in the same period last year. However, the company's profitability declined significantly with EBITDA falling to 821 million rupees from 1.3 billion rupees year-over-year. The EBITDA margin compressed to 10.19% from 18.32% in the previous year. Net profit also decreased to 465 million rupees compared to 816 million rupees in the corresponding quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1754656950608,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita India Reports Q1 FY26 Results, Appoints New Secretarial Auditor",
            "Summary": "RHI Magnesita India Limited's Board approved unaudited consolidated and standalone financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported total income of Rs. 96,142.11 lakhs and profit after tax of Rs. 3,526.79 lakhs, with basic earnings per share of Rs. 1.71. Standalone results showed total income of Rs. 80,599.79 lakhs and profit after tax of Rs. 4,654.03 lakhs, with basic earnings per share of Rs. 2.25. The Board also appointed Mr. Naresh Verma as Secretarial Auditor for a five-year term from the conclusion of the upcoming Annual General Meeting until 2030, subject to shareholder approval. Post-quarter, the company made additional investment of Rs. 249.71 lakhs in subsidiary Intermetal Engineers (India) Private Limited, which subsequently acquired 100% shareholding in Ashwath Technologies Private Limited for Rs. 1,411.89 lakhs on August 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754649954455,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita India Schedules Q1 FY26 Earnings Conference Call for August 11",
            "Summary": "RHI Magnesita India Limited has scheduled an investors' conference call for August 11, 2025, at 11:00 AM IST to discuss its unaudited financial results for Q1 FY26 (quarter ended June 30, 2025). The earnings call will be led by Chairman, Managing Director & CEO Parmod Sagar and Whole-Time Director & CFO Azim Syed. The company has provided multiple access numbers for participants including primary numbers for India, toll-free numbers for USA, UK, Singapore, and Hong Kong, along with a Diamond Pass registration link.",
            "Sentiment": "neutral",
            "PublishDate": 1754407329380,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita India Completes ₹14.12 Crore Acquisition of Ashwath Technologies",
            "Summary": "RHI Magnesita India Limited's wholly owned subsidiary, Intermetal Engineers (India) Private Limited, has completed the acquisition of 100% shareholding of Ashwath Technologies Private Limited for ₹14.12 crore. The acquisition was completed on August 01, 2025, making Ashwath a step-down subsidiary of RHI Magnesita India Limited. The transaction involved acquiring 10,000 equity shares of face value ₹10 each. The Share Purchase Agreement was originally executed on March 04, 2025, and the acquisition has now been completed after fulfilling all closing conditions mentioned in the agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1754057112211,
            "Source": "order&deals"
        },
        {
            "Title": "RHI Magnesita India Shareholders Approve Director Appointments Through Postal Ballot",
            "Summary": "RHI Magnesita India Limited conducted a postal ballot through remote e-voting for four director-related resolutions. The voting period ran from June 25 to July 24, 2025. Shareholders approved the appointment of Priyabrata Panda as Independent Director with 99.99% votes in favor. The re-appointment of Nazim Sheikh as Independent Director for a second term received 99.91% approval. Azim Syed's appointment as Director was approved with 99.94% votes, while his appointment as Whole-time Director and Chief Financial Officer received 94.90% approval. All four resolutions were successfully passed with strong shareholder support.",
            "Sentiment": "positive",
            "PublishDate": 1753443647809,
            "Source": "corporate_action"
        },
        {
            "Title": "Rhi Magnesita India Reports Q4 Profit and Dividend",
            "Summary": "Rhi Magnesita India has reported a net profit of 364 million rupees in Q4, compared to a loss of 2.3 billion rupees in the same quarter last year. The company's profit increased from 561.7 million rupees in the previous quarter. Q4 revenue rose to 7.55 billion rupees from 7.36 billion rupees year-over-year. The company has recommended a final dividend of 2.50 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1748477285000,
            "Source": "default"
        },
        {
            "Title": "RHI Magnesita India Reports Q4 Results and Dividend",
            "Summary": "RHI Magnesita India has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 7.55 billion rupees from 7.36 billion rupees year-over-year. However, EBITDA decreased to 726 million rupees from 1.28 billion rupees, with EBITDA margin falling to 9.61% from 17.35%. The company reported a net profit of 364 million rupees in Q4, compared to a loss of 2.3 billion rupees in the same quarter last year and a profit of 561.7 million rupees in the previous quarter. Additionally, the company has recommended a final dividend of 2.50 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748448094000,
            "Source": "result"
        },
        {
            "Title": "RHI Magnesita India: Stock Surges 36% in Two Weeks, Erasing Six-Month Losses",
            "Summary": "RHI Magnesita India's stock has risen 36% in the last two weeks, from ₹392 to ₹533, erasing its six-month losses. The company reported strong Q4 results with revenue exceeding ₹1,000 crore for the first time. Despite near-term challenges, the company remains cautiously optimistic about mid-term goals.",
            "Sentiment": "positive",
            "PublishDate": 1743573311000,
            "Source": "normal_news"
        },
        {
            "Title": "RHI Magnesita India Subsidiary to Acquire Ashwath Technologies",
            "Summary": "A subsidiary of RHI Magnesita India has executed a share purchase agreement to acquire 100% of the share capital of Ashwath Technologies for 140 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1741086776000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rhi Magnesita India Reports Q3 Financial Results",
            "Summary": "Rhi Magnesita India has announced its financial results for the third quarter. The company's net profit increased to 562 million rupees, up from 514 million rupees year-over-year and 488 million rupees quarter-over-quarter. Revenue for Q3 rose to 7.74 billion rupees, compared to 6.9 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739320442000,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita India Reports Improved Q3 EBITDA and Margin",
            "Summary": "RHI Magnesita India has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased to 965 million rupees from 806 million rupees year-over-year. Additionally, the EBITDA margin rose to 12.46% from 11.64% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739281580000,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita India Reports Q3 Financial Results",
            "Summary": "RHI Magnesita India has announced its financial results for the third quarter. The company's net profit increased to 562 million rupees, up from 514 million rupees year-over-year and 488 million rupees quarter-over-quarter. Revenue for Q3 rose to 7.74 billion rupees, compared to 6.9 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739281504000,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita India to Consider Q3 Results on February 11",
            "Summary": "RHI Magnesita India has announced that it will be considering its third quarter (Q3) financial results on February 11. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737723460000,
            "Source": "earnings"
        },
        {
            "Title": "RHI Magnesita: Confident in Achieving 15% Margin Target",
            "Summary": "RHI Magnesita expects price increases to boost revenue in H2 2024. The company maintains its target of 14-15% blended margin for 2024-25. Volume growth of 4.8% was reported in the latest quarter, with pricing corrections expected to drive revenue up in the next quarter. The Dalmia asset's EBITDA has improved from 7% to 11.5%, with a target of 12-13%.",
            "Sentiment": "positive",
            "PublishDate": 1731062451000,
            "Source": "normal_news"
        },
        {
            "Title": "RHI Magnesita India Reports Q2 Financial Results",
            "Summary": "RHI Magnesita India has reported its Q2 financial results. The company's EBITDA for the quarter was 1.1 billion rupees, down from 1.5 billion rupees in the same quarter last year. The EBITDA margin decreased to 12.35% from 14.98% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730985120000,
            "Source": "result"
        },
        {
            "Title": "RHI Magnesita India Reports Q2 Financial Results",
            "Summary": "RHI Magnesita India has announced its Q2 consolidated net profit of 459 million rupees, showing a decrease from 713 million rupees year-over-year and 729 million rupees quarter-over-quarter. The company's Q2 revenue stands at 8.7 billion rupees, down from 9.9 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730985039000,
            "Source": "result"
        }
    ]
}