{
    "Symbol": "RHL",
    "ISIN": "INE508K01013",
    "News": [
        {
            "Title": "Robust Hotels Reports Quarterly Results and Approves Key Board Decisions",
            "Summary": "Robust Hotels Limited's Board approved unaudited financial results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs 598.66 lakhs for the quarter, with occupancy rate at 73%. Net profit after tax was Rs 362.74 lakhs for the quarter and Rs 365.05 lakhs for the half-year period. The Board also approved re-appointment of internal auditors for one year at Rs 8 lakhs remuneration, increased statutory auditor fees from Rs 7 lakhs to Rs 8 lakhs annually, and sanctioned refinancing of existing borrowings with ICICI Bank along with additional term loan of Rs 68 crores. The company operates Hotel Hyatt Regency in Chennai and has an investment division comprising shares, securities, mutual funds and loans.",
            "Sentiment": "positive",
            "PublishDate": 1762852476092,
            "Source": "earnings"
        },
        {
            "Title": "Robust Hotels Reports Record Performance with 40% EBITDA Growth in FY2025",
            "Summary": "Robust Hotels Limited announced strong financial results for FY2025, with operating income reaching Rs 13,628 lakhs (11.31% growth) and EBITDA surging 40% to Rs 5,586 lakhs. The company's flagship property Hyatt Regency Chennai achieved 73.81% occupancy (vs 68.01% previous year) with average room rates rising to Rs 7,914. Profit after tax increased significantly to Rs 1,646 lakhs from Rs 474 lakhs in the previous year. The company received a favorable court order and refund of Rs 15.12 crores plus Rs 5.75 crores interest from a litigation case. The company has scheduled its 18th AGM for August 21, 2025, via video conference, with key agenda items including director appointments and related party transaction approvals.",
            "Sentiment": "positive",
            "PublishDate": 1753861062716,
            "Source": "corporate_action"
        },
        {
            "Title": "Robust Hotels Amends Loan Agreement with Novak Hotels, Changes Interest Payment Schedule",
            "Summary": "Robust Hotels Limited has amended its loan agreement with Novak Hotels Private Limited, changing the interest payment schedule from quarterly to annual, effective retrospectively from 1st April 2025. All other terms of the original agreement remain unchanged. The amendment was made with mutual consent of both parties and relates to a short-term loan/advance agreement originally entered into in April 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1753705387984,
            "Source": "stock"
        }
    ]
}