{
    "Symbol": "RICOAUTO",
    "ISIN": "INE209B01025",
    "News": [
        {
            "Title": "Rico Auto Q3FY26: Revenue jumps 27.7% to ₹475.61 cr",
            "Summary": "Rico Auto Industries reported strong Q3FY26 results with revenue rising 27.7% YoY to ₹475.61 crores. Net profit after tax increased 29.8% to ₹5.58 crores, while nine-month revenue grew to ₹1,325.09 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770793540928,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rico Auto Board Meet Set for Feb 10 to Review Q3 Results",
            "Summary": "Rico Auto Industries has scheduled a board meeting on February 10, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770029153917,
            "Source": "co_actions_results"
        },
        {
            "Title": "RICO Auto Launches Railway Division, Gets RDSO Approval",
            "Summary": "RICO Auto Industries establishes new railway division and receives RDSO approval to manufacture spheroidal graphite cast iron inserts, while seeking permissions for additional high-quality railway components.",
            "Sentiment": "positive",
            "PublishDate": 1768894833016,
            "Source": "stocks"
        },
        {
            "Title": "Rico Auto Industries Reports Q2 FY26 Results, Targets 12-13% EBITDA Margins by Q4",
            "Summary": "Rico Auto Industries delivered stable quarterly performance with 5% consolidated revenue growth and 9.9% EBITDA margins, driven by 22% export growth and new product launches. The company expects significant margin improvement in Q3-Q4 through better capacity utilization of foundry and aluminum casting facilities, targeting revenue guidance of INR 2,600 crores for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763534993714,
            "Source": "earnings"
        },
        {
            "Title": "Rico Auto Industries Reports Strong Growth with Revenue Up 19% and Net Profit Surging 54.7%",
            "Summary": "Rico Auto Industries Limited announced quarterly results showing total revenue growth of 19% with net profit increasing 54.7% year-over-year, driven by strong domestic sales performance and new business wins. The automotive components manufacturer secured new programs worth ₹1,230 crores in H1FY26 and reported improving US export trends, demonstrating solid operational momentum.",
            "Sentiment": "positive",
            "PublishDate": 1763115759245,
            "Source": "earnings"
        },
        {
            "Title": "Rico Auto Industries Reports Strong Q2 Performance and Announces CFO Transition",
            "Summary": "Rico Auto Industries Limited announced its quarterly results for the quarter ended September 30, 2025, showing revenue from operations of Rs. 461.60 crores (standalone) and Rs. 627.36 crores (consolidated). The company reported a net profit of Rs. 10.47 crores (standalone) and Rs. 17.35 crores (consolidated) for the quarter. On a half-yearly basis, consolidated revenue reached Rs. 1,170.82 crores with net profit of Rs. 33.68 crores. The company also announced a leadership change with Shri Rakesh Kumar Sharma ceasing to be Chief Financial Officer due to superannuation, effective November 12, 2025. Shri Naveen Sorot, currently Vice President (Finance), has been appointed as the new CFO effective November 13, 2025. Sorot is a Chartered Accountant with over 20 years of experience in financial governance and has previously served as CFO at Steel Strips Wheels Limited and Sunbeam Auto Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762939058892,
            "Source": "earnings"
        },
        {
            "Title": "Rico Auto Industries Reports Triple Profit Growth in Q1 FY26, Targets 12-13% EBITDA Margins",
            "Summary": "Rico Auto Industries achieved revenue of INR 543 crores in Q1 FY26, maintaining levels similar to the previous year despite slower production volumes at OEMs including Maruti and Hero. The company's profitability tripled compared to the same quarter last year, with EPS improving to INR 1.24 from INR 0.42 in Q1 FY25. Management expects to achieve 12-13% EBITDA margins by Q4 FY26 through cost control measures and better capacity utilization. The company has an order book exceeding INR 1,000 crores annually and projects FY26 revenue of INR 2,652 crores. Rico showed growth of 4.4% in 2-wheeler segments while the market declined 6.2%. Key growth drivers include alloy wheels, EV and hybrid components, and pump business. The company is expanding into Railways and Defense sectors, targeting INR 80 crores revenue from these segments in FY26. Rico's Hosur facility remains on schedule with first production expected in Q1 2026. Management addressed US tariff concerns, stating they have settled arrangements with key customers and expect minimal negative impact due to their OEM-focused business model.",
            "Sentiment": "positive",
            "PublishDate": 1755602603031,
            "Source": "earnings"
        },
        {
            "Title": "Rico Auto Industries Sets Book Closure Period for Dividend Payment and 42nd AGM",
            "Summary": "Rico Auto Industries Limited announced a book closure period from September 10, 2025 to September 16, 2025 for dividend payment and the 42nd Annual General Meeting. The record date has been set for September 9, 2025. During the book closure period, the company's Register of Members and Share Transfer Books will remain closed to determine eligible shareholders for dividend payment and AGM participation.",
            "Sentiment": "neutral",
            "PublishDate": 1755079373214,
            "Source": "corporate_action"
        },
        {
            "Title": "Rico Auto Industries Reports Q1 FY26 Results, Approves Subsidiary Merger and Appoints New Auditor",
            "Summary": "Rico Auto Industries Limited reported its unaudited financial results for the first quarter ended June 30, 2025. On a standalone basis, revenue from operations declined to Rs 387.88 crores from Rs 415.07 crores in the previous quarter, while profit for the period was Rs 4.54 crores compared to Rs 8.41 crores in the previous quarter. On a consolidated basis, revenue from operations decreased to Rs 539.67 crores from Rs 545.26 crores in the previous quarter, with profit for the period at Rs 5.64 crores versus Rs 19.19 crores in the previous quarter. The National Company Law Tribunal approved the amalgamation scheme of subsidiary Rico Fluidtronics Limited with Rico Jinfei Wheels Limited, with an appointed date of April 1, 2023. The board also appointed PG & Associates as the secretarial auditor for five consecutive years from FY 2025-26 to 2029-30, subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "negative",
            "PublishDate": 1754993459755,
            "Source": "earnings"
        },
        {
            "Title": "Rico Auto Industries Reports 191% Jump in Q1 Net Profit to 163 Million Rupees",
            "Summary": "Rico Auto Industries reported Q1 consolidated net profit of 163 million rupees compared to 56 million rupees in the same period last year. Revenue remained flat at 5.4 billion rupees year-over-year. EBITDA increased to 539 million rupees from 433 million rupees, while EBITDA margin improved to 9.9% from 8% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754991173246,
            "Source": "earnings"
        },
        {
            "Title": "Rico Auto Industries Launches Railway Components Manufacturing Division",
            "Summary": "Rico Auto Industries Limited has established a new business vertical focused on manufacturing components for the railway sector, including parts for tracks, wagons, and carriages. Production has commenced at the company's Dharuhera facility, with some components already being supplied to Railways.",
            "Sentiment": "positive",
            "PublishDate": 1753441780238,
            "Source": "stock"
        },
        {
            "Title": "Rico Auto Industries Shareholders Approve Five Special Resolutions via Postal Ballot",
            "Summary": "Rico Auto Industries Limited announced that shareholders have passed five special resolutions through postal ballot. The approved resolutions include payment of commission to non-executive directors and reappointments of key personnel: Ms. Sarita Kapur as Independent Director, and three executives - Shri Kaushalendra Verma, Shri Rajiv Kumar Miglani, and Shri Samarth Kapur - as Whole-time Directors designated as Executive Directors. The postal ballot process was conducted with remote e-voting facilities, and results are available on the company's website and NSDL's platform.",
            "Sentiment": "positive",
            "PublishDate": 1753440775552,
            "Source": "corporate_action"
        },
        {
            "Title": "Rico Auto Industries Reports Q4 Financial Results",
            "Summary": "Rico Auto Industries has released its quarterly financial results. The company reported a consolidated net profit of 73.6 million rupees for the fourth quarter, compared to 163 million rupees in the same period last year. Revenue for Q4 remained stable at 5.5 billion rupees, unchanged from the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748390479000,
            "Source": "default"
        },
        {
            "Title": "Rico Auto Industries Reports Q4 Financial Results",
            "Summary": "Rico Auto Industries has released its Q4 financial results. The company's EBITDA decreased to 504 million rupees from 590 million rupees year-over-year. The EBITDA margin declined to 9.26% from 10.77% in the same period last year. Revenue remained stable at 5.5 billion rupees. Consolidated net profit fell to 73.6 million rupees from 163 million rupees in the previous year's quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748341085000,
            "Source": "result"
        },
        {
            "Title": "Rico Auto Industries Reports Significant Decline in Q3 Consolidated Net Profit",
            "Summary": "Rico Auto Industries has reported a consolidated net profit of 19 million rupees for the third quarter, marking a substantial decrease from 100 million rupees in the same period last year. This represents an 81% year-over-year decline in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1739345884000,
            "Source": "earnings"
        },
        {
            "Title": "Rico Auto Industries Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Rico Auto Industries has reported a decrease in its Q3 EBITDA, which fell to 450 million rupees from 583 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 8.15% from 11.13% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739345689000,
            "Source": "earnings"
        },
        {
            "Title": "Rico Auto Industries Reports Q2 EBITDA Decline",
            "Summary": "Rico Auto Industries has reported a decrease in its Q2 EBITDA, which fell to 490 million rupees from 544 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 8.51% from 9.75% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731311862000,
            "Source": "result"
        },
        {
            "Title": "Rico Auto Industries Reports Q2 Revenue Growth",
            "Summary": "Rico Auto Industries has announced its second quarter revenue for the current fiscal year. The company reported revenue of 5.8 billion rupees, compared to 5.53 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731311855000,
            "Source": "result"
        },
        {
            "Title": "Rico Auto Industries Reports Slight Increase in Q2 Net Profit",
            "Summary": "Rico Auto Industries has announced its Q2 consolidated net profit of 66 million rupees, showing a marginal increase from 64 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731311818000,
            "Source": "result"
        }
    ]
}