{
    "Symbol": "RISHABH",
    "ISIN": "INE0N2P01017",
    "News": [
        {
            "Title": "Rishabh Instruments uploads Q3 FY26 earnings call audio",
            "Summary": "Rishabh Instruments Limited has uploaded the audio recording of its Q3 FY 2025-26 earnings conference call held on February 6, 2026, to its website under regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770397954671,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rishabh Instruments Files Fund Utilization Statement",
            "Summary": "Rishabh Instruments Limited filed its quarterly statement on fund utilization deviation under SEBI regulations for the quarter ended December 31, 2025, showing modifications to its manufacturing expansion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1770312340772,
            "Source": "stocks"
        },
        {
            "Title": "Rishabh Instruments Allots 15,740 ESOP Shares",
            "Summary": "Rishabh Instruments Limited allotted 15,740 equity shares under ESOP Plan 2022 Scheme B to eligible employees, increasing paid-up capital to Rs. 38,49,73,480/-",
            "Sentiment": "neutral",
            "PublishDate": 1770205018689,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rishabh Instruments Board Meet on Feb 5 for Q3FY26",
            "Summary": "Rishabh Instruments Limited has scheduled its board meeting for February 5, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769752162640,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rishabh Instruments Auditor Firm Converts to LLP",
            "Summary": "Rishabh Instruments Limited announces that its statutory auditor M S K A & Associates has converted to LLP structure while continuing audit engagement without changes to existing obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1769502139540,
            "Source": "stocks"
        },
        {
            "Title": "Rishabh Instruments Allots 3,000 ESOP Shares",
            "Summary": "Rishabh Instruments Limited has allotted 3,000 equity shares under its Employee Stock Option Plan 2022 - Scheme B, increasing paid-up capital to ₹38.48 crores with shares priced at ₹250 each.",
            "Sentiment": "neutral",
            "PublishDate": 1769085163984,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rishabh Instruments receives warning letters from BSE, NSE",
            "Summary": "Rishabh Instruments Limited received warning letters from BSE and NSE dated January 6, 2026, for non-compliance with audit committee quorum requirements during a meeting held on February 7, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1767773028015,
            "Source": "stocks"
        },
        {
            "Title": "Rishabh Instruments Allots 3,165 ESOP Shares",
            "Summary": "Rishabh Instruments Limited allotted 3,165 equity shares under ESOP Plan 2022 - Scheme A on January 6, 2026, increasing paid-up capital to ₹38.48 crores with exercise price of ₹165 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1767699527374,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rishabh Instruments Secures Euro 1 Million Contract for Low Voltage Current Transformers",
            "Summary": "Rishabh Instruments Limited signed a contract worth Euro 1 million (Rs 10 Crores) with a leading European electrical equipment supplier for supplying Low Voltage Current Transformers. The deliveries are scheduled equally across FY26 and FY27, representing a significant international business expansion for the company.",
            "Sentiment": "positive",
            "PublishDate": 1765272656243,
            "Source": "order&deals"
        },
        {
            "Title": "Rishabh Instruments Reports Strong Q2 FY26 Results with 5-fold Profit Growth",
            "Summary": "Rishabh Instruments delivered consolidated revenue growth of 7.7% in Q2 FY26 and 9.9% in H1 FY26, with profitability increasing more than 5-fold driven by improved raw material sourcing and operational efficiencies. The company's standalone business grew 12.1% in the quarter with EBITDA margins expanding significantly to 26.1%, while maintaining confidence in achieving full-year EBITDA target of Rs. 100 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763726681428,
            "Source": "earnings"
        },
        {
            "Title": "Rishab Instruments Promoter Donates 5,000 Equity Shares to Healthcare Trust",
            "Summary": "Mr. Narendra Goliya, promoter of Rishab Instruments Limited, transferred 5,000 equity shares off-market to Dr. Babasaheb Ambedkar Vaidyakiya Pratishthan charitable trust on November 18, 2025. The donation supports construction of a new hospital building at Guruji Rugnalaya to expand healthcare capacity and improve medical services for the local community.",
            "Sentiment": "positive",
            "PublishDate": 1763551353915,
            "Source": "stock"
        },
        {
            "Title": "Rishabh Instruments Reports Strong Q2H1FY26 Results with Significant Margin Expansion",
            "Summary": "Rishabh Instruments Limited delivered consolidated revenue growth of 7.7% for the quarter and 9.9% for the half year, with consolidated EBITDA margins expanding by 1,130 bps and EBITDA growing 220.6% year-on-year during the quarter. The company's standalone revenue grew 12.1% in the quarter and 14.6% for the half year, driven by robust export momentum and new product launches, while achieving standalone EBITDA margin of 26.1% in Q2FY26 and PAT increase of 85.4%.",
            "Sentiment": "positive",
            "PublishDate": 1763176136451,
            "Source": "earnings"
        },
        {
            "Title": "Rishab Instruments Reports Fund Utilization Deviation in Manufacturing Expansion",
            "Summary": "Rishab Instruments Limited disclosed deviations in the utilization of Rs. 750 million raised through public issue in September 2023, with modified allocations for Nashik manufacturing facility expansions approved by shareholders in September 2024. The company reduced allocation for Manufacturing Facility I from Rs. 621.80 million to Rs. 321.80 million while increasing Facility II allocation from Rs. 300 million to Rs. 169.70 million for the quarter ended September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763054892176,
            "Source": "stock"
        },
        {
            "Title": "Rishabh Instruments' Independent Director Rathin Banerjee Retires, Board Committees Reconstituted",
            "Summary": "Rathin Banerjee, Non-Executive Independent Director of Rishabh Instruments Limited, retired from the Board effective September 12, 2025. Following his retirement, the company has reconstituted its Board committees. The reconstituted committees include the Audit Committee with Mr. Siddharth Bafna as Chairman, Stakeholder Relationship Committee also chaired by Mr. Siddharth Bafna, Nomination and Remuneration Committee chaired by Mr. Rajendra Bagwe, Risk Management Committee chaired by Mr. Narendra Goliya, and CSR Committee also chaired by Mr. Narendra Goliya. The committees comprise various independent directors, executive chairman, and whole-time directors in different capacities.",
            "Sentiment": "neutral",
            "PublishDate": 1757669711386,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rishabh Instruments' Independent Director Rathin Kumar Banerjee Retires from Board",
            "Summary": "Rathin Kumar Banerjee, Non-Executive Independent Director of Rishabh Instruments Limited, retired from the Board effective September 12, 2025. His retirement occurred upon completion of his tenure as an Independent Director in accordance with the Companies Act, 2013 and SEBI Listing Regulations. He was relieved from his duties on the same date. The company disclosed this board change through regulatory filings to NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757668920372,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rishabh Instruments Reports Fund Utilization Deviation for Quarter Ended June 30, 2025",
            "Summary": "Rishabh Instruments Limited submitted a statement reporting deviation in the utilization of funds raised through a public issue. The company raised Rs. 75 crores on September 11, 2023, and received shareholder approval for fund utilization changes on September 13, 2024. The original allocation included Rs. 62.18 crores for Expansion of Nashik Manufacturing Facility I and Rs. 7.92 crores for General Corporate Purpose. Following modifications, the company created a new object - Expansion of Nashik Manufacturing Facility II with Rs. 30 crores allocation, while reducing the original facility expansion allocation to Rs. 32.18 crores. As of the quarter ended June 30, 2025, the company utilized Rs. 12.47 crores for Facility I expansion, Rs. 11.40 crores for Facility II expansion, and Rs. 7.72 crores for general corporate purposes. No deviation occurred during the specific quarter, though overall fund allocation was modified with proper shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755158910089,
            "Source": "corporate_action"
        },
        {
            "Title": "Rishabh Instruments Reports Strong Q1 Performance with 447% Jump in Net Profit",
            "Summary": "Rishabh Instruments delivered strong quarterly results with consolidated net profit surging to 197 million rupees compared to 36 million rupees in the same period last year. The company's revenue also grew to 1.9 billion rupees from 1.7 billion rupees year-over-year, representing solid top-line growth alongside the significant improvement in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1755156557661,
            "Source": "earnings"
        },
        {
            "Title": "Rishabh Instruments Limited Approves Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Rishabh Instruments Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The results were accompanied by a Limited Review Report from MSKA & Associates, the company's statutory auditors. The board meeting was conducted via video conferencing on August 14, 2025, starting at 11:20 a.m. and concluding at 12:30 p.m. The financial results and review report will be available on the company's website at https://rishabh.co.in/.",
            "Sentiment": "neutral",
            "PublishDate": 1755156448557,
            "Source": "earnings"
        },
        {
            "Title": "Rishabh Instruments Director P.K. Ramakrishnan Retires, Board Committees Reconstituted",
            "Summary": "P.K. Ramakrishnan, Non-Executive-Non Independent Director of Rishabh Instruments Limited, retired from the Board effective July 30, 2025, following the conclusion of the Annual General Meeting. The company has reconstituted all Board committees following his retirement. The reconstituted committees include the Audit Committee with 7 members chaired by Siddharth Bafna, Stakeholder Relationship Committee with 3 members also chaired by Bafna, Nomination and Remuneration Committee with 4 members chaired by Rathin Banerjee, Risk Management Committee with 4 members chaired by Executive Chairman Narendra Goliya, and CSR Committee with 4 members chaired by Goliya. The new committee structure became effective from July 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753875001586,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rishabh Instruments Reports Q4 Financial Results",
            "Summary": "Rishabh Instruments has released its Q4 financial results. The company's EBITDA for Q4 was 162 million rupees, compared to 180.3 million rupees in the same quarter last year. The EBITDA margin decreased to 8.64% from 10.13% year-over-year. The consolidated net profit for Q4 was 64 million rupees, up from 24 million rupees year-over-year and 85 million rupees quarter-over-quarter. Q4 revenue increased to 1.87 billion rupees from 1.8 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748347008000,
            "Source": "result"
        },
        {
            "Title": "Rishabh Instruments Reports Significant EBITDA Growth in Q3",
            "Summary": "Rishabh Instruments has announced its Q3 financial results, showing a substantial improvement in EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization). The company's EBITDA increased to 144 million rupees, up from 47 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 7.95% from 2.95% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738939912000,
            "Source": "earnings"
        },
        {
            "Title": "Rishabh Instruments Reports Q3 Financial Results",
            "Summary": "Rishabh Instruments announced its Q3 consolidated net profit of 85 million rupees, showing an increase from 76 million rupees year-over-year and 41 million rupees quarter-over-quarter. The company's Q3 revenue reached 1.8 billion rupees, up from 1.59 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738939684000,
            "Source": "earnings"
        }
    ]
}