{
    "Symbol": "RITCO",
    "ISIN": "INE01EG01016",
    "News": [
        {
            "Title": "Ritco Logistics Wins ₹82 Cr Contracts in Jan 2026",
            "Summary": "Ritco Logistics secured new transportation contracts worth ₹82 crore in January 2026, including long-term steel sector deals worth ₹233 crore and partnerships with ITC Ltd across multiple verticals.",
            "Sentiment": "positive",
            "PublishDate": 1770717000708,
            "Source": "stocks"
        },
        {
            "Title": "RITCO Logistics Secures ₹205 Cr New Contracts",
            "Summary": "RITCO Logistics announces securing approximately ₹205 crore worth of new contracts for December 2025, marking significant business growth for the logistics company.",
            "Sentiment": "positive",
            "PublishDate": 1767620599228,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ritco Logistics Submits Missing Auditor Report Annexure",
            "Summary": "Ritco Logistics Limited clarifies submission of inadvertently omitted Annexure 'B' - CARO Report from Independent Auditor's Report for FY25, with no changes to financial statements or audit opinion.",
            "Sentiment": "neutral",
            "PublishDate": 1767269746577,
            "Source": "stocks"
        },
        {
            "Title": "RITCO Logistics Wins ₹230 Cr Contracts",
            "Summary": "RITCO Logistics secures approximately ₹230 crore in new contracts for November 2025, while subsidiary TruckSup focuses on leadership enhancement and growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1765980668869,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ritco Logistics Secures ₹230 Cr Contracts in Nov 2025",
            "Summary": "Ritco Logistics Limited reported securing new transportation and supply chain contracts worth approximately ₹230 crores in November 2025, including major steel, flyash, and 3PL partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1765973191043,
            "Source": "stocks"
        },
        {
            "Title": "Ritco Logistics Reports Best-Ever Q2 FY26 Performance with H1 Revenue Crossing ₹714 Cr",
            "Summary": "Ritco Logistics delivered its strongest quarterly performance in Q2 FY26 with standalone operating income of ₹358.15 cr and net profit of ₹12.67 cr, driven by steel logistics expansion, multimodal offerings, and digital transformation initiatives. The integrated logistics company secured major contracts across steel, petrochemicals, and infrastructure sectors while expanding operations to five states and upgrading its fleet with 50 custom-built vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1763124620203,
            "Source": "earnings"
        },
        {
            "Title": "Ritco Logistics Reports 34.5% Revenue Growth in Q2 FY2026",
            "Summary": "Ritco Logistics Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of ₹36,038.46 lakhs for the quarter, compared to ₹27,909.15 lakhs in the same quarter last year, representing a 29% increase. For the half year, consolidated revenue reached ₹71,471.38 lakhs versus ₹53,131.90 lakhs in the previous year. Net profit for the quarter stood at ₹932.57 lakhs compared to ₹1,033.19 lakhs last year. On a standalone basis, the company achieved revenue of ₹36,017.11 lakhs for the quarter against ₹27,909.15 lakhs last year. The Board of Directors approved these unaudited financial results in a meeting held on November 12, 2025. The statutory auditors issued an unmodified opinion on the financial statements. The results include consolidated figures from subsidiaries Logro Sourcing Private Limited and Trucksup Solutions Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762969526936,
            "Source": "earnings"
        },
        {
            "Title": "RITCO Logistics Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "RITCO Logistics reported Q2 net profit of 101 million rupees, down from 106 million rupees in the same period last year. Revenue increased to 3.6 billion rupees from 2.79 billion rupees year-over-year. EBITDA rose to 259 million rupees from 215 million rupees, while EBITDA margin declined to 7.18% from 7.70% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762955126351,
            "Source": "earnings"
        },
        {
            "Title": "Ritco Logistics Secures ₹130 Crore New Contracts in October 2025",
            "Summary": "Ritco Logistics Limited announced multiple high-value transportation and supply chain contracts totaling ₹130 crore in October 2025. Major contracts include a ₹60 crore pan-India agreement with a petrochemical company for transportation from Haldia, a ₹35 crore nationwide logistics contract from Nestle India, and a two-year engagement with Nayara Energy for pan-India movements from Gujarat. The company also secured a ₹12 crore two-year contract from Tata Metaliks for transportation from Kharagpur, along with regional contracts including ₹4.89 crore from MRPL for Mangalore to Gujarat transportation and ₹1.19 crore from CCI-NTPC. Ritco is expanding its fleet with 50 custom-built vehicles designed for infrastructure-based clients. The company's tech platform TrucksUp made key leadership appointments including a Chief Marketing Officer, Tech Head, and HR Head, while launching new features like URGENT LOAD and My Truck is Here. TrucksUp achieved significant milestones with FASTag transactions surpassing the multimillion mark and partnerships with leading Oil Marketing Companies.",
            "Sentiment": "positive",
            "PublishDate": 1762939300230,
            "Source": "stock"
        },
        {
            "Title": "Ritco Logistics Reports Strong Q1 FY26 Growth with 39.83% Revenue Increase and Major Contract Wins",
            "Summary": "Ritco Logistics delivered strong quarterly results with total income rising 39.83% to Rs. 352.70 crores and EBITDA growing 38.01% to Rs. 28.28 crores. PAT increased 34.51% to Rs. 12.46 crores with a margin of 3.53%. The company secured significant contracts including a Rs. 36 crore deal with NTPC Karnpura for fly ash movement services. Ritco strengthened partnerships with major steel companies including Tata Steel, JSW Steel, RINL, Jindal Steel & Power, and Maruti Steel. The company also won transportation contracts with AMNS Steel, Hindustan Zinc, and Mother Dairy. In multimodal logistics, Ritco secured a contract with Reliance and expanded rail-based operations with Indian Railways across multiple states. The 3PL division added partnerships with ISRPL and MRPL across locations in Gujarat. Management expects margin improvements in coming quarters with increased utilization levels.",
            "Sentiment": "positive",
            "PublishDate": 1755187213220,
            "Source": "earnings"
        },
        {
            "Title": "Ritco Logistics Reports 40.5% Revenue Growth in Q1 FY2025",
            "Summary": "Ritco Logistics Limited reported consolidated revenue from operations of ₹35,432.93 lakh for the quarter ended June 30, 2025, representing a 40.5% increase from ₹25,222.75 lakh in the same quarter of the previous year. The company's consolidated net profit declined to ₹895.43 lakh compared to ₹864.35 lakh in the corresponding quarter last year. On a standalone basis, the company achieved revenue of ₹35,269.64 lakh and net profit of ₹1,245.83 lakh, up from ₹926.17 lakh in the previous year's quarter. Basic earnings per share on a consolidated basis was ₹3.13 compared to ₹3.53 in the prior year quarter, while standalone basic EPS improved to ₹4.36 from ₹3.78. The Board also reviewed the utilization of funds raised through the public issue. The company issued 3,00,000 equity shares by converting share warrants on May 19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755009438445,
            "Source": "earnings"
        },
        {
            "Title": "Ritco Logistics Shareholders Approve Amendment to Company's Object Clause",
            "Summary": "Ritco Logistics Limited completed a postal ballot process through remote e-voting that concluded on July 27, 2025. Shareholders approved the alteration of the Object Clause in the company's Memorandum of Association with 99.9970% votes in favor. Out of 2,83,22,757 total shares, 1,84,90,266 votes were polled, with 1,84,89,706 supporting the resolution and only 560 votes against. The amendment adds four new sub-clauses to expand the company's business scope to include comprehensive logistics and supply chain management solutions, transportation, warehousing, inventory management, cold chain logistics, and related trading activities. The new clauses also allow the company to develop integrated logistics platforms and technologies, undertake infrastructure-related activities, and engage in material supply and sub-contracting operations. The e-voting process ran from June 28 to July 27, 2025, with 12,783 total shareholders eligible to participate as of the cut-off date of June 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753791956413,
            "Source": "corporate_action"
        },
        {
            "Title": "Ritco Logistics Secures Two Major Transportation Contracts",
            "Summary": "Ritco Logistics has won two significant contracts: one worth 60 crores for chrome ore transportation, and another worth 30 crore rupees for fly ash transportation.",
            "Sentiment": "positive",
            "PublishDate": 1751436945000,
            "Source": "default"
        },
        {
            "Title": "RITCO LOGISTICS Reports Q4 Financial Results",
            "Summary": "RITCO LOGISTICS has announced its Q4 financial results. The company's EBITDA increased to 277 million rupees from 203 million rupees year-over-year. The EBITDA margin slightly decreased to 8.03% from 8.06% year-over-year. Net profit rose to 135 million rupees from 91.4 million rupees year-over-year and 130 million rupees quarter-over-quarter. Revenue grew to 3.4 billion rupees from 2.52 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747665604000,
            "Source": "result"
        },
        {
            "Title": "Ritco Logistics Secures New Contracts and Expands Sector Reach",
            "Summary": "Ritco Logistics has announced the acquisition of significant new contracts, enabling the company to expand its operations across multiple industry sectors. This development suggests a strategic growth initiative and potential increase in the company's market presence.",
            "Sentiment": "positive",
            "PublishDate": 1746403527000,
            "Source": "default"
        },
        {
            "Title": "Ritco Logistics Secures Key Contracts and Expands Sector Reach",
            "Summary": "Ritco Logistics has announced that it has secured important contracts and expanded its operations across multiple sectors. This development suggests growth and diversification in the company's business activities.",
            "Sentiment": "positive",
            "PublishDate": 1746191410000,
            "Source": "default"
        },
        {
            "Title": "Ritco Logistics Secures Multiple High-Value Contracts",
            "Summary": "Ritco Logistics has announced that it has secured multiple high-value contracts. This development suggests potential growth and increased business opportunities for the company in the logistics sector.",
            "Sentiment": "positive",
            "PublishDate": 1743552810000,
            "Source": "order&deals"
        },
        {
            "Title": "Ritco Logistics Secures Multiple High-Value Contracts",
            "Summary": "Ritco Logistics has announced that it has secured multiple high-value contracts. This development suggests potential growth and increased business activity for the company in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1743507203000,
            "Source": "order&deals"
        },
        {
            "Title": "RITCO Logistics Reports Q3 EBITDA Growth",
            "Summary": "RITCO Logistics announced its Q3 financial results. The company's EBITDA increased to 227 million rupees from 196 million rupees in the same quarter last year. However, the EBITDA margin decreased to 7.26% from 8.20% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739272195000,
            "Source": "earnings"
        },
        {
            "Title": "RITCO Logistics Reports Q3 Financial Results",
            "Summary": "RITCO Logistics has announced its Q3 consolidated financial results. The company's net profit increased to 102 million rupees, up from 87 million rupees in the same quarter last year. Revenue also saw significant growth, rising to 3.13 billion rupees from 2.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739272191000,
            "Source": "earnings"
        },
        {
            "Title": "Ritco Logistics MD Expresses Enthusiasm for Technological Expansion",
            "Summary": "The Managing Director of Ritco Logistics has stated that the company is looking forward to expanding its capabilities through the implementation of advanced and innovative technology.",
            "Sentiment": "positive",
            "PublishDate": 1731758841000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ritco Logistics Reports Q2 EBITDA Growth",
            "Summary": "Ritco Logistics announced its Q2 financial results. The company's EBITDA increased to 226 million rupees from 192 million rupees year-over-year. However, the EBITDA margin slightly decreased to 8.11% from 8.18% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731508927000,
            "Source": "result"
        },
        {
            "Title": "RITCO Logistics Reports Q2 Financial Results",
            "Summary": "RITCO Logistics announced its Q2 financial results. The company's net profit increased to 115 million rupees, up from 85.3 million rupees year-over-year and 93 million rupees quarter-over-quarter. Revenue for Q2 rose to 2.79 billion rupees, compared to 2.34 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731508867000,
            "Source": "result"
        },
        {
            "Title": "Ritco Logistics: Multibagger Stock Soars 220% in 20 Months",
            "Summary": "Ritco Logistics' stock has surged 220% in 20 months and 2,750% over four years. The company has diversified its revenue streams, reducing dependence on petrochemicals and expanding into steel and other sectors. Brokerage firm Monarch Networth Capital has initiated coverage with a 'buy' rating and a target price of ₹760, citing growth potential from its tech platform TrucksUp and expansion into multimodal logistics.",
            "Sentiment": "positive",
            "PublishDate": 1729242245000,
            "Source": "normal_news"
        }
    ]
}