{
    "Symbol": "RITES",
    "ISIN": "INE320J01015",
    "News": [
        {
            "Title": "RITES Q3 Net Profit Rises to ₹1.15 Billion",
            "Summary": "RITES Limited reports consolidated net profit of ₹1.15 billion for Q3, marking growth from ₹1.10 billion in the corresponding quarter of previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770194208387,
            "Source": "co_actions_results"
        },
        {
            "Title": "RITES Signs Locomotive Deal with SAIL",
            "Summary": "RITES Limited has entered into a strategic agreement with Steel Authority of India Limited (SAIL) for locomotive leasing and maintenance services, expanding its railway infrastructure business portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1770045899514,
            "Source": "co_actions_results"
        },
        {
            "Title": "RITES Ltd Board Change: Director Steps Down",
            "Summary": "RITES Limited announces cessation of Shri Shailendra Singh as Government Nominee Director effective February 01, 2026, following his superannuation from Railway Board. Board now comprises 8 directors.",
            "Sentiment": "neutral",
            "PublishDate": 1769921689995,
            "Source": "stocks"
        },
        {
            "Title": "RITES wins Excellence in Sustainable Engineering award",
            "Summary": "RITES Limited receives Excellence in Sustainable Engineering for Rail Sector award at 7th Rail Analysis Innovation & Excellence Summit 2026 for Udhampur-Srinagar-Baramulla Railway Link contribution.",
            "Sentiment": "positive",
            "PublishDate": 1769840209450,
            "Source": "stocks"
        },
        {
            "Title": "Rites Secures $20.6 Million Mozambique Contract",
            "Summary": "Rites wins major $20.6 million contract from ICVL Mozambique for diesel electric locomotives and maintenance services with 15-month supply timeline.",
            "Sentiment": "positive",
            "PublishDate": 1769490481091,
            "Source": "co_actions_results"
        },
        {
            "Title": "RITES Board Meet on Feb 4 for Q3FY26 Results",
            "Summary": "RITES Limited has scheduled a board meeting on February 4, 2026, to consider Q3FY26 financial results and potential third interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769076956591,
            "Source": "co_actions_results"
        },
        {
            "Title": "RITES shares in focus on $3.6M locomotive order win",
            "Summary": "RITES shares to be in focus after securing USD 3.6 million international order from Zimbabwe for Cape Gauge Diesel Electric Locomotives supply with 3-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767095029526,
            "Source": "co_actions_results"
        },
        {
            "Title": "RITES Wins $35.2M Locomotive Order from South Africa",
            "Summary": "RITES Limited secures significant $35.2 million locomotive supply contract from South Africa, strengthening its international railway equipment business and export portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1766460830435,
            "Source": "co_actions_results"
        },
        {
            "Title": "RITES Signs MoU with Botswana Government for Railway Modernisation",
            "Summary": "RITES Limited signed a Memorandum of Understanding with the Government of Botswana on December 19, 2025, to collaborate on railway and transport infrastructure development and modernisation.",
            "Sentiment": "positive",
            "PublishDate": 1766154893425,
            "Source": "stocks"
        },
        {
            "Title": "RITES Chief Vigilance Officer Shiv Ratan Steps Down",
            "Summary": "RITES Limited announces cessation of Shri Shiv Ratan as Chief Vigilance Officer following completion of his deputation tenure on December 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765378834088,
            "Source": "stocks"
        },
        {
            "Title": "RITES Limited Announces Senior Management Change as Chief Vigilance Officer Completes Tenure",
            "Summary": "Shri Shiv Ratan (ITS-1996) ceased to be among the Senior Management of RITES Limited upon completion of his tenure of deputation as Chief Vigilance Officer on 05.12.2025. The government enterprise informed stock exchanges NSE and BSE about this senior management change as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765282513380,
            "Source": "corporate_governance"
        },
        {
            "Title": "RITES Limited Reports Sequential Growth in Q2FY26 with Strong Order Book and Export Revival",
            "Summary": "RITES Limited achieved 12% sequential growth in revenue and profitability in Q2FY26, driven by consultancy and export segments, while maintaining EBITDA margins above 20% and securing orders worth INR 850 crore. The company reached an all-time high order book of INR 9,090 crore and successfully delivered first locomotives to Mozambique after a revenue gap, positioning for sustained export contributions in coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1763460476747,
            "Source": "stock"
        },
        {
            "Title": "RITES Secures Rs 52 Crore Bridge Construction Contract from Cochin International Airport",
            "Summary": "RITES Limited has received a Letter of Award from Cochin International Airport Limited for the construction of a Regulator cum Bridge (RCB) across Chengalthodu at Chengal, Kanjoor Panchayath near Cochin International Airport. The project is valued at an estimated Rs 52.00 crore exclusive of GST, including PMC fees. The contract is structured on a turnkey basis from concept to commissioning using a cost plus fee model. This is a domestic contract and does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1762997356199,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Limited Reports 32.2% YoY PAT Growth in Q2FY26 with Record Order Book of ₹9,090 Crore",
            "Summary": "RITES Limited delivered strong quarterly results with PAT increasing 32.2% year-on-year and 20.0% quarter-on-quarter. EBITDA and PBT grew 27.6% and 31.5% respectively on a yearly basis. Operating revenue reached ₹549 crore (consolidated) and ₹514 crore (standalone) with double-digit sequential growth driven by consultancy and exports segments. The company maintained its pace of securing one order daily, adding ₹850 crore in new orders during the quarter and achieving a record order book of ₹9,090 crore. RITES supplied 2 locomotives to Mozambique during the quarter and continued securing export orders every quarter. The Board recommended an interim dividend of ₹2 per share with a 94% dividend payout ratio. Revenue growth was supported by better execution in consultancy services and increased leasing income from expanded locomotive fleet. The company secured 15 major projects worth ₹851 crore during the quarter, including contracts in railway maintenance, locomotive supply, and project management across various sectors.",
            "Sentiment": "positive",
            "PublishDate": 1762855389376,
            "Source": "earnings"
        },
        {
            "Title": "RITES Reports Flat Q2 Revenue at 5.4 Billion Rupees",
            "Summary": "RITES reported Q2 revenue of 5.4 billion rupees, showing no year-over-year growth compared to the same period in the previous year when revenue was also 5.4 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1762849422547,
            "Source": "earnings"
        },
        {
            "Title": "RITES Reports Strong Q2 Performance with Higher Profits and Declares Rs 2 Dividend",
            "Summary": "RITES declared a dividend of Rs 2 per share. The company reported Q2 EBITDA of Rs 1 billion compared to Rs 799 million in the previous year, with EBITDA margin improving to 19.46% from 15.66%. Q2 consolidated net profit increased to Rs 1.02 billion from Rs 859 million in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762848839975,
            "Source": "corporate_action"
        },
        {
            "Title": "RITES Partners With DGNP-Mumbai For Consultancy Services",
            "Summary": "RITES has entered into a partnership with DGNP-Mumbai to provide consultancy services. The collaboration establishes a business relationship between the two entities for consulting activities.",
            "Sentiment": "positive",
            "PublishDate": 1762430740477,
            "Source": "stock"
        },
        {
            "Title": "RITES Secures ₹372.68 Crore Project Management Contract from NIMHANS",
            "Summary": "RITES has won a ₹372.68 crore order from NIMHANS for project management consultancy services for a new OPD building construction project.",
            "Sentiment": "positive",
            "PublishDate": 1762186898483,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Limited Signs MoU with Shipping Corporation of India for Maritime Logistics Collaboration",
            "Summary": "RITES Limited, a leading transport infrastructure consultancy and engineering firm, has signed a memorandum of understanding with Shipping Corporation of India Limited (SCI) to explore collaboration in maritime logistics and multimodal transport solutions. The MoU was signed during India Maritime Week 2025. Under this agreement, both parties will collaborate to enhance maritime logistics and shipping operations for timely and efficient movement of RITES cargo across global destinations. The partnership aims to design innovative, cost-effective, and resilient supply chain and logistics models tailored to RITES operational needs. Both organizations will also engage in knowledge exchange and capacity-building initiatives, sharing best practices in supply chain resilience, digital cargo tracking, and logistics planning for high-value consignments. RITES Limited is a Navratna Public Sector Enterprise with over 5 decades of experience and has undertaken projects in over 55 countries across Asia, Africa, South America, and Middle East regions.",
            "Sentiment": "positive",
            "PublishDate": 1761901393113,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Limited Appoints Shri Jayant Kumar as Government Nominee Director",
            "Summary": "RITES Limited announced the appointment of Shri Jayant Kumar as part-time Government Nominee Director on the Board, effective October 17, 2025. The appointment was approved by the President of India through the Ministry of Railways. Kumar serves as EDME (MDP) at Railway Board and will hold the director position until he leaves his Railway Board post or until further orders. He holds a Bachelor's in Mechanical Engineering, belongs to the Indian Railways Service of Mechanical Engineers 1994 batch, and has over 25 years of experience with Indian Railways and Government of India. Kumar is not debarred from holding directorship and is not related to any other company directors.",
            "Sentiment": "neutral",
            "PublishDate": 1760708248521,
            "Source": "corporate_governance"
        },
        {
            "Title": "RITES Wins Rs. 36.22 Crore Contract from Damodar Valley Corporation",
            "Summary": "RITES has secured a Rs. 36.22 crore Annual Maintenance Contract (AMC) and Operations & Maintenance (O&M) order from Damodar Valley Corporation for the Mejia Thermal Power Station. This contract involves maintenance and operational services for the thermal power facility.",
            "Sentiment": "positive",
            "PublishDate": 1759457100164,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Signs Agreement With Etihad Rail For Joint Business Efforts",
            "Summary": "RITES has entered into an agreement with Etihad Rail for joint business efforts. The partnership aims to collaborate on business initiatives between the two railway companies.",
            "Sentiment": "positive",
            "PublishDate": 1759238222409,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Secures $18 Million International Order from South African Logistics Company",
            "Summary": "RITES has received a letter of award from Talis Logistics, South Africa for the supply and commissioning of overhauled Cape Gauge ALCO Diesel Electric Locomotives. The international contract is valued at USD 18.00 million (CIF) and delivery will be completed within 6 to 8 months from receipt of advance payment. The order involves overhauling in-service locomotives for the South African logistics company. RITES confirmed that promoter groups have no interest in the awarding entity and the transaction does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758810214267,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Limited Approves Final Dividend of ₹2.65 Per Share at 51st AGM",
            "Summary": "RITES Limited conducted its 51st Annual General Meeting through video-conferencing, where shareholders approved all resolutions including a final dividend of ₹2.65 per share for FY2024-25. Combined with three interim dividends of ₹4.90 per share paid during the year, the total dividend reaches ₹7.55 per share (₹363 crore), representing a 95.4% dividend payout ratio. The record date for final dividend payout is September 17, 2025. RITES reported consolidated revenue of ₹2,324 crore in FY25 compared to ₹2,539 crore in FY24, with operating revenue at ₹2,218 crore versus ₹2,453 crore in FY24. Profit After Tax declined to ₹424 crore in FY25 from ₹495 crore in FY24. The consultancy business generated ₹1,133 crore in revenue, while turnkey and leasing segments contributed ₹797 crore and ₹150 crore respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1758639739862,
            "Source": "corporate_action"
        },
        {
            "Title": "RITES Secures Rs 78.65 Crore Rate Contract from NTPC for Diesel Locomotive Leasing",
            "Summary": "RITES has secured a rate contract from NTPC Limited for hiring diesel locomotives on lease basis for NTPC power plants across India. The contract has an indicative value of Rs 78.65 crores excluding GST and is valid from September 20, 2025 to September 19, 2027. Under this rate contract, NTPC stations will place separate purchase orders specifying exact requirements, completion periods, and amounts for actual execution. The actual order values will depend on the requirements of various NTPC stations. This is a domestic contract and does not involve any related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758267177632,
            "Source": "order&deals"
        },
        {
            "Title": "RITES and 26 Other Companies Go Ex-Dividend with Record Date Set for September 17",
            "Summary": "RITES and 26 other companies will trade ex-dividend, with September 17 as the record date for final dividend eligibility. RITES declared a final dividend of 26.5%, paying Rs 2.65 per share to eligible shareholders. Other notable dividend announcements include KRBL at 350% (Rs 3.5 per share), Garware Hi-Tech Films and Carysil both at 120% (Rs 12 and Rs 2.4 per share respectively), and Tanfac Industries at 90% (Rs 9 per share). Investors must purchase shares before the ex-dividend date to qualify for dividends, which are credited directly to bank accounts linked with demat accounts. The simultaneous dividend announcements from multiple companies are expected to attract investor interest in the trading session.",
            "Sentiment": "positive",
            "PublishDate": 1757990574103,
            "Source": "corporate_action"
        },
        {
            "Title": "RITES Secures ₹25.3 Crore Contract from NTPC for Mouda Thermal Power Plant Project",
            "Summary": "RITES has won a ₹25.3 crore contract from NTPC for an MGR (Merry-Go-Round) mega project at the Mouda Thermal Power Plant. The contract involves infrastructure development work for NTPC's thermal power facility.",
            "Sentiment": "positive",
            "PublishDate": 1756475406670,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Limited Reports Flat Q1 FY26 Results with INR 8,800 Crore Order Book",
            "Summary": "RITES Limited held an investor conference call to discuss quarterly results ended June 30, 2025. The company reported flat results with an order book of INR 8,800 crore, including INR 3,500 crore from 300+ orders added in the last two quarters. Chairman Rahul Mithal indicated revenue flow will start in the latter part of FY26 as orders move from design phase to execution. The consultancy segment showed 7% growth, contributing to 8% EBITDA growth. Export deliveries commenced with two locomotives shipped to Mozambique in early July, with revenue recognition expected in Q2. The company maintains guidance to surpass previous year's performance with EBITDA margins around 20% and PAT margins around 15%. Cash balance stands at INR 800 crore with client funds of INR 2,400 crore. Management expects the Bangladesh order's first rake delivery before end of FY26, with prototype development for South African locomotive modification orders progressing.",
            "Sentiment": "neutral",
            "PublishDate": 1755162672803,
            "Source": "earnings"
        },
        {
            "Title": "RITES Targets Over One Order Per Day to Drive Growth",
            "Summary": "RITES company executive outlined the organization's goal to secure more than one order per day as part of its growth strategy. The executive indicated this target represents a significant improvement compared to the previous year's performance.",
            "Sentiment": "positive",
            "PublishDate": 1754490765435,
            "Source": "stock"
        },
        {
            "Title": "RITES Reports ₹8,790 Crore Order Book with Growth in Consultancy and Leasing Segments",
            "Summary": "RITES has an order book worth ₹8,790 crore and is experiencing growth in its consultancy and leasing business segments. The company is maintaining export momentum, which is expected to provide long-term revenue visibility and support its overall growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1754481945108,
            "Source": "stock"
        },
        {
            "Title": "RITES Limited Declares ₹1.30 Interim Dividend, Appoints New Secretarial Auditor for Q1 FY2025-26",
            "Summary": "RITES Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue from operations of ₹455.73 crores and net profit after tax of ₹66.65 crores. The company declared its first interim dividend of ₹1.30 per share (13% of paid-up share capital) for FY2025-26, with record date set for August 12, 2025. The Board also appointed M/s Agarwal S. & Associates as Secretarial Auditor for five years from FY2025-26 to FY2029-30, subject to shareholder approval. On a consolidated basis, revenue from operations stood at ₹489.74 crores with net profit after tax of ₹90.89 crores. Basic earnings per share was ₹1.39 on standalone basis and ₹1.67 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1754474167437,
            "Source": "earnings"
        },
        {
            "Title": "RITES Reports Marginal Growth in Q1 Results with Net Profit at 909 Million Rupees",
            "Summary": "RITES posted a consolidated net profit of 909 million rupees in Q1, showing a slight increase from 904 million rupees in the same period last year. The company's revenue reached 4.9 billion rupees, up from 4.86 billion rupees year-over-year. Both profit and revenue figures indicate modest growth compared to the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754473597634,
            "Source": "earnings"
        },
        {
            "Title": "RITES Reports Higher Quarterly EBITDA and Improved Margins",
            "Summary": "RITES posted quarterly EBITDA of 1.14 billion rupees compared to 1.05 billion rupees in the same period last year. The company's EBITDA margin improved to 23.31% from 21.78% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754473121100,
            "Source": "earnings"
        },
        {
            "Title": "RITES Limited Signs MoU with iSky Transport to Explore Urban Mobility Solutions",
            "Summary": "RITES Limited, a transport infrastructure consultancy organization, signed a Memorandum of Understanding with Bengaluru-based iSky Transport Systems Pvt. Ltd. The partnership aims to explore and implement transformative infrastructure projects focusing on urban mobility, container logistics, and material handling solutions across India. The collaboration will combine RITES's infrastructure expertise with iSky Transport's Suspended String Rail Technology (SSRT) and sustainable urban transit solutions. Both companies will work together to deliver efficient, eco-friendly, and cost-effective transportation solutions, with particular focus on smart cities and multimodal connectivity. RITES Limited is a Navratna Public Sector Enterprise with 51 years of experience and has undertaken projects in over 55 countries across Asia, Africa, Latin America, South America, and the Middle East.",
            "Sentiment": "positive",
            "PublishDate": 1754053944949,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Partners with ISKY Transport for Urban Mobility Solutions",
            "Summary": "RITES has entered into a partnership with ISKY Transport to explore urban mobility options. The collaboration aims to examine potential solutions in the urban transportation sector.",
            "Sentiment": "positive",
            "PublishDate": 1754053555931,
            "Source": "stock"
        },
        {
            "Title": "RITES Limited Announces Senior Management Changes with New Regional Head Appointment",
            "Summary": "RITES Limited announced changes in its senior management structure. Shri Rajiv Kumar Sinha, who served as GGM (Civil) and Regional Head-ERPO, Kolkata, retired from the company on July 31, 2025. Shri Alok Bansal, GGM (Civil), has been appointed as the new Regional Head-ERPO, Kolkata, effective August 1, 2025. Bansal brings over 22 years of multidisciplinary professional experience and holds a postgraduate degree in Civil Engineering from Indian Institute of Science, Bangalore. He joined RITES Limited on December 31, 2024, and previously worked as Senior DGM at Bharat Heavy Electricals Limited (BHEL).",
            "Sentiment": "neutral",
            "PublishDate": 1753979054133,
            "Source": "corporate_governance"
        },
        {
            "Title": "RITES Partners with NABCONS for Infrastructure Development; Q4 Net Profit Rises 3.4%",
            "Summary": "RITES Ltd signed a memorandum of understanding with NABCONS, NABARD's consultancy arm, to jointly develop infrastructure and rural development projects in India and internationally. The partnership combines RITES' transport infrastructure expertise with NABCONS' agriculture and rural development capabilities, targeting sectors including rural infrastructure, agri-logistics, climate-resilient development, and smart cities. In its fourth quarter results, RITES reported net profit of ₹141 crore, up 3.4% year-on-year, while revenue declined 4.3% to ₹615 crore. EBITDA increased 5.4% to ₹185.5 crore with operating margins expanding 564 basis points to 30%. The board declared a final dividend of ₹2.65 per share. RITES shares closed 0.91% lower at ₹260.40.",
            "Sentiment": "neutral",
            "PublishDate": 1753884848303,
            "Source": "stock"
        },
        {
            "Title": "RITES Partners with NABCONS for Infrastructure and Rural Development Projects",
            "Summary": "RITES has signed an agreement with NABCONS to collaborate on infrastructure and rural development projects. The partnership aims to combine both companies' expertise in these sectors.",
            "Sentiment": "positive",
            "PublishDate": 1753882304517,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Secures ₹177 Crore Contract from Bharat Electronics for Andhra Pradesh Manufacturing Facility",
            "Summary": "RITES Ltd received a Letter of Intent from Bharat Electronics Limited for a ₹177.225 crore contract to provide Design and Project Management Consultancy services and construct a mass manufacturing facility for the EM SBU at BEL's Palasamudram unit in Andhra Pradesh. The 24-month project will be executed on a cost-plus basis. In quarterly results, RITES reported net profit growth of 3.4% to ₹141 crore, while revenue declined 4.3% to ₹615 crore. EBITDA increased 5.4% to ₹185.5 crore with margins expanding by 564 basis points to 30%. The company declared a final dividend of ₹2.65 per share for financial year 2025, subject to shareholder approval at the 51st Annual General Meeting. RITES shares closed down 3.29% at ₹264.60 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1753471071185,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Secures Letter of Intent Worth 1.77 Billion Rupees",
            "Summary": "RITES has received a Letter of Intent valued at 1.77 billion rupees. The announcement indicates a significant business opportunity for the company, though specific details about the project scope, timeline, or contracting entity were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1753450947344,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Partners with CMPDI Through New MOU for Mining and Renewable Energy Opportunities",
            "Summary": "RITES has entered into a Memorandum of Understanding (MOU) with CMPDI to explore opportunities in mining and renewable energy sectors. The partnership aims to leverage both companies' capabilities in these areas.",
            "Sentiment": "positive",
            "PublishDate": 1753268298414,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Limited Schedules Board Meeting on August 6, 2025 to Review Q1 Results and Consider Interim Dividend",
            "Summary": "RITES Limited has scheduled a Board of Directors meeting for August 6, 2025 to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also consider declaring a first interim dividend on equity shares for Financial Year 2025-26. The trading window for designated persons and their immediate relatives has been closed from July 1, 2025 until 48 hours after the board meeting concludes.",
            "Sentiment": "neutral",
            "PublishDate": 1753099420955,
            "Source": "corporate_action"
        },
        {
            "Title": "RITES Ltd: Secures ₹47 Crore Contract for College Infrastructure in Karnataka",
            "Summary": "RITES Ltd has won a ₹46.82 crore turnkey contract from Karnataka's Department of Collegiate and Technical Education for constructing and renovating Government First Grade Colleges under the PM USHA Scheme. The project, initially considered for Project Management Consultancy, will be executed over 36 months.",
            "Sentiment": "positive",
            "PublishDate": 1752235965000,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Secures 468.2 Million Rupee Construction Order in Karnataka",
            "Summary": "RITES, a company, has received a construction order worth 468.2 million rupees in Karnataka. The news brief does not provide additional details about the nature of the construction project or its timeline.",
            "Sentiment": "positive",
            "PublishDate": 1752235759000,
            "Source": "default"
        },
        {
            "Title": "RITES Ltd: Secures $3.6 Million International Locomotive Order",
            "Summary": "RITES Ltd won a $3.6 million contract from African Rail Company to supply and commission two overhauled ALCO diesel-electric locomotives for use in Zimbabwe, Mozambique, and Botswana. The project includes equipment upgrades and technical support, with a 9-month execution timeline. RITES shares jumped 6% to Rs 296 following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1751436642000,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Secures $3.6 Million Contract for Refurbished Locomotives",
            "Summary": "RITES has won an international contract worth $3.6 million from an African rail company. The contract involves providing refurbished ALCO locomotives. This deal represents a significant international business opportunity for RITES in the railway sector.",
            "Sentiment": "positive",
            "PublishDate": 1751423122000,
            "Source": "default"
        },
        {
            "Title": "RITES Ltd: Secures International and Domestic Railway Contracts",
            "Summary": "RITES Ltd has won two significant contracts: a $3.6 million order from African Rail Company for overhauled locomotives, and a ₹37.81 crore share in a joint venture contract with South Western Railway for station redevelopment. The African contract involves supplying two Cape Gauge ALCO diesel-electric locomotives within nine months, while the domestic project focuses on redeveloping Tumakuru Station within 540 days.",
            "Sentiment": "positive",
            "PublishDate": 1751391704000,
            "Source": "order&deals"
        },
        {
            "Title": "RITES-ARYAN Joint Venture Secures Railway Redevelopment Project",
            "Summary": "RITES-ARYAN Joint Venture has been awarded a significant redevelopment project by South Western Railway. The project involves redevelopment work, though specific details about the scope, location, or value of the project are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751388378000,
            "Source": "default"
        },
        {
            "Title": "RITES Ltd: Secures $2.9 Million Construction Supervision Contract from Guyana",
            "Summary": "RITES Ltd has won a $2.9 million contract from Guyana for construction supervision of the East Bank-East Coast Road Project Phase 2 extension. The 30-month contract includes 18 months of construction supervision and 12 months for the defects liability period. Additionally, RITES has signed an MoU with Hindustan Copper to develop a supply chain for metals and minerals, focusing on critical minerals.",
            "Sentiment": "positive",
            "PublishDate": 1749526741000,
            "Source": "order&deals"
        },
        {
            "Title": "RITES Ltd Secures $2.91 Million International Contract in Guyana",
            "Summary": "RITES Ltd has acquired an international contract worth USD 2.91 million (equivalent to 25 Crores Rupees) for overseeing a road project in Guyana. The contract involves project oversight, indicating RITES' role in supervising or managing aspects of the road construction or improvement in Guyana.",
            "Sentiment": "positive",
            "PublishDate": 1749522749000,
            "Source": "default"
        }
    ]
}