{
    "Symbol": "RKDL",
    "ISIN": "INE722J01012",
    "News": [
        {
            "Title": "Ravi Kumar Distilleries Postal Ballot Results Declared",
            "Summary": "Ravi Kumar Distilleries announced detailed voting results for postal ballot approving Mrs. Shanmugam Vidhyasankari's appointment as Non-Executive Non-Independent Woman Director with 84.05% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1766061671972,
            "Source": "stocks"
        },
        {
            "Title": "Ravi Kumar Distilleries Independent Director Completes Tenure",
            "Summary": "Mrs. Vidhisa Shekar Shetty (DIN: 08967328) completed her first term as Independent Director of Ravi Kumar Distilleries Limited on November 22, 2025, ceasing to be a Director from the close of business hours that day. The Board expressed appreciation for her extensive contribution and stewardship during her tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763814025131,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ravi Kumar Distilleries Seeks Shareholder Approval for Director Appointment via Postal Ballot",
            "Summary": "Ravi Kumar Distilleries Limited has issued a postal ballot notice seeking member approval for the appointment of Mrs. Shanmugam Vidhyasankari as Non-Executive, Non-Independent Woman Director. The e-voting process runs from November 18, 2025 to December 17, 2025, with results to be declared by December 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763065503241,
            "Source": "earnings"
        },
        {
            "Title": "Ravi Kumar Distilleries Re-appoints Managing Director and Whole-time Director for 3-Year Terms",
            "Summary": "Ravi Kumar Distilleries Limited shareholders approved the re-appointment of Mr. R V Ravikumar as Managing Director and Mr. Badrinath S Gandhi as Whole-time Director at their annual general meeting held on September 19, 2025. Both appointments are effective from April 1, 2026, for a period of 3 years. Mr. Ravikumar brings experience in manufacturing, selling and dealing in liquor products, while Mr. Gandhi has skills in industrial management. The company confirmed that neither director is debarred from holding office by SEBI or other authorities. The directors have a family relationship as co-brothers through marriage connections.",
            "Sentiment": "neutral",
            "PublishDate": 1758269974822,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ravi Kumar Distilleries Reappoints Managing Director and Whole-time Director for 3-Year Terms",
            "Summary": "Ravi Kumar Distilleries Limited has reappointed Mr. R V Ravikumar as Managing Director and Mr. Badrinath S Gandhi as Whole-time Director, both for 3-year terms effective April 1, 2026. The board approved these reappointments on August 6, 2025, following recommendations from the Nomination and Remuneration Committee. Both appointments are subject to shareholder approval at the upcoming Annual General Meeting. Mr. Ravikumar brings extensive experience in manufacturing, selling and dealing in liquor products, while Mr. Gandhi has significant skills in industrial management. The directors are related, with Mr. Gandhi being the co-brother of Mr. Ravikumar's brother-in-law. Both directors have been confirmed as not debarred from holding directorial positions by SEBI or other authorities.",
            "Sentiment": "positive",
            "PublishDate": 1754489574374,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ravi Kumar Distilleries Approves Q2 2025 Results, Reappoints Key Executives and Sets AGM Date",
            "Summary": "Ravi Kumar Distilleries Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs. 811.36 lakhs and profit of Rs. 2.78 lakhs. The company reappointed RV Ravikumar as Managing Director and Badrinath S. Gandhi as Whole-time Director for 3-year terms starting April 1, 2026, subject to shareholder approval. M/s. Ramanand & Associates was appointed as statutory auditors for 5 years from FY 2025-26. The 32nd Annual General Meeting is scheduled for September 19, 2025. The auditor's review report highlighted several concerns including disputed amounts recoverable of Rs. 2,900.25 lakhs, unconfirmed balances for sundry debtors and creditors, and pending statutory dues of Rs. 257.87 lakhs without provision for interest.",
            "Sentiment": "neutral",
            "PublishDate": 1754483731670,
            "Source": "earnings"
        },
        {
            "Title": "Ravi Kumar Distilleries Schedules Board Meeting on August 6 to Approve Quarterly Financial Results",
            "Summary": "Ravi Kumar Distilleries Limited has scheduled a Board of Directors meeting for August 6, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure for designated persons from July 1, 2025, until 48 hours after the financial results announcement. The notice was communicated to both NSE and BSE exchanges on July 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753960211423,
            "Source": "corporate_action"
        }
    ]
}