{
    "Symbol": "RKFORGE",
    "ISIN": "INE399G01023",
    "News": [
        {
            "Title": "Ramkrishna Forgings Maintains Double-Digit Growth Target",
            "Summary": "Ramkrishna Forgings reaffirms its double-digit growth forecast for FY26 while targeting steady quarterly margin improvements to reach 19% to 20%, though no specific timeline provided.",
            "Sentiment": "positive",
            "PublishDate": 1769572031106,
            "Source": "stocks"
        },
        {
            "Title": "Ramkrishna Forgings Eyes 10-15% Growth, Cuts Debt",
            "Summary": "Ramkrishna Forgings projects 10-15% annual sales growth from FY27 onwards and targets debt reduction below ₹1,900 crore by FY26, having already reduced ₹350 crore in Q3.",
            "Sentiment": "positive",
            "PublishDate": 1769571838699,
            "Source": "stocks"
        },
        {
            "Title": "Ramkrishna Forgings Plans Major Capacity Expansion",
            "Summary": "Company announces significant growth initiatives including new aluminum forgings, 45,000 MT castings plant, 40,000 MT forging capacity, LCV products, and railway bogie assemblies from Q4FY26.",
            "Sentiment": "positive",
            "PublishDate": 1769512885738,
            "Source": "stocks"
        },
        {
            "Title": "Ramkrishna Forgings Q3FY26 Monitoring Report Filed",
            "Summary": "Ramkrishna Forgings submits monitoring agency report for Q3FY26 showing INR 51.19 crores received from preferential warrant issue, with funds utilized for debt repayment as planned.",
            "Sentiment": "neutral",
            "PublishDate": 1769511209624,
            "Source": "stocks"
        },
        {
            "Title": "Ramkrishna Forgings Q3FY26 Results: Revenue ₹939.60 Cr",
            "Summary": "Ramkrishna Forgings reports Q3FY26 revenue of ₹939.60 crores with net profit of ₹13.12 crores. Company also allotted 34 lakh warrants at ₹588 each in January 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769510812358,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramkrishna Forgings Starts Aluminium Forging Production",
            "Summary": "Ramkrishna Forgings commenced commercial production at its new 3,000 TPA aluminium forging facility in Jharkhand with an investment of ₹57.50 crores to strengthen EV market presence.",
            "Sentiment": "positive",
            "PublishDate": 1768913865827,
            "Source": "stocks"
        },
        {
            "Title": "Ramkrishna Forgings Allots ₹199.92 Cr Warrants",
            "Summary": "Ramkrishna Forgings allocates 34 lakh warrants to promoter Chaitanya Jalan at ₹588 each, totaling ₹199.92 crore. Warrants convertible to equity within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1768384267167,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Buys ₹95 Cr Stake in Ramkrishna Forgings",
            "Summary": "Morgan Stanley acquired 18.75 lakh shares worth ₹95 crores while Societe Generale sold 14.75 lakh shares valued at ₹75 crores in bulk deals at ₹506.7 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1767075231974,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ramkrishna Forgings Credit Rating Reaffirmed at AA-",
            "Summary": "CRISIL removes Ramkrishna Forgings from rating watch, reaffirms AA-/Negative rating for ₹1,650 crore facilities. Company implements corrective measures for inventory controls.",
            "Sentiment": "neutral",
            "PublishDate": 1766211583496,
            "Source": "stocks"
        },
        {
            "Title": "Ramkrishna Forgings Seeks Reclassification of Ramkrishna Rail from Promoter Group to Public Shareholder",
            "Summary": "Ramkrishna Forgings Limited has submitted applications to BSE and NSE seeking approval to reclassify Ramkrishna Rail and Infrastructure Private Limited from promoter group category to public shareholder category. The application was filed on November 17, 2025, following earlier intimations to the exchanges regarding this reclassification process.",
            "Sentiment": "neutral",
            "PublishDate": 1763450795842,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Reports Loss in Q2 FY26 Due to Forex Impact and US Tariff Disruptions",
            "Summary": "Ramkrishna Forgings posted a consolidated loss of Rs. 9.5 crores in Q2 FY26 with revenue declining 10.6% to Rs. 907.53 crores, primarily due to forex losses of Rs. 6.77 crores and tariff impact of Rs. 10.75 crores. The company secured new orders worth Rs. 1,116 crores with 4-year program life and expects significant recovery in H2 with management confident of achieving double-digit growth for the full year.",
            "Sentiment": "negative",
            "PublishDate": 1763444121214,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings to Issue 34 Lakh Warrants Worth ₹200 Crores to Promoter",
            "Summary": "Ramkrishna Forgings Limited will hold an EGM on December 12, 2025, to approve issuance of 34,00,000 convertible warrants at ₹588 each to promoter Chaitanya Jalan, raising ₹199.92 crores. The funds will be used for debt repayment and general corporate purposes, with warrants convertible to equity shares within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1763386363510,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Board Approves Promoter Group Entity's Reclassification Request",
            "Summary": "Ramkrishna Forgings' Board of Directors approved a request from Ramkrishna Rail Infrastructure Private Limited (RRIPL) to reclassify from Promoter Group category to Public Category shareholder. RRIPL holds 65,00,000 equity shares representing 3.59% of the company's total equity share capital. The entity stated it is not associated with the company's business operations, has no management control, and meets all criteria specified under SEBI LODR Regulations for reclassification. The approval is subject to no-objection from stock exchanges and shareholder approval. The company will undertake the application process to stock exchanges in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1762997364105,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Pays Rs. 10,000 Fine for Board Meeting Non-Compliance",
            "Summary": "Ramkrishna Forgings Limited received fines from NSE and BSE for non-compliance with board meeting requirements for the quarter ended June 30, 2025. The company was penalized Rs. 10,000 under Regulation 17(2) of SEBI listing regulations for failing to meet the required number of board meetings. The fine has been paid within the stipulated timeframe. The company's board discussed the matter and noted that the non-compliance was inadvertent and occurred due to reasons beyond the company's control. The board confirmed there was no malafide or willful intention and advised ensuring better compliance going forward. The stock exchanges had also identified multiple other regulatory non-compliances related to board composition, committee constitution, and corporate governance reporting for the same quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762979714278,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ramkrishna Forgings Reports No Deviation in Fund Utilization from Preferential Issue",
            "Summary": "Ramkrishna Forgings Limited submitted a monitoring agency report through India Ratings Research for the quarter ended September 30, 2025, regarding fund utilization from its preferential issue of convertible warrants. The company issued 9,75,000 convertible warrants at INR 2,100 per warrant and received INR 51.19 crores as upfront consideration (25% of total value). The monitoring agency reported no deviation from the stated objects of the issue. The funds are allocated for debt repayment (INR 153.57 crores) and general corporate purposes (INR 51.18 crores). The company transferred INR 51.19 crores to its cash credit account under debt repayment without reducing credit lines. The warrants have an 18-month conversion period, with the remaining 75% payment due upon conversion to equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762971799326,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Reports 18% Revenue Growth in Q2FY26 Despite Export Challenges",
            "Summary": "Ramkrishna Forgings delivered quarterly revenue of Rs 80,079 lakhs, marking 18% year-on-year growth on standalone basis. EBITDA reached Rs 10,789 lakhs with a margin of 13.5%. The company secured new orders worth Rs 1,116 crores during the quarter across automotive (69%), railways (27%), and non-automotive (4%) segments. International business faced headwinds from tariff-related uncertainties, while domestic operations showed healthy traction. The company expects 18-20% volume growth in H2FY26, supported by strong order pipeline. Railway segment made promising start with bulk dispatches commenced for Bogie Assemblies after receiving required approvals. Capacity utilization improved to 60% with total production capacity at 2,68,400 MT per annum. The management highlighted ongoing efforts to strengthen domestic presence and diversify revenue base as key growth drivers.",
            "Sentiment": "positive",
            "PublishDate": 1762958136527,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings Board Approves Rs 199.92 Crore Preferential Warrant Issue to Promoter",
            "Summary": "Ramkrishna Forgings' Board approved the issuance of up to 34,00,000 convertible warrants to promoter Mr. Chaitanya Jalan at Rs 588 per warrant, aggregating to Rs 199.92 crores. The warrants are convertible into equity shares within 18 months and require shareholder approval at an Extraordinary General Meeting scheduled for December 12, 2025. The company also approved quarterly results for the period ended September 30, 2025, and appointed India Ratings and Research Private Limited as the monitoring agency for proceeds utilization. Post-conversion, the promoter's shareholding would increase from 1.68% to 3.48%.",
            "Sentiment": "positive",
            "PublishDate": 1762954841302,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Reports Q2 Net Loss of 95M Rupees, Revenue Drops to 9.07B Rupees",
            "Summary": "Ramkrishna Forgings reported a net loss of 95 million rupees in Q2, compared to a profit of 1.9 billion rupees in the same quarter last year. Revenue declined to 9.07 billion rupees from 10.54 billion rupees year-over-year. EBITDA fell to 1.22 billion rupees from 1.66 billion rupees, while EBITDA margin dropped significantly to 1.35% from 15.73% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762951629537,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings: Promoter Group Entity Seeks Reclassification to Public Category",
            "Summary": "Ramkrishna Rail Infrastructure Private Limited (RRIPL), a promoter group entity holding 65,00,000 equity shares (3.59%) in Ramkrishna Forgings Limited, has requested reclassification from promoter group category to public category shareholder. RRIPL states it is not related to the company's business operations, has no management involvement, and lacks rights to appoint directors or control company decisions. The entity confirms it holds less than 10% voting rights, exercises no control over company affairs, has no special rights or board representation, and is not a key managerial person. The reclassification request will be considered by Ramkrishna Forgings' Board of Directors at a meeting scheduled for November 12, 2025. RRIPL has committed to comply with applicable SEBI regulations for maintaining public category status.",
            "Sentiment": "neutral",
            "PublishDate": 1762909900473,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Schedules Q2 FY2025-26 Earnings Conference Call",
            "Summary": "Ramkrishna Forgings Limited has announced an earnings conference call with analysts and investors to discuss Q2 FY2025-26 unaudited financial results. The call is scheduled for November 12, 2025, at 6:00 PM IST. Key management participants include Managing Director Naresh Jalan, Whole-time Director Chaitanya Jalan, Whole-time Director CFO Lalit Khetan, Whole-time Director Milesh Gandhi, and VP-Finance Company Secretary Rajesh Mundhra. The company will discuss business strategy and outlook following the declaration of quarterly results. Access details include various international dial-in numbers for participants from different regions.",
            "Sentiment": "neutral",
            "PublishDate": 1762590108278,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings Receives Tribunal Approval for Second Motion Petition in Subsidiary Amalgamation",
            "Summary": "Ramkrishna Forgings Limited announced that the National Company Law Tribunal, Kolkata Bench has allowed the Second Motion Petition for the amalgamation scheme involving its subsidiaries. The scheme involves the merger of Mal Metalliks Private Limited and Multitech Auto Private Limited with Ramkrishna Casting Solutions Limited. The tribunal heard the petition on October 7, 2025, and uploaded its order on November 6, 2025. The tribunal has directed notices to be served to various statutory authorities including the Central Government, Registrar of Companies, Income Tax authorities, and other regulators within specified timeframes. All authorities have 30 days to file representations, and the matter is scheduled for hearing on November 24, 2025. The company has made the tribunal order available on its website.",
            "Sentiment": "positive",
            "PublishDate": 1762542432039,
            "Source": "corporate_action"
        },
        {
            "Title": "Riddhi Portfolio Private Limited Acquires 6,500 Shares in Ramkrishna Forgings Limited",
            "Summary": "Riddhi Portfolio Private Limited disclosed the acquisition of 6,500 equity shares of Ramkrishna Forgings Limited through open market purchase. The acquisition was made on August 18, 2021. Prior to this transaction, the acquirer and persons acting in concert held 14,705,394 shares representing 45.98% of the total voting rights in Ramkrishna Forgings Limited. After the acquisition, their holding increased to 14,711,894 shares, representing 46.00% of the total voting rights. The target company has a total equity share capital of 3,19,77,907 equity shares of Rs. 10 each. The disclosure was made under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1761833115527,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Reports No Share Buybacks on September 21, 2020",
            "Summary": "Ramkrishna Forgings Limited reported zero equity shares bought back on September 21, 2020, through its broker Narnolia Financial Advisors Limited on both BSE and NSE exchanges. The company's buyback program was announced via public announcement dated March 23, 2020. As of the reporting date, the cumulative equity shares bought back stood at 674,993 shares, with no shares closed out during the day.",
            "Sentiment": "neutral",
            "PublishDate": 1761713956002,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Receives NCLT Approval for Subsidiary Amalgamation Scheme",
            "Summary": "The National Company Law Tribunal (NCLT) Kolkata Bench approved the First Motion Application for the amalgamation of Mal Metalliks Private Limited and Multitech Auto Private Limited with Ramkrishna Casting Solutions Limited. The order was pronounced on September 3, 2025, and dispensed with meetings of equity shareholders, secured creditors, unsecured creditors, and debenture holders. All three companies are wholly owned subsidiaries of Ramkrishna Forgings Limited. The scheme received consent from 100% of equity shareholders and secured creditors, and over 90% of unsecured creditors across all applicant companies. The appointed date for the amalgamation is January 1, 2024. The NCLT has directed the companies to serve notices to regulatory authorities including the Regional Director, Registrar of Companies, Official Liquidator, and Income Tax Department within two weeks.",
            "Sentiment": "positive",
            "PublishDate": 1757072692833,
            "Source": "corporate_action"
        },
        {
            "Title": "R K Forgings Reports 14% Drop in North American Class 8 Truck Orders",
            "Summary": "R K Forgings reported that North American Class 8 truck orders declined 14% year-over-year in August. The company forecasts a 15% decline for the 2025 cycle, indicating weak demand in the heavy truck segment.",
            "Sentiment": "negative",
            "PublishDate": 1757045145970,
            "Source": "stock"
        },
        {
            "Title": "Ramkrishna Forgings MD Says Extra 25% US Tariff Won't Impact Auto Exports",
            "Summary": "Ramkrishna Forgings Managing Director Naresh Jalan stated that the additional 25% US tariff will not affect the company's automotive component exports, as these products fall under the standard 25% tariff category. The extra 25% tariff applies only to non-auto forgings for oil and gas sectors, which represents a smaller portion of their business. Jalan expressed optimism that the US will reassess the tariff decision, citing America's lack of low-cost forging capacity. The company has successfully negotiated tariff pass-through arrangements with most customers and continues to receive new orders from US clients. However, overall demand has softened across passenger vehicles and truck segments in the US market. The company is not planning to diversify its manufacturing base outside India. Ramkrishna Forgings shares closed up 1.75% at Rs 575 on Thursday.",
            "Sentiment": "neutral",
            "PublishDate": 1756436084666,
            "Source": "stock"
        },
        {
            "Title": "Ramkrishna Forgings Allots 9.75 Lakh Warrants Worth Rs 204.75 Crores to Promoter Entity",
            "Summary": "Ramkrishna Forgings Limited has allotted 9,75,000 warrants to Riddhi Portfolio Private Limited, a promoter entity, at Rs 2,100 per warrant for a total consideration of Rs 204.75 crores. The company received 25% of the issue price upfront, amounting to Rs 51.19 crores. The warrant holders have the right to convert each warrant into one equity share within 18 months by paying the remaining 75% of the issue price (Rs 1,575 per warrant). The allotment was approved by the board of directors, shareholders at an extraordinary general meeting held on June 28, 2025, and received in-principle approval from BSE and NSE. The paid-up equity share capital remains unchanged due to this warrant allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1755169360847,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Q1 FY26 Profit Drops 78% to Rs 12 Crores Amid Steel Price Decline and Tariff Impact",
            "Summary": "Ramkrishna Forgings reported consolidated revenues of Rs 1,015 crores for Q1 FY26, up 6% year-on-year, but profit after tax declined sharply to Rs 12 crores from Rs 55 crores in Q1 FY25. EBITDA margin fell 300 basis points to 14.6% due to a Rs 40 crore impact from decreased realization and export-domestic mix changes. The company faced additional headwinds including Rs 6 crores in U.S. tariff costs (25% on passenger vehicles, 10% on commercial vehicles), forex losses of Rs 6.66 crores from the rail wheels joint venture, and Rs 5 crores in machine import losses. Despite challenges, the company secured new orders worth Rs 660 crores in Q1, with Rs 502 crores from exports and Rs 158 crores from domestic markets. Management expects gradual margin recovery and aims to return to 21-22% EBITDA margins by Q4 FY26 or Q1 FY27 on standalone basis. The company plans to reduce net debt by Rs 300-400 crores during FY26 and received approval for railway undercarriage supply worth Rs 60 crores.",
            "Sentiment": "negative",
            "PublishDate": 1754643540091,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings Targets 15-20% Volume Growth in H2 FY26 on New Capacity Additions",
            "Summary": "Ramkrishna Forgings expects strong performance in the second half of FY26, targeting 15-20% volume growth driven by new capacity additions. Managing Director Naresh Jalan stated that most ongoing projects will be operational by late September to mid-October, leading to high utilization levels. The company projects Rs 15,000 to Rs 20,000 crore growth for FY26 and FY27. Europe is identified as a key growth driver for exports over the next few years, while North American operations are expected to remain steady despite temporary tariff-related challenges. In Q1FY26, the company reported 6% revenue growth to Rs 1,015.26 crore, but EBITDA declined 12% to Rs 147 crore and margins compressed to 14.6% from 17.6%. Net profit dropped 78% to Rs 12 crore from Rs 55 crore in the previous year. Shares closed 0.95% lower at Rs 574.1.",
            "Sentiment": "positive",
            "PublishDate": 1754443409204,
            "Source": "stock"
        },
        {
            "Title": "Ramkrishna Forgings Outlines Growth Strategy with EV Focus and Debt Reduction Plans",
            "Summary": "Ramkrishna Forgings is developing aluminum forging capabilities with a new 3,000 tonne press facility targeting EV applications. The company expects 15-20% volume growth and projects standalone EBITDA margins to return to 21-22% levels by Q4 FY26 or Q1 FY27, while consolidated margins are expected at 20-21% due to lower casting business margins. Net debt is projected to decrease by Rs 300-400 crores by end of FY26, reaching Rs 1,400-1,500 crores. The company has planned capex of Rs 300-350 crores for FY26, plus Rs 115 crores investment in joint venture. For US exports, the company faces 25% tariffs on passenger vehicles and 10% on commercial vehicles, with customers absorbing about 50% of tariff costs. Ramkrishna Forgings received approval from Indian Railways for complete assembled undercarriage for passenger vehicles, with a development order worth Rs 60 crores to be fulfilled by March 2026. The rail wheel joint venture project totals Rs 2,000 crores in two phases, funded with 70% debt and 30% equity, with Rs 1,274 crores already invested.",
            "Sentiment": "positive",
            "PublishDate": 1754278651296,
            "Source": "stock"
        },
        {
            "Title": "Ramkrishna Forgings Reports 78% Drop in Net Profit Despite Revenue Growth",
            "Summary": "Ramkrishna Forgings reported quarterly net profit of 118 million rupees, down from 547 million rupees in the same period last year. Revenue increased to 10.15 billion rupees from 9.59 billion rupees year-over-year. EBITDA declined to 1.49 billion rupees from 1.69 billion rupees, while EBITDA margin compressed to 14.64% from 17.62% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754266090900,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings Approves Q1 FY2026 Results, Re-appoints Key Personnel and Reschedules AGM",
            "Summary": "Ramkrishna Forgings Ltd approved its unaudited standalone and consolidated financial results for Q1 FY2026 ended June 30, 2025. The Board re-appointed Singhi & Co., Chartered Accountants as Internal Auditors for Financial Year 2025-26. Mr. Lalit Kumar Khetan was re-appointed as Whole-time Director for three years from October 20, 2025, subject to shareholder approval at the 43rd AGM. The company rescheduled its AGM from August 30, 2025 to September 20, 2025 due to certain exigencies. India Ratings and Research Private Limited was appointed as Monitoring Agency for the preferential issue of 975,000 warrants. Board committee changes include Mr. Sanjay Kothari joining the Audit Committee and Mr. Ranaveer Sinha becoming Chairman of the Corporate Social Responsibility Committee, while Mr. Kothari stepped down from the CSR Committee. The Register of Members will be closed from September 13-20, 2025 for the AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1754049487618,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Ramkrishna Forgings reported quarterly revenue of 10.15 billion rupees compared to 9.59 billion rupees in the same period last year. However, the company's consolidated net profit dropped significantly to 118 million rupees from 547 million rupees year-over-year. EBITDA declined to 1.49 billion rupees from 1.69 billion rupees, while EBITDA margin compressed to 14.64% from 17.62% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754047639383,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings Schedules Q1 FY2026 Results Conference Call for August 1",
            "Summary": "Ramkrishna Forgings Limited has scheduled an earnings conference call with analysts and investors to discuss Q1 FY 2025-26 unaudited financial results on August 1, 2025, at 5:00 PM IST. The management team participating includes Managing Director Naresh Jalan, Wholetime Director Chaitanya Jalan, Wholetime Director & CFO Lalit Khetan, Wholetime Director Milesh Gandhi, and VP-Finance & Company Secretary Rajesh Mundhra. The call will discuss the company's business strategy and outlook following the declaration of quarterly results. Access details include both domestic and international dial-in numbers, with toll-free options available for USA, UK, Singapore, and Hong Kong participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753792466468,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings to Hold Board Meeting for Q4 Results and Fund Raising",
            "Summary": "Ramkrishna Forgings has announced a board meeting scheduled for May 30. The meeting will consider the company's Q4 results. Additionally, the board will discuss potential fund raising through shares or bonds.",
            "Sentiment": "neutral",
            "PublishDate": 1748358374000,
            "Source": "default"
        },
        {
            "Title": "Ramkrishna Forgings: Shares Drop on Inventory Discrepancy Disclosure",
            "Summary": "Ramkrishna Forgings shares fell 4.8% after disclosing inventory discrepancies that could reduce net worth by 4-5%. Promoters pledged to fund any shortfall. The company has engaged external agencies for a forensic audit. Managing Director Naresh Jalan takes moral responsibility and promises to uphold corporate governance standards.",
            "Sentiment": "negative",
            "PublishDate": 1745887269000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ramkrishna Forgings: Inventory Discrepancies Discovered, Shares Fall",
            "Summary": "Ramkrishna Forgings Ltd. shares dropped up to 10% after discovering inventory discrepancies during annual verification. The company estimates a 4-5% impact on net worth and has appointed an external agency for investigation. Promoters commit to protect stakeholder interests and fund potential adverse impacts.",
            "Sentiment": "negative",
            "PublishDate": 1745812182000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ramkrishna Forgings Expands Production Capacity with New Upsetters",
            "Summary": "Ramkrishna Forgings has initiated commercial production of new upsetters, increasing its annual capacity by 14,250 MT. The company invested Rs 40.85 crore in this expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1743132642000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Launches Cold Forging Facility in Jharkhand",
            "Summary": "Ramkrishna Forgings has initiated operations at its new cold forging facility in Jharkhand. The facility has an annual production capacity of 25,000 tonnes per annum (TPA). This expansion represents a significant increase in the company's manufacturing capabilities and potential output.",
            "Sentiment": "positive",
            "PublishDate": 1738314316000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Reports Q3 Results and Announces New Casting Project",
            "Summary": "Ramkrishna Forgings has reported its Q3 consolidated net profit at 996.1 million rupees, up from 868.6 million rupees year-over-year. The company's Q3 revenue increased to 10.74 billion rupees from 9.95 billion rupees in the previous year. Additionally, Ramkrishna Forgings has announced plans to set up a new casting project in Jamshedpur, which is expected to commence operations from June.",
            "Sentiment": "positive",
            "PublishDate": 1737333571000,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings: Q3 Profit Rises 14.68% YoY, Revenue Up 7.85%",
            "Summary": "Ramkrishna Forgings reported Q3 FY25 results with profit at ₹99.61 crore, up 14.68% YoY. Revenue increased by 7.85% YoY to ₹1073.78 crore. EPS rose 12.68% to ₹5.51. Quarter-on-quarter, revenue grew 1.91% but profit declined 47.51%. Operating income increased 10.19% YoY despite a 2.73% q-o-q decrease.",
            "Sentiment": "positive",
            "PublishDate": 1737178596000,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings Aims to Boost EV Business Revenue Share",
            "Summary": "Ramkrishna Forgings has announced its strategic focus on increasing the revenue share from its electric vehicle (EV) business segment. The company shared this information in an investor presentation, highlighting its commitment to expanding its presence in the growing EV market.",
            "Sentiment": "positive",
            "PublishDate": 1737117087000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings to Establish Casting Project in Jamshedpur",
            "Summary": "Ramkrishna Forgings has announced plans to set up a new casting project in Jamshedpur. The project is expected to begin operations in June, marking a significant expansion of the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1737114810000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Ltd: Q3 Profit Rises 15%, Revenue Up 8%",
            "Summary": "Ramkrishna Forgings reported a 14.6% YoY increase in Q3 net profit to ₹99.6 crore. Revenue grew 7.9% to ₹1,073.8 crore. EBITDA rose 5.4% to ₹231.5 crore. Domestic sales volume increased 7.02%, while export volume grew 12.2%. The company secured new orders worth ₹697 crore from non-auto segments.",
            "Sentiment": "positive",
            "PublishDate": 1737114194000,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings: SMALLCAP World Fund Increases Stake",
            "Summary": "SMALLCAP World Fund, a UK-based venture capital firm, has increased its stake in Ramkrishna Forgings to 7% by acquiring 12,698,933 shares. The stock rallied over 3.12% to ₹945.75 following the news. UBS initiated coverage with a 'buy' rating and a target price of ₹1,500 per share.",
            "Sentiment": "positive",
            "PublishDate": 1736846080000,
            "Source": "block_deals"
        },
        {
            "Title": "Ramkrishna Forgings to Consider Q3 Results on January 17",
            "Summary": "Ramkrishna Forgings Limited has announced that it will consider its financial results for the third quarter of the fiscal year on January 17. This indicates that the company is preparing to disclose its performance for the most recent three-month period to investors and stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1736342258000,
            "Source": "earnings"
        },
        {
            "Title": "Ramkrishna Forgings Ltd: Block Trade of 200,574 Shares on NSE",
            "Summary": "A block trade of approximately 200,574 shares of Ramkrishna Forgings Ltd was executed on the National Stock Exchange (NSE) for Rs. 18.39 Crores. The trade was conducted at a price of Rs. 916.85 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1734497185000,
            "Source": "block_deals"
        },
        {
            "Title": "Ramkrishna Forgings Expands into Aluminum Forging for EV Sector",
            "Summary": "Ramkrishna Forgings is establishing an aluminum forging press line with a 3000T capacity. This new production line is primarily intended to serve the electric vehicle (EV) segment, indicating the company's strategic move to capitalize on the growing EV market.",
            "Sentiment": "positive",
            "PublishDate": 1729758296000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Announces Capacity Expansion Plans",
            "Summary": "Ramkrishna Forgings is expanding its production capacity. The company plans to add 14,250 tons of upsetter forgings capacity by Q3FY25. Additionally, they are setting up a cold forging line and an 8,000-ton hot forging press line, along with smaller press lines. These additions will increase the company's total capacity by 65,000 tons.",
            "Sentiment": "positive",
            "PublishDate": 1729758282000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ramkrishna Forgings Announces Capacity Expansion",
            "Summary": "Ramkrishna Forgings is set to increase its total production capacity to 311,400 tonnes by the end of Q1FY26. This represents a significant expansion from the installed capacity of 229,150 tonnes as of September 30, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1729758268000,
            "Source": "corporate_action"
        }
    ]
}