{
    "Symbol": "RKSWAMY",
    "ISIN": "INE0NQ801033",
    "News": [
        {
            "Title": "RK Swamy shares surge 8% on Porinju stake buy",
            "Summary": "RK Swamy shares jumped 8% after ace investor Porinju Veliyath acquired 6.25 lakh shares worth ₹6.55 crore, taking a 1.23% stake in the advertising and media company.",
            "Sentiment": "positive",
            "PublishDate": 1769155570673,
            "Source": "co_actions_results"
        },
        {
            "Title": "RK Swamy Reports No Deviation in IPO Fund Utilization for Quarter Ended September 30, 2025",
            "Summary": "RK Swamy Limited confirmed no deviations or variations in the utilization of its IPO proceeds from the objects mentioned in its March 6, 2024 prospectus. The company raised Rs. 4,235.60 million through fresh issuance of Rs. 1,730.00 million and offer for sale of Rs. 2,505.60 million. For the quarter ended September 30, 2025, the company utilized funds for IT infrastructure development (Rs. 64.05 million) and setting up new CEC and CATI facilities (Rs. 70.96 million). Working capital requirements of Rs. 540.00 million were fully utilized in March 2024, while general corporate purposes of Rs. 362.62 million were completed in September 2024. No funds were utilized for DVCP Studio capital expenditure during the quarter. The Audit Committee reviewed and the Board approved this statement at meetings held on November 11 and 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762983828355,
            "Source": "corporate_action"
        },
        {
            "Title": "RK Swamy Reports 83% Drop in Quarterly Profit to ₹53.6 Lakhs",
            "Summary": "RK Swamy Limited announced consolidated quarterly results showing net profit declined 83% to ₹53.6 lakhs compared to ₹341.1 lakhs in the previous quarter. Revenue from operations dropped 5% to ₹7,364.8 lakhs from ₹7,756.8 lakhs sequentially. For the half-year period, profit increased to ₹341.1 lakhs versus ₹269.7 lakhs in the same period last year, while revenue grew 13% to ₹15,121.6 lakhs. The company's standalone quarterly profit was ₹64.1 lakhs with revenue of ₹2,990.9 lakhs. Basic earnings per share for the quarter stood at ₹0.11. The integrated marketing services company continues utilizing IPO proceeds, with ₹5,256.2 lakhs remaining unutilized from the ₹17,300 lakhs raised.",
            "Sentiment": "negative",
            "PublishDate": 1762980849346,
            "Source": "earnings"
        },
        {
            "Title": "R K Swamy Focuses on Digital Growth Strategy with AI Investments and Client Expansion",
            "Summary": "R K Swamy is pursuing growth through integrated marketing, data analytics, and digital advertising. The company is expanding its MarTech and research offerings while making strategic investments in AI-led consumer insights. The firm has secured strong client wins across BFSI, automotive, and FMCG sectors. The company expects margin growth driven by a higher share of digital services.",
            "Sentiment": "positive",
            "PublishDate": 1762963756854,
            "Source": "stock"
        },
        {
            "Title": "R K Swamy Reports Growth in Revenue and Profitability in Q2 Results",
            "Summary": "R K Swamy reported consolidated net profit of 5.4 million rupees compared to 5.2 million rupees year-over-year. Revenue increased to 736.5 million rupees from 656.1 million rupees year-over-year. EBITDA rose significantly to 59.4 million rupees from 35.7 million rupees year-over-year. EBITDA margin improved to 8.06% from 5.44% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762948412981,
            "Source": "earnings"
        },
        {
            "Title": "R K Swamy Plans AI-Driven Growth Strategy to Enhance Revenue and Margins by FY26",
            "Summary": "R K Swamy announced plans to enhance its integrated marketing, data analytics, and brand consulting services using artificial intelligence. The company expects to establish new customer experience centers and leverages a strong pipeline to drive revenue and margin growth by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755015989431,
            "Source": "stock"
        },
        {
            "Title": "R K Swamy Reports Strong Q1 Performance with Revenue Growth to 776M Rupees",
            "Summary": "R K Swamy delivered solid quarterly results with revenue increasing to 776 million rupees from 684 million rupees year-over-year. The company's EBITDA grew to 88 million rupees compared to 70 million rupees in the same period last year, while EBITDA margin improved to 11.33% from 10.28%. Consolidated net profit rose to 29 million rupees from 22 million rupees year-over-year, reflecting overall business growth across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1755009737105,
            "Source": "earnings"
        },
        {
            "Title": "R K SWAMY Limited Sets Record Date for Rs. 1.50 Final Dividend Payment",
            "Summary": "R K SWAMY Limited has fixed August 19, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs. 1.50 per share for the 2024-25 financial year. The dividend represents 30% of the face value of Rs. 5 per share and was recommended by the Board of Directors at their meeting held on May 21, 2025. The final dividend is subject to shareholder approval at the Annual General Meeting scheduled for September 3, 2025. If approved, the dividend payment will be made within 30 days from the approval date, subject to tax deduction at source. Shareholders holding shares in both physical and dematerialized form as of the record date will be eligible for the dividend.",
            "Sentiment": "positive",
            "PublishDate": 1754557617823,
            "Source": "corporate_action"
        },
        {
            "Title": "RK SWAMY Reports Q4 Results and Declares Dividend",
            "Summary": "RK SWAMY has announced its quarterly results and a dividend declaration. The company's Q4 consolidated net profit was 123 million rupees, compared to 262 million rupees year-over-year and 36 million rupees quarter-over-quarter. Q4 revenue stood at 835 million rupees, down from 1.18 billion rupees in the same quarter last year. The company's Q4 EBITDA was 197 million rupees, with an EBITDA margin of 23.61%, compared to 403 million rupees and 34.04% margin in the previous year. Additionally, RK SWAMY has recommended a dividend of 1.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747834730000,
            "Source": "result"
        },
        {
            "Title": "R K Swamy Launches Brand & Marketing Consulting Group",
            "Summary": "R K Swamy has announced the launch of a new Brand & Marketing Consulting Group. This strategic move aims to expand the company's service offerings in the marketing and branding sector.",
            "Sentiment": "positive",
            "PublishDate": 1747233878000,
            "Source": "default"
        },
        {
            "Title": "R K SWAMY Reports Q3 Financial Results",
            "Summary": "R K SWAMY has announced its third quarter financial results. The company reported a consolidated net profit of 36 million rupees, down from 56 million rupees in the same quarter last year. However, revenue increased to 768 million rupees from 721 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739347885000,
            "Source": "earnings"
        },
        {
            "Title": "R K Swamy Promoters Increase Stake by Acquiring Shares from Evanston Pioneer Fund",
            "Summary": "The promoters of R K Swamy have purchased a 3.56% stake in the company from Evanston Pioneer Fund. This transaction represents a significant increase in the promoters' ownership of the company.",
            "Sentiment": "positive",
            "PublishDate": 1735562737000,
            "Source": "corporate_action"
        },
        {
            "Title": "R K SWAMY Reports Significant Decline in Q2 EBITDA",
            "Summary": "R K SWAMY has reported a substantial decrease in its Q2 EBITDA, dropping from 146 million rupees in the previous year to 35 million rupees in the current quarter. The company's EBITDA margin also saw a significant reduction, falling from 18.32% to 5.43% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731484238000,
            "Source": "result"
        },
        {
            "Title": "R K SWAMY Reports Significant Decline in Q2 Profit and Revenue",
            "Summary": "R K SWAMY has reported a substantial decrease in both net profit and revenue for the second quarter compared to the same period last year. The company's net profit fell to 5.2 million rupees from 74 million rupees, while revenue dropped to 656 million rupees from 797 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731484055000,
            "Source": "result"
        },
        {
            "Title": "R K SWAMY Expands Operations with New Capacity",
            "Summary": "<p>R K SWAMY has announced the <span class='positive'>commencement</span> of the fit-out process for <span class='positive'>setting up additional capacity</span> to accommodate <b>600 new associates</b>. This <span class='positive'>expansion</span> indicates <span class='positive'>growth</span> and <span class='positive'>increased operational capabilities</span> for the company.</p>",
            "Sentiment": "positive",
            "PublishDate": 1729000088000,
            "Source": "corporate_action"
        }
    ]
}