{
    "Symbol": "RMDRIP",
    "ISIN": "INE219Y01026",
    "News": [
        {
            "Title": "Kunal Mehta reduces stake in R M Drip and Sprinklers",
            "Summary": "Kunal Haresh Mehta and PAC Smita Mehta sold shares in R M Drip and Sprinklers Systems through open market transactions, reducing their combined holding from 20.75% to 18.20% during December 2025-February 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770181529760,
            "Source": "co_actions_results"
        },
        {
            "Title": "RM Drip Systems Independent Director Resigns",
            "Summary": "RM Drip and Sprinklers Systems Limited announces resignation of Independent Director Mrs. Kavita Ashish Pandare due to personal considerations, effective January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769759473227,
            "Source": "stocks"
        },
        {
            "Title": "RM Drip & Sprinklers Q3 profit jumps 38% YoY",
            "Summary": "RM Drip & Sprinklers Systems reported strong Q3 performance with net profit rising to ₹141 million from ₹102 million YoY, while revenue surged 55% to ₹746 million.",
            "Sentiment": "positive",
            "PublishDate": 1769701060471,
            "Source": "co_actions_results"
        },
        {
            "Title": "RM Drip Acquires Land for New Manufacturing Unit",
            "Summary": "RM Drip and Sprinklers Systems completes land acquisition through subsidiary Brahmanand Pipes for new manufacturing facility at Sinnar, Maharashtra with 12,000 MT annual capacity.",
            "Sentiment": "positive",
            "PublishDate": 1769698893707,
            "Source": "stocks"
        },
        {
            "Title": "R.M Drip Board Meet Set for Jan 29 for Q3 Results",
            "Summary": "R.M Drip And Sprinklers Systems Limited has scheduled its board meeting for January 29, 2026, to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769249158109,
            "Source": "co_actions_results"
        },
        {
            "Title": "R M Drip Systems Boosts Production Capacity by 50%",
            "Summary": "R M Drip And Sprinklers Systems announces significant manufacturing expansion to increase production capacity by approximately 50%, aimed at enhancing operations and strengthening market position.",
            "Sentiment": "positive",
            "PublishDate": 1768238230756,
            "Source": "stocks"
        },
        {
            "Title": "RM Drip announces 50% capacity expansion with new unit",
            "Summary": "RM Drip and Sprinklers Systems Limited announces establishment of new manufacturing facility at Sinnar, Maharashtra, adding 12,000 metric tonnes annual capacity through subsidiary Brahmanand Pipes Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1768233119644,
            "Source": "stocks"
        },
        {
            "Title": "R M Drip Sets Up New Manufacturing Unit in Maharashtra",
            "Summary": "R M Drip And Sprinklers Systems Limited announces setup of new manufacturing unit under Brahmanand Pipes Private Limited in Sinnar District, Nashik, Maharashtra with 12,000 MT annual capacity.",
            "Sentiment": "positive",
            "PublishDate": 1768232833147,
            "Source": "stocks"
        },
        {
            "Title": "R M Drip Board Approves Brahmanand Pipes Acquisition",
            "Summary": "R M Drip And Sprinklers Systems Limited's board has approved the acquisition of Brahmanand Pipes Private Limited, marking a strategic expansion move for the irrigation systems company.",
            "Sentiment": "positive",
            "PublishDate": 1768232158208,
            "Source": "co_actions_results"
        },
        {
            "Title": "RM Drip Announces ₹10 Lakh Acquisition of Brahmanand Pipes",
            "Summary": "RM Drip And Sprinklers Systems Limited announces proposed acquisition of Brahmanand Pipes Private Limited for ₹10.00 lakh to expand manufacturing capabilities and meet growing demand.",
            "Sentiment": "positive",
            "PublishDate": 1768232054184,
            "Source": "co_actions_results"
        }
    ]
}