{
    "Symbol": "RML",
    "ISIN": "INE050H01012",
    "News": [
        {
            "Title": "Rane (Madras) Q3FY26 earnings call on Feb 17",
            "Summary": "Rane (Madras) Limited announces earnings conference call scheduled for February 17, 2026 at 15:00 hrs IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770783032563,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rane Madras Q3FY26 Results: Revenue Up 21.3% YoY",
            "Summary": "Rane (Madras) Limited reported strong Q3FY26 performance with consolidated revenue growing 21.3% to ₹1,019.1 crores. EBITDA surged 36.8% with margin expansion of 106 bps to 9.3%.",
            "Sentiment": "positive",
            "PublishDate": 1770201049800,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rane (Madras) Gets Income Tax Show Cause Notice",
            "Summary": "Rane (Madras) Limited received a show cause notice from Principal Commissioner of Income Tax Chennai for disallowance of ₹7.61 crores relating to trademark fee expenditure and actuarial gain/loss on gratuity for FY 2019-20.",
            "Sentiment": "negative",
            "PublishDate": 1768046377551,
            "Source": "stocks"
        },
        {
            "Title": "Rane Madras gets ₹0.39 cr GST demand for FY22 ITC issue",
            "Summary": "Rane (Madras) Limited receives fresh GST tax demand of ₹0.39 crores with ₹0.04 crores penalty for FY2021-22 related to non-reversal of Input Tax Credit. Company to contest the order.",
            "Sentiment": "negative",
            "PublishDate": 1767100650945,
            "Source": "stocks"
        },
        {
            "Title": "Rane (Madras) Limited Receives Compounding Order from Legal Metrology Authority",
            "Summary": "Rane (Madras) Limited received a compounding order from the Office of the Assistant Controller Legal Metrology, Udhampur for violation of Rule 6 of Legal Metrology (Packaged Commodities) Rules, 2011. The company has paid a compounding fee of Rs. 50,000 as determined by the authority and disclosed the matter to stock exchanges under SEBI regulations.",
            "Sentiment": "negative",
            "PublishDate": 1764338247213,
            "Source": "stock"
        },
        {
            "Title": "Rane (Madras) Limited Reports 8.4% Revenue Growth to Rs 923.4 Cr in Q2FY26",
            "Summary": "Rane (Madras) Limited achieved consolidated revenue of Rs 923.4 crores with 8.4% YoY growth and EBITDA of Rs 82.9 crores at 9.0% margin for Q2FY26. The auto components manufacturer won orders worth Rs 200 crores across businesses and received multiple supplier awards from major customers including Volvo and TAFE.",
            "Sentiment": "positive",
            "PublishDate": 1763140831207,
            "Source": "stock"
        },
        {
            "Title": "Rane (Madras) Limited Reports 33.2% Jump in Net Profit for Q2FY26",
            "Summary": "Rane (Madras) Limited announced consolidated financial results for the quarter ended September 30, 2025. Total revenue grew 8.4% to Rs 923.4 crores compared to Rs 851.8 crores in the same quarter last year. EBITDA increased 10.6% to Rs 82.9 crores with margin improving to 9.0% from 8.8%. Profit after tax surged 33.2% to Rs 21.5 crores versus Rs 16.1 crores in Q2FY25. Sales to domestic OE customers grew 6% driven by higher offtake in passenger vehicle and farm tractor segments. International customer sales increased 10% supported by strong steering products demand. Indian aftermarket sales experienced 17% growth. The company faced lower offtake on specific export customer programs for light metal casting products. For the half year, total revenue was Rs 1,807.8 crores and PAT stood at Rs 40.0 crores, up 30.1% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1762302473607,
            "Source": "earnings"
        },
        {
            "Title": "Rane (Madras) Reports 74% Revenue Jump to 9.2B Rupees in Q2",
            "Summary": "Rane (Madras) reported quarterly revenue of 9.2 billion rupees compared to 5.3 billion rupees in the same period last year. The company stated it experienced no sales impact from new USA tariffs during the quarter. However, the company noted reduced demand for specific export programs of light metal casting products.",
            "Sentiment": "positive",
            "PublishDate": 1762251034813,
            "Source": "earnings"
        },
        {
            "Title": "Rane (Madras) Reports Higher Q2 Profit and EBITDA Growth",
            "Summary": "Rane (Madras) reported consolidated net profit of 215 million rupees in Q2, up from 161 million rupees in the same quarter last year. The company's EBITDA increased to 787 million rupees from 723 million rupees year-over-year. EBITDA margin improved slightly to 8.57% compared to 8.52% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762250449182,
            "Source": "earnings"
        },
        {
            "Title": "Rane (Madras) Reports 7.4% Revenue Growth and 26.7% PAT Increase in Q1 FY26",
            "Summary": "Rane (Madras) Limited reported consolidated revenue of Rs 884.4 crores for Q1 FY26, marking a 7.4% year-on-year growth from Rs 807.8 crores in Q1 FY25. The company's profit after tax increased 26.7% to Rs 18.5 crores, while EBITDA grew 10.9% to Rs 78.5 crores with a margin of 8.9%. Net sales rose 8% to Rs 869.4 crores, driven by 7% growth in domestic OE sales and 15% increase in international sales. The steering and linkages business secured new orders worth Rs 280 crores, including Rs 170 crores from international customers. The company outperformed industry growth in passenger vehicles (9% vs 3%) and farm tractors (9% vs 13%), while commercial vehicle sales remained flat and two-wheeler sales declined 1%. Rane operates 17 manufacturing plants across India and Mexico, serving customers in over 30 countries with a total revenue of Rs 3,421 crores in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1754996374231,
            "Source": "earnings"
        },
        {
            "Title": "Rane (Madras) Limited Completes Distribution of Fractional Share Proceeds Following Amalgamation",
            "Summary": "Rane (Madras) Limited submitted reports from its Audit Committee and Independent Directors certifying the distribution of proceeds to eligible shareholders from fractional shares arising from the amalgamation of Rane Engine Valve Limited and Rane Brake Lining Limited. The amalgamation scheme became effective on April 07, 2025, with share allotment completed on April 23, 2025. Under the share exchange ratios, REVL shareholders received 9 RML shares for every 20 REVL shares held, while RBL shareholders received 21 RML shares for every 20 RBL shares held. Fractional entitlements totaling 9,324 shares were consolidated and sold by RML Fractional Shares Trust on July 15, 2025, at an average price of INR 869.38 per share, generating gross proceeds of INR 81,06,069.65. After deducting expenses and applicable taxes, INR 80,55,490.86 was distributed to 21,343 eligible shareholders on July 31, 2025, in proportion to their fractional entitlements.",
            "Sentiment": "neutral",
            "PublishDate": 1754485567527,
            "Source": "corporate_action"
        },
        {
            "Title": "Rane (Madras) Reports 18.72 Crore Quarterly Profit, Reconstitutes Risk Management Committee",
            "Summary": "Rane (Madras) Limited reported a standalone net profit of Rs. 18.72 crores for the quarter ended June 30, 2025, compared to Rs. 18.77 crores in the same quarter last year. Revenue from operations stood at Rs. 880.88 crores versus Rs. 817.65 crores in the previous year quarter. On a consolidated basis, the company posted a net profit of Rs. 18.53 crores against Rs. 14.63 crores in the corresponding quarter. The company incurred exceptional expenses of Rs. 1.01 crores related to voluntary retirement expenditure. Basic earnings per share remained steady at Rs. 6.77 for standalone results. The Board reconstituted the Risk Management Committee with Harish Lakshman as Chairman, L Ganesh as Member, and N Ramesh Rajan as Member. The company's paid-up equity share capital increased to Rs. 27.64 crores from Rs. 16.27 crores following the amalgamation scheme implementation.",
            "Sentiment": "positive",
            "PublishDate": 1754384664926,
            "Source": "earnings"
        },
        {
            "Title": "Rane (Madras) Finalizes Sale of Fractional Shares Post-Merger",
            "Summary": "Rane (Madras) has completed the sale of fractional shares resulting from a merger. The company has not provided specific details about the merger or the number of shares sold.",
            "Sentiment": "neutral",
            "PublishDate": 1752682564000,
            "Source": "default"
        },
        {
            "Title": "Rane (Madras) Schedules Board Meeting for Q1 Results Review",
            "Summary": "Rane (Madras) has scheduled a board meeting for August 5 to review the company's first quarter results.",
            "Sentiment": "neutral",
            "PublishDate": 1751290848000,
            "Source": "default"
        },
        {
            "Title": "Rane Madras Sells Land in Velachery for Rs. 361.18 Crores",
            "Summary": "Rane Madras has signed a deal to sell 3.48 acres of land located in Velachery, Tamil Nadu. The company will receive Rs. 361.18 Crores from this land sale transaction.",
            "Sentiment": "positive",
            "PublishDate": 1751011308000,
            "Source": "default"
        },
        {
            "Title": "Rane (Madras) Authorizes Land Transfer to Joint Venture",
            "Summary": "Rane (Madras) has authorized the transfer of 3.48 acres of land located in Velachery to Canopy Living LLP, which is a joint venture. The specific details of the joint venture or the purpose of the land transfer are not provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750149851000,
            "Source": "default"
        },
        {
            "Title": "RANE (MADRAS) Reports Decline in Q4 Net Profit",
            "Summary": "RANE (MADRAS) has reported a consolidated net profit of 65 million rupees for the fourth quarter, compared to 108 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1748334210000,
            "Source": "result"
        },
        {
            "Title": "NCLT Sanctions Merger Scheme for Rane Group Companies",
            "Summary": "The National Company Law Tribunal (NCLT) has approved the merger scheme involving Rane Engine Valve, Rane Brake Lining, and Rane (Madras). This corporate action represents a significant restructuring within the Rane Group, potentially aimed at streamlining operations and enhancing efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1742906050000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rane (Madras) Reports Q3 Revenue of 5.24 Billion Rupees",
            "Summary": "Rane (Madras) has announced its third-quarter revenue, which stands at 5.24 billion rupees. This represents a slight increase from the previous year's figure of 5.2 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1738221280000,
            "Source": "earnings"
        },
        {
            "Title": "RANE (MADRAS) Reports Decline in Q3 EBITDA and Margin",
            "Summary": "RANE (MADRAS) has reported a decrease in its Q3 EBITDA, which fell to 380 million rupees from 479 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 7.5% from 9.20% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738221244000,
            "Source": "earnings"
        },
        {
            "Title": "Rane (Madras) Reports Q3 Net Loss of 2 Million Rupees",
            "Summary": "Rane (Madras) has reported a consolidated net loss of 2 million rupees for the third quarter, compared to a profit of 91 million rupees in the same period last year. This represents a significant decline in the company's financial performance year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738221171000,
            "Source": "earnings"
        },
        {
            "Title": "RANE (MADRAS) Reports Q2 Revenue Decline",
            "Summary": "RANE (MADRAS) has reported its second quarter revenue for the current fiscal year. The company's revenue stood at 5.3 billion rupees, showing a decrease from 6.1 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1729755629000,
            "Source": "result"
        },
        {
            "Title": "Rane (Madras) Reports Q2 Loss",
            "Summary": "Rane (Madras) has reported a consolidated net loss of 7 million rupees for the second quarter, compared to a profit of 178 million rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1729755595000,
            "Source": "result"
        }
    ]
}