{
    "Symbol": "RNBDENIMS",
    "ISIN": "INE012Q01021",
    "News": [
        {
            "Title": "R&B Denims Reports 54% Jump in Quarterly Net Profit to 71 Million Rupees",
            "Summary": "R&B Denims posted consolidated net profit of 71 million rupees compared to 46 million rupees in the same quarter last year, marking a 54% year-on-year increase. The company's revenue grew to 1.1 billion rupees from 933 million rupees, reflecting an 18% year-on-year growth in quarterly performance.",
            "Sentiment": "positive",
            "PublishDate": 1763205925991,
            "Source": "earnings"
        },
        {
            "Title": "R&B Denims Announces Passing of Promoter Group Member Mrs. Mohinikumari Borana",
            "Summary": "R&B Denims Limited announced the passing of Mrs. Mohinikumari Borana, a member of the company's Promoter Group and mother of two company directors, Mr. Rajkumar Mangilal Borana and Mr. Ankur Mangilal Borana. She held 52,500 equity shares in the company. Following her demise, Mrs. Borana will cease to be part of the Promoter Group. The transmission of her shareholding to legal heirs will be processed, and her shares will remain reflected in her name until the transmission process is completed.",
            "Sentiment": "negative",
            "PublishDate": 1761223972649,
            "Source": "corporate_governance"
        },
        {
            "Title": "R&B Denims Regularizes Mrs. Nitika Abhishek Soni as Independent Director for Five-Year Term",
            "Summary": "R&B Denims Limited shareholders approved the regularization of Mrs. Nitika Abhishek Soni as Non-Executive Independent Director at the 15th Annual General Meeting held on August 11, 2025. Her appointment is effective from May 15, 2025 to May 14, 2030, spanning five consecutive years. Mrs. Soni is an associate member of the Institute of Chartered Accountants of India and has been a practicing Chartered Accountant since 2019 with approximately 5 years of experience in the finance industry. She is not related to any existing Directors or Key Managerial Personnel of the company and is not debarred from holding directorship positions.",
            "Sentiment": "neutral",
            "PublishDate": 1755012253990,
            "Source": "corporate_governance"
        },
        {
            "Title": "R&B Denims Reports 34% Jump in Quarterly Profit to ₹610 Crores",
            "Summary": "R&B Denims Limited announced its quarterly results for the quarter ended June 30, 2025. The company reported a standalone profit of ₹610.49 lakhs compared to ₹454.55 lakhs in the same quarter last year, marking a 34% increase. Revenue from operations grew to ₹7,137.01 lakhs from ₹4,652.69 lakhs year-over-year. On a consolidated basis, profit attributable to shareholders increased to ₹668.35 lakhs from ₹468.73 lakhs in the previous year. Consolidated revenue from operations rose to ₹10,261.32 lakhs compared to ₹7,839.11 lakhs. The company ceased reporting Solar and Wind Energy activities as separate segments, as these operations are now integrated to support the core textile business. Basic earnings per share on standalone basis improved to ₹0.68 from ₹0.51 in the corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754922927537,
            "Source": "earnings"
        },
        {
            "Title": "R&B Denims Reports 61% Jump in Q1 Net Profit Despite Margin Compression",
            "Summary": "R&B Denims delivered strong quarterly results with consolidated net profit rising to 82 million rupees from 51 million rupees year-over-year, representing a 61% increase. Revenue grew significantly to 1.02 billion rupees compared to 784 million rupees in the same period last year. EBITDA increased to 113 million rupees from 105 million rupees year-over-year. However, EBITDA margin contracted to 10.99% from 13.39% in the previous year period, indicating pressure on profitability despite higher absolute earnings.",
            "Sentiment": "positive",
            "PublishDate": 1754920812780,
            "Source": "earnings"
        },
        {
            "Title": "R&B Denims Reports Q4 Financial Results",
            "Summary": "R&B Denims has released its Q4 financial results. The company's EBITDA for Q4 was 122 million rupees, compared to 140 million rupees in the same quarter last year. The EBITDA margin improved to 12.2% from 11.31% year-over-year. Consolidated net profit for Q4 was 76 million rupees, slightly up from 74 million rupees in the previous year. However, revenue decreased to 998 million rupees from 1.23 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747362448000,
            "Source": "result"
        },
        {
            "Title": "R & B Denims Launches Commercial Production in Garmenting Segment",
            "Summary": "R & B Denims has announced the commencement of commercial production in its garmenting segment. The company has invested an initial capital of 12.5 million rupees for this new garmenting unit.",
            "Sentiment": "positive",
            "PublishDate": 1744293472000,
            "Source": "corporate_action"
        },
        {
            "Title": "R&B Denims Reports Mixed Q3 Financial Results",
            "Summary": "R&B Denims announced its Q3 financial results, showing a significant increase in net profit to 101 million rupees, up from 58.6 million rupees in the same quarter last year. However, the company's revenue decreased to 952 million rupees from 1.06 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739751587000,
            "Source": "earnings"
        },
        {
            "Title": "R&B Denims Reports Decline in Q3 EBITDA and Margin",
            "Summary": "R&B Denims experienced a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 113 million rupees from 147 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 11.81% from 13.69% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739535857000,
            "Source": "earnings"
        },
        {
            "Title": "R&B Denims Reports Mixed Q3 Financial Results",
            "Summary": "R&B Denims has reported its Q3 financial results. The company's consolidated net profit increased to 101 million rupees from 58.6 million rupees in the same quarter last year, showing significant growth. However, revenue decreased to 952 million rupees from 1.06 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739535853000,
            "Source": "earnings"
        }
    ]
}