{
    "Symbol": "ROCKINGDCE",
    "ISIN": "INE0PTR01012",
    "News": [
        {
            "Title": "Rockingdeals Circular Announces National and Global Expansion with Quick Commerce Focus",
            "Summary": "Rockingdeals Circular has announced plans to expand its operations both nationally and globally, with a strategic focus on quick commerce services.",
            "Sentiment": "positive",
            "PublishDate": 1759829687816,
            "Source": "stock"
        },
        {
            "Title": "Rockingdeals Reports Strong Q3 FY25 Results and Sets Ambitious Revenue Target",
            "Summary": "Rockingdeals has reported robust financial results for Q3 FY25, with revenue matching the figures from the first half of the year. The company maintained a consistent 15% profit after tax (PAT) margin. Looking ahead, Rockingdeals has set an ambitious target of achieving 400-500 crore revenue by FY27. The company currently has a market capitalization of 324 crore.",
            "Sentiment": "positive",
            "PublishDate": 1736759544000,
            "Source": "earnings"
        },
        {
            "Title": "Rockingdeals Circular Projects Significant Revenue Growth and Profitability",
            "Summary": "Rockingdeals Circular has announced expectations of achieving revenue between 400-500 crore rupees by fiscal year 2027, following a strategic investment. The company also projects profit after tax (PAT) margins of 10-15% for the same period.",
            "Sentiment": "positive",
            "PublishDate": 1735536527000,
            "Source": "corporate_action"
        },
        {
            "Title": "RockingDeals Circular Economy Signs Agreement with FabIndia",
            "Summary": "RockingDeals Circular Economy has entered into a sales or return agreement with FabIndia. The agreement allows FabIndia to utilize space within RockingDeals' stores.",
            "Sentiment": "positive",
            "PublishDate": 1730290583000,
            "Source": "corporate_action"
        }
    ]
}