{
    "Symbol": "ROHLTD",
    "ISIN": "INE283H01019",
    "News": [
        {
            "Title": "Royal Orchid Hotels Launches 5th Amritsar Property",
            "Summary": "Royal Orchid Hotels opens Regenta Ranjit Avenue in Amritsar, marking its fifth property in the city with 37 rooms, multiple dining venues, and premium event spaces.",
            "Sentiment": "positive",
            "PublishDate": 1770799131792,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Board Meet on Feb 14, 2026",
            "Summary": "Royal Orchid Hotels Limited has scheduled a Board meeting on February 14, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770469964904,
            "Source": "co_actions_results"
        },
        {
            "Title": "Royal Orchid Hotels to Sell 100% Stake in Multi Hotels",
            "Summary": "Royal Orchid Hotels board approves plan to divest entire stake in subsidiary Multi Hotels Limited. Company implements trading window closure following the strategic decision.",
            "Sentiment": "neutral",
            "PublishDate": 1769659070273,
            "Source": "co_actions_results"
        },
        {
            "Title": "Royal Orchid Hotels Launches New Resort in Jim Corbett",
            "Summary": "Royal Orchid Hotels Ltd. announces signing of new Regenta Place Resort in Jim Corbett, Uttarakhand, featuring 50 rooms, spa, swimming pool, and 3,500 sq. ft. banquet hall to expand leisure portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768538038835,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Expands with New Jim Corbett Resort",
            "Summary": "Royal Orchid Hotels announces new Regenta Place Resort in Jim Corbett, Uttarakhand, featuring 50 rooms, restaurant, banquet hall, and wellness facilities to strengthen hospitality portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768537986127,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Signs 43-Room Udaipur Hotel Deal",
            "Summary": "Royal Orchid & Regenta Hotels announces signing of Regenta Place Udaipur, a 43-room property scheduled to open in March 2026, featuring extensive banquet facilities targeting wedding market.",
            "Sentiment": "positive",
            "PublishDate": 1768210014412,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Signs Deal for New Udaipur Hotel",
            "Summary": "Royal Orchid Hotels Ltd has signed a deal for Regenta Place Udaipur, a 43-room hotel in Rajasthan set to open by March 2026. The property will feature extensive banquet and event facilities.",
            "Sentiment": "positive",
            "PublishDate": 1768194138031,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Signs Jaipur Management Deal",
            "Summary": "Royal Orchid Hotels announces management agreement for new Regenta Suites & Residences in Jaipur with 60 rooms, scheduled to open by April 2026 in prime city center location.",
            "Sentiment": "positive",
            "PublishDate": 1767762235375,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Signs New 200-Key Regenta Jodhpur",
            "Summary": "Royal Orchid Hotels announces signing of new 200-key all-suite Regenta Hotel in Jodhpur, Rajasthan, scheduled to open by December 2029 under asset-light expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1767417593980,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Opens Fourth Vadodara Property",
            "Summary": "Royal Orchid Hotels Ltd launches Regenta Z Vadodara in Gujarat, marking its fourth property in the city. The new hotel targets Gen Z and millennials with contemporary amenities and modern design features.",
            "Sentiment": "positive",
            "PublishDate": 1767156218312,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Signs Regenta Gwalior Property",
            "Summary": "Royal Orchid Hotels announces signing of new upscale Regenta Gwalior hotel near airport with 71 rooms in Phase I and 30 additional rooms in Phase II, marking second property in Gwalior.",
            "Sentiment": "positive",
            "PublishDate": 1766582901802,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Appoints Two Independent Directors",
            "Summary": "Royal Orchid Hotels Limited announces postal ballot results for appointment of Rakesh Mehta and Nithyalakshmi Subramanian as independent directors, with both resolutions passing with over 99% approval from shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1766416366801,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Fined ₹11,800 Each by BSE, NSE",
            "Summary": "Royal Orchid Hotels Limited received regulatory penalties totaling ₹23,600 from BSE and NSE for one-day delay in filing related party transaction disclosures due to technical issues with XBRL submission.",
            "Sentiment": "negative",
            "PublishDate": 1765971913624,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Expands to Himachal Pradesh",
            "Summary": "Royal Orchid Hotels signs deal for new 43-room 'Regenta Place Golden Castle' hotel in Baddi, Himachal Pradesh, expanding presence in Asia's largest pharmaceutical hub.",
            "Sentiment": "positive",
            "PublishDate": 1765948263384,
            "Source": "stocks"
        },
        {
            "Title": "Royal Orchid Hotels Signs Agreement for 36-Key Hotel in Rishikesh",
            "Summary": "Royal Orchid Hotels has signed an agreement with Iris Park Leisures Private Limited to develop a new 36-key hotel property in Rishikesh, Uttarakhand. The expansion represents the company's strategic move to capitalize on the growing tourism market in the region.",
            "Sentiment": "positive",
            "PublishDate": 1765256716268,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Opens 8th Goa Property with Regenta Place M.A.R.S. Candolim",
            "Summary": "Royal Orchid Hotels Ltd. announced the opening of Regenta Place M.A.R.S. Candolim, a 3-star deluxe hotel in North Goa featuring 36 rooms across four categories with amenities including rooftop dining and infinity pool. The new property marks the company's 8th hotel in Goa, strengthening its presence in the coastal tourism market as part of its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1765172281970,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Launches 120-Key Regenta Anantam Resort in Rajasthan's Khatu Shyam Ji",
            "Summary": "Royal Orchid Hotels Ltd. announced the launch of Regenta Anantam Resort, a 120-key upscale property located 2 km from Khatu Shyam Ji Temple in Rajasthan, developed in association with Mr. Rajender Kumar Agarwal and Mr. Dinesh Kumar Agarwal under a management agreement. The resort targets pilgrims and leisure travelers visiting one of India's most prominent pilgrimage destinations, featuring five room categories, vegetarian restaurant, spa, and banquet facilities as part of ROHL's asset-light expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1764564211141,
            "Source": "stock"
        },
        {
            "Title": "Harsha Farms Private Limited Acquires Additional Shares in Royal Orchid Hotels",
            "Summary": "Harsha Farms Private Limited, a promoter group member of Royal Orchid Hotels Limited, purchased 2,397 shares on November 28, 2025, for Rs. 10,04,714.35 through open market transactions on NSE. The acquisition increased their shareholding from 4,61,633 shares (1.68%) to 4,64,030 shares (1.69%) in the hospitality company.",
            "Sentiment": "neutral",
            "PublishDate": 1764428027610,
            "Source": "corporate_action"
        },
        {
            "Title": "Harsha Farms Private Limited Increases Stake in Royal Orchid Hotels",
            "Summary": "Harsha Farms Private Limited, a promoter group member of Royal Orchid Hotels Limited, acquired 19,601 equity shares worth Rs. 9,22,082.10 through open market purchases on November 27, 2025. The acquisition increased their shareholding from 1.61% to 1.68% in the hospitality company.",
            "Sentiment": "neutral",
            "PublishDate": 1764257496656,
            "Source": "corporate_action"
        },
        {
            "Title": "Royal Orchid Hotels Seeks Shareholder Approval for Two Independent Director Appointments via Postal Ballot",
            "Summary": "Royal Orchid Hotels Limited has issued a postal ballot notice dated November 18, 2025, seeking member approval for the appointment of Mr. Rakesh Mehta and Ms. Nithyalakshmi Subramanian as Independent Directors for 2-year terms. The e-voting process will commence on November 22, 2025, and conclude on December 21, 2025, with results to be declared by December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763734004978,
            "Source": "corporate_governance"
        },
        {
            "Title": "Royal Orchid Hotels Reports 10.7% Revenue Growth, Opens ICONIQA Mumbai Ahead of Schedule",
            "Summary": "Royal Orchid Hotels achieved consolidated revenue of ₹86.8 crores in Q2 FY26, up 10.7% year-on-year, with EBITDA at ₹20.8 crores reflecting 7% growth, while successfully launching its 292-key ICONIQA Mumbai hotel ahead of schedule. The company now operates 119+ hotels with 7,437 operational rooms across 80 cities and targets tripling its portfolio to 345 hotels by 2030 through an asset-light expansion model.",
            "Sentiment": "positive",
            "PublishDate": 1763563733664,
            "Source": "earnings"
        },
        {
            "Title": "Royal Orchid Hotels Reports 43% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "Royal Orchid Hotels reported consolidated net profit of 43 million rupees in Q2, down from 75 million rupees in the same quarter last year. Revenue increased to 792 million rupees from 704 million rupees year-over-year. EBITDA rose to 132 million rupees compared to 115 million rupees in the previous year, with EBITDA margin improving slightly to 16.68% from 16.27%.",
            "Sentiment": "neutral",
            "PublishDate": 1762958799132,
            "Source": "earnings"
        },
        {
            "Title": "Royal Orchid Regenta Hotels Signs 51-Key Resort in Bathinda, Punjab",
            "Summary": "Royal Orchid Regenta Hotels Ltd. has signed a new 51-key Regenta Resort in Bathinda, Punjab, under a Management Agreement with Firdaus Hotels Pvt. Ltd. The resort spans 2.2 acres with a built-up area of 80,500 sq.ft. and features multi-cuisine restaurant and bar, swimming pool, gymnasium, spa and wellness facilities, banquet halls, and two expansive lawns. The property is located 15km from Bathinda Railway Station and 38km from Bathinda Airport. The signing strengthens the company's presence in Punjab and aligns with its strategy to expand in Tier-II cities with strong tourism and business potential. Royal Orchid Regenta Hotels currently operates 1104 hotels across India and is listed on BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1762404417117,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Appoints Nithyalakshmi Subramanian as Independent Women Director",
            "Summary": "Royal Orchid Hotels Limited appointed Ms. Nithyalakshmi Subramanian as an Additional Director in the category of Non-Executive Independent Women Director for a two-year term from October 20, 2025, to October 19, 2027. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation and is subject to shareholder approval. Ms. Subramanian brings 21 years of experience as a senior management professional with expertise in data science, machine learning, AI, and business intelligence. She currently serves as Senior Director Data & AI at Best Buy and has previously worked with companies including Microsoft, Philips, Cisco, and IBM. She is not related to any existing directors of the company and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1760707767258,
            "Source": "corporate_governance"
        },
        {
            "Title": "Royal Orchid Hotels Launches New Brand 'Iconiqa' with Phased Rollout Plan",
            "Summary": "Royal Orchid Hotels announced the soft launch of Iconiqa, a new lifestyle-driven hospitality brand targeting modern travelers and business professionals. The brand focuses on contemporary design, comfort, and personalized service with stylish spaces and vibrant dining options. The launch marks the beginning of a phased rollout, with the first property ready to welcome guests. Each Iconiqa hotel will combine contemporary style with local character. Royal Orchid Hotels currently operates 120+ hotels and resorts across India and select international destinations, with plans to open another 20+ hotels in the current financial year. President Arjun Baljee stated the brand represents the company's commitment to evolving with guest preferences and delivering relevant, refreshing experiences.",
            "Sentiment": "positive",
            "PublishDate": 1758132431813,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Targets 25% RoCE in Five Years Through Asset-Light Growth Strategy",
            "Summary": "Royal Orchid Hotels plans to increase its return on capital employed from 20% to 25% within five years by focusing on profitability and cost control. CFO Amit Jaiswal outlined an asset-light expansion strategy where 80% of growth will come from management contracts and 20% from revenue-sharing models with minimal investment required. The company expects to maintain debt levels around Rs 90 crore. Royal Orchid anticipates benefits from recent GST rate reductions on hotel rooms below Rs 7,500, which dropped from 12% to 5% effective September 22. The company has significant exposure to this segment, with an average room rate of Rs 6,000 and 85% of rooms sold below Rs 7,500, giving them a competitive advantage from the tax change.",
            "Sentiment": "positive",
            "PublishDate": 1757666684867,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Signs 65-Key Property in Ambala, Haryana",
            "Summary": "Royal Orchid Hotels has signed a new 65-key property in Ambala, Haryana. This expansion strengthens the company's presence in North India.",
            "Sentiment": "positive",
            "PublishDate": 1756724602490,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Signs New Agreement to Expand in Jabalpur",
            "Summary": "Royal Orchid Hotels has signed a new agreement in Jabalpur as part of its expansion strategy in Central India. The hospitality company is extending its presence in the region through this new partnership.",
            "Sentiment": "positive",
            "PublishDate": 1756190172650,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Promoter Group Member Sunil Sikka Sells 4,000 Shares",
            "Summary": "Sunil Sikka, a promoter group member of Royal Orchid Hotels Limited, sold 4,000 equity shares through open market transactions on NSE on August 22, 2025. The sale reduced his shareholding from 19,000 shares (0.07%) to 15,000 shares (0.05%) of the company's total paid-up share capital of 2.74 crore equity shares. The transaction was valued at Rs. 19,32,160. Royal Orchid Hotels submitted the required regulatory disclosures under SEBI insider trading and substantial acquisition regulations on August 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755948964389,
            "Source": "corporate_action"
        },
        {
            "Title": "Royal Orchid Hotels Reports 8% Revenue Growth, Launches Iconiqa Mumbai Property",
            "Summary": "Royal Orchid Hotels Limited reported consolidated revenue of INR 78.8 crores for Q1 FY26, marking an 8% year-over-year increase. The company's EBITDA grew 11% to INR 23.7 crores, while profit after tax before exceptional items rose 28% to INR 11.2 crores from INR 8.7 crores. The hospitality company operates 118+ hotels across India with 9,605 keys in its portfolio. Key operational metrics showed room revenue growth of 6%, F&B revenue up 7%, and other services revenue increasing 24%. Average room rates for JLO hotels reached INR 5,488, up 6% from the previous year. The company soft-launched its new Iconiqa Mumbai property with 291 keys, expected to generate INR 65-70 crores revenue in the first eight months. Royal Orchid is consolidating its brand architecture under five key brands and pursuing an asset-light expansion model. The company has set Vision 2030 targets to triple its hotel count from 115 to 345 properties and grow keys from 9,605 to 22,000. Management projects non-IndAS profit of INR 75 crores for FY27. However, the company faced challenges from geopolitical situations affecting North India tourism, taxi issues in Goa, and competition from reopened international destinations.",
            "Sentiment": "positive",
            "PublishDate": 1755613256660,
            "Source": "earnings"
        },
        {
            "Title": "Royal Orchid Hotels Plans to Expand Portfolio to 150+ Properties by 2028",
            "Summary": "Royal Orchid Hotels has announced plans to expand its portfolio to over 150 properties by 2028. The company will pursue this expansion through asset-light management contracts, focusing on premium and mid-market segments. The strategy includes forming strategic alliances and capitalizing on rising domestic travel demand to drive sustainable revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1755104749663,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Reports Q1 FY2025 Results, Sets Dividend Record Date and AGM Schedule",
            "Summary": "Royal Orchid Hotels Limited approved its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of ₹4,755.85 lakhs and net profit of ₹361.53 lakhs, with earnings per share of ₹1.32. On a consolidated basis, total income reached ₹8,279.52 lakhs with net profit of ₹1,119.43 lakhs and earnings per share of ₹3.99. The board has set August 29, 2025 as the record date for final dividend eligibility of ₹2.5 per share for financial year 2024-25, subject to shareholder approval. The 39th Annual General Meeting is scheduled for September 25, 2025 via video conferencing. The company continues to face ongoing legal proceedings with SEBI regarding the classification of associate company KSDPL, with the next hearing scheduled for October 8, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755100671997,
            "Source": "earnings"
        },
        {
            "Title": "Royal Orchid Hotels Reports Strong Q1 Performance with 29% Jump in Net Profit",
            "Summary": "Royal Orchid Hotels delivered robust quarterly results with consolidated net profit rising to 112 million rupees from 87 million rupees year-over-year. Revenue increased to 788 million rupees compared to 730 million rupees in the same period last year. The company's EBITDA grew to 196 million rupees from 166 million rupees, while EBITDA margin expanded to 24.93% from 22.8% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1755097990864,
            "Source": "earnings"
        },
        {
            "Title": "Royal Orchid Hotels Changes Director Appointment Date, Schedules Q1 FY26 Results Call",
            "Summary": "Royal Orchid Hotels Limited announced a change in the effective date for Mr. Sunil Sikka's appointment as Non-Executive Director to September 15, 2025, subject to shareholder approval via postal ballot. The Board made this decision through a circular resolution passed on August 11, 2025, based on recommendations from the Nomination and Remuneration Committee. Additionally, the company scheduled a conference call with investors and analysts to discuss Q1 and Financial Year 2025-26 results on Thursday, August 14, 2025 at 4:00 PM IST. The management team will be represented by Chairman & Managing Director Chander K. Baljee, President Arjun Baljee, Non-Executive Director Keshav Baljee, and Chief Financial Officer Amit Jaiswal.",
            "Sentiment": "neutral",
            "PublishDate": 1754926189721,
            "Source": "corporate_governance"
        },
        {
            "Title": "Royal Orchid Hotels Signs New 70-Key Property in Bhopal",
            "Summary": "Royal Orchid Hotels Limited has signed a new property called Regenta, Bhopal, marking its expansion into Central India. The 70-key business hotel, including four suites, is located on Airport Road, 1 km from Raja Bhoj International Airport. The property spans 56,000 sq ft and will be operated under a management agreement with Regenta Hotel Bhopal Airport. The hotel features three conference rooms, a rooftop bar and restaurant, spa, swimming pool, and gym, targeting business travelers and MICE clientele. The property is developed in partnership with Sarla Builders & Developers and reflects the company's asset-light model strategy of expanding into growing regions of India.",
            "Sentiment": "positive",
            "PublishDate": 1754906818560,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Expands Operations in Himachal Pradesh with New Baddi Property",
            "Summary": "Royal Orchid Hotels has expanded its presence in Himachal Pradesh by adding a new property in Baddi. This expansion represents the company's continued growth strategy in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1754380128282,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Reschedules Board Meeting to August 13 for Q1 Financial Results",
            "Summary": "Royal Orchid Hotels Limited has rescheduled its Board Meeting to August 13, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. This follows earlier intimations dated July 26 and July 30, 2025. The company's trading window remains closed from July 1, 2025, until two days after the submission of quarterly results to stock exchanges, and will reopen on the third day following submission.",
            "Sentiment": "neutral",
            "PublishDate": 1754053081352,
            "Source": "corporate_action"
        },
        {
            "Title": "Royal Orchid Hotels Launches Fifth Property in Mysore with Regenta Resort Tropical Villages",
            "Summary": "Royal Orchid Hotels Ltd. launched Regenta Resort Tropical Villages in Mysore, marking its fifth property in the city. The experiential resort features 35 themed cottages inspired by global cultures from seven continents and 12 rooms based on Indian elemental philosophy in the Mangala Kutira block. The property offers diverse amenities including multiple dining options, recreational facilities, a wellness center, yoga hall, and over 12,000 sq. ft. of outdoor space for events. Chairman Chander K Baljee described the launch as bringing a distinctive resort experience that celebrates cultural diversity, wellness, and sustainability. The resort aligns with the company's asset-light growth strategy and targets both leisure and business travelers seeking wellness-driven experiences.",
            "Sentiment": "positive",
            "PublishDate": 1753443630878,
            "Source": "stock"
        },
        {
            "Title": "Royal Orchid Hotels Opens New Hotel in Solapur, Maharashtra",
            "Summary": "Royal Orchid Hotels has expanded its presence in Maharashtra by opening a new hotel in Solapur. This addition marks the company's growth in the hospitality sector within the state.",
            "Sentiment": "positive",
            "PublishDate": 1751889552000,
            "Source": "default"
        },
        {
            "Title": "Royal Orchid Hotels Expands in Uttarakhand with 8th Property",
            "Summary": "Royal Orchid Hotels has announced the signing of its 8th property in Uttarakhand, expanding its presence in the state. This move indicates continued growth and expansion for the company in the region.",
            "Sentiment": "positive",
            "PublishDate": 1748875110000,
            "Source": "default"
        },
        {
            "Title": "Royal Orchid Hotels Reports Q4 Financial Results and Dividend Declaration",
            "Summary": "Royal Orchid Hotels announced its Q4 financial results. The company's EBITDA increased to 199 million rupees from 178 million rupees year-over-year. However, the EBITDA margin slightly decreased to 22.97% from 23.33%. Revenue grew to 867 million rupees from 762 million rupees in the same period last year. Consolidated net profit declined to 132 million rupees from 166 million rupees year-over-year. The company also declared a dividend of 2.5 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1748334403000,
            "Source": "result"
        },
        {
            "Title": "Royal Orchid Hotels Expands with New Property in Mussoorie",
            "Summary": "Royal Orchid Hotels Limited (ROHL) has signed an agreement to open a new upscale property in Mussoorie, a popular hill station in India. This move indicates the company's strategy for expansion and growth in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1745843136000,
            "Source": "default"
        },
        {
            "Title": "Royal Orchid Hotels Expands in Maharashtra with New Resort Launch",
            "Summary": "Royal Orchid Hotels has continued its expansion in Maharashtra by launching the Regenta Bharti Resort in Mahabaleshwar. This new property adds to the company's growing portfolio in the state, indicating a strategic move to strengthen its presence in popular tourist destinations.",
            "Sentiment": "positive",
            "PublishDate": 1745401842000,
            "Source": "default"
        },
        {
            "Title": "Royal Orchid Hotels Renews Land Lease Agreement",
            "Summary": "Royal Orchid Hotels has signed a land lease renewal agreement. This action suggests the company is maintaining its current property holdings and continuing its operations at an existing location.",
            "Sentiment": "neutral",
            "PublishDate": 1743600579000,
            "Source": "corporate_action"
        },
        {
            "Title": "Royal Orchid Hotels Expands Regenta Brand in Goa",
            "Summary": "Royal Orchid Hotels has launched two new properties under its Regenta brand in Goa, expanding its presence in the popular tourist destination.",
            "Sentiment": "positive",
            "PublishDate": 1742201568000,
            "Source": "corporate_action"
        },
        {
            "Title": "Royal Orchid Hotels Reports Q3 Revenue Increase",
            "Summary": "Royal Orchid Hotels has announced its third-quarter revenue results. The company reported revenue of 893 million rupees, compared to 819 million rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739349865000,
            "Source": "earnings"
        },
        {
            "Title": "Royal Orchid Hotels Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Royal Orchid Hotels has announced its financial results for the third quarter. The company's consolidated net profit rose to 178 million rupees, up from 154 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739349836000,
            "Source": "earnings"
        },
        {
            "Title": "Royal Orchid Hotels: Expands Gurgaon Property with 48 New Suites",
            "Summary": "Royal Orchid Hotels Limited is expanding its Regenta Suites property in Gurgaon by adding 48 suites, increasing total room count to 115. The expansion is driven by rising demand in the business district near Delhi. The hotel features a rooftop pool, all-day dining, and a banquet hall for 200-300 people.",
            "Sentiment": "positive",
            "PublishDate": 1737524471000,
            "Source": "corporate_action"
        },
        {
            "Title": "Royal Orchid Hotels: Projecting 20% ARR Growth in FY26, FY27",
            "Summary": "Royal Orchid Hotels expects 15-20% organic growth in average room rents (ARR) for FY26 and FY27 due to high demand. A new 300-room hotel near Mumbai Airport is set to boost revenue by over Rs 100 crore next fiscal year, supporting the company's FY26 target of Rs 500 crore revenue and 20% net profit growth.",
            "Sentiment": "positive",
            "PublishDate": 1735357976000,
            "Source": "normal_news"
        },
        {
            "Title": "Royal Orchid Hotels Expands Religious Tourism Portfolio with New Hotel in Dwarka",
            "Summary": "Royal Orchid Hotels has announced the launch of Regent Hotel in Dwarka, Gujarat, strengthening its presence in the religious tourism sector. This strategic move aims to cater to the growing demand for quality accommodation in popular pilgrimage destinations.",
            "Sentiment": "positive",
            "PublishDate": 1734323514000,
            "Source": "corporate_action"
        }
    ]
}