{
    "Symbol": "ROLEXRINGS",
    "ISIN": "INE645S01024",
    "News": [
        {
            "Title": "Rolex Rings Q3FY26 Results Call on Feb 10, 2026",
            "Summary": "Rolex Rings Limited schedules analyst/investor conference call for February 10, 2026 at 02:30 PM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770272755986,
            "Source": "stocks"
        },
        {
            "Title": "Rolex Rings postal ballot for remuneration hikes",
            "Summary": "Rolex Rings Limited issues postal ballot notice dated January 27, 2026 seeking shareholder approval for significant remuneration revisions for key directors and promoter group reclassification.",
            "Sentiment": "neutral",
            "PublishDate": 1769690637606,
            "Source": "stocks"
        },
        {
            "Title": "Rolex Rings Gets Approval for Promoter Reclassification",
            "Summary": "Rolex Rings Limited receives BSE and NSE approval to reclassify two promoter group members to public category under SEBI regulations, with one member holding 1.13% stake.",
            "Sentiment": "neutral",
            "PublishDate": 1769000451787,
            "Source": "stocks"
        },
        {
            "Title": "Rolex Rings Promoter Pledges 73 Lakh Shares",
            "Summary": "Rolex Rings promoter Manesh Dayashankar Madeka pledged 73 lakh equity shares representing 2.68% of share capital to Equitus Finance and Tata Capital on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767351007535,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rolex Rings Reports Decline in Quarterly Financial Performance",
            "Summary": "Rolex Rings reported quarterly net profit of 443 million rupees, down from 493 million rupees in the same period last year. Revenue decreased to 2.71 billion rupees from 3 billion rupees year-over-year. EBITDA fell to 548 million rupees from 660 million rupees, while EBITDA margin compressed to 20.21% from 21.98% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762772130379,
            "Source": "earnings"
        }
    ]
}