{
    "Symbol": "ROLLT",
    "ISIN": "INE927A01040",
    "News": [
        {
            "Title": "Rollatainers Board Meet Set for Feb 11, 2026",
            "Summary": "Rollatainers Limited announces board meeting on February 11, 2026 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025. Trading window closed for insiders.",
            "Sentiment": "neutral",
            "PublishDate": 1770398200724,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rollatainers Exits Joint Venture with ₹1 Lakh Sale",
            "Summary": "Rollatainers Limited sold its entire stake in joint venture Rollatainers-Toyo Machine Private Limited to promoter group company WLD Investments for ₹1.00 lakh on December 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767106198007,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rollatainers Limited Completes Disinvestment of Material Subsidiary RT Packaging Limited",
            "Summary": "Rollatainers Limited completed the sale of shares in its material subsidiary RT Packaging Limited on November 13, 2025, following an earlier intimation from April 2025. RT Packaging Limited has ceased to be a subsidiary company as the disinvestment transaction stands closed, affecting Rollatainers' corporate structure and subsidiary portfolio.",
            "Sentiment": "negative",
            "PublishDate": 1763057437652,
            "Source": "earnings"
        },
        {
            "Title": "Rollatainers Limited Re-appoints Amit Sharma as Director at Annual General Meeting",
            "Summary": "Rollatainers Limited shareholders approved the re-appointment of Mr. Amit Sharma as Director at the 54th Annual General Meeting held on September 30, 2025. Sharma, who was liable to retire by rotation, will continue serving on the company's board. He holds DIN 10524102 and has over 15 years of experience in accounting and finance. The company confirmed that Sharma is not debarred from holding office as a Director by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1759486713638,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rollatainers Limited Appoints New Independent Director as Board Member Resigns",
            "Summary": "Rollatainers Limited announced board changes effective September 18, 2025. Mr. Shashikant Sharma has been appointed as Additional Non-Executive Independent Director for a five-year term, subject to shareholder approval within three months. Simultaneously, Mr. Mahir Bhadani resigned from his position as Non-Executive Independent Director due to pre-occupation with other tasks. The appointment was recommended by the Nomination & Remuneration Committee. Mr. Sharma, aged 40 years, is a BA Graduate with 15 years of experience in transportation and logistics business. He is not related to the company and is not debarred from holding directorship by any regulatory authority. Mr. Bhadani confirmed there are no material reasons for his resignation beyond those stated.",
            "Sentiment": "neutral",
            "PublishDate": 1758199088781,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rollatainers Limited Reports Rs 16.99 Lakh Loss in Q1 FY2026 Amid Subsidiary Sale Approval",
            "Summary": "Rollatainers Limited reported a net loss of Rs 16.99 lakhs from continuing operations for the quarter ended June 30, 2025. The company recorded zero revenue from operations with total income of Rs 0.00 lakhs, while total expenses stood at Rs 16.99 lakhs. The company's accumulated losses reached Rs 12,377.90 lakhs as of June 30, 2025. The Board approved the sale of its entire investment in material subsidiary RT Packaging Limited, comprising 2,24,99,900 equity shares and 2,00,000 preference shares, which was subsequently approved by shareholders in April 2025. RT Packaging Limited's results have been classified as discontinued operations. The company faces regulatory challenges with provisional attachment orders issued by the Directorate of Enforcement against subsidiary properties and promoter shares, though management states this does not affect business operations. The company operates primarily in leasing and related activities as a single business segment.",
            "Sentiment": "negative",
            "PublishDate": 1755015346390,
            "Source": "earnings"
        },
        {
            "Title": "Rollatainers Limited Seeks Shareholder Approval for Regularization of Independent Director Through Postal Ballot",
            "Summary": "Rollatainers Limited has issued a postal ballot notice seeking shareholder approval to regularize the appointment of Mr. Mahir Bhadani as a Non-Executive Independent Director through an ordinary resolution. Mr. Bhadani, aged 26 years and a B.Com graduate with experience in finance and general management, was initially appointed as an Additional Director by the board on May 29, 2025. The company's board meeting held on August 1, 2025, approved the postal ballot notice and appointed M/s AASK & Associates LLP as scrutinizer for the e-voting process. The e-voting period will commence on August 2, 2025, at 9:00 AM and conclude on August 31, 2025, at 5:00 PM. Mr. Bhadani's proposed term as Independent Director is for five consecutive years from May 29, 2025, and he will not be liable to retire by rotation. The company has engaged Central Depository Services Limited to facilitate the e-voting process, with results to be announced within two days of voting conclusion.",
            "Sentiment": "neutral",
            "PublishDate": 1754067815003,
            "Source": "corporate_governance"
        }
    ]
}