{
    "Symbol": "ROML",
    "ISIN": "INE294G01026",
    "News": [
        {
            "Title": "Raj Oil Mills Q3 FY26 Results Show Strong Growth",
            "Summary": "Raj Oil Mills reported Q3 FY26 net profit of ₹121.81 lakhs, with total income at ₹3,590.99 lakhs. Nine-month performance shows significant improvement with net profit rising to ₹415.83 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770816431516,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raj Oil Mills Shareholders Approve Director Reappointments",
            "Summary": "Raj Oil Mills Ltd. shareholders overwhelmingly approved the re-appointment of three independent directors through postal ballot, with all resolutions passing with over 99% approval rates.",
            "Sentiment": "positive",
            "PublishDate": 1770638468244,
            "Source": "stocks"
        },
        {
            "Title": "Raj Oil Mills Launches New Palm Oil Product PALMRAJ",
            "Summary": "Raj Oil Mills Limited announced the launch of its new edible oil product PALMRAJ (Palm Oil) on January 15, 2026, targeting the domestic market under SEBI Regulation 30 compliance.",
            "Sentiment": "positive",
            "PublishDate": 1768465759830,
            "Source": "stocks"
        },
        {
            "Title": "Raj Oil Mills Reappoints Three Independent Directors for Second Terms",
            "Summary": "Raj Oil Mills Limited's Board of Directors approved the re-appointment of three Independent Directors for second terms of five years each. Mrs. Kiran Raghavendra Awasthi and Mr. Rishang Sanjay Jain will serve from February 13, 2026, while Mr. Unmesh Breed's term begins June 24, 2026. All appointments are subject to shareholder approval at the upcoming General Meeting. Mrs. Awasthi is a Chartered Accountant with over 28 years of experience in Accounts, Finance, and Taxation, and serves as Senior Partner at AMRG Associates. Mr. Jain is a Chartered Accountant with a B.Com from H.R. College, Mumbai, and achieved All-India Rank 23 in CA exams, bringing entrepreneurial and advisory experience. Mr. Breed is a 42-year-old advocate with over 13 years of practice in criminal law, known for courtroom advocacy and strategic case management across trial courts, sessions courts, and High Courts.",
            "Sentiment": "neutral",
            "PublishDate": 1762524509106,
            "Source": "corporate_governance"
        },
        {
            "Title": "Raj Oil Mills Reports Strong Q1 Performance, Faces Board Changes with Two Independent Directors Resigning",
            "Summary": "Raj Oil Mills Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs 3,359.70 lakhs and profit after tax of Rs 140.65 lakhs, compared to a loss of Rs 79.15 lakhs in the same quarter last year. The company scheduled its 23rd Annual General Meeting for September 29, 2025, through video conferencing. Two independent directors resigned effective August 13, 2025: Mr. Siraj Umar Furniturewala citing engagement in other assignments, and Mr. Arun Dash due to preoccupation and personal commitments. Following these resignations, the company reconstituted its Audit Committee, Nomination and Remuneration Committee, and Stakeholder Relationship Committee. The auditor's report highlighted ongoing difficulties with Rs 61.75 lakhs in outstanding payments to unsecured operational creditors and public fixed deposit holders, for which the company has filed an application with NCLT seeking payment directions.",
            "Sentiment": "neutral",
            "PublishDate": 1755097096868,
            "Source": "corporate_governance"
        }
    ]
}