{
    "Symbol": "ROSSTECH",
    "ISIN": "INE0OJW01016",
    "News": [
        {
            "Title": "Rossell Techsys Q3 FY26 Revenue Jumps 72% to INR130 Cr",
            "Summary": "Rossell Techsys delivered record Q3 FY26 revenue of INR130 crores, marking 72% YoY growth. Nine-month revenue surged 98% to INR343 crores with strong semiconductor and space segment traction.",
            "Sentiment": "positive",
            "PublishDate": 1770357011818,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rossell Techsys Q3FY26 earnings call on Feb 4",
            "Summary": "Rossell Techsys Limited announces Q3 FY26 earnings conference call scheduled for February 4, 2026 at 11:00 AM IST to discuss financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769684631402,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rossell Techsys Shareholders Approve Fundraising Through Qualified Institutional Placement",
            "Summary": "Rossell Techsys Limited shareholders passed a special resolution with 99.999% votes in favor to raise funds through qualified institutional placement by issuing equity shares and other securities to eligible investors. The postal ballot conducted through remote e-voting concluded on December 3, 2025, with 2,92,31,986 votes cast in favor and only 87 votes against the proposal.",
            "Sentiment": "positive",
            "PublishDate": 1764909492976,
            "Source": "corporate_action"
        },
        {
            "Title": "Rossell Techsys Clarifies Recent Share Price Movement as Market-Driven",
            "Summary": "Rossell Techsys informed stock exchanges that recent share price and trading volume movements appear to be market-driven, attributing them to investor sentiment, speculation, or external factors beyond company control. The company confirmed no pending announcements or material information that could impact securities pricing, maintaining compliance with disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1764224791727,
            "Source": "stock"
        },
        {
            "Title": "Rossell Techsys Receives IND BBB Credit Rating with Positive Outlook for INR 3,200 Million Bank Facilities",
            "Summary": "India Ratings assigned Rossell Techsys Limited an IND BBB/Positive/IND A2 credit rating for its INR 3,200 million bank loan facilities, citing strong order book visibility and healthy operating performance. The Positive Outlook reflects expectations of improved working capital cycle and credit metrics, though the company faces challenges from stretched working capital due to significant inventory holdings and customer concentration risks.",
            "Sentiment": "positive",
            "PublishDate": 1763637198491,
            "Source": "stock"
        },
        {
            "Title": "Rossell Techsys Reports Record Q2 Performance with Revenue Doubling to INR 126 Crores",
            "Summary": "Rossell Techsys delivered exceptional quarterly results with revenue surging to INR 126 crores from INR 51.35 crores year-over-year, while profit before tax jumped to INR 6.7 crores from INR 0.06 crores. The aerospace and defense manufacturer secured firm orders worth INR 932.2 crores and plans a INR 300 crore fundraise through QIP to support capacity expansion and working capital needs.",
            "Sentiment": "positive",
            "PublishDate": 1763120668266,
            "Source": "earnings"
        },
        {
            "Title": "Rossell Techsys Recognized as Top Supplier by Lockheed Martin for Cable Harness Assembly Excellence",
            "Summary": "Rossell Techsys received recognition from Lockheed Martin as a top supplier at the defense contractor's annual conference for excellence in cable harness assembly. The award highlights Rossell Techsys' manufacturing capabilities and strengthens its position as a key supplier in the aerospace and defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1763100969363,
            "Source": "stock"
        },
        {
            "Title": "Rossell Techsys Initiates Capacity Expansion of 1.5 Lakh Square Feet",
            "Summary": "Rossell Techsys Limited has initiated capacity expansion within its existing premises as part of its long-term growth strategy. The company plans to add 1,50,000 square feet to its current capacity of 2,40,000 square feet, with existing utilization at 2,00,000 square feet. The expansion is expected to be completed within 18 months and will be financed through internal accruals and proposed fundraising. The company stated the expansion is aimed at supporting the execution of significant orders across multiple programs.",
            "Sentiment": "positive",
            "PublishDate": 1762804450243,
            "Source": "stock"
        },
        {
            "Title": "Rossell Techsys Reports Strong Q2 Performance with 499.98 Lakhs Profit",
            "Summary": "Rossell Techsys Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a standalone profit of Rs. 499.98 lakhs for Q2 2025, compared to Rs. 5.90 lakhs in the same quarter last year. For the half-year period, standalone profit reached Rs. 797.72 lakhs versus a loss of Rs. 442.95 lakhs in the previous year. Total income for Q2 stood at Rs. 11,000.54 lakhs. On a consolidated basis, the company posted Q2 profit of Rs. 567.05 lakhs and half-year profit of Rs. 936.56 lakhs. The company operates in engineering and manufacturing for aerospace and defense sectors. Basic earnings per share for the quarter was Rs. 1.33. The Board had previously approved a final dividend of Rs. 0.20 per share for the financial year ended March 31, 2025, which was paid in October 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762783590675,
            "Source": "earnings"
        },
        {
            "Title": "Rossell Techsys Announces Up to ₹300 Crore Fundraise Through QIP",
            "Summary": "Rossell Techsys Limited, an aerospace and defence engineering solutions provider, announced that its Board of Directors has approved a fundraise of up to ₹300 crores. The capital will be raised through issuance of equity shares and/or other eligible securities, including through a Qualified Institutions Placement (QIP). The proceeds will be utilized for capital expenditure, working capital requirements, and general corporate purposes. Managing Director Rishab Gupta stated the capital infusion will support growth and capability expansion plans while strengthening the company's financial position. The company has initiated a postal ballot for shareholder approval with e-voting scheduled from November 4 to December 3, 2025. In August 2025, the company reported a 94% year-on-year increase in total income, marking its strongest quarterly performance. The company is scheduled to announce financial results for the quarter ending September 2025 on November 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762750308734,
            "Source": "corporate_action"
        },
        {
            "Title": "Rossell Techsys Schedules Q2 FY26 Earnings Conference Call",
            "Summary": "Rossell Techsys Limited will conduct its Q2 FY26 earnings conference call on November 11, 2025, at 11:00 AM IST. The call will discuss business performance and financial highlights for the quarter ended September 30, 2025. The session will be hosted by Anand Rathi Research and attended by key company executives including Managing Director Rishab Mohan Gupta, CEO Senthil Balasubramanian, COO Zeena Philip, and CFO Jayanth V. Multiple access numbers have been provided for participants across different regions including India, USA, UK, Hong Kong, and Singapore.",
            "Sentiment": "neutral",
            "PublishDate": 1762378538501,
            "Source": "earnings"
        },
        {
            "Title": "Rossell Techsys Seeks Shareholder Approval for Rs 300 Crore QIP Fundraising",
            "Summary": "Rossell Techsys Limited has issued a postal ballot notice seeking shareholder approval to raise up to Rs 300 crores through a Qualified Institutional Placement (QIP). The company plans to issue equity shares and/or other convertible securities to eligible investors including qualified institutional buyers. The board approved this proposal on November 1, 2025. The e-voting period runs from November 4, 2025 at 9:00 AM to December 3, 2025 at 5:00 PM, with results to be declared by December 5, 2025. The cut-off date for determining voting eligibility is October 31, 2025. The company intends to use the proceeds for capital expenditure, working capital requirements, debt repayment, and general corporate purposes. Under SEBI regulations, the QIP must be completed within 365 days of the resolution passing, with a minimum 10% allocation to mutual funds and no single allottee receiving more than 50% of the issue size.",
            "Sentiment": "neutral",
            "PublishDate": 1762202767553,
            "Source": "corporate_action"
        },
        {
            "Title": "Rossell Techsys Board Approves Capital Raising Plan Up To ₹300 Crores",
            "Summary": "Rossell Techsys Limited's Board of Directors approved a proposal to raise capital up to ₹300 crores through equity shares and convertible securities. The fundraising will be conducted through Qualified Institutions Placement (QIP), preferential allotment, rights issue, or public offering to eligible investors. The company plans to use the proceeds for capital expenditure, working capital, general corporate purposes, or other purposes as determined by the Board. The company will conduct a postal ballot to seek shareholder approval through a special resolution for the securities issuance.",
            "Sentiment": "positive",
            "PublishDate": 1762000349043,
            "Source": "corporate_action"
        },
        {
            "Title": "Rossell Techsys Secures Long-Term Boeing Contract for T-7A Red Hawk Electrical Panel Assemblies",
            "Summary": "Rossell Techsys Limited has signed a long-term Indefinite Delivery, Indefinite Quantity (IDIQ) contract with Boeing to manufacture electrical panel assemblies for the T-7A Red Hawk advanced pilot training system. The agreement allows Rossell Techsys to produce up to 1,200 shipsets through 2033. This builds on the company's previous IDIQ contract for wire harness assemblies for the same platform. Rossell Techsys has been associated with the T-7A Red Hawk program since its engineering and manufacturing development stages and has received two Boeing 'Supplier of the Year' awards. The partnership with Boeing began in 2013, and Rossell Techsys supports Boeing across multiple defense platforms including F/A-18 Super Hornet, F-15 Eagle, AH-64 Apache, CH-47 Chinook, V-22 Osprey, P-8 Poseidon, and KC-46 Pegasus. The company has delivered more than 160,000 critical assemblies to Boeing to date.",
            "Sentiment": "positive",
            "PublishDate": 1758516426074,
            "Source": "stock"
        },
        {
            "Title": "Rossell Techsys Appoints Senthil Balasubramanian as Chief Executive Officer",
            "Summary": "Rossell Techsys Limited appointed Mr. Senthil Balasubramanian as Chief Executive Officer effective August 18, 2025. Balasubramanian brings 30 years of global experience in aerospace and defense across the United States, Philippines, Puerto Rico, and Mexico. He previously spent a decade at Collins Aerospace leading operations with oversight of multiple factories and product lines generating over $800 million in annual revenue. He also served as Country General Manager at ITT Interconnect Solutions in Mexico with full P&L responsibility, managing production for Boeing and Airbus. Most recently, he was Vice President of Global Operations at Ultra Maritime, directing sonobuoy manufacturing for the U.S. Navy across five facilities. He holds dual master's degrees in Engineering and Business Administration from the United States and is a certified Six Sigma Black Belt.",
            "Sentiment": "positive",
            "PublishDate": 1755523256455,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rossell Techsys Reports Strong Q1 FY2026 Results with 100% Revenue Growth and Return to Profitability",
            "Summary": "Rossell Techsys Limited reported total income of INR 88.29 crores for Q1 FY2026, representing nearly 100% growth compared to INR 45.60 crores in Q1 FY2025. The company achieved a significant turnaround in profitability with profit after tax of INR 2.98 crores versus a loss of INR 4.47 crores in the previous year. The aerospace and defense solutions provider holds strategic agreements worth approximately INR 2,500 crores and confirmed purchase orders over INR 700 crores. Management projects EBITDA margins of 18-22% and PAT margins of 8-12% going forward. The company expanded its customer base from 2 in 2022 to over 30 currently, with Boeing expected to contribute around 40% of revenue in FY2026. Rossell operates primarily in defense (60-65%), semiconductor (10-12%), and space sectors (8-10%), with about 80% of revenue coming from the USA. The company is expanding capacity by 15,000 sq ft and increased headcount from 680 to 960 employees. Management announced a 10% dividend and expects substantial growth in financial performance for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1755514190577,
            "Source": "earnings"
        },
        {
            "Title": "Rossell Techsys Expands Production Capacity by 15,000 Sq Feet with ₹1.5 Crore Investment",
            "Summary": "Rossell Techsys Limited has initiated a capacity expansion project within its existing premises as part of its long-term growth strategy. The company will add 15,000 square feet to its current capacity of 2,25,000 square feet, with existing utilization at 1,75,000 square feet. The expansion requires an investment of ₹1.5 crore, which will be funded through internal accruals. The project is scheduled for completion in Q3 FY 2025-26. The expansion aims to support execution of significant orders across multiple programs by increasing production capacity.",
            "Sentiment": "positive",
            "PublishDate": 1755110760274,
            "Source": "stock"
        },
        {
            "Title": "Rossell Techsys Limited Approves Q1 FY26 Financial Results and Key Auditor Appointments",
            "Summary": "Rossell Techsys Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs. 8,698.73 lakhs and profit after tax of Rs. 297.4 lakhs, with basic EPS of Rs. 0.79. Consolidated revenue stood at Rs. 8,721.64 lakhs with profit after tax of Rs. 329.51 lakhs and basic EPS of Rs. 0.87. The Board also approved the re-appointment of M/s. Raghavan, Chaudhuri & Narayanan as Statutory Auditors for five years (FY 2025-26 to FY 2029-30), appointment of M/s. BMP & Co LLP as Secretarial Auditor for the same period, and MMAK & Co as Internal Auditor for FY 2025-26. The company scheduled its Third Annual General Meeting for September 24, 2025, and fixed September 17, 2025, as the record date for dividend eligibility for FY 2024-25. The company operates in Engineering and Manufacturing in Aerospace and Defence sector.",
            "Sentiment": "positive",
            "PublishDate": 1755096518957,
            "Source": "earnings"
        },
        {
            "Title": "Rossell Techsys Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Rossell Techsys has announced its financial results for the third quarter. The company's net profit increased to 50 million rupees, up from 18 million rupees in the same period last year, marking a substantial year-over-year growth. Additionally, the company's revenue rose to 757 million rupees from 579 million rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738850351000,
            "Source": "earnings"
        }
    ]
}