{
    "Symbol": "ROSSELLIND",
    "ISIN": "INE847C01020",
    "News": [
        {
            "Title": "Rossell India Q3 FY26 Results Show Strong Growth",
            "Summary": "Rossell India reports 36.13% revenue growth to Rs 8,519 lakhs in Q3 FY26, with net profit declining to Rs 428 lakhs from Rs 617 lakhs in Q3 FY25. Nine-month performance remains robust.",
            "Sentiment": "neutral",
            "PublishDate": 1770711280062,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rossell Techsys Q3 Net Profit Rises to 53M Rupees",
            "Summary": "Rossell Techsys reported Q3 net profit of 53 million rupees compared to 50 million rupees in the same period last year, marking a year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1770106253072,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rossell India's Tea Estates Win Government Awards for Compliance and Welfare",
            "Summary": "Rossell India Limited received two awards from the Labour Welfare Department and Commissionerate of Labour, Government of Assam for its tea estates. Dikom Tea Estate was recognized as the Best ATEPFO Compliant Tea Estate for 2025, while Kharikatiea Tea Estate won the Best Tea Garden Compliant Factory award for 2025, both acknowledging outstanding contribution to labour welfare and adherence to statutory norms.",
            "Sentiment": "positive",
            "PublishDate": 1764249339086,
            "Source": "stock"
        },
        {
            "Title": "Rossell Techsys Expands Manufacturing Capacity with Rs 70 Crore Investment",
            "Summary": "Rossell Techsys is expanding its manufacturing capacity through a Rs 70 crore investment in a new 1.5 lakh square feet facility. The expansion is aimed at meeting increased order volumes expected over the next 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1762826934021,
            "Source": "stock"
        },
        {
            "Title": "Rossell Techsys Approves Fundraising of Up to 3 Billion Rupees",
            "Summary": "Rossell Techsys has approved a fundraising initiative of up to 3 billion rupees. The company has given its approval for this capital raising exercise.",
            "Sentiment": "positive",
            "PublishDate": 1762750329305,
            "Source": "corporate_action"
        },
        {
            "Title": "Rossell Techsys Secures Contract to Supply Electrical Panel Assemblies for Boeing's T-7A Red Hawk",
            "Summary": "Rossell Techsys has been selected to provide electrical panel assemblies for Boeing's T-7A Red Hawk aircraft program. This contract positions the company as a supplier for Boeing's advanced trainer jet platform.",
            "Sentiment": "positive",
            "PublishDate": 1758515982009,
            "Source": "order&deals"
        },
        {
            "Title": "Rossell Techsys Management Discusses Potential Customer Exemptions from U.S. Tariffs",
            "Summary": "Rossell Techsys management addressed potential exemptions for customers from U.S. tariffs during a conference call. The discussion focused on how these potential exemptions could impact the company's customer base.",
            "Sentiment": "neutral",
            "PublishDate": 1755151723674,
            "Source": "stock"
        },
        {
            "Title": "Rossell Techsys Reports Strong Q1 Turnaround with 30M Rupees Profit",
            "Summary": "Rossell Techsys achieved a net profit of 30 million rupees in Q1, marking a significant turnaround from a loss of 45 million rupees in the same period last year. The company's revenue nearly doubled to 870 million rupees compared to 448 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755097871660,
            "Source": "earnings"
        },
        {
            "Title": "Rossell India Reports ₹801 Lakh Quarterly Profit, Acquires Dhoedaam Tea Estate",
            "Summary": "Rossell India reported a profit of ₹801 lakh for the quarter ended June 30, 2025, compared to ₹737 lakh in the same period last year. Revenue from operations increased to ₹4,358 lakh from ₹3,003 lakh year-over-year. The company's earnings per share stood at ₹2.12 versus ₹1.96 in the corresponding quarter. The company acquired Dhoedaam Tea Estate in Assam as a going concern from January 1, 2025, which contributed to the current period results. Employee benefits expense rose to ₹3,912 lakh from ₹2,926 lakh in the previous year quarter. The board approved these unaudited financial results following an audit committee review. The company noted that tea business being seasonal in nature makes quarterly results non-indicative of full-year performance.",
            "Sentiment": "positive",
            "PublishDate": 1754383105540,
            "Source": "earnings"
        },
        {
            "Title": "Rossell India Acquires Dhoedaam Tea Estate from James Warren Tea Ltd",
            "Summary": "Rossell India has executed an agreement with James Warren Tea Ltd to acquire the Dhoedaam Tea Estate. This acquisition will increase Rossell India's crop base by approximately 40%, bringing it to 7 million kilograms.",
            "Sentiment": "positive",
            "PublishDate": 1733761392000,
            "Source": "corporate_action"
        }
    ]
}