{
    "Symbol": "ROSSARI",
    "ISIN": "INE02A801020",
    "News": [
        {
            "Title": "Rossari Biotech Receives Arbitration Award",
            "Summary": "Rossari Biotech receives arbitration award regarding Unitop Chemicals dispute. Company directed to release INR 97.90 lakh tax refund with 12% interest. Limited financial impact expected.",
            "Sentiment": "neutral",
            "PublishDate": 1769694228708,
            "Source": "stocks"
        },
        {
            "Title": "Rossari Biotech Completes Mumbai Office Sale",
            "Summary": "Rossari Biotech Limited has completed the sale of its office premises located at Kanjurmarg, Mumbai on January 23, 2026, as per regulatory compliance under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769179900359,
            "Source": "stocks"
        },
        {
            "Title": "Rossari Biotech Expects Ethylene Oxide Supply Relief",
            "Summary": "Rossari Biotech management indicates that current ethylene oxide supply constraints, which have been impacting operations, are expected to ease during the current calendar year, providing relief to the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1768881712030,
            "Source": "stocks"
        },
        {
            "Title": "Rossari Biotech Q3 FY26: Revenue up 13% to ₹581.7 cr",
            "Summary": "Rossari Biotech reported Q3 FY26 revenue of ₹581.7 crores, up 13% YoY, with EBITDA at ₹68.9 crores and PAT at ₹32.8 crores. Board approves greenfield facilities in Saudi Arabia.",
            "Sentiment": "positive",
            "PublishDate": 1768804676327,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rossari Biotech Q3 FY26 Earnings Call on Jan 19",
            "Summary": "Rossari Biotech Limited has scheduled an earnings conference call for January 19, 2026, at 4:00 PM IST to discuss Q3 FY26 financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1768311216130,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rossari Biotech Establishes Singapore Subsidiary",
            "Summary": "Rossari Biotech has incorporated a new subsidiary named Rossari (Singapore) Pte. Ltd., expanding its international presence through this strategic corporate development.",
            "Sentiment": "positive",
            "PublishDate": 1766060199977,
            "Source": "stocks"
        },
        {
            "Title": "Rossari Biotech Completes Singapore Subsidiary Setup",
            "Summary": "Rossari Biotech Limited successfully incorporated its wholly owned subsidiary Rossari (Singapore) Pte. Ltd. on December 18, 2025, following board approval for USD 10 million investment.",
            "Sentiment": "positive",
            "PublishDate": 1766039039086,
            "Source": "co_actions_results"
        },
        {
            "Title": "ICRA Reaffirms Credit Ratings for Rossari Biotech's Rs 333.31 Crore Banking Facilities",
            "Summary": "ICRA Limited reaffirmed credit ratings for Rossari Biotech Limited's banking facilities totaling Rs 333.31 crore, maintaining long-term rating at ICRA[AA- (Positive)] and short-term rating at ICRA[A1+]. The reaffirmation covers fund-based term loans of Rs 60 crore, working capital facilities of Rs 240 crore, and various other banking limits across multiple lenders including HDFC Bank, SBI, and Axis Bank.",
            "Sentiment": "positive",
            "PublishDate": 1764768846107,
            "Source": "corporate_action"
        },
        {
            "Title": "Rossari Biotech Subsidiary Unitop Chemicals Receives Leasehold Land Rights in Dahej from GIDC",
            "Summary": "Gujarat Industrial Development Corporation (GIDC) has granted leasehold land rights in Dahej to Unitop Chemicals Pvt Ltd, which is a material subsidiary of Rossari Biotech. This land acquisition by the subsidiary could support the company's operational expansion in the industrial hub of Dahej.",
            "Sentiment": "positive",
            "PublishDate": 1764000381046,
            "Source": "corporate_action"
        },
        {
            "Title": "Rossari Biotech Reports 18% Revenue Growth in Q2 FY26 Driven by Volume Expansion",
            "Summary": "Rossari Biotech achieved revenue of Rs. 586.1 crore in Q2 FY26, marking 18% year-over-year growth driven by volume expansion across all three business segments. HPPC, TSC, and AHN divisions grew 16%, 21%, and 29% respectively. Export business showed strong performance with 36% growth in the quarter and 27% growth in H1, now contributing 28% of total revenues. The company commissioned additional capacity of 20,000 metric tons per annum at Dahej facility and 15,000 metric tons per annum of ethoxylation capacity at Unitop. EBITDA stood at Rs. 71.9 crore with margin of 12.3% compared to 13.2% in the previous year. Core EBITDA excluding institutional and B2C verticals remained steady at around 15%. The company faces pricing pressures due to tariff uncertainties affecting textile exports to the US. Management expects margin levels to remain similar in H2 FY26, with core business maintaining 14-16% EBITDA margins. Working capital increased to 102 days from 95 days in March due to stretched receivables and strategic inventory stocking.",
            "Sentiment": "neutral",
            "PublishDate": 1761575428870,
            "Source": "earnings"
        },
        {
            "Title": "Rossari Biotech Targets Growth Through Performance Chemicals and Textile Specialties",
            "Summary": "Rossari Biotech expects strong growth from its performance chemicals and textile specialties segments. The company anticipates growth driven by demand recovery, benefits from backward integration, and scaling up exports. These factors are expected to contribute to double-digit margin expansion.",
            "Sentiment": "positive",
            "PublishDate": 1760632768116,
            "Source": "stock"
        },
        {
            "Title": "Rossari Biotech Reports Strong Q2 Performance, Approves Stock Options and Subsidiary Investment",
            "Summary": "Rossari Biotech Limited announced its quarterly results for the quarter ended September 30, 2025, showing consolidated revenue from operations of Rs 5,861.07 million and profit after tax of Rs 368.76 million. The company's Board approved granting 35,000 stock options under its Employee Stock Option Plan 2019 at an exercise price of Rs 661 per option. Additionally, the Board approved allotment of 14,400 equity shares at Rs 425 per share to employees exercising their stock options, increasing the total issued share capital to Rs 11,07,62,732 consisting of 55,381,366 equity shares. The company also approved an additional investment of up to USD 8 million in its wholly owned subsidiary Rossari International Limited Company in Saudi Arabia for manufacturing and trading activities. The investment will be made in tranches by March 31, 2027.",
            "Sentiment": "positive",
            "PublishDate": 1760541113970,
            "Source": "earnings"
        },
        {
            "Title": "Rossari Biotech and Unitop Chemicals Expand Production Capacities at Dahej Facilities",
            "Summary": "Rossari Biotech has commissioned an expansion of its Dahej facility, adding 20,000 MTPA capacity and bringing its total capacity to 1,52,500 MTPA. Separately, Unitop Chemicals has commissioned 15,000 MTPA ethoxylation capacity at Dahej, raising its total capacity to 51,000 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1759104741351,
            "Source": "stock"
        },
        {
            "Title": "Rossari Biotech Expands Production Capacity at Dahej Facility",
            "Summary": "Rossari Biotech has expanded its manufacturing operations through two capacity additions at its Dahej facility. Unitop Chemicals has commenced operations of a new 15,000 MTPA ethoxylation capacity, bringing the total ethoxylation capacity to 51,000 MTPA. Additionally, the company has added 20,000 MTPA capacity at the Dahej facility, increasing the total facility capacity to 152,500 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1758898150972,
            "Source": "stock"
        },
        {
            "Title": "Rossari Biotech Subsidiary Unitop Chemicals Acquires Leasehold Land Rights in Gujarat for Rs 9 Crores",
            "Summary": "Unitop Chemicals Private Limited, a material subsidiary of Rossari Biotech Limited, has approved the purchase of leasehold land rights in Dahej, Gujarat Industrial Development Corporation industrial estate. The transaction involves acquiring rights to approximately 12,600 square meters of land from Micro Resins Private Limited for a consideration of up to Rs 9 crores, excluding transfer charges and duties. The acquisition is intended to support future capacity expansion and operational synergies with the existing facility as part of the company's long-term growth strategy. The transaction completion is subject to necessary approvals and permissions from concerned authorities. The parties involved are not related to the promoter group, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1755524567124,
            "Source": "stock"
        },
        {
            "Title": "Rossari Biotech Reports 11% Revenue Growth to Rs 543.7 Crore in Q1 FY26, EBITDA Margins Decline",
            "Summary": "Rossari Biotech Limited reported revenue from operations of Rs 543.7 crore in Q1 FY26, marking 11% year-on-year growth driven by HPPC and AHN segments. EBITDA stood at Rs 67.9 crore with margins at 12.5%, down from 13.3% in the same quarter last year. The institutional and B2C business reported losses of approximately Rs 7 crore, impacting consolidated margins. Excluding these verticals, EBITDA was Rs 75 crore with adjusted margins of 16%. Export business faced headwinds due to global uncertainties, while domestic business performed well. The company experienced production disruptions for 10-12 days during the quarter due to capacity expansion activities. Management expects Q2 to be stronger and maintains optimism for mid-double-digit growth of 14-15% on both revenue and EBITDA. Capacity expansion projects across subsidiaries are progressing with phased commissioning expected in coming quarters. The company is setting up an overseas formulation facility in Southeast Asia with investment of Rs 15-20 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1753438883968,
            "Source": "earnings"
        },
        {
            "Title": "Rossari Biotech Reports Mixed Q1 Results with Higher EBITDA but Lower Margins",
            "Summary": "Rossari Biotech reported Q1 EBITDA of 680 million rupees, up from 649 million rupees in the same period last year. However, the company's EBITDA margin declined to 12.51% from 13.25% year-over-year, indicating lower profitability despite higher absolute earnings.",
            "Sentiment": "neutral",
            "PublishDate": 1753014523835,
            "Source": "earnings"
        },
        {
            "Title": "Rossari Biotech Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "Rossari Biotech reported quarterly consolidated net profit of 336 million rupees compared to 349 million rupees in the same period last year, representing a decline. However, the company's revenue increased to 5.4 billion rupees from 4.9 billion rupees year-over-year, showing growth in the top line despite pressure on profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1753014159941,
            "Source": "earnings"
        },
        {
            "Title": "Rossari Biotech Reports Q4 EBITDA Growth",
            "Summary": "Rossari Biotech's Q4 EBITDA increased to 695 million rupees from 636 million rupees year-over-year. However, the EBITDA margin decreased to 11.99% from 13.45% in the same period.",
            "Sentiment": "neutral",
            "PublishDate": 1745594973000,
            "Source": "result"
        },
        {
            "Title": "Rossari Biotech Reports Q4 FY2023 Financial Results",
            "Summary": "Rossari Biotech announced its Q4 financial results. The company's consolidated net profit for Q4 was 344 million rupees, showing a slight increase from 341 million rupees year-over-year (YoY) and a more significant increase from 317 million rupees quarter-over-quarter (QoQ). Revenue for Q4 stood at 5.8 billion rupees, up from 4.73 billion rupees in the same quarter last year, indicating substantial growth.",
            "Sentiment": "positive",
            "PublishDate": 1745594922000,
            "Source": "result"
        },
        {
            "Title": "Rossari Biotech Units Announce Capacity Expansion Plans",
            "Summary": "Rossari Biotech's subsidiaries, Unitop and Tristar, have announced significant capacity expansion plans. Unitop will increase its capacity by 18,500 MTPA in phases until Q4 FY26, with a capital expenditure of ₹77 crore. Tristar will add 3,600 MTPA to its current capacity of 15,000 MTPA, which is currently 90% utilized, investing ₹20 crore in the expansion.",
            "Sentiment": "positive",
            "PublishDate": 1745547897000,
            "Source": "default"
        },
        {
            "Title": "Rossari Biotech Reports Q3 Financial Results",
            "Summary": "Rossari Biotech has announced its Q3 consolidated financial results. The company reported a net profit of 317 million rupees, down from 343 million rupees in the same quarter last year. However, revenue increased to 5.13 billion rupees from 4.63 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737505324000,
            "Source": "earnings"
        },
        {
            "Title": "Rossari Biotech Reports Q3 EBITDA and Margin Results",
            "Summary": "Rossari Biotech announced its Q3 financial results. The company's EBITDA for the quarter was 646 million rupees, compared to 637 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin decreased to 12.60% from 13.73% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737470264000,
            "Source": "earnings"
        },
        {
            "Title": "Rossari Biotech Reports Q3 Financial Results",
            "Summary": "Rossari Biotech has announced its Q3 consolidated financial results. The company reported a net profit of 317 million rupees, compared to 343 million rupees in the same quarter last year. Revenue for Q3 increased to 5.13 billion rupees from 4.63 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737470257000,
            "Source": "earnings"
        },
        {
            "Title": "Rossari Biotech to Acquire 100% Equity Share Capital of Unistar",
            "Summary": "Rossari Biotech has entered into a share purchase agreement with Unistar to acquire 100% of Unistar's equity share capital. This acquisition represents a significant corporate action that will likely impact Rossari Biotech's business structure and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1733898103000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rossari Biotech: Confident of 14% Revenue Growth in FY25 Despite Challenges",
            "Summary": "Rossari Biotech's CFO Ketan Sablok expects 12-14% revenue growth in FY25, driven by a 32% YoY increase in exports in H1 FY24. The company is expanding its export markets beyond Bangladesh to Vietnam, Egypt, North Africa, and Turkey. Domestic market volumes remain sluggish, but Bangladesh exports are expected to recover from December.",
            "Sentiment": "positive",
            "PublishDate": 1729653147000,
            "Source": "normal_news"
        },
        {
            "Title": "Rossari Biotech: New Capacities to Drive Volume Growth in FY26",
            "Summary": "Nirmal Bang's Q2 results review for Rossari Biotech indicates that new production capacities are expected to boost volume growth for the company in fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1729571897000,
            "Source": "result"
        },
        {
            "Title": "Rossari Biotech: Q2 Profit Up 7%, Subsidiary to Acquire Thai Company",
            "Summary": "Rossari Biotech reported a 7.3% YoY increase in Q2 net profit to ₹35.3 crore. Revenue rose 1.8% to ₹498.3 crore. The company's subsidiary, Rossari Global DMCC, agreed to acquire 100% of Unistar Thai Co Ltd. Two new board appointments were announced.",
            "Sentiment": "positive",
            "PublishDate": 1729342528000,
            "Source": "result"
        },
        {
            "Title": "Rossari Biotech Approves Additional Investment for Capacity Expansion",
            "Summary": "Rossari Biotech has approved an additional investment of ₹18.25 crore for its unit's capacity expansion. This will increase the ethoxylation capacity from 36,000 MTPA to 66,000 MTPA by the first half of FY26. The total investment for this expansion now stands at ₹146.25 crore.",
            "Sentiment": "positive",
            "PublishDate": 1729216518000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rossari Biotech Schedules Q2 Results Board Meeting",
            "Summary": "<p><span class='neutral'>Rossari Biotech</span> has announced that its <span class='neutral'>board of directors</span> will meet on <b>October 19</b> to consider and approve the company's <span class='neutral'>financial results</span> for the <span class='neutral'>second quarter</span> of the fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728652294000,
            "Source": "result"
        },
        {
            "Title": "Rossari Biotech Subsidiary Establishes Unit in Dubai for Export Expansion",
            "Summary": "<p><span class='positive'>Rossari Biotech's</span> subsidiary has <span class='positive'>incorporated</span> a <b>new unit</b> in the <span class='neutral'>Jebel Ali Free Zone (JAFZA)</span> in <span class='neutral'>Dubai</span>, with an initial capital of <span class='neutral'>AED 100,000</span>. This <span class='positive'>strategic move</span> aims to <span class='positive'>expand</span> the company's presence in <span class='positive'>export markets</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728438989000,
            "Source": "corporate_action"
        }
    ]
}