{
    "Symbol": "ROTO",
    "ISIN": "INE535D01037",
    "News": [
        {
            "Title": "Roto Pumps Q3FY26 Results: Revenue Up 0.48%",
            "Summary": "Roto Pumps reported Q3FY26 standalone revenue of ₹5,779.20 lakhs vs ₹5,751.53 lakhs YoY. Net profit surged 77.02% to ₹632.70 lakhs. EPS increased to ₹0.34 from ₹0.19.",
            "Sentiment": "positive",
            "PublishDate": 1770782943216,
            "Source": "co_actions_results"
        },
        {
            "Title": "Roto Pumps receives warning letters from BSE, NSE",
            "Summary": "Roto Pumps Ltd received warning letters from BSE and NSE on January 6, 2026, for exceeding the prescribed 210-day gap between Risk Management Committee meetings by 2 days. Company states no material impact.",
            "Sentiment": "negative",
            "PublishDate": 1767781280015,
            "Source": "stocks"
        },
        {
            "Title": "CRISIL Reaffirms Roto Pumps A-/Stable Rating",
            "Summary": "CRISIL reaffirmed Roto Pumps Limited's long-term rating at A-/Stable and short-term rating at A2+ for bank facilities worth ₹52.50 crores on December 29, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767360654689,
            "Source": "stocks"
        },
        {
            "Title": "Roto Pumps Wins Export Excellence Award for FY22-23",
            "Summary": "Roto Pumps Ltd receives Star Performer Export Excellence Award from EEPC India for outstanding performance in pumps segment during financial years 2021-22 and 2022-23.",
            "Sentiment": "positive",
            "PublishDate": 1766578805159,
            "Source": "stocks"
        },
        {
            "Title": "Roto Pumps Promoter Group Member Acquires Additional 4,649 Equity Shares",
            "Summary": "Gopika Gupta, a promoter group shareholder of Roto Pumps Limited, acquired 4,649 equity shares of Rs. 1 each through open market purchase on December 3, 2025. The acquisition maintains the promoter group's total shareholding at 66.78% of the company's equity share capital of Rs. 18,84,45,660.",
            "Sentiment": "neutral",
            "PublishDate": 1765015505132,
            "Source": "corporate_action"
        },
        {
            "Title": "Roto Pumps Promoter Gopika Gupta Acquires Additional 54,332 Equity Shares",
            "Summary": "Gopika Gupta, a promoter group shareholder of Roto Pumps Limited, acquired 54,332 equity shares through open market transactions on December 1-2, 2025. The acquisition increased the total promoter group holding from 66.75% to 66.78% of the company's equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764824809022,
            "Source": "corporate_action"
        },
        {
            "Title": "Roto Pumps Promoters Acquire Additional 1.01 Lakh Shares Through Open Market",
            "Summary": "Harish Chandra Gupta and associated promoter group members acquired 1,01,194 equity shares of Roto Pumps Limited through open market purchases between November 25-27, 2025. The acquisition increased the collective promoter group holding from 66.66% to 66.71% of the company's total share capital.",
            "Sentiment": "positive",
            "PublishDate": 1764318443995,
            "Source": "corporate_action"
        },
        {
            "Title": "Roto Pumps Reports 65% Drop in Q2 Net Profit to ₹361 Crores Despite Revenue Growth",
            "Summary": "Roto Pumps Limited reported standalone net profit of ₹361.39 crores for Q2 FY2026, down 65% from ₹1,037.97 crores in the previous quarter. Revenue from operations declined to ₹4,875.30 crores from ₹5,162.79 crores. For the half-year period, net profit reached ₹1,077.28 crores on revenue of ₹10,038.09 crores. On consolidated basis, Q2 net profit was ₹595.81 crores with revenue of ₹6,476.37 crores. The company allotted bonus shares in 2:1 ratio in July 2025. The Board also appointed Mahesh Bhupal Kinikar as General Manager-Sales Service and approved a USD 2 million standby letter of credit for subsidiary Roto Pumps MENA FZE.",
            "Sentiment": "negative",
            "PublishDate": 1762995038631,
            "Source": "earnings"
        },
        {
            "Title": "Roto Pumps Reports Decline in Q2 Financial Performance",
            "Summary": "Roto Pumps reported quarterly results showing a decline across key financial metrics. Revenue fell to 648 million rupees compared to 846 million rupees in the same period last year. Net profit dropped to 60 million rupees from 114 million rupees year-over-year. EBITDA decreased to 117 million rupees from 194 million rupees, while EBITDA margin compressed to 18.04% from 22.94% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762963156128,
            "Source": "earnings"
        },
        {
            "Title": "Company Secures ₹7.25 Crore Order from GPS Renewables for Progressive Cavity Pumps",
            "Summary": "The company received a major sales order worth ₹7.25 crores from GPS Renewables Private Limited for designing, engineering, and supplying Progressive Cavity Pumps along with supervision support. The domestic order is to be completed during the current financial year. The promoter group has no interest in the entity awarding the order, and the contract does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758031718268,
            "Source": "order&deals"
        },
        {
            "Title": "Roto Pumps Reports Q1 FY2026 Results; Board Approves Strategic Investments and Key Appointments",
            "Summary": "Roto Pumps Ltd announced its unaudited financial results for Q1 ended June 30, 2025. On standalone basis, the company reported revenue from operations of Rs. 5,162.79 lakhs and net profit after tax of Rs. 556.77 lakhs. On consolidated basis, revenue from operations was Rs. 8,305.05 lakhs with net profit after tax of Rs. 629.67 lakhs. The Board approved investment up to Rs. 10 crore in wholly owned subsidiary Roto Energy Systems Limited on need basis. The company acquired 25% additional stake in step-down subsidiary Roto Pumps Africa Pty Ltd, making it 100% subsidiary of Roto Overseas Pte Ltd. Key appointments include Richard Stirch as General Manager-UK and Brad Adams as General Manager-Australia. The Board also re-appointed cost auditors and appointed new secretarial auditors. The company's 50th Annual General Meeting is scheduled for September 29, 2025. The auditors highlighted a fraud matter in the African subsidiary involving approximately Rs. 600 lakhs, with management expecting recovery from involved parties.",
            "Sentiment": "neutral",
            "PublishDate": 1755187424633,
            "Source": "earnings"
        },
        {
            "Title": "Roto Pumps Reports 14% Growth in Net Profit and Revenue in Q1 Results",
            "Summary": "Roto Pumps delivered strong quarterly performance with consolidated net profit rising to 63 million rupees from 55 million rupees year-over-year. Revenue increased to 659 million rupees compared to 576 million rupees in the same period last year. EBITDA grew to 136 million rupees from 121 million rupees year-over-year, though EBITDA margin slightly declined to 20.63% from 20.92% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755185015755,
            "Source": "earnings"
        },
        {
            "Title": "Company Reports Rs 6 Crore Embezzlement by Step-Down Subsidiary Director, Orders Forensic Investigation",
            "Summary": "A company disclosed that funds worth Rs 6 crore were embezzled through account manipulation by Mr. Ravin Munsook Sewnarain, director of step-down subsidiary Roto Pumps Africa Pty Ltd, in collusion with a supplier. The embezzlement occurred over a period of time and was detected on May 22, 2025. Following an internal investigation, a South African Attorney recommended legal action. The Audit Committee has now advised conducting a forensic investigation. A settlement agreement for recovery of the embezzled money is under execution between the subsidiary and the director, while legal action against the supplier is also being pursued.",
            "Sentiment": "negative",
            "PublishDate": 1755184482915,
            "Source": "corporate_governance"
        },
        {
            "Title": "Embezzlement Detected at Roto Pumps Subsidiary",
            "Summary": "Roto Pumps has reported an embezzlement of funds by a director of its step-down subsidiary. The estimated amount involved in the embezzlement is between 20 to 25 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1748010156000,
            "Source": "default"
        },
        {
            "Title": "MPS Reports Q4 Financial Results and Dividend Announcement",
            "Summary": "MPS has reported its Q4 consolidated net profit at 471 million rupees, compared to 287.1 million rupees year-over-year and 407 million rupees quarter-over-quarter. The company's Q4 revenue stood at 1.8 billion rupees, up from 1.49 billion rupees in the same quarter last year. Additionally, MPS has recommended a dividend of 50 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747613595000,
            "Source": "default"
        },
        {
            "Title": "Roto Pumps Approves Bonus Issue and Reports Q4 Results",
            "Summary": "Roto Pumps has approved a bonus issue in the ratio of 2:1. The company reported its Q4 results with an EBITDA of 207 million rupees compared to 210 million rupees year-over-year. The EBITDA margin was 24.95% versus 25.64% in the same period last year. Consolidated net profit for Q4 stood at 124 million rupees, down from 126.4 million rupees year-over-year. Revenue increased to 831 million rupees from 819.3 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1747494407000,
            "Source": "result"
        },
        {
            "Title": "Roto Pumps Ltd: Launches New Compact Pump Range, Targets $100M Revenue by 2028",
            "Summary": "Roto Pumps Ltd unveiled a new line of compact pumps called P Range and expanded manufacturing infrastructure. The company aims to achieve $100 million in revenue by 2028. The new pumps are designed for durability and high performance across various sectors. Roto Pumps plans to expand globally and increase its international market share.",
            "Sentiment": "positive",
            "PublishDate": 1744882295000,
            "Source": "corporate_action"
        },
        {
            "Title": "Roto Pumps Unveils New Manufacturing Infrastructure and Compact Pump Range",
            "Summary": "Roto Pumps has announced the introduction of advanced manufacturing infrastructure and a new 'P' range of compact pumps. These initiatives are part of the company's strategy to achieve a revenue milestone of $100 million by 2028. The new infrastructure and product line are expected to enhance the company's production capabilities and market offerings, positioning it for significant growth in the coming years.",
            "Sentiment": "positive",
            "PublishDate": 1744848307000,
            "Source": "default"
        }
    ]
}