{
    "Symbol": "ROUTE",
    "ISIN": "INE450U01017",
    "News": [
        {
            "Title": "Route Mobile Q3FY26 Results Presentation Scheduled",
            "Summary": "Route Mobile announces investor presentation for February 10, 2026 to discuss Q3FY26 and 9M FY26 unaudited financial results. Company reports revenue decline but margin expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1770658469519,
            "Source": "co_actions_results"
        },
        {
            "Title": "Route Mobile Q3FY26 Results: Profit Rises 20% YoY",
            "Summary": "Route Mobile reported consolidated net profit of ₹102.56 crores for Q3FY26, up 20% YoY. Revenue declined 6.5% to ₹1,107.06 crores. Board declared third interim dividend of ₹3 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770656772314,
            "Source": "co_actions_results"
        },
        {
            "Title": "Route Mobile de-registers Zambian subsidiary",
            "Summary": "Route Mobile Limited announces voluntary de-registration of step-down subsidiary Route SMS Solutions Zambia Limited effective January 6, 2026. The subsidiary had no business operations since incorporation.",
            "Sentiment": "neutral",
            "PublishDate": 1769702193011,
            "Source": "stocks"
        },
        {
            "Title": "Route Mobile Q3FY26 earnings call on Feb 10, 2026",
            "Summary": "Route Mobile schedules board meeting on Feb 9, 2026 to approve Q3FY26 results, followed by earnings call on Feb 10. Company may declare third interim dividend with record date Feb 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769697452465,
            "Source": "co_actions_results"
        },
        {
            "Title": "Route Mobile Appoints New Chairman Seckin Arikan",
            "Summary": "Route Mobile announces leadership transition with Seckin Arikan joining as Non-Executive Director and Chairman, while Mark James Reid steps down from both positions effective January 22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769148478155,
            "Source": "stocks"
        },
        {
            "Title": "Route Mobile rescinded Dec 18 ESOP resolution, approved fresh allotment",
            "Summary": "Route Mobile Limited rescinded its December 18, 2025 ESOP resolution and approved fresh allotment of 5,500 equity shares under ESOP 2017 plan effective December 24, 2025, increasing paid-up capital to ₹63,00,30,820.",
            "Sentiment": "neutral",
            "PublishDate": 1766072055266,
            "Source": "co_actions_results"
        },
        {
            "Title": "Route Mobile Board Member Mark Reid to Leave Proximus",
            "Summary": "Mark James Reid will depart Proximus Group by January 2026 while continuing his Route Mobile board position, as he pursues new career opportunities in the UK.",
            "Sentiment": "neutral",
            "PublishDate": 1765956076692,
            "Source": "stocks"
        },
        {
            "Title": "Route Mobile Subsidiary Receives Partial Arbitration Award from Singapore International Arbitration Centre",
            "Summary": "Routesms Solutions FZE, a wholly owned subsidiary of Route Mobile Limited, received a partial arbitration award from Singapore International Arbitration Centre regarding disputes with Atom Myanmar Limited under an A2P SMS services agreement. The award addressed preliminary issues including contractual provisions on committed traffic volumes and refund obligations, with no incremental financial impact as the company had already written off related net advances in its September 2025 quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1763709698228,
            "Source": "stock"
        },
        {
            "Title": "Route Mobile Reports 6.5% Sequential Revenue Growth and Margin Expansion in Q2",
            "Summary": "Route Mobile Limited reported revenue from operations of INR 1,119.4 crores for the quarter ended September 30, 2025, representing a 0.5% year-on-year increase and 6.5% sequential growth. The company achieved gross profit margin expansion to 22.1%, up 70 basis points sequentially and 100 basis points year-on-year. EBITDA grew 16% sequentially from INR 115 crores to INR 133 crores, with EBITDA margin improving to 11.9%. New product revenue showed strong 13.1% sequential growth, driven by omnichannel and integrated solutions platform adoption. The company secured new customers in mobility and transportation sectors, including train/metro segments and bus booking in Bangladesh. Route Mobile expanded partnerships with TechMahindra and integrated firewall platforms with Claro networks. The quarter included exceptional items related to vendor advance write-offs that impacted reported profit after tax. Management emphasized strategic focus on profitable growth over volume, with separate dedicated teams for telco and enterprise business segments. The company maintains around 85% transactional SMS traffic versus 15% promotional traffic mix.",
            "Sentiment": "positive",
            "PublishDate": 1762769011329,
            "Source": "earnings"
        },
        {
            "Title": "Route Mobile Reports Complete Utilization of IPO Proceeds for Debt Repayment and Acquisitions",
            "Summary": "Route Mobile Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing INR 1,580.91 million utilized from its INR 2,400 million IPO proceeds. The company has fully utilized funds for debt repayment (INR 365 million) and acquisitions/strategic initiatives (INR 830 million). Debt repayment included clearing loans from HDFC Bank (INR 65 million) and Kotak Bank (INR 300 million). Strategic acquisitions encompassed TeleDNA Communications, 365squared Ltd, Sarv Webs Private Limited, and Mr. Messaging FZE. The remaining INR 650 million allocated for Mumbai office premises purchase remains unutilized and is deployed in fixed deposits with various banks earning returns between 3.25% to 6.70%. Axis Bank Limited serves as the monitoring agency and reported no deviation from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762454434370,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile Declares Second Interim Dividend of ₹3 Per Share for FY2025-26",
            "Summary": "Route Mobile's Board of Directors declared a second interim dividend of ₹3 per equity share (30%) with a nominal value of ₹10 each for FY2025-26. The dividend will be paid to shareholders whose names appear in the register as of the record date of November 10, 2025, with payment scheduled on or before November 25, 2025. The company has communicated tax deduction procedures to shareholders, noting that dividends are taxable in shareholders' hands as per revised Income Tax Act provisions. Tax deduction at source (TDS) will apply at applicable rates, with no withholding tax for resident individual shareholders if aggregate dividend during FY2025-26 is less than ₹10,000 per annum. The company provided detailed guidelines for both resident and non-resident shareholders regarding required documentation for tax exemptions and lower TDS rates.",
            "Sentiment": "positive",
            "PublishDate": 1762281853725,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile Reports Net Loss Due to Exceptional Write-offs, Shares Decline",
            "Summary": "Route Mobile reported a net loss of ₹21 crore in the September quarter, compared to a net profit in the same period last year. The loss was primarily driven by an exceptional loss of ₹135.9 crore from write-offs of advances to two vendors - a mobile network operator and an SMS aggregator. Excluding the exceptional item, the company's profit would have increased 70% sequentially but declined 0.4% year-over-year. Revenue grew 6.5% quarter-over-quarter and 0.5% year-over-year. Gross profit margin improved to 22.1% from 21.4% in the previous quarter. The stock fell 1.8% to ₹710.6 and has declined 10% over the past month.",
            "Sentiment": "negative",
            "PublishDate": 1762228583298,
            "Source": "earnings"
        },
        {
            "Title": "Route Mobile Reports 0.5% Revenue Growth and 15.5% EBITDA Jump in Q2 FY25-26",
            "Summary": "Route Mobile Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported revenue of ₹11,340 million for Q2 FY25-26, representing a 0.5% year-on-year increase and 6.5% quarter-on-quarter growth. Revenue for the last twelve months ended September 30, 2025 reached ₹45,290 million. Adjusted EBITDA grew 15.5% quarter-on-quarter and 0.7% year-on-year, with EBITDA for the last twelve months at ₹5,024 million. The company processed 4.4 billion billable transactions in H1 FY25-26. Gross profit margin expanded to 22.1% in Q2 FY25-26 from 21.4% in Q1 FY25-26. New generation product revenues grew 13% quarter-on-quarter. The company reported cash and cash equivalents of ₹10,470 million as of September 30, 2025, with an 82% cash flow to EBITDA conversion ratio in H1 FY25-26. The board recommended an interim dividend of ₹3 per share. Route Mobile operates across 20 locations globally with 280 direct mobile network operator connections and serves 2,500 active billable clients.",
            "Sentiment": "positive",
            "PublishDate": 1762198793402,
            "Source": "earnings"
        },
        {
            "Title": "Route Mobile Schedules Q2 FY26 Results Announcement and Earnings Call",
            "Summary": "Route Mobile Limited will announce its Q2 FY26 results on November 3, 2025, followed by an earnings conference call on November 4, 2025 at 4:30 PM IST. The call will be hosted by Concept Investor Relations and will feature key management including Managing Director & CEO Rajdipkumar Gupta, Chief Strategy Officer Vinay Binyala, and Group CFO Rajeshwar Singh Gill. The management will discuss quarterly performance and answer participant questions. Results will be sent to stock exchanges and made available on the company's investor website. International dial-in numbers are provided for global participation.",
            "Sentiment": "neutral",
            "PublishDate": 1761658449626,
            "Source": "earnings"
        },
        {
            "Title": "Route Mobile Partners with Kalaam Telecom to Expand WhatsApp Business Services in Middle East",
            "Summary": "Route Mobile, a Proximus Global company, has partnered with Kalaam Telecom to deliver WhatsApp Business services to enterprises across the Middle East. The partnership enables businesses in the Gulf Cooperation Council region to integrate WhatsApp Business service APIs into their operations for enhanced customer engagement. The collaboration combines Route Mobile's cloud communications platform expertise with Kalaam Telecom's regional presence in the Middle East. The partnership was formalized through a Memorandum of Understanding signed at GITEX Global 2025. While initially focused on WhatsApp messaging, the partnership establishes groundwork for expansion into additional communication channels. The Middle East's digital economy is projected to grow four-fold to $780 billion by 2030 according to UBS.",
            "Sentiment": "positive",
            "PublishDate": 1760591307512,
            "Source": "order&deals"
        },
        {
            "Title": "Claro CENAM Partners with Proximus Global for A2P Messaging Services Across Latin America",
            "Summary": "Claro CENAM, a major telecommunications brand in Latin America and subsidiary of América Móvil, has signed an agreement with Proximus Global to support monetization and security of application-to-person (A2P) messaging services across the region. The partnership will utilize Proximus Global's 365squared technology to protect against fraud, spam, and artificially inflated traffic in the A2P messaging market. The Latin American A2P messaging market is projected to reach $5 billion in revenue by 2030. Proximus Global combines the capabilities of BICS, Telesign, and Route Mobile, reaching over 5 billion subscribers. Route Mobile Limited disclosed this information as Proximus Global is its promoter company.",
            "Sentiment": "positive",
            "PublishDate": 1757423616177,
            "Source": "stock"
        },
        {
            "Title": "Route Mobile Sets Record Date for ₹2 Per Share Final Dividend for FY 2024-25",
            "Summary": "Route Mobile Limited has set August 28, 2025 as the record date for determining shareholder eligibility for a final dividend of ₹2 per equity share for FY 2024-25. The dividend represents 20% of the face value of ₹10 per equity share and is subject to approval at the upcoming Annual General Meeting. If approved by shareholders, the dividend payment will be made within 30 days from the approval date. The company trades on BSE with scrip code 543228 and on NSE with symbol ROUTE.",
            "Sentiment": "positive",
            "PublishDate": 1755610936466,
            "Source": "corporate_action"
        },
        {
            "Title": "Proximus Global Achieves 'Visionary' Status in Gartner Magic Quadrant for CPaaS",
            "Summary": "Proximus Global, formed by combining BICS, Telesign, and Route Mobile on January 1, 2025, has achieved 'Visionary' status in Gartner's Magic Quadrant for Communications Platform as a Service (CPaaS). This marks the company's debut in the Magic Quadrant as a newly formed entity. Gartner defines 'Visionaries' as businesses that understand market direction and actively shape its future. The recognition highlights Proximus Global's unified go-to-market strategy, focus on security and fraud prevention, and global network scale. The company is expanding global RCS coverage for interactive messaging and enhancing its CPaaS stack with Network APIs for location services, Quality of Service, and device information. Route Mobile Limited disclosed this information as its promoter company Proximus Global S.A./N.V. issued the press release.",
            "Sentiment": "positive",
            "PublishDate": 1753440738227,
            "Source": "stock"
        },
        {
            "Title": "Route Mobile Reports Revenue Decline in Q1 FY26 Despite Margin Improvements",
            "Summary": "Route Mobile Limited reported quarterly results showing revenue from operations of INR 10,508 million, down 4.8% year-on-year. The company processed 39.3 billion billable transactions with an average realization of 27 paisa per transaction. Despite revenue headwinds, gross profit margin improved to 21.4% from 19.3% in the previous quarter, while adjusted EBITDA margin increased to 11% from 10.2% sequentially. The company lost a large digital native enterprise customer who moved to direct sourcing from mobile network operators. Rajdipkumar Gupta returned as CEO, replacing Gautam Badalia, with focus on growth, cost optimization, and synergies with Proximus Global. The company onboarded several marquee customers through its omnichannel platform and secured a large firewall deal in Latin America. New product revenue growth slowed to low double digits, partly due to WhatsApp pricing revisions. The company added 26 new employees while 63 employees left during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753438865501,
            "Source": "earnings"
        },
        {
            "Title": "Route Mobile Shareholders Approve Jan Van Acoleyen's Appointment as Non-Executive Director",
            "Summary": "Route Mobile Limited conducted a postal ballot through remote e-voting to seek shareholder approval for appointing Jan Van Acoleyen as a Non-Executive Non-Independent Director. The voting period ran from May 29 to June 27, 2025, with results declared on June 27, 2025. Van Acoleyen was initially appointed as an additional director by the board on April 16, 2025. The resolution received overwhelming support with 99.96% of votes cast in favor (54,337,251 votes) and only 0.04% against (23,232 votes). Total voter turnout was 86.29% of outstanding shares. The appointment is effective from April 16, 2025, with Van Acoleyen liable to retire by rotation. Managing Director Rajdipkumar Gupta declared the results, and the resolution was deemed passed by members on June 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753278870170,
            "Source": "corporate_action"
        },
        {
            "Title": "Gautam Badalia Resigns as CEO and Chief Investor Relations Officer of Route Mobile Limited",
            "Summary": "Gautam Badalia has resigned from his positions as Chief Executive Officer, Chief Investor Relations Officer, and Key Managerial Personnel of Route Mobile Limited, effective July 17, 2025, to pursue other career opportunities. The Board approved his resignation with immediate effect during their meeting on July 17, 2025. Badalia had been with the company for over 8 years and expressed confidence that Route Mobile will continue to thrive. He committed to ensuring a smooth transition and thanked the Board, employees, shareholders and stakeholders for their support during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1753160742690,
            "Source": "corporate_governance"
        },
        {
            "Title": "Route Mobile: Q1 Results Show Revenue Decline and Leadership Change",
            "Summary": "Route Mobile reported a 10.6% sequential and 4.8% YoY revenue decline to ₹1,050.8 crore in Q1. EBITDA margin dropped to 8.9%, and PAT fell 6% QoQ and 32% YoY. CEO Gautam Badalia resigned, with Rajdipkumar Gupta taking over as MD and CEO from July 18, 2025. The company is focusing on cost optimization and AI automation amid global uncertainties.",
            "Sentiment": "negative",
            "PublishDate": 1752805855000,
            "Source": "result"
        },
        {
            "Title": "Route Mobile Reports Q1 EBITDA Decline",
            "Summary": "Route Mobile's Q1 EBITDA decreased to 940 million rupees from 1.23 billion rupees year-over-year. The company's Q1 EBITDA margin also fell to 8.97% from 11.15% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1752803649000,
            "Source": "default"
        },
        {
            "Title": "Route Mobile Reports Q1 Financial Results",
            "Summary": "Route Mobile has announced its Q1 financial results. The company's consolidated net profit for the quarter was 532 million rupees, down from 785 million rupees in the same quarter last year. Revenue for Q1 was 10.5 billion rupees, compared to 11 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1752803476000,
            "Source": "default"
        },
        {
            "Title": "Route Mobile Delays Providing Specific Guidance Amid Cost Optimization and Integration Efforts",
            "Summary": "Route Mobile has decided against providing specific financial guidance for the near future, including 2025-2026. The company is focusing on cost optimization and integration efforts with Proximus, aiming to realize cross-sell synergies. Management cites global uncertainties surrounding traffic regimes that could impact enterprise and OTT communication spending as a reason for withholding guidance. The company maintains its commitment to distributing 20% of annualized profits and plans to provide more information after completing their summer review.",
            "Sentiment": "neutral",
            "PublishDate": 1746761934000,
            "Source": "default"
        },
        {
            "Title": "Route Mobile Reports Q4 Financial Results",
            "Summary": "Route Mobile announced its Q4 financial results. EBITDA decreased to 1.22B rupees from 1.25B year-over-year, with EBITDA margin falling to 10.38% from 12.33%. Revenue increased to 11.75B rupees from 10.17B. The company reported an exceptional item of 247M, and consolidated profit before tax (PBT) slightly decreased to 1.04B rupees from 1.08B year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746671643000,
            "Source": "result"
        },
        {
            "Title": "Route Mobile to Consider Q4 Results on May 7",
            "Summary": "Route Mobile has announced that it will consider its fourth quarter financial results on May 7. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745582189000,
            "Source": "default"
        },
        {
            "Title": "Proximus Global Launches AI-Powered SMS Spam Protection Solution",
            "Summary": "Proximus Global, a subsidiary of Route Mobile, has introduced a new AI-powered SMS spam and fraud protection solution called 365Guard. This innovative system is designed to safeguard consumers by blocking millions of unwanted messages on a daily basis, enhancing mobile communication security.",
            "Sentiment": "positive",
            "PublishDate": 1744122270000,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile: Shares Surge on Parent's Nokia Partnership",
            "Summary": "Route Mobile's stock rose 12% after parent Proximus Global partnered with Nokia for network API solutions. The collaboration aims to enhance developer access to advanced network capabilities and foster innovation in enterprise communications.",
            "Sentiment": "positive",
            "PublishDate": 1741236775000,
            "Source": "normal_news"
        },
        {
            "Title": "Route Mobile: Share Price Surges 11% on Nokia Partnership",
            "Summary": "Route Mobile's stock price increased by over 11% following the announcement of a partnership with Nokia and Proximus Global to offer network APIs for enterprise application development.",
            "Sentiment": "positive",
            "PublishDate": 1741234470000,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile's Proximus Global and Nokia Partner for Network API Development",
            "Summary": "Route Mobile's subsidiary Proximus Global has partnered with Nokia to offer network APIs, enabling developers to create enterprise applications. This collaboration aims to facilitate the development of innovative solutions for businesses by providing access to network capabilities through APIs.",
            "Sentiment": "positive",
            "PublishDate": 1741183051000,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile Reports Q3 Revenue Growth",
            "Summary": "Route Mobile has announced its financial results for the third quarter, reporting revenue of 11.84 billion rupees, compared to 10.24 billion rupees in the same period last year. This represents a year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738050605000,
            "Source": "earnings"
        },
        {
            "Title": "Route Mobile Reports Q3 EBITDA and Margin Results",
            "Summary": "Route Mobile has announced its Q3 financial results. The company's EBITDA for the quarter stands at 1.29 billion rupees, compared to 1.26 billion rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin has decreased from 12.30% to 10.90% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738050587000,
            "Source": "earnings"
        },
        {
            "Title": "Route Mobile Reports Decline in Q3 Consolidated Net Profit",
            "Summary": "Route Mobile, a cloud communication platform provider, has reported a consolidated net profit of 855 million rupees for the third quarter, down from 1.13 billion rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738050565000,
            "Source": "earnings"
        },
        {
            "Title": "Route Mobile to Consider Q3 Results on January 28",
            "Summary": "Route Mobile has announced that it will consider its third quarter financial results on January 28. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737468561000,
            "Source": "result"
        },
        {
            "Title": "Route Mobile Partners with PT MRT Jakarta for WhatsApp Ticketing",
            "Summary": "Route Mobile has formed a partnership with PT MRT Jakarta to introduce an innovative WhatsApp-based ticketing system for vending machines and email. This collaboration marks a first-of-its-kind implementation, potentially revolutionizing public transportation ticketing processes.",
            "Sentiment": "positive",
            "PublishDate": 1736311366000,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile: On Track for $1 Billion Revenue Goal",
            "Summary": "Route Mobile's new management reaffirms the company's target to achieve $1 billion in revenue within three years. The company, now part of Proximus Global, expects stronger performance in H2 FY24 with double-digit growth. CEO Gautam Badalia and MD Rajdip Gupta express confidence in achieving targets through synergies with Proximus Global and upcoming deals.",
            "Sentiment": "positive",
            "PublishDate": 1734845598000,
            "Source": "normal_news"
        },
        {
            "Title": "Route Mobile: Integration with Proximus Group to Boost Efficiency",
            "Summary": "Route Mobile anticipates improved operating efficiency following the integration of Proximus Group.",
            "Sentiment": "positive",
            "PublishDate": 1734518519000,
            "Source": "corporate_action"
        },
        {
            "Title": "Proximus Group Creates Proximus Global to Oversee International Activities",
            "Summary": "Proximus Group is advancing its strategy to become a global digital communications leader by establishing Proximus Global, a new entity that will oversee all of the group's international activities. This move is part of Proximus Group's ongoing efforts to expand its global presence and consolidate its international operations under a single umbrella.",
            "Sentiment": "positive",
            "PublishDate": 1734487903000,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile: Leadership Reshuffle and New Appointments",
            "Summary": "Route Mobile has restructured its leadership team. Rajdipkumar Gupta is re-designated as managing director, stepping down as group CEO. Gautam Badalia is appointed as the new CEO. Milind Pathak becomes chief corporate marketing officer, and Vinay Binyala is named chief strategy officer.",
            "Sentiment": "neutral",
            "PublishDate": 1734451517000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Route Mobile Subsidiary Acquires PT Route Mobile Indonesia",
            "Summary": "A subsidiary of Route Mobile has approved the acquisition of PT Route Mobile Indonesia for IDR 7,507,500,000. The acquired entity operates in the omni-channel and communication services sector.",
            "Sentiment": "positive",
            "PublishDate": 1732282900000,
            "Source": "corporate_action"
        },
        {
            "Title": "L&T Metro Rail Hyderabad Introduces RCS-Based Ticketing with Route Mobile and Billeasy",
            "Summary": "L&T Metro Rail Hyderabad has partnered with Route Mobile and Billeasy to launch new ticketing services. The solution allows commuters to purchase tickets through RCS (Rich Communication Services) chat and use Google Wallet for scanning. This integration aims to enhance the convenience and efficiency of the ticketing process for Hyderabad metro users.",
            "Sentiment": "positive",
            "PublishDate": 1730804836000,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile's Large RFP Not Impacting Near-Term Guidance",
            "Summary": "Route Mobile has announced that a large Request for Proposal (RFP) mentioned in a recent concall update will not affect their net guidance for the second half of the current fiscal year. However, the company expects this RFP to contribute to their financial guidance in the next three to four years.",
            "Sentiment": "neutral",
            "PublishDate": 1729654091000,
            "Source": "normal_news"
        },
        {
            "Title": "Route Mobile Announces Dividend Distribution and Telesign Synergy Plans",
            "Summary": "Route Mobile has provided guidance to distribute up to 20% of its Profit After Tax (PAT) as dividend, which aligns with their current dividend distribution. The company is also working on synergies with Telesign, which is expected to contribute to their organic strategy and guidance.",
            "Sentiment": "positive",
            "PublishDate": 1729654082000,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile On Track to Meet Financial Guidance",
            "Summary": "Route Mobile reports that their current quarter performance indicates they will achieve their projected financial targets. The company's historical seasonality trends show that 45-47% of annual performance typically occurs in the first half of the year, with the remainder in the second half, suggesting they are on course to meet their guidance.",
            "Sentiment": "positive",
            "PublishDate": 1729654076000,
            "Source": "normal_news"
        },
        {
            "Title": "Route Mobile Confident in Meeting Annual Guidance",
            "Summary": "Route Mobile expresses confidence in meeting its annual guidance. The company anticipates a significant increase in revenue and improved margins as the festive season approaches, which is expected to contribute to achieving their financial targets.",
            "Sentiment": "positive",
            "PublishDate": 1729654070000,
            "Source": "normal_news"
        },
        {
            "Title": "Route Mobile Reports Q2 Profit Before Tax of 1.31B Rupees",
            "Summary": "Route Mobile has reported a profit before tax (PBT) of 1.31 billion rupees for the second quarter, compared to 1.04 billion rupees in the same period last year, showing year-over-year growth. The company also reported an exceptional item of 62.8 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729531358000,
            "Source": "result"
        },
        {
            "Title": "Route Mobile Declares First Interim Dividend",
            "Summary": "Route Mobile has announced its first interim dividend of 6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1729531333000,
            "Source": "corporate_action"
        },
        {
            "Title": "Route Mobile Reports Q2 FY2024 Financial Results",
            "Summary": "Route Mobile announced its Q2 financial results. The company's EBITDA increased to 1.35 billion rupees from 1.28 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 12.15% from 12.30% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729531321000,
            "Source": "result"
        },
        {
            "Title": "Route Mobile Reports Q2 Revenue Growth",
            "Summary": "Route Mobile, a cloud communication platform provider, announced its second quarter revenue of 11.13 billion rupees, showing an increase from 10.15 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729531309000,
            "Source": "result"
        }
    ]
}