{
    "Symbol": "RPEL",
    "ISIN": "INE912T01018",
    "News": [
        {
            "Title": "Raghav Productivity Enhancers Q3FY26 Results Published",
            "Summary": "Raghav Productivity Enhancers Limited published its unaudited Q3FY26 financial results in newspapers on January 13, 2026, complying with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768472934628,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raghav Productivity Enhancers Q3 Profit Jumps 44%",
            "Summary": "Raghav Productivity Enhancers reported strong Q3 performance with net profit rising 44% to ₹141 million and revenue growing 17% to ₹645 million year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1768349848921,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raghav Productivity Enhancers Q3FY26 Results",
            "Summary": "Raghav Productivity Enhancers reports strong Q3FY26 performance with consolidated revenue of ₹6,448.74 lakhs and net profit of ₹1,411.85 lakhs. Board approves committee reconstitution.",
            "Sentiment": "positive",
            "PublishDate": 1768314841275,
            "Source": "co_actions_results"
        },
        {
            "Title": "Raghav Productivity Enhancers Sets ₹500-550 Cr Revenue Target by FY27",
            "Summary": "Raghav Productivity Enhancers has announced ambitious growth targets for FY27, aiming to achieve revenue of ₹500-550 crores and a Return on Capital Employed (ROCE) of 20%. The company plans to reach these goals through multiple strategic initiatives including maintaining capacity utilization above 90%, expanding global exports, establishing a NABL-accredited R&D facility, and entering new markets for foundry and semiconductor-grade silica products.",
            "Sentiment": "positive",
            "PublishDate": 1761582370443,
            "Source": "stock"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports Strong Half-Year Performance with 57% Profit Growth",
            "Summary": "Raghav Productivity Enhancers Limited approved its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported standalone profit of Rs 1,571.93 lakhs for the half-year compared to Rs 1,001.82 lakhs in the previous year, representing significant growth. Revenue from operations reached Rs 5,481.30 lakhs for the half-year. The company operates primarily in the 'Ramming Mass' business and has a wholly owned subsidiary, Raghav Productivity Solutions Private Limited. During the period, the company received dividend income of Rs 456.25 lakhs from its subsidiary. The board also confirmed allotment of 6,760 shares under the Employee Stock Option Scheme 2018, which were listed on BSE and NSE in May 2025. The results were reviewed by the audit committee and approved by the board of directors on October 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761561751632,
            "Source": "earnings"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports 50% Revenue Growth to ₹199.65 Crores, Announces 16th AGM",
            "Summary": "Raghav Productivity Enhancers Limited, the world's largest manufacturer of silica ramming mass, reported consolidated revenue growth of 50% to ₹199.65 crores for FY2024-25. The company expanded manufacturing capacity from 288,000 MTPA to 414,000 MTPA and secured a patent for its silica ramming mass manufacturing process. Net profit increased 42% to ₹36.97 crores with exports contributing 46% of revenue across 36+ countries. The company announced its 16th AGM to be held on August 25, 2025, via video conferencing, with a record date of August 14, 2025 for final dividend eligibility. The Board recommended a final dividend of ₹1 per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1753791369011,
            "Source": "corporate_action"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports Strong FY25 Performance with 50% Revenue Growth and Capacity Expansion",
            "Summary": "Raghav Productivity Enhancers Limited, the world's largest manufacturer of silica ramming mass, reported consolidated revenue of ₹199.65 crores for FY25, up 50% from ₹132.77 crores in FY24. Net profit increased 42% to ₹36.97 crores. The company expanded manufacturing capacity from 288,000 MTPA to 414,000 MTPA and secured a patent for its silica ramming mass manufacturing process. Export sales contributed 46% of total revenue at ₹55.94 crores. The company completed a 1:1 bonus share issue and crossed 200,000 MT in annual sales volume. The Board recommended a final dividend of ₹1 per equity share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1753789099705,
            "Source": "corporate_action"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports Strong Q1 Growth with 30% Revenue Increase",
            "Summary": "Raghav Productivity Enhancers delivered strong quarterly results with revenue rising to 584 million rupees from 448 million rupees year-over-year. Consolidated net profit increased to 117 million rupees compared to 83 million rupees in the same period last year. EBITDA grew to 159 million rupees from 123 million rupees year-over-year, though EBITDA margin slightly declined to 27.24% from 27.5%.",
            "Sentiment": "positive",
            "PublishDate": 1753082997394,
            "Source": "earnings"
        },
        {
            "Title": "Raghav Productivity Enhancers Expands Manufacturing Capacity",
            "Summary": "Raghav Productivity Enhancers has installed a third Programmable Logic Controller (PLC) line for manufacturing ramming mass, which is expected to increase the total installed capacity of the plant to 270,000 metric tonnes per annum. The new PLC line is anticipated to contribute an additional 90,000 metric tonnes per annum. The company has also installed Vertical Shaft Impact (VSI) and Ball Mill machines, although the current installed production capacity remains at 144,000 metric tonnes per annum.",
            "Sentiment": "positive",
            "PublishDate": 1746024345000,
            "Source": "default"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports Q4 Results and Dividend",
            "Summary": "Raghav Productivity Enhancers announced its Q4 financial results and dividend. The company recommended a dividend of 1 rupee per equity share. Q4 EBITDA decreased to 77 million rupees from 92 million year-over-year, with EBITDA margin falling to 26.59% from 29.32%. Net profit for Q4 was 56 million rupees, down from 67 million year-over-year but slightly down from 58 million quarter-on-quarter. Revenue for Q4 stood at 288 million rupees, compared to 315 million in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746022366000,
            "Source": "result"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports Strong Q3 Financial Results",
            "Summary": "Raghav Productivity Enhancers has announced its Q3 consolidated financial results. The company's net profit increased to 98 million rupees, up from 60 million rupees year-over-year and 87 million rupees quarter-over-quarter. Revenue also saw significant growth, reaching 550 million rupees compared to 317 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737418889000,
            "Source": "earnings"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports Strong Q3 Financial Results",
            "Summary": "Raghav Productivity Enhancers has announced its Q3 consolidated financial results. The company's net profit increased to 98 million rupees, up from 60 million rupees year-over-year and 87 million rupees quarter-over-quarter. Revenue for Q3 rose to 550 million rupees, compared to 317 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737382823000,
            "Source": "earnings"
        },
        {
            "Title": "Raghav Productivity Enhancers: Ashish Kacholia Likely Exits Small-Cap Multibagger in Q3 FY25",
            "Summary": "Ace investor Ashish Kacholia appears to have exited or significantly reduced his stake in Raghav Productivity Enhancers during Q3 FY25. The company's latest shareholding pattern does not list Kacholia among key shareholders, suggesting his stake has fallen below 1%. This follows a 107% surge in the stock price over the past year. Other notable investors, including Rekha Jhunjhunwala and Mukul Agrawal, continue to hold stakes in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1736237080000,
            "Source": "normal_news"
        },
        {
            "Title": "Raghav Productivity Enhancers Granted Patent for Silica-Based Ramming Mass Production",
            "Summary": "Raghav Productivity Enhancers has been awarded a patent certificate by the Patent Office, Government of India, for their invention titled 'A Method of Production of Silica Based Ramming Mass Containing Alumina for Refractory Lining of an Induction Furnace'. This patent recognizes the company's innovative method in producing a specialized material used in the lining of induction furnaces.",
            "Sentiment": "positive",
            "PublishDate": 1734396740000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raghav Productivity Enhancers Granted Patent for Silica-Based Ramming Mass Production",
            "Summary": "Raghav Productivity Enhancers has been awarded a patent certificate by the Patent Office, Government of India, for their invention titled 'A Method of Production of Silica Based Ramming Mass Containing Alumina for Refractory Lining of an Induction Furnace'. This patent recognizes the company's innovative method in producing specialized materials for industrial furnace lining.",
            "Sentiment": "positive",
            "PublishDate": 1734358493000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raghav Productivity Enhancers: 1:1 Bonus Shares with November 29 Record Date",
            "Summary": "Raghav Productivity Enhancers Limited (RPEL) has set November 29, 2024, as the record date for its 1:1 bonus share issue. Shareholders will receive one bonus equity share for every existing share held. The bonus shares are expected to be credited to the depository system on December 2, 2024, and available for trading from December 3, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1731122619000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports Q2 Financial Results",
            "Summary": "Raghav Productivity Enhancers announced its Q2 financial results. The company's EBITDA increased to 126 million rupees, up from 98 million rupees in the same quarter last year. However, the EBITDA margin decreased to 25.7% from 30.14% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1729238988000,
            "Source": "result"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports Q2 Revenue Growth",
            "Summary": "Raghav Productivity Enhancers has announced its Q2 revenue figures. The company reported revenue of 491 million rupees, compared to 325 million rupees in the same quarter of the previous year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729238942000,
            "Source": "result"
        },
        {
            "Title": "Raghav Productivity Enhancers Reports Q2 Profit Increase",
            "Summary": "Raghav Productivity Enhancers has reported a consolidated net profit of 87 million rupees for the second quarter, compared to 63.4 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729238882000,
            "Source": "result"
        },
        {
            "Title": "Raghav Productivity Approves 1:1 Bonus Share Issue",
            "Summary": "Raghav Productivity has approved the issuance of bonus shares in a ratio of 1:1, meaning shareholders will receive one additional share for each share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1729238833000,
            "Source": "corporate_action"
        },
        {
            "Title": "Raghav Productivity to Consider Q2 Results and Bonus Share Issue",
            "Summary": "<p><span class=\"neutral\">Raghav Productivity</span> has announced that it will <b>consider</b> its <span class=\"neutral\">Q2 financial results</span> and the potential <span class=\"positive\">issuance of bonus shares</span> at a <b>meeting</b> scheduled for <span class=\"neutral\">October 18</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728627332000,
            "Source": "corporate_action"
        }
    ]
}