{
    "Symbol": "RPGLIFE",
    "ISIN": "INE105J01010",
    "News": [
        {
            "Title": "RPG Life Sciences Reports Strong API Performance",
            "Summary": "RPG Life Sciences indicates robust January performance for API segment with strong domestic portfolio showing positive momentum according to CNBC-TV18 coverage.",
            "Sentiment": "positive",
            "PublishDate": 1769581743282,
            "Source": "stocks"
        },
        {
            "Title": "RPG Life Sciences Q3 Results Show Mixed Performance",
            "Summary": "RPG Life Sciences reported Q3 net profit of ₹221 million, down from ₹350 million YoY, while revenue increased to ₹1.8 billion from ₹1.72 billion in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1769524518132,
            "Source": "co_actions_results"
        },
        {
            "Title": "RPG Life Sciences Receives ₹1.08 Cr GST Demand Order",
            "Summary": "RPG Life Sciences received GST order from Maharashtra State Tax Officer demanding ₹1.08 crores for tax period April 2021 to March 2022. Company plans to contest the demand through legal remedies.",
            "Sentiment": "negative",
            "PublishDate": 1767007553178,
            "Source": "stocks"
        },
        {
            "Title": "RPG Life Sciences Completes API Subsidiary Formation",
            "Summary": "RPG Life Sciences successfully incorporates RPG Active Pharma Limited on December 24, 2025, completing the subsidiary formation process announced earlier for its API business operations.",
            "Sentiment": "positive",
            "PublishDate": 1765792911018,
            "Source": "stocks"
        },
        {
            "Title": "RPG Life Sciences Receives GST Demand Order Worth Rs 2.05 Crore from Gujarat Authority",
            "Summary": "RPG Life Sciences received a GST order from the Deputy Commissioner, Gujarat, demanding Rs 2.05 crore including tax, interest and penalty for the period April 2021 to March 2022. The company plans to contest the demand through legal remedies and does not foresee any material financial impact from this order.",
            "Sentiment": "negative",
            "PublishDate": 1764308952000,
            "Source": "stock"
        },
        {
            "Title": "RPG Life Sciences Plans Growth Through New Molecules, U.S. Market Entry, and API Capacity Expansion",
            "Summary": "RPG Life Sciences is positioning itself for sustained growth through multiple strategic initiatives. The company is launching new molecules and preparing to enter the U.S. market. Additionally, RPG Life Sciences plans to double its API (Active Pharmaceutical Ingredient) capacity as part of efforts to strengthen its global pharmaceutical presence.",
            "Sentiment": "positive",
            "PublishDate": 1760718507768,
            "Source": "stock"
        },
        {
            "Title": "RPG Life Reports 13.5% Growth in Domestic Formulations, Outpacing Market Average",
            "Summary": "RPG Life achieved 13.5% growth in domestic formulations during H1 FY26, significantly outperforming the Indian pharmaceutical market's 7.4% growth rate for the same period. The company's domestic formulations business demonstrated strong performance compared to the broader industry benchmark.",
            "Sentiment": "positive",
            "PublishDate": 1760717675795,
            "Source": "stock"
        },
        {
            "Title": "RPG Life Sciences Reports Q2 Results and CFO Resignation",
            "Summary": "RPG Life Sciences announced its unaudited financial results for the quarter and six months ended September 30, 2025. The company reported revenue from operations of Rs. 18,168 lakhs for the quarter, with profit for the period at Rs. 3,685 lakhs. Earnings per share stood at Rs. 22.28. The company also announced the resignation of Chief Financial Officer Vishal Shah, effective October 23, 2025, citing personal reasons. Shah expressed gratitude for his tenure and the company's transformation journey. RPG Life Sciences is in the process of identifying a suitable replacement for the CFO position. The results include exceptional items of Rs. 1,122 lakhs related to insurance proceeds from a fire incident that occurred at one of the company's manufacturing blocks in January 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760704256005,
            "Source": "earnings"
        },
        {
            "Title": "RPG Life Sciences Targets ₹500 Crore OTC Market with ₹200 Crore Investment in Immunosuppressants",
            "Summary": "RPG Life Sciences has announced its strategic plans to target the ₹500 crore over-the-counter (OTC) pharmaceutical market. The company plans to invest ₹200 crore specifically in immunosuppressant drugs. Additionally, RPG Life Sciences is focusing on global generics as part of its long-term growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1753458399323,
            "Source": "stock"
        },
        {
            "Title": "RPG Life Focuses on Expanding International Formulations and API Business",
            "Summary": "RPG Life's co-executive has confirmed the company's strategic focus on strengthening its international formulations and API (Active Pharmaceutical Ingredient) business. The expansion strategy involves attracting new clients, entering new markets, and introducing new molecules to provide broader treatment options.",
            "Sentiment": "positive",
            "PublishDate": 1753455781861,
            "Source": "stock"
        },
        {
            "Title": "RPG Life Sciences Appoints New API Business Chief, Reports Q1 Results",
            "Summary": "RPG Life Sciences appointed Deepak Shukla as Chief Executive - API Business effective July 28, 2025. Shukla brings 25 years of experience from companies including UPL Group, Teva Group, and Dr. Reddy's Laboratories. The company reported quarterly results for the period ended June 30, 2025, showing revenue from operations of ₹168.9 crores compared to ₹165.4 crores in the same quarter last year. EBITDA margin decreased to 24.1% from 25.1%, while PAT margin improved to 21.0% from 21.8%. The domestic formulations segment contributed 69% to total sales with 9.5% growth, while the API segment contributed 12% but declined 22.4% due to a fire incident in one manufacturing block. International formulations contributed 19% with a 2.7% decline. The Board also approved revisions to the policy for determination of materiality of events.",
            "Sentiment": "neutral",
            "PublishDate": 1753455300623,
            "Source": "corporate_governance"
        },
        {
            "Title": "RPG Life Sciences Reports 2.1% Revenue Growth and 24.1% EBITDA Margin in Q1 FY26",
            "Summary": "RPG Life Sciences Limited announced its quarterly results with revenue from operations increasing 2.1% year-on-year to Rs. 168.9 crores compared to Rs. 165.4 crores in the previous year. The company achieved an EBITDA margin of 24.1% and recorded 18.1% quarter-on-quarter growth. Profit before tax remained largely stable at Rs. 35.4 crores versus Rs. 36.0 crores in the previous year. The company's domestic formulations business showed strong growth, while management indicated plans to accelerate international formulations and API segments through new customer acquisition and market expansion. Managing Director Ashok Nair highlighted the company's focus on strategic execution and mentioned active exploration of inorganic growth opportunities across formulations and APIs. The Board also approved revisions to the policy for determination of materiality of events.",
            "Sentiment": "positive",
            "PublishDate": 1753453581053,
            "Source": "earnings"
        },
        {
            "Title": "RPG Life Sciences Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "RPG Life Sciences reported quarterly results showing revenue growth to 1.7 billion rupees from 1.65 billion rupees year-over-year. However, net profit declined to 263 million rupees from 268 million rupees in the same period last year. EBITDA decreased to 355 million rupees from 391 million rupees year-over-year, while EBITDA margin compressed to 21% from 23.62% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753452491601,
            "Source": "earnings"
        },
        {
            "Title": "RPG Life Sciences Board Approves Quarterly Financial Results and Revises Materiality Policy",
            "Summary": "RPG Life Sciences Limited's Board of Directors held a meeting on July 25, 2025, where they unanimously approved the company's unaudited financial results along with a limited review report from statutory auditors. The board also revised the policy for determination of materiality of events in accordance with amended SEBI listing regulations. The revised policy will be made available on the company's website. The meeting lasted from 3:00 p.m. to 6:00 p.m. The financial results were prepared in compliance with Indian Accounting Standards and SEBI listing requirements, with auditors SRBC & CO LLP providing a clean review opinion stating no material misstatements were found.",
            "Sentiment": "neutral",
            "PublishDate": 1753452406794,
            "Source": "earnings"
        },
        {
            "Title": "RPG Life Sciences: Q4 Profit Soars 786%, Dividend Announced",
            "Summary": "RPG Life Sciences reported a 786% increase in Q4 PAT to ₹117.35 crore. The company also announced a dividend. Share price jumped 12% following the news.",
            "Sentiment": "positive",
            "PublishDate": 1745902285000,
            "Source": "earnings"
        },
        {
            "Title": "RPG Life Sciences Reports Strong Q4 Results, Announces Dividends",
            "Summary": "RPG Life Sciences reported a significant increase in Q4 net profit, rising to 1.17 billion rupees from 132 million rupees year-over-year. Revenue grew to 1.43 billion rupees from 1.27 billion rupees. The company recommended a final dividend of 20 rupees per equity share and an additional special dividend of 4 rupees per share. An exceptional item of 1.1 billion rupees was noted. Q4 profit before tax increased to 250 million rupees from 177.4 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1745885391000,
            "Source": "default"
        },
        {
            "Title": "RPG Life Sciences Reports Strong Q4 Results with Exceptional Item",
            "Summary": "RPG Life Sciences announced its Q4 results, reporting a significant increase in net profit to 1.17B rupees, up from 132M rupees year-over-year. The company's revenue grew to 1.43B rupees from 1.27B rupees, while EBITDA increased to 254.9M rupees with an improved margin of 17.81%. The company also declared a final dividend of 20 rupees per equity share and an additional special dividend of 4 rupees per share. An exceptional item of 1.1B rupees was reported for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745856979000,
            "Source": "result"
        },
        {
            "Title": "RPG Life Sciences Executes Deed of Assignment for Land Transfer in Navi Mumbai",
            "Summary": "RPG Life Sciences has executed a deed of assignment cum sale to transfer surplus vacant leasehold land along with built-up structures located in Navi Mumbai, Maharashtra. This action suggests the company is divesting non-core assets, potentially to optimize its real estate holdings or generate additional capital.",
            "Sentiment": "neutral",
            "PublishDate": 1739504592000,
            "Source": "corporate_action"
        },
        {
            "Title": "RPG Life Sciences Reports Q3 FY24 Financial Results",
            "Summary": "RPG Life Sciences has announced its financial results for the third quarter. The company's net profit increased to 349 million rupees, up from 265 million rupees year-over-year and 42 million rupees quarter-over-quarter. Revenue for Q3 rose to 1.7 billion rupees from 1.54 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737936780000,
            "Source": "earnings"
        },
        {
            "Title": "RPG Life Sciences Reports Improved Q3 EBITDA and Margin",
            "Summary": "RPG Life Sciences has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 379 million rupees to 492 million rupees. Additionally, the EBITDA margin expanded from 24.66% to 28.46%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737731390000,
            "Source": "earnings"
        },
        {
            "Title": "RPG Life Sciences Reports Q3 Financial Results",
            "Summary": "RPG Life Sciences announced its Q3 financial results, showing a year-over-year increase in both net profit and revenue. The company's net profit rose to 349 million rupees, up from 265 million rupees in the same quarter last year. Sequentially, net profit increased from 42 million rupees in the previous quarter. Revenue for Q3 reached 1.7 billion rupees, compared to 1.54 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1737731317000,
            "Source": "earnings"
        },
        {
            "Title": "RPG Life Sciences to Consider Q3 Results on January 24",
            "Summary": "RPG Life Sciences has announced that it will consider its third quarter (Q3) financial results on January 24. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737116475000,
            "Source": "earnings"
        },
        {
            "Title": "RPG Life Sciences Reports Exceptional Items in Q2 FY25 Results",
            "Summary": "RPG Life Sciences has reported exceptional items amounting to 273 million in their second quarter financial results for the fiscal year 2025. This information is part of the company's quarterly financial reporting.",
            "Sentiment": "neutral",
            "PublishDate": 1730984182000,
            "Source": "result"
        },
        {
            "Title": "RPG Life Sciences Reports Improved Q2 EBITDA and Margin",
            "Summary": "RPG Life Sciences announced its Q2 financial results, showing an increase in EBITDA from 373 million rupees to 459 million rupees year-over-year. The company's EBITDA margin also improved, rising from 24.28% to 26.67% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730984129000,
            "Source": "result"
        },
        {
            "Title": "RPG Life Sciences Reports Q2 Financial Results",
            "Summary": "RPG Life Sciences announced its Q2 financial results. The company reported a net profit of 42 million rupees, which is significantly lower compared to 259 million rupees in the same quarter last year (YoY) and 268 million rupees in the previous quarter (QoQ). However, the company's revenue increased to 1.7 billion rupees from 1.54 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730984026000,
            "Source": "result"
        }
    ]
}