{
    "Symbol": "RPOWER",
    "ISIN": "INE614G01033",
    "News": [
        {
            "Title": "SC Reviews SIT Probe Request Against Anil Ambani Group",
            "Summary": "Supreme Court examines petition seeking Special Investigation Team probe into Anil Ambani Group over alleged ₹40,000 crore fund misappropriation under PMLA and FEMA provisions.",
            "Sentiment": "negative",
            "PublishDate": 1770182969572,
            "Source": "stocks"
        },
        {
            "Title": "Reliance Power Submits NCD Security Cover Certificate",
            "Summary": "Reliance Power Limited filed Security Cover Certificate for Rs. 250 crore Non-Convertible Debentures as on December 31, 2025, showing asset coverage ratio of 2.03 on market value basis under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769783585053,
            "Source": "co_actions_results"
        },
        {
            "Title": "Reliance Power Q3 FY26 Results Date Announced",
            "Summary": "Anil Ambani-led Reliance Power announces schedule for Q3 FY26 earnings declaration as part of ongoing earnings season with board meeting planned for next week.",
            "Sentiment": "neutral",
            "PublishDate": 1769266963713,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEBI Initiates Forensic Audit of Reliance Power",
            "Summary": "Reliance Power Limited disclosed that SEBI has initiated a forensic audit of the company in relation to alleged violations of SEBI Act, 1992, SCRA, 1956 and Companies Act, 2013.",
            "Sentiment": "negative",
            "PublishDate": 1768414484727,
            "Source": "stocks"
        },
        {
            "Title": "BSE and NSE Approve Reclassification of Reliance Capital from Reliance Power's Promoter Group",
            "Summary": "BSE and NSE have approved Reliance Power's application to reclassify Reliance Capital Limited from promoter group to public category following IndusInd International Holdings Limited's implementation of a resolution plan under the Insolvency and Bankruptcy Code, 2016. The reclassification affects Reliance Power's shareholding structure and requires the company to ensure compliance with subsequent disclosure requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765208569845,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Power Unveils Strategic Transformation Plan with 4GW Solar and 6.5GWh Battery Storage Pipeline",
            "Summary": "Reliance Power presented its resurgent strategy focusing on clean energy transition with locked-in projects of 4GW solar capacity and 6.5GWh battery storage through subsidiary Reliance Nu Energies. The company reported strengthened financials with zero net debt at standalone level, 8.4% EBITDA growth in H1FY26, and aims to capitalize on India's renewable energy expansion targeting 280GW solar capacity by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1765132758856,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Faces ED Supplementary Prosecution Complaint in SECI Bank Guarantee Matter",
            "Summary": "The Enforcement Directorate has filed a supplementary prosecution complaint against Reliance Power Limited, its subsidiaries Reliance NUBESS Limited and Rosa Power Supply Company Limited, along with other parties in a SECI bank guarantee related matter. The company maintains it acted in good faith as victims of fraud by third parties and has lodged a criminal complaint, with an FIR registered against the alleged perpetrators.",
            "Sentiment": "negative",
            "PublishDate": 1765033432114,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Group Clarifies ED Attachment Order Impact on Infrastructure Operations",
            "Summary": "Anil Ambani's Reliance Group issued clarification regarding an Enforcement Directorate attachment order on Reliance Communications assets. The company stated that the ED order has no material impact on the operations of Reliance Infrastructure.",
            "Sentiment": "neutral",
            "PublishDate": 1763679180101,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Board Approves Creation of New Management Board",
            "Summary": "Reliance Power's board has approved the establishment of a new management board structure. This governance decision affects the company's organizational framework and management operations.",
            "Sentiment": "positive",
            "PublishDate": 1763552953021,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Power Seeks Shareholder Approval for $600 Million FCCB Issuance and Director Appointments",
            "Summary": "Reliance Power has issued a postal ballot notice seeking member approval for three resolutions: appointment of Arup Ashok Gupta as Non-Executive Non-Independent Director, appointment of Zohra Chatterji as Independent Director, and authorization to issue Foreign Currency Convertible Bonds worth up to $600 million. The voting period runs from November 19 to December 18, 2025, with results to be declared by December 22, 2025, as the company aims to raise long-term resources for expansion in renewable energy sector and general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1763488801232,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Group Launches First-Ever ESOP Program for 2,500 Employees Across Infrastructure and Power Units",
            "Summary": "Reliance Group announced its inaugural Employee Stock Ownership Plan covering nearly 2,500 employees across Reliance Infrastructure Limited and Reliance Power Limited. The program allows most employees to exercise options at face value of ₹10 per share, recognizing their loyalty and contributions to the group's turnaround journey. The initiative received shareholder approval and aims to create wealth-sharing opportunities while aligning employee interests with long-term company vision. Reliance Group serves over 50 lakh shareholders, employs more than 28,000 people, and has assets worth ₹1,07,123 crore with net worth of ₹40,856 crore. Both flagship companies are bank debt-free, with Reliance Power operating 5,305MW installed capacity including a 4,000MW thermal power plant in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1763036888707,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Nu Energies Secures 750 MW Solar Project, Positions Reliance Power as India's Largest Solar and Battery Storage Company",
            "Summary": "Reliance Power's subsidiary Reliance Nu Energies won an award for 750 MW / 3000 MWh capacity in SJVN's 1500 MW tender with a tariff of ₹6.74 per KWh. Following this development, Reliance Power has become India's largest company in solar and battery storage sectors, with a total capacity of 4 GWp solar and 6.5 GWh battery storage.",
            "Sentiment": "positive",
            "PublishDate": 1762832283683,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Reports No Deviation in Preferential Issue Proceeds Utilization for Q2 FY2026",
            "Summary": "Reliance Power Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its preferential issue of convertible warrants worth Rs. 1,524.60 crores. The monitoring agency, Infomerics Valuation and Rating Limited, reported no deviation from the stated objects and no range of deviation from the allocated amounts. During the quarter, the company did not utilize any amount from the issue proceeds, leaving Rs. 26.49 crores unutilized, which remains invested in fixed deposits with scheduled commercial banks. The proceeds were originally allocated for three purposes: expansion of business operations (Rs. 803.60 crores), general corporate expenses (Rs. 381.00 crores), and debt reduction (Rs. 340.00 crores). As of the reporting date, Rs. 668.16 crores had been utilized across all objects since the issue. The company had previously allotted 11.88 crore equity shares upon exercise of warrant rights during an earlier quarter for a consideration of Rs. 392.04 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1762825769019,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Power Grants 99.92 Lakh Stock Options Under Employee Stock Option Scheme 2024",
            "Summary": "Reliance Power's Nomination and Remuneration Committee approved the grant of 99,92,103 employee stock options under the Reliance Power Employee Stock Option Scheme, 2024. The options cover fully paid-up equity shares with a face value of Rs. 10 each. The company implemented two pricing formulas: options granted at face value of Rs. 10 and options granted at a 20% discount to the closing market price on NSE as of November 07, 2025, which was Rs. 31.35. The vested options can be exercised within a maximum period of 4 years from the vesting date. The granted options, once vested, will entitle option holders to acquire an equal number of equity shares upon payment of exercise price and applicable taxes according to the vesting schedule and scheme conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1762824671640,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Power Reports Q2 Profit of Rs 87 Crore, Board Approves USD 600 Million FCCB Proposal",
            "Summary": "Reliance Power reported a profit after tax of Rs 87 crore for the quarter ended September 30, 2025, compared to a loss of Rs 352 crore in the same period last year, marking a 125% year-on-year improvement. EBITDA increased 64% to Rs 618 crore from Rs 376 crore. Total income rose to Rs 2,067 crore from Rs 1,963 crore. The company's debt-to-equity ratio stands at 0.87 with net worth of Rs 16,516 crore. The Board approved seeking shareholder authorization for issuing Foreign Currency Convertible Bonds up to USD 600 million through international offering via private placement to fund growth. The company completed debt servicing of Rs 634 crore during the quarter. Additionally, 100 lakh stock options were granted under the ESOP scheme. The company operates 5,305 megawatts of power generation capacity, including the 3,960 megawatt Sasan Power plant.",
            "Sentiment": "positive",
            "PublishDate": 1762791737913,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Power Reports 97% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "Reliance Power reported a consolidated net profit of 846.9 million rupees for Q2, down significantly from 28.7 billion rupees in the same period last year. Revenue increased to 19.74 billion rupees from 17.6 billion rupees year-over-year. EBITDA rose to 6.18 billion rupees compared to 3.76 billion rupees previously, with EBITDA margin improving to 31.29% from 21.36%. The company recorded a one-time gain of 32.3 billion rupees from deconsolidation of a subsidiary in the previous year period.",
            "Sentiment": "negative",
            "PublishDate": 1762791403427,
            "Source": "earnings"
        },
        {
            "Title": "Reliance Power Shares Surge 8% as Company Denies Links to ED Arrest in Fake Guarantee Case",
            "Summary": "Reliance Power shares jumped 7.8% to Rs 42.30 after the company clarified that Amar Nath Dutta, arrested by the Enforcement Directorate in a fake bank guarantee case, has no connection with the company or its subsidiaries. The company stated it is a victim of fraud and that the arrest has no impact on business operations. Dutta allegedly helped arrange forged bank guarantees worth over Rs 68 crore for a Reliance Power subsidiary to qualify for a SECI tender, working with previously arrested individuals including the company's former CFO. The case is part of a broader ED investigation into Anil Ambani's Reliance Group, which has seen asset attachments worth over Rs 7,500 crore and allegations of loan diversions between 2010-2012. The share rally also comes ahead of quarterly results, following the company's turnaround to Rs 44.68 crore profit in the previous quarter from a year-earlier loss of Rs 97.85 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1762753358241,
            "Source": "stock"
        },
        {
            "Title": "ED Makes Third Arrest in Reliance Power Fake Bank Guarantee Case",
            "Summary": "The Enforcement Directorate arrested Amar Nath Dutta in connection with a money laundering probe involving Reliance Power and an alleged fake bank guarantee worth Rs 68 crore. The case involves a fraudulent bank guarantee submitted to Solar Energy Corporation of India by Reliance NU BESS Limited, a Reliance Power subsidiary. Two others were previously arrested: former Reliance Power CFO Ashok Kumar Pal and Partha Sarathi Biswal of Biswal Tradelink. The investigation revealed that Biswal Tradelink operated a racket providing fake bank guarantees for an 8% commission, using a fake email domain similar to State Bank of India's to create false legitimacy. The bank guarantee claimed to be from FirstRand Bank in Manila, but the bank has no branch in the Philippines. Reliance Power stated it was a victim of fraud and had filed a criminal complaint with Delhi Police. Anil Ambani has not been on Reliance Power's board for over 3.5 years.",
            "Sentiment": "negative",
            "PublishDate": 1762505164677,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Discloses ED's Provisional Asset Attachment of Promoter Reliance Infrastructure",
            "Summary": "Reliance Power informed stock exchanges that its promoter, Reliance Infrastructure Limited, had certain assets provisionally attached by the Enforcement Directorate for alleged violations under the Prevention of Money Laundering Act. Reliance Infrastructure stated there is no impact on business operations, shareholders, employees, or other stakeholders. The company clarified that Anil D. Ambani has not been on the Board of Reliance Infrastructure Limited for more than 3.5 years. Reliance Power emphasized that none of its own assets have been attached.",
            "Sentiment": "negative",
            "PublishDate": 1762205031806,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Independent Director Dr. Vijayalakshmy Gupta Resigns Due to Health Issues",
            "Summary": "Dr. Vijayalakshmy Gupta has resigned from her position as Independent Director of Reliance Power Limited with immediate effect. The resignation was submitted on November 3, 2025, citing poor health as the reason for stepping down. Dr. Gupta also resigned from her membership in Board committees. In her resignation letter, she confirmed there are no other material reasons beyond health concerns for her departure and expressed gratitude to the Board and Management for the opportunity to serve during her tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1762204521787,
            "Source": "corporate_governance"
        },
        {
            "Title": "ED Detains R Power's Chief Financial Officer",
            "Summary": "The Enforcement Directorate has detained the Chief Financial Officer of R Power.",
            "Sentiment": "negative",
            "PublishDate": 1760608938871,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Power CFO Ashok Kumar Pal Resigns Following Arrest in Investigation",
            "Summary": "Ashok Kumar Pal resigned from his position as Executive Director and Chief Financial Officer of Reliance Power Limited, effective October 11, 2025. Pal was arrested on October 10, 2025 by the Enforcement Directorate in connection with an investigation under ECIR/STF/14/2025 dated June 16, 2025. The investigation stems from an FIR filed by Pal himself in November 2024 with the Economic Offences Wing, New Delhi. In his resignation letter, Pal cited his arrest and the pending investigation as reasons for stepping down, while maintaining his innocence and stating he is not involved in any wrongdoing. He indicated the resignation is temporary until his name is cleared in the matter.",
            "Sentiment": "negative",
            "PublishDate": 1760375976031,
            "Source": "corporate_governance"
        },
        {
            "Title": "Anil Ambani's Reliance Stocks Drop Up to 10% Following Executive's Arrest",
            "Summary": "Shares of Anil Ambani-led Reliance companies fell up to 10.5% after reports that the Enforcement Directorate arrested Reliance Power executive Ashok Kumar Pal in connection with alleged fake bank guarantee and invoicing cases. Reliance Power dropped over 10% to Rs 43.55 per share, while Reliance Infrastructure declined 4.5% to Rs 231 per share. The ED is investigating alleged financial irregularities under the Prevention of Money Laundering Act, following a large-scale operation in July that searched 35 premises and 50 companies linked to Reliance Anil Ambani Group firms. The probe involves suspected illegal diversion of around Rs 3,000 crore in loans disbursed by Yes Bank between 2017 and 2019. Pal allegedly played a key role in fund diversion and submission of a bogus bank guarantee worth over Rs 68 crore to the Solar Energy Corporation of India.",
            "Sentiment": "negative",
            "PublishDate": 1760334652559,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Appoints New Director and Interim CFO",
            "Summary": "Reliance Power Limited appointed Shri Arup Ashok Gupta as a Non-Executive and Non-Independent Director. Shri Neeraj Parakh, who serves as Executive Director and CEO, has been given additional charge as interim Chief Financial Officer. Gupta brings over 40 years of HR experience and has been with the Reliance Group for 16 years. Parakh has 29 years of professional experience, including more than 20 years with Reliance, and has been instrumental in delivering power generation projects totaling over 10 GW with capital expenditure of ₹50,000 crore. Both appointments were made during a board meeting held on October 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760197628331,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Power CFO Ashok Kumar Pal Resigns Following Enforcement Directorate Arrest",
            "Summary": "Ashok Kumar Pal resigned as Executive Director and CFO of Reliance Power Limited effective October 11, 2025, following his arrest by the Enforcement Directorate on October 10, 2025. The arrest stems from an investigation related to FIR No. 131/2024 registered by EOW, New Delhi, in which Pal was the original complainant. The Enforcement Directorate registered ECIR/STF/14/2025 based on this FIR. Pal communicated his resignation through counsel, stating he maintains his innocence and is not involved in any wrongdoing, but is resigning due to his arrest and the pending investigation. He plans to submit a formal resignation letter on October 13, 2025, with the resignation effective from October 11, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1760197006437,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Power CFO Arrested in ₹68 Crore Fake Bank Guarantee Money Laundering Case",
            "Summary": "The Enforcement Directorate arrested Ashok Pal, CFO of Reliance Power, in connection with a money laundering case involving an alleged fake bank guarantee worth ₹68.2 crore. The guarantee was submitted to Solar Energy Corporation of India Limited on behalf of Reliance NU BESS Limited, a Reliance Power subsidiary. The case stems from a Delhi Police FIR involving Odisha-based Biswal Tradelink, which allegedly operated a racket providing fake bank guarantees for an 8% commission. The company used a fake email domain similar to State Bank of India's to create fraudulent communications. ED previously arrested Biswal Tradelink's Managing Director Partha Sarathi Biswal and found the company to be a paper entity with no actual operations. Reliance Group stated they were victims of fraud and had filed a criminal complaint against the third party with Delhi Police.",
            "Sentiment": "negative",
            "PublishDate": 1760163247871,
            "Source": "stock"
        },
        {
            "Title": "ED Arrests Reliance Power CFO in Money Laundering Probe",
            "Summary": "The Enforcement Directorate arrested Reliance Power CFO Ashok Kumar Pal as part of a money laundering investigation into suspected loan frauds by Reliance Home Finance Ltd. and Reliance Commercial Finance Ltd. The probe centers on Rs 12,524 crore in loans extended by RHFL and RCFL, with the majority disbursed to firms linked to the Reliance Anil Ambani Group. Of these loans, Rs 6,931 crore have been declared non-performing assets. Preliminary findings indicate funds were routed back to other Reliance group companies, suggesting circular lending practices. Yes Bank's Rana Kapoor reportedly played a key role in sanctioning these loans, with his family-linked firms RAB Enterprises, Imagine Estates, and Bliss House also receiving credit facilities. A Grant Thornton audit identified significant fund diversion and lending policy violations. The ED has conducted searches across 60 companies and 22 individuals as the investigation continues.",
            "Sentiment": "negative",
            "PublishDate": 1760154176945,
            "Source": "corporate_governance"
        },
        {
            "Title": "Reliance Power Files Applications for Reclassification of Reliance Capital to Public Category",
            "Summary": "Reliance Power Limited has filed applications with BSE and NSE seeking reclassification of Reliance Capital Limited to public category. This follows the implementation of a resolution plan by InduslInd International Holdings Limited under the Insolvency and Bankruptcy Code. The company's Board of Directors approved the application during their meeting, determining it complies with applicable listing regulations. Reliance Power is now seeking no objection from both stock exchanges to proceed with the reclassification process.",
            "Sentiment": "neutral",
            "PublishDate": 1760113893019,
            "Source": "corporate_action"
        },
        {
            "Title": "Reliance Power Shares Surge 15% on High Trading Volumes Despite SEBI Notice",
            "Summary": "Reliance Power shares jumped 15% to Rs 50.75 with exceptional trading volumes of 7 crore shares, significantly higher than the usual 2 crore average. The company recently received Show Cause Notices from SEBI regarding CLE Private Limited matters, though the company denies ongoing financial ties. Reliance Power reported a turnaround to Rs 44.68 crore net profit in Q1 from a Rs 97.85 crore loss in the same quarter last year. However, revenue from operations declined 5.3% year-on-year to Rs 1,885.58 crore. The stock has gained over 3% in one month but fell more than 25% over three months, while delivering 171% returns over two years and 1,657% over five years.",
            "Sentiment": "positive",
            "PublishDate": 1760075404329,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Receives SEBI Notice Over Reliance Infrastructure's CLE Private Investment",
            "Summary": "Reliance Power has received a notice from SEBI concerning Reliance Infrastructure's investment in CLE Private. The company has stated that it has no connection to this matter.",
            "Sentiment": "negative",
            "PublishDate": 1759803740513,
            "Source": "corporate_governance"
        },
        {
            "Title": "Bombay High Court Rejects Anil Ambani's Challenge to SBI's Fraud Classification",
            "Summary": "The Bombay High Court has rejected Anil Ambani's request challenging State Bank of India's classification of his loan account as fraudulent. The court ruling upholds SBI's fraud designation of Ambani's loan account.",
            "Sentiment": "negative",
            "PublishDate": 1759502100970,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Sells Indonesian Subsidiaries for $12 Million",
            "Summary": "Reliance Power has signed an agreement to sell its entire stake in Indonesian subsidiaries for $12 million. The transaction is expected to close by December 30, 2025. The subsidiaries generated no income in the last financial year.",
            "Sentiment": "neutral",
            "PublishDate": 1759118609574,
            "Source": "order&deals"
        },
        {
            "Title": "Reliance Power and RInfra Assert No Business Impact from CBI Chargesheet Against Anil Ambani",
            "Summary": "Reliance Power and Reliance Infrastructure stated that the CBI chargesheet against Anil Ambani and others in a ₹2,796 crore bank fraud case will not affect their operations or financial performance. The CBI filed charges alleging fraudulent transactions between Reliance Commercial Finance, Reliance Home Finance, Yes Bank and firms connected to former Yes Bank CEO Rana Kapoor's family. Both companies emphasized that issues related to RCFL and RHFL were resolved through lender-driven processes led by Bank of Baroda under RBI regulations, following Supreme Court judgments in 2022 and 2023. The companies noted that Anil Ambani was never on the boards of RCFL or RHFL and stepped down from Reliance Power and Reliance Infrastructure boards over 3.5 years ago. They maintain that as separate listed entities, the CBI action does not impact their management, governance or financial stability.",
            "Sentiment": "neutral",
            "PublishDate": 1758284256968,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power States CBI Actions Won't Impact Company Operations",
            "Summary": "Reliance Power announced that recent actions by the Central Bureau of Investigation (CBI) will not affect the company's operations.",
            "Sentiment": "neutral",
            "PublishDate": 1758273848141,
            "Source": "stock"
        },
        {
            "Title": "Anil Ambani Group Stocks Rally 5% Despite Legal Challenges and Weak Technical Indicators",
            "Summary": "Reliance Power and Reliance Infrastructure shares jumped 5% on Tuesday, with Reliance Power reaching Rs 47.90 and Reliance Infrastructure hitting Rs 260. The rally comes after both stocks lost nearly 30% over the past three months. Despite year-over-year gains of 52% for Reliance Power and 20% for Reliance Infrastructure, both remain well below their May peaks. Technical indicators show mixed signals, with Reliance Infrastructure trading below seven of eight key moving averages and an RSI of 34. The Enforcement Directorate filed a fresh money laundering case against Anil Ambani and Reliance Communications, alleging fraud of over Rs 2,900 crore against State Bank of India. Bank of Baroda classified Reliance Communications loans as fraud. Both companies returned to profitability in the June quarter - Reliance Power posted Rs 44.68 crore profit versus Rs 97.85 crore loss previously, while Reliance Infrastructure earned Rs 59.84 crore against Rs 233.74 crore loss last year. However, revenues declined for both companies. Recent contract wins include Reliance Power securing a 500 MW battery storage project from SECI and Reliance Infrastructure winning a 390 MW solar power project from NHPC.",
            "Sentiment": "neutral",
            "PublishDate": 1758011772833,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Upholds Tribunal Ruling Favoring GMR Kamalanga Energy in Coal Allocation Dispute",
            "Summary": "The Supreme Court has upheld a tribunal ruling in favor of GMR Kamalanga Energy regarding coal allocation. The court dismissed appeals filed by Haryana and Odisha distribution companies (discoms) against the earlier tribunal decision. This ruling supports GMR Kamalanga Energy's position in the coal allocation matter.",
            "Sentiment": "positive",
            "PublishDate": 1757895131638,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Upholds Tribunal Ruling Favoring GMR Kamalanga Energy in Coal Allocation Dispute",
            "Summary": "The Supreme Court has upheld a tribunal ruling in favor of GMR Kamalanga Energy regarding coal allocation. The court dismissed appeals filed by Haryana and Odisha distribution companies (DISCOMs) in the matter.",
            "Sentiment": "positive",
            "PublishDate": 1757596761360,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Clarifies Independence from Reliance Communications Amid Bank of Baroda Fraud Label",
            "Summary": "Reliance Power has stated that Bank of Baroda's fraud classification on a Reliance Communications loan does not impact its operations. The company emphasized that it operates as an independent entity with no financial connections to Reliance Communications.",
            "Sentiment": "neutral",
            "PublishDate": 1757054566893,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power and Reliance Infrastructure Shares Hit 5% Upper Circuit on Strong Gains",
            "Summary": "Reliance Power and Reliance Infrastructure shares hit 5% upper circuits, marking their second consecutive session of gains. Reliance Infrastructure reached an intraday high of Rs 278.95, up Rs 13.25, while Reliance Power rose to Rs 46.22. Reliance Power's rally was driven by developments in its renewable energy business, including the incorporation of GDL – Reliance Solar Pte Ltd, a joint venture in Bhutan's Gelephu Mindfulness City. The 50:50 partnership between Green Digital Private Ltd and Reliance Enterprises Private Ltd expands Reliance Power's clean energy pipeline to over 3 GW of solar DC capacity and 3.5 GWh of battery energy storage system capacity. The Enforcement Directorate has questioned senior executives of Anil Ambani's Reliance Group regarding alleged money laundering in a Rs 17,000 crore bank loan fraud case and has requested loan details from nearly 20 banks, including State Bank of India and Bank of Baroda. Over the past year, Reliance Power shares gained 51% while Reliance Infrastructure returned 34%, both outperforming the Nifty and Sensex which posted negative 3% returns.",
            "Sentiment": "positive",
            "PublishDate": 1756807451486,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Shares Surge 17% on Renewable Energy Joint Venture in Bhutan",
            "Summary": "Reliance Power shares rallied over 17% in one week following the company's announcement of incorporating GDL – Reliance Solar Pte Ltd (GRSPL), a joint venture in Bhutan's Gelephu Mindfulness City. The venture is a 50:50 partnership between Green Digital Private Ltd (a state-owned enterprise of Bhutan) and Reliance Enterprises Private Ltd. Reliance Power indirectly holds 25% in GRSPL through REPL's subscription to 225,000 shares. This expansion increases Reliance Power's clean energy pipeline to over 3 GW of solar DC capacity and 3.5 GWh of battery energy storage system capacity. Technical analysts suggest the stock has broken out of consolidation after hitting oversold levels, with RSI moving from 23 to 48 and MACD generating a buy crossover. Analysts see potential upside toward Rs. 60-71 levels, with immediate resistance at Rs. 53 and support around Rs. 46-47.",
            "Sentiment": "positive",
            "PublishDate": 1756104364702,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power and Infrastructure Shares Hit Lower Circuit Limits Amid CBI Action on Reliance Communications",
            "Summary": "Shares of Reliance Power and Reliance Infrastructure hit their lower circuit limits during Monday morning trade following CBI action on Reliance Communications. Reliance Power dropped 4.99% to ₹46.49, while Reliance Infrastructure fell 4.99% to ₹275.05. Reliance Communications also declined 4.86% to ₹1.76. The CBI searched Anil Ambani's Mumbai residence and Reliance Communications' premises regarding alleged defrauding of State Bank of India of Rs 2,929.05 crore. Both Reliance Power and Reliance Infrastructure stated the CBI action has no impact on their business operations, financial performance, or stakeholders, emphasizing they are separate entities with no business or financial linkage to Reliance Communications. Anil Ambani has not been on Reliance Power's board for more than 3.5 years and denies all allegations.",
            "Sentiment": "negative",
            "PublishDate": 1756102063770,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Clarifies No Impact from CBI Action on Reliance Communications",
            "Summary": "Reliance Power Limited issued a clarification stating that recent Central Bureau of Investigation action on Reliance Communications Limited and Anil D Ambani has no impact on its business operations, financial performance, or stakeholders. The company emphasized it is a separate and independent listed entity with no business or financial linkage to Reliance Communications. Anil D Ambani has not been on Reliance Power's Board for more than 3.5 years and resigned from Reliance Communications' Board six years ago in 2019. The complaint by State Bank of India relates to matters from over 10 years ago when Ambani was a Non-Executive Director at Reliance Communications with no day-to-day management involvement. Reliance Communications is currently managed under a Committee of Creditors led by SBI. Reliance Power operates 5,305 megawatts of power generation capacity, including the 3,960 megawatt Sasan Power Limited plant.",
            "Sentiment": "neutral",
            "PublishDate": 1756016148561,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Forms 50:50 Renewable Energy Joint Venture in Bhutan",
            "Summary": "Reliance Power's associate company Reliance Enterprises Private Limited has formed a joint venture with Green Digital Private Limited, a state-owned enterprise of Bhutan's Royal Government. The 50:50 partnership, named GDL–Reliance Solar Pte Ltd, was incorporated under Bhutan's Gelephu Mindfulness City Special Administrative Region and focuses on renewable and green energy. Reliance Enterprises invested $22.5 million for its 50% stake, giving Reliance Power an indirect 25% holding in the venture. The company has not yet commenced operations. Separately, Reliance Power reported strong quarterly results with net profit of ₹125.6 crore compared to a net loss of ₹397.6 crore in the previous year's corresponding quarter. Revenue from operations declined 1% to ₹1,978 crore, while EBITDA surged 1,109% to ₹589.8 crore with margins improving to 29.8% from 2.4%.",
            "Sentiment": "positive",
            "PublishDate": 1755541690469,
            "Source": "order&deals"
        },
        {
            "Title": "Reliance Power Partners with Bhutan Government to Acquire 25% Stake in Solar Venture",
            "Summary": "Reliance Power has partnered with Bhutan's government to acquire a 25% indirect stake in GDL-Reliance Solar PTE Ltd. The partnership is designed to enhance renewable energy initiatives and support clean power growth.",
            "Sentiment": "positive",
            "PublishDate": 1755535073093,
            "Source": "order&deals"
        },
        {
            "Title": "Odisha Government Approves Financial Aid for RIR Power's Silicon Carbide Semiconductor Plant",
            "Summary": "The Odisha Government has approved financial aid for RIR Power's Silicon Carbide Semiconductor Plant Phase 1 project in Bhubaneswar. This government support will assist RIR Power in developing its semiconductor manufacturing facility in the state capital.",
            "Sentiment": "positive",
            "PublishDate": 1754536646082,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power Shares Hit Lower Circuit for Third Day as Anil Ambani Faces ED Questioning",
            "Summary": "Reliance Power shares fell 5% to Rs 45.20, hitting the lower circuit limit for the third consecutive day. The decline coincides with Reliance Group Chairman Anil Ambani appearing before the Enforcement Directorate for questioning in an alleged Rs 17,000 crore bank loan fraud-linked money laundering case. The case involves complex financial dealings including alleged arrangements with bankers, suspicious investments through shell companies, and forged bank guarantees. Despite recent declines, the stock has gained 37.76% over the past 12 months and 6.10% year-to-date. Trading volume reached 2.28 times the 30-day average, while the broader NSE Nifty 50 declined only 0.5%.",
            "Sentiment": "negative",
            "PublishDate": 1754370266391,
            "Source": "stock"
        },
        {
            "Title": "Reliance Group Shares Fall 5% as ED Probes Rs 17,000 Crore Loan Fraud Case",
            "Summary": "Shares of Anil Ambani-led Reliance Group companies declined by approximately 5% following reports of an Enforcement Directorate investigation into a Rs 17,000 crore loan fraud case. Reliance Power dropped 5% to Rs 47.58, Reliance Infrastructure fell 4.98% to Rs 296.15, and Reliance Home Finance declined 4.84% to Rs 4.84. The ED plans to question bank officials from public and private sector banks that provided loans to Reliance Group entities. The agency, which has already summoned Anil Ambani, seeks to understand what actions banks took after group companies defaulted on repayments. Loans to Reliance Home Finance Ltd, Reliance Commercial Finance Ltd, and Reliance Communications totaling around Rs 17,000 crore have reportedly become non-performing assets, involving nearly 20 lenders. Technical analysis shows Reliance Power in oversold territory with an RSI of 28.0, while Reliance Infrastructure has an RSI of 31.0 and Reliance Home Finance shows an RSI of 49.2 in neutral territory.",
            "Sentiment": "negative",
            "PublishDate": 1754286899313,
            "Source": "stock"
        },
        {
            "Title": "ED Arrests Managing Director of Odisha Company in Fake Bank Guarantee Racket",
            "Summary": "The Enforcement Directorate arrested Partha Sarathi Biswal, Managing Director of Biswal Tradelink, an Odisha-based company allegedly operating a fake bank guarantee issuance racket. The company charged an 8% commission for issuing fraudulent bank guarantees to business groups. A fake Rs 68.2 crore bank guarantee was submitted to Solar Energy Corp on behalf of Reliance NU BESS Ltd, a Reliance Power subsidiary. The ED conducted searches at three premises in Bhubaneswar and one in Kolkata, discovering seven undisclosed bank accounts with transactions disproportionate to declared turnover. The company used a fake email domain (s-bi.co.in) to impersonate State Bank of India communications. Reliance Power stated it was a victim of fraud and filed a criminal complaint with Delhi Police in October 2024. The investigation revealed the company operated from a residential property with no actual business records found at the registered address.",
            "Sentiment": "negative",
            "PublishDate": 1754143480198,
            "Source": "stock"
        },
        {
            "Title": "Reliance Group Plans ₹18,000 Crore Fundraise for Defense & Aerospace and Renewable Energy Expansion",
            "Summary": "Reliance Group held a leadership meeting with over 100 senior leaders from Reliance Infrastructure and Reliance Power to discuss growth strategies. The boards of both companies approved raising ₹18,000 crore through equity and debt to fund expansion in Defense & Aerospace and Renewable Energy sectors. The group highlighted its debt-free status with Reliance Infrastructure having a net worth of ₹14,883 crore and Reliance Power ₹16,431 crore. Reliance Infrastructure is focusing on defense manufacturing partnerships with Dassault Aviation for Falcon 2000 jets, Coastal Mechanics for MRO services, and Rheinmetall AG for defense manufacturing. The company also operates BSES power distribution serving 53 lakh households in Delhi. Reliance Power operates a 5.3 GW portfolio and has secured 3.3 GWh of solar and battery energy storage projects. The combined group has a market capitalization of ₹40,000 crore with over 4 million shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1753624205505,
            "Source": "stock"
        },
        {
            "Title": "Reliance Power States ED Action Concluded with No Impact on Operations",
            "Summary": "Reliance Power announced that Enforcement Directorate action has concluded at all company locations. The company stated it fully cooperated with authorities and that the action has no impact on business operations, financial performance, or stakeholders. The company clarified it is a separate entity from Reliance Communications and Reliance Home Finance, which are subjects of the ED investigation. Reliance Power emphasized that allegations appear to concern transactions of RCOM or RHFL that are over 10 years old. The company noted that Anil D. Ambani is not on Reliance Power's board, and any action against RCOM or RHFL has no bearing on Reliance Power's governance or operations. The company operates a 5,305 megawatt power generation portfolio and continues normal business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1753605115485,
            "Source": "stock"
        }
    ]
}