{
    "Symbol": "RPPINFRA",
    "ISIN": "INE324L01013",
    "News": [
        {
            "Title": "RPP Infra Projects Announces Share Transfer Plan",
            "Summary": "RPP Infra Projects Limited notifies stock exchanges of proposed inter-se transfer of 39.60 lakh equity shares between promoters Ms. Nithya Arulsundaram and Ms. N A Tharunya via gift.",
            "Sentiment": "neutral",
            "PublishDate": 1769920084703,
            "Source": "co_actions_results"
        },
        {
            "Title": "RPP Infra Projects Announces Promoter Share Transfer",
            "Summary": "RPP Infra Projects Ltd notifies stock exchanges of proposed acquisition of 40,000 equity shares by way of gift between promoters scheduled for January 22, 2026, involving inter-se transfer among immediate relatives.",
            "Sentiment": "neutral",
            "PublishDate": 1768541341703,
            "Source": "co_actions_results"
        },
        {
            "Title": "RPP Infra Projects Wins ₹662.6 Cr Contract",
            "Summary": "RPP Infra Projects Limited has secured a significant contract worth ₹662.6 million, marking a notable business development for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1766492211886,
            "Source": "co_actions_results"
        },
        {
            "Title": "RPP Infra Wins ₹66.26 Cr Railway Shed Contract",
            "Summary": "RPP Infra Projects secures Letter of Acceptance from IPRCL for construction of roofing shed at New Mangalore Port Authority's marshalling yard with 6-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1766491241813,
            "Source": "co_actions_results"
        },
        {
            "Title": "RPP Infra faces prosecution order for TDS delays",
            "Summary": "RPP Infra Projects receives Income Tax Department prosecution sanction for delayed TDS remittance of ₹1.92 crores during FY23, affecting company and two directors.",
            "Sentiment": "negative",
            "PublishDate": 1765807002833,
            "Source": "stocks"
        },
        {
            "Title": "RPP Infra Projects Company Secretary Shammi Prakash Resigns Due to Personal Reasons",
            "Summary": "CS Shammi Prakash (ICSI Membership No: FCS12231) resigned from his position as Company Secretary, Compliance Officer and Key Managerial Personnel at RPP Infra Projects Limited effective December 5, 2025, citing personal reasons. The resignation affects the company's key management structure as Prakash held multiple critical compliance and secretarial roles within the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1765021593983,
            "Source": "corporate_governance"
        },
        {
            "Title": "RPP Infra Projects Secures New Contracts Worth ₹259.9 Million",
            "Summary": "RPP Infra Projects has secured new contracts valued at ₹259.9 million. The contract wins will contribute to the company's revenue pipeline and business growth.",
            "Sentiment": "positive",
            "PublishDate": 1764676725402,
            "Source": "order&deals"
        },
        {
            "Title": "R.P.P Infra Projects Wins Rs. 69.36 Crore Road Widening Contract",
            "Summary": "R.P.P Infra Projects Limited secured a contract worth Rs. 69.36 crores from the Office of the Superintending Engineer, Chennai Circle for widening Thirumazhisai-Uthukottai Road (SH-50) from two lanes to four lanes. The domestic infrastructure project includes road improvements and bridge construction work to be completed within 12 months, representing significant new business for the company.",
            "Sentiment": "positive",
            "PublishDate": 1764337166046,
            "Source": "stock"
        },
        {
            "Title": "RPP Infra Projects Ltd Announces Resignation of Two Independent Directors",
            "Summary": "Mr. Sundararajan and Mr. Nagadipudur Ramasamy Thangavel resigned as Independent Directors of RPP Infra Projects Ltd effective November 18, 2025, citing family health issues and personal commitments. Both directors will also cease their roles as Chairman/Members of Board Committees, with the company confirming no other material reasons for their departure.",
            "Sentiment": "neutral",
            "PublishDate": 1763467411795,
            "Source": "corporate_governance"
        },
        {
            "Title": "R.P.P Infra Projects Secures ₹1,851 Crores in New Orders, Reports 39% Jump in Q2 Net Profit",
            "Summary": "R.P.P Infra Projects Limited was awarded 25 new infrastructure and building projects worth ₹1,851.25 crores up to October 31, 2025, bringing total order book to ₹3,874 crores across 43 projects. The company reported quarterly net profit of ₹15.09 crores with 4.76% margin compared to ₹10.86 crores in previous quarter, despite revenue declining to ₹316.79 crores from ₹341.10 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763063140415,
            "Source": "stock"
        },
        {
            "Title": "RPP Infra Projects Targets Double-Digit Revenue Growth With ₹5,200 Cr Order Book",
            "Summary": "RPP Infra Projects reports strong execution momentum with a ₹5,200 crore order book, focusing on roads, bridges, and smart city projects while expanding operations in Tamil Nadu, Karnataka, and Telangana. The company targets double-digit revenue CAGR over 3 years through an asset-light EPC strategy.",
            "Sentiment": "negative",
            "PublishDate": 1763051842037,
            "Source": "earnings"
        },
        {
            "Title": "RPP Infra Projects Secures Rs. 125.92 Crore Defense Contract for NADFM Pune Construction",
            "Summary": "RPP Infra Projects Ltd has received a Letter of Acceptance for a new work order worth Rs. 125.92 crores from Chief Construction Engineer (R&D)W Pune. The contract involves civil works for construction of office cum training building and residential accommodation for officers and staff of the National Academy of Defence Financial Management (NADFM) in Pune. The project has a completion period of 36 months from the effective date of October 24, 2025, with completion scheduled for October 23, 2028. The contract includes standard payment terms with 10% mobilization advance, 2.5% initial security deposit, and 7.5% performance bank guarantee requirements. The company confirmed no promoter or group company interest exists in the awarding entity, and the contract is classified as a domestic project.",
            "Sentiment": "positive",
            "PublishDate": 1761073663762,
            "Source": "stock"
        },
        {
            "Title": "RPP Infra Projects Secures Rs. 125.92 Crore Defense Infrastructure Contract",
            "Summary": "RPP Infra Projects Ltd has received a Letter of Acceptance for a Rs. 125.92 crore contract from Chief Construction Engineer (R&D)W Pune. The project involves civil works for constructing office, training building, and residential accommodation for officers and staff of the National Academy of Defence Financial Management (NADFM) in Pune. The contract has a 36-month execution timeline, with work commencing from October 24, 2025, and scheduled completion by October 23, 2028. The contract includes standard payment terms with mobilization advance of 10% of contract price, initial security deposit of 2.5%, and performance bank guarantee of 7.5%. The project is funded under Government of India Ministry of Defence DRDO sanction.",
            "Sentiment": "positive",
            "PublishDate": 1760868973396,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Wins ₹134.21 Crore Road Improvement Contract from MSIDC",
            "Summary": "RPP Infra Projects has secured a ₹134.21 crore order from Maharashtra State Industrial Development Corporation (MSIDC) for a road improvement project in Maharashtra. The contract represents a significant business win for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1756984864623,
            "Source": "order&deals"
        },
        {
            "Title": "R.P.P. Infra Projects Secures ₹1,125.94 Crore Contract from Bharat Heavy Electricals Limited",
            "Summary": "R.P.P. Infra Projects has received a contract worth ₹1,125.94 crores from Bharat Heavy Electricals Limited for the fabrication and supply of structures. The project is scheduled to be completed within 60 months.",
            "Sentiment": "positive",
            "PublishDate": 1756717949158,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Reports Board Changes and Quarterly Results",
            "Summary": "RPP Infra Projects Ltd submitted a revised consolidated audit report for the quarter ended June 30, 2025, correcting the quarter period mentioned in the previously submitted report. The company's board approved unaudited financial results showing revenue from operations of Rs 341.10 crores for the quarter, compared to Rs 336.12 crores in the same period last year. Net profit after tax stood at Rs 10.86 crores versus Rs 16.51 crores in the previous year quarter. The board approved re-appointments of P Arul Sundaram as Chairman and Managing Director and A. Nithya as Whole Time Director for five years from April 2026 to March 2031, subject to shareholder approval. Two executive directors, C.K Venkatachalam and S Anandavadivel, resigned from their positions effective August 11, 2025, citing personal and professional commitments. The company appointed two new additional directors: Venkatachalam Pranav Harshan and Sanu Raghav. The board also appointed M/s Lakshmmi Subramanian & Associates as secretarial auditors for the financial years 2025-26 to 2029-30.",
            "Sentiment": "neutral",
            "PublishDate": 1755082717460,
            "Source": "corporate_action"
        },
        {
            "Title": "RPP Infra Projects Reports Q2 2025 Results, Executes Major Board Changes Including Director Resignations and New Appointments",
            "Summary": "RPP Infra Projects Ltd approved unaudited financial results for the quarter ended June 30, 2025, reporting revenue from operations of Rs 341.10 crore and net profit of Rs 10.86 crore. The company executed significant board restructuring with two executive directors - C.K. Venkatachalam and S. Anandavadivel - resigning due to personal and professional commitments, while appointing two new additional directors - Venkatachalam Pranav Harshan and Sanu Raghav. The board approved reappointment of P. Arul Sundaram as Chairman and Managing Director for five years from April 2026 to March 2031 at Rs 10 lakhs monthly remuneration, and A. Nithya as Whole Time Director and CFO for the same period at Rs 5 lakhs monthly, both subject to shareholder approval. The company appointed Lakshmmi Subramanian & Associates as secretarial auditors for 2025-30, discussed ROC investigation implications, revised independent director fees, and reconstituted the Legal and Finance Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1754917034382,
            "Source": "corporate_action"
        },
        {
            "Title": "RPP Infra Projects Reports Mixed Q1 Results with Higher EBITDA but Lower Net Profit",
            "Summary": "RPP Infra Projects reported Q1 EBITDA of 200 million rupees compared to 125 million rupees in the same period last year. The company's EBITDA margin improved to 5.76% from 3.61% year-over-year. However, consolidated net profit declined to 108 million rupees from 117 million rupees in the previous year. Revenue remained relatively flat at 3.47 billion rupees versus 3.46 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1754914990505,
            "Source": "earnings"
        },
        {
            "Title": "R.P.P Infra Projects Secures Rs. 1.43 Crore Elevator Contract from NLC India",
            "Summary": "R.P.P Infra Projects Limited has received a work order worth Rs. 1.43 crores from NLC India Limited for supply, erection, testing, commissioning and certification of a Kone make stretcher cum passenger elevator for a service building in NNTPS. The project involves a 1360 kg capacity elevator with G+6 levels, including civil, aesthetics and electrical work. The contract has an 18-month execution period from the date of award, with 12 months allocated for actual work completion from site handover. Payment terms are structured in phases, with 60% released upon elevator delivery, 20% after erection, and 20% upon commissioning. The company must provide a 10% performance guarantee and 12-month warranty from commissioning date.",
            "Sentiment": "positive",
            "PublishDate": 1753969624506,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Secures New Orders Worth ₹14.3 Million",
            "Summary": "RPP Infra Projects has secured new orders valued at ₹14.3 million. The company operates in the infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1753969088233,
            "Source": "stock"
        },
        {
            "Title": "RPP Infra Projects Incorporates Wholly Owned Subsidiary in Sri Lanka for Real Estate Expansion",
            "Summary": "RPP Infra Projects Limited has incorporated a wholly owned subsidiary company named RPP Realtor (Pvt) Limited in Sri Lanka. The subsidiary's main purpose is to undertake and execute real estate projects as part of the company's strategic initiative to expand its business operations internationally.",
            "Sentiment": "positive",
            "PublishDate": 1753535837168,
            "Source": "stock"
        },
        {
            "Title": "R.P.P Infra Projects Secures Rs. 2.44 Crore Storm Water Drain Contract",
            "Summary": "R.P.P Infra Projects Ltd has received a work order worth Rs. 2.44 crores for constructing a storm water drain at Millerpuram Housing Board in Thoothukudi City Municipal Corporation. The project is to be completed within 6 months. The contract involves construction of storm water drains in the west zone of Thoothukudi City Municipal Corporation under Package 2. The company has received the physical copy of the Letter of Acceptance from the department. The contract price excluding GST is Rs. 2,07,09,285.03. The company is required to furnish a security deposit equivalent to 2% of the contract value within 7 days of receiving the acceptance letter.",
            "Sentiment": "positive",
            "PublishDate": 1753284090344,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Receives Investigation Notice from ROC",
            "Summary": "RPP Infra Projects has received an investigation notice from the Registrar of Companies (ROC). The notice requests data and documents from a group firm associated with RPP Infra Projects. No further details about the nature of the investigation or the specific group firm involved were provided in the news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1752585040000,
            "Source": "default"
        },
        {
            "Title": "RPP Infra Projects Limited: Secures ₹365 Crore Water Supply Project in Rajasthan",
            "Summary": "RPP Infra Projects Limited's joint venture RPP-BCC IV has won a ₹365.85 crore order for water supply work in Ajmer district, Rajasthan. The project, part of the Jal Jeevan Mission, includes providing water connections to 557 habitations and involves a 20-month completion timeline with 10 years of operation and maintenance. This order brings the company's total order book to ₹3,370.32 crore.",
            "Sentiment": "positive",
            "PublishDate": 1752215528000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Secures 365 Crore Rupees Contract",
            "Summary": "RPP Infra has been awarded a contract worth 365 crores rupees. The news briefly mentions the company securing this significant project, but no further details about the nature of the contract or its duration are provided.",
            "Sentiment": "positive",
            "PublishDate": 1752209668000,
            "Source": "default"
        },
        {
            "Title": "RPP Infra Projects Secures ₹283 Crore Contract",
            "Summary": "RPP Infra Projects has secured a contract valued at ₹283 crore. The news briefly mentions the company's success in obtaining this significant project, though specific details about the nature of the contract or the client are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1749794655000,
            "Source": "default"
        },
        {
            "Title": "R P P Infra Projects Reports Improved Q4 EBITDA",
            "Summary": "R P P Infra Projects has reported a significant increase in its Q4 EBITDA, which rose to 129 million rupees from 45 million rupees in the same quarter last year. The company's EBITDA margin also improved, reaching 3.73% compared to 1.09% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748437438000,
            "Source": "result"
        },
        {
            "Title": "R P P Infra Projects Reports Q4 Financial Results",
            "Summary": "R P P Infra Projects announced its quarterly financial results. The company reported a consolidated net profit of 117 million rupees for Q4, compared to 136 million rupees in the same quarter last year and 189 million rupees in the previous quarter. Revenue for Q4 stood at 3.46 billion rupees, down from 4.12 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748437345000,
            "Source": "result"
        },
        {
            "Title": "R.P.P Infra Projects Secures New Orders Worth Rs 154.43 Crore",
            "Summary": "R.P.P Infra Projects has won new orders valued at Rs 154.43 crore. No further details about the nature of the orders or the timeline for execution were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747488363000,
            "Source": "default"
        },
        {
            "Title": "RPP Infra Projects Completes Land Registration for 885.4M Rupees",
            "Summary": "RPP Infra Projects has successfully registered 90.175 acres of land out of a total of 120 acres. The transaction was completed for a total consideration of 885.4 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745412529000,
            "Source": "default"
        },
        {
            "Title": "RPP Infra Projects Does Not Qualify as 'Large Corporate'",
            "Summary": "RPP Infra Projects has confirmed that it does not meet the criteria to be classified as a 'Large Corporate' entity. This classification is typically used by regulatory bodies to determine reporting requirements and other obligations for companies based on their size and financial metrics.",
            "Sentiment": "neutral",
            "PublishDate": 1743851848000,
            "Source": "corporate_governance"
        },
        {
            "Title": "RPP Infra Projects to Acquire 120 Acres Near Chennai Airport",
            "Summary": "RPP Infra Projects has announced plans to acquire 120 acres of land near Chennai Airport for 750 million rupees. This significant land acquisition suggests potential expansion or development plans for the company in the vicinity of a major transportation hub.",
            "Sentiment": "positive",
            "PublishDate": 1742970530000,
            "Source": "corporate_action"
        },
        {
            "Title": "RPP Infra Projects Secures New Orders Worth 219.5 Million Rupees",
            "Summary": "RPP Infra Projects has announced winning new orders valued at 219.5 million rupees. This development indicates potential growth in the company's project pipeline and revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1742861433000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Secures New Orders Worth 219.5 Million Rupees",
            "Summary": "RPP Infra Projects has announced winning new orders valued at 219.5 million rupees. This development indicates positive business growth and potential revenue increase for the company.",
            "Sentiment": "positive",
            "PublishDate": 1742825716000,
            "Source": "order&deals"
        },
        {
            "Title": "R.P.P Infra Projects to Consider Land Purchase for New Chennai Airport",
            "Summary": "R.P.P Infra Projects has scheduled a board meeting on March 26 to consider and approve the purchase of 120 acres of land near the planned new Chennai Airport. This strategic move could potentially position the company to benefit from future infrastructure development in the area.",
            "Sentiment": "positive",
            "PublishDate": 1742565208000,
            "Source": "corporate_action"
        },
        {
            "Title": "RPP Infra Projects Secures New Order Worth 225.6 Million Rupees",
            "Summary": "RPP Infra Projects has announced winning a new order valued at 225.6 million rupees. This development represents a significant business opportunity for the company, potentially boosting its project portfolio and revenue stream.",
            "Sentiment": "positive",
            "PublishDate": 1741955374000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Ltd: Secures ₹81-Crore Water Supply Contract in Chennai",
            "Summary": "RPP Infra Projects Ltd has received a letter of acceptance for a ₹80.98 crore contract from Chennai Metropolitan Water Supply and Sewerage Board. The project involves improving water supply infrastructure in Chennai, including constructing underground tanks, setting up distribution stations, and laying water mains. The contract also includes stormwater drainage works. The project is set to be completed within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1741181763000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Secures Orders Worth 809.8 Million Rupees",
            "Summary": "RPP Infra Projects has announced winning new orders valued at 809.8 million rupees. This development indicates a positive business momentum for the company, potentially boosting its project pipeline and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1741179614000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Secures Orders Worth 1.09 Billion Rupees",
            "Summary": "RPP Infra Projects has announced winning new orders valued at 1.09 billion rupees. This development indicates a positive business momentum for the company, potentially boosting its project pipeline and revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1740961223000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Secures Orders Worth 1.09 Billion Rupees",
            "Summary": "RPP Infra Projects has announced that it has won new orders valued at 1.09 billion rupees. This development indicates a positive business momentum for the company, potentially boosting its project pipeline and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1740750108000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Secures New Orders Worth 627.8 Million Rupees",
            "Summary": "RPP Infra Projects has announced winning new orders valued at 627.8 million rupees. This development indicates potential growth in the company's project pipeline and revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1739924287000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Secures Orders Worth 627.8 Million Rupees",
            "Summary": "RPP Infra Projects has announced winning new orders valued at 627.8 million rupees. This development indicates a positive business momentum for the company, potentially boosting its project pipeline and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1739884849000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "RPP Infra Projects has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) rose to 262 million rupees, compared to 107 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 7.38% from 3.27% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739535758000,
            "Source": "earnings"
        },
        {
            "Title": "RPP Infra Projects Reports Increased Q3 Profit and Revenue",
            "Summary": "RPP Infra Projects has announced its Q3 financial results. The company's consolidated net profit increased to 189 million rupees, up from 161 million rupees in the same quarter last year. Revenue also saw growth, reaching 3.55 billion rupees compared to 3.26 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739535752000,
            "Source": "earnings"
        },
        {
            "Title": "RPP Infra Projects Secures Orders Worth 287.7 Million Rupees",
            "Summary": "RPP Infra Projects has won new orders valued at 287.7 million rupees. This development indicates the company's continued business growth and its ability to secure new projects in the infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1737591040000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Secures Orders Worth 287.7 Million Rupees",
            "Summary": "RPP Infra Projects has announced winning new orders valued at 287.7 million rupees. This development indicates positive business growth and potential revenue increase for the company in the near future.",
            "Sentiment": "positive",
            "PublishDate": 1737553839000,
            "Source": "order&deals"
        },
        {
            "Title": "RPP Infra Projects Enters Partnership with Paper Pack Packaging Industry",
            "Summary": "RPP Infra Projects has announced a new partnership with a paper pack packaging industry. The company will contribute up to 80 million rupees to the partnership, with a 95% profit-sharing agreement in place.",
            "Sentiment": "positive",
            "PublishDate": 1735689868000,
            "Source": "corporate_action"
        },
        {
            "Title": "RPP Infra Projects Enters Partnership with Paper Pack Packaging Industry",
            "Summary": "RPP Infra Projects has announced a new partnership with Paper Pack Packaging Industry. The company will contribute up to 80 million rupees to the partnership, with a 95% profit sharing agreement in place.",
            "Sentiment": "positive",
            "PublishDate": 1735645704000,
            "Source": "corporate_action"
        },
        {
            "Title": "RPP Infra Projects Considers Partnership Agreement with Paper Packaging Industry",
            "Summary": "RPP Infra Projects is considering a partnership agreement with a paper packaging industry. The agreement involves a contribution of 8 crore rupees and a profit-sharing ratio of 95% for RPP Infra Projects.",
            "Sentiment": "positive",
            "PublishDate": 1735226062000,
            "Source": "corporate_action"
        },
        {
            "Title": "R.P.P Infra Projects to Collaborate on '96 Legends' Project in Sri Lanka",
            "Summary": "R.P.P Infra Projects has agreed in principle to collaborate with Wills Realtors Pvt Ltd on the development of the '96 Legends' project in Sri Lanka. The collaboration includes partial capital expenditure funding for the project.",
            "Sentiment": "positive",
            "PublishDate": 1733312845000,
            "Source": "corporate_action"
        }
    ]
}