{
    "Symbol": "RPPL",
    "ISIN": "INE760W01023",
    "News": [
        {
            "Title": "Rajshree Polypack Expands Extrusion Machinery Capacity by 1,600 MTPA",
            "Summary": "Rajshree Polypack has added 1,600 MTPA capacity for extrusion machinery operations. The expansion brings the company's total capacity to 25,600 MTPA, representing a capacity enhancement for the polypack manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1763107230476,
            "Source": "stock"
        },
        {
            "Title": "Rajshree PolyPack Expands Injection Molded Food Packaging Capacity",
            "Summary": "Rajshree PolyPack has increased its injection molded food packaging capacity by 900 MTPA (Metric Tonnes Per Annum). This expansion brings the company's total capacity to 4,200 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1751440359000,
            "Source": "default"
        },
        {
            "Title": "Rajshree Polypack Signs 90-Year Lease for New Manufacturing Unit in Odisha",
            "Summary": "Rajshree Polypack has entered into a 90-year lease agreement with IDCO (Industrial Development Corporation of Odisha) to set up a new manufacturing unit in Odisha. This move indicates the company's plans for expansion and long-term investment in the state.",
            "Sentiment": "positive",
            "PublishDate": 1750636741000,
            "Source": "default"
        },
        {
            "Title": "Rajshree Polypack Secures 90-Year Lease for New Manufacturing Facility in Odisha",
            "Summary": "Rajshree Polypack has entered into a 90-year lease agreement with IDCO (Industrial Development Corporation of Odisha) for a new manufacturing facility in Odisha. The company plans to establish this facility, indicating an expansion of its operations into the state.",
            "Sentiment": "positive",
            "PublishDate": 1750420550000,
            "Source": "default"
        },
        {
            "Title": "Rajshree Polypack Secures Export Orders Worth ₹9.14 Crore from U.S. Distributors",
            "Summary": "Rajshree Polypack has obtained export orders valued at ₹9.14 crore from distributors based in the United States. This development indicates the company's expansion into international markets and potential growth in its export business.",
            "Sentiment": "positive",
            "PublishDate": 1743144739000,
            "Source": "order&deals"
        }
    ]
}