{
    "Symbol": "RPSGVENT",
    "ISIN": "INE425Y01011",
    "News": [
        {
            "Title": "RPSG Ventures Reports Q3FY26 Results with Mixed Performance",
            "Summary": "RPSG Ventures announced Q3FY26 results showing standalone profit of ₹2.59 crore vs ₹7.46 crore YoY, while consolidated operations faced losses due to exceptional items totaling ₹103.90 crore.",
            "Sentiment": "negative",
            "PublishDate": 1770377207543,
            "Source": "co_actions_results"
        },
        {
            "Title": "RPSG Ventures Board Meet Set for Feb 6 for Q3FY26 Results",
            "Summary": "RPSG Ventures Limited has scheduled a board meeting on February 6, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769770115893,
            "Source": "co_actions_results"
        },
        {
            "Title": "RPSG Ventures Acquires 40% Stake in FSP Design",
            "Summary": "RPSG Ventures has purchased a 40% stake in FSP Design, marking a strategic investment move by the company. The acquisition expands RPSG Ventures' portfolio and establishes a significant ownership position in the design firm.",
            "Sentiment": "positive",
            "PublishDate": 1763596997864,
            "Source": "order&deals"
        },
        {
            "Title": "RPSG Ventures Reports Higher Q2 Revenue and Improved Losses",
            "Summary": "RPSG Ventures reported Q2 revenue of 26.7 billion rupees, up from 21.7 billion rupees in the same period last year. The company's EBITDA increased to 3.05 billion rupees from 2.17 billion rupees year-over-year, with EBITDA margin improving to 11.46% from 10.02%. The consolidated net loss narrowed to 520 million rupees compared to a loss of 779 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762759974624,
            "Source": "earnings"
        },
        {
            "Title": "RPSG Group to Launch Cell and Module Manufacturing with 3 GW Capacity Target",
            "Summary": "RPSG Group Chairman Sanjiv Goenka announced the company's entry into cell and module manufacturing, with the first gigawatt of module capacity expected to begin operations within 45 days. The group plans to establish 3 GW each of cell and module capacity over the next three years. Goenka indicated that production will primarily serve the group's own facilities while also targeting export markets. The chairman reaffirmed confidence in achieving the ₹2 lakh crore market capitalisation target within 30 months, noting that internal targets have been scaled up since last year. Renewables will constitute a significant portion of RPSG's ₹1 lakh crore capital expenditure plans over five years, with 3.2 GW currently under implementation and another 4 GW nearing closure. The group aims for approximately 10 GW in renewables capacity over six years.",
            "Sentiment": "positive",
            "PublishDate": 1758266026197,
            "Source": "stock"
        },
        {
            "Title": "RPSG Ventures Reports 18% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "RPSG Ventures reported a consolidated net profit of 831 million rupees for Q1, down from 1.02 billion rupees in the same period last year, representing an 18.5% decline. However, the company's revenue increased to 29.7 billion rupees compared to 25.2 billion rupees year-over-year, marking an 18% growth in the top line.",
            "Sentiment": "neutral",
            "PublishDate": 1754039971639,
            "Source": "earnings"
        },
        {
            "Title": "RPSG Ventures Acquires 70% Stake in Manchester Originals for £81.2 Million",
            "Summary": "RPSG Ventures has acquired a 70% stake in Manchester Originals for £81.2 million. The transaction represents a significant investment by RPSG Ventures in the sports franchise.",
            "Sentiment": "positive",
            "PublishDate": 1753710394181,
            "Source": "order&deals"
        },
        {
            "Title": "RPSG Ventures Reports Mixed Q4 Results",
            "Summary": "RPSG Ventures announced its Q4 financial results. The company's EBITDA increased to 3.3 billion rupees from 2.3 billion year-over-year, with EBITDA margin improving to 13.17% from 11.16%. Revenue grew to 25 billion rupees from 20.2 billion. However, the company still reported a consolidated net loss of 130 million rupees, though this was an improvement from the 998 million loss in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747300242000,
            "Source": "result"
        },
        {
            "Title": "RPSG Ventures to Consider Q4 Results on May 15",
            "Summary": "RPSG Ventures has announced that it will consider its fourth quarter (Q4) financial results on May 15. This indicates that the company is preparing to release its earnings report for the last quarter of its fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746537664000,
            "Source": "default"
        },
        {
            "Title": "RPSG Ventures Reports Q3 Financial Results",
            "Summary": "RPSG Ventures announced its Q3 consolidated financial results. The company reported a net loss of 600 million rupees, slightly improved from a loss of 611 million rupees in the same quarter last year. Revenue increased to 23.8 billion rupees from 18.5 billion rupees year-over-year, showing significant growth.",
            "Sentiment": "neutral",
            "PublishDate": 1739518385000,
            "Source": "earnings"
        },
        {
            "Title": "RPSG Ventures Subsidiary to Acquire Controlling Stake in Manchester Originals",
            "Summary": "A subsidiary of RPSG Ventures is set to acquire a controlling stake in Manchester Originals, a cricket team in The Hundred competition. This move represents a significant expansion for RPSG Ventures into international cricket franchises.",
            "Sentiment": "positive",
            "PublishDate": 1739276878000,
            "Source": "corporate_action"
        },
        {
            "Title": "RPSG Ventures to Consider Q3 Results",
            "Summary": "RPSG Ventures has announced that it will consider its third quarter (Q3) financial results on February 14. This indicates that the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1738759896000,
            "Source": "result"
        },
        {
            "Title": "RPSG Ventures Reports Q2 Financial Results",
            "Summary": "RPSG Ventures has announced its Q2 financial results. The company's EBITDA for the quarter stands at 2.17 billion rupees, compared to 2.1 billion rupees in the same quarter last year. However, the EBITDA margin has decreased from 11.80% to 10.02% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730886907000,
            "Source": "result"
        },
        {
            "Title": "RPSG Ventures Reports Q2 Revenue Growth",
            "Summary": "RPSG Ventures has announced its Q2 revenue figures, showing an increase to 21.7 billion rupees from 17.9 billion rupees in the same quarter last year. This represents a year-over-year growth in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730886788000,
            "Source": "result"
        },
        {
            "Title": "RPSG Ventures Reports Increased Q2 Consolidated Net Loss",
            "Summary": "RPSG Ventures has reported a consolidated net loss of 779 million for the second quarter, compared to a loss of 346 million in the same period last year. This represents a significant increase in losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730886760000,
            "Source": "result"
        },
        {
            "Title": "RPSG Ventures Expands into US Ayurvedic Market",
            "Summary": "<p><span class='neutral'>RPSG Ventures</span> has <span class='positive'>incorporated</span> a new subsidiary, <span class='neutral'>Natural Wellness Inc</span>, in the <span class='neutral'>United States</span>. This move is aimed at <span class='positive'>expanding</span> the company's presence in the <span class='neutral'>Ayurvedic health products market</span> in the <b>USA</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728525594000,
            "Source": "corporate_action"
        }
    ]
}