{
    "Symbol": "RPTECH",
    "ISIN": "INE0J1F01024",
    "News": [
        {
            "Title": "Rashi Peripherals Q3 FY26 Revenue Surges 43% YoY",
            "Summary": "Rashi Peripherals delivered strong Q3 FY26 performance with consolidated revenue growing 43% YoY to INR4,030 crores and PAT jumping 132% to INR75 crores, driven by price increases and volume growth amid component shortages.",
            "Sentiment": "positive",
            "PublishDate": 1770628831604,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rashi Peripherals Appoints Two Additional Directors",
            "Summary": "Rashi Peripherals Limited board approves appointment of Rajesh Goenka as Whole-Time Director and CEO for 5 years, and Dr. Indumati Gopinathan as Independent Director till 38th AGM.",
            "Sentiment": "positive",
            "PublishDate": 1770132467941,
            "Source": "stocks"
        },
        {
            "Title": "Rashi Peripherals Q3FY26 Earnings Call on Feb 4",
            "Summary": "Rashi Peripherals Limited has scheduled an earnings conference call for February 4, 2026 at 11:00 AM IST to discuss Q3FY26 and nine-month financial results, hosted by Monarch Networth Capital.",
            "Sentiment": "neutral",
            "PublishDate": 1769671770517,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rashi Peripherals Receives ₹1.96 Cr GST Demand Order",
            "Summary": "Rashi Peripherals Limited received a GST demand order of ₹1.96 crores from Assistant Commissioner for FY 2021-22, alleging wrong ITC availment. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1767262329894,
            "Source": "stocks"
        },
        {
            "Title": "Rashi Peripherals: MKC Family Trust Acquires 11.22% Stake",
            "Summary": "MKC Family Trust acquired 73.92 lakh equity shares (11.22% stake) in Rashi Peripherals through gift transfer from promoter Keshav Choudhary on December 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766223041742,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rashi Peripherals Seeks Shareholder Approval to Increase Borrowing Limit to Rs 3,500 Crore",
            "Summary": "Rashi Peripherals has issued a postal ballot notice seeking shareholder approval to enhance its borrowing limit from Rs 2,500 crore to Rs 3,500 crore and authorize creation of charges on company assets for securing borrowings. The e-voting period runs from November 28, 2025 to December 27, 2025, with the company citing emerging market opportunities as the reason for seeking additional funding capacity.",
            "Sentiment": "neutral",
            "PublishDate": 1764251387674,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashi Peripherals Reports 12.1% Revenue Growth in Q2 FY26, Adds Dell Commercial Partnership",
            "Summary": "Rashi Peripherals achieved revenue of Rs 4,155.4 million in Q2 FY26, up 12.1% year-over-year, with EBITDA at Rs 1,081 million and PAT at Rs 592.2 million. The company expanded its distribution network with new branches in Maharashtra, launched an ESOP program, and added Dell Commercial Technologies to its portfolio while maintaining positive cash flow.",
            "Sentiment": "positive",
            "PublishDate": 1763122309653,
            "Source": "earnings"
        },
        {
            "Title": "Rashi Peripherals Wins Significant Reduction in GST Demand from Rs 11.83 Crore to Rs 8.11 Lacs",
            "Summary": "Rashi Peripherals Limited received a favorable order from the Department of Goods and Service Tax, Government of Maharashtra, regarding an appeal against a GST demand. The company had appealed against a demand order for Rs 11.83 crore pertaining to 2017-18. The appeal order dated November 7, 2025, partially allowed the GST Department's demand but significantly reduced it to Rs 8.11 lacs (including interest and penalty). The breakdown shows GST amount reduced from Rs 5.48 crore to Rs 3.12 lacs, interest from Rs 60.82 lacs to Rs 4.68 lacs, and penalty from Rs 26.55 lacs to Rs 31,208. This represents a substantial reduction from the original demand of Rs 11.83 crore to the final determined amount of Rs 8.11 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1762896995634,
            "Source": "stock"
        },
        {
            "Title": "Rashi Peripherals Reports Mixed Q2 Results with Revenue Growth but Lower Profit",
            "Summary": "Rashi Peripherals reported quarterly revenue of 4.16 billion rupees, up from 3.7 billion rupees in the same period last year. However, consolidated net profit declined to 585 million rupees from 697 million rupees year-over-year. EBITDA increased to 1.04 billion rupees from 989 million rupees, while EBITDA margin compressed to 2.50% from 2.67% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762527250106,
            "Source": "earnings"
        },
        {
            "Title": "Rashi Peripherals Limited Announces Resignation of Company Secretary and Compliance Officer",
            "Summary": "Rashi Peripherals Limited announced the resignation of two key managerial personnel. Ms. Hinal Shah, Company Secretary and Key Managerial Personnel, submitted her resignation on October 31, 2025, to pursue better career opportunities. Mr. Tejas Vyas, Compliance Officer and Key Managerial Personnel, also resigned on October 31, 2025, citing personal reasons. Both resignations will be effective from the close of business hours on November 7, 2025. The company confirmed that both executives stated there are no other material reasons for their resignations beyond those mentioned in their respective resignation letters.",
            "Sentiment": "neutral",
            "PublishDate": 1761926636063,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rashi Peripherals Wins ₹135 Crore Customs Dispute",
            "Summary": "Rashi Peripherals received a favorable ruling from the customs authority as the Principal Commissioner of Customs in Mumbai canceled a ₹135 crore demand against the company. This decision resolves a significant customs-related matter for the electronics peripherals company.",
            "Sentiment": "positive",
            "PublishDate": 1761745575508,
            "Source": "stock"
        },
        {
            "Title": "Rashi Peripherals: Promoter Group Member Transfers 2.4% Stake to Family Trust via Gift",
            "Summary": "Manju Suresh Pansari, a promoter group member of Rashi Peripherals Limited, transferred 15,81,592 shares (2.40% of total voting capital) to Kapal Pansari Family Trust through an inter-se gift transfer on September 15, 2025. Following the transaction, Manju Suresh Pansari's shareholding decreased from 8.07% to 5.67%, while Kapal Pansari Family Trust's holding increased from 0.36% to 2.76%. The company has an equity share capital of Rs. 32.95 crore divided into 6.59 crore equity shares of Rs. 5 each. The shares are listed on BSE and NSE under scrip code 544119 and symbol RPTECH respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1758022035509,
            "Source": "corporate_action"
        },
        {
            "Title": "Chaman Pansari Family Trust Acquires 2.40% Stake in Rashi Peripherals Through Gift Transfer",
            "Summary": "Chaman Pansari Family Trust acquired 15,81,592 shares of Rashi Peripherals Limited through a gift transfer from promoters on September 10, 2025. The acquisition increased the trust's shareholding from 2,40,000 shares (0.36%) to 18,21,592 shares (2.76%) of the company's total equity. The shares were acquired through an off-market gift transaction. Rashi Peripherals has an equity share capital of Rs. 32.95 crore divided into 6.59 crore equity shares of Rs. 5 each. The company's shares are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1757675773220,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashi Peripherals Promoter Group Member Transfers 3.91% Stake Through Gift Transaction",
            "Summary": "Gazal Chaman Pansari, a promoter group member of Rashi Peripherals Limited, has transferred her entire shareholding of 25,79,934 shares (3.91% of total share capital) to Chaman Suresh Pansari through an inter-se gift transaction on August 22, 2025. Following the transfer, Gazal Chaman Pansari's holding reduced to zero, while Chaman Suresh Pansari's stake increased from 23,94,000 shares (3.63%) to 49,73,934 shares (7.55%). The company's total equity share capital remains unchanged at Rs. 32,94,98,325 divided into 6,58,99,665 equity shares of Rs. 5 each. The transaction was disclosed to BSE and NSE as required under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1756118635834,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashi Peripherals Reports 23% EBITDA Growth Despite 26% Revenue Decline in Q1 FY2026",
            "Summary": "Rashi Peripherals Limited reported quarterly results with revenue of INR 31,521 million, down 26% year-on-year, though excluding a one-time project deal from the previous year, revenue grew 11.4%. EBITDA increased 23% to INR 1,114 million with margins expanding 140 basis points to 3.5%. PAT rose 12.1% to INR 617 million with margins improving 70 basis points to 2%. The ICT distributor added four new strategic brands including MSI, Norden, Riello, and ALOGIC. Business segments showed mixed performance with regular channel business achieving fastest growth while online business experienced degrowth. The surveillance vertical, started a year ago, is experiencing strong growth and expected to reach significant annual revenue. Working capital days increased to 73 from the usual 50-55 range due to delayed payments and strategic inventory decisions. Management expects the overall PC market to grow 6-9% in FY2026, with the company targeting double the market growth rate. The Windows 10 end-of-support cycle starting October 2025 is anticipated to drive demand in the second half of FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1754982209684,
            "Source": "earnings"
        },
        {
            "Title": "Rashi Peripherals Reports 23% EBITDA Growth in Q1 FY26, Plans Expansion in AI and Surveillance",
            "Summary": "Rashi Peripherals reported a 23% year-over-year increase in EBITDA for Q1 FY26, with margins at 3.5% due to improved efficiency. The company is focusing on steady growth through AI solutions and increased surveillance business. Management plans to expand operations beyond major cities, strengthen brand partnerships, and diversify its portfolio across IT, mobility, and enterprise sectors to capitalize on India's digital and AI infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1754405352199,
            "Source": "earnings"
        },
        {
            "Title": "Rashi Peripherals Reports Q1 FY26 Results, Schedules AGM for September 9",
            "Summary": "Rashi Peripherals Limited approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue of Rs. 30,527.27 million and profit after tax of Rs. 588.25 million for the quarter. Consolidated revenue stood at Rs. 31,521.43 million with profit after tax of Rs. 617.00 million. The board scheduled the 36th Annual General Meeting for September 9, 2025, via video conferencing. Directors recommended a dividend of Rs. 2 per equity share for FY2025, with record date set as August 11, 2025. The board approved re-appointment of Chairman Krishna Kumar Choudhary and Vice-Chairman Sureshkumar Pansari for five-year terms from October 1, 2025 to September 30, 2030. The company sold its entire 51% stake in subsidiary Znet Technologies Private Limited on June 17, 2025. IPO proceeds utilization shows Rs. 55.28 million remaining unutilized for general corporate purposes out of the original Rs. 5,541.41 million raised.",
            "Sentiment": "neutral",
            "PublishDate": 1754399307251,
            "Source": "earnings"
        },
        {
            "Title": "Rashi Peripherals Recommends Final Dividend",
            "Summary": "Rashi Peripherals has recommended a final dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748002985000,
            "Source": "result"
        },
        {
            "Title": "Rashi Peripherals Reports Q4 Financial Results",
            "Summary": "Rashi Peripherals announced its Q4 financial results. The company's EBITDA increased to 937 million rupees from 680 million rupees year-over-year. The EBITDA margin improved to 3.15% from 2.26% in the same period. Consolidated net profit rose to 513 million rupees from 398 million rupees year-over-year and 318 million rupees quarter-over-quarter. However, revenue slightly decreased to 29.7 billion rupees from 30 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748002936000,
            "Source": "result"
        },
        {
            "Title": "Chargesheet Filed Against Rashi Peripherals and Directors",
            "Summary": "Rashi Peripherals has reported that a chargesheet has been filed against the company and its directors. The company has denied these allegations, describing them as baseless and frivolous. No further details about the nature of the charges or the filing authority have been provided in the news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1746144550000,
            "Source": "default"
        },
        {
            "Title": "Chargesheet Filed Against Rashi Peripherals and Directors",
            "Summary": "Rashi Peripherals has reported that a chargesheet has been filed against the company and its directors. The company has denied these allegations, describing them as baseless and frivolous.",
            "Sentiment": "negative",
            "PublishDate": 1746101916000,
            "Source": "default"
        },
        {
            "Title": "Rashi Peripherals Abandons Acquisition of Satcom Info Tech",
            "Summary": "The board of Rashi Peripherals has decided not to proceed with the previously considered acquisition of shares in Satcom Info Tech. This decision marks a significant change in the company's strategic plans.",
            "Sentiment": "neutral",
            "PublishDate": 1745244737000,
            "Source": "default"
        },
        {
            "Title": "Rashi Peripherals Reports Low Quick Commerce Sales, Expects Q4 Growth",
            "Summary": "Rashi Peripherals has disclosed that sales through quick commerce channels constitute less than 1% of their total sales. Despite this low percentage, the company remains optimistic about its future performance, projecting a return to double-digit growth in the fourth quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739434767000,
            "Source": "earnings"
        },
        {
            "Title": "Rashi Peripherals Reports Q3 Financial Results",
            "Summary": "Rashi Peripherals has announced its Q3 consolidated financial results. The company's net profit increased to 318 million rupees, up from 252 million rupees in the same quarter last year. Revenue also saw growth, reaching 28 billion rupees compared to 26 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739405848000,
            "Source": "earnings"
        },
        {
            "Title": "Rashi Peripherals Reports Significant Decline in Q3 EBITDA",
            "Summary": "Rashi Peripherals experienced a substantial decrease in its third-quarter EBITDA, dropping from 640 million rupees to 214 million rupees year-over-year. The company's EBITDA margin also contracted sharply, falling from 2.44% to 0.76% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739364578000,
            "Source": "earnings"
        },
        {
            "Title": "Rashi Peripherals Reports Increased Q3 Profit and Revenue",
            "Summary": "Rashi Peripherals has announced its Q3 financial results. The company's consolidated net profit increased to 318 million rupees from 252 million rupees in the same quarter last year. Revenue also saw growth, rising to 28 billion rupees from 26 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739364567000,
            "Source": "earnings"
        },
        {
            "Title": "Rashi Peripherals to Acquire 70% Stake in Satcom Infotech",
            "Summary": "Rashi Peripherals has announced plans to acquire a 70% stake in Satcom Infotech. This strategic acquisition is aimed at expanding RP Tech's cybersecurity portfolio, strengthening its position in the technology distribution market.",
            "Sentiment": "positive",
            "PublishDate": 1736985864000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashi Peripherals to Acquire 70% Stake in Satcom Infotech",
            "Summary": "Rashi Peripherals has announced plans to acquire a 70% stake in Satcom Infotech. This strategic acquisition is aimed at expanding RP Tech's cybersecurity portfolio, indicating a move to strengthen its position in the technology and security sectors.",
            "Sentiment": "positive",
            "PublishDate": 1736939109000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashi Peripherals Approves Investment in Satcom Info Tech",
            "Summary": "The board of Rashi Peripherals has approved an investment of up to 140 million rupees in Satcom Info Tech. Satcom Info Tech operates in the distribution of Information and Communication Technology (ICT), specifically focusing on cyber security products.",
            "Sentiment": "positive",
            "PublishDate": 1736813528000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashi Peripherals Approves Investment in Satcom Info Tech",
            "Summary": "Rashi Peripherals' board has approved an investment of up to 140 million rupees in Satcom Info Tech, a company specializing in the distribution of Information and Communication Technology (ICT) products, particularly in the cyber security sector.",
            "Sentiment": "positive",
            "PublishDate": 1736767050000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rashi Peripherals Reports Strong Q2 EBITDA Growth",
            "Summary": "Rashi Peripherals has announced its Q2 financial results, showing significant year-over-year improvement. The company's EBITDA increased to 989 million rupees from 694 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 2.67% from 2.30% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730192130000,
            "Source": "result"
        },
        {
            "Title": "Rashi Peripherals Reports Q2 Revenue Growth",
            "Summary": "Rashi Peripherals has announced its Q2 revenue results, showing an increase from 3 billion rupees to 3.7 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730192056000,
            "Source": "result"
        },
        {
            "Title": "Rashi Peripherals Reports Significant Profit Growth in Q2",
            "Summary": "Rashi Peripherals has announced its Q2 consolidated net profit of 697 million rupees, compared to 261 million rupees in the same quarter last year, representing a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730192029000,
            "Source": "result"
        }
    ]
}