{
    "Symbol": "RRKABEL",
    "ISIN": "INE777K01022",
    "News": [
        {
            "Title": "RR Kabel Q3 Net Profit Surges 76% to ₹1.2B",
            "Summary": "RR Kabel reports strong Q3 performance with net profit jumping 76% to ₹1.2 billion and revenue growing 42% to ₹25.3 billion year-on-year, demonstrating robust business momentum.",
            "Sentiment": "positive",
            "PublishDate": 1769948244526,
            "Source": "co_actions_results"
        },
        {
            "Title": "R R Kabel faces ₹1.01 crore GST penalty from CGST",
            "Summary": "R R Kabel Limited disclosed a GST penalty of ₹1,01,70,919 imposed by Central GST & Central Excise for alleged supplies without actual movement of goods. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1769879871751,
            "Source": "stocks"
        },
        {
            "Title": "RR Kabel Appoints Three Senior Management Personnel",
            "Summary": "RR Kabel Limited's board approved redesignation of Vivek CM as Chief Sales Officer and appointed Manjari Modi and Manish Balodi to senior positions in wires and cables division.",
            "Sentiment": "positive",
            "PublishDate": 1769873301337,
            "Source": "stocks"
        },
        {
            "Title": "RR Kabel Q3FY26 Earnings Call Set for February 2",
            "Summary": "RR Kabel Limited announces earnings conference call scheduled for February 2, 2026, to discuss Q3 and nine months FY26 financial results with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1768997283755,
            "Source": "co_actions_results"
        },
        {
            "Title": "RR Kabel H1 FY26 Net Profit Surges 80.9% to ₹206 Cr",
            "Summary": "RR Kabel reports highest-ever half-yearly performance with revenue rising 16.7% to ₹4,222 crore. Company targets 18% CAGR growth through Project RRise amid expanding data centre demand.",
            "Sentiment": "positive",
            "PublishDate": 1768378420776,
            "Source": "stocks"
        },
        {
            "Title": "RR Kabel faces ₹34.12L penalty from CGST authorities",
            "Summary": "RR Kabel Limited received two penalty orders totaling ₹34.12 lakhs from CGST authorities in Daman for alleged supplies without actual movement of goods under ex-parte proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1765524722266,
            "Source": "stocks"
        },
        {
            "Title": "RR Kabel Co-CEO Vivek Abrol Steps Down from FMEG Division",
            "Summary": "Vivek Abrol has resigned from his position as Co-CEO of the FMEG (Fast Moving Electrical Goods) division at RR Kabel. The departure represents a leadership change in the company's electrical goods segment.",
            "Sentiment": "neutral",
            "PublishDate": 1765237726558,
            "Source": "corporate_governance"
        },
        {
            "Title": "RR Kabel Allots 1,484 Equity Shares Under Employee Stock Option Plan",
            "Summary": "RR Kabel Limited has allotted 1,484 equity shares with a face value of ₹5 each to an eligible employee who exercised vested options under the RR Kabel Employee Stock Option Plan 2020. The allotment was approved by the Finance and Allotment Committee. Following this allotment, the company's paid-up equity share capital increased from ₹56,54,38,585 (comprising 11,30,87,717 equity shares) to ₹56,54,46,005 (comprising 11,30,89,201 equity shares). The shares were issued on November 1, 2025, and will rank pari-passu with existing equity shares of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762790830385,
            "Source": "corporate_action"
        },
        {
            "Title": "RR Kabel Reports Strong Q2 FY26 Results with 19.5% Revenue Growth and 105.8% EBITDA Jump",
            "Summary": "RR Kabel Limited delivered robust quarterly results with revenue from operations reaching INR 2,163.8 crores, marking 19.5% year-on-year growth compared to INR 1,810.1 crores in Q2 FY25. EBITDA surged 105.8% to INR 176.1 crores from INR 85.6 crores, with margins expanding to 8.1% from 4.7%. Profit after tax jumped 134.7% to INR 116.3 crores versus INR 49.5 crores, with PAT margins improving to 5.4% from 2.7%. The wires and cables segment drove growth with 22.3% revenue increase to INR 1,971.2 crores and 16% volume expansion. The company announced leadership changes with Rajesh Jain transitioning from CFO to COO and Jigar Mehta becoming the new CFO. For the first half of FY26, the company achieved its highest ever half-yearly revenue and reported record H1 PAT of INR 206 crores, up 80.9% year-on-year. Management expressed confidence in maintaining sequential growth and expects the second half to outperform the first half, targeting EBIT margins of 10.5%-11% by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1762535254604,
            "Source": "earnings"
        },
        {
            "Title": "RR Kabel Promoter Mahendrakumar Kabra Gifts 2.17% Stake to Family Members",
            "Summary": "Mahendrakumar Rameshwarlal Kabra, a promoter of RR Kabel Limited, transferred 24,56,278 shares (2.17% stake) to his immediate relatives Sumeet Kabra and Hemant Kabra through gift transactions on November 4, 2025. The transfer reduced Mahendrakumar's holding from 8.00% to 5.83% of the company's total equity capital. The transaction was conducted as an off-market inter-se transfer between promoter group members. The overall promoter and promoter group holding remains unchanged at 6,98,46,196 equity shares, representing 61.76% of RR Kabel's total equity capital of INR 56,54,38,585 consisting of 11,30,87,717 shares of INR 5 each.",
            "Sentiment": "neutral",
            "PublishDate": 1762404314528,
            "Source": "corporate_action"
        },
        {
            "Title": "RR Kabel Targets Double-Digit EBIT Margins Within Three Years",
            "Summary": "RR Kabel plans to achieve double-digit EBIT margins over the next two to three years, according to Chief Operating Officer Rajesh Jain. The company's wire and cable EBIT margins were 7.4% last year, with a target improvement of 100-110 basis points. RR Kabel has allocated Rs 1,200 crore in capital expenditure over three years, primarily focused on expanding cable segment capacity. The wire segment operates at 70% capacity utilization while the cable segment runs at 90% utilization. The company uses dual hedging strategies for copper price volatility, with 100% back-to-back coverage for B2B and export business, and price adjustments for B2C business when copper prices move 2-3%. RR Kabel reported 22% year-on-year growth in its core wires and cables business for the first half, with 16% volume growth. Profit after tax increased 134.7% year-on-year to Rs 116.3 crore. The company targets 18% volume growth year-on-year for the third quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762235586905,
            "Source": "stock"
        },
        {
            "Title": "R R Kabel Targets 16-18% Volume Growth for FY26",
            "Summary": "R R Kabel's executive announced the company's volume growth expectations of 16-18% for FY26. The company is specifically targeting approximately 21% growth in the second half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762169363918,
            "Source": "stock"
        },
        {
            "Title": "RR Kabel Reports Strong Q2 Performance with Net Profit Surging 133% Year-on-Year",
            "Summary": "RR Kabel delivered robust quarterly results with net profit rising to 1.16 billion rupees from 497.5 million rupees year-on-year. Revenue increased to 21.6 billion rupees compared to 18.1 billion rupees in the same period last year. EBITDA more than doubled to 1.76 billion rupees from 858 million rupees year-on-year, while EBITDA margin expanded significantly to 8.13% from 4.74% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762128830662,
            "Source": "earnings"
        },
        {
            "Title": "RR Kabel Reports Quarterly Results and Declares Interim Dividend of ₹4 Per Share",
            "Summary": "RR Kabel Limited announced its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company declared an interim dividend of ₹4 per share (80%) on equity shares with face value of ₹5 each for financial year 2025-26, with record date set for November 7, 2025. The dividend will be paid within 30 days from declaration. The company also announced key management changes: Rajesh Babu Jain has been redesignated from Chief Financial Officer to Chief Operating Officer - WAC Business effective November 1, 2025, while Jigar Mehta, currently Vice President-Finance, has been appointed as the new Chief Financial Officer from the same date. The board meeting was held on October 31, 2025, and the financial results received an unmodified review conclusion from statutory auditors BSR Co. LLP.",
            "Sentiment": "positive",
            "PublishDate": 1761922995122,
            "Source": "corporate_action"
        },
        {
            "Title": "RR Kabel Targets Double-Digit Growth with 16%+ Volume Expansion in Wires and Cables",
            "Summary": "RR Kabel has outlined growth targets focused on sustained double-digit expansion driven by increasing demand in the wires and cables segment, with volume growth exceeding 16%. The company plans to improve margins through operational efficiencies and scale up its FMEG (Fast Moving Electrical Goods) portfolio. Expansion strategies include strengthening export operations, optimizing working capital management, and increasing brand presence in tier-2 and tier-3 markets.",
            "Sentiment": "positive",
            "PublishDate": 1761917797326,
            "Source": "stock"
        },
        {
            "Title": "RR Kabel Declares Rs 4 Dividend Per Share, Reports Strong Q2 Performance",
            "Summary": "RR Kabel has declared a dividend of Rs 4 per share. The company reported quarterly net profit of Rs 1.16 billion compared to Rs 497.5 million in the same period last year. Revenue increased to Rs 21.6 billion from Rs 18.1 billion year-over-year. EBITDA rose to Rs 1.76 billion from Rs 858 million, with EBITDA margin improving to 8.13% from 4.74% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761915288168,
            "Source": "corporate_action"
        },
        {
            "Title": "R R Kabel Appoints Vivek Dubey as Assistant Vice President - Procurement",
            "Summary": "R R Kabel Limited has appointed Shri Vivek Dubey as Assistant Vice President – Procurement, designated as Senior Management Personnel, effective from 12 August 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Dubey is a Commerce graduate with a Diploma in Business Management from ICFAI and MBA in SCM from ISBM. He brings over 18 years of experience in procurement and sourcing, having previously worked with Apar Industries Limited as General Manager – Procurement. The appointment is on a full-time employment basis as per company policy.",
            "Sentiment": "positive",
            "PublishDate": 1754489537295,
            "Source": "corporate_governance"
        },
        {
            "Title": "R R Kabel Reports Strong Q1 FY26 Results with 13.9% Revenue Growth and 50% EBITDA Jump",
            "Summary": "R R Kabel Limited delivered robust quarterly results with revenue from operations rising 13.9% year-on-year to INR 2,058.6 crores. EBITDA surged 50% to INR 143.1 crores, expanding margins to 7% from 5.3% in the same quarter last year. Profit after tax grew 39.4% to INR 89.8 crores. The wire and cable segment posted 16.2% revenue growth to INR 1,833.5 crores with overall volume growth of 6.5% - wires grew 10% while cables grew 2%. The FMEG segment narrowed losses to INR 7.1 crores from INR 20.7 crores previously. Management maintained guidance of 18% volume growth and 100 basis points margin improvement for the full year. The company expects 10-12% growth in wires and 25% growth in cables, with plans to invest INR 1,200 crores in capacity expansion over three years. Export business showed strong performance with higher volume growth, while domestic growth was driven primarily by the wire segment.",
            "Sentiment": "positive",
            "PublishDate": 1754406588361,
            "Source": "earnings"
        },
        {
            "Title": "RR Kabel Expects Strong Double-Digit Growth Driven by Wire and Cable Demand",
            "Summary": "RR Kabel anticipates strong double-digit growth driven by demand for wires and cables. The company expects profit recovery in its FMEG (Fast Moving Electrical Goods) segment and improved operations. RR Kabel aims to achieve higher export rates and better working capital management for sustainable margins.",
            "Sentiment": "positive",
            "PublishDate": 1753971729155,
            "Source": "stock"
        },
        {
            "Title": "RR Kabel Reports 39% Jump in Quarterly Net Profit to 888 Million Rupees",
            "Summary": "RR Kabel reported quarterly net profit of 888 million rupees compared to 639 million rupees in the same period last year. Revenue increased to 20.58 billion rupees from 18.1 billion rupees year-over-year. The company's EBITDA rose to 1.42 billion rupees from 950 million rupees, while EBITDA margin improved to 6.90% from 5.25% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753967765819,
            "Source": "earnings"
        },
        {
            "Title": "R R Kabel Limited Schedules Earnings Conference Call for Q1 FY26 Results",
            "Summary": "R R Kabel Limited has scheduled an earnings conference call on August 1, 2025, at 2:30 PM IST to discuss financial results for the quarter ended June 30, 2025. The call will feature senior management including Managing Director Mahendrakumar Kabra and Chief Financial Officer Rajesh Jain. The company has provided multiple access numbers for participants including domestic and international toll-free numbers for Hong Kong, Singapore, USA, and UK. MUFG Intime India Private Limited is coordinating the call arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1753762767454,
            "Source": "earnings"
        },
        {
            "Title": "R R Kabel: Mid-Cap Stock Surges 20% Post Strong Q4 Results",
            "Summary": "R R Kabel's share price has gained nearly 20% in two trading sessions following its Q4 results. HSBC expects an additional 15% upside, setting a target price of ₹1400. The company reported strong Q4 performance with revenue, EBITDA, and net profit growth exceeding expectations. R R Kabel announced a medium-term strategic plan aiming to increase EBITDA by 2.5 times over FY25-28.",
            "Sentiment": "positive",
            "PublishDate": 1746526368000,
            "Source": "earnings"
        },
        {
            "Title": "R R Kabel: Q4 Profit Surges 63%, Beats Estimates",
            "Summary": "R R Kabel's Q4 consolidated net profit rose 63% to Rs 129 crore, surpassing estimates. Revenue increased 26.39% to Rs 2,217 crore. EBITDA grew 68.55% to Rs 193.5 crore with margin expansion. The board recommended a final dividend of Rs 3.5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1746420126000,
            "Source": "earnings"
        },
        {
            "Title": "RR Kabel Ltd: Record Q4 Revenue and Ambitious Expansion Plans",
            "Summary": "RR Kabel reported its highest-ever quarterly revenue of ₹2,271.83 crore, up 29.5% YoY. EBITDA grew 70% YoY with margins expanding 200 bps. The company announced plans to add 36,000 MT capacity at Waghodia plant and 6,000 MT at Silvassa unit. RR Kabel aims for 18% CAGR in wires and cables business over next three years.",
            "Sentiment": "positive",
            "PublishDate": 1746418681000,
            "Source": "result"
        },
        {
            "Title": "R R Kabel Approves Major Capacity Expansion",
            "Summary": "R R Kabel has approved capacity expansion plans for its Waghodia and Silvassa units, focusing on wires and cables production. The Silvassa expansion is estimated to cost approximately 4 billion rupees, while the Waghodia expansion is projected at around 10.50 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746196074000,
            "Source": "default"
        },
        {
            "Title": "R R Kabel Ltd: Q4 Profit Drops 84% But Beats Estimates",
            "Summary": "R R Kabel's Q4 FY25 net profit fell 84% YoY to Rs 129 crore, surpassing analyst estimates. Revenue increased 26.4% to Rs 2,217 crore. The company recommended a final dividend of Rs 3.5 per share for FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1746195951000,
            "Source": "earnings"
        },
        {
            "Title": "R R Kabel to Consider Q4 Results on May 2",
            "Summary": "R R Kabel has announced that it will consider its fourth quarter (Q4) financial results on May 2. This indicates the company is preparing to disclose its performance for the latest fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745494549000,
            "Source": "default"
        },
        {
            "Title": "R R Kabel to Meet with Motilal Oswal",
            "Summary": "R R Kabel has scheduled a meeting with Motilal Oswal on March 24. This meeting likely involves discussions between the company and the financial services firm, possibly for investment-related matters or financial advisory services.",
            "Sentiment": "neutral",
            "PublishDate": 1742286224000,
            "Source": "corporate_governance"
        },
        {
            "Title": "R R Kabel: Q3 Profit Dips 3.37% YoY, Revenue Up 9.1%",
            "Summary": "R R Kabel reported Q3 FY25 results with profit at ₹68.57 crore, down 3.37% YoY, and revenue at ₹1782.15 crore, up 9.1% YoY. Quarterly revenue declined 1.55% while profit increased 38.44% compared to Q2. EPS stood at ₹6.07, down 4.26% YoY. Analysts' consensus recommendation is Strong Buy.",
            "Sentiment": "neutral",
            "PublishDate": 1738130573000,
            "Source": "earnings"
        },
        {
            "Title": "R R Kabel Reports Mixed Q3 Financial Results",
            "Summary": "R R Kabel has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q3 was 1.1 billion rupees, slightly down from 1.13 billion rupees in the same quarter last year. The EBITDA margin decreased to 6.20% from 6.89% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738074696000,
            "Source": "earnings"
        },
        {
            "Title": "R R Kabel Reports Q3 Financial Results",
            "Summary": "R R Kabel has announced its financial results for the third quarter. The company reported a net profit of 681 million rupees, which is lower compared to 709 million rupees in the same quarter last year but higher than 498 million rupees in the previous quarter. Revenue for Q3 stood at 17.8 billion rupees, showing an increase from 16.33 billion rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738074644000,
            "Source": "earnings"
        },
        {
            "Title": "R R Kabel CFO Projects 15% Volume Growth for H2FY25",
            "Summary": "The Chief Financial Officer of R R Kabel has stated that the company expects a volume growth of 15% for the second half of fiscal year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1729837415000,
            "Source": "normal_news"
        },
        {
            "Title": "R R Kabel Expects Margin Improvements and On-Track CAPEX Plans",
            "Summary": "R R Kabel has announced that they anticipate margin improvements in the second half of the year. Additionally, the company reports that their capital expenditure plans are progressing as scheduled and are set to be completed by the end of the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1729786878000,
            "Source": "corporate_action"
        },
        {
            "Title": "RR Kabel Declares Dividend of 2.5 Rupees Per Share",
            "Summary": "RR Kabel has announced a dividend of 2.5 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729784795000,
            "Source": "corporate_action"
        },
        {
            "Title": "RR Kabel: Q2 Profit Drops 33% Despite 12% Revenue Growth",
            "Summary": "RR Kabel reported a 33% decline in Q2 consolidated net profit to Rs 49.5 crore, while revenue increased 12% to Rs 1,810 crore. EBITDA fell 29% to Rs 86 crore, with margins shrinking by 280 basis points to 4.7%.",
            "Sentiment": "negative",
            "PublishDate": 1729777248000,
            "Source": "result"
        }
    ]
}