{
    "Symbol": "RSSOFTWARE",
    "ISIN": "INE165B01029",
    "News": [
        {
            "Title": "RS Software Reports Q2FY26 Loss of ₹536.59 Lac",
            "Summary": "RS Software (India) Ltd posted a standalone net loss of ₹536.59 lac for Q2FY26 compared to profit of ₹585.59 lac in Q2FY25. Revenue declined 64.72% to ₹606.87 lac.",
            "Sentiment": "negative",
            "PublishDate": 1769758390293,
            "Source": "co_actions_results"
        },
        {
            "Title": "RS Software Q3FY26 Revenue Drops 58% to ₹537.64 Lac",
            "Summary": "RS Software (India) Limited reported Q3FY26 revenue of ₹537.64 lac, down 58% YoY from ₹1,276.62 lac. Company posted net loss of ₹807.21 lac vs profit of ₹6.29 lac in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1768981260800,
            "Source": "co_actions_results"
        },
        {
            "Title": "RS Software Board Meet on Jan 21 for Q3 Results",
            "Summary": "RS Software India Ltd schedules board meeting for January 21, 2026 to consider audited financial results for period ending December 31, 2025. Trading window closed from January 1-23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767856154858,
            "Source": "co_actions_results"
        },
        {
            "Title": "RS Software Reports Delayed Project Closures Impact Fiscal Performance Despite AI Integration and UPI Growth",
            "Summary": "RS Software's fiscal performance has been impacted by delays in large payment modernization projects at country level, though the company remains profit and cash flow positive over the past 3.5 years with Rs 300 crore invested in product development. The company continues to gain revenue from NPCI's UPI cross-border integrations across 10 countries and expects significant improvement in fiscal 27-28, while strengthening sales coverage in North America and other regions.",
            "Sentiment": "neutral",
            "PublishDate": 1763729427041,
            "Source": "stock"
        },
        {
            "Title": "RS Software Reports Loss of Rs 536.59 Lacs in Latest Quarter",
            "Summary": "RS Software (India) Limited reported a net loss of Rs 536.59 lacs for the quarter ended September 30, 2025, compared to a profit of Rs 585.59 lacs in the same period last year. Revenue from operations declined to Rs 606.87 lacs from Rs 1,720.43 lacs year-over-year. The company's consolidated results showed a loss of Rs 591.67 lacs for the quarter. Employee benefits expense increased to Rs 750.69 lacs from Rs 825.07 lacs. The Board of Directors approved the audited standalone and consolidated financial results for the period ending September 30, 2025, with statutory auditors providing unqualified audit opinions.",
            "Sentiment": "negative",
            "PublishDate": 1762384924579,
            "Source": "earnings"
        },
        {
            "Title": "R S Software CEO Rajnit Rai Jain Purchases 19,546 Equity Shares",
            "Summary": "Rajnit Rai Jain, Promoter and CEO & Managing Director of R S Software (India) Ltd, purchased 19,546 equity shares of the company from the market on August 07, 2025. The company submitted Form C to stock exchanges as required under SEBI insider trading regulations. The transaction was disclosed through proper regulatory channels with CFO & Company Secretary Vijendra Kumar Surana signing the intimation letter.",
            "Sentiment": "positive",
            "PublishDate": 1754582806210,
            "Source": "stock"
        },
        {
            "Title": "R S Software CEO Rajnit Rai Jain Purchases 2,454 Equity Shares",
            "Summary": "Rajnit Rai Jain, Promoter and CEO & Managing Director of R S Software (India) Ltd, purchased 2,454 equity shares from the market on August 06, 2025, valued at ₹1,62,398.60. The transaction increased his shareholding from 10,170,628 shares (39.37%) to 10,173,082 shares (39.38%). The purchase was made through on-market acquisition and was disclosed in compliance with insider trading regulations.",
            "Sentiment": "positive",
            "PublishDate": 1754576363043,
            "Source": "corporate_action"
        },
        {
            "Title": "R S Software Promoter and CEO Rajnit Rai Jain Acquires 24,000 Equity Shares",
            "Summary": "Rajnit Rai Jain, Promoter and CEO & Managing Director of R S Software (India) Ltd, purchased 24,000 equity shares from the market on July 31, 2025, for ₹18,74,755.20. Following this acquisition, his shareholding increased from 10,146,628 shares (39.28%) to 10,170,628 shares (39.37%). The transaction was conducted through on-market purchase and reported in compliance with SEBI Insider Trading Regulations.",
            "Sentiment": "positive",
            "PublishDate": 1753979047118,
            "Source": "corporate_action"
        },
        {
            "Title": "R S Software (India) Ltd Approves Audited Financial Results for Quarter Ending June 30, 2025",
            "Summary": "R S Software (India) Ltd's Board of Directors approved the company's audited standalone and consolidated financial results for the quarter ending June 30, 2025, during a board meeting held on July 22, 2025. The meeting took place from 3:30 PM to 4:30 PM. The company submitted the financial results along with unmodified auditor's reports to stock exchanges BSE and NSE. The auditor's reports contain unmodified opinions and the financial results follow the format prescribed in Schedule III of the Companies Act 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1753184363095,
            "Source": "earnings"
        }
    ]
}