{
    "Symbol": "RSWM",
    "ISIN": "INE611A01016",
    "News": [
        {
            "Title": "RSWM Limited Reports Q3 FY25 Financial Results",
            "Summary": "RSWM Limited submitted newspaper cuttings for its unaudited financial results for quarter and nine months ended December 31, 2025, published in Business Standard and other newspapers on February 12, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770888350826,
            "Source": "co_actions_results"
        },
        {
            "Title": "RSWM Board Approves MD Reappointment & Rs 300 Crore Guarantee",
            "Summary": "RSWM Limited's board approved reappointment of Managing Director Riju Jhunjhunwala for 3 years and sanctioned corporate guarantee of up to Rs 300 crore for subsidiary's bottle recycling project.",
            "Sentiment": "positive",
            "PublishDate": 1770813195930,
            "Source": "stocks"
        },
        {
            "Title": "RSWM Gets ESG Rating of 55 from SEBI Registered Agency",
            "Summary": "RSWM Limited receives ESG rating of 55 from ESG Risk Assessments & Insights Limited on January 28, 2026, based on publicly available data under voluntary assessment.",
            "Sentiment": "neutral",
            "PublishDate": 1769608476461,
            "Source": "stocks"
        },
        {
            "Title": "RSWM's Chief HR Officer Manoj Sharma Superannuates",
            "Summary": "RSWM Limited announces the superannuation of Shri Manoj Sharma, Chief Human Resources Officer, effective January 27, 2026, in compliance with SEBI disclosure requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769521827786,
            "Source": "stocks"
        },
        {
            "Title": "RSWM Completes Share Purchase Agreement",
            "Summary": "RSWM has completed an agreement to purchase shares from Bhilwara Energy and LNJ Greenpet, though specific transaction details remain undisclosed.",
            "Sentiment": "neutral",
            "PublishDate": 1769003185838,
            "Source": "co_actions_results"
        },
        {
            "Title": "RSWM Signs ₹52 Cr Deal with Malik Heights",
            "Summary": "RSWM terminates contract with Didwania Trading and immediately secures new ₹52 crore agreement with Malik Heights for thermal power plant assets sale on December 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765377271454,
            "Source": "co_actions_results"
        },
        {
            "Title": "RSWM Limited Reports Turnaround to Profitability Despite Textile Industry Challenges in Q2 FY26",
            "Summary": "RSWM Limited achieved a turnaround to profitability with PAT of ₹6.3 crores in Q2 FY26 versus a loss of ₹21 crores in Q2 FY25. Revenue declined 1.4% YoY to ₹1,150 crores due to lower capacity utilization in melange and knit businesses. EBITDA surged 85.6% YoY to ₹79 crores with margins expanding to 6.8% from 3.6%. The company faced challenges from 50% U.S. tariffs on textile goods and cotton import duty removal, which negatively impacted cotton yarn prices by 5-6%. RSWM invested in 70 MW renewable energy capacity to achieve 70% green energy consumption and announced ₹92 crores investment for knit division expansion from 700 to 900 tons monthly capacity, including new printing facilities. Finance costs reduced 11.5% YoY through better financial planning. The company reduced inventory by ₹121 crores and receivables by ₹51 crores compared to March 2025. Management expects annual savings of ₹30-40 crores from renewable energy investments.",
            "Sentiment": "positive",
            "PublishDate": 1762918570746,
            "Source": "earnings"
        },
        {
            "Title": "RSWM Targets Export Growth Through India-UK and India-EU Trade Agreements",
            "Summary": "RSWM is positioning itself to capitalize on export opportunities through India-UK and upcoming India-EU Free Trade Agreements, aiming for improved market access and reduced tariffs. The company is focusing on sustainable investments including increased use of recycled fibers, renewable energy adoption, and water-efficient technology. Management anticipates a gradual recovery in the second half and emphasizes innovation, cost efficiency, and supply chain optimization as critical drivers for future growth.",
            "Sentiment": "positive",
            "PublishDate": 1762438433679,
            "Source": "stock"
        },
        {
            "Title": "RSWM Limited Reports Quarterly Loss, Announces Acquisition and Unit Closure",
            "Summary": "RSWM Limited reported a net loss of Rs. 6.28 crores for the quarter ended September 30, 2025, compared to a loss of Rs. 6.96 crores in the previous quarter. The company's revenue from operations stood at Rs. 1,199.58 crores for the quarter. The Board approved the acquisition of 100% shareholding in LNJ Greenpet Private Limited for Rs. 20.01 crores from Bhilwara Energy Limited, making it a wholly owned subsidiary. LNJ Greenpet operates in PET bottle recycling business and focuses on creating food-grade recycled PET resin. Additionally, RSWM announced the closure of spinning operations at its Chhata unit effective November 6, 2025. The company also entered into investment agreements with Adani Solar Energy Jodhpur Six Limited and Adani Renewable Energy Forty One Limited for securing 60MW renewable energy for its power requirements in Rajasthan.",
            "Sentiment": "negative",
            "PublishDate": 1762437793643,
            "Source": "corporate_action"
        },
        {
            "Title": "RSWM Reports Q2 Net Profit of 62.8M Rupees After Previous Year Loss",
            "Summary": "RSWM posted a net profit of 62.8 million rupees in Q2, compared to a loss of 212 million rupees in the same period last year. Revenue declined to 11.5 billion rupees from 11.66 billion rupees year-over-year. EBITDA nearly doubled to 693.1 million rupees from 357.1 million rupees, while EBITDA margin expanded to 6.03% from 3.06% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762433584785,
            "Source": "earnings"
        },
        {
            "Title": "RSWM Partners with Adani Energy Solutions for 60MW Green Energy Supply",
            "Summary": "RSWM Limited has signed an agreement with Adani Energy Solutions Ltd. (AESL) for the supply of 60MW of renewable energy. RSWM invested ₹60 crores under the Group Captive Scheme with a renewable generator for the supply of 31.53 crore units of green power annually to its manufacturing facilities across Rajasthan. This partnership will increase RSWM's renewable energy contribution from the current 33% to 70% of its total energy requirements. AESL will manage the entire green power value chain for RSWM's additional power requirements. The collaboration aims to reduce RSWM's carbon footprint while enhancing long-term energy security and operational efficiency. AESL is targeting a Commercial & Industrial portfolio of 7,000MW over the next five years.",
            "Sentiment": "positive",
            "PublishDate": 1762329465266,
            "Source": "order&deals"
        },
        {
            "Title": "RSWM Signs Investment Deals with Adani Solar and Adani Renewable Energy",
            "Summary": "RSWM has entered into investment agreements with Adani Solar and Adani Renewable Energy. The deals involve partnerships in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1761921724146,
            "Source": "order&deals"
        },
        {
            "Title": "RSWM Approves 600 Million Rupee Investment for 60MW Renewable Energy Project",
            "Summary": "RSWM has approved an investment of 600 million rupees for a 60MW renewable energy project. This represents the company's move into the renewable energy sector with a significant capital allocation.",
            "Sentiment": "positive",
            "PublishDate": 1761829742506,
            "Source": "stock"
        },
        {
            "Title": "RSWM Limited Schedules Q2 & H1 FY26 Earnings Conference Call for November 6, 2025",
            "Summary": "RSWM Limited has announced an earnings conference call scheduled for Thursday, November 6, 2025, at 6:00 PM IST to discuss the company's unaudited standalone and consolidated financial results for Q2 & H1 FY26 period ending September 30, 2025. The management team will present the company's financial performance and conduct a Q&A session. The call details include multiple dial-in numbers for domestic and international participants. The company's press release and investor presentation will be made available on their website after the results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1761568979891,
            "Source": "earnings"
        },
        {
            "Title": "RSWM Limited Signs Rs 54.11 Crore Agreement to Purchase Machinery from Birla Advanced Knits for Capacity Expansion",
            "Summary": "RSWM Limited entered into an agreement with Birla Advanced Knits Private Limited to purchase dying, processing, and knitting machinery worth Rs 54.11 crores. The machinery will be installed at the company's Mordi and Chhata Units to modernize operations. The investment is expected to increase knitting business capacity by 20%, from 750 MT per month to 900 MT per month, within 6 months. The company's existing capacity utilization stands at 75-80%. The purchase will be financed through internal accruals and debt. The expansion includes addition of printing facility and aims to enhance growth opportunities by offering a complete product range to garment manufacturers in India and abroad, ultimately improving overall capacity utilization.",
            "Sentiment": "positive",
            "PublishDate": 1760362421660,
            "Source": "stock"
        },
        {
            "Title": "RSWM Limited Launches 100-Day 'Saksham Niveshak' Campaign to Help Shareholders Claim Unclaimed Dividends",
            "Summary": "RSWM Limited has initiated a 100-day campaign called 'Saksham Niveshak' aimed at engaging shareholders to prevent the transfer of unclaimed dividends to the Investor Education and Protection Fund (IEPF). The company is sending communications to shareholders who have unclaimed dividends, requesting them to claim their funds immediately. Shareholders are required to submit specific documents including a letter of undertaking, self-attested copies of PAN card and address proof, and a cancelled cheque copy to the company's registrar and transfer agent MCS Share Transfer Agent Limited in New Delhi. The campaign information is available on the company's website at www.rswm.in.",
            "Sentiment": "neutral",
            "PublishDate": 1757591778899,
            "Source": "corporate_action"
        },
        {
            "Title": "RSWM's Bhilwara Energy Limited Receives Additional INR 250 Crore Investment from Singularity Fund",
            "Summary": "RSWM Limited announced that Singularity Growth Opportunities Fund II has exercised its additional investment option in Bhilwara Energy Limited (BEL). The board of directors of BEL approved the allotment of 1,75,95,979 partly paid-up equity shares at INR 142.08 per share, with BEL receiving INR 25 crore as initial payment representing 10% of the additional subscription amount. This follows an earlier investment of approximately INR 250 crore by Singularity and its affiliates in BEL. Following this additional allotment, the investors' holdings in BEL will increase from 9.6% to 17.51%. The remaining 90% of the additional subscription amount will be paid when called by BEL according to the Share Subscription and Shareholders' Agreement terms.",
            "Sentiment": "positive",
            "PublishDate": 1757419412546,
            "Source": "order&deals"
        },
        {
            "Title": "RSWM Abandons ₹740 Crore Kathua Project Due to Economic Challenges",
            "Summary": "RSWM has decided to drop its ₹740 crore greenfield project in Kathua that was planned for manufacturing recycled PET chips and filament yarn. The company cited non-viability due to prevailing economic and geopolitical conditions as the reason for abandoning the project. RSWM will surrender the land that was allotted for this manufacturing facility.",
            "Sentiment": "negative",
            "PublishDate": 1757332553291,
            "Source": "stock"
        },
        {
            "Title": "RSWM Limited Signs 25 MW Renewable Energy Agreement with Adani Green Subsidiary",
            "Summary": "RSWM Limited has entered into a Power Supply and Management Agreement with Powerpulse Trading Solutions Limited, a power supply company of Adani Green Energy Limited, to secure 25 MW of renewable energy comprising solar and wind power under a Group Captive Scheme. The agreement aims to enhance RSWM's existing renewable energy capacity and support the company's sustainability goals by shifting maximum power demand to renewable energy sources. Additional related agreements are under finalization and will be executed shortly. Powerpulse Trading Solutions Limited is not a related party to RSWM.",
            "Sentiment": "positive",
            "PublishDate": 1756986706748,
            "Source": "stock"
        },
        {
            "Title": "RSWM Limited Reports Q1 FY26 Results with 50.6% EBITDA Growth and ₹142 Crore CAPEX Plan",
            "Summary": "RSWM Limited reported Q1 FY26 revenue of ₹1,169 crore, down 3.2% year-over-year due to subdued export demand. However, EBITDA surged 50.6% to ₹81 crore with margin expanding to 6.9%. The company turned profitable with PAT of ₹7 crore versus a loss of ₹13.7 crore in Q1 FY25. The board approved ₹92 crore CAPEX to expand knitting capacity by 20% from 750 to 900 metric tons monthly, expected to generate ₹220 crore additional annual revenue. Additionally, ₹50 crore will be invested in 50 megawatt renewable energy capacity, increasing green energy footprint from 74 to 124 megawatt. The company is rationalizing spinning operations at its Chhata unit while continuing knitting operations there. Management highlighted challenges from 25% US tariffs but noted opportunities from the UK-India FTA removing 9-12% duties. RSWM operates with 70% domestic revenue exposure, limiting direct US market impact. Total borrowings stand at ₹1,600 crore with plans to maintain debt levels through balanced new borrowing and repayments.",
            "Sentiment": "positive",
            "PublishDate": 1754992012959,
            "Source": "earnings"
        },
        {
            "Title": "RSWM Limited Reports Quarterly Results, Approves ₹92 Crore Capex and Closes Spinning Operations at Chhata Unit",
            "Summary": "RSWM Limited approved unaudited financial results for the quarter ended June 30, 2025. The Board made several strategic decisions including closure of spinning operations at Chhata Unit due to limited use of old spinning assets, with usable spindles to be transferred to other plants for modernization. The company approved capex of up to ₹92 crores for upgrading knitting operations at Mardi and Chhata Units, expected to increase knitting capacity by 20% from 750 MT/month to 900 MT/month and boost revenue by approximately ₹220 crores annually. Additionally, the Board granted approval for investment in 50MW renewable energy capacity (solar and wind) with ₹50 crore investment to enhance sustainability goals. The company also paid a penalty of ₹1,95,000 plus GST for non-compliance with SEBI regulations, with the Board advising greater caution to avoid similar incidents in future.",
            "Sentiment": "neutral",
            "PublishDate": 1754399195551,
            "Source": "corporate_governance"
        },
        {
            "Title": "RSWM to Close Spinning Operations at Chhata Unit",
            "Summary": "RSWM has announced it will close spinning operations at its Chhata facility. The company will halt all spinning activities at this unit.",
            "Sentiment": "negative",
            "PublishDate": 1754398569311,
            "Source": "stock"
        },
        {
            "Title": "RSWM Limited Reports Q1 FY2026 Results, Approves ₹92 Crore Capex and Renewable Energy Investment",
            "Summary": "RSWM Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone net profit of ₹6.96 crores compared to a loss of ₹13.68 crores in the same quarter last year. Revenue from operations stood at ₹1,169.19 crores. The Board approved several strategic decisions including rationalization of spinning operations at Chhata Unit due to limited use of old spinning assets, with closure expected in 6-8 months. The spinning operations contributed ₹329 crores (6.82% of consolidated turnover) in FY2025. The company approved ₹92 crores capex for modernization of knitting operations at Mardi and Chhata Units, expected to increase knitting capacity by 20% from 750 MT/month to 900 MT/month, potentially adding ₹220 crores annual revenue. Additionally, the Board approved investment in 50MW renewable energy capacity (solar and wind), with orders placed for 10MW captive power and discussions ongoing for 25MW capacity. The company's existing renewable energy capacity stands at 74MW.",
            "Sentiment": "positive",
            "PublishDate": 1754398409462,
            "Source": "earnings"
        },
        {
            "Title": "RSWM Reports 47% Jump in Q1 EBITDA to 694 Million Rupees",
            "Summary": "RSWM's Q1 EBITDA increased to 694 million rupees compared to 472 million rupees in the same period last year. The company's EBITDA margin improved to 5.94% from 3.9% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754397485088,
            "Source": "earnings"
        },
        {
            "Title": "RSWM Reports Q1 Net Profit of 70M Rupees After Previous Year Loss",
            "Summary": "RSWM posted a net profit of 70 million rupees in Q1, compared to a loss of 137 million rupees in the same period last year. The company's revenue declined to 11.69 billion rupees from 12.1 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754396354483,
            "Source": "earnings"
        },
        {
            "Title": "RSWM Reports Improved Q4 Financial Performance",
            "Summary": "RSWM Limited has reported an exceptional item of 1.38 billion rupees in its March 31, 2024 result. For Q4, the company's Profit Before Tax (PBT) improved to 65 million rupees, compared to a loss of 170 million rupees in the same period last year. EBITDA for Q4 increased to 700 million rupees from 439 million rupees year-over-year, with the EBITDA margin expanding to 5.57% from 3.75%.",
            "Sentiment": "positive",
            "PublishDate": 1747142797000,
            "Source": "result"
        },
        {
            "Title": "RSWM Reports Q4 FY23 Financial Results",
            "Summary": "RSWM Limited has reported its Q4 financial results. The company's net profit decreased significantly to 16 million rupees, compared to 996 million rupees in the same quarter last year. This also represents a loss of 80 million rupees compared to the previous quarter. However, revenue increased to 12.6 billion rupees from 11.71 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747142647000,
            "Source": "result"
        },
        {
            "Title": "RSWM Ltd and Birla Cellulose Collaborate on Graphene-Enhanced Textiles",
            "Summary": "RSWM Ltd, a textile company, has announced a collaboration with Birla Cellulose to explore the development of functional textiles incorporating graphene technology. This partnership aims to innovate in the textile industry by combining RSWM's expertise with Birla Cellulose's advanced materials, potentially leading to new products with enhanced properties.",
            "Sentiment": "positive",
            "PublishDate": 1739518249000,
            "Source": "corporate_action"
        },
        {
            "Title": "RSWM Reports Reduced Q3 Loss and Increased Revenue",
            "Summary": "RSWM Limited has reported financial results for the third quarter. The company's net loss has decreased to 80 million rupees, compared to a loss of 321 million rupees in the same quarter last year. Revenue has increased to 11.96 billion rupees from 9.77 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739369088000,
            "Source": "earnings"
        },
        {
            "Title": "RSWM MD Optimistic About Indian Textile Industry's Future",
            "Summary": "The Managing Director of RSWM expresses confidence in the long-term prospects of the Indian textile industry. The company sees significant growth potential in sustainable practices, technical textiles, and digital textile printing. RSWM is strategically focusing on these value-added segments to capitalize on future opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1731469065000,
            "Source": "normal_news"
        }
    ]
}