{
    "Symbol": "RSYSTEMS",
    "ISIN": "INE411H01032",
    "News": [
        {
            "Title": "R Systems schedules Q3FY26 results call Feb 11",
            "Summary": "R Systems International Limited announces investor/analysts call on February 11, 2026 at 10:00 AM IST to discuss Q3FY26 and FY26 financial results for quarter and year ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770836589992,
            "Source": "co_actions_results"
        },
        {
            "Title": "R Systems Reports Strong FY25 Growth with 17.8% EBITDA Jump",
            "Summary": "R Systems International delivered robust FY25 performance with revenue of Rs 19,582 mn (12.4% YoY growth) and normalized EBITDA of Rs 3,427 mn (17.8% YoY growth). Q4 revenue reached Rs 5,551 mn with 18.3% EBITDA margin.",
            "Sentiment": "positive",
            "PublishDate": 1770745797813,
            "Source": "co_actions_results"
        },
        {
            "Title": "R Systems Confirms Non-Applicability of LC Framework",
            "Summary": "R Systems International Limited disclosed that it does not fall under the Large Corporate category as per SEBI circular dated August 10, 2021, making the LC framework non-applicable to the company.",
            "Sentiment": "neutral",
            "PublishDate": 1769525012213,
            "Source": "stocks"
        },
        {
            "Title": "N.R. International Appoints New Company Secretary",
            "Summary": "N.R. International Limited has appointed Mr. Gaurav Pandey as Company Secretary and Compliance Officer effective December 15, 2025, in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768906848781,
            "Source": "stocks"
        },
        {
            "Title": "R Systems Launches GCC Copilot, Expands to Mexico",
            "Summary": "R Systems International launches AI-powered GCC Copilot service following three-fold demand increase, expands operations to Mexico and enhances Romania center to serve North America and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1768389694796,
            "Source": "stocks"
        },
        {
            "Title": "R Systems Acquires Novigo Solutions for AI Growth",
            "Summary": "R Systems International completes acquisition of Novigo Solutions to strengthen its global digital engineering capabilities and artificial intelligence expertise in the competitive technology market.",
            "Sentiment": "positive",
            "PublishDate": 1765539480403,
            "Source": "co_actions_results"
        },
        {
            "Title": "RSystems Elevated to UiPath Diamond Partner Status and Recognized as Agentic Automation Fast Track Partner",
            "Summary": "RSystems International Ltd. announced its recognition as a UiPath Agentic Automation Fast Track Partner and elevation to Diamond Partner status within the UiPath Partner Network. The recognition reinforces RSystems' technical expertise in intelligent automation and commitment to helping global enterprises accelerate digital transformation using UiPath's AI-powered automation platform.",
            "Sentiment": "positive",
            "PublishDate": 1763716297731,
            "Source": "stock"
        },
        {
            "Title": "R Systems Reports Strong Q3 Growth with 7.9% Sequential Revenue Rise and AI-Driven Deal Wins",
            "Summary": "R Systems International delivered quarterly revenue of INR 498.6 crores with 16.9% EBITDA margin, driven by large deal conversions and AI-powered service offerings including their OptimaAI platform with over a dozen proprietary agents. The company secured six significant client wins in areas like Agentric AI and specialized platforms, while maintaining healthy utilization at 82.3% and adding 150+ associates to support growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1763146927734,
            "Source": "earnings"
        },
        {
            "Title": "R Systems International Allots 6,539 Equity Shares and Grants 36,000 RSUs Under Management Incentive Plan",
            "Summary": "R Systems International Limited allotted 6,539 equity shares of INR 1/- each following exercise of Restricted Stock Units under its Management Incentive Plan 2023, increasing paid-up share capital to INR 11,83,98,927/-. The company also granted 36,000 new RSUs to identified employees under the same incentive plan.",
            "Sentiment": "positive",
            "PublishDate": 1763128949146,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International Completes 100% Acquisition of Novigo Solutions",
            "Summary": "R Systems International Limited has completed the acquisition of 100% equity shares of Novigo Solutions Private Limited on November 13, 2025. The acquisition was previously approved by the Board of Directors in August 2025 and affects shareholders of both companies involved in the transaction.",
            "Sentiment": "positive",
            "PublishDate": 1763049847054,
            "Source": "order&deals"
        },
        {
            "Title": "R Systems International Board Approves ₹275 Crore Debenture Issuance",
            "Summary": "R Systems International's board has approved the issuance of 27,500 non-convertible debentures worth ₹275 crores through private placement. The debentures will be listed on BSE with a 5-year maturity period and carry an annual coupon rate of 9.75%.",
            "Sentiment": "neutral",
            "PublishDate": 1762840594722,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "R Systems International reported Q2 revenue of 5 billion rupees, up from 4.4 billion rupees year-over-year. EBITDA increased to 721 million rupees from 683 million rupees, though EBITDA margin compressed to 14.46% from 15.38%. Consolidated net profit declined to 353 million rupees compared to 398 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762440716378,
            "Source": "earnings"
        },
        {
            "Title": "R Systems International Receives ICRA [AA-] Stable Credit Rating",
            "Summary": "R Systems International Limited has been assigned a credit rating of ICRA [AA-] (Stable) by ICRA Limited. The rating was communicated through a letter dated October 30, 2025. The company informed stock exchanges NSE and BSE about this rating assignment as part of its disclosure obligations.",
            "Sentiment": "positive",
            "PublishDate": 1761854950035,
            "Source": "stock"
        },
        {
            "Title": "Bhavook Tripathi Reduces Stake in R Systems International to 32.23%",
            "Summary": "Bhavook Tripathi sold 39,06,005 equity shares of R Systems International Limited through open market transactions between April 2, 2023, and June 4, 2023. Following the sale, Tripathi's shareholding decreased from 4,20,38,375 shares to 3,81,32,370 shares, representing 32.23% of the company's total equity capital. The company has 11,83,03,445 equity shares with a face value of Rs. 1 each, and its shares are listed on both BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1761795517216,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems Acquires Novigo for ₹400 Crore to Boost AI Capabilities and Expand to Middle East",
            "Summary": "R Systems has acquired Novigo, a low-code/no-code development and intelligent automation specialist, in a deal valued at ₹400 crore upfront. Novigo has achieved 44% compound annual growth rate over three years and maintains EBITDA margins above 25%, compared to R Systems' 17.5%. The acquisition will expand R Systems' revenue base from $208 million to nearly $240 million, with Novigo contributing $30 million. The deal provides R Systems entry into the Middle East market, where Novigo generates 47% of its revenues from a $25 billion target spend market. R Systems will fund the acquisition using ₹125 crore from internal accruals and ₹275 crore through listed NCDs. CEO Nitesh Bansal expects the combined entity to achieve market-leading growth, with the deal being margin-accretive from day one. R Systems has a market capitalization of ₹5,587 crore and trades at ₹472.50, down 3% over the past year.",
            "Sentiment": "positive",
            "PublishDate": 1756112182487,
            "Source": "order&deals"
        },
        {
            "Title": "R Systems International Acquires Novigo Solutions for ₹400 Crore and Approves ₹275 Crore Debenture Placement",
            "Summary": "R Systems International has acquired 100% equity of Novigo Solutions for up to ₹400 crore. The acquisition aims to strengthen product engineering and Agentic AI capabilities while expanding presence in the Middle East and southern India. The deal is expected to be EPS accretive from the first year. Additionally, the company has approved a private placement of rated, listed, unsecured, redeemable non-convertible debentures worth ₹275 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755788077806,
            "Source": "order&deals"
        },
        {
            "Title": "R Systems International Reports Strong Q1 Performance with Net Profit Surging to 759M Rupees",
            "Summary": "R Systems International delivered strong quarterly results with consolidated net profit reaching 759 million rupees compared to 249 million rupees in the same period last year. Revenue grew to 4.6 billion rupees from 4.3 billion rupees year-over-year. The company's EBITDA increased to 702 million rupees from 612 million rupees, while EBITDA margin improved to 15.19% from 14.17% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755098061182,
            "Source": "earnings"
        },
        {
            "Title": "R Systems International Shareholders Approve Merger with Velotio Technologies and Scaleworx Technologies",
            "Summary": "R Systems International Limited received approval from equity shareholders and unsecured creditors for a composite scheme of amalgamation with Velotio Technologies Private Limited and Scaleworx Technologies Private Limited. The meetings were held on July 31, 2025, following directions from the National Company Law Tribunal, New Delhi Bench. The voting results showed strong support with 99.99867% of votes in favor from equity shareholders and 99.99643% approval from unsecured creditors excluding promoter group votes. A total of 118,380,289 shares were eligible for voting among equity shareholders, with 82.69% participation. The scrutinizer's reports were dated August 4, 2025, confirming the requisite majority was achieved for the special resolution.",
            "Sentiment": "positive",
            "PublishDate": 1754306950266,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International Holds NCLT-Ordered Meeting for Amalgamation Scheme with Velotio and Scaleworx",
            "Summary": "R Systems International Limited conducted a National Company Law Tribunal convened meeting of unsecured creditors on July 31, 2025, to consider a composite Scheme of Amalgamation involving Velotio Technologies Private Limited and Scaleworx Technologies Private Limited. The meeting was held via video conferencing with Mr. Sumit Kumar Shukla as Chairperson and Mr. Ankit Monga as Scrutinizer, pursuant to NCLT orders dated May 22, 2025 and June 10, 2025. The meeting initially lacked the required 75% quorum by value of unsecured creditors, leading to a 30-minute adjournment before resuming at 12:32 PM. The scheme involves amalgamation under Sections 230-232 of the Companies Act, 2013. Unsecured creditors were provided electronic voting facilities, with results to be shared with stock exchanges and uploaded on company websites. The meeting concluded at 12:53 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1753971576475,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International Holds Shareholder Meeting for Amalgamation Scheme with Velotio and Scaleworx Technologies",
            "Summary": "R Systems International Limited conducted a National Company Law Tribunal convened meeting of equity shareholders on July 31, 2025, to consider a composite Scheme of Amalgamation involving Velotio Technologies Private Limited and Scaleworx Technologies Private Limited. The meeting was held via video conferencing at 10:00 A.M. IST, with Mr. Sumit Kumar Shukla as Chairperson and Mr. Ankit Monga as Scrutinizer. The meeting initially lacked the required 75% quorum by value of equity shareholders and was adjourned for thirty minutes before resuming at 10:34 A.M. The shareholders present after resumption constituted the quorum as per tribunal orders. The meeting addressed the amalgamation scheme under Sections 230-232 of the Companies Act, 2013, with shareholders given fifteen minutes to cast their votes through electronic voting system. The meeting concluded at 11:05 A.M. with voting results to be shared with stock exchanges and uploaded on company websites.",
            "Sentiment": "neutral",
            "PublishDate": 1753971132931,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems Adopts Cursor AI Tool for Software Development",
            "Summary": "R Systems has selected Cursor as its AI tool to integrate artificial intelligence capabilities into its software development processes. The technology company is implementing this AI solution to enhance its development operations.",
            "Sentiment": "positive",
            "PublishDate": 1753170697696,
            "Source": "stock"
        },
        {
            "Title": "R Systems Approves ₹275 Crore Fundraising via Private Placement of Non-Convertible Debentures",
            "Summary": "R Systems' board has approved a fundraising initiative of ₹275 crores through the issuance of Non-Convertible Debentures (NCDs) via private placement. This decision represents a significant corporate financial action aimed at raising capital for the company.",
            "Sentiment": "positive",
            "PublishDate": 1752032919000,
            "Source": "default"
        },
        {
            "Title": "R Systems International to Discuss Fundraising Approval",
            "Summary": "R Systems International has scheduled a meeting on July 9 to discuss and potentially approve fundraising activities.",
            "Sentiment": "neutral",
            "PublishDate": 1751854474000,
            "Source": "default"
        },
        {
            "Title": "R Systems Denies Acquisition Talks with Coforge",
            "Summary": "R Systems has clarified that it is not in discussions with Coforge regarding a potential stake acquisition. This statement comes in response to rumors that caused R Systems' shares to surge by 6%. The company issued this clarification to address market speculation.",
            "Sentiment": "neutral",
            "PublishDate": 1750324497000,
            "Source": "default"
        },
        {
            "Title": "R Systems International Board Approves Investment and Loan Guarantees up to INR 2,000 Crores",
            "Summary": "The board of R Systems International has sanctioned investments or loan guarantees up to INR 2,000 Crores. This decision represents a significant financial commitment by the company, potentially indicating plans for expansion or strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1749181612000,
            "Source": "default"
        },
        {
            "Title": "R Systems International and Mavvrik Partner for AI Financial Governance",
            "Summary": "R Systems International has announced a partnership with Mavvrik to provide proactive financial governance solutions for AI and hybrid infrastructure. The collaboration aims to help organizations manage and optimize their AI and cloud investments more effectively.",
            "Sentiment": "positive",
            "PublishDate": 1748995727000,
            "Source": "default"
        },
        {
            "Title": "R Systems International Partners with Mavrik for Enhanced Financial Governance",
            "Summary": "R Systems International has formed a partnership with Mavrik to improve proactive financial governance for AI and hybrid infrastructure. The collaboration aims to enhance financial management in technology-driven environments.",
            "Sentiment": "positive",
            "PublishDate": 1748952792000,
            "Source": "default"
        },
        {
            "Title": "R Systems International Enhances Microsoft Partnership",
            "Summary": "R Systems International has strengthened its partnership with Microsoft by achieving Advanced Specialization in Kubernetes and securing five Solutions Partner designations. This development demonstrates the company's expertise in cloud technologies and its commitment to delivering high-quality Microsoft-based solutions.",
            "Sentiment": "positive",
            "PublishDate": 1747130199000,
            "Source": "default"
        },
        {
            "Title": "R Systems International Reports Strong Q4 Results and Declares Dividend",
            "Summary": "R Systems International announced a dividend of 6 rupees per equity share. The company reported impressive Q4 results, with EBITDA increasing to 705 million rupees from 533 million year-over-year, and EBITDA margin improving to 15.93% from 12.8%. Consolidated net profit for Q4 rose to 386 million rupees, up from 275 million year-over-year and 390 million quarter-over-quarter. Revenue for Q4 grew to 4.4 billion rupees from 4.17 billion year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1746714867000,
            "Source": "result"
        },
        {
            "Title": "R Systems International Launches IoT Smart C2C Connector on AWS",
            "Summary": "R Systems International has introduced an IoT Smart C2C (Cloud-to-Cloud) Connector on Amazon Web Services (AWS) to address integration challenges for smart home devices. This solution aims to simplify the process of connecting and managing various smart home devices across different platforms.",
            "Sentiment": "positive",
            "PublishDate": 1741220824000,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International Launches IoT Smart C2C Connector on AWS",
            "Summary": "R Systems International has introduced an IoT Smart C2C (Cloud-to-Cloud) Connector on Amazon Web Services (AWS) to address integration challenges for smart home devices. This new solution aims to simplify the process of connecting and managing various smart home devices across different platforms.",
            "Sentiment": "positive",
            "PublishDate": 1741175422000,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International Receives Regulatory Approval for Amalgamation",
            "Summary": "R Systems International has received no objections from the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) regarding its proposed amalgamation with Velotio Technologies Pvt Ltd and Scaleworx Technologies Pvt Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1740961188000,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International Receives Regulatory Approval for Amalgamation",
            "Summary": "R Systems International has received no objections from the Bombay Stock Exchange (BSE) and National Stock Exchange (NSE) regarding its proposed amalgamation with Velotio Technologies Pvt Ltd and Scaleworx Technologies Pvt Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1740760323000,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International Focuses on R&D and Product Development Projects",
            "Summary": "R Systems International is collaborating with product and platform companies on research and development and extended product development initiatives. The company is setting up dedicated teams in an Offshore Development Center (ODC) format for these projects. R Systems is involved in various projects including product development, product R&D, re-platforming, and modernization, with contracts based on specific project requirements.",
            "Sentiment": "positive",
            "PublishDate": 1739620281000,
            "Source": "normal_news"
        },
        {
            "Title": "R Systems International Expects to Maintain Current Margins",
            "Summary": "R Systems International has announced during a conference call that the company anticipates maintaining its current margin levels. The company expressed confidence in its financial stability, stating that no surprises are expected in terms of margin performance. Additionally, R Systems International revealed its ambition to achieve market-leading growth, indicating a strong focus on expansion and competitiveness within its industry.",
            "Sentiment": "positive",
            "PublishDate": 1739620044000,
            "Source": "earnings"
        },
        {
            "Title": "R Systems International Reports Improved Q3 EBITDA and Margin",
            "Summary": "R Systems International has announced its Q3 financial results, showing an increase in EBITDA to 707 million rupees from 628 million rupees year-over-year. The company's EBITDA margin also improved to 15.75% from 15.09% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739458760000,
            "Source": "earnings"
        },
        {
            "Title": "R Systems International Reports Q3 Financial Results",
            "Summary": "R Systems International has announced its Q3 financial results. The company's consolidated net profit decreased to 390 million rupees from 459 million rupees year-over-year. However, revenue increased to 4.5 billion rupees from 4.16 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739458644000,
            "Source": "earnings"
        },
        {
            "Title": "R Systems International to Sell Land and Building in Noida for 505 Million Rupees",
            "Summary": "R Systems International has announced an agreement to sell its land and building located in Noida. The deal is valued at 505 million rupees (approximately $6.1 million USD). This transaction represents a significant corporate action for the company, potentially impacting its asset portfolio and financial position.",
            "Sentiment": "positive",
            "PublishDate": 1734912586000,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International to Sell Noida Property for 505 Million Rupees",
            "Summary": "R Systems International has announced an agreement to sell its land and building located in Noida. The deal is valued at 505 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734704656000,
            "Source": "corporate_action"
        },
        {
            "Title": "R Systems International Reports Q2 Revenue Decline",
            "Summary": "R Systems International, an IT services company, reported a revenue of 4.44 billion rupees for the second quarter, down from 4.57 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731041920000,
            "Source": "result"
        },
        {
            "Title": "R Systems International Reports Q2 Financial Results",
            "Summary": "R Systems International announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 was 683 million rupees, compared to 820 million rupees in the same quarter last year, showing a year-over-year decline. The EBITDA margin also decreased from 17.93% in the previous year to 15.38% in the current quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731041916000,
            "Source": "result"
        },
        {
            "Title": "R Systems International Reports Q2 Net Profit Decline",
            "Summary": "R Systems International, an IT services company, has reported a consolidated net profit of 398 million rupees for the second quarter, down from 440 million rupees in the same period last year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1731041878000,
            "Source": "result"
        },
        {
            "Title": "R Systems: Bhavook Tripathi Sells 8.45% Stake for Rs 465 Crore",
            "Summary": "<p>Investor <span class='neutral'>Bhavook Tripathi</span> <span class='negative'>sold</span> <b>8.45%</b> stake in <span class='neutral'>R Systems International</span> for <b>Rs 465 crore</b> to various buyers including <span class='positive'>Goldman Sachs</span> and mutual funds. His holding <span class='negative'>decreased</span> from <b>29.03%</b> to <b>20.58%</b>. The company's shares <span class='positive'>closed 7.28% higher</span> at <b>Rs 504</b> on the <span class='neutral'>BSE</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728053119000,
            "Source": "block_deals"
        },
        {
            "Title": "R Systems: 8% Surge After 10 Million Share Block Deal",
            "Summary": "<p><span class='positive'>R Systems International's</span> stock price <span class='positive'>increased 8%</span> to Rs 506.50 on BSE after a <b>block deal</b> involving over 10 million shares (8.5% of total equity). The company specializes in <span class='neutral'>digital product engineering</span> and <span class='neutral'>technology solutions</span>, focusing on <span class='neutral'>Cloud, Data, AI, and CX services</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728017615000,
            "Source": "block_deals"
        },
        {
            "Title": "R Systems International: Stock Surges 5.5% in Today's Trading",
            "Summary": "<p><span class=\"positive\">R Systems International Ltd's</span> stock price <span class=\"positive\">increased by 5.5%</span> to Rs 495.65 in today's trading session. The <b>BSE Information Technology</b> index, of which R Systems is a part, <span class=\"positive\">rose 0.37%</span>. The company's stock has <span class=\"negative\">declined 1.54%</span> over the past month, slightly <span class=\"positive\">outperforming</span> the sector index.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728014400000,
            "Source": "normal_news"
        }
    ]
}