{
    "Symbol": "RTNINDIA",
    "ISIN": "INE834M01019",
    "News": [
        {
            "Title": "RattanIndia Board Meet Set for Feb 12 for Q3FY26 Results",
            "Summary": "RattanIndia Enterprises has scheduled its board meeting for February 12, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770636735976,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rattan India Partners with noon for Gulf E-commerce",
            "Summary": "Rattan India Enterprises launches Cocoblu Global Retail in UAE through partnership with noon marketplace, targeting Gulf region's rapidly expanding digital retail market worth projected USD 50 billion.",
            "Sentiment": "positive",
            "PublishDate": 1766040135917,
            "Source": "stocks"
        },
        {
            "Title": "Rattan India Enterprises Grants 54L Stock Options",
            "Summary": "Rattan India Enterprises approves grant of 54 lakh stock options under ESOP 2022 at ₹40.18 per share, while cancelling 51 lakh previously granted options surrendered by employees.",
            "Sentiment": "neutral",
            "PublishDate": 1766038274777,
            "Source": "co_actions_results"
        },
        {
            "Title": "RattanIndia Enterprises Establishes Dubai Subsidiary for Middle East E-Commerce Expansion",
            "Summary": "RattanIndia Enterprises has created a new subsidiary called Neorise Global Trading LLC in Dubai to focus on e-commerce operations in the Middle East Asia region. This strategic move positions the company to expand its business presence and tap into the growing e-commerce market in the Middle Eastern territories.",
            "Sentiment": "positive",
            "PublishDate": 1764064416171,
            "Source": "stock"
        },
        {
            "Title": "Rattan India Power Promoters Transfer Stakes to Family Trusts Under SEBI Exemption",
            "Summary": "Rajiv Rattan and spouse Anjali Nashier transferred equity shares in Nettle Constructions and partnership interests in Arbutus Consultancy LLP to four family trusts under SEBI exemption order dated September 12, 2025. The inter-se transfers resulted in indirect acquisition of voting rights over 44.06% shares in Rattan India Power Limited, though total promoter group shareholding remains unchanged.",
            "Sentiment": "neutral",
            "PublishDate": 1763987956980,
            "Source": "corporate_action"
        },
        {
            "Title": "Rattan India Enterprises Reports Loss of Rs 3,966 Million in Q2 FY26 Due to Fair Value Changes",
            "Summary": "Rattan India Enterprises Limited reported a net loss of Rs 3,966 million for the quarter ended September 30, 2025, compared to a profit of Rs 5,023 million in the previous quarter. The loss was primarily driven by net loss on fair value changes of Rs 4,575 million related to investments in equity shares of Rattan India Power Limited due to market price movements. Total income for the quarter was Rs 24,275 million versus Rs 23,467 million in the previous quarter. The company operates as an unregistered Core Investment Company, investing in technology-focused businesses including retail e-commerce, electric vehicles, fintech, and drones through subsidiary companies. The Board approved these unaudited financial results at a meeting held on November 11, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762861820467,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Enterprises Reports Widening Losses in Q2 Results",
            "Summary": "RattanIndia Enterprises reported an EBITDA loss of 4.36 billion rupees in Q2, compared to a loss of 2.4 billion rupees in the same period last year. The company's consolidated net loss also increased to 4 billion rupees from 2.4 billion rupees year-over-year. Both key financial metrics show deteriorating performance with losses nearly doubling compared to the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762853054631,
            "Source": "earnings"
        },
        {
            "Title": "Revolt Motors Launches Diwali Promotional Offer with Benefits Up to ₹1 Lakh",
            "Summary": "Revolt Motors, a subsidiary of RattanIndia Enterprises Limited, announced its Diwali Double Dhamaka offer providing benefits worth up to ₹1 lakh on electric motorcycles. The promotion includes up to ₹13,000 cash discount and free insurance worth up to ₹7,000. Customers receive assured festive gifts including TVs, laptops, smartphones, microwaves, silver coins, smartwatches, and Revolt merchandise. One customer will win a gold voucher worth up to ₹1 lakh. The offer is valid until October 21, 2025. Chairperson Anjali Rattan stated the promotion celebrates customer trust in Revolt and aims to add joy and excitement to the Revolt experience. RattanIndia Enterprises is a publicly listed company with approximately ₹7,000 crore market capitalization and operates across electric mobility, e-commerce, fashion brands, fintech, and drones sectors.",
            "Sentiment": "positive",
            "PublishDate": 1760322122259,
            "Source": "stock"
        },
        {
            "Title": "Revolt Motors Appoints Roy Kurian as President to Drive Growth Phase",
            "Summary": "Revolt Motors has appointed Roy Kurian as President during its growth phase. Kurian previously served as Senior VP of Sales & Marketing at Yamaha Motor India. Revolt Motors is associated with RattanIndia Enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1759981462033,
            "Source": "stock"
        },
        {
            "Title": "NCLT Dismisses REC's Insolvency Petition Against RattanIndia Enterprises",
            "Summary": "The National Company Law Tribunal (NCLT) has dismissed an insolvency petition filed by REC against RattanIndia Enterprises. The tribunal's decision prevents the initiation of insolvency proceedings against the company at this time.",
            "Sentiment": "positive",
            "PublishDate": 1758280043809,
            "Source": "stock"
        },
        {
            "Title": "Revolt Motors Extends 'Azadi From Petrol' Offer Until August 23 Due to High Demand",
            "Summary": "Revolt Motors has extended its 'Azadi From Petrol' promotional offer until August 23, 2025, citing overwhelming customer response and unprecedented booking demand. The offer, originally launched to celebrate India's 79th Independence Day, provides benefits worth up to ₹20,000 including zero insurance fees and additional savings on the company's AI-enabled electric motorcycle range. The promotion covers all Revolt models including RV400, RV400 BRZ, RV1, RV1+, and RV BlazeX, and is available across authorized Revolt Hubs and online. Revolt Motors is a subsidiary of RattanIndia Enterprises Limited, which has a market capitalization of approximately ₹7,000 crore and operates across 200+ Indian cities.",
            "Sentiment": "positive",
            "PublishDate": 1755484549186,
            "Source": "stock"
        },
        {
            "Title": "RattanIndia Enterprises Reports Strong Q1 FY26 Performance with Rs 2,317 Cr Total Income",
            "Summary": "RattanIndia Enterprises shared its investor presentation highlighting quarterly results showing total income of Rs 2,317 crore and profit after tax of Rs 502 crore for Q1 FY26. The company's e-commerce platform Cocoblu Retail reported revenue of Rs 1,663 crore versus Rs 1,441 crore in Q1 FY25, marking a 16% increase. The platform served 3.2 crore orders during the quarter and has serviced 34 crore orders since inception. Revolt Motors achieved the milestone of rolling out its 50,000th electric bike, having sold 12,322 units in FY25. The dealer network expanded to 211 stores across 185 cities and 24 states. NeoSky won tenders for supplying 60 Tavas drones to Karnataka police and received ISO certification. The company was featured in Fortune Magazine's list of 500 largest companies in India, moving up 25 spots to 363rd place. RattanIndia Power reported EBITDA of Rs 196 crore with 91% plant load factor and 97% availability for its Amravati thermal power plant.",
            "Sentiment": "positive",
            "PublishDate": 1754988875345,
            "Source": "stock"
        },
        {
            "Title": "RattanIndia Enterprises Submits Unaudited Financial Results for Quarter Ended June 30, 2025",
            "Summary": "RattanIndia Enterprises Limited submitted its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, to BSE Limited and National Stock Exchange of India Limited. The results were approved by the Board of Directors at a meeting held on August 12, 2025, which ran from 1:00 PM to 1:55 PM IST. The company also submitted a Limited Review Report dated August 12, 2025, issued by statutory auditors Walker Chandiok & Co. LLP on the unaudited financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1754988407446,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Enterprises Reports Decline in Q1 Financial Performance",
            "Summary": "RattanIndia Enterprises reported Q1 revenue of 23 billion rupees, down from 25 billion rupees in the previous year. The company's consolidated net profit fell to 5.03 billion rupees compared to 8.5 billion rupees year-over-year. EBITDA decreased to 6.09 billion rupees from 10.3 billion rupees, while EBITDA margin contracted to 26.32% from 41.34% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1754988052726,
            "Source": "earnings"
        },
        {
            "Title": "Revolt Motors Launches 'Azadi From Petrol' Independence Day Offer Worth ₹20,000",
            "Summary": "Revolt Motors, a subsidiary of RattanIndia Enterprises Limited, has launched an 'Azadi From Petrol' promotion for Independence Day, offering benefits worth ₹20,000 on their electric vehicles. The offer includes zero insurance fee providing free insurance coverage valued up to ₹7,000 and cash savings of up to ₹13,000. The promotion is available from August 11 to August 16, 2025, across all authorized Revolt dealerships in India. Revolt's product lineup includes RV400, RV400 BRZ, RV1, RV1+, and RV BlazeX motorcycles. RattanIndia Enterprises Limited is a public-listed company with market capitalization of approximately ₹7,000 crore and is featured in the Fortune 500 India list.",
            "Sentiment": "positive",
            "PublishDate": 1754966097060,
            "Source": "stock"
        },
        {
            "Title": "RattanIndia's Neosky Partners with Karnataka Government for Drone Security Deployment",
            "Summary": "RattanIndia Enterprises' subsidiary NeoSky India Limited has partnered with the Karnataka Government to deploy drones for enhanced security measures. The company has supplied drones to the Kalaburagi district administration and will soon provide an additional 60 Tavas drones to Karnataka Police. At an event on July 24, 2025, presided over by Karnataka Home Minister Shri Gangadharaiah Parameshwara, NeoSky officially handed over NS01 and Nimble-i surveillance drones to the Kalaburagi administration. The partnership includes a major skilling initiative where NeoSky will train 500 youth from Kalaburagi district with DGCA-approved drone pilot licenses. NeoSky has been collaborating with Indian armed forces, paramilitary forces, and state police to support security needs. The company holds a 10-year DGCA license to train and certify drone pilots and is currently training 500 graduates from agricultural universities. RattanIndia Enterprises is a public-listed company with approximately ₹7,000 crore market capitalization and is featured in the Fortune 500 India list.",
            "Sentiment": "positive",
            "PublishDate": 1754274864708,
            "Source": "stock"
        },
        {
            "Title": "RattanIndia Enterprises Approves Committee for Fund Raising",
            "Summary": "RattanIndia Enterprises has approved the creation of a committee to raise funds. The news suggests that the company is planning to secure additional capital, though specific details about the amount or purpose of the fundraising are not provided in the given information.",
            "Sentiment": "positive",
            "PublishDate": 1751456255000,
            "Source": "default"
        },
        {
            "Title": "RattanIndia Enterprises: Shares Dip Despite Revolt Motors' Sri Lanka Expansion",
            "Summary": "RattanIndia Enterprises shares down 1.80% on NSE, trading at ₹63.76. Profit booking follows Revolt Motors' expansion in Sri Lanka with new electric motorcycle models RV1 and RV1+. This marks the second phase of expansion in Sri Lanka after November 2024 launch.",
            "Sentiment": "neutral",
            "PublishDate": 1751353454000,
            "Source": "normal_news"
        },
        {
            "Title": "RattanIndia Enterprises Schedules Board Meeting to Discuss Fundraising",
            "Summary": "RattanIndia Enterprises has announced a board meeting scheduled for July 2, 2025. The purpose of the meeting is to discuss raising funds for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1751036059000,
            "Source": "default"
        },
        {
            "Title": "Revolt Motors Launches RV1 and RV1+ in Sri Lanka",
            "Summary": "RattanIndia Enterprises' subsidiary, Revolt Motors, has introduced two electric vehicle models, RV1 and RV1+, in Sri Lanka. The launch took place at the Colombo EV Motor Show 2025, marking the company's expansion into the Sri Lankan market.",
            "Sentiment": "positive",
            "PublishDate": 1750992052000,
            "Source": "default"
        },
        {
            "Title": "Revolt Motors Launches 50,000th Electric Motorcycle",
            "Summary": "Revolt Motors, a subsidiary of RattanIndia Enterprises, has achieved a significant milestone by launching its 50,000th electric motorcycle. This achievement is being celebrated as a step towards promoting India's electric vehicle future. The news highlights the growing adoption of electric vehicles in India and Revolt Motors' contribution to this trend.",
            "Sentiment": "positive",
            "PublishDate": 1750394355000,
            "Source": "default"
        },
        {
            "Title": "RattanIndia Enterprises Reports Increased Q4 EBITDA Loss and Revenue",
            "Summary": "RattanIndia Enterprises has reported its Q4 financial results. The company's EBITDA loss widened to 3.77 billion rupees, compared to a loss of 589 million rupees in the same period last year. Revenue increased to 15 billion rupees from 12.9 billion rupees year-over-year. The consolidated net loss for Q4 expanded to 3.6 billion rupees, up from a loss of 813 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748338331000,
            "Source": "result"
        },
        {
            "Title": "RattanIndia Enterprises: Q4 and FY25 Results Announcement Scheduled",
            "Summary": "RattanIndia Enterprises Ltd. will announce Q4 and FY25 results on May 27, 2025. The company's trading window is closed for designated persons until 48 hours after results declaration. Q3 FY25 saw a net loss of Rs 170.43 crore compared to a profit in Q3 FY24. The stock is currently trading at Rs 48.58, up 0.68% on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1748234403000,
            "Source": "corporate_action"
        },
        {
            "Title": "Revolt Motors Expands to Nepal with First Dealership in Kathmandu",
            "Summary": "RattanIndia Enterprises' subsidiary, Revolt Motors, has initiated operations in Nepal by opening its first dealership in Kathmandu. This marks the company's expansion into the international market, potentially signaling growth opportunities for electric vehicles in the region.",
            "Sentiment": "positive",
            "PublishDate": 1744684336000,
            "Source": "corporate_action"
        },
        {
            "Title": "RattanIndia Enterprises Expands Dealership Network and Plans International Growth",
            "Summary": "RattanIndia Enterprises has reported a significant expansion of its dealership network, doubling from 100 to 200 dealers within a year. The company is also progressing with its international expansion plans, with a launch in Nepal scheduled for this year.",
            "Sentiment": "positive",
            "PublishDate": 1744081918000,
            "Source": "corporate_action"
        },
        {
            "Title": "RattanIndia Enterprises' Revolt Motors Expands Dealership Network",
            "Summary": "Revolt Motors, a subsidiary of RattanIndia Enterprises, has expanded its dealership network to 200 locations. The company aims to further increase this number to 400 dealerships by the fiscal year 2026. This expansion strategy indicates Revolt Motors' efforts to strengthen its market presence and distribution capabilities in the electric vehicle sector.",
            "Sentiment": "positive",
            "PublishDate": 1744081804000,
            "Source": "corporate_action"
        },
        {
            "Title": "RattanIndia Enterprises Partners with Nepal's MV Dugar Group",
            "Summary": "RattanIndia Enterprises has formed a partnership with Nepal's MV Dugar Group. This collaboration likely aims to expand RattanIndia's business operations or investments in Nepal, potentially opening up new market opportunities for the company.",
            "Sentiment": "positive",
            "PublishDate": 1742440825000,
            "Source": "corporate_action"
        },
        {
            "Title": "Revolt Motors Expands into Nepal Market",
            "Summary": "RattanIndia Enterprises' subsidiary, Revolt Motors, has entered the Nepalese market, marking its first international expansion. This move signifies Revolt Motors' efforts to grow its presence beyond India and tap into new markets for its electric vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1742439871000,
            "Source": "corporate_action"
        },
        {
            "Title": "RattanIndia Enterprises' Revolt Motors Unveils New RV BlazEX Electric Motorcycle",
            "Summary": "Revolt Motors, a subsidiary of RattanIndia Enterprises, has launched a new electric motorcycle model called the RV BlazEX. This announcement represents a significant product development for the company in the electric vehicle market.",
            "Sentiment": "positive",
            "PublishDate": 1740467049000,
            "Source": "corporate_action"
        },
        {
            "Title": "RattanIndia Enterprises Reports Q3 Revenue Growth",
            "Summary": "RattanIndia Enterprises has reported a revenue of 19.17 billion rupees for the third quarter, compared to 16.5 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738659491000,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Enterprises Reports Q3 EBITDA Loss",
            "Summary": "RattanIndia Enterprises has reported a significant financial downturn in its third quarter results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) showed a loss of 1.65 billion rupees, contrasting sharply with a profit of 234 million rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738659473000,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Enterprises Reports Q3 Consolidated Net Loss",
            "Summary": "RattanIndia Enterprises has reported a consolidated net loss of 1.7 billion rupees for the third quarter, compared to a profit of 1.8 billion rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1738659419000,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Enterprises to Consider Q3 Results on February 4",
            "Summary": "RattanIndia Enterprises has announced that it will consider its third quarter (Q3) financial results on February 4. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738241369000,
            "Source": "earnings"
        },
        {
            "Title": "Revolt Motors Achieves Significant Sales Growth in Recent Period",
            "Summary": "Revolt Motors, a subsidiary of RattanIndia Enterprises, has reported a substantial increase in sales. The company experienced a year-over-year growth of 197% and a month-over-month increase of 109%. This remarkable performance indicates strong market demand for Revolt Motors' products and suggests positive momentum for the company.",
            "Sentiment": "positive",
            "PublishDate": 1733279982000,
            "Source": "result"
        },
        {
            "Title": "RattanIndia's Revolt Motors Launches Electric Bikes in Sri Lanka",
            "Summary": "Revolt Motors, a subsidiary of RattanIndia Enterprises, has expanded its operations to Sri Lanka by launching its flagship electric motorcycle models, the RV400 and RV400 BRZ. This marks the company's entry into the Sri Lankan market, potentially opening up new growth opportunities in the electric vehicle sector for RattanIndia Enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1732761353000,
            "Source": "corporate_action"
        },
        {
            "Title": "Revolt Motors: Rapid Dealership Expansion Across India",
            "Summary": "Revolt Motors announces expansion to 153 dealerships, with 14 new locations planned for November 2024. The expansion covers multiple states, offering test rides and after-sales support for their electric motorcycle lineup.",
            "Sentiment": "positive",
            "PublishDate": 1732171921000,
            "Source": "normal_news"
        },
        {
            "Title": "Revolt Motors Expands Dealership Network Across India",
            "Summary": "RattanIndia Enterprises' Revolt Motors has announced a significant expansion of its dealership network in India. The company now has 153 dealerships nationwide, with plans to add 14 more in various cities by November.",
            "Sentiment": "positive",
            "PublishDate": 1732156759000,
            "Source": "corporate_action"
        },
        {
            "Title": "RattanIndia Enterprises Reports Q2 Revenue Growth",
            "Summary": "RattanIndia Enterprises has announced its second quarter revenue for the current fiscal year. The company reported revenue of 18 billion rupees, compared to 13.9 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731404835000,
            "Source": "result"
        },
        {
            "Title": "RattanIndia Enterprises Reports Q2 Loss",
            "Summary": "RattanIndia Enterprises has reported a consolidated net loss of 2.4 billion rupees for the second quarter, compared to a profit of 1.4 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731404808000,
            "Source": "result"
        },
        {
            "Title": "RattanIndia Enterprises: Launches Neomate Stationery Brand",
            "Summary": "RattanIndia Enterprises Limited has entered the stationery market with its new brand Neomate, offering premium products at affordable prices. The products are now available on Amazon.in, with prices starting at ₹160. The product line includes desk organizers, whiteboard stickers, markers, and paint sets targeting students, artists, and professionals.",
            "Sentiment": "positive",
            "PublishDate": 1731306469000,
            "Source": "normal_news"
        },
        {
            "Title": "RattanIndia Enterprises: Launches Kalaanj Ethnic Wear Brand on Amazon",
            "Summary": "RattanIndia Enterprises Limited introduces Kalaanj, an Indian ethnic wear brand for women, through its subsidiary Neobrands Limited. The brand offers diverse prints and styles, catering to sizes S to 2XL, and will be exclusively available on Amazon.",
            "Sentiment": "positive",
            "PublishDate": 1730182169000,
            "Source": "normal_news"
        },
        {
            "Title": "RattanIndia Enterprises: Subsidiary Launches Budget Musical Instrument Line",
            "Summary": "Neobrands Limited, a subsidiary of RattanIndia Enterprises, has introduced 'Akkord', a new budget-friendly musical instrument brand. The initial product range includes guitars, ukuleles, and keyboards, priced from ₹1,799 to ₹3,799, available exclusively on Amazon.in. RattanIndia Enterprises' stock was down 1.08% on the NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1729487843000,
            "Source": "normal_news"
        }
    ]
}