{
    "Symbol": "RTNPOWER",
    "ISIN": "INE399K01017",
    "News": [
        {
            "Title": "RattanIndia Power Q3 Revenue Drops to ₹7.28B",
            "Summary": "RattanIndia Power reported Q3 revenue of ₹7.28 billion compared to ₹7.33 billion in the same quarter last year, marking a slight year-over-year decline in the power sector company's performance.",
            "Sentiment": "negative",
            "PublishDate": 1769758686564,
            "Source": "co_actions_results"
        },
        {
            "Title": "RattanIndia Power Board Meet Set for Jan 30, 2026",
            "Summary": "RattanIndia Power Limited announces board meeting on January 30, 2026 to consider Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769516023697,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rattan India Power Reports Loss of Rs 47.62 Crore in H1 FY26 Despite Improved Plant Performance",
            "Summary": "Rattan India Power Limited reported a net loss of Rs 47.62 crore for the half-year ended September 30, 2025, compared to a profit of Rs 88.68 crore in the same period last year. Revenue from operations decreased to Rs 1,475.68 crore from Rs 1,614.26 crore year-on-year. The company's 1,350 MW thermal power plant at Amravati achieved a Plant Load Factor of 78.98% and plant availability of 85% during H1 FY26. The company reported EBITDA of Rs 337 crore for the period. During the quarter, the company sold 12.09 MUs on the power exchange, generating revenue of Rs 9.36 crore. The Appellate Tribunal for Electricity allowed RPL's appeal regarding Change in Law claims related to ash transportation and sizing charges. CRISIL Ratings upgraded the company's short-term bank facilities rating to CRISIL A3+ from CRISIL A3. The company continues to pursue recovery of regulatory receivables through legal forums.",
            "Sentiment": "negative",
            "PublishDate": 1761900772525,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Power Reports Widened Q2 Net Loss and Declining Revenue",
            "Summary": "RattanIndia Power reported a net loss of 315 million rupees in Q2 compared to a loss of 13 million rupees in the same period last year. Revenue declined to 6.5 billion rupees from 6.8 billion rupees year-over-year. EBITDA fell to 517 million rupees from 939 million rupees, while EBITDA margin compressed to 7.91% from 13.77% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761900312330,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Power Wins Legal Battle as NCLT Dismisses REC Limited's Insolvency Petition",
            "Summary": "The National Company Law Tribunal, New Delhi Branch dismissed a petition filed by REC Limited under Section 7 of the Insolvency and Bankruptcy Code against RattanIndia Power Limited. REC Limited had filed the petition as a holder of Redeemable Preference Shares of RattanIndia Power. The tribunal ruled that Redeemable Preference Shares do not constitute a 'financial debt' under the Insolvency and Bankruptcy Code, making REC Limited ineligible to qualify as a 'financial creditor' to initiate Corporate Insolvency Resolution Process. The company stated there are no expected financial implications, compensation, or penalties related to this dismissal.",
            "Sentiment": "positive",
            "PublishDate": 1758250851257,
            "Source": "stock"
        },
        {
            "Title": "Vistra ITCL Releases Entire 26% Stake in RattanIndia Power Limited",
            "Summary": "Vistra ITCL (India) Limited, acting as Debenture Trustee and Security Trustee, released its entire shareholding of 1,39,62,27,524 shares (26% stake) in RattanIndia Power Limited on August 5, 2025. The shares were released to secure debentures and term loan facilities availed by RattanIndia Power Limited. Following this transaction, Vistra's holding in the company reduced to nil. The company's total equity share capital remains at 5,37,01,05,860 shares with a face value of Rs 10 each. Vistra clarified that the primary compliance responsibility lies with the lender and debenture holder, but filed the disclosure as a precautionary measure.",
            "Sentiment": "neutral",
            "PublishDate": 1754562896142,
            "Source": "corporate_action"
        },
        {
            "Title": "RattanIndia Power Appoints Ravi Kumar Pakalapati as Additional Director and Whole Time Director",
            "Summary": "RattanIndia Power Limited appointed Mr. Ravi Kumar Pakalapati as an Additional Director and Whole Time Director for a five-year term, subject to shareholder approval. The appointment was made by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Pakalapati is a Mechanical Engineer with over 23 years of power sector experience, currently serving as Senior General Manager and Station Head at the company's Amravati power plant, where he oversees operations and maintenance of a 5x270 MW thermal power plant. He has previously held leadership roles at Adani Power Maharashtra Limited, ERA Infra Engineering Ltd, ESSAR Construction, and Lucky Engineering Services. Pakalapati has successfully led the execution and commissioning of a 2x27 MWp solar power project at Katol, Maharashtra. He is not related to any existing directors and has been verified as not being debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1753265346740,
            "Source": "corporate_governance"
        },
        {
            "Title": "RattanIndia Power Reports Q1 Net Loss of 131M Rupees, Revenue Drops to 8.22B Rupees",
            "Summary": "RattanIndia Power reported a net loss of 131 million rupees in Q1, compared to a profit of 930 million rupees in the same period last year. The company's revenue declined to 8.22 billion rupees from 9.3 billion rupees year-over-year. EBITDA fell to 966 million rupees from 1.8 billion rupees, while EBITDA margin compressed to 11.76% from 20.24% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753262980263,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Power: Stock Surges 35% in Two Days Amid High Volumes",
            "Summary": "RattanIndia Power shares rose 12.9% on Wednesday, extending a two-day rally to 35%. The company issued a clarification stating it's unaware of any reason for the sudden spike in trading volume. A board-level change was announced earlier, with Whole-time Director Baliram Ratna resigning effective June 6, 2025. The stock is trading above key moving averages despite mixed Q4FY25 results.",
            "Sentiment": "positive",
            "PublishDate": 1749618823000,
            "Source": "normal_news"
        },
        {
            "Title": "RattanIndia Power: Shares Surge 18% Amid High Volumes, BSE Seeks Clarification",
            "Summary": "RattanIndia Power's stock jumped 18% to Rs 14.04 on NSE with 19.47 crore shares traded. BSE has requested clarification on the volume spike. The stock has gained 26% over four sessions. The company recently announced the resignation of Whole-time Director Baliram Ratna, effective June 06, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1749547551000,
            "Source": "normal_news"
        },
        {
            "Title": "RattanIndia Power: Q3 Net Profit Plummets to Rs 125.94 Crore",
            "Summary": "RattanIndia Power reported a significant drop in Q3 net profit to Rs 125.94 crore, down from Rs 10,665.75 crore in the same quarter last year. The previous year's high profit was due to an exceptional gain. Total income increased to Rs 1,028.61 crore. The company de-recognized assets and liabilities of Sinnar Thermal Power Ltd following NCLT dismissal and reinitiation of CIRP.",
            "Sentiment": "negative",
            "PublishDate": 1746612625000,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Power Reports Improved Q4 Financial Results",
            "Summary": "RattanIndia Power has announced its Q4 financial results, showing year-over-year improvements. Revenue increased to 9.36 billion rupees from 9.14 billion. EBITDA rose to 2.02 billion rupees from 1.96 billion, with the EBITDA margin improving to 22% from 21.42%. Notably, the company reported a net profit of 1.25 billion rupees, compared to a loss of 10.94 billion in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746607797000,
            "Source": "result"
        },
        {
            "Title": "RattanIndia Power to Consider Q4 Results on May 7",
            "Summary": "RattanIndia Power Limited has announced that it will consider and approve its financial results for the fourth quarter on May 7.",
            "Sentiment": "neutral",
            "PublishDate": 1746186728000,
            "Source": "default"
        },
        {
            "Title": "Delhi High Court Dismisses RattanIndia Power's Petition Against Rs 115 Crore Arbitral Award to BHEL",
            "Summary": "RattanIndia Power's petition challenging a Rs 115 crore arbitral award in favor of Bharat Heavy Electricals Limited (BHEL) has been dismissed by the Delhi High Court. The company has stated its intention to file an appeal against this decision.",
            "Sentiment": "negative",
            "PublishDate": 1741824379000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Delhi High Court Dismisses RattanIndia Power's Petition Against BHEL Arbitral Award",
            "Summary": "RattanIndia Power's petition challenging a Rs 115 crore arbitral award in favor of Bharat Heavy Electricals Limited (BHEL) has been dismissed by the Delhi High Court. The company has announced its intention to file an appeal against this decision.",
            "Sentiment": "negative",
            "PublishDate": 1741777163000,
            "Source": "corporate_governance"
        },
        {
            "Title": "High Court Upholds Arbitral Award Against RattanIndia Power",
            "Summary": "The High Court has dismissed RattanIndia Power's plea and upheld an interim arbitral award worth 115 crore rupees in favor of Bharat Heavy Electricals Limited (BHEL). This ruling represents a significant legal setback for RattanIndia Power and a victory for BHEL in their ongoing dispute.",
            "Sentiment": "negative",
            "PublishDate": 1741325291000,
            "Source": "corporate_governance"
        },
        {
            "Title": "High Court Upholds Arbitral Award Against RattanIndia Power",
            "Summary": "The High Court has dismissed RattanIndia Power's plea and upheld an interim arbitral award worth 115 crore rupees in favor of Bharat Heavy Electricals Limited (BHEL). This ruling represents a significant legal setback for RattanIndia Power and a financial victory for BHEL.",
            "Sentiment": "negative",
            "PublishDate": 1741325251000,
            "Source": "corporate_governance"
        },
        {
            "Title": "RattanIndia Power Reports Q3 Revenue Decline",
            "Summary": "RattanIndia Power Limited has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 7.3 billion rupees, down from 8 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737536760000,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Power Reports Decline in Q3 EBITDA",
            "Summary": "RattanIndia Power has reported a significant decrease in its Q3 EBITDA, which fell to 900 million rupees from 1.71 billion rupees year-over-year. The company's EBITDA margin also declined, dropping to 12.28% from 21.22% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737536745000,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Power Reports Profit in Q3 FY24",
            "Summary": "RattanIndia Power Limited has reported a consolidated net profit of 43 million rupees in the third quarter, marking a significant turnaround from a loss of 6 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737536653000,
            "Source": "earnings"
        },
        {
            "Title": "RattanIndia Power Reports Q2 Financial Results",
            "Summary": "RattanIndia Power announced its Q2 financial results. The company reported a net loss of 28 million rupees, which is an improvement from the 215 million rupee loss in the same quarter last year. However, it's a decline from the 915 million rupee profit in the previous quarter. Revenue for Q2 stood at 6.8 billion rupees, down from 7.96 billion rupees in the year-ago period.",
            "Sentiment": "neutral",
            "PublishDate": 1729689092000,
            "Source": "result"
        },
        {
            "Title": "RattanIndia Power Repays ₹510 Crore External Debt",
            "Summary": "<p><span class=\"positive\">RattanIndia Power</span> has <span class=\"positive\">successfully repaid</span> an external debt of <b>₹510 crore</b>. This <span class=\"positive\">significant debt repayment</span> demonstrates the company's <span class=\"positive\">commitment</span> to <span class=\"positive\">improving</span> its financial position and <span class=\"positive\">reducing</span> its overall indebtedness.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728270124000,
            "Source": "corporate_action"
        }
    ]
}