{
    "Symbol": "RUBFILA",
    "ISIN": "INE642C01025",
    "News": [
        {
            "Title": "Rubfila International Board Meet on Feb 13, 2026",
            "Summary": "Rubfila International Limited has scheduled a board meeting for February 13, 2026, to approve Q3 FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770119836966,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rubfila International Reports 15.6% Revenue Growth in Q2 FY2025",
            "Summary": "Rubfila International Limited reported revenue from operations of Rs 1,282.90 lakhs for the quarter ended September 30, 2025, compared to Rs 1,109.58 lakhs in the previous quarter. The company's profit after tax increased to Rs 715.99 lakhs from Rs 596.4 lakhs in the prior quarter. On a consolidated basis, revenue reached Rs 15,023.67 lakhs versus Rs 14,493.02 lakhs in the previous quarter, with consolidated profit after tax at Rs 800.08 lakhs compared to Rs 668.95 lakhs. The company operates in latex rubber thread and corrugated carton box segments, with its wholly-owned subsidiary Premier Tissues India Limited contributing to paper tissue business. Basic earnings per share stood at Rs 1.32 for standalone results and Rs 1.47 for consolidated results.",
            "Sentiment": "positive",
            "PublishDate": 1762976413210,
            "Source": "earnings"
        },
        {
            "Title": "Rubfila International Sets Record Date for Rs. 2 Final Dividend Payment",
            "Summary": "Rubfila International Limited has declared a final dividend of Rs. 2 per equity share for financial year 2024-25. The company's Board of Directors approved this dividend at their meeting held on May 28, 2025. The record date has been set as September 18, 2025, to determine shareholder eligibility for the dividend payment. Each equity share has a face value of Rs. 5.",
            "Sentiment": "positive",
            "PublishDate": 1758091613908,
            "Source": "corporate_action"
        },
        {
            "Title": "Rubfila International Reports Quarterly Results and Subsidiary Expansion Plans",
            "Summary": "Rubfila International Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹12,338.72 lakhs compared to ₹11,089.13 lakhs in the same quarter last year. Standalone profit for the period was ₹596.13 lakhs versus ₹579.58 lakhs in the previous year quarter. On a consolidated basis, revenue from operations reached ₹14,493.02 lakhs compared to ₹13,023.35 lakhs in the corresponding quarter. Consolidated profit for the period stood at ₹668.95 lakhs against ₹712.65 lakhs in the same quarter last year. The company has scheduled its 32nd Annual General Meeting for September 25, 2025. Additionally, Premier Tissues India Ltd, a wholly-owned subsidiary, plans to establish a conversion unit in Palakkad, Kerala for manufacturing tissue paper products.",
            "Sentiment": "positive",
            "PublishDate": 1755096890808,
            "Source": "earnings"
        }
    ]
}