{
    "Symbol": "RUBICON",
    "ISIN": "INE506V01022",
    "News": [
        {
            "Title": "Rubicon Research Q3 Net Profit Jumps 91% to ₹728M",
            "Summary": "Rubicon Research reported strong Q3 performance with consolidated net profit rising 91% YoY to ₹728 million, while revenue grew 52% to ₹4.76 billion compared to previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770121248564,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rubicon Research Board Approves Key Changes",
            "Summary": "Rubicon Research Limited's board approved appointment of Dr. Pradnya Saravade as Independent Woman Director, resignation of Mr. Anand Agarwal, new secretarial auditor appointment, and merger approval with subsidiary KIA Health Tech.",
            "Sentiment": "positive",
            "PublishDate": 1770119939103,
            "Source": "stocks"
        },
        {
            "Title": "Rubicon Research faces GST inspection at offices",
            "Summary": "GST authorities initiated inspection proceedings at Rubicon Research Limited's Thane and Ambernath offices on January 30, 2026, under Section 67 of Maharashtra GST Act. Company expects no material impact.",
            "Sentiment": "neutral",
            "PublishDate": 1769781801387,
            "Source": "stocks"
        },
        {
            "Title": "Rubicon Research Board Meet on Feb 3 for Q3FY26 Results",
            "Summary": "Rubicon Research Limited has scheduled a board meeting on February 3, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769523685121,
            "Source": "co_actions_results"
        },
        {
            "Title": "Investec Initiates Buy Call on Rubicon Research",
            "Summary": "Investec projects 47% EPS CAGR for Rubicon Research between FY25-FY28, initiating coverage with buy rating and ₹820 target price, citing specialty generics growth potential.",
            "Sentiment": "positive",
            "PublishDate": 1768270091886,
            "Source": "stocks"
        },
        {
            "Title": "Rubicon Research Appoints New General Manager",
            "Summary": "Rubicon Research Limited announces the appointment of Ms. Avani Harish Shah as General Manager – Secretarial, Legal & Compliance, effective January 9, 2026. Shah brings over 20 years of corporate legal experience.",
            "Sentiment": "positive",
            "PublishDate": 1767965434270,
            "Source": "stocks"
        },
        {
            "Title": "Rubicon Research Subsidiary Faces ₹4.19 Cr Tax Demand",
            "Summary": "AdvaGen Pharma Ltd, a material subsidiary of Rubicon Research Limited, received a tax demand notice of ₹4.19 crores from Income Tax authorities for assessment year 2021-22 related to DTAA exemption denial.",
            "Sentiment": "negative",
            "PublishDate": 1767709218229,
            "Source": "stocks"
        },
        {
            "Title": "Rubicon Research Limited Shareholders Approve All Six Resolutions Through Postal Ballot",
            "Summary": "Rubicon Research Limited announced that shareholders passed all six resolutions through remote e-voting, including approval of a promoter agreement and ratification of employee stock option plans. The postal ballot voting concluded on December 7, 2025, with resolutions receiving requisite majority support ranging from 88.81% to 95.18% in favor.",
            "Sentiment": "positive",
            "PublishDate": 1765205335965,
            "Source": "corporate_action"
        },
        {
            "Title": "Rubicon Research Projects Strong Growth With 39% Revenue Jump and New Manufacturing Expansion",
            "Summary": "Rubicon Research guides for Q2FY26 revenue of ₹4,120 million (39% YoY growth) and EBITDA of ₹943 million (53% YoY growth), with plans to operationalize its Pithampur plant by mid-CY26. The company targets increased specialty products share, global NDAs, and double-digit margin expansion as outsourcing normalizes by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1763051708355,
            "Source": "earnings"
        },
        {
            "Title": "Rubicon Research Reports Insider Trading Violations by Two Designated Persons",
            "Summary": "Rubicon Research Limited reported two cases of insider trading violations under SEBI regulations. In the first case, Vice President Mr. Amol Shamrao Masal sold 30 shares worth Rs. 18,090 on October 28, 2025. The shares were acquired through IPO, resulting in a contra trade executed during the trading window closure period. In the second case, Ms. Romola Pinto (Head HR Admin) and her immediate relative Mr. Vikram N Pinto acquired 20 shares worth Rs. 12,446.20 on October 16, 2025, during the trading window closure period. Both trades were below Rs. 10 lakhs threshold. The company issued warning letters to both designated persons, citing that the trades were inadvertent with insignificant amounts and no intention to violate regulations or make undue gains.",
            "Sentiment": "negative",
            "PublishDate": 1763023652816,
            "Source": "corporate_governance"
        }
    ]
}