{
    "Symbol": "RUBYMILLS",
    "ISIN": "INE301D01026",
    "News": [
        {
            "Title": "Ruby Mills Board Approves Three Solar Subsidiaries",
            "Summary": "Ruby Mills Limited's board approved incorporation of three wholly owned subsidiaries in Mumbai for Solar Open Access project investment, creating special purpose vehicles for flexible investment management.",
            "Sentiment": "positive",
            "PublishDate": 1768816462586,
            "Source": "stocks"
        },
        {
            "Title": "Ruby Mills Appoints New Independent Director",
            "Summary": "Ruby Mills Limited appointed Paras Khimji Savla as Additional Director and Independent Director for five years, while Yogen Shivlal Lathia retired after completing his second term.",
            "Sentiment": "neutral",
            "PublishDate": 1766838491219,
            "Source": "stocks"
        },
        {
            "Title": "Ruby Mills Settles Dispute with Mindset Estates",
            "Summary": "Ruby Mills has finalized a settlement agreement with Mindset Estates, bringing an end to their development agreement dispute through mutual resolution.",
            "Sentiment": "positive",
            "PublishDate": 1765554421133,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ruby Mills Settles Development Agreement Dispute",
            "Summary": "Ruby Mills Limited executes settlement agreement with Mindset Estates Private Limited regarding Revenue Share Development Agreement dispute, mediated by retired Justice Sharukh J. Kathawala.",
            "Sentiment": "positive",
            "PublishDate": 1765554170274,
            "Source": "stocks"
        },
        {
            "Title": "Ruby Mills Reports Strong Q2 Performance with ₹2,305 Crore Half-Year Profit, Appoints New Internal Auditor",
            "Summary": "Ruby Mills Limited announced quarterly results for the period ended September 30, 2025, reporting a net profit of ₹2,305.03 crore for the half-year period, with earnings per share of ₹6.89. The company's board also approved the appointment of M/s. Aneja Associates as internal auditors for financial year 2025-26, strengthening its governance framework.",
            "Sentiment": "positive",
            "PublishDate": 1763050221681,
            "Source": "earnings"
        },
        {
            "Title": "Ruby Mills' Bank Balance of Rs 2.6 Crore Attached by Enforcement Directorate",
            "Summary": "The Ruby Mills Limited disclosed that the Directorate of Enforcement has attached the company's bank balance of Rs 2,59,90,569 held with Bank of India through an order dated October 16, 2025. The attachment relates to interest earned by the company on term deposits created from advance payments received from Rajput Retail Ltd (RRL) for floor space purchase in 2012. Ruby Mills had previously returned the advance amount to RRL's Resolution Professional after seeking Supreme Court directions to NCLT. The ED alleged that while the company returned the principal advance, the interest earned on these funds is liable for attachment. The company stated this matter has no impact on current business operations or financial commitments. Ruby Mills is seeking legal advice and plans to appeal the order. The company denied any knowledge of fraud by third parties and emphasized its century-long operations with high corporate governance standards.",
            "Sentiment": "negative",
            "PublishDate": 1761395119071,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ruby Mills Reports 37% Jump in Quarterly Profit to ₹1,206 Crore",
            "Summary": "Ruby Mills Limited reported a profit of ₹1,205.94 lakhs for the quarter ended June 30, 2025, compared to ₹877.90 lakhs in the same period last year. Revenue from operations increased to ₹6,957.26 lakhs from ₹4,736.95 lakhs year-on-year. Total income rose to ₹7,858.89 lakhs, with other income of ₹901.63 lakhs including ₹630 lakhs from fair value gain on unquoted equity instruments. Earnings per share stood at ₹3.61 compared to ₹2.63 in the previous year. The company operates in textiles and real estate segments, with textiles generating ₹5,940.24 lakhs and real estate contributing ₹1,017.02 lakhs in revenue. The Board approved these unaudited financial results in a meeting held on August 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755184799935,
            "Source": "earnings"
        },
        {
            "Title": "The Ruby Mills Disburses 1.01 Billion Rupees to Shreem Corp's Resolution Professional",
            "Summary": "The Ruby Mills has disbursed 1.01 billion rupees to the Resolution Professional of Shreem Corp. No further details about the context or reason for this disbursement were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750430607000,
            "Source": "default"
        },
        {
            "Title": "Ruby Mills Reports Q4 Results and Recommends Final Dividend",
            "Summary": "Ruby Mills has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 803.2 million rupees from 735 million rupees year-over-year. However, EBITDA decreased to 138.8 million rupees from 185.8 million rupees, with the EBITDA margin falling to 17.27% from 25.29%. Net profit slightly decreased to 160 million rupees from 162 million rupees year-over-year, but increased from 147 million rupees quarter-over-quarter. The company has recommended a final dividend of 1.75 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1748280319000,
            "Source": "result"
        },
        {
            "Title": "The Ruby Mills Reports Decline in Q3 EBITDA and Margin",
            "Summary": "The Ruby Mills has reported a decrease in its third quarter EBITDA, which fell to 139 million rupees from 155 million rupees in the same period last year. The company's EBITDA margin also declined, dropping to 21.66% from 27.44% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739459629000,
            "Source": "earnings"
        },
        {
            "Title": "The Ruby Mills Reports Q3 Financial Results",
            "Summary": "The Ruby Mills has reported its Q3 financial results. The company's net profit increased to 147 million rupees, up from 111 million rupees year-over-year and 28 million rupees quarter-over-quarter. Revenue for Q3 rose to 641 million rupees, compared to 565 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739459586000,
            "Source": "earnings"
        },
        {
            "Title": "The Ruby Mills Signs MOU for Ruby Tower Project",
            "Summary": "The Ruby Mills has executed a Memorandum of Understanding (MOU) with Mindset Estates for the Ruby Tower project. This agreement suggests a significant development or collaboration in the real estate sector, potentially involving property development or redevelopment.",
            "Sentiment": "positive",
            "PublishDate": 1735827292000,
            "Source": "corporate_action"
        },
        {
            "Title": "The Ruby Mills Secures 2.5 Billion Rupee Loan from Union Bank of India",
            "Summary": "The Ruby Mills has entered into a loan agreement with Union Bank of India for 2.5 billion rupees. This significant financial arrangement indicates a substantial credit facility for the company, which could be used for various purposes such as expansion, debt refinancing, or working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1735735074000,
            "Source": "corporate_action"
        },
        {
            "Title": "Ruby Mills Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Ruby Mills has reported a significant decrease in its Q2 EBITDA, which fell to 49.2 million rupees from 114 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 9.61% from 21.43% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731505351000,
            "Source": "result"
        },
        {
            "Title": "Ruby Mills Reports Q2 Revenue Decline",
            "Summary": "Ruby Mills has reported a revenue of 512.7 million rupees for the second quarter, compared to 531 million rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731505177000,
            "Source": "result"
        },
        {
            "Title": "Ruby Mills Reports Q2 Net Profit Decline",
            "Summary": "Ruby Mills has reported a net profit of 27.9 million rupees for the second quarter, showing a significant decrease from 99.8 million rupees year-over-year and 88 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731505138000,
            "Source": "result"
        }
    ]
}