{
    "Symbol": "RUCHIRA",
    "ISIN": "INE803H01014",
    "News": [
        {
            "Title": "Ruchira Papers Board Meet Set for Feb 13, 2026",
            "Summary": "Ruchira Papers Limited has scheduled its board meeting for February 13, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770223204066,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ruchira Papers MD Umesh Chander Garg Passes Away",
            "Summary": "Ruchira Papers Limited announces the sad demise of Managing Director and Promoter Sh. Umesh Chander Garg on January 23, 2026. He held 18,41,999 shares (6.17% stake) in the company.",
            "Sentiment": "negative",
            "PublishDate": 1769166247818,
            "Source": "stocks"
        },
        {
            "Title": "Ruchira Papers Resumes Operations at Writing and Printing Paper Plant",
            "Summary": "Ruchira Papers Limited has resumed operations at its Writing and Printing Paper Plant (PM3) from December 9, 2025, following completion of annual maintenance activities and modernization implementation. The plant had been temporarily shut down since November 3, 2025, affecting the company's paper manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1765273766389,
            "Source": "stock"
        },
        {
            "Title": "Ruchira Papers Reports Financial Results for Quarter and Half Year Ended September 2025",
            "Summary": "Ruchira Papers Limited's Board of Directors approved the unaudited financial results for the quarter and half year ended September 30, 2025. The company reported total income from operations of Rs. 16,799.83 lakhs for the quarter compared to Rs. 16,941.93 lakhs in the previous quarter. For the half year, total income was Rs. 33,741.76 lakhs versus Rs. 33,030.05 lakhs in the corresponding previous period. Profit before tax for the quarter stood at Rs. 2,268.10 lakhs compared to Rs. 2,329.80 lakhs in the previous quarter. The company operates in a single business segment of paper manufacturing. The results were reviewed by the Audit Committee and approved by the Board at their meeting held on November 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763021859207,
            "Source": "earnings"
        },
        {
            "Title": "Ruchira Papers Re-appoints Three Directors and Secretarial Auditor for Five-Year Terms",
            "Summary": "Ruchira Papers Limited shareholders approved the re-appointment of three directors and a secretarial auditor at their 45th Annual General Meeting held on September 29, 2025. Mr. Subhash Chander Garg and Mr. Jatinder Singh were re-appointed as Whole-Time Directors for five years from September 1, 2025 to August 31, 2030. Mr. Umesh Chander Garg was re-appointed as Managing Director for the same five-year period. M/s Priyanka Chawla & Associates was re-appointed as Secretarial Auditors for financial years 2025-26 to 2029-30. All three directors are promoters of the company, with Mr. Subhash Chander Garg (83 years) handling taxation and marketing, Mr. Jatinder Singh (71 years) managing finance and accounts, and Mr. Umesh Chander Garg (76 years) overseeing day-to-day operations as Managing Director.",
            "Sentiment": "neutral",
            "PublishDate": 1759235281712,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ruchira Papers Board Approves Quarterly Results, Sets AGM Date, and Re-appoints Key Directors",
            "Summary": "Ruchira Papers Limited's Board of Directors approved the company's un-audited financial results for the quarter ended June 30, 2025. The company scheduled its 45th Annual General Meeting for September 29, 2025, at Hotel Black Mango in Himachal Pradesh. The Board set September 22, 2025, as the record date for final dividend eligibility for FY 2024-25, with dividend payment scheduled on or after October 10, 2025. The company approved re-appointments of three Whole-time Directors - Subhash Chander Garg, Jatinder Singh, and Managing Director Umesh Chander Garg - for five-year terms from September 1, 2025, to August 31, 2030, subject to shareholder approval. Additionally, the Board re-appointed Priyanka Chawla & Associates as Secretarial Auditors for FY 2025-26 to 2029-30 and approved the creation of charge/mortgage/security on company assets, both subject to shareholder approval. The quarterly results showed total income of Rs 16,941.93 lakhs and profit for the period of Rs 1,698.00 lakhs, with basic and diluted earnings per share of Rs 5.69.",
            "Sentiment": "positive",
            "PublishDate": 1754900403460,
            "Source": "corporate_action"
        },
        {
            "Title": "Ruchira Papers Reports Growth in Quarterly Net Profit and Revenue",
            "Summary": "Ruchira Papers reported net profit of 170 million rupees in its quarterly results, compared to 148 million rupees in the same period last year. The company's revenue increased to 1.7 billion rupees from 1.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754899154096,
            "Source": "earnings"
        },
        {
            "Title": "Ruchira Papers Reports Q3 Revenue Growth",
            "Summary": "Ruchira Papers has announced its third quarter revenue results. The company reported revenue of 1.7 billion rupees, compared to 1.6 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1739431495000,
            "Source": "earnings"
        },
        {
            "Title": "Ruchira Papers Reports Significant Increase in Q3 EBITDA",
            "Summary": "Ruchira Papers has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter reached 258 million rupees, compared to 126 million rupees in the same period last year. This represents a year-over-year increase of 104.76%. Additionally, the EBITDA margin expanded to 15.37% from 8.56% in the previous year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739431448000,
            "Source": "earnings"
        },
        {
            "Title": "Ruchira Papers Reports Significant Increase in Q3 Net Profit",
            "Summary": "Ruchira Papers has announced its financial results for the third quarter, reporting a net profit of 164.8 million rupees. This represents a substantial increase from the 72 million rupees reported in the same period last year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739431413000,
            "Source": "earnings"
        },
        {
            "Title": "Ruchira Papers Reports Strong Q2 EBITDA Growth",
            "Summary": "Ruchira Papers has reported a significant increase in its Q2 EBITDA, rising to 284 million rupees from 187 million rupees year-over-year. The company's EBITDA margin also improved, reaching 17.14% compared to 11.02% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731312127000,
            "Source": "result"
        },
        {
            "Title": "Ruchira Papers Reports Increased Q2 Net Profit",
            "Summary": "Ruchira Papers has reported a net profit of 177 million rupees for the second quarter, compared to 106 million rupees in the same period last year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731312054000,
            "Source": "result"
        }
    ]
}