{
    "Symbol": "RUCHINFRA",
    "ISIN": "INE413B01023",
    "News": [
        {
            "Title": "Ruchi Infrastructure Q3FY26 Results Show Strong Growth",
            "Summary": "Ruchi Infrastructure reported Q3FY26 standalone net profit of Rs 82 lacs vs Rs 31 lacs in Q3FY25. Nine-month profit surged to Rs 867 lacs from Rs 44 lacs year-on-year, with revenue growing to Rs 3,203 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1770728252929,
            "Source": "co_actions_results"
        },
        {
            "Title": "Amisha Shahra to Acquire 3.22% Stake in Ruchi Infra",
            "Summary": "Amisha Shahra plans to acquire 76 lakh equity shares (3.22% stake) in Ruchi Infrastructure through a gift transaction from promoter Ankesh Shahra, scheduled for January 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767425178441,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ruchi Infrastructure Settles West Bengal Entry Tax Dispute for Rs. 69.83 Lakhs",
            "Summary": "Ruchi Infrastructure Limited applied for settlement of its tax dispute under the West Bengal Tax on Entry of Goods into Local Areas Act, 2012 by paying Rs. 69.83 lakhs on November 21, 2025. The settlement covers 75% of assessed liabilities for respective assessment years without any interest or penalty charges.",
            "Sentiment": "positive",
            "PublishDate": 1763732673336,
            "Source": "stock"
        },
        {
            "Title": "Ruchi Infrastructure Reports Mixed Financial Performance with Quarterly Profit Recovery",
            "Summary": "Ruchi Infrastructure Limited published its unaudited standalone and consolidated financial results for the quarter ended 30 September 2025, showing a quarterly net profit of Rs. 47 lacs compared to a loss of Rs. 64 lacs in the same period last year. The company's total income from operations reached Rs. 1,067 lacs for the quarter, up from Rs. 998 lacs in the previous year, with earnings per share improving to positive territory.",
            "Sentiment": "positive",
            "PublishDate": 1763452099567,
            "Source": "earnings"
        },
        {
            "Title": "Ruchi Infrastructure Reports Mixed Quarterly Results with Revenue Growth but Profit Decline",
            "Summary": "Ruchi Infrastructure Ltd announced quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs 1,067 lacs compared to Rs 998 lacs in the previous year, while reporting a net loss of Rs 38 lacs against a profit of Rs 663 lacs in the corresponding quarter. The company's Board also took cognizance of NCLT orders approving merger schemes involving 54,60,613 preference shares worth Rs 100 each, with the trading window for designated persons closed until November 15, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763045731497,
            "Source": "earnings"
        },
        {
            "Title": "Ruchi Infrastructure Reports Strong Q1 FY2026 Results with Sharp Profit Growth",
            "Summary": "Ruchi Infrastructure Limited reported robust financial performance for Q1 FY2026. On a standalone basis, revenue increased to Rs 10.93 crore (up 11.9% quarter-on-quarter and 10.4% year-on-year), while net profit surged to Rs 7.38 crore from Rs 1.39 crore in the previous quarter and Rs 0.77 crore in the same quarter last year. Earnings per share improved significantly to Rs 0.28 from Rs 0.03 in the previous quarter. Consolidated results showed revenue of Rs 16.53 crore (up 16.1% quarter-on-quarter and 4.7% year-on-year) with net profit jumping to Rs 8.58 crore from Rs 0.96 crore in the previous quarter and Rs 2.20 crore in the corresponding quarter of the previous year. Consolidated EPS reached Rs 0.33 compared to Rs 0.01 in the previous quarter. The company published these unaudited results in newspapers on August 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754920492289,
            "Source": "earnings"
        },
        {
            "Title": "Ruchi Infrastructure Reports Strong Q1 FY26 Results with 303% Jump in Standalone Profit",
            "Summary": "Ruchi Infrastructure Ltd announced its quarterly results for the quarter ended June 30, 2025. The company reported standalone profit of Rs 738 lacs compared to Rs 77 lacs in the same quarter last year, marking a significant increase. Revenue from operations grew to Rs 1,093 lacs from Rs 950 lacs year-on-year. On consolidated basis, profit reached Rs 858 lacs versus Rs 220 lacs in the previous year quarter, while consolidated revenue from operations was Rs 1,653 lacs compared to Rs 1,579 lacs. The company's earnings per share improved to Rs 0.28 from break-even in the corresponding quarter. The Board also approved several corporate actions including reconstitution of Audit Committee and Nomination & Remuneration Committee, appointment of P. Diwan & Associates as Secretarial Auditor for five years, and re-appointment of SMAK & Co. as Statutory Auditors for two years. The company operates across Infrastructure, Windpower and Commodities segments, with Infrastructure being the primary revenue contributor.",
            "Sentiment": "positive",
            "PublishDate": 1754660189391,
            "Source": "earnings"
        }
    ]
}