{
    "Symbol": "RUDRA",
    "ISIN": "INE027T01023",
    "News": [
        {
            "Title": "Rudra Global Infra Gets Credit Rating Upgrade",
            "Summary": "Rudra Global Infra Products receives credit rating upgrade from IVR BBB-/Stable to IVR BBB/Stable by Infomerics Ratings, reflecting improved credit profile and financial strength.",
            "Sentiment": "positive",
            "PublishDate": 1770217554385,
            "Source": "stocks"
        },
        {
            "Title": "Rudra Global Infra Products Q3FY26 Net Profit Surges",
            "Summary": "Rudra Global Infra Products reported strong Q3FY26 results with net profit jumping 367.5% YoY to ₹737.56 lacs. Revenue grew 6.9% to ₹15,858.58 lacs, driven by improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1768838803182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rudra Global Infra Products Reports Mixed Quarterly Performance with Revenue Decline",
            "Summary": "Rudra Global Infra Products Limited reported quarterly results for the period ended September 30, 2025, with revenue from operations declining to Rs 13,643.71 lacs from Rs 14,954.23 lacs in the previous quarter, while maintaining net profit at Rs 118.63 lacs. The company's board approved both standalone and consolidated unaudited financial results during their meeting on November 14, 2025, with statutory auditors issuing unmodified review reports for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763146965288,
            "Source": "earnings"
        },
        {
            "Title": "Rudra Global Infra Products Decides to Apply for NSE Direct Listing",
            "Summary": "Rudra Global Infra Products Limited's board of directors approved the decision to apply for direct listing of the company's securities on the National Stock Exchange of India Limited (NSE). The board meeting was held on November 5, 2025, and authorized Managing Director Sahil Gupta to proceed with the NSE listing application. The company is currently listed on the Bombay Stock Exchange with security code 539226.",
            "Sentiment": "positive",
            "PublishDate": 1762357436641,
            "Source": "corporate_action"
        },
        {
            "Title": "Rudra Global Infra Products Reappoints Parth Pragjibhai Vora as Independent Director",
            "Summary": "Rudra Global Infra Products Limited has reappointed Mr. Parth Pragjibhai Vora as an Independent Director for a second term of five years. The reappointment was approved by company members at the 15th Annual General Meeting held on September 29, 2025, with the appointment effective from September 30, 2025. Mr. Vora, aged 36, holds an MBA in Management and Accounting and brings expertise in management and finance. He does not hold directorships in other listed companies or shareholding in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1759332316659,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rudra Global Infra Products Reports 16.6% Revenue Growth in Q1 2025",
            "Summary": "Rudra Global Infra Products Limited reported standalone revenue from operations of Rs. 14,954.23 lacs for the quarter ended June 30, 2025, compared to Rs. 12,825.08 lacs in the same quarter last year. Net profit increased to Rs. 391.36 lacs from Rs. 387.86 lacs year-on-year. Basic earnings per share remained flat at Rs. 0.39. The company's consolidated results showed identical revenue and profit figures. Total expenses were Rs. 14,438.29 lacs, with cost of materials consumed being the largest component at Rs. 13,243.01 lacs. The Board of Directors approved both standalone and consolidated unaudited financial results on August 8, 2025. The consolidated results include subsidiary Rudra Aerospace & Defence Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1754654751269,
            "Source": "earnings"
        }
    ]
}