{
    "Symbol": "RUPA",
    "ISIN": "INE895B01021",
    "News": [
        {
            "Title": "Rupa & Company Q3FY26 Results & Leadership Change",
            "Summary": "Rupa & Company reported Q3FY26 net profit of ₹1,610.39 lakhs with revenue of ₹31,359.67 lakhs. Company Secretary Sumit Jaiswal resigned effective February 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770928053836,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rupa Company Reports Mixed Q2 Results with Revenue Growth but Margin Pressure",
            "Summary": "Rupa Company Limited recorded 8% revenue growth to INR 320 crores in Q2 FY26 driven by 14% volume growth, but EBITDA margins declined 260 basis points to 7% due to aggressive pricing strategy to compete in the market. The company adopted calibrated pricing approach and increased marketing spend to drive volume growth in economy and mid-premium segments, while thermal wear contributed 13% to quarterly revenues with 23-24% volume growth.",
            "Sentiment": "neutral",
            "PublishDate": 1763726705853,
            "Source": "earnings"
        },
        {
            "Title": "Rupa Company Reports Strong Q2 Performance with 18% Net Profit Growth",
            "Summary": "Rupa Company Limited posted net profit of Rs 1,439.18 lakhs for the quarter ended September 30, 2025, compared to Rs 1,830.17 lakhs in the same quarter last year, with revenue from operations reaching Rs 32,011.42 lakhs. The company's Board approved the quarterly results and issued commercial papers worth Rs 50 crores at 6.28% discount rate due for redemption on December 10, 2025.",
            "Sentiment": "mixed",
            "PublishDate": 1763061297039,
            "Source": "earnings"
        },
        {
            "Title": "Rupa Company Schedules Q2 H1 FY26 Earnings Conference Call",
            "Summary": "Rupa Company Limited has announced an earnings conference call scheduled for November 14, 2025, at 3:30 p.m. IST to discuss Q2 H1 FY26 results. The conference call will involve several analysts and investors in a group call format. Company representatives including Whole Time Director Vikash Agarwal and Chief Financial Officer Sumit Khowala will participate in the interaction. The presentation for the meeting will be submitted to stock exchanges and uploaded on the company's website before the call begins. The company noted that the schedule is subject to change due to exigencies.",
            "Sentiment": "neutral",
            "PublishDate": 1762891092963,
            "Source": "corporate_action"
        },
        {
            "Title": "Rupa & Company Raises Rs. 50 Crore Through Commercial Paper Issuance",
            "Summary": "Rupa & Company Limited issued and allotted 1,000 units of Commercial Paper worth Rs. 50 crore on September 11, 2025. Each unit has a face value of Rs. 5 lakh with a coupon rate of 6.28% per annum and maturity date of December 10, 2025. The commercial paper was issued to Kotak Mahindra Bank through Yes Bank Limited as the issuing and paying agent, and will be listed on BSE Limited. The company plans to use the proceeds to meet working capital requirements by repaying higher-cost borrowings to improve financial efficiency and reduce interest burden.",
            "Sentiment": "positive",
            "PublishDate": 1757597634680,
            "Source": "corporate_action"
        },
        {
            "Title": "RUPA Targets Growth Through Premium Products, E-Commerce, and Export Expansion",
            "Summary": "RUPA has outlined its growth strategy focusing on expanding into premium and athleisure segments, strengthening e-commerce operations, and increasing exports. The company plans to enhance margins and gain market share through cost management initiatives and leveraging its brand value.",
            "Sentiment": "positive",
            "PublishDate": 1755016998351,
            "Source": "stock"
        },
        {
            "Title": "Rupa & Co Reports Decline in Q1 Financial Performance",
            "Summary": "Rupa & Co reported quarterly results showing a decline across key financial metrics. The company's EBITDA fell to 122 million rupees compared to 180 million rupees in the same period last year. EBITDA margin decreased to 6.65% from 8.56% year-over-year. Consolidated net profit dropped to 55 million rupees from 105 million rupees in the previous year. Revenue declined to 1.84 billion rupees compared to 2.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755002925498,
            "Source": "earnings"
        },
        {
            "Title": "Rupa & Company Schedules Q1 FY26 Earnings Conference Call for August 13, 2025",
            "Summary": "Rupa & Company Limited has scheduled an earnings conference call with analysts and investors for August 13, 2025, at 4:00 p.m. IST to discuss Q1 FY26 results. The call will be conducted via conference call with multiple analysts and investors participating. Management representatives include Vikash Agarwal, Whole Time Director from the Promoter Group, and Sumit Khowala, Chief Financial Officer. The company will submit the presentation to stock exchanges and upload it on their website before the meeting begins. Access will be provided through multiple phone numbers including domestic and international toll-free options.",
            "Sentiment": "neutral",
            "PublishDate": 1754740227533,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Reaffirms Rupa & Company's Credit Ratings with AA-/Stable Long-term Rating",
            "Summary": "CRISIL Ratings Limited has reaffirmed the credit ratings for Rupa & Company Limited's bank loan facilities. The long-term rating remains CRISIL AA-/Stable, while the short-term and commercial paper ratings are maintained at CRISIL A1+. The reaffirmation covers total bank loan facilities of Rs. 365 crore for long-term rating and Rs. 180 crore for commercial paper facilities. The rating action was communicated through a letter dated July 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753449177149,
            "Source": "stock"
        },
        {
            "Title": "Rupa & Co Reports Q4 Results and Dividend Recommendation",
            "Summary": "Rupa & Co announced its quarterly results and dividend recommendation. For Q4, the company reported a consolidated net profit of 306 million rupees, up from 242 million rupees year-over-year and 238 million rupees quarter-over-quarter. Revenue for Q4 was 4.15 billion rupees, compared to 4 billion rupees in the same quarter last year. EBITDA for Q4 was 459 million rupees, up from 404 million rupees year-over-year, with EBITDA margin improving to 11.04% from 10.1%. The company has recommended a dividend of 3 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747838186000,
            "Source": "result"
        },
        {
            "Title": "Rupa & Co Reports Improved Q3 EBITDA and Margin",
            "Summary": "Rupa & Co, an Indian textile company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 380 million rupees, up from 329 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 12.01% from 10.34% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738849970000,
            "Source": "earnings"
        },
        {
            "Title": "RUPA & CO Reports Q3 Financial Results",
            "Summary": "RUPA & CO announced its Q3 financial results. The company's consolidated net profit increased to 238 million rupees from 208 million rupees year-over-year. However, revenue slightly decreased to 3.16 billion rupees from 3.18 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738849965000,
            "Source": "earnings"
        },
        {
            "Title": "Rupa & Co MD Expects Improved Performance and Growth",
            "Summary": "The Managing Director of Rupa & Co expresses optimism for improved performance in upcoming quarters. The company anticipates growth driven by thermal wear sales, athleisure products, and modern trade business. They aim to achieve new business milestones and introduce innovative products across various customer segments.",
            "Sentiment": "positive",
            "PublishDate": 1731296047000,
            "Source": "normal_news"
        },
        {
            "Title": "Rupa & Co Reports Q2 Financial Results",
            "Summary": "Rupa & Co, an Indian textile company, has announced its Q2 financial results. The company's consolidated net profit decreased to 184 million rupees from 205 million rupees year-over-year. Revenue also saw a slight decline, dropping to 2.95 billion rupees from 2.99 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731290563000,
            "Source": "result"
        },
        {
            "Title": "Rupa & Co Reports Q2 EBITDA Decline",
            "Summary": "Rupa & Co, an Indian textile company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 285 million rupees from 324 million rupees in the same quarter last year. The EBITDA margin also declined to 9.7% from 10.82% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731290557000,
            "Source": "result"
        }
    ]
}