{
    "Symbol": "RUSHIL",
    "ISIN": "INE573K01025",
    "News": [
        {
            "Title": "Rushil Decor Completes Rs 93.04 Cr Fund Utilization",
            "Summary": "Rushil Decor Limited reports complete utilization of Rs 93.04 crores raised through preferential issue for Q3 FY26, with no deviation from stated objectives. Company confirms this as final disclosure.",
            "Sentiment": "positive",
            "PublishDate": 1770722367387,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rushil Decor Q3 FY26 Results: Revenue Grows 2.3% YoY",
            "Summary": "Rushil Decor reports Q3 FY26 revenue of INR 2,165 million with 2.3% YoY growth. Laminate business drives performance with 20.4% growth, while Jumbo Laminate Phase 2 commences commercial production.",
            "Sentiment": "positive",
            "PublishDate": 1770222999878,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rushil Decor completes preferential issue fund utilization",
            "Summary": "Rushil Decor Limited has fully utilized Rs. 93.04 crores raised through preferential issue for stated objectives, with monitoring agency confirming no deviations in fund usage despite shortfall from original target.",
            "Sentiment": "neutral",
            "PublishDate": 1769597593655,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rushil Decor Q3 Net Profit Drops 55% YoY to ₹52M",
            "Summary": "Rushil Decor reported consolidated net profit of ₹52 million in Q3, marking a significant 55% decline from ₹115 million in the same quarter previous year, reflecting challenging operational conditions.",
            "Sentiment": "negative",
            "PublishDate": 1769596306904,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rushil Decor Board Meet on Jan 28 for Q3FY26 Results",
            "Summary": "Rushil Decor Limited has scheduled a board meeting on January 28, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767857998948,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rushil Decor Starts Phase 2 Production at Gujarat Plant",
            "Summary": "Rushil Decor commences commercial production of Jumbo Laminate Sheets Phase 2 at its new Gujarat facility, expanding total annual capacity to 2.8 million sheets.",
            "Sentiment": "positive",
            "PublishDate": 1765376048744,
            "Source": "stocks"
        },
        {
            "Title": "Rushil Decor Limited Commences Phase 2 Commercial Production of Jumbo Size Laminate Sheets",
            "Summary": "Rushil Decor Limited has started commercial production of Jumbo Size Laminate Sheets Phase 2 at its Gujarat manufacturing plant, adding 1.6 million sheets per annum production capacity. The completion of both Phase 1 and Phase 2 brings the total installed production capacity to approximately 2.8 million sheets per annum, expanding the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765340440408,
            "Source": "stock"
        },
        {
            "Title": "Rushil Decor Limited Receives Extended Status Quo Order from Securities Appellate Tribunal",
            "Summary": "Securities Appellate Tribunal extended the status quo direction for Rushil Decor Limited by two weeks through an order dated 20.11.2025. The company continues to await receipt of Rs. 22.27 crores (75% balance amount) from 10,00,000 warrants issued to Vespera Fund Limited at Rs. 297 per warrant, having already received Rs. 7.42 crores (25%) at allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1764324194667,
            "Source": "stock"
        },
        {
            "Title": "Rushil Decor Signs Agreement to Sell Up to 29% Stake in Rushil Modala Ply Limited",
            "Summary": "Rushil Decor has entered into an agreement to divest up to 29% of its shareholding in subsidiary Rushil Modala Ply Limited through multiple tranches. The strategic divestment will reduce Rushil Decor's ownership in the plywood manufacturing entity and potentially generate capital for the parent company.",
            "Sentiment": "neutral",
            "PublishDate": 1763728355220,
            "Source": "order&deals"
        },
        {
            "Title": "Rushil Decor Reports Q2 FY26 Recovery with 31.5% Sequential Revenue Growth",
            "Summary": "Rushil Decor Limited achieved INR 2,356 million revenue in Q2 FY26, marking 31.5% sequential growth as operations normalized after the Andhra Pradesh MDF plant fire incident. The company expects INR 970 crores revenue for FY26 with 10-12% EBITDA margins, supported by Jumbo Laminate facility ramp-up and improved capacity utilization reaching 79% in MDF and 90% in laminates.",
            "Sentiment": "positive",
            "PublishDate": 1763200702398,
            "Source": "earnings"
        },
        {
            "Title": "Rushil Decor Reports 2.3% Revenue Growth to Rs 2,356 Million in Q2 FY2026",
            "Summary": "Rushil Decor Limited reported consolidated revenue of Rs 2,356 million for the second quarter, marking a 2.3% year-on-year increase. The MDF division contributed Rs 1,695 million while the Laminates division generated Rs 547 million, up 8.9% year-on-year. However, EBITDA declined 24.1% to Rs 225 million with margins at 9.5%, and PAT fell 55% to Rs 51 million. The company's Andhra Pradesh MDF facility returned to full operations after a fire incident earlier in the year, achieving 79% capacity utilization. Commercial dispatches from the Phase 1 Jumbo Laminates unit commenced during the quarter. The company added 10 new direct distributors and over 40 retailers to expand its network. For the first half of FY2026, revenue was Rs 4,148 million, down 8.9% year-on-year, with EBITDA at Rs 203 million and a net loss of Rs 89 million.",
            "Sentiment": "neutral",
            "PublishDate": 1762604965169,
            "Source": "earnings"
        },
        {
            "Title": "Rushil Decor Reports Fund Utilization Challenges in Preferential Issue Monitoring Report",
            "Summary": "Rushil Decor Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding its preferential issue of Rs. 122.66 crore. The company received Rs. 93.04 crore through the preferential issue, with Rs. 90.22 crore utilized for stated objectives. However, there are deviations from original objects due to warrant holders not exercising conversion options worth Rs. 7.35 crore by the maturity date of June 22, 2025. Additionally, uncertainty exists regarding Rs. 22.28 crore from Vespera Fund Limited (VFL) following a Securities Appellate Tribunal order that dismissed VFL's appeal but extended status quo for six weeks from October 15, 2025. The funds were primarily used for decorative laminates manufacturing project (Rs. 77.32 crore utilized out of Rs. 90 crore allocated), MDF plant machinery and civil work (Rs. 9.53 crore out of Rs. 10 crore), and general corporate purposes (Rs. 3.37 crore out of Rs. 12.66 crore). The company plans to bridge potential shortfalls through internal accruals and debt financing, though this may affect project returns due to increased interest and debt repayment liabilities.",
            "Sentiment": "negative",
            "PublishDate": 1762590135217,
            "Source": "corporate_action"
        },
        {
            "Title": "Rushil Decor Reports Mixed Q2 Results, Approves Subsidiary Stake Dilution",
            "Summary": "Rushil Decor Limited reported quarterly results ended September 30, 2025, with revenue from operations at ₹2,332.39 million and net profit of ₹59.73 million. The company's board approved reducing its shareholding in subsidiary Rushil Modala Ply Limited from 51% to 29% by selling equity shares to existing shareholders of Modala Group. The company faced foreign exchange losses of ₹17.08 million during the quarter due to EUR-INR exchange rate movements on its ECA loan. Rushil Decor operates in three segments: laminates and allied products, medium density fiber board, and polyvinyl chloride board. The company successfully commenced Phase II trial production of its Jumbo Size Laminate Sheets Project in October 2025, adding 1.6 million sheets per annum capacity. Additionally, the company received ₹14.17 million from Andhra Pradesh government as incentives under the Industrial Development Policy 2015-20.",
            "Sentiment": "neutral",
            "PublishDate": 1762588852571,
            "Source": "earnings"
        },
        {
            "Title": "SAT Dismisses Vespera Fund's Appeal Against SEBI Order on Rushil Decor Warrants",
            "Summary": "The Securities Appellate Tribunal in Mumbai dismissed an appeal by Vespera Fund Limited against a SEBI order from March 2025. The appeal concerned Vespera Fund's application under SEBI regulations seeking relaxation to pay the remaining 75% consideration amount for convertible warrants and exercise conversion into equity shares of Rushil Decor Limited. SAT upheld SEBI's decision and extended the status quo on 1,000,000 warrants for six weeks from October 15, 2025. Rushil Decor will maintain the current position on these warrants during this period and take appropriate action after the deadline expires or upon receiving further directions.",
            "Sentiment": "negative",
            "PublishDate": 1760785301941,
            "Source": "stock"
        },
        {
            "Title": "Rushil Decor Targets ₹11,000 Million Revenue by Mid FY2026, Begins Phase 2 Production Testing",
            "Summary": "Rushil Decor has started testing production at Phase 2 of its Jumbo Laminate Plant and plans to achieve consolidated revenues of around ₹11,000 million by mid FY2026. The company expects additional annual earnings of ₹300 crore with an 11% EBITDA margin from this expansion. The total production capacity has increased to 2.8 million sheets per year following the Phase 2 implementation.",
            "Sentiment": "positive",
            "PublishDate": 1760076380064,
            "Source": "stock"
        },
        {
            "Title": "Rushil Décor Limited Shareholders Approve Re-appointment of Independent Director for Five-Year Term",
            "Summary": "Rushil Décor Limited shareholders approved the re-appointment of Mr. Hiren S. Mahadevia as an Independent Director for a second term of five years, effective from August 9, 2025 to August 8, 2030. The approval was granted at the company's 31st Annual General Meeting held on September 20, 2025. Mr. Mahadevia is a Company Secretary by profession, member of the Institute of Company Secretaries of India since 1986, and holds MBA-Finance and L.L.B. qualifications. He brings over 35 years of finance and legal management experience, having retired in June 2023 after more than 35 years with Ashima Group. He is not related to any other Director of the company and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1758363616873,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rushil Decor Q1 FY2026 Revenue Falls 20.4% to ₹179.2 Crores Due to Fire Incident at MDF Plant",
            "Summary": "Rushil Decor Limited reported consolidated revenue of ₹179.2 crores for Q1 FY2026, declining 20.4% year-on-year and 22.4% quarter-on-quarter. The company posted negative EBITDA, though it would have been ₹3.5 crores (2% margin) excluding a forex loss of ₹5.7 crores. The MDF business revenue dropped 26.6% to ₹124.2 crores with volumes declining 30% due to a fire incident at the Andhra Pradesh facility in April that caused 43 days of production loss. The Chikmagalur plant operated at 99% capacity while the Andhra Pradesh plant ran at only 43% utilization. The laminate business showed resilience with revenue of ₹44.5 crores, down just 5.6%, and domestic market revenue growing 9.3%. Phase-I of the new Jumbo Laminate facility in Gandhinagar began commercial production. The company targets ₹1,000 crores revenue for FY2026 and ₹1,150-1,200 crores for FY2027, with EBITDA margins of 11-12% and 13-14% respectively. Management expects strong Q2 performance with normalized production and improved capacity utilization.",
            "Sentiment": "negative",
            "PublishDate": 1755578008739,
            "Source": "earnings"
        },
        {
            "Title": "Rushil Decor Utilizes Rs. 80.98 Crores from Preferential Issue, Faces Funding Uncertainty",
            "Summary": "Rushil Decor Limited has utilized Rs. 80.98 crores out of Rs. 93.04 crores raised through its preferential issue for the quarter ended June 30, 2025. The company received Rs. 93.04 crores against the originally planned Rs. 122.66 crores due to warrant conversion issues. Some warrant holders did not exercise their conversion options, leading to forfeiture of 3.30 lakh warrants worth Rs. 7.35 crores. Additionally, 10 lakh warrants from Vespera Fund Limited (VFL) worth Rs. 22.28 crores remain unconverted due to a stay order from Securities Appellate Tribunal, Mumbai. The funds were deployed across four objectives: decorative laminates manufacturing project (Rs. 68.66 crores utilized), MDF plant machinery and civil work (Rs. 8.96 crores), general corporate purposes (Rs. 3.36 crores), and working capital requirements (no utilization yet). The monitoring agency CARE Ratings noted uncertainty regarding fund availability from VFL and potential delays in project implementation. The company has arranged interim debt financing from Bank of Baroda to bridge the shortfall. All utilization remains aligned with the Private Placement Offer Letter objectives with no deviations reported.",
            "Sentiment": "neutral",
            "PublishDate": 1754908791868,
            "Source": "corporate_action"
        },
        {
            "Title": "Rushil Decor Reports Q1 Net Loss of 137M Rupees, Revenue Drops to 1.77B Rupees",
            "Summary": "Rushil Decor reported a net loss of 137 million rupees in Q1, compared to a profit of 123 million rupees in the same period last year. The company's revenue declined to 1.77 billion rupees from 2.2 billion rupees year-over-year, representing a significant decrease in both profitability and top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1754901125420,
            "Source": "earnings"
        },
        {
            "Title": "Rushil Decor Limited Approves Re-appointment of Independent Director for Five-Year Term",
            "Summary": "Rushil Decor Limited's Board of Directors approved the re-appointment of Mr. Hiren S. Mahadevia as an Independent Director for a second term of five consecutive years from August 09, 2025 to August 08, 2030. The decision was made based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval at the Annual General Meeting. Mr. Mahadevia's first term as Independent Director expires on August 08, 2025. He is a Company Secretary by profession with MBA-Finance and L.L.B. qualifications, and has over 35 years of experience in finance and legal management. He retired in June 2023 after more than 35 years with the Ashima Group and is not related to any Director of the Company.",
            "Sentiment": "neutral",
            "PublishDate": 1754117906451,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rushil Decor Issues 66 Lakh Equity Shares on Warrant Conversion",
            "Summary": "Rushil Decor has issued 66 lakh equity shares following the conversion of warrants. The shares were issued on a preferential basis at a price of ₹297 per share.",
            "Sentiment": "positive",
            "PublishDate": 1750772529000,
            "Source": "default"
        },
        {
            "Title": "Rushil Decor Secures Initial Export Orders for New Capacity",
            "Summary": "Rushil Decor has obtained initial export orders that cover 15% of its Phase 1 capacity. The company plans to increase production in the upcoming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1750137227000,
            "Source": "default"
        },
        {
            "Title": "Rushil Decor Aims for ₹11,000 Million Revenue by FY2026",
            "Summary": "Rushil Decor's Managing Director has set a target for consolidated revenues of approximately ₹11,000 million by FY2026. The company is evaluating the combined installed capacity of Phase 1 and 2, projecting potential additional annual revenues of about ₹300 crores. Rushil Decor plans to complete Phase 2 of its jumbo laminate facility by Q3 FY26, which will increase annual sheet production capacity by an additional 2.8 million, aiming to enhance revenue and global reach.",
            "Sentiment": "positive",
            "PublishDate": 1750137145000,
            "Source": "default"
        },
        {
            "Title": "Rushil Decor Q4 Financial Results",
            "Summary": "Rushil Decor reported its Q4 financial results. EBITDA decreased to 231.2M rupees from 292M rupees year-over-year, with EBITDA margin falling to 10.10% from 12.53%. Revenue slightly decreased to 2.29B rupees from 2.33B rupees. However, net profit increased to 128.8M rupees from 90M rupees year-over-year. The company reported an exceptional item of 20M rupees, and PBT decreased to 133.7M rupees from 158.7M rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747221583000,
            "Source": "result"
        },
        {
            "Title": "Rushil Decor Begins Production of Jumbo Laminate Sheets in Gujarat",
            "Summary": "Rushil Decor has commenced production of jumbo laminate sheets at its facility in Gujarat. This development represents an expansion of the company's product line and manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1746019507000,
            "Source": "default"
        },
        {
            "Title": "Fire at Rushil Decor's Atchutapuram MDF Plant Causes Disruption and Financial Loss",
            "Summary": "Rushil Decor has reported that a fire at its Atchutapuram MDF (Medium Density Fiberboard) plant has resulted in an estimated loss of up to 70 million rupees. The incident has disrupted operations at the plant, with the company expecting the disruption to last for 4-6 weeks.",
            "Sentiment": "negative",
            "PublishDate": 1744636998000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fire Disrupts Production at Rushil Decor's MDF Plant",
            "Summary": "Rushil Decor reported a fire incident at its MDF manufacturing plant in Atchutapuram. The production operations at the facility have been temporarily halted due to the fire. The company stated that there were no human injuries or casualties as a result of the incident.",
            "Sentiment": "negative",
            "PublishDate": 1744201093000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rushil Decor Reports Slight Decrease in Q3 Revenue",
            "Summary": "Rushil Decor, a company in the decorative laminates and wood-based panel products industry, has reported its third-quarter revenue. The company's revenue for Q3 stood at 2.1 billion rupees, showing a marginal decrease compared to 2.13 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738055185000,
            "Source": "earnings"
        },
        {
            "Title": "Rushil Decor Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Rushil Decor has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 272 million rupees from 307 million rupees in the same quarter last year. Additionally, the EBITDA margin declined to 12.93% from 14.38% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738055130000,
            "Source": "earnings"
        },
        {
            "Title": "Rushil Decor Reports Slight Increase in Q3 Net Profit",
            "Summary": "Rushil Decor has announced its financial results for the third quarter. The company reported a net profit of 115 million rupees, compared to 114 million rupees in the same quarter of the previous year, showing a marginal year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1738055094000,
            "Source": "earnings"
        },
        {
            "Title": "Rushil Decor: Jumbo Laminate Project Set to Boost Growth",
            "Summary": "Rushil Decor announces plans for Jumbo Laminate Project in Gandhinagar, expected to start operations by Q4 FY25. The facility aims to produce 2.8 million sheets annually, targeting export markets. The company also enters the plywood segment. Q2 FY2025 results show 12.6% YoY revenue growth to ₹229 crore and 7.9% PAT increase to ₹12 crore.",
            "Sentiment": "positive",
            "PublishDate": 1730712374000,
            "Source": "normal_news"
        },
        {
            "Title": "Rushil Decor Announces Planned Shutdown of Chikmagalur Unit",
            "Summary": "Rushil Decor has announced a planned shutdown of its manufacturing unit in Chikmagalur, starting from November 5. The company states that this shutdown is not expected to result in any revenue loss.",
            "Sentiment": "neutral",
            "PublishDate": 1730469871000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rushil Decor: Q2 Results Boost Share Price by 5%",
            "Summary": "Rushil Decor's share price rose up to 5% following the release of its Q2 FY25 results. The company reported a 12.6% year-on-year revenue growth to ₹230.4 Crore, with EBITDA at ₹29.6 Crore and net profit growing 7.9% to ₹11.4 Crore. The stock closed 3-4% higher on both NSE and BSE.",
            "Sentiment": "positive",
            "PublishDate": 1730114186000,
            "Source": "result"
        },
        {
            "Title": "Rushil Decor Expands into Laminates and Plywood",
            "Summary": "Rushil Decor announces two significant expansion projects: 1) A new facility in Gandhinagar, Gujarat, for producing jumbo size laminates with an annual capacity of 2.80 million sheets. 2) Entry into the plywood market through a 51% joint venture in Chikmagalur, Karnataka, with a daily production capacity of 300 boards.",
            "Sentiment": "positive",
            "PublishDate": 1730086727000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rushil Decor: Shares Surge 6.5% on Warrant Conversion and Q1FY25 Results",
            "Summary": "Rushil Decor's shares rose 6.5% to Rs 34.87. The company converted 9,00,000 warrants to equity shares at Rs 28.70 each, increasing non-promoter holding to 45.37%. Q1FY25 results show 16% YoY increase in net sales to Rs 223.50 crore and 1% growth in net profit to Rs 12.31 crore. MDF segment achieved 91% capacity utilization with 12.4% EBITDA margin.",
            "Sentiment": "positive",
            "PublishDate": 1729530411000,
            "Source": "corporate_action"
        },
        {
            "Title": "Rushil Decor: Stock Surges 4.5% on Successful Fundraising and Expansion",
            "Summary": "<p><span class='positive'>Rushil Decor's stock rose 4.5%</span> to Rs 35.05. The company <span class='positive'>raised Rs 30.66 crore</span> through convertible warrants, <b>allotted 9,00,000 equity shares</b>, and plans to <span class='positive'>acquire a manufacturing unit</span> in Bengaluru. It's <b>forming a joint venture</b> with 51% ownership, <span class='positive'>investing Rs 20 crore</span> for <span class='positive'>eco-friendly plyboard production</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728452421000,
            "Source": "corporate_action"
        }
    ]
}