{
    "Symbol": "RUSTOMJEE",
    "ISIN": "INE263M01029",
    "News": [
        {
            "Title": "Keystone Realtors Allots 2,708 Shares Under ESOP",
            "Summary": "Keystone Realtors Limited allotted 2,708 equity shares of face value ₹10 each under its Employee Stock Option Plan 2022, approved by the Stakeholders Relationship Committee on February 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770780596345,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keystone Realtors Projects Strong Cash Flow Recovery",
            "Summary": "Keystone Realtors anticipates significant operating cash flow improvement from H2 FY27 after Q3 FY26 challenges, with business development spending projected to grow 25% to INR850-1,000 crores in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1770262096303,
            "Source": "stocks"
        },
        {
            "Title": "Keystone Realtors Projects ₹4,000 Cr Pre-Sales for FY26",
            "Summary": "Keystone Realtors targets ₹4,000 crores pre-sales for FY26 with 25% yearly growth expectations while maintaining cautious outlook. Debt-to-equity ratio stands at 0.22:1 as of December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770262069714,
            "Source": "stocks"
        },
        {
            "Title": "Keystone Realtors Q3 Net Profit Drops 77.5% YoY",
            "Summary": "Keystone Realtors reported consolidated net profit of 34 million rupees in Q3, marking a significant decline from 151 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1770203111417,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keystone Realtors Q3FY26 Earnings Call on Feb 4",
            "Summary": "Keystone Realtors Limited has scheduled its Q3FY26 earnings call for February 4, 2026 at 5:00 PM IST to discuss unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769585266216,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keystone Realtors Appoints Pritam Chivukula as Project CEO",
            "Summary": "Keystone Realtors Limited announces the appointment of Mr. Pritam Chivukula as Senior Management Personnel and Project CEO - Commercial, effective January 19, 2026. The new appointee brings 27 years of experience in real estate development.",
            "Sentiment": "positive",
            "PublishDate": 1768825701229,
            "Source": "stocks"
        },
        {
            "Title": "Keystone Realtors Q3 FY26: Area sold up 13% YoY",
            "Summary": "Mumbai-based developer reports 13% increase in area sold to 0.46 million sq ft in Q3 FY26, though pre-sales declined 3% to ₹837 crore. Nine-month performance shows strong growth with 43% rise in area sold.",
            "Sentiment": "neutral",
            "PublishDate": 1767943906172,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keystone Realtors Q3FY26 Pre-Sales Drop 3% to ₹8.37 Bn",
            "Summary": "Keystone Realtors reports Q3FY26 pre-sales of ₹8.37 billion, down 3% YoY from ₹8.63 billion. Collections also declined 3.3% to ₹5.24 billion compared to ₹5.42 billion in Q3FY25.",
            "Sentiment": "negative",
            "PublishDate": 1767931118430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keystone Realtors Reports Strong Q3FY26 Performance",
            "Summary": "Keystone Realtors delivers impressive Q3FY26 results with pre-sales reaching ₹8.37 billion and collections hitting ₹5.24 billion. Company launches new project worth ₹9.19 billion while adding four projects valued at ₹86.49 billion this year.",
            "Sentiment": "positive",
            "PublishDate": 1767929866039,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keystone Realtors Q3FY26: 23% YoY Pre-sales Growth",
            "Summary": "Keystone Realtors reports strong Q3FY26 performance with 23% YoY growth in pre-sales to ₹26.76 billion YTD, achieving 67% of full-year guidance. Company launched 5 projects worth ₹58.35 billion GDV.",
            "Sentiment": "positive",
            "PublishDate": 1767929627339,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keystone Realtors Allots 8,242 Shares Under ESOP",
            "Summary": "Keystone Realtors' Stakeholders Relationship Committee approved allotment of 8,242 equity shares under the Rustomjee Employee Stock Option Plan 2022 on December 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765546340747,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keystone Realtors Reports Strong Q2 FY26 Performance with 40% Growth in Presales",
            "Summary": "Keystone Realtors achieved INR 772 crores in presales for Q2 FY26, bringing first-half presales to INR 1,839 crores representing 40% year-on-year growth and 46% of full-year guidance. The company launched one new project with INR 949 crores GDV, added three redevelopment projects worth INR 7,727 crores GDV surpassing annual targets, and raised INR 335 crores through oversubscribed NCDs while maintaining net debt at zero.",
            "Sentiment": "positive",
            "PublishDate": 1763454474936,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Reports 10% Growth in Q2 Pre-Sales, Achieves 70% of Annual Launch Guidance",
            "Summary": "Keystone Realtors Limited reported pre-sales of INR 772 crores in Q2 FY26, marking 10% growth over Q2 FY25. For the first half of FY26, pre-sales reached INR 1,839 crores, representing 40% growth over H1 FY25. The company launched one project with GDV of INR 949 crores in Q2 FY26, bringing total launches for H1 FY26 to four projects worth INR 4,916 crores, achieving 70% of full-year FY26 guidance. Financial results for Q2 FY26 showed revenue from operations of INR 499 crores, EBITDA of INR 37 crores, and PAT of INR 10 crores. The company added three new projects in H1 FY26 with combined GDV of INR 7,727 crores, surpassing full-year guidance of INR 6,000 crores. Gross debt stands at INR 588 crores with debt-to-equity ratio of 0.21, while net debt is nil. India Ratings assigned a credit rating of A+ with positive outlook.",
            "Sentiment": "positive",
            "PublishDate": 1762962568424,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Reports Mixed Financial Performance for Quarter Ended September 2025",
            "Summary": "Keystone Realtors Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved both consolidated and standalone financial results at their meeting held on November 12, 2025. PriceWaterhouseCoopers Chartered Accountants LLP issued a limited review report with unmodified opinion on the unaudited financial results. During the quarter, the company allotted 33,500 fully paid-up, senior, secured, redeemable, listed, rated non-convertible debentures (NCDs) of INR 100,000 each, amounting to INR 33,280 lakhs, which have been listed on BSE Limited. The NCDs are secured against first ranking exclusive charge on unsold units, outstanding cash flows from sold units and related rights. The company operates exclusively in real estate and allied activities business. The financial results include operations of 56 subsidiaries, 2 associates, 5 joint ventures, and 2 jointly controlled entities.",
            "Sentiment": "neutral",
            "PublishDate": 1762938064031,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Reports Sharp Decline in Q2 Profitability",
            "Summary": "Keystone Realtors reported Q2 revenue of 5 billion rupees compared to 5.3 billion rupees in the same period last year. The company's EBITDA fell significantly to 154 million rupees from 805 million rupees year-over-year, with EBITDA margin dropping to 3.1% from 15.11%. Consolidated net profit declined to 86 million rupees versus 663 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762935672716,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Allots 22,609 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Keystone Realtors Limited has allotted 22,609 equity shares with a face value of ₹10 each under the Rustomjee Employee Stock Option Plan 2022. The allotment was approved by the company's Stakeholders Relationship Committee on November 8, 2025. These newly allotted equity shares will rank pari-passu with the existing equity shares of the company in all aspects.",
            "Sentiment": "neutral",
            "PublishDate": 1762811906195,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors (Rustomjee) Schedules Q2FY26 Earnings Conference Call",
            "Summary": "Keystone Realtors Limited has announced an investor and analyst conference call scheduled for November 12, 2025, at 4:00 PM IST to discuss its unaudited standalone and consolidated results for the quarter and half-year ended September 30, 2025. The call will feature a management discussion on earnings performance followed by a Q&A session. Key management participants include Chairman and Managing Director Boman Irani, Executive Directors Chandresh Mehta and Percy Chowdhry, and Group CFO Sajal Gupta. The conference call will be hosted by Axis Capital with dial-in numbers provided for multiple countries including India, Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1762282708483,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors Allots 26,091 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Keystone Realtors Limited has allotted 26,091 equity shares with a face value of ₹10 each under its Employee Stock Option Plan 2022. The allotment was approved by the company's Stakeholders Relationship Committee. The newly allotted shares will have equal rights with existing equity shares of the company. Keystone Realtors operates under the brand name Rustomjee and is listed on BSE and NSE with scrip code 543669 and symbol RUSTOMJEE respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1761226158835,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors Promoters to Sell 3.63% Stake Through OFS on October 15-16, 2025",
            "Summary": "Three promoters of Keystone Realtors Limited - Boman Rustom Irani, Percy Sorabji Chowdhry, and Chandresh Dinesh Mehta - will sell up to 45,76,000 equity shares representing 3.63% of the company's total equity share capital through an Offer for Sale mechanism. The OFS will take place on BSE and NSE over two trading days from October 15-16, 2025, with a floor price of ₹550 per share. The sale aims to achieve minimum public shareholding requirements. Boman Rustom Irani will sell up to 22,88,000 shares, while Percy Sorabji Chowdhry and Chandresh Dinesh Mehta will each sell up to 11,44,000 shares. Non-retail investors can bid on October 15, while retail investors can participate on October 16. Spark Institutional Equities Private Limited and Motilal Oswal Financial Services Limited are acting as the sellers' brokers.",
            "Sentiment": "neutral",
            "PublishDate": 1760444882318,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors Achieves 70% of FY26 Launch Guidance in First Half, Reports 9% Growth in Q2 Pre-Sales",
            "Summary": "Keystone Realtors achieved 70% of its full-year FY26 launches guidance during the first half of FY26. The company reported pre-sales of ₹7.63 billion in Q2 FY26, representing a 9% yearly growth. Collections also increased by 9% year-on-year to reach ₹6.01 billion in the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1759844334337,
            "Source": "stock"
        },
        {
            "Title": "Keystone Realtors Appoints Chetan Deshpande as Senior Management Personnel in HR Department",
            "Summary": "Keystone Realtors Limited appointed Mr. Chetan Deshpande as Senior Management Personnel and Senior Personnel in the HR department effective October 1, 2025. Deshpande holds a B.Tech (Mechanical) from G.I.T Belgaum and MBA in Human Resources from Ross School of Business, University of Michigan, USA. He has completed the Leadership Excellence Program at Harvard Business School and brings over 25 years of HR leadership experience across apparel, manufacturing, FMCG, technology, and pharmaceuticals industries. He previously held leadership roles at Texport Industries, Genus Power, Gabriel India, Ferrero (APAC), Hewlett Packard, and Sanofi Aventis. In his last role as CHRO at Texport Industries, he oversaw HR for 13,000+ employees across 13 manufacturing units and international offices in US, Spain, and Hong Kong. He has no relationship with the company's directors.",
            "Sentiment": "positive",
            "PublishDate": 1759335344710,
            "Source": "corporate_governance"
        },
        {
            "Title": "Keystone Realtors Board Approves ₹375 Crore Fundraising Through NCDs",
            "Summary": "Keystone Realtors' board has approved a fundraising initiative worth ₹375 crore through the issuance of secured redeemable non-convertible debentures (NCDs) on a private placement basis. The company will use this debt instrument to raise capital from select investors.",
            "Sentiment": "positive",
            "PublishDate": 1757503155655,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors Plans Board Meeting to Consider Debenture Fundraising",
            "Summary": "Keystone Realtors (Rustomjee) will hold a board meeting on September 10 to consider raising funds through debentures. The company has exceeded its annual pre-sales guidance, achieving over 25% in the first quarter with projects worth over ₹7,700 crore locked in against full-year guidance of ₹6,000 crore. Project launches in the April-June quarter were worth nearly ₹4,000 crore. However, quarterly financial performance declined with net profit dropping 44% to ₹14.5 crore from ₹26 crore, revenue falling 35% to ₹273 crore from ₹422 crore, and EBITDA decreasing to ₹13.4 crore from ₹43.4 crore. EBITDA margin compressed to 5% from 10%.",
            "Sentiment": "neutral",
            "PublishDate": 1757167260985,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors Schedules Board Meeting to Consider Debenture Fundraising",
            "Summary": "Keystone Realtors Limited has scheduled a Board of Directors meeting for September 10, 2025, to consider and approve raising funds through debentures. The company, which trades under the symbol RUSTOMJEE on stock exchanges, communicated this development to both the National Stock Exchange and Bombay Stock Exchange. The intimation was signed by Company Secretary Bimal K Nanda and is also available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1757161308780,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors Secures Three Mumbai Redevelopment Projects Worth Rs 7,700 Crore",
            "Summary": "Keystone Realtors Ltd acquired three redevelopment projects in Mumbai with a combined revenue potential exceeding Rs 7,700 crore. The company achieved record quarterly pre-sales of Rs 1,068 crore in the April-June period, marking a 75% increase from the same quarter last year. The three projects include a Rs 4,521 crore GTB Nagar Cluster redevelopment at Sion, a Rs 2,956 crore Lokhandwala Cluster project at Andheri West, and a Rs 251 crore redevelopment at Goregaon East, providing 3.25 million square feet of total saleable area. The company launched three new projects with an estimated value of Rs 4,000 crore, representing 57% of its Rs 7,000 crore launch target for the fiscal year. However, consolidated net profit declined 44% to Rs 14.51 crore due to lower income recognition under the project completion method. Total income fell to Rs 288.64 crore from Rs 437.20 crore in the previous year's corresponding period. CMD Boman Irani indicated the company plans to acquire more land parcels across Mumbai Metropolitan Region and may revise annual guidance after the second quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754909185583,
            "Source": "stock"
        },
        {
            "Title": "Keystone Realtors Makes Earnings Call Audio Recording Available for Quarterly Results",
            "Summary": "Keystone Realtors Limited has made available an audio recording of their earnings conference call discussing unaudited financial results for the quarter ended June 30, 2025. The call was conducted following a board meeting held on August 5, 2025. The company has provided the recording link on their website and notified stock exchanges NSE and BSE. The company trades under the scrip symbol RUSTOMJEE on NSE with scrip code 543669.",
            "Sentiment": "neutral",
            "PublishDate": 1754403170135,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Reports No Deviation in QIP Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Keystone Realtors Limited has submitted a monitoring agency report confirming no deviation in the utilization of proceeds from their Qualified Institutional Placement (QIP) for the quarter ended June 30, 2025. The company raised Rs. 800 crore through the QIP (Rs. 782.72 crore net proceeds) during May 22-27, 2024. CARE Ratings Limited, serving as the monitoring agency, confirmed that all funds were utilized appropriately according to the stated objectives. The QIP proceeds were allocated across three main areas: Rs. 490 crore for land acquisition costs, joint development agreements, and property redevelopment; Rs. 110 crore for debt repayment; and Rs. 182.72 crore for general corporate purposes. All funds have been fully utilized, with Rs. 62.58 crore spent during the quarter primarily on landowner payments (Rs. 61.16 crore) and vendor payments (Rs. 1.42 crore). The monitoring agency found no major deviations from previous reports and confirmed that utilization aligned with the offer document disclosures.",
            "Sentiment": "positive",
            "PublishDate": 1754393082530,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors Reports Record Q1FY26 Performance with 75% Pre-Sales Growth",
            "Summary": "Keystone Realtors Limited achieved record quarterly performance in Q1FY26 with pre-sales of INR 10.68 billion, marking 75% growth over Q1FY25. The company launched 3 new projects worth INR 39.67 billion and added 3 projects with combined GDV of INR 77.27 billion, exceeding full-year FY26 guidance. Collections reached INR 5.75 billion, up 19% year-on-year. Financial results showed revenue from operations of INR 2.73 billion, EBITDA of INR 0.29 billion, and PAT of INR 0.16 billion. The company's credit rating was upgraded to ICRA A+ from ICRA A, reflecting improved financial health. Gross debt stands at INR 3.04 billion with debt-to-equity ratio of 0.11 and net debt at nil. Chairman Boman Irani highlighted the strength of their product portfolio and asset-light, capital-efficient model focused on redevelopment within Mumbai MMR.",
            "Sentiment": "positive",
            "PublishDate": 1754387366482,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Reports 36% Decline in Q1 Revenue to 2.7 Billion Rupees",
            "Summary": "Keystone Realtors reported quarterly revenue of 2.7 billion rupees, representing a significant decrease from 4.22 billion rupees in the same period last year. The year-over-year comparison shows a decline of approximately 1.52 billion rupees in revenue performance.",
            "Sentiment": "negative",
            "PublishDate": 1754386087408,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Reports Decline in Q1 Profitability Metrics",
            "Summary": "Keystone Realtors reported Q1 EBITDA of 137 million rupees, down from 432 million rupees in the same period last year. The company's EBITDA margin decreased to 5.03% from 10.23% year-over-year. Consolidated net profit for the quarter stood at 145 million rupees, compared to 258 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754385352136,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Appoints Vikas Singhal as CEO - Special Projects & Head Strategic Initiatives",
            "Summary": "Keystone Realtors Limited appointed Mr. Vikas Singhal as CEO - Special Projects & Head Strategic Initiatives, effective August 1, 2025. The appointment is classified as a Senior Management Personnel position. Singhal holds a B.Tech (Civil Engineering) degree from IIT (BHU) Varanasi and brings over three decades of experience in the real estate and construction industry. He has held leadership roles at Godrej Properties Limited, Larsen & Toubro Limited, and Emaar MGF. In his previous role, he served as Chief Operations Officer at Godrej Properties Limited, leading functions including Business P&L, Business strategy, Operations, Design, Budgeting, and Contracts. He has no relationship with the company's directors.",
            "Sentiment": "positive",
            "PublishDate": 1754048508924,
            "Source": "corporate_governance"
        },
        {
            "Title": "Keystone Realtors Announces Important Developments at Subsidiary Keymidtown Developers",
            "Summary": "Keystone Realtors has announced that its subsidiary Keymidtown Developers Incorporated has made important developments. No specific details about the nature or scope of these developments were provided.",
            "Sentiment": "positive",
            "PublishDate": 1753360120650,
            "Source": "stock"
        },
        {
            "Title": "Keystone Realtors Incorporates Wholly Owned Subsidiary Keymidtown Developers for Real Estate Development",
            "Summary": "Keystone Realtors Limited has incorporated a new wholly owned subsidiary named Keymidtown Developers Private Limited on July 23, 2025. The subsidiary operates in the real estate and construction sector and was established for the development of new projects. The company has a paid-up capital of Rs. 0.10 lakh, with shares subscribed at par value of Rs. 10 per share. Keystone Realtors holds 100% shareholding in the newly incorporated entity, which is based in India.",
            "Sentiment": "neutral",
            "PublishDate": 1753360034435,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors: Confident to Exceed Rs 4,000-Crore Pre-Sales Guidance for FY26",
            "Summary": "Keystone Realtors Ltd. reports strong Q1 FY26 performance with Rs 1,068 crore pre-sales, a 75% YoY growth. The company is on track to surpass its Rs 4,000 crore FY26 guidance. It has acquired 18 projects in the last 2.5 years with a total GDV of Rs 20,000 crore, and added Rs 7,000 crore worth of projects this quarter. Keystone is expanding within MMR and entering Nagpur with a Rs 1,000 crore project.",
            "Sentiment": "positive",
            "PublishDate": 1752025693000,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors: Record Q1 Performance with 159% Volume Growth",
            "Summary": "Keystone Realtors reported strong Q1 FY2026 results with a 159% YoY increase in volume to 0.63 million sq ft. Pre-sales grew 75% YoY to ₹1,068 crore, while collections rose 19% to ₹575 crore. The company launched three projects with 0.91 million sq ft area and ₹4,000 crore GDV, achieving 57% of its launch guidance. It also added three projects with 3.25 million sq ft area and ₹7,725 crore GDV, surpassing full-year guidance on new additions.",
            "Sentiment": "positive",
            "PublishDate": 1751862330000,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Exceeds FY26 New Additions Target",
            "Summary": "Keystone Realtors' Chairman and Managing Director (CMD) has announced that the company has surpassed its full-year FY26 targets for new additions. This achievement suggests strong performance and growth for the real estate company ahead of schedule.",
            "Sentiment": "positive",
            "PublishDate": 1751857622000,
            "Source": "default"
        },
        {
            "Title": "Keystone Realtors Approved for GTB Nagar Redevelopment Project",
            "Summary": "Keystone Realtors has been chosen by eight housing societies as the developer for a redevelopment project. The company has received approval for the GTB Nagar redevelopment project in collaboration with MHADA (Maharashtra Housing and Area Development Authority).",
            "Sentiment": "positive",
            "PublishDate": 1751638729000,
            "Source": "default"
        },
        {
            "Title": "Keystone Realtors: Secures Rs 3,000 Crore Project in Mumbai Redevelopment",
            "Summary": "Keystone Realtors has been selected to redevelop eight housing societies in Andheri West, Mumbai. The project covers 4.75 acres with 548 existing members and is expected to generate Rs 3,000 crore from a saleable area of 10.6 lakh square feet.",
            "Sentiment": "positive",
            "PublishDate": 1751440558000,
            "Source": "order&deals"
        },
        {
            "Title": "Keystone Realtors: Shares Surge on Second Major Redevelopment Project",
            "Summary": "Keystone Realtors secured a cluster redevelopment project in Andheri West, Mumbai, involving 8 housing societies with 4.75 acres of plot area. The project is expected to generate ₹3,000 crore in gross development value. This follows a recent ₹4,000 crore redevelopment project in GTB Nagar, Mumbai. The company's shares have risen for nine consecutive days, gaining over 25% in the last month.",
            "Sentiment": "positive",
            "PublishDate": 1751432605000,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors Selected for Andheri West Cluster Redevelopment Project",
            "Summary": "Keystone Realtors has been chosen by eight societies for a cluster redevelopment project in Andheri West (Lokhandwala). The project is valued at ₹3000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1751427331000,
            "Source": "default"
        },
        {
            "Title": "Keystone Realtors: Rs 4,500 Crore Revenue Expected from Mumbai Redevelopment Project",
            "Summary": "Keystone Realtors Ltd has received approval to redevelop an 11.19-acre project in GTB Nagar, Sion, Mumbai. The project, in collaboration with MHADA, is expected to generate sales revenue of over Rs 4,500 crore from a saleable area of approximately 20.7 lakh square feet. It will benefit over 1,400 families and is part of the company's urban transformation initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1751361361000,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors: Shares Surge on ₹4,521 Crore MHADA Redevelopment Project",
            "Summary": "Keystone Realtors received a Letter of Acceptance for redeveloping GTB Nagar in Mumbai's Sion suburb, in collaboration with MHADA. The project covers 11.19 acres, benefiting over 1,400 families with a saleable area of 20.7 lakh square feet. Shares jumped 7% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1751345973000,
            "Source": "order&deals"
        },
        {
            "Title": "Keystone Realtors Awarded INR 4,521 Crore GTB Nagar Redevelopment Project",
            "Summary": "Keystone Realtors has received a Letter of Award for the redevelopment of GTB Nagar in partnership with MHADA (Maharashtra Housing and Area Development Authority). The project is valued at INR 4,521 crores. The company's total market capitalization is reported to be INR 8,000 crores.",
            "Sentiment": "positive",
            "PublishDate": 1751344324000,
            "Source": "default"
        },
        {
            "Title": "Keystone Realtors Targets 33% Growth in Presales by FY26",
            "Summary": "Keystone Realtors is aiming for a 33% growth in presales, expecting to reach ₹4000 crore by FY26. The company anticipates high demand in the real estate sector to drive this growth.",
            "Sentiment": "positive",
            "PublishDate": 1750912191000,
            "Source": "default"
        },
        {
            "Title": "Keystone Realtors: Last Day to Buy Shares for FY25 Dividend Eligibility",
            "Summary": "Keystone Realtors has announced a final dividend of Rs 1.50 per share for FY25. The record date is set for May 23, making May 22 the last day to buy shares to qualify for the dividend under T+1 settlement. The company reported Q4 FY25 revenue of Rs 585 crore, Ebitda of Rs 107 crore, and PAT of Rs 69 crore.",
            "Sentiment": "positive",
            "PublishDate": 1747896373000,
            "Source": "corporate_action"
        },
        {
            "Title": "Keystone Realtors Outlines Sales Strategy and Project Focus",
            "Summary": "Keystone Realtors has announced its sales strategy, targeting 35% of inventory sales in the launch phase, 35% in the sustenance phase, and 30% in the finishing phase. The company also revealed that 16 new projects are in the midmass and aspiration category, aligning with their strategic focus on urban consolidation.",
            "Sentiment": "positive",
            "PublishDate": 1747279805000,
            "Source": "default"
        },
        {
            "Title": "Keystone Realtors Plans Multiple Project Launches in FY25",
            "Summary": "Keystone Realtors has announced plans to launch 3-4 new projects in the fiscal year 2025, stemming from recent acquisitions. This information was shared during a company conference call, indicating a strategic expansion of their real estate portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1747279728000,
            "Source": "default"
        },
        {
            "Title": "Keystone Realtors: Q4 Profit Soars Over 2-Fold to Rs 67 Crore",
            "Summary": "Keystone Realtors reported a 120% increase in Q4 consolidated net profit to Rs 66.95 crore. FY 2024-25 profit rose 69% to Rs 188.13 crore. Annual pre-sales grew 34% to Rs 3,028 crore. The company added 9 land parcels with potential sales of Rs 4,783 crore. A final dividend of Rs 1.50 per share was recommended.",
            "Sentiment": "positive",
            "PublishDate": 1747219233000,
            "Source": "earnings"
        },
        {
            "Title": "Keystone Realtors Surpasses FY25 Pre-Sales Guidance, Sets Higher Target for FY26",
            "Summary": "Keystone Realtors has reported pre-sales of ₹30.28 billion, exceeding its FY25 guidance of ₹30 billion. The company has set a new target of ₹40 billion for FY26, indicating strong growth expectations.",
            "Sentiment": "positive",
            "PublishDate": 1747215709000,
            "Source": "default"
        },
        {
            "Title": "Keystone Realtors Q4 Results and Dividend Declaration",
            "Summary": "Keystone Realtors reported its Q4 financial results. Revenue decreased to 5.8B rupees from 8.1B rupees year-over-year. EBITDA slightly decreased to 505M rupees from 521M rupees, but EBITDA margin improved to 8.63% from 6.42%. Consolidated net profit increased significantly to 648M rupees from 307M rupees. The company also declared a dividend of 1.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747214013000,
            "Source": "result"
        }
    ]
}