{
    "Symbol": "RVHL",
    "ISIN": "INE09E501017",
    "News": [
        {
            "Title": "Ravinder Heights Appoints New Independent Director",
            "Summary": "Ravinder Heights Limited shareholders approve appointment of Chander Mohan Mehra as Non-Executive Independent Director for 5 years through postal ballot with 99.99% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1765873230142,
            "Source": "co_actions_results"
        },
        {
            "Title": "Ravinder Heights Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Ravinder Heights Limited has issued a postal ballot notice seeking shareholder approval through remote e-voting for the appointment of Mr. Chander Mohan Mehra as Non-Executive Independent Director for five consecutive years from November 12, 2025. The e-voting process will commence on November 15, 2025, and conclude on December 14, 2025, with results to be announced within two working days thereafter.",
            "Sentiment": "neutral",
            "PublishDate": 1763112287671,
            "Source": "corporate_action"
        },
        {
            "Title": "Ravinder Heights Reports Strong Q2 Performance with Rs 5,500 Lakh Revenue Boost from Security Deposit",
            "Summary": "Ravinder Heights Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company's consolidated revenue from operations reached Rs 3,501.01 lakh for the quarter, with total income of Rs 5,630.70 lakh. The significant revenue increase was driven by a Rs 5,500 lakh recognition from a collaboration agreement where Bestech India Pvt. Ltd. paid an additional non-refundable security deposit of Rs 3,000 lakh to Radhika Heights Limited and its subsidiaries. This was in addition to the original Rs 2,500 lakh deposit from December 2019. The company reported consolidated profit after tax of Rs 3,987.31 lakh for the quarter. Additionally, the Board appointed Mr. Chander Mohan Mehra as Additional Director in the category of Non-Executive Independent Director for a five-year term, subject to shareholder approval through postal ballot. Mehra is a retired government official with experience at Customs, Enforcement Directorate, and SEBI.",
            "Sentiment": "positive",
            "PublishDate": 1762979156598,
            "Source": "earnings"
        },
        {
            "Title": "Ravinder Heights Unit Secures RERA Licenses for Two Affordable Housing Projects in Gurugram",
            "Summary": "Ravinder Heights announced that its unit has obtained RERA licenses for two affordable housing projects located in Gurugram. These projects are being developed in partnership with Bestech Group.",
            "Sentiment": "positive",
            "PublishDate": 1759565116809,
            "Source": "stock"
        },
        {
            "Title": "Ravinder Heights Limited Appoints Ms. Vertika as Company Secretary & Compliance Officer",
            "Summary": "Ravinder Heights Limited has appointed Ms. Vertika (ACS 74813) as Company Secretary & Compliance Officer effective August 11, 2025. The Board of Directors approved the appointment on August 7, 2025, based on the recommendation of the Nomination & Remuneration Committee. Ms. Vertika is an associate member of the Institute of Company Secretaries of India and a law graduate from Lucknow University, with experience in secretarial compliances for listed and unlisted companies. She is not related to any directors of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1754653225826,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ravinder Heights Limited Reports Quarterly Results and Key Management Changes",
            "Summary": "Ravinder Heights Limited approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported a net loss of Rs. 17.11 lakh compared to Rs. 20.20 lakh loss in the same quarter last year. Revenue from operations remained flat at Rs. 35.28 lakh. On a consolidated basis, the company posted a net loss of Rs. 51.97 lakh versus Rs. 41.57 lakh loss in the previous year quarter, with revenue from operations declining to Rs. 12.72 lakh from Rs. 15.28 lakh. The Board also approved several key appointments including re-appointment of M/s. Dewan P N Chopra & Co. as statutory auditors for five years (FY 2025-26 to FY 2029-30), appointment of M/s. RAA & Associates LLP as secretarial auditors, and re-appointment of M/s. SNVA & Associates as internal auditors. Additionally, Ms. Renuka Uniyal resigned as Company Secretary effective August 8, 2025, and Ms. Vertika was appointed as her replacement effective August 11, 2025. The company scheduled its 6th Annual General Meeting for September 27, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754572973504,
            "Source": "earnings"
        }
    ]
}