{
    "Symbol": "RVNL",
    "ISIN": "INE415G01027",
    "News": [
        {
            "Title": "Rail Vikas Nigam Declares ₹1 Interim Dividend",
            "Summary": "Rail Vikas Nigam Limited has announced an interim dividend of ₹1.00 per share for its shareholders, reflecting the company's commitment to returning value to investors.",
            "Sentiment": "positive",
            "PublishDate": 1770285619809,
            "Source": "co_actions_results"
        },
        {
            "Title": "RVNL Q3 Net Profit Rises to ₹3.2 Billion",
            "Summary": "Rail Vikas Nigam Limited reports consolidated net profit of ₹3.2 billion in Q3, marking modest growth from ₹3.11 billion in the corresponding quarter of previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770285592104,
            "Source": "co_actions_results"
        },
        {
            "Title": "RVNL schedules Q3FY26 earnings call for Feb 6, 2026",
            "Summary": "Rail Vikas Nigam Limited announces investor conference call on February 6, 2026 at 4:00 PM IST to discuss Q3FY26 financial results and operations for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769676159374,
            "Source": "co_actions_results"
        },
        {
            "Title": "RVNL-GPT JV Wins ₹1,201 Cr Rail-Road Bridge Project",
            "Summary": "Rail Vikas Nigam's joint venture emerges as lowest bidder for Northern Railway's ₹1,201 crore Ganga bridge construction project in Varanasi with 48-month execution timeline.",
            "Sentiment": "positive",
            "PublishDate": 1769610461019,
            "Source": "co_actions_results"
        },
        {
            "Title": "RVNL Appoints B.K. Jain as Part-Time Director",
            "Summary": "Rail Vikas Nigam Limited announces appointment of Shri B.K. Jain, Executive Director/L&A Railway Board, as Part-Time Official Director effective January 28, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769597313819,
            "Source": "stocks"
        },
        {
            "Title": "RVNL Wins ₹242 Cr Railway OHE Upgrade Contract",
            "Summary": "Rail Vikas Nigam Limited emerges as lowest bidder for South Central Railway's OHE upgradation project worth ₹242.50 crore covering 154 RKM/462 TKM section.",
            "Sentiment": "positive",
            "PublishDate": 1769519965387,
            "Source": "co_actions_results"
        },
        {
            "Title": "RVNL Wins ₹87.56 Cr Video Surveillance Contract",
            "Summary": "Rail Vikas Nigam Limited emerges as lowest bidder for South Eastern Railway's IP-based video surveillance system contract worth ₹87.56 crores, to be executed over 10 months.",
            "Sentiment": "positive",
            "PublishDate": 1768561878143,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rail Vikas Nigam Shifts Corporate Office to WTC",
            "Summary": "Rail Vikas Nigam Limited announces relocation of its registered and corporate office from Bhikaji Cama Place to World Trade Center, Tower A in Nauroji Nagar, New Delhi effective January 15, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768484599070,
            "Source": "stocks"
        },
        {
            "Title": "RVNL shares decline for fifth consecutive session",
            "Summary": "Rail Vikas Nigam shares extended losses for the fifth straight trading session on January 9, declining nearly 3% to hit an intraday low of ₹334.70 amid broad-based market selling pressure.",
            "Sentiment": "negative",
            "PublishDate": 1767947224732,
            "Source": "stocks"
        },
        {
            "Title": "RVNL Wins ₹201 Cr East Coast Railway Order",
            "Summary": "Rail Vikas Nigam Limited secured a ₹201.23 crore contract from East Coast Railway to establish a wagon Periodical Overhauling workshop with 200-wagon capacity at Kantabanji, Odisha.",
            "Sentiment": "positive",
            "PublishDate": 1767934182605,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rail Vikas Nigam Wins ₹201 Crore Wagon Workshop Deal",
            "Summary": "Rail Vikas Nigam Limited has secured a Letter of Award (LoA) worth ₹201 crores for the Wagon POH Workshop project, marking a significant contract win for the railway infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1767924905175,
            "Source": "co_actions_results"
        },
        {
            "Title": "RVNL Gets ₹201-Cr Railway Workshop Project from ECR",
            "Summary": "Rail Vikas Nigam Limited received Letter of Acceptance from East Coast Railway for setting up 200-capacity wagon POH workshop at Kantabanji worth ₹201.23 crores, to be completed in 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1767868616731,
            "Source": "co_actions_results"
        },
        {
            "Title": "RVNL Director Prem Sagar Gupta Steps Down",
            "Summary": "Rail Vikas Nigam Limited announces cessation of Shri Prem Sagar Gupta as Part-time Official Director effective January 5, 2026, following his transfer from Railway Board position.",
            "Sentiment": "neutral",
            "PublishDate": 1767617249611,
            "Source": "stocks"
        },
        {
            "Title": "RVNL Appoints Amit Tandon as Director (Projects)",
            "Summary": "Rail Vikas Nigam Limited announces the appointment of Shri Amit Tandon as Director (Projects) effective January 2, 2026, bringing over 25 years of railway and metro infrastructure experience to the role.",
            "Sentiment": "positive",
            "PublishDate": 1767349334761,
            "Source": "stocks"
        },
        {
            "Title": "RVNL shares in focus after winning ₹201 crore project",
            "Summary": "Rail Vikas Nigam shares will be in spotlight after emerging as L1 bidder for ₹201.23 crore wagon workshop project from East Coast Railway, despite recent stock decline of 13.59% over past year.",
            "Sentiment": "positive",
            "PublishDate": 1767009237116,
            "Source": "co_actions_results"
        },
        {
            "Title": "RVNL Gets ₹4.26 Lakh Demand Notice from Hyderabad",
            "Summary": "Rail Vikas Nigam Limited received another demand notice worth ₹4.26 lakhs from Deputy Commissioner Jurisdiction BEGUMPET STU3, Telangana State, Hyderabad for FY 2021-22, bringing total demands to ₹9.41 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766396288593,
            "Source": "stocks"
        },
        {
            "Title": "RVNL Secures Rs 1.45 Billion Contract from Southern Railway",
            "Summary": "RVNL has received a Letter of Acceptance (LOA) worth Rs 1.45 billion from Southern Railway. This contract award strengthens RVNL's order book and represents significant business development for the railway infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1764806804455,
            "Source": "order&deals"
        },
        {
            "Title": "Rail Vikas Nigam Limited Promotes V.R. Naidu to Executive Director/Civil",
            "Summary": "Rail Vikas Nigam Limited promoted Shri Vegi Ramu Naidu to Executive Director/Civil effective December 3, 2025, following a selection process held on November 18, 2025. The promotion moves Naidu, a 1993 batch Indian Railway Service of Engineers officer with extensive infrastructure construction experience, to E-9 Grade of CPSE with IDA Scale of Rs 1,50,000-3,00,000.",
            "Sentiment": "positive",
            "PublishDate": 1764771905360,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rail Vikas Nigam Limited Fined Rs. 9.77 Lakh by BSE for Board Composition Non-Compliance",
            "Summary": "BSE imposed a fine of Rs. 9,77,040 on Rail Vikas Nigam Limited for non-compliance with board and committee composition regulations for the quarter ended September 30, 2025. The government-owned railway company clarified that all directors are appointed by the Government of India through the Ministry of Railways, and expects fine waiver upon compliance as per SEBI policy.",
            "Sentiment": "neutral",
            "PublishDate": 1764410700604,
            "Source": "corporate_governance"
        },
        {
            "Title": "RVNL Secures New Project Worth 96.4 Million Rupees",
            "Summary": "RVNL has received a Letter of Award for a project valued at 96.4 million rupees. This new project award will contribute to the company's order book and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1764244697040,
            "Source": "order&deals"
        },
        {
            "Title": "RVNL Emerges as Lowest Bidder for Railway Project Worth Rs 1.81 Billion",
            "Summary": "RVNL has emerged as the lowest bidder for a railway infrastructure project valued at Rs 1.81 billion. The development positions the company to potentially secure this significant contract, which could contribute to its order book and revenue pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1763942730253,
            "Source": "stock"
        },
        {
            "Title": "Rail Vikas Nigam Limited Wins Rs 181 Crore Railway Electrification Contract",
            "Summary": "Rail Vikas Nigam Limited emerged as the lowest bidder (L1) from North Eastern Railway for design, supply, erection, testing and commissioning of OHE modification and feeder wire work of 2x25kV traction system for capacity upgradation of UTR-MWP section in Lucknow division. The domestic contract is valued at Rs 180.78 crore including applicable taxes and falls under the company's normal course of business.",
            "Sentiment": "positive",
            "PublishDate": 1763727105998,
            "Source": "order&deals"
        },
        {
            "Title": "RVNL Reports Q2 FY26 Results with INR 90,000 Crores Order Book",
            "Summary": "Rail Vikas Nigam Limited conducted its quarterly earnings call revealing a total order book of INR 90,000 crores, comprising INR 43,000 crores from legacy railway projects and INR 46,000 crores from competitive bidding across various sectors. The company maintains revenue guidance of INR 21,000-22,000 crores for FY26 and expects order inflows of INR 8,000-10,000 crores, though EBITDA margins have compressed to 4-5% due to increased contribution from lower-margin bidding projects.",
            "Sentiment": "neutral",
            "PublishDate": 1763379591552,
            "Source": "earnings"
        },
        {
            "Title": "RVNL Targets 10% Revenue Growth in FY27 with 5-6% Profit Margin Goal",
            "Summary": "RVNL has outlined its strategic plans to increase revenue by at least 10% in FY27 compared to FY26. The company aims to achieve profit margins of 5-6% through a focused approach on higher-margin projects. Key strategies include targeting less competitive HAM (Hybrid Annuity Model) projects and expanding international operations to drive growth and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763005493837,
            "Source": "stock"
        },
        {
            "Title": "Rail Vikas Nigam Limited Appoints M/s. Ravi Rajan Co. LLP as Internal Auditor",
            "Summary": "Rail Vikas Nigam Limited's Board of Directors approved the appointment of M/s. Ravi Rajan Co. LLP, Chartered Accountants, as Internal Auditor for a period up to March 31, 2026. The decision was made during a board meeting held on November 11, 2025. Ravi Rajan Co LLP is an accountancy firm incorporated in 1989 with 36 years of experience, 15 partners, and a team of 225 professionals providing various services including support from lawyers, company secretaries, engineers, and insolvency professionals.",
            "Sentiment": "neutral",
            "PublishDate": 1762914488227,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rail Vikas Nigam Limited Faces Exchange Fines for Board Composition Non-Compliance",
            "Summary": "Rail Vikas Nigam Limited (RVNL) received fines from NSE and BSE for non-compliance with SEBI regulations regarding board and committee composition for the quarter ended June 30, 2025. The violations related to Regulation 17(1)(a), 17(1)(b), 18(1)(b), and 19(1)(c) of SEBI Listing Obligations and Disclosure Requirements Regulations, 2015. RVNL's Board noted the non-compliance issues stem from vacancies in Independent Directors positions, including one woman Independent Director. The company has been following up with the Ministry of Railways through several reminder letters requesting immediate action for these appointments, noting that as a government company, RVNL has no role in director appointments.",
            "Sentiment": "negative",
            "PublishDate": 1762910898553,
            "Source": "corporate_governance"
        },
        {
            "Title": "Rail Vikas Nigam Reports 53% Drop in Q2 Net Profit to Rs 196 Crores",
            "Summary": "Rail Vikas Nigam Limited reported a net profit of Rs 196.11 crores for the quarter ended September 30, 2025, compared to Rs 302.81 crores in the same period last year, marking a 53% decline. Revenue from operations decreased to Rs 958.50 crores from Rs 4,869.22 crores year-on-year. For the half-year period, net profit fell to Rs 520.31 crores from Rs 698.48 crores previously. The company faces ongoing issues with Krishnapatnam Railway Company Limited (KRCL), with Rs 1,190.73 crores receivable including Rs 889.95 crores in cumulative interest charges due to delayed payments. The Board approved these unaudited financial results in a meeting held on November 11, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762908815835,
            "Source": "earnings"
        },
        {
            "Title": "RVNL Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "RVNL reported Q2 consolidated net profit of 2.3 billion rupees, down from 2.87 billion rupees in the same period last year. Revenue increased to 51.23 billion rupees from 48.55 billion rupees year-over-year. EBITDA declined to 2.17 billion rupees from 2.71 billion rupees, while EBITDA margin compressed to 4.23% from 5.59% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762869557908,
            "Source": "earnings"
        },
        {
            "Title": "Rail Vikas Nigam Limited Receives Railway Electrification Contract Worth Rs 144.45 Crore",
            "Summary": "Rail Vikas Nigam Limited has received a Letter of Acceptance from South Central Railway for overhead electrification work. The contract involves design, supply, erection, testing and commissioning for upgrading the existing 1X25kV system to 2X25kV feeding system with feeder and earthing works in the Ramgundam-Kazipet section of Secunderabad Division. The project covers 92 route kilometers and 276 track kilometers. The contract value is Rs 144.45 crore including applicable taxes. The company stated this work is in the normal course of its business operations.",
            "Sentiment": "positive",
            "PublishDate": 1762818574469,
            "Source": "stock"
        },
        {
            "Title": "Rail Vikas Nigam Wins ₹272 Crore Railway Contract as Lowest Bidder",
            "Summary": "Rail Vikas Nigam Ltd. emerged as the lowest bidder for a ₹272 crore contract from Central Railway. The project involves designing, supplying, testing, and commissioning traction substations and posts across the Daund-Solapur sections. The 24-month EPC project aims to meet a 3,000 MT loading target. The company clarified that promoters have no interest in Central Railway and the order is not a related party transaction. Rail Vikas previously received three orders in October, including a ₹165.5 crore infrastructure project from North Eastern Railway.",
            "Sentiment": "positive",
            "PublishDate": 1762435488797,
            "Source": "stock"
        },
        {
            "Title": "RVNL Wins ₹165.5 Crore Railway Bridge Construction Project",
            "Summary": "Rail Vikas Nigam Limited (RVNL) emerged as the lowest bidder for a ₹165.54 crore infrastructure project from North Eastern Railway. The project involves constructing the substructure of Bridge No. 50 with 14 spans of 61.0 metres each over river Gandak, between Paniyahwa and Valmikinagar stations. The bridge features Double D-type well foundation for double line with RDSO 25T axle loading standard as part of doubling work between Gorakhpur Cantt and Valmikinagar section. RVNL also secured another project worth ₹144.44 crore from South Central Railway for OHE upgradation work in the Ramgundam-Kazipet section with an 18-month execution period. RVNL shares closed 0.09% higher at ₹329.75 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1761580121041,
            "Source": "stock"
        },
        {
            "Title": "RVNL Secures Project Worth ₹1.65 Billion",
            "Summary": "RVNL has secured a project valued at ₹1.65 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1761565412822,
            "Source": "stock"
        },
        {
            "Title": "Rail Vikas Nigam Wins Rs 144 Crore Railway Electrification Contract from South Central Railway",
            "Summary": "Rail Vikas Nigam Limited has emerged as the lowest bidder for a railway electrification project from South Central Railway. The contract involves design, supply, erection, testing and commissioning for overhead equipment upgradation from existing 1X25kV system to 2X25kV AT feeding system with feeder and earthing works in the Ramgundam-Kazipet section of Secunderabad Division. The project spans 92 RKM/276 TKM and is valued at Rs 144.45 crore including applicable taxes. The domestic contract has an execution timeline of 18 months. The company confirmed this work falls under its normal course of business and involves no related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1760709342747,
            "Source": "order&deals"
        },
        {
            "Title": "Rail Vikas Nigam Wins ₹40.42 Crore Western Railway S&T Maintenance Contract",
            "Summary": "Rail Vikas Nigam has emerged as the lowest bidder for a Western Railway contract valued at ₹40.42 crore. The contract covers two years of S&T (Signaling and Telecommunications) maintenance services.",
            "Sentiment": "positive",
            "PublishDate": 1759478867596,
            "Source": "order&deals"
        },
        {
            "Title": "Rail Vikas Nigam Limited Wins Southern Railway Traction Sub-Station Project Bid",
            "Summary": "Rail Vikas Nigam Limited has been selected as the lowest bidder for a Southern Railway project involving the design, supply, erection, testing and commissioning of traction sub-stations with power quality compensating equipment for the Jolarpettai Junction - Salem Junction section. The project includes Scott-Connected traction sub-stations, associated switching posts for 2x25 kV AT feeding system, and SCADA & Automatic Fault Locator systems for Salem Division of Southern Railway in connection with Mission 3000MT Loading Target. The company has informed stock exchanges that this work falls under its normal course of business.",
            "Sentiment": "positive",
            "PublishDate": 1758545020728,
            "Source": "stock"
        },
        {
            "Title": "RVNL Shares Surge 12.5% in 11-Day Rally Amid Railway Sector Recovery",
            "Summary": "Rail Vikas Nigam Ltd (RVNL) shares extended gains for an eleventh consecutive session, rising 1.5% to Rs 367.80. The stock has climbed 12.5% over this 11-day period, though it remains down 15% in 2025 and 29% over the past year. The rally is part of a broader recovery in railway stocks, with companies like Titagarh Rail, Ircon International, Texmaco Rail, RailTel, Jupiter Wagons, and IRFC gaining 4-13% over the past week. Market experts attribute the rebound to reset valuations after last year's decline. RVNL recently won a Rs 169 crore traction substation contract from West Central Railway for the Bina-RTA project in Bhopal Division, to be completed in 540 days. Technical indicators show the stock trading above five of eight key moving averages, with RSI at 67.6 and MACD at 3.5, both supporting the bullish momentum.",
            "Sentiment": "positive",
            "PublishDate": 1758264832309,
            "Source": "stock"
        },
        {
            "Title": "RVNL Wins ₹169.49 Crore West Central Railway Project as Lowest Bidder",
            "Summary": "RVNL has emerged as the lowest bidder for a West Central Railway project valued at ₹169.49 crore. The company's successful bid positions it to secure this railway infrastructure contract.",
            "Sentiment": "positive",
            "PublishDate": 1757510188222,
            "Source": "stock"
        },
        {
            "Title": "RVNL Denied Approval for Wholly Owned Subsidiary Formation by DIPAM",
            "Summary": "RVNL has been denied approval by DIPAM (Department of Investment and Public Asset Management) for the formation of a wholly owned subsidiary. The rejection prevents the company from establishing the proposed subsidiary structure.",
            "Sentiment": "negative",
            "PublishDate": 1757340141375,
            "Source": "stock"
        },
        {
            "Title": "RVNL Signs Joint Venture Agreement with Texmaco Rail & Engineering for Railway Infrastructure Projects",
            "Summary": "Rail Vikas Nigam Limited has signed a Joint Venture Agreement with Texmaco Rail & Engineering Ltd. to undertake projects in railway and allied infrastructure sectors. The joint venture will have a 51% shareholding for RVNL and 49% for Texmaco Rail & Engineering Ltd. The JV company will focus on rolling stock manufacturing and maintenance, EPC projects in railways, bidding for domestic and international tenders, and setting up railway workshops and depots. Primary operations will be in India with potential expansion to other geographies. The joint venture is subject to RVNL's Board approval and other statutory clearances. RVNL operates as a PSU under the Ministry of Railways, while Texmaco Rail & Engineering is part of a group of companies involved in rolling stock and allied infrastructure business.",
            "Sentiment": "positive",
            "PublishDate": 1756307080777,
            "Source": "order&deals"
        },
        {
            "Title": "S.C. Jain Appointed as CMD of RVNL",
            "Summary": "S.C. Jain has been appointed to serve as Chairman and Managing Director (CMD) of Rail Vikas Nigam Limited (RVNL).",
            "Sentiment": "neutral",
            "PublishDate": 1755874696656,
            "Source": "corporate_governance"
        },
        {
            "Title": "RVNL Shares Rise 2% After Securing Rs 178.65 Crore Contract from IRCON International",
            "Summary": "Rail Vikas Nigam Limited (RVNL) shares jumped 2% to reach a day's high of Rs 330.65 following the announcement of a Rs 178.65 crore order from IRCON International. The contract involves supplying signalling, telecommunications, and EIMWB materials, along with installation and commissioning of Electronic Interlocking systems at 10 new stations including Surakachhar, Block Cabin, Katghora Road, Bhingra, and Putiwa. The project also covers six new IBSs across block sections such as Bhingra-Putiwa, Putiwa-Matin, and Dhangawan-Pendra Road. The domestic contract, valued at Rs 178.65 crore inclusive of transportation, insurance, and taxes, is expected to be completed within 11 months. Despite the positive news, RVNL shares have declined 42.87% over the past year, 23.83% year-to-date, 20.45% over three months, and 13.34% in the last month.",
            "Sentiment": "positive",
            "PublishDate": 1755499936549,
            "Source": "stock"
        },
        {
            "Title": "RVNL Shares Rise 2% on Rs 90.6 Crore Southern Railway Order Win",
            "Summary": "RVNL shares traded over 2% higher after securing a Rs 90.6 crore order from Southern Railway for Video Surveillance System provision. The company will pay a final dividend of Rs 1.72 per share in the upcoming week. However, RVNL's June quarter results showed significant declines with consolidated net profit dropping 40% to Rs 135 crore from Rs 224 crore, revenue falling 4.1% to Rs 3,909 crore from Rs 4,074 crore, and Ebitda plunging 70.9% to Rs 52.9 crore from Rs 182 crore. The stock has declined 42.22% over the last 12 months and 21.97% year-to-date. Two analysts tracking the company have 'hold' and 'sell' ratings, with a consensus target price of Rs 272, suggesting 17% downside from current levels.",
            "Sentiment": "neutral",
            "PublishDate": 1755496817931,
            "Source": "stock"
        },
        {
            "Title": "Rail Vikas Nigam Reports Q1 FY26 Results with Revenue Challenges and One-Time Expenses",
            "Summary": "Rail Vikas Nigam Limited held its quarterly earnings conference call, reporting mixed performance for Q1 FY26. The company secured new orders worth Rs. 1,000 crores during the quarter, maintaining a total order book of Rs. 1,01,000 crores across 96 contracts. Revenue declined 3.42% in the first quarter, with railway turnover dropping 25% but bidding project revenue increasing threefold. Margins faced pressure due to Rs. 60 crores in one-time expenses, including Rs. 20 crores for BharatNet pre-bid consultancy costs and Rs. 40 crores from onerous contract provisions. The order book spans multiple sectors: civil engineering (Rs. 26,000 crores), electrical (Rs. 10,900 crores), and signalling/telecom (Rs. 14,700 crores). Management indicated revenue has already surpassed previous year levels as of the call date. The Vande Bharat manufacturing project experienced a 10-month delay, with the first prototype now expected by June 2026, followed by regular production in FY27. International order book stands at Rs. 4,000 crores, with Rs. 10,000 crores in bids submitted and another Rs. 6,000 crores in pipeline for the current year.",
            "Sentiment": "neutral",
            "PublishDate": 1755184124292,
            "Source": "earnings"
        },
        {
            "Title": "Rail Vikas Nigam Secures ₹178.6 Crore Contract from IRCON for Signalling and Telecommunications Work",
            "Summary": "Rail Vikas Nigam Limited received a Letter of Acceptance from IRCON International Limited for signalling and telecommunications work valued at ₹178.6 crore. The project involves supply and installation of electronic interlocking systems at 10 new stations including Surakachhar, Katghora Road, Bhingra, and others in the Gevra Road-Pendra Road section. The scope includes installation of distributed/centralised electronic interlocking at stations, new section control systems, telephone exchanges, and modifications to existing installations at Kusmunda Block Station and SECL SILO Siding yards. The contract is to be executed within 11 months including the monsoon period. The company stated this work falls within its normal course of business.",
            "Sentiment": "positive",
            "PublishDate": 1755167190528,
            "Source": "stock"
        },
        {
            "Title": "RVNL Secures ₹180 Crore Contract",
            "Summary": "RVNL has secured a contract worth ₹180 crore. The announcement indicates new business acquisition for the company.",
            "Sentiment": "positive",
            "PublishDate": 1755164999167,
            "Source": "stock"
        },
        {
            "Title": "RVNL Secures Approval for ₹906.5 Million Video Surveillance Project Across 441 Stations",
            "Summary": "RVNL has received approval for implementing a video surveillance system across 441 stations. The project is valued at ₹906.5 million.",
            "Sentiment": "positive",
            "PublishDate": 1755093126227,
            "Source": "stock"
        },
        {
            "Title": "Rail Vikas Nigam Reports Q1 FY26 Results; Announces Joint Venture Shareholding Restructure",
            "Summary": "Rail Vikas Nigam Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹3,925.30 crore and net profit of ₹127.85 crore for the quarter. Consolidated revenue stood at ₹3,908.77 crore with net profit of ₹134.36 crore. The company established a new wholly-owned subsidiary, Sabbavaram Sheelanagar Road Development Limited, in Andhra Pradesh with share capital of ₹1 lakh. Additionally, the Board noted a reshuffling in joint venture Kinet Railway Solutions Private Limited's shareholding pattern, where Joint Stock Company Metrowagonmash's stake reduced from 70% to 35%, Rail Vikas Nigam maintained 25%, and Joint Stock Company Locomotive Electronic System increased from 5% to 40%. The company continues to face receivables of ₹1,275.25 crore from joint venture partner Krishnapatnam Railway Company Limited, including ₹889.95 crore in interest on delayed payments.",
            "Sentiment": "neutral",
            "PublishDate": 1754993556997,
            "Source": "earnings"
        },
        {
            "Title": "RVNL Reports Decline in Q1 Financial Performance Across Key Metrics",
            "Summary": "RVNL reported Q1 revenue of 39.1 billion rupees, down from 40.7 billion rupees in the previous year. The company's consolidated net profit fell to 1.35 billion rupees from 2.24 billion rupees year-over-year. EBITDA declined significantly to 528 million rupees compared to 1.81 billion rupees in the same period last year. The EBITDA margin compressed to 1.35% from 4.46% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754992092046,
            "Source": "earnings"
        },
        {
            "Title": "Rail Vikas Nigam Limited Appoints Prakash Singh as Executive Director (Electrical)",
            "Summary": "Rail Vikas Nigam Limited has appointed Mr. Prakash Singh as Executive Director (Electrical) effective July 25, 2025. He will be part of the Senior Management Personnel of the company. Singh previously served as Chief Engineer/General on deputation in NCRTC. He does not hold any equity shares in the company.",
            "Sentiment": "positive",
            "PublishDate": 1753441715121,
            "Source": "corporate_governance"
        },
        {
            "Title": "RVNL Signs Business Partnership Agreement in Oman",
            "Summary": "RVNL has entered into an agreement with Ashraf Ghulam Mohmed Theba to pursue business growth opportunities in Oman. The partnership aims to expand RVNL's operations in the Omani market.",
            "Sentiment": "positive",
            "PublishDate": 1753192054456,
            "Source": "order&deals"
        }
    ]
}