{
    "Symbol": "RVTH",
    "ISIN": "INE0DAB01012",
    "News": [
        {
            "Title": "Revathi Equipment Q3 FY26 Results Published",
            "Summary": "Revathi Equipment India Limited published its unaudited standalone and consolidated financial results for Q3 FY26 ended December 31, 2025 in newspapers on January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769680806077,
            "Source": "co_actions_results"
        },
        {
            "Title": "Revathi Equipment Board Meet Set for Jan 28, 2026",
            "Summary": "Revathi Equipment India Limited has scheduled its board meeting for January 28, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768301463782,
            "Source": "co_actions_results"
        },
        {
            "Title": "Revathi Equipment Appoints Independent Director",
            "Summary": "Revathi Equipment India Limited successfully completes postal ballot process for appointing Mr. Natarajan S Iyer as Independent Director with 99.36% approval from shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1768221359833,
            "Source": "stocks"
        },
        {
            "Title": "Revathi Equipment India Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Revathi Equipment India Limited is conducting a postal ballot through remote e-voting from December 12, 2025 to January 10, 2026, seeking shareholder approval for appointing Mr. Natarajan Slyer as Independent Director for a five-year term starting November 7, 2025. The company requires special resolution approval as Mr. Slyer will turn 75 years during his tenure, necessitating additional shareholder consent under SEBI regulations for directors above 75 years of age.",
            "Sentiment": "neutral",
            "PublishDate": 1765199024942,
            "Source": "corporate_governance"
        },
        {
            "Title": "Revathi Equipment India Reports Mixed Q2 Performance with Declining Profits",
            "Summary": "Revathi Equipment India Limited announced its quarterly results for the period ended September 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 22.26 crores compared to Rs 19.71 crores in the same quarter last year. However, net profit after tax declined significantly to Rs 0.32 crores from Rs 2.70 crores in the corresponding quarter of the previous year. For the six-month period, revenue stood at Rs 44.51 crores versus Rs 71.78 crores in the prior year, while net profit dropped to Rs 0.96 crores from Rs 10.64 crores. The company operates in manufacturing of equipment and has incorporated a new wholly-owned Limited Liability Partnership named Global Essential Mining Supplies LLP in April 2025. The consolidated results include two LLPs - Revathi Drilling Solutions LLP and Global Essential Mining Supplies LLP.",
            "Sentiment": "negative",
            "PublishDate": 1762529682227,
            "Source": "earnings"
        },
        {
            "Title": "Revathi Equipment India Reports 92% Drop in Net Profit for Q1 FY2026, No Interim Dividend Declared",
            "Summary": "Revathi Equipment India Limited reported quarterly results for the period ended June 30, 2025. The company's standalone net profit after tax declined significantly to ₹0.63 crores compared to ₹7.94 crores in the same quarter last year, representing a 92% decrease. Revenue from operations dropped to ₹22.24 crores from ₹52.03 crores year-over-year. On a consolidated basis, net profit fell to ₹0.57 crores from ₹7.94 crores in the previous year. The board decided not to recommend any interim dividend for financial year 2025-2026. The company operates in manufacturing of equipment and has incorporated a new wholly-owned Limited Liability Partnership called Global Essential Mining Supplies LLP in April 2025, which has not yet commenced operations.",
            "Sentiment": "negative",
            "PublishDate": 1754659901843,
            "Source": "earnings"
        }
    ]
}