{
    "Symbol": "S&SPOWER",
    "ISIN": "INE902B01017",
    "News": [
        {
            "Title": "S&S Power Switchgear Q3FY26 Results Show Mixed Performance",
            "Summary": "S&S Power Switchgear reported consolidated revenue of ₹7,907.54 lakhs in Q3FY26, up from ₹3,931.64 lakhs in Q3FY25. The company posted consolidated net profit of ₹350.90 lakhs versus loss of ₹527.86 lakhs in the prior year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1770735432372,
            "Source": "co_actions_results"
        },
        {
            "Title": "S&S Power Switchgear Board Meet on Feb 10, 2026",
            "Summary": "S&S Power Switchgear Limited has scheduled its board meeting for February 10, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769853630423,
            "Source": "co_actions_results"
        },
        {
            "Title": "SS Power Switchgear Fined Rs. 3.28 Lakh Each by BSE and NSE for Committee Compliance Violation",
            "Summary": "SS Power Switchgear Limited received fines of Rs. 3,28,040 each from BSE and NSE for non-compliance with Nomination and Remuneration Committee composition requirements under SEBI regulations. The company has since constituted the committee properly and applied for penalty waivers at both exchanges, stating no impact on financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1764595360824,
            "Source": "corporate_governance"
        },
        {
            "Title": "S&S Power Switchgear Reports Quarterly Loss and Approves Subsidiary Strike-Off",
            "Summary": "S&S Power Switchgear Limited reported a net loss of Rs. 138.04 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs. 170.20 lakhs in the previous year quarter. The company's board approved filing for voluntary strike-off of its wholly-owned subsidiary Acrastyle EPS Technologies Limited, which has remained inoperative for over two years.",
            "Sentiment": "negative",
            "PublishDate": 1763054260775,
            "Source": "earnings"
        },
        {
            "Title": "S&S Power Switchgear Subsidiary Secures ₹30+ Crore Contract for Pot Control System Supply",
            "Summary": "S&S Power Switchgear's subsidiary Hart has received a Letter of Intent (LOI) from Giza Systems Free Zone for supplying pot control systems valued at over ₹30 crores. The project is scheduled to commence this financial year with an expected completion timeline of 36 months.",
            "Sentiment": "positive",
            "PublishDate": 1762149536424,
            "Source": "order&deals"
        },
        {
            "Title": "S&S Power Switchgear's UK Subsidiary Secures Protection Panel Orders Worth Over Rs 10 Crore",
            "Summary": "S&S Power Switchgear Limited announced that its wholly owned subsidiary Acrastyle Ltd (UK) has received Letters of Award from SP Transmission plc for supplying Protection Panels for multiple substation projects in Scotland. The total order value exceeds Rs 10 crore, with deliveries scheduled to commence in the current financial year. The contracts involve supply and delivery of Protection Panels at multiple substations and are to be executed within 18 months. The promoter group has no interest in the awarding entity, and the transactions do not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1755100803790,
            "Source": "order&deals"
        },
        {
            "Title": "S & S Power Switchgear Secures Order Worth Over 100 Million Rupees",
            "Summary": "S & S Power Switchgear has secured an order valued at over 100 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1755097916772,
            "Source": "order&deals"
        },
        {
            "Title": "S&S Power Ltd Approves Q1 Results and Appoints New Auditors",
            "Summary": "S&S Power Ltd's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company appointed BP & Associates as secretarial auditors for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval at the 47th Annual General Meeting. Durv & Associates LLP was appointed as internal auditor for FY 2025-26. The board noted the completion of independent director Mr. Ajay Kumar Dhagat's tenure, effective from the closure of business hours on August 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755000405139,
            "Source": "earnings"
        },
        {
            "Title": "S&S Power Switchgear Subsidiary Wins ₹5+ Crore Order for Botswana Project",
            "Summary": "S&S Power Switchgear Limited's wholly owned subsidiary, S&S Power Switchgear Equipment Limited, has received a Letter of Award from Transrail Lighting Limited. The contract involves supplying 400KV Disconnectors for a project in Botswana, with an order value exceeding ₹5 crores. The delivery is scheduled to be completed within the current financial year. The awarding entity is a domestic company, and there are no related party interests or promoter group connections involved in this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1754458716968,
            "Source": "order&deals"
        },
        {
            "Title": "S&S Power Switchgear Equipment Secures Over ₹6 Crore Order for High Voltage Isolators",
            "Summary": "S&S Power Switchgear Equipment Limited, a wholly owned subsidiary of S&S Power Switchgear Limited, received Letter of Awards from Hartek Power Private Limited for supplying high voltage isolators including 420 KV, 245 KV, 72.5 KV and 36 KV units for Powergrid Corporation of India Limited projects. The order value exceeds ₹6 crores with deliveries scheduled to commence from the last quarter of the current fiscal year. The contract involves supply of isolators to a domestic entity with no promoter group interest in the awarding company.",
            "Sentiment": "positive",
            "PublishDate": 1753858362303,
            "Source": "order&deals"
        },
        {
            "Title": "S & S Power Switchgear Secures Major Order from Godrej & Boyce",
            "Summary": "S & S Power Switchgear has received a Letter of Award (LOA) from Godrej & Boyce for an order valued at more than 150 million rupees. This significant contract represents a substantial business opportunity for the company in the power switchgear sector.",
            "Sentiment": "positive",
            "PublishDate": 1743034321000,
            "Source": "order&deals"
        },
        {
            "Title": "S & S Power Switchgear Secures Major Order from Godrej & Boyce",
            "Summary": "S & S Power Switchgear has received a Letter of Award (LOA) from Godrej & Boyce for an order valued at more than 150 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743002534000,
            "Source": "order&deals"
        }
    ]
}