{
    "Symbol": "SAATVIKGL",
    "ISIN": "INE13B501022",
    "News": [
        {
            "Title": "Saatvik Green Energy Releases Q3FY26 Earnings Call",
            "Summary": "Saatvik Green Energy Limited makes audio recording of Q3FY26 earnings call available on company website following regulatory compliance requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770297166302,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy Q3FY26 earnings call on Feb 5",
            "Summary": "Saatvik Green Energy Limited has scheduled a conference call on February 05, 2026 at 10:00 AM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769680215994,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy Subsidiary Wins ₹10.15 Cr Order",
            "Summary": "Saatvik Solar Industries Private Limited, material subsidiary of Saatvik Green Energy Limited, secured a ₹10.15 crore order from a renowned Independent Power producer for solar PV modules supply.",
            "Sentiment": "positive",
            "PublishDate": 1769074033893,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy, Gayatri Rubbers Win ₹21 Cr Orders",
            "Summary": "Saatvik Green Energy secured ₹13.80 cr solar module order while Gayatri Rubbers bagged ₹7.23 cr railway contract. Both companies show strong financial performance with significant revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1768220917397,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy Secures ₹13.8 Cr Module Order",
            "Summary": "Saatvik Green Energy has received a significant module supply order valued at ₹13.8 crores, marking another milestone in the company's business expansion and order book growth.",
            "Sentiment": "positive",
            "PublishDate": 1768188564399,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy subsidiary wins ₹13.80 cr order",
            "Summary": "Saatvik Solar Industries Private Limited, material subsidiary of Saatvik Green Energy Limited, secures order worth ₹13.80 crores for supply of solar PV modules from domestic IPP/EPC player.",
            "Sentiment": "positive",
            "PublishDate": 1767980063612,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy clarifies subsidiary order value",
            "Summary": "Saatvik Green Energy Limited clarifies that its subsidiary received a ₹20.84 crore solar EPC project order, correcting media reports that incorrectly stated ₹29 crore value.",
            "Sentiment": "neutral",
            "PublishDate": 1767972263082,
            "Source": "stocks"
        },
        {
            "Title": "Saatvik Green secures ₹20.84 Cr solar EPC order",
            "Summary": "Saatvik Green Energy's EPC subsidiary secured a ₹20.84 crore turnkey solar project from a reputed developer, with execution scheduled by March 2026, adding to its growing order book.",
            "Sentiment": "positive",
            "PublishDate": 1767941632559,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy Wins ₹21-Crore Solar Project",
            "Summary": "Saatvik Green Energy's subsidiary secures ₹20.84 crore solar project order with execution deadline of March 2026, boosting the company's renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767933322119,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy Wins ₹208.4 Cr Order",
            "Summary": "Saatvik Green Energy has secured a significant order worth ₹208.4 million, marking a notable business development for the renewable energy company.",
            "Sentiment": "positive",
            "PublishDate": 1767878868830,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy subsidiary wins ₹20.84 cr solar EPC order",
            "Summary": "Saatvik Cleantech EPC Private Limited, wholly owned subsidiary of Saatvik Green Energy Limited, secured a turnkey solar EPC project worth ₹20.84 crores from a renowned solar developer, to be completed by March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767877216492,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy Starts 2 GW Film Manufacturing",
            "Summary": "Saatvik Green Energy Limited has commenced operations at its 2 GW film manufacturing facility, enhancing vertical integration and supply chain independence while supporting Make In India initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1766467310910,
            "Source": "stocks"
        },
        {
            "Title": "Saatvik Green Energy Company Secretary Resigns",
            "Summary": "Saatvik Green Energy Limited announces resignation of Company Secretary & Compliance Officer Mr. Bhagya Hasija effective February 6, 2026, citing professional opportunities outside the Saatvik Group.",
            "Sentiment": "neutral",
            "PublishDate": 1766410748938,
            "Source": "stocks"
        },
        {
            "Title": "Saatvik Green Energy Unit Wins ₹486 Cr Solar Order",
            "Summary": "Saatvik Solar Industries Private Limited, material subsidiary of Saatvik Green Energy Limited, secured a major order worth ₹486 crores from renowned independent power producer for solar PV modules supply.",
            "Sentiment": "positive",
            "PublishDate": 1766409006549,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy Wins ₹13.50 Cr Solar Pump Order",
            "Summary": "Saatvik Green Energy Limited secures ₹13.50 crore order from MSEDCL for 815 solar water pumps under PM KUSUM B scheme with 60-day installation timeline.",
            "Sentiment": "positive",
            "PublishDate": 1766396807998,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saatvik Green Energy Seeks Shareholder Approval via Postal Ballot",
            "Summary": "Saatvik Green Energy Limited has issued a postal ballot notice seeking member consent for three special resolutions including appointment of independent woman director and ratification of employee stock option scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1765974686455,
            "Source": "stocks"
        },
        {
            "Title": "Saatvik Green Energy Updates CIN Post-Listing",
            "Summary": "Saatvik Green Energy Limited announces Corporate Identification Number update from U40106HR2015PLC075578 to L40106HR2015PLC075578 following equity shares listing on September 26, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765777527484,
            "Source": "stocks"
        },
        {
            "Title": "Saatvik Green Energy Appoints Ms. Ritu Lal as Director",
            "Summary": "Saatvik Green Energy Limited appointed Ms. Ritu Lal as Additional Non-Executive Independent Woman Director for a 5-year term from December 11, 2025 to December 10, 2030, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1765443522287,
            "Source": "stocks"
        },
        {
            "Title": "Saatvik Green Energy Subsidiary Secures ₹178 Crore Solar Module Orders",
            "Summary": "Saatvik Green Energy's subsidiary Saatvik Solar Industries received orders worth ₹177.50 crore from an Independent Power producer for solar PV module supply, with execution scheduled from November to December 2025. The domestic repeat orders strengthen the company's position as a leading solar module manufacturer with 3.80 GW operational capacity, though shares declined 3.07% to ₹466.30.",
            "Sentiment": "positive",
            "PublishDate": 1763374375299,
            "Source": "order&deals"
        },
        {
            "Title": "Saatvik Green Energy Reports 133% Revenue Growth in H1 FY26, Expands Manufacturing Capacity",
            "Summary": "Saatvik Green Energy Limited reported strong financial performance for the second quarter and first half of FY26. Revenue from operations for H1 FY26 reached INR 16,838 million, representing 133% year-on-year growth compared to INR 7,213 million in H1 FY25. EBITDA grew 135% to INR 3,046 million with margins at 18.09%. Profit after tax increased 146% to INR 2,021 million from INR 823 million in the previous year. For Q2 alone, revenue stood at INR 7,680 million, up 62% year-on-year, with PAT of INR 832 million. The company's Ambala facility is now fully operational at 4.8 gigawatts annual capacity with over 83% capacity utilization. The order book remains healthy at approximately 4.68 gigawatts as of September 30, 2025. The company's Greenfield integrated project in Odisha comprising 4 gigawatt module and 4.8 gigawatt solar cell capacity is progressing on schedule, with first phase commissioning expected in Q4 FY26. The debt-to-equity ratio improved significantly to 0.44 from 1.36 in the previous year. Post-quarter closure, the subsidiary received new domestic orders worth approximately INR 2,994 million from three independent power producers and EPC players for execution between December 2025 and March 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763012665250,
            "Source": "earnings"
        },
        {
            "Title": "Saatvik Green Energy Reports No IPO Fund Utilization in First Quarter Post-Listing",
            "Summary": "Saatvik Green Energy Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no utilization of its Rs 7,000 million IPO proceeds. The company raised funds through an IPO from September 19-23, 2025, with intended uses including debt repayment (Rs 1,081.9 million), investment in subsidiary Saatvik Solar Industries for debt repayment (Rs 4,964.36 million), investment for setting up a 4GW solar PV module manufacturing facility in Odisha (Rs 4,772.27 million), and general corporate purposes. All proceeds remain deployed in fixed deposits earning interest rates between 5.95% to 6.40%. CRISIL Ratings Limited, serving as the monitoring agency, reported no deviations from disclosed objectives and confirmed all unutilized proceeds are parked in deposits. The company received Rs 6,999.99 million by September 30, 2025, with the remaining Rs 0.01 million received in October due to a technical banking error.",
            "Sentiment": "neutral",
            "PublishDate": 1762978026337,
            "Source": "stock"
        },
        {
            "Title": "Saatvik Solar Plans 5 GW Manufacturing Capacity Expansion by FY27",
            "Summary": "Saatvik Solar announced plans to expand its module manufacturing capacity to 5 GW by FY27. The company aims to strengthen its presence in export markets and rooftop solar solutions. Saatvik Solar is investing in backward integration for cell manufacturing and sustainable technologies. The company targets revenue doubling over three years through premium solar modules and EPC partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1762442082766,
            "Source": "stock"
        },
        {
            "Title": "Saatvik Green Energy Reports Quarterly Results and Senior Management Changes",
            "Summary": "Saatvik Green Energy Limited's Board approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company also approved addition of senior management personnel due to internal changes in roles, designations and responsibilities. The Board meeting was held on November 6, 2025, commencing at 4:10 p.m. and concluding at 5:00 p.m. Detailed disclosures for each management addition will be provided separately under regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762434575776,
            "Source": "earnings"
        },
        {
            "Title": "Saatvik Green Energy Reports Strong Q2 Growth with 36% Rise in Net Profit",
            "Summary": "Saatvik Green Energy reported consolidated net profit of 832 million rupees for Q2, representing a year-over-year increase from 612 million rupees. The company's Q2 revenue reached 7.7 billion rupees, up from 4.75 billion rupees in the same period last year, marking significant growth across both profitability and revenue metrics.",
            "Sentiment": "positive",
            "PublishDate": 1762431255288,
            "Source": "earnings"
        },
        {
            "Title": "Saatvik Green Energy's Subsidiary Secures INR 299.40 Crore Solar Module Orders",
            "Summary": "Saatvik Green Energy Limited announced that its material subsidiary, Saatvik Solar Industries Private Limited, has received and accepted orders worth INR 299.40 crores from three Independent Power producers/EPC players for supply of solar PV modules. The orders are domestic in nature and will be executed during December 2025 to March 2026. The company confirmed that promoters have no interest in the entities awarding the orders, and these transactions do not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1762377308240,
            "Source": "order&deals"
        },
        {
            "Title": "Saatvik Green Energy's Subsidiary Secures INR 17.99 Crore Solar Module Order",
            "Summary": "Saatvik Green Energy Limited announced that its material subsidiary, Saatvik Solar Industries Private Limited, has received and accepted orders worth INR 17.99 crores from an Independent Power producer for supply of solar PV modules. The domestic order involves repeated business and is scheduled for execution by the end of December 2025. The transaction does not involve any promoter group interest and is not classified as a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1761659242028,
            "Source": "order&deals"
        },
        {
            "Title": "Saatvik Green Energy Secures ₹639 Crore Solar Module Orders",
            "Summary": "Saatvik Green Energy's subsidiary Saatvik Solar Industries received orders worth ₹638.85 crore for solar PV module supply from three independent power producers and EPC companies, with execution scheduled by June 2026. The company's quarterly results showed revenue more than tripling to ₹915.7 crore from ₹245.9 crore year-on-year, while EBITDA increased over five-fold to ₹176.9 crore with margins improving to 19.77% from 16.5%. Managing Director Manik Garg indicated focus on growth and margin improvement, expecting margins to remain in the 16-17% range. Shares closed 1.74% higher at ₹536 and have gained 22% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1760491186891,
            "Source": "stock"
        },
        {
            "Title": "Saatvik Green Energy's Subsidiary Secures INR 638.85 Crores Solar Module Orders",
            "Summary": "Saatvik Solar Industries Private Limited, a material subsidiary of Saatvik Green Energy Limited, has received and accepted orders worth INR 638.85 crores from three Independent Power producers/EPC companies for the supply of solar PV modules. The orders are from domestic entities and are classified as repeated business. The company will execute these orders by the end of June 2026. The transactions do not involve any promoter group interest and are not related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1760463380724,
            "Source": "order&deals"
        },
        {
            "Title": "Saatvik Green Energy Secures INR 50.62 Crore Orders for Solar PV Module Supply",
            "Summary": "Saatvik Green Energy Limited has received and accepted orders worth INR 50.62 crores from independent power producers and EPC companies for the supply of solar PV modules. The orders are from domestic entities and are classified as repeated business. The company will execute these orders until the end of November 2025. The transactions do not involve any promoter group interest and are not related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1760463048982,
            "Source": "order&deals"
        },
        {
            "Title": "Saatvik Green Energy Shares Hit 10% Upper Circuit on 459% Net Profit Jump",
            "Summary": "Saatvik Green Energy shares reached a 10% upper circuit at Rs 551.40 on BSE following strong quarterly earnings results. The company reported consolidated net profit of Rs 119 crore, representing a 459% increase from Rs 21 crore in the same quarter of the previous year. This marks the company's first earnings report since its September listing. The bottom line rose 30% sequentially from Rs 91 crore, while revenue was marginally down 0.34% to Rs 919 crore. Additionally, the company secured two new orders totaling Rs 707 crore - one worth Rs 488 crore from an Indian power producer for PV modules to be executed by FY26, and another Rs 219 crore order for solar PV modules. The solar module manufacturer had launched a Rs 900 crore IPO in September, which was subscribed 6.93 times. After falling to an all-time low of Rs 420 per share on September 30, the stock has recovered over 20% in six trading sessions to reach an all-time high of Rs 506.",
            "Sentiment": "positive",
            "PublishDate": 1759983448086,
            "Source": "earnings"
        },
        {
            "Title": "Saatvik Green Energy Launches Uday Series On-Grid Solar Inverters",
            "Summary": "Saatvik Green Energy has launched its Uday Series On-Grid Solar Inverters and introduced a full range of solar solutions. The company is expanding its product portfolio in the solar energy sector with this new inverter series.",
            "Sentiment": "positive",
            "PublishDate": 1759929809771,
            "Source": "stock"
        },
        {
            "Title": "Saatvik Green Energy Reports Strong Q1 Growth with Net Profit Rising to 1.2B Rupees",
            "Summary": "Saatvik Green Energy delivered robust quarterly performance with consolidated net profit reaching 1.2 billion rupees compared to 213 million rupees in the same period last year. Revenue surged to 9.16 billion rupees from 2.5 billion rupees year-over-year. The company's EBITDA grew significantly to 1.8 billion rupees versus 326 million rupees previously, while EBITDA margin improved to 19.34% from 13.25% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1759926501848,
            "Source": "earnings"
        },
        {
            "Title": "Saatvik Green Energy Secures Solar Module Orders Worth 7.08 Billion Rupees",
            "Summary": "Saatvik Green Energy has received orders totaling 7.08 billion rupees for solar modules. The company secured a 4.88 billion rupees order and a separate 2.2 billion rupees order. The orders are scheduled to be executed in FY'26.",
            "Sentiment": "positive",
            "PublishDate": 1759882916724,
            "Source": "order&deals"
        },
        {
            "Title": "Saatvik Green Energy Secures ₹4.88 Billion Solar Module Orders",
            "Summary": "Saatvik Green Energy has secured orders worth ₹4.88 billion for solar modules. The company expects to complete these orders by FY'26.",
            "Sentiment": "positive",
            "PublishDate": 1759849795323,
            "Source": "order&deals"
        }
    ]
}