{
    "Symbol": "SABEVENTS",
    "ISIN": "INE860T01019",
    "News": [
        {
            "Title": "SAB Events Reports Q3FY26 Profit of ₹13.12 Lakhs",
            "Summary": "SAB Events & Governance Now Media Limited posted a profit of ₹13.12 lakhs in Q3FY26, recovering from previous quarter losses. However, nine-month performance shows a loss of ₹25.19 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1770295473283,
            "Source": "co_actions_results"
        },
        {
            "Title": "SAB Events Governance Now Media Conducts First Committee of Creditors Meeting Under Pre-Packaged Insolvency Process",
            "Summary": "SAB Events Governance Now Media Limited held its first Committee of Creditors meeting on December 1, 2025, as part of its ongoing Pre-Packaged Insolvency Resolution Process. The meeting approved key appointments including the Resolution Professional, registered valuers, and transaction auditor, while also ratifying PPIRP costs and approving circulation of Information Memorandum to creditors.",
            "Sentiment": "neutral",
            "PublishDate": 1764660012680,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events Governance Now Media Limited Schedules First Committee of Creditors Meeting",
            "Summary": "SAB Events Governance Now Media Limited has scheduled its first Committee of Creditors meeting for December 01, 2025 at 5:00 PM as part of its ongoing Pre-Packaged Insolvency Resolution Process (PPIRP). The meeting is being held pursuant to Section 54(1)(2) of The Insolvency and Bankruptcy Code, 2016, affecting the company's creditors and stakeholders in the insolvency proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1764251064367,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events Governance Now Media Appoints Transaction Auditor for Pre-Packaged Insolvency Process",
            "Summary": "SAB Events Governance Now Media Limited has appointed Mr. Parthajit Ghosh as Transaction Auditor for its ongoing Pre-Packaged Insolvency Resolution Process, following NCLT Mumbai Bench's admission order received on November 11, 2025. The appointment was made by Resolution Professional Mr. Kedar Parshuram Mulye to conduct audit on transactions in accordance with the Insolvency and Bankruptcy Code, 2016.",
            "Sentiment": "neutral",
            "PublishDate": 1763990635018,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events Governance Now Media Limited Constitutes Committee of Creditors Under Insolvency Process",
            "Summary": "SAB Events Governance Now Media Limited has constituted a Committee of Creditors on November 24, 2025, under Section 54(I)(1) of the Insolvency and Bankruptcy Code, 2016, as part of its ongoing Pre-Packaged Insolvency Resolution Process. The committee was formed by Resolution Professional Mr. Kedar Parshuram Mulye following the NCLT Mumbai Bench's admission order received on November 11, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763984092545,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events Governance Now Media Limited Publishes Claims List Under Pre-Packaged Insolvency Process",
            "Summary": "SAB Events Governance Now Media Limited has disclosed its list of claims totaling Rs. 8,89,79,647 under the Pre-Packaged Insolvency Resolution Process (PPIRP) that commenced on November 11, 2025, following NCLT Mumbai Bench order. The claims include unsecured financial creditors of Rs. 4,53,47,238, other creditors of Rs. 3,24,35,478, and various operational creditors including employees, government dues, and professional service providers.",
            "Sentiment": "negative",
            "PublishDate": 1763830024844,
            "Source": "corporate_action"
        },
        {
            "Title": "SAB Events Governance Now Media Appoints Two Registered Valuers for Pre-Packaged Insolvency Process",
            "Summary": "SAB Events Governance Now Media Limited appointed two IBBI registered valuers, Mr. Pijush Karmakar and Mr. Jigar Pradipchandra Shah, following NCLT Mumbai's admission of the company into Pre-Packaged Insolvency Resolution Process. The valuers will determine the company's Fair Value and Liquidation Value in accordance with the Insolvency and Bankruptcy Code provisions.",
            "Sentiment": "negative",
            "PublishDate": 1763568527592,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events Governance Now Media Limited Enters Pre-Packaged Insolvency Resolution Process",
            "Summary": "The National Company Law Tribunal Mumbai Bench ordered commencement of Pre-Packaged Insolvency Resolution Process for SAB Events Governance Now Media Limited on November 11, 2025, with Kedar Parshuram Mulye appointed as Resolution Professional. The company has issued public announcements to creditors as required under insolvency regulations, with claims list to be made available from November 22, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763544569025,
            "Source": "corporate_action"
        },
        {
            "Title": "SAB Events Governance Now Media Seeks Stock Exchange Approval for Promoter Reclassification",
            "Summary": "SAB Events Governance Now Media Limited has submitted applications to BSE and NSE seeking approval for reclassification of Mr. Markand Navnitlal Adhikari's status from Promoter category to Public category. Upon receiving stock exchange approval, the company will seek shareholder approval in accordance with listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763229473053,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events Governance Now Media Reports Loss, Appoints New Chairman Amid Financial Distress",
            "Summary": "SAB Events Governance Now Media Limited reported a net loss of Rs. 38.31 lakhs for the quarter ended September 30, 2025, compared to Rs. 16.22 lakhs loss in the previous year quarter. Revenue from operations declined to Rs. 50.68 lakhs from Rs. 57.94 lakhs year-on-year. The company appointed Mr. Kailasnath Adhikari as Chairman, who is a double postgraduate in accounting from London School of Economics and former government official. The Board approved the reclassification of Mr. Markand Adhikari from promoter category to public category, who holds 4.59% stake and seeks to retire from business activities. The company faces significant financial challenges with current liabilities 4.44 times higher than current assets and inability to service debt obligations. The Board has approved initiation of Pre-Packaged Insolvency Resolution Process under the Insolvency and Bankruptcy Code, 2016. Auditors highlighted material uncertainty regarding the company's ability to continue as a going concern due to substantial losses and negative total equity of Rs. 237.58 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1762932478889,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events Governance Now Media Limited Enters Pre-Packaged Insolvency Resolution Process",
            "Summary": "SAB Events Governance Now Media Limited has been admitted into Pre-Packaged Insolvency Resolution Process (PPIRP) by the National Company Law Tribunal Mumbai Bench. The company, engaged in digital media, websites, and MICE business under the Governance Now brand, filed the petition following financial distress caused by prolonged revenue decline worsened by COVID-19 pandemic restrictions on public gatherings. The company owes Rs. 4.53 crores to Moviestar Production Services and has total outstanding dues of Rs. 2.52 lakhs to employees. Under the resolution plan, financial creditors will receive Rs. 2 crores within 90 days, representing full settlement of their claims. Kedar Parshuram Mulye has been appointed as Resolution Professional to conduct the PPIRP. The company's MICE vertical, which organized on-ground events, came to a complete halt during the pandemic and has not fully recovered. A moratorium has been declared prohibiting legal proceedings against the company during the resolution process.",
            "Sentiment": "negative",
            "PublishDate": 1762887142903,
            "Source": "corporate_action"
        },
        {
            "Title": "SAB Events Governance Now Media Receives Promoter Reclassification Request",
            "Summary": "SAB Events Governance Now Media Limited received a request from Mr. Markand Navnitlal Adhikari to reclassify his shareholding from promoter category to public category. Adhikari holds 4,81,589 equity shares representing 4.59% of the company's paid-up equity share capital. He resigned from his position as non-executive director a year ago and states he has not been associated with the company's business operations for the past two years. At age 68, Adhikari wishes to withdraw from corporate affairs to focus on social service and prayer. He confirms he does not hold more than 10% voting rights, does not exercise control over company affairs, and has no special rights or arrangements. His son Kailasnath Adhikari serves as Managing Director but functions independently. The company will undertake necessary steps in compliance with SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762879225357,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events Governance Now Media Limited Chairman Director Ravi Adhikari Resigns",
            "Summary": "Ravi Adhikari has resigned from his position as Chairman Director of SAB Events Governance Now Media Limited, effective from the close of business hours on November 11, 2025. Adhikari cited his desire to pursue creative endeavors as the reason for his resignation. The company has informed stock exchanges BSE and NSE about this leadership change in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762877294432,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events & Governance Now Media Limited Files for Pre-Packaged Insolvency Resolution Process",
            "Summary": "SAB Events & Governance Now Media Limited has filed an application with the National Company Law Tribunal, Mumbai Bench to initiate a Pre-Packaged Insolvency Resolution Process (PPIRP). The company owes Rs. 4,53,47,238 to Saturn Fund, an unrelated financial creditor who has approved the PPIRP initiation. The application was filed following prior approvals from the Board of Directors and company members.",
            "Sentiment": "negative",
            "PublishDate": 1760761667624,
            "Source": "stock"
        },
        {
            "Title": "SAB Events & Governance Now Media Limited Approves Re-appointment of Managing Director Through Postal Ballot",
            "Summary": "SAB Events & Governance Now Media Limited completed a postal ballot conducted through e-voting, where members approved the re-appointment of Mr. Kailasnath Adhikari as Managing Director for a further term of 5 years. The e-voting period ran from July 23 to August 21, 2025. The resolution received overwhelming support with 99.97% of valid votes cast in favor and only 0.03% against. A total of 2,933,659 votes were polled, representing 27.98% of outstanding shares. The scrutinizer Mr. Bhavesh Chheda submitted his report on August 23, 2025, confirming the resolution was passed with requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1756118642567,
            "Source": "corporate_action"
        },
        {
            "Title": "SAB Events & Governance Now Media Initiates Pre-Packaged Insolvency Process Amid Financial Distress",
            "Summary": "SAB Events & Governance Now Media Limited's Board approved the initiation of a Pre-Packaged Insolvency Resolution Process under the Insolvency and Bankruptcy Code, 2016, with Mr. Kedar Parshuram Mulye appointed as Resolution Professional. The company reported a net loss of Rs. 24.30 lakhs for the quarter ended June 30, 2025, compared to Rs. 42.00 lakhs loss in the same period last year. Revenue from operations increased to Rs. 40.68 lakhs from Rs. 15.00 lakhs year-over-year. The company faces significant financial challenges with current liabilities 4.82 times higher than current assets and inability to service debt obligations. The Board also approved increasing authorized share capital from Rs. 11.03 crores to Rs. 32.00 crores, subject to shareholder approval, and appointed HRU & Associates as Secretarial Auditors for five years starting 2025-2026. Auditors highlighted material uncertainty regarding the company's ability to continue as a going concern and noted issues with goodwill impairment testing and unprovided interest expenses of approximately Rs. 5.97 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1755163348793,
            "Source": "corporate_action"
        },
        {
            "Title": "SAB Events & Governance Now Media Seeks Shareholder Approval for Managing Director's Re-appointment",
            "Summary": "SAB Events & Governance Now Media Limited has approved a postal ballot to seek shareholder approval for the re-appointment of Mr. Kailasnath Adhikari as Managing Director for a further term of 5 years. The Board meeting was held on July 21, 2025, and appointed Mr. Bhavesh Chheda as the Scrutinizer for the e-voting process. The e-voting period is scheduled from July 23, 2025 (9:00 A.M. IST) to August 21, 2025 (5:00 P.M. IST). The postal ballot notice will be dispatched by email on or before July 22, 2025, with newspaper advertisements published by July 23, 2025. Results will be declared by August 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753096883207,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAB Events & Governance Now Media Seeks Shareholder Approval for Managing Director Re-appointment",
            "Summary": "SAB Events & Governance Now Media Limited's Board of Directors approved a postal ballot to seek shareholder approval for the re-appointment of Mr. Kailasnath Adhikari as Managing Director for an additional 5-year term. The company appointed Mr. Bhavesh Chheda of Bhavesh Chheda & Associates as the scrutinizer for the e-voting process. The e-voting period is scheduled from July 23, 2025 at 9:00 AM to August 21, 2025 at 5:00 PM, with results to be declared by August 25, 2025. The Board meeting was held on July 21, 2025, lasting 15 minutes from 2:30 PM to 2:45 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1753096224560,
            "Source": "corporate_action"
        }
    ]
}