{
    "Symbol": "SADBHAV",
    "ISIN": "INE226H01026",
    "News": [
        {
            "Title": "Sadbhav Engineering: Catalyst Releases Pledged Shares",
            "Summary": "Catalyst Trusteeship Limited releases 1,00,63,495 pledged equity shares of Sadbhav Engineering Limited, representing 5.87% of total share capital, reducing its encumbrance holding to nil.",
            "Sentiment": "neutral",
            "PublishDate": 1770181748555,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vikram Patel Disposes 0.25% Stake in Sadbhav Engineering",
            "Summary": "Vikram Rasiklal Patel disposed 4,37,500 equity shares (0.25%) of Sadbhav Engineering through off-market transfer to Shashin Vishnubhai Patel, reducing his holding to 1.67%.",
            "Sentiment": "neutral",
            "PublishDate": 1767432353992,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sadbhav Engineering Resolves Board Compliance Issues",
            "Summary": "Sadbhav Engineering Limited's board approved payment of fines imposed by stock exchanges for non-compliance with board composition requirements under SEBI regulations, achieving compliance after appointing new director.",
            "Sentiment": "neutral",
            "PublishDate": 1765984856616,
            "Source": "stocks"
        },
        {
            "Title": "Sadbhav Engineering Approves ₹1,000 Cr Debt Plan",
            "Summary": "Sadbhav Engineering's board approved a comprehensive debt restructuring plan involving ₹890 crores fund-based debt conversion into NCDs and authorized issuance of up to ₹1,000 crores debentures on private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1765984158831,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sadbhav Engineering: Promoter Group Members Execute Off-Market Share Transfer",
            "Summary": "Shashin V. Patel acquired 4,37,500 equity shares (0.25%) of Sadbhav Engineering Limited through off-market transfer from Rekhaben Vasisthakumar Patel, both being promoter group members. The transaction increased Shashin V. Patel's shareholding from 6.02% to 6.27% while Rekhaben's holding reduced to zero, representing an internal promoter group restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1764308625044,
            "Source": "corporate_action"
        },
        {
            "Title": "Sadbhav Engineering Issues Corrigendum for Q2 FY26 Results, Corrects Balance Sheet Figures",
            "Summary": "Sadbhav Engineering Limited corrected typographical errors in its consolidated financial results for the quarter and half year ended September 30, 2025, revising Equity Share Capital from Rs. 4,963.21 lakhs to Rs. 1,715.71 lakhs and Other Equity from Rs. (27,286.03) lakhs to Rs. (24,038.53) lakhs. The company clarified that these corrections do not impact profit-loss or other balance sheet items, with the standalone results showing a net loss of Rs. 1,091.94 lakhs for Q2 FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763558826110,
            "Source": "earnings"
        },
        {
            "Title": "Sadbhav Engineering Reports Quarterly Loss Amid Financial Restructuring Efforts",
            "Summary": "Sadbhav Engineering Limited posted a standalone net loss of Rs 1,091.94 lakhs for Q2 FY26, with auditors expressing qualified opinions on multiple financial matters including contract assets worth Rs 35,019.32 lakhs. The company is pursuing debt restructuring with consortium lenders while facing going concern uncertainties, though management remains confident about operational resumption through asset monetization and fund infusion plans.",
            "Sentiment": "neutral",
            "PublishDate": 1763174862511,
            "Source": "corporate_governance"
        },
        {
            "Title": "Catalyst Trusteeship Invokes Pledge on 1.84 Crore Sadbhav Engineering Shares",
            "Summary": "Catalyst Trusteeship Limited has invoked a pledge over 1,83,50,000 equity shares of Sadbhav Engineering Limited, representing 10.70% of the company's total share capital. The pledge was invoked on September 10, 2025, due to events of default and failure to repay debt obligations related to non-convertible debentures issued by Sadbhav Infrastructure Project Limited. The pledged shares were originally secured through a deed dated August 13, 2024, with Sadbhav Finstock Private Limited and Shashin Patel as pledgors. Catalyst Trusteeship is acting as debenture trustee for the benefit of debenture holders. The invocation affects shares worth 10.70% of Sadbhav Engineering's total equity capital of 17,15,70,800 shares.",
            "Sentiment": "negative",
            "PublishDate": 1757755602303,
            "Source": "corporate_action"
        },
        {
            "Title": "Sadbhav Engineering Appoints New Non-Executive Director, Schedules AGM for September 30",
            "Summary": "Sadbhav Engineering Limited appointed Mr. Siddharth Bhupendrabhai Vyas as a Non-Executive Director, subject to shareholder approval. The appointment was made on the recommendation of the Nomination and Remuneration Committee and is effective from September 4, 2025. Vyas holds an MBA from the National Institute of Management and has experience working with top management and as a CFO, with expertise in financial modeling, policy making, and financial discipline. He is not related to any existing directors or key managerial personnel and holds no shares in the company. The company also approved the notice for its Annual General Meeting scheduled for September 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757042884172,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sadbhav Engineering Reports Q1 Net Profit of 122 Million Rupees After Previous Year Loss",
            "Summary": "Sadbhav Engineering reported Q1 consolidated net profit of 122 million rupees compared to a loss of 312 million rupees in the same period last year. Revenue declined to 2.2 billion rupees from 3 billion rupees year-over-year. EBITDA increased to 1.47 billion rupees from 990 million rupees, while EBITDA margin improved significantly to 66.14% from 32.93% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755469627419,
            "Source": "earnings"
        },
        {
            "Title": "Sadbhav Engineering Reports Strong Turnaround with ₹31.19 Crore Net Profit Despite Revenue Decline",
            "Summary": "Sadbhav Engineering Limited reported quarterly results showing total income from operations of ₹221.98 crore, down 26.2% from ₹300.74 crore in the previous year. The company achieved a net profit of ₹31.19 crore compared to a net loss of ₹30.74 crore in the same period last year. EBITDA improved to ₹42.91 crore from negative ₹26.19 crore previously. EPS increased to ₹0.71 from -₹1.82, while net profit margin reached 14.1% versus -10.2% in the prior year. The company maintains an order book of ₹8,500 crore and secured new orders worth ₹1,200 crore during the quarter. Chairman and Managing Director Shashin Patel attributed the turnaround to operational efficiency and cost optimization. Management expects revenue growth from the next quarter and targets order inflows of ₹5,000-6,000 crore for the fiscal year. Key risks include potential government infrastructure spending slowdown, rising input costs, and project delays.",
            "Sentiment": "positive",
            "PublishDate": 1755326086778,
            "Source": "earnings"
        },
        {
            "Title": "Sadbhav Engineering Reports Strong Profitability Turnaround Despite Revenue Decline",
            "Summary": "Sadbhav Engineering reported quarterly EBITDA of 1.47 billion rupees compared to 990 million rupees in the same period last year. The company's EBITDA margin significantly improved to 66.14% from 32.93% year-over-year. The company turned profitable with a consolidated net profit of 122 million rupees, reversing from a loss of 312 million rupees in the previous year. However, quarterly revenue declined to 2.2 billion rupees from 3 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755187544425,
            "Source": "earnings"
        },
        {
            "Title": "Sadbhav Engineering Reports Q1 FY26 Results, Reappoints Chairman for Three-Year Term",
            "Summary": "Sadbhav Engineering Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported a revenue from operations of Rs 3,301.52 lakhs and a net loss of Rs 42.05 lakhs for the quarter. The board approved both standalone and consolidated results and reappointed Mr. Shashin Patel as Chairman and Managing Director for a three-year term from December 17, 2025 to December 16, 2028, subject to shareholder approval. The company scheduled its 36th Annual General Meeting for September 30, 2025 via video conference. The company faces financial difficulties including defaults in loan repayments and classification as Non-Performing Asset by most lenders. A debt restructuring plan has been submitted to lenders, with the lead bank already providing sanction and other member banks reviewing approvals.",
            "Sentiment": "negative",
            "PublishDate": 1755187465777,
            "Source": "earnings"
        },
        {
            "Title": "Sadbhav Engineering: Q3 Loss Narrows Despite Revenue Decline",
            "Summary": "Sadbhav Engineering reported Q3 FY25 results with revenue of ₹240.07 crore, down 20.17% YoY. Net loss narrowed to ₹26.69 crore, an 81.84% improvement YoY. Operating income increased by 249.9% YoY. EPS improved to ₹-1.57, up 70.71% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1739598963000,
            "Source": "earnings"
        },
        {
            "Title": "Sadbhav Engineering Reports Q2 Loss and Exceptional Item",
            "Summary": "Sadbhav Engineering has reported a loss before tax (LBT) of 168.5 million rupees in Q2, compared to a loss of 221 million rupees in the same quarter last year. The company also disclosed an exceptional item of 700.9 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731604555000,
            "Source": "result"
        },
        {
            "Title": "Sadbhav Engineering Reports Q2 Financial Results",
            "Summary": "Sadbhav Engineering announced its Q2 financial results. The company's EBITDA for the quarter was 1.01 billion rupees, compared to 1.07 billion rupees in the same quarter last year. The EBITDA margin improved significantly to 49% from 24.31% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731604528000,
            "Source": "result"
        },
        {
            "Title": "Sadbhav Engineering Reports Q2 Revenue Decline",
            "Summary": "Sadbhav Engineering has reported a significant decrease in its second quarter revenue. The company's revenue for Q2 stood at 2.06 billion rupees, compared to 4.38 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731604521000,
            "Source": "result"
        },
        {
            "Title": "Sadbhav Engineering Reports Q2 Profit After Previous Losses",
            "Summary": "Sadbhav Engineering has reported a consolidated net profit of 274.1 million rupees for the second quarter, marking a significant turnaround from a loss of 2.1 billion rupees in the same quarter last year. However, this represents a decrease from the previous quarter's loss of 356.3 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731604512000,
            "Source": "result"
        }
    ]
}