{
    "Symbol": "SADBHIN",
    "ISIN": "INE764L01010",
    "News": [
        {
            "Title": "GCCL Infrastructure Reports Q3 FY26 Loss of ₹9.95 Lacs",
            "Summary": "GCCL Infrastructure & Projects Limited reported a net loss of ₹9.95 lacs for Q3 FY26 ended December 31, 2025, compared to ₹5.47 lacs loss in Q3 FY25. Total expenses rose to ₹11.56 lacs.",
            "Sentiment": "negative",
            "PublishDate": 1770725517966,
            "Source": "co_actions_results"
        },
        {
            "Title": "ARSS Infrastructure Posts Q3 FY26 Results",
            "Summary": "ARSS Infrastructure Projects Limited announced Q3 FY26 results with revenue of ₹3,825.10 lakhs and net loss of ₹6.28 lakhs. Company completed resolution plan implementation with debt settlement.",
            "Sentiment": "neutral",
            "PublishDate": 1770719822856,
            "Source": "co_actions_results"
        },
        {
            "Title": "GCCL Infrastructure Board Meet Set for Feb 10",
            "Summary": "GCCL Infrastructure & Projects Limited has scheduled a board meeting on February 10, 2026, to consider Q3FY26 unaudited financial results and discuss directorship continuation matters.",
            "Sentiment": "neutral",
            "PublishDate": 1770037260649,
            "Source": "co_actions_results"
        },
        {
            "Title": "ARSS Infrastructure EGM Approves Capital Restructuring",
            "Summary": "ARSS Infrastructure Projects Limited shareholders approved six special resolutions including authorized capital increase to ₹110 crores, borrowing limits of ₹5,000 crores, and executive remuneration packages during EGM held on December 9, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766406518256,
            "Source": "stocks"
        },
        {
            "Title": "ARSS Infrastructure Completes Equity Share Allotment",
            "Summary": "ARSS Infrastructure Projects Limited has completed the allotment of equity shares on December 22, 2025, as per the approved Resolution Plan under the Corporate Insolvency Resolution Process.",
            "Sentiment": "positive",
            "PublishDate": 1766403000279,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sadbhav Infrastructure Reports Loss, Appoints New Company Secretary and CFO Resigns",
            "Summary": "Sadbhav Infrastructure Project Limited reported a net loss of INR 198.62 million for the quarter ended September 30, 2025, compared to a loss of INR 472 million in the previous quarter. The Board approved the appointment of Kedar Pandya as Company Secretary and Compliance Officer effective November 12, 2025. Jatin Thakkar resigned from his position as Chief Financial Officer due to personal reasons, with his resignation taking effect from November 12, 2025. The company's total assets stood at INR 13,257.92 million as of September 30, 2025. The auditors expressed qualified opinions on the financial results regarding the recoverability of investments in subsidiary companies totaling INR 8,046.85 million.",
            "Sentiment": "negative",
            "PublishDate": 1762999523345,
            "Source": "corporate_governance"
        },
        {
            "Title": "ARSS Infrastructure Projects Secures ₹377.9 Million Subcontract",
            "Summary": "ARSS Infrastructure Projects has secured a subcontract worth ₹377.9 million. The announcement indicates new business acquisition for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1761320423760,
            "Source": "stock"
        },
        {
            "Title": "Sadbhav Infrastructure Appoints Siddharth Vyas as Non-Executive Director",
            "Summary": "Sadbhav Infrastructure Project Limited appointed Mr. Siddharth Bhupendrabhai Vyas as a Non-Executive Director effective September 4, 2025, following the Nomination and Remuneration Committee's recommendation. The appointment is subject to shareholder approval at the Annual General Meeting scheduled for September 30, 2025. Vyas holds an MBA from the National Institute of Management and has experience in top management roles and as a CFO, with expertise in financial modelling, policy making, and financial discipline. He holds no shares in the company and is not related to any existing directors or key managerial personnel. The company also approved the notice for its upcoming AGM.",
            "Sentiment": "neutral",
            "PublishDate": 1757043634937,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sadbhav Infrastructure Reports Quarterly Loss, Schedules AGM for September 30",
            "Summary": "Sadbhav Infrastructure Project Limited announced unaudited financial results for the quarter ended June 30, 2025, showing a standalone loss of INR 171 million compared to INR 279.12 million loss in the same quarter last year. On a consolidated basis, the company reported a profit of INR 258.57 million versus a loss of INR 159.29 million in the previous year quarter. Revenue from operations increased to INR 1,862.81 million from INR 1,668.24 million year-over-year on consolidated basis. The company scheduled its 19th Annual General Meeting for September 30, 2025, to be conducted virtually. The board also approved both standalone and consolidated results during their meeting held on August 12, 2025. Remote e-voting will be available from September 27-29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755016792722,
            "Source": "earnings"
        },
        {
            "Title": "Sadbhav Infrastructure Issues Notice for Transfer of Unclaimed Shares to IEPF",
            "Summary": "Sadbhav Infrastructure Project Limited has published a notice to equity shareholders regarding the transfer of unclaimed equity shares to the Investor Education and Protection Fund (IEPF). The company published this notice in English and Gujarati newspapers on August 4, 2025. Under regulatory provisions, equity shares with unclaimed dividends for seven consecutive years or more must be transferred to IEPF's demat account. Shareholders can claim dividends for the financial year ended March 31, 2018 (F.Y. 2017-2018) and onwards by contacting the company or its registrar MUFG Intime India Pvt. Ltd. before October 25, 2025. The notice includes details of affected shareholders, their folio numbers, and shares eligible for transfer, available on the company's website. Individual letters have been sent to concerned shareholders at their registered addresses.",
            "Sentiment": "neutral",
            "PublishDate": 1754306382802,
            "Source": "corporate_action"
        }
    ]
}