{
    "Symbol": "SADHNANIQ",
    "ISIN": "INE888C01040",
    "News": [
        {
            "Title": "Sadhana Nitrochem Files Corrected SEBI SAST Disclosures",
            "Summary": "Company submits corrected regulatory filings for promoter stake acquisitions by Asit Javeri and Abhishek Javeri, addressing earlier clerical errors in submission dates.",
            "Sentiment": "neutral",
            "PublishDate": 1766555408646,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sadhana Nitrochem Postal Ballot Results Announced",
            "Summary": "Sadhana Nitrochem announced postal ballot results with 99.91% approval for Tej Mayur Contractor's appointment as Non-Executive Independent Director. Total votes polled reached 30.79% of outstanding shares.",
            "Sentiment": "positive",
            "PublishDate": 1765541157588,
            "Source": "stocks"
        },
        {
            "Title": "Sadhana Nitrochem Limited Independent Director Ayesha Patel Retires After Term Completion",
            "Summary": "Ms. Ayesha Patel (DIN: 02074115) retired as Independent Director of Sadhana Nitrochem Limited on December 6, 2025, following completion of her term of appointment. The company disclosed this board change to BSE and NSE exchanges in compliance with listing regulations, with Patel formally tendering her resignation effective December 7, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765190885346,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sadhana Nitrochem Appoints Rony Mukesh Shah as Senior Management Personnel",
            "Summary": "Sadhana Nitrochem Limited appointed Mr. Rony Mukesh Shah as Compliance Officer and Senior Management Personnel in the Secretarial Team effective December 01, 2025. Mr. Nitin R. Jani continues as Company Secretary and Compliance Officer while heading the Secretarial Department, with the new appointee bringing over 11 years of experience as a Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1764600986645,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sadhana Nitro Chem Reports Higher-Than-Usual Loss for Quarter Ended September 30, 2025",
            "Summary": "Sadhana Nitro Chem Limited recorded significant losses in quarterly results due to technical constraints in production facilities, liquidity challenges, and reduced export demand from US and European markets affected by tariff-related uncertainties. The chemical manufacturer expects operational improvements in subsequent periods as production stability returns and market conditions become more predictable.",
            "Sentiment": "negative",
            "PublishDate": 1763067934003,
            "Source": "earnings"
        },
        {
            "Title": "Sadhana Nitro Chem Promoters Complete Inter-se Share Transfer of 8.77 Crore Shares",
            "Summary": "Sadhana Nitro Chem Limited disclosed an inter-se transfer of 8,77,77,000 equity shares (26.6469% stake) among promoter group members. Manekchand Panachand Trading Investment Co Pvt Ltd transferred 4,38,88,500 shares each to Mr. Asit Dhankumar Javeri and Mr. Abhishek Asit Javeri through off-market purchases at Rs. 6.17 per share. Following the transaction, Mr. Asit Dhankumar Javeri will hold 4,85,90,726 shares while Mr. Abhishek Asit Javeri will hold 4,66,32,262 shares. The transferor company will retain 1,021 equity shares. The transaction is exempt under SEBI regulations as it involves promoter group members who have been part of the shareholding pattern for over three years. The aggregate promoter and promoter group holding remains unchanged after this restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1761654319688,
            "Source": "corporate_action"
        },
        {
            "Title": "Sadhana Nitrochem Appoints Tej Mayur Contractor as Independent Director for Five-Year Term",
            "Summary": "Sadhana Nitrochem Limited's Board of Directors approved the appointment of Mr. Tej Mayur Contractor as a Non-Executive Independent Director for a five-year term from October 18, 2025 to October 17, 2030. The appointment was made through a circular resolution based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval. Mr. Contractor, identified as a businessman with DIN 00454197, is not related to any existing directors and is not debarred from holding directorial positions by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1760800545205,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sadhana Nitro Chem Limited Board Approves Increase in Authorized Share Capital",
            "Summary": "Sadhana Nitro Chem Limited's Board of Directors approved an increase in authorized share capital and consequent alteration of the Memorandum of Association, subject to shareholder approval. The board passed a circular resolution on October 02, 2025, based on the Audit Committee's recommendation. An extraordinary general meeting will be convened to seek member approval for the proposed changes. The board also authorized the Company Secretary to sign the draft notice for the meeting, approved the use of NSDL services for e-voting and video conferencing, and appointed a scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1759476221787,
            "Source": "corporate_action"
        },
        {
            "Title": "Sadhana Nitro Chem Shareholders Reject Final Dividend Proposal at 52nd AGM",
            "Summary": "Sadhana Nitro Chem Limited held its 52nd Annual General Meeting on September 29, 2025, through video conferencing. The company submitted voting results showing that seven out of eight resolutions were passed with required majority. However, Resolution No. 2 regarding declaration of final dividend at 10% (Rs. 0.10 per equity share) for the financial year ended March 31, 2025 was rejected as majority votes were cast against it. Other approved resolutions included adoption of financial statements, re-appointment of director Asit D. Javeri, ratification of cost auditor remuneration, appointment of secretarial auditor, increase in authorized share capital, enhancement of borrowing limits, and creation of charges on company assets. The scrutinizer Ms. Hetal Doshi confirmed the voting process was conducted fairly with 65,324 total shareholders on record date of September 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759310111737,
            "Source": "corporate_action"
        },
        {
            "Title": "Sadhana Nitro Chem Promoters Secure Court Injunction to Stop Share Sales by Broking Firms",
            "Summary": "Sadhana Nitro Chem Limited's promoters, Manekchand Panachand Trading Investment Company Private Limited, obtained an ad-interim injunction dated August 14, 2025 from the Bombay High Court. The injunction restrains three entities - Badjate Stock Broking Private Limited, Badjate Stocks and Shares Private Limited, and Bonanza Portfolio Limited - from further selling company shares that were pledged with them. The promoters have filed a suit seeking damages against these three entities for alleged illegal invocation and sale of the company's shares. Sadhana Nitro Chem is listed as Defendant No. 6 in this suit. The company is obtaining independent legal advice to evaluate measures for protecting shareholder interests and will disclose any material developments per applicable regulations.",
            "Sentiment": "negative",
            "PublishDate": 1755513368724,
            "Source": "stock"
        },
        {
            "Title": "Catalyst Trusteeship Sells Invoked Equity Shares of Sadhana Nitrochem",
            "Summary": "Catalyst Trusteeship Limited sold 72,46,119 invoked equity shares of Sadhana Nitrochem Limited on August 11, 2025. The transaction reduced Catalyst Trusteeship's holding from 8.22% to 6.02% of the company's total share capital. The sale was conducted by way of invoked equity shares, with Catalyst Trusteeship acting as Security Trustee for lenders. Sadhana Nitrochem has a total paid-up equity share capital of 32,94,11,057 shares of INR 1 each. The company's shares are listed on BSE Limited and National Stock Exchange Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755149938515,
            "Source": "corporate_action"
        },
        {
            "Title": "Sadhana Nitro Chem Reports Loss, Divests Subsidiary, and Announces Leadership Changes",
            "Summary": "Sadhana Nitro Chem Limited reported a net loss of Rs. 170 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs. 4 lakhs in the same period last year. Revenue from operations declined to Rs. 2,810 lakhs from Rs. 3,084 lakhs year-over-year. The company divested its entire shareholding in wholly-owned subsidiary Calchem Industries (India) Limited to H.G. Partners LLP for Rs. 13 crores. Executive directors waived 55% of their remuneration aggregating to Rs. 69 lakhs for the quarter. CFO Rakesh R. Kothari resigned effective August 14, 2025, citing personal and professional goals. The company appointed Vimal Jain as President Operations and Finance, and Jayesh Shah as Vice President Operations and Finance. On a consolidated basis, the company reported a net loss of Rs. 212 lakhs compared to a profit of Rs. 62 lakhs in the previous year quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755015619051,
            "Source": "earnings"
        },
        {
            "Title": "Catalyst Trusteeship Invokes 8.23% Stake in Sadhana Nitrochem Through Pledged Shares",
            "Summary": "Catalyst Trusteeship Limited invoked 2.71 crore equity shares of Sadhana Nitrochem Limited, representing 8.23% of the company's total share capital. The shares were pledged by Manekchand Panachand Trading Investment Co Pvt Ltd and invoked on August 7, 2025, in favor of Catalyst Trusteeship acting as Security Trustee for a lender. The invocation was made through pledged equity shares as part of security arrangements. Sadhana Nitrochem has a total paid-up equity share capital of 32.94 crore shares of INR 1 each and is listed on BSE Limited and National Stock Exchange Limited. Catalyst Trusteeship clarified it acts as trustee for two separate lenders in independent transactions, with additional pledged shares of 24.18 lakh pertaining to another lender not included in this disclosure.",
            "Sentiment": "negative",
            "PublishDate": 1754908992451,
            "Source": "corporate_action"
        },
        {
            "Title": "Sadhana Nitro Chem Reports Q4 Financial Results",
            "Summary": "Sadhana Nitro Chem announced its Q4 consolidated net profit of 41 million rupees, showing significant growth from 5 million rupees year-over-year and 25.8 million rupees quarter-over-quarter. However, Q4 revenue decreased to 494.7 million rupees from 645 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746403568000,
            "Source": "default"
        },
        {
            "Title": "Sadhana Nitro Chem Reports Q4 Financial Results",
            "Summary": "Sadhana Nitro Chem announced its Q4 financial results. The company's EBITDA increased to 132.3 million rupees from 92.9 million rupees year-over-year, with EBITDA margin improving to 26.74% from 14.39%. However, revenue decreased to 494.7 million rupees from 645 million rupees year-over-year. The consolidated net profit rose significantly to 41 million rupees, compared to 5 million rupees in the same quarter last year and 25.8 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746204757000,
            "Source": "result"
        },
        {
            "Title": "SADHANA NITRO CHEM Acquires CALCHEM INDUSTRIES (INDIA)",
            "Summary": "The National Company Law Tribunal (NCLT) has approved SADHANA NITRO CHEM's resolution plan to acquire CALCHEM INDUSTRIES (INDIA) for 95 million rupees. The acquisition is expected to be completed by January 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1731071255000,
            "Source": "corporate_action"
        }
    ]
}