{
    "Symbol": "SAFARI",
    "ISIN": "INE429E01023",
    "News": [
        {
            "Title": "Safari Industries Board Approves Rs 500 Crore QIP",
            "Summary": "Safari Industries board approved raising up to Rs 500 crore through QIP, re-appointed MD Sudhir Jatia for 5 years, and announced key management changes including new RTA appointment.",
            "Sentiment": "positive",
            "PublishDate": 1770717198385,
            "Source": "co_actions_results"
        },
        {
            "Title": "Safari Industries Q3FY26 Results Show Mixed Performance",
            "Summary": "Safari Industries reports Q3FY26 standalone revenue of ₹511.77 crores with net profit of ₹17.45 crores. Nine-month revenue reached ₹1,571.91 crores with profit of ₹89.85 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1770716652170,
            "Source": "co_actions_results"
        },
        {
            "Title": "Safari Industries Appoints Manish Bhatia as CHRO",
            "Summary": "Safari Industries (India) Limited has appointed Mr. Manish Bhatia as Chief Human Resource Officer effective January 27, 2026. Bhatia brings over 26 years of HR experience across diverse industries.",
            "Sentiment": "positive",
            "PublishDate": 1769515286889,
            "Source": "stocks"
        },
        {
            "Title": "Safari Industries Reports Strong Q2 Results, Declares 100% Interim Dividend",
            "Summary": "Safari Industries (India) Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved and declared an interim dividend of Rs. 2 per equity share (100% dividend) for financial year 2025-26, to be paid on or before December 6, 2025. The company operates in the luggage business segment and has two wholly owned subsidiaries - Safari Manufacturing Limited and Safari Lifestyles Limited. During the quarter, the company allotted 9,000 equity shares under its Employee Stock Option Scheme 2016 and 95,535 equity shares under its Employee Stock Appreciation Rights Scheme 2022. The financial results were reviewed by the Audit Committee and approved by the Board at their meeting held on November 10, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762804994334,
            "Source": "earnings"
        },
        {
            "Title": "Safari Industries Reports Strong Q2 Performance with Revenue Growth to 5.3B Rupees",
            "Summary": "Safari Industries reported Q2 revenue of 5.3 billion rupees, up from 4.6 billion rupees in the same period last year. The company's EBITDA increased to 740 million rupees from 480 million rupees year-over-year. EBITDA margin improved to 13.9% compared to 10.48% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762764174461,
            "Source": "earnings"
        },
        {
            "Title": "Safari Industries Reports 58% Jump in Quarterly Net Profit to 470 Million Rupees",
            "Summary": "Safari Industries reported consolidated net profit of 470 million rupees for the quarter, compared to 297 million rupees in the same period last year, representing a year-on-year increase of 58%.",
            "Sentiment": "positive",
            "PublishDate": 1762763683245,
            "Source": "earnings"
        },
        {
            "Title": "Safari Industries Allots 1,200 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "Safari Industries (India) Limited's Nomination, Remuneration and Compensation Committee approved the allotment of 1,200 equity shares with a face value of Rs. 2 each to an ESOP grantee under the Safari Employee Stock Option Scheme 2016. Following this allotment, the company's issued, subscribed and paid-up equity share capital will increase from Rs. 9,79,82,158 to Rs. 9,79,84,558. The decision was made during the committee meeting held on November 10, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762750300831,
            "Source": "corporate_action"
        },
        {
            "Title": "Safari Industries Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Safari Industries (India) Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Ms. Manjaree Chowdhary (DIN: 03402143) as Non-Executive Independent Director. The company appointed her as Additional Director on August 2, 2025, and now seeks member approval for a five-year term from August 2, 2025 to August 1, 2030. The e-voting period runs from August 21 to September 19, 2025, with results to be announced by September 21, 2025. Ms. Chowdhary is General Counsel at Maruti Suzuki India Limited with over 28 years of experience across legal, compliance, and corporate governance. The cut-off date for eligible voting members is August 15, 2025. NSDL will provide the remote e-voting facility, and Dilip Bharadiya & Associates will serve as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1755513402377,
            "Source": "corporate_action"
        },
        {
            "Title": "Safari Industries Reports Strong Q1 Growth with 14% Jump in Net Profit",
            "Summary": "Safari Industries delivered robust quarterly performance with consolidated net profit rising to 505 million rupees from 444 million rupees year-over-year. Revenue grew significantly to 5.3 billion rupees compared to 4.5 billion rupees in the same period last year. The company's EBITDA increased to 793 million rupees from 658 million rupees, while EBITDA margin improved to 15% from 14.64% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754039978609,
            "Source": "earnings"
        },
        {
            "Title": "Safari Industries Reports Q1 Results, Appoints New Independent Director and Invests Rs 25 Crore in Subsidiary",
            "Summary": "Safari Industries India Ltd reported unaudited financial results for the quarter ended June 30, 2025. The company appointed Ms. Manjaree Chowdhary as Additional Director in Non-Executive, Independent Director capacity effective August 2, 2025, for a five-year term until August 1, 2030. Ms. Chowdhary is a Felix Scholar with Master's in Law from University of London and serves as Senior Executive Officer and General Counsel of Maruti Suzuki India Limited, bringing over 28 years of experience across diverse industries. Mrs. Vijaya Sampath's tenure as Independent Director will complete on August 4, 2025, after serving five years since August 2020. The Board approved subscription of up to Rs 25 crore in share capital of Safari Manufacturing Limited, a wholly owned subsidiary with FY2024-25 turnover of Rs 481.03 crore. The investment will be through 2.5 crore redeemable preference shares of Rs 10 each, to be completed by December 31, 2025. Board committees were reconstituted to include the new director, and a postal ballot notice was approved for Ms. Chowdhary's appointment.",
            "Sentiment": "positive",
            "PublishDate": 1754039951519,
            "Source": "earnings"
        },
        {
            "Title": "Safari Industries: Multibagger Stock Faces Recent Dip Amid Analyst Optimism",
            "Summary": "Safari Industries India Ltd. has delivered a 1,013% return over five years but is down 19% year-to-date in 2025. Analysts remain bullish with 8 out of 11 recommending 'buy'. FY2024 saw 28% revenue growth to Rs 1,550 crore and 41% profit increase to Rs 176 crore. The company increased manufacturing capacity and issued 1:1 bonus shares.",
            "Sentiment": "positive",
            "PublishDate": 1750815697000,
            "Source": "earnings"
        },
        {
            "Title": "Safari Industries India Reports Q4 FY2023 Results and Dividend Declaration",
            "Summary": "Safari Industries India announced its Q4 financial results. Revenue increased to 4.2B rupees from 3.65B rupees year-over-year. However, EBITDA decreased to 470M rupees from 668M rupees, with EBITDA margin dropping to 11% from 18.30%. Consolidated net profit declined to 380M rupees from 430M rupees. The company declared a dividend of 1.5 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746520378000,
            "Source": "result"
        },
        {
            "Title": "Safari Industries (India) Reports Q3 EBITDA Decline",
            "Summary": "Safari Industries (India) has reported a significant decrease in its Q3 EBITDA, which fell to 360 million rupees from 560 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 8.14% from 14.43% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738655717000,
            "Source": "earnings"
        },
        {
            "Title": "Safari Industries Reports Q3 Revenue Growth",
            "Summary": "Safari Industries (India) has reported a revenue of 4.4 billion rupees for the third quarter, compared to 3.9 billion rupees in the same period last year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738655626000,
            "Source": "earnings"
        },
        {
            "Title": "Safari Industries Reports Q3 Net Profit Decline",
            "Summary": "Safari Industries (India) has reported a net profit of 255 million rupees for the third quarter, down from 355 million rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738655594000,
            "Source": "earnings"
        },
        {
            "Title": "Safari Industries' New Manufacturing Facility Begins Operations in Jaipur",
            "Summary": "Safari Industries (India) has announced that its subsidiary, Safari Manufacturing, has successfully commenced commercial production at its newly established greenfield manufacturing facility in Jaipur, Rajasthan. The facility will focus on the production of luggage.",
            "Sentiment": "positive",
            "PublishDate": 1733184400000,
            "Source": "corporate_action"
        },
        {
            "Title": "Safari Industries' New Manufacturing Facility Begins Operations in Jaipur",
            "Summary": "Safari Industries (India) has announced that its subsidiary, Safari Manufacturing, has successfully started commercial production of luggage at its newly established greenfield manufacturing facility in Jaipur, Rajasthan. This marks the beginning of operations at the company's latest production site.",
            "Sentiment": "positive",
            "PublishDate": 1733141327000,
            "Source": "corporate_action"
        },
        {
            "Title": "Safari Industries: Q2 Margins Squeezed by Price Wars",
            "Summary": "Safari Industries faced margin pressure in Q2 due to price competition in the market, according to an IDBI Capital review.",
            "Sentiment": "negative",
            "PublishDate": 1731318224000,
            "Source": "result"
        },
        {
            "Title": "Safari Industries Reports Q2 Financial Results",
            "Summary": "Safari Industries has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 480 million rupees, down from 635 million rupees in the same quarter last year. The EBITDA margin has also decreased from 17.15% to 10.48% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731054284000,
            "Source": "result"
        },
        {
            "Title": "Safari Industries Reports Q2 Revenue Growth",
            "Summary": "Safari Industries has announced its Q2 revenue figures, showing an increase to 4.6 billion rupees from 3.7 billion rupees in the same quarter last year, representing year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731054270000,
            "Source": "result"
        },
        {
            "Title": "Safari Industries Reports Q2 Consolidated Net Profit",
            "Summary": "Safari Industries has announced its financial results for the second quarter. The company reported a consolidated net profit of 297 million rupees, compared to 398 million rupees in the same quarter of the previous year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731053836000,
            "Source": "result"
        }
    ]
}