{
    "Symbol": "SAGCEM",
    "ISIN": "INE229C01021",
    "News": [
        {
            "Title": "Sagar Cements Issues ₹74 Crore Corporate Guarantee",
            "Summary": "Sagar Cements Limited executed a corporate guarantee agreement worth ₹74.00 crores in favour of Axis Finance Limited for subsidiary's term loan facility to support ongoing project expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1769242038840,
            "Source": "stocks"
        },
        {
            "Title": "Sagar Cements Unveils Major Cost Reduction Plan",
            "Summary": "Sagar Cements announces strategic cost reduction initiatives including 4.35 MW WHRS at Gudipadu and grinding mill at Jeerabad, targeting combined savings of ₹250-₹325 per ton by early FY27.",
            "Sentiment": "positive",
            "PublishDate": 1769134244728,
            "Source": "stocks"
        },
        {
            "Title": "Sagar Cements Plans ₹350 Cr Land Monetization",
            "Summary": "Sagar Cements management announces plans to monetize Vizag land assets over 18 months, expecting ₹350 crores net proceeds to be used primarily for debt reduction.",
            "Sentiment": "positive",
            "PublishDate": 1769134213653,
            "Source": "stocks"
        },
        {
            "Title": "Sagar Cements Outlines CapEx Plans for FY26-27",
            "Summary": "Sagar Cements reveals comprehensive capital expenditure strategy with ₹489 crores budgeted for FY26 and ₹291 crores for FY27, having already invested ₹303 crores in first nine months.",
            "Sentiment": "positive",
            "PublishDate": 1769134186295,
            "Source": "stocks"
        },
        {
            "Title": "Sagar Cements Board Approves ₹125 Cr Loan to Subsidiary",
            "Summary": "Sagar Cements Limited's board has approved an inter-corporate loan of up to ₹125.00 crores to its subsidiary Andhra Cements Limited, subject to regulatory approvals as required.",
            "Sentiment": "neutral",
            "PublishDate": 1769003882639,
            "Source": "stocks"
        },
        {
            "Title": "Sagar Cements Reports Q3FY26 Loss of ₹64.10 Crores",
            "Summary": "Sagar Cements Limited reported a consolidated net loss of ₹64.10 crores for Q3FY26, compared to ₹54.45 crores loss in Q3FY25. Revenue from operations increased 4.73% to ₹590.54 crores.",
            "Sentiment": "negative",
            "PublishDate": 1769003500749,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagar Cements Re-appoints Nominee Director",
            "Summary": "Sagar Cements Limited re-appoints Smt. N. Sudha Rani as TSIDC Nominee Director for January 2026-2028 term, subject to shareholder approval as per SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768570117322,
            "Source": "stocks"
        },
        {
            "Title": "Sagar Cements Re-appoints Nominee Director",
            "Summary": "Sagar Cements Limited re-appointed Smt.N.Sudha Rani as Nominee Director of TSIDC effective January 20, 2026, for a term extending till January 31, 2028, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1768569780794,
            "Source": "stocks"
        },
        {
            "Title": "Sagar Cements Q3 FY26 Earnings Call on Jan 22",
            "Summary": "Sagar Cements Limited announces earnings call on January 22, 2026 at 11:00 AM IST to discuss Q3 & 9M FY26 financial performance via Zoom meeting for analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1768545381198,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagar Cements Sells 7.76% Stake in Andhra Cements",
            "Summary": "Sagar Cements divested 7.76% stake in Andhra Cements through OFS, reducing promoter shareholding to 82.24%. Strategic divestment reflects corporate restructuring move.",
            "Sentiment": "neutral",
            "PublishDate": 1768307672100,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagar Cements Sells 7.76% Stake in Andhra Cements",
            "Summary": "Sagar Cements Limited sold 71,48,978 equity shares of Andhra Cements Limited representing 7.76% stake through stock exchange mechanism on January 09 and 12, 2026, reducing promoter holding from 90% to 82.24%.",
            "Sentiment": "neutral",
            "PublishDate": 1768307457132,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagar Cements Board Meet Set for Q3FY26 Results",
            "Summary": "Sagar Cements Limited has scheduled its board meeting for January 21, 2026, to consider and approve the unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768306253461,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagar Cements to sell 8.14% stake in Andhra Cements",
            "Summary": "Sagar Cements approved OFS of 75 lakh equity shares in subsidiary Andhra Cements at ₹72 floor price. Issue opens January 9 for non-retail, January 12 for all investors.",
            "Sentiment": "neutral",
            "PublishDate": 1767935715801,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagar Cements to divest 8.14% stake in Andhra Cements",
            "Summary": "Sagar Cements Limited announced divestment of up to 8.14% stake in subsidiary Andhra Cements Limited through Offer for Sale to comply with minimum public shareholding requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767934862536,
            "Source": "co_actions_results"
        },
        {
            "Title": "Andhra Cements OFS: 75L shares at ₹72 floor price",
            "Summary": "Sagar Cements announces OFS of 75,00,000 equity shares (8.14%) in Andhra Cements on Jan 9-12, 2026 at ₹72 floor price through BSE and NSE platforms under SEBI guidelines.",
            "Sentiment": "neutral",
            "PublishDate": 1767870588500,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagar Cements Promoters Pledge Shares for ₹50 Cr NCDs",
            "Summary": "Sagar Cements promoters pledge shares as security for ₹50 crore non-convertible debentures issued by RV Consulting Services, extending existing encumbrance arrangements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765877495070,
            "Source": "stocks"
        },
        {
            "Title": "Sagar Cements Sets Sales Volume Target of 6 Million Tons for FY26, 7 Million Tons for FY27",
            "Summary": "Sagar Cements has announced its sales volume expectations of 6 million tons for FY26 and maintained its FY27 sales guidance at 7 million tons, with potential for future increases. The company has set its EBITDA guidance for FY26 at approximately Rs. 600 per ton.",
            "Sentiment": "positive",
            "PublishDate": 1761536656247,
            "Source": "stock"
        },
        {
            "Title": "Sagar Cements Reports Loss in Q2 FY26 Despite Revenue Growth",
            "Summary": "Sagar Cements Limited reported consolidated revenue from operations of ₹60,620 lakhs for the quarter ended September 30, 2025, compared to ₹47,512 lakhs in the same period last year. However, the company posted a consolidated net loss of ₹4,231 lakhs versus a profit of ₹2,390 lakhs in the previous year quarter. For the six-month period, revenue increased to ₹1,27,252 lakhs from ₹1,28,105 lakhs, while the company recorded a loss of ₹2,261 lakhs compared to a profit of ₹12,676 lakhs in the prior year. On a standalone basis, the company reported quarterly revenue of ₹39,951 lakhs and a net loss of ₹824 lakhs. The Board of Directors approved these results at their meeting held on October 23, 2025. The company operates in cement and cement-related products manufacturing.",
            "Sentiment": "negative",
            "PublishDate": 1761227273199,
            "Source": "earnings"
        },
        {
            "Title": "Sagar Cements Withdraws Reclassification Application for P. V. Narasimha Reddy",
            "Summary": "Sagar Cements Limited has withdrawn its application for reclassification under Regulation 31A of SEBI Listing Regulations regarding Mr. P. V. Narasimha Reddy. The company had previously submitted an application on August 6, 2025, which it has now decided to withdraw. The withdrawal was communicated to both NSE and BSE through a formal letter signed by Company Secretary J. Raja Reddy.",
            "Sentiment": "neutral",
            "PublishDate": 1757938165268,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sagar Cements Partially Withdraws Promoter Reclassification Application",
            "Summary": "Sagar Cements Limited has partially withdrawn its application for promoter reclassification submitted in August 2023. The company withdrew the request for reclassifying M/s.Panchavati Polyfibres Limited from 'Promoter/Promoter Group' to 'Public' category but will continue pursuing the reclassification of Mr. P. V. Narasimha Reddy from 'Promoter' to 'Public' category under SEBI regulations. The company will keep stock exchanges informed of further developments.",
            "Sentiment": "neutral",
            "PublishDate": 1754478872337,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sagar Cements Reports Strong Q1 Performance with 20% Revenue Growth and Improved Margins",
            "Summary": "Sagar Cements Limited reported quarterly revenue of ₹671 crore compared to ₹561 crore in the previous year, marking a 20% increase. EBITDA improved significantly to ₹121 crore from ₹47 crore, with margins expanding to 18% from 8%. The company achieved 11% volume growth and EBITDA per tonne of ₹851. Profit after tax stood at ₹7 crore. The company expects overall volumes of around 6 million tonnes for the fiscal year and anticipates minimum EBITDA of ₹600 per tonne going forward. Power and fuel costs remained stable at ₹1,450 per tonne. The modernization of Andhra cement's Dachepalli unit is progressing on schedule for commissioning by September-October. Gross debt stands at ₹1,556 crore with a debt-equity ratio of 0.65:1. The company received ₹34 crore in incentives during the quarter with an additional ₹12 crore expected. A subsidiary has approved expansion of cement grinding capacity from 1 million to 1.5 million tonnes and establishment of a 6-megawatt solar power plant with a capex of ₹140 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753515993185,
            "Source": "earnings"
        },
        {
            "Title": "Sagar Cements Provides Audio Recording Link for Q1 FY2026 Analyst Meeting",
            "Summary": "Sagar Cements Limited has made available an audio recording of their analyst meeting discussing unaudited standalone and consolidated financial results for the first quarter ended June 30, 2025. The company provided a link to the conference call recording at https://sagarcements.in/Earning Call Q1 FY 26. The communication was addressed to the National Stock Exchange of India and BSE Limited, with the company trading under scrip code 502090 and symbol SAGCEM.",
            "Sentiment": "neutral",
            "PublishDate": 1753187895177,
            "Source": "earnings"
        },
        {
            "Title": "Sagar Cements Subsidiary Approves Rs 140.5 Crore Expansion Plan for Grinding Capacity and Solar Power",
            "Summary": "Sagar Cements (M) Private Limited, an unlisted material subsidiary of Sagar Cements Limited, has approved two major projects at its Jeerabad, Madhya Pradesh facility. The company will enhance its grinding capacity from 1.00 MTPA to 1.5 MTPA at a cost of Rs 120 crores and implement a 6 MW solar power plant costing Rs 20.50 crores. The total investment of approximately Rs 140.5 crores will be funded through internal accruals and debt. The board approval was granted at a meeting held on July 21st, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753160806061,
            "Source": "stock"
        },
        {
            "Title": "Sagar Cements Reports Strong Q1 Turnaround with 75M Rupees Profit",
            "Summary": "Sagar Cements posted a consolidated net profit of 75 million rupees in Q1, marking a significant turnaround from a loss of 284 million rupees in the same period last year. The company's revenue grew to 6.7 billion rupees compared to 5.60 billion rupees year-over-year. EBITDA more than doubled to 1.21 billion rupees from 467 million rupees, while EBITDA margin expanded substantially to 18.11% from 8.33% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753104505881,
            "Source": "earnings"
        },
        {
            "Title": "Sagar Cements: Dolat Capital Upgrades to 'Reduce', Raises Target Price",
            "Summary": "Dolat Capital has upgraded Sagar Cements to 'Reduce' and increased its target price following inline Q4 FY25 results. The company expects to grow in line with the South industry's projected 6-8% demand growth for FY26E. Sagar Cements targets a volume of 6-6.1 mt for the upcoming period.",
            "Sentiment": "neutral",
            "PublishDate": 1747222996000,
            "Source": "earnings"
        },
        {
            "Title": "Sagar Cements Reports Q4 Financial Results",
            "Summary": "Sagar Cements announced its Q4 financial results, showing a significant decline in performance. The company reported an EBITDA of 308 million rupees, down from 681 million rupees year-over-year. The EBITDA margin decreased to 4.68% from 9.61% in the same period last year. The company posted a consolidated net loss of 707 million rupees, compared to a loss of 133 million rupees in the previous year and 551 million rupees in the previous quarter. Revenue for Q4 stood at 6.6 billion rupees, down from 7.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747060308000,
            "Source": "result"
        },
        {
            "Title": "Sagar Cements Approves 4.30 MW Waste Heat Recovery Power System",
            "Summary": "Sagar Cements has approved the installation of a 4.30 MW Waste Heat Recovery Power System. The project is estimated to cost around 800 million rupees and is expected to be completed within 18 months.",
            "Sentiment": "positive",
            "PublishDate": 1743163011000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagar Cements Reports Increased Q3 Net Loss and Decreased Revenue",
            "Summary": "Sagar Cements has reported a consolidated net loss of 551 million rupees for the third quarter, a significant increase from the 81 million rupee loss in the same period last year. The company's revenue also declined, falling to 5.64 billion rupees from 6.69 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737936809000,
            "Source": "earnings"
        },
        {
            "Title": "Sagar Cements: Q3 Loss Narrows, Revenue Declines Sharply",
            "Summary": "Sagar Cements reported Q3 FY25 results with a loss of ₹55.07 crore, down 2.72% YoY. Revenue fell 68.6% to ₹563.88 crore. Operating income declined 160.69% YoY but improved 44.33% QoQ. EPS stood at ₹-4.17, up 12.03% YoY. Analysts maintain a 'Buy' recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1737786023000,
            "Source": "earnings"
        },
        {
            "Title": "Sagar Cements Reports Significant Drop in Q3 EBITDA",
            "Summary": "Sagar Cements has reported a substantial decline in its third-quarter EBITDA, which fell to 376 million rupees from 871 million rupees year-over-year. The company's EBITDA margin also decreased, dropping to 6.68% from 13.00% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737728548000,
            "Source": "earnings"
        },
        {
            "Title": "Sagar Cements Reports Increased Net Loss in Q3",
            "Summary": "Sagar Cements has reported a consolidated net loss of 551 million rupees for the third quarter, compared to a loss of 81 million rupees in the same period last year. The company's revenue also declined to 5.64 billion rupees from 6.69 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737728542000,
            "Source": "earnings"
        },
        {
            "Title": "Sagar Cements Reports Increased Q2 Net Loss",
            "Summary": "Sagar Cements reported a consolidated net loss of 556 million rupees in Q2, compared to a loss of 87 million rupees year-over-year. The loss also increased from 284 million rupees quarter-over-quarter. Q2 revenue decreased to 4.75 billion rupees from 5.87 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1729693856000,
            "Source": "result"
        }
    ]
}