{
    "Symbol": "SAGILITY",
    "ISIN": "INE0W2G01015",
    "News": [
        {
            "Title": "Sagility Q3FY26: Revenue Surges 35.7% YoY to ₹19,712 Million",
            "Summary": "Sagility Limited reported strong Q3FY26 results with revenue at ₹19,712 million, up 35.7% YoY. Adjusted EBITDA grew 24.2% to ₹5,125 million at 26.0% margin, while adjusted PAT increased 23.0% to ₹3,229 million.",
            "Sentiment": "positive",
            "PublishDate": 1769609271992,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagility Gets Credit Rating Withdrawal from ICRA",
            "Summary": "Sagility Limited announces ICRA's withdrawal of credit ratings for its long-term and short-term fund-based bank facilities following company's request and lender approval on January 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769157126326,
            "Source": "stocks"
        },
        {
            "Title": "Sagility schedules Q3 FY26 earnings webinar for Jan 28",
            "Summary": "Sagility Limited announces earnings webinar on January 28, 2026, at 7:30 PM IST to discuss Q3 FY26 unaudited financial results. Management will present business highlights followed by Q&A session.",
            "Sentiment": "neutral",
            "PublishDate": 1768830113161,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sagility Gets CRISIL A/Stable Credit Rating",
            "Summary": "CRISIL Ratings assigns long-term rating of 'CRISIL A/Stable' and short-term rating of 'CRISIL A1' to Sagility Limited's ₹300 crore bank facilities, reflecting stable credit profile.",
            "Sentiment": "positive",
            "PublishDate": 1767626443367,
            "Source": "stocks"
        },
        {
            "Title": "Sagility Faces ₹351.3 Cr Tax Demand for AY 2022-23",
            "Summary": "Sagility Limited receives income tax assessment order with ₹351.3 crore demand including interest. Company plans to appeal, citing no material impact on operations or financials.",
            "Sentiment": "negative",
            "PublishDate": 1765380327481,
            "Source": "stocks"
        },
        {
            "Title": "Sagility Appoints Chris Shiffert as Chief Growth Officer Following Sohail Djariri's Resignation",
            "Summary": "Sagility announced the resignation of Chief Growth Officer Sohail Djariri effective November 28, 2025, due to personal reasons, with Chris Shiffert appointed as his replacement effective December 1, 2025. Shiffert joined Sagility through the BroadPath acquisition in January 2025 and brings experience from business development roles at BroadPath, Xerox Services, and Deloitte.",
            "Sentiment": "neutral",
            "PublishDate": 1764405693922,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sagility Limited Processes Interim Dividend Payment for FY2025-26, Issues Notice for Bank Detail Updates",
            "Summary": "Sagility Limited has processed interim dividend payments of Rs. 0.05 per equity share for FY2025-26 for shareholders with updated bank details, while sending notices via Speed Post to shareholders without bank details. The company is complying with SEBI notification SEBI/LAD-NRO/GN/2025/273 dated November 18, 2025, which mandates electronic dividend payments and discontinues physical warrants/demand drafts.",
            "Sentiment": "neutral",
            "PublishDate": 1764328251123,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility B.V. Reduces Stake in Sagility Limited Through Bulk Deal Transaction",
            "Summary": "Sagility B.V. sold 769,000,000 equity shares (16.427% stake) in Sagility Limited through a bulk deal settled on November 17, 2025, reducing its holding from 67.38% to 50.95%. The transaction resulted in an indirect release of encumbered shares that were pledged to lenders including CPPIB Credit Investments Inc. and HSBC Limited as part of financing arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1763534937391,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility Shares Surge 5% Despite Promoter Block Deal Worth Rs 3,600 Crore",
            "Summary": "Sagility India shares rose 5% as promoter Sagility BV offloaded 17% stake worth Rs 3,600 crore through block deals at Rs 46.40 per share, an 8% discount to previous close. The technology-enabled healthcare services company reported strong quarterly results with 25% revenue growth to Rs 1,659 crore and 84% jump in net profit to Rs 301 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763093441195,
            "Source": "order&deals"
        },
        {
            "Title": "Sagility Limited CFO Resigns, Deputy CFO Appointed",
            "Summary": "Sagility Limited announced that Group Chief Finance Officer Sarvabhouman Doraiswamy Srinivasan has resigned for personal reasons, with his resignation taking effect from November 15, 2025. The Board acknowledged his resignation and recorded appreciation for his contributions during his tenure. The company has appointed Abhishek Kayan as Deputy CFO and Senior Management Personnel, effective November 15, 2025. Kayan brings 20 years of experience in healthcare services across finance functions including Business Finance, Pricing, FPA, Corporate Treasury and Investor Relations. He currently serves as Group Head of FPA IR and Head of Finance for the Americas region at Sagility, and holds an MBA from Indian Institute of Management, Lucknow.",
            "Sentiment": "neutral",
            "PublishDate": 1762203133355,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sagility Reports 25.2% Revenue Growth in Q2 FY26, Raises Full-Year Guidance",
            "Summary": "Sagility Limited reported consolidated revenues of INR 16,585 million ($189.4 million) for Q2 FY26, marking 25.2% year-on-year growth in INR terms and 20% in constant currency. Organic growth registered 16% year-on-year in INR terms and 11.1% in constant currency. The Payer business grew 24.2% year-on-year, accounting for 88.5% of total revenue, while the Provider vertical expanded 33.4% year-on-year, contributing 11.5% to overall revenues. Adjusted EBITDA reached INR 4,352 million, representing 25.6% year-on-year increase with a margin of 26.2%. The company secured business from 24 existing clients and added five new clients during the quarter, with aggregate annual contract value of $34 million. Sagility raised its constant currency revenue guidance to 21% plus from the previous 20% and adjusted EBITDA guidance to close to 25% for FY2026. The Board approved an interim dividend of INR 0.05 per share. The company has deployed 25 distinct AI use cases across nine clients and expects strong performance in H2 FY26 due to the Annual Enrollment Period season.",
            "Sentiment": "positive",
            "PublishDate": 1761922960495,
            "Source": "earnings"
        },
        {
            "Title": "Sagility Raises Revenue Growth Forecast to 21% and Adjusted EBITDA Forecast to 25%",
            "Summary": "Sagility has revised its financial forecasts upward, increasing its revenue growth projection from 20% to 21% and setting its adjusted EBITDA forecast at 25%. The company's updated guidance reflects improved expectations for its financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1761796276411,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India Projects Strong FY26 Growth with $34 Million ACV Wins and Digital Strategy",
            "Summary": "Sagility India anticipates strong momentum in FY26 driven by $34 million in Annual Contract Value wins. The company is implementing a consulting-led approach for margin expansion and scalable digital delivery. Sagility is focusing on automation, analytics, and high-value healthcare outsourcing to increase its offshore mix and drive EBITDA growth in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761754380049,
            "Source": "stock"
        },
        {
            "Title": "Sagility India Reports Strong Q2 Performance with Net Profit Doubling Year-over-Year",
            "Summary": "Sagility India delivered robust quarterly results with consolidated net profit reaching 2.51 billion rupees, more than doubling from 1.17 billion rupees in the same period last year. Revenue grew to 16.58 billion rupees from 13.25 billion rupees year-over-year. EBITDA increased to 4.15 billion rupees compared to 3.01 billion rupees previously, while EBITDA margin improved to 25.03% from 22.73% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761744807599,
            "Source": "earnings"
        },
        {
            "Title": "Sagility Limited Board to Consider Interim Dividend Proposal at October 29 Meeting",
            "Summary": "Sagility Limited has issued an addendum to its earlier board meeting notice, announcing that the Board of Directors will consider a proposal for declaration of interim dividend for financial year 2025-26 at their meeting scheduled for October 29, 2025. The board meeting was originally scheduled to review unaudited financial results for the quarter and half year ended September 30, 2025. The company has added the interim dividend consideration as an additional agenda item for the same meeting.",
            "Sentiment": "positive",
            "PublishDate": 1761324504874,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility B.V. Refiled Disclosure for 703 Million Share Sale, Reducing Indirect Encumbrances",
            "Summary": "Sagility B.V., promoter of Sagility India Limited, has refiled a regulatory disclosure regarding the disposal of 703 million equity shares through an offer for sale. The transaction was completed across two trade dates in May 2025, with settlement dates of May 28 and May 29, 2025. Following the share sale, Sagility B.V.'s holding in the company decreased from 82.39% to 67.38% of total share capital. The disposal resulted in changes to indirect share encumbrances related to financing facilities availed by the promoter and its holding companies from lenders outside India. The refiling was requested by BSE Limited through multiple email correspondences, with the promoter revising the number of shares and percentage of indirect release of pledge from 3.857 billion equity shares to 703 million equity shares. The encumbrances were created in favor of security agents including Global Loan Agency Services Australia Nominees Pty Limited and The Hongkong and Shanghai Banking Corporation Limited, representing various international lenders.",
            "Sentiment": "neutral",
            "PublishDate": 1758511539561,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility B.V. Refiled Disclosure Following Share Sale, Updates Encumbrance Details",
            "Summary": "Sagility B.V., promoter of Sagility India Limited, has refiled its disclosure under SEBI Takeover Regulations after disposing of equity shares through an offer for sale. The refiling includes updated information on indirectly encumbered shares due to financing facilities. Sagility B.V. sold 703 million equity shares through stock exchange mechanism, reducing its holding from 82.39% to 67.38% of Sagility India Limited's total share capital. The promoter and its holding companies have financing facilities from international lenders, creating indirect encumbrances on the shares. The encumbrances are held by Global Loan Agency Services Australia Nominees Pty Limited and The Hongkong and Shanghai Banking Corporation Limited as security agents. The share sale settlement occurred on May 28-29, 2025, resulting in changes to the percentage of indirectly encumbered shares, prompting the revised disclosure filing.",
            "Sentiment": "neutral",
            "PublishDate": 1757654355853,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility India Shares Rise for Third Consecutive Session Amid IT Sector Rally",
            "Summary": "Sagility India Ltd.'s share price extended gains for the third consecutive day, following broader gains in IT stocks. The company provides technology and business process management services primarily in medical and healthcare domains. The rally was driven by overall IT sector momentum following Wall Street gains over the weekend, sparked by Federal Reserve Chair Jerome Powell's Jackson Hole address hinting at near-term rate cuts. This increased September rate cut probability to nearly 90% from 75%. Indian IT companies are sensitive to US economic factors due to their business exposure there. Sagility India shares rose 1.37% to Rs 46.43, trading 0.74% higher at Rs 46.40 as of 10:22 a.m., outperforming the NSE Nifty 50's 0.22% advance. The stock has gained 58.53% over 12 months but declined 7.91% year-to-date. Six analysts maintain 'buy' ratings on the stock.",
            "Sentiment": "positive",
            "PublishDate": 1756103631151,
            "Source": "stock"
        },
        {
            "Title": "Sagility Limited Shareholders Approve Re-appointment of Martin I. Cole as Director",
            "Summary": "Sagility Limited shareholders approved the re-appointment of Mr. Martin I. Cole as Non-Executive Non-Independent Director at the company's 4th Annual General Meeting held on August 21, 2025. Cole, who was liable to retire by rotation, was re-appointed based on the Board's recommendation. He holds degrees from Dartmouth College and University of Texas at Austin, has over 43 years of experience, and serves as director for Western Digital (NASDAQ-listed) and Western Union (NYSE-listed). He previously served as chairman and interim CEO of Cloudera and as chief executive of Accenture's technology group.",
            "Sentiment": "neutral",
            "PublishDate": 1755876113038,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sagility India Reports Strong Q1 FY26 Results with 25.8% Revenue Growth and Raises EBITDA Margin Guidance",
            "Summary": "Sagility India Limited reported consolidated revenues of ₹15,389 million ($180.4 million) for Q1 FY26, reflecting 25.8% year-on-year growth in INR terms and 23.1% in constant currency. Organic growth stood at 17.9% in INR terms and 15.4% in constant currency. The payer vertical grew 24.7% year-on-year, accounting for 88.4% of total revenue, while the provider vertical expanded 34.5% year-on-year, contributing 11.6% to overall revenues. Adjusted EBITDA reached ₹3,687 million ($43.2 million), up 26.5% year-on-year, with a margin of 24%. Adjusted profit after tax increased 38% to ₹1,997 million. The company won new business from 18 existing clients and onboarded four new clients, with total potential annual contract value of approximately $32 million. Sagility closed the quarter with 39,917 employees and maintained annualized attrition at 26.6%. The company has deployed 18 AI-based use cases for eight existing clients and is working on 15 additional use cases. Management raised its adjusted EBITDA margin guidance to 24% plus for FY26 and expects to achieve 20% plus growth including BroadPath acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1754391603572,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India Reports 25%+ Revenue Growth, Focuses on AI-Driven Healthcare BPO Expansion",
            "Summary": "Sagility India has achieved a revenue surge of over 25% while strengthening client relationships in the healthcare BPO sector. The company is implementing AI-driven solutions and targeting margin expansion through scalable automation. Sagility India is pursuing strategic global penetration as part of its next-generation growth strategy in the healthcare business process outsourcing market.",
            "Sentiment": "positive",
            "PublishDate": 1753886662480,
            "Source": "stock"
        },
        {
            "Title": "Sagility India Reports 25.8% Revenue Growth in Q1FY26, Appoints PwC as Internal Auditor",
            "Summary": "Sagility India Limited reported consolidated revenue of ₹15,389 million for the quarter ended June 30, 2025, marking a 25.8% year-on-year growth. The company achieved adjusted EBITDA of ₹3,687 million (24.0% margin) with 26.5% YoY growth and adjusted PAT of ₹1,997 million (13.0% margin) with 38.0% YoY growth. Basic earnings per share stood at ₹0.32, representing 530% YoY growth. The Board approved the appointment of PricewaterhouseCoopers Services LLP as Internal Auditors for the period August 1, 2025 to September 30, 2026, and amended the company's Code of Conduct for Prevention of Insider Trading. The company operates with 39,917 employees across 33 delivery centers in 5 countries, serving healthcare payers and providers in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1753879861685,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India Repurchases ₹124.5 Crore Worth of Non-Convertible Debentures",
            "Summary": "Sagility India has bought back Non-Convertible Debentures (NCDs) valued at ₹124.5 crores from Sagility B.V. This repurchase represents a significant repayment activity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1750694332000,
            "Source": "default"
        },
        {
            "Title": "Sagility B.V. Exercises Oversubscription Option in Sagility India OFS",
            "Summary": "Sagility B.V. has exercised an oversubscription option for a 7.62% stake in Sagility India's Offer for Sale (OFS). This action indicates increased investor interest in the offering, allowing Sagility B.V. to sell more shares than initially planned.",
            "Sentiment": "positive",
            "PublishDate": 1748347958000,
            "Source": "default"
        },
        {
            "Title": "Sagility India: Promoter Plans 7.39% Stake Sale, Stock Hits Lower Circuit",
            "Summary": "Sagility India's share price fell 5.02% to Rs 40.71, hitting the lower circuit limit, as promoter Sagility BV announced plans to sell a 7.39% stake via an offer for sale. The floor price is set at Rs 38 per share. Non-retail bidding for the offer begins today.",
            "Sentiment": "negative",
            "PublishDate": 1748319430000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility India: Promoter to Sell Up to 15.02% Stake via OFS",
            "Summary": "Sagility B.V., promoter of Sagility India Ltd., plans to sell up to 15.02% stake through an Offer for Sale (OFS). The OFS opens on May 27-28 with a floor price of ₹38 per share. The company recently reported a 127.62% rise in Q4 net profit and 22.23% increase in sales.",
            "Sentiment": "neutral",
            "PublishDate": 1748269281000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility India: Promoter to Sell Up to 15% Stake via Block Deal",
            "Summary": "Sagility B.V. plans to sell up to 703 million shares (15.02% stake) in Sagility India via block deals on Tuesday. The floor price is set at Rs 38 per share, an 11.4% discount to the last closing price. The total offer could fetch up to Rs 2,671 crore ($314.7 million).",
            "Sentiment": "neutral",
            "PublishDate": 1748268259000,
            "Source": "block_deals"
        },
        {
            "Title": "Sagility B.V. Plans to Sell Stake in Sagility India via OFS",
            "Summary": "Sagility B.V., a co-founder of Sagility India, intends to sell up to 15.02% of its stake in the company through an Offer for Sale (OFS). The floor price for the OFS has been set at 38 rupees per share. Initially, the plan is to sell 7.39% of the company's shares.",
            "Sentiment": "neutral",
            "PublishDate": 1748260999000,
            "Source": "default"
        },
        {
            "Title": "Sagility India Reports Strong Q4 Financial Results",
            "Summary": "Sagility India has announced its Q4 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit reached 1.83 billion rupees, up from 802.1 million rupees in the same quarter last year and 2.17 billion rupees in the previous quarter. Revenue also increased to 15.68 billion rupees, compared to 12.83 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747267579000,
            "Source": "default"
        },
        {
            "Title": "Sagility India Reports Strong Q4 Financial Results",
            "Summary": "Sagility India has announced its Q4 financial results, showing significant year-over-year growth. The company's EBITDA increased to 3.73 billion rupees from 3.07 billion rupees in the previous year. Revenue rose to 15.68 billion rupees from 12.83 billion rupees. Consolidated net profit saw a substantial increase to 1.83 billion rupees, up from 802.1 million rupees year-over-year and 2.17 billion rupees quarter-over-quarter. However, the EBITDA margin slightly decreased to 23.78% from 23.95% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747241619000,
            "Source": "result"
        },
        {
            "Title": "Sagility India to Consider Q4 Results on May 14",
            "Summary": "Sagility India has announced that it will consider its fourth quarter financial results on May 14. This indicates the company is preparing to release its latest earnings report, which will provide insight into its financial performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746532667000,
            "Source": "default"
        },
        {
            "Title": "Sagility India: Debt Reduction to Fuel PAT Growth Over Next Three Years",
            "Summary": "Sagility India's Managing Director and Group CEO Ramesh Gopalan states that reduced debt levels will drive profit after tax growth at a higher rate than revenue and Ebitda over the next three years. The company reported strong quarterly results with a 15.3% year-on-year revenue increase to Rs 1,453 crore and a 50.8% Ebitda growth to Rs 392 crore.",
            "Sentiment": "positive",
            "PublishDate": 1738826276000,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India Reports Strong Q3 Financial Results",
            "Summary": "Sagility India has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 2.17 billion rupees, up from 706 million rupees in the same quarter last year. Revenue also saw an increase, reaching 14.5 billion rupees compared to 12.6 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1738801268000,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India Reports Strong Q3 EBITDA Growth",
            "Summary": "Sagility India has announced its Q3 financial results, showing significant improvement in EBITDA and EBITDA margin. The company's EBITDA increased to 3.9 billion rupees from 2.6 billion rupees in the same quarter last year. The EBITDA margin also improved, rising to 27% from 20.64% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738760854000,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Sagility India has announced its financial results for the third quarter. The company's consolidated net profit has increased substantially to 2.17 billion rupees, compared to 706 million rupees in the same period last year. Revenue also saw growth, rising to 14.5 billion rupees from 12.6 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738760847000,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India to Consider Q3 Results",
            "Summary": "Sagility India has announced that it will consider its third quarter (Q3) financial results on February 5. This meeting is likely to involve the company's board reviewing and potentially approving the financial statements for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738245676000,
            "Source": "result"
        },
        {
            "Title": "Sagility Expands Cross-Selling Opportunities in Healthcare Services",
            "Summary": "Sagility has announced an opportunity to cross-sell its wide range of service offerings to various mid-market clients in the healthcare sector. The targeted clients include payers, third-party administrators, pharmacy benefit managers, and healthcare providers.",
            "Sentiment": "positive",
            "PublishDate": 1738204975000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility Strengthens Position Among Top 10 Largest US Health Plans Through Acquisition",
            "Summary": "Sagility has announced an acquisition that enhances its standing among the top 10 largest health plans in the United States. This strategic move is expected to bolster the company's market position and expand its presence in the healthcare sector.",
            "Sentiment": "positive",
            "PublishDate": 1738204961000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility Acquires BroadPath Healthcare Solutions",
            "Summary": "Sagility has acquired BroadPath Healthcare Solutions, a US-based healthcare-focused services company. This strategic acquisition is aimed at accelerating Sagility's growth in the mid-market payer segment of the healthcare industry.",
            "Sentiment": "positive",
            "PublishDate": 1738204812000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility India: Stock Surges 40% in a Month, Analysts Urge Caution",
            "Summary": "Sagility India's stock has rallied over 40% in the past month, reaching a new all-time high of Rs 56.44. The stock is up 87% since its November listing. Analysts advise caution and profit-taking due to overbought conditions, suggesting partial booking in the Rs 54-56 range. The company reported strong Q2 results with a 30.5% YoY increase in adjusted PAT.",
            "Sentiment": "neutral",
            "PublishDate": 1735631935000,
            "Source": "normal_news"
        },
        {
            "Title": "Sagility India: Shares Surge 5% in 8-Day Rally Amid Positive Analyst Coverage",
            "Summary": "Sagility India's stock hit a new high of Rs 51.35, up 61% in the last month. JPMorgan initiated coverage with an 'Overweight' rating and Rs 54 target price, citing strong positioning in healthcare services and potential for 50% CAGR in earnings over FY24-27. Jefferies also initiated coverage with a 'Buy' rating and Rs 52 target price.",
            "Sentiment": "positive",
            "PublishDate": 1735187669000,
            "Source": "normal_news"
        },
        {
            "Title": "Sagility India: JP Morgan Initiates Coverage with 16% Upside Potential",
            "Summary": "JP Morgan initiates coverage on Sagility India with an 'Overweight' rating and a target price of Rs 54, indicating a 16% upside. The stock soared 5% to Rs 48.91 on BSE. JP Morgan cites Sagility's strong position in healthcare services, stable growth outlook, and potential to benefit from US healthcare outsourcing trends. The firm projects a 50% CAGR in earnings over FY24-27.",
            "Sentiment": "positive",
            "PublishDate": 1735017828000,
            "Source": "normal_news"
        },
        {
            "Title": "Sagility India: Share Price Fluctuates After Hitting Post-Listing High",
            "Summary": "Sagility India's stock price initially fell after reaching its highest level since listing, but later recovered, rising up to 4.05% to Rs 47 per share. The company has seen a 53% gain since its market debut last month. Jefferies recently initiated coverage with a 'buy' rating and a target of Rs 52, citing Sagility's strong position in US Healthcare BPM and potential for double-digit growth.",
            "Sentiment": "positive",
            "PublishDate": 1734931106000,
            "Source": "normal_news"
        },
        {
            "Title": "Sagility India: Jefferies Initiates Coverage with 18% Upside Potential",
            "Summary": "Jefferies initiates coverage on Sagility India with a 'buy' rating and Rs 52 target price, indicating 18% upside. The stock hit a new all-time high of Rs 46.09. Jefferies projects 12% revenue CAGR and 40% PAT CAGR over FY25-27, citing strong positioning for consistent double-digit growth, normalization of D&A costs, and deleveraging benefits.",
            "Sentiment": "positive",
            "PublishDate": 1734669868000,
            "Source": "normal_news"
        },
        {
            "Title": "Sagility India: Share Price Surges 48% Since Listing, Q2 Profit Soars 236%",
            "Summary": "Sagility India's stock hit its upper circuit for the fifth consecutive session, reaching Rs 43.48. The company reported a 236% year-on-year increase in Q2 net profit to Rs 117 crore, with revenue up 21.1% to Rs 1,325 crore. EBITDA rose 28.2% to Rs 300 crore, with margins improving to 22.6%.",
            "Sentiment": "positive",
            "PublishDate": 1733807353000,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India Plans to Repay 8 Billion Rupees Debt by FY27",
            "Summary": "Sagility India has announced its intention to repay approximately 8 billion rupees of debt within the next two years, by the fiscal year 2027. This information was shared in the company's investor presentation, indicating a strategic plan for debt reduction.",
            "Sentiment": "positive",
            "PublishDate": 1732691514000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sagility India: Stock Surges 10% for Second Day Post Strong Q2 Results",
            "Summary": "Sagility India's shares hit a new all-time high of ₹34.69, up 10% for the second consecutive day following impressive Q2FY25 results. The company reported a 236% YoY increase in PAT to ₹117.34 crore and a 21% YoY revenue growth to ₹1,325 crore. EBITDA grew by 20.3% YoY, though the margin slightly decreased to 23.9%.",
            "Sentiment": "positive",
            "PublishDate": 1732682390000,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India: Stock Surges 10% on Strong Q2 Results",
            "Summary": "Sagility India's share price hit the 10% upper circuit at ₹31.52 on BSE following a 31% YoY increase in Q2FY25 adjusted PAT.",
            "Sentiment": "positive",
            "PublishDate": 1732606908000,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India Reports Strong Q2 Revenue Growth",
            "Summary": "Sagility India has announced its second-quarter revenue for the current fiscal year. The company reported revenue of 13.2 billion rupees, compared to 10.9 billion rupees in the same quarter of the previous year, representing a significant year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1732592605000,
            "Source": "earnings"
        },
        {
            "Title": "Sagility India Reports Significant Increase in Q2 Consolidated Net Profit",
            "Summary": "Sagility India has announced its financial results for the second quarter, reporting a consolidated net profit of 1.17 billion rupees. This marks a substantial increase from the 349.61 million rupees reported in the same period last year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1732592589000,
            "Source": "earnings"
        }
    ]
}