{
    "Symbol": "SAHAJSOLAR",
    "ISIN": "INE0P4701011",
    "News": [
        {
            "Title": "Sahaj Solar Reports 11.22% Revenue Growth in 9M FY25",
            "Summary": "Sahaj Solar Limited achieved revenue of ₹19,821.38 lakhs for nine months ending December 31, 2025, marking an 11.22% year-on-year growth driven by strong fundamentals and strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1767762209296,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sahaj Solar Signs 25-Year RESCO Deal with UP Agency",
            "Summary": "Sahaj Solar Limited enters into a 25-year Renewable Energy Service Company agreement with Uttar Pradesh Renewable Energy Development Agency for solar systems ranging from 200-2000 KW capacity.",
            "Sentiment": "positive",
            "PublishDate": 1766490640335,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sahaj Solar Secures ₹125 Cr IREDA Loan for Solar Projects",
            "Summary": "Sahaj Solar Limited has completed a ₹125 crore loan agreement with IREDA to fund PM-KUSUM solar pump and off-grid initiatives across four states, strengthening its renewable energy portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1766467337267,
            "Source": "stocks"
        },
        {
            "Title": "Sahaj Solar Secures ₹57 Crore Order",
            "Summary": "Sahaj Solar has received an order worth ₹57 crore. The company's market capitalization stands at ₹533 crore.",
            "Sentiment": "positive",
            "PublishDate": 1755065470160,
            "Source": "order&deals"
        },
        {
            "Title": "Sahaj Solar Reports Doubled Profit in H2",
            "Summary": "Sahaj Solar has announced its financial results for the second half of the fiscal year. The company's consolidated net profit has significantly increased to 228 million rupees, compared to 113 million rupees in the same period last year, representing a 101.8% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1745477234000,
            "Source": "result"
        },
        {
            "Title": "Sahaj Solar Reports Significant Revenue Growth for FY 2024-25",
            "Summary": "Sahaj Solar has announced its financial results for the fiscal year 2024-25. The company's standalone sales have reached ₹307.47 crore, marking a substantial year-over-year growth of 71.45%.",
            "Sentiment": "positive",
            "PublishDate": 1744011709000,
            "Source": "earnings"
        },
        {
            "Title": "Sahaj Solar Forecasts 30% Revenue Growth and 12% Margin Over Next 3 Years",
            "Summary": "Sahaj Solar has announced its financial projections for the next three years. The company estimates a compound annual growth rate (CAGR) of 30% in revenue over this period. Additionally, Sahaj Solar expects to maintain a margin of 12% during the same timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1739422547000,
            "Source": "earnings"
        },
        {
            "Title": "Sahaj Solar Announces Massive Capacity Expansion Plans",
            "Summary": "Sahaj Solar has revealed ambitious expansion plans, aiming to increase its solar power generation capacity from 100 MW to 1600 MW by the fiscal year 2026. The company also disclosed that its upcoming projects, totaling 51.4 MW, are expected to be completed by FY26.",
            "Sentiment": "positive",
            "PublishDate": 1739422365000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sahaj Solar Secures 47 Crore Rupee Order",
            "Summary": "Sahaj Solar, a company with a market capitalization of 604 crore rupees, has won an order worth 47 crore rupees. The company is classified as a Small and Medium Enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1736136653000,
            "Source": "order&deals"
        },
        {
            "Title": "Sahaj Solar Secures 36 Crore Rupee Order",
            "Summary": "Sahaj Solar, a company in the solar energy sector, has won a new order worth 36 crore rupees (approximately $4.3 million USD). This order represents a significant business opportunity for the company, potentially boosting its revenue and market position in the solar industry.",
            "Sentiment": "positive",
            "PublishDate": 1735791474000,
            "Source": "order&deals"
        },
        {
            "Title": "Sahaj Solar Secures 1500 MW Solar Module Order",
            "Summary": "<p><span class='positive'>Sahaj Solar</span> has received an order for <b>1500 MW</b> of solar modules. The initial phase includes <b>750 MW</b>, with the remaining <b>750 MW</b> scheduled for commissioning after <span class='neutral'>Q2 2025</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728023176000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sahaj Solar to Set Up 1.5 GW Solar Module Production Line",
            "Summary": "<p><span class=\"positive\">Sahaj Solar</span> has engaged in <span class=\"neutral\">discussions</span> with <span class=\"positive\">Cliantech Solutions and Technologies LLP</span> to establish a <b>1.5 GW solar module production line</b>. This move indicates Sahaj Solar's <span class=\"positive\">intent to expand</span> its <span class=\"neutral\">manufacturing capabilities</span> in the <span class=\"positive\">solar energy sector</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728023116000,
            "Source": "corporate_action"
        }
    ]
}