{
    "Symbol": "SAHASRA",
    "ISIN": "INE0RBQ01018",
    "News": [
        {
            "Title": "Sahasra Electronic Solutions Reports Strong H1 Performance with 205% Jump in Net Profit",
            "Summary": "Sahasra Electronic Solutions delivered robust H1 results with net profit surging to 58M rupees from 19M rupees year-on-year, while revenue grew to 606M rupees from 463M rupees. EBITDA increased to 106M rupees from 81M rupees, though EBITDA margin remained stable at 17.44% compared to 17.47% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1763136919100,
            "Source": "earnings"
        },
        {
            "Title": "ED Files Money Laundering Charges Against Sahara Group Officials",
            "Summary": "The Enforcement Directorate filed a prosecution complaint under the Prevention of Money Laundering Act against Sahara Group on September 6. Two individuals, Jitendra Prasad Verma and Anil Vilaparampil Abraham, were arrested and named as accused for allegedly facilitating secret disposal of Sahara Group properties through cash transactions. The investigation revealed that properties acquired through public deposits were being disposed of secretly. ED alleges Sahara Group operated a Ponzi scheme, manipulating accounts and siphoning depositor money for personal use. The probe stems from over 500 FIRs across states, with more than 300 involving scheduled offences. ED has issued four Provisional Attachment Orders on benami assets. Meanwhile, Sahara Group deposited Rs 16,138 crore in a refund account, with Rs 5,000 crore allocated for depositor refunds. Over Rs 5,000 crore has been refunded to more than 27 lakh depositors. The Supreme Court permitted an additional Rs 5,000 crore disbursal for refunds, while Rs 19,533 crore remains in the account for eligible depositors.",
            "Sentiment": "negative",
            "PublishDate": 1757953419055,
            "Source": "corporate_governance"
        }
    ]
}