{
    "Symbol": "SAHYADRI",
    "ISIN": "INE280H01015",
    "News": [
        {
            "Title": "Sahyadri Industries Q3FY26 Net Profit Jumps 554%",
            "Summary": "Sahyadri Industries reported strong Q3FY26 results with net profit rising 554% to ₹4.97 crores and revenue growing 11.11% to ₹144.16 crores compared to Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770811154182,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sahyadri Industries Extends Commercial Operation Date to March 2026",
            "Summary": "Sahyadri Industries Limited has extended the completion timeline for its acquisition and commercial operations to March 31, 2026, citing delays in project execution by Emerge Solar One Private Limited. The company has informed BSE and NSE about this revised timeline following previous communications regarding the project's progress.",
            "Sentiment": "negative",
            "PublishDate": 1764392030716,
            "Source": "stock"
        },
        {
            "Title": "Sahyadri Industries Reports 18.3% Revenue Growth in Q2FY26 Despite Margin Pressures",
            "Summary": "Sahyadri Industries Limited reported total income growth of 18.3% year-on-year to Rs 126.3 crores in Q2FY26, with profit after tax surging 40.4% to Rs 2.7 crores. The company experienced margin pressures due to a stronger US dollar leading to higher imported fiber costs and delayed monsoon withdrawal affecting sales. EBITDA remained flat at Rs 10.3 crores with margins declining to 8.2% from 9.6% in the previous year. For H1FY26, total income grew 5.5% to Rs 342.4 crores while PAT decreased 6.5% to Rs 13.5 crores. Capacity utilization stood at 73% for H1FY26. The company is expanding with new manufacturing units in Orissa for asbestos corrugated sheets (Rs 95 crores capex) and Maharashtra for non-asbestos cement boards (Rs 95 crores capex). Sahyadri operates 5 plants across 4 states with a distribution network of 3,000+ dealers and has served 1 million customers across 54 countries.",
            "Sentiment": "neutral",
            "PublishDate": 1762468863815,
            "Source": "earnings"
        },
        {
            "Title": "Sahyadri Industries Reports Quarterly Financial Results and Expansion Plans",
            "Summary": "Sahyadri Industries Limited announced its unaudited financial results for the quarter ended September 30, 2025. The company reported total income of Rs 126.34 crores compared to Rs 106.81 crores in the previous quarter. Net profit stood at Rs 2.71 crores versus Rs 10.75 crores in the prior quarter. Earnings per share decreased to Rs 2.48 from Rs 9.84 in the previous quarter. The company operates in two segments: Building Material and Power Generation. Sahyadri Industries is expanding operations with a new unit in Odisha for manufacturing Asbestos Corrugated Sheets with capacity of 1,20,000 MT, and another unit in Maharashtra for Non Asbestos Cement Boards with capacity of 72,000 MT. Land acquisition for the Maharashtra facility is in process. The results were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1761911373710,
            "Source": "earnings"
        },
        {
            "Title": "Sahyadri Industries Reports Mixed Q1 Results with Revenue Decline and Margin Pressure",
            "Summary": "Sahyadri Industries Limited, an asbestos-based roofing manufacturer, reported total income of Rs. 216.1 crores for Q1, down 0.8% year-over-year but up 41.6% quarter-over-quarter. EBITDA declined 12.7% annually to Rs. 21.7 crores with margins compressing to 10.1% from 11.4% in the previous year. Profit after tax fell 13.8% year-over-year to Rs. 10.8 crores. The company improved capacity utilization to 93% from 89% in the prior year quarter, though sales were impacted by early monsoon and subdued roofing demand. The company faces challenges from elevated input costs for imported asbestos fiber, supply chain disruptions, and currency depreciation. Management plans a Rs. 100 crore capacity expansion in Palghar expected to add Rs. 125 crores to revenue, with completion now targeted for Q4 FY'27. The company anticipates 8-10% topline growth for FY'26 with improving margins compared to FY'25.",
            "Sentiment": "neutral",
            "PublishDate": 1755596822868,
            "Source": "earnings"
        },
        {
            "Title": "Sahyadri Industries Reports Q1FY26 Results with Total Income of ₹216.1 Crore",
            "Summary": "Sahyadri Industries Limited reported total income of ₹216.1 crore for Q1FY26, declining 0.8% year-over-year but increasing 41.6% quarter-over-quarter. EBITDA stood at ₹21.7 crore with a margin of 10.1%, down 12.7% year-over-year but up 56.7% quarter-over-quarter. Profit after tax was ₹10.8 crore, declining 13.8% year-over-year but surging 152.2% quarter-over-quarter. Managing Director Satyen Patel noted the performance was affected by weak demand and pricing pressures. Capacity utilization improved to 93% in Q1FY26 from 89% in Q1FY25. The company operates as a building solutions pioneer offering roofing and interior/exterior building systems. Sahyadri is expanding with two new manufacturing units - one in Orissa for asbestos corrugated sheets (120,000 MTPA capacity) and another in Maharashtra for non-asbestos cement boards (72,000 MTPA capacity), each requiring ₹95 crore investment.",
            "Sentiment": "neutral",
            "PublishDate": 1754990519785,
            "Source": "earnings"
        },
        {
            "Title": "Sahyadri Industries Reports Net Profit of ₹10.77 Crores in Q1, Down from ₹12.49 Crores Year-Over-Year",
            "Summary": "Sahyadri Industries Limited reported quarterly results with total income of ₹216.09 crores compared to ₹217.74 crores in the same quarter last year. Net profit decreased to ₹10.77 crores from ₹12.49 crores year-over-year, while showing improvement from ₹4.27 crores in the previous quarter. Sales from operations stood at ₹214.19 crores versus ₹216.67 crores in the prior year quarter. The company operates in two segments - Building Materials (₹212.25 crores revenue) and Power Generation (₹4.16 crores revenue). Earnings per share was ₹9.84 compared to ₹11.41 in the same quarter last year. The company is expanding with a new 1,20,000 MT Asbestos Corrugated Sheet unit in Odisha and a 72,000 MT Non Asbestos Cement Boards plant in Maharashtra. The results were reviewed by statutory auditors who issued an unmodified review report.",
            "Sentiment": "neutral",
            "PublishDate": 1754662573262,
            "Source": "earnings"
        },
        {
            "Title": "Sahyadri Industries Sets Record Date for 31st AGM and Final Dividend Payment",
            "Summary": "Sahyadri Industries Limited has announced key dates for its 31st Annual General Meeting and final dividend payment for FY 2024-25. The company's Board of Directors recommended a final dividend of INR 1 per equity share of face value INR 10, subject to shareholder approval at the upcoming AGM. The record date is set for August 15, 2025, with book closure period from August 16 to August 22, 2025. The dividend payment is scheduled for September 16, 2025. Shareholders holding shares on the record date will be eligible for the dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1753786498432,
            "Source": "corporate_action"
        },
        {
            "Title": "Sahyadri Industries Reports 4.6% Revenue Decline Despite Debt Reduction Progress",
            "Summary": "Sahyadri Industries Limited reported total income of Rs 608.8 crore for FY25, down 4.6% from previous year, with net profit falling to Rs 19.46 crore from Rs 26.37 crore. The company faced margin pressures due to subdued demand conditions and pricing challenges in domestic markets. However, the company improved its debt-to-equity ratio from 0.32 to 0.21 through debt repayment and reduced finance costs. Capacity utilization stood at 68% for FY25. The Board proposed a final dividend of Re 1 per equity share and recommended re-appointment of executive directors for three-year terms.",
            "Sentiment": "neutral",
            "PublishDate": 1753785407405,
            "Source": "earnings"
        },
        {
            "Title": "Sahyadri Industries Extends Power Purchase Agreement Commercial Operation Date to November 2025",
            "Summary": "Sahyadri Industries Limited has amended its Power Purchase Agreement, extending the Commercial Operation date to November 30, 2025, or a mutually agreed date. The revised agreement is dated July 21, 2025, replacing the original agreement from November 8, 2024. The company has notified stock exchanges BSE and NSE about this extension.",
            "Sentiment": "neutral",
            "PublishDate": 1753160826593,
            "Source": "stock"
        },
        {
            "Title": "Sahyadri Industries Acquires Stake in Solar Power Company",
            "Summary": "Sahyadri Industries has approved the acquisition of a 26% stake in Emerge Solar One Private Limited (ESOPL) for 12.8 million rupees. ESOPL is engaged in the business of solar power generation. This acquisition is aimed at facilitating solar power purchase for Sahyadri Industries.",
            "Sentiment": "positive",
            "PublishDate": 1731073493000,
            "Source": "corporate_action"
        }
    ]
}