{
    "Symbol": "SAILIFE",
    "ISIN": "INE570L01029",
    "News": [
        {
            "Title": "Sai Life Sciences Q3FY26 Profit Surges 91% YoY",
            "Summary": "Sai Life Sciences reported strong Q3FY26 results with revenue rising 28.14% YoY to Rs. 5,491.79 million and net profit jumping 91.22% YoY to Rs. 976.30 million, despite exceptional charges.",
            "Sentiment": "positive",
            "PublishDate": 1770309293168,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sai Life Sciences Partners With Mabtech",
            "Summary": "Sai Life Sciences announces strategic partnership with Mabtech to enhance immunology research capabilities, establishes Boston laboratory as US hub for Eyra platform, and expands advanced immunology assay services.",
            "Sentiment": "positive",
            "PublishDate": 1769595427083,
            "Source": "stocks"
        },
        {
            "Title": "Sai Life Sciences Q3FY26 Earnings Call on Feb 6",
            "Summary": "Sai Life Sciences schedules earnings conference call for February 6, 2026 at 4:00 PM IST to discuss Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769583231923,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sai Life Sciences receives warning letters from BSE, NSE",
            "Summary": "Sai Life Sciences Limited received warning letters from BSE and NSE for not holding mandatory Stakeholders' Relationship Committee meetings during FY2024-25, citing short duration between listing date and year-end.",
            "Sentiment": "negative",
            "PublishDate": 1767788702058,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Sets Overweight Rating on Sai Life",
            "Summary": "Morgan Stanley maintains overweight rating on Sai Life Sciences with target price of ₹1,020, reflecting positive outlook on the pharmaceutical company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1766375353691,
            "Source": "stocks"
        },
        {
            "Title": "Sai Life Sciences Releases FY25 Sustainability Report",
            "Summary": "Sai Life Sciences Limited released its sixth sustainability report for FY25, aligned with GRI and SASB standards. The report highlights progress in climate action, renewable energy usage, and community impact initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1766128023699,
            "Source": "stocks"
        },
        {
            "Title": "Sai Life Sciences Allots 1.07 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "Sai Life Sciences Limited allotted 1,07,331 equity shares of Re. 1 each upon exercise of stock options under ESOP 2008 and MESOP 2018 plans on December 8, 2025. The allotment includes 27,500 shares at Rs. 188.90 per share and 79,831 shares at Rs. 23.30 per share, increasing total issued share capital to 21.03 crore shares.",
            "Sentiment": "neutral",
            "PublishDate": 1765205326714,
            "Source": "corporate_action"
        },
        {
            "Title": "Sai Life Sciences Faces GST Demand of ₹4.62 Crore from Karnataka Tax Authority",
            "Summary": "Sai Life Sciences received a GST demand order totaling ₹10.67 crore including interest and penalties for alleged excess ITC availment and discrepancies in B2B supply records for FY 2020-21. The company plans to file an appeal and expects a favorable outcome at the tribunal level with no material financial impact anticipated.",
            "Sentiment": "negative",
            "PublishDate": 1765183586122,
            "Source": "stock"
        },
        {
            "Title": "Sai Life Sciences Allots 62,991 Equity Shares Under Employee Stock Option Plans",
            "Summary": "Sai Life Sciences allotted 62,991 equity shares of Re. 1 each upon exercise of options under ESOP 2008 (17,991 shares at Rs. 188.90) and MESOP 2018 (45,000 shares at Rs. 127.30) on November 22, 2025. The allotment increases the company's total issued share capital to 210,234,752 shares, providing incentives to retain and reward employees while contributing to company growth.",
            "Sentiment": "positive",
            "PublishDate": 1763878421457,
            "Source": "corporate_action"
        },
        {
            "Title": "Sai Life Sciences Faces INR 36.68 Crore GST Demand from Karnataka Tax Authority",
            "Summary": "Joint Commissioner of Commercial Taxes issued an order demanding INR 20.85 crore in IGST, INR 13.75 crore in interest, and INR 2.08 crore in penalty from Sai Life Sciences for alleged non-payment of taxes on intermediary services from US subsidiary during July 2017 to March 2022. The company plans to appeal the order and expects no material financial impact, believing it will receive a favorable outcome at the tribunal level.",
            "Sentiment": "negative",
            "PublishDate": 1763626207376,
            "Source": "stock"
        },
        {
            "Title": "Sai Life Sciences Releases Earnings Call Transcript for Q2 Results",
            "Summary": "Sai Life Sciences Limited has released the transcript of its earnings call for unaudited financial results for the quarter and half year ended September 30, 2025. The earnings call was held on November 7, 2025, and the transcript has been made available on the company's website and submitted to stock exchanges.",
            "Sentiment": "negative",
            "PublishDate": 1763103421055,
            "Source": "stock"
        },
        {
            "Title": "Sai Life Sciences Plans to Recruit 200 Scientists in November 2025",
            "Summary": "Sai Life Sciences Limited announced plans to recruit 200 scientists in November 2025 to meet growing demand for its Discovery and CMC services. The company will conduct walk-in interviews in Bengaluru on November 15-16, 2025, at Sai Vishram Business Hotel from 9:00 a.m. to 5:00 p.m. Open positions span multiple scientific functions including Process R&D, Analytical R&D, Process Engineering, Biology, and DMPK. The company seeks candidates with qualifications in organic chemistry, life sciences, chemical engineering, and related fields, with 2-14 years of experience. The hiring drive supports the company's expansion across global operations, including a new CMC Process R&D Center at its Hyderabad campus scheduled for completion by September 2026. Sai Life Sciences currently employs over 3,400 professionals and partners with more than 300 global innovators, including 18 of the top 20 pharmaceutical companies.",
            "Sentiment": "positive",
            "PublishDate": 1762841925062,
            "Source": "stock"
        },
        {
            "Title": "Sai Life Sciences Reports Strong Q2 Performance with Net Profit Doubling Year-on-Year",
            "Summary": "Sai Life Sciences reported consolidated net profit of 838 million rupees for Q2, representing a significant increase from 415 million rupees in the same quarter last year. The company's revenue also grew substantially to 5.4 billion rupees compared to 3.95 billion rupees year-on-year. The results show strong financial performance across both profitability and revenue metrics.",
            "Sentiment": "positive",
            "PublishDate": 1762440319746,
            "Source": "earnings"
        },
        {
            "Title": "Sai Life Sciences Allots 2.5 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "Sai Life Sciences Limited has allotted 2,49,969 fully paid-up equity shares of Re. 1 each following the exercise of stock options under two employee plans. The allotment includes 19,995 shares under ESOP 2008 at an exercise price of Rs. 188.90 per share and 2,29,974 shares under MESOP 2018 at exercise prices of Rs. 23.30 and Rs. 127.30 per share for different tranches. The Board of Directors approved the allotment through a circular resolution dated November 4, 2025. Following this allotment, the company's total issued share capital stands at 210,171,761 shares. The ESOP plans are designed to attract, retain and reward employees with a maximum vesting period of 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1762283096250,
            "Source": "corporate_action"
        },
        {
            "Title": "Sai Life Sciences Announces New CMC Process R&D Center in Hyderabad to Double Capacity",
            "Summary": "Sai Life Sciences Limited announced the groundbreaking of a new CMC Process R&D Center at its integrated R&D campus in Hyderabad. The facility is expected to be operational by September 2026 and will double the company's Process R&D capacity. The new center will span 100,000 sq. ft. across five floors and include 140 process chemistry fume hoods, dedicated laboratories for peptides and oligo intermediates & linkers, a 25,000 sq. ft. centralized analytical laboratory, and early-phase clinical supply capabilities. The facility will introduce new capabilities in peptide development, oligo intermediates & linkers, formulation development, and early-phase clinical supplies. The investment is part of the company's planned capital expenditure, driven by increasing demand for late-stage development programs and scalable CMC capacity. CEO Krishna Kanumuri stated the expansion aims to enhance the company's ability to combine scientific excellence with execution agility as partners seek greater speed and flexibility.",
            "Sentiment": "positive",
            "PublishDate": 1761560061127,
            "Source": "stock"
        },
        {
            "Title": "Sai Life Sciences Opens Dedicated Veterinary API Manufacturing Facility in Bidar",
            "Summary": "Sai Life Sciences opened Unit VI, a dedicated facility for veterinary API production, in Bidar, India on September 18, 2025. The facility is located alongside Unit IV, the company's flagship API manufacturing site. The new facility is designed to meet high standards of safety, sustainability, and regulatory compliance for producing veterinary APIs. The expansion aims to provide scalable manufacturing solutions to global animal health companies. CEO Krishna Kanumuri stated the investment strengthens the company's ability to meet growing global demand for veterinary pharmaceuticals while maintaining standards of innovation, efficiency, and sustainability. The facility leverages advanced technologies and supply chain management for reliable manufacturing of animal health APIs.",
            "Sentiment": "positive",
            "PublishDate": 1758193680776,
            "Source": "stock"
        },
        {
            "Title": "SAI Life Sciences Completes Phase II Expansion of Production Block 11 in Bidar",
            "Summary": "SAI Life Sciences has completed Phase II of its Production Block 11 facility in Bidar, India. The completion has increased the company's production capacity to 700 KL.",
            "Sentiment": "positive",
            "PublishDate": 1756367791703,
            "Source": "stock"
        },
        {
            "Title": "Goldman Sachs and Societe Generale Acquire Shares in Sai Lifescience Through Open Market",
            "Summary": "Goldman Sachs acquired 1.1 million shares of Sai Lifescience through open market transactions. Societe Generale acquired 1.4 million shares of the company through similar open market transactions.",
            "Sentiment": "positive",
            "PublishDate": 1756223834001,
            "Source": "order&deals"
        },
        {
            "Title": "TPG Asia Plans ₹2,500 Crore Exit from Sai Life Sciences Through Block Deal",
            "Summary": "TPG Asia is preparing to sell its entire 14.72% stake in Sai Life Sciences through a block deal valued at ₹2,500 crore. The sale involves 3.07 crore shares with a floor price of ₹860 per share, representing a 5% discount to the last closing price. Sai Life Sciences, a Hyderabad-based contract research and manufacturing organization, reported strong quarterly performance with profit after tax of ₹60 crore compared to a ₹13 crore loss in the previous year. Revenue from operations increased 77% year-on-year to ₹496 crore, driven by 113% growth in the CDMO segment and 38% growth in Discovery revenues. EBITDA margins expanded significantly to 25% from 11% previously. The company has projected revenue growth of 15-20% annually over the next three to five years with margin expansion targets of 24-30%. Shares closed at ₹905.90, down 2.16%.",
            "Sentiment": "neutral",
            "PublishDate": 1756133245172,
            "Source": "order&deals"
        },
        {
            "Title": "Sai Life Sciences Releases Earnings Call Transcript for Q1 Results",
            "Summary": "Sai Life Sciences Limited has made available the transcript of its earnings call discussing unaudited financial results for the quarter ended June 30, 2025. The earnings call was conducted on August 8, 2025, and the transcript has been posted on the company's website. The company is listed on both BSE and NSE exchanges. The filing represents the company's regulatory disclosure following the quarterly earnings discussion with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1755508908596,
            "Source": "earnings"
        },
        {
            "Title": "Sai Life Sciences Makes Earnings Call Recording Available for Quarter Ended June 30, 2025",
            "Summary": "Sai Life Sciences Limited announced the availability of the audio recording for their earnings call discussing unaudited financial results for the quarter ended June 30, 2025. The earnings call was held on August 8, 2025, at 4:00 PM IST. The recording has been uploaded to the company's website and is accessible via a direct link. The company notified both BSE and NSE stock exchanges about the recording availability.",
            "Sentiment": "neutral",
            "PublishDate": 1754662553860,
            "Source": "earnings"
        },
        {
            "Title": "Sai Life Sciences Reappoints Krishnamraju Kanumuri as Managing Director & CEO for Five-Year Term",
            "Summary": "Sai Life Sciences Limited's Board of Directors approved the reappointment of Krishnamraju Kanumuri as Managing Director & CEO for a five-year term from September 1, 2025 to August 31, 2030. The reappointment is subject to shareholder approval at the upcoming Annual General Meeting. Kanumuri, who has over 25 years of cross-industry experience, has been with the company since 2004 and led its transformation from a domestic service provider into a globally respected CRDMO. Under his leadership, the company achieved 25% revenue CAGR from 2022-2025, expanded its global footprint with R&D centers in Boston and Manchester, and completed its IPO in December 2024. Kanumuri is the son of Dr. K Ranga Raju, Chairman and Promoter of the company.",
            "Sentiment": "positive",
            "PublishDate": 1754593415281,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sai Life Sciences Reports Strong Q1 Performance, Reappoints CEO for 5-Year Term",
            "Summary": "Sai Life Sciences Limited's Board approved quarterly financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 4,830.38 million, up from Rs. 2,644.69 million in the same quarter last year. Profit after tax increased to Rs. 583.70 million compared to a loss of Rs. 113.79 million in the previous year quarter. On a consolidated basis, revenue from operations reached Rs. 4,964.19 million versus Rs. 2,797.23 million in the corresponding quarter. The Board reappointed Mr. Krishnamraju Kanumuri as Managing Director & CEO for a 5-year term effective September 1, 2025, subject to shareholder approval. The company scheduled its 26th Annual General Meeting for September 11, 2025, via video conferencing. Earnings per share improved to Rs. 2.80 on standalone basis and Rs. 2.90 on consolidated basis. The company operates in the Contract Research, Development and Manufacturing (CRDMO) segment.",
            "Sentiment": "positive",
            "PublishDate": 1754588972833,
            "Source": "earnings"
        },
        {
            "Title": "Sai Life Sciences Schedules Q1FY26 Earnings Conference Call for August 8, 2025",
            "Summary": "Sai Life Sciences has scheduled an earnings conference call on August 8, 2025, at 4:00 PM IST to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The call will include a management discussion and an interactive Q&A session. The company's Managing Director & CEO Krishna Kanumuri and Director & CFO Siva Chittor will represent management during the call. Sai Life Sciences is a Contract Research, Development, and Manufacturing Organization (CRDMO) headquartered in Hyderabad that partners with pharmaceutical and biotech companies.",
            "Sentiment": "neutral",
            "PublishDate": 1753268199984,
            "Source": "earnings"
        },
        {
            "Title": "Sai Life Sciences Schedules Board Meeting for August 7 to Approve Quarterly Financial Results",
            "Summary": "Sai Life Sciences Limited has scheduled a Board of Directors meeting for August 7, 2025, to review and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure for directors, officials, and designated persons from July 1, 2025, through August 9, 2025, under its insider trading code of conduct.",
            "Sentiment": "neutral",
            "PublishDate": 1753160342806,
            "Source": "corporate_action"
        },
        {
            "Title": "Sai Life Sciences: TPG Sells Rs 1,505 Crore Stake in Block Deals",
            "Summary": "TPG sold over 2 crore shares of Sai Life Sciences at Rs 722 per share. Norges Bank acquired 11.5 lakh shares, while Indian mutual funds including Nippon, Invesco, and Aditya Birla Sun Life also participated. The stock rallied 5% post-deal, closing at Rs 765.85 on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1750433519000,
            "Source": "block_deals"
        },
        {
            "Title": "SAI Life Sciences Starts Commercial Operations at Bidar Unit IV",
            "Summary": "SAI Life Sciences has commenced commercial operations for phase two at its Bidar Unit IV facility. This expansion has increased the company's total capacity to 640 KL. The news indicates a significant expansion in the company's production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1750401921000,
            "Source": "default"
        },
        {
            "Title": "Sai Life Sciences: 10% Equity Changes Hands in Block Deal",
            "Summary": "A block deal involving 10% equity (2.08 crore shares) of Sai Life Sciences occurred. TPG Asia, holding 24.73% stake, is likely selling 6% (12.5 million shares) at ₹710 per share, totaling $102 million. The company projects 15-20% revenue CAGR over 3-5 years with margin increase from 24% to 30%.",
            "Sentiment": "neutral",
            "PublishDate": 1750392145000,
            "Source": "block_deals"
        },
        {
            "Title": "Sai Life Sciences: TPG Asia to Sell 6% Stake for $102 Million",
            "Summary": "TPG Asia plans to sell a 6% stake in Sai Life Sciences through block deals. The sale involves 12.5 million shares at ₹710 per share, a 2.5% discount to the current market price. The deal is valued at approximately $102 million with a 60-day lock-in period for the seller post-transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1750340703000,
            "Source": "block_deals"
        },
        {
            "Title": "Sai Life Sciences: Targets 15-20% Annual Growth, Margin Expansion",
            "Summary": "Sai Life Sciences aims for 15-20% CAGR in revenues over 3-5 years, with margin increase from 24% to 30%. Q4FY25 revenue was ₹579 crore with 27.2% margins. The company sees opportunities in diversification from China due to US pricing uncertainties.",
            "Sentiment": "positive",
            "PublishDate": 1747205271000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Life Sciences to Consider Q4 Results on May 13",
            "Summary": "Sai Life Sciences has announced that it will consider its fourth quarter results on May 13. This indicates the company is preparing to disclose its financial performance for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746532834000,
            "Source": "default"
        },
        {
            "Title": "Sai Life Sciences Establishes Peptide Research Center in India",
            "Summary": "Sai Life Sciences, a pharmaceutical company, has set up a new Peptide Research Center in India. This development indicates an expansion of the company's research capabilities and a potential focus on peptide-based drug discovery and development.",
            "Sentiment": "positive",
            "PublishDate": 1743725092000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sai Life Sciences Establishes Peptide Research Center in India",
            "Summary": "Sai Life Sciences has announced the establishment of a new Peptide Research Center in India. This development signifies the company's expansion into peptide research and development capabilities, potentially enhancing its position in the pharmaceutical and biotechnology sectors.",
            "Sentiment": "positive",
            "PublishDate": 1743692681000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sai Life Sciences Reports Bullish Business Prospects",
            "Summary": "CNBC TV18 reports that Sai Life Sciences, a contract research and manufacturing services company, is experiencing extremely positive business prospects. The news suggests a strong outlook for the company's future performance and growth potential in the pharmaceutical and biotechnology sectors.",
            "Sentiment": "positive",
            "PublishDate": 1741854012000,
            "Source": "normal_news"
        },
        {
            "Title": "Sai Life Sciences Reports Strong Q3 EBITDA Growth",
            "Summary": "Sai Life Sciences has reported a significant increase in its Q3 EBITDA, rising to 1.2 billion rupees from 963 million rupees in the same period last year. The company's EBITDA margin also improved, reaching 27.23% compared to 25.11% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738860953000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Life Sciences Reports Q3 Revenue Growth",
            "Summary": "Sai Life Sciences announced its third quarter revenue of 4.4 billion rupees, compared to 3.84 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738860947000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Life Sciences Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Sai Life Sciences announced its Q3 consolidated net profit of 538.5 million rupees, showing a year-over-year increase from 396 million rupees and a quarter-over-quarter increase from 415 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1738860942000,
            "Source": "earnings"
        },
        {
            "Title": "Sai Life Sciences: Morgan Stanley Initiates Coverage with Positive Outlook",
            "Summary": "Morgan Stanley initiates coverage on Sai Life Sciences, citing cost advantages and global supply chain diversification. The brokerage expects 17% revenue CAGR, 32% Ebitda CAGR, and sets a target price of Rs 841. Sai's end-to-end 'follow the molecule' strategy and presence in innovation hubs are highlighted as strengths.",
            "Sentiment": "positive",
            "PublishDate": 1737610728000,
            "Source": "normal_news"
        },
        {
            "Title": "Sai Life Sciences: Shares Close 40% Above IPO Price on Debut",
            "Summary": "Sai Life Sciences Ltd. shares ended their first trading day at Rs 768.4 on BSE and Rs 768 on NSE, representing a 39.9% and 39.8% premium respectively over the IPO price of Rs 549. The Rs 3,042-crore IPO was oversubscribed 10.26 times, with strong demand from institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1734517796000,
            "Source": "result"
        },
        {
            "Title": "Sai Life Sciences: Strong Market Debut with 18.4% Premium",
            "Summary": "Sai Life Sciences shares listed at ₹650 on NSE, an 18.4% premium over the IPO price of ₹549. The IPO, valued at ₹3,042.62 crore, was oversubscribed 10.27 times. The company specializes in small-molecule new chemical entity research and development.",
            "Sentiment": "positive",
            "PublishDate": 1734496234000,
            "Source": "normal_news"
        },
        {
            "Title": "Sai Life Sciences Shares Debut on NSE at 18.4% Premium",
            "Summary": "Sai Life Sciences, a pharmaceutical company, made its debut on the National Stock Exchange (NSE) of India. The shares opened at 650 rupees in pre-open trade, which is 18.4% higher than the initial public offering (IPO) price of 549 rupees.",
            "Sentiment": "positive",
            "PublishDate": 1734495812000,
            "Source": "corporate_action"
        }
    ]
}