{
    "Symbol": "SAIL",
    "ISIN": "INE114A01011",
    "News": [
        {
            "Title": "SAIL Q3 Net Profit Surges 167% to ₹3.74B",
            "Summary": "Steel Authority of India reports strong Q3 performance with net profit jumping to ₹3.74 billion from ₹1.4 billion year-on-year, while revenue grows 11.8% to ₹273.7 billion.",
            "Sentiment": "positive",
            "PublishDate": 1769782921875,
            "Source": "co_actions_results"
        },
        {
            "Title": "SAIL Schedules Q3FY26 Results Meet on Feb 2, 2026",
            "Summary": "Steel Authority of India Limited announces analyst and institutional investor meet on February 2, 2026 at 12:30 PM via conference call to discuss Q3FY26 and nine months financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1769515851551,
            "Source": "stocks"
        },
        {
            "Title": "SAIL Positioned to Benefit Most from Steel Price Rise",
            "Summary": "Analysis suggests Steel Authority of India Limited would gain the most compared to Tata Steel and JSW Steel if steel prices increase, according to Tijori Finance research.",
            "Sentiment": "positive",
            "PublishDate": 1769505679948,
            "Source": "stocks"
        },
        {
            "Title": "Morgan Stanley Downgrades SAIL to Underweight",
            "Summary": "Morgan Stanley has downgraded Steel Authority of India Limited (SAIL) from Equal Weight to Underweight rating, setting a target price of ₹140.00 per share.",
            "Sentiment": "negative",
            "PublishDate": 1768968100119,
            "Source": "stocks"
        },
        {
            "Title": "SAIL Shares Rise 2.34% as December Sales Hit Record High",
            "Summary": "SAIL shares gained 2.34% to Rs 150.85 after reporting best-ever December sales of 2.1 MT, up 37% YoY, with strong export growth and sustained fiscal momentum reaching 14.7 MT in April-December FY26.",
            "Sentiment": "positive",
            "PublishDate": 1767622416192,
            "Source": "stocks"
        },
        {
            "Title": "SAIL Records ₹28.41 Cr NSE Block Trade at ₹145.93",
            "Summary": "Steel Authority of India Ltd. witnessed a significant block trade on NSE worth ₹28.41 crores involving approximately 1,946,675 shares at ₹145.93 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767153759791,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Ministry Plans ₹400+ Crore Investment in SAIL's Salem Steel Plant",
            "Summary": "The Steel Ministry has announced plans to invest over ₹400 crore in Steel Authority of India Limited's Salem Steel Plant. This investment initiative affects SAIL's operations and represents a significant capital allocation for the state-owned steel manufacturer's facility expansion.",
            "Sentiment": "positive",
            "PublishDate": 1764126835124,
            "Source": "stock"
        },
        {
            "Title": "SAIL Reports 32% Jump in H1 Profit, Reduces Debt by Rs 3,000 Crores",
            "Summary": "Steel Authority of India Limited (SAIL) reported strong financial performance for H1 FY26. The company achieved a 32% increase in profit after tax to Rs 1,112 crores compared to the same period last year. Revenue from operations grew 8% to Rs 52,625 crores, while sales volume increased significantly by 17% to 9.46 million tons from 8.11 million tons in H1 FY25. EBITDA stood at Rs 5,754 crores with 3% growth. The company successfully reduced borrowings by over Rs 3,000 crores during the half-year period, bringing non-IndAS borrowings down to Rs 26,427 crores. SAIL maintained its production guidance of 18.5 million tons for FY26. The company reported higher realization from scrap and by-product sales of Rs 1,140 crores in Q2 versus Rs 869 crores in Q1. Management expects improved performance in Q3 and Q4 as capital repairs are completed and demand picks up post-monsoon and festive season. SAIL is progressing with its IISCO expansion project of 4.5 million tons capacity at Rs 36,000 crores, with major package orders being finalized.",
            "Sentiment": "positive",
            "PublishDate": 1762172351473,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Maintains 18.5 MT Sales Volume Target, Expects EBITDA Margin Improvement in Q4",
            "Summary": "Steel Authority of India Limited (SAIL) confirmed its sales volume target of 18.5 million tonnes remains unchanged. The company expects EBITDA margin to remain steady or show slight improvement in Q3, with a significant improvement to 14-15% projected for Q4. These updates were shared during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1761983135779,
            "Source": "stock"
        },
        {
            "Title": "SAIL Projects EBITDA Margin to Rise to 14-15% in Q4 from Current 9.46%",
            "Summary": "SAIL has projected its EBITDA margin will increase to 14-15% in Q4, representing a significant improvement from the current EBITDA margin of 9.46% reported in Q2. This projection indicates the company expects substantial margin expansion over the coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1761801989090,
            "Source": "stock"
        },
        {
            "Title": "SAIL Expects Demand Boost and Higher Sales Growth in FY27",
            "Summary": "SAIL anticipates a demand boost over the next two quarters. The company expects increased sales growth in FY27 compared to FY26, attributing this projected improvement to debottlenecking initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1761800348552,
            "Source": "stock"
        },
        {
            "Title": "SAIL Plans Margin Recovery Through Plant Upgrades and Value-Added Steel Focus",
            "Summary": "SAIL is implementing a strategy to recover margins through upgrades at its Bhilai and Bokaro facilities. The company is focusing on value-added steel growth and plans to re-enter export markets. SAIL aims to achieve cost efficiency, expand specialty steel production, and improve return on capital employed through a capex-led modernization plan.",
            "Sentiment": "positive",
            "PublishDate": 1761754360654,
            "Source": "stock"
        },
        {
            "Title": "SAIL Reports 44% Drop in Net Profit Despite Revenue Growth in Q2",
            "Summary": "Steel Authority of India Ltd. (SAIL) reported quarterly results showing mixed performance. Net profit declined 44% to Rs 419 crore from Rs 745 crore in the previous quarter, while revenue increased 3% to Rs 26,704 crore from Rs 25,922 crore. EBITDA fell 8.7% to Rs 2,528 crore compared to Rs 2,769 crore previously. The company's margin contracted to 9.5% from 10.7% in the preceding quarter. SAIL shares closed 4.32% higher at Rs 236.68 on the NSE, outperforming the benchmark Nifty which fell 0.29%. Three analysts maintain 'buy' ratings on the stock with an average 12-month price target suggesting 23.2% potential upside.",
            "Sentiment": "negative",
            "PublishDate": 1761747814761,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Q2 Results: Revenue Rises to 267B Rupees, Net Profit Falls to 4.2B Rupees",
            "Summary": "SAIL reported Q2 revenue of 267 billion rupees, up from 247 billion rupees year-over-year, exceeding estimates of 248.22 billion rupees. However, consolidated net profit declined to 4.2 billion rupees from 8.97 billion rupees year-over-year, though it surpassed estimates of 1.36 billion rupees. EBITDA decreased to 25.3 billion rupees from 29.13 billion rupees year-over-year but beat estimates of 19.95 billion rupees. EBITDA margin compressed to 9.46% from 11.81% year-over-year, still above the estimated 8.04%.",
            "Sentiment": "neutral",
            "PublishDate": 1761744443090,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Shares Surge 7% to 52-Week High Despite Weak Earnings Forecast",
            "Summary": "Steel Authority of India Ltd. (SAIL) shares gained over 7% to reach a fresh 52-week high of ₹142 ahead of quarterly results. A CNBC-TV18 poll forecasts mixed performance with revenue expected to increase marginally by 0.6% to ₹24,822 crore. However, operating profit is projected to decline 32% to ₹1,995 crore, with margins contracting to 8.04% from 11.81%. Net profit is estimated to fall sharply by 85% to ₹136 crore from ₹897 crore. The Street expects SAIL's volumes to increase by around 10%, but steel realisations are likely to contract due to seasonal price cuts and the company's higher proportion of long products. Lower coking coal prices provide partial offset to margin pressures. The stock has gained 22.2% over the past six months.",
            "Sentiment": "neutral",
            "PublishDate": 1761713155158,
            "Source": "stock"
        },
        {
            "Title": "SAIL Schedules Second Quarter Results Review for October 29",
            "Summary": "Steel Authority of India Limited (SAIL) has announced it will review its second quarter results on October 29. The company has set this date for examining its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1761284056960,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Executive Expects Mozambique Joint Venture Cooking Coal Supplies to Resume Soon",
            "Summary": "A co-executive at SAIL anticipates that cooking coal supplies from the company's Mozambique joint venture will restart within a few months. The executive's statement suggests the resumption of coal operations from this international partnership.",
            "Sentiment": "positive",
            "PublishDate": 1757330867052,
            "Source": "stock"
        },
        {
            "Title": "SAIL Supplies 8,000 Tonnes of Steel for Indian Navy's Advanced Frigates",
            "Summary": "State-owned SAIL supplied approximately 8,000 tonnes of critical-grade steel for the Indian Navy's advanced frontline frigates, INS Udaygiri and INS Himgiri. Defence Minister Rajnath Singh commissioned these multi-mission stealth frigates at the Eastern Naval Command in Visakhapatnam. The frigates are part of the Indian Navy's Project 17A, marking the first simultaneous commissioning of two frontline surface combatants built at different shipyards. SAIL sourced the materials from its steel plants in Bokaro, Bhilai, and Rourkela. The company stated this supply supports import substitution and defense self-reliance, contributing to 'Atmanirbhar Bharat' and 'Make in India' initiatives while reducing dependence on imported special quality steel for defense requirements. SAIL has previously supplied steel for various other naval vessels including INS Vikrant, INS Nilgiri, INS Ajay, INS Nistar, INS Arnala, INS Vindhyagiri, and INS Surat.",
            "Sentiment": "positive",
            "PublishDate": 1756217826278,
            "Source": "stock"
        },
        {
            "Title": "SAIL Releases Business Responsibility & Sustainability Report for FY 2024-25",
            "Summary": "Steel Authority of India Limited (SAIL) has published its Business Responsibility & Sustainability Report (BRSR) for FY 2024-25. The report covers the company's operations across integrated steel plants, special steel plants, mines, and various units. SAIL reported a paid-up capital of ₹41,305 crores and turnover of ₹1,01,716 crores with net worth of ₹55,656 crores. The company employs 53,159 permanent employees and 73,819 contract workers. Key sustainability initiatives include water recycling with Zero Liquid Discharge goals, waste management with 100% solid waste utilization targets, and greenhouse gas emission reduction plans. SAIL achieved specific energy consumption improvements and enhanced renewable energy capacity. The report demonstrates compliance with environmental regulations and outlines material sustainability issues including occupational health & safety, human rights, and business ethics.",
            "Sentiment": "neutral",
            "PublishDate": 1756122129004,
            "Source": "corporate_action"
        },
        {
            "Title": "India Imposes 5-Year Anti-Dumping Duty on Hot Rolled Steel Imports from Vietnam",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed a 5-year anti-dumping duty on certain hot rolled steel imports from Vietnam. The measure is designed to protect the domestic steel industry from unfair trade practices. SAIL appears to be among the beneficiaries of this protective trade action.",
            "Sentiment": "positive",
            "PublishDate": 1755141307102,
            "Source": "stock"
        },
        {
            "Title": "SAIL Reports Strong Q1 Performance with 15% Sales Growth and 2.7x Profit Increase",
            "Summary": "Steel Authority of India Limited reported its best-ever first quarter sales performance with volumes reaching 4.55 million tons, representing 15% growth compared to the previous year. Saleable steel production increased 12% to 4.7 million tons. Profit before tax surged 2.7 times to INR890 crores from INR326 crores in the same quarter last year. The company reduced borrowings by INR1,100 crores during the quarter to INR28,741 crores. However, the company faced a one-time stock valuation impact of INR1,050 crores due to lower coking coal prices reducing production costs. Blended coking coal costs decreased to INR16,918 per ton from INR17,653 in the previous quarter. The company maintained its full-year sales guidance of 18.5 million tons and increased capex target to INR7,500 crores. SAIL also marketed 0.373 million tons of NMDC steel, generating revenue of approximately INR1,800 crores. Management expects the stock valuation impact to be a one-time adjustment that will not repeat in subsequent quarters.",
            "Sentiment": "positive",
            "PublishDate": 1754045682582,
            "Source": "earnings"
        },
        {
            "Title": "SAIL CMD Confident Despite 41% Quarterly Profit Drop, Targets 8% Growth for FY26",
            "Summary": "Steel Authority of India Ltd. reported a 41% sequential decline in consolidated net profit to Rs 745 crore in Q1, down from Rs 1,251 crore in the March quarter. Chairman and Managing Director Amarendu Prakash attributed the decline to planned maintenance activities at plants and described it as a one-time accounting hit related to stock valuation. Despite the quarterly dip, Prakash emphasized improved cost efficiency and production growth, maintaining the company's target of 8% growth for FY26 over FY25. He highlighted the importance of continued government support through safeguard duties for pricing stability. SAIL stock declined 1.82% during trading to Rs 123.30, and has fallen 15.18% over the past 12 months. Among 27 analysts tracking the company, 4 recommend 'buy', 11 suggest 'hold', and 12 advise 'sell', with a consensus target price of Rs 122.3.",
            "Sentiment": "neutral",
            "PublishDate": 1753766798269,
            "Source": "stock"
        },
        {
            "Title": "SAIL Targets 18.5 Million Tons Sales in FY26 with ₹7,500 Crore CAPEX Approval",
            "Summary": "SAIL has set a sales target of 18.5 million tons for FY26, supported by an approved capital expenditure of ₹7,500 crores. The company expects a significant increase in sales volume in FY27 due to expansion at its IISCO facility.",
            "Sentiment": "positive",
            "PublishDate": 1753760260585,
            "Source": "stock"
        },
        {
            "Title": "Steel Authority of India Limited Makes Conference Call Audio Recording Available to Public",
            "Summary": "Steel Authority of India Limited held a conference call on July 28, 2025, where management discussed the company's quarterly results with analysts and investors. The audio recording of this call has been made available on the company's website at https://sail.co.in/en/investors-relation/performance-highlights. The call was conducted in continuation of their earlier communication dated July 25, 2025, and was announced by M.B. Balakrishnan, Executive Director (Finance & Accounts) and Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1753704364391,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Reports Strong Q1 Performance with Net Profit Surging to 7.4 Billion Rupees",
            "Summary": "Steel Authority of India Limited (SAIL) delivered robust quarterly results with consolidated net profit jumping to 7.4 billion rupees from 818 million rupees in the same period last year. Revenue increased to 259 billion rupees compared to 240 billion rupees year-over-year. EBITDA rose to 27.7 billion rupees from 22.2 billion rupees, while EBITDA margin improved to 10.69% from 9.25% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753662212802,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Reports 41% Drop in Net Profit for First Quarter",
            "Summary": "Steel Authority of India Ltd. reported a consolidated net profit of Rs 745 crore in the first quarter, down 41% from Rs 1,251 crore in the previous quarter. Revenue declined 11.6% to Rs 25,922 crore from Rs 29,316 crore, while EBITDA fell 20.5% to Rs 2,769 crore. The company's margin contracted to 10.7% from 11.9%. SAIL shares closed 4.04% lower at Rs 130.67 on the National Stock Exchange. Among 28 analysts covering the stock, five recommend 'buy', 11 suggest 'hold', and 12 advise 'sell'. The average 12-month price target indicates a potential downside of 4.8%.",
            "Sentiment": "negative",
            "PublishDate": 1753457974922,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Reports Strong Q1 Performance with Net Profit Surging to 7.4 Billion Rupees",
            "Summary": "SAIL delivered robust quarterly results with consolidated net profit jumping to 7.4 billion rupees compared to 818 million rupees in the same period last year. Revenue increased to 259 billion rupees from 240 billion rupees year-over-year. The company's EBITDA rose to 27.7 billion rupees versus 22.2 billion rupees previously, while EBITDA margin improved to 10.69% from 9.25% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1753454340274,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Announces Q1 Results Date and Earnings Call Schedule",
            "Summary": "Steel Authority of India Ltd. (SAIL), India's largest government-owned steel producer, will announce its first quarter results on July 25, 2025. The Board of Directors meeting will consider unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. An earnings call with investors and analysts is scheduled for July 28 at 12 p.m. The company's trading window remains closed until 48 hours after results declaration. In the previous quarter, SAIL reported an 11.1% year-on-year increase in consolidated net profit to Rs 1,250.98 crore, with total income rising 4.7% to Rs 29,613.68 crore. SAIL shares have gained 0.33% in the past five trading sessions and are up 25.09% over six months, though down nearly 8% over the past year.",
            "Sentiment": "neutral",
            "PublishDate": 1753338577458,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Schedules Board Meeting on July 25, 2025 to Approve Quarterly Financial Results",
            "Summary": "Steel Authority of India Limited (SAIL) will hold a Board of Directors meeting on July 25, 2025 in New Delhi to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company's trading window is closed and will remain closed until 48 hours after the financial results are announced.",
            "Sentiment": "neutral",
            "PublishDate": 1753161256023,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Emerges as Largest Steel Supplier for India's Zojila Tunnel Project",
            "Summary": "Steel Authority of India Ltd. has become the single largest steel supplier for the Zojila tunnel project, providing over 31,000 tonnes of steel including TMT re-bars, structurals, and plates. The tunnel, located at 11,578 feet altitude in Himalayan terrain, is set to become India's longest road tunnel and Asia's longest bi-directional tunnel. The project is 70% completed and expected to finish by 2026, providing all-weather connectivity between Srinagar and Leh. The construction cost has been reduced from an initial estimate of Rs 12,000 crore to approximately Rs 5,500 crore. The 30-kilometer tunnel will enhance civilian and military mobility and includes smart tunnel features with CCTV, radio control, power supply, and ventilation systems.",
            "Sentiment": "positive",
            "PublishDate": 1753088231490,
            "Source": "stock"
        },
        {
            "Title": "SAIL Reduces Debt by ₹7.5 Billion, Plans Further Reduction",
            "Summary": "Steel Authority of India Limited (SAIL) has decreased its debt by approximately ₹7.5 billion in the previous year. Company officials have stated that SAIL aims to further reduce its debt in the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1749125209000,
            "Source": "default"
        },
        {
            "Title": "Steel Authority of India: Debt Reduction and Expansion Plans",
            "Summary": "SAIL has reduced its debt by Rs 750 crore in FY25, bringing it down to Rs 26,800 crore. The company plans further debt reduction and aims to increase its capacity to 35 million tonnes per annum by 2030. SAIL reported an 11% growth in Q4 consolidated net profit to Rs 1,250.98 crore.",
            "Sentiment": "positive",
            "PublishDate": 1749124108000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Authority of India Limited: Q4 Earnings Beat Expectations on Higher Volumes",
            "Summary": "SAIL reported better-than-expected Q4 earnings due to increased volumes and easing pricing pressure. The company is focusing on sustenance and debottlenecking projects while planning to expand capacity from 20 mt to 35 mt by 2031.",
            "Sentiment": "positive",
            "PublishDate": 1748584616000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Authority of India Limited: Q4 Profit Rises 11% YoY, Announces Dividend",
            "Summary": "SAIL reported a consolidated net profit of Rs 1,251 crore for Q4FY25, up 11% YoY. Revenue increased 5% to Rs 29,316 crore. The company announced a final dividend of Rs 1.60 per share for FY2024-25. Full-year PAT decreased to Rs 2,372 crore from Rs 3,067 crore in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1748487953000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Authority of India Ltd: Q4 Profit Soars 393% Sequentially",
            "Summary": "SAIL's Q4 FY25 consolidated net profit jumped 393% sequentially to Rs 1,251 crore. Revenue increased 19.7% to Rs 29,316 crore. EBITDA rose 72% to Rs 3,484 crore with margin improving to 11.9%. Board recommends final dividend of Rs 1.6 per share for FY25.",
            "Sentiment": "positive",
            "PublishDate": 1748447370000,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Reports Q4 Results and Recommends Dividend",
            "Summary": "Steel Authority of India Limited (SAIL) has announced its Q4 results and dividend recommendation. The company's Q4 consolidated net profit increased to 12.5 billion rupees from 11.26 billion rupees year-over-year. Q4 revenue rose to 293.2 billion rupees from 279.6 billion rupees in the previous year. SAIL's Q4 EBITDA remained stable at 34.83 billion rupees, while the EBITDA margin decreased slightly to 11.88% from 12.5% year-over-year. The company has recommended a dividend of 1.6 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748444005000,
            "Source": "result"
        },
        {
            "Title": "Steel Authority of India Ltd: Steel Ministry Considers Separate Mining Vertical to Boost Iron Ore Output",
            "Summary": "The Steel Ministry is discussing the formation of a separate mining vertical within SAIL to improve iron ore production operations. This aligns with SAIL's goal to increase its installed capacity to 35 million tonnes per annum by 2030. SAIL currently operates 15 iron ore mines across three states.",
            "Sentiment": "positive",
            "PublishDate": 1747649319000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Authority of India Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade of approximately 2,444,980 shares of Steel Authority of India Ltd. (SAIL) was executed on the National Stock Exchange (NSE) at a price of Rs. 112.87 per share. The total value of the transaction amounted to Rs. 27.60 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1743749648000,
            "Source": "block_deals"
        },
        {
            "Title": "Steel Authority of India Limited (SAIL): US Tariffs May Redirect Global Steel Trade to India",
            "Summary": "SAIL Chairperson Amarendu Prakash warns that US tariffs on European and Asian steel could redirect global steel trade to India, potentially increasing steel imports. The situation remains volatile, with potential reciprocal tariffs and tightening of EU quotas. India's government is aware and working on the situation.",
            "Sentiment": "neutral",
            "PublishDate": 1743595106000,
            "Source": "normal_news"
        },
        {
            "Title": "SAIL Chairman Advocates for Safeguard Duty Implementation",
            "Summary": "The Chairman of Steel Authority of India Limited (SAIL) has expressed the company's belief that a safeguard duty needs to be implemented. This statement suggests that SAIL is seeking protective measures for the domestic steel industry, possibly against cheaper imports.",
            "Sentiment": "neutral",
            "PublishDate": 1743582462000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAIL to Begin Operations at Tasra Coking Coal Mine in 2026",
            "Summary": "Steel Authority of India Limited (SAIL) plans to commence operations at its Tasra coking coal mine in 2026. The company has set a goal to increase its steel production capacity to 35.65 million tonnes per annum (MTPA) by 2031, according to a report in The Economic Times.",
            "Sentiment": "positive",
            "PublishDate": 1742780040000,
            "Source": "corporate_action"
        },
        {
            "Title": "SAIL to Expand Rourkela Steel Plant Capacity to 9 MT by 2030",
            "Summary": "Steel Authority of India Limited (SAIL) plans to increase the capacity of its Rourkela Steel Plant to 9 million tonnes by 2030. This expansion project will require an investment of approximately 30,000 crore rupees. The news indicates a significant long-term growth strategy for SAIL's Rourkela facility.",
            "Sentiment": "positive",
            "PublishDate": 1742182340000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Authority of India Ltd: Rs 30,000 Crore Expansion Plan for Rourkela Plant",
            "Summary": "SAIL plans to more than double the capacity of its Rourkela Steel Plant to 9.4 MTPA by 2030, investing Rs 30,000 crore. The expansion will cover 1,200 acres and include new facilities like raw material handling plant, coke oven battery, and thin slab caster. Post-expansion, RSP will contribute about 25% to SAIL's overall 35 MTPA production target by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1742110356000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Authority of India Limited: SAIL Plans $800 Million Rail Mill Investment",
            "Summary": "SAIL Chairman Amarendu Prakash announced a decision to invest $800 million in a new rail mill, despite no order commitments from Indian Railways. The investment reflects confidence in market growth and government policies.",
            "Sentiment": "positive",
            "PublishDate": 1739619463000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Authority of India: Q3 Revenue Rises Despite Profit Decline",
            "Summary": "SAIL reported a 5% YoY increase in Q3FY25 revenue to Rs 24,490 crore, but net profit fell 66% YoY to Rs 142 crore. EBITDA stood at Rs 2,389 crore. Crude steel production decreased to 4.63 million tonnes, while sales volume increased to 4.43 million tonnes. Motilal Oswal maintained a 'Neutral' rating with a target price of Rs 115.",
            "Sentiment": "neutral",
            "PublishDate": 1739424279000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Authority of India Limited: Systematix Maintains 'Hold' Rating, Lowers Target Price",
            "Summary": "Systematix has maintained a 'Hold' rating on Steel Authority of India Limited (SAIL) stock while lowering the target price. The decision on implementing safeguard duty on steel imports is pending, which could potentially drive stock re-rating if favorable. Key risks for SAIL include further drops in steel prices and increases in raw material costs.",
            "Sentiment": "neutral",
            "PublishDate": 1739421246000,
            "Source": "normal_news"
        },
        {
            "Title": "SAIL Reports Decline in Q3 Net Profit",
            "Summary": "Steel Authority of India Limited (SAIL) has reported a significant decrease in its consolidated net profit for the third quarter. The profit dropped to 1.4 billion rupees from 4.23 billion rupees in the same quarter last year. However, the company's revenue increased to 244.9 billion rupees from 233.5 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739320365000,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Steel Authority of India Limited (SAIL) has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 20.3 billion rupees from 21.42 billion rupees year-over-year. Additionally, SAIL's EBITDA margin dropped to 8.29% from 9.17% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739287977000,
            "Source": "earnings"
        },
        {
            "Title": "SAIL Reports Decline in Q3 Net Profit",
            "Summary": "Steel Authority of India Limited (SAIL) has reported a consolidated net profit of 1.4 billion rupees for the third quarter, showing a significant decrease from 4.23 billion rupees year-over-year. However, the company's revenue increased to 244.9 billion rupees from 233.5 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739287921000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Authority of India: Q3 Results Expected, Share Price Falls",
            "Summary": "SAIL share price fell over 3% ahead of Q3 results announcement. Analysts expect revenue growth due to increased sales volumes, but some predict a potential slip into losses. EBITDA per tonne estimates vary among analysts, with expectations of lower coking coal costs partially offsetting reduced realizations.",
            "Sentiment": "neutral",
            "PublishDate": 1739249480000,
            "Source": "earnings"
        }
    ]
}