{
    "Symbol": "SAKAR",
    "ISIN": "INE732S01012",
    "News": [
        {
            "Title": "Sakar Healthcare Q3 Net Profit Surges 127% YoY",
            "Summary": "Sakar Healthcare reports strong Q3 performance with net profit jumping to 102 million rupees from 45 million rupees in the previous year, marking significant growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1770268717319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sakar Healthcare Secures European Oncology Deal",
            "Summary": "Sakar Healthcare's oncology unit will supply Imatinib tablets to Accord for European markets, representing the first of nine planned oncology products in the partnership.",
            "Sentiment": "positive",
            "PublishDate": 1766121370539,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sakar Healthcare Gets EU Approval for Imatinib Supply",
            "Summary": "Accord Healthcare receives European Union approval for Imatinib 100 MG and 400 MG tablets, with Sakar Healthcare designated as the supplier to European markets, potentially boosting company sales.",
            "Sentiment": "positive",
            "PublishDate": 1766121341480,
            "Source": "stocks"
        },
        {
            "Title": "Sakar Healthcare Secures Nine Additional Marketing Authorizations for Cancer Treatments",
            "Summary": "Sakar Healthcare has obtained nine new marketing authorizations for cancer products in Europe and emerging markets, increasing its total authorizations to eleven. The approved products include Carboplatin, Docetaxel, and Tamoxifen, which are treatments used in cancer therapy.",
            "Sentiment": "positive",
            "PublishDate": 1762406918676,
            "Source": "stock"
        },
        {
            "Title": "Sakar Healthcare Reports 95% Jump in Q1 Net Profit to Rs 46.7 Million",
            "Summary": "Sakar Healthcare reported a net profit of Rs 46.7 million for Q1, marking a significant increase from Rs 24 million in the same period last year. The company's EBITDA grew to Rs 127 million from Rs 107 million year-over-year. However, the EBITDA margin declined to 24.1% from 26% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753426394557,
            "Source": "earnings"
        },
        {
            "Title": "Sakar Healthcare Receives European Approvals for Anti-Cancer Injections",
            "Summary": "Sakar Healthcare has expanded its export potential by receiving approvals for anti-cancer injections in Europe. The company has obtained its third and fourth marketing authorizations for oncology injections in the European market. Sakar Healthcare is preparing for commercial supply of these products to Europe.",
            "Sentiment": "positive",
            "PublishDate": 1752644016000,
            "Source": "default"
        },
        {
            "Title": "Sakar Healthcare Anticipates MAS Approval for Oncology Products in EU",
            "Summary": "Sakar Healthcare expects to receive Marketing Authorization System (MAS) approval gradually over the next few months. This approval will accelerate the export of various oncology products to the European Union. The company has already received its second marketing authorization for an oncology injection in the EU.",
            "Sentiment": "positive",
            "PublishDate": 1750233646000,
            "Source": "default"
        },
        {
            "Title": "Sakar Healthcare Reports Strong Q4 Financial Results",
            "Summary": "Sakar Healthcare has announced its Q4 financial results, showing significant year-over-year improvements. The company's net profit increased from 31 million rupees to 58 million rupees. Revenue grew from 430 million rupees to 502 million rupees. EBITDA rose from 110 million rupees to 157 million rupees, with the EBITDA margin expanding from 25.47% to 31.30%.",
            "Sentiment": "positive",
            "PublishDate": 1747294171000,
            "Source": "result"
        },
        {
            "Title": "Sakar Healthcare Receives First Marketing Authorization for Oncology Injection in EU",
            "Summary": "Sakar Healthcare has been granted its first Marketing Authorization (MA) or registration for an oncology injection in the European Union (EU). This approval marks a significant milestone for the company, potentially opening up new market opportunities in Europe for their oncology products.",
            "Sentiment": "positive",
            "PublishDate": 1745211184000,
            "Source": "default"
        },
        {
            "Title": "Sakar Healthcare Signs 9 Agreements to Boost Oncology Product Exports",
            "Summary": "Sakar Healthcare has entered into nine agreements with partners across Europe and South (Latin) America. These agreements are aimed at increasing the company's exports of oncology products to these regions, potentially expanding their market reach and revenue streams in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1744793391000,
            "Source": "default"
        },
        {
            "Title": "Sakar Healthcare to Manufacture Oncology Products for Accord Healthcare",
            "Summary": "Sakar Healthcare has announced an agreement to manufacture and supply oncology products for Accord Healthcare Limited, a fully owned subsidiary of Intas. The products will be distributed in the European Union, United Kingdom, and emerging markets.",
            "Sentiment": "positive",
            "PublishDate": 1740376982000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sakar Health Reports Q2 Financial Results",
            "Summary": "Sakar Health announced its Q2 consolidated financial results. The company's net profit increased to 48 million rupees from 36 million rupees year-over-year. Revenue also grew to 428 million rupees from 341 million rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729581335000,
            "Source": "result"
        }
    ]
}