{
    "Symbol": "SAKHTISUG",
    "ISIN": "INE623A01011",
    "News": [
        {
            "Title": "Sakthi Sugars Board Addresses SEBI Compliance",
            "Summary": "Sakthi Sugars Limited's Board of Directors met on February 12, 2026, to discuss compliance with SEBI LODR Regulation 17(1A) regarding appointment of Non-Executive Directors above 75 years.",
            "Sentiment": "neutral",
            "PublishDate": 1770887090940,
            "Source": "stocks"
        },
        {
            "Title": "Sakthi Sugars Limited Fined Rs 86,000 Each by BSE and NSE for Regulatory Non-Compliance",
            "Summary": "Sakthi Sugars Limited received fines of Rs 86,000 plus GST each from BSE and NSE on November 28, 2025, for non-compliance with SEBI Listing Regulations regarding appointment of Non-Executive Independent Director who attained age of seventy-five years. The company stated that these fines have no material impact on its financial, operational or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1764397910492,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sakthi Sugars Reports Net Loss of ₹23.06 Crores in Q2 Despite Revenue Growth",
            "Summary": "Sakthi Sugars Limited reported a net loss of ₹23.06 crores for the quarter ended September 30, 2025, compared to a net loss of ₹28.98 crores in the same quarter last year. Total income from operations increased significantly to ₹168.27 crores from ₹73.38 crores year-over-year. For the six-month period, the company posted a net loss of ₹24.16 crores versus a net profit of ₹28.92 crores in the previous year. The company's equity share capital remains at ₹118.85 crores, with reserves at ₹79.80 crores.",
            "Sentiment": "negative",
            "PublishDate": 1761824803614,
            "Source": "earnings"
        },
        {
            "Title": "Sakthi Sugars Reports Net Loss of Rs 23.06 Crore in Q2 FY26",
            "Summary": "Sakthi Sugars Limited reported a net loss of Rs 23.06 crore for the quarter ended September 30, 2025, compared to a net loss of Rs 1.10 crore in the previous quarter. Revenue from operations declined to Rs 73.38 crore from Rs 470.69 crore in the same quarter last year. The company operates across four segments: Sugar (Rs 150.56 crore revenue), Industrial Alcohol (Rs 49.15 crore), Power (Rs 33.02 crore), and Soya Products. For the half-year period, the company posted a net loss of Rs 24.16 crore versus a profit of Rs 28.92 crore in the corresponding period last year. The auditors issued a qualified opinion regarding Rs 252.20 crore of interest receivable from an erstwhile associate company, where no provision for expected credit loss has been made. The company's management believes recovery is reasonably assured. Basic and diluted earnings per share stood at negative Rs 1.94 for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761650373970,
            "Source": "earnings"
        },
        {
            "Title": "Sakthi Sugars Reports Strong Q1 Performance, Appoints New Independent Director and Schedules AGM",
            "Summary": "Sakthi Sugars Limited announced its unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of Rs. 92,854.06 lakhs and profit for the period of Rs. 7,409.55 lakhs. Basic earnings per share stood at Rs. 6.23. The company operates across four segments: Sugar (Rs. 24,727.73 lakhs revenue), Industrial Alcohol (Rs. 16,926.95 lakhs), Power (Rs. 4,711.77 lakhs), and Soya Products (Rs. 1,121.23 lakhs). The Board appointed Smt. Susheela Balakrishnan as Additional and Independent Director for five consecutive years, effective August 13, 2025, subject to shareholder approval. She is a Fellow Member of the Institute of Chartered Accountants of India with 40 years of professional experience. The company scheduled its 63rd Annual General Meeting for September 25, 2025, via video conferencing. Additionally, the Board recommended the appointment of Sri. R. Dhanasekaran as Secretarial Auditor for five years (2025-2030) and approved STR & Associates as Cost Auditors for financial year 2025-26. The auditors qualified their report regarding Rs. 25,219.69 lakhs of interest receivable from an erstwhile associate company, citing inability to determine expected credit loss due to ongoing legal proceedings.",
            "Sentiment": "positive",
            "PublishDate": 1755071076184,
            "Source": "earnings"
        }
    ]
}