{
    "Symbol": "SAKSOFT",
    "ISIN": "INE667G01023",
    "News": [
        {
            "Title": "Saksoft Q3 FY26: Revenue Up 11% YoY to ₹250 Crores",
            "Summary": "Saksoft reported Q3 FY26 revenue of ₹250 crores with 11% YoY growth. EBITDA grew 19% to ₹45 crores. Sequential revenue declined 3% due to temporary client spending slowdown.",
            "Sentiment": "neutral",
            "PublishDate": 1770717649355,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saksoft Q3FY26 Earnings Call Set for February 3, 2026",
            "Summary": "Saksoft Limited announces investor/analyst meeting on February 3, 2026 at 2:00 PM IST hosted by Monarch Networth Capital to discuss Q3FY26 results. Virtual group meeting scheduled under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769499885861,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saksoft CDO Saswat Swain Resigns Due to Personal Reasons",
            "Summary": "Saksoft Limited announces resignation of Chief Delivery Officer Saswat Swain from senior management position effective December 26, 2025, citing personal reasons for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1766762302741,
            "Source": "stocks"
        },
        {
            "Title": "Saksoft Senior Management Personnel Resigns",
            "Summary": "Saksoft Limited announces resignation of Mr. Deepak Agarwal, Business Unit Head-Ecommerce and Senior Management Personnel, effective December 12, 2025, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765790809447,
            "Source": "stocks"
        },
        {
            "Title": "Saksoft Limited Senior Management Personnel Resigns Due to Personal Reasons",
            "Summary": "Mr. Deepak Agarwal, Business Unit Head-Ecommerce and Senior Management Personnel at Saksoft Limited, has resigned from his position citing personal reasons. The resignation affects the company's ecommerce business unit leadership structure and was disclosed to stock exchanges as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765289229211,
            "Source": "corporate_governance"
        },
        {
            "Title": "Saksoft Reports Strong Q2FY26 Results with 20% Revenue Growth and Margin Expansion",
            "Summary": "Saksoft Limited delivered robust quarterly results with revenue of INR 258 crores (20% YoY growth) and EBITDA of INR 51 crores (38% YoY growth), achieving 19.58% EBITDA margin. The company maintained its FY26 revenue guidance of INR 1,000-1,100 crores while expanding AI capabilities through new accelerators SakMod and SakCelerate, with 95% growth driven by increased wallet share from existing customers.",
            "Sentiment": "positive",
            "PublishDate": 1763449059462,
            "Source": "earnings"
        },
        {
            "Title": "Saksoft Reports 21.9% Revenue Growth and 34.3% EBITDA Jump in H1-FY26",
            "Summary": "Saksoft delivered strong financial performance with operating income rising 21.9% to INR 5,075.68 million and operating EBITDA increasing 34.3% to INR 964.49 million. Net profit grew 32% to INR 683.15 million with basic EPS at INR 5.34. Operating EBITDA margins improved to 19% from 17.25%. The company expanded its AI-powered framework portfolio with new solutions including SakMod for legacy modernization, Sakcelerate for AI Ops automation, and agentic AI-based solutions like Conversational AI Agent and Emergency Care Agent. Chairman Aditya Krishna highlighted continued sequential and year-on-year growth in revenues and EBITDA, with the strategy of intelligent products and platforms building traction and providing greater revenue predictability. The company serves multiple verticals including BFS, digital engineering, logistics, and emerging sectors with 70% revenue coming from top 10 clients.",
            "Sentiment": "positive",
            "PublishDate": 1762829987310,
            "Source": "earnings"
        },
        {
            "Title": "Saksoft Limited Reports Quarterly Financial Results with Revenue Growth and Declares Interim Dividend",
            "Summary": "Saksoft Limited filed its unaudited consolidated financial results for the quarter and half-year ended September 30, 2025, with a correction to the paid-up equity share capital figure from Rs. 1011.58 lakhs to Rs. 1274.83 lakhs. The company reported net sales of Rs. 25,849.30 lakhs for the quarter ended September 30, 2025, compared to Rs. 21,528.95 lakhs in the same quarter of the previous year. Net profit for the quarter was Rs. 3,596.70 lakhs versus Rs. 2,626.29 lakhs in the corresponding quarter of 2024. For the half-year period, net sales reached Rs. 50,756.75 lakhs compared to Rs. 41,629.57 lakhs in the previous year, with net profit of Rs. 6,831.49 lakhs against Rs. 5,174.85 lakhs. The company operates across four segments: BFS, Logistics, Emerging vertical, and Commerce. The Board of Directors declared an interim dividend of Re. 0.45 per equity share (45%) of face value Re. 1.00 each. Basic earnings per share for the quarter was Rs. 2.80 compared to Rs. 2.06 in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762804442314,
            "Source": "earnings"
        },
        {
            "Title": "SAKSOFT Reports Growth in Q2 Financial Metrics",
            "Summary": "SAKSOFT reported quarterly revenue of 2.6 billion rupees, up from 2.49 billion in the previous quarter. The company's EBIT increased to 473 million rupees from 425 million quarter-on-quarter, with EBIT margin improving to 18.3% from 17.1%. Consolidated net profit rose to 360 million rupees compared to 323.4 million in the prior quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762759069714,
            "Source": "earnings"
        },
        {
            "Title": "Saksoft Appoints Shankar Harihara Iyer as Chief Growth Officer for North America",
            "Summary": "Saksoft Limited appointed Mr. Shankar Harihara Iyer as Chief Growth Officer for North America at its US subsidiary, Saksoft Inc., effective October 13, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Iyer brings over two decades of experience in Tech Services across US, Europe and India, with expertise in business growth, account management, and technical solutions across multiple sectors including finance, banking, insurance, retail, and manufacturing. He holds a B.Tech in Electronics Engineering and is not related to any Director of the Company.",
            "Sentiment": "positive",
            "PublishDate": 1760360758339,
            "Source": "stock"
        },
        {
            "Title": "Saksoft Updates Amalgamation Scheme with Augmento Labs Following Registered Office Approval",
            "Summary": "Saksoft Limited has modified its Scheme of Amalgamation with wholly-owned subsidiary Augmento Labs Private Limited after the Registrar of Companies approved Augmento Labs' change in registered office. The scheme has been updated to reflect the new registered office address and Corporate Identification Number of Augmento Labs. The Board of Directors had approved the original amalgamation scheme on August 8, 2025. Under the scheme, Augmento Labs will merge into Saksoft with an appointed date of April 1, 2026. The amalgamation aims to consolidate operations, achieve economies of scale, reduce administrative costs, and enhance shareholder value. Since Augmento Labs is a wholly-owned subsidiary, no new shares will be issued by Saksoft. All assets, liabilities, employees, and business operations of Augmento Labs will transfer to Saksoft upon completion.",
            "Sentiment": "neutral",
            "PublishDate": 1756206247486,
            "Source": "corporate_action"
        },
        {
            "Title": "Saksoft Reports 24% Revenue Growth to INR 249 Crores in Q1 FY26, Targets INR 1,000-1,100 Crores for Full Year",
            "Summary": "Saksoft Limited reported strong quarterly results with revenue growing 24% year-on-year to INR 249 crores. EBITDA increased 31% year-on-year to INR 46 crores with margins at 18.4%, while net profit rose 26% to INR 32 crores with PAT margins at 12.99%. The company is repositioning itself as an AI-led product engineering company and has 16 customers generating over $1 million in revenue. Saksoft added one new customer in the $0.5 million bracket and scaled an existing client from $0.5 million to $1 million bracket. The Americas contributed 44% of revenues, Europe 21%, and Asia Pacific 35%. Employee count stands at 2,616 with 86% utilization rate. Management provided guidance of INR 1,000-1,100 crores for the current financial year and maintains its $500 million revenue target by 2030. The company expects EBITDA margins to normalize to 16.5%-17.5% range due to annual increments and currency headwinds. Saksoft has around INR 190-200 crores cash on books and continues to evaluate acquisition opportunities in the $8-10 million revenue range.",
            "Sentiment": "positive",
            "PublishDate": 1755522444805,
            "Source": "earnings"
        },
        {
            "Title": "Saksoft Limited Re-appoints Aditya Krishna as Chairman & Managing Director for Five Years",
            "Summary": "Saksoft Limited has re-appointed Mr. Aditya Krishna as Chairman & Managing Director for a five-year term from April 01, 2026 to March 31, 2031. The re-appointment was approved by the Board of Directors on May 26, 2025, following recommendation from the Nomination and Remuneration Committee, and by shareholders on August 08, 2025. Mr. Krishna holds an M.A. in Economics from St. Stephen's College, New Delhi and an MBA in Finance & Marketing from Northeastern University, Boston. He completed the Owner/President Management Program at Harvard Business School (2010–2012). He founded Saksoft Limited in 1999, which has grown into a global provider of digital transformation solutions. He is the father of Ms. Kanika Krishna, who serves as Non-Executive Non-Independent Director of the company.",
            "Sentiment": "positive",
            "PublishDate": 1755015701803,
            "Source": "corporate_governance"
        },
        {
            "Title": "Saksoft Limited Approves Merger with Subsidiary Augmento Labs and Reports Q1 FY26 Results",
            "Summary": "Saksoft Limited's Board approved a scheme of amalgamation with its wholly-owned subsidiary Augmento Labs Private Limited, subject to requisite approvals. The Board also approved unaudited financial results for the quarter ended June 30, 2025. Saksoft reported consolidated revenue of Rs 249.07 crores and net profit of Rs 32.35 crores for the quarter. Augmento Labs, a digital engineering company with enterprise clients across India and US, generated revenue of Rs 535.41 million for the year ended March 31, 2025. The merger aims to consolidate entities, simplify group structure, achieve operational efficiencies, reduce administrative costs, and maximize shareholder value. Since Augmento Labs is wholly-owned, no new shares will be issued and there will be no change in Saksoft's shareholding pattern. The appointed date for the merger is April 1, 2026, subject to tribunal and other regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1754641966948,
            "Source": "corporate_action"
        },
        {
            "Title": "SAKSOFT Reports Higher Q1 EBITDA and Profit Margins",
            "Summary": "SAKSOFT reported Q1 EBITDA of 458 million rupees compared to 363 million rupees in the previous quarter. The company's EBITDA margin improved to 18.4% from 15.13% quarter-on-quarter. Consolidated net profit increased to 323 million rupees from 300 million rupees in the prior quarter. Revenue remained flat at 2.4 billion rupees compared to the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754641159053,
            "Source": "earnings"
        },
        {
            "Title": "Saksoft Schedules Virtual Investor Meeting on August 11, 2025 to Discuss Q1FY26 Earnings",
            "Summary": "Saksoft Limited has scheduled a virtual group meeting with investors and analysts on August 11, 2025, at 2:00 PM IST, hosted by Monarch Networth Capital. The meeting will focus on discussing Q1FY26 earnings update. Key company management participants include Chairman and MD Ms. Avantika Krishna, COO & CFO Mr. Niraj Kumar Ganeriwal, and Chief Sales Officer Mr. Aditya Krishna. The company has confirmed that no unpublished price sensitive information will be discussed during the interaction. The meeting will be accessible through dial-in numbers for various countries including India, Hong Kong, Singapore, UK, and USA.",
            "Sentiment": "neutral",
            "PublishDate": 1754402543816,
            "Source": "stock"
        },
        {
            "Title": "Saksoft Reports Q4 Financial Results",
            "Summary": "Saksoft has released its Q4 financial results. The company's EBITDA increased to 364 million rupees from 333 million rupees year-over-year. However, the EBITDA margin decreased to 15.17% from 17.1% compared to the same period last year. Revenue grew to 2.4 billion rupees from 1.9 billion rupees year-over-year. Consolidated net profit rose to 300 million rupees from 232 million rupees in the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748248831000,
            "Source": "result"
        },
        {
            "Title": "Saksoft Announces NCLT Sanction for Scheme of Amalgamation",
            "Summary": "Saksoft has announced that the National Company Law Tribunal (NCLT) has sanctioned a scheme of amalgamation. The scheme involves the merger of Dreamorbit Softech, Threesixty Logica Testing Services, and Terafast Networks with Saksoft.",
            "Sentiment": "neutral",
            "PublishDate": 1743466307000,
            "Source": "corporate_action"
        },
        {
            "Title": "SAKSOFT Announces NCLT Sanction for Scheme of Amalgamation",
            "Summary": "SAKSOFT has announced that the National Company Law Tribunal (NCLT) has sanctioned a scheme of amalgamation. This scheme involves the merger of DreamOrbit Softech, ThreeSixty Logica Testing Services, and Terafast Networks with SAKSOFT.",
            "Sentiment": "neutral",
            "PublishDate": 1743174881000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saksoft Reports Strong Q3 Financial Results",
            "Summary": "Saksoft, an IT services company, has announced its financial results for the third quarter. The company's consolidated net profit increased to 270 million rupees from 225 million rupees in the same quarter last year, marking a significant year-over-year growth. Additionally, Saksoft's revenue for Q3 rose to 2.27 billion rupees from 1.9 billion rupees in the previous year, demonstrating robust top-line growth.",
            "Sentiment": "positive",
            "PublishDate": 1738570163000,
            "Source": "earnings"
        },
        {
            "Title": "Saksoft Reports Q3 EBITDA Growth with Slight Margin Decline",
            "Summary": "Saksoft, an IT services company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 381 million rupees, up from 330 million rupees in the same quarter of the previous year. However, the EBITDA margin slightly decreased to 16.78% from 17.13% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738570131000,
            "Source": "earnings"
        },
        {
            "Title": "Saksoft to Consider Q3 Results on February 3",
            "Summary": "Saksoft, an IT services company, has announced that it will consider and approve its financial results for the third quarter on February 3.",
            "Sentiment": "neutral",
            "PublishDate": 1737554920000,
            "Source": "result"
        },
        {
            "Title": "Saksoft Acquires Zetechno Products and Services",
            "Summary": "Saksoft has acquired Zetechno Products and Services, a Hyderabad-based ServiceNow partner. This acquisition is aimed at enhancing Saksoft's digital transformation capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1734790640000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saksoft Reports Q2 FY2024 Financial Results",
            "Summary": "Saksoft, an IT services company, has announced its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 367 million rupees, compared to 358 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin decreased from 18.81% in Q2 last year to 17.08% this year.",
            "Sentiment": "neutral",
            "PublishDate": 1731313005000,
            "Source": "result"
        },
        {
            "Title": "Saksoft Reports Q2 Revenue Growth",
            "Summary": "Saksoft, an IT services company, has reported a revenue of 2.15 billion rupees for the second quarter, compared to 1.9 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731312958000,
            "Source": "result"
        },
        {
            "Title": "Saksoft Reports Q2 Consolidated Net Profit Increase",
            "Summary": "Saksoft, an IT services company, has reported a consolidated net profit of 262 million rupees for the second quarter, compared to 252 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731312907000,
            "Source": "result"
        }
    ]
}