{
    "Symbol": "SAKUMA",
    "ISIN": "INE190H01024",
    "News": [
        {
            "Title": "Sakuma Exports Reports Mixed Q2 Performance with Revenue Decline",
            "Summary": "Sakuma Exports Limited reported quarterly results for the period ended September 30, 2025, showing total income of Rs 25,658.29 lakhs compared to Rs 31,767.70 lakhs in the same quarter previous year. The company posted a net profit of Rs 67.06 lakhs for the quarter, with consolidated results showing total income of Rs 25,864.98 lakhs and net profit of Rs 73.46 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1763130484725,
            "Source": "earnings"
        },
        {
            "Title": "Sakuma Exports Board Approves Performance Share Plan and Sets AGM Date for September 29, 2025",
            "Summary": "Sakuma Exports Limited's Board of Directors held a meeting on August 26, 2025, approving several key decisions. The board introduced and adopted the Sakuma Exports Limited Performance Share Plan Scheme 2025, which proposes stock options exercisable into up to 1.5 crore equity shares, representing 0.96% of the company's equity share capital. The plan requires shareholder approval at the upcoming Annual General Meeting. The board also appointed Mr. Rajeev Bhambri as scrutinizer for the AGM e-voting process, approved the board report for the financial year ended March 31, 2025, and set the book closure period from September 23-29, 2025. The Annual General Meeting is scheduled for September 29, 2025, at 11:00 AM through video conferencing.",
            "Sentiment": "positive",
            "PublishDate": 1756205760895,
            "Source": "corporate_action"
        },
        {
            "Title": "Sakuma Exports Reports Q1 FY26 Results, Announces Key Board Appointments",
            "Summary": "Sakuma Exports Limited announced its unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of ₹319.28 crores compared to ₹520.42 crores in the same quarter last year, while net profit declined to ₹1.34 crores from ₹4.55 crores year-over-year. On consolidated basis, revenue from operations was ₹375.67 crores versus ₹740.64 crores in the previous year quarter, with net profit at ₹1.65 crores compared to ₹5.69 crores. The board also approved the reappointment of M/s Mehta Singhvi & Associates as internal auditors for FY 2025-26, reappointment of Mr. Amit Amist Shanker as Non-Executive Independent Director for a second term, and appointment of M/s Ramesh M Sheth & Associates as statutory auditors for FY 2025-26 to 2029-30, all subject to shareholder approval. The company operates in agro products trading and has subsidiaries in UAE, Singapore, Bahrain and United Kingdom.",
            "Sentiment": "negative",
            "PublishDate": 1755079357517,
            "Source": "earnings"
        },
        {
            "Title": "Sakuma Exports Appoints New Company Secretary Following Resignation",
            "Summary": "Sakuma Exports Limited announced leadership changes in its compliance function. Ms. Surbhi Nahata resigned from her position as Company Secretary cum Compliance Officer effective July 21, 2025, citing pre-occupations as the reason for her departure. The company immediately appointed Ms. Pooja Malhotra as the new Company Secretary cum Compliance Officer effective July 22, 2025. Malhotra is an Associate Member of the Institute of Company Secretaries of India with approximately 5 years of experience in company secretarial matters at listed companies. The board approved both the resignation and appointment during a meeting held on July 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753187422717,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sakuma Exports: Q3 Profit Plunges 47.75% YoY, Revenue Down 38.68%",
            "Summary": "Sakuma Exports reported Q3 FY25 results with profit at ₹3.37 crore, down 47.75% YoY. Revenue decreased to ₹477.73 crore, a 38.68% YoY decline. However, the company saw quarter-on-quarter improvements with revenue up 40.76% and profit surging 171.77%. Operating income fell 113.17% YoY, and EPS dropped to ₹0.02, a 60% YoY decrease.",
            "Sentiment": "negative",
            "PublishDate": 1739598883000,
            "Source": "earnings"
        },
        {
            "Title": "Sakuma Exports Reports Q2 Financial Results",
            "Summary": "Sakuma Exports announced its Q2 consolidated net profit of 12 million rupees, down from 27 million rupees year-over-year and 57 million rupees quarter-over-quarter. The company's Q2 revenue was 3.4 billion rupees, slightly lower than the 3.6 billion rupees reported in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731585593000,
            "Source": "result"
        }
    ]
}