{
    "Symbol": "SALASAR",
    "ISIN": "INE170V01027",
    "News": [
        {
            "Title": "Salasar Techno Engineering Secures Two Major Contracts Worth Rs 695.18 Crore",
            "Summary": "Salasar Techno Engineering has been awarded two contracts with a combined value of approximately Rs 695.18 crore. The contract wins represent significant business development for the engineering company, potentially boosting its revenue pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1764202285141,
            "Source": "order&deals"
        },
        {
            "Title": "Salasar Techno Engineering Reports Mixed Q2 Results with Revenue Decline and Regulatory Fine",
            "Summary": "Salasar Techno Engineering's board approved unaudited financial results for the quarter and six months ended September 30, 2025, while also noting a fine imposed by stock exchanges for non-compliance with SEBI regulations for the quarter ended June 30, 2025. The company authorized its Managing Director to explore funding options for working capital and future growth while announcing the trading window will reopen on November 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763127430285,
            "Source": "earnings"
        },
        {
            "Title": "Salasar Techno Engineering Surges 35% in Two Sessions on Strong Volumes",
            "Summary": "Salasar Techno Engineering shares surged 15% on Tuesday, September 9, following Monday's 20% upper circuit gain, marking a nearly 35% increase over two sessions. The infrastructure and engineering services company saw exceptional trading volumes with over 8 crore shares traded Monday and 5 crore shares within the first two hours Tuesday, compared to a 20-day average of 16 lakh shares. The stock broke above its 100-day moving average on Monday and crossed its 200-day moving average on Tuesday. The company operates in steel structure manufacturing, EPC services, and telecom infrastructure. Its 2017 IPO was oversubscribed by over 250 times. The company issued four bonus shares for every one share held in 2024 and conducted a stock split in 2022. Despite the recent surge, shares remain down 25% year-to-date, trading at ₹10.67.",
            "Sentiment": "positive",
            "PublishDate": 1757397422983,
            "Source": "stock"
        },
        {
            "Title": "Salasar Techno Engineering Reports No Deviation in Rs 290.77 Crore Preferential Issue Fund Utilization",
            "Summary": "Salasar Techno Engineering Limited submitted its monitoring agency report for the quarter ended June 30, 2025, covering the utilization of proceeds from its Rs 290.77 crore preferential issue of equity shares and fully-convertible warrants. CARE Ratings Limited, serving as the monitoring agency, reported no deviation from the stated objects of the issue. The company utilized Rs 232.77 crore till date, with Rs 179.27 crore for financing acquisitions, Rs 53.29 crore for working capital requirements, and Rs 0.21 crore for issue-related expenses. No utilization occurred during the quarter. The monitoring agency noted that low share prices below warrant exercise price may lead subscribers to let warrants lapse, potentially affecting project viability. The Directorate of Enforcement conducted search operations at the premises of Chairman & Managing Director Alok Kumar and Joint Managing Director Shashank Agarwal on April 16, 2025. The company maintains that promoters will exercise warrants and expects non-promoters to do the same within the 18-month timeframe.",
            "Sentiment": "neutral",
            "PublishDate": 1755103837094,
            "Source": "stock"
        },
        {
            "Title": "Salasar Techno Engineering Reports Mixed Q1 Results with Revenue Growth but Lower Profit",
            "Summary": "Salasar Techno Engineering reported quarterly results showing revenue growth to 3 billion rupees from 2.9 billion rupees year-over-year. EBITDA increased to 300 million rupees from 281 million rupees, with EBITDA margin improving to 9.98% from 9.6%. However, consolidated net profit declined to 85 million rupees compared to 105 million rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1755098036575,
            "Source": "earnings"
        },
        {
            "Title": "Salasar Techno Engineering Reports Q4 Net Loss of 53m Rupees",
            "Summary": "Salasar Techno Engineering reported a consolidated net loss of 53 million rupees in Q4, compared to a profit of 170 million rupees in the same quarter last year. However, it showed improvement from the previous quarter with a profit of 120.6 million rupees. Q4 revenue increased to 4.83 billion rupees from 3.67 billion rupees year-over-year. The company reported an exceptional item loss of 65.6 million rupees. Profit before tax (PBT) for Q4 was 49.5 million rupees, down from 229 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748823189000,
            "Source": "default"
        },
        {
            "Title": "Salasar Techno Engineering: Q4 Profit Jumps 30% to Rs 20 Crore",
            "Summary": "Salasar Techno Engineering reported a 30% increase in Q4 FY25 consolidated net profit to Rs 19.31 crore, up from Rs 15.21 crore in Q4 FY24. Total income rose 32% to Rs 472.68 crore from Rs 358.42 crore in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1748689631000,
            "Source": "earnings"
        },
        {
            "Title": "Salasar Techno Engineering Reports Q4 Financial Results",
            "Summary": "Salasar Techno Engineering released its Q4 financial results. The company reported a revenue of 4.83 billion rupees, up from 3.67 billion rupees in the same quarter last year. However, the company faced challenges with profitability. It reported a consolidated net loss of 53 million rupees, compared to a profit of 170 million rupees in the previous year's quarter. The company's EBITDA decreased to 274.5 million rupees from 364 million rupees, with the EBITDA margin falling to 5.68% from 9.93%. The company also reported an exceptional item loss of 65.6 million rupees. Profit before tax (PBT) declined to 49.5 million rupees from 229 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748605233000,
            "Source": "result"
        },
        {
            "Title": "ED Conducts Search at Residences of Salasar Techno Engineering's Chairman and Joint MD",
            "Summary": "The Enforcement Directorate (ED) has conducted searches at the residences of Salasar Techno Engineering's Chairman and Joint Managing Director. The company has stated that no searches were carried out at Salasar's facilities, and their operations remain unaffected by this development.",
            "Sentiment": "neutral",
            "PublishDate": 1745194870000,
            "Source": "default"
        },
        {
            "Title": "Enforcement Directorate Searches Residences of Salasar Techno Engineering's Top Executives",
            "Summary": "The Enforcement Directorate (ED) has conducted searches at the residences of the Chairman and Joint Managing Director of Salasar Techno Engineering. The company has stated that no searches were carried out at Salasar's facilities, and their operations remain unaffected by this development.",
            "Sentiment": "negative",
            "PublishDate": 1744899609000,
            "Source": "default"
        },
        {
            "Title": "Salasar Techno Engineering Approves Amalgamation with EMC Ltd",
            "Summary": "The board of Salasar Techno Engineering has approved the amalgamation of EMC Ltd with itself. This corporate action represents a significant structural change for the company, potentially aimed at consolidating operations, improving efficiency, or expanding market presence.",
            "Sentiment": "neutral",
            "PublishDate": 1742977703000,
            "Source": "corporate_action"
        },
        {
            "Title": "Salasar Techno Engineering to Consider Amalgamation with EMC Limited",
            "Summary": "Salasar Techno Engineering Limited has announced a board meeting scheduled for March 26. The primary agenda of this meeting is to consider and approve the proposed amalgamation of EMC Limited with Salasar Techno Engineering Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1742569697000,
            "Source": "corporate_action"
        },
        {
            "Title": "Salasar Techno Engineering: Stock Surges on Potential Acquisition News",
            "Summary": "Salasar Techno Engineering's stock price jumped over 5% after announcing a non-binding MOU for the proposed acquisition of Elegant Forge & Equipments Pvt. Ltd. The due diligence process is expected to be completed within 45 days.",
            "Sentiment": "positive",
            "PublishDate": 1739776475000,
            "Source": "corporate_action"
        },
        {
            "Title": "Salasar Techno Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Salasar Techno Engineering Limited has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 325 million rupees from 375 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 8.68% from 12.33% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739524071000,
            "Source": "earnings"
        },
        {
            "Title": "Salasar Techno Reports Mixed Q3 Financial Results",
            "Summary": "Salasar Techno Engineering Limited has released its financial results for the third quarter. The company reported a revenue increase to 3.7 billion rupees, up from 3 billion rupees in the same quarter last year. However, net profit decreased to 126 million rupees, compared to 167 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739523979000,
            "Source": "earnings"
        },
        {
            "Title": "Salasar Techno Engineering: Board Approves Amalgamation with Hill View Infrabuild",
            "Summary": "Salasar Techno Engineering's board approved a scheme of amalgamation with Hill View Infrabuild Limited on December 30, 2024. The stock price opened 5% higher at ₹14.50 on the BSE following the announcement. Hill View Infrabuild, an unlisted public company, acts as an incubator and provides financial support for Salasar Techno's projects.",
            "Sentiment": "positive",
            "PublishDate": 1735624600000,
            "Source": "corporate_action"
        },
        {
            "Title": "Salasar Techno Engineering: Board to Consider Amalgamation with Hill View Infrabuild",
            "Summary": "Salasar Techno Engineering's stock rose up to 7% after announcing a board meeting on December 30, 2024, to consider amalgamation with Hill View Infrabuild Limited.",
            "Sentiment": "positive",
            "PublishDate": 1735189837000,
            "Source": "corporate_action"
        },
        {
            "Title": "Salasar Techno Engineering: Penny Stock Surges on Q2 Performance",
            "Summary": "Salasar Techno Engineering's stock rose over 4% to Rs 16.20 following Q2FY25 results. Revenue increased 2.2% YoY to Rs 2,814.9 million, EBITDA up 3% to Rs 256.6 million, and PAT improved to Rs 96.8 million with margin expansion. The company recently won significant contracts in energy and infrastructure sectors.",
            "Sentiment": "positive",
            "PublishDate": 1732260965000,
            "Source": "earnings"
        },
        {
            "Title": "Salasar Techno Engineering: Q2 Growth and Strategic Wins",
            "Summary": "Salasar Techno Engineering reported Q2 FY25 EPS of Rs 0.06, with revenue of Rs 283.22 crores and net income of Rs 9.60 crore. The company secured contracts worth Rs 1033.78 crore from TANGEDCO and Rs 173.99 crore from RVNL. Foreign institutional investors increased their stake to 8.42% in Q1FY25.",
            "Sentiment": "positive",
            "PublishDate": 1729670488000,
            "Source": "result"
        },
        {
            "Title": "Salasar Techno Engineering Reports Q2 EBITDA Growth",
            "Summary": "Salasar Techno Engineering announced its Q2 financial results. The company's EBITDA increased to 257 million rupees, up from 249 million rupees in the same quarter last year. The EBITDA margin also improved slightly to 9.11% from 9.05% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729585923000,
            "Source": "result"
        },
        {
            "Title": "Salasar Techno Engineering Reports Q2 Revenue Growth",
            "Summary": "Salasar Techno Engineering has reported a revenue of 2.8 billion rupees for the second quarter, compared to 2.75 billion rupees in the same period last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729585763000,
            "Source": "result"
        },
        {
            "Title": "Salasar Techno Engineering Reports Q2 Profit Growth",
            "Summary": "Salasar Techno Engineering has reported a consolidated net profit of 96 million rupees for the second quarter, showing an increase from 91 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729585750000,
            "Source": "result"
        }
    ]
}