{
    "Symbol": "SALSTEEL",
    "ISIN": "INE658G01014",
    "News": [
        {
            "Title": "SAL Steel: Shah Alloys Sells 10.32% Stake",
            "Summary": "Shah Alloys Limited disposed of 1.08 crore shares representing 10.32% stake in SAL Steel Limited through off-market transfer, reducing its total holding to 18.71%.",
            "Sentiment": "neutral",
            "PublishDate": 1766993753967,
            "Source": "co_actions_results"
        },
        {
            "Title": "SAL Care Pvt Ltd Completes Share Disposal to Sree Metaliks",
            "Summary": "SAL Care Private Limited formally disclosed disposal of 1.27 crore equity shares and 48 lakh warrants to Sree Metaliks Limited, completing promoter exit and reclassification to public shareholder status.",
            "Sentiment": "neutral",
            "PublishDate": 1766827394967,
            "Source": "co_actions_results"
        },
        {
            "Title": "SAL Steel Promoter Sells 7.43% Stake for ₹26.89 Cr",
            "Summary": "Shah Alloys Limited, promoter of SAL Steel, disposed of 1.07 crore equity shares representing 7.43% stake through off-market transfer for ₹26.89 crores on December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766761144708,
            "Source": "co_actions_results"
        },
        {
            "Title": "SAL Steel Chairman Rajendrakumar Shah Resigns",
            "Summary": "SAL Steel Limited announces resignation of Chairman and Non-Executive Director Rajendrakumar Shah effective December 23, 2025, pursuant to acquisition by Sree Metaliks Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1766487568051,
            "Source": "stocks"
        },
        {
            "Title": "SAL Steel Board Approves Major Leadership Changes",
            "Summary": "SAL Steel Ltd announces significant board restructuring with three new director appointments and two resignations following acquisition by Sree Metaliks Limited on December 23, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766480586008,
            "Source": "stocks"
        },
        {
            "Title": "SAL Steel Limited Announces Open Offer by Sree Metaliks Limited for 26% Stake at Rs 25 Per Share",
            "Summary": "Sree Metaliks Limited has launched an open offer to acquire up to 3,76,39,342 equity shares (26% of expanded share capital) of SAL Steel Limited at Rs 25 per equity share from public shareholders. The Committee of Independent Directors has recommended the offer as fair and reasonable, with the tendering period scheduled from November 28, 2025 to December 11, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764243544047,
            "Source": "order&deals"
        },
        {
            "Title": "SAL Steel Independent Directors Recommend Open Offer by Sree Metaliks at ₹25 per Share",
            "Summary": "The Committee of Independent Directors of SAL Steel Limited has recommended accepting the open offer by Sree Metaliks Limited to acquire up to 3,76,39,342 equity shares representing 26% of expanded share capital at ₹25 per share. The recommendation was published in multiple newspapers including Financial Express, Jansatta, and regional publications, with the offer price being significantly lower than recent market prices of ₹43.70 and ₹43.38 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1763981812616,
            "Source": "order&deals"
        },
        {
            "Title": "SAL Steel's Independent Directors Approve Open Offer by Sree Metaliks at ₹25 per Share",
            "Summary": "SAL Steel Limited's Independent Directors Committee unanimously approved Sree Metaliks Limited's open offer to acquire up to 3,76,39,342 equity shares (26% of expanded share capital) at ₹25 per share. The committee deemed the offer price fair and reasonable under SEBI regulations, though noted current market prices of ₹43.70-₹43.38 per share are higher than the offer price.",
            "Sentiment": "neutral",
            "PublishDate": 1763802434674,
            "Source": "corporate_governance"
        },
        {
            "Title": "SAL Steel Reports Mixed Quarterly Performance with Auditor Qualifications",
            "Summary": "SAL Steel Limited reported a profit of Rs 3.73 crores for the quarter ended September 30, 2025, compared to a loss of Rs 9.68 crores in the previous quarter, though auditors raised concerns about unprovided electricity duty of Rs 12.69 lakhs and capital work impairment of Rs 100.94 lakhs. The company is undergoing ownership changes with Sree Metaliks Limited acquiring promoter stakes and making an open offer to public shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1763133566047,
            "Source": "earnings"
        },
        {
            "Title": "Sree Metaliks Acquires 39.30% Stake in SAL Steel Through Preferential Allotment",
            "Summary": "Sree Metaliks Limited has acquired a 39.30% stake in SAL Steel Limited through preferential allotment. The acquisition includes 1,92,50,000 equity shares at Rs. 18 per share worth Rs. 34.65 crores, and 3,57,50,000 fully convertible warrants at Rs. 18 per warrant worth Rs. 64.35 crores. The warrants can be converted into equity shares within 18 months from the allotment date. Post-acquisition, Sree Metaliks holds 13.57% in equity shares and 25.34% through warrants. The transaction was completed on November 1, 2025. Following this acquisition and completion of the open offer, Sree Metaliks will be classified as a promoter of SAL Steel, while existing promoters will cease to hold promoter status.",
            "Sentiment": "neutral",
            "PublishDate": 1762146429773,
            "Source": "corporate_action"
        },
        {
            "Title": "SAL Steel Receives Disclosure from Sree Metaliks on Share Allotment",
            "Summary": "SAL Steel Limited received a disclosure from Sree Metaliks Limited regarding the allotment of 1,92,50,000 equity shares and 3,57,50,000 warrants. The allotment was made by SAL Steel's Board of Directors at their meeting held on October 30, 2025, through preferential allotment. The company has informed BSE and NSE about this disclosure under SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762011390295,
            "Source": "corporate_action"
        },
        {
            "Title": "SAL Steel Allots ₹99 Crore Equity Shares and Warrants to Sree Metaliks on Preferential Basis",
            "Summary": "SAL Steel Limited has allotted 1.93 crore equity shares at ₹18 per share for ₹34.65 crore and 3.58 crore convertible warrants at ₹18 per warrant aggregating ₹64.35 crore to Sree Metaliks Limited on a preferential basis. The warrants can be converted into equity shares within 18 months. Following this allotment, the company's paid-up equity share capital increased from ₹84.97 crore to ₹104.22 crore. Sree Metaliks will become a promoter of SAL Steel upon completion of the share purchase agreement and open offer, while existing promoters will cease to be promoters. Post-allotment, assuming full warrant conversion, Sree Metaliks will hold 37.99% shareholding in the company. The allotted securities are subject to lock-in restrictions and will be credited to an escrow account as per regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1761854491533,
            "Source": "corporate_action"
        },
        {
            "Title": "Sree Metaliks Limited Launches Open Offer to Acquire 26% Stake in SAL Steel Limited at ₹25 Per Share",
            "Summary": "Sree Metaliks Limited has announced an open offer to acquire up to 3,76,39,342 equity shares representing 26% of SAL Steel Limited's expanded share capital at ₹25 per share, totaling ₹94.09 crore. The offer follows Sree Metaliks' agreement to acquire control through a share purchase agreement with existing promoters Shah Alloys Limited and SAL Care Private Limited for 4,29,59,495 shares, and a share subscription agreement for preferential allotment of 1,92,50,000 equity shares and 3,57,50,000 warrants worth ₹99 crore. Upon completion, Sree Metaliks will hold 96.98% of SAL Steel's expanded share capital. The tendering period runs from October 31, 2025 to November 14, 2025. SAL Steel operates in manufacturing of Direct Reduced Iron, Ferro Alloys, Iron Ore pellets and steel products, while Sree Metaliks is engaged in iron ore mining, processing and steel manufacturing. The acquirer intends to retain SAL Steel's listing status and continue existing business operations.",
            "Sentiment": "neutral",
            "PublishDate": 1757667519789,
            "Source": "corporate_action"
        },
        {
            "Title": "SAL Steel Receives Open Offer Public Announcement from Sree Metaliks Limited",
            "Summary": "SAL Steel Limited disclosed that it has received a Public Announcement from Sree Metaliks Limited for an Open Offer to acquire equity shares from public shareholders. The announcement was issued by Vivro Financial Services Private Limited on September 4, 2025. The Open Offer is being conducted under the Securities and Exchange Board of India (Substantial Acquisition of Shares and Takeovers) Regulation 2011. SAL Steel has shared this information with stock exchanges BSE Limited and National Stock Exchange of India Limited for dissemination to shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1757043606228,
            "Source": "order&deals"
        },
        {
            "Title": "SAL Steel Limited Approves Share Purchase and Subscription Agreements with Sree Metaliks Limited",
            "Summary": "SAL Steel Limited's board approved two key agreements with Sree Metaliks Limited. Under the Share Purchase Agreement, promoter shareholders Shah Alloys Limited and SAL CARE Private Limited will sell 3,02,56,989 equity shares (33.71% diluted equity) and 1,27,02,506 equity shares plus 48,00,000 warrants respectively to Sree Metaliks Limited. Additionally, a Share Subscription Agreement was approved for SAL Steel to issue 1,92,50,000 equity shares at ₹18 per share (aggregating ₹34.65 crores) and 3,57,50,000 warrants at ₹18 exercise price (aggregating ₹64.35 crores) through preferential allotment. The total fundraising amounts to ₹99 crores. The board also approved increasing authorized share capital from ₹140 crores to ₹145 crores. Post-transaction, Sree Metaliks Limited will hold 37.99% stake and become the new promoter, while existing promoters will be reclassified as public shareholders. The transaction requires shareholder approval and triggers a mandatory open offer under SEBI takeover regulations. The 22nd Annual General Meeting is scheduled for September 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756986741842,
            "Source": "order&deals"
        },
        {
            "Title": "SAL Steel Reports Net Loss of Rs 9.68 Crores in Quarter Ended June 2025",
            "Summary": "SAL Steel Limited reported a net loss of Rs 9.68 crores for the quarter ended June 30, 2025, compared to a net profit of Rs 0.16 crores in the same quarter last year. Revenue from operations increased to Rs 127.55 crores from Rs 110.70 crores year-on-year. Total expenses rose to Rs 140.62 crores, resulting in a loss before tax of Rs 12.94 crores. The company's earnings per share stood at negative Rs 1.14. The Board approved the Directors' Report for the year ended March 31, 2025, and scheduled the 22nd Annual General Meeting for September 26, 2025. The auditors issued a qualified opinion citing non-provision of electricity duty of Rs 90.40 lakhs and failure to impair capital work in progress worth Rs 100.94 lakhs.",
            "Sentiment": "negative",
            "PublishDate": 1755156505280,
            "Source": "earnings"
        }
    ]
}