{
    "Symbol": "SALZERELEC",
    "ISIN": "INE457F01013",
    "News": [
        {
            "Title": "Salzer Electronics Q3FY26 Results & Board Decisions",
            "Summary": "Salzer Electronics reports Q3FY26 financial results with revenue of ₹41,195.20 lakhs and net profit of ₹1,274.05 lakhs. Board approves MD re-appointment and new CFO appointment.",
            "Sentiment": "positive",
            "PublishDate": 1770825389524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Salzer Electronics Q3 FY26 Earnings Call Feb 12",
            "Summary": "Salzer Electronics Limited schedules earnings conference call for February 12, 2026 to discuss Q3 & 9M FY26 operational and financial performance, hosted by Aditya Birla Money Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769767878538,
            "Source": "co_actions_results"
        },
        {
            "Title": "Salzer Electronics Publishes Unaudited Financial Results for Second Quarter Ended September 30, 2025",
            "Summary": "Salzer Electronics Limited has published its unaudited financial results for the second quarter and six months ended September 30, 2025. The company notified stock exchanges BSE and NSE about the publication of these results in Tamil English Daily newspaper. The results are also being posted on the company's website. The communication was signed by K.M. Murugesan, Company Secretary and Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1762156724195,
            "Source": "earnings"
        },
        {
            "Title": "Salzer Electronics Reports 21.7% Revenue Growth in Q2 with Smart Meter Business Expansion",
            "Summary": "Salzer Electronics Limited reported consolidated revenues of ₹418.9 crore for the second quarter, representing 21.7% year-on-year growth. The company's Smart Meter business achieved sales of ₹22 crore during Q2, bringing the first half total to ₹24 crore. EBITDA margin moderated to 8.7% due to higher input costs and initial scaling expenses in the new segment. The company's revenue breakdown shows Industrial Switchgear contributing 63.1%, Wire Cables 31.8%, and Building Electrical Products 5.1%. Export contribution was 23.79% for the quarter. For the first half, consolidated revenues reached ₹860.03 crore, up 22.66% year-on-year, with export contribution at 24.0%. The company was granted a patent for its Disconnecting and Earthing Device for High Voltage Applications. Management aims to sustain double-digit revenue growth for the full year while focusing on improving margins and scaling smart metering operations.",
            "Sentiment": "positive",
            "PublishDate": 1762005805710,
            "Source": "earnings"
        },
        {
            "Title": "Salzer Electronics Reports 75% Jump in Quarterly Profit to Rs 13.47 Crore",
            "Summary": "Salzer Electronics Limited reported a profit after tax of Rs 13.47 crore for the quarter ended September 30, 2025, compared to Rs 26.20 crore in the same quarter last year. Revenue from operations decreased to Rs 408.74 crore from Rs 336.40 crore year-on-year. For the half-year period, the company posted profits of Rs 31.07 crore versus Rs 39.45 crore in the previous year. The company operates in electrical installation products segment. During the six-month period, Salzer invested Rs 21.55 lakh in its wholly owned subsidiary Salzer EV Infra Private Limited and made Effilume Private Limited a direct associate entity by acquiring a 49% stake through its subsidiary.",
            "Sentiment": "neutral",
            "PublishDate": 1761984802724,
            "Source": "earnings"
        },
        {
            "Title": "Salzer Electronics Secures Patent for High-Voltage Disconnecting and Earthing Device",
            "Summary": "Salzer Electronics has obtained a patent for a compact high-voltage disconnecting and earthing device. The patented technology is designed to enhance safety and efficiency in power systems.",
            "Sentiment": "positive",
            "PublishDate": 1759836674473,
            "Source": "stock"
        },
        {
            "Title": "Salzer Electronics Reports 25% Revenue Growth in Q1 FY26, Revises Smart Meter Business Expectations",
            "Summary": "Salzer Electronics reported quarterly revenues of INR 432 crore, up 25% year-on-year from INR 347 crore. EBITDA excluding other income grew 32% to INR 41 crore with a 10% margin. Profit after tax increased 33% to INR 18 crore with a 4% margin. Industrial Switchgear business contributed 55% of revenues with 31% YoY growth and 14% EBITDA margin. Wire and Cables division accounted for 41% of revenues with 17% YoY growth and 5% EBITDA margin. Export revenues grew 14% YoY and 20% quarter-on-quarter, representing 24% of total revenues. The company acknowledged challenges in smart meter business execution due to field-level implementation issues across the industry, with only INR 2.2 crore executed from a INR 50 crore order. Management expects the next INR 50 crore smart meter order in the current quarter. The company sold approximately 50 EV chargers and developed a new temperature sensor for automotive industry validation. US tariffs are expected to impact 7% of direct exports plus 3-4% indirect business. Management maintains revenue guidance of INR 1,600 crore for the year excluding smart meters.",
            "Sentiment": "neutral",
            "PublishDate": 1755189337078,
            "Source": "earnings"
        },
        {
            "Title": "Salzer Electronics Reports 15.6% Revenue Growth in Q1 FY26 Despite Margin Pressure",
            "Summary": "Salzer Electronics Limited reported revenue from operations of Rs 231.37 crore in Q1 FY26, marking a 15.6% increase from Rs 200.15 crore in the previous year quarter. EBITDA grew 10.3% to Rs 23.67 crore, while net profit rose 7.9% to Rs 11.44 crore. However, EBITDA margin contracted to 10.2% from 10.7% due to higher input costs. The company attributed strong revenue growth to increased demand across product segments while maintaining profitability despite cost pressures. Management remains optimistic about growth prospects driven by electrification and automation trends. The company is investing in capacity expansion, automation, and R&D for new products. Management expects demand momentum to continue and targets double-digit revenue growth for full year FY26, with margins likely to improve as input costs stabilize. The company is focusing on high-growth segments including renewable energy and electric vehicles.",
            "Sentiment": "positive",
            "PublishDate": 1754721376204,
            "Source": "earnings"
        },
        {
            "Title": "Salzer Electronics Reports Strong Q1 Growth with Revenue Rising to 4.3 Billion Rupees",
            "Summary": "Salzer Electronics delivered robust quarterly performance with revenue increasing to 4.3 billion rupees from 3.5 billion rupees year-over-year. The company's EBITDA grew to 413 million rupees compared to 312 million rupees in the same period last year, while EBITDA margin improved to 9.6% from 9.01%. Net profit also showed strong growth, rising to 176 million rupees from 132 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754642076049,
            "Source": "earnings"
        },
        {
            "Title": "CRISIL Reaffirms Salzer Electronics' Credit Ratings, Increases Rated Facilities to Rs. 534.62 Crores",
            "Summary": "CRISIL has reaffirmed Salzer Electronics Ltd's credit ratings at CRISIL A/Stable for long-term facilities and CRISIL A1 for short-term facilities following its annual surveillance review. The total rated facilities have been increased from Rs. 410.62 crores to Rs. 534.62 crores. The rating reaffirmation indicates maintained creditworthiness, while the facility increase suggests expanded borrowing capacity for the electrical equipment manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1753506100843,
            "Source": "stock"
        },
        {
            "Title": "Salzer Electronics Reports Q4 Financial Results",
            "Summary": "Salzer Electronics has released its Q4 financial results. The company's EBITDA decreased to 292 million rupees from 331 million rupees year-over-year. The EBITDA margin declined to 7.80% from 10.13% in the same period last year. Consolidated net profit fell to 102 million rupees from 129 million rupees year-over-year. However, revenue increased to 3.76 billion rupees from 3.27 billion rupees compared to the previous year's quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748085635000,
            "Source": "result"
        },
        {
            "Title": "Salzer Electronics Secures ₹192 Crore BBMP Order for Smart Street Lighting in Bengaluru",
            "Summary": "Salzer Electronics has been awarded a ₹192 crore order from the Bruhat Bengaluru Mahanagara Palike (BBMP) for a smart street lighting project in Bengaluru. The project involves implementing smart street lighting solutions in the city.",
            "Sentiment": "positive",
            "PublishDate": 1747896475000,
            "Source": "default"
        },
        {
            "Title": "Salzer Electronics Secures 50 Crore Rupee Order",
            "Summary": "Salzer Electronics has announced winning a new order worth 50 crore rupees. This significant order is likely to boost the company's revenue and potentially impact its financial performance positively.",
            "Sentiment": "positive",
            "PublishDate": 1742186904000,
            "Source": "order&deals"
        },
        {
            "Title": "Salzer Electronics Reports Q3 EBITDA Growth",
            "Summary": "Salzer Electronics announced its Q3 financial results. The company's EBITDA increased to 343 million rupees from 294 million rupees year-over-year. However, the EBITDA margin decreased to 10.29% from 11.20% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739282207000,
            "Source": "earnings"
        },
        {
            "Title": "Salzer Electronics Reports Q3 FY24 Financial Results",
            "Summary": "Salzer Electronics has announced its financial results for the third quarter. The company's net profit increased to 146 million rupees, up from 124 million rupees in the same period last year. Revenue also saw significant growth, reaching 3.34 billion rupees compared to 2.6 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739282202000,
            "Source": "earnings"
        },
        {
            "Title": "Salzer Electronics Reports Improved Q2 EBITDA and Margin",
            "Summary": "Salzer Electronics announced its Q2 financial results, showing an increase in EBITDA to 331 million rupees from 253 million rupees year-over-year. The company's EBITDA margin also improved to 9.85% from 9.24% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731317017000,
            "Source": "result"
        },
        {
            "Title": "Salzer Electronics Reports Q2 Revenue Growth",
            "Summary": "Salzer Electronics has announced its second quarter revenue for the current fiscal year. The company reported revenue of 3.36 billion rupees, compared to 2.74 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731317017000,
            "Source": "result"
        },
        {
            "Title": "Salzer Electronics Reports Significant Profit Increase in Q2",
            "Summary": "Salzer Electronics has reported a substantial increase in net profit for the second quarter. The company's net profit rose to 262 million rupees, up from 94 million rupees in the same period last year, marking a year-over-year growth of approximately 179%.",
            "Sentiment": "positive",
            "PublishDate": 1731316961000,
            "Source": "result"
        }
    ]
}