{
    "Symbol": "SAMBHV",
    "ISIN": "INE12NJ01018",
    "News": [
        {
            "Title": "Sambhav Steel Tubes Signs PLI Scheme MOU with MoS",
            "Summary": "Sambhav Steel Tubes Limited and its subsidiary signed MOU with Ministry of Steel for Production Linked Incentive Scheme 1.2 for Specialty Steel with combined investment of ₹361.75 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770634951794,
            "Source": "stocks"
        },
        {
            "Title": "Sambhv Steel Tubes Q3FY26 Earnings Call on Feb 2",
            "Summary": "Sambhv Steel Tubes Limited has scheduled its Q3FY26 earnings call for February 2, 2026, at 4:00 PM IST to discuss financial performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1769608742824,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sambhv Steel Tubes VP Marketing & Communications Resigns",
            "Summary": "Sambhv Steel Tubes Limited announces resignation of Mr. Prashant Sharma, Vice President - Marketing & Communications, effective February 7, 2026, due to personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1767879153756,
            "Source": "stocks"
        },
        {
            "Title": "Sambhv Steel Tubes Reports 34% Jump in Q3 Sales",
            "Summary": "Sambhv Steel Tubes achieved record sales volume of 97,472 tonnes of value-added products in Q3, marking a significant 34.32% increase from 72,559 tonnes in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1767334816012,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sambhv Steel Tubes Achieves Record Value-Added Sales in Q3",
            "Summary": "Sambhv Steel Tubes Limited reported highest-ever value-added products sales of 90,612 tons in Q3 FY26, with total sales reaching 97,472 tons and strong performance across all segments.",
            "Sentiment": "positive",
            "PublishDate": 1767334788236,
            "Source": "stocks"
        },
        {
            "Title": "Sambhv Steel Tubes Receives Approval for Major Capacity Expansion at Kuthrel Unit",
            "Summary": "Sambhv Steel Tubes has received approval for a significant expansion at its Kuthrel unit, planning to double production capacity for both cold rolling mill and continuous galvanizing line from 58,000 MTPA to 1,16,000 MTPA each. The expansion involves a ₹50 crore investment and is scheduled to launch in Q4 FY26, positioning the company for substantial growth in steel processing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1765248932196,
            "Source": "stock"
        },
        {
            "Title": "Sambhv Steel Tubes Receives Environmental Clearance for Greenfield Integrated Steel Manufacturing Project",
            "Summary": "Sambhv Steel Tubes Limited's wholly owned subsidiary, Sambhv Tubes Private Limited, received Environmental Clearance dated November 24, 2025 from the Government of India for setting up a Greenfield Integrated Steel Manufacturing Project at Village Kesda, Chhattisgarh. The project includes DRI based Sponge Iron (7,00,000 TPA), Iron Ore Pellets (12,00,000 TPA), MS Billets (10,45,000 TPA), and various steel products with a captive power plant of 85MW, with the clearance valid for 10 years.",
            "Sentiment": "positive",
            "PublishDate": 1764052722684,
            "Source": "stock"
        },
        {
            "Title": "Sambhv Steel Tubes Reports Record H1FY26 Performance with 76% Revenue Growth",
            "Summary": "Sambhv Steel Tubes delivered its strongest half-yearly performance with revenue rising 76% to Rs. 1,139 crores, EBITDA growing 94% to Rs. 133 crores, and PAT increasing 109% to Rs. 63 crores. The company is establishing a Rs. 935 crore greenfield project at Kesda with 3,60,000 tons stainless steel capacity targeted for Q4FY27 commissioning, expecting revenue potential of Rs. 2,400-2,800 crores from the first phase.",
            "Sentiment": "positive",
            "PublishDate": 1763063946917,
            "Source": "earnings"
        },
        {
            "Title": "Sambhv Steel Tubes Reports No Deviation in IPO Fund Utilization for September Quarter",
            "Summary": "Sambhv Steel Tubes Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from stated IPO objectives. The company raised Rs. 440 crore through its IPO held from June 25-27, 2025. CARE Ratings Limited, serving as the monitoring agency, confirmed that fund utilization aligned with the offer document. The company used Rs. 390 crore to repay outstanding borrowings across multiple banks including Yes Bank, HDFC, Axis Bank, SBI, and Bajaj Finance Limited. For general corporate purposes, Rs. 20.96 crore was utilized primarily for vendor payments related to raw material purchases. Issue-related expenses consumed Rs. 25.41 crore, with the company claiming Rs. 9.35 crore in reimbursements for earlier expenses and incurring Rs. 16.06 crore in new issue expenses. The unutilized amount of Rs. 3.63 crore remains parked in a Kotak Mahindra Public Offer account. The debt repayment objective was completed as scheduled in Fiscal 2026 with no delays reported.",
            "Sentiment": "neutral",
            "PublishDate": 1762820336561,
            "Source": "stock"
        },
        {
            "Title": "Sambhv Steel Tubes Limited Submits Quarterly Financial Results for September 30, 2025",
            "Summary": "Sambhv Steel Tubes Limited has submitted copies of its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025 to stock exchanges NSE and BSE. The results were published in Business Line (English) and Amrit Sandesh (Hindi) newspapers on November 10, 2025. The submission was made by Company Secretary and Compliance Officer Niraj Shrivastava in compliance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762761856559,
            "Source": "earnings"
        },
        {
            "Title": "Sambhv Steel Tubes Approves Major Capacity Expansion Projects Worth INR 7,550 Million",
            "Summary": "Sambhv Steel Tubes Limited's Board of Directors approved two significant capacity expansion projects on November 8, 2025. The first project involves setting up a Cold Rolling Mill for stainless steel at Kuthrel Unit-II in Raipur, Chhattisgarh. The second is a Greenfield Integrated Steel Manufacturing Project at Village Kesda, Chhattisgarh, which will now be executed directly by the company rather than through its subsidiary Sambhv Tubes Private Limited as originally planned. The expansion includes increasing induction furnace capacity from 3.6 lakh MT to 7.2 lakh MT per annum, hot rolling mill capacity from 4.5 lakh MT to 8.1 lakh MT per annum, and adding 3.6 lakh MT per annum hot rolled pickling plant capacity. The total investment is approximately INR 7,550 million, to be financed through internal accruals and debt. The proposed capacity is expected to be operational by Q4-FY-2027. The company stated the expansion aims to meet captive requirements and growing market demand for their products.",
            "Sentiment": "positive",
            "PublishDate": 1762597282708,
            "Source": "stock"
        },
        {
            "Title": "Sambhv Steel Tubes Reports Strong Q2 Performance with 445% Jump in Net Profit",
            "Summary": "Sambhv Steel Tubes delivered robust quarterly results with net profit surging to 300 million rupees from 55 million rupees in the same period last year. Revenue nearly doubled to 5.8 billion rupees compared to 3.16 billion rupees year-over-year. EBITDA increased significantly to 602.5 million rupees from 224.6 million rupees, while EBITDA margin improved to 10.39% from 7.1% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762594435115,
            "Source": "earnings"
        },
        {
            "Title": "Sambhv Steel Tubes Reports Strong Q2 FY26 Sales Volume Growth Across Product Categories",
            "Summary": "Sambhv Steel Tubes reported total sales volumes of 98,768 tons in Q2 FY26, representing growth from 92,706 tons in Q1 FY26 and 64,489 tons in Q2 FY25. Value-added products reached 89,562 tons compared to 79,717 tons in the previous quarter. The growth was driven by structural pipes and tubes at 57,788 tons and stainless steel coils at 11,567 tons. Pre-galvanised coils and pipes contributed 20,207 tons, while intermediate products totaled 9,206 tons.",
            "Sentiment": "positive",
            "PublishDate": 1759709626464,
            "Source": "stock"
        },
        {
            "Title": "Sambhv Steel Tubes Reports 53% Production Growth in Q2 FY26",
            "Summary": "Sambhv Steel Tubes reported total production of 98,768 tons in Q2 FY26, representing a 6.5% increase from 92,706 tons in Q1 FY26 and a 53% jump from 64,489 tons in Q2 FY25. The company's value-added products reached 89,562 tons in Q2 FY26, up from 79,717 tons in Q1 FY26. Structural pipes and tubes contributed 57,788 tons while stainless steel coils added 11,567 tons to the high-value product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1759579810499,
            "Source": "stock"
        },
        {
            "Title": "Sambhv Steel Tubes Reports Record Quarterly Results, Revenue Up 69% YoY in Q1 FY26",
            "Summary": "Sambhv Steel Tubes Limited achieved its highest-ever quarterly performance with revenue from operations rising 69% year-on-year to INR 559 crores in Q1 FY26. EBITDA increased 58% YoY to INR 73 crores with margins at 13%, while PAT grew 35% YoY to INR 33 crores. The company achieved record quarterly sales volume with 50% YoY growth and EBITDA per ton of INR 7,800. The company successfully raised INR 440 crores through its IPO in July 2025 and debuted on stock exchanges. Sambhv is expanding capacity with consent received to enhance GP coils and stainless steel coils capacity from 58,000 to 116,000 metric tons per annum each. A major Greenfield project is underway at Kesda with planned capacity addition of 1.2 million tons of finished products across three phases, with Phase 1 expected by end of FY27. The company operates as a backward-integrated manufacturer of structural pipes, tubes, and value-added products including ERW pipes, GI pipes, and stainless steel coils, supported by 43 distributors and over 700 dealers.",
            "Sentiment": "positive",
            "PublishDate": 1753770017577,
            "Source": "earnings"
        },
        {
            "Title": "Sambhv Steel Tubes Targets Rs 4,500 Crore Revenue By FY28 Through Capacity Expansion",
            "Summary": "Sambhv Steel Tubes plans to double its revenue to Rs 4,500 crore by FY28, up from projected Rs 2,200-2,300 crore in FY26. The company reported Q1FY26 revenue of Rs 558 crore. MD and CEO Vikas Goyal outlined plans to increase stainless steel capacity by 200% and pipe capacity by 50%. The company will shift its product mix toward stainless steel, targeting 30% in FY26, 40% the following year, and 50% by FY28. Growth will be driven by a new 1.2 million-tonne plant in Kesda, Chhattisgarh, executed in three phases with the first phase starting by end of FY27, adding 1,80,000 tonnes each of pipes and stainless steel capacity. Chief Strategy Officer Bikash Agrawal stated the company is virtually debt-free with Rs 20 crore monthly free cash flow, and enterprise debt will remain below 0.5 times equity base, capping total debt under Rs 500 crore. Goyal cited the company's backward integration model and location in mineral-rich Chhattisgarh as advantages, along with India's projected 8-10% annual infrastructure growth and reduced stainless steel imports driving future growth.",
            "Sentiment": "positive",
            "PublishDate": 1753591027457,
            "Source": "stock"
        },
        {
            "Title": "Sambhv Steel Plans 1.2 MTPA Capacity Expansion and Coastal Distribution Network",
            "Summary": "Sambhv Steel has announced plans for a 1.2 million tonnes per annum (MTPA) capacity expansion along with developing coastal distribution capabilities. The company aims to boost its value-added products portfolio and maintain high-margin growth through FY27 with this expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1753367352174,
            "Source": "stock"
        },
        {
            "Title": "Sambhv Steel Tubes Reports Strong Q1 Performance with 69% Revenue Growth",
            "Summary": "Sambhv Steel Tubes Limited reported quarterly results for the period ended June 30, 2025. The company's revenue from operations increased to INR 5,586.29 million compared to INR 3,307.75 million in the same quarter last year. Net profit rose to INR 333.99 million from INR 247.55 million year-over-year. Earnings per share improved to INR 1.39 from INR 1.03. The company completed its Initial Public Offer of 6,58,64,549 equity shares aggregating to INR 5,400 million, with shares listed on NSE and BSE on July 2, 2025. During the quarter, the company divested its interest in Clean Max Opia Pvt. Ltd. due to the associate's failure to fulfill obligations under an Energy Supply Agreement. The company operates in steel products manufacturing with primary operations in India.",
            "Sentiment": "positive",
            "PublishDate": 1753359449248,
            "Source": "earnings"
        },
        {
            "Title": "Sambhv Steel Tubes Schedules Q1 FY2026 Earnings Call for July 25, 2025",
            "Summary": "Sambhv Steel Tubes Limited will hold an investor earnings call on July 25, 2025, at 3:30 PM IST to discuss the company's Q1 FY2026 financial performance. The call will be hosted by Go India Advisors and feature key management participants including MD & CEO Vikas Kumar Goyal, CFO Anu Garg, Chief Strategy Officer Bikash Agrawal, and AVP - Investor Relations Mayank Agrawal. The company has provided dial-in numbers and registration details for investors to participate in the earnings discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1753189491430,
            "Source": "earnings"
        },
        {
            "Title": "Sambhv Steel Tubes Schedules Board Meeting to Review Quarterly Financial Results",
            "Summary": "Sambhv Steel Tubes Limited has scheduled a Board of Directors meeting for July 24, 2025, to consider the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company trades on NSE under symbol SAMBHV and on BSE with scrip code 544430. The meeting intimation has been made available on the company's website at www.sambhv.com.",
            "Sentiment": "neutral",
            "PublishDate": 1753158449705,
            "Source": "corporate_action"
        },
        {
            "Title": "Sambhv Steel Tubes: Newly Listed Stock Enters ASM Framework",
            "Summary": "Sambhv Steel Tubes Ltd., listed on July 2, entered Stage 1 of the Short-term Additional Surveillance Measures (ASM) framework within nine trading days. The stock experienced price variations of 5% or more in five out of nine sessions. Under ASM Stage 1, the stock faces increased margin requirements and heightened scrutiny.",
            "Sentiment": "neutral",
            "PublishDate": 1752534935000,
            "Source": "normal_news"
        },
        {
            "Title": "Sambhv Steel Tubes Reports Q1 FY26 Sales Volume",
            "Summary": "Sambhv Steel Tubes has reported a total sales volume of 92,706 tons for the first quarter of the fiscal year 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1752496625000,
            "Source": "default"
        },
        {
            "Title": "Sambhv Steel Tubes Reports Q4 EBITDA Growth",
            "Summary": "Sambhv Steel Tubes has reported its Q4 EBITDA at 482 million rupees, compared to 370 million rupees in the same quarter last year, showing a year-over-year increase. However, the company's Q4 EBITDA margin decreased to 9.7% from 10.3% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1752482482000,
            "Source": "result"
        },
        {
            "Title": "Sambhv Steel Tubes Reports Q4 Financial Results",
            "Summary": "Sambhv Steel Tubes has announced its Q4 financial results. The company reported a net profit of 165 million rupees, compared to 171 million rupees in the same quarter last year. Revenue for Q4 increased to 4.95 billion rupees from 3.58 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1752482418000,
            "Source": "result"
        }
    ]
}