{
    "Symbol": "SAMBHAAV",
    "ISIN": "INE699B01027",
    "News": [
        {
            "Title": "Sambhaav Media Q3FY26 Results: Revenue Rises to ₹1,018.49L",
            "Summary": "Sambhaav Media reported revenue of ₹1,018.49 lakhs for Q3FY26 ended December 31, 2025, with net profit of ₹51.99 lakhs from continuing operations. The company converted investments worth ₹1,675.00 lakhs into equity shares of Gujarat News Broadcaster Private Limited.",
            "Sentiment": "positive",
            "PublishDate": 1769515220261,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sambhaav Media Reports Mixed Q2 Results, Reappoints MD and Plans Strategic Acquisition",
            "Summary": "Sambhaav Media Limited announced its quarterly results for the second quarter ended September 30, 2025. The company reported a standalone net profit of ₹0.70 lakhs compared to ₹26.20 lakhs in the previous quarter. For the half-year period, standalone net profit reached ₹25.87 lakhs versus ₹103.63 lakhs in the corresponding period last year. The Board approved the reappointment of Manoj B. Vadodaria as Managing Director for three years effective January 28, 2026. The company also approved further acquisition of equity shares in Gujarat News Broadcasters Private Limited through conversion of existing preference shares and compulsory convertible debentures, which will increase Sambhaav Media's shareholding to 36.85%, making it an associate company. The target company operates Gujarati News TV Channel with a turnover of ₹3,419.25 lakhs for FY24-25. The company continues to face ongoing Income Tax assessment proceedings for years 2021-22 and 2022-23, with the final impact remaining uncertain.",
            "Sentiment": "neutral",
            "PublishDate": 1762933602256,
            "Source": "corporate_action"
        },
        {
            "Title": "Sambhaav Media Reports Mixed Q1 FY26 Results with Standalone Profit and Consolidated Loss",
            "Summary": "Sambhaav Media Limited reported its quarterly results for the period ended June 30, 2025. On a standalone basis, the company posted a net profit of ₹0.70 lakhs compared to a loss of ₹0.26 lakhs in the same quarter last year. Revenue from operations increased to ₹814.65 lakhs from ₹786.73 lakhs year-over-year. However, on a consolidated basis, the company recorded a net loss of ₹27.82 lakhs compared to a loss of ₹14.68 lakhs in the previous year. The company operates through two main segments: Media and Allied Business, and Technology and Allied Business. The results include an ongoing Income Tax Department assessment matter from a 2021 search operation, with notices received for assessment years 2021-22 and 2022-23. The company has one subsidiary, Ved Technoserve India Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754465058975,
            "Source": "earnings"
        },
        {
            "Title": "Sambhaav Media Limited Schedules Board Meeting for August 6, 2025 to Approve Quarterly Financial Results",
            "Summary": "Sambhaav Media Limited has scheduled a Board of Directors meeting for August 6, 2025, to review and approve the unaudited financial results for the first quarter ended June 30, 2025. The company has also closed its trading window for insiders until 48 hours after the results are announced.",
            "Sentiment": "neutral",
            "PublishDate": 1753707494578,
            "Source": "corporate_action"
        }
    ]
}