{
    "Symbol": "SAMHI",
    "ISIN": "INE08U801020",
    "News": [
        {
            "Title": "SAMHI Hotels Shares Q3FY26 Earnings Call Recording",
            "Summary": "SAMHI Hotels Limited has made available the audio recording of its earnings call held on January 29, 2026, discussing Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769694670000,
            "Source": "co_actions_results"
        },
        {
            "Title": "SAMHI Hotels Board Meet Set for Jan 28 Q3FY26 Results",
            "Summary": "SAMHI Hotels Limited has scheduled a board meeting on January 28, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769087457335,
            "Source": "co_actions_results"
        },
        {
            "Title": "SAMHI Hotels Subsidiaries Receive New Credit Ratings from CARE Ratings",
            "Summary": "CARE Ratings Limited assigned CARE A+ (Stable) ratings to long-term bank facilities of SAMHI Hotels subsidiaries - Rs 353 crore for SAMHI Hotels (Ahmedabad) Private Limited and Rs 30 crore for Paulmech Hospitality Private Limited. The rating agency also withdrew its earlier rating on Non-Convertible Debentures of SAMHI Hotels (Ahmedabad) Private Limited as the company has fully repaid the NCD issue.",
            "Sentiment": "positive",
            "PublishDate": 1764752857495,
            "Source": "corporate_action"
        },
        {
            "Title": "Samhi Hotels Targets Double-Digit Growth Through Asset-Light Expansion Strategy",
            "Summary": "Samhi Hotels is pursuing margin expansion through operating leverage and portfolio optimization. The company is strengthening its presence in key business hubs including Bengaluru, Hyderabad, and Pune. Samhi Hotels plans to achieve double-digit growth through asset-light expansion using new management contracts and brand partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1762874974913,
            "Source": "stock"
        },
        {
            "Title": "SAMHI Hotels Reports Strong Q2 Performance with Major Mumbai and Hyderabad Expansion Plans",
            "Summary": "SAMHI Hotels delivered robust quarterly results with total income of INR 296 crores, up 11% year-on-year, and EBITDA of INR 110 crores, marking a 14% increase with margins improving to 37.3%. Same-store RevPAR grew 11.2% to INR 5,026. The company announced two major growth projects: a landmark dual-branded hotel development in Navi Mumbai under Westin and Fairfield brands with 400 rooms in Phase 1 (expandable to 700 rooms) requiring INR 650 crores investment, and a 260-room mid-scale hotel in Hyderabad Financial District under a long-term variable lease structure. Net debt to EBITDA improved to 2.9x, with average interest cost falling to 8.5% and credit rating upgraded to A+ with stable outlook. The company reported profit after tax of INR 99 crores, including a reversal of Navi Mumbai land impairment of INR 57 crores following MIDC extension confirmation. Management expects H2 performance to significantly exceed H1 results and maintains revenue growth guidance of 9-11% CAGR for same-store hotels.",
            "Sentiment": "positive",
            "PublishDate": 1762281841965,
            "Source": "earnings"
        },
        {
            "Title": "SAMHI Hotels Plans Aggressive Expansion With 700-Room Navi Mumbai Project and Hyderabad Lease",
            "Summary": "SAMHI Hotels is pursuing an aggressive growth strategy through a dual-brand project in Navi Mumbai featuring approximately 700 rooms and a lease agreement in Hyderabad's Financial District. The company plans to add 8% to its inventory in FY26 and reported 16% EBITDA growth in H1. SAMHI Hotels has set a target of achieving 9-11% CAGR growth in RevPAR for FY27.",
            "Sentiment": "positive",
            "PublishDate": 1761667354592,
            "Source": "stock"
        },
        {
            "Title": "Samhi Hotel Reports Same-Store Growth Aligned with 9%-11% CAGR Forecast",
            "Summary": "Samhi Hotel has reported same-store growth that aligns with its previously forecasted compound annual growth rate of approximately 9%-11%. The company's ongoing performance is meeting its projected growth targets.",
            "Sentiment": "positive",
            "PublishDate": 1761662735786,
            "Source": "stock"
        },
        {
            "Title": "SAMHI Hotels Provides Corporate Guarantees Worth INR 380 Crores for Subsidiary Credit Facilities",
            "Summary": "SAMHI Hotels Limited will extend corporate guarantees, issue non-disposal undertakings, and create pledges over securities held in its wholly owned subsidiaries, totaling up to INR 380 crores. The guarantees favor IndusInd Bank Limited for credit facilities availed by two subsidiaries: Argon Hotels Private Limited (INR 112 crores) and Barque Hotels Private Limited (INR 268 crores). For each subsidiary, SAMHI will provide an irrevocable corporate guarantee, pledge 30% of the subsidiary's paid-up share capital, and issue a non-disposal undertaking for 21% of the share capital. The company states these guarantees will have no impact on the listed entity and are being provided on an arm's length basis.",
            "Sentiment": "neutral",
            "PublishDate": 1761661526958,
            "Source": "stock"
        },
        {
            "Title": "SAMHI Hotels Reports Strong Q2 Performance and Approves Hotel Asset Restructuring",
            "Summary": "SAMHI Hotels Limited announced its unaudited financial results for the quarter and six months ended September 30, 2025. The Board of Directors approved the quarterly results during a meeting held on October 28, 2025. Additionally, the company approved restructuring within the group, involving the transfer of an operating hotel (Fairfield by Marriott, Hyderabad) from Duet India Hotels (Hyderabad) Private Limited to Caspia Hotels Private Limited through a demerger process requiring National Company Law Tribunal approval. Both entities are wholly owned subsidiaries of SAMHI Hotels. The company also completed the sale of its Caspia hotel business undertaking on August 13, 2025, for INR 639.87 million. The results show the company operates in the hotel development and operations segment, with Walker Chandiok & Co LLP serving as statutory auditors for the limited review of these financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1761658482292,
            "Source": "earnings"
        },
        {
            "Title": "SAMHI Hotels Reports 633% Jump in Q2 Net Profit to 924 Million Rupees",
            "Summary": "SAMHI Hotels reported a consolidated net profit of 924 million rupees for Q2, representing a significant increase from 126 million rupees in the same period last year. The company's revenue grew to 2.93 billion rupees compared to 2.62 billion rupees year-over-year. EBITDA increased to 1.79 billion rupees from 1.75 billion rupees, though the EBITDA margin declined to 61.25% from 66.78% in the previous year. The company also recorded an exceptional item of 841 million rupees during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761657764453,
            "Source": "earnings"
        },
        {
            "Title": "Samhi Hotels Receives Extension for Navi Mumbai Project, Plans 400-Room Dual-Branded Hotel",
            "Summary": "Samhi Hotels has received an extension from MIDC for the development of its Navi Mumbai project land. The company plans to construct a dual-branded hotel featuring Westin and Fairfield by Marriott brands, with approximately 400 rooms planned for Phase One of the development.",
            "Sentiment": "positive",
            "PublishDate": 1761576113815,
            "Source": "stock"
        },
        {
            "Title": "Samhi Hotels Expects 10-15% Revenue Boost from Proposed GST Rate Cut on Hotel Rooms",
            "Summary": "Samhi Hotels anticipates a 10-15% revenue increase if GST on hotel rooms priced at ₹7,500 or below is reduced from the current 12% (with input tax credit) to 5% (without input tax credit). Chairman and Managing Director Ashish Jakhanwala stated that 60-65% of Samhi's rooms fall under this pricing category, contributing 45-50% of revenues through properties like Holiday Inn Express and Fairfield by Marriott. The company reported quarterly revenues of ₹272.2 crore with EBITDA of ₹90.5 crore and margins at 33.2%. Domestic business accounts for 75% of operations while international guests contribute 25%. The stock trades at ₹207.08 with a market capitalization of ₹4,536 crore.",
            "Sentiment": "positive",
            "PublishDate": 1756444707333,
            "Source": "stock"
        },
        {
            "Title": "SAMHI Hotels Subsidiary Signs Lease Agreement for 260-Room Hotel in Hyderabad Financial District",
            "Summary": "Barque Hotels Private Limited, a wholly owned subsidiary of SAMHI Hotels Limited, executed an Agreement to Lease on August 27, 2025, with lessors Mrs. P Pramoda, Mrs. P Harika and Aurean Eskar for a 260-room mid-scale hotel in Hyderabad's Financial District. The hotel will be developed as part of a mixed-use project, with Aurean Eskar Homes LLP first developing the building within a pre-defined timeframe. SAMHI will then take possession for hotel fitouts and branding, with estimated development costs of ₹1,250-1,430 million. The transaction is structured as a long-term variable lease that ties land valuation to hotel operating performance. This adds a third hotel offering to SAMHI's existing properties in the area - a 326-key Sheraton and 232-key Fairfield by Marriott. The agreement supports SAMHI's strategy to capture multiple price points within core micro markets and is subject to customary conditions and building sanctions.",
            "Sentiment": "positive",
            "PublishDate": 1756297248512,
            "Source": "stock"
        },
        {
            "Title": "SAMHI Hotels Plans Growth Through Asset Rebranding and Portfolio Expansion",
            "Summary": "SAMHI Hotels is targeting growth through asset rebranding, portfolio expansion, and capital recycling strategies. The company's balance sheet has been strengthened following a deal with GIC, which positions it to pursue value-accretive mergers and acquisitions as well as variable lease expansion opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1755102844232,
            "Source": "stock"
        },
        {
            "Title": "SAMHI Hotels Reports Strong Quarterly Performance with INR 458.88 Million Profit",
            "Summary": "SAMHI Hotels Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported a standalone profit of INR 458.88 million compared to a loss of INR 2.85 million in the same quarter last year. Revenue from operations stood at INR 337.54 million. The company recorded exceptional gains of INR 974.93 million primarily from the sale of investment in a subsidiary. On a consolidated basis, the group reported a profit of INR 192.16 million for the quarter. The company proposed the sale of its Caspia hotel business undertaking, which has been classified as discontinued operations. An investor, Reco Bellflower Private Limited (affiliate of GIC Pte. Limited), made primary investments to hold 35% equity in three target companies with a combined enterprise value of INR 22,000 million.",
            "Sentiment": "positive",
            "PublishDate": 1755092922200,
            "Source": "earnings"
        },
        {
            "Title": "SAMHI Hotels Reports Strong Q1 Performance with 19% Revenue Growth",
            "Summary": "SAMHI Hotels delivered robust quarterly results with revenue rising to 2.7 billion rupees from 2.5 billion rupees year-over-year. The company's EBITDA increased significantly to 1.06 billion rupees compared to 890 million rupees in the previous year, while EBITDA margin expanded to 38.80% from 35.61%. Consolidated net profit surged to 173 million rupees versus 42 million rupees year-over-year, representing substantial improvement in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1755089168878,
            "Source": "earnings"
        },
        {
            "Title": "Samhi Hotels: Smallcap Stock Hits All-Time High, Up 98% in 3 Months",
            "Summary": "Samhi Hotels stock reached a new all-time high of Rs 240.30 on July 10, 2025, representing a 98.4% surge from its April 7 low of Rs 121.10. Madhuri Kela holds a 1.69% stake in the company. The stock is up 53.20% in the last three months and 13.20% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1752311359000,
            "Source": "normal_news"
        },
        {
            "Title": "Samhi Hotels Reports Q4 Financial Results",
            "Summary": "Samhi Hotels has reported its quarterly financial results. The company's consolidated net profit for Q4 was 459 million rupees, compared to 113 million rupees in the same quarter last year (year-over-year) and 228 million rupees in the previous quarter (quarter-over-quarter). Revenue for Q4 was 3.2 billion rupees, up from 2.79 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748559774000,
            "Source": "default"
        },
        {
            "Title": "SAMHI Hotels Reports Strong Q4 Financial Performance",
            "Summary": "SAMHI Hotels has reported its Q4 financial results. The company's EBITDA increased to 1.2 billion rupees from 962 million rupees year-over-year. The EBITDA margin improved to 39.62% from 34.46% in the same period last year. Consolidated net profit rose to 459 million rupees, up from 113 million rupees year-over-year and 228 million rupees quarter-over-quarter. Revenue for Q4 reached 3.2 billion rupees, compared to 2.79 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748528740000,
            "Source": "result"
        },
        {
            "Title": "SAMHI Hotels Approves 450 Million Rupee Investment in Ascent Hotels",
            "Summary": "The board of SAMHI Hotels has approved an investment of 450 million rupees in Ascent Hotels. This decision represents a significant corporate action, potentially aimed at expanding SAMHI's portfolio or strengthening its market position.",
            "Sentiment": "positive",
            "PublishDate": 1747227906000,
            "Source": "default"
        },
        {
            "Title": "Samhi Hotels: Blue Chandra Exits with Rs 150-Crore Stake Sale",
            "Summary": "Blue Chandra Pte Ltd., a subsidiary of Equity International Fund V, has sold its entire 3.94% stake in Samhi Hotels Ltd. for approximately Rs 152 crore. The block deal involved selling 87.21 lakh shares at Rs 174.3 per share. Major buyers include BoFA Securities Europe SA, Citigroup Global Markets Mauritius Pvt, Steinberg India Emerging Opportunities Fund Ltd., and Tata Mutual Fund.",
            "Sentiment": "neutral",
            "PublishDate": 1745945038000,
            "Source": "block_deals"
        },
        {
            "Title": "Samhi Hotels: GIC Acquires 35% Stake in Three Subsidiaries for ₹752 Crore",
            "Summary": "Samhi Hotels has entered a joint venture with GIC, selling 35% stake in three subsidiaries for ₹752 crore. The deal aims to reduce debt by ₹580 crore and boost profit after tax by 15-20%. The transaction involves an enterprise value of ₹2,200 crore for the three subsidiaries.",
            "Sentiment": "positive",
            "PublishDate": 1745463741000,
            "Source": "corporate_action"
        },
        {
            "Title": "SAMHI Hotels and GIC Form Strategic Partnership for Hotel Investment in India",
            "Summary": "SAMHI Hotels and GIC have announced a strategic partnership to create an upscale+ hotel investment platform in India. The partnership involves an equity investment plan of up to USD 300 million (approximately 2,566 crore rupees).",
            "Sentiment": "positive",
            "PublishDate": 1745461836000,
            "Source": "default"
        },
        {
            "Title": "Samhi Hotels: Stock Surges 45% from 52-Week Low, Analyst Sets ₹243 Target",
            "Summary": "Samhi Hotels stock has risen over 45% from its 52-week low. PhillipCapital India initiates coverage with a 'Buy' rating and ₹243 target price, citing potential 38% growth. The company's strategic investments in major office markets and focus on upper upscale segments are expected to drive growth. Analysts project improved occupancy levels and RevPAR growth over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1745312754000,
            "Source": "normal_news"
        },
        {
            "Title": "Samhi Hotels: Double-Digit Revenue Growth Projected Amid Expansion",
            "Summary": "Samhi Hotels expects mid-to-high teens total revenue growth over the next 3-4 years, driven by stable hotel performance and expansion. The company plans annual capex of Rs 700-800 crore for the next four years, funded by internal accruals. FII stake reduction from 64.6% to 54.8% attributed to pre-IPO investors exiting. The company aims to reduce net debt-to-EBITDA ratio below 3.5 times in 12-15 months.",
            "Sentiment": "positive",
            "PublishDate": 1743233400000,
            "Source": "normal_news"
        },
        {
            "Title": "Samhi Hotels to Sell 100% Stake in Chennai Property for 535 Million Rupees",
            "Summary": "Samhi Hotels has announced its decision to sell its entire stake in a Chennai property, Duet Chennai OMR. The company has stated that the consideration for this sale is 535 million rupees. This move represents a significant corporate action for Samhi Hotels, potentially impacting its portfolio and financial position.",
            "Sentiment": "neutral",
            "PublishDate": 1739233157000,
            "Source": "corporate_action"
        },
        {
            "Title": "SAMHI Hotels to Sell 100% Stake in Duet Chennai OMR for 535 Million Rupees",
            "Summary": "SAMHI Hotels has announced its intention to divest its entire stake in Duet Chennai OMR. The company has stated that the consideration for this sale is set at 535 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1739197256000,
            "Source": "corporate_action"
        },
        {
            "Title": "Samhi Hotels Ltd.: 35% Revenue Growth Expected Through Acquisitions and Portfolio Mix Shift",
            "Summary": "Samhi Hotels Ltd. anticipates 35% revenue growth in the next few years, driven by recent acquisitions in Bengaluru and Hyderabad, and a shift towards more upscale hotels. The company expects to improve margins in FY26, potentially exceeding 40% EBITDA. Q4 is projected to outperform Q3 due to increased MICE segment activity.",
            "Sentiment": "positive",
            "PublishDate": 1738475281000,
            "Source": "normal_news"
        },
        {
            "Title": "Samhi Hotels Reports Profitable Q3 FY2024",
            "Summary": "Samhi Hotels has reported a consolidated net profit of 228 million rupees in Q3 FY2024, compared to a loss of 744 million rupees in the same quarter last year. The company's revenue increased to 2.96 billion rupees from 2.7 billion rupees year-over-year. Sequentially, net profit improved from 126 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738197210000,
            "Source": "earnings"
        },
        {
            "Title": "SAMHI Hotels Reports Strong Q3 EBITDA Growth",
            "Summary": "SAMHI Hotels has reported a significant increase in its Q3 EBITDA, rising to 1.13 billion rupees from 904 million rupees in the same period last year. The company's EBITDA margin also improved, reaching 38.27% compared to 33.76% in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738159161000,
            "Source": "earnings"
        },
        {
            "Title": "SAMHI Hotels Reports Profitable Q3 FY2024",
            "Summary": "SAMHI Hotels has reported a consolidated net profit of 228 million rupees for the third quarter, compared to a loss of 744 million rupees in the same quarter last year. The company's revenue increased to 2.96 billion rupees from 2.7 billion rupees year-over-year. Sequentially, the net profit improved from 126 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738159088000,
            "Source": "earnings"
        },
        {
            "Title": "SAMHI Hotels to Consider Q3 Results on January 29",
            "Summary": "SAMHI Hotels has announced that it will consider its third quarter (Q3) financial results on January 29. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737722391000,
            "Source": "earnings"
        },
        {
            "Title": "SAMHI Hotels to Invest 205 Million Rupees in Chennai Property",
            "Summary": "SAMHI Hotels has announced plans to invest up to 205 million rupees in Duet Chennai OMR, indicating a significant expansion or upgrade of their property in Chennai's Old Mahabalipuram Road area. This investment suggests SAMHI Hotels' commitment to strengthening its presence in the Chennai hospitality market.",
            "Sentiment": "positive",
            "PublishDate": 1737449383000,
            "Source": "corporate_action"
        },
        {
            "Title": "Samhi Hotels Ltd.: Double-Digit Revenue Growth Expected in Coming Quarters",
            "Summary": "Samhi Hotels Ltd. anticipates high single-digit to early double-digit revenue growth in the next few quarters and fiscal years. The company turned profitable in Q2 FY2024-25 with a PAT of Rs 12.6 crore. Reduced finance costs and strong RevPAR growth across cities contribute to the positive outlook.",
            "Sentiment": "positive",
            "PublishDate": 1732246558000,
            "Source": "earnings"
        },
        {
            "Title": "SAMHI Hotels: CEO Confident on Capex Guidance, Expects Stable Finance Costs",
            "Summary": "SAMHI Hotels' CEO is confident about meeting capex guidance. Finance costs are expected to remain stable in coming quarters. Strong revenue per available room growth anticipated in Bangalore, with significant revenue per key growth driven by upper upscale properties.",
            "Sentiment": "positive",
            "PublishDate": 1732167257000,
            "Source": "normal_news"
        },
        {
            "Title": "SAMHI Hotels Expands Partnership with Marriott International",
            "Summary": "SAMHI Hotels has signed an agreement with Marriott International for the management of three additional hotels. This move indicates an expansion of their existing partnership and potentially increases SAMHI's portfolio of Marriott-managed properties.",
            "Sentiment": "positive",
            "PublishDate": 1731502895000,
            "Source": "corporate_action"
        },
        {
            "Title": "SAMHI Hotels Reports Strong Q2 Financial Performance",
            "Summary": "SAMHI Hotels has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 972 million rupees from 541 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 36.61% from 24.59% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731068470000,
            "Source": "result"
        },
        {
            "Title": "SAMHI Hotels Reports Profit in Q2 FY2024",
            "Summary": "SAMHI Hotels has reported a consolidated net profit of 126 million rupees in Q2 FY2024, compared to a loss of 880 million rupees in the same quarter last year. The company's revenue increased to 2.6 billion rupees from 2.2 billion rupees year-over-year. Sequentially, the net profit improved from 42 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731068393000,
            "Source": "result"
        },
        {
            "Title": "SAMHI Hotels to Convert Office Building into Upscale Hotel in Hyderabad",
            "Summary": "SAMHI Hotels has announced plans to convert an existing office building in Hitec City, Hyderabad, into an upper upscale hotel. The project aims to create 170-175 rooms, demonstrating the company's expansion efforts in the hospitality sector.",
            "Sentiment": "positive",
            "PublishDate": 1731042671000,
            "Source": "corporate_action"
        },
        {
            "Title": "SAMHI Hotels Acquires Innmar Tourism and Hotels",
            "Summary": "<p>SAMHI Hotels has approved the <span class='positive'>acquisition</span> of <b>100%</b> share capital of Innmar Tourism and Hotels for <b>205 crore rupees</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728022523000,
            "Source": "corporate_action"
        }
    ]
}