{
    "Symbol": "SAMMAANCAP",
    "ISIN": "INE148I01020",
    "News": [
        {
            "Title": "Sammaan Capital Q3FY26 Monitoring Report Released",
            "Summary": "CRISIL releases monitoring agency report for Sammaan Capital's Q3FY26 quarter ended December 31, 2025, covering Rights Issue and QIP proceeds utilization under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770648548645,
            "Source": "stocks"
        },
        {
            "Title": "Sammaan Capital Completes NCD Payment & Redemption",
            "Summary": "Sammaan Capital Limited successfully paid ₹461.18 lacs interest and redeemed ₹5,000 lacs principal on secured non-convertible debentures ahead of February 7, 2026 due date.",
            "Sentiment": "positive",
            "PublishDate": 1770380925053,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital Board Meet Set for Feb 4, 2026",
            "Summary": "Sammaan Capital Limited has scheduled a board meeting for February 4, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769871733034,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital pays debenture interest early",
            "Summary": "Sammaan Capital Limited has made timely interest payments totaling ₹6.26199 lacs on its secured non-convertible debentures across four ISIN series, paying four days ahead of the January 27, 2026 due date.",
            "Sentiment": "positive",
            "PublishDate": 1769186096137,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital pays ₹96.25L interest on NCDs",
            "Summary": "Sammaan Capital Limited successfully paid ₹96.25 lakh interest on eight series of secured non-convertible debentures on January 16, 2026, three days ahead of the due date.",
            "Sentiment": "positive",
            "PublishDate": 1768575673667,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital allots ₹115 cr NCDs at 9.05% rate",
            "Summary": "Sammaan Capital Limited successfully allotted 11,500 secured non-convertible debentures worth ₹115 crores on private placement basis with 9.05% coupon rate and 10-year tenor.",
            "Sentiment": "positive",
            "PublishDate": 1768548095632,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital Issues ₹115 Cr NCDs at 9.05%",
            "Summary": "Sammaan Capital raises ₹115 crore through private placement of 11,500 non-convertible debentures with 9.05% coupon rate, maturing in January 2036.",
            "Sentiment": "positive",
            "PublishDate": 1768547752553,
            "Source": "stocks"
        },
        {
            "Title": "Sammaan Capital pays ₹63.70 lacs interest on NCDs",
            "Summary": "Sammaan Capital Limited successfully paid ₹63.70 lacs interest on its secured redeemable non-convertible debentures one day ahead of the January 15, 2026 due date, maintaining compliance with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1768393686947,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital Pays ₹348.25 Lacs Interest on NCDs",
            "Summary": "Sammaan Capital Limited successfully paid ₹348.25 lacs interest on its secured redeemable non-convertible debentures one day ahead of the January 14, 2026 due date, maintaining timely payment obligations.",
            "Sentiment": "positive",
            "PublishDate": 1768313637301,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital Pays ₹27.42L Interest on NCDs",
            "Summary": "Sammaan Capital Limited successfully paid ₹27.42 lakhs in monthly interest across seven series of secured redeemable non-convertible debentures on January 8, 2026, one day ahead of the due date.",
            "Sentiment": "positive",
            "PublishDate": 1767882004573,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital Board Approves Arrangement Plan",
            "Summary": "Sammaan Capital's board has approved an arrangement plan involving the company and Sammaan Finserve, marking a significant corporate development for the finance sector entity.",
            "Sentiment": "neutral",
            "PublishDate": 1767190852668,
            "Source": "stocks"
        },
        {
            "Title": "Sammaan Capital Board Approves Demerger Scheme",
            "Summary": "Sammaan Capital Limited's board approved a scheme of arrangement to demerge its wholly-owned subsidiary Sammaan Finserve Limited's NBFC business, consolidating lending operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767190000308,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital Pays Interest on 4 NCD Series Worth ₹106 L",
            "Summary": "Sammaan Capital Limited completed interest payments totaling ₹106.60 lakhs across 4 secured NCD series on January 5, 2026, maintaining regulatory compliance under SEBI guidelines.",
            "Sentiment": "positive",
            "PublishDate": 1766150534697,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sammaan Capital Clarifies Media Reports on Fresh FIR",
            "Summary": "Sammaan Capital clarifies media reports about fresh FIR filed by Delhi Police EOW against ex-promoter Sameer Gehlaut, reaffirming no current connection to the company since his exit in 2023.",
            "Sentiment": "neutral",
            "PublishDate": 1766049400609,
            "Source": "stocks"
        },
        {
            "Title": "Delhi Police EOW Files New FIR Against Sammaan Capital",
            "Summary": "Delhi Police's Economic Offences Wing has filed a fresh FIR concerning Sammaan Capital's former promoters, marking another development in the ongoing regulatory scrutiny.",
            "Sentiment": "negative",
            "PublishDate": 1765961357393,
            "Source": "stocks"
        },
        {
            "Title": "SC Orders CBI FIR Decision Within Week For Sammaan Capital",
            "Summary": "Supreme Court directs CBI to decide on FIR registration within one week for Sammaan Capital case, escalating legal proceedings with specific timeline for investigative action.",
            "Sentiment": "negative",
            "PublishDate": 1765960623830,
            "Source": "stocks"
        },
        {
            "Title": "CCI Approves Avenir Investment's Acquisition of Controlling Stake in Sammaan Capital Limited",
            "Summary": "The Competition Commission of India has approved the proposed acquisition of controlling stake in Sammaan Capital Limited by Avenir Investment RSC Ltd, which is owned by International Holding Company PJSC. The transaction still awaits regulatory approvals from SEBI for the open offer and from the Reserve Bank of India before completion.",
            "Sentiment": "positive",
            "PublishDate": 1765336792930,
            "Source": "order&deals"
        },
        {
            "Title": "Sammaan Capital Allots ₹300 Crore Non-Convertible Debentures in Private Placement",
            "Summary": "Sammaan Capital Limited allotted 30,000 secured, rated, listed non-convertible debentures worth ₹300 crores on December 9, 2025, comprising Series I (₹200 crores at 8.7923% with monthly interest) and Series II (₹100 crores at 8.8570% with quarterly interest). The debentures mature on December 9, 2030, are secured by hypothecation of company's financial and non-financial assets, and will be listed on NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1765262937374,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payment on Listed Debentures",
            "Summary": "Sammaan Capital Limited has completed interest payments on its secured redeemable non-convertible debentures issued through public offering and listed on stock exchanges. The company paid interest amounts totaling approximately INR 5.85 lacs across four different ISIN series with monthly payment frequency.",
            "Sentiment": "positive",
            "PublishDate": 1765198396332,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payments on Listed Debentures",
            "Summary": "Sammaan Capital Limited (formerly Indiabulls Housing Finance Limited) completed monthly interest payments totaling approximately INR 64.86 lacs across 11 series of secured redeemable non-convertible debentures with due date November 17, 2025. The company paid all interest amounts on November 28, 2025, maintaining compliance with its debt obligations to debenture holders.",
            "Sentiment": "positive",
            "PublishDate": 1764334654111,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payment on Listed Debentures",
            "Summary": "Sammaan Capital Limited (formerly Indiabulls Housing Finance Limited) has made timely payment of interest amount on its Secured Redeemable Non-Convertible Debentures issued through public issue and listed on stock exchanges. The company paid the entire interest amount of INR 1528.70 lacs on November 27, 2025, for debentures with a size of INR 26000.56 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1764249638434,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Interest Payment on Secured Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited (formerly Indiabulls Housing Finance Limited) has made the required interest payment on its Secured Redeemable Non-Convertible Debentures issued on a private placement basis. The company informed stock exchanges NSE and BSE about the completion of this quarterly interest payment obligation.",
            "Sentiment": "neutral",
            "PublishDate": 1763723395468,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Court Reviews Appeal Against Sammaan Capital as Company Closes Borrower Accounts",
            "Summary": "The Supreme Court is reviewing an appeal related to allegations made by Sammaan Capital's former promoter, with the company stating no misconduct was found against it. Sammaan Capital has closed borrower group loan accounts, currently operates without a promoter, and is cooperating with ongoing investigations.",
            "Sentiment": "neutral",
            "PublishDate": 1763707210332,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sammaan Capital Confirms No FIR Filed During Wednesday Court Proceedings",
            "Summary": "Sammaan Capital announced that no First Information Report (FIR) was ordered against the company during court proceedings held on Wednesday. The clarification addresses potential concerns about legal proceedings involving the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763563440214,
            "Source": "stock"
        },
        {
            "Title": "Sammaan Capital Makes Principal and Interest Payment on Secured Redeemable Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited has completed payment of principal and interest amounts on its secured redeemable non-convertible debentures as per regulatory requirements. The company informed stock exchanges about the debt service payment in compliance with SEBI listing obligations and disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763553490569,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Highlights Professional Management with LIC and BlackRock as Major Shareholders",
            "Summary": "Sammaan Capital has stated that it operates under professional management structure. The company disclosed that Life Insurance Corporation (LIC) and BlackRock serve as its main shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1763546167921,
            "Source": "stock"
        },
        {
            "Title": "Sammaan Capital Denies Petition Allegations, Confirms Sameer Gehlaut's Exit",
            "Summary": "Sammaan Capital has denied all allegations mentioned in a petition and clarified that Sameer Gehlaut departed the company in 2022-23. The company stated that Gehlaut no longer holds any shares in the organization.",
            "Sentiment": "neutral",
            "PublishDate": 1763545885672,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Orders Multi-Agency Discussion on Sammaan Capital Irregularities",
            "Summary": "The Supreme Court has directed CBI, SEBI, SFIO, and ED to discuss claims of irregularities in Sammaan Capital. The order involves multiple regulatory and investigative agencies examining potential violations at the company.",
            "Sentiment": "negative",
            "PublishDate": 1763538315545,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sammaan Capital Offers to Purchase Non-Convertible Debentures Maturing by June 2026",
            "Summary": "Sammaan Capital Limited has announced an offer to purchase all Non-Convertible Debentures (NCDs) maturing on or before June 30, 2026, excluding subordinated debt bearing ISIN INE148108215. The Asset Liability Management Committee approved the decision to buy back NCDs at par value and hold them as treasury stock until maturity. The company positions this move as part of its disciplined approach to liquidity and liability management through proactive Asset-Liability Management practices. Sammaan Capital maintains a strong investment and liquidity buffer for near to mid-term debt repayments and utilizes surplus liquidity to prepay or buy back outstanding debt instruments when permissible. Interested NCD holders can contact the company via email at bondpurchase@sammaancapital.com before November 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762877242991,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Reports Monitoring Agency Results for QIP and Rights Issue Proceeds",
            "Summary": "Sammaan Capital Limited submitted monitoring agency reports from CRISIL Ratings for the quarter ended September 30, 2025, covering both its Qualified Institutional Placement and Rights Issue proceeds. For the QIP, the company raised Rs. 13,000 million with net proceeds of Rs. 12,648.9 million. The funds were allocated toward augmenting capital base (Rs. 9,593.90 million) and general corporate purposes (Rs. 3,055.00 million). The capital augmentation amount was fully utilized during the quarter ended March 31, 2025, while Rs. 15.94 million remains unutilized from general corporate purposes. For the Rights Issue, gross proceeds were Rs. 36,933.98 million with net proceeds of Rs. 36,134.68 million. The allocation included Rs. 27,341.10 million for capital base augmentation and Rs. 8,793.58 million for general corporate purposes. Cumulative utilization shows Rs. 27,108.81 million used for capital augmentation and Rs. 8,722.22 million for general corporate purposes, with Rs. 232.29 million and Rs. 71.36 million respectively remaining unutilized. CRISIL reported no deviations from stated objectives for both issues.",
            "Sentiment": "neutral",
            "PublishDate": 1762484523533,
            "Source": "corporate_action"
        },
        {
            "Title": "BlackRock Increases Stake in Sammaan Capital to 5.33%",
            "Summary": "BlackRock, Inc. has increased its shareholding in Sammaan Capital Ltd to 5.33% through on-market transactions. The investment firm acquired 3,875,983 additional shares representing 0.47% of the company, bringing its total holding to 44,291,365 shares from the previous 40,415,382 shares (4.86%). The acquisition was completed on October 31, 2025, and triggered disclosure requirements as BlackRock's aggregate holdings moved above the 5% threshold. Sammaan Capital has a total equity share capital of 831,383,143 shares. BlackRock holds these shares on behalf of discretionary management clients and is not part of the promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1762234979063,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Secures INR 8,850 Crore Investment from International Holding Company at 41.2% Stake",
            "Summary": "Sammaan Capital Limited announced a preferential allotment to International Holding Company's subsidiary Avenir Investment RSC Limited for INR 8,850 crores, acquiring 41.2% stake on a fully diluted basis at INR 139 per share. IHC has also given an open offer to acquire an additional 26%, potentially taking their total stake to 63.4%. The company received shareholder approval on October 29 and has applied for RBI and other regulatory approvals, expecting completion within 4 months. The investment announcement immediately impacted borrowing costs, with the company raising a $450 million dollar bond at 150 basis points lower than previous issuance. Moody's has placed the company on review for possible upgrade. Sammaan Capital reported quarterly results with net worth of INR 22,373 crores, growth AUM of INR 42,000 crores, and profit of INR 308 crores versus loss of INR 2,761 crores in the previous year. The company plans to expand disbursals from current annualized INR 15,000 crores to INR 35,000 crores next year, focusing on retail mortgage business and exploring additional product lines beyond mortgages.",
            "Sentiment": "positive",
            "PublishDate": 1762204588780,
            "Source": "earnings"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payments on Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited has made timely interest payments on its Secured Redeemable Non-Convertible Debentures issued through public offering and listed on stock exchanges. The company paid interest amounts across nine different ISIN series with monthly payment frequency. All payments were made on October 30, 2025, with interest due dates of October 17, 2025, and record dates of November 1, 2025. The total interest payments ranged from small amounts of 0.03413 lacs to larger amounts of 13.04908 lacs across the different debenture series. The company confirmed that the entire interest amount was paid without any delays.",
            "Sentiment": "positive",
            "PublishDate": 1761916150047,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Reports Rs 308 Crore Profit in Q2 FY26, Board Approves Rs 8,850 Crore Preferential Issue",
            "Summary": "Sammaan Capital Limited reported a standalone profit of Rs 308 crore for the quarter ended September 30, 2025, compared to Rs 109 crore in the same period last year. Total income increased to Rs 2,089 crore from Rs 2,068 crore year-on-year. The company's board approved a preferential issue worth approximately Rs 8,850 crore to Avenir Investment RSC Ltd, subject to shareholder and regulatory approvals. Shareholders approved this resolution at an extraordinary general meeting on October 29, 2025. The company raised $300 million through Senior Secured Social Bonds during the quarter and an additional $450 million post-quarter. Sammaan Capital has been categorized as Upper Layer NBFC by RBI. The company is primarily engaged in finance and mortgage-backed lending business.",
            "Sentiment": "positive",
            "PublishDate": 1761899719792,
            "Source": "earnings"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payment on Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited (formerly Indiabulls Housing Finance Limited) has made timely interest payments on its Secured Redeemable Non-Convertible Debentures. The company paid interest on two debenture series with a combined issue size of INR 1,411.67 lacs. The monthly interest payments totaling INR 10.69925 lacs were due on October 13, 2025, with actual payment made on October 28, 2025. The record date was October 27, 2025, and the previous interest payment was made on September 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761654352902,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Issues Corrigendum for Preferential Issue EGM Scheduled October 29, 2025",
            "Summary": "Sammaan Capital Limited has issued a corrigendum to its Extraordinary General Meeting notice scheduled for October 29, 2025. The corrigendum addresses clarifications requested by NSE and BSE regarding the company's proposed preferential issue of equity shares and warrants. The company plans to utilize 80% of the issue proceeds (INR 7,080 crore) for onward lending purposes including housing loans, MSME financing, and loans against property, with 20% (INR 1,770 crore) allocated for general corporate purposes. The total issue size is INR 8,850 crore. Post-issue, an investor will hold 43.46% stake and become a promoter. The company intends to strengthen its position in retail mortgage and MSME segments through technology deployment, expanded co-lending models, and geographic reach spanning 220 branches with over 4,400 employees. The corrigendum provides detailed fund utilization timelines within 12 months of receipt and updated shareholding patterns.",
            "Sentiment": "neutral",
            "PublishDate": 1761385851465,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payments on Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited has made timely interest payments on its Secured Redeemable Non-Convertible Debentures issued through public offering and listed on stock exchanges. The company paid interest on eight different debenture series with a total payment amount of ₹43.52 lakh. All payments were made on October 24, 2025, ahead of the October 27, 2025 due date. The debentures have monthly interest payment frequency with issue sizes ranging from ₹3 lakh to ₹1,610.15 lakh across different ISIN codes. The record date for all payments was September 27, 2025, and no delays were reported in the interest payments.",
            "Sentiment": "positive",
            "PublishDate": 1761380108811,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payments on Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited has made timely interest payments on its Secured Redeemable Non-Convertible Debentures issued through public offering. The company paid interest on eight different debenture series with a total interest amount of approximately INR 14.08 lacs. All payments were made on October 24, 2025, ahead of the due date of October 26, 2025. The debentures carry monthly interest payment frequency with amounts ranging from INR 0.00644 lacs to INR 6.27341 lacs across different ISIN codes. The company confirmed full compliance with payment obligations and no delays in interest payments.",
            "Sentiment": "positive",
            "PublishDate": 1761379773399,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payments on Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited has made timely interest payments on its Secured and Unsecured Redeemable Non-Convertible Debentures issued through public offering. The company paid interest on two debenture series with ISINs INE148I07GJ7 and INE148108231, totaling INR 11.88 lacs. Both payments had a due date of October 15, 2025, with record date of October 26, 2025, and actual payment made on October 24, 2025. The debentures carry monthly interest payment frequency with no changes to the payment structure.",
            "Sentiment": "positive",
            "PublishDate": 1761379106345,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payments on Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited has made timely interest payments on its Secured Redeemable Non-Convertible Debentures issued through public offering. The company paid interest on 10 different debenture series with a combined issue size of INR 5,652.85 lacs. All payments were made on October 23, 2025, ahead of the October 26, 2025 due date. The interest amounts ranged from INR 0.00787 lacs to INR 16.28626 lacs across the various series, with all debentures following a monthly payment frequency. The record date for all series was October 13, 2025, with the last interest payment date being September 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761236379719,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Raises $450 Million Through Senior Secured Social Bonds",
            "Summary": "Sammaan Capital Limited raised $450 million through the allotment of 7.5% Senior Secured Social Bonds due 2030. The bonds were issued under Regulation S and Rule 144A of the U.S. Securities Act, with $34.29 million allocated under Rule 144A and $415.71 million under Regulation S. The bonds are expected to be listed on NSE IFSC Limited. The company was formerly known as Indiabulls Housing Finance Limited.",
            "Sentiment": "positive",
            "PublishDate": 1760614489192,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Allots Rs 400 Crore Non-Convertible Debentures in Two Series",
            "Summary": "Sammaan Capital Limited has allotted secured, rated, listed, taxable, redeemable, non-convertible debentures worth Rs 400 crores through private placement. The issuance comprises two series: Series I worth Rs 200 crores with 9.30% coupon rate maturing on October 16, 2035, and Series II worth Rs 200 crores with 9.15% coupon rate maturing on October 16, 2030. Each series consists of 20,000 debentures with face value of Rs 1 lakh each. The debentures are secured by hypothecation of the company's financial and non-financial assets with minimum asset coverage of 1.1 times the principal amount and interest. Interest payments will be made annually starting October 16, 2026. The debentures will be listed on National Stock Exchange and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760605696760,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Approves $450 Million Senior Secured Social Bond Issuance",
            "Summary": "Sammaan Capital has approved the issuance of $450 million in senior secured social bonds. The bonds carry a 7.5% interest rate and are scheduled to mature in 2030.",
            "Sentiment": "positive",
            "PublishDate": 1760017058051,
            "Source": "corporate_action"
        },
        {
            "Title": "Abu Dhabi's IHC to Acquire 43.5% Stake in Sammaan Capital for ₹8,850 Crore",
            "Summary": "Abu Dhabi-based International Holding Company (IHC) will acquire a 43.5% stake in Indian financial services firm Sammaan Capital through a ₹8,850 crore deal. The transaction involves issuing 33 crore equity shares and 31 crore warrants to IHC at ₹139 per share, making IHC the new promoter. IHC is backed by Sheikh Tahnoon bin Zayed Al Nahyan, UAE's National Security Adviser. The company will conduct a mandatory open offer for existing shareholders and an Extraordinary General Meeting is scheduled for October 29 for shareholder approval. Sammaan Capital shares gained 5% on October 1, extending a six-session rally of 25%. The board expects the partnership to provide global backing and enable expansion in asset management, financial services, and fintech.",
            "Sentiment": "positive",
            "PublishDate": 1759413148514,
            "Source": "order&deals"
        },
        {
            "Title": "Sammaan Capital Shares Surge 25% Over Six Sessions on Fund Raising Plans and Institutional Buying",
            "Summary": "Sammaan Capital shares gained 5% on Wednesday, extending their rally to 25% over six consecutive trading sessions. The company's board will meet on Thursday to consider fund raising proposals through equity securities or other convertible instruments. The stock received a boost after ICICI Prudential Mutual Fund purchased 42 lakh shares at ₹151.95 per share in bulk deals on Monday. The company appointed Himanshu Mody as deputy CEO effective September 4. Sammaan Capital projects its assets under management will reach ₹1 lakh crore in financial year 2027, up from ₹62,378 crore in the first quarter, representing a 27% CAGR. The company expects to reduce its legacy book contribution to single digits from the current 37% of total AUM by 2027. Management anticipates credit costs to stabilize around 1% compared to 3% in the June quarter. September marked the stock's best monthly performance with 29% gains since August 2023. Shares closed at ₹168.55, up 4.8%, though the stock remains under F&O ban restrictions.",
            "Sentiment": "positive",
            "PublishDate": 1759318582526,
            "Source": "stock"
        },
        {
            "Title": "Sammaan Capital Completes Principal and Interest Payments on Secured Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited has made timely payment of principal and interest on its Secured Redeemable Non-Convertible Debentures issued through public offering. The company paid interest amounts totaling INR 521.68 lacs across nine different ISIN codes with varying payment frequencies - monthly, yearly, and cumulative. Five debenture series reached maturity and were fully redeemed, with total redemption amounts of INR 3,718.87 lacs. All payments were completed by September 26, 2025, ahead of the September 28, 2025 due date. The outstanding amount for all redeemed debentures is now zero.",
            "Sentiment": "positive",
            "PublishDate": 1758966860077,
            "Source": "corporate_action"
        },
        {
            "Title": "Plutus Wealth Management Acquires 3.2% Stake in Sammaan Capital Limited",
            "Summary": "Plutus Wealth Management LLP acquired 2,66,00,000 shares (3.2% stake) in Sammaan Capital Limited through open market transactions between August 27, 2025 and September 23, 2025. The acquisition increased Plutus Wealth Management's total holding to 4,84,00,000 shares, representing 5.84% of the company's voting capital. The firm is acting in concert with Junomoneta Finsol Private Limited, which holds 0.58% of the shares. Plutus Wealth Management does not belong to the promoter group. Sammaan Capital Limited is listed on both NSE and BSE, with a total voting capital of 82,93,74,234 equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758783246031,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Timely Interest Payments on Multiple Debenture Series",
            "Summary": "Sammaan Capital Limited (formerly Indiabulls Housing Finance Limited) completed interest payments on its Secured Redeemable Non-Convertible Debentures across nine different ISIN series. The company paid a total interest amount of ₹42.68 lakhs on debentures with a combined issue size of ₹5,113.90 lakhs. All payments were made on September 6, 2025, three days ahead of the September 9, 2025 due date. The debentures follow a monthly interest payment schedule with record date of August 25, 2025. Individual interest payments ranged from ₹0.04 lakhs to ₹11.33 lakhs across the different series, with issue sizes varying from ₹5 lakhs to ₹1,279.19 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1757336896190,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Makes Early Interest Payments Worth ₹191.38 Crores on Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited paid interest totaling ₹191.38 crores on its Non-Convertible Debentures issued through private placement. The company made payments of ₹116.435 crores and ₹74.9442 crores for two separate NCD series on September 5, 2025, three days ahead of the September 8, 2025 due date. Both NCD series have annual interest payment frequency with issue sizes of ₹1,450 crores and ₹900 crores respectively. The record date for both payments was September 4, 2025, and the last interest payments were made on September 8, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1757142152620,
            "Source": "corporate_action"
        },
        {
            "Title": "Sammaan Capital Limited Makes Timely Interest Payments on Secured Non-Convertible Debentures",
            "Summary": "Sammaan Capital Limited has made timely interest payments on its Secured Redeemable Non-Convertible Debentures issued through public offering. The company paid interest on two ISIN numbers: INE148I07LD0 with an issue size of 1.00 lacs and interest payment of 0.00716 lacs, and INE148I07LE8 with an issue size of 1008.80 lacs and interest payment of 7.69411 lacs. Both payments were made monthly with a due date of August 22, 2025, and actual payment date of September 4, 2025. The record date for both instruments was August 6, 2025. The company confirmed it paid the entire interest amount as required.",
            "Sentiment": "positive",
            "PublishDate": 1757044330414,
            "Source": "corporate_action"
        }
    ]
}