{
    "Symbol": "SAMPANN",
    "ISIN": "INE735M01018",
    "News": [
        {
            "Title": "Sampann Utpadan Q3 FY26 Results Show Strong Growth",
            "Summary": "Sampann Utpadan India Limited reported robust Q3 FY26 performance with revenue from operations reaching ₹96.37 crores and net profit of ₹1.30 crores, demonstrating significant operational improvements.",
            "Sentiment": "positive",
            "PublishDate": 1769155793532,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sampann Utpadan faces ₹60,000 penalty for delayed filing",
            "Summary": "Sampann Utpadan India Limited incurred a ₹60,000 penalty for submitting trading approval application three days late, citing delays in receiving depository confirmation as the reason for non-compliance.",
            "Sentiment": "negative",
            "PublishDate": 1769063883922,
            "Source": "stocks"
        },
        {
            "Title": "Sampann Utpadan India Limited Independent Director Resigns Due to Personal Reasons",
            "Summary": "Mr. Pramod Agarwal (DIN: 08862101) resigned as Non-Executive Independent Director of Sampann Utpadan India Limited with effect from November 7, 2025. He cited personal reasons and other professional commitments as the reason for his resignation. Agarwal also ceased to be Chairman/Member of various committees of the company. He had been associated with the company since September 4, 2020. The director confirmed there are no other material reasons for his resignation beyond those mentioned in his resignation letter.",
            "Sentiment": "neutral",
            "PublishDate": 1762542787150,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sampann Utpadan India Limited Reports Quarterly Results for September 2025",
            "Summary": "Sampann Utpadan India Limited's Board approved unaudited financial results for the quarter ended September 30, 2025. The company operates in two primary business segments: Non-Conventional Energy Division and Reclaimed Rubber Division. For the quarter, standalone revenue from operations was ₹2,484.20 lakhs compared to ₹2,103.78 lakhs in the same quarter last year. The company reported a standalone profit of ₹185.44 lakhs for the current quarter versus a loss of ₹112.70 lakhs in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations reached ₹3,484.37 lakhs for the quarter. The company allocated 82,00,000 equity shares during the quarter on conversion of warrants. The results were reviewed by the Audit Committee and received an unmodified opinion from statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1760688279600,
            "Source": "earnings"
        },
        {
            "Title": "Sampann Utpadan India Approves Board Appointments and Secretarial Auditor Selection at AGM",
            "Summary": "Sampann Utpadan India Limited shareholders approved multiple board appointments at their 15th Annual General Meeting held on September 27, 2025. The company appointed Mr. Anant Kumar as Non-Executive Independent Director for a 5-year term, and reappointed Mr. Ashok Jolly and Mr. Pramod Agrawal as Non-Executive Independent Directors for second 5-year terms. Mr. Sanjeetkumar Gourishankar Rath was re-appointed as director liable to retire by rotation. Additionally, shareholders approved the appointment of M/S Satish Jadon & Associates as Secretarial Auditors for five financial years from FY 2025-26 to FY 2029-30. All appointed directors are confirmed as not being debarred by SEBI or other authorities, and the board composition complies with regulatory requirements.",
            "Sentiment": "positive",
            "PublishDate": 1759040972316,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sampann Utpadan India Limited Reports Quarterly Financial Results for June 2025",
            "Summary": "Sampann Utpadan India Limited announced its unaudited financial results for the quarter ended June 30, 2025. The Board of Directors approved both standalone and consolidated financial statements during a meeting held on July 23, 2025. The company operates two primary business segments: Non-Conventional Energy Division and Reclaimed Rubber Division. The consolidated results include wholly owned subsidiary Shubham Electrochem Limited. The financial statements were prepared in accordance with Indian Accounting Standards and reviewed by independent auditors who provided an unmodified opinion. The company's paid-up equity share capital remains at Rs. 1,061.00 lakhs with a face value of Rs. 10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1753258570399,
            "Source": "earnings"
        }
    ]
}