{
    "Symbol": "SANATHAN",
    "ISIN": "INE0JPD01013",
    "News": [
        {
            "Title": "Sanathan Textiles Q3FY26 Results Mixed Performance",
            "Summary": "Sanathan Textiles reports Q3FY26 standalone profit of ₹38.09 crores vs ₹37.33 crores YoY, but consolidated loss of ₹4.77 crores. Revenue grows to ₹768.07 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1770379201883,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sanathan Textiles Reports Strong Q2 Performance with 22% EBITDA Growth and Punjab Facility Commissioning",
            "Summary": "Sanathan Textiles delivered robust quarterly results with standalone EBITDA growing 22% and PAT surging 45% year-on-year, while successfully commissioning its new Punjab facility on August 27, 2025, starting operations at 350 metric tonnes per day. The company maintained its FY26 revenue guidance of Rs. 4,100-4,300 crores with double-digit EBITDA margins and announced plans for a Rs. 420-445 crore cotton expansion facility in Madhya Pradesh expected to be operational by Q1 FY28.",
            "Sentiment": "positive",
            "PublishDate": 1763061451787,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Shares Audio Recording of Earnings Call for Quarter Ended September 30, 2025",
            "Summary": "Sanathan Textiles Limited has provided the audio recording link for its earnings call discussing unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The earnings call was held on November 7, 2025, following board approval of the results on November 5, 2025. The company has made the recording available on its investor relations website and submitted the link to stock exchanges NSE and BSE as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762543654129,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Reports No Deviation in IPO Fund Utilization for September Quarter",
            "Summary": "Sanathan Textiles Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from the stated objectives of its Initial Public Offer. The company raised INR 550 crore through its IPO in December 2024, with net proceeds of INR 370.952 crore excluding issue-related expenses. ICRA Limited, the appointed monitoring agency, confirmed that fund utilization was in line with the disclosed objects of the issue. The company has completed repayment of borrowings worth INR 160 crore, invested INR 140 crore in subsidiary Sanathan Polycot Private Limited for debt repayment, and utilized INR 70.952 crore for general corporate purposes including working capital. The report shows INR 4.174 crore remains unutilized and is held in bank accounts. The Audit Committee reviewed the report at its meeting held on November 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762542424163,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanathan Textiles Reports Strong Q2FY26 Performance with 22% EBITDA Growth and Punjab Facility Commissioning",
            "Summary": "Sanathan Textiles delivered strong operational performance in Q2FY26 with standalone EBITDA growing 22% and PAT increasing 45% year-on-year. The company's Silvassa plant operated at full capacity while the newly commissioned Punjab facility began commercial operations in August 2025. On a consolidated basis, revenue from operations increased 10% year-on-year to INR 818 crores, driven by higher sales volumes from the Punjab facility commissioning. However, the company incurred start-up costs of approximately INR 11 crores related to the new facility. For the half-year period, consolidated revenue rose to INR 1,563 crores from INR 1,523 crores in H1FY25. The Punjab plant is expected to reach optimal capacity over the next quarter. Sanathan Textiles is also expanding cotton yarn capacity through its subsidiary Sanathan Polycot with a new manufacturing facility in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1762528682555,
            "Source": "stock"
        },
        {
            "Title": "Sanathan Textiles Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Sanathan Textiles reported quarterly consolidated net profit of 201 million rupees, down from 326 million rupees in the same period last year. Revenue increased to 8.18 billion rupees compared to 7.42 billion rupees year-over-year. EBITDA rose to 623 million rupees from 574 million rupees, while EBITDA margin slightly decreased to 7.61% from 7.73% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762395272536,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Reports Revenue Growth in Q2 with Punjab Facility Commissioning",
            "Summary": "Sanathan Textiles Limited announced its quarterly results for the quarter and half year ended September 30, 2025. On a standalone basis, revenue from operations increased to Rs. 767.1 crores from Rs. 749.9 crores in the previous quarter. The company's Silvassa plant operated at 100% capacity utilization. The newly commissioned Punjab facility commenced commercial operations on August 27, 2025, contributing to higher volumes. However, the quarter included one-time start-up costs of approximately Rs. 11 crores related to the new facility. On a consolidated basis, revenue from operations grew to Rs. 818.0 crores from Rs. 745.3 crores in the previous quarter. The company operates across three yarn segments - Polyester Filament Yarns, Cotton Yarns, and Yarns for Technical Textiles. Sanathan Textiles is expanding its cotton division capacity through its subsidiary Sanathan Polycot with a new manufacturing facility in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1762366375624,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Reports Strong Quarterly Results and Key Leadership Appointment",
            "Summary": "Sanathan Textiles Limited announced its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company appointed Mr. Aakash Dattani as Executive President - Finance and Sustainability, effective November 5, 2025. Dattani is a Chartered Accountant with an MBA from Yale School of Management and previous experience at HDFC Securities and Actis. The Board also approved renaming the Risk Management Committee to Risk Management and Sustainability Committee to oversee Business Responsibility and Sustainability Report compliance. Additionally, the company approved expanding its cotton division capacity through wholly-owned subsidiary Sanathan Polycot Private Limited with a new manufacturing facility in Madhya Pradesh. The decisions were made during a Board meeting held on November 5, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762360548670,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Projects Revenue of ₹4000-4300 Crore for FY26",
            "Summary": "Sanathan Textiles has projected revenue of ₹4000 to ₹4300 crore for FY26. The company expects its Punjab facility to contribute ₹1300 crore to this revenue target. The textile manufacturer anticipates achieving full capacity utilization within 3-4 months.",
            "Sentiment": "positive",
            "PublishDate": 1757665159467,
            "Source": "stock"
        },
        {
            "Title": "Sanathan Textiles Begins Commercial Production at Punjab Manufacturing Facility",
            "Summary": "Sanathan Textiles Limited has commenced commercial production at its manufacturing facility in Wazirabad, Punjab, marking Phase-1 operations. The facility started production at 350 tonnes per day with a Continuous Polymerisation line, expected to ramp up to 700 tonnes per day within 3-4 months. After Phase-2 implementation, the Punjab facility will contribute 950 tonnes per day, increasing the company's total installed yarn-manufacturing capacity from 223,750 MTPA at Silvassa to 570,500 MTPA across both locations. The Punjab facility will focus on green manufacturing practices and cater to North India's textile market, while the existing Silvassa facility will continue serving domestic and export demand through its proximity to western ports. Sanathan Textiles specializes in polyester filament yarns, cotton yarns, and technical textile yarns, serving over 7,000 customers and 400+ distributors across India, with exports to around 27 countries.",
            "Sentiment": "positive",
            "PublishDate": 1756290814773,
            "Source": "stock"
        },
        {
            "Title": "Sanathan Textiles Reports Q1 FY26 Results with Revenue of INR 745 Crores, Plans Punjab Facility Launch",
            "Summary": "Sanathan Textiles Limited reported quarterly results with revenue from operations of INR 745 crores compared to INR 732 crores in the previous quarter, driven by slight increase in sales volume. However, revenue declined 4.5% year-on-year due to softening raw material prices and lower average sales prices. The company achieved sales volume of 59,000 metric tons and production of 57,000 tons during the quarter. EBITDA stood at INR 70 crores with margins at 9.3%, while PAT was INR 40 crores with margins at 5.4%. The company's new Punjab facility with capacity of 3,46,000 metric tons per annum is set to commence commercial operations on August 27, 2025, after delays due to early monsoon. Management maintains guidance of INR 4,500 crores annual revenue and expects double-digit EBITDA margins between 10-11% for the full year. The company operates with manufacturing capacity of 2,23,000 metric tons per annum at its Silvassa facility, comprising polyester yarn, cotton yarn, and technical textile yarns.",
            "Sentiment": "positive",
            "PublishDate": 1755080316765,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Maintains FY26 Revenue Guidance Despite Q1 Decline, Unaffected by US Tariffs",
            "Summary": "Sanathan Textiles reported a 4.6% decline in revenue to Rs 745 crore in Q1FY26 compared to Rs 781 crore in Q1FY25. The company's profit after tax fell 19.3% to Rs 40 crore from Rs 50 crore, while Ebitda margin decreased to 9.3% from 9.8%. Executive Director Sammir Dattani attributed the revenue decline to lower selling prices following reduced raw material costs, noting that sales volumes remained consistent. The company maintains its FY26 revenue guidance of Rs 4,600 to Rs 4,800 crore, expecting support from a new Punjab facility that will more than double capacity. Sanathan Textiles remains unaffected by US tariffs as exports to the US represent under 1% of business and less than 4% of revenue. The company has strategically shifted focus to domestic markets over the past three years, operating at 95% capacity utilization. Dattani indicated June margins exceeded 10%, suggesting momentum toward the company's 10-11% Ebitda margin target.",
            "Sentiment": "neutral",
            "PublishDate": 1754712857153,
            "Source": "stock"
        },
        {
            "Title": "Sanathan Textiles Reports Q1 FY26 Revenue of Rs. 745.34 Crores, Plans Major Punjab Facility Expansion",
            "Summary": "Sanathan Textiles Limited announced its Q1 FY26 financial results with revenue from operations at Rs. 745.34 crores, showing a 1.80% quarter-on-quarter increase but a 4.58% year-on-year decline. EBITDA stood at Rs. 69.56 crores with margins at 9.33%, while PAT was Rs. 40.43 crores with margins at 5.42%. The revenue decline was attributed to lower raw material costs and average selling prices, though volumes remained stable due to healthy demand and high plant utilization. The company is preparing to commission a greenfield manufacturing facility in Punjab with a total installed capacity of 3.46 lakh MTPA to be added in two phases. This expansion will more than double the polyester filament yarn capacity from 2.00 lakh MTPA to 5.47 lakh MTPA. The facility is built on an 80-acre freehold parcel and is expected to reduce logistics costs, improve operating leverage, and enable better service to textile hubs in North India. Chairman & Managing Director Paresh Dattani expressed confidence that the Punjab facility will drive the next phase of growth and margin improvement.",
            "Sentiment": "positive",
            "PublishDate": 1754572946020,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Approves Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Sanathan Textiles Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board meeting was held on August 7, 2025, from 12:00 PM to 2:30 PM IST. The financial results were accompanied by a limited review report from the statutory auditors and were reviewed and recommended by the audit committee. The results and related information have been uploaded to the company's website at www.sanathan.com.",
            "Sentiment": "neutral",
            "PublishDate": 1754559824381,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Reports Decline in Q1 Financial Performance",
            "Summary": "Sanathan Textiles reported quarterly results showing a decline across key financial metrics. Revenue decreased to 7.5 billion rupees from 7.8 billion rupees in the same period last year. Net profit fell to 472 million rupees compared to 523 million rupees year-over-year. EBITDA dropped to 700 million rupees from 763 million rupees, while EBITDA margin compressed to 9.34% from 9.78% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754559011835,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Reports Q4 Net Profit of 436.5M Rupees",
            "Summary": "Sanathan Textiles has reported its quarterly financial results. The company's consolidated net profit for the fourth quarter stands at 436.5 million rupees. This represents a year-over-year decrease from 522.6 million rupees in the same quarter of the previous year. However, it shows a quarter-over-quarter increase from 341.7 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1748270266000,
            "Source": "result"
        },
        {
            "Title": "Sanathan Textiles: Rs 5,000 Crore Revenue Target for FY26 with New Punjab Facility",
            "Summary": "Sanathan Textiles plans to commission a new greenfield facility in Punjab by Q1 FY26, aiming to reach full capacity within two months. The company targets a topline of Rs 5,000 crore for FY26, with the new plant contributing Rs 2,000 crore. Total capacity is expected to expand to 5,81,990 MTPA by FY27, including increases in polyester and cotton yarn production.",
            "Sentiment": "positive",
            "PublishDate": 1741242971000,
            "Source": "corporate_action"
        },
        {
            "Title": "Societe Generale Acquires 1.73% Stake in Sanathan Textiles",
            "Summary": "Societe Generale, operating under its ODI (Overseas Direct Investment) name, has reported a 1.73% stake in Sanathan Textiles during the third quarter. This acquisition represents a significant shareholding in the textile company.",
            "Sentiment": "neutral",
            "PublishDate": 1737373442000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sanathan Textiles Reports Improved Q2 EBITDA and Margin",
            "Summary": "Sanathan Textiles has reported its Q2 financial results. The company's EBITDA increased to 583 million rupees from 520 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 7.84% from 6.97% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737104691000,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Reports Stable Q2 Revenue",
            "Summary": "Sanathan Textiles has reported a quarterly revenue of 7.4 billion rupees for Q2, which remains unchanged compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1737104680000,
            "Source": "earnings"
        },
        {
            "Title": "Sanathan Textiles Reports Increased Q2 Net Profit",
            "Summary": "Sanathan Textiles has reported a net profit of 350 million rupees for the second quarter, compared to 321 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737104599000,
            "Source": "earnings"
        },
        {
            "Title": "Societe Generale Acquires Shares in Sanathan Textiles",
            "Summary": "Societe Generale has purchased 6.95 lakh shares of Sanathan Textiles through open market transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1735518046000,
            "Source": "block_deals"
        },
        {
            "Title": "Societe Generale Acquires 6.95 Lakh Shares of Sanathan Textiles",
            "Summary": "Societe Generale has purchased 6.95 lakh shares of Sanathan Textiles through the open market. This transaction represents a significant acquisition of shares in the textile company by the French multinational investment bank and financial services company.",
            "Sentiment": "neutral",
            "PublishDate": 1735383514000,
            "Source": "block_deals"
        },
        {
            "Title": "Sanathan Textiles: Shares Debut with 32% Premium on Stock Exchanges",
            "Summary": "Sanathan Textiles Ltd. shares listed at Rs 422.30 on NSE and Rs 419.1 on BSE, marking a premium of 31.56% and 30.56% respectively over the issue price of Rs 321. The Rs 550-crore IPO was oversubscribed 35.12 times, receiving bids worth Rs 14,229.11 crore. The company plans to use the proceeds for debt repayment, subsidiary investment, and general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1735273927000,
            "Source": "normal_news"
        }
    ]
}