{
    "Symbol": "SANDESH",
    "ISIN": "INE583B01015",
    "News": [
        {
            "Title": "Sandesh Reports Strong Q3 Turnaround with ₹391M Profit",
            "Summary": "Sandesh achieved remarkable turnaround in Q3 with net profit of ₹391 million compared to loss of ₹209 million in previous year, despite revenue declining to ₹767 million from ₹788 million.",
            "Sentiment": "positive",
            "PublishDate": 1770298966524,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sandesh Limited Reports Company Secretary Resignation",
            "Summary": "Sandesh Limited disclosed the resignation of Company Secretary and Compliance Officer Hardik Patel, effective May 21, 2025, due to personal reasons, following regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768462181984,
            "Source": "stocks"
        },
        {
            "Title": "Sandesh Ltd Opens Special Window for Share Transfers",
            "Summary": "Sandesh Limited announces SEBI's special window facility for re-lodgement of physical share transfer deeds rejected before April 2019, available from July 7, 2025 to January 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1765458247977,
            "Source": "stocks"
        },
        {
            "Title": "Sandesh Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Sandesh reported quarterly revenue of 778 million rupees, up from 705 million rupees year-over-year. However, the company's consolidated net profit dropped significantly to 39 million rupees from 382 million rupees in the same period last year. EBITDA fell to 48 million rupees compared to 157 million rupees year-over-year, while EBITDA margin contracted to 6.12% from 22.31% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762957044236,
            "Source": "earnings"
        },
        {
            "Title": "Sandesh Limited Shareholders Approve Director Re-appointments and Dividend Declaration at 82nd AGM",
            "Summary": "Sandesh Limited held its 82nd Annual General Meeting on September 25, 2025, where shareholders approved several key resolutions. The company confirmed an interim dividend of Rs. 2.50 per equity share and declared a final dividend of Rs. 2.50 per equity share for the financial year ended March 31, 2025. The final dividend will be paid on October 10, 2025, to shareholders on record as of August 22, 2025. Shareholders re-appointed Smt. Pannaben Falgunbhai Patel as Director, who was retiring by rotation. The meeting also approved the continuation of Shri Falgunbhai C. Patel as Chairman & Managing Director after he attains 70 years of age on January 11, 2026, extending his term until March 31, 2027. Additionally, M.C. Gupta & Co. was appointed as Secretarial Auditor for a five-year term from 2025-26 to 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1758801599491,
            "Source": "corporate_action"
        },
        {
            "Title": "The Sandesh Limited Reports Strong Q1 Results, Declares Rs. 2.50 Final Dividend",
            "Summary": "The Sandesh Limited approved its standalone and consolidated unaudited financial results for the quarter ended June 30, 2025. The company reported standalone profit after tax of Rs. 5,833.86 lakhs compared to Rs. 5,049.39 lakhs in the same quarter last year. Consolidated profit after tax stood at Rs. 5,803.89 lakhs versus Rs. 5,048.74 lakhs in the previous year quarter. The Board fixed August 22, 2025 as the record date for a final dividend of Rs. 2.50 per equity share for FY 2024-25, subject to shareholder approval. The company also appointed Mr. Hardik Joshi as Company Secretary and Compliance Officer, approved the reappointment of Smt. Pannaben Falgunbhai Patel as a non-executive director, and approved the continuation of Shri Falgunbhai C. Patel as Chairman & Managing Director after he attains 70 years of age.",
            "Sentiment": "positive",
            "PublishDate": 1754401603923,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandesh Reports 15% Growth in Q1 Net Profit to 583 Million Rupees",
            "Summary": "Sandesh reported Q1 consolidated net profit of 583 million rupees compared to 505 million rupees in the same period last year. Revenue increased to 729 million rupees from 682 million rupees year-over-year. EBITDA rose to 185 million rupees from 156 million rupees, while EBITDA margin improved to 25.35% from 22.87% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754399573165,
            "Source": "earnings"
        },
        {
            "Title": "Sandesh Reports Improved Q2 EBITDA and Margin",
            "Summary": "Sandesh, a media company, has reported its Q2 financial results. The company's EBITDA increased from 145 million rupees to 157 million rupees year-over-year. Additionally, the EBITDA margin improved from 19.96% to 22.31% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731398037000,
            "Source": "result"
        },
        {
            "Title": "Sandesh Reports Q2 FY2024 Financial Results",
            "Summary": "Sandesh Limited has announced its Q2 FY2024 consolidated financial results. The company reported a net profit of 382 million rupees, up from 259 million rupees in the same quarter last year. However, revenue decreased to 705 million rupees from 724.5 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731397958000,
            "Source": "result"
        }
    ]
}