{
    "Symbol": "SANDUMA",
    "ISIN": "INE149K01016",
    "News": [
        {
            "Title": "Sandur Manganese Board Addresses BSE Fine for Delay",
            "Summary": "The Sandur Manganese & Iron Ores Limited board acknowledged a ₹11,800 fine from BSE for delayed board meeting intimation, citing inadvertent oversight of stock exchange holiday.",
            "Sentiment": "neutral",
            "PublishDate": 1770210987985,
            "Source": "stocks"
        },
        {
            "Title": "Sandur Manganese Board Meet Set for Feb 4, 2026",
            "Summary": "Sandur Manganese & Iron Ores Limited schedules board meeting on February 4, 2026 to review Q3FY26 unaudited financial results and consider early redemption of Non-Convertible Debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1769791323401,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sandur Manganese Appoints New Chief Risk Officer",
            "Summary": "The Sandur Manganese & Iron Ores Limited announced leadership changes with Manoj Kumar Jha appointed as Chief Risk Officer while Uttam Kumar Bhageria steps down to focus on CFO role.",
            "Sentiment": "neutral",
            "PublishDate": 1768313304084,
            "Source": "stocks"
        },
        {
            "Title": "Sandur Manganese And Iron Ores Receives MPAP Allocation For Mining Lease",
            "Summary": "Sandur Manganese And Iron Ores has received MPAP allocation for a mining lease. This allocation affects the company's mining operations and provides access to mineral resources for extraction activities.",
            "Sentiment": "positive",
            "PublishDate": 1763942776136,
            "Source": "stock"
        },
        {
            "Title": "Sandur Manganese And Iron Ores Secures MPAP Allocation For Mining Lease",
            "Summary": "Sandur Manganese And Iron Ores has secured MPAP allocation for a mining lease. This development affects the company's mining operations and provides access to mineral resources for extraction activities.",
            "Sentiment": "positive",
            "PublishDate": 1763730087847,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Bengaluru Approves Amalgamation of Sandur Manganese Promoter Group Entities",
            "Summary": "NCLT Bengaluru has approved the amalgamation of promoter group entities into Lohagiri Industrials Pvt Ltd for Sandur Manganese & Iron Ores. The corporate restructuring involves consolidation of the company's promoter group structure through the approved merger process.",
            "Sentiment": "neutral",
            "PublishDate": 1763679157350,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese And Iron Ores Receives Approval for Mine Expansion",
            "Summary": "Sandur Manganese And Iron Ores has obtained approval to expand operations at its manganese and iron ore mines. The approval will allow the company to increase its mining activities across its existing mineral extraction facilities.",
            "Sentiment": "positive",
            "PublishDate": 1762963629672,
            "Source": "stock"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Reports Strong Q2 Growth with Net Profit Rising to 1.4 Billion Rupees",
            "Summary": "Sandur Manganese & Iron Ores delivered robust quarterly performance with consolidated net profit reaching 1.4 billion rupees compared to 321 million rupees in the same period last year. Revenue surged to 12.3 billion rupees from 2.6 billion rupees year-over-year. EBITDA increased significantly to 2.7 billion rupees versus 375.7 million rupees previously, while EBITDA margin improved to 22.13% from 14.44% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762733526187,
            "Source": "earnings"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Plans ₹2,000 Crore Expansion Into Steel and Energy Sectors",
            "Summary": "Sandur Manganese & Iron Ores announced plans to diversify into steel and energy businesses through a ₹2,000 crore investment in expansion projects. The expansion includes development of coke oven, captive power, and ferro alloy facilities. The company aims to enhance value addition and cost efficiency while targeting long-term margin stability through renewable integration and export expansion.",
            "Sentiment": "positive",
            "PublishDate": 1762528851479,
            "Source": "stock"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Reports Strong Q2 Performance with Revenue Growth to 12.3B Rupees",
            "Summary": "Sandur Manganese & Iron Ores delivered robust quarterly results with revenue reaching 12.3 billion rupees compared to 2.6 billion rupees in the same period last year. The company's EBITDA surged to 2.7 billion rupees from 375.7 million rupees year-over-year, while EBITDA margin improved to 22.13% from 14.44%. Consolidated net profit increased significantly to 1.4 billion rupees versus 321 million rupees in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762517454956,
            "Source": "earnings"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Gets Forest Land Approval for Karnataka Mining Infrastructure",
            "Summary": "Sandur Manganese & Iron Ores received final approval from the Ministry of Environment, Forest and Climate Change (MoEF&CC) for diversion of forest land in Karnataka. The approval is for establishing a Direct Dispatch System (DCS) from Kammathuru Iron Ore Mine to PMBR (BMM) Siding.",
            "Sentiment": "positive",
            "PublishDate": 1759709603985,
            "Source": "stock"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Receives Final Environmental Approval for Forest Land Diversion",
            "Summary": "The Sandur Manganese & Iron Ores Limited received final approval from the Ministry of Environment, Forest and Climate Change for diversion of 2.4314 hectares of forest land in Deogiri Swamimalai Forest Block, Sandur Taluk, Bellary District, Karnataka. The approval is for establishing a Downhill Conveyor Pipe System from Kammathuru Iron Ore Mine to PMBR siding. The company will now approach the Department of Forests & Environment, Government of Karnataka to execute a Forest Lease Agreement in accordance with applicable provisions.",
            "Sentiment": "positive",
            "PublishDate": 1759507983913,
            "Source": "stock"
        },
        {
            "Title": "Sandur Manganese Shares Trade Ex-Bonus with 2:1 Ratio Issue",
            "Summary": "Sandur Manganese & Iron Ores Ltd. shares began trading adjusted for its bonus issue with a 2:1 ratio, meaning shareholders receive two bonus shares for every one share held as of the record date. Investors purchasing shares on the record date are not eligible for the bonus issue. The share price adjusts proportionally, maintaining the same total value despite increased share count. This marks the company's second bonus issue in two years, following a previous 5:1 ratio issue. The stock closed at ₹477.6, up 1.1% on Friday, with gains of 6.3% over the past month and 14% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1758504321282,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Announces 2:1 Bonus Issue with Record Date September 22, 2025",
            "Summary": "Sandur Manganese & Iron Ores has announced a 2:1 bonus issue with September 22, 2025 as the record date. Shareholders will receive two additional equity shares for every one share held without any additional cost. The stock has delivered nearly 1,100% returns over the past five years. For 2025, the stock has gained 12.73% year-to-date, with recent performance showing 3.26% growth over three months, 2.10% over one month, and 2.65% over the past week. The six-month performance remained relatively flat at 0.13% gain.",
            "Sentiment": "positive",
            "PublishDate": 1758250891945,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Receives In-Principle Approval for 2:1 Bonus Issue",
            "Summary": "Sandur Manganese & Iron Ores has received in-principle approval for a 2:1 bonus issue. This means existing shareholders will receive two additional shares for every one share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1757942264798,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Shareholders Approve Share Capital Increase and 2:1 Bonus Issue",
            "Summary": "The Sandur Manganese & Iron Ores Limited shareholders have approved two key resolutions through postal ballot voting that concluded on September 10, 2025. The first resolution approved increasing the company's authorized share capital from ₹200 crore to ₹600 crore, divided into 60 crore equity shares of ₹10 each, with 99.74% votes in favor. The second resolution approved issuing bonus shares in a 2:1 ratio (2 new shares for every 1 existing share) to eligible shareholders, with 99.31% votes in favor. The bonus issue will capitalize up to ₹324.07 crore from the company's available reserves of ₹2,581.41 crore. The remote e-voting process ran from August 12 to September 10, 2025, with T. Sathya Prasad Yadav serving as the scrutinizer. Both the new equity shares and bonus shares will rank equally with existing shares.",
            "Sentiment": "positive",
            "PublishDate": 1757591824685,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Increases Authorized Share Capital to ₹600 Crore",
            "Summary": "Sandur Manganese & Iron Ores Limited shareholders approved an increase in authorized share capital through a postal ballot resolution on September 10, 2025. The company's authorized share capital has been increased to ₹600 crore, divided into 60 crore equity shares of ₹10 each. This required a consequent alteration of the Capital Clause in the company's Memorandum of Association. The resolution provides the company with power to divide shares into equity and preference share capital and attach various rights and privileges as permitted under the Companies Act, 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1757590991055,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Sets Record Date for Rs 1.25 Per Share Dividend",
            "Summary": "The Sandur Manganese & Iron Ores Limited has set Wednesday, 10 September 2025 as the record date for dividend distribution of Rs 1.25 per equity share (12.5%) for the financial year ended 31 March 2025. The dividend is subject to approval at the company's 71st Annual General Meeting. Once approved by members, the dividend will be paid within 30 days from the date of approval.",
            "Sentiment": "positive",
            "PublishDate": 1756208133306,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Requests Physical Shareholders to Provide Demat Details for Bonus Share Allotment",
            "Summary": "The Sandur Manganese & Iron Ores Limited has sent letters to shareholders holding physical shares, requesting them to provide demat account details for crediting bonus shares. The company referenced a Postal Ballot Notice dated 8 August 2025 seeking approval for Issue of Bonus Shares. SEBI regulations require that bonus shares be allotted only in dematerialized form. Shareholders holding physical shares must submit required documents including request letter, Form ISR-1, Form ISR-2, self-attested copies of PAN and Aadhaar, and Client Master List by 15 September 2025. If documents are not received by the deadline, bonus shares will be credited to a Suspense Escrow Demat Account, and shareholders can later claim them through the company or its registrar Venture Capital & Corporate Investments Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1755602611103,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese Seeks Shareholder Approval for Authorized Capital Increase and 2:1 Bonus Share Issue",
            "Summary": "The Sandur Manganese & Iron Ores Limited has issued a postal ballot notice seeking shareholder approval for two key proposals. The company proposes to increase its authorized share capital from ₹200 crore to ₹600 crore, divided into 60 crore equity shares of ₹10 each. Additionally, the company seeks approval to issue bonus shares in a 2:1 ratio, offering 2 new fully paid-up equity shares for every 1 existing share held by eligible shareholders. The bonus issue will capitalize up to ₹324.07 crore from the company's available reserves of ₹2,581.41 crore. The remote e-voting period runs from August 12, 2025, to September 10, 2025. The board cited the company's strong financial position, successful integration of Arjas Steel Private Limited, and robust consolidated financial performance as reasons for the proposals. The initiatives aim to reward existing shareholders, encourage retail investor participation by making shares more affordable, and increase share liquidity.",
            "Sentiment": "positive",
            "PublishDate": 1754888819760,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese Reports 84% Revenue Growth in Q1 FY26, Driven by Mining Expansion and Steel Acquisition",
            "Summary": "The Sandur Manganese & Iron Ores Limited reported strong quarterly results with total income rising 84% year-on-year to ₹1,150 crore, while EBITDA grew 47% to ₹314 crore and profit after tax increased 16% to ₹167 crore. However, EBITDA margin declined to 27% from previous year levels. The growth was driven by the company's mining capacity expansions - manganese ore to 0.599 MTPA and iron ore to 4.45 MTPA - and the integration of Arjas Steel acquired in November 2024. Production volumes were strong with manganese ore at 1.21 lakh tonnes and iron ore at 10.71 lakh tonnes, though sales volumes declined year-on-year for most segments. The company, which is the 2nd largest manganese ore miner and 3rd largest iron ore miner in Karnataka, also commissioned a 42.9 MW renewable energy project. Management highlighted focus on ramping up sales after capacity expansions and maximizing synergies from the steel acquisition, while noting seasonal softness expected in steel markets due to monsoon.",
            "Sentiment": "positive",
            "PublishDate": 1754675433869,
            "Source": "earnings"
        },
        {
            "Title": "Sandur Manganese Re-appoints Bahirji Ajai Ghorpade as Managing Director for Three Years",
            "Summary": "The Sandur Manganese & Iron Ores Limited board re-appointed Bahirji Ajai Ghorpade as Managing Director for a three-year term from October 1, 2025 to September 30, 2028. The decision was made at the 380th board meeting based on recommendations from the Nomination and Remuneration Committee and Audit Committee. The appointment is subject to shareholder approval at the upcoming Annual General Meeting. Ghorpade, who holds a Commerce degree and Master's in Finance and Management, has been with the company since 2015 and became Managing Director in June 2020. During his tenure, he has overseen record-breaking turnover and profitability achievements and played a vital role in the strategic acquisition of Arjas Steel Private Limited. He also serves as Chairman & Managing Director of Arjas Steel Private Limited, a material subsidiary of the company.",
            "Sentiment": "positive",
            "PublishDate": 1754650766871,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Reports Q1 FY26 Results, Board Approves 2:1 Bonus Share Issue",
            "Summary": "The Sandur Manganese & Iron Ores Limited announced its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported net profit of ₹12,875 lakh compared to ₹13,930 lakh in the preceding quarter and ₹14,635 lakh in the corresponding quarter of the previous year. Revenue from operations stood at ₹42,272 lakh versus ₹59,495 lakh in the previous quarter. On a consolidated basis, net profit was ₹16,709 lakh against ₹15,650 lakh in the preceding quarter, with revenue at ₹1,13,538 lakh compared to ₹1,32,127 lakh previously. The Board of Directors approved the issuance of bonus shares in a 2:1 ratio, subject to shareholder approval. The company operates across mining, ferroalloys, coke and energy, and steel segments.",
            "Sentiment": "neutral",
            "PublishDate": 1754646746526,
            "Source": "earnings"
        },
        {
            "Title": "Sandur Manganese Announces 2-for-1 Bonus Share Issue Amid Mixed Q1 Results",
            "Summary": "Sandur Manganese & Iron Ores has announced a 2-for-1 bonus share issue. The company reported Q1 revenue of 4.23 billion rupees, down from 6 billion rupees in the same period last year. Net profit decreased to 1.3 billion rupees from 1.46 billion rupees year-over-year. However, EBITDA improved to 2.1 billion rupees from 1.9 billion rupees, with EBITDA margin significantly increasing to 48.94% from 31.74% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754646185304,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese Gets Supreme Court Nod to Increase Annual Production Capacity",
            "Summary": "Sandur Manganese And Iron Ores has received Supreme Court approval to increase its manganese ore annual production limit from 0.032 MMT to 0.049 MMT. This represents a production capacity increase of approximately 53% for the company's manganese ore operations.",
            "Sentiment": "positive",
            "PublishDate": 1754576635760,
            "Source": "stock"
        },
        {
            "Title": "Sandur Manganese & Iron Ores to Review Quarterly Results and Bonus Issue on August 8",
            "Summary": "Sandur Manganese & Iron Ores will consider its quarterly results and the issue of bonus shares on August 8. The company has scheduled this board meeting to deliberate on both financial performance review and potential bonus share distribution to shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1754386779250,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Redesignates Anand Sen from Independent to Non-Executive Director",
            "Summary": "The Sandur Manganese & Iron Ores Limited redesignated Anand Sen from Independent Director to Non-Executive Director effective March 25, 2025. The company clarified to stock exchanges that Sen is not debarred from holding a directorship by any SEBI order or other authority. This clarification was provided following an email from the National Stock Exchange regarding affirmation relating to Sen's redesignation.",
            "Sentiment": "neutral",
            "PublishDate": 1753422555590,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Recommends Dividend",
            "Summary": "Sandur Manganese & Iron Ores has recommended a dividend of 1.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748446319000,
            "Source": "result"
        },
        {
            "Title": "SANDUR MANGANESE & IRON ORES Reports Q4 Financial Results",
            "Summary": "SANDUR MANGANESE & IRON ORES announced its Q4 financial results. The company's EBITDA increased to 2.4 billion rupees from 2.08 billion rupees year-over-year, with an EBITDA margin of 39.60% compared to 37.68% in the previous year. Net profit for Q4 was 1.4 billion rupees, down from 1.62 billion rupees year-over-year but up from 1.3 billion rupees quarter-over-quarter. Revenue for Q4 rose to 5.9 billion rupees from 5.52 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748446285000,
            "Source": "result"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Receives Additional Iron Ore Production Allocation",
            "Summary": "Sandur Manganese & Iron Ores has been granted permission by the Supreme Court-appointed Monitoring Committee to produce an extra 0.5041 million tonnes per annum (MTPA) of silicious hematitic ore for the remaining eleven months of the 2025-26 financial year. This allocation is in addition to the company's Maximum Permissible Annual Production (MPAP) of iron ore.",
            "Sentiment": "positive",
            "PublishDate": 1746807773000,
            "Source": "default"
        },
        {
            "Title": "Sandur Manganese Receives Approval to Expand Iron Ore Production",
            "Summary": "Sandur Manganese has obtained consent from the Karnataka State Pollution Control Board (KSPCB) to expand its iron ore production capacity to 4.36 million tonnes per annum (MTPA). This approval marks a significant step in the company's expansion plans and could potentially boost its production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1745995051000,
            "Source": "default"
        },
        {
            "Title": "Sandur Manganese Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Sandur Manganese has reported a substantial increase in both net profit and revenue for the third quarter. The company's net profit rose to 1.27 billion rupees, up from 96 million rupees year-over-year and 321.2 million rupees quarter-over-quarter. Revenue also saw a significant jump to 4.82 billion rupees, compared to 1.53 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739751284000,
            "Source": "earnings"
        },
        {
            "Title": "Sandur Manganese Reports Significant Profit Increase in Q3",
            "Summary": "Sandur Manganese has reported a substantial increase in net profit for the third quarter. The company's net profit rose to 1.27 billion rupees, up from 96 million rupees in the same quarter last year (year-over-year) and 321.2 million rupees in the previous quarter (quarter-over-quarter).",
            "Sentiment": "positive",
            "PublishDate": 1739547759000,
            "Source": "earnings"
        },
        {
            "Title": "Sandur Manganese and Iron Ores: Approval for Increased Iron Ore Production",
            "Summary": "Sandur Manganese and Iron Ores Ltd. received approval from the Central Empowered Committee to increase its annual iron ore production limit from 3.81 MTPA to 4.36 MTPA. The company will now seek additional regulatory clearances to operate at the increased levels.",
            "Sentiment": "positive",
            "PublishDate": 1735747137000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Receives Expansion Consent for Ramghad Mines",
            "Summary": "Sandur Manganese & Iron Ores has obtained consent for establishment-expansion from the Karnataka State Pollution Control Board (KSPCB) for its Ramghad manganese and iron ore mines. This approval allows the company to increase its iron ore production and handling capabilities at the site.",
            "Sentiment": "positive",
            "PublishDate": 1735172354000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Receives Expansion Consent for Ramghad Mines",
            "Summary": "Sandur Manganese & Iron Ores has obtained consent for establishment-expansion from the Karnataka State Pollution Control Board (KSPCB) for its Ramghad Manganese & Iron Ore Mines. This approval enables the company to increase its iron ore production and handling capacity at the site.",
            "Sentiment": "positive",
            "PublishDate": 1735049669000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandur Manganese & Iron Ores Identified as Major Iron Ore Producer in Karnataka",
            "Summary": "Sandur Manganese & Iron Ores has been recognized as one of the major iron ore producers in the state of Karnataka, India, according to a report by CNBC TV18. This highlights the company's significant role in the region's mining industry and its contribution to the iron ore market.",
            "Sentiment": "positive",
            "PublishDate": 1734943098000,
            "Source": "normal_news"
        },
        {
            "Title": "SANDUR MANGANESE & IRON ORES Reports Q2 Financial Results",
            "Summary": "SANDUR MANGANESE & IRON ORES has released its Q2 financial results. The company's EBITDA for the quarter was 375.7 million rupees, compared to 375 million rupees in the same quarter last year. However, the EBITDA margin decreased from 20.31% to 14.44% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731506803000,
            "Source": "result"
        },
        {
            "Title": "SANDUR MANGANESE & IRON ORES Reports Q2 Revenue Growth",
            "Summary": "SANDUR MANGANESE & IRON ORES has reported a significant increase in its second quarter revenue. The company's revenue for Q2 reached 2.6 billion rupees, compared to 1.85 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731506646000,
            "Source": "result"
        },
        {
            "Title": "SANDUR MANGANESE & IRON ORES Reports Q2 Profit Increase",
            "Summary": "SANDUR MANGANESE & IRON ORES has reported a net profit of 321 million rupees for the second quarter, showing an increase from 264 million rupees in the same quarter last year. However, this represents a significant decrease from the previous quarter's profit of 1.46 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1731506605000,
            "Source": "result"
        },
        {
            "Title": "Sandur Manganese: Full Acquisition of Arjas Steel Approved",
            "Summary": "Sandur Manganese & Iron Ores Limited (SANDUMA) to acquire remaining 20% stake in Arjas Steel Private Limited (ASPL), reaching 100% ownership. Board approved acquisition on November 4, 2024. Deal valued at ₹3,000 crore enterprise value, expected to close by November 15, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1730793058000,
            "Source": "corporate_action"
        }
    ]
}