{
    "Symbol": "SANDHAR",
    "ISIN": "INE278H01035",
    "News": [
        {
            "Title": "Sandhar Technologies Q3FY26 Earnings Call on Feb 16",
            "Summary": "Sandhar Technologies has scheduled an investor conference call for February 16, 2026, at 10:00 AM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770811223778,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sandhar Technologies Board Meet on Feb 11, 2026",
            "Summary": "Sandhar Technologies Limited has scheduled a board meeting on February 11, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769604993075,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sandhar Technologies Reports 29% Revenue Growth in Q2 FY26 Despite Margin Pressures",
            "Summary": "Sandhar Technologies achieved 29% consolidated revenue growth to INR 1,153 crores in Q2 FY26, with India business growing 33%, though EBITDA margins compressed due to new project costs of INR 11.21 crores. The company expects strong Q3-Q4 performance driven by festive season demand and aims to achieve double-digit margins by March 2026 while targeting 18% pre-tax ROCE.",
            "Sentiment": "neutral",
            "PublishDate": 1763640423778,
            "Source": "earnings"
        },
        {
            "Title": "Sandhar Technologies Reports Strong Q2 FY26 Results with 33% Revenue Growth",
            "Summary": "Sandhar Technologies delivered robust quarterly performance with standalone revenue rising 33% to Rs 1,153.02 crores and consolidated revenue growing 29% to Rs 1,270.37 crores, while net profit increased 103% and 83% respectively. The auto component manufacturer's strong operational performance was driven by improved margins and higher volumes across its locking systems, vision systems, and sheet metal assemblies business segments.",
            "Sentiment": "positive",
            "PublishDate": 1763060028817,
            "Source": "earnings"
        },
        {
            "Title": "Sandhar Technologies Reports Quarterly Results and Board Approvals",
            "Summary": "Sandhar Technologies Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025, as recommended by the Audit Committee. The company also approved a variation in the terms of appointment for Gurvinder Jeet Singh, Wholetime Director Head Corporate Strategy, changing his position from non-rotational to rotational Wholetime Director effective November 13, 2025. The Board meeting was held on November 13, 2025, commencing at 11:30 AM and concluding at 2:05 PM. The financial results include both standalone and consolidated statements, with Limited Review Reports issued by statutory auditors BSR & Co. LLP.",
            "Sentiment": "neutral",
            "PublishDate": 1763028055804,
            "Source": "earnings"
        },
        {
            "Title": "Sandhar Technologies COO Venkataraman Srinivasan Resigns Due to Family Medical Emergency",
            "Summary": "Sandhar Technologies announced the resignation of Venkataraman Srinivasan, Chief Operating Officer of the Cabins Fabrication Division and designated Key Managerial Personnel. Srinivasan submitted his resignation on October 27, 2025, citing a family member's serious medical condition requiring personal attention and care. The company accepted his resignation and relieved him from duties effective October 31, 2025. Srinivasan requested early relief from his responsibilities, stating he would be unable to continue discharging his professional duties effectively under the circumstances. The company expressed appreciation for his valuable contributions during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1761903406911,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sandhar Technologies Senior Management Personnel Resigns Due to Health Concerns",
            "Summary": "Sandhar Technologies Limited announced the resignation of Mr. Harjit Singh, Assistant Vice President of Research Development Department and designated Senior Management Personnel. Singh submitted his resignation on October 30, 2025, citing ongoing health concerns as the reason for his departure. The company accepted his resignation with immediate effect from the close of business hours on October 30, 2025. Singh had requested to be relieved from his duties at the earliest possible date.",
            "Sentiment": "neutral",
            "PublishDate": 1761831537441,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sandhar Technologies Shareholders Approve Authorized Share Capital Increase to Rs 80 Crore",
            "Summary": "Sandhar Technologies Limited shareholders approved an increase in authorized share capital and alteration of the Capital Clause in the Memorandum of Association during a meeting held on September 19, 2025. The new authorized share capital structure consists of Rs 80 crore divided into 7.8 crore equity shares of Rs 10 each and 2 lakh preference shares of Rs 100 each. The approval was granted through an ordinary resolution and remains subject to approval from the Registrar of Companies, Delhi & Haryana.",
            "Sentiment": "neutral",
            "PublishDate": 1758297916857,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandhar Technologies Re-appoints Jayant Davar as Executive Chairman and CEO for Five Years",
            "Summary": "Sandhar Technologies Limited shareholders approved the re-appointment of Jayant Davar as Executive Chairman and Chief Executive Officer for a five-year term beginning January 1, 2026. The decision was made at the company's 33rd Annual General Meeting held on September 19, 2025, following recommendations from the Nomination and Remuneration Committee and Board approval. Davar, who is the company's founder, holds a mechanical engineering degree from Thapar Institute and is a Harvard Business School alumnus. He brings over four decades of experience in the auto component industry and serves on various industry bodies including advisory roles with Fraunhofer Gesellschaft Germany and the Automotive Component Manufacturers Association. Davar is related to directors Monica Davar and Neel Jay Davar.",
            "Sentiment": "positive",
            "PublishDate": 1758297536120,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sandhar Technologies Discloses Major Shareholder Declaration and SEBI Exemption for Share Settlement",
            "Summary": "Sandhar Technologies Limited disclosed a declaration received from major shareholders Jayant Davar (Settlor of Cream & Cookies Trust) and Monica Davar (Settlor of Hazelnut Family Trust) regarding substantial acquisition of shares under SEBI regulations. The declaration was submitted on September 1, 2025, pursuant to Regulation 29(2) of SEBI's Substantial Acquisition of Shares and Takeovers Regulations, 2011. SEBI granted an exemption under Regulation 11(5) through order No. WTM/AB/CFD/03/2025-26 dated April 30, 2025, for the proposed settlement of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1756979554535,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandhar Technologies Targets 20% Revenue Growth in FY26, Focuses on Two-Wheeler Smart Locks",
            "Summary": "Sandhar Technologies expects to achieve double-digit EBITDA margins by the end of the current financial year, with a 50 basis points improvement. Chairman, MD and CEO Jayant Davar projects 20% revenue growth in FY26, supported by the acquisition of Sundaram Clayton's aluminium die-casting business. The company is expanding into smart locks for two-wheelers, where revenue per lock is eight to ten times higher than traditional locks. Two major clients have adopted these smart locks as standard equipment. The locking systems business generates margins of 14-16%, while newer segments like casting and sheet metal have lower margins. Sandhar Technologies targets 15% return on capital employed for FY26 and plans to raise approximately Rs 500 crore for potential acquisitions. The company expects growth rates double the industry average.",
            "Sentiment": "positive",
            "PublishDate": 1756881961811,
            "Source": "stock"
        },
        {
            "Title": "Sandhar Technologies Acquires 4.51% Stake in Clean Renewable Energy KK 1A for INR 2.72 Crores",
            "Summary": "Sandhar Technologies Limited has acquired a 4.51% shareholding in Clean Renewable Energy KK 1A Private Limited through a Share Subscription and Shareholders Agreement. The acquisition was completed for a total cash consideration of INR 2.72 crores. This transaction follows earlier intimations made by the company in May and July 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755524027196,
            "Source": "order&deals"
        },
        {
            "Title": "Sandhar Technologies Reports 21% Revenue Growth in Q1 FY26 Despite Margin Pressures",
            "Summary": "Sandhar Technologies achieved 21% revenue growth in Q1 FY26, with India business growing 22% at consolidated level. However, consolidated EBITDA declined to 9.18% from 9.85% in Q1 FY25 due to multiple factors including foreign currency translation loss of INR 4.5 crores, commodity price impact of INR 3 crores, and one-time power costs in Mexico of INR 2 crores. Two customers faced supply issues resulting in business loss of INR 20 crores, while BS IV to BS V transition in construction sector affected quarterly sales. The company's overseas subsidiaries registered a loss of EUR 1.06 million including foreign exchange translation loss of EUR 0.46 million. Sandhar has exited two joint ventures and maintains five profitable JVs with total investment of INR 62.72 crores. The company generated INR 2 crores revenue from EV products including battery chargers, motor controllers and DC-DC converters. Management maintains guidance of 0.5% EBITDA margin improvement for the year and expects Q2 performance to be considerably better than Q1.",
            "Sentiment": "neutral",
            "PublishDate": 1755156441888,
            "Source": "earnings"
        },
        {
            "Title": "Sandhar Technologies Reports 19% Revenue Growth to ₹1,090 Crores in Q1 FY26",
            "Summary": "Sandhar Technologies Limited reported consolidated revenue of ₹1,090 crores for the quarter ended June 30, 2025, representing a 19% year-over-year increase from ₹913 crores in the same period last year. The company's standalone revenue grew 8% to ₹728 crores. However, consolidated net profit declined 4% to ₹28 crores, while standalone net profit increased 3% to ₹25 crores. EBITDA margins compressed slightly with consolidated EBITDA at 9.34% compared to 9.90% in the previous year. The company's debt-to-equity ratio increased to 0.74 from 0.61 in the previous fiscal year. Two-wheeler segment contributed 65.8% of total revenue, while passenger vehicles accounted for 14.7%. Geographically, India business represented 88.7% of revenue with overseas operations contributing 11.3%. The company highlighted normalized profit adjustments for exceptional expenses including foreign currency translation losses, commodity price impacts, and business losses due to lower volumes.",
            "Sentiment": "neutral",
            "PublishDate": 1754590891805,
            "Source": "earnings"
        },
        {
            "Title": "Sandhar Technologies Reports Q1 FY26 Results, Announces Leadership Changes and Business Restructuring Plans",
            "Summary": "Sandhar Technologies Limited reported quarterly results for the period ended June 30, 2025, with standalone revenue from operations of Rs 728.12 crores and net profit after tax of Rs 254.02 crores. The company scheduled its 33rd Annual General Meeting for September 19, 2025, via video conferencing. The Board approved the appointment of Jayant Davar as Executive Chairman and CEO effective January 1, 2026, subject to shareholder approval. The company designated three Key Managerial Personnel and ten Senior Management Personnel across various business functions. Sandhar approved slump sales of two aluminium die casting units to its wholly owned subsidiary Sandhar Ascast Private Limited to consolidate operations and achieve economies of scale. The Board also approved raising capital up to Rs 500 crores through various modes, increasing authorized share capital from Rs 70 crores to Rs 80 crores, and enhancing borrowing limits from Rs 600 crores to Rs 1,200 crores, all subject to shareholder approval. Book closure dates were set from September 13-19, 2025, for final dividend eligibility of Rs 3.50 per equity share for FY 2024-25.",
            "Sentiment": "positive",
            "PublishDate": 1754556527405,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandhar Technologies Reports Decline in Q1 Net Profit and EBITDA Margin",
            "Summary": "Sandhar Technologies reported consolidated net profit of 280 million rupees in Q1, down from 291 million rupees in the same quarter last year. The company's EBITDA decreased to 824 million rupees from 847 million rupees year-over-year. EBITDA margin compressed to 7.56% compared to 9.39% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1754555993316,
            "Source": "earnings"
        },
        {
            "Title": "Sandhar Technologies Signs 25-Year Power Purchase Agreement with Clean Renewable Energy",
            "Summary": "Sandhar Technologies Limited has executed a Power Purchase Agreement with Clean Renewable Energy KK 1A Private Limited for a 25-year term to procure contracted energy for the company's facilities at group level. The agreement covers facilities situated within the distribution area of relevant DISCOMs. The company describes this as a strategic step toward enhancing environmental sustainability and achieving greater cost efficiency in energy consumption. Further detailed disclosure regarding the investment involved will be provided once the company enters into the Share Subscription and Shareholders' Agreement. The parties have no existing shareholding relationship, and the transaction does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1753191374090,
            "Source": "order&deals"
        },
        {
            "Title": "Sandhar Technologies Signs Agreement with Subsidiary",
            "Summary": "Sandhar Technologies has signed a sale/purchase agreement with its subsidiary, Sandhar Engineering Pvt Ltd. No further details about the nature or terms of the agreement were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751463768000,
            "Source": "default"
        },
        {
            "Title": "Sandhar Technologies Exits Joint Ventures KSTPL and KSASPL",
            "Summary": "Sandhar Technologies has completed the sale of its stake in two joint ventures: KSTPL and KSASPL. The company has fully divested its interests in these partnerships.",
            "Sentiment": "neutral",
            "PublishDate": 1750772609000,
            "Source": "default"
        },
        {
            "Title": "Sandhar Technologies Sells Joint Venture Stake to Kwangsung",
            "Summary": "Sandhar Technologies has sold its complete joint venture stake to Korea's Kwangsung for ₹11.07 crores. This move is aimed at enhancing the company's strategic focus.",
            "Sentiment": "neutral",
            "PublishDate": 1750323872000,
            "Source": "default"
        },
        {
            "Title": "Sandhar Tech Reports Q4 Results and Declares Dividend",
            "Summary": "Sandhar Tech announced its Q4 financial results. The company reported revenue of 10 billion rupees, up from 9.18 billion rupees in the same quarter last year. EBITDA increased to 1.04 billion rupees from 940 million rupees year-over-year. However, the EBITDA margin decreased to 10.24% from 10.68%. Consolidated net profit rose to 426 million rupees from 359 million rupees in the previous year's quarter. Additionally, the company declared a dividend of 3.5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747905738000,
            "Source": "result"
        },
        {
            "Title": "Sandhar Technologies to Consider Q4 Results on May 22",
            "Summary": "Sandhar Technologies Limited has announced that it will consider and approve its financial results for the fourth quarter on May 22.",
            "Sentiment": "neutral",
            "PublishDate": 1745852665000,
            "Source": "default"
        },
        {
            "Title": "Sandhar Technologies to Sell Property in Bangalore for 610 Million Rupees",
            "Summary": "Sandhar Technologies has executed an agreement to sell a property located in Bangalore. The transaction is valued at 610 million Indian rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745235288000,
            "Source": "default"
        },
        {
            "Title": "Sandhar Technologies' Unit Acquires Sundaram-Clayton's Die Casting Business in Hosur",
            "Summary": "A subsidiary of Sandhar Technologies has announced a strategic acquisition of Sundaram-Clayton Limited's high pressure and low pressure aluminium die casting business located at their Hosur plant. This move is likely aimed at expanding Sandhar's manufacturing capabilities and market presence in the automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1743562113000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandhar Technologies Acquires Aluminium Die Casting Businesses from Sundaram-Clayton",
            "Summary": "Sandhar Technologies has announced the acquisition of aluminium die casting businesses from Sundaram-Clayton. This corporate action represents a significant expansion of Sandhar Technologies' manufacturing capabilities in the automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1742204915000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandhar Technologies to Sell Entire Stake in Joint Venture",
            "Summary": "Sandhar Technologies has approved the sale of its entire 50% stake in Jinyoung Sandhar Mechatronics, a joint venture company. This decision represents a significant corporate action that will alter the company's business structure and partnerships.",
            "Sentiment": "neutral",
            "PublishDate": 1742204883000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandhar Technologies: Q3 Profit Rises 18.71% YoY Despite Quarterly Decline",
            "Summary": "Sandhar Technologies reported Q3 FY25 results with profit up 18.71% YoY to ₹29.95 crore, revenue increased 9.46% YoY to ₹973.69 crore. However, profit declined 25.16% QoQ. EPS rose 18.05% YoY to ₹4.97. Operating income decreased 9.5% QoQ but increased 4.81% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1739566435000,
            "Source": "earnings"
        },
        {
            "Title": "Sandhar Technologies Reports Q3 EBITDA Growth",
            "Summary": "Sandhar Technologies has reported its Q3 financial results. The company's EBITDA increased to 950 million rupees from 886 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 9.75% from 9.96% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739369062000,
            "Source": "earnings"
        },
        {
            "Title": "Sandhar Technologies Reports Increased Q3 Profit and Revenue",
            "Summary": "Sandhar Technologies has announced its Q3 financial results. The company's consolidated net profit rose to 299 million rupees, up from 252 million rupees in the same quarter last year. Revenue also increased to 9.74 billion rupees from 8.89 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739369055000,
            "Source": "earnings"
        },
        {
            "Title": "Sandhar Technologies Signs 20-Year Solar Power Agreement",
            "Summary": "Sandhar Technologies has entered into a 20-year Power Purchase Agreement (PPA) with Clean Max Enviro Solutions to install solar energy at its manufacturing facility in Pune, Maharashtra. This move is aimed at enhancing sustainability and reducing costs for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738801095000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandhar Technologies Signs 20-Year Solar Power Agreement",
            "Summary": "Sandhar Technologies has entered into a 20-year Power Purchase Agreement (PPA) with Clean Max Enviro Solutions to install solar energy at its manufacturing facility in Pune, Maharashtra. This move is aimed at enhancing sustainability and reducing costs for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738761617000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandhar Technologies to Consolidate Assembly and Sheet Metal Business",
            "Summary": "Sandhar Technologies has announced plans to consolidate its assembly and sheet metal business with Sandhar Engineering. This move suggests a strategic restructuring within the company to streamline operations and potentially improve efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1731313921000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sandhar Technologies Reports Improved Q2 Financial Performance",
            "Summary": "Sandhar Technologies has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 812 million rupees to 988 million rupees. Additionally, the EBITDA margin improved from 9.17% to 10.04%.",
            "Sentiment": "positive",
            "PublishDate": 1731313771000,
            "Source": "result"
        },
        {
            "Title": "Sandhar Technologies Reports Q2 Revenue Growth",
            "Summary": "Sandhar Technologies Limited has reported a revenue of 9.8 billion rupees for the second quarter, compared to 8.8 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731313728000,
            "Source": "result"
        },
        {
            "Title": "Sandhar Technologies Reports Significant Profit Growth in Q2",
            "Summary": "Sandhar Technologies, an Indian automotive components manufacturer, has reported a substantial increase in its consolidated net profit for the second quarter. The company's net profit rose to 400 million rupees, up from 273 million rupees in the same period last year, marking a year-over-year growth of approximately 46.5%.",
            "Sentiment": "positive",
            "PublishDate": 1731313705000,
            "Source": "result"
        }
    ]
}