{
    "Symbol": "SANGHVIMOV",
    "ISIN": "INE989A01032",
    "News": [
        {
            "Title": "Sanghvi Movers Board Meet Set for Feb 6, 2026",
            "Summary": "Sanghvi Movers Limited has scheduled a board meeting on February 06, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770028136633,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sanghvi Movers Subsidiary Wins $4.3M Jindal Contract",
            "Summary": "Sanghvi Movers Botswana Proprietary Limited, wholly owned subsidiary, awarded USD 4.3 million work order from Jindal Energy Botswana for 4*175 MW contract, execution from Q4 FY26 to Q4 FY28.",
            "Sentiment": "positive",
            "PublishDate": 1768828423286,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sanghvi Movers' Auditor Converts to LLP Structure",
            "Summary": "Sanghvi Movers Limited announces that its statutory auditor M S K A & Associates has converted to M S K A & Associates LLP effective January 13, 2026, with no impact on ongoing audit services.",
            "Sentiment": "neutral",
            "PublishDate": 1768820757084,
            "Source": "stocks"
        },
        {
            "Title": "Sanghvi Movers Forms Botswana Subsidiary",
            "Summary": "Sanghvi Movers Limited incorporates wholly owned subsidiary in Botswana for crane rental services with share capital of 15,000 Botswana Pula on January 13, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768378705105,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sanghvi Movers Unit Wins ₹429 Crore Contract",
            "Summary": "Sanghvi Movers announces that its subsidiary has secured a significant contract worth ₹4.29 billion, marking a major business development for the heavy lifting and transportation services company.",
            "Sentiment": "positive",
            "PublishDate": 1766412807862,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sanghvi Movers Partners With Ace for Elevate 2030",
            "Summary": "Sanghvi Movers announces new partnership with Ace to enhance their Elevate 2030 vision through local heavy crane operations.",
            "Sentiment": "positive",
            "PublishDate": 1765449969277,
            "Source": "stocks"
        },
        {
            "Title": "Sanghvi Movers Partners with ACE for Indigenous Cranes",
            "Summary": "Sanghvi Movers Limited signs strategic MoU with Action Construction Equipment Limited to integrate domestically manufactured heavy cranes into its fleet, advancing ELEVATE 2030 vision and supporting Aatmanirbhar Bharat initiative.",
            "Sentiment": "positive",
            "PublishDate": 1765449689627,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sanghvi Movers Reports 35% Revenue Growth in Q2 FY26, Commences Saudi Arabia Operations",
            "Summary": "Sanghvi Movers achieved total income of INR 210 crores in Q2 FY26 versus INR 156 crores in Q2 FY25, with half-yearly revenue reaching INR 483 crores (up 57% year-on-year) and began commercial operations in Saudi Arabia with 30+ cranes deployed. The company maintains a strong order book of INR 1,239 crores and has approved capex of INR 629 crores for FY26, targeting global expansion under its Elevate 2030 strategy while serving infrastructure and renewable energy sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763097905177,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Reports 57% Revenue Growth to ₹483 Cr in H1 FY26",
            "Summary": "Sanghvi Movers Limited reported consolidated revenue of ₹483 crores for the half year ended September 30, 2025, representing a 57% increase from ₹307 crores in the previous year. The company achieved a profit after tax of ₹87 crores compared to ₹70 crores in H1 FY25. EBITDA stood at ₹195 crores with a margin of 40%. The company maintains a debt-to-equity ratio of 0.36:1 and has planned capital expenditure of ₹629 crores for FY26, with ₹140 crores already incurred. Sanghvi Movers operates as the world's 5th largest crane rental company with a fleet of 400+ cranes across 40-1600 MT capacities. The company has expanded operations to Saudi Arabia through its subsidiary and maintains an order book of ₹1,239 crores as of October 31, 2025. Average utilization improved to 75% with yield at 2.08%. The company has investments of ₹192 crores in mutual fund schemes generating 7-7.10% returns annually.",
            "Sentiment": "positive",
            "PublishDate": 1762753755272,
            "Source": "stock"
        },
        {
            "Title": "Sanghvi Movers Reports 25% Jump in Q2 Net Profit to 363 Million Rupees",
            "Summary": "Sanghvi Movers reported consolidated net profit of 363 million rupees in Q2, up from 291 million rupees in the same quarter last year. Revenue increased to 2.09 billion rupees from 1.56 billion rupees year-on-year. EBITDA rose to 808 million rupees compared to 731 million rupees in the previous year. However, EBITDA margin declined to 38.49% from 46.81% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762524944319,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Targets Rs 1,000 Crore Revenue in FY26 with Rs 950 Crore Order Book",
            "Summary": "Sanghvi Movers, Asia's largest crane rental service provider, aims to achieve Rs 1,000 crore revenue in FY26, supported by its current order book of Rs 950 crore. Managing Director Rishi Sanghvi expects to exceed the initially projected 30% revenue growth target. The company anticipates securing additional orders in the second half of FY26 from crane rental business across steel, cement, nuclear, thermal and renewable power, oil and gas, refineries, metros, railways and bridges sectors. Subsidiary Sangreen Future Renewables secured Rs 292 crore orders from Independent Power Producers for wind balance of plant execution with 10-12% EBITDA margins. Sanghvi Movers plans capital expenditure of approximately Rs 500 crore for FY26, with Rs 200 crore allocated for Saudi Arabia expansion and the remainder for Indian operations. Company shares closed 4.13% higher at Rs 387 on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1758092086326,
            "Source": "stock"
        },
        {
            "Title": "Sanghvi Movers' Subsidiary Secures Rs. 292 Crore Wind Energy Orders",
            "Summary": "Sangreen Future Renewable Private Limited, a material subsidiary of Sanghvi Mover Limited, has been awarded work orders worth Rs. 292 crores from various Independent Power Producers. The orders involve Wind Balance of Plant (BOP) services including construction of WTG civil foundations, internal roads, crane platforms, WTG transportation and installation, mechanical completion, internal 33Kv line works, and DP yards. The projects are scheduled to commence from Q2 of FY 2025-26 and complete by Q1 of FY 2026-27. The orders are from domestic entities with no related party transactions involved.",
            "Sentiment": "positive",
            "PublishDate": 1757933524102,
            "Source": "order&deals"
        },
        {
            "Title": "Sanghvi Movers Sets Record Date for Final Dividend Payment",
            "Summary": "Sanghvi Movers Limited has clarified that the record date for payment of final dividend is Friday, September 12, 2025. The clarification was communicated to BSE Limited and National Stock Exchange of India Limited by Company Secretary Vinav Agarwal.",
            "Sentiment": "neutral",
            "PublishDate": 1757498645505,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanghvi Movers Reports 65% Revenue Growth in Q1 FY2026, Expands Operations to Saudi Arabia",
            "Summary": "Sanghvi Movers Limited reported total income of ₹273 crores for Q1 FY2026, marking a 65% year-on-year growth. The company achieved an EBITDA margin of 38% and net profit of ₹50 crores. The crane rental business generated ₹159 crores revenue with 56% EBITDA margin, while the wind EPC business contributed ₹106 crores with 11% margin. The company expanded internationally by launching operations in Saudi Arabia through wholly-owned subsidiary Sanghvi Movers Middle East, deploying 12 cranes. Average capacity utilization improved to 80% from 77% in the previous year. The company added 21 cranes during the quarter and plans to add 75-80 cranes in FY26 with a revised CAPEX of ₹321 crores. Order book stands at ₹767 crores as of July 2025. Managing Director Rishi Sanghvi stated the company is transforming from a pure-play crane rental company to a group of companies with diversified verticals and geographical presence, with the wind EPC subsidiary accounting for nearly 20% of bottom line.",
            "Sentiment": "positive",
            "PublishDate": 1754980576839,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Reports Q1 FY26 Results with ₹273 Cr Revenue and ₹50 Cr Profit",
            "Summary": "Sanghvi Movers Limited submitted a revised investor presentation for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of ₹273.35 crores in Q1 FY26, up from ₹150.61 crores in Q1 FY25. Profit after tax stood at ₹50.26 crores compared to ₹40.60 crores in the same quarter last year. The company maintained an average capacity utilization of 81% and achieved an average blended yield of 2.11%. Net debt stood at ₹395 crores with a debt-to-equity ratio of 0.33:1. The company operates across three segments: crane hiring services (₹159.66 crores revenue), wind EPC (₹106.19 crores), and project EPC (₹7.50 crores). Sanghvi Movers has an order book of ₹767 crores and plans capital expenditure of ₹321 crores for FY26, including expansion in India and Saudi Arabia through its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1754575073575,
            "Source": "stock"
        },
        {
            "Title": "Sanghvi Movers Announces ₹471 Crore Investment Plan with Fleet Expansion and International Growth",
            "Summary": "Sanghvi Movers has outlined expansion plans involving ₹321 crore investment in India and ₹150 crore expansion in Saudi Arabia. The company plans to add over 76 new cranes to its fleet. The expansion is supported by a ₹767 crore order book, driven by demand in wind EPC and infrastructure sectors.",
            "Sentiment": "positive",
            "PublishDate": 1754476752260,
            "Source": "stock"
        },
        {
            "Title": "Sanghvi Movers Reports Quarterly Results with Key Leadership Changes",
            "Summary": "Sanghvi Movers Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of Rs. 15,934.54 lakhs and profit of Rs. 4,180.63 lakhs from continuing operations. On a consolidated basis, revenue from operations was Rs. 27,335.50 lakhs with profit of Rs. 5,025.73 lakhs. The company operates through three segments: crane hiring and other ancillary services, Wind EPC, and Project EPC. Significant management changes include the resignation of CFO Sham D. Kajale and appointment of Pradeep Mehta as new CFO. Company Secretary Rajesh P. Likhite resigned due to personal reasons and was replaced by Vinav Agarwal. Mohammed Almanaseer was appointed as Managing Director of the company's Middle East subsidiary. The board also approved changes to various committee compositions.",
            "Sentiment": "neutral",
            "PublishDate": 1754476704350,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Sanghvi Movers reported Q1 consolidated net profit of 303 million rupees, down from 405 million rupees in the same period last year. However, the company saw significant revenue growth with Q1 revenue reaching 2.73 billion rupees compared to 1.5 billion rupees year-over-year. EBITDA increased to 994 million rupees from 743 million rupees, though EBITDA margin compressed to 36.41% from 49.36% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754474858309,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Schedules Post Earnings Conference Call for Q1 FY2025-26 Results Discussion",
            "Summary": "Sanghvi Movers Limited will announce its unaudited financial results for the quarter ended June 30, 2025, on August 6, 2025. The company has scheduled a post earnings conference call on August 8, 2025, at 4:00 PM IST to discuss these quarterly results with fund managers, investors, analysts, and institutional investors. The teleconference will be led by Managing Director Rishi C. Sanghvi and Chief Executive Officer Gaurang Desai. The company has provided dial-in numbers for domestic and international participants across multiple countries. Conference call details will be published on the company's website, and no unpublished price sensitive information will be shared during the meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753364845968,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers: Targets 25-30% Revenue Growth in FY26",
            "Summary": "Sanghvi Movers Ltd. aims for 25-30% top-line growth in FY26, supported by a strong order book. The company plans to double revenue in Wind EPC and project EPC segments. Q4 FY25 saw 79% capacity utilization and a 2% blended average yield. The company is expanding into Saudi Arabia's infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1748061912000,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Secures Order Worth ₹49.5 Crore",
            "Summary": "Sanghvi Movers has received an order valued at ₹49.5 crore. No further details about the nature of the order or the client were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747901313000,
            "Source": "default"
        },
        {
            "Title": "Sanghvi Movers Reports Q4 Results and Declares Dividend",
            "Summary": "Sanghvi Movers has announced its Q4 financial results. The company's revenue decreased to 1.62 billion rupees from 1.65 billion rupees year-over-year. EBITDA declined to 890.6 million rupees from 923 million rupees, with the EBITDA margin dropping to 54.87% from 59.84%. Net profit decreased to 434.5 million rupees from 477 million rupees year-over-year, but increased from 184 million rupees quarter-on-quarter. The company has recommended a final dividend of 2 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747757534000,
            "Source": "result"
        },
        {
            "Title": "Sanghvi Movers Approves Investment in Sangreen Future Renewables",
            "Summary": "Sanghvi Movers has approved an investment in Sangreen Future Renewables. The cost of acquisition for this investment is reported to be 80 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1741865790000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanghvi Movers: Q3 Profit Plunges 46% Despite Revenue Growth",
            "Summary": "Sanghvi Movers reported Q3 FY25 results with profit falling 46.02% YoY to ₹33.08 crore, despite revenue increasing 24.5% to ₹207.96 crore. Operating income decreased 46.01% YoY. EPS dropped to ₹3.82, down 46.05% YoY. Rising SG&A expenses impacted profitability.",
            "Sentiment": "negative",
            "PublishDate": 1739653088000,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Sanghvi Movers has reported a significant decrease in its Q3 EBITDA, which fell to 546 million rupees from 1.14 billion rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 45.83% from 68.71% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739436317000,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Reports Q3 Revenue Decline",
            "Summary": "Sanghvi Movers, a company in the heavy equipment rental sector, has reported its third-quarter revenue. The company's revenue for Q3 stood at 1.2 billion rupees, compared to 1.63 billion rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1739436292000,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Reports Decline in Q3 Net Profit",
            "Summary": "Sanghvi Movers has reported a net profit of 184 million rupees for the third quarter, compared to 613 million rupees in the same period last year, representing a significant year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1739436262000,
            "Source": "earnings"
        },
        {
            "Title": "Sanghvi Movers Establishes Subsidiary in Saudi Arabia",
            "Summary": "Sanghvi Movers has incorporated a wholly owned subsidiary named 'Sanghvi Movers Middle East Ltd' as a limited liability company in the Kingdom of Saudi Arabia.",
            "Sentiment": "positive",
            "PublishDate": 1734569392000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanghvi Movers Establishes Subsidiary in Saudi Arabia",
            "Summary": "Sanghvi Movers has incorporated a wholly owned subsidiary named 'Sanghvi Movers Middle East Ltd' as a limited liability company in the Kingdom of Saudi Arabia.",
            "Sentiment": "positive",
            "PublishDate": 1734526194000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanghvi Movers Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Sanghvi Movers has reported a decrease in its Q2 consolidated EBITDA, which fell to 731 million rupees from 861 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 46.85% from 61.51% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731576498000,
            "Source": "result"
        },
        {
            "Title": "Sanghvi Movers Reports Q2 Net Profit Decline",
            "Summary": "Sanghvi Movers has reported a net profit of 291 million rupees for the second quarter, down from 372 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731576329000,
            "Source": "result"
        }
    ]
}