{
    "Symbol": "SANGAMIND",
    "ISIN": "INE495C01010",
    "News": [
        {
            "Title": "Sangam India Acquires 49% Stake in Clean Max Kenai",
            "Summary": "Sangam (India) Limited announced acquisition of 49% equity in Clean Max Kenai Private Limited for Rs 24 crore to develop 20 MW wind-solar hybrid captive power project in Rajasthan, targeting Rs 26 crore annual savings.",
            "Sentiment": "positive",
            "PublishDate": 1769601884194,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sangam India Q3FY26 Results Show Strong Growth",
            "Summary": "Sangam (India) Limited reports impressive Q3FY26 performance with 39.3% YoY EBITDA growth to ₹85 crores and 898.8% surge in net profit to ₹24 crores, driven by improved margins and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1769003442887,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sangam India Board Meet on Jan 21 for Q3FY26 Results",
            "Summary": "Sangam (India) Limited has scheduled its board meeting for January 21, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768381732580,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sangam India Signs 27 MW Solar Contract with IB Vogt",
            "Summary": "Sangam (India) Limited has entered into a contract with IB Vogt Solar for a 27 MW solar power project, marking the company's expansion into renewable energy infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1766750870017,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sangam India Reports 16% Revenue Growth and 32% EBITDA Jump in Q2 FY26",
            "Summary": "Sangam India Limited achieved revenue of INR 785 crores with 16% year-on-year growth and EBITDA of INR 76 crores (32% increase) in Q2 FY26, driven by higher volumes and improved product mix. The company revised its depreciation policy and expects 12-15% annual revenue growth with margin expansion of 1-2% in coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1763099047673,
            "Source": "earnings"
        },
        {
            "Title": "Sangam India Reports Higher Quarterly Profits After Revising Asset Life Estimates",
            "Summary": "Sangam India Limited reported quarterly results with profit after tax of Rs 2,378 lakhs for the quarter ended September 30, 2025, compared to Rs 482 lakhs in the same period last year. The company revised the estimated useful life of certain plant and machinery from 9.19 years to 15 years and solar power plants from 18 years to 25 years, effective April 1, 2025. This revision resulted in lower depreciation charges of Rs 2,407 lakhs for the half-year, leading to higher profit before tax by Rs 2,407 lakhs and profit after tax higher by Rs 1,801 lakhs. Revenue from operations stood at Rs 77,592 lakhs for the quarter versus Rs 67,510 lakhs in the previous year. The Board also approved issuing performance-linked sweat equity shares to promoter group members, with targets including PAT of Rs 100 crore and EBITDA of Rs 375 crore for FY 2026-27, scaling up to PAT of Rs 225 crore and EBITDA of Rs 600 crore for FY 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1762820407183,
            "Source": "earnings"
        },
        {
            "Title": "Sangam (India) Reports Strong Q2 Performance with 395% Jump in Net Profit",
            "Summary": "Sangam (India) delivered robust quarterly results with net profit surging to 238 million rupees from 48 million rupees in the same period last year. Revenue grew to 7.8 billion rupees compared to 6.75 billion rupees year-over-year. The company's EBITDA increased to 752 million rupees from 509 million rupees, while EBITDA margin improved to 9.69% from 7.54% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1762785993026,
            "Source": "earnings"
        },
        {
            "Title": "Sangam (India) Limited Acquires Stake in CGE II Hybrid Energy for Renewable Energy Access",
            "Summary": "Sangam (India) Limited's Investment and Borrowing Committee has approved and executed agreements to acquire a stake in CGE II Hybrid Energy Private Limited. The company signed a Power Consumption Agreement with CGE II Hybrid Energy Private Limited and a Share Purchase & Shareholders Agreement with CGE II Hybrid Energy Private Limited and Continuum Green Energy Limited. The transaction aims to secure renewable energy under captive status for Sangam's manufacturing units in Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1760510897124,
            "Source": "order&deals"
        },
        {
            "Title": "Sangam (India) Limited Shareholders Approve Key Resolutions at 39th AGM Including Rs. 2 Dividend and Director Appointments",
            "Summary": "Sangam (India) Limited shareholders approved multiple resolutions at their 39th Annual General Meeting held on September 19, 2025. Key approvals included adoption of audited financial statements for the year ended March 31, 2025, declaration of Rs. 2 dividend per equity share, and re-appointment of V.K. Sodani as Director retiring by rotation. Shareholders also approved the re-appointment of Sudhir Maheshwari as Independent Director for a second five-year term from August 1, 2025 to July 31, 2030. Additionally, M/s. B.K. Sharma & Associates was appointed as Secretarial Auditors for five consecutive years from FY 2025-26 to FY 2029-30, and remuneration of Cost Auditors for FY 2025-26 was ratified. V.K. Sodani serves as Executive Director and CEO of Fabric & Garment Business with over 27 years of textile industry experience, while Sudhir Maheshwari is a chartered accountant and company secretary with 37 years of global experience, currently serving as Founder and Managing Partner at Synergy Capital.",
            "Sentiment": "positive",
            "PublishDate": 1758280015633,
            "Source": "corporate_action"
        },
        {
            "Title": "Sangam (India) Limited Sets Record Date for ₹2.00 Final Dividend Payment",
            "Summary": "Sangam (India) Limited has set September 12, 2025 as the record date for determining shareholder eligibility for a final dividend of ₹2.00 per equity share for financial year 2024-25. The Board of Directors recommended this dividend at their May 29, 2025 meeting, subject to shareholder approval at the 39th Annual General Meeting scheduled for September 19, 2025. The dividend applies to equity shares of ₹10.00 each. Payment will be made to beneficial owners of dematerialized shares and members holding physical shares as per records at close of business on the record date, subject to tax deduction at source and within prescribed time limits.",
            "Sentiment": "positive",
            "PublishDate": 1756298262984,
            "Source": "corporate_action"
        },
        {
            "Title": "Sangam India Acquires Recycled Polyester Manufacturing Unit for Rs 52.51 Crores",
            "Summary": "Sangam (India) Limited's Board approved the purchase of a Recycle Polyester Staple Fibre Manufacturing Unit from M/s. Eminent Dealers Private Limited for up to Rs 52.51 crores. The unit, located in Village Lambia Kalan, Rajasthan, has an installed capacity of 45 TPD (16,020 MT per annum) and will meet approximately 50% of the company's daily polyester fibre requirement. The acquisition is expected to generate annual savings of Rs 11 crores and supports backward integration strategy. The production will serve as raw material for the company's other units, while helping comply with global brands' recycled content mandates from companies like H&M, Zara, and Nike. Additionally, the Board appointed M/s. Protiviti India Member Private Limited as Internal Auditor for financial year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1754569112744,
            "Source": "corporate_action"
        },
        {
            "Title": "Sangam India Reports 66% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Sangam India reported Q1 net profit of 43 million rupees, down 66% from 128 million rupees in the same quarter last year. Revenue increased to 7.86 billion rupees from 6.97 billion rupees year-over-year. EBITDA declined to 546 million rupees from 603 million rupees, while EBITDA margin compressed to 6.95% from 8.65% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754266080054,
            "Source": "earnings"
        },
        {
            "Title": "Sangam India Reports 66% Drop in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Sangam India reported a net profit of 43 million rupees in Q1, representing a significant decline from 128 million rupees in the same period last year. However, the company's revenue increased to 7.86 billion rupees compared to 6.97 billion rupees year-over-year, showing growth in the top line despite pressure on profitability.",
            "Sentiment": "negative",
            "PublishDate": 1754046188501,
            "Source": "earnings"
        },
        {
            "Title": "Sangam (India) Q4 Results and Dividend Announcement",
            "Summary": "Sangam (India) has announced its Q4 results and dividend. The company recommended a dividend of 2 rupees per equity share. Q4 EBITDA was 535 million rupees, down from 611 million year-over-year, with EBITDA margin decreasing to 7.37% from 8.66%. Net profit for Q4 was 94 million rupees, down from 125 million year-over-year but up from 5 million quarter-on-quarter. Q4 revenue increased to 7.25 billion rupees from 7 billion year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748523061000,
            "Source": "result"
        },
        {
            "Title": "Sangam India Onboards Gelmart Industries as New Customer",
            "Summary": "Sangam India has added Gelmart Industries Inc., a supplier to Walmart, as a new customer for its garment business.",
            "Sentiment": "positive",
            "PublishDate": 1747377677000,
            "Source": "default"
        },
        {
            "Title": "Sangam (India) Signs MOU for Joint Venture in Denim Manufacturing",
            "Summary": "Sangam (India) has executed a Memorandum of Understanding (MOU) with Golden Seams Industries Pvt Ltd to establish a joint venture company. The new entity will focus on denim manufacturing and laundry operations in Orissa.",
            "Sentiment": "positive",
            "PublishDate": 1744897658000,
            "Source": "default"
        },
        {
            "Title": "Fire Incident at Sangam (India)'s Denim Division in Bhilwara",
            "Summary": "Sangam (India) reported a fire incident at its Denim Division in Bhilwara. The company stated that no injuries or casualties were reported. The cause and impact of the fire are currently under investigation.",
            "Sentiment": "neutral",
            "PublishDate": 1741651448000,
            "Source": "corporate_action"
        },
        {
            "Title": "Fire Incident at Sangam (India)'s Denim Division in Bhilwara",
            "Summary": "Sangam (India) reported a fire incident at its denim division in Bhilwara. The company stated that no injuries or casualties were reported. The cause and impact of the fire are currently under investigation.",
            "Sentiment": "neutral",
            "PublishDate": 1741610801000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sangam (India) Reports Q3 Financial Results",
            "Summary": "Sangam (India) has released its Q3 financial results. The company reported a net profit of 5 million rupees, down from 44 million rupees in the same quarter last year. However, revenue increased to 7.46 billion rupees from 6.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739405865000,
            "Source": "earnings"
        },
        {
            "Title": "Sangam (India) Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sangam (India) has reported its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 454 million rupees to 588 million rupees. Additionally, the EBITDA margin expanded from 7.14% to 7.88%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739363118000,
            "Source": "earnings"
        },
        {
            "Title": "Sangam (India) Reports Q3 Financial Results",
            "Summary": "Sangam (India) has announced its financial results for the third quarter. The company's net profit decreased to 5 million rupees from 44 million rupees in the same period last year. However, revenue increased to 7.46 billion rupees from 6.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739363111000,
            "Source": "earnings"
        },
        {
            "Title": "Sangam (India) Reports Improved Q2 EBITDA and Margin",
            "Summary": "Sangam (India) has reported its Q2 financial results. The company's EBITDA increased to 509 million rupees from 428.9 million rupees in the same quarter last year. The EBITDA margin also improved to 7.54% from 6.82% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729862187000,
            "Source": "result"
        },
        {
            "Title": "Sangam (India) Reports Q2 Financial Results",
            "Summary": "Sangam (India) has reported its Q2 financial results. The company's net profit for the quarter was 48 million rupees, down from 70 million rupees year-over-year and 128 million rupees quarter-over-quarter. However, revenue increased to 6.75 billion rupees from 6.29 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729862115000,
            "Source": "result"
        }
    ]
}