{
    "Symbol": "SANOFI",
    "ISIN": "INE058A01010",
    "News": [
        {
            "Title": "Sanofi India Senior Management Personnel Resigns",
            "Summary": "Sanofi India Limited announces resignation of Mr. Suresh Babu, Sales & Customer Engagement Head – Diabetes, effective February 12, 2026, to pursue opportunities outside the company.",
            "Sentiment": "neutral",
            "PublishDate": 1770901185994,
            "Source": "stocks"
        },
        {
            "Title": "Sanofi India Faces ₹1.43 Cr Tax Demand Order",
            "Summary": "Sanofi India Limited receives tax demand order of ₹1.43 crores from CGST & Central Excise authorities for alleged wrong availment of Input Tax Credit during FY 2018-19 to FY 2022-23.",
            "Sentiment": "negative",
            "PublishDate": 1767091784091,
            "Source": "stocks"
        },
        {
            "Title": "Sanofi India Receives ₹14.30 Million Tax Order",
            "Summary": "Sanofi India has received a tax order amounting to ₹14.30 million from tax authorities. The pharmaceutical company disclosed this development in a regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1767091720566,
            "Source": "stocks"
        },
        {
            "Title": "Sanofi India Gets ₹24.10L GST Demand from Gujarat",
            "Summary": "Sanofi India receives revised GST order from Deputy Commissioner of State Tax, Ahmedabad demanding ₹24.10 lakh for FY2018-19 due to excess ITC claims. Company to appeal decision.",
            "Sentiment": "negative",
            "PublishDate": 1766235291590,
            "Source": "stocks"
        },
        {
            "Title": "Sanofi India Seeks Shareholder Approval for Deepak Arora's Appointment as Managing Director",
            "Summary": "Sanofi India has issued a postal ballot notice seeking member approval for appointing Deepak Arora as Director and Managing Director for a 3-year term from October 27, 2025 to October 26, 2028. The appointment requires Central Government approval as Arora has not been residing in India for the required 12 months prior to appointment, with e-voting scheduled from November 18 to December 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763391583590,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanofi Consumer Healthcare India Reports Strong Q2 Growth with 40% Revenue Jump",
            "Summary": "Sanofi Consumer Healthcare India delivered robust Q2 performance with net profit rising to 629 million rupees from 450 million rupees in the same period last year. Revenue grew significantly to 2.3 billion rupees compared to 1.6 billion rupees year-over-year. EBITDA increased to 850 million rupees from 631 million rupees, though EBITDA margin declined to 36.34% from 39.46% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762960592828,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Reports Strong Q3 Performance with Diabetes Focus and Operational Excellence",
            "Summary": "Sanofi India Limited held an investor conference call on October 29, 2025, to discuss quarterly results ended September 30, 2025. The company has transformed its business model to strengthen leadership in the insulin market and achieve sustainable growth. Key highlights include: accelerated growth in Q3 despite structural changes, with diabetes insulin business showing 4% YTD growth and 5% quarter-to-quarter growth. The company successfully developed partnership models for legacy cardiovascular, central nervous system, and oral anti-diabetic portfolios. Significant OPEX optimization was achieved with 30% reduction in personnel costs and other expenses compared to last quarter, improving the ratio to 22%. Export revenues declined due to expected impact from Ankleshwar site divestment to Zentiva in 2020, though this had limited bottom-line impact as exports represent only 8% of total profit. The Board declared an interim dividend of INR 75 per share. Management emphasized focus on three strategic pillars: portfolio approach with innovative products like Toujeo and Soliqua, market expansion initiatives including public sector opportunities, and customer-centricity powered by AI capabilities. The company is leveraging artificial intelligence across operations for forecasting, marketing tools, and sales force optimization.",
            "Sentiment": "positive",
            "PublishDate": 1762257266713,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Plans Growth Through Chronic Care, Specialty Products, and Local Manufacturing",
            "Summary": "Sanofi India is targeting steady expansion through its chronic and specialty drug portfolios. The company plans to launch new diabetes treatments and vaccines while optimizing costs through local manufacturing and supply chain integration.",
            "Sentiment": "positive",
            "PublishDate": 1761754777446,
            "Source": "stock"
        },
        {
            "Title": "Sanofi India Reports Profit Decline, Declares ₹75 Interim Dividend",
            "Summary": "Sanofi India reported a 7.5% decline in net profit to ₹76 crore for the third quarter ended September 30, compared to ₹82 crore in the previous year. Revenue from operations fell 9.3% to ₹475.4 crore from ₹524 crore year-over-year. However, EBITDA increased 12% to ₹134 crore, with operating margin improving to 28% from 23%, driven by cost efficiency measures and favorable product mix. The company is streamlining its portfolio to focus on core therapeutic areas including diabetes and cardiovascular treatments. The board declared an interim dividend of ₹75 per share for FY25, with November 7 as the record date. Shares remained largely unchanged at ₹4,747.00 following the results announcement, with the stock gaining 22% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1761728095729,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Reports Mixed Q2 Results with Higher EBITDA Margin Despite Revenue Decline",
            "Summary": "Sanofi India announced its Q2 financial results showing EBITDA of 1.34 billion rupees compared to 1.2 billion rupees in the previous year. The company's EBITDA margin improved to 28.23% from 22.84% year-over-year. However, revenue declined to 4.75 billion rupees from 5.2 billion rupees in the same period last year. Net profit also decreased to 760 million rupees from 822 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1761725020750,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Appoints Deepak Arora as Managing Director, Rachid Ayari Steps Down from Interim Role",
            "Summary": "Sanofi India Limited's Board of Directors approved the appointment of Deepak Arora as Additional Director and Managing Director for a three-year term starting October 27, 2025, subject to shareholder and Central Government approval. Arora brings over 30 years of pharmaceutical and healthcare experience across North America, Europe, Middle East and Africa in commercial, sales, marketing and general management roles. Simultaneously, Rachid Ayari stepped down from his position as Interim Managing Director effective October 26, 2025, but continues serving as Whole-time Director and Chief Financial Officer. Ayari had been appointed as Interim Managing Director for six months from July 21, 2025, or until a permanent Managing Director was appointed. The Board authorized Arora to determine materiality of events and make stock exchange disclosures alongside other Key Managerial Personnel.",
            "Sentiment": "positive",
            "PublishDate": 1761565323943,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sanofi India Announces Leadership Change in Company Secretary Role",
            "Summary": "Sanofi India Limited announced key management changes in its Company Secretary position. Arjun Thakkar resigned from his role as Company Secretary and Compliance Officer, effective September 30, 2025, to pursue a career opportunity in the Ethics & Business Integrity department within the Sanofi Group. The Board of Directors appointed Haresh Vala as the new Company Secretary and Compliance Officer, effective October 1, 2025. Vala is an Associate Member of the Institute of Company Secretaries of India with over two decades of experience in corporate secretarial and compliance functions. He holds degrees in Law and Commerce from the University of Mumbai and brings expertise in corporate governance, regulatory compliance, investor relations, SEBI regulations, and Companies Act compliances. The appointment was approved by the Board upon recommendation from the Nomination and Remuneration Committee during their meeting on September 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758801082112,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sanofi India Seeks Shareholder Approval for Interim Managing Director and New Whole-time Director Appointments",
            "Summary": "Sanofi India Limited has dispatched a postal ballot notice seeking shareholder approval for two key appointments. The company proposes to appoint Rachid Ayari as Interim Managing Director for six months from July 21, 2025 to January 20, 2026, or until a permanent Managing Director is appointed. Ayari currently serves as Whole-time Director and Chief Financial Officer, a position he will retain alongside the interim role. The company also seeks approval for Mahadev Gawade's appointment as Director and Whole-time Director for three years from August 11, 2025 to August 10, 2028. Gawade brings over 20 years of experience in logistics and manufacturing in the pharmaceutical industry. The e-voting period runs from August 13 to September 11, 2025, with results to be declared by September 13, 2025. These appointments follow the departure of Rodolfo Hrosz as Managing Director on April 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755013465987,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanofi Consumer Healthcare India Reports Strong Q1 Profit Growth",
            "Summary": "Sanofi Consumer Healthcare India delivered strong quarterly results with net profit more than doubling to 607 million rupees compared to 290 million rupees in the same period last year. Revenue grew significantly to 2.2 billion rupees from 1.72 billion rupees year-over-year. EBITDA increased to 702 million rupees from 636 million rupees, though EBITDA margin declined to 31.78% from 36.91% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754318718067,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Reports 9% Decline in Net Sales Despite 6% Growth in Operating Profit",
            "Summary": "Sanofi India Limited announced its financial results for the quarter ended June 30, 2025, showing a 9% decline in net sales on a comparable basis of continuing business. However, the company achieved a 6% increase in operating profit for the year-to-date period, driven by cost optimization and enhanced operational efficiencies. In the domestic market, the company saw success with the launch of Soliqua, a premium diabetes treatment, while Toujeo maintained strong performance with high single-digit growth. Strategic partnerships in Cardiovascular and Central Nervous System segments met expectations for market reach expansion. Export sales were negatively impacted by non-recurring CHC product sales from 2024 and the planned discontinuation of the Zentiva portfolio. The company continues its transformation through targeted market initiatives, operational excellence, and innovation advancement in India.",
            "Sentiment": "neutral",
            "PublishDate": 1754116694305,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Reports Q2 2025 Results, Announces Leadership Changes",
            "Summary": "Sanofi India approved its unaudited financial statements for the quarter and half-year ended June 30, 2025. The company reported revenue from operations of ₹4,063 million for Q2 2025, down from ₹5,359 million in Q1 2025 and ₹4,635 million in Q2 2024. Net profit for the quarter was ₹695 million compared to ₹1,195 million in the previous quarter and ₹1,034 million in the same quarter last year. For the half-year period, revenue reached ₹9,422 million with net profit of ₹1,890 million. The company announced the retirement of Ms. Renee Amonkar from her position as Whole-time Director and Site Director - Goa, effective August 11, 2025. Mr. Mahadev Gawade has been appointed as Additional and Whole-time Director for a three-year term starting August 11, 2025, and will also serve as Site Director - Goa. Gawade brings over 20 years of experience in logistics and manufacturing pharmaceutical industries. The company has entered into a promotion and distribution agreement with Emcure Pharmaceuticals Limited for its Oral Anti-diabetic business products.",
            "Sentiment": "neutral",
            "PublishDate": 1753968386263,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Reports Decline in Q1 Financial Performance",
            "Summary": "Sanofi India's Q1 results showed a decline across key financial metrics. Revenue fell to 4.06 billion rupees from 4.64 billion rupees in the previous year. Net profit dropped to 695 million rupees compared to 1.03 billion rupees year-over-year. EBITDA decreased to 949 million rupees from 1.16 billion rupees, while EBITDA margin compressed to 23.36% from 24.95% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1753967772499,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India: Q1 EBITDA Surges 25%, Margin Expands Despite Profit Dip",
            "Summary": "Sanofi India's Q4 FY25 results show mixed performance. Net profit fell 12.5% YoY to ₹119.5 crore, while revenue rose 5% to ₹535.9 crore. EBITDA increased 25% to ₹171.9 crore, with margins expanding to 32.1%. The launch of Soliqua® contributed to growth. On a comparable basis, net sales grew 4% for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747229068000,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Reports Strong Q4 EBITDA Growth",
            "Summary": "Sanofi India's Q4 EBITDA increased to 1.7 billion rupees from 1.4 billion rupees year-over-year. The company's EBITDA margin also improved, rising to 32.08% from 26.84% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747224875000,
            "Source": "result"
        },
        {
            "Title": "Sanofi India Reports Strong Q4 Financial Results",
            "Summary": "Sanofi India has announced its Q4 financial results, showing significant year-over-year growth. The company's net profit increased to 1.2 billion rupees, up from 720 million rupees in the same quarter last year. Revenue also saw an increase, reaching 5.4 billion rupees compared to 5.1 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747224717000,
            "Source": "result"
        },
        {
            "Title": "Sanofi India Clarifies No Plans to Divest Insulin Brand Lantus",
            "Summary": "Sanofi India has issued a clarification regarding a news article about its insulin brand Lantus. The company explicitly stated that it has no intentions to divest, sell, or license the Lantus brand.",
            "Sentiment": "neutral",
            "PublishDate": 1744724555000,
            "Source": "default"
        },
        {
            "Title": "Sanofi India: Q4 Profit Surges 31%, Announces ₹117 Dividend",
            "Summary": "Sanofi India reported a 31% increase in Q4 profit to ₹91.3 crore, with revenue up 10% to ₹515 crore. The company announced a dividend of ₹117 per share. Diabetes portfolio showed strong growth, with successful launch of Soliqua. Operating profit in Q4 2024 increased by 21% compared to Q4 2023.",
            "Sentiment": "positive",
            "PublishDate": 1740723315000,
            "Source": "result"
        },
        {
            "Title": "Sanofi India Reports Q3 Financial Results and Dividend Announcement",
            "Summary": "Sanofi India has released its Q3 financial results. Net profit decreased to 913 million rupees from 1.38 billion rupees year-over-year, but increased from 822 million rupees quarter-over-quarter. Revenue rose to 5.15 billion rupees from 4.69 billion rupees year-over-year. The company reported an exceptional item of 80 million rupees and a profit before tax of 1.14 billion rupees, up from 993 million rupees year-over-year. Additionally, Sanofi India has recommended a final dividend of 117 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1740702269000,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Recommends Final Dividend of 117 Rupees per Share",
            "Summary": "Sanofi India has recommended a final dividend of 117 rupees per equity share for its shareholders. This announcement represents a significant corporate action that will directly benefit the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1740673918000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanofi India Reports Q3 Profit Before Tax of 1.14 Billion Rupees",
            "Summary": "Sanofi India has reported a profit before tax (PBT) of 1.14 billion rupees for the third quarter, compared to 993 million rupees in the same period last year. The company also noted an exceptional item of 80 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740673906000,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sanofi India has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.18 billion rupees, up from 996 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 22.98% from 21.23% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1740673891000,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Reports 9.8% Year-over-Year Revenue Growth in Q3",
            "Summary": "Sanofi India Limited has announced its financial results for the third quarter. The company reported revenue of 5.15 billion rupees, compared to 4.69 billion rupees in the same quarter of the previous year, representing a year-over-year growth of approximately 9.8%.",
            "Sentiment": "positive",
            "PublishDate": 1740673882000,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India Reports Q3 Net Profit of 913 Million Rupees",
            "Summary": "Sanofi India has announced its Q3 financial results. The company reported a net profit of 913 million rupees, which represents a decrease from 1.38 billion rupees in the same quarter last year (YoY). However, it shows an increase from 822 million rupees in the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1740673870000,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi India: ₹26.5 Crore Income Tax Order for Transfer Pricing Issues",
            "Summary": "Sanofi India received a transfer pricing order from the Joint Commissioner of Income Tax for assessment year 2022-23, imposing a ₹26.50 crore tax liability due to disallowed international transactions. The company plans to appeal after draft assessment proceedings are completed.",
            "Sentiment": "negative",
            "PublishDate": 1737546482000,
            "Source": "order&deals"
        },
        {
            "Title": "Sanofi India Reports Q2 EBITDA Growth",
            "Summary": "Sanofi India's Q2 EBITDA increased to 1.2 billion rupees from 1.1 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 22.84% from 23.13% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730983638000,
            "Source": "result"
        },
        {
            "Title": "Sanofi India Reports Q2 Financial Results",
            "Summary": "Sanofi India has announced its financial results for the second quarter. The company's net profit from continuing operations reached 822 million rupees, showing a slight increase from 806 million rupees year-over-year and a more significant rise from 682 million rupees quarter-over-quarter. Revenue for Q2 stood at 5.2 billion rupees, up from 4.9 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730983563000,
            "Source": "result"
        },
        {
            "Title": "Sanofi India Schedules Board Meeting for Q2 Results",
            "Summary": "Sanofi India has announced a board meeting scheduled for November 7th to consider and approve the company's financial results for the second quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1729169516000,
            "Source": "result"
        },
        {
            "Title": "Sanofi Negotiates Sale of 50% Stake in Consumer Healthcare Business",
            "Summary": "<p>Sanofi has entered into <span class='neutral'>negotiations</span> with Clayton, Dubilier & Rice (CD&R) for the <span class='neutral'>potential sale</span> of a <b>50% controlling stake</b> in Opella, its <span class='neutral'>consumer healthcare business</span>. This move indicates a <span class='neutral'>significant corporate restructuring</span> for Sanofi, potentially allowing the company to <span class='positive'>focus more</span> on its <span class='neutral'>core pharmaceutical operations</span> while <span class='neutral'>maintaining partial ownership</span> in its consumer healthcare division.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728645162000,
            "Source": "corporate_action"
        }
    ]
}