{
    "Symbol": "SANOFICONR",
    "ISIN": "INE0UOS01011",
    "News": [
        {
            "Title": "Sanofi Consumer Healthcare India Reports 46% Revenue Growth in Q3 2025",
            "Summary": "Sanofi Consumer Healthcare India Limited reported quarterly results for the period ended September 30, 2025. Revenue from operations reached ₹2,339 million, representing a 46% increase compared to the same quarter last year. Net profit for the quarter was ₹629 million, up 40% year-on-year. For the nine-month period, revenue grew 13% to ₹6,274 million, while profit after tax increased 27% to ₹1,736 million. Domestic sales grew 20% during the quarter, while export sales grew over 1000% from a low base. The company successfully relaunched all previously recalled products - Depura Adult and Combiflam Suspension were relaunched earlier in the year, while Allegra Suspension and Depura Kids were relaunched in the September quarter. The company operates in the pharmaceutical business segment with key brands including Allegra, DePURA, Avil and Combiflam. Managing Director Himanshu Bakshi noted that the results reflect strength in their diversified portfolio and sustained growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1763002228376,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi Consumer Healthcare India Shareholders Approve Material Related Party Transactions",
            "Summary": "Sanofi Consumer Healthcare India Limited announced the results of its postal ballot process conducted through remote e-voting. Shareholders approved two ordinary resolutions for material related party transactions with overwhelming majority. The first resolution for approval of material related party transactions with Opella Healthcare India Private Limited received 99.8699% votes in favor and 0.1301% against. The second resolution for approval of material related party transactions with Opella Healthcare International SAS also received identical voting results of 99.8699% in favor and 0.1301% against. The postal ballot notice was dated August 4, 2025, with voting conducted from September 30, 2025 to October 29, 2025. Mr. Omkar Dindorkar from MMJB Associates LLP served as the scrutinizer for the voting process. The company has 51,137 total shareholders on record date, with National Securities Depository Limited providing the remote e-voting facility.",
            "Sentiment": "positive",
            "PublishDate": 1761845929323,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanofi Consumer Healthcare India Appoints Richard D'souza as Chief Financial Officer",
            "Summary": "Sanofi Consumer Healthcare India Limited appointed Richard D'souza as Chief Financial Officer effective October 16, 2025. The appointment was approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee and in consultation with the Audit Committee. D'souza brings over 25 years of leadership experience in finance across multinational and listed organizations in FMCG and consumer goods sectors. He has expertise in financial strategy, M&A, investor relations, governance, and digital transformation. Previously, he served as Head of Finance at Bajaj Consumer Care, where he led acquisitions and strategic market expansion. He also worked with Castrol India managing treasury operations and ERP migrations. D'souza is a Chartered Accountant and Certified Information Systems Auditor.",
            "Sentiment": "positive",
            "PublishDate": 1760626433036,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sanofi Consumer Healthcare India CFO Narahari Naidu Resigns to Explore New Opportunities",
            "Summary": "Sanofi Consumer Healthcare India Limited announced that Chief Financial Officer Narahari Naidu has resigned from his position to explore new career opportunities outside the organization. His resignation becomes effective from the close of business hours on October 15, 2025, which will be his last working day with the company. In his resignation email, Naidu expressed gratitude for the trust and support from the Board, senior leadership team, and colleagues during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1760092400161,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sanofi Consumer Healthcare India Appoints Narahari Naidu as Chief Financial Officer",
            "Summary": "Sanofi Consumer Healthcare India Limited appointed Mr. Narahari Naidu as Chief Financial Officer effective August 4th, 2025, for a six-month term. The appointment was approved by the Board of Directors based on recommendations from the Nomination and Remuneration Committee and in consultation with the Audit Committee. Naidu brings over 14 years of experience across healthcare/pharmaceuticals, manufacturing, and consulting sectors, with expertise in Finance & Accounts, Procurement, Investor Relations, Mergers & Acquisitions, Banking & Treasury, and IPO management. He previously served as Group CFO for entities operating across India, UK and USA.",
            "Sentiment": "positive",
            "PublishDate": 1754320701332,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sanofi Consumer Healthcare India Reports 28% Revenue Growth in Q1 FY2026",
            "Summary": "Sanofi Consumer Healthcare India Limited reported revenue from operations of ₹2,209 million for the quarter ended June 30, 2025, representing a 28% increase from ₹1,723 million in the same quarter last year. Net profit rose 21% to ₹607 million compared to ₹290 million in the previous year quarter. For the half-year period, revenue remained flat at ₹3,935 million versus ₹3,939 million, while profit increased to ₹1,107 million from ₹917 million. The company recorded an exceptional gain of ₹66 million from reversing excess demerger-related provisions. Basic and diluted earnings per share for the quarter stood at ₹26.36 compared to ₹12.58 in the prior year. The company successfully relaunched Combiflam Suspension during the quarter and continues efforts to bring back other recalled products to market.",
            "Sentiment": "positive",
            "PublishDate": 1754318316712,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi Consumer Healthcare India Reports Q4 Financial Results",
            "Summary": "Sanofi Consumer Healthcare India has released its Q4 financial results. The company's EBITDA decreased to 640 million rupees from 818 million rupees year-over-year. However, the EBITDA margin slightly improved to 37.08% from 36.91%. Net profit fell to 500 million rupees from 627 million rupees year-over-year, but increased from 443 million rupees quarter-over-quarter. Revenue for Q4 was 1.7 billion rupees, down from 2.2 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746194976000,
            "Source": "result"
        },
        {
            "Title": "Sanofi Consumer Healthcare Faces Potential Acquisition Bid",
            "Summary": "Opal Bidco Sas and Clayton, Dubilier & Rice Fund have proposed to acquire a 26% stake in Sanofi Consumer Healthcare through an open offer, according to Reuters. This potential acquisition could significantly impact the ownership structure of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1745540048000,
            "Source": "default"
        },
        {
            "Title": "Sanofi Consumer Healthcare Faces Potential Acquisition",
            "Summary": "Opal Bidco SAS, in association with Clayton, Dubilier & Rice Fund, has proposed to acquire a 26% stake in Sanofi Consumer Healthcare through an open offer.",
            "Sentiment": "neutral",
            "PublishDate": 1745504608000,
            "Source": "default"
        },
        {
            "Title": "Sanofi Consumer Healthcare Reports Q3 Financial Results and Dividend Declaration",
            "Summary": "Sanofi Consumer Healthcare announced its Q3 financial results. The company reported a net profit of 443 million rupees, down from 679 million rupees year-over-year and 450 million rupees quarter-over-quarter. Q3 revenue stood at 1.7 billion rupees, compared to 2.2 billion rupees in the same quarter last year. Additionally, the company declared a dividend of 55 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1740096635000,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi Consumer Healthcare: Q4 Profit Drops 35%, Declares ₹55 Dividend",
            "Summary": "Sanofi Consumer Healthcare India Ltd approved a final dividend of ₹55 per share for FY2024. Q4 net profit fell 34.8% to ₹44.3 crore, revenue declined 24% to ₹170.7 crore, and EBITDA dropped 30.6% to ₹61.1 crore. EBITDA margin contracted to 36.4% from 39.9% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1740064120000,
            "Source": "result"
        },
        {
            "Title": "Sanofi Consumer Healthcare Declares Dividend of 55 Rupees per Share",
            "Summary": "Sanofi Consumer Healthcare has announced a dividend of 55 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1740062410000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sanofi Consumer Healthcare Reports Q3 Financial Results",
            "Summary": "Sanofi Consumer Healthcare announced its Q3 financial results. The company reported a net profit of 443 million rupees, down from 679 million rupees year-over-year and 450 million rupees quarter-over-quarter. Revenue for Q3 stood at 1.7 billion rupees, a decrease from 2.2 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1740062284000,
            "Source": "earnings"
        },
        {
            "Title": "Sanofi Consumer Healthcare India Reports Q2 Financial Results",
            "Summary": "Sanofi Consumer Healthcare India has released its Q2 financial results. The company reported a net profit of 450 million rupees, which is lower compared to 712 million rupees in the same quarter last year (YoY) and 290 million rupees in the previous quarter (QoQ). Revenue for Q2 stood at 1.6 billion rupees, down from 2.1 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731456034000,
            "Source": "result"
        },
        {
            "Title": "Sanofi Consumer Healthcare Block Trade on BSE",
            "Summary": "<p>A <span class='neutral'>significant</span> <span class='neutral'>block trade</span> of <b>Sanofi Consumer Healthcare</b> shares occurred on the <b>Bombay Stock Exchange (BSE)</b> during <span class='neutral'>pre-open trading</span>. Approximately <span class='neutral'>13,904,722 shares</span> were traded at a price of <span class='neutral'>Rs 4,982.05</span> per share, totaling <span class='neutral'>Rs 6,927.4 crore</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728531742000,
            "Source": "block_deals"
        }
    ]
}