{
    "Symbol": "SANSERA",
    "ISIN": "INE953O01021",
    "News": [
        {
            "Title": "Sansera Engineering Q3FY26 Results Show Strong Growth",
            "Summary": "Sansera Engineering reported robust Q3FY26 performance with standalone revenue of ₹7,980.03 million, up 23.87% YoY, and net profit of ₹635.04 million, marking 40.84% growth despite exceptional charges.",
            "Sentiment": "positive",
            "PublishDate": 1770643329436,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sansera Engineering QIP Monitoring Report Q3 FY26",
            "Summary": "ICRA confirms no deviation in Sansera Engineering's ₹1,200.00 crore QIP proceeds utilization for Q3 FY26. Company has utilized ₹939.29 crore with ₹260.71 crore remaining in fixed deposits.",
            "Sentiment": "neutral",
            "PublishDate": 1770122741373,
            "Source": "stocks"
        },
        {
            "Title": "Sansera Engineering Q3FY26 Earnings Call on Feb 10",
            "Summary": "Sansera Engineering Limited has scheduled its Q3FY26 earnings call for February 10, 2026 at 09:00 AM IST to discuss operational and financial performance with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770091932120,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sansera Engineering Forms JV with Japan's Nichidai",
            "Summary": "Sansera Engineering announces strategic joint venture with Nichidai Corporation to manufacture precision forged automotive components. Sansera will hold 60% stake in new Bengaluru-based JV company.",
            "Sentiment": "positive",
            "PublishDate": 1769667790141,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sansera Engineering Gets ICRA Rating Reaffirmation",
            "Summary": "ICRA reaffirmed Sansera Engineering's [ICRA]AA(Stable) and [ICRA]A1+ ratings for facilities worth Rs. 996.00 crore, citing strong business profile and improved financial metrics post Rs. 1,200 crore QIP.",
            "Sentiment": "positive",
            "PublishDate": 1769582804111,
            "Source": "stocks"
        },
        {
            "Title": "Sansera Engineering Reports Record Quarterly Performance with 8.1% Revenue Growth and Strong ADS Division Expansion",
            "Summary": "Sansera Engineering achieved its strongest-ever quarterly performance with revenues of INR 8,252 million, EBITDA margin of 17.3%, and PAT margin of 8.7%, driven by healthy domestic market recovery and 56.4% growth in non-auto segment. The company's ADS division delivered INR 496 million topline with unexecuted order backlog exceeding INR 39,500 million, while the board approved additional facility expansion and INR 30 crores investment in MMRFIC to increase stake beyond 50%.",
            "Sentiment": "positive",
            "PublishDate": 1763611867032,
            "Source": "earnings"
        },
        {
            "Title": "Sansera Engineering Grants 75,500 Stock Options and Allots 1,28,519 Equity Shares Under ESOP 2018",
            "Summary": "Sansera Engineering's Nomination and Remuneration Committee approved the grant of 75,500 stock options at Rs.1,237.00 per option for 28,000 options and Rs.1,555.90 per option for 47,500 options under ESOP 2018. The company also allotted 1,28,519 equity shares of Rs.2/- each upon exercise of vested options, increasing total issued share capital to Rs.12,44,48,536.00.",
            "Sentiment": "positive",
            "PublishDate": 1763529259322,
            "Source": "corporate_action"
        },
        {
            "Title": "Sansera Engineering Projects Revenue Growth to Rs 5,000-5,500 Million by FY27",
            "Summary": "Sansera Engineering has set revenue guidance of Rs 3,000-3,200 million for FY26 and expects revenue to reach Rs 5,000-5,500 million in FY27. The projections indicate significant revenue growth trajectory over the two-year period.",
            "Sentiment": "positive",
            "PublishDate": 1763003393333,
            "Source": "stock"
        },
        {
            "Title": "Sansera Engineering Approves 300 Million Rupees Investment in MMRFIC Technology",
            "Summary": "Sansera Engineering has approved an investment of 300 million rupees in MMRFIC Technology.",
            "Sentiment": "positive",
            "PublishDate": 1762958846700,
            "Source": "stock"
        },
        {
            "Title": "Sansera Engineering Reports 42% Jump in Q2 Net Profit to 717 Million Rupees",
            "Summary": "Sansera Engineering reported quarterly consolidated net profit of 717 million rupees compared to 506 million rupees in the same period last year, marking a 42% increase. Revenue grew to 8.25 billion rupees from 7.6 billion rupees year-over-year, representing an 8.6% rise. EBITDA increased to 1.4 billion rupees from 1.3 billion rupees, though EBITDA margin slightly declined to 17.35% from 17.44% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762957262710,
            "Source": "earnings"
        },
        {
            "Title": "Sansera Engineering Reports No Deviation in QIP Fund Utilization for Quarter Ended September 2025",
            "Summary": "Sansera Engineering Limited submitted a monitoring agency report for the quarter ended September 30, 2025, regarding utilization of funds raised through its Qualified Institutional Placement (QIP). ICRA Limited, the monitoring agency, confirmed no deviation in fund utilization from the stated objectives. The company raised Rs 1,200 crore through the QIP issued in October 2024, with net proceeds of Rs 1,174.979 crore. Out of total proceeds, Rs 929.294 crore has been utilized, leaving Rs 270.706 crore unutilized. The funds were allocated for repayment of borrowings (Rs 700 crore - fully utilized), land acquisition for new manufacturing facility (Rs 100 crore - Rs 92.591 crore utilized), capital expenditure for facility expansion (Rs 100 crore - fully utilized), and general corporate purposes (Rs 274.979 crore - Rs 11.682 crore utilized). Unutilized funds totaling Rs 282.776 crore are parked in fixed deposits with banks earning returns between 7.40% to 7.80%. The company has experienced delays in land acquisition and general corporate purpose utilization compared to original FY25 timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1762412323462,
            "Source": "corporate_action"
        },
        {
            "Title": "Sansera Engineering Appoints Satish Kumar as Chief Customer Relationship Officer and Mentor",
            "Summary": "Sansera Engineering Limited announced the designation of Mr. Satish Kumar as Chief Customer Relationship Officer and Mentor with immediate effect. Kumar, aged about 61 years, has been associated with the company for more than 21 years and previously served as Chief Engineering & Technical Services Officer. He has handled various functions including operations, business development and engineering. Kumar has relinquished his present responsibilities to Mr. Amit Gautam, who joined as Chief Technology Officer. The appointment was effective November 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762385360315,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sansera Engineering Appoints Amit Gautam as Chief Technology Officer",
            "Summary": "Sansera Engineering Limited has appointed Mr. Amit Gautam as Chief Technology Officer on November 4, 2025. Gautam, aged 49, brings over 26 years of experience in automotive technology, specializing in powertrain design, advanced engine development, calibration, transmission systems, and simulation. He is a graduate of Thapar Institute of Engineering and Technology and spent six years at Suzuki Motor Corporation headquarters in Japan working on new engine programs. He has authored papers at forums including SAE World Congress and holds multiple patents in IC engine design and calibration logic. Prior to joining Sansera, he was associated with Maruti Suzuki India Ltd., where he served as Head of Department in various Powertrain departments and was head of Engineering test facility management.",
            "Sentiment": "positive",
            "PublishDate": 1762256708665,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sansera Engineering Reports 3% Revenue Growth and 26% PAT Increase in Q1 FY26",
            "Summary": "Sansera Engineering delivered revenue growth of 3% year-on-year to INR 7,663 million in Q1 FY26, with EBITDA margins improving to 17.2% and PAT growing 26% to INR 630 million. The domestic business grew approximately 4% driven by passenger vehicles, commercial vehicles, ADS, agriculture and industrial segments, while 2-wheeler and 3-wheeler segments showed muted performance. International operations faced headwinds with exports from India declining 20.6%, though the European business grew 3.5% and the Swedish subsidiary achieved 80% growth. The company added new orders worth INR 1,732 million, maintaining an order book of INR 20,243 million with over 60% from international markets. Management expressed caution about near-term export outlook due to US tariff increases on Indian exports and geopolitical factors. The company is targeting 20% revenue each from non-auto and electric vehicle segments in the medium-term and aims for INR 280-300 crore revenue from the ADS segment in FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1755424105831,
            "Source": "earnings"
        },
        {
            "Title": "Sansera Engineering Reports 25% Growth in Q1 Net Profit to 622 Million Rupees",
            "Summary": "Sansera Engineering reported quarterly consolidated net profit of 622 million rupees compared to 496 million rupees in the same period last year. Revenue increased to 7.7 billion rupees from 7.4 billion rupees year-over-year. EBITDA remained flat at 1.3 billion rupees, while EBITDA margin improved marginally to 17.23% from 17.15%.",
            "Sentiment": "positive",
            "PublishDate": 1754916073410,
            "Source": "earnings"
        },
        {
            "Title": "Sansera Engineering: Secures Rs 160 Crore Contract from Airbus Defence",
            "Summary": "Sansera Engineering has won a Rs 160 crore international contract from Airbus Defence and Space for supplying Airborne Intensive Care Transport Modules. The long-term contract's first shipment is due before the end of 2026, with subsequent deliveries as per Airbus' schedule.",
            "Sentiment": "positive",
            "PublishDate": 1749051941000,
            "Source": "order&deals"
        },
        {
            "Title": "Sansera Engineering: Secures ₹160 Crore Contract with Airbus for Medical Evacuation Systems",
            "Summary": "Sansera Engineering has signed a long-term contract with Airbus Defence and Space to manufacture and supply airborne intensive care transport modules for aircraft. The deal is valued at approximately ₹160 crore ($18.8 million) and marks the first time Airbus has chosen an Indian supplier for these critical medical evacuation systems.",
            "Sentiment": "positive",
            "PublishDate": 1748942948000,
            "Source": "order&deals"
        },
        {
            "Title": "Sansera Engineering Secures Contract with Airbus for Medical Transport Modules",
            "Summary": "Sansera Engineering has entered into a contract with Airbus to manufacture, supply, and support Airborne Intensive Care Transport Modules (ICTM) for light and medium transport aircraft programs.",
            "Sentiment": "positive",
            "PublishDate": 1748941184000,
            "Source": "default"
        },
        {
            "Title": "Sansera Engineering Expects Revenue Growth in ADS and PV Segments",
            "Summary": "Sansera Engineering anticipates doubling its revenue in the ADS (Aerospace and Defense) segment by FY26. The company also expects to outperform in the PV (Passenger Vehicle) segment in the coming years. Additionally, Sansera Engineering reports a positive outlook for the two-wheeler segment in the upcoming year, citing strong rural demand supported by improving consumer sentiment.",
            "Sentiment": "positive",
            "PublishDate": 1748488646000,
            "Source": "default"
        },
        {
            "Title": "Sansera Engineering: Nomura Cuts Price Target Amid Export Concerns",
            "Summary": "Nomura reduced Sansera Engineering's target price from Rs 1,669 to Rs 1,643 per share due to weakening exports, while maintaining a 'buy' rating. Q4 EBITDA margin was 16.3%, in line with Nomura's estimate. The company's order book grew 16% year-on-year to INR 18.5bn, with 20% from the Aerospace, Defence and Semiconductor segment. Management expects weaker exports in Q1 FY2026 due to US trade tariff uncertainties.",
            "Sentiment": "neutral",
            "PublishDate": 1748486533000,
            "Source": "earnings"
        },
        {
            "Title": "Sansera Engineering Reports Q4 Results and Dividend Recommendation",
            "Summary": "Sansera Engineering announced its Q4 financial results. The company's consolidated net profit increased to 593 million rupees from 461 million rupees year-over-year. Revenue rose to 7.8 billion rupees from 7.46 billion rupees in the same period last year. EBITDA slightly improved to 1.3 billion rupees from 1.27 billion rupees, while the EBITDA margin decreased to 16.26% from 17% year-over-year. Additionally, the company recommended a dividend of 3.25 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748356146000,
            "Source": "result"
        },
        {
            "Title": "Sansera Engineering's Associate Company Collaborates with IIT Madras for Secure SoC IP Development",
            "Summary": "MMRFIC, an associate company of Sansera Engineering Limited, has entered into a collaboration with the Indian Institute of Technology Madras (IITM) for the development of secure System-on-Chip (SoC) Intellectual Property (IP). This partnership aims to advance technological innovation in the field of secure chip design.",
            "Sentiment": "positive",
            "PublishDate": 1743552801000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sansera Engineering's Associate Company Collaborates with IIT Madras for Secure SoC IP Development",
            "Summary": "MMRFIC, an associate company of Sansera Engineering Limited, has entered into a collaboration with the Indian Institute of Technology Madras (IITM) for the development of secure System-on-Chip (SoC) Intellectual Property (IP). This partnership aims to advance technological capabilities in the field of integrated circuit design and security.",
            "Sentiment": "positive",
            "PublishDate": 1743507506000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sansera Engineering Reports Q3 Financial Results",
            "Summary": "Sansera Engineering announced its Q3 consolidated net profit of 557 million rupees, showing an increase from 480 million rupees year-over-year and 507 million rupees quarter-over-quarter. The company's Q3 revenue stood at 7.3 billion rupees, slightly up from 7.13 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739233307000,
            "Source": "earnings"
        },
        {
            "Title": "Sansera Engineering Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sansera Engineering has reported its Q3 financial results. The company's EBITDA increased to 1.27 billion rupees from 1.21 billion rupees year-over-year. The EBITDA margin also improved, rising to 17.46% from 16.92% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739196087000,
            "Source": "earnings"
        },
        {
            "Title": "Sansera Engineering Reports Q3 Financial Results",
            "Summary": "Sansera Engineering announced its Q3 financial results. The company's consolidated net profit increased to 557 million rupees, up from 480 million rupees year-over-year and 507 million rupees quarter-over-quarter. Revenue for Q3 reached 7.3 billion rupees, slightly higher than the 7.13 billion rupees reported in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739196019000,
            "Source": "earnings"
        },
        {
            "Title": "MMRFIC: Secures ₹10 Crore Defense Grant for Satellite Tech",
            "Summary": "MMRFIC Technology, an associate of Sansera Engineering, won a ₹10 crore grant from the Defence Space Agency for developing a 200-Watt Ka band Solid State Power Amplifier for satellite ground stations. The project aligns with India's Atmanirbhar Bharat initiative.",
            "Sentiment": "positive",
            "PublishDate": 1732010110000,
            "Source": "normal_news"
        },
        {
            "Title": "Sansera Engineering's Associate Wins IDEX Prime X Challenge",
            "Summary": "MMRFIC Technology, an associate of Sansera Engineering, has won the IDEX Prime X Challenge. The company has been awarded a Rs 10 crore grant for developing a 200-watt Ka-band Solid State Power Amplifier (SSPA) for satellite ground stations.",
            "Sentiment": "positive",
            "PublishDate": 1732007312000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sansera Engineering Reports Q2 EBITDA Growth",
            "Summary": "Sansera Engineering announced its Q2 financial results, showing an increase in EBITDA to 1.3 billion rupees from 1.2 billion rupees year-over-year. The company's EBITDA margin also improved, rising to 17.44% from 17.00% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731329256000,
            "Source": "result"
        },
        {
            "Title": "Sansera Engineering Reports Q2 Revenue Growth",
            "Summary": "Sansera Engineering announced its second quarter revenue of 7.6 billion rupees, compared to 6.93 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731329084000,
            "Source": "result"
        },
        {
            "Title": "Sansera Engineering Reports Q2 Profit Increase",
            "Summary": "Sansera Engineering announced its Q2 consolidated net profit of 506 million rupees, showing an increase from 469 million rupees year-over-year and 495.7 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731329033000,
            "Source": "result"
        },
        {
            "Title": "Sansera Engineering: QIP Raises ₹1,200 Crore Through Share Allotment",
            "Summary": "Sansera Engineering's board approved allotment of 77.22 lakh equity shares at ₹1,554 per share to qualified institutional buyers, raising ₹1,200 crore. The issue price represents a 4.98% discount to the floor price. The company's paid-up equity share capital has increased to ₹12.34 crore after the allotment.",
            "Sentiment": "positive",
            "PublishDate": 1729054191000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sansera Engineering Sets QIP Floor Price at ₹1,635.48",
            "Summary": "<p><span class=\"neutral\">Sansera Engineering</span> has approved a <span class=\"neutral\">floor price</span> of <b>₹1,635.48</b> per share for its <span class=\"neutral\">Qualified Institutional Placement (QIP)</span>. This decision indicates the company's intention to <span class=\"positive\">raise capital</span> through the QIP mechanism, which allows <span class=\"neutral\">listed companies</span> to issue <span class=\"neutral\">equity shares</span> to <span class=\"neutral\">qualified institutional buyers</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728618083000,
            "Source": "corporate_action"
        }
    ]
}