{
    "Symbol": "SANSTAR",
    "ISIN": "INE08NE01025",
    "News": [
        {
            "Title": "Sanstar Limited Reports Q2FY26 Revenue of Rs. 1,964 Million with Capacity Expansion on Track",
            "Summary": "Sanstar Limited, a maize-based specialty products manufacturer, reported quarterly revenue of Rs. 1,964 million with 15.8% sequential growth, though EBITDA margin compressed to 0.7% due to pricing pressures from Chinese corn starch exports. The company's Dhule expansion project adding 1,000 TPD capacity is scheduled for commissioning in December 2025, positioning it to become India's second-largest producer with total capacity of 2,100 TPD.",
            "Sentiment": "negative",
            "PublishDate": 1763205502802,
            "Source": "earnings"
        },
        {
            "Title": "Sanstar Limited Reports 44% Revenue Decline in Q1 FY26 Due to Maintenance Shutdown and Pricing Pressure",
            "Summary": "Sanstar Limited reported revenue from operations of Rs. 1,689 million for Q1 FY26, down 44.2% from Rs. 3,027 million in Q1 FY25. Gross profit fell to Rs. 404 million with a margin of 23.9%, compared to Rs. 801 million and 26.5% margin in the previous year. The company recorded negative EBITDA of Rs. 17 million and negative PAT of Rs. 3 million. The decline was attributed to a 24-day annual maintenance shutdown at both plants and pricing pressure in the native starch segment due to increased Chinese exports. The company completed maintenance programs at its facilities with combined capacity of 1,100 TPD. Sanstar is expanding its Dhule facility capacity from 750 TPD to 1,750 TPD, with native starch manufacturing to be commissioned in December 2025 and derivatives facility in March 2026. This expansion will increase total company capacity from 1,100 TPD to 2,100 TPD, positioning Sanstar as India's second-largest producer of maize-based specialty products.",
            "Sentiment": "negative",
            "PublishDate": 1755517009218,
            "Source": "earnings"
        },
        {
            "Title": "SANSTAR Reports Q1 Net Loss of 3M Rupees, Revenue Drops to 1.68B Rupees",
            "Summary": "SANSTAR posted a net loss of 3 million rupees in Q1 compared to a profit of 165 million rupees in the same period last year. The company's revenue declined to 1.68 billion rupees from 3.02 billion rupees year-over-year, representing a significant decrease in both profitability and top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1755185003618,
            "Source": "earnings"
        },
        {
            "Title": "Sanstar Limited Reports IPO Proceeds Utilization for Q1 FY2025-26",
            "Summary": "Sanstar Limited utilized INR 287.99 crores out of INR 363.48 crores net proceeds from its July 2024 IPO. The company fully utilized INR 100 crores for debt repayment and INR 81.93 crores for general corporate purposes. For Dhule facility expansion, INR 106.06 crores was utilized out of the allocated INR 181.56 crores, leaving INR 75.50 crores unutilized. The remaining funds are deployed in fixed deposits with Karur Vysya Bank earning 7.70% returns. Monitoring agency Acuité Ratings reported no deviation from stated objectives and confirmed all utilizations align with the offer document disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1755180512997,
            "Source": "corporate_action"
        },
        {
            "Title": "SANSTAR Reports Q4 Financial Results",
            "Summary": "SANSTAR has announced its Q4 financial results. The company reported a net profit of 55 million rupees, down from 162 million rupees in the same quarter last year. Revenue for Q4 was 2.3 billion rupees, compared to 2.6 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748616861000,
            "Source": "result"
        },
        {
            "Title": "SANSTAR Reports Q3 Financial Results",
            "Summary": "SANSTAR has announced its Q3 financial results. The company reported a net profit of 143 million rupees, which is lower compared to both the previous year (219 million rupees) and the previous quarter (75 million rupees). Revenue for Q3 stood at 2.12 billion rupees, down from 2.7 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739366842000,
            "Source": "earnings"
        },
        {
            "Title": "SANSTAR Reports Decline in Q2 EBITDA and Margin",
            "Summary": "SANSTAR's Q2 EBITDA decreased to 114 million rupees from 236 million rupees year-over-year. The company's EBITDA margin also fell to 5.86% from 9.5% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731595414000,
            "Source": "result"
        },
        {
            "Title": "Sanstar Reports Q2 Financial Results",
            "Summary": "Sanstar announced its Q2 financial results. The company reported a net profit of 75 million rupees, down from 148 million rupees year-over-year and 165 million rupees quarter-over-quarter. Revenue for Q2 stood at 1.95 billion rupees, compared to 2.5 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731595341000,
            "Source": "result"
        }
    ]
}