{
    "Symbol": "SANWARIA",
    "ISIN": "INE890C01046",
    "News": [
        {
            "Title": "Sanwaria Consumer Board Meet on Feb 14 for Q3FY26",
            "Summary": "Sanwaria Consumer Limited schedules board meeting on February 14, 2026 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025 under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770471141426,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sanwaria Consumer Limited Reports Quarterly Results Under Corporate Insolvency Resolution Process",
            "Summary": "Sanwaria Consumer Limited released un-audited standalone and consolidated financial results for the quarter ended September 30, 2025, while operating under Corporate Insolvency Resolution Process since May 29, 2020. The Committee of Creditors rejected all resolution plans and decided to liquidate the company, with the liquidation process application filed before NCLT.",
            "Sentiment": "negative",
            "PublishDate": 1763175669095,
            "Source": "earnings"
        },
        {
            "Title": "Sanwaria Consumer Limited Reports Rs 86.09 Lakh Net Loss Despite Slight Revenue Decline",
            "Summary": "Sanwaria Consumer Limited reported unaudited financial results for the quarter ended June 30, 2025. The company recorded revenue from operations of Rs 26.59 lakhs and a net loss of Rs 86.09 lakhs on a standalone basis. This represents a marginal decrease in revenue from Rs 27.07 lakhs in the same quarter last year, while the net loss improved from Rs 110.93 lakhs in the previous year's corresponding quarter. The company remains under Corporate Insolvency Resolution Process as per NCLT order dated May 29, 2020. Sanwaria Consumer has negative reserves of Rs 66,563.64 lakhs and paid-up equity share capital of Rs 7,361 lakhs. The company is listed on BSE and NSE.",
            "Sentiment": "negative",
            "PublishDate": 1756986699960,
            "Source": "earnings"
        },
        {
            "Title": "Sanwaria Consumer Limited Reports Quarterly Results Amid Ongoing Insolvency Process",
            "Summary": "Sanwaria Consumer Limited submitted unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company remains under Corporate Insolvency Resolution Process since May 29, 2020, following a petition by creditor Kishor Ramniklal Unadikat. The Resolution Professional invited expressions of interest from parties for company revival, receiving five eligible submissions, but none of the resolution plans were approved by the Committee of Creditors. The COC has decided to liquidate the company, with an application filed before NCLT for initiation of liquidation process. The company operates with limited commercial activities including warehousing, leasing and job work under the Resolution Professional's supervision. Gautam Mittal serves as the Resolution Professional after replacing the initial appointee Rajiv Goyal.",
            "Sentiment": "negative",
            "PublishDate": 1755187354317,
            "Source": "earnings"
        },
        {
            "Title": "Sanwaria Consumer Limited Approves Quarterly Financial Results Under Corporate Insolvency Process",
            "Summary": "Sanwaria Consumer Limited's suspended Board of Directors approved standalone and consolidated unaudited financial results for the quarter ended June 30, 2025, along with the Limited Review Report from statutory auditors. The company is currently under Corporate Insolvency Resolution Process following an NCLT order dated May 29, 2020. The board meeting was held on August 14, 2025, lasting from 4:56 p.m. to 5:18 p.m. The results will be uploaded on the company's website in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1755177821123,
            "Source": "earnings"
        }
    ]
}