{
    "Symbol": "SAPPHIRE",
    "ISIN": "INE806T01020",
    "News": [
        {
            "Title": "Sapphire Foods Q3FY26 Earnings Call Highlights",
            "Summary": "Sapphire Foods reports 7% revenue growth to INR 811 crores in Q3FY26, with KFC achieving 18.8% restaurant EBITDA. Company added 31 new stores during the quarter while maintaining focus on profitability improvements.",
            "Sentiment": "positive",
            "PublishDate": 1770897065048,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sapphire Foods Shareholders Approve Office Relocation",
            "Summary": "Sapphire Foods India shareholders overwhelmingly approved shifting the company's registered office from Maharashtra to Haryana through postal ballot with 99.999% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1770661668458,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sapphire Foods schedules Q3FY26 earnings call",
            "Summary": "Sapphire Foods India Limited announces earnings conference call with analysts and investors on February 6, 2026 at 4:30 PM IST to discuss Q3FY26 financial performance under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770042129120,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sapphire Foods Schedules Investor Meet on Merger",
            "Summary": "Sapphire Foods India Limited has scheduled an analyst and institutional investor meeting on January 16, 2026, to discuss its proposed merger with Devyani International Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1768311477183,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sapphire Foods Schedules Merger Discussion Meeting",
            "Summary": "Sapphire Foods India Limited has scheduled an analyst and institutional investor meeting for January 15, 2026, to discuss the proposed merger with Devyani International Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1768223606818,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sapphire Foods seeks approval for registered office shift",
            "Summary": "Sapphire Foods India Limited has issued a postal ballot notice seeking shareholder approval to shift its registered office from Maharashtra to Haryana. Remote e-voting is scheduled from January 10 to February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767967664912,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sapphire Foods Makes Merger Call Recording Available",
            "Summary": "Sapphire Foods India Limited has made the audio recording of its merger announcement conference call with Devyani International available on its website as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1767317732416,
            "Source": "co_actions_results"
        },
        {
            "Title": "Devyani International shares in focus after mega merger",
            "Summary": "Devyani International shares to be in focus after announcing merger with Sapphire Foods, creating India's largest Yum! Brands franchisee with enhanced commercial terms and 12-15 month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767281795762,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sapphire Foods Faces ₹203.25 Cr GST Demand Order",
            "Summary": "Sapphire Foods India receives GST demand order worth ₹203.25 crores from tax authorities for alleged excess input tax credit claims during April 2018 to March 2022. Company plans to challenge the order.",
            "Sentiment": "negative",
            "PublishDate": 1767257066709,
            "Source": "stocks"
        },
        {
            "Title": "Sapphire Foods Wins Tax Appeal, Saves ₹16.79 Cr",
            "Summary": "Income Tax Appellate Tribunal rules in favour of Sapphire Foods, reducing interest liability from ₹17.04 crores to ₹25.13 lakhs across 7 assessment years spanning AY 2016-17 to AY 2023-24.",
            "Sentiment": "positive",
            "PublishDate": 1767174569618,
            "Source": "stocks"
        },
        {
            "Title": "Devyani International and Sapphire Foods Near Merger Completion; MosChip Tech Partners with Emass for AI Chip Development",
            "Summary": "Devyani International and Sapphire Foods are close to finalizing merger discussions, with Devyani expected to remain as the listed entity. MosChip Tech has entered into a partnership with Emass for the silicon development of its Edge AI SoC technology.",
            "Sentiment": "positive",
            "PublishDate": 1764839530761,
            "Source": "order&deals"
        },
        {
            "Title": "Sapphire Foods Achieves Top ESG Rating Among Indian QSR Companies",
            "Summary": "Sapphire Foods India Limited received a DJSI ESG score of 73 from S&P Global Corporate Sustainability Assessment for FY2024-25, ranking No.1 among QSR brands in India and No.3 globally. The company placed in the 98th percentile among global QSR companies and remains the only Indian QSR company to publish ESG reports under GRI, SASB and BRSR standards for four consecutive years.",
            "Sentiment": "positive",
            "PublishDate": 1764051130114,
            "Source": "stock"
        },
        {
            "Title": "Sapphire Foods Wins Income Tax Appeal on Interest Calculation",
            "Summary": "Sapphire Foods India Limited received a favorable ruling from the Income Tax Appellate Tribunal (ITAT), Mumbai. The tribunal held that interest under section 201(1A) of the Income Tax Act, 1961, is restricted only up to the date of actual payment of tax. The ITAT allowed the company's appeal for statistical purposes with other grounds adjudicated in favor of the assessee. The matter has been remanded to the Assessing Officer for limited verification of whether tax was properly deducted and deposited in the following financial year regarding the disputed expenses.",
            "Sentiment": "positive",
            "PublishDate": 1762579148267,
            "Source": "stock"
        },
        {
            "Title": "Sapphire Foods Reports 7% Revenue Growth to ₹740 Crores in Q2 FY26 Despite Mixed Brand Performance",
            "Summary": "Sapphire Foods India Limited reported consolidated revenue of ₹740 crores for Q2 FY26, representing 7% year-on-year growth. KFC revenue grew 7%, which would have been double-digit excluding Navratri impact that shifted from Q3 to Q2 this year. Pizza Hut revenue declined 6% overall, though the Tamil Nadu market showed double-digit growth. Sri Lanka operations grew 18% in local currency terms. The company added 19 KFC restaurants and 2 Pizza Hut outlets in India during the quarter, reaching 997 total restaurants and inaugurating its 1000th restaurant in Tamil Nadu. Consolidated restaurant EBITDA declined 12% year-on-year with margins at 11.3%, down 240 basis points. Adjusted EBITDA was ₹45 crores, declining 24% year-on-year with 6.1% margin. The company reported consolidated PAT loss of ₹12.8 crores. KFC maintained flat same-store sales growth excluding Navratri impact, while Pizza Hut showed negative same-store sales growth except in Tamil Nadu. Management indicated ongoing discussions about additional investments needed for Pizza Hut brand revival based on the Tamil Nadu success model.",
            "Sentiment": "neutral",
            "PublishDate": 1761562313889,
            "Source": "earnings"
        },
        {
            "Title": "Sapphire Foods Halts Pizza Hut Expansion in India Due to Declining Sales Performance",
            "Summary": "Sapphire Foods India Ltd., Pizza Hut's Indian operator, has suspended expansion plans due to weak performance metrics. Pizza Hut's same-store sales growth declined 8% year-on-year in the second quarter, worsening from a 3% drop in the previous year's same quarter. Average daily sales per store fell to Rs 42,000 from Rs 47,000 year-on-year. Despite restaurant count increasing to 338 from 323, total restaurant sales dropped 6% to Rs 129.6 crore for the quarter ended September 30. The company opened 20 new Pizza Hut stores in the previous fiscal year but recorded a net decline of one store this year. Management stated expansion will remain halted until same-store sales growth and profitability recover. The company increased marketing investments beyond contractually required levels due to lower consumer demand. Sapphire Foods operates nearly 1,000 KFC, Pizza Hut, and Taco Bell restaurants across India and Sri Lanka.",
            "Sentiment": "negative",
            "PublishDate": 1761309693926,
            "Source": "stock"
        },
        {
            "Title": "Sapphire Foods Reports Consolidated Loss of Rs 145.25 Million for H1 FY2026; Director Rohitt Mutthoo Resigns",
            "Summary": "Sapphire Foods India Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of Rs 15,192.65 million for H1 FY2026, up from Rs 14,139.86 million in the same period last year. However, the company posted a consolidated net loss after tax of Rs 145.25 million for H1 FY2026, compared to a profit of Rs 19.48 million in H1 FY2025. On a standalone basis, the company reported revenue of Rs 12,764.67 million for H1 FY2026 versus Rs 12,080.91 million in the previous year, with a net loss of Rs 207.06 million compared to a loss of Rs 61.19 million in H1 FY2025. Basic earnings per share stood at negative Rs 0.45 for the consolidated entity. Additionally, Mr. Rohitt Mutthoo resigned as Non-Executive Nominee Director representing promoter shareholder Sapphire Foods Mauritius Limited, citing personal reasons. The resignation was accepted by the Board on October 17, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1760687883090,
            "Source": "earnings"
        },
        {
            "Title": "Sapphire Foods India Reports Wider Net Loss Despite Revenue Growth",
            "Summary": "Sapphire Foods India reported a net loss of 128 million rupees compared to a loss of 30 million rupees in the same quarter last year. The company's revenue increased to 7.4 billion rupees from 7 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1760687489775,
            "Source": "earnings"
        },
        {
            "Title": "Sapphire Foods India Receives INR 1.01 Million GST Demand Order from Raipur Authorities",
            "Summary": "Sapphire Foods India Limited received a demand order worth INR 1.01 million from the Central GST and Central Excise authorities in Raipur, Chhattisgarh on September 10th, 2025. The demand relates to the period from April 2018 to March 2019 under Section 74(1) of CGST Act 2017. Authorities have alleged that the company availed excess Input Tax Credit (ITC) and incorrectly utilized ITC against GST liability on outward supply, along with delayed payment of reverse charge payments. The company stated there is no material impact on its financial, operational or other activities due to this order. Sapphire Foods is evaluating the order and plans to take necessary steps to respond to the demand, including challenging it at relevant forums.",
            "Sentiment": "negative",
            "PublishDate": 1757592542475,
            "Source": "stock"
        },
        {
            "Title": "Sapphire Foods Clarifies Executive Director Appointment and Stock Option Allocation for Vijay Jain",
            "Summary": "Sapphire Foods India Limited issued a clarification regarding the appointment of Vijay Jain as Executive Director and Chief Financial Officer, as proposed in their 16th Annual General Meeting notice. Jain has served as CFO since September 5, 2018. His proposed remuneration remains unchanged from his previous CFO role except for standard annual increments, with no additional stock options granted due to his elevation. The company has approximately 11 lakh unallocated stock options representing 5% of the total ESOP pool. No exclusive stock option allocation will be made to board members, and any future grants to the ED & CFO will not exceed 20% of the remaining unallocated pool, with a minimum grant price of Rs. 272 per share. The performance-linked incentive is tied to operating profits and evaluated by the Nomination and Remuneration Committee based on individual and company performance. The Board stated that Jain's proposed remuneration is comparable to similar positions in other companies.",
            "Sentiment": "neutral",
            "PublishDate": 1754035620984,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sapphire Foods Reports 8% Revenue Growth to Rs 775 Crores in Q1 FY26, Margins Decline on Value Campaigns",
            "Summary": "Sapphire Foods India Limited reported revenue of Rs 775 crores for Q1 FY26, representing 8% growth year-on-year. The company added 11 new restaurants during the quarter, bringing total count to 974 stores. However, consolidated restaurant EBITDA declined 13% year-on-year with margins at 12.2%, down 290 basis points. KFC business showed flat same-store sales growth (SSSG) but achieved positive transaction growth through Epic Savers campaign offering 9 items for Rs 299. Pizza Hut revenue declined 5% with negative 8% SSSG, though Tamil Nadu market showed positive single-digit SSSG due to mass media advertising support. Sri Lanka operations delivered strong 12% SSSG and 15% system growth, though margins were impacted by minimum wage increases. The company invested heavily in value campaigns and promotions, resulting in gross margin compression across brands. Management expressed confidence in strategy execution and expects transaction growth to eventually translate into improved SSSG performance.",
            "Sentiment": "neutral",
            "PublishDate": 1753884208681,
            "Source": "earnings"
        },
        {
            "Title": "Sapphire Foods Targets Multi-Channel Growth and Cost Optimization to Improve Profit Margins",
            "Summary": "Sapphire Foods is pursuing a multi-channel growth strategy with smaller location expansion and cost savings initiatives to boost profit margins. The company is focusing on affordable growth across its KFC, Pizza Hut, and Sri Lanka operations while navigating short-term challenges.",
            "Sentiment": "positive",
            "PublishDate": 1753458420238,
            "Source": "stock"
        },
        {
            "Title": "Sapphire Foods Reports 8% Revenue Growth to ₹7,748 MN in Q1 FY26, EBITDA Margin Drops to 14.6%",
            "Summary": "Sapphire Foods India Limited reported restaurant sales of ₹7,748 million in Q1 FY26, representing an 8% year-over-year increase from ₹7,165 million in Q1 FY25. The company operates 974 restaurants across India, Sri Lanka and Maldives as of June 30, 2025, including 510 KFC outlets, 454 Pizza Hut restaurants, and 10 Taco Bell locations. EBITDA margin declined to 14.6% from 17.3% in the previous year quarter, while adjusted EBITDA fell 22% to ₹548 million. The company added 11 new restaurants during the quarter. KFC India showed stronger performance with 11% revenue growth and 15.7% restaurant EBITDA margin, while Pizza Hut India reported 6% revenue growth but negative restaurant EBITDA margin of -2.5%. Sri Lanka business demonstrated robust growth with 19% revenue increase in INR terms and 12.7% restaurant EBITDA margin. The company was recognized as World's Best KFC Franchisee at the Yum Global Franchise Convention in April 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753450880907,
            "Source": "stock"
        },
        {
            "Title": "Sapphire Foods Receives GST Show Cause Notice Worth INR 51 Million for FY 2021-22",
            "Summary": "Sapphire Foods India Limited received a show cause notice from the Sales Tax Officer in Delhi regarding alleged discrepancies in GST returns for FY 2021-22. The notice amounts to INR 51 million, which includes interest of INR 19.53 million and penalty of INR 2.88 million. The authorities issued the notice under Section 73 of Central Goods and Services Tax Act, 2017, highlighting differences observed in the company's filed returns. Sapphire Foods states that the claim is not maintainable and expects no material impact on its financial, operational, or other activities. The company is evaluating the notice and will respond appropriately.",
            "Sentiment": "negative",
            "PublishDate": 1753344633642,
            "Source": "stock"
        },
        {
            "Title": "Sapphire Foods India Reports Mixed Q1 Results with Revenue Growth but Profitability Decline",
            "Summary": "Sapphire Foods India reported quarterly revenue of 7.8 billion rupees, up from 7.2 billion rupees in the same period last year. However, the company posted a net loss of 18 million rupees compared to a profit of 82 million rupees in the previous year. EBITDA decreased to 1.13 billion rupees from 1.24 billion rupees, while EBITDA margin compressed to 14.53% from 17.3% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753258172621,
            "Source": "earnings"
        },
        {
            "Title": "Sapphire Foods Addresses Merger Rumors with Devyani International",
            "Summary": "Sapphire Foods has issued a clarification regarding news of a potential merger with Devyani International. The company stated that it evaluates various strategic opportunities for growth and expansion of its business, without confirming or denying the specific merger rumor.",
            "Sentiment": "neutral",
            "PublishDate": 1751620221000,
            "Source": "default"
        },
        {
            "Title": "Sapphire Foods India Ltd. Block Trade on NSE",
            "Summary": "A block trade of approximately 506,108 shares of Sapphire Foods India Ltd. was executed on the National Stock Exchange (NSE) at Rs. 300.00 per share, totaling Rs. 15.18 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1746774070000,
            "Source": "block_details"
        },
        {
            "Title": "Sapphire Foods India Reports Q4 Financial Results",
            "Summary": "Sapphire Foods India has released its Q4 financial results. The company's EBITDA increased slightly to 106 million rupees from 103 million rupees year-over-year. However, the EBITDA margin decreased to 14.9% from 16.30% in the same period last year. The consolidated net profit for Q4 declined to 18 million rupees from 24 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746606525000,
            "Source": "result"
        },
        {
            "Title": "Sapphire Foods India: KFC Operator's Q3 Profit Up 18%, Margins Decline",
            "Summary": "Sapphire Foods India reported an 18% YoY increase in Q3 FY2025 net profit to ₹12 crore. Revenue rose 14% to ₹756.5 crore. EBITDA grew 10% to ₹134.2 crore, but margins declined to 17.7% from 18.3% due to higher costs. The company added 54 new restaurants, bringing the total to 963. KFC India saw a 3% decline in same-store sales growth, while Pizza Hut India reported 5% growth. Sri Lanka operations showed strong performance with 14% same-store sales growth in local currency.",
            "Sentiment": "neutral",
            "PublishDate": 1738832805000,
            "Source": "earnings"
        },
        {
            "Title": "Sapphire Foods India Reports Q3 EBITDA Growth",
            "Summary": "Sapphire Foods India announced its Q3 financial results. The company's EBITDA increased to 1.34 billion rupees from 1.21 billion rupees year-over-year. However, the EBITDA margin decreased slightly to 17.75% from 18.30% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738829539000,
            "Source": "earnings"
        },
        {
            "Title": "Sapphire Foods India Reports Q3 Revenue Growth",
            "Summary": "Sapphire Foods India has announced its third-quarter revenue results. The company reported revenue of 7.6 billion rupees, compared to 6.6 billion rupees in the same quarter of the previous year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738829516000,
            "Source": "earnings"
        },
        {
            "Title": "Sapphire Foods India Reports Q3 Profit Increase",
            "Summary": "Sapphire Foods India has reported a consolidated net profit of 120 million rupees for the third quarter, compared to 101 million rupees in the same period last year. This represents a year-over-year increase in profit for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738829495000,
            "Source": "earnings"
        },
        {
            "Title": "SAP: Indian Workforce to Surpass German Headquarters",
            "Summary": "SAP plans to hire 'over proportionally' in India, soon making it the company's largest workforce globally. SAP Labs India currently has 15,000 employees. The company is building a second office in Bengaluru with capacity for 15,000 more. India is among SAP's top 10 markets by revenue and its fastest-growing one. SAP's main AI strategy team is located in India.",
            "Sentiment": "positive",
            "PublishDate": 1730894035000,
            "Source": "normal_news"
        },
        {
            "Title": "SAP: India to Become One of Its Largest Markets",
            "Summary": "SAP CEO Christian Klein expects India to be one of the company's largest markets soon, citing rapid digitization across industries. SAP Labs India employs 15,000 people, and major Indian IT companies heavily invest in SAP. The company sees opportunities in manufacturing, supply chain, retail, and utilities sectors in India.",
            "Sentiment": "positive",
            "PublishDate": 1730876274000,
            "Source": "normal_news"
        },
        {
            "Title": "Sapphire Foods India Reports Q2 Financial Results",
            "Summary": "Sapphire Foods India has released its Q2 financial results. The company's EBITDA for the quarter was 1.1 billion rupees, compared to 1.15 billion rupees in the same quarter last year. The EBITDA margin decreased to 16.10% from 17.93% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730103100000,
            "Source": "result"
        },
        {
            "Title": "SAP: Cloud Business Boosts Shares to All-Time High",
            "Summary": "SAP shares hit a record €221 after strong Q3 results. Cloud revenue grew 27% to €4.35 billion, with AI driving 30% of cloud contracts. The company raised its full-year targets and expects restructuring costs of €3 billion as it evaluates up to 10,000 jobs for AI era.",
            "Sentiment": "positive",
            "PublishDate": 1729618922000,
            "Source": "result"
        }
    ]
}