{
    "Symbol": "SARDAEN",
    "ISIN": "INE385C01021",
    "News": [
        {
            "Title": "Sarda Energy Terminates Coal Mining Agreement",
            "Summary": "Sarda Energy & Minerals Ltd announces termination of agreement between SECL and its subsidiary Kalyani Coal Mining for underground coal mine operations due to project unviability following mine boundary changes.",
            "Sentiment": "negative",
            "PublishDate": 1770309784965,
            "Source": "stocks"
        },
        {
            "Title": "Sarda Energy Promoter Group Share Transfer",
            "Summary": "Sarda Energy & Minerals reports internal promoter group share transfer of 67,000 equity shares on December 30, 2025, with no change in overall promoter holding.",
            "Sentiment": "neutral",
            "PublishDate": 1767099888342,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sarda Energy Invests ₹48.23 Cr in Subsidiary",
            "Summary": "Sarda Energy & Minerals invests ₹48.23 crore in its fully owned subsidiary Sarda Energy Limited through a rights issue, strengthening its corporate structure.",
            "Sentiment": "positive",
            "PublishDate": 1766578631646,
            "Source": "stocks"
        },
        {
            "Title": "Sarda Energy Infuses ₹48.23 Cr in Subsidiary",
            "Summary": "Sarda Energy & Minerals invests ₹48.23 crores in wholly-owned subsidiary Sarda Energy Limited through rights issue subscription for operational activities and loan reduction.",
            "Sentiment": "positive",
            "PublishDate": 1766572794632,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sarda Energy Reports Plant Accident at Raipur Facility",
            "Summary": "Steam pipeline leakage at Sarda Energy & Minerals' captive power plant in Raipur resulted in one casualty and one serious injury on December 20, 2025. Company explains filing delay due to emergency response priorities.",
            "Sentiment": "negative",
            "PublishDate": 1766397442575,
            "Source": "stocks"
        },
        {
            "Title": "Sarda Group Launches RHINO Rock Mineral Wool Insulation at Green Building Congress 2025",
            "Summary": "Sarda Metals & Alloys Limited, a wholly owned subsidiary of Sarda Energy Minerals Limited, launched RHINO rock mineral wool insulation at the 23rd Green Building Congress in Mumbai. The product promises 45-50% energy savings annually, is manufactured without fossil fuels, offers fire resistance up to 1000 degrees Celsius, and achieves up to 65% lower CO2 emissions compared to conventional alternatives.",
            "Sentiment": "positive",
            "PublishDate": 1764230841507,
            "Source": "stock"
        },
        {
            "Title": "Sarda Energy Reports 32% Revenue Growth to INR 1,528 Crores in Q2 FY26",
            "Summary": "Sarda Energy Minerals Limited posted consolidated revenue of INR 1,528 crores, up 32% year-on-year, with EBITDA rising to INR 580 crores and profit after tax growing 61% to INR 328 crores. The company achieved highest-ever half-yearly production across iron ore pellets, captive power, hydropower and coal operations, while commissioning the 25 megawatt Rehar Hydropower project and securing allocation for Senduri coal block in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1763630774014,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals Reports 52% Revenue Growth in H1FY26, Energy Segment Drives Performance",
            "Summary": "Sarda Energy & Minerals Limited reported consolidated revenue of Rs 3,161 crores in H1FY26, marking a 52% increase from Rs 2,085 crores in H1FY25. The energy segment emerged as the primary growth driver, contributing Rs 1,505 crores (47% of consolidated revenue) and Rs 759 crores in EBIT (72% of consolidated EBIT). Profit after tax surged 90% to Rs 764 crores from Rs 402 crores year-over-year. The company's IPP Binjkot achieved an average PLF of 85%, while hydro power generation increased 32% due to seasonal uptick. EBITDA margin improved to 38.6% in H1FY26 from 32.9% in H1FY25. The company maintains strong financial metrics with net debt to EBITDA ratio of 0.32x and total liquidity of Rs 2,231 crores. Credit ratings were reaffirmed by CRISIL with outlook changed from stable to positive.",
            "Sentiment": "positive",
            "PublishDate": 1762935564735,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals' Subsidiary Gets Credit Rating Outlook Upgrade",
            "Summary": "Sarda Energy & Minerals Ltd announced that its wholly owned subsidiary, Sarda Metals & Alloys Ltd, received updated credit ratings from CRISIL. The subsidiary's long-term rating was reaffirmed at CRISIL A with the outlook revised from Stable to Positive. The short-term rating remained unchanged at CRISIL A1. The ratings cover total bank facilities worth ₹659.81 crore.",
            "Sentiment": "positive",
            "PublishDate": 1762924607128,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Strong Q2 Growth with 32% Revenue Increase",
            "Summary": "Sarda Energy & Minerals reported Q2 revenue of 15.3 billion rupees, up from 11.6 billion rupees year-over-year. The company's consolidated net profit increased to 3.2 billion rupees from 1.95 billion rupees in the same period last year. EBITDA rose to 5.1 billion rupees compared to 3.37 billion rupees year-over-year, while EBITDA margin improved to 33.5% from 29.11% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762764513684,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals Receives Environmental Consent for Coal Handling Plant Operations",
            "Summary": "Sarda Energy & Minerals Ltd has received Consent to Operate from the Chhattisgarh Environment Conservation Board for its Coal Handling Plant at Gare Palma IV/7 Coal Mine. The consent covers operations under Water and Air Pollution Control Acts for a 300 TPH plant with 18,00,000 Metric Tonnes per annum capacity. The company informed stock exchanges BSE and NSE about this regulatory approval.",
            "Sentiment": "positive",
            "PublishDate": 1760097077352,
            "Source": "stock"
        },
        {
            "Title": "Sarda Energy & Minerals Wins Senduri Coal Mine Bid with 9.50% Revenue Share Agreement",
            "Summary": "Sarda Energy & Minerals Ltd has been declared the successful bidder for Senduri Coal Mine located in Shahdol and Umaria districts of Madhya Pradesh. The company secured the mine with a 9.50% revenue sharing agreement with the State Government. The Senduri Coal Mine contains total geological reserves of 248.54 million tonnes of G9 (Provisional) grade coal. The company stated that necessary agreements will be executed in due course.",
            "Sentiment": "positive",
            "PublishDate": 1755596707630,
            "Source": "stock"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Record Q1 Revenue of INR 1,633 Crores, Up 76% YoY",
            "Summary": "Sarda Energy & Minerals Limited reported record consolidated revenue of INR 1,633 crores in Q1 FY26, representing a 76% year-over-year increase and 32% quarter-over-quarter growth. The integrated steel, power and mining company saw operating EBITDA rise to INR 627 crores from INR 382 crores in the previous year, while consolidated profit after tax grew 118% to INR 435 crores. The company strengthened its balance sheet by reducing net consolidated debt to approximately INR 1,000 crores from INR 1,600 crores and maintained strong liquidity with INR 1,700 crores in cash and liquid investments. Operational performance improved across segments, with hydropower generation growing 37% and the thermal power plant achieving 90.21% plant load factor compared to 71.65% in the previous year. The company commissioned a 25 MW hydropower project and expects to complete a 50 MW solar project in FY26. Management projects power segment EBITDA of over INR 1,000 crores for FY26 and plans annual capital expenditure of INR 500-1000 crores for the next 2-3 years.",
            "Sentiment": "positive",
            "PublishDate": 1754907592011,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy Shares Surge 20% Following Strong Quarterly Results",
            "Summary": "Sarda Energy & Minerals Ltd. shares jumped 20% following quarterly results that showed the company's transformation into an energy-focused business. The energy segment now contributes 67% of consolidated EBITDA. The company reported 76% revenue growth to ₹1,633.1 crore and 137% EBITDA growth to ₹617.19 crore compared to the same quarter last year. These results include numbers from SKS Power Generation (Chhattisgarh) Ltd., which Sarda acquired through the Corporate Insolvency and Resolution Process and merged in September last year. The stock closed 17% higher at ₹512.65, becoming the top gainer on the BSE Smallcap index and turning positive year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1754284686242,
            "Source": "stock"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Strong Q1 Performance with Net Profit Doubling",
            "Summary": "Sarda Energy & Minerals reported consolidated net profit of Rs 4.34 billion for Q1, compared to Rs 1.98 billion in the same period last year. The company's EBITDA increased to Rs 5.96 billion from Rs 2.6 billion year-on-year. EBITDA margin improved to 36.54% from 28.16% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754265754082,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Strong Q1 Results, Plans ₹1,000 Crore Debt Fundraise",
            "Summary": "Sarda Energy & Minerals Ltd announced its Q1 2025-26 results with standalone revenue from operations rising to ₹1,307.09 crore compared to ₹661.83 crore in the same quarter last year. Net profit increased significantly to ₹386.05 crore from ₹181.01 crore year-on-year. On consolidated basis, revenue reached ₹1,633.11 crore versus ₹926.21 crore in Q1 2024-25, with net profit at ₹423.07 crore compared to ₹194.49 crore. The board approved seeking shareholder consent to raise up to ₹1,000 crore through debt instruments. The company also approved re-appointment of Mr. Padam Kumar Jain as Wholetime Director for five years from June 1, 2026, and Ms. Tripti Sinha as Independent Director for five years from October 20, 2025. Mr. Arup Pal was appointed as President and Plant Head, IPP. The board set August 22, 2025 as the record date for FY 2024-25 dividend payment and approved amendments to Articles of Association including changes to director age limits and lender nomination rights.",
            "Sentiment": "positive",
            "PublishDate": 1754130795164,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Strong Q1 EBITDA Growth",
            "Summary": "Sarda Energy & Minerals reported Q1 EBITDA of Rs 5.96 billion, representing significant growth from Rs 2.6 billion in the same period last year. The company's EBITDA margin improved to 36.54% compared to 28.16% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754130134472,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals Reports 119% Jump in Q1 Consolidated Net Profit",
            "Summary": "Sarda Energy & Minerals reported consolidated net profit of Rs 4.34 billion for Q1, representing a significant increase from Rs 1.98 billion in the same period last year. The year-over-year growth reflects more than doubling of the company's quarterly profit performance.",
            "Sentiment": "positive",
            "PublishDate": 1754129721234,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals Schedules Q1 FY26 Earnings Conference Call for August 4, 2025",
            "Summary": "Sarda Energy & Minerals Limited has scheduled an earnings conference call for analysts, institutional investors, and fund houses on Monday, August 4, 2025 at 4:00 PM IST. The call will discuss the company's Q1 FY26 results, business strategy, and outlook. The management team participating includes Managing Director Pankaj Sarda, Deputy MD of Sarda Metals & Alloys Manish Sarda, Director & CFO Padam Kumar Jain, and Executive Director Nilay Joshi. Dial-in details have been provided for both domestic and international participants, with toll-free numbers available for India, USA, UK, Hong Kong, and Singapore.",
            "Sentiment": "neutral",
            "PublishDate": 1753507000179,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy Subsidiary Terminates Power Purchase Agreement",
            "Summary": "Madhya Bharat Power Corporation Ltd., a subsidiary of Sarda Energy & Minerals, has ended its long-term power purchase agreement with Chhattisgarh State Power Distribution Company Ltd. The agreement was for the 113 MW Rongnichu Hydropower Project.",
            "Sentiment": "neutral",
            "PublishDate": 1752237077000,
            "Source": "default"
        },
        {
            "Title": "Sarda Energy's Unit Starts Operations of 24.9 MW Rehar-1 Hydro Project",
            "Summary": "Sarda Energy And Minerals has announced that its company unit has received approval and commenced operations for the 24.9 MW Rehar-1 Hydro Project. This development marks the successful launch of a renewable energy initiative, indicating the company's expansion into hydroelectric power generation.",
            "Sentiment": "positive",
            "PublishDate": 1752048788000,
            "Source": "default"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Q4 Financial Results",
            "Summary": "Sarda Energy & Minerals has reported its Q4 financial results. The company's EBITDA increased to 2.71 billion rupees from 1.53 billion rupees year-over-year, representing a 77.78% increase. The EBITDA margin improved to 21.87% from 17.17% in the same period last year, an increase of 27.28%. The consolidated net profit for Q4 was 1.08 billion rupees, up from 944 million rupees in the previous year. Revenue for the quarter rose to 12.39 billion rupees from 8.89 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748084834000,
            "Source": "result"
        },
        {
            "Title": "Fire Incident at Sarda Energy & Minerals Power Plant in Raigarh",
            "Summary": "A fire incident occurred at a unit of Sarda Energy & Minerals' power plant in Raigarh. The cause of the fire is yet to be determined. Based on initial assessments, the company reports that property damage is limited. However, the affected unit may require time to restart, which will result in production losses.",
            "Sentiment": "negative",
            "PublishDate": 1740572937000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Strong Q3 Financial Performance",
            "Summary": "Sarda Energy & Minerals has announced its Q3 consolidated financial results. The company's net profit increased to 1.97 billion rupees, up from 1.17 billion rupees in the same quarter last year. Revenue also saw significant growth, reaching 13.2 billion rupees compared to 9.25 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739146188000,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Significant Increase in Q3 EBITDA and Margin",
            "Summary": "Sarda Energy & Minerals has announced its Q3 financial results, showing a substantial improvement in performance. The company's EBITDA rose to 3.68 billion rupees, up from 1.88 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 27.93% from 20.32% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739016173000,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Strong Q3 Financial Performance",
            "Summary": "Sarda Energy & Minerals has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 1.97 billion rupees, up from 1.17 billion rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 13.2 billion rupees compared to 9.25 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739016168000,
            "Source": "earnings"
        },
        {
            "Title": "Sarda Energy & Minerals' Subsidiary Commences Trial Power Production",
            "Summary": "Sarda Energy & Minerals has announced that its subsidiary, Chhattisgarh Hydro Power LLP, has successfully synchronized its 24.9 MW Rehar Small Hydro Power Project with the grid. The project has now begun trial production of power, marking a significant milestone in the company's renewable energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1736727713000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarda Energy & Minerals' Subsidiary Commences Trial Power Production",
            "Summary": "Sarda Energy & Minerals has announced that its subsidiary, Chhattisgarh Hydro Power LLP, has successfully synchronized its 24.9 MW Rehar Small Hydro Power Project with the grid. The project has now begun trial production of power, marking a significant milestone in the company's renewable energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1736510652000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarda Energy & Minerals Wins Bid for Gare Palma IV/5 Coal Mine",
            "Summary": "Sarda Energy & Minerals has been declared the preferred bidder for the Gare Palma IV/5 coal mine located in Raigarh district, Chhattisgarh. The company secured the bid with a 25.75% revenue sharing agreement with the state government. The mine is reported to contain G8 (provisional) grade coal.",
            "Sentiment": "positive",
            "PublishDate": 1732492368000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarda Energy & Minerals Wins Bid for Gare Palma IV/5 Coal Mine",
            "Summary": "Sarda Energy & Minerals has been declared the preferred bidder for the Gare Palma IV/5 coal mine located in Raigarh district, Chhattisgarh. The company secured the bid with a 25.75% revenue sharing agreement with the state government. The mine is reported to have a provisional G8 grade of coal.",
            "Sentiment": "positive",
            "PublishDate": 1732280466000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Improved Q2 FY25 Results",
            "Summary": "Sarda Energy & Minerals has reported a deferred tax of 1.2 billion in Q2 FY25. The company's Profit Before Tax (PBT) for the quarter increased to 2.8 billion, up from 1.9 billion in the same quarter of the previous year, showing a year-over-year improvement.",
            "Sentiment": "positive",
            "PublishDate": 1731583875000,
            "Source": "result"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Strong Q2 Financial Performance",
            "Summary": "Sarda Energy & Minerals has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 2.42 billion rupees to 3.37 billion rupees. Additionally, the EBITDA margin rose from 24.21% to 29.11%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1731583619000,
            "Source": "result"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Q2 Revenue Growth",
            "Summary": "Sarda Energy & Minerals has reported a revenue of 11.6 billion rupees for the second quarter, compared to 10 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731583499000,
            "Source": "result"
        },
        {
            "Title": "Sarda Energy & Minerals Reports Q2 Profit Increase",
            "Summary": "Sarda Energy & Minerals has reported a consolidated net profit of 1.95 billion rupees for the second quarter, showing an increase from 1.41 billion rupees year-over-year and 2 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731583442000,
            "Source": "result"
        }
    ]
}