{
    "Symbol": "SAREGAMA",
    "ISIN": "INE979A01025",
    "News": [
        {
            "Title": "Saregama Q3FY26: Music Revenue Surges 29% YoY",
            "Summary": "Saregama India reports strong Q3FY26 performance with music segment growing 29% year-on-year, driven by successful releases like Dhurandhar and strategic content investments.",
            "Sentiment": "positive",
            "PublishDate": 1770731465885,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saregama India Q3 Net Profit Drops 17.7% YoY",
            "Summary": "Saregama India reported consolidated net profit of ₹51.3 crores in Q3, down from ₹62.3 crores in the same quarter last year, marking a decline of 17.7%.",
            "Sentiment": "negative",
            "PublishDate": 1770107408393,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saregama Completes INR 325 Crore Bhansali Acquisition",
            "Summary": "Saregama India Limited has successfully completed its acquisition of securities in Bhansali Productions Private Limited for INR 325 crores through subscription of compulsory convertible preference shares.",
            "Sentiment": "positive",
            "PublishDate": 1769792275315,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saregama India schedules Q3FY26 earnings call",
            "Summary": "Saregama India Limited has scheduled an analyst and investor conference call for February 3, 2026, at 5:00 PM IST to discuss Q3FY26 financial and operational performance.",
            "Sentiment": "neutral",
            "PublishDate": 1769600671286,
            "Source": "stocks"
        },
        {
            "Title": "Music labels pivot to film production for growth",
            "Summary": "Major music labels including Saregama are investing in film studios to diversify revenue streams beyond low-monetization streaming, with Saregama investing ₹325 crore in Bhansali's company.",
            "Sentiment": "positive",
            "PublishDate": 1768836501823,
            "Source": "stocks"
        },
        {
            "Title": "Saregama India Independent Director Completes Tenure",
            "Summary": "Saregama India announces completion of Mr. Santanu Bhattacharya's second term as Independent Director on December 21, 2025, following regulatory tenure limits.",
            "Sentiment": "neutral",
            "PublishDate": 1766322369721,
            "Source": "stocks"
        },
        {
            "Title": "Saregama India: 30% Hindi Music From Bhansali Deal",
            "Summary": "Saregama India executive reveals Bhansali Productions partnership expected to contribute 30% of company's Hindi music content, strengthening content portfolio significantly.",
            "Sentiment": "positive",
            "PublishDate": 1765885807445,
            "Source": "stocks"
        },
        {
            "Title": "Saregama Board Approves Bhansali Productions Acquisition",
            "Summary": "Saregama India's board approves acquisition of Bhansali Productions for ₹325 crores through CCPS subscription, with options for majority stake by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1765881124205,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saregama Completes Full Acquisition of Finnet Media Through Pocket Aces",
            "Summary": "Saregama has completed the full acquisition of Finnet Media through its subsidiary Pocket Aces. The company plans to acquire additional Original Content Producers (OCPs) over the next two years.",
            "Sentiment": "positive",
            "PublishDate": 1763556699175,
            "Source": "order&deals"
        },
        {
            "Title": "Saregama India Reports Q2FY26 Revenue of INR 230 Crores, Video Segment Sees Decline",
            "Summary": "Saregama India Limited reported operating revenue of INR 230 crores and PBT of INR 60 crores for Q2FY26. While all segments grew, the Video segment experienced degrowth due to fewer releases compared to Q2FY25, which the company attributes to cyclical issues. The Music segment grew 12% year-on-year, driven by successful releases including Tamil album Idli Kadai, Bengali album Dhumketu, and Malayalam film Sahasam. The company reduced its content spend guidance to INR 320-330 crores from earlier projections due to film album delays, including Sanjay Leela Bhansali's Love War being pushed to next fiscal year. Saregama is implementing Generative AI tools to create music videos for older songs, reducing production time from 10-12 days to 2-3 days. The artist management vertical added 18 new artists, bringing the total to 230 artists with 200 million social media followers. Management revised music segment growth guidance to 19-20% for the current year while maintaining long-term projections of 23% CAGR and 32-33% adjusted EBITDA margins.",
            "Sentiment": "neutral",
            "PublishDate": 1762936412223,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India Reports Strong Q2 Results, Declares Rs 4.50 Interim Dividend",
            "Summary": "Saregama India Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company's Board of Directors approved the quarterly results and declared an interim dividend of Rs 4.50 per equity share of face value Re 1 each (450%). The dividend will be paid to shareholders whose names appear in the Register of Members at the close of business on November 11, 2025, which has been fixed as the Record Date. The consolidated revenue from operations for the quarter was Rs 23,003 lakhs compared to Rs 21,855 lakhs in the previous year quarter. Profit for the quarter stood at Rs 4,376 lakhs versus Rs 4,490 lakhs in the corresponding quarter last year. The company operates through four business segments: Music, Artist Management, Video, and Events. The Board meeting was held on November 5, 2025, and commenced at 11:00 AM, concluding at 12:10 PM.",
            "Sentiment": "positive",
            "PublishDate": 1762329486115,
            "Source": "corporate_action"
        },
        {
            "Title": "Saregama's Subsidiary Pocket Aces Acquires Finnet Media for INR 8.7 Crores",
            "Summary": "Saregama India's board approved the acquisition of 100% equity share capital of Finnet Media Private Limited through its subsidiary Pocket Aces Pictures for INR 8.7 crores. The deal involves purchasing 3 lakh equity shares and will make Finnet Media a wholly owned subsidiary of Pocket Aces. Additionally, Pocket Aces will acquire 2.88 lakh optionally convertible preference shares after two years. Finnet Media, incorporated in March 2022, operates in influencer marketing, social media marketing, and talent management in finance, health, and infotainment sectors. The company reported revenues of INR 20.93 crores in FY2023 and INR 23.04 crores in FY2024. The acquisition aims to strengthen Pocket Aces' artist and influencer management division, generate operational synergies, and broaden market reach. The transaction is expected to complete by October 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758787850400,
            "Source": "order&deals"
        },
        {
            "Title": "Saregama Plans ₹200 Crore AI Investment to Create Modern Videos for Classic Songs",
            "Summary": "Saregama is entering AI-generated content to transform its music library into a new revenue stream. The company plans to invest ₹200 crore to convert 20,000 top songs into AI-generated videos at a fraction of traditional production costs. With over 87,000 songs in its library, Saregama aims to monetize content on digital platforms like YouTube. The company is also exploring AI-generated films with production costs under ₹5 crore, expecting the first AI film within 12 months. Saregama reported record revenue of ₹1,171.3 crore in FY25, up 46% year-on-year, with EBITDA at ₹356.6 crore. The business has delivered 23% annual profit growth over the last five years. The company has allocated ₹1,000 crore for content investments during FY25-27. The AI initiative is being led by the next generation of leadership within the RPSG Group.",
            "Sentiment": "positive",
            "PublishDate": 1758275491210,
            "Source": "stock"
        },
        {
            "Title": "Saregama India Reports 46% Revenue Growth, Plans INR 10,000 Million Content Investment",
            "Summary": "Saregama India Limited announced an investors conference scheduled for September 8th, 2025. The entertainment company reported revenue growth of 46% year-on-year to INR 11,713 million in FY25, with adjusted EBITDA increasing 18% to INR 3,566 million. The company operates across four segments: music licensing and artist management (52% of revenue), video content (24%), retail products (16%), and live events (8%). Saregama maintains a portfolio of 175,000+ songs, 70+ films, 55+ digital series, and 10,000+ hours of TV content. The company plans to invest approximately INR 10,000 million in new content acquisition over the next three years. Management projects revenue to double and profit before tax to increase 2.2-2.5 times over the next four years, with expected segment growth rates of 20-23% for music, 15-20% for video, and 25-30% for events through FY30. The company maintains a debt-free balance sheet and reported a return on equity of 13% in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1757177388022,
            "Source": "stock"
        },
        {
            "Title": "Saregama Reports Strong Revenue Growth Driven by Live Events Business in Q3FY25",
            "Summary": "Saregama India Limited reported operating revenues of INR 483 crores and PBT of INR 84 crores for Q3FY25. The company's revenue growth exceeded its 30% guidance for FY25, with adjusted EBITDA increasing 25% year-on-year. Live events contributed significantly with INR 279 crores in revenue, representing 58% of quarterly revenue, though at lower margins with INR 22 crores profit. The music business grew nearly 20% year-on-year, with successful releases including Stree 2 songs generating 1.9 billion YouTube views and 450 million Spotify streams. The company released content worth INR 235 crores over nine months and expects full-year content investment exceeding INR 300 crores. Saregama expanded into hip-hop music through MTV Hustle Season 4 partnership and successfully conducted the Dil Luminati tour with Diljit Dosanjh. The board declared an interim dividend of Rs. 4.5 per share. Management maintains medium-term growth projections of 22-23% CAGR for the music vertical and expects PBT to double over the next three to four years.",
            "Sentiment": "positive",
            "PublishDate": 1757079741930,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India Appoints New Company Secretary and Approves Dubai Subsidiary Formation",
            "Summary": "Saregama India Ltd appointed Mr. Nayan Kumar Misra as Company Secretary and Compliance Officer effective September 5, 2025. Misra is a Commerce Graduate and Company Secretary Institute member with over 15 years of experience in Finance, Secretarial and Legal Functions, having previously worked with K Raheja Group and JSW Group. The Board also authorized three Key Managerial Personnel - Managing Director Vikram Mehra, Chief Financial Officer Pankaj Mahesh Chaturvedi, and Misra - to determine materiality of events for stock exchange disclosures. Additionally, the Board approved incorporation of a wholly owned subsidiary in Dubai Mainland named 'Saregama Performing Arts and Music Festivals LLC' with initial paid-up capital of up to One Million AED. The subsidiary will focus on tapping business potential in the Middle East Asia region through live events, audio-video content licensing, and collaborations with artists and content creators in the Media and Entertainment industry.",
            "Sentiment": "positive",
            "PublishDate": 1757057665538,
            "Source": "corporate_action"
        },
        {
            "Title": "Saregama Reports Q1FY26 Revenue of INR 206 Crores, Music Segment Grows 12% YoY",
            "Summary": "Saregama India Limited reported operating revenue of INR 206 crores and PBT of INR 51 crores for Q1FY26. The music segment, comprising licensing and artist management, grew 12% year-on-year. The quarter was impacted by postponement of several planned movie releases. The company released over 1,000 original songs across multiple languages including successful Tamil film albums like Thug Life. Saregama acquired NAV Records, a Haryanvi music catalog with 6,500 tracks and 24 million YouTube subscribers, to be funded through QIP money with revenues expected from Q3. The company plans to spend INR 350-380 crores on new content this year, with major releases scheduled for Q3-Q4 including films starring Ranveer Singh, Kartik Aaryan, and Sanjay Leela Bhansali's Love & War. Management maintains guidance of 22-23% annual growth for music vertical and 32-33% adjusted EBITDA. The video segment reported losses this quarter but management expects full-year profitability. Artist management vertical added 25+ new influencers, bringing total managed artists to 230+ with 200 million combined followers.",
            "Sentiment": "neutral",
            "PublishDate": 1754636796203,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Saregama India reported Q1 consolidated net profit of 367 million rupees, down from 369 million rupees in the same period last year. The company's revenue increased to 2.1 billion rupees compared to 2.05 billion rupees year-over-year. EBITDA rose to 553 million rupees from 515 million rupees, while EBITDA margin improved to 26.7% from 25.07% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753946047806,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India Schedules Q1FY26 Results Conference Call for August 1, 2025",
            "Summary": "Saregama India Limited has scheduled a conference call with analysts and investors to discuss Q1FY26 financial and operational performance on August 1, 2025 at 11:30 AM IST. The call will be hosted by Emkay Global Financial Services and will feature key management including Managing Director Vikram Mehra, CFO Pankaj Chaturvedi, Group Head Investor Relations Anand Kumar, and Executive Director Investor Relations Pankaj Kedia. The company has provided dial-in numbers for both domestic and international participants across multiple countries.",
            "Sentiment": "neutral",
            "PublishDate": 1753776349262,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India Reports 46% Revenue Growth to INR 11,713 Mn in FY25, Driven by Music Licensing and Content Expansion",
            "Summary": "Saregama India Limited submitted a corporate presentation showing strong financial performance for FY25. The entertainment company reported revenue from operations of INR 11,713 million, representing 46% year-over-year growth from INR 8,030 million in FY24. The music licensing and artist management segment contributed 52% of total revenue at INR 6,104 million. Adjusted EBITDA grew 18% to INR 3,566 million, though margins compressed to 30% from 38% in the previous year. Profit after tax increased 3% to INR 2,043 million with diluted EPS of INR 10.61. The company operates across multiple segments including music licensing, video content, retail, and events. Saregama maintains a large IP portfolio of 170,000+ songs, 70+ films, 45+ digital series and 10,000+ hours of television content. The company has 350 million+ subscribers and followers across digital platforms and manages 230+ artists and influencers through its Pocket Aces division. Content investment increased 48% to INR 1,282 million as the company expanded its music catalog across Hindi and regional languages.",
            "Sentiment": "positive",
            "PublishDate": 1753277263220,
            "Source": "stock"
        },
        {
            "Title": "Saregama India Ltd: Acquires NAV Records' Haryanvi Music Catalogue, Shares Surge",
            "Summary": "Saregama India Ltd acquired NAV Records' Haryanvi music catalogue, including over 6,500 tracks and YouTube channels with 24 million subscribers. The deal strengthens Saregama's regional portfolio and digital footprint. Shares rose 6.75% to Rs 520 before settling at Rs 513.65, up 5.45%.",
            "Sentiment": "positive",
            "PublishDate": 1752818077000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saregama India Ltd: Acquires NAV Records, Expands Haryanvi Music Catalogue",
            "Summary": "Saregama India Ltd has acquired NAV Records, adding 6,500 tracks across various regional genres, including Haryanvi, Punjabi, Ghazals, Devotional, and Indie Pop. The deal includes popular YouTube channels with over 24 million subscribers. Saregama aims to strengthen its position in Haryanvi music and plans to create new content in Haryanvi and Punjabi languages.",
            "Sentiment": "positive",
            "PublishDate": 1752761927000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saregama India Plans Significant Content Investment",
            "Summary": "Saregama India has announced plans to substantially increase its investment in content. The company projects that its content investment will reach Rs 10,000 million (approximately $120 million USD) by the fiscal year 2027. This significant financial commitment suggests Saregama's strategic focus on expanding its content portfolio over the next few years.",
            "Sentiment": "positive",
            "PublishDate": 1747294459000,
            "Source": "result"
        },
        {
            "Title": "Saregama India Reports Strong Q4 EBITDA Growth",
            "Summary": "Saregama India's Q4 EBITDA increased to 803 million rupees from 700 million rupees year-over-year. The company's EBITDA margin also improved significantly, rising to 33.35% from 26.62% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747293783000,
            "Source": "result"
        },
        {
            "Title": "Saregama India Reports Q4 Profit Increase",
            "Summary": "Saregama India's consolidated net profit for the fourth quarter rose to 600 million rupees, up from 540 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1747293715000,
            "Source": "result"
        },
        {
            "Title": "Saregama India Ltd: Q3 Profit Soars 20%, Events Segment Booms",
            "Summary": "Saregama India Ltd reported a 20.8% YoY increase in Q3 consolidated net profit to Rs 63.24 crore. Revenue surged 137% to Rs 483.43 crore, driven by music and events segments. Events revenue skyrocketed from Rs 10 crore to Rs 278.89 crore. The company plans to invest Rs 1,000 crore in content development over three years. An interim dividend of Rs 4.50 per share was declared.",
            "Sentiment": "positive",
            "PublishDate": 1739192673000,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India Reports Mixed Q3 Results",
            "Summary": "Saregama India has released its Q3 financial results, showing a year-over-year increase in EBITDA from 656 million rupees to 848 million rupees. However, the company's EBITDA margin decreased significantly from 32.13% to 17.45% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739173844000,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India Reports Significant Revenue Growth in Q3",
            "Summary": "Saregama India has announced its third-quarter revenue, which stands at 4.8 billion rupees. This represents a substantial increase compared to the same period last year when the revenue was 2.04 billion rupees. The year-over-year growth indicates a strong performance for the company in the latest quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739173718000,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India Reports 19.8% Increase in Q3 Consolidated Net Profit",
            "Summary": "Saregama India has announced its financial results for the third quarter, reporting a consolidated net profit of 623 million rupees. This represents a significant increase from the 520 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth of approximately 19.8%.",
            "Sentiment": "positive",
            "PublishDate": 1739173622000,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India to Consider Q3 Results on February 10",
            "Summary": "Saregama India has announced that it will consider its financial results for the third quarter on February 10. This indicates that the company is preparing to release its earnings report for the latest financial period, which is a standard practice for publicly traded companies.",
            "Sentiment": "neutral",
            "PublishDate": 1738588344000,
            "Source": "earnings"
        },
        {
            "Title": "Saregama India Limited: Court Rules Copyright Ownership of Tamil Song",
            "Summary": "Delhi High Court ruled that Saregama India Limited, not composer Ilaiyaraaja, owns copyright to the Tamil song 'En Iniya Pon Nilave'. The court prohibited Vels Films International from publishing a recreated version without proper authorization. Vels Films can use the song if they deposit ₹30 lakh as a licence fee.",
            "Sentiment": "positive",
            "PublishDate": 1738326788000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Saregama Increases Stake in Pocket Aces Through Rights Issue",
            "Summary": "Saregama has increased its ownership stake in Pocket Aces to 53.51% by subscribing to a rights issue worth 15 crore rupees. This move strengthens Saregama's position in the digital content space.",
            "Sentiment": "positive",
            "PublishDate": 1732587246000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saregama India Launches New Live Events IP 'Yeh Shaam Mastani' with Zeenat Aman",
            "Summary": "Saregama India has introduced a new intellectual property (IP) called 'Yeh Shaam Mastani' in its live events business. The company has partnered with veteran Bollywood actress Zeenat Aman for this initiative, as revealed during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1730950274000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saregama India Anticipates Significant Growth in Subscription Services",
            "Summary": "Saregama India expects substantial growth in its subscription services within the next 12 to 15 months. The company projects a significant increase in subscription growth, with the potential to double its revenue in a few quarters, according to a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1730950208000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saregama India Projects Strong Growth and Profit Doubling",
            "Summary": "Saregama India has announced ambitious growth projections during a conference call. The company expects its revenue, excluding Carvaan, to grow at a Compound Annual Growth Rate (CAGR) of at least 30% over the next three to four years. Additionally, Saregama anticipates its Profit Before Tax (PBT) to double within the same timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1730949999000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saregama India Projects 22% Annual Growth",
            "Summary": "During a conference call, Saregama India announced that the company expects its business to grow by 22% annually, which aligns with their previously stated annual guidance.",
            "Sentiment": "positive",
            "PublishDate": 1730949973000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saregama India Reports Q2 EBITDA and Margin",
            "Summary": "Saregama India announced its Q2 financial results. The company's EBITDA remained relatively stable at 608 million rupees compared to 609 million rupees in the same quarter last year. However, the EBITDA margin decreased significantly from 35.32% to 25.16% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730789005000,
            "Source": "result"
        },
        {
            "Title": "Saregama India Reports Q2 Revenue Growth",
            "Summary": "Saregama India has announced its Q2 revenue, which stands at 2.4 billion rupees, compared to 1.7 billion rupees in the same quarter last year, indicating a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730788966000,
            "Source": "result"
        },
        {
            "Title": "Saregama India Reports Q2 Consolidated Net Profit",
            "Summary": "Saregama India has reported a consolidated net profit of 449 million rupees for the second quarter, compared to 481 million rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1730788941000,
            "Source": "result"
        },
        {
            "Title": "Saregama India Ltd: Stock Continues Downward Trend for Fifth Session",
            "Summary": "<p><span class='negative'>Saregama India Ltd's stock is down 0.23%</span> at Rs 549.2 on NSE, marking its <span class='negative'>fifth consecutive session of decline</span>. The stock has <span class='positive'>gained 5.69% in the last month</span>, <b>outperforming</b> the Nifty Media index which <span class='negative'>eased 3.83%</span> in the same period.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728979500000,
            "Source": "normal_news"
        },
        {
            "Title": "Saregama India: Clarifies Rumors on Dharma Productions Stake",
            "Summary": "<p><span class='neutral'>Saregama India Ltd.</span> issued a <span class='neutral'>clarification</span> regarding reports of acquiring a <b>majority stake</b> in <span class='neutral'>Dharma Productions</span>. The company stated it <span class='neutral'>evaluates</span> various strategic opportunities but currently has <span class='negative'>no material evidence</span> to support the claim. Saregama's stock <span class='positive'>rose 11%</span> intraday following the announcement.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728369640000,
            "Source": "normal_news"
        }
    ]
}