{
    "Symbol": "SARLAPOLY",
    "ISIN": "INE453D01025",
    "News": [
        {
            "Title": "Sarla Performance Fibers seeks shareholder approval",
            "Summary": "Sarla Performance Fibers Limited initiates postal ballot for special resolutions to increase borrowing limits to ₹550 crores and create asset charges, with e-voting from February 12 to March 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770823908084,
            "Source": "stocks"
        },
        {
            "Title": "Sarla Performance Fibers Sells Preference Shares",
            "Summary": "Sarla Performance Fibers Limited board approves sale of 11 preference shares in wholly owned subsidiary Sarla Flex Inc., USA for USD 121,000 to STAR EXIM GENERAL TRADING L.L.C.",
            "Sentiment": "neutral",
            "PublishDate": 1770220278366,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sarla Performance Fibers Q3 Profit Jumps 62%",
            "Summary": "Sarla Performance Fibers reported a 62% increase in Q3 net profit to ₹192 million, though revenue declined 11% to ₹886 million compared to the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1770218315801,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sarla Performance Fibers Faces ₹2.16 Cr Tax Demand",
            "Summary": "Sarla Performance Fibers Limited receives rectification order from income tax department resulting in tax demand of ₹2.16 crores for assessment year 2018-19. Company has filed appeal with ITAT Mumbai.",
            "Sentiment": "negative",
            "PublishDate": 1768310640805,
            "Source": "stocks"
        },
        {
            "Title": "Hindustan Cotton Company Acquires Additional 20,000 Shares in Sarla Performance Fibers",
            "Summary": "Hindustan Cotton Company, through partner Mrs. Sarladevi Madhusudan Jhunjhunwala, acquired 20,000 equity shares (0.024%) of Sarla Performance Fibers through open market transactions on December 08, 2025. Following this acquisition, the promoter group's total shareholding increased to 4,76,10,586 shares representing 57.0167% of the company's equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765280024699,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Cotton Company Acquires Additional 16,975 Shares in Sarla Performance Fibers",
            "Summary": "Hindustan Cotton Company through its partner Mrs. Sarladevi Madhsudan Jhunjhunwala acquired 16,975 equity shares (0.0204%) of Sarla Performance Fibers Limited on December 05, 2025, through open market transactions. Following this acquisition, the promoter group's total holding increased to 4,75,90,586 shares representing 56.9927% of the company's equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1765019839466,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Cotton Company Acquires Additional Shares in Sarla Performance Fibers",
            "Summary": "Hindustan Cotton Company through partner Mrs. Sarladevi Madhusudan Jhunjhunwala acquired 1,557 equity shares (0.0019%) of Sarla Performance Fibers Limited on December 03, 2025, through open market purchase. Following this acquisition, the promoter group's total holding increased to 4,75,71,543 shares representing 56.9699% of the company's equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764836358149,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Cotton Company Acquires Additional 4,880 Shares in Sarla Performance Fibers",
            "Summary": "Hindustan Cotton Company, through partner Mrs. Sarladevi Madhsudan Jhunjhunwala, acquired 4,880 equity shares (0.0058%) of Sarla Performance Fibers Limited on November 27, 2025, through open market purchase. The acquisition increased the promoter group's total shareholding to 4,75,69,986 shares representing 56.9680% of the company's equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764331066000,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Cotton Company Acquires Additional Stake in Sarla Performance Fibers",
            "Summary": "Hindustan Cotton Company through partner Mrs. Sarladevi Madhusudan Jhunjhunwala acquired 5,317 equity shares (0.0064%) of Sarla Performance Fibers Limited on November 26, 2025, through open market transactions. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers, with the company's total equity share capital standing at 8,35,03,000 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764311331572,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarla Performance Fibers Wins Gujarat High Court Case, Rs 41.57 Crore Tax Demand Quashed",
            "Summary": "Sarla Performance Fibers received a favorable judgment from Gujarat High Court that quashed the entire tax and penalty demand of Rs 41.57 crores. The court ruling removes this financial liability from the company's books, providing relief from the regulatory demand.",
            "Sentiment": "positive",
            "PublishDate": 1764288412258,
            "Source": "stock"
        },
        {
            "Title": "Hindustan Cotton Company Acquires Additional Stake in Sarla Performance Fibers",
            "Summary": "Hindustan Cotton Company through its partner Mrs. Sarladevi Madhusudhan Jhunjhunwala acquired 2,991 equity shares (0.0036%) of Sarla Performance Fibers Limited through open market transactions on November 21, 2025. The acquisition increased the promoter group's total shareholding to 4,75,44,187 shares representing 56.9371% of the company's equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763970662413,
            "Source": "corporate_action"
        },
        {
            "Title": "Satidham Industries Acquires Additional Stake in Sarla Performance Fibers",
            "Summary": "Satidham Industries Private Limited acquired 4,000 additional equity shares (0.0012%) of Sarla Performance Fibers Limited on November 19, 2025, through open market transactions. The acquisition increases Satidham's total holding to 47,54,046 shares representing 56.9395% of the company's equity share capital of 8,35,03,000 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1763634126769,
            "Source": "corporate_action"
        },
        {
            "Title": "Hindustan Cotton Company Acquires Additional Shares in Sarla Performance Fibers",
            "Summary": "Hindustan Cotton Company, through partner Mrs. Sarladevi Madhusudan Jhunjhunwala, acquired 1,000 additional equity shares (0.0012%) of Sarla Performance Fibers Limited on November 19, 2025, through open market purchase. The acquisition was disclosed under SEBI regulations, with the promoter group maintaining their shareholding position in the textile company.",
            "Sentiment": "neutral",
            "PublishDate": 1763633140482,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarla Performance Fibers Appoints Mustafa Manasawala as Company Secretary and Compliance Officer",
            "Summary": "Sarla Performance Fibers Limited's Board of Directors approved the appointment of CS Mustafa Manasawala (ACS: 76344) as Company Secretary and Compliance Officer effective November 11, 2025. The appointment was made on the recommendation of the Nomination and Remuneration Committee. Manasawala is a qualified Company Secretary with over 4 years of experience in corporate law compliance, SEBI regulations, and governance for listed and unlisted entities. He has expertise in SEBI LODR filings, Companies Act requirements, and corporate actions including buybacks, rights issues, and mergers. He is currently pursuing an LLB and holds a B.Com degree from Mumbai University. The company confirmed that Manasawala has no relationship with the promoters or directors of the company.",
            "Sentiment": "positive",
            "PublishDate": 1762855355877,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sarla Performance Fibers Reports Mixed Q2 Results with Margin Improvement",
            "Summary": "Sarla Performance Fibers reported Q2 consolidated net profit of Rs 189.6 million, down from Rs 192 million in the same quarter last year. However, the company's EBITDA increased to Rs 230.3 million from Rs 221 million year-over-year. EBITDA margin improved to 21.50% compared to 19.44% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762853523467,
            "Source": "earnings"
        },
        {
            "Title": "Sarla Performance Fibers Reconstitutes Audit Committee with New Member Appointment",
            "Summary": "Sarla Performance Fibers Limited has reconstituted its Audit Committee by appointing Mr. Paulo Manuel Castro Ferreira Moura as a new member. The Board of Directors approved this change through a circular resolution passed on October 25, 2025, with the appointment taking immediate effect. The reconstituted Audit Committee now consists of four members: Mr. Sachin Shashikant Abhyankar as Chairperson, Mr. Krishna Madhusudan Jhunjhunwala as Managing Director member, Mr. Bharat Kishore Jhamvar as member, and the newly appointed Mr. Paulo Manuel Castro Ferreira Moura as member. All members except the Managing Director hold Non-Executive Independent Director positions.",
            "Sentiment": "neutral",
            "PublishDate": 1761564682126,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sarla Performance Fibers Discloses Substantial Share Acquisition by Satidham Industries",
            "Summary": "Sarla Performance Fibers Limited has submitted a disclosure regarding substantial acquisition of shares by Satidham Industries Private Limited. The disclosure was made under SEBI regulations and was received from Satidham Industries via a letter dated September 26, 2025. Managing Director Krishna Jhunjhunwala communicated this information to BSE Limited and National Stock Exchange of India Limited for their records.",
            "Sentiment": "neutral",
            "PublishDate": 1758949796267,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarla Performance Fibers Receives Substantial Acquisition Disclosure from Hindustan Cotton Company",
            "Summary": "Sarla Performance Fibers Limited disclosed receiving a substantial acquisition of shares notification from Hindustan Cotton Company through its partner Sarladevi Madhusudan Jhunjhunwala. The disclosure was made under SEBI regulations governing substantial acquisition of shares and takeovers. Krishna Jhunjhunwala, Director of Sarla Performance Fibers Limited, communicated this information to BSE Limited and National Stock Exchange of India Limited for their records.",
            "Sentiment": "neutral",
            "PublishDate": 1758861088494,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarla Performance Fibers Discloses Substantial Share Acquisition by Hindustan Cotton Company",
            "Summary": "Sarla Performance Fibers Limited submitted a disclosure regarding substantial acquisition of shares by Hindustan Cotton Company through its partner Mrs. Sarladevi Madhusudan Jhunjhunwala. The disclosure was made under SEBI regulations and communicated to BSE Limited and National Stock Exchange of India Limited on September 24, 2025. The company trades under scrip code 526885 and symbol SARLAPOLY. Director Krishnakumar Jhunjhunwala signed the disclosure letter on behalf of Sarla Performance Fibers Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758715570980,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarla Performance Fibers Discloses Substantial Share Acquisition by Hindustan Cotton Company",
            "Summary": "Sarla Performance Fibers Limited disclosed a substantial acquisition of shares by Hindustan Cotton Company through its partner Mrs. Sarladevi Madhusudan Jhunjhunwala. The disclosure was made under SEBI regulations regarding substantial acquisition of shares and takeovers. Director Krishnakumar Jhunjhunwala communicated this information to BSE Limited and National Stock Exchange of India Limited on September 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757923054347,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarla Performance Fibers' Company Secretary Kapil Raj Yadav Resigns to Pursue New Career Opportunities",
            "Summary": "Kapil Raj Yadav has resigned from his position as Company Secretary and Compliance Officer of Sarla Performance Fibers Limited, effective from the close of business hours on September 4, 2025. He cited personal and professional reasons for his departure, stating his intention to explore a new career path aligned with his evolving interests and aspirations. The company has accepted his resignation and confirmed there are no other material reasons beyond those stated in his resignation letter. Yadav will cease to be a Key Managerial Personnel of the company following his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1757054200925,
            "Source": "corporate_governance"
        },
        {
            "Title": "Satidham Industries Acquires Additional 3,000 Shares in Sarla Performance Fibers",
            "Summary": "Satidham Industries Private Limited acquired 3,000 equity shares (0.0036%) of Sarla Performance Fibers Limited on September 2, 2025, through open market transactions. Following this acquisition, Satidham Industries' total shareholding in Sarla Performance Fibers increased from 4,75,09,166 shares (56.8951%) to 4,75,12,166 shares (56.8987%). Satidham Industries is part of the promoter group of Sarla Performance Fibers. The company disclosed this transaction under SEBI regulations for substantial acquisition of shares and takeovers. Sarla Performance Fibers has an equity share capital of 8,35,03,000 shares and is listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1756975011771,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarla Performance Fibers Challenges ₹41.57 Crore GST Demand in Gujarat High Court",
            "Summary": "Sarla Performance Fibers Limited has filed a Special Civil Application in the High Court of Gujarat against a GST order from the Additional Commissioner, Central GST & Central Excise, Surat Commissionerate. The order alleges the company availed undue IGST refund of ₹9.45 crore on exports while importing inputs duty-free and claimed refund of unutilized Input Tax Credit of ₹11.34 crore on exports without payment of tax. The total demand includes tax of ₹20.79 crore, applicable interest under Section 50 of the CGST Act, and penalty of ₹20.79 crore under Section 74(1). The company believes it has adequate factual and legal grounds to substantiate its position and anticipates the entire demand will be set aside, expecting no impact on its financial position or operations.",
            "Sentiment": "negative",
            "PublishDate": 1756209349713,
            "Source": "stock"
        },
        {
            "Title": "Sarla Performance Fibers Reports Strong Q1 Results with Revenue at ₹10,165 Crores",
            "Summary": "Sarla Performance Fibers Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹10,165.20 crores compared to ₹11,053.68 crores in the same quarter last year. Profit after tax stood at ₹2,266.32 crores versus ₹1,683.06 crores in the previous year quarter. The company operates in two business segments - Yarn and Wind Power, with Yarn contributing ₹9,977.28 crores and Wind Power contributing ₹220 crores to quarterly revenue. The company recognized an exchange loss of ₹1,127.82 crores during the quarter related to foreign currency exposures. Earnings per share for the quarter was ₹2.71 compared to ₹2.02 in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753864372697,
            "Source": "earnings"
        },
        {
            "Title": "Sarla Performance Reports Q3 Financial Results",
            "Summary": "Sarla Performance has announced its Q3 financial results. The company reported a net profit of 118.5 million rupees, showing an increase from 90 million rupees year-over-year and 150 million rupees quarter-over-quarter. Revenue for Q3 stood at 999.3 million rupees, up from 959 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738284215000,
            "Source": "earnings"
        },
        {
            "Title": "SARLA Performance Fibers Reports Strong Q3 EBITDA Growth",
            "Summary": "SARLA Performance Fibers has reported significant year-over-year improvements in its third-quarter financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 240 million rupees, up from 138 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 24%, compared to 14.35% in the year-ago period, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738250004000,
            "Source": "earnings"
        },
        {
            "Title": "SARLA PERFORMANCE Reports Q3 Revenue Growth",
            "Summary": "SARLA PERFORMANCE has reported a revenue of 999.3 million rupees for the third quarter, compared to 959 million rupees in the same period last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738249997000,
            "Source": "earnings"
        },
        {
            "Title": "Sarla Performance Fibers Reports Increased Q3 Net Profit",
            "Summary": "Sarla Performance Fibers has reported a net profit of 118.5 million rupees for the third quarter, showing an increase from 90 million rupees year-over-year and 150 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738249989000,
            "Source": "earnings"
        },
        {
            "Title": "Sarla Performance Fibers Reports Strong Q2 EBITDA Growth",
            "Summary": "Sarla Performance Fibers has announced its Q2 financial results, showing significant improvement in EBITDA and EBITDA margin compared to the same period last year. The company's EBITDA increased from 134 million rupees to 221 million rupees year-over-year. Additionally, the EBITDA margin expanded from 13.99% to 19.44% in the same period.",
            "Sentiment": "positive",
            "PublishDate": 1730116988000,
            "Source": "result"
        },
        {
            "Title": "SARLA PERFORMANCE FIBERS Reports Strong Q2 Financial Results",
            "Summary": "SARLA PERFORMANCE FIBERS has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter improvements. The company's consolidated net profit increased to 192 million rupees, up from 65 million rupees in the same quarter last year and 167 million rupees in the previous quarter. Revenue also saw growth, reaching 1.13 billion rupees compared to 958 million rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1730116824000,
            "Source": "result"
        }
    ]
}