{
    "Symbol": "SARTELE",
    "ISIN": "INE0PUC01020",
    "News": [
        {
            "Title": "Sar Televenture Approves Share Swap Deal to Acquire Majority Stake in Tikona Infinet",
            "Summary": "Sar Televenture's board has approved a share swap deal to acquire a majority stake in Tikona Infinet for ₹578 crore. This strategic move aims to strengthen the company's enterprise and broadband services offerings.",
            "Sentiment": "positive",
            "PublishDate": 1743639175000,
            "Source": "corporate_action"
        },
        {
            "Title": "SAR Televenture Approves Share Swap Deal to Acquire Majority Stake in Tikona Infinet",
            "Summary": "SAR Televenture's board has approved a share swap deal to acquire a majority stake in Tikona Infinet for ₹578 crore. This strategic move aims to strengthen the company's enterprise and broadband services offerings.",
            "Sentiment": "positive",
            "PublishDate": 1743595988000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sar Televenture Signs Agreement with Vodafone Idea for Infrastructure Development",
            "Summary": "Sar Televenture has entered into an agreement with Vodafone Idea to identify and acquire locations for establishing sites and installing passive infrastructure. The scope of the agreement includes erecting towers and deploying resources using HSW (Health, Safety, and Welfare) norms.",
            "Sentiment": "positive",
            "PublishDate": 1740702207000,
            "Source": "corporate_action"
        },
        {
            "Title": "SAR Televenture Enters Agreement with Vodafone Idea for Infrastructure Deployment",
            "Summary": "SAR Televenture has signed an agreement with Vodafone Idea to identify and acquire locations for establishing sites, install passive infrastructure, erect towers, and deploy resources using HSW (Health, Safety, and Welfare) norms.",
            "Sentiment": "positive",
            "PublishDate": 1740662111000,
            "Source": "corporate_action"
        }
    ]
}