{
    "Symbol": "SARVESHWAR",
    "ISIN": "INE324X01026",
    "News": [
        {
            "Title": "Sarveshwar Foods postal ballot results announced",
            "Summary": "Sarveshwar Foods Limited successfully passed two key resolutions through postal ballot on February 6, 2026, including regularisation of appointments for executive and independent director positions.",
            "Sentiment": "positive",
            "PublishDate": 1770622524051,
            "Source": "stocks"
        },
        {
            "Title": "Sarveshwar Foods Board Meet on Feb 14 for Q3FY26 Results",
            "Summary": "Sarveshwar Foods Limited has scheduled its Board meeting for February 14, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closure effective from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770383773520,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sarveshwar Foods forfeits ₹23.77 crore from lapsed warrants",
            "Summary": "Sarveshwar Foods Limited forfeited ₹23.77 crore upfront payment after 9.81 crore warrants lapsed on January 25, 2026, as holders failed to exercise conversion option within 18-month period.",
            "Sentiment": "neutral",
            "PublishDate": 1769313211017,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sarveshwar Foods Allots 2 Lakh Equity Shares",
            "Summary": "Sarveshwar Foods Limited allotted 2,00,000 equity shares at ₹9.70 per share upon warrant conversion, raising ₹14.55 lakh and increasing paid-up capital to ₹122.89 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768985929009,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sarveshwar Foods Signs ₹197.29 Cr Basmati Rice MoU",
            "Summary": "Sarveshwar Foods Limited entered into MoU with JKH PMC for development of Basmati Rice Clusters in Jammu region under HADP worth ₹197.29 crores to transform basmati value chain in J&K.",
            "Sentiment": "positive",
            "PublishDate": 1768913183487,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sarveshwar Foods CFO Anand Sharda Resigns",
            "Summary": "Sarveshwar Foods Limited announces resignation of Chief Financial Officer Mr. Anand Sharda effective January 16, 2026, citing better opportunities as the reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768567991886,
            "Source": "stocks"
        },
        {
            "Title": "Sarveshwar Foods postal ballot for director appointments",
            "Summary": "Sarveshwar Foods Limited announces postal ballot notice for regularisation of two director appointments with e-voting scheduled from January 8 to February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767784775506,
            "Source": "stocks"
        },
        {
            "Title": "Sarveshwar Foods Appoints Gagandeep Singh Tuteja as Independent Director",
            "Summary": "Sarveshwar Foods Limited has appointed Mr. Gagandeep Singh Tuteja as Additional Director (Non-Executive & Independent) for a five-year term starting January 1, 2026, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1767173392226,
            "Source": "stocks"
        },
        {
            "Title": "Sarveshwar Foods Gets ₹197.29 Cr Basmati Project Nod",
            "Summary": "Sarveshwar Foods Limited receives government approval for a ₹197.29 crore basmati rice cluster development project in Jammu & Kashmir, marking a significant expansion in the region.",
            "Sentiment": "positive",
            "PublishDate": 1765891663056,
            "Source": "stocks"
        },
        {
            "Title": "Sarveshwar Foods Acquires 100% Stake in Himalayan Ancient",
            "Summary": "Sarveshwar Foods Limited's board approved the acquisition of 100% equity stake in Himalayan Ancient Foods Private Limited for ₹1.00 lakh, making it a wholly owned subsidiary to serve as SPV for HADP project.",
            "Sentiment": "positive",
            "PublishDate": 1765886181448,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sarveshwar Foods Appoints New Executive Director and Internal Auditor, Reports Quarterly Results",
            "Summary": "Sarveshwar Foods Limited's Board of Directors approved the appointment of Mr. Harbanslal as Additional Executive Director for a five-year term, subject to shareholder approval. The company also appointed M/S MSGK Associates as Internal Auditor for Financial Year 2025-2026. The Board reviewed and approved unaudited financial results for the quarter and half-year ended September 30, 2025, along with a monitoring agency report for the rights issue allotment made on September 17, 2025. The company confirmed no deviation in the use of funds raised through the rights issue, having received Rs. 149.63 crores with Rs. 8.81 crores utilized during the quarter for working capital and general corporate purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1762826219047,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Reports Mixed Q2 Results with Revenue Growth but Lower Margins",
            "Summary": "Sarveshwar Foods reported quarterly consolidated net profit of 83 million rupees compared to 81 million rupees in the same period last year. Revenue increased to 3.35 billion rupees from 2.71 billion rupees year-over-year. However, EBITDA declined to 173.7 million rupees from 208.5 million rupees, while EBITDA margin compressed to 5.19% from 7.68% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762793392965,
            "Source": "earnings"
        },
        {
            "Title": "Sarveshwar Foods Signs Agreement to Procure 500 MT of Kashmir's Mushkbudji Rice Worth ₹7.5 Crores",
            "Summary": "Sarveshwar Foods has signed an agreement with a Jammu & Kashmir-based Farmer Producer Organization (FPO) and IREF to enhance procurement of Kashmir's aromatic Mushkbudji Rice. The company aims to procure 500 metric tons of the rice valued at ₹7.5 crores for nationwide distribution.",
            "Sentiment": "positive",
            "PublishDate": 1762752441473,
            "Source": "stock"
        },
        {
            "Title": "Sarveshwar Foods Subsidiary Secures $19.8 Million Rice Export Agreement",
            "Summary": "Sarveshwar Foods announced that its subsidiary Green Point Pte. Ltd has entered into an agreement worth $19.8 million for rice exports with the Indian Rice Exporters Federation. The deal represents a significant export contract for the food company's international operations.",
            "Sentiment": "positive",
            "PublishDate": 1762266374869,
            "Source": "order&deals"
        },
        {
            "Title": "Sarveshwar Foods Organizes Basmati Export Promotion Programme to Strengthen Farmer-Market Linkages",
            "Summary": "Sarveshwar Foods Limited organized a 'Basmati export promotion programme' at SIDCO Industrial Area, Samba, bringing together Farmer Producer Organizations (FPOs), basmati producers, and traders. The initiative aimed to facilitate direct market access and better price realization for farmers through collective marketing by FPOs. The programme emphasized adoption of sustainable and residue-free cultivation practices to meet international export standards. Chairman Rohit Gupta highlighted the company's commitment to building a transparent and sustainable ecosystem by linking FPOs directly with producers and traders. Dr. Gayatri Tandon discussed strategies for strengthening market linkages, enhancing quality certification and branding, and integrating modern processing and packaging technologies. The event saw participation from farmers, FPOs, cooperatives, traders, and senior management. Managing Director Anil Sharma extended thanks to all participants for their contribution to the initiative.",
            "Sentiment": "positive",
            "PublishDate": 1761561770292,
            "Source": "stock"
        },
        {
            "Title": "Sarveshwar Foods Secures ₹266 Million Export Deal, Total Export Orders Reach ₹1,226 Million",
            "Summary": "Sarveshwar Foods has secured a ₹266 million export deal with Delaware USA's Agri Services & Trade LLP. The company's total export orders have reached ₹1,226 million over a two-month period. The company has confirmed rising global demand for quality products.",
            "Sentiment": "positive",
            "PublishDate": 1759729320445,
            "Source": "stock"
        },
        {
            "Title": "Sarveshwar Foods Secures ₹329 Million Export Order from Singapore-Based Monarda Commodities",
            "Summary": "Sarveshwar Foods Limited announced securing a ₹329 million export order from Singapore-based Monarda Commodities Pte. Ltd through its wholly owned subsidiary Green Point Pte. Ltd, Singapore. The agro and organic FMCG company, which has over 130 years of heritage, holds international certifications including ISO 22000:2018, USFDA, BRC, Kosher, NPPO USA & China, and NOP-USDA Organic. This order follows recently secured ₹329 million international contracts and completion of an oversubscribed ₹1,499.5 million Rights Issue. Director of International Business Seema Rani stated the order strengthens their international business and reflects global partners' confidence in their quality and reliability. The company manufactures, trades, processes and markets branded and un-branded basmati and non-basmati rice domestically and internationally, operating from Jammu and Kashmir and Gujarat regions.",
            "Sentiment": "positive",
            "PublishDate": 1758512516987,
            "Source": "order&deals"
        },
        {
            "Title": "Sarveshwar Foods Limited Announces Rights Issue of 24.99 Crore Equity Shares at ₹6 Per Share",
            "Summary": "Sarveshwar Foods Limited has announced a rights issue of up to 24,99,10,469 equity shares at ₹6 per share, including a premium of ₹5 per equity share. The issue is being offered to existing shareholders in the ratio of 12 rights equity shares for every 47 shares held. The record date for the rights issue was August 22, 2025. The company has published the post-issue advertisement dated September 17, 2025, in multiple newspapers including Financial Express, Janasatta, Daily Taskeen, and Daily Roshni across English, Hindi, and Urdu editions. The advertisement provides details about subscription, basis of allotment, and other procedural information related to the rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1758281664807,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Promoter Rohit Gupta's Shareholding Drops to 40.93% Following Rights Issue",
            "Summary": "Rohit Gupta, a promoter of Sarveshwar Foods Limited, disclosed changes in his shareholding following the company's rights issue completed on September 17, 2025. While Gupta's absolute shareholding remained unchanged at 50,30,37,872 shares, his percentage holding decreased from 51.39% to 40.93% due to dilution from the rights issue. The company's total equity share capital increased from 97,88,16,000 shares to 1,22,87,26,469 shares. Gupta did not acquire or sell any shares during this transaction, with the shareholding change occurring solely due to the issuance of new shares to other shareholders through the rights offering.",
            "Sentiment": "neutral",
            "PublishDate": 1758280004947,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Raises Rs. 149.95 Crores Through Oversubscribed Rights Issue",
            "Summary": "Sarveshwar Foods Limited successfully completed its rights issue of 24,99,10,469 equity shares, raising Rs. 149.95 crores at Rs. 6 per share. The issue was oversubscribed by 1.35 times, receiving subscriptions for 33,85,67,058 shares. The rights issue was offered in a 12:47 ratio to eligible shareholders and closed on September 16, 2025. The company will use the funds to augment working capital requirements and for general corporate purposes. Allotment and listing formalities on BSE and NSE are expected to be completed by September 17 and September 19, 2025 respectively. Sarveshwar Foods is engaged in manufacturing, trading, processing, and marketing of basmati and non-basmati rice in domestic and international markets, with operations in Jammu & Kashmir and Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1758092475190,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Secures INR 631 Million Export Order from Singapore-Based Swan International",
            "Summary": "Sarveshwar Foods Limited and its subsidiary Sarveshwar Overseas Ltd. have secured four major export contracts worth INR 631 million from Singapore-based Swan International Pte Ltd for the supply of premium Indian parboiled rice. Swan International is described as an agriculture supply chain company engaged in storage warehousing, processing, and transportation of agricultural produce. Mrs. Seema Rani, Director of International Business at Sarveshwar Foods, stated that securing export orders of this scale validates the company's global competitiveness, supply chain strength, and quality standards, accelerating growth in high-margin export markets. Sarveshwar Foods is an FMCG company specializing in basmati rice from the Himalayas, with operations in Jammu & Kashmir and Gujarat, and holds various certifications including ISO 22000:2018 and USFDA.",
            "Sentiment": "positive",
            "PublishDate": 1757907332586,
            "Source": "order&deals"
        },
        {
            "Title": "Sarveshwar Foods Incorporates Wholly Owned Subsidiary in Delaware, USA",
            "Summary": "Sarveshwar Foods Limited has incorporated a new wholly owned subsidiary named Himalayan Organic Foods INC. in Delaware, USA, with an initial capital of $2,000. The subsidiary will engage in trading, sourcing, and distribution of high-quality agricultural products. The company aims to strengthen its presence in international markets and meet growing demand for basmati rice and organic food products across diverse geographies. The subsidiary's registered office is located at 8 The Green, Ste A, Dover, Kent, Delaware. The incorporation was completed on September 02, 2025, as part of the company's long-term vision to expand distribution networks, enhance brand visibility, and leverage business opportunities in developed and emerging economies.",
            "Sentiment": "positive",
            "PublishDate": 1756994143005,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Partners with German Firm for Advanced Rice Processing Technology",
            "Summary": "Sarveshwar Foods has signed an agreement with Germany's FoodTech Solutions GmbH for technology transfer in advanced rice processing. The partnership focuses on shelf-life extension and flavor improvement technologies.",
            "Sentiment": "positive",
            "PublishDate": 1756870726421,
            "Source": "order&deals"
        },
        {
            "Title": "Sarveshwar Foods Announces ₹149.95 Crore Rights Issue at ₹6 Per Share",
            "Summary": "Sarveshwar Foods has announced a rights issue worth ₹149.95 crore. The company will issue 24.99 crore equity shares at a price of ₹6 per share through this rights offering.",
            "Sentiment": "neutral",
            "PublishDate": 1756724608385,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Limited Announces Rights Issue of Up to ₹14,994.63 Lakhs",
            "Summary": "Sarveshwar Foods Limited announced a rights issue of up to 24,99,10,469 equity shares at ₹6 per share, with a face value of ₹1 each and share premium of ₹5 per share. The issue aggregates up to ₹14,994.63 lakhs assuming full subscription. Existing shareholders can subscribe in the ratio of 12 rights equity shares for every 47 fully paid-up equity shares held as of the record date of August 22, 2025. The company published a pre-issue advertisement on August 27, 2025, in Financial Express (English), Janasatta (Hindi), and Daily Roshini (Urdu) newspapers, disclosing the completion of dispatch of offer documents and subscription procedures.",
            "Sentiment": "neutral",
            "PublishDate": 1756292646252,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Reports Strong Q1 Performance with 29% Revenue Growth and 120% Net Profit Jump",
            "Summary": "Sarveshwar Foods Limited reported total income of Rs. 301 crores for Q1 FY2026, marking 29% year-over-year growth. The company's EBITDA reached Rs. 17.13 crores with 36% growth and improved margins to 5.56%. Net profit surged 120% to Rs. 7.02 crores. The food company, which specializes in rice and organic products through its Sarveshwar and Nimbark brands, derives 85% revenue from domestic markets and 15% from exports. Organic products contribute approximately 25% of total revenue at Rs. 70 crores. The company operates 15 retail stores across 10 Indian states and plans to target 25-30% export growth, potentially reaching up to 50%. Management aims to increase exports from the current 15% to 25-50% of total revenue and expand the Nimbark brand globally. The company is planning a Rs. 150 crore rights issue primarily for working capital needs, which currently operates on a 170-180 day cycle.",
            "Sentiment": "positive",
            "PublishDate": 1756290804898,
            "Source": "earnings"
        },
        {
            "Title": "Sarveshwar Foods Announces ISIN Allocation for Rights Issue Entitlements",
            "Summary": "Sarveshwar Foods Limited has announced the allocation of International Securities Identification Number (ISIN) INE324X20018 for rights entitlements related to an upcoming rights issue. The company has made arrangements with NSDL and CDSL to credit the rights entitlements in dematerialized form to eligible equity shareholders' demat accounts. The rights entitlements for eligible equity shareholders as on record date will be credited prior to the issue opening date under the allocated ISIN.",
            "Sentiment": "neutral",
            "PublishDate": 1755603605864,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Approves Rs. 149.95 Crore Rights Issue at 12:47 Ratio",
            "Summary": "Sarveshwar Foods Limited's Rights Issue Committee approved terms for raising Rs. 149.95 crores through a rights issue. The company will issue 24,99,10,469 fully paid-up equity shares with a face value of Re. 1 each at Rs. 6 per share, including a premium of Rs. 5. Existing shareholders will receive rights entitlement at a ratio of 12 shares for every 47 shares held. The record date is set for August 22, 2025. The company's outstanding equity shares will increase from 97,88,16,000 to 1,22,87,26,469 shares assuming full subscription. BSE and NSE provided in-principle approvals for the rights issue.",
            "Sentiment": "positive",
            "PublishDate": 1755532203408,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Approves Rs 150 Crore Rights Issue and Appoints New CFO",
            "Summary": "Sarveshwar Foods Limited's Board of Directors approved a rights issue to raise up to Rs 150 crore through fully paid-up equity shares with a face value of Re 1 each. The rights issue will be offered to eligible equity shareholders as on a record date to be determined later. The Board also appointed Anand Sharda as Chief Financial Officer effective August 11, 2025. Sharda is a Chartered Accountant with 19 years of experience in accounting and financial management, having previously worked with Parag Milkfoods Limited, RBL Bank Limited, DCB Bank Limited, and Publicis Groupe. The Board constituted a Rights Issue Committee to determine the terms including quantum, entitlement ratio, issue price, and timing. The company also approved its unaudited financial results for the quarter ended June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755091889424,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Approves Rs 150 Crore Rights Issue and Appoints New CFO",
            "Summary": "Sarveshwar Foods Limited's Board approved a rights issue to raise up to Rs 150 crore through fully paid-up equity shares with face value of Re 1 each. The company also appointed CA Anand Sharda as Chief Financial Officer, effective August 11, 2025. Sharda brings 19 years of experience in accounting and financial management, having worked with companies including Parag Milkfoods Limited, RBL Bank Limited, and DCB Bank Limited. The Board constituted a Rights Issue Committee to determine terms including issue price, entitlement ratio, and record date. Additionally, the company approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue from operations of Rs 14,807.72 lakhs and consolidated revenue of Rs 30,134.89 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1754904389613,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Reports Strong Q1 Growth with Net Profit Rising to 70M Rupees",
            "Summary": "Sarveshwar Foods reported consolidated net profit of 70 million rupees in Q1, compared to 31 million rupees in the same period last year. The company's revenue increased to 3 billion rupees from 2.33 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754903736933,
            "Source": "earnings"
        },
        {
            "Title": "Sarveshwar Foods CFO and COO Vishal Narchal Resigns Due to Health Reasons",
            "Summary": "Sarveshwar Foods Limited announced the resignation of Vishal Narchal from his positions as Chief Financial Officer, Chief Operating Officer, and Key Managerial Personnel, effective August 05, 2025. The resignation is attributed to personal and health reasons. In his resignation letter, Narchal cited ongoing health concerns that require his full attention and care. He expressed gratitude for his tenure with the company and committed to ensuring a smooth transition of responsibilities to minimize disruption to finance functions and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754417051236,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sarveshwar Foods Reports Q4 Financial Results",
            "Summary": "Sarveshwar Foods has announced its Q4 financial results. The company's EBITDA increased to 168 million rupees from 142 million rupees year-over-year. However, the EBITDA margin decreased to 4.79% from 5.74% in the same period. The consolidated net profit rose to 88 million rupees from 41 million rupees year-over-year. Revenue for Q4 grew to 3.5 billion rupees from 2.47 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748676239000,
            "Source": "result"
        },
        {
            "Title": "Sarveshwar Foods: Credit Rating Upgrade Boosts Penny Stock",
            "Summary": "Sarveshwar Foods received a credit rating upgrade from Infomerics Valuation and Rating for its Long-Term and Short-Term Bank Facilities. The company's stock rose 5.1% following the news. In December 2024, the company secured a major export order for Basmati rice worth ₹498 million from a U.S. distributor.",
            "Sentiment": "positive",
            "PublishDate": 1738735675000,
            "Source": "normal_news"
        },
        {
            "Title": "Sarveshwar Foods: FMCG Penny Stock Surges 12% Intraday",
            "Summary": "Sarveshwar Foods, an FMCG penny stock priced below ₹20, saw a 12.4% intraday surge on December 11, reaching ₹11.85. The stock has delivered over 150% return in the last year.",
            "Sentiment": "positive",
            "PublishDate": 1733904094000,
            "Source": "normal_news"
        },
        {
            "Title": "Sarveshwar Foods Launches Soil Mapping Initiative for Sustainable Agriculture",
            "Summary": "Sarveshwar Foods has initiated a groundbreaking soil mapping project aimed at promoting sustainable agriculture. The company will provide farmers with Soil Health Cards, empowering them with detailed information about their soil's condition. This initiative is expected to help farmers make informed decisions about crop selection, fertilizer use, and overall land management, potentially leading to improved crop yields and more sustainable farming practices.",
            "Sentiment": "positive",
            "PublishDate": 1733801495000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Secures Major Basmati Rice Export Order",
            "Summary": "Sarveshwar Foods has obtained an export order for 5,350 metric tons of basmati rice from I SIFOL LLC, USA. The order is valued at approximately 498 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1733456054000,
            "Source": "order&deals"
        },
        {
            "Title": "Sarveshwar Foods Limited: Set to Complete Dubai Subsidiary Acquisition by 2024",
            "Summary": "Sarveshwar Foods Limited announces plans to fully acquire Natural Global Foods DMCC, its Dubai-based subsidiary, by December 31, 2024. This strategic move aims to strengthen the company's presence in the Middle East market for rice and rice-based products.",
            "Sentiment": "positive",
            "PublishDate": 1732865959000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarveshwar Foods Subsidiary Secures Major Rice Export Order",
            "Summary": "A subsidiary of Sarveshwar Foods has secured an order for 12,000 metric tons of Indian long grain parboiled rice. The total value of this order is approximately 445 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732666650000,
            "Source": "order&deals"
        },
        {
            "Title": "Sarveshwar Foods Subsidiary Secures Major Rice Export Order",
            "Summary": "A subsidiary of Sarveshwar Foods has secured an order for 12,000 metric tons of Indian long grain parboiled rice. The total value of this order is approximately 445 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1732620363000,
            "Source": "order&deals"
        },
        {
            "Title": "Sarveshwar Foods: Q2 Profit Soars 68.53%, Acquires Dubai Subsidiary",
            "Summary": "Sarveshwar Foods reported a 68.53% increase in Q2 net profit to Rs 8.14 crore. Sales rose 32.20% to Rs 271.31 crore. The company plans to acquire the remaining stake in Natural Global Foods DMCC, Dubai, to make it a wholly-owned subsidiary. The board approved a preferential issue of 10,20,00,000 fully convertible warrants at Rs 9.70 each.",
            "Sentiment": "positive",
            "PublishDate": 1729333877000,
            "Source": "result"
        },
        {
            "Title": "Sarveshwar Foods Reports Improved Q2 Financial Performance",
            "Summary": "Sarveshwar Foods has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 208 million rupees from 141 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 7.68% from 6.86% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1729264217000,
            "Source": "result"
        },
        {
            "Title": "Sarveshwar Foods Reports Q2 Revenue Growth",
            "Summary": "Sarveshwar Foods has announced its second quarter revenue results. The company reported revenue of 2.71 billion rupees, compared to 2.05 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729264205000,
            "Source": "result"
        },
        {
            "Title": "Sarveshwar Foods Reports Q2 Profit Increase",
            "Summary": "Sarveshwar Foods announced its Q2 consolidated net profit of 81 million rupees, showing a significant increase from 48 million rupees year-over-year and 31 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1729264195000,
            "Source": "result"
        },
        {
            "Title": "Sarveshwar Foods: Penny Stock Surges on Strong H1FY25 Sales",
            "Summary": "<p>Sarveshwar Foods reported over <span class=\"positive\">₹500 crores</span> in sales for H1FY25, driven by <span class=\"positive\">popularity</span> of <b>organic products</b>. The stock <span class=\"positive\">recovered 7.5%</span> from day's low, reaching ₹10.35. The company aims for <span class=\"positive\">25% CAGR growth</span>, focusing on <b>organic offerings</b> and adapting to <span class=\"positive\">health-conscious</span> consumer trends.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728020593000,
            "Source": "normal_news"
        },
        {
            "Title": "Sarveshwar Foods Reports Profit Growth from Organic Products",
            "Summary": "<p><span class=\"positive\">Sarveshwar Foods</span> is experiencing an <span class=\"positive\">increase in profits</span>, attributed to the company's focus on delivering <b>high-quality organic food products</b>. This <span class=\"positive\">growth</span> indicates a <span class=\"positive\">successful business strategy</span> centered around <b>organic offerings</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727949661000,
            "Source": "normal_news"
        },
        {
            "Title": "Sarveshwar Foods Achieves Record Sales in Half-Year",
            "Summary": "<p>Sarveshwar Foods has reported reaching <span class=\"positive\">sales of 500 crore rupees</span> for the <b>first time</b> in a half fiscal year period. This milestone represents a <span class=\"positive\">significant achievement</span> for the company's <span class=\"positive\">financial performance</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727949568000,
            "Source": "result"
        }
    ]
}