{
    "Symbol": "SASKEN",
    "ISIN": "INE231F01020",
    "News": [
        {
            "Title": "Sasken Technologies Receives IT Order with ₹1.45L Demand",
            "Summary": "Sasken Technologies received an Income Tax order from CPC regarding its superannuation fund trust for AY 2025-26, creating a tax demand of ₹1,45,100. Company states no material impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1770392619888,
            "Source": "stocks"
        },
        {
            "Title": "Sasken Allots 43,670 Shares Under RSU Plan",
            "Summary": "Sasken Technologies allotted 43,670 equity shares to employees under its 2016 RSU plan on February 2, 2026, increasing total issued shares to 15,186,471 with share capital of Rs. 151,864,710.",
            "Sentiment": "neutral",
            "PublishDate": 1770049579896,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sasken Technologies Faces Rs 45.29 Crore GST Demand After Appeal Dismissal",
            "Summary": "Sasken Technologies received orders from Joint Commissioner Appeals-5 dismissing its appeals for FY2017-18 and FY2018-19, confirming total GST demands of Rs 20.75 crore and Rs 24.53 crore respectively for alleged violations related to reverse charge on overseas branch payments. The company states no material financial or operational impact and plans to appeal before GSTAT.",
            "Sentiment": "negative",
            "PublishDate": 1765025557149,
            "Source": "stock"
        },
        {
            "Title": "Sasken Technologies Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "Sasken Technologies is conducting a postal ballot from December 8, 2025 to January 6, 2026, seeking shareholder approval for appointing Ms. Meeta Malhotra as Non-Executive Independent Director for a five-year term from October 22, 2025 to October 22, 2030. The appointment requires special resolution approval through remote e-voting, with Ms. Malhotra bringing over 25 years of leadership experience in brand consulting, marketing, and design across B2C and B2B sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1764675595853,
            "Source": "corporate_action"
        },
        {
            "Title": "Sasken Technologies Receives Rs 8.82 Lakh Fine from Stock Exchanges for Regulatory Non-Compliance",
            "Summary": "BSE and NSE imposed fines of Rs 4.41 lakh each (excluding GST) on Sasken Technologies for alleged non-compliance with board composition regulations under Listing Regulations 17(1) and 20(2)/(2A). The company disputes the penalty, stating its board and committee compositions consistently met regulatory requirements, and plans to apply for withdrawal of the imposed fines.",
            "Sentiment": "negative",
            "PublishDate": 1764338766541,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sasken Academy Expands Global Partnerships with International University Collaborations",
            "Summary": "Sasken Technologies announced the growing success of Sasken Academy, its capability development arm that partners with universities to design industry-relevant engineering curricula and bridge the gap between academia and industry. The Academy recently completed a three-week international internship program for eight students from Japan's Ritsumeikan University at its Bengaluru campus, providing hands-on experience in product engineering and digital technologies.",
            "Sentiment": "positive",
            "PublishDate": 1764246175572,
            "Source": "stock"
        },
        {
            "Title": "Sasken Technologies Appoints Nirmala Datla as Chief of Data Science and Engineering Site Head-Hyderabad",
            "Summary": "Sasken Technologies Limited appointed Ms. Nirmala Datla as Chief of Data Science and Engineering Site Head-Hyderabad effective November 24, 2025. Datla brings over three decades of experience in Product Engineering and Engineering Services, having held leadership roles at HCL Technologies, Microsoft India, and Motorola India, with portfolio management experience exceeding 600 million.",
            "Sentiment": "positive",
            "PublishDate": 1764005354854,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sasken Technologies Appoints Rajeev Ved as Chief Growth AI Officer",
            "Summary": "Sasken Technologies Limited has appointed Mr. Rajeev Ved as Chief Growth AI Officer, a senior management position, effective November 20, 2025. Ved brings over 25 years of experience in strategy, operations, and digital transformation across B2B technology, industrial technology, telecommunications, and mobility sectors, having previously served as CEO MD of Hitachi Rail STS India.",
            "Sentiment": "positive",
            "PublishDate": 1763620486107,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sasken Tech Announces ₹12 Interim Dividend Despite Lower Q2 Profit",
            "Summary": "Sasken Tech declared an interim dividend of ₹12 per equity share. The company's Q2 consolidated net profit declined to ₹98 million from ₹120.5 million year-over-year. However, revenue doubled to ₹2.6 billion from ₹1.3 billion in the same period. EBITDA increased significantly to ₹150 million from ₹45 million, with EBITDA margin improving to 5.87% from 3.36% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762526741047,
            "Source": "corporate_action"
        },
        {
            "Title": "Sasken Technologies Appoints Meeta Malhotra as Independent Director",
            "Summary": "Sasken Technologies has appointed Ms. Meeta Malhotra as an Additional Director in the Non-Executive Independent category, effective October 22, 2025. The appointment is for a term of up to five years, subject to shareholder approval. The decision was made based on the recommendation of the Nomination and Remuneration Committee. Ms. Malhotra is an entrepreneur and brand strategist with over 25 years of leadership experience in brand consulting, marketing and design. She was a Partner at Ray+Keshavan, a brand consultancy acquired by WPP, and Co-Founder of Kinetic Glue, a SaaS collaboration platform acquired by BMC Software. She currently serves on the Management Committee of Plaksha University and is a Stanford Distinguished Careers Institute Fellow. Ms. Malhotra is not related to any other Director of the Company and has not been debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1761220173766,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sasken Technologies Says U.S. H-1B Visa Program Changes Won't Impact Business Operations",
            "Summary": "Sasken Technologies announced that recent changes to the U.S. H-1B visa program, including a $100,000 annual application fee, will not affect its business operations. The company operates primarily through an offshore-centric delivery model with most of its workforce based in India, providing engineering R&D and digital services to global clients in semiconductor, automotive, industrial, and communications sectors. Sasken combines remote delivery from India with locally hired onsite or nearshore staff when needed, maintaining cost competitiveness and agility. A company spokesperson stated the changes will have little to no impact on serving U.S. customers, as their offshore-led approach ensures business continuity. The company serves clients across North America, Europe, and Asia, specializing in product engineering and digital transformation services.",
            "Sentiment": "positive",
            "PublishDate": 1758468947748,
            "Source": "stock"
        },
        {
            "Title": "Sasken Technologies Partners with VicOne for Automotive Cybersecurity Solutions",
            "Summary": "Sasken Technologies Limited announced a strategic partnership with VicOne, a Trend Micro subsidiary, to deliver end-to-end automotive cybersecurity solutions for global OEMs and Tier-1 suppliers. VicOne brings cybersecurity solutions including xCarbon (in-vehicle intrusion detection and prevention), vSOC (fleet monitoring), and EVSE Security (electric vehicle charging infrastructure protection). Sasken will leverage its engineering and system integration expertise to co-sell, integrate, and operationalize VicOne's cybersecurity solutions. The partnership enables deployment of cybersecurity across ECUs, operating systems, and cloud systems. Both companies will exchange competencies, with VicOne training Sasken engineers on core technologies. The collaboration aims to help automotive manufacturers deploy secure, scalable solutions across vehicles and fleets while meeting regulatory requirements and addressing evolving cyber threats in connected vehicles and EV infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1758208424747,
            "Source": "stock"
        },
        {
            "Title": "Sasken Technologies Reports Strong Revenue Growth in Q1 FY26 Despite Profit Decline",
            "Summary": "Sasken Technologies announced its Q1 FY26 results for the quarter ended June 30, 2025. Consolidated revenues surged 84.8% sequentially to ₹273.53 crores and 121.7% year-on-year. However, consolidated PAT declined 13.0% sequentially to ₹100.06 crores with a margin of 3.7%. The company secured a total order book of $51.7 million, including $27.4 million from new business and seven new client logos. Key wins included deals with German automotive Tier-1 companies for telematics software and RF antenna design, plus partnerships in industrial modernization and Android development. The company completed the acquisition of Borqs International Holding Corp in April 2025, adding a new Product Solutions segment alongside its existing Software Services business. Employee headcount reached 2,196 with attrition at historic lows of 7.3%. Sasken also received sustainability awards and strengthened its Japan operations with a new office and expanded capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1755180210370,
            "Source": "earnings"
        },
        {
            "Title": "Sasken Tech Reports Mixed Q1 Results with Revenue Surge and Profit Decline",
            "Summary": "Sasken Tech announced its quarterly consolidated results showing net profit of 94 million rupees compared to 181 million rupees in the same period last year, representing a decline. However, the company's revenue increased significantly to 2.7 billion rupees from 1.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1755178093819,
            "Source": "earnings"
        },
        {
            "Title": "Sasken Tech Partners with Microsoft for Smart Device Innovation",
            "Summary": "Sasken Technologies has announced a collaboration with Microsoft aimed at accelerating smart device innovation through the Microsoft Devices Ecosystem Platform (MDEP). This partnership is expected to enhance the development of smart devices within Microsoft's ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1749720790000,
            "Source": "default"
        },
        {
            "Title": "Sasken Tech Reports Q4 Results and Declares Dividend",
            "Summary": "Sasken Technologies has announced its Q4 results and dividend declaration. The company's EBITDA for Q4 increased to 71 million rupees from 20 million rupees year-over-year, with the EBITDA margin improving to 4.78% from 1.86%. Additionally, the company has recommended a final dividend of 13 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1745593369000,
            "Source": "result"
        },
        {
            "Title": "Sasken Tech Reports Q4 FY2023 Financial Results",
            "Summary": "Sasken Technologies Limited has announced its Q4 financial results. The company reported a consolidated net profit of 110 million rupees, down from 172 million rupees year-over-year. However, revenue increased to 1.48 billion rupees from 1.09 billion rupees in the same period last year. Sequentially, net profit improved from 91 million rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1745593224000,
            "Source": "result"
        },
        {
            "Title": "Sasken Technologies Completes Acquisition of Borqs Technologies",
            "Summary": "Sasken Technologies has successfully completed the acquisition of Borqs Technologies. This strategic move is aimed at enhancing Sasken's capabilities in IoT (Internet of Things) and 5G product engineering. The acquisition is expected to strengthen Sasken's position in these rapidly growing technological domains.",
            "Sentiment": "positive",
            "PublishDate": 1744630622000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sasken Technologies Subsidiary Acquires Borqs International",
            "Summary": "A subsidiary of Sasken Technologies has acquired Borqs International for a deal worth up to $40 million. This acquisition represents a significant corporate action that could potentially impact Sasken's market position and future operations.",
            "Sentiment": "positive",
            "PublishDate": 1744115297000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sasken Technologies Reports Q3 Financial Results",
            "Summary": "Sasken Technologies has announced its Q3 financial results. The company reported a consolidated net profit of 91 million rupees, down from 177 million rupees in the same quarter last year. However, revenue increased to 1.45 billion rupees from 964 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737936806000,
            "Source": "earnings"
        },
        {
            "Title": "Sasken Technologies Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sasken Technologies has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 61 million rupees, up from 30 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 4.21% from 3.10% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1737728564000,
            "Source": "earnings"
        },
        {
            "Title": "Sasken Technologies Reports Q3 Financial Results",
            "Summary": "Sasken Technologies has announced its Q3 financial results. The company reported a consolidated net profit of 91 million rupees, down from 177 million rupees in the same quarter last year. However, revenue increased to 1.45 billion rupees from 964 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1737728558000,
            "Source": "earnings"
        },
        {
            "Title": "Sasken Technologies to Acquire Borqs for Rs 338 Crore",
            "Summary": "Sasken Technologies has announced its plan to acquire Borqs International and Borqs India in a deal valued at Rs 338 crore. This acquisition is aimed at expanding Sasken's capabilities in the connected device sector.",
            "Sentiment": "positive",
            "PublishDate": 1731292924000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sasken Technologies Declares Interim Dividend",
            "Summary": "Sasken Technologies has announced an interim dividend of ₹12 per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729861726000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sasken Technologies Reports Significant Drop in Q2 EBITDA",
            "Summary": "Sasken Technologies has reported a substantial decrease in its Q2 EBITDA, which fell to 45 million rupees from 146 million rupees year-over-year. The company's EBITDA margin also declined significantly, dropping to 3.36% from 14.21% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729861717000,
            "Source": "result"
        },
        {
            "Title": "Sasken Technologies Reports Q2 Revenue Growth",
            "Summary": "Sasken Technologies has reported a revenue of 1.3 billion rupees for the second quarter, compared to 1.02 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729861707000,
            "Source": "result"
        },
        {
            "Title": "Sasken Technologies Reports Q2 Financial Results",
            "Summary": "Sasken Technologies has reported its consolidated net profit for the second quarter. The company's net profit stands at 120.5 million rupees, showing a decrease from both the previous year and the previous quarter, which were 181 million rupees each.",
            "Sentiment": "negative",
            "PublishDate": 1729861698000,
            "Source": "result"
        }
    ]
}