{
    "Symbol": "SASTASUNDR",
    "ISIN": "INE019J01013",
    "News": [
        {
            "Title": "Sastasundar Ventures Q3FY26 Results Mixed Performance",
            "Summary": "Sastasundar Ventures reported consolidated revenue of Rs 34,573.70 lakhs for Q3FY26, up from Rs 28,129.05 lakhs YoY. Net profit turned positive at Rs 36.87 lakhs vs loss of Rs 3,779.18 lakhs in Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770384080166,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sastasundar Ventures Board Meet on Feb 6, 2026",
            "Summary": "Sastasundar Ventures Limited has scheduled a board meeting for February 6, 2026, to consider and approve Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769694195791,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sastasundar Ventures postal ballot for name change",
            "Summary": "Sastasundar Ventures Limited announces postal ballot seeking shareholder approval for name change to Health X Platform Limited and amendments to main object clause, with e-voting from January 15 to February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768290893263,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sastasundar Ventures to Rebrand as Health X Platform",
            "Summary": "Sastasundar Ventures Limited board approves name change to Health X Platform Limited and MOA amendments to expand into healthcare and digital platform services, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1767784740050,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sastasundar Ventures Promoter Banwari Lal Mittal Acquires Additional 10,280 Equity Shares",
            "Summary": "Banwari Lal Mittal, promoter of Sastasundar Ventures Limited, purchased 10,280 equity shares through market purchase between December 2-6, 2025, increasing his shareholding to 33.6944%. The company disclosed this acquisition under SEBI insider trading regulations, with the transaction valued at Rs. 10,280.",
            "Sentiment": "neutral",
            "PublishDate": 1765194388872,
            "Source": "corporate_action"
        },
        {
            "Title": "Sastasundar Ventures Promoter Banwari Lal Mittal Acquires 11,500 Equity Shares",
            "Summary": "Banwari Lal Mittal, promoter of Sastasundar Ventures Limited, acquired 11,500 equity shares through market purchase between November 28 and December 1, 2025. His shareholding increased from 33.6259% to 33.6621%, with the company disclosing this transaction under SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764678371437,
            "Source": "corporate_action"
        },
        {
            "Title": "Sastasundar Ventures Promoter Banwari Lal Mittal Acquires Additional 10,582 Equity Shares",
            "Summary": "Banwari Lal Mittal, promoter of Sastasundar Ventures Limited, purchased 10,582 equity shares worth Rs. 10,582 through market purchase between November 25-27, 2025. His shareholding increased marginally from 33.5926% to 33.6259%, with the company disclosing this acquisition under SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764392040921,
            "Source": "corporate_action"
        },
        {
            "Title": "Sastasundar Ventures Promoter Banwari Lal Mittal Acquires 30,000 Equity Shares",
            "Summary": "Banwari Lal Mittal, promoter of Sastasundar Ventures Limited, acquired 30,000 equity shares through market purchases on November 20-21, 2025, increasing his shareholding from 33.4983% to 33.5926%. The company disclosed this acquisition under SEBI insider trading regulations, with the transactions valued at Rs. 4.75 lakh inclusive of taxes.",
            "Sentiment": "neutral",
            "PublishDate": 1763815508499,
            "Source": "corporate_action"
        },
        {
            "Title": "Sastasundar Ventures Promoter Banwari Lal Mittal Acquires 15,000 Equity Shares",
            "Summary": "Banwari Lal Mittal, promoter of Sastasundar Ventures Limited, acquired 15,000 equity shares worth Rs. 7.06 lakh through market purchase. His shareholding increased from 33.4512% to 33.4983% of the company's total capital following the transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1763647686510,
            "Source": "corporate_action"
        },
        {
            "Title": "Luv Kush Projects Limited Acquires Additional Shares in Sastasundar Ventures",
            "Summary": "Luv Kush Projects Limited, a promoter group entity of Sastasundar Ventures Limited, acquired 20,000 equity shares worth Rs. 8,06,748.29 through market purchase. The acquisition increased Luv Kush Projects' shareholding from 11.8993% to 11.9622% in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763463154259,
            "Source": "corporate_action"
        },
        {
            "Title": "Sastasundar Ventures Expands Digital Healthcare Ecosystem Beyond Pharmacy",
            "Summary": "Sastasundar Ventures is expanding its digital healthcare ecosystem beyond pharmacy into diagnostics, personal & beauty care, and pet health while launching private label 'JITO' range and JITO Clinics for integrated consultations. The company is pursuing rapid B2C and B2B expansion across Northern and Eastern India as part of its growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1763051974321,
            "Source": "stock"
        },
        {
            "Title": "Sastasundar Ventures Reports Quarterly Loss, Subsidiary Buyback Approved",
            "Summary": "Sastasundar Ventures Limited posted a standalone net loss of Rs 31.90 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 38.93 lakhs in the previous year. The company's subsidiary Sastasundar Healthbuddy Limited received shareholder approval for a buyback of up to 20.27 lakh equity shares at Rs 453.21 per share, totaling Rs 9,200 lakhs, which will increase the parent company's shareholding from 72.4% to 78.89%.",
            "Sentiment": "neutral",
            "PublishDate": 1763050682608,
            "Source": "earnings"
        },
        {
            "Title": "Sastasundar Ventures Reduces Quarterly Loss by 88% Despite Revenue Growth",
            "Summary": "Sastasundar Ventures reported a consolidated net loss of 127 million rupees in Q2, significantly lower than the previous year's loss of 1.09 billion rupees. The company's quarterly revenue increased to 3 billion rupees from 2.73 billion rupees year-over-year, showing improved operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1763047763766,
            "Source": "earnings"
        },
        {
            "Title": "Sastasundar Ventures' Stake in Subsidiary Increases to 78.89% Following Buyback Completion",
            "Summary": "Sastasundar Healthbuddy Limited (SHBL), a material subsidiary of Sastasundar Ventures Limited, has completed its buyback offer by accepting 20,27,534 equity shares tendered by Mitsubishi Corporation. The buyback was executed at Rs. 493.21 per share, with total consideration not exceeding Rs. 100 crore. As a result of this transaction, Sastasundar Ventures' shareholding in SHBL increased from 72.14% to 78.89%. The parent company did not participate in the buyback offer. SHBL, incorporated in 2011, operates in wholesale trading of medicinal products and healthcare goods, with turnover of Rs. 1,08,498.21 lacs in FY24-25. The buyback proposal was initially approved by SHBL's board in September 2025 and subsequently approved by shareholders at an extraordinary general meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1762908010003,
            "Source": "corporate_action"
        },
        {
            "Title": "Sastasundar Healthbuddy Approves Rs 100 Crore Share Buyback at Rs 493.21 Per Share",
            "Summary": "Sastasundar Healthbuddy Limited, a material subsidiary of Sastasundar Ventures Limited, has approved a buyback of 20,27,534 equity shares at Rs 493.21 per share, totaling Rs 1,00,00,00,044. The buyback requires shareholder approval from Sastasundar Healthbuddy Limited. The board of directors approved this proposal at their meeting held on September 19, 2025. The trading window for company securities will remain closed for designated persons until September 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758288233276,
            "Source": "corporate_action"
        },
        {
            "Title": "SastaSundar Ventures Reports Mixed Q1 FY26 Results with B2B Growth Offsetting B2C Decline",
            "Summary": "SastaSundar Ventures Limited, a healthcare digital platform operator, reported total revenue of ₹298.4 crores in Q1 FY26, with overall revenue growing 5.9% year-over-year to ₹278.5 crores. The company's B2B segment RetailerShakti drove growth with revenue increasing 30.9% to ₹244.5 crores, while the B2C SastaSundar segment declined significantly by 55.7% to ₹33.3 crores. Financial Services showed strong growth of 168.9% to ₹19.9 crores. Despite revenue growth, profitability remained challenging with EBITDA at -₹13.8 crores compared to -₹9.7 crores in the previous year, though PAT was positive at ₹26.6 crores, down 35.1% year-over-year. The company maintains a strong balance sheet with total assets of ₹974.4 crores and ₹655 crores in liquid assets, though operating cash flow was negative at -₹17.3 crores for FY25. Working capital management improved with inventory days reducing from 40 to 36 days.",
            "Sentiment": "neutral",
            "PublishDate": 1755352904542,
            "Source": "stock"
        },
        {
            "Title": "Sastasundar Ventures Reports Quarterly Loss, Consolidated Operations Show Mixed Results",
            "Summary": "Sastasundar Ventures Limited reported unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company recorded a net loss of Rs. 10.95 lakhs compared to Rs. 22.15 lakhs loss in the same quarter last year. Revenue from operations stood at Rs. 9.67 lakhs. On a consolidated basis, the company reported a net profit of Rs. 2,659.21 lakhs for the quarter, with total revenue from operations at Rs. 29,842.82 lakhs. The consolidated results include contributions from subsidiaries across Financial Services and Healthcare Network segments. The company operates as a Core Investment Company with business segments in financial services and healthcare network operations.",
            "Sentiment": "neutral",
            "PublishDate": 1755008598683,
            "Source": "earnings"
        },
        {
            "Title": "SASTASUNDAR VENTURES Reports Q4 Financial Results",
            "Summary": "SASTASUNDAR VENTURES announced its Q4 consolidated financial results. The company reported a net profit of 137 million rupees, compared to 164 million rupees in the same quarter last year. Revenue for Q4 stood at 2.85 billion rupees, down from 3.07 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748621736000,
            "Source": "result"
        },
        {
            "Title": "SastaSundar Ventures Reports Increased Q3 Net Loss",
            "Summary": "SastaSundar Ventures reported a consolidated net loss of 269 million rupees in the third quarter, compared to a loss of 3 million rupees in the same period last year. The company's revenue decreased from 3.7 billion rupees to 2.8 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739541769000,
            "Source": "earnings"
        },
        {
            "Title": "SastaSundar Ventures Reports Q2 Financial Results",
            "Summary": "SastaSundar Ventures announced its Q2 financial results. The company reported a consolidated net loss of 1.09 billion rupees, compared to a loss of 58 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter, where the company posted a profit of 315 million rupees. Q2 revenue stood at 2.73 billion rupees, down from 3.58 billion rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731589867000,
            "Source": "result"
        },
        {
            "Title": "SastaSundar Ventures Projects Q2 FY25 Revenue of Rs. 238 Crore",
            "Summary": "SastaSundar Ventures has released an investor presentation projecting a provisional revenue of Rs. 238 crore for the second quarter of fiscal year 2025. This forward-looking financial estimate provides insight into the company's expected performance and growth trajectory.",
            "Sentiment": "positive",
            "PublishDate": 1730297036000,
            "Source": "corporate_action"
        },
        {
            "Title": "SastaSundar Ventures Plans Rs. 115 Crore Investment for Growth",
            "Summary": "SastaSundar Ventures has announced plans to invest Rs. 115 crores over the next three years in technology and brand building. The company expects this investment to lead to profitability for their platform, as stated in their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1730296871000,
            "Source": "corporate_action"
        },
        {
            "Title": "SastaSundar Ventures Sells Stake in Flipkart Health",
            "Summary": "SastaSundar Ventures has announced the sale of its entire stake in Flipkart Health through one of its units. The total consideration for this transaction amounts to 971.7 million Indian rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730117194000,
            "Source": "corporate_action"
        }
    ]
}