{
    "Symbol": "SATIN",
    "ISIN": "INE836B01017",
    "News": [
        {
            "Title": "Satin Finserv Raises Rs. 260 Cr in 3 Months",
            "Summary": "SFL successfully mobilizes Rs. 260 crores in three months, issues Rs. 50 crores NCDs with unique Rs. 10,000 face value structure, and gets shareholder approval to increase NCD limit to Rs. 600 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770699842778,
            "Source": "stocks"
        },
        {
            "Title": "Satin Creditcare Allots NCDs Worth ₹125 Crore",
            "Summary": "Satin Creditcare Network Limited has allotted 1,25,000 non-convertible debentures with face value of ₹10,000 each, raising ₹125 crore through the issuance on January 30, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1769798733927,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satin Creditcare Reports 404% PAT Growth in Q3FY26",
            "Summary": "Satin Creditcare Network Limited achieved consolidated PAT of ₹72 crore in Q3FY26, marking 404% YoY growth and 18th consecutive profitable quarter with 10% AUM growth to ₹13,341 crore.",
            "Sentiment": "positive",
            "PublishDate": 1769602642845,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satin Creditcare Allots ₹30 Cr Non-Convertible Debentures",
            "Summary": "Satin Creditcare Network Limited successfully allotted 3,000 non-convertible debentures worth ₹30 crores on January 23, 2026, with each debenture having a face value of ₹1 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1769173196451,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satin Creditcare Board Meet Set for Jan 28, 2026",
            "Summary": "Satin Creditcare Network Limited has scheduled a board meeting on January 28, 2026, to consider and approve unaudited financial results for Q3 FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769062643839,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satin Creditcare Scores 59 in S&P Global CSA",
            "Summary": "Satin Creditcare Network Limited achieves score of 59 in first-ever S&P Global Corporate Sustainability Assessment, marking milestone in ESG journey with strong performance in governance and risk management.",
            "Sentiment": "positive",
            "PublishDate": 1769053317660,
            "Source": "stocks"
        },
        {
            "Title": "Satin Creditcare Acquires Majority Stake in QTrino Labs",
            "Summary": "Satin Creditcare Network's subsidiary Satin Technologies Limited acquires up to 76.40% equity in IIT-incubated cybersecurity startup QTrino Labs Private Limited through share subscription agreement dated January 17, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768966741225,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satin Creditcare Board to Consider NCD Fund Raising",
            "Summary": "Satin Creditcare Network Limited has scheduled a Board Working Committee meeting for January 20, 2026, to consider raising funds through private placement of non-convertible debentures under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768482113294,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satin Creditcare Allots ₹80 Cr NCDs",
            "Summary": "Satin Creditcare Network Limited successfully allots 80,000 non-convertible debentures worth ₹80 crores with face value of ₹10,000 each on January 13, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768311918550,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satin Creditcare Approves ₹1 Billion NCD Issue",
            "Summary": "Satin Creditcare Network Limited has approved the release of Non-Convertible Debentures worth ₹1 billion, including a greenshoe option of ₹500 million for additional fundraising flexibility.",
            "Sentiment": "positive",
            "PublishDate": 1767617161131,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satin Creditcare Board Meet on Jan 5 for NCD Fundraising",
            "Summary": "Satin Creditcare Network Limited's Board Working Committee will meet on January 05, 2026, to consider raising funds through private placement of non-convertible debentures under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767096319700,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satin Creditcare Board Approves ₹25 Cr Investment",
            "Summary": "Satin Creditcare Network's board approved ₹25 crore additional investment in wholly-owned subsidiary Satin Technologies Limited for expansion and technology development.",
            "Sentiment": "positive",
            "PublishDate": 1766494706210,
            "Source": "stocks"
        },
        {
            "Title": "Satin Creditcare Network's Independent Director Anil Kumar Kalra Completes Second Term",
            "Summary": "Mr. Anil Kumar Kalra (DIN: 07361739) ceased to be Non-Executive Independent Director of Satin Creditcare Network Limited after completing his second term of 5 years on December 7, 2025. The Board expressed appreciation for his valuable guidance and significant contribution that strengthened the Company's governance and strategic direction during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1765110131960,
            "Source": "corporate_governance"
        },
        {
            "Title": "Satin Finserv Limited Announces Leadership Changes and Rights Issue",
            "Summary": "Satin Finserv Limited appointed Mr. Pramod Marar as Additional Director and Whole Time Director to lead entire business operations including Green and non-Green finance, while Mr. Dhiraj Jha resigned from his position citing personal reasons. The company also approved issuance of 2,08,68,113 equity shares on rights basis.",
            "Sentiment": "neutral",
            "PublishDate": 1764159481151,
            "Source": "corporate_governance"
        },
        {
            "Title": "Satin Creditcare Network Allots INR 25 Crore Commercial Papers",
            "Summary": "Satin Creditcare Network Limited has allotted commercial papers worth INR 25 crore with a 9.40% per annum coupon rate and 364-day maturity period. The commercial papers are proposed to be listed on BSE Limited, with both interest and principal payments scheduled at maturity on November 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763727752899,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare Plans Portfolio Diversification and Geographic Expansion",
            "Summary": "Satin Creditcare is targeting a diversified lending portfolio with 15% allocation to non-microfinance institution (non-MFI) products. The company plans geographic expansion into new states while focusing on credit cost control to improve return on equity (ROE) and enhance book quality.",
            "Sentiment": "positive",
            "PublishDate": 1761755141578,
            "Source": "stock"
        },
        {
            "Title": "Satin Creditcare Network Reports 19% Growth in Q2 Net Profit to 532 Million Rupees",
            "Summary": "Satin Creditcare Network reported Q2 consolidated net profit of 532 million rupees compared to 447 million rupees in the same period last year. Revenue increased to 7.9 billion rupees from 6.6 billion rupees year-over-year. EBITDA rose to 3.85 billion rupees from 3.3 billion rupees, though EBITDA margin declined to 48.85% from 50.82% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761738836219,
            "Source": "earnings"
        },
        {
            "Title": "Satin Finserv Raises ₹60 Crore Through Secured NCD Issuance",
            "Summary": "Satin Finserv has successfully collected ₹60 crore by issuing secured Non-Convertible Debentures (NCDs). This fundraising activity represents a debt financing initiative by the company to raise capital through secured debt instruments.",
            "Sentiment": "positive",
            "PublishDate": 1759807455573,
            "Source": "stock"
        },
        {
            "Title": "Satin Creditcare Network Sells Stressed Assets Worth INR 265.79 Crore to Asset Reconstruction Company",
            "Summary": "Satin Creditcare Network Limited's Working Committee of Board of Directors approved the sale of stressed financial assets valued at INR 265.79 crore to an Asset Reconstruction Company for INR 86.14 crore. The outstanding value includes principal and interest accrued as of August 31, 2025. The transaction was conducted through an Open Bid Method, representing a recovery of approximately 32% of the outstanding amount.",
            "Sentiment": "neutral",
            "PublishDate": 1758888835069,
            "Source": "stock"
        },
        {
            "Title": "Satin Creditcare Network Incorporates Wholly Owned Subsidiary Satin Growth Alternatives Limited",
            "Summary": "Satin Creditcare Network Limited has successfully incorporated a wholly owned subsidiary named Satin Growth Alternatives Limited on August 27, 2025. The Ministry of Corporate Affairs approved the incorporation and issued the Certificate of Incorporation on the same date. The company had previously submitted the required regulatory details to stock exchanges on July 23, 2025. The incorporation follows earlier intimation provided to BSE and NSE regarding the subsidiary formation.",
            "Sentiment": "positive",
            "PublishDate": 1756312303646,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare Network Raises Rs 100 Crore Through Bond Issuance",
            "Summary": "Microfinance lender Satin Creditcare Network completed raising Rs 100 crore through bonds in two tranches - Rs 40 crore on July 24 and Rs 60 crore on August 21. The funds were raised through rated, unsecured, non-convertible debentures with bullet repayments structured over 5.5 years and 7 years respectively. The NCDs qualify as tier II capital and are aimed at improving the company's asset liability position. Chairman HP Singh stated the fundraising reinforces investor confidence in their model and provides a stronger capital cushion to their CRAR of about 26% as of June 30, 2025. The company plans to use the funds for expanding income-generating loans and water, sanitation and hygiene (WASH) loans for clients.",
            "Sentiment": "positive",
            "PublishDate": 1755862650352,
            "Source": "stock"
        },
        {
            "Title": "Satin Creditcare Network Appoints Pramod Marar as CEO of Subsidiary Satin Finserv Limited",
            "Summary": "Satin Creditcare Network Limited announced the appointment of Pramod Marar as Chief Executive Officer and Key Managerial Personnel of its wholly owned subsidiary, Satin Finserv Limited, effective August 20, 2025. The appointment was approved by the Board of Directors at their meeting held on August 18, 2025. Marar brings over 20 years of banking experience and 3+ years in start-up ventures, with expertise in scaling businesses across sustainability, fintech, MSME financing, and Corporate Banking. He previously worked at HSBC for 18 years as Managing Director and has held leadership roles across corporate, mid-market, SME, and microfinance segments. Marar holds a PGDM from IIM Indore and B.Com (Hons) from SRCC, Delhi University, and is a Certified Associate of the Indian Institute of Bankers. He will lead Green Financing initiatives to be undertaken by the company.",
            "Sentiment": "positive",
            "PublishDate": 1755607133392,
            "Source": "corporate_governance"
        },
        {
            "Title": "Satin Creditcare Network Approves INR 75 Crore Debenture Issuance with Green Shoe Option",
            "Summary": "Satin Creditcare Network Limited's Working Committee approved the issuance of up to 7,500 subordinated, unsecured, non-convertible debentures worth INR 75 crore on a private placement basis. Each debenture has a face value of INR 1,00,000. The issuance includes a green shoe option for an additional 4,500 debentures valued at INR 45 crore. The debentures carry an interest rate of 11.50% per annum, payable annually, with a tenure of 84 months. The proposed allotment date is August 21, 2025, with maturity on August 21, 2032. The debentures will be listed on BSE Limited. In case of payment default, an additional 2% per annum interest will be charged over the base rate.",
            "Sentiment": "neutral",
            "PublishDate": 1755187362088,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare Reports 16th Consecutive Profitable Quarter Despite Seasonal Headwinds",
            "Summary": "Satin Creditcare Network Limited reported quarterly results with consolidated AUM growing 6.8% year-on-year to INR 12,499 crores and standalone gross loan portfolio at INR 10,956 crores, up 4.5% year-on-year. The company achieved its 16th consecutive profitable quarter with consolidated PAT of INR 45 crores and standalone PAT of INR 43 crores. Revenue grew 10.3% year-on-year to INR 642 crores with net interest margin stable at 13.48%. The company expanded its network to 1,599 branches across 519 districts in 29 states, serving 32.9 lakh customers. PAR 90 levels remained stable at 3.7% while PAR 1 increased to 5.8% due to seasonal factors including harvesting period and heat waves. The company maintains strong capital adequacy at 26% CRAR and holds on-book provisions of INR 316 crores. Management noted the first quarter typically experiences slowdown due to agricultural cycles, with the sector reporting 21% degrowth based on peer averages. The company's subsidiaries showed growth with Satin Housing Finance reaching INR 961 crores AUM and Satin FinServ at INR 582 crores AUM.",
            "Sentiment": "positive",
            "PublishDate": 1755177062372,
            "Source": "earnings"
        },
        {
            "Title": "Satin Creditcare Network Schedules Board Meeting to Consider Non-Convertible Debentures Fundraising",
            "Summary": "Satin Creditcare Network Limited has scheduled a Working Committee meeting on August 14, 2025 to consider raising funds through private placement of listed, secured/unsecured, non-convertible debentures. The meeting will focus on the fund raising proposal through issuance of these debentures on a private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1754922910360,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare Network Plans Fundraising Discussion",
            "Summary": "Satin Creditcare Network is scheduled to consider fundraising matters on August 14.",
            "Sentiment": "neutral",
            "PublishDate": 1754920848096,
            "Source": "stock"
        },
        {
            "Title": "Satin Creditcare Network Uploads Q1 FY26 Earnings Call Recording on Company Website",
            "Summary": "Satin Creditcare Network Limited has made the audio recording of its Q1 FY26 earnings call available on its company website. The earnings call was held on August 11, 2025, and discussed the company's financial results and future outlook. The recording can be accessed through the company's website at www.satincreditcare.com. The company trades on BSE with scrip code 539404 and on NSE with symbol SATIN. This disclosure was made under SEBI listing regulations to inform stock exchanges about the availability of the earnings call recording.",
            "Sentiment": "neutral",
            "PublishDate": 1754912760412,
            "Source": "earnings"
        },
        {
            "Title": "Satin Creditcare Targets Credit Cost Reduction by FY26 with Growth Strategy",
            "Summary": "Satin Creditcare plans to reduce credit costs by FY26 while pursuing growth through secured loans and regional expansion. The company is diversifying into housing, MSME, and AIF sectors. Satin Creditcare has reported profits for 16 consecutive quarters and maintains strong financial standing.",
            "Sentiment": "positive",
            "PublishDate": 1754665814879,
            "Source": "stock"
        },
        {
            "Title": "Satin Creditcare Reports 16th Consecutive Profitable Quarter with INR 45 Crore PAT",
            "Summary": "Satin Creditcare Network Limited reported its quarterly results with consolidated profit after tax of INR 45 crores, marking the 16th consecutive profitable quarter. Assets under management stood at INR 12,499 crores, growing 6.8% year-over-year. Net interest income increased to INR 416 crores from INR 383 crores in the same quarter last year. Disbursements reached INR 2,242 crores, up 6% year-over-year. The company operates across 29 states with 1,599 branches and serves 32.9 lakh clients. Gross non-performing assets stood at 3.7% with capital adequacy ratio at 26%. The company has expanded into Mizoram and added two new independent directors. Chairman HP Singh highlighted the company's diversification strategy beyond microfinance into housing, MSME lending, and technology services, with plans for an AIF debt fund targeting women-led enterprises.",
            "Sentiment": "positive",
            "PublishDate": 1754658191217,
            "Source": "earnings"
        },
        {
            "Title": "Satin Creditcare Network Reports ₹4,260 Crore Net Profit in Q1 FY26",
            "Summary": "Satin Creditcare Network Limited reported quarterly results with net profit after tax of ₹4,260.14 crore on standalone basis and ₹4,509.98 crore on consolidated basis. Total revenue from operations reached ₹64,143.09 crore (standalone) and ₹70,857.99 crore (consolidated). The company's earnings per share stood at ₹3.87 (standalone) and ₹4.10 (consolidated). Key financial metrics include GNPA at 3.74%, NNPA at 1.39%, and Capital Risk Adequacy Ratio at 26.04%. During the quarter, the company transferred loan assets worth ₹51,431.10 crore through direct assignment and invested ₹300 crore in its wholly owned subsidiary Satin Technologies Limited. The Board also approved incorporation of a new wholly owned subsidiary, Satin Growth Alternatives Limited, for alternative investment activities.",
            "Sentiment": "positive",
            "PublishDate": 1754652154440,
            "Source": "earnings"
        },
        {
            "Title": "Satin Creditcare Launches Women-Led MSME Debt Fund as Category II AIF",
            "Summary": "Satin Creditcare Network Ltd. announced the launch of a women-led MSME-focused debt fund structured as a Category II Alternative Investment Fund. The fund aims to provide debt capital to underserved micro, small and medium enterprises, particularly in rural and semi-urban India, with a focus on women-led enterprises. The fund will be championed by women, featuring an all-women Board of Directors and investment leadership team. It will prioritize investments in sectors including agri-tech, manufacturing, health-tech, rural services, education and infrastructure. Ms. Aditi Singh, Chief Strategy Officer, described it as a platform for systemic change by placing women at the helm of financial decision-making and capital deployment. Dr. H P Singh, Chairman cum Managing Director, stated the fund is an extension of the company's mission to create inclusive financial systems. Satin Creditcare is a leading microfinance institution with presence in 26 states, 4 union territories and over 100,000 villages, serving 33.6 lakh clients as of March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753328159853,
            "Source": "stock"
        },
        {
            "Title": "Satin Creditcare Network Approves Incorporation of Wholly Owned Subsidiary for Alternative Investment Business",
            "Summary": "Satin Creditcare Network Limited's Board of Directors approved the incorporation of a wholly owned subsidiary named Satin Growth Alternatives Limited to participate in the alternative investment space. The new subsidiary will have an authorized capital of INR 3 crore and will act as investment manager and/or sponsor to an Alternative Investment Fund registered with SEBI. The initiative aims to leverage the company's existing financial services expertise and enable revenue diversification through participation in the regulated alternative asset management sector. Satin Creditcare will hold 100% shareholding through initial subscription at face value in cash. The subsidiary is proposed to be incorporated in Haryana, India.",
            "Sentiment": "positive",
            "PublishDate": 1753273168549,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare Network: Plans Rs 50-Crore NCD Issue at 11.5% Interest",
            "Summary": "Satin Creditcare Network aims to raise a minimum of ₹50 crore through non-convertible bonds with an 11.5% annual interest rate. The issue, set for July 21, has a ₹25 crore greenshoe option. Bonds will be privately placed to institutional investors with monthly interest payments.",
            "Sentiment": "positive",
            "PublishDate": 1752540533000,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare Network Approves Issuance of Non-Convertible Debentures",
            "Summary": "Satin Creditcare Network has approved the issuance of 5,000 Non-Convertible Debentures. Each debenture is valued at 100,000 Rupees, resulting in a total issuance value of 500 Million Rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1752496581000,
            "Source": "default"
        },
        {
            "Title": "Satin Creditcare Network to Explore Fundraising via Debentures",
            "Summary": "Satin Creditcare Network has announced plans to explore fundraising through debentures. The company will consider this option on July 14th.",
            "Sentiment": "neutral",
            "PublishDate": 1752065275000,
            "Source": "default"
        },
        {
            "Title": "Satin Creditcare Network: Microfinance Sector Recovery and Rural Demand Revival",
            "Summary": "HP Singh, Chairman of Satin Creditcare Network, reports improved asset quality and collections in the microfinance sector. The company aims for an ROA of 2.5% to 3%, focusing on asset quality over rapid growth. Singh expects credit costs to decline in FY26 and emphasizes the role of technology in customer acquisition and operations.",
            "Sentiment": "positive",
            "PublishDate": 1752025735000,
            "Source": "normal_news"
        },
        {
            "Title": "Satin Creditcare Board Approves ₹44.1 Crore Private Placement of Secured NCDs",
            "Summary": "The Board of Directors of Satin Creditcare has approved the issuance of Secured Non-Convertible Debentures (NCDs) worth ₹44.1 crore through private placement.",
            "Sentiment": "positive",
            "PublishDate": 1751380749000,
            "Source": "default"
        },
        {
            "Title": "Satin Creditcare Network Plans to Raise 50 Billion Rupees via Non-Convertible Debentures",
            "Summary": "Satin Creditcare Network has announced plans to raise up to 50 billion rupees through the issuance of non-convertible debentures. This fundraising initiative aims to strengthen the company's financial position.",
            "Sentiment": "positive",
            "PublishDate": 1751025660000,
            "Source": "default"
        },
        {
            "Title": "Satin Creditcare to Consider Fundraising via NCD Private Placement",
            "Summary": "Satin Creditcare's board will evaluate a proposal to raise funds by issuing Non-Convertible Debentures (NCDs) through private placement.",
            "Sentiment": "neutral",
            "PublishDate": 1750943060000,
            "Source": "default"
        },
        {
            "Title": "Satin Creditcare Network Plans to Raise ₹50 Billion Through NCDs",
            "Summary": "Satin Creditcare Network has announced plans to raise up to ₹50 billion through the issuance of non-convertible debentures (NCDs). This fundraising initiative aims to strengthen the company's financial position.",
            "Sentiment": "positive",
            "PublishDate": 1750678835000,
            "Source": "default"
        },
        {
            "Title": "Satin Creditcare Network Reports Q4 FY23 Financial Results",
            "Summary": "Satin Creditcare Network announced its Q4 consolidated net profit of 218.9 million rupees, down from 1.3 billion rupees year-over-year but up from 142.6 million rupees quarter-over-quarter. The company's Q4 revenue stood at 6.21 billion rupees, slightly lower than 6.42 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1746663177000,
            "Source": "default"
        },
        {
            "Title": "Satin Creditcare Reports Stable Performance and Managed Credit Cost",
            "Summary": "Satin Creditcare's executive reports a 7% year-on-year AUM growth and a well-managed credit cost of 4.6% for FY25, within the guided range of 4.5% to 5.0%. Despite industry volatility and policy transitions, the company delivered stable performance across key metrics, positioning itself as a top industry performer.",
            "Sentiment": "positive",
            "PublishDate": 1746630167000,
            "Source": "default"
        },
        {
            "Title": "Satin Creditcare Network: Q4 Profit Plunges 67%, NII Down 10%",
            "Summary": "Satin Creditcare Network reported a 67.3% YoY decline in Q4 FY25 net profit to ₹41 crore. Net Interest Income fell 10% to ₹324.2 crore. Capital Adequacy Ratio stood at 25.9%. On-book GNPA was 3.7% at ₹323 crore. AUM grew 5% sequentially and 7% annually.",
            "Sentiment": "negative",
            "PublishDate": 1746625537000,
            "Source": "earnings"
        },
        {
            "Title": "Satin Creditcare Network Reports Q4 Financial Results",
            "Summary": "Satin Creditcare Network has released its Q4 financial results. The company reported revenue of 6.21 billion rupees, down from 6.42 billion rupees year-over-year. The consolidated net profit for Q4 was 218.9 million rupees, significantly lower than the 1.3 billion rupees reported in the same quarter last year. However, it showed an improvement from the previous quarter's 142.6 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1746618231000,
            "Source": "result"
        },
        {
            "Title": "Satin Creditcare Network Approves Sale of Stressed Loan Portfolio",
            "Summary": "Satin Creditcare Network has approved the sale of a stressed loan portfolio with an outstanding value of ₹212.98 crore, including principal and accrued interest as of February 28, 2025. The portfolio will be sold to an Asset Reconstruction Company (ARC) through an open bid method for a consideration of ₹42.60 crore, based on security receipts.",
            "Sentiment": "neutral",
            "PublishDate": 1742947785000,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare Network Sells Stressed Loan Portfolio",
            "Summary": "Satin Creditcare Network has approved the sale of a stressed loan portfolio with an outstanding value of ₹212.98 crore to an Asset Reconstruction Company (ARC). The sale, which includes principal and interest accrued as of February 28, 2025, will be conducted through an open bid method for a consideration of ₹42.60 crore on a security receipts basis.",
            "Sentiment": "neutral",
            "PublishDate": 1742913848000,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare Network Secures $100 Million Social Loan via ECB",
            "Summary": "Satin Creditcare Network has successfully raised $100 million through a social loan via External Commercial Borrowing (ECB). This significant financial move demonstrates the company's ability to access international funding sources and potentially expand its lending capabilities in the social sector.",
            "Sentiment": "positive",
            "PublishDate": 1741846052000,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare: Raises Letter of Comfort Limit for Housing Finance Subsidiary",
            "Summary": "Satin Creditcare Network Ltd has approved an increase in the limit for issuing Letters of Comfort for its subsidiary, Satin Housing Finance Limited, to ₹300 crore from ₹200 crore. The decision was made on March 12, 2025, to support SHFL's credit arrangements with lenders.",
            "Sentiment": "positive",
            "PublishDate": 1741781733000,
            "Source": "corporate_action"
        },
        {
            "Title": "Satin Creditcare Network Limited: Q3 Profit Drops 71% Amid Industry Challenges",
            "Summary": "Satin Creditcare Network Limited reported a 71% decrease in Q3 FY25 standalone net profit to ₹31 crore. AUM grew 10% YoY to ₹10,778 crore. Total revenue increased 15% to ₹632 crore. Asset quality improved with net fresh PAR flow reducing to 0.45%. Capital adequacy ratio stands at 27.4%. Subsidiary businesses showed growth in their respective segments.",
            "Sentiment": "neutral",
            "PublishDate": 1739270311000,
            "Source": "earnings"
        },
        {
            "Title": "Satin Creditcare Network Reports Q3 Revenue Growth",
            "Summary": "Satin Creditcare Network has announced its third quarter revenue, which stands at 6.8 billion rupees. This represents an increase from the previous year's figure of 5.96 billion rupees for the same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739181417000,
            "Source": "earnings"
        }
    ]
}