{
    "Symbol": "SATIA",
    "ISIN": "INE170E01023",
    "News": [
        {
            "Title": "Satia Industries Q3FY26 Net Profit Surges to ₹2,803 Lakhs",
            "Summary": "Satia Industries reported strong Q3FY26 results with net profit of ₹2,803 lakhs vs ₹1,979.92 lakhs in Q3FY25. Revenue reached ₹38,030.81 lakhs with cogeneration segment driving profitability.",
            "Sentiment": "positive",
            "PublishDate": 1770892974093,
            "Source": "co_actions_results"
        },
        {
            "Title": "SATIA Industries Board Meet Set for Feb 12, 2026",
            "Summary": "SATIA Industries Limited announces board meeting on February 12, 2026, to consider Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769768003900,
            "Source": "co_actions_results"
        },
        {
            "Title": "Satia Industries Reports Q2FY26 Loss of INR 245 Million, Revenue Drops 16% Quarter-on-Quarter",
            "Summary": "Satia Industries Limited posted a net loss of INR 245 million in Q2FY26 compared to a profit of INR 316 million in Q1FY26, with revenue declining 16% to INR 3,111 million due to elevated input costs and low-priced imports. The paper manufacturer faced margin compression from inverted GST duty structure and increased working capital requirements, while expanding its cutlery business with 5 additional machines now operating at full capacity.",
            "Sentiment": "negative",
            "PublishDate": 1763190463479,
            "Source": "earnings"
        },
        {
            "Title": "Satia Industries Limited Reports CCI Officials Visit for Investigation",
            "Summary": "Officials from the Competition Commission of India (CCI) visited Satia Industries Limited's Delhi offices on November 11, 2025, in connection with an investigation. The paper manufacturing company has extended full cooperation to the authorities during the investigation process and committed to keeping stock exchanges updated on further developments in this matter.",
            "Sentiment": "neutral",
            "PublishDate": 1762936875361,
            "Source": "stock"
        },
        {
            "Title": "Satia Industries Sets September 23, 2025 as Record Date for Final Dividend",
            "Summary": "Satia Industries Limited has fixed September 23, 2025 as the record date for determining shareholder eligibility for final dividend payment for financial year 2024-25. The dividend is subject to declaration at the company's 44th Annual General Meeting scheduled for September 30, 2025. If approved, the dividend will be paid immediately after the AGM but within four weeks of the meeting date. For dematerialized shares, dividend payments will be based on beneficial ownership details from depositories.",
            "Sentiment": "positive",
            "PublishDate": 1758096471443,
            "Source": "corporate_action"
        },
        {
            "Title": "Satia Industries Appoints Two New Independent Directors and Re-appoints One for Five-Year Terms",
            "Summary": "Satia Industries' Board of Directors approved the appointment of Mr. Deepak Kumar Kakkar and Mr. Vibhor Kapoor as Non-Executive Independent Directors for five-year terms from August 11, 2025 to August 10, 2030. The Board also approved the re-appointment of Mr. Vinod Kumar Kathuria as Non-Executive Independent Director for five years from October 1, 2025 to September 30, 2030. All appointments are subject to shareholder approval. Kakkar brings nearly 40 years of banking experience including roles as Country Manager at Punjab National Bank in Afghanistan and Circle Head positions. Kathuria has four decades of banking experience and previously served as Executive Director at Union Bank of India. Kapoor is a CA and CFA with 14 years of corporate banking experience across multiple banks and currently runs a debt syndication company.",
            "Sentiment": "neutral",
            "PublishDate": 1754987450591,
            "Source": "corporate_governance"
        },
        {
            "Title": "Satia Industries Reports Decline in Q1 Net Profit and Revenue",
            "Summary": "Satia Industries reported a net profit of 316 million rupees in Q1, down from 511 million rupees in the same period last year. The company's revenue also decreased to 3.71 billion rupees compared to 3.99 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754905346654,
            "Source": "earnings"
        },
        {
            "Title": "Satia Industries Schedules Board Meeting for August 11, 2025 to Review Quarterly Financial Results",
            "Summary": "Satia Industries Limited has scheduled a Board Meeting for August 11, 2025, to review and approve the Standalone Unaudited Financial Results for the quarter ended June 30, 2025. The company will also consider other matters during the meeting. The Trading Window will reopen on August 13, 2025, at 9:00 AM following the company's Code of Conduct for Prevention of Insider Trading.",
            "Sentiment": "neutral",
            "PublishDate": 1753334713793,
            "Source": "corporate_action"
        },
        {
            "Title": "India Ratings Affirms Satia Industries' Bank Loans at 'IND A+'/Stable, Assigns Additional Credit Facilities",
            "Summary": "India Ratings and Research affirmed Satia Industries Limited's bank loan ratings at 'IND A+'/Stable and proposed commercial paper at 'IND A1+', while assigning ratings to additional credit facilities totaling INR400.6 million. The rating reflects the company's integrated operations, healthy market position in state textbook segment with 10%-15% market share, and robust credit metrics with net leverage below 1x. The company operates a 205,000 MTPA paper manufacturing facility in Punjab and recorded revenue of INR15,120 million in FY25, down 12.1% from previous year due to softening paper prices. EBITDA margins moderated to 17.9% in FY25 from 24.3% in FY24. The company plans to upgrade its paper machine over six-to-nine months starting November 2025, adding 18,000-20,000 MTPA capacity but requiring temporary shutdown. India Ratings expects EBITDA to decline further in FY26 due to planned shutdown and volume impact, with gradual recovery expected from second half of FY27. The ratings are supported by the company's ability to use multiple feedstocks, operational efficiencies, and adequate liquidity with INR1,139 million in unencumbered cash.",
            "Sentiment": "neutral",
            "PublishDate": 1753162170547,
            "Source": "stock"
        },
        {
            "Title": "Satia Industries Reports Decline in Q3 Revenue",
            "Summary": "Satia Industries has reported a decrease in revenue for the third quarter. The company's revenue stood at 3.7 billion rupees, down from 4.36 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1739265840000,
            "Source": "earnings"
        },
        {
            "Title": "SATIA INDUSTRIES Reports Decline in Q3 EBITDA and Margin",
            "Summary": "SATIA INDUSTRIES has reported a significant decrease in its Q3 EBITDA, which fell to 530 million rupees from 922 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 14.10% from 21.16% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739265827000,
            "Source": "earnings"
        },
        {
            "Title": "Satia Industries Reports 50% Decline in Q3 Net Profit",
            "Summary": "Satia Industries has reported a net profit of 198 million rupees for the third quarter, representing a significant decrease from 396 million rupees in the same period last year. This indicates a 50% year-over-year decline in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1739265783000,
            "Source": "earnings"
        },
        {
            "Title": "Satia Industries Reports Q2 Revenue Decline",
            "Summary": "Satia Industries has reported a decrease in revenue for the second quarter. The company's revenue for Q2 stood at 3.4 billion rupees, down from 3.73 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731489765000,
            "Source": "result"
        },
        {
            "Title": "Satia Industries Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Satia Industries has reported a significant decrease in its Q2 EBITDA, which fell to 451 million rupees from 864 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 13.25% from 23.15% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731489756000,
            "Source": "result"
        },
        {
            "Title": "Satia Industries Reports Significant Decline in Q2 Net Profit",
            "Summary": "Satia Industries has reported a net profit of 123 million rupees for the second quarter, marking a substantial decrease from 479 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731489597000,
            "Source": "result"
        }
    ]
}