{
    "Symbol": "SAURASHCEM",
    "ISIN": "INE626A01014",
    "News": [
        {
            "Title": "Saurashtra Cement Q3FY26 Results Show Mixed Performance",
            "Summary": "Saurashtra Cement reported Q3FY26 revenue of ₹41,018.74 lakhs, up 8.67% YoY, but posted net loss of ₹1,034.56 lakhs due to higher costs and exceptional items.",
            "Sentiment": "negative",
            "PublishDate": 1770646356812,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saurashtra Cement Board Meet on Feb 9 for Q3 Results",
            "Summary": "Saurashtra Cement Limited has scheduled a board meeting on February 9, 2026, to consider unaudited financial results for Q3 and nine months ended December 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769610517605,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saurashtra Cement IT Appeal Hearing Set for Feb 2026",
            "Summary": "Saurashtra Cement receives notice for Income Tax Appeal hearing on 3 February 2026 regarding transfer pricing adjustments for assessment years 2016-17 to 2021-22.",
            "Sentiment": "neutral",
            "PublishDate": 1765540380772,
            "Source": "stocks"
        },
        {
            "Title": "Saurashtra Cement Reports Reduced Net Loss and Higher Revenue in Q2",
            "Summary": "Saurashtra Cement reported a net loss of 110 million rupees in Q2, which represents an improvement from the previous year's loss of 315 million rupees. The company's revenue increased to 3.86 billion rupees compared to 2.97 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762524530485,
            "Source": "earnings"
        },
        {
            "Title": "Saurashtra Cement Receives Rs 16.56 Crore Tax Demand Order from Central Excise Authority",
            "Summary": "Saurashtra Cement Limited received a demand order totaling Rs 16.56 crores from the Office of the Commissioner of Central Excise & CGST, Bhavnagar. The demand comprises Rs 7.74 crores in tax and Rs 8.82 crores in penalty, plus applicable interest, related to alleged ineligible availment and utilization of Input Tax Credit under GST provisions for financial years 2018-19 to 2023-24. The company stated the demand is not maintainable and is evaluating options including filing an appeal. Saurashtra Cement does not anticipate any material impact on its financials, operations, or other activities.",
            "Sentiment": "negative",
            "PublishDate": 1761386554965,
            "Source": "stock"
        },
        {
            "Title": "Saurashtra Cement's Jay Mehta Transitions from Executive Chairman to Non-Executive Chairman",
            "Summary": "Saurashtra Cement Limited's Board of Directors approved the change in designation of Jay Mahendra Mehta from Executive Chairman to Non-Executive Chairman, effective September 26, 2025. Mehta requested the change to focus on personal and professional commitments outside India. While ceasing executive responsibilities, he will continue as Chairman of the Board in a non-executive capacity without drawing a fixed salary. Mehta, who holds degrees from Columbia University and IMD Lausanne, has been associated with the company's Board since 1987 and was reappointed as Executive Chairman in August 2024. The Board expressed appreciation for his valuable guidance and leadership during his executive tenure and looks forward to his continued strategic support.",
            "Sentiment": "neutral",
            "PublishDate": 1758861972038,
            "Source": "corporate_governance"
        },
        {
            "Title": "Saurashtra Cement Appoints Prakash Chand Jain as New CFO",
            "Summary": "Saurashtra Cement Limited appointed Mr. Prakash Chand Jain as Chief Financial Officer and Key Managerial Personnel effective September 5, 2025. The Board of Directors approved the appointment based on recommendations from the Nomination and Remuneration Committee and Audit and Compliance Committee. Mr. Rakesh Mehta, who served as CFO and KMP on an interim basis, ceased his role at the closure of business hours on September 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1756992051216,
            "Source": "corporate_governance"
        },
        {
            "Title": "Saurashtra Cement Completes Annual Maintenance, Resumes Kiln Operations at Gujarat Plant",
            "Summary": "Saurashtra Cement Limited announced the successful completion of annual maintenance at its cement plant located in Ranavav, Gujarat. The company stated that kiln operations at the facility are scheduled to resume from August 9, 2025. This follows a previous intimation dated July 24, 2025, regarding the maintenance activity at the plant.",
            "Sentiment": "positive",
            "PublishDate": 1754653270167,
            "Source": "stock"
        },
        {
            "Title": "Saurashtra Cement Limited Announces Q1 FY2026 Financial Results",
            "Summary": "Saurashtra Cement Limited has announced its unaudited financial results for the first quarter ended June 30, 2025. The results were reviewed by the Audit Committee and approved by the Board of Directors at their meeting held on July 24, 2025. The company's statutory auditors conducted a limited review of the results. The financial results and limited review reports are available on stock exchange websites (BSE and NSE) and the company's website. The company has published newspaper advertisements regarding the extract of these quarterly results in Business Standard (Mumbai, Ahmedabad Edition - English) and Jai Hind (Rajkot Edition - Gujarati) newspapers.",
            "Sentiment": "neutral",
            "PublishDate": 1753517012052,
            "Source": "earnings"
        },
        {
            "Title": "Saurashtra Cement Appoints Rakesh H. Mehta as Interim CFO Following Pradeep Mehta's Resignation",
            "Summary": "Saurashtra Cement Limited has appointed Rakesh H. Mehta as interim Chief Financial Officer effective July 26, 2025, following the resignation of Pradeep Mehta on July 25, 2025. Rakesh Mehta will serve as CFO and Key Managerial Personnel until a permanent CFO is appointed. He is a Mechanical Engineer with a master's degree in financial management and has over four decades of experience in Finance, Corporate Planning, Strategy Evaluation and Projects across manufacturing and service sectors. Mehta previously served as CFO of Saurashtra Cement Limited from October 2014 to March 2023 and currently works as a Finance Consultant for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753435091420,
            "Source": "corporate_governance"
        },
        {
            "Title": "Saurashtra Cement CFO Pradeep Mehta Resigns Due to Personal Reasons",
            "Summary": "Saurashtra Cement Limited announced the resignation of Chief Financial Officer Pradeep Mehta, effective from the close of business hours on July 25, 2025. Mehta cited personal reasons for his departure in his resignation letter dated May 26, 2025, and requested relief within one month with a waiver of the balance notice period. He committed to ensuring a smooth transition and facilitating the handover of responsibilities during the interim period. The company has notified stock exchanges BSE and NSE about the resignation.",
            "Sentiment": "neutral",
            "PublishDate": 1753434630617,
            "Source": "corporate_governance"
        },
        {
            "Title": "Saurashtra Cement Reports Strong Q1 Performance with 51% Jump in EBITDA",
            "Summary": "Saurashtra Cement delivered robust quarterly results with EBITDA rising to 347 million rupees from 230 million rupees year-over-year. The company's EBITDA margin improved significantly to 8.20% compared to 5.97% in the same period last year. Net profit increased substantially to 168 million rupees from 98 million rupees year-over-year. Revenue grew to 4.2 billion rupees from 3.86 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753367919064,
            "Source": "earnings"
        },
        {
            "Title": "Saurashtra Cement Reports Q1 Results, Announces 20-Day Plant Maintenance Shutdown",
            "Summary": "Saurashtra Cement Limited announced quarterly results for the period ended June 30, 2025, showing standalone revenue from operations of ₹42,356.59 lakhs and net profit of ₹1,679.14 lakhs. The company operates in two segments - cement and clinker (₹40,339.47 lakhs revenue) and paints (₹2,017.12 lakhs revenue). The company also disclosed a planned 20-day shutdown of its kiln at the Ranavav Plant in Gujarat starting July 25, 2025 for annual maintenance. Cement dispatches will continue during the shutdown period, and the Sidheegram plant remains operational. The company allotted 16,203 equity shares during the quarter under its employee stock option scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1753367803395,
            "Source": "stock"
        },
        {
            "Title": "Saurashtra Cement Reports Q4 Financial Results",
            "Summary": "Saurashtra Cement has reported its Q4 financial results. The company's EBITDA increased to 538 million rupees from 449 million rupees year-over-year. The EBITDA margin improved to 11.25% from 9.03% in the same period last year. Net profit for Q4 was 331 million rupees, up from 317 million rupees year-over-year, but down from a loss of 44 million rupees quarter-over-quarter. Revenue for Q4 was 4.78 billion rupees, compared to 4.97 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747926550000,
            "Source": "result"
        },
        {
            "Title": "Saurashtra Cement Reports Q3 Net Loss of 44 Million Rupees",
            "Summary": "Saurashtra Cement has reported a net loss of 44 million rupees for the third quarter, compared to a loss of 125 million rupees in the same period last year. This represents a significant reduction in losses year-over-year. However, the loss has increased from 315 million rupees in the previous quarter. The company's revenue for Q3 stood at 3.8 billion rupees, down from 4.47 billion rupees in the corresponding quarter of the previous year, indicating a decline in sales.",
            "Sentiment": "negative",
            "PublishDate": 1739492262000,
            "Source": "earnings"
        },
        {
            "Title": "Saurashtra Cement Reports Significant Decline in Q3 EBITDA",
            "Summary": "Saurashtra Cement has reported a substantial decrease in its third-quarter EBITDA, which fell to 77 million rupees from 430 million rupees in the same period last year. The company's EBITDA margin also declined sharply, dropping to 2.04% from 9.64% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739451177000,
            "Source": "earnings"
        },
        {
            "Title": "Saurashtra Cement Reports Q3 Net Loss of 44 Million Rupees",
            "Summary": "Saurashtra Cement has reported a net loss of 44 million rupees for the third quarter, showing an improvement from the 125 million rupee loss in the same period last year. However, the loss has increased from the previous quarter's 315 million rupees. The company's revenue for Q3 stood at 3.8 billion rupees, down from 4.47 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739451109000,
            "Source": "earnings"
        },
        {
            "Title": "Saurashtra Cement Resumes Production at Gujarat Plant",
            "Summary": "Saurashtra Cement Limited has announced the recommencement of production at its cement manufacturing plant located in Gujarat. This development indicates a return to normal operations for the company's production facilities.",
            "Sentiment": "positive",
            "PublishDate": 1733987091000,
            "Source": "corporate_action"
        },
        {
            "Title": "Saurashtra Cement Reports Q2 Net Loss of 315M Rupees",
            "Summary": "Saurashtra Cement has reported a net loss of 315 million rupees in the second quarter, compared to a loss of 8 million rupees in the same period last year. This represents a significant increase in losses year-over-year. However, compared to the previous quarter, the company has moved from a profit of 98 million rupees to a loss. The company's revenue for Q2 stood at 2.96 billion rupees, down from 3.74 billion rupees in the same quarter last year, indicating a decline in sales.",
            "Sentiment": "negative",
            "PublishDate": 1731509191000,
            "Source": "result"
        },
        {
            "Title": "Saurashtra Cement Continues Operations at Two Plants",
            "Summary": "Saurashtra Cement has announced that cement dispatches will continue from their Ranavav plant. Additionally, the company's cement plant located in Sidheegram, Gujarat, remains operational.",
            "Sentiment": "positive",
            "PublishDate": 1729085156000,
            "Source": "normal_news"
        },
        {
            "Title": "Saurashtra Cement Announces Annual Maintenance Shutdown",
            "Summary": "Saurashtra Cement has reported that its kiln at the Ranavav Plant in Gujarat will be shut down for annual maintenance starting August 2, 2024. The maintenance period is expected to last approximately 25 days.",
            "Sentiment": "neutral",
            "PublishDate": 1729085148000,
            "Source": "corporate_action"
        }
    ]
}