{
    "Symbol": "SBC",
    "ISIN": "INE04AK01028",
    "News": [
        {
            "Title": "SBC Exports Board Meet on Feb 5 for Q3FY26 Results",
            "Summary": "SBC Exports Limited has scheduled its board meeting for February 05, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770014097250,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBC Exports Wins ₹25.53 Lakh Govt Contract from MeitY",
            "Summary": "SBC Exports Limited secured a work order worth ₹25.53 lakh from Ministry of Electronics and Information Technology through NICSI for office support and project management services over 8 months.",
            "Sentiment": "positive",
            "PublishDate": 1769774773326,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBC Exports Secures ₹7 Crore Dubai Order",
            "Summary": "SBC Exports Limited receives repeat export order worth ₹7.00 crore from Dubai-based HUXXE Readymade Garments Trading LLC for supply of various garment articles including T-shirts, trousers, and shorts.",
            "Sentiment": "positive",
            "PublishDate": 1768989271915,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBC Exports Wins ₹10.77 Cr IIT Jodhpur Contract",
            "Summary": "SBC Exports Limited secured a manpower services contract worth ₹10.77 crores from IIT Jodhpur for one year starting January 2026, with potential extension up to 3 years.",
            "Sentiment": "positive",
            "PublishDate": 1765785878525,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBC Exports Wins ₹3 Cr Manpower Contract from MDI",
            "Summary": "SBC Exports Limited secured a one-year manpower services contract worth approximately ₹3 crores from Management Development Institute, Gurgaon, starting January 1, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1765530497528,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBC Exports Reports Strong Q2 Performance with Doubled Net Profit and Improved Margins",
            "Summary": "SBC Exports delivered robust quarterly results with net profit more than doubling to 114 million rupees compared to 54 million rupees in the same period last year. Revenue grew significantly to 847 million rupees from 660 million rupees year-over-year. The company's EBITDA increased substantially to 103 million rupees from 57 million rupees, while EBITDA margin expanded to 12.14% from 8.70% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762521816888,
            "Source": "earnings"
        },
        {
            "Title": "SBC Exports Secures ₹45 Crore Repeat Export Order from Dubai-Based Company",
            "Summary": "SBC Exports Limited received a repeat export order worth ₹45 crore from M/s HUXE Readymade Garments Trading LLC, a Dubai-based textile company. The order involves supplying various garment articles including T-shirts, trousers, and shorts. The contract is to be executed within one year from the purchase order date of November 5, 2025, with completion by November 5, 2026. Payment will be received within 90 days of goods receipt, with all consideration in USD. The Dubai-based company will bear insurance and freight expenses. The company confirmed that no promoter or group companies have any interest in the entity awarding the order, and it does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1762451496269,
            "Source": "order&deals"
        },
        {
            "Title": "SBC Exports Secures ₹53.46 Lakh Manpower Supply Contract from Ministry of Electronics and IT",
            "Summary": "SBC Exports Limited has been awarded a work order worth ₹53.46 lakh by the Ministry of Electronics and Information Technology through NICSI for providing manpower supply services. The six-month contract, allotted on September 16, 2025, involves supplying personnel for NICSI/NIC internal requirements and projects. Under the agreement, SBC Exports will receive monthly payments based on actual service duration rendered. The company is required to regularly pay deployed manpower their entitlements including salaries, wages, EPF, ESI, bonus, and insurance coverage, with proof to be submitted along with vendor invoices. The empanelment allows for converting earnest money deposit into security deposit for the empanelment period plus three months. The contract does not involve any related party transactions or promoter group interests.",
            "Sentiment": "positive",
            "PublishDate": 1758027032120,
            "Source": "stock"
        },
        {
            "Title": "SBC Exports Secures ₹6 Crore Two-Year Manpower Supply Contract from ICSI",
            "Summary": "SBC Exports has secured a manpower supply contract worth ₹6 crore from ICSI (Institute of Company Secretaries of India) for a duration of two years. The contract involves providing manpower supply services to the professional institute.",
            "Sentiment": "positive",
            "PublishDate": 1756811885975,
            "Source": "stock"
        },
        {
            "Title": "SBC Exports Appoints New Auditors and Promotes Executive Director to Whole Time Director",
            "Summary": "SBC Exports Limited's Board of Directors approved three key appointments during their meeting on August 28, 2025. The company appointed M/s Durga Prasad & Associate as Cost Auditor for financial year 2025-26 with a remuneration of INR 60,000 plus taxes. M/s Kumar Mandal & Associates was appointed as Secretarial Auditor for a five-year term from 2025-26 to 2029-30 with fees of Rs. 50,000. Additionally, Mrs. Deepika Gupta's designation was changed from Executive Director to Whole Time Director for a five-year term from August 28, 2025 to August 27, 2030, subject to shareholder approval. Mrs. Gupta, who holds an MBA in Entrepreneurship & Family Business, is the wife of Managing Director Mr. Govind Ji Gupta.",
            "Sentiment": "positive",
            "PublishDate": 1756385444496,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBC Exports Secures ₹17.56 Crore Export Order from Dubai-Based HUXXE Readymade Garments",
            "Summary": "SBC Exports Limited received an initial export order worth ₹17.56 crore from HUXXE Readymade Garments Trading LLC, a Dubai-based company, for supplying readymade garments including T-shirts, trousers, and shorts. The order is to be executed within one year and payment will be received within 90 days of goods receipt, with consideration in US dollars. The company expects this order to contribute to revenue within the financial year and support projected 15-20% annual growth in export turnover. The deal is expected to enhance profitability, diversify market exposure, and strengthen the company's position in the international apparel sector. No promoter group has any interest in the awarding entity, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1755157560914,
            "Source": "order&deals"
        },
        {
            "Title": "SBC Exports Reports Quarterly Results, Plans Agro Business Diversification and Dubai Partnership",
            "Summary": "SBC Exports Ltd announced its unaudited financial results for the quarter ended June 30, 2025. On standalone basis, the company reported revenue from operations of Rs 6,136.34 lakh and net profit of Rs 339.98 lakh. On consolidated basis, revenue from operations was Rs 7,245.51 lakh with net profit of Rs 346.84 lakh. The company operates in two main segments: IT Support Services (Rs 3,120.22 lakh revenue) and Garments Sales (Rs 3,016.12 lakh revenue). The board approved strategic diversification into the Agro Business sector, focusing on production, processing, and distribution of organic grains, pulses, spices, and value-added agro-products. The company is also in advanced negotiations with HUXXE Readymade Garments Trading LLC, a Dubai-based company, for a strategic partnership involving export of approximately 10,00,000 units annually of readymade garments. The partnership is projected to increase export revenue by 15-20% annually, with terms expected to be finalized by August 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754404720517,
            "Source": "earnings"
        },
        {
            "Title": "SBC Exports Secures $1.25 Million Repeat Order from Dubai Wholesaler",
            "Summary": "SBC Exports has received a new repeat order worth $1.25 million from Gawgee Brothers Wholesalers, a company based in Dubai. This international order signifies continued business relations between SBC Exports and the Dubai-based wholesaler.",
            "Sentiment": "positive",
            "PublishDate": 1750861965000,
            "Source": "default"
        },
        {
            "Title": "SBC EXPORTS Reports Q4 Financial Results",
            "Summary": "SBC EXPORTS announced its Q4 financial results. The company's EBITDA for Q4 was 62 million rupees, compared to 58 million rupees in the same quarter last year. The EBITDA margin decreased to 6.46% from 8.35% year-over-year. Consolidated net profit for Q4 was 40 million rupees, up from 25 million rupees year-over-year and 36 million rupees quarter-over-quarter. Q4 revenue increased to 963 million rupees from 693 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747837852000,
            "Source": "result"
        },
        {
            "Title": "SBC Export Approves 1:2 Bonus Share Issue",
            "Summary": "SBC Export has approved a bonus share issue in the ratio of 1:2, meaning shareholders will receive one additional share for every two shares they currently hold. This corporate action aims to reward existing shareholders and potentially increase liquidity in the stock.",
            "Sentiment": "positive",
            "PublishDate": 1741671268000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBC Exports: Small-Cap Stock Surges 8% Amid Market Relief Rally",
            "Summary": "SBC Exports, a small-cap stock priced below ₹50, experienced an 8% jump in morning trade on the BSE. The surge is attributed to a broader market relief rally following US President Donald Trump's decision to halt tariffs on Mexico and Canada.",
            "Sentiment": "positive",
            "PublishDate": 1738645993000,
            "Source": "normal_news"
        },
        {
            "Title": "SBC Exports: Bonus Shares Announced Alongside Strong Q3 Results",
            "Summary": "SBC Exports has declared a 1:2 bonus share issue following the announcement of strong Q3 results for 2025 on January 24.",
            "Sentiment": "positive",
            "PublishDate": 1737954656000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBC Exports Reports Q3 Results and Announces Bonus Share Issue",
            "Summary": "SBC Exports has reported its Q3 financial results, showing a net profit of 33 million rupees, up from 28 million rupees in the same quarter last year. The company's revenue for Q3 reached 500 million rupees, compared to 478 million rupees in the previous year. Additionally, SBC Exports has approved the issuance of bonus shares in a ratio of 1:2.",
            "Sentiment": "positive",
            "PublishDate": 1737936788000,
            "Source": "earnings"
        },
        {
            "Title": "SBC Exports Approves 1:2 Bonus Share Issue",
            "Summary": "SBC Exports has approved the issuance of bonus shares in a ratio of 1:2. This means shareholders will receive one additional share for every two shares they currently hold, effectively increasing the number of shares without changing the company's overall value.",
            "Sentiment": "positive",
            "PublishDate": 1737730404000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBC Exports Reports Decline in Q3 EBITDA and Margin",
            "Summary": "SBC Exports has reported a significant decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 15 million rupees from 38 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 3.08% from 7.95% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737730400000,
            "Source": "earnings"
        },
        {
            "Title": "SBC Exports Reports Q3 Financial Results",
            "Summary": "SBC Exports has announced its financial results for the third quarter. The company's net profit increased to 33 million rupees, up from 28 million rupees in the same quarter last year. Revenue also saw growth, reaching 500 million rupees compared to 478 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737730395000,
            "Source": "earnings"
        },
        {
            "Title": "SBC Exports Withdraws Proposal for Rights Issue",
            "Summary": "The board of directors of SBC Exports has decided to withdraw the previously proposed rights issue. This decision represents a significant change in the company's capital raising strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1732839779000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBC Exports Withdraws Proposal for Rights Issue",
            "Summary": "The board of SBC Exports has decided to withdraw the previously proposed rights issue. This decision represents a significant change in the company's capital raising strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1732793059000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBC Export Reports Strong Q2 Financial Results",
            "Summary": "SBC Export announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 54 million rupees, up from 22 million rupees in the same quarter last year and 53 million rupees in the previous quarter. Revenue also saw substantial growth, reaching 660 million rupees compared to 352 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731332612000,
            "Source": "result"
        },
        {
            "Title": "SBC Exports Projects Improved EBITDA Margins",
            "Summary": "SBC Exports anticipates EBITDA margins to range between 10-13% due to increased scale of operations and implementation of cost control measures.",
            "Sentiment": "positive",
            "PublishDate": 1729655265000,
            "Source": "normal_news"
        },
        {
            "Title": "SBC Exports Projects 30% Revenue Growth in Q3FY25",
            "Summary": "SBC Exports has announced in a press release that it expects a 30% revenue growth in Q3FY25. This growth is attributed to increased brand visibility, the festival season, a wider product range, and higher consumer spending. The company also anticipates that exports will contribute approximately 40% to their overall revenue.",
            "Sentiment": "positive",
            "PublishDate": 1729655250000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBC Exports Announces Board Meeting for Q2 Results and Rights Issue Consideration",
            "Summary": "<p><span class='neutral'>SBC Exports</span> has scheduled a <b>board meeting</b> on <span class='neutral'>October 22</span> to <span class='neutral'>review and consider</span> the company's <b>second quarter results</b>. Additionally, the board will discuss the possibility of <span class='positive'>raising funds</span> through a <span class='neutral'>rights issue</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728906341000,
            "Source": "corporate_action"
        }
    ]
}