{
    "Symbol": "SBCL",
    "ISIN": "INE386D01027",
    "News": [
        {
            "Title": "Shivalik Bimetal Reports Strong Q3 Results, 100% Dividend",
            "Summary": "Shivalik Bimetal Controls posted consolidated net profit of ₹2,217.68 lakhs in Q3 FY26, up from ₹1,823.99 lakhs YoY. Board declared 100% interim dividend of ₹2 per share with record date February 13, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770312024335,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shivalik Bimetal Plans ₹200M Production Expansion",
            "Summary": "Shivalik Bimetal Controls announces major capacity expansion plan to add 1 million busbars monthly production through internal investment of ₹200 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1770293623205,
            "Source": "stocks"
        },
        {
            "Title": "Shivalik Bimetal Board Meet on Feb 5 for Q3 Results",
            "Summary": "Shivalik Bimetal Controls schedules board meeting on February 05, 2026 to consider Q3FY26 financial results and potential interim dividend declaration with record date set for February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769688884208,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shivalik Bimetal Reports Minor Fire at Plant",
            "Summary": "Shivalik Bimetal Controls Limited experienced a minor fire incident at its main plant's packaging area on January 28th, 2026. No casualties or equipment damage reported, operations continue normally.",
            "Sentiment": "neutral",
            "PublishDate": 1769671136104,
            "Source": "stocks"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports 26.3% PAT Growth Despite Volume Contraction in H1 FY26",
            "Summary": "Shivalik Bimetal Controls delivered strong earnings momentum with Profit After Tax up 26.3% in H1 FY26, despite total volumes contracting marginally by 0.9%. The company achieved significant margin expansion with gross margins improving by 296 basis points and consolidated EBITDA margins rising 305 basis points year-on-year, driven by focus on higher value-added products and assemblies.",
            "Sentiment": "positive",
            "PublishDate": 1763573564464,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports Strong Quarterly Results, Approves Rs 25 Crore Working Capital Facility",
            "Summary": "Shivalik Bimetal Controls Limited approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company's standalone revenue increased to Rs 14,474.71 lakhs for the half-year from Rs 12,424.89 lakhs in the previous year. Net profit after tax rose to Rs 4,281.59 lakhs from Rs 3,608.25 lakhs. The Board approved a working capital facility of Rs 25 crore from Axis Bank and appointed M/s. TR Chadha Co LLP as Internal Auditor for FY 2026-27. Consolidated results showed revenue of Rs 15,756.03 lakhs for the half-year compared to Rs 13,545.86 lakhs previously, with net profit increasing to Rs 3,465.12 lakhs from Rs 3,196.47 lakhs. The company operates primarily in Process and Product Engineering segment.",
            "Sentiment": "positive",
            "PublishDate": 1762951407569,
            "Source": "earnings"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports 25% Jump in Quarterly Net Profit to 249M Rupees",
            "Summary": "Shivalik Bimetal Controls reported consolidated net profit of 249 million rupees for the quarter, compared to 199 million rupees in the same period last year, marking a year-on-year increase. The company's quarterly revenue rose to 1.37 billion rupees from 1.26 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762940844413,
            "Source": "earnings"
        },
        {
            "Title": "Shivalik Bimetal Controls Schedules Earnings Call for Quarterly Results",
            "Summary": "Shivalik Bimetal Controls Limited has scheduled an earnings conference call for November 13, 2025, at 4:00 PM IST to discuss its quarterly and half-year results ended September 30, 2025. The company will announce its results on November 12, 2025. The webinar will include management commentary on performance, key financial and operational highlights, and an interactive Q&A session with participants. Senior management will be present to address the call, which is hosted by Dickenson World, the company's investor relations advisor. Results presentation and press release will be available on NSE/BSE websites and the company's website under Investor Relations following the board meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1762802771373,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivalik Bimetal Controls Gets Exchange Approval for Promoter Group Reclassification",
            "Summary": "Shivalik Bimetal Controls Limited received no objection certificates from NSE and BSE on September 29, 2025, approving the reclassification of six individuals and five corporate entities from Promoter and Promoter Group category to Public category. The entities seeking reclassification include Satinder Jeet Singh Sandhu, Sarita Sandhu, Angad Sandhu, Devinder Jeet Singh Sandhu, Manjit Kaur, Gurbir Sandhu, and companies Amar Engineering Company Pvt. Ltd., Angad Estates Pvt. Ltd., TSL Holdings Pvt. Ltd., Ultra Portfolio Management Pvt. Ltd., and B S Sandhu and Associates Pvt. Ltd. All these entities currently hold zero equity shares in the company. The reclassification was processed under Regulation 31A of SEBI regulations, with the original application submitted on August 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759208763272,
            "Source": "corporate_action"
        },
        {
            "Title": "Kabir Ghumman Acquires 2.09 Million Shares in Shivalik Bimetal Controls Through Gift Transfer",
            "Summary": "Kabir Ghumman acquired 2,086,200 equity shares of Shivalik Bimetal Controls Limited through an inter-se transfer among promoter group as a gift. The shares were transferred from Sumer Ghumman on August 28, 2025. The acquisition represents 3.62% of the company's diluted share capital. Following the transaction, Kabir Ghumman's shareholding increased from 300 shares (0.00%) to 2,086,500 shares (3.62%), while Sumer Ghumman's holding decreased from 4,173,000 shares (7.24%) to 2,086,800 shares (3.62%). The transaction was exempt from open offer requirements under SEBI regulations as it was an inter-se transfer among promoter group members. Shivalik Bimetal Controls is listed on BSE and National Stock Exchange.",
            "Sentiment": "neutral",
            "PublishDate": 1756967982112,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivalik Bimetal Controls Sets September 9, 2025 as Record Date for Final Dividend",
            "Summary": "Shivalik Bimetal Controls Limited has fixed September 9, 2025, as the record date for determining shareholder eligibility for final dividend payment. The dividend is subject to declaration at the company's 41st Annual General Meeting. If approved, the dividend will be distributed to eligible shareholders within 30 days from the AGM date. The company secretary Aarti Sahni communicated this information to BSE and NSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1756128760864,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivalik Bimetal Controls Seeks Reclassification of 11 Promoter Group Entities to Public Shareholders",
            "Summary": "Shivalik Bimetal Controls Limited received requests from 11 individuals and entities in the Promoter and Promoter Group category to be reclassified as Public shareholders. The requests were made through letters dated July 11, 2025, from 6 individuals and 5 body corporates. The company filed applications with NSE and BSE for this reclassification. All 11 entities seeking reclassification currently hold zero equity shares in the company. The individuals include Satinder Jeet Singh Sandhu, Sarita Sandhu, Angad Sandhu, Devinder Jeet Singh Sandhu, Manjit Kaur, and Gurbir Sandhu. The body corporates are Amar Engineering Company Pvt. Ltd., Angad Estates Pvt. Ltd., TSL Holdings Pvt. Ltd., Ultra Portfolio Management Pvt. Ltd., and B S Sandhu and Associates Pvt. Ltd.",
            "Sentiment": "neutral",
            "PublishDate": 1755180591352,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports Strong Q1 Results, Approves Euro 25,000 Investment in European Subsidiary",
            "Summary": "Shivalik Bimetal Controls Limited's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. Standalone revenue from operations reached ₹11,669.53 lakhs compared to ₹10,721.69 lakhs in the same quarter last year, while net profit increased to ₹2,097.33 lakhs from ₹1,630.45 lakhs. Consolidated revenue grew to ₹13,659.68 lakhs from ₹12,598.06 lakhs year-over-year, with net profit rising to ₹2,278.06 lakhs from ₹1,782.12 lakhs. The board approved a Euro 25,000 investment in wholly-owned subsidiary Shivalik Bimetal Europe SRL for working capital requirements. Key appointments include Dr. Srikant Baldi as Non-Executive Independent Director for 5 years and re-appointment of Mr. Gurmeet Singh Gill who retires by rotation. The company scheduled its 41st Annual General Meeting for September 16, 2025, with record date closure from September 10-16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755088086977,
            "Source": "earnings"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports Q4 Results and Dividend",
            "Summary": "Shivalik Bimetal Controls has announced its quarterly results and dividend. The company recommended a dividend of 1.5 rupees per equity share. For Q4, the company reported an EBITDA of 285 million rupees, up from 218 million rupees year-over-year, with an EBITDA margin of 21.52% compared to 17.06% in the previous year. The consolidated net profit for Q4 was 211 million rupees, down from 257 million rupees year-over-year but up from 182 million rupees quarter-over-quarter. Q4 revenue stood at 1.3 billion rupees, slightly up from 1.28 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748524756000,
            "Source": "result"
        },
        {
            "Title": "Shivalik Bimetal Reports Minimal Impact from US Tariffs",
            "Summary": "The Managing Director of Shivalik Bimetal has stated that the company is experiencing very minimal impact from the 26% US tariffs. The company's direct exposure to these tariffs remains manageable, suggesting that their business operations and financial performance are not significantly affected by this trade policy.",
            "Sentiment": "neutral",
            "PublishDate": 1744359378000,
            "Source": "normal_news"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports Q3 EBITDA and Margin",
            "Summary": "Shivalik Bimetal Controls has reported its Q3 financial results. The company's EBITDA for the quarter was 246 million rupees, compared to 252 million rupees in the same quarter last year. The EBITDA margin for Q3 stood at 19.91%, slightly lower than the 19.95% reported in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1739360095000,
            "Source": "earnings"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports Q3 Financial Results",
            "Summary": "Shivalik Bimetal Controls has announced its Q3 consolidated financial results. The company reported a net profit of 182 million rupees, up from 170 million rupees in the same quarter last year. However, revenue decreased slightly to 1.23 billion rupees from 1.26 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739360092000,
            "Source": "earnings"
        },
        {
            "Title": "Shivalik Bimetal Controls Announces Investment Plan for Productivity Improvement",
            "Summary": "Shivalik Bimetal Controls has announced plans to invest between Rs 20 to 30 crores over the next three financial years (FY 2024 to FY 2026). The investment is aimed at optimizing operations and improving productivity within the company.",
            "Sentiment": "positive",
            "PublishDate": 1730950632000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports Q2 EBITDA Decline",
            "Summary": "Shivalik Bimetal Controls has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 270 million rupees from 292 million rupees year-over-year. The EBITDA margin also declined to 21.29% from 22.83% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730886816000,
            "Source": "result"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports Q2 Revenue",
            "Summary": "Shivalik Bimetal Controls has reported its second quarter revenue of 1.26 billion rupees, compared to 1.27 billion rupees in the same quarter last year, showing a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1730886767000,
            "Source": "result"
        },
        {
            "Title": "Shivalik Bimetal Controls Reports Q2 Net Profit",
            "Summary": "Shivalik Bimetal Controls has reported a consolidated net profit of 199 million rupees for the second quarter, compared to 203 million rupees in the same period last year. This represents a slight year-over-year decrease in profit.",
            "Sentiment": "neutral",
            "PublishDate": 1730886717000,
            "Source": "result"
        }
    ]
}