{
    "Symbol": "SBFC",
    "ISIN": "INE423Y01016",
    "News": [
        {
            "Title": "SBFC Finance Re-designates MD as Executive Vice-Chairman",
            "Summary": "SBFC Finance's Board approves re-designation of Managing Director Aseem Dhru as Executive Vice-Chairman for five years from April 1, 2026, subject to shareholder approval via postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1770088946426,
            "Source": "stocks"
        },
        {
            "Title": "SBFC Finance Allots 381,418 Equity Shares Under ESOP",
            "Summary": "SBFC Finance Limited allotted 381,418 equity shares to employees under four ESOP schemes on January 29, 2026, raising Rs. 2.18 crores and increasing paid-up capital to Rs. 1,096.85 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769683209782,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBFC Finance announces major leadership transition",
            "Summary": "SBFC Finance Limited announces significant management changes with Aseem Dhru stepping down as MD & CEO to become Vice-Chairman, while Mahesh Dayani takes over as new MD & CEO from April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769250991241,
            "Source": "stocks"
        },
        {
            "Title": "SBFC Finance Q3FY26 Net Profit Surges 34.01% YoY",
            "Summary": "SBFC Finance reports strong Q3FY26 results with net profit rising 34.01% to ₹1,180.40 million and total income growing 27.78% to ₹4,258.14 million compared to Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1769246532820,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBFC Finance Q3FY26 Earnings Call Set for Jan 24",
            "Summary": "SBFC Finance Limited has scheduled its Q3FY26 earnings conference call for January 24, 2026, at 4:15 PM IST to discuss financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769004475439,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBFC Finance Gets CARE AA- Rating Reaffirmed",
            "Summary": "SBFC Finance Limited receives credit rating reaffirmation from CARE Ratings with AA- stable outlook for bank facilities worth ₹2,500 crore, enhanced from ₹1,700 crore, along with A1+ rating for commercial paper.",
            "Sentiment": "positive",
            "PublishDate": 1768924372571,
            "Source": "stocks"
        },
        {
            "Title": "SBFC Finance Board Meet on Jan 24 for Q3FY26 Results",
            "Summary": "SBFC Finance Limited has scheduled a board meeting for January 24, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closure announced from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766755679529,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBFC Finance Gets ESG Rating of 64 from NSE Analytics",
            "Summary": "SBFC Finance Limited receives an ESG rating of 64 from NSE Sustainability Ratings and Analytics Limited for FY 2024-25, based on publicly available company data without direct engagement.",
            "Sentiment": "positive",
            "PublishDate": 1765380768030,
            "Source": "stocks"
        },
        {
            "Title": "SBFC Finance Allots 6.23 Lakh Equity Shares Under Employee Stock Option Plans",
            "Summary": "SBFC Finance Limited allotted 6,23,607 equity shares to employees under five different ESOP schemes with exercise prices ranging from Rs.40 to Rs.87.33 per share. The allotment increased the company's issued and paid-up equity share capital from Rs.10,95,84,88,180 to Rs.10,96,47,24,250, with all new shares ranking pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1764756989215,
            "Source": "corporate_action"
        },
        {
            "Title": "SBFC Finance Independent Director Rajesh Agrawal's Term Concludes After 5 Years",
            "Summary": "SBFC Finance Limited announced that Rajesh Mannalal Agrawal (DIN: 00302467) completed his 5-year term as Independent Director on November 11, 2025, and will cease to be a Director effective November 12, 2025. The company acknowledged his significant contributions during his tenure. The cessation follows the completion of his appointed term as per the terms of appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1762909194918,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBFC Finance Reports 30% YOY Profit Growth, Crosses Rs 10,000 Crore AUM Milestone",
            "Summary": "SBFC Finance Limited reported quarterly results with profit after tax of Rs 109 crore, marking 30% year-on-year growth and 8% quarter-on-quarter growth. The company's assets under management reached Rs 9,938 crore as of September 2025, with 29% YOY and 6% QOQ growth, crossing the Rs 10,000 crore milestone during the quarter. Return on average tangible equity improved to 14.09% from 13.53% in the previous quarter. The company maintained yield at 18.01% while reducing cost of borrowing to 8.96%, resulting in spread improvement to 9.05%. Gross NPA remained range-bound at 2.77% with provision coverage ratio at 46.17%. Credit costs increased to 1.29% for the quarter. SBFC operates through 220 branches with 100% secured lending backed by properties and gold. The company tightened underwriting standards, stopped lending below Rs 7 lakhs, and raised minimum CIBIL score requirements to 700. Management guided for 5-7% quarter-on-quarter AUM growth going forward, with credit costs potentially increasing another 10-15 basis points before stabilizing. The company noted stress in Karnataka portfolio due to regulatory issues and maintained cautious outlook on smaller ticket segments.",
            "Sentiment": "neutral",
            "PublishDate": 1762610026658,
            "Source": "earnings"
        },
        {
            "Title": "SBFC Finance Allots 26.51 Lakh Equity Shares Under Employee Stock Option Schemes",
            "Summary": "SBFC Finance Limited allotted 26,51,417 equity shares to employees under seven different employee stock option schemes. The allotment includes shares from SBFC Stock Option Policy 2021-II (48,624 shares at Rs. 40), SBFC Stock Option Policy 2021-III-Special Grant (23,065 shares at Rs. 40), SBFC Stock Option Policy 2021-IV (11,48,437 shares at Rs. 21.45), SBFC Stock Option Policy 2021-V (4,40,625 shares at Rs. 40), SBFC Stock Option Policy 2023-I (53,823 shares at Rs. 55), SBFC Stock Option Policy 2023-II (5,00,000 shares at Rs. 55), and SBFC Stock Option Policy 2023-III (4,36,843 shares at Rs. 87.33). Following this allotment, the company's issued and paid-up equity share capital increased from 1,09,31,97,401 equity shares aggregating to Rs. 10,93,19,74,010 to 1,09,58,48,818 equity shares aggregating to Rs. 10,95,84,88,180. All newly allotted shares have a face value of Rs. 10 each and will rank pari-passu with existing equity shares.",
            "Sentiment": "neutral",
            "PublishDate": 1762298692438,
            "Source": "corporate_action"
        },
        {
            "Title": "SBFC Finance Approves 1.21 Crore Stock Options Pool, Announces Key Leadership Changes",
            "Summary": "SBFC Finance Limited's Board approved the SBFC Stock Option Policy 2025-I, creating a pool of 1.21 crore employee stock options subject to shareholder approval through postal ballot. The exercise price will be determined based on the average closing price of five trading days preceding the grant date. The company experienced significant leadership changes with two key resignations: Shanesh Jain, Head-Internal Audit, resigned to relocate to UAE for personal reasons, and Viney Vaid, Head-Credit, resigned after eight years with the company due to personal reasons. To fill the credit leadership gap, SBFC appointed Sreenivas Mylavarapu as Chief Credit Officer. Mylavarapu brings 29 years of banking experience across retail, MSME, agriculture, and microfinance segments, with previous roles at Karnataka Bank Ltd., Aditya Birla Housing Finance, Kotak Mahindra Bank, IDBI Bank, and State Bank of Hyderabad. All changes took effect from November 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1761998235579,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBFC Finance Reports Marginal Improvement in Asset Quality Metrics",
            "Summary": "SBFC Finance announced its quarterly results showing Gross Non-Performing Assets (GNPA) at 2.77%, a slight improvement from 2.78% in the previous quarter. Net Non-Performing Assets (NNPA) also decreased to 1.51% from 1.57% quarter-on-quarter, indicating better asset quality management.",
            "Sentiment": "positive",
            "PublishDate": 1761986274448,
            "Source": "earnings"
        },
        {
            "Title": "SBFC Finance Reports 30% Jump in Quarterly Net Profit to Rs 1.09 Billion",
            "Summary": "SBFC Finance reported net profit of Rs 1.09 billion for the quarter compared to Rs 840 million in the same period last year. The company's interest income increased to Rs 3.8 billion from Rs 2.8 billion year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1761985932313,
            "Source": "earnings"
        },
        {
            "Title": "SBFC Finance Reports Quarterly Results and Board Approvals",
            "Summary": "SBFC Finance Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025, during a meeting held on November 1, 2025. The company issued 3,76,240 equity shares during the quarter and 71,98,313 shares during the half year to employees under stock option policies. Additionally, 1,05,000 equity shares were transferred from the employee welfare trust to eligible employees during the half year. The company raised Rs. 200 crore through Non-Convertible Debentures in August 2025, of which Rs. 101.90 crore has been utilized for onlending to secured micro, small and medium enterprises and gold loans. The company maintains sufficient security cover for its listed non-convertible debentures and confirmed compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1761985917885,
            "Source": "earnings"
        },
        {
            "Title": "SBFC Finance Receives Closure Confirmation for Telangana Profession Tax Show Cause Notice with Nil Demand",
            "Summary": "SBFC Finance Limited received confirmation on October 10, 2025, that the Show Cause Notice issued by the Government of Telangana Commercial/State Taxes Department has been closed with nil demand. The notice was originally issued under Section 8 of the Telangana Profession Tax Act, 1987, related to non-payment of Profession Tax and non-filing of tax returns. The company had responded to the notice, clarifying that the requisite Professional Tax had been duly paid. The professional tax office endorsed the closure on October 9, 2025, officially resolving the matter. The company reported no financial or operational impact from this development.",
            "Sentiment": "positive",
            "PublishDate": 1760175529884,
            "Source": "stock"
        },
        {
            "Title": "SBFC Finance Schedules Board Meeting for November 1 to Approve Q2 Results, Closes Trading Window",
            "Summary": "SBFC Finance Limited has scheduled a board meeting for November 1, 2025, to consider and approve unaudited financial results for the quarter and half year ending September 30, 2025. The company has closed the trading window for designated persons and their immediate relatives from October 1, 2025, until 48 hours after the financial results declaration. The trading window closure applies to dealing in the company's securities during this period.",
            "Sentiment": "neutral",
            "PublishDate": 1758810713732,
            "Source": "corporate_action"
        },
        {
            "Title": "SBFC Finance Allots ₹200 Crore Senior Secured NCDs Through Private Placement",
            "Summary": "SBFC Finance has allotted ₹200 crore worth of redeemable senior secured non-convertible debentures (NCDs) through private placement. The NCDs are senior secured instruments, indicating they have priority in repayment and are backed by collateral.",
            "Sentiment": "neutral",
            "PublishDate": 1755691258384,
            "Source": "corporate_action"
        },
        {
            "Title": "SBFC Finance Reports INR 101 Crore Quarterly Profit, Raises Credit Cost Guidance Amid MSME Stress",
            "Summary": "SBFC Finance Limited reported a profit after tax of INR 101 crores for Q1 FY26, marking a 28% year-on-year growth and 7% quarter-on-quarter growth. The company's AUM reached INR 9,351 crores with 30% year-on-year growth. Yields improved by 11 basis points to 17.99% while borrowing costs decreased by 3 basis points to 9.32%, resulting in a spread of 8.67%. The company expanded its network by 10 branches to 215 total branches. However, SBFC is experiencing stress in smaller ticket size MSME loans, with 1+ DPD levels increasing and collection efficiency dropping. Management cited political risks, particularly in Karnataka, and overleveraged individual balance sheets as key challenges. The company has tightened underwriting standards, increasing rejection rates by 10%, and expects credit costs to rise by 15-20 basis points from the current 1.11% level. GNPA remained range-bound at 2.78% with PCR at 44.4%. The company maintains strong capital adequacy at 34.3% and achieved an ROE of 13.53%. Management guided for 5-7% quarter-on-quarter AUM growth and a 50 basis point reduction in operational costs for the year.",
            "Sentiment": "neutral",
            "PublishDate": 1753965615634,
            "Source": "earnings"
        },
        {
            "Title": "SBFC Finance Maintains 5-7% Quarterly AUM Growth Guidance Despite Rising Credit Costs",
            "Summary": "SBFC Finance expects its assets under management to grow 5-7% quarterly, maintaining guidance provided for over nine quarters. The company reported a 100 basis point increase in bucket one delinquency, driven by stress in specific geographies and smaller ticket segments. Credit costs have risen to 1.1% with guidance for an additional 15-20 basis points increase from current levels. Executive Director Mahesh Dayani stated the company anticipated this increase and remains prepared. SBFC's assets grew 7% quarter-on-quarter while pre-provisioning operating profit increased 9%. The company plans to curtail 15-20% of distribution but expects the remaining 75-80% to continue growing. SBFC has strengthened underwriting with 87-88% of customer acquisitions now having credit scores above 700, potentially tightening to 90%. The company achieved over ₹800 crore in disbursals and expects 20% growth in disbursals and 25% in AUM even without expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1753698705795,
            "Source": "stock"
        },
        {
            "Title": "SBFC Finance Uploads Q1 FY26 Earnings Call Audio Recording",
            "Summary": "SBFC Finance Limited has made available the audio recording of its Q1 FY26 earnings conference call held on July 26, 2025, on its website. The recording can be accessed at the company's investor section under 'Investor Presentation – Audio Recordings'. The company will upload the transcript of the earnings call to its website and submit it to stock exchanges at a later time. The notification was signed by Company Secretary & Chief Compliance Officer Namrata Sajnani.",
            "Sentiment": "neutral",
            "PublishDate": 1753542323916,
            "Source": "earnings"
        },
        {
            "Title": "SBFC Finance Reports 28% Jump in Net Profit to ₹1,009 Crore for June Quarter",
            "Summary": "SBFC Finance Limited reported a net profit of ₹1,008.92 crore for the quarter ended June 30, 2025, marking a 28% increase from ₹787.15 crore in the same quarter last year. Total income rose to ₹3,885.42 crore from ₹2,975.07 crore year-on-year. Interest income grew to ₹3,548.97 crore compared to ₹2,711.19 crore in the previous year quarter. The company's gross non-performing assets stood at 2.78% versus 2.60% a year ago, while net NPAs increased to 1.57% from 1.51%. Basic earnings per share was ₹0.93 compared to ₹0.73 in the corresponding quarter. The debt-equity ratio increased to 1.73 times from 1.42 times year-on-year. During the quarter, the company transferred 409 stressed loan accounts worth ₹250.93 crore to asset reconstruction companies. The company issued 28.22 lakh equity shares to employees under stock option schemes and raised ₹400 crore through non-convertible debentures in February 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753519949770,
            "Source": "earnings"
        },
        {
            "Title": "SBFC Finance Schedules Earnings Conference Call for Q1FY26 Results on July 26, 2025",
            "Summary": "SBFC Finance Limited has scheduled an earnings conference call on Saturday, July 26, 2025, at 4:00 PM IST to discuss the company's financial results for the quarter ended June 30, 2025. The call will be represented by key executives including Managing Director and CEO Aseem Dhru, Executive Director Mahesh Dayani, CFO Narayan Barasia, Chief Strategy Officer Sanket Agrawal, and Chief Risk Officer Rajiv Thakker. The company has provided universal access numbers for domestic participants and international toll-free numbers for participants from Hong Kong, Singapore, UK, and USA. ICICI Securities is coordinating the call, with multiple contact persons available for clarifications.",
            "Sentiment": "neutral",
            "PublishDate": 1753275112431,
            "Source": "earnings"
        },
        {
            "Title": "SBFC Finance: Targets 25-30% Annual Growth, Stable Asset Quality in FY26",
            "Summary": "SBFC Finance aims for 25-30% annual AUM growth in FY26, maintaining 5-7% quarter-on-quarter growth. The company expects stable delinquencies and NPAs, with credit costs around 1%. Capital adequacy ratio stands at 35%, with plans to increase ROE to 15% by Q1 FY27 through increased leverage and reduced operating expenses.",
            "Sentiment": "positive",
            "PublishDate": 1746492902000,
            "Source": "normal_news"
        },
        {
            "Title": "SBFC Finance Secures INR 4,000 Million Investment from British International Investment",
            "Summary": "SBFC Finance has obtained a significant investment of INR 4,000 million from British International Investment. This funding is aimed at supporting low-income and women entrepreneurs in India, demonstrating a commitment to financial inclusion and economic empowerment in the country.",
            "Sentiment": "positive",
            "PublishDate": 1739192661000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBFC Finance Reports Strong Q3 Financial Results",
            "Summary": "SBFC Finance Ltd has announced its Q3 consolidated financial results. The company's net profit increased to 835 million rupees, up from 614 million rupees year-over-year and 870 million rupees quarter-over-quarter. Revenue also saw significant growth, reaching 3.07 billion rupees compared to 2.26 billion rupees year-over-year and 2.88 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737936760000,
            "Source": "earnings"
        },
        {
            "Title": "SBFC Finance Ltd: Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for SBFC Finance Ltd on the National Stock Exchange (NSE). Approximately 3,171,701 shares were traded at a price of Rs. 91.08 per share, resulting in a total transaction value of Rs. 28.89 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1735633983000,
            "Source": "block_deals"
        },
        {
            "Title": "SBFC Finance Receives IRDAI Registration as Corporate Agent",
            "Summary": "SBFC Finance has been issued a certificate of registration by the Insurance Regulatory and Development Authority of India (IRDAI) to act as a corporate agent. This certification allows SBFC Finance to engage in insurance-related activities as an authorized corporate agent.",
            "Sentiment": "positive",
            "PublishDate": 1732545629000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBFC Finance Reports Strong Q2 Financial Results",
            "Summary": "SBFC Finance has announced its Q2 financial results, showing significant year-over-year growth. The company's net profit increased to 840 million rupees from 526 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 2.8 billion rupees compared to 2.2 billion rupees in the previous year's Q2.",
            "Sentiment": "positive",
            "PublishDate": 1729952542000,
            "Source": "result"
        }
    ]
}