{
    "Symbol": "SBGLP",
    "ISIN": "INE05ST01028",
    "News": [
        {
            "Title": "SBGL Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Suratwwala Business Group Limited has scheduled its board meeting for February 12, 2026, to consider Q3FY26 financial results and registered office shift. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770193180886,
            "Source": "co_actions_results"
        },
        {
            "Title": "Suratwwala Business Group Finalizes Pune Housing Project",
            "Summary": "Suratwwala Business Group completes sale deed for housing project redevelopment in Pune covering 11,250 sq. ft with projected revenue of ₹100-110 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769501934117,
            "Source": "stocks"
        },
        {
            "Title": "Suratwwala Business Group Reports Strong Q2 Performance and Strategic Investment",
            "Summary": "Suratwwala Business Group Limited approved unaudited financial results for the quarter and half year ended September 30, 2025, showing consolidated net profit of Rs. 816.25 lakhs for the quarter. The company also approved investment in NextRiise Real Estate Advisors Private Limited by acquiring 49% stake for Rs. 49,000, making it an associate company in the real estate advisory sector.",
            "Sentiment": "positive",
            "PublishDate": 1763145077203,
            "Source": "earnings"
        },
        {
            "Title": "Suratwwala Business Group Limited Recommends Rs. 0.10 Final Dividend, Sets AGM for September 30, 2025",
            "Summary": "Suratwwala Business Group Limited's Board of Directors recommended a final dividend of Rs. 0.10 per share (10% on face value of Rs. 1) for the financial year ended March 31, 2025, subject to shareholder approval. The company set September 12, 2025 as the record date for dividend entitlement and scheduled its 18th Annual General Meeting for September 30, 2025. Key dates include book closure on September 24, e-voting from September 27-29, and e-voting cut-off date of September 23, 2025. If approved, dividend payment will be made within 30 days of the AGM conclusion to shareholders holding dematerialized and physical shares as per the record date. The board meeting was held on August 19, 2025, and the company's trading window for designated persons was closed from August 14-19, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755602618649,
            "Source": "corporate_action"
        },
        {
            "Title": "Suratwwala Business Group Publishes Q1 FY2026 Financial Results in Newspapers",
            "Summary": "Suratwwala Business Group Limited published its unaudited financial results for the first quarter ended June 30, 2025 in newspapers as per regulatory requirements. The results were approved by the Board of Directors on August 13, 2025 and published in Business Standard and Navrashtra on August 15, 2025. The company informed stock exchanges NSE and BSE about the newspaper publication as required under SEBI regulations. The financial results and limited review report have been posted on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1755345055141,
            "Source": "earnings"
        },
        {
            "Title": "Suratwwala Business Group Acquires Office Space in Pune",
            "Summary": "Suratwwala Business Group has purchased office space in Pune for 186.9 million rupees. This acquisition represents a significant investment in commercial real estate for the company in one of India's major business hubs.",
            "Sentiment": "positive",
            "PublishDate": 1743686949000,
            "Source": "corporate_action"
        },
        {
            "Title": "Suratwwala Business Group Reports Significant Decline in Q3 Financial Performance",
            "Summary": "Suratwwala Business Group has reported a substantial decrease in its financial performance for the third quarter. The company's consolidated net profit dropped to 1.9 million rupees, compared to 65 million rupees in the same period last year. Similarly, revenue fell to 32 million rupees from 163 million rupees year-over-year, indicating a significant contraction in the company's business activities.",
            "Sentiment": "negative",
            "PublishDate": 1738714825000,
            "Source": "earnings"
        },
        {
            "Title": "Suratwwala Business Group Reports Significant Decline in Q3 Financial Results",
            "Summary": "Suratwwala Business Group has reported a substantial decrease in its financial performance for the third quarter. The company's consolidated net profit dropped to 1.9 million rupees from 65 million rupees in the same period last year. Similarly, revenue declined to 32 million rupees from 163 million rupees year-over-year, representing a significant reduction in both profit and revenue.",
            "Sentiment": "negative",
            "PublishDate": 1738677187000,
            "Source": "earnings"
        }
    ]
}