{
    "Symbol": "SBICARD",
    "ISIN": "INE018E01016",
    "News": [
        {
            "Title": "SBI Cards Reports Strong Q3 FY26 Results",
            "Summary": "SBI Cards delivered robust Q3 FY26 performance with 45% YoY profit growth to ₹557 crores, driven by record spends of ₹1,14,702 crores and improved asset quality with credit costs declining to 8.3%.",
            "Sentiment": "positive",
            "PublishDate": 1770216504217,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Cards Reports Strong Q3 FY26 Results",
            "Summary": "SBI Cards delivers robust Q3 FY26 performance with net profit of ₹556.64 crores, up 45.2% YoY. Total income rises to ₹5,353.42 crores while maintaining healthy asset quality metrics.",
            "Sentiment": "positive",
            "PublishDate": 1769610358870,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Cards Allots 8,096 Shares Under ESOP Scheme 2023",
            "Summary": "SBI Cards and Payment Services Limited allotted 8,096 equity shares to employees under its ESOP Scheme 2023 at Rs. 10 per share, increasing paid-up capital to Rs. 9,51,58,54,960.",
            "Sentiment": "neutral",
            "PublishDate": 1769504846113,
            "Source": "co_actions_results"
        },
        {
            "Title": "CLSA Upgrades SBI Cards to Hold, Cites Asset Quality",
            "Summary": "CLSA upgraded SBI Cards from Underperform to Hold with ₹820 target price, citing improving asset quality but warning of operating profitability pressures and slower growth outlook.",
            "Sentiment": "neutral",
            "PublishDate": 1768356461837,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Downgrades SBI Cards to Underperform",
            "Summary": "Macquarie downgrades SBI Cards from Neutral to Underperform rating and reduces target price to ₹750.00, reflecting revised outlook on the credit card company's prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768190067530,
            "Source": "stocks"
        },
        {
            "Title": "SBI Cards Receives ESG Rating of 78 for FY2025",
            "Summary": "SBI Cards and Payment Services Limited received an ESG rating of 78 from NSE Sustainability Ratings for FY2025, up from 77 in FY2024, earning 'Leader' category status with strong governance and environmental scores.",
            "Sentiment": "positive",
            "PublishDate": 1767863231409,
            "Source": "stocks"
        },
        {
            "Title": "SBI Cards Seeks Shareholder Approval for Two New Directors",
            "Summary": "SBI Cards initiates postal ballot for appointment of Smt. Anuradha Rao and Smt. Parvathy Vairava Sundaram as Independent Directors. E-voting opens January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767786427238,
            "Source": "stocks"
        },
        {
            "Title": "SBI Cards Allots 29,896 Equity Shares Under ESOP Plans",
            "Summary": "SBI Cards and Payment Services allotted 29,896 equity shares to employees under two ESOP schemes at exercise prices of ₹152.10 and ₹10.00 per share, increasing paid-up capital to ₹951.58 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1766407497157,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bernstein Maintains Underperform Rating on SBI Cards",
            "Summary": "Bernstein maintains 'Underperform' rating on SBI Cards with price target of ₹780.00, reflecting cautious outlook on the credit card company's prospects.",
            "Sentiment": "negative",
            "PublishDate": 1765375593595,
            "Source": "stocks"
        },
        {
            "Title": "SBI Cards Appoints Parvathy Vairava Sundaram as Independent Director",
            "Summary": "SBI Cards and Payment Services Limited appointed Smt. Parvathy Vairava Sundaram as an additional Independent Director for a three-year term from December 09, 2025 to December 08, 2028, subject to shareholder approval. The appointee is a former Executive Director at Reserve Bank of India who superannuated in November 2019 and brings extensive central banking experience in regulation and supervision.",
            "Sentiment": "positive",
            "PublishDate": 1765279163359,
            "Source": "corporate_governance"
        },
        {
            "Title": "CRISIL Enhances SBI Cards' Bank Loan Rating to Rs 62,000 Crore, Reaffirms AAA Rating",
            "Summary": "CRISIL enhanced SBI Cards and Payment Services' total bank loan facilities rating to Rs 62,000 crore from Rs 57,000 crore while reaffirming its CRISIL AAA/Stable rating for debt instruments and bank facilities. The rating reflects continued strong support from majority shareholder State Bank of India and the company's steady market position as second-largest credit card player with 19% market share, despite moderation in profitability with RoA declining to 3.0% and gross NPAs at 2.85%.",
            "Sentiment": "neutral",
            "PublishDate": 1763393612521,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Cards Appoints Anuradha Rao as Independent Director, Two Directors Complete Terms",
            "Summary": "SBI Cards appointed Anuradha Rao as Additional Independent Director for three years starting November 13, 2025, subject to shareholder approval. Dinesh Kumar Mehrotra and Anuradha Shripad Nadkarni completed their second terms as Independent Directors and ceased to be directors from November 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763065284076,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Cards Director Shamsher Singh Resigns Due to Time Constraints",
            "Summary": "Shamsher Singh, Non-executive Nominee Director of SBI Cards and Payment Services Limited, resigned from the company's Board of Directors effective November 13, 2025. Singh, who was nominated by State Bank of India and serves as Deputy Managing Director for Transaction Banking New Initiatives at SBI, cited his inability to devote adequate time for Board matters due to demands from his role at the bank. The Board and management acknowledged his valuable contributions and guidance during his tenure with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1763019391176,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Cards Block Trade Worth Rs 179.87 Crore Executed on BSE",
            "Summary": "A block trade involving SBI Cards shares was executed on BSE for Rs 179.87 crore. The transaction involved approximately 2,062,438 shares at a price of Rs 872.1 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1763009464977,
            "Source": "order&deals"
        },
        {
            "Title": "SBI Cards Receives ESG Rating Upgrade to AA from MSCI",
            "Summary": "SBI Cards and Payment Services Limited received an upgraded Environmental, Social, and Governance (ESG) rating of AA from MSCI ESG Ratings and Research Private Limited, improved from its previous A rating. MSCI is a SEBI registered ESG rating provider. The company has made this information available on its website at www.sbicard.com.",
            "Sentiment": "positive",
            "PublishDate": 1762509751432,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Cards Reports 31% Spend Growth in Q2 FY26 Despite Lower Margins",
            "Summary": "SBI Cards and Payment Services reported total revenue of INR 5,136 crores for the quarter, marking 13% year-over-year growth. Total spend reached a record INR 1,07,063 crores with 31% year-over-year growth, while retail spend grew 17% to INR 89,611 crores. The company added 9,36,000 new accounts, bringing cards-in-force to 2.15 crores with 10% annual growth. Profit after tax was INR 445 crores, up 10% year-over-year. However, cost-to-income ratio increased to 56.8% due to higher festive campaign costs and corporate passback expenses. Asset quality showed improvement with gross NPA declining to 2.85% from 3.07% in the previous quarter. The company launched three new co-brand credit cards with Flipkart, PhonePe, and IndiGo during the quarter. Net interest margin stood at 11.2% with portfolio yield at 16.5%. Management expects credit costs to decline below 9% in the coming quarters and maintains guidance for new card sourcing at 0.9-1 million accounts.",
            "Sentiment": "positive",
            "PublishDate": 1761923007125,
            "Source": "earnings"
        },
        {
            "Title": "SBI Cards Adjusts FY26 Guidance, Expects Credit Costs Below 9%",
            "Summary": "SBI Cards anticipates credit costs to remain under 9% in upcoming quarters. The company has adjusted its FY26 cost-to-income ratio guidance higher due to increased corporate spending. SBI Cards maintains its guidance of adding 0.9-1.0 million new accounts while lowering its IBNEA guidance to 10-12%. The company aims to maintain current NIM levels.",
            "Sentiment": "neutral",
            "PublishDate": 1761536650791,
            "Source": "stock"
        },
        {
            "Title": "SBI Cards Reports 10% Net Profit Growth Despite EBITDA Margin Decline in Q2",
            "Summary": "SBI Cards and Payment Services reported net profit of 4.4 billion rupees in Q2, up from 4 billion rupees year-over-year, though falling short of estimates of 5.93 billion rupees. Revenue grew to 49.6 billion rupees from 44.2 billion rupees in the same period last year. However, EBITDA declined to 12.2 billion rupees from 12.5 billion rupees year-over-year, with EBITDA margin contracting to 24.57% from 28.23% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761523769479,
            "Source": "earnings"
        },
        {
            "Title": "SBI Cards Reports Improved Asset Quality with GNPA at 2.85% and NNPA at 1.29%",
            "Summary": "SBI Cards and Payment Services reported quarterly gross non-performing assets (GNPA) at 2.85%, down from 3.07% in the previous quarter. Net non-performing assets (NNPA) also improved to 1.29% from 1.42% quarter-on-quarter. The company recorded a 31% increase in receivables and is focusing on building a profitable card portfolio while reducing credit costs. SBI Cards is planning a new growth phase emphasizing strong spending trends, digital growth, and operational expansion.",
            "Sentiment": "positive",
            "PublishDate": 1761324679722,
            "Source": "earnings"
        },
        {
            "Title": "SBI Cards Receives Credit Rating Reaffirmation from ICRA, Term Loan Facility Enhanced to Rs 15,000 Crore",
            "Summary": "ICRA Limited has reaffirmed SBI Cards and Payment Services Limited's credit ratings across multiple debt instruments totaling Rs 75,850 crore. The rating agency maintained [ICRA]AAA (Stable) ratings for non-convertible debentures (Rs 8,550 crore), subordinated debt (Rs 5,300 crore), and bank lines/commercial paper programs (Rs 47,000 crore). ICRA enhanced the term loan facility from Rs 10,000 crore to Rs 15,000 crore while reaffirming the [ICRA]AAA (Stable) rating. The agency withdrew ratings for Rs 500 crore non-convertible debentures as no amount remains outstanding. ICRA cited SBI Cards' strong parentage with State Bank of India holding a 68.59% stake, adequate capitalization with Tier I capital adequacy at 17.95%, and comfortable profitability despite recent moderation. However, asset quality indicators weakened with gross stage 3 at 3.1% and elevated credit costs at 7.1% in Q1 FY2026. The company reported profit after tax of Rs 1,916 crore in FY2025 on total assets of Rs 67,451 crore, with return on assets declining to 3.0% from 4.5% in FY2024.",
            "Sentiment": "neutral",
            "PublishDate": 1761324572654,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Cards Reports Decline in Q2 EBITDA and Margin Performance",
            "Summary": "SBI Cards and Payment Services reported Q2 EBITDA of 12.2 billion rupees, down from 12.5 billion rupees in the same quarter last year. The company's EBITDA margin also decreased to 24.57% from 28.23% year-over-year, indicating reduced profitability efficiency compared to the previous year's performance.",
            "Sentiment": "negative",
            "PublishDate": 1761320586085,
            "Source": "earnings"
        },
        {
            "Title": "SBI Cards Reports 10% Growth in Net Profit to 4.4B Rupees, Revenue Rises to 49.6B Rupees",
            "Summary": "SBI Cards and Payment Services reported a net profit of 4.4 billion rupees for the second quarter, representing a 10% increase from 4 billion rupees in the same period last year. However, the profit fell short of analyst estimates of 5.93 billion rupees. The company's revenue grew to 49.6 billion rupees from 44.2 billion rupees year-over-year, marking a 12.2% increase.",
            "Sentiment": "neutral",
            "PublishDate": 1761309387791,
            "Source": "earnings"
        },
        {
            "Title": "SBI Cards Sees Major GST Demand Relief as ₹81.45 Crore Claim Dropped",
            "Summary": "SBI Cards And Payment Services received significant relief as the CGST Authority dropped a GST demand of ₹81.45 crore. However, a smaller demand of ₹47.54 lakh has been confirmed due to documentation problems, which the company plans to appeal.",
            "Sentiment": "positive",
            "PublishDate": 1760606115124,
            "Source": "stock"
        },
        {
            "Title": "SBI Cards and RBL Bank Shares Surge on RBI's Proposed Credit Risk Capital Framework Changes",
            "Summary": "Shares of SBI Cards & Payment Services and RBL Bank rose up to 5% following the Reserve Bank of India's draft guidelines for credit risk capital framework. The proposed changes would reduce risk weight for 'transactor' category credit cards to 100% from 125%, while maintaining 125% for personal loans and regular credit cards. Transactor users consistently pay their full credit card balance by the due date, avoiding interest charges. SBI Cards has 40% of its ₹56,607 crore total receivables from transactor users, with Macquarie noting this could release 450 basis points worth of capital. RBL Bank benefits as 18% of its loan book comes from credit cards, with 30% of its ₹21,499 crore assets under management from transactors. RBL Bank shares closed 4.9% higher at ₹287, while SBI Cards gained 1.8% to ₹921.3.",
            "Sentiment": "positive",
            "PublishDate": 1759919313185,
            "Source": "stock"
        },
        {
            "Title": "SBI Card Implements New Transaction Fees on Education Payments and Wallet Loads",
            "Summary": "SBI Card announced transaction fee changes effective November 1. The company will introduce a 1% fee on education payments made through third-party apps, while payments made directly to schools or colleges via official websites or POS machines remain exempt. Additionally, a 1% fee will apply to all wallet load transactions exceeding ₹1,000. The card issuer continues its reward points program for Ajio and JioMart shopping launched in October, where Reliance SBI Card PRIME holders earn 20 reward points per ₹100 spent and other cardholders earn 10 reward points per ₹100 spent. SBI Card also migrated all CPP customers to updated plan variants with revised features and prices from September 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1759400430269,
            "Source": "stock"
        },
        {
            "Title": "SBI Cards Partners With IndiGo to Launch Co-Branded Credit Card",
            "Summary": "SBI Cards has partnered with IndiGo to launch the IndiGo SBI Card. The credit card offers users the opportunity to earn up to 29,000 bonus BluChips annually. Two card variants are available, providing rewards of up to 7% on IndiGo purchases.",
            "Sentiment": "positive",
            "PublishDate": 1758784121313,
            "Source": "order&deals"
        },
        {
            "Title": "SBI Cards Appoints New Company Secretary as Chief People Officer Resigns",
            "Summary": "SBI Cards and Payment Services Ltd has made two key leadership changes. Payal Mittal Chhabra has been appointed as the new Company Secretary effective September 19, 2025. Separately, Anita Sontumyra has resigned from her position as Chief People Officer effective September 18, 2025, citing repatriation to State Bank of India as the reason for her departure.",
            "Sentiment": "neutral",
            "PublishDate": 1758273427210,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Cards Participates in BoFA Securities Group Call with 42 Institutional Investors",
            "Summary": "SBI Cards and Payment Services Limited participated in a group call organized by BoFA Securities on September 15, 2025, from 12:05 PM to 12:50 PM in Gurugram. The call included 42 institutional participants, comprising major asset management companies, mutual funds, insurance companies, and international investment firms including Aditya Birla Sun Life AMC, Axis Mutual Fund, Bajaj Allianz Life Insurance, Citadel Advisors Europe, HSBC Asset Management, Nomura Asset Management, and Tata Mutual Fund among others. The company shared information already available in the public domain during the investor relations activity.",
            "Sentiment": "neutral",
            "PublishDate": 1757940585199,
            "Source": "stock"
        },
        {
            "Title": "SBI Cards Partners with Flipkart to Launch Co-Branded Credit Card with Tiered Cashback Benefits",
            "Summary": "SBI Cards and Payment Services has partnered with Flipkart to launch the Flipkart SBI Credit Card, offering tiered cashback rewards across multiple spending categories. The card provides 5% cashback on Flipkart and Cleartrip transactions, up to 7.5% on Myntra purchases, 4% on platforms like Zomato, Uber, Netmeds and PVR, and 1% on other eligible transactions. New members receive a Rs 250 Flipkart gift card as a welcome reward. The card features annual fee reversal for spending above Rs 3.5 lakh, 1% fuel surcharge waiver (capped at Rs 400 per billing cycle) on transactions between Rs 500-Rs 4,000, contactless payment capability, and global ATM access. Additional features include add-on cards for up to three family members, Easy Bill Pay for utility payments, and Flexipay facility for converting purchases above Rs 2,500 into EMIs within 30 days.",
            "Sentiment": "positive",
            "PublishDate": 1756892332777,
            "Source": "order&deals"
        },
        {
            "Title": "SBI Card and Flipkart Launch Co-Branded Credit Card Through Strategic Partnership",
            "Summary": "SBI Card and Flipkart have formed a strategic alliance and launched the Flipkart SBI co-branded credit card. This partnership brings together the financial services expertise of SBI Card with Flipkart's e-commerce platform to offer customers a new credit card product.",
            "Sentiment": "positive",
            "PublishDate": 1756205385858,
            "Source": "order&deals"
        },
        {
            "Title": "SBI Card Reduces Card Protection Plan Pricing While Enhancing Benefits",
            "Summary": "SBI Card will revise its Card Protection Plan benefits and pricing starting September 16, migrating all active customers to new plan variants on their renewal dates. The revised structure introduces three variants - Classic, Premium, and Platinum - with significantly reduced pricing. Classic plans drop from ₹1,199-₹1,899 to ₹999, Premium from ₹2,499 to ₹1,499, and Platinum from ₹3,199 to ₹1,999. Key benefits include one-call card blocking, SIM card blocking, emergency travel assistance with advances ranging from ₹80,000 to ₹1.6 lakh, fraud protection coverage up to ₹1 lakh for PIN-based frauds and phishing, and mobile wallet protection up to ₹10,000-₹50,000. Family coverage varies by plan, with Classic covering only the primary member, Premium covering member and spouse, and Platinum extending to member, spouse, and parents. Customers will receive prior communication via SMS or email at least 24 hours before renewal.",
            "Sentiment": "positive",
            "PublishDate": 1756200846867,
            "Source": "stock"
        },
        {
            "Title": "SBI Card Removes Reward Points for Digital Gaming and Government Transactions on Select Cards",
            "Summary": "SBI Card will discontinue reward points on digital gaming platforms and government-related transactions for three specific cards starting September 1. The affected cards are Lifestyle Home Centre SBI Card, Lifestyle Home Centre SBI Card SELECT, and Lifestyle Home Centre SBI Card PRIME. Cardholders will no longer earn reward points on purchases like gaming credits or government bill payments. SBI Card charges a redemption fee of Rs 99 plus taxes when customers redeem reward points. Reward points cannot be transferred between different SBI cards and can only be used to pay outstanding balances in multiples of 2,000. HDFC Bank implemented similar restrictions on online skill-based gaming transactions in July.",
            "Sentiment": "negative",
            "PublishDate": 1756105946820,
            "Source": "stock"
        },
        {
            "Title": "SBI Card Reduces Reward Points and Card Protection Benefits Starting September",
            "Summary": "SBI Card announced changes effective September that will impact customer benefits. Starting September 1, three Lifestyle Home Centre SBI Card variants will stop earning reward points on digital gaming transactions and government-related payments. From September 16, Card Protection Plan memberships will automatically migrate to new plan variants with updated features and pricing on each customer's renewal date. The company has also removed complimentary air accident insurance coverage from multiple co-branded cards, including ₹1 crore cover from six ELITE variants and ₹50 lakh cover from other PRIME and Platinum co-branded cards with partner banks.",
            "Sentiment": "negative",
            "PublishDate": 1755771225076,
            "Source": "stock"
        },
        {
            "Title": "SBI Cards Launches Bank of Maharashtra Co-Branded Credit Card for Domestic Market",
            "Summary": "SBI Cards and Payment Services Limited launched the Bank of Maharashtra SBI Card on August 18, 2025. The new product is a banking co-branded credit card designed for the domestic market. The company disclosed this product launch through regulatory filings to stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1755516992513,
            "Source": "stock"
        },
        {
            "Title": "SBI Cards Appoints Payal Mittal Chhabra as Company Secretary",
            "Summary": "SBI Cards and Payment Services Ltd has appointed Payal Mittal Chhabra as the new Company Secretary. Her appointment is evidenced by her digital signature on an official company document dated August 13, 2025. The document also references a brief profile of Rajnikant Patel in an annexure.",
            "Sentiment": "neutral",
            "PublishDate": 1755107454762,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Cards Reports 12% Revenue Growth to ₹5,035 Crore in Q1 FY26, Credit Costs Rise to 9.6%",
            "Summary": "SBI Cards posted total revenue of ₹5,035 crore in Q1 FY26, up 12% year-on-year and 4% quarter-on-quarter. Profit after tax declined 6% year-on-year to ₹556 crore but increased 4% sequentially. The company added 8.73 lakh new accounts, bringing cards-in-force to 2.12 crore with 10% year-on-year growth. Total spends reached ₹93,244 crore, growing 21% year-on-year, with retail spends at ₹82,404 crore (15% growth). Receivables grew 7% year-on-year to ₹56,607 crore. Credit costs increased to 9.6% from 9.0% in the previous quarter due to ECL rate increases from periodic data refresh. GNPA remained stable at 3.07% versus 3.08% in the previous quarter. Stage 2 balances reduced by ₹128 crore quarter-on-quarter to ₹2,673 crore. Cost of funds improved to 7.1% from 7.3% in Q4 FY25, benefiting from repo rate cuts. Net Interest Margin increased to 11.2% with portfolio yield steady at 17%. The company maintains 19.1% market share in card issuance and 16.6% in card spends. Management revised receivables growth guidance to 10-12% from earlier 12-14% projections. Capital Adequacy Ratio stood at 23.2% with ROAE at 15.8%.",
            "Sentiment": "neutral",
            "PublishDate": 1754046633010,
            "Source": "earnings"
        },
        {
            "Title": "SBI Cards Raises Rs 2,000 Crores Through Non-Convertible Debentures",
            "Summary": "SBI Cards and Payment Services Limited has allotted 2,00,000 non-convertible debentures worth Rs 2,000 crores through private placement. The unsecured debentures carry a face value of Rs 1,00,000 each and offer a coupon rate of 7.05% per annum. The debentures have a tenure of 3 years, with allotment on July 30, 2025, and maturity on July 28, 2028. Interest will be paid annually, with the first payment due on July 30, 2026. The debentures will be listed on the Wholesale Debt Market Segment of BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753870902838,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Cards Shares Drop 6% as Quarterly Profit Falls 6.5%",
            "Summary": "SBI Cards and Payment Services shares declined over 6% following a 6.5% drop in net profit to Rs 556 crore in the June quarter, compared to Rs 594 crore in the same period last year. Provision expenses increased 23% year-on-year to Rs 1,351 crore. Asset quality remained stable with gross NPA at 3.07% and net NPA flat at 1.42%. Customer spends grew 21% to Rs 93,244 crore, driven by corporate spending recovery and retail spending pickup. Receivables rose 7% to Rs 56,607 crore. The stock traded down 5.7% at Rs 830, with trading volume at 1.9 times the 30-day average. Among 29 analysts covering the stock, 7 recommend buy, 10 hold, and 12 sell, with an average price target of Rs 880.",
            "Sentiment": "negative",
            "PublishDate": 1753693887431,
            "Source": "earnings"
        },
        {
            "Title": "SBI Cards Shares Drop Over 6% as Brokerages Downgrade Stock Following Quarterly Results",
            "Summary": "SBI Cards and Payment Services shares declined over 6% following its quarterly results. Morgan Stanley downgraded the stock to 'underweight' with a price target of ₹710, citing higher credit costs due to increased stressed asset creation and rising ECL coverage. Bernstein maintained an 'underperform' rating with a ₹690 target, noting that elevated credit costs have become a consistent issue for SBI Cards. Among analyst coverage, 11 analysts have 'hold' and 'sell' ratings each, while 7 maintain 'buy' recommendations. Bernstein suggested that market reactions to SBI Cards' results have typically been temporary over recent quarters.",
            "Sentiment": "negative",
            "PublishDate": 1753674660723,
            "Source": "stock"
        },
        {
            "Title": "SBI Card Focuses on Tier-2+ Market Expansion and Digital Innovation for Growth",
            "Summary": "SBI Card is pursuing sustained growth through several strategic initiatives including expanding penetration in tier-2 and beyond cities, digital innovation, and strategic co-branded offerings. The company is benefiting from accelerating retail and UPI spending patterns. SBI Card maintains stable asset quality and holds a strong capital position to support its growth plans.",
            "Sentiment": "positive",
            "PublishDate": 1753449872343,
            "Source": "stock"
        },
        {
            "Title": "SBI Cards Reports Mixed Q1 Results with Revenue Growth and Profit Decline",
            "Summary": "SBI Cards and Payment Services reported Q1 results showing revenue growth to 48.8 billion rupees compared to 43.6 billion rupees in the previous year. However, net profit declined to 5.6 billion rupees from 5.94 billion rupees year-over-year. Asset quality showed marginal improvement with Gross Non-Performing Assets (GNPA) decreasing to 3.07% from 3.08% quarter-over-quarter, while Net Non-Performing Assets (NNPA) improved to 1.42% from 1.46% quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753445236254,
            "Source": "earnings"
        },
        {
            "Title": "SBI Card Discontinues Air Accident Insurance Cover on Multiple Co-branded Credit Cards",
            "Summary": "SBI Card will discontinue complimentary air accident insurance coverage on several co-branded credit cards from August 11. Cards offering ₹1 crore coverage include UCO Bank SBI Card ELITE, Central Bank of India SBI Card ELITE, PSB SBI Card ELITE, KVB SBI Card ELITE, KVB SBI Signature Card, and Allahabad Bank SBI Card ELITE. Cards with ₹50 lakh coverage being discontinued include various PRIME and Platinum variants across multiple partner banks. SBI Card recently revised its billing processes from July 15, changing how Minimum Amount Due is calculated to include full GST, EMIs, fees, charges, finance charges, and over-limit amounts plus 2% of remaining unpaid balance. The company also modified payment adjustment order, prioritizing GST, EMIs, fees, charges, finance charges, balance transfers, retail transactions, and cash advances in sequence.",
            "Sentiment": "negative",
            "PublishDate": 1753344899287,
            "Source": "stock"
        },
        {
            "Title": "SBI Card and PhonePe Launch Co-Branded Credit Cards with Up to 10% Rewards",
            "Summary": "SBI Card and PhonePe have launched co-branded credit cards in two variants - SELECT BLACK and PURPLE. The SELECT BLACK card offers up to 10% value back as reward points for spending on the PhonePe app and up to 5% back on other online shopping. The cards operate on RuPay and VISA networks, with RuPay versions linkable to UPI for payments at UPI merchants. Both cards reward spending on groceries, bills, travel, utilities, and insurance. Joining fees are returned as PhonePe e-gift vouchers of ₹1,500 for SELECT BLACK and ₹500 for PURPLE. SELECT BLACK users receive a ₹5,000 travel voucher for ₹5 lakh annual spending, while PURPLE cardholders get ₹3,000 for ₹3 lakh annual spending. Additional benefits include domestic lounge access, Priority Pass membership for SELECT BLACK users, and 1% fuel surcharge waiver. Customers can apply and repay bills through the PhonePe app, with the launch rolling out in phases.",
            "Sentiment": "positive",
            "PublishDate": 1753170747832,
            "Source": "stock"
        },
        {
            "Title": "SBI Cards Partners With PhonePe to Launch Jointly Branded Credit Card",
            "Summary": "SBI Cards And Payment Services has partnered with PhonePe to introduce a jointly branded PhonePe SBI Card. The collaboration brings together the credit card issuer and the digital payments platform to offer a co-branded payment solution.",
            "Sentiment": "positive",
            "PublishDate": 1753166456370,
            "Source": "order&deals"
        },
        {
            "Title": "SBI Cards Schedules Board Meeting on July 25 to Approve Quarterly Financial Results",
            "Summary": "SBI Cards and Payment Services Limited has scheduled a Board of Directors meeting for July 25, 2025, to consider and approve unaudited financial results for the quarter ended June 30, 2025. The company has implemented a trading window closure from July 1, 2025, which will remain in effect until 48 hours after the financial results are declared. The announcement was made through a regulatory communication to BSE and NSE exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753158379193,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Cards Schedules Q1 FY26 Earnings Conference Call for July 25, 2025",
            "Summary": "SBI Cards and Payment Services Limited will host an earnings conference call for Q1 FY26 on July 25, 2025, at 6:00 PM IST. The company has provided comprehensive dial-in details for domestic and international participants, including universal access numbers and toll-free numbers for Hong Kong, Singapore, UK, and USA. Participants are advised to dial in 10 minutes prior to avoid delays, with pre-registration available through a Diamond Pass link. The earnings call will be conducted with analysts and investors to discuss the company's quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1753155434515,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Cards and Payment Services: Goldman Sachs Downgrades Stock After Recent Rally",
            "Summary": "Goldman Sachs downgraded SBI Card to 'Neutral' from its previous stance, setting a new price target of ₹1,006 per share. The downgrade follows a sharp re-rating in recent months, with the stock's valuation now more than one standard deviation above its historical average. Key focus areas include credit costs and loan growth, particularly in the subdued credit card loan segment.",
            "Sentiment": "neutral",
            "PublishDate": 1751446417000,
            "Source": "normal_news"
        },
        {
            "Title": "SBI Cards and Payment Services: GST Notice for ₹81.93 Crore Input Tax Credit Claim",
            "Summary": "SBI Cards received a show cause notice from CGST Gurugram proposing to disallow input tax credit of ₹81.93 crore for FY 2018-19 to 2020-21. The company has 30 days to respond and believes it has a strong case for a favorable outcome.",
            "Sentiment": "negative",
            "PublishDate": 1751383152000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Cards Receives GST Notice for ₹81.93 Crore Tax Credit Dispute",
            "Summary": "SBI Cards has received a notice from the Goods and Services Tax (GST) authorities regarding a disagreement over tax credits amounting to ₹81.93 crore. The notice indicates a potential tax liability or dispute that the company needs to address.",
            "Sentiment": "negative",
            "PublishDate": 1751380793000,
            "Source": "default"
        },
        {
            "Title": "SBI Cards Partners with Apollo HealthCo",
            "Summary": "SBI Cards and Payment Services has entered into a partnership with Apollo HealthCo. This collaboration likely aims to enhance healthcare-related payment services or offer co-branded credit cards with healthcare benefits.",
            "Sentiment": "positive",
            "PublishDate": 1747293372000,
            "Source": "default"
        }
    ]
}