{
    "Symbol": "SBILIFE",
    "ISIN": "INE123W01016",
    "News": [
        {
            "Title": "SBI Life Notifies Shareholders on IEPF Transfer",
            "Summary": "SBI Life Insurance alerts shareholders about transfer of unclaimed dividends from FY2018-19 and shares to IEPF Authority by April 17, 2026, unless claimed before deadline.",
            "Sentiment": "neutral",
            "PublishDate": 1770140224735,
            "Source": "stocks"
        },
        {
            "Title": "SBI Life Q3 Net Profit Rises 5.5% to ₹5.8 Billion",
            "Summary": "SBI Life Insurance Company reported a net profit of ₹5.8 billion for Q3, marking a 5.5% increase from ₹5.5 billion in the same quarter last year, though falling short of analyst estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1769592448081,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Life Gets Macquarie Upgrade to Outperform",
            "Summary": "Macquarie upgrades SBI Life Insurance from Neutral to Outperform rating and raises target price to ₹2,360.00, signaling positive outlook for the insurance major.",
            "Sentiment": "positive",
            "PublishDate": 1768190026349,
            "Source": "stocks"
        },
        {
            "Title": "Macquarie Upgrades SBI Rating, Raises Target Price",
            "Summary": "Macquarie has upgraded State Bank of India from Underperform to Outperform rating and raised the target price to ₹1,150.00 per share, reflecting improved confidence in the bank's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1768189944502,
            "Source": "stocks"
        },
        {
            "Title": "SBI Life Insurance Block Trade Worth ₹28.73 Crores",
            "Summary": "SBI Life Insurance Company witnessed a significant block trade on NSE worth ₹28.73 crores involving 138,243 shares at ₹2,078.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767852203857,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Life Insurance Sees ₹29.76 Cr Block Trade",
            "Summary": "SBI Life Insurance Company witnessed a significant block trade worth ₹29.76 crores on NSE, involving 141,641 shares at ₹2,101.30 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767760198285,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Life Insurance Block Trade Worth ₹42.80 Crores",
            "Summary": "SBI Life Insurance witnessed a significant NSE block trade of ₹42.80 crores involving 204,653 shares at ₹2,091.40 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767593280138,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Life Receives GST Order with ₹70.88 Lakh Demand",
            "Summary": "SBI Life Insurance received GST order from Chennai authorities demanding ₹70.88 lakhs including tax, interest and penalty for FY 2021-22. Company plans to file appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1767028010417,
            "Source": "stocks"
        },
        {
            "Title": "SBI Life Receives GST Order with ₹8.23 Lakh Demand",
            "Summary": "SBI Life Insurance Company received GST order from Delhi tax authorities demanding ₹8.23 lakh for FY 2021-22, including tax, interest and penalty. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766922711394,
            "Source": "stocks"
        },
        {
            "Title": "SBI Life Receives ₹14.67 Cr GST Demand Order",
            "Summary": "SBI Life Insurance received a GST demand order worth ₹14.67 crores from Maharashtra tax authorities over ITC mismatch claims for FY 2021-22. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766769202828,
            "Source": "stocks"
        },
        {
            "Title": "SBI Life Receives GST Order Worth ₹10.65 Lakh",
            "Summary": "SBI Life Insurance receives GST demand order from Bihar tax authorities for FY2021-22, totaling ₹10.65 lakh including tax, interest and penalty. Company to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766423412066,
            "Source": "stocks"
        },
        {
            "Title": "Citi Maintains Buy Rating on SBI with ₹1,110 Target",
            "Summary": "Citi maintains its buy recommendation on State Bank of India with a target price of ₹1,110, indicating positive outlook for the banking stock.",
            "Sentiment": "positive",
            "PublishDate": 1765943296894,
            "Source": "stocks"
        },
        {
            "Title": "SBI Life Gets SAT Approval for Sahara Life Transfer",
            "Summary": "Securities Appellate Tribunal upholds IRDAI order directing SBI Life Insurance to acquire all policyholder assets and liabilities from Sahara India Life Insurance Company.",
            "Sentiment": "positive",
            "PublishDate": 1765384670586,
            "Source": "stocks"
        },
        {
            "Title": "Court Rejects SILIC Appeal Against IRDAI Decision",
            "Summary": "A court has dismissed SILIC's appeal challenging a regulatory decision by IRDAI, marking a significant development in the insurance sector regulatory landscape.",
            "Sentiment": "neutral",
            "PublishDate": 1765381550198,
            "Source": "stocks"
        },
        {
            "Title": "SBI Life Insurance Receives GST Demand Order Worth Rs 68.77 Crore",
            "Summary": "SBI Life Insurance Company received a GST demand order from Joint Commissioner of CGST Bhopal for violations including GST charges on ULIP charges, non-reversal of input tax credit, and ITC mismatches for financial years 2018-19 to 2023-24. The total demand amounts to Rs 68,76,89,564 comprising tax of Rs 62.31 crore, unquantified interest, and penalty of Rs 6.46 crore, with the company planning to file an appeal against the order.",
            "Sentiment": "negative",
            "PublishDate": 1764166628553,
            "Source": "stock"
        },
        {
            "Title": "SBI Life Allots 137,191 Equity Shares Under Employee Stock Option Scheme",
            "Summary": "SBI Life's Board Stakeholders Relationship & Sustainability Committee allotted 137,191 equity shares of Rs. 10 each to employees exercising vested stock options under the company's 2018 Employee Stock Option Scheme. Following this allotment, the company's paid-up share capital increased to Rs. 10,02,70,51,930 consisting of 1,00,27,05,193 equity shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763470927448,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Life Appoints Ganesh Prasad as Chief Audit Officer, Replaces Hema B.",
            "Summary": "SBI Life Insurance Company's Board approved the appointment of Ganesh Prasad as Chief Audit Officer effective November 15, 2025, while Hema B. will be relieved from the position and repatriated to State Bank of India. Prasad brings over 23 years of banking and finance experience, having previously served in various roles at SBI including VP Concurrent Auditor at SBI Hong Kong Operations.",
            "Sentiment": "neutral",
            "PublishDate": 1763051043542,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Life Reports 20.3% Growth in First-Year Premium to ₹31.85 Billion in October",
            "Summary": "SBI Life Insurance reported first-year premium collections of ₹31.85 billion in October, marking a 20.3% year-on-year increase. This growth indicates strong business performance in new policy acquisitions for the insurance company during the month.",
            "Sentiment": "positive",
            "PublishDate": 1762749480239,
            "Source": "stock"
        },
        {
            "Title": "SBI Life Reports 17% New Business Premium Growth to INR 183.5 Billion in H1 FY26",
            "Summary": "SBI Life Insurance reported new business premium of INR 183.5 billion with 17% growth and maintained private market share of 22.2% for the half year ended September 30, 2025. Individual rated new business premium stood at INR 86.8 billion with 7% growth. Gross written premium reached INR 429 billion with 19% growth. Profit after tax grew 4% to INR 10.89 billion. Value of new business increased 14% to INR 27.5 billion with VoNB margin at 27.8%, up 98 basis points. The company faced GST impact of 80 basis points on margins due to non-availability of input tax credit. Protection business showed strong performance with 33% year-on-year growth on APE basis. Individual protection sum assured grew 108% while group protection APE increased 44%. The company launched two new products - SmartShield Plus and SmartMoney Back Plus, with the latter attracting over 8,500 customers within 15 days. Assets under management stood at INR 4.81 trillion with 10% growth. Solvency ratio remained strong at 1.94 against regulatory requirement of 1.50. Management expects protection business to exceed 10% of total APE and guided for individual APE growth of 13-14% for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761918218606,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Insurance Sees Rs. 16.65 Crore Block Trade on NSE",
            "Summary": "SBI Life Insurance Company executed a block trade worth Rs. 16.65 crores on the National Stock Exchange. The transaction involved approximately 86,509 shares at a price of Rs. 1,925.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761625561816,
            "Source": "order&deals"
        },
        {
            "Title": "SBI Life Anticipates VNB Margin Pressure from GST Changes",
            "Summary": "SBI Life expects pressure on its Value of New Business (VNB) margins due to changes in GST regulations. The insurance company anticipates these tax modifications will impact its profitability metrics for new business written.",
            "Sentiment": "negative",
            "PublishDate": 1761553649631,
            "Source": "stock"
        },
        {
            "Title": "SBI Life Shares Rise 5% After Strong Q2 Results, Analysts Set Target Prices Up to ₹2,550",
            "Summary": "SBI Life Insurance Company shares gained nearly 5% following their September quarter earnings release. The company reported a 14% increase in value of new business (VNB) for the second quarter, with VNB margins expanding by 100 basis points year-over-year to 28%. Total annualised premium equivalent (APE) grew 10% in Q2, driven by 55.8% growth in group APE, while retail APE increased 6%. Three major brokerages issued buy ratings: Citi set a target price of ₹2,550, Jefferies at ₹2,270, and Nuvama at ₹2,320, representing potential upside of up to 39% from the previous closing price of ₹1,839.8. Management reiterated guidance of 13-14% APE growth for FY26 and VNB margins of 26-28%. Analysts noted that margin expansion was supported by favorable product mix shifts toward higher-yielding segments, and the impact of input tax credit benefit absence remains manageable. The stock has gained 35.4% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1761552463972,
            "Source": "stock"
        },
        {
            "Title": "SBI Life Maintains Growth Targets with 15% Non-SBI Partnership Growth and 13-14% APE Growth for FY26",
            "Summary": "SBI Life expects to maintain or slightly exceed a 15% growth rate for non-SBI bank partnerships. The company anticipates keeping September's growth momentum with a 15% increase in individual rated premiums through October. For FY26, SBI Life projects 13-14% individual APE growth and maintains its VNB margin guidance between 26-28%.",
            "Sentiment": "positive",
            "PublishDate": 1761536634495,
            "Source": "stock"
        },
        {
            "Title": "SBI Life Insurance Reports Q2 Net Profit of 5B Rupees, Revenue Rises to 248B Rupees",
            "Summary": "SBI Life Insurance Company reported Q2 net profit of 5 billion rupees compared to 5.39 billion rupees in the same period last year. The company's Q2 revenue increased to 248 billion rupees from 202 billion rupees year-over-year. The results show revenue growth but a decline in net profit compared to the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761302798425,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Reports 32.1% Growth in First Year Premium to INR 39.53 Billion",
            "Summary": "SBI Life reported first year premium of INR 39.53 billion in September, marking a 32.1% increase compared to the same period last year. This growth indicates strong performance in the company's new business acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1760003776999,
            "Source": "stock"
        },
        {
            "Title": "SBI Life Appoints Dorababu Daparti as Deputy Chief Executive Officer",
            "Summary": "SBI Life Insurance Company Limited appointed Mr. Dorababu Daparti as Deputy Chief Executive Officer effective February 24, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Board Nomination and Remuneration Committee. Mr. Daparti brings over 29 years of experience in the financial industry and holds a postgraduate degree in sciences (M.Sc.) and is a Chartered Associate of the Indian Institute of Bankers (CAIIB). He began his career with SBI in 1995 and has held various managerial and executive roles within the organization. He served as Country Head & CEO of State Bank of India (SBI) Maldives operations since September 2021 and previously worked as Deputy General Manager & Head of the Department- Overseas Planning & Strategy in the International Banking Group at the Bank's Corporate Centre in Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1757077713605,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Life Insurance Announces GST Reduction on Individual Life Insurance Policies from September 2025",
            "Summary": "SBI Life Insurance Company announced that Goods and Service Tax (GST) on Individual Life Insurance policies will be reduced effective September 22, 2025, following a government announcement. The company expects minimal impact of less than 0.2% on Embedded Value and anticipates the change will stimulate demand and positively affect long-term value generation. SBI Life is aligning its products and processes to ensure smooth transition to the new regime, viewing the reform as a step towards making insurance more affordable and accessible.",
            "Sentiment": "positive",
            "PublishDate": 1757044321439,
            "Source": "stock"
        },
        {
            "Title": "SBI Life Insurance Sees Rs. 18.20 Crore Block Trade on NSE",
            "Summary": "SBI Life Insurance Company executed a block trade worth Rs. 18.20 crores on the National Stock Exchange. The transaction involved approximately 98,751 shares at a price of Rs. 1,842.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1756957817382,
            "Source": "order&deals"
        },
        {
            "Title": "SBI Life and Insurance Leaders Oppose GST Reduction, Warn of Industry Impact",
            "Summary": "SBI Life and other insurance industry leaders have warned against reducing GST to 5% or removing it entirely, stating it would negatively impact the industry. They argue that such changes would increase costs and premiums while simultaneously reducing demand. The industry is considering requesting the government to review any proposed GST reduction.",
            "Sentiment": "negative",
            "PublishDate": 1755503362001,
            "Source": "sectoral"
        },
        {
            "Title": "IRDAI Will Not Impose Restrictions on SBI Life's Bancassurance Operations Through Parent Bank",
            "Summary": "The Insurance Regulatory and Development Authority of India (IRDAI) has decided not to limit SBI Life's bancassurance business conducted through its parent bank SBI. This regulatory stance allows SBI Life to continue its current bancassurance distribution model without restrictions.",
            "Sentiment": "positive",
            "PublishDate": 1754027450984,
            "Source": "stock"
        },
        {
            "Title": "SBI Life Reports 14% Profit Growth and 27.4% VoNB Margin in Q1 FY26",
            "Summary": "SBI Life Insurance reported quarterly results with profit after tax growing 14% to INR 5.94 billion. The company achieved a Value of New Business margin of 27.4%, up 62 basis points from the previous year. New business premium stood at INR 72.7 billion with a private market share of 21.3%. Individual rated new business premium reached INR 34.7 billion, growing 8% year-on-year. Gross written premium increased 14% to INR 178.14 billion. The protection segment showed strong growth of 53% on APE basis, contributing 11.7% of total APE. The company maintained its solvency ratio at 1.96 against the regulatory requirement of 1.50. Assets under management grew 15% to INR 4.76 trillion. The company added over 31,000 agents and opened 36 new branches during the quarter. Management indicated they expect to maintain mid-teens growth guidance for the year while focusing on improving product mix toward guaranteed non-par savings and protection solutions.",
            "Sentiment": "positive",
            "PublishDate": 1753966961586,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Insurance Shares Rise Over 2% Following Strong Quarterly Results",
            "Summary": "SBI Life Insurance shares gained over 2% after reporting quarterly results. The company's net profit increased 14.4% year-on-year to Rs 594 crore for the April-June quarter, compared to Rs 520 crore in the same period last year. The insurer maintained its VNB margin guidance of 26-28% with a positive bias. Shares rose as much as 2.81% to Rs 1,844 before settling 2.45% higher at Rs 1,837. The stock has gained 8.52% over the past 12 months and 32.31% year-to-date. Of 37 analysts covering the company, 35 recommend 'buy' and two suggest 'hold', with the average 12-month price target indicating 14.9% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1753417831081,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Reports Strong Q1 Performance with 14% PAT Growth, Reappoints CEO",
            "Summary": "SBI Life Insurance reported robust quarterly results with Profit After Tax growing 14% to ₹5.9 billion and Annualized Premium Equivalent rising 9% to ₹39.7 billion. Value of New Business increased 12% to ₹10.9 billion with a margin of 27.4%. The company maintained its private market leadership in Individual Rated Premium with 22.3% market share. The board approved the re-appointment of Amit Jhingran as Managing Director & CEO for October 1, 2025 to January 31, 2027, subject to shareholder approval. Additionally, M/s. Aashish K. Bhatt & Associates was appointed as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. The company reported strong solvency ratio of 1.96 and Assets under Management grew 15% to ₹4.8 trillion.",
            "Sentiment": "positive",
            "PublishDate": 1753352598689,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Life Insurance Exceeds Q1 Estimates Across Key Metrics",
            "Summary": "SBI Life Insurance reported quarterly results that surpassed analyst estimates across major performance indicators. The company's Value of New Business (VNB) reached 10.9 billion rupees, beating the estimated 9.43 billion rupees. Total Annual Premium Equivalent (APE) came in at 39.7 billion rupees, above the forecast of 39.09 billion rupees. The VNB margin stood at 27.4%, slightly higher than the estimated 27.19%.",
            "Sentiment": "positive",
            "PublishDate": 1753351244940,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Insurance Reports Higher Q1 Net Premium Income and Profit",
            "Summary": "SBI Life Insurance Company reported Q1 net premium income of 172 billion rupees compared to 151 billion rupees in the same period last year. The company's Q1 net profit increased to 6 billion rupees from 5.2 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753350826566,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Q1FY26 Results Preview: APE Expected to Grow 2-8% YoY, VNB May Rise Up to 17%",
            "Summary": "SBI Life Insurance Company will announce its quarterly earnings on July 24. Four brokerages project Annual Premium Equivalent (APE) growth of 2-8% year-on-year, ranging from Rs 3,720 crore to Rs 3,936 crore. Value of New Business (VNB) is expected to increase 2-17% year-on-year, estimated between Rs 993 crore and Rs 1,133 crore. However, margins are anticipated to decline both year-on-year and quarter-on-quarter. Axis Securities forecasts the highest APE at Rs 3,936 crore (8.1% YoY growth) and VNB at Rs 1,132 crore (16.7% YoY increase). Nuvama provides the most conservative estimates with APE at Rs 3,720 crore (2% YoY growth) and VNB at Rs 993 crore (2% YoY growth). All brokerages highlight the importance of monitoring VNB margin trends, growth commentary, and product mix changes. PhillipCapital expects PAT of Rs 582 crore, up 12% year-on-year, while revenue is projected at Rs 3,858 crore, rising 6% year-on-year.",
            "Sentiment": "neutral",
            "PublishDate": 1753255436432,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Reports Strong Premium Growth in May",
            "Summary": "SBI Life has reported a 25% year-over-year increase in premiums for May. The company's total Annualized Premium Equivalent (APE) grew by 13%, while retail APE saw a 4% increase.",
            "Sentiment": "positive",
            "PublishDate": 1749458474000,
            "Source": "default"
        },
        {
            "Title": "DFS Secretary Assures Life Insurance Industry on Bancassurance Channel",
            "Summary": "The Secretary of the Department of Financial Services (DFS) has provided assurance to the life insurance industry that no action will be taken against the bancassurance channel. This news is particularly relevant to SBI Life, as bancassurance is a significant distribution channel for insurance products through banks.",
            "Sentiment": "positive",
            "PublishDate": 1745832461000,
            "Source": "default"
        },
        {
            "Title": "SBI Life Insurance: Share Price Surges 9% Following Q4 Results",
            "Summary": "SBI Life Insurance Company's share price increased by 9% in morning trading on Friday after the company announced its Q4 results on Thursday evening.",
            "Sentiment": "positive",
            "PublishDate": 1745553555000,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Insurance Company: Q4 Profit Flat, Annual PAT Up 27%",
            "Summary": "SBI Life reported a 0.3% increase in Q4 net profit to ₹814 crore. Annual PAT rose 27% to ₹2,400 crore. Value of New Business grew 7% to ₹5,950 crore. Non-participating business share increased, while unit-linked plans declined due to market volatility. The company decided to exit the group savings business.",
            "Sentiment": "neutral",
            "PublishDate": 1745541680000,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Insurance: Q4 Profit Flat, Premium Income Declines",
            "Summary": "SBI Life Insurance reported a marginal 0.3% YoY increase in Q4 consolidated net profit to Rs 813.5 crore. Net premium income fell 5% YoY to Rs 23,861 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1745489884000,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Insurance Q4 Financial Results",
            "Summary": "SBI Life Insurance Company reported its Q4 financial results. The net premium for the quarter stood at 239 billion rupees, compared to 251.16 billion rupees in the same quarter last year. The standalone net profit remained stable at 8.1 billion rupees, unchanged from the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1745488845000,
            "Source": "result"
        },
        {
            "Title": "SBI Life Insurance Company: Mixed Q4FY25 Projections with Potential APE Growth",
            "Summary": "Analysts project SBI Life's Q4FY25 Annualised Premium Equivalent (APE) to grow 0-7.8% YoY, ranging from Rs 5,347-5,740 crore. Value of New Business (VNB) estimates vary, with potential declines YoY and QoQ. VNB margins expected to compress or remain stable. Q4 results to be announced on April 24, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1745400959000,
            "Source": "earnings"
        },
        {
            "Title": "SBI Life Insurance Company: Q4 Results Announcement Scheduled",
            "Summary": "SBI Life Insurance Company will announce Q4 and FY25 results on April 24, 2025. Board meeting to approve audited financial results. Earnings call with analysts and investors scheduled for 4:15 p.m. on the same day. Trading window closed from April 1 until 48 hours after results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1745381349000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Life Insurance Company: Board Meeting Set for Q4 FY25 Results",
            "Summary": "SBI Life Insurance Company has scheduled a board meeting on April 24, 2025, to consider and approve the financial results for Q4 and the full year ended March 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1744183907000,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Life Insurance Company Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred on the National Stock Exchange (NSE) for SBI Life Insurance Company Ltd. The transaction involved approximately 347,995 shares, traded at a price of Rs. 1467.80 per share. The total value of this block trade amounted to Rs. 51.08 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1744088992000,
            "Source": "block_deals"
        },
        {
            "Title": "SBI Life Insurance Company Ltd: Receives ₹23.80 Crore Income Tax Penalty, Plans Appeal",
            "Summary": "SBI Life Insurance Company Ltd received an Income Tax Order imposing a ₹23.80 crore penalty for Assessment Year 2018-19. The company plans to appeal the order, stating it will have no adverse material impact on financial operations.",
            "Sentiment": "neutral",
            "PublishDate": 1743007900000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Life Insurance: Rs 352.50 Crore Income Tax Demand Challenged",
            "Summary": "SBI Life Insurance received an Income Tax order for AY 2023-24, demanding Rs 352.50 crore in tax and Rs 78.50 crore in interest. The company plans to appeal, citing erroneous calculations and incorrect tax rate application. SBI Life states this will not materially impact its financial operations.",
            "Sentiment": "neutral",
            "PublishDate": 1742872289000,
            "Source": "order&deals"
        },
        {
            "Title": "SBI Life Insurance Receives Income Tax Order with Demand of 3.53 Billion Rupees",
            "Summary": "SBI Life Insurance has received an income tax order that includes a tax demand of 3.53 billion rupees and interest of 785 million rupees. The company states that this order does not have any adverse material impact on SBI Life.",
            "Sentiment": "neutral",
            "PublishDate": 1742861341000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Life Insurance: ₹352.50 Crore Income Tax Order Received, Appeal Planned",
            "Summary": "SBI Life Insurance received an Income Tax Order demanding ₹352.50 crore in tax and ₹78.50 crore in interest for FY 2022-23. The company plans to appeal, citing erroneous tax calculations and misapplication of tax rates. SBI Life states this will not materially impact its financial operations.",
            "Sentiment": "neutral",
            "PublishDate": 1742832721000,
            "Source": "order&deals"
        }
    ]
}