{
    "Symbol": "SBIN",
    "ISIN": "INE062A01020",
    "News": [
        {
            "Title": "SBI Reports No Fund Deviation in Q3 FY26 Compliance Filing",
            "Summary": "State Bank of India submitted regulatory compliance disclosure for Q3 FY26, confirming no deviation in fund utilization. Bank raised ₹7,500 crore through Tier 2 bonds in October 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770458964625,
            "Source": "stocks"
        },
        {
            "Title": "SBI schedules analyst meet on Feb 7 post Q3FY26 results",
            "Summary": "State Bank of India has scheduled an interaction with analysts and institutional investors on February 7, 2026 at 5:15 PM IST following the declaration of Q3FY26 results. The meet will be held in-person at SBI's corporate centre with live webcast facility.",
            "Sentiment": "neutral",
            "PublishDate": 1769843239712,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Raises USD 250 Million Through Senior Unsecured Bond",
            "Summary": "State Bank of India successfully concluded issuance of USD 250 million senior unsecured floating rate notes with 12-month maturity and O/N SOFR+50 bps coupon, issued through London branch.",
            "Sentiment": "positive",
            "PublishDate": 1769600258842,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Block Trade Worth Rs. 52.20 Crores on NSE",
            "Summary": "State Bank of India witnessed a significant block trade on NSE worth Rs. 52.20 crores involving 491,548 shares at Rs. 1061.90 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1769581558714,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank of India Q3 Net Profit Rises 7% to ₹2,705 Cr",
            "Summary": "Bank of India shares hit 52-week high of ₹168.40 after reporting 7% growth in Q3 net profit to ₹2,705 crore, driven by higher non-core income and 14% advance growth.",
            "Sentiment": "positive",
            "PublishDate": 1769070811210,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Chairman sees private investment rebound post tariff disruption",
            "Summary": "CS Setty expects broad-based private investment recovery once US tariff disruption settles. SBI targets 11-12% balance sheet growth, focuses on AI integration for efficiency gains.",
            "Sentiment": "positive",
            "PublishDate": 1769040789054,
            "Source": "stocks"
        },
        {
            "Title": "Bank of India Q3 Fresh Slippages Rise to ₹10.9B",
            "Summary": "Bank of India reported fresh slippages of ₹10.9 billion in Q3, marking a sequential increase from ₹8.9 billion in the previous quarter, reflecting higher asset quality stress.",
            "Sentiment": "negative",
            "PublishDate": 1769009116115,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Q3 Results on Feb 7; Trading Window Closed",
            "Summary": "State Bank of India will announce Q3FY26 results on February 7, 2026, followed by analyst meet. Trading window closed from January 1 for designated persons until 48 hours post-results.",
            "Sentiment": "neutral",
            "PublishDate": 1769006823934,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI revises IMPS charges for high-value transfers",
            "Summary": "State Bank of India introduces service charges on IMPS transfers above ₹25,000 through digital channels from February 15, while maintaining free transfers for amounts up to ₹25,000.",
            "Sentiment": "neutral",
            "PublishDate": 1768993416812,
            "Source": "stocks"
        },
        {
            "Title": "SBI Stock Hits Fresh Record High in January 2026",
            "Summary": "State Bank of India shares reached new record levels after breaking out from month-long consolidation, rising over 16% in three months with experts suggesting potential upside to ₹1,100.",
            "Sentiment": "positive",
            "PublishDate": 1768865843516,
            "Source": "stocks"
        },
        {
            "Title": "SBI Block Trade: ₹44.41 Cr Deal at ₹1034.10",
            "Summary": "State Bank of India witnessed a significant block trade on NSE worth ₹44.41 crores involving 429,503 shares at ₹1034.10 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768538465726,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Hikes ATM Charges for Non-SBI ATM Usage",
            "Summary": "State Bank of India increases ATM transaction fees at other banks' ATMs from December 1, 2025. Cash withdrawals now cost ₹23 plus GST, up from ₹21, while balance enquiries cost ₹11 plus GST.",
            "Sentiment": "negative",
            "PublishDate": 1768282229202,
            "Source": "stocks"
        },
        {
            "Title": "SBI Har Ghar Lakhpati Scheme: ₹610 Monthly Investment",
            "Summary": "State Bank of India's Har Ghar Lakhpati scheme enables households to build ₹1 lakh corpus through systematic monthly investments of ₹610, making wealth creation accessible for all income levels.",
            "Sentiment": "positive",
            "PublishDate": 1768217757089,
            "Source": "stocks"
        },
        {
            "Title": "SBI Issues Deepfake Scam Alert for Customers",
            "Summary": "State Bank of India warns customers about AI-powered deepfake scams where fraudsters impersonate bank officials and trusted contacts through fake video calls and voice messages to steal money.",
            "Sentiment": "neutral",
            "PublishDate": 1768207386885,
            "Source": "stocks"
        },
        {
            "Title": "SBI Revises ATM Charges for Non-SBI Transactions",
            "Summary": "State Bank of India increases ATM charges at other banks from ₹21 to ₹23 plus GST for cash withdrawals, introduces 10-transaction cap for salary accounts while maintaining free limits for regular savings accounts.",
            "Sentiment": "neutral",
            "PublishDate": 1768194445928,
            "Source": "stocks"
        },
        {
            "Title": "SBI Revises ATM Transaction Charges for Customers",
            "Summary": "State Bank of India has updated ATM and ADWM transaction service charges, affecting customers using other banks' ATMs beyond free transaction limits for various account types.",
            "Sentiment": "neutral",
            "PublishDate": 1768117934229,
            "Source": "stocks"
        },
        {
            "Title": "SBI Stock Forms Bearish Head & Shoulders Pattern",
            "Summary": "State Bank of India shows bearish reversal signals after breaking below ₹1,002 neckline support on its 1-hour chart, with technical indicators confirming downward momentum despite strong yearly gains of 29.37%.",
            "Sentiment": "negative",
            "PublishDate": 1767937530808,
            "Source": "stocks"
        },
        {
            "Title": "SBI Projects India's GDP Growth at 7.5% for FY26",
            "Summary": "State Bank of India's Economic Research Department forecasts India's GDP growth at 7.5% for FY26, slightly higher than NSO's 7.4% estimate, with upward bias expected despite fiscal deficit concerns.",
            "Sentiment": "positive",
            "PublishDate": 1767932050938,
            "Source": "stocks"
        },
        {
            "Title": "SBI to facilitate India-Israel trade in rupees",
            "Summary": "State Bank of India's Tel Aviv branch receives regulatory approval to facilitate bilateral trade settlements in Indian rupees through Special Rupee Vostro Accounts, strengthening economic ties between both nations.",
            "Sentiment": "positive",
            "PublishDate": 1767602748205,
            "Source": "stocks"
        },
        {
            "Title": "Bank of India Q3 FY26: Double-digit growth across key metrics",
            "Summary": "Bank of India reported strong Q3 FY26 performance with global business up 12.50% YoY to ₹16,27,098 crore. Global deposits grew 11.64% while advances surged 13.55%, reflecting robust operational momentum.",
            "Sentiment": "positive",
            "PublishDate": 1767355202695,
            "Source": "co_actions_results"
        },
        {
            "Title": "Bank Of India Reports Strong Growth in Advances & Deposits",
            "Summary": "Bank Of India demonstrates robust performance with global advances rising 13.55% year-on-year and global deposits increasing 11.64% yearly as of December 31, reflecting strong business momentum.",
            "Sentiment": "positive",
            "PublishDate": 1767353273650,
            "Source": "stocks"
        },
        {
            "Title": "SBI's DMD Jayati Bansal Retires on Dec 31, 2025",
            "Summary": "State Bank of India announces the superannuation of Ms. Jayati Bansal, Deputy Managing Director (International Banking Group), effective December 31, 2025, marking a senior management transition.",
            "Sentiment": "neutral",
            "PublishDate": 1767179473554,
            "Source": "stocks"
        },
        {
            "Title": "Bank Of India Raises ₹100 Billion via Long-Term Bonds",
            "Summary": "Bank Of India successfully receives ₹100 billion through its Long-Term Bonds Series IV issuance, strengthening its capital base and funding capabilities for future growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1766751900066,
            "Source": "stocks"
        },
        {
            "Title": "Bank Of India Raises ₹100 Billion Through Bond Issue",
            "Summary": "Bank Of India successfully completed a bond fundraising exercise, accepting bids worth ₹100 billion at 7.23% coupon rate from total bids of ₹153.05 billion received.",
            "Sentiment": "positive",
            "PublishDate": 1766491169244,
            "Source": "stocks"
        },
        {
            "Title": "SBI Extends MD Ashwini Kumar Tewari's Tenure Till 2027",
            "Summary": "State Bank of India announces extension of Managing Director Ashwini Kumar Tewari's tenure beyond January 2026 till his superannuation on December 31, 2027, following government notification.",
            "Sentiment": "positive",
            "PublishDate": 1765954860117,
            "Source": "stocks"
        },
        {
            "Title": "SBI Issues IEPF Transfer Notice for Unclaimed Shares",
            "Summary": "State Bank of India announces transfer of shares with unclaimed dividends for seven consecutive years to IEPF by March 6, 2026, and opens special window for physical share transfer requests.",
            "Sentiment": "neutral",
            "PublishDate": 1765869328174,
            "Source": "co_actions_results"
        },
        {
            "Title": "SBI Signs €150M Credit Line with KfW for Green Energy",
            "Summary": "State Bank of India officially signs Euro 150 million credit facility with German development bank KfW on December 16, 2025, at KfW headquarters in Frankfurt to finance climate-friendly energy projects.",
            "Sentiment": "positive",
            "PublishDate": 1765802726309,
            "Source": "stocks"
        },
        {
            "Title": "SBI Gets RBI Nod for Digital Payments Platform",
            "Summary": "State Bank of India receives regulatory approval from RBI to launch its Digital Payments Intelligence Platform, marking a significant step in the bank's digital transformation journey.",
            "Sentiment": "positive",
            "PublishDate": 1765412028467,
            "Source": "stocks"
        },
        {
            "Title": "SBI Invests ₹100 Cr in Digital Payments Platform IDPIC",
            "Summary": "State Bank of India subscribes to 1 crore equity shares worth ₹100 crores in Indian Digital Payment Intelligence Corporation, acquiring 50% stake as initial promoter following RBI approval.",
            "Sentiment": "positive",
            "PublishDate": 1765376930911,
            "Source": "stocks"
        },
        {
            "Title": "State Bank of India Receives RBI Approval to Establish Digital Payments Intelligence Platform",
            "Summary": "State Bank of India has received approval from the Reserve Bank of India to establish a Section 8 Company under the Companies Act, 2013, for Digital Payments Intelligence Platform. The approval allows SBI to hold shares exceeding 30% of the paid-up share capital in the proposed Indian Digital Payment Intelligence Corporation until October 16, 2026, subject to exemption from the Department of Financial Services.",
            "Sentiment": "positive",
            "PublishDate": 1765363232806,
            "Source": "stock"
        },
        {
            "Title": "State Bank of India Appoints Anindya Sunder Paul as Deputy Managing Director (Finance)",
            "Summary": "State Bank of India announced that Anindya Sunder Paul has taken charge as Deputy Managing Director (Finance) and has been designated as Key Managerial Personnel effective December 1, 2025. This leadership change affects the bank's senior management structure and financial operations oversight.",
            "Sentiment": "neutral",
            "PublishDate": 1764597376435,
            "Source": "corporate_governance"
        },
        {
            "Title": "State Bank of India Announces Leadership Changes Due to Superannuation",
            "Summary": "State Bank of India disclosed that three senior officials including Managing Director Vinay M Tonse (Retail Business and Operations), Deputy Managing Director Saloni Narayan (Finance), and Deputy Managing Director Ruma Dey (Special Projects-Compliance Data Protection) are superannuating effective November 30, 2025. The leadership transition affects key positions across retail operations, finance, and compliance functions at India's largest public sector bank.",
            "Sentiment": "neutral",
            "PublishDate": 1764427269590,
            "Source": "corporate_governance"
        },
        {
            "Title": "SBI Centralises Trade Finance Operations At Kolkata Hub",
            "Summary": "State Bank of India has established a centralised digital hub in Kolkata to handle trade finance and international banking transactions for branches across eastern and northeastern India. The Global Trade Finance Centre employs over 300 skilled professionals and leverages AI, machine learning, and blockchain technologies to transition from paper-based to digital processes, aiming to improve processing speed, compliance, and customer experience.",
            "Sentiment": "positive",
            "PublishDate": 1763229193998,
            "Source": "stock"
        },
        {
            "Title": "SBI Appoints 10 Chartered Accountant Firms as Statutory Central Auditors for FY2025-26",
            "Summary": "State Bank of India received RBI approval to appoint 10 CA firms as Statutory Central Auditors for FY2025-26, comprising 8 continuing firms and 2 newly appointed firms. The appointment includes established firms like RGN Price Co. Chennai and Rama K Gupta Co. Bhopal among continuing auditors, with Ashwani & Associates Ludhiana as one of the new appointments.",
            "Sentiment": "neutral",
            "PublishDate": 1763204732030,
            "Source": "corporate_governance"
        },
        {
            "Title": "FIIs and DIIs Increase Stakes in SBI as Bank Posts Rs 20,159 Crore Quarterly Profit",
            "Summary": "State Bank of India reported a 10% year-on-year rise in standalone net profit to Rs 20,159 crore in the September quarter, marking the first time in five quarters crossing the Rs 20,000-crore profit mark. Foreign institutional investors raised their stake to 9.57% from 9.33% while domestic institutional investors increased holdings to 27.65% from 25.69%, with ICICI Securities maintaining a Buy rating and Rs 1,150 target price indicating 20% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1763122844733,
            "Source": "stock"
        },
        {
            "Title": "SBI Chairman Supports Another Wave of State Bank Mergers to Build Scale",
            "Summary": "State Bank of India Chairman Challa Sreenivasulu Setty endorsed further consolidation among state-backed lenders, citing the need to address smaller sub-scale banks as India seeks to build large institutions capable of financing massive infrastructure projects. SBI, which controls about 25% of India's $2.18 trillion loan market with $787 billion in assets, raised its credit growth forecast to 12-14% and hired 1,000 wealth relationship managers as the bank aims to expand market share in the competitive banking sector.",
            "Sentiment": "positive",
            "PublishDate": 1763116782890,
            "Source": "stock"
        },
        {
            "Title": "State Bank of India Acquires 7.45% Stake in Raajmarg Infra Investment Managers",
            "Summary": "State Bank of India subscribed to 5,10,000 equity shares of Raajmarg Infra Investment Managers Private Limited through a rights issue at Rs. 10 per share. The acquisition brings SBI's total shareholding to 14,90,000 shares representing a 7.45% stake in the asset management company that will provide investment management services to a proposed public InvIT sponsored by NHAI.",
            "Sentiment": "neutral",
            "PublishDate": 1763047427294,
            "Source": "corporate_action"
        },
        {
            "Title": "State Bank of India Reports Q2 FY26 Results with Rs 4,593 Crore Exceptional Gain from YES Bank Stake Sale",
            "Summary": "State Bank of India held its analyst meet for quarterly results, with Chairman C.S. Setty highlighting the bank's performance amid global economic challenges. The bank reported domestic NIMs improvement of 7 basis points quarter-on-quarter to 3.09%, driven by deposit repricing. SBI completed India's largest QIP offering worth Rs 25,000 crores with demand exceeding Rs 1.1 trillion, oversubscribed 4.5 times. The bank recorded Rs 4,593 crores exceptional income from YES Bank stake sale in standalone results, though consolidated figures showed Rs 3,000 crores. Credit growth stood at 3.88% for first six months with management targeting 12-14% annual growth. The bank maintains a corporate credit pipeline of Rs 7 lakh crores. Treasury profits declined 50% from Rs 8,082 crores to Rs 4,011 crores compared to previous quarter. Management launched Project SARAL for operational process simplification and announced upcoming YONO 2.0 platform. Recovery from written-off accounts reached Rs 2,483 crores. The bank's CASA ratio stands at 39.63% with current account market share gains of 185 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1762968824380,
            "Source": "earnings"
        },
        {
            "Title": "State Bank of India to Acquire 9.90% Stake in CareEdge Global IFSC Limited",
            "Summary": "State Bank of India has signed a Non-Binding Term Sheet with Care Ratings Limited to purchase 29,70,000 equity shares of CareEdge Global IFSC Limited (CGIL) for up to 9.90% stake acquisition. The cash consideration is Rs. 10 per share, totaling an investment of up to Rs. 2.97 crore. CareEdge Global is a full-service Credit Rating Agency incorporated on April 29, 2024, and is the first CRA registered and authorized by the International Financial Services Centres Authority (India). The transaction requires regulatory approvals from IFSCA and Reserve Bank of India, with completion expected within 6 months from the date of the Non-Binding Term Sheet. This acquisition falls outside SBI's main line of business and does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1762959679680,
            "Source": "order&deals"
        },
        {
            "Title": "SBI Targets Top 10 Global Banks by Market Cap by 2030 After Crossing Rs 100 Lakh Crore Business Milestone",
            "Summary": "State Bank of India has set a goal to be among the world's top 10 most valued banks by market capitalization by 2030. Chairman CS Setty announced this target after SBI crossed the Rs 100 lakh crore business milestone, which includes both advances and deposits. The bank also crossed $100 billion in market capitalization, joining companies like HDFC Bank, TCS, and Reliance Industries. SBI has internal targets of maintaining a 15% capital adequacy ratio and 12% core equity CET-1 ratio, currently standing at 14.62% and 11.47% respectively. The bank reported a 10% year-on-year increase in net profit to Rs 20,160 crore in quarterly results, driven by growth in retail, agriculture, and MSME advances, plus gains from selling its Yes Bank stake. SBI's advances stood at Rs 44.20 lakh crore and deposits at Rs 55.92 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1762576645078,
            "Source": "stock"
        },
        {
            "Title": "SBI Develops Language Communication Platform for Employee-Customer Interactions",
            "Summary": "State Bank of India is developing a mechanism to help employees communicate with customers in local languages through a platform called Spark. SBI Chairman CS Setty described Spark as both a knowledge and skill-based platform that can address language-related issues. The initiative follows Finance Minister Nirmala Sitharaman's call for government banks to ensure branch employees can communicate in local languages. Setty noted that SBI recruits from diverse regions with different language backgrounds, and AI tools can facilitate the transition and accelerate learning. The bank is focusing on change management to prepare employees both in skills and mental adaptation to new technology while promoting digital tools and customer centricity.",
            "Sentiment": "positive",
            "PublishDate": 1762456799581,
            "Source": "stock"
        },
        {
            "Title": "SBI Crosses $100 Billion Market Cap Milestone as Total Business Surpasses ₹100 Trillion",
            "Summary": "State Bank of India achieved a $100 billion market capitalization following better-than-expected quarterly results. The bank's total business crossed ₹100 trillion, comprising advances of ₹44.20 lakh crore and deposits of ₹55.92 lakh crore. Net interest income rose 3% year-on-year to ₹42,985 crore, exceeding estimates of ₹40,766 crore. Net profit increased 10% to ₹20,160 crore, surpassing Street expectations of ₹17,048 crore, aided by a one-off gain of ₹4,593 crore from Yes Bank stake sale. SBI joins an elite group of six Indian companies above $100 billion valuation, including Reliance Industries ($228 billion), HDFC Bank ($170 billion), Bharti Airtel, TCS, and ICICI Bank. SBI shares have gained over 20% year-to-date, outperforming Nifty50's under 9% rise. Chairman CS Setty highlighted benefits from public sector bank consolidation, with PSB count reducing from 26 to 12. Among 50 analysts, 41 maintain 'Buy' ratings, eight recommend 'Hold', and one suggests 'Sell'.",
            "Sentiment": "positive",
            "PublishDate": 1762407622170,
            "Source": "stock"
        },
        {
            "Title": "State Bank of India Reports No Deviation in ₹25,000 Crore QIP Fund Utilization",
            "Summary": "State Bank of India disclosed its fund utilization statement for the quarter ended September 30, 2025, under SEBI regulations. The bank raised ₹25,000 crore through a Qualified Institutional Placement on July 21, 2025. The funds were raised for augmenting the bank's Tier-I capital base to meet future capital requirements and support growth plans. The bank reported no deviation or variation in the use of funds raised during the quarter. Additionally, no bond issuance occurred during the reporting period. The bank maintains outstanding domestic bond instruments totaling ₹1,58,557 crore across various private placements including Tier 2, AT1, and LTB securities, with no deviations reported in their utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1762306151485,
            "Source": "corporate_action"
        },
        {
            "Title": "SBI Expects Double-Digit Credit Growth as Corporate Lending Shows Recovery Signs",
            "Summary": "State Bank of India Chairman CS Setty announced that the bank's total business crossed ₹100 trillion in Q2 FY25, driven by strong consumption and double-digit growth across most segments except corporate credit. Corporate credit growth improved from nearly flat last quarter to 7.1% in Q2, with expectations to reach double digits in the next two quarters. The recovery is expected to be led by mid-corporates and central PSUs, particularly in steel and cement sectors, while large corporates continue using existing cash reserves. SBI maintains strong asset quality with slippages expected around 0.50% and credit costs below 50 basis points for FY26. Net interest margins improved in Q2 due to better liability management and growth in low-cost CASA deposits, with exit NIMs for FY26 projected to exceed 3%. The bank plans to spread expected credit loss provisions over five years and has no immediate decision timeline regarding its 10% stake in Yes Bank.",
            "Sentiment": "positive",
            "PublishDate": 1762262789419,
            "Source": "stock"
        },
        {
            "Title": "SBI Raises Credit Growth Forecast to 12-14% from Previous 11%",
            "Summary": "SBI has increased its credit growth forecast to 12-14% from the previous projection of 11%. The bank anticipates strong growth in corporate loans during the second half.",
            "Sentiment": "positive",
            "PublishDate": 1762248780845,
            "Source": "stock"
        },
        {
            "Title": "State Bank of India Reports Q2 FY26 Results with Net Profit of ₹20,169 Crore",
            "Summary": "State Bank of India announced its quarterly results for the period ended September 30, 2025, reporting a net profit of ₹20,169 crore. The bank's total income reached ₹1,34,971 crore while total expenditure was ₹1,07,661 crore. Operating profit before provisions stood at ₹27,310 crore. The bank made provisions of ₹4,024 crore during the quarter. SBI completed a Qualified Institutional Placement raising ₹25,000 crore through allotment of equity shares at ₹817 per share. The bank divested its 13.18% stake in Yes Bank Limited for ₹21.50 per share, resulting in an exceptional profit of ₹4,593 crore. Additionally, SBI increased its shareholding in SBI General Insurance Company to 73.89% and divested its entire 14.96% stake in Jio Payments Bank. The Provision Coverage Ratio stood at 75.79% as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762246446660,
            "Source": "earnings"
        },
        {
            "Title": "SBI Reports 10% Jump in Quarterly Net Profit to Rs 20,160 Crore, Beats Estimates",
            "Summary": "State Bank of India reported a 10% year-on-year growth in standalone net profit to Rs 20,160 crore, compared to Rs 18,331 crore in the same period last year. The profit exceeded Street estimates of Rs 17,387 crore, with brokerages having projected up to a 17% decline and estimates ranging between Rs 17,700 crore to Rs 18,800 crore. The bank's interest income increased 5% to Rs 1,19,654 crore from Rs 1,13,871 crore in the corresponding period of the previous financial year.",
            "Sentiment": "positive",
            "PublishDate": 1762244084113,
            "Source": "earnings"
        },
        {
            "Title": "SBI Reports Significant Improvement in Asset Quality with Fresh Slippages Dropping to 48B Rupees",
            "Summary": "State Bank of India reported fresh slippages of 48 billion rupees in Q2, down from 79 billion rupees in the previous quarter. The bank's slippage ratio improved to 0.45% from 0.75% quarter-on-quarter. The Q2FY26 slippage ratio of 0.45% represents a 6 basis points improvement compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1762244026096,
            "Source": "earnings"
        },
        {
            "Title": "SBI Reports Strong Q2 Performance with Higher Profits and Improved Asset Quality",
            "Summary": "State Bank of India reported quarterly net profit of 201 billion rupees, up from 183 billion rupees year-over-year and exceeding estimates of 170.5 billion rupees. Interest earned increased to 1.2 trillion rupees from 1.14 trillion rupees compared to the previous year. The bank's asset quality improved with gross non-performing assets declining to 1.73% from 1.83% quarter-over-quarter, while net non-performing assets decreased to 0.42% from 0.47%. Provisions for non-performing assets were reduced to 41.3 billion rupees from 49.3 billion rupees on a quarterly basis.",
            "Sentiment": "positive",
            "PublishDate": 1762243317479,
            "Source": "earnings"
        },
        {
            "Title": "SBI Q2 Results Preview: Profit Expected to Drop Up to 17% YoY on Margin Pressure",
            "Summary": "State Bank of India is expected to report mixed quarterly results with profit after tax projected between Rs 17,700-Rs 18,800 crore, representing a 2-17% year-on-year decline. Net Interest Income is forecast to remain largely flat or decline up to 2.7% due to rising funding costs and margin compression. Net Interest Margins are expected to contract to 2.6-2.8%, down 29-32 basis points year-on-year, due to higher deposit costs and slower loan yield transmission. Pre-Provision Operating Profit is projected to decline 3-12% year-on-year due to lower treasury gains and modest NII growth. However, loan growth remains strong at 11.7-12% year-on-year, driven by retail and corporate segments, while deposit growth is expected at 9-9.6% year-on-year. Credit costs are anticipated to remain stable at 0.4-0.5%, indicating continued asset quality stability. The bank will announce earnings on November 4.",
            "Sentiment": "negative",
            "PublishDate": 1762173219444,
            "Source": "earnings"
        }
    ]
}