{
    "Symbol": "SCHAND",
    "ISIN": "INE807K01035",
    "News": [
        {
            "Title": "S Chand completes CPD Singapore acquisition",
            "Summary": "S Chand's subsidiary New Saraswati House completes 100% acquisition of CPD Singapore Education Services for SGD 1,500,000, expanding into international curriculum publishing.",
            "Sentiment": "positive",
            "PublishDate": 1769761798143,
            "Source": "co_actions_results"
        },
        {
            "Title": "S Chand Acquires Full Ownership of CPD Singapore",
            "Summary": "S Chand And Company announces acquisition of complete ownership of CPD Singapore Education Services for SGD 1.5 million, expanding its international education footprint.",
            "Sentiment": "positive",
            "PublishDate": 1768184965609,
            "Source": "co_actions_results"
        },
        {
            "Title": "S Chand acquires CPD Singapore for SGD 1.50 million",
            "Summary": "S Chand's subsidiary NSHIPL to acquire 100% stake in CPD Singapore Education Services through two-tranche deal worth SGD 1.50 million, expanding into international curriculum publishing.",
            "Sentiment": "positive",
            "PublishDate": 1768062916913,
            "Source": "co_actions_results"
        },
        {
            "Title": "S Chand Gets ₹15.67 Cr Tax Refund for FY19",
            "Summary": "S Chand And Company receives ₹15.67 crores income tax refund for 2018-19 along with ₹5.31 crores interest, expected to boost liquidity and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1767163689532,
            "Source": "stocks"
        },
        {
            "Title": "S Chand And Company Limited Receives Credit Rating Upgrade from ICRA",
            "Summary": "ICRA Limited upgraded S Chand And Company Limited's credit rating from ICRA A- (Stable) to ICRA A (Stable) for enhanced long-term fund based facilities worth Rs. 110.00 crore. The rating upgrade applies to the company's overdraft facility and term loan from various banks and financial institutions.",
            "Sentiment": "positive",
            "PublishDate": 1763629189994,
            "Source": "corporate_action"
        },
        {
            "Title": "S Chand Reports 32% Revenue Growth to Rs 493M in Q2 FY26, Plans US$1.5M International Curriculum Acquisition",
            "Summary": "S Chand and Company delivered consolidated revenues of Rs 493 million (up 32% YoY) in Q2 FY26 despite reporting EBITDA loss of Rs 60 million and PAT loss of Rs 53 million, while maintaining net debt-free status with Rs 235 million cash balance. The educational publisher is finalizing a US$1.5 million acquisition in the international curriculum space for Q3 completion and expects full adoption of new NCERT syllabus books across K-12 classes by FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1763465989757,
            "Source": "earnings"
        },
        {
            "Title": "S Chand Projects FY26 Revenue of ₹670 Crore with 21% EBITDA Margin",
            "Summary": "S Chand has provided guidance for FY26, projecting revenue of ₹670 crore, representing 9% year-over-year growth, with an EBITDA margin target of 21%. The company plans to expand its EdTech and digital content offerings through its 'S Chand Advance' platform. Strategic acquisitions are planned in the K-12 and skill learning segments. The company is focusing on margin expansion through supply-chain digitization and improved print efficiency. S Chand expects to generate strong cash flow and reduce debt levels.",
            "Sentiment": "positive",
            "PublishDate": 1762874946571,
            "Source": "stock"
        },
        {
            "Title": "S Chand And Company Reports Quarterly Loss of ₹243.50 Million",
            "Summary": "S Chand And Company Limited reported a standalone loss of ₹243.50 million for the quarter ended September 30, 2025, compared to a loss of ₹67.88 million in the same period last year. On a consolidated basis, the company posted a loss of ₹355.37 million versus ₹152.75 million in the previous year quarter. Total standalone revenue from operations declined to ₹347.61 million from ₹507.38 million year-over-year. The consolidated revenue also decreased to ₹517.83 million from ₹705.23 million. The company's Board of Directors approved these unaudited financial results on November 11, 2025. The auditors issued an unmodified opinion on both standalone and consolidated results.",
            "Sentiment": "negative",
            "PublishDate": 1762873876875,
            "Source": "earnings"
        },
        {
            "Title": "S Chand and Company Reports Higher Q2 Loss Despite Revenue Growth",
            "Summary": "S Chand and Company reported a consolidated net loss of 527.2 million rupees in Q2, compared to a loss of 516.8 million rupees in the same period last year. The company's revenue increased to 493.4 million rupees from 374.4 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762856827718,
            "Source": "earnings"
        },
        {
            "Title": "S Chand And Company Allots 22,560 Equity Shares Under Employee Stock Option Plans",
            "Summary": "S Chand And Company Limited allotted 22,560 equity shares of Rs. 5 each to eligible employees under its ESOP schemes. The allotment included 5,000 shares under the Employee Stock Option Scheme 2018 at an exercise price of Rs. 80.19 per share, and 17,560 shares under the Employee Stock Option Scheme 2023 at Rs. 113.50 per share. The company realized Rs. 4,00,950 from the 2018 scheme and Rs. 19,93,060 from the 2023 scheme. Following this allotment, the company's total issued, subscribed and paid-up equity share capital increased to 3,52,72,192 shares with a total nominal value of Rs. 176,360,960. The newly allotted shares rank pari-passu with existing equity shares and have no lock-in period.",
            "Sentiment": "neutral",
            "PublishDate": 1761904374851,
            "Source": "corporate_action"
        },
        {
            "Title": "S Chand Subsidiary Vikas Publishing Sells Printing Business to Step-Down Subsidiary for Rs 53 Crores",
            "Summary": "Vikas Publishing House Private Limited, a wholly-owned subsidiary of S Chand and Company Limited, has approved the sale of its printing business to Shri Shyamlal Printing Press Private Limited through a slump sale agreement. The printing business generated Rs 45.82 crores in turnover, representing 21.20% of Vikas Publishing's total revenue, with a net worth of Rs 18.78 crores (9% of total net worth). The sale consideration is Rs 53 crores, comprising Rs 23 crores through banking channels and Rs 30 crores via subscription to compulsory convertible debentures. The transaction was executed on October 1, 2025, between two wholly-owned subsidiaries of S Chand, structured as an arm's length related party transaction based on independent valuation.",
            "Sentiment": "neutral",
            "PublishDate": 1759309323361,
            "Source": "corporate_action"
        },
        {
            "Title": "S Chand Reports Q1 FY26 Loss Due to AI Dataset Revenue Shift, Maintains Growth Guidance",
            "Summary": "S Chand And Company Limited reported consolidated revenues of Rs1,026 million for the quarter ended June 30, 2025, with an EBITDA loss of Rs91 million and PAT loss of Rs141 million. The decline was primarily driven by a shift in content licensing (AI Datasets) revenues from Q1 to Q2, with AI dataset revenues falling to Rs30 million versus Rs115 million in Q1FY25. The company achieved historic low working capital metrics for Q1, with receivable days at 89 days, inventory days at 218 days, and net working capital days at 119 days. Net cash position increased to Rs1,161 million from Rs1,036 million in Q4FY25, after dividend payment of Rs141 million. The company maintained its revenue guidance of over Rs8,000 million for FY26 and upgraded EBITDA margin guidance to 18-20%. Management expects NCERT to release new syllabus books for Classes 4, 5, 7, and 8 during the year, with full adoption expected by FY27. The company is evaluating three acquisition opportunities totaling less than Rs50 crores in revenue across test preparation, international board, and regional segments. Paper prices declined 5-7% and are expected to remain soft. The AI dataset business is expanding from two to seven potential clients, with opportunities expected to continue for the next 2-3 years.",
            "Sentiment": "neutral",
            "PublishDate": 1755015877933,
            "Source": "earnings"
        },
        {
            "Title": "S Chand Sets Ambitious Revenue Target of ₹8,000+ Crores for FY26",
            "Summary": "S Chand has announced plans to achieve revenues exceeding ₹8,000 crores by FY26 while maintaining EBITDA margins of 18-20%. The company's growth strategy includes capitalizing on the NCERT new syllabus rollout expected by FY27, expanding its AI dataset licensing business, and pursuing strategic acquisitions. The company plans to leverage its historically low working capital position to drive sustained cash flow growth.",
            "Sentiment": "positive",
            "PublishDate": 1754665780296,
            "Source": "stock"
        },
        {
            "Title": "S Chand Limited Reports Loss in Q1 Results, Sets AGM Date for September 25",
            "Summary": "S Chand Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone loss of ₹27.78 million compared to a profit of ₹30.79 million in the same quarter last year. On a consolidated basis, the loss was ₹140.66 million versus a loss of ₹29.94 million in the previous year quarter. Revenue from operations on consolidated basis declined to ₹1,026.21 million from ₹1,106.61 million year-over-year. The company set September 18, 2025 as the record date for its 54th Annual General Meeting, which will be held on September 25, 2025 via video conferencing. The auditors issued unmodified opinions on both standalone and consolidated results.",
            "Sentiment": "negative",
            "PublishDate": 1754652054832,
            "Source": "earnings"
        },
        {
            "Title": "S Chand And Company Approves 350 Million Rupees for Acquisition Investment",
            "Summary": "S Chand And Company has approved an investment of 350 million rupees for an acquisition. No further details about the specific acquisition target or terms were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751290615000,
            "Source": "default"
        },
        {
            "Title": "S Chand and Co Reports Q4 Results and Recommends Dividend",
            "Summary": "S Chand and Co has announced its quarterly results and dividend recommendation. The company's Q4 EBITDA increased to 2.03 billion rupees from 1.86 billion rupees year-over-year. The EBITDA margin improved to 43.13% from 42.62% in the same period. Additionally, the company has recommended a dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748006404000,
            "Source": "result"
        },
        {
            "Title": "S Chand and Co Reports Q4 Financial Results",
            "Summary": "S Chand and Co announced its Q4 consolidated financial results. The company reported a net profit of 1.4 billion rupees, up from 1.29 billion rupees year-over-year. However, it showed a loss of 246 million rupees compared to the previous quarter. Revenue for Q4 was 4.7 billion rupees, an increase from 4.37 billion rupees in the same quarter last year.",
            "Sentiment": "mixed",
            "PublishDate": 1748006243000,
            "Source": "result"
        },
        {
            "Title": "S Chand and Company Reports Reduced Q3 Net Loss",
            "Summary": "S Chand and Company Limited has reported a consolidated net loss of 246 million rupees for the third quarter, showing an improvement from the 348 million rupee loss in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738918241000,
            "Source": "earnings"
        },
        {
            "Title": "S Chand Expects Growth from New Syllabus Adoption",
            "Summary": "S Chand's Managing Director anticipates significant growth for the company in fiscal years 2025 and 2026 due to the expected maximum adoption of new syllabus books.",
            "Sentiment": "positive",
            "PublishDate": 1731382902000,
            "Source": "corporate_action"
        }
    ]
}