{
    "Symbol": "SCHAEFFLER",
    "ISIN": "INE513A01022",
    "News": [
        {
            "Title": "Schaeffler India Launches Two-Wheeler Spare Parts",
            "Summary": "Schaeffler India showcases innovative aftermarket solutions and launches two-wheeler spare parts at ACMA Automechanika New Delhi, focusing on EV-ready repair solutions and training programs.",
            "Sentiment": "positive",
            "PublishDate": 1770282308156,
            "Source": "stocks"
        },
        {
            "Title": "Schaeffler India Gets 78/100 ESG Score from S&P Global",
            "Summary": "Schaeffler India Limited received an ESG score of 78 out of 100 from S&P Global under the Corporate Sustainability Assessment conducted as part of the Dow Jones Sustainability Indices evaluation process.",
            "Sentiment": "positive",
            "PublishDate": 1770104715656,
            "Source": "stocks"
        },
        {
            "Title": "Schaeffler India Showcases Future Tech at SIAT 2026",
            "Summary": "Schaeffler India to highlight electrification solutions, powertrain improvements, and eco-friendly mobility technologies at SIAT 2026, with company leaders delivering keynote speeches at the automotive event.",
            "Sentiment": "positive",
            "PublishDate": 1769574065400,
            "Source": "stocks"
        },
        {
            "Title": "Schaeffler India Confirms Non-Large Corporate Status",
            "Summary": "Schaeffler India Limited confirms it does not meet SEBI's Large Corporate criteria as its long-term borrowings remain below ₹100 crores as of December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767846958492,
            "Source": "stocks"
        },
        {
            "Title": "Schaeffler India Block Trade Worth ₹18.62 Crores",
            "Summary": "Schaeffler India executed NSE block trade involving 48,957 shares at ₹3,803 per share, totaling ₹18.62 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1767778042075,
            "Source": "co_actions_results"
        },
        {
            "Title": "Schaeffler India Opens Special Window for Share Transfer",
            "Summary": "Schaeffler India Limited announces special window for re-lodgement of physical share transfer requests following SEBI circular dated July 2, 2025, with details shared via social media channels.",
            "Sentiment": "neutral",
            "PublishDate": 1767593625375,
            "Source": "stocks"
        },
        {
            "Title": "Schaeffler India Appoints Maximilian Fiedler as Director",
            "Summary": "Schaeffler India Limited announces the appointment of Mr. Maximilian Andreas Fiedler as Additional Non-Executive Non-Independent Director effective January 1, 2026, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1766763830661,
            "Source": "stocks"
        },
        {
            "Title": "Schaeffler India Gets ESG Ratings from Two Agencies",
            "Summary": "Schaeffler India receives ESG scores of 80/100 from CFC Finlease and 77/100 from NSE Sustainability Ratings, both issued independently without company engagement.",
            "Sentiment": "positive",
            "PublishDate": 1766579158143,
            "Source": "stocks"
        },
        {
            "Title": "Schaeffler India Announces Social Innovation Winners",
            "Summary": "Schaeffler India recognizes 10 winners of its 4th Social Innovator Fellowship Program, awarding ₹1.75 lakh grants and 24-week mentorship at IIM Ahmedabad for sustainable solutions.",
            "Sentiment": "positive",
            "PublishDate": 1766400132653,
            "Source": "stocks"
        },
        {
            "Title": "Schaeffler India faces ₹3.60 cr GST penalty order",
            "Summary": "Schaeffler India received a tax order from Gujarat GST authorities imposing a penalty of ₹3.60 crores for alleged Input Tax Credit disallowance. The company plans to file an appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766120005585,
            "Source": "stocks"
        },
        {
            "Title": "Schaeffler India Conducts Anti-Counterfeit Raids in Delhi, Seizes Fake Bearings",
            "Summary": "Schaeffler India conducted enforcement operations on November 4 and 7, 2025, targeting five locations in Delhi's Kashmiri Gate area and seizing thousands of counterfeit FAG wheel bearings and fake packaging materials. The company reinforced its anti-counterfeit measures to protect customers from substandard products that pose operational safety risks and can lead to unplanned downtimes and higher maintenance costs.",
            "Sentiment": "positive",
            "PublishDate": 1763371462538,
            "Source": "stock"
        },
        {
            "Title": "Schaeffler India Reports 13.9% Revenue Growth and 20% EBITDA Margin in Q3 2025",
            "Summary": "Schaeffler India Limited reported quarterly revenue of INR 2,360 crores, marking a 13.9% increase compared to the same period last year and 3.4% growth over the previous quarter. The company achieved a milestone EBITDA margin of 20.2%, up from 19.7% in the preceding quarter, driven by improved localization efforts which reached 79%. Profit after tax stood at INR 307 crores, representing a 13% margin and 24% improvement year-over-year. The automotive technology segment showed strong performance with 18.7% growth for the nine-month period, while bearings and industrial solutions grew 4.1%. Free cash flow generation was robust at INR 223 crores for the quarter. The company secured multiple new business wins across automotive clutch applications, hydraulic tensioners, and industrial bearings segments. Management expressed optimism about demand recovery following GST reforms implementation and expects stronger traction in the automotive industry.",
            "Sentiment": "positive",
            "PublishDate": 1762520531335,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Reports 13.9% Revenue Growth in Q3 2025 with Improved Operating Margins",
            "Summary": "Schaeffler India Limited achieved double-digit revenue growth of 13.9% year-over-year in quarterly results, reaching INR 23,601 million. The company's EBITDA margin improved to 20.2% from 19.7% in the previous quarter, driven by volume gains and fixed cost absorption. Revenue growth was supported by Automotive Technologies segment and intercompany exports. The company generated free cash flow of INR 2,232 million and maintained PAT margin at 13.0%. Business developments included new wins in hydraulic tensioners for passenger vehicles, HD clutches for commercial vehicles, and continued momentum in dampers and clutches. The company launched large-size spherical roller bearings and cast steel housings at its Savli, Gujarat facility. Schaeffler India received quality awards including Best Quality Export Parts Award from Escorts Kubota Limited and recognition for zero defect supplies from TAFE for the second consecutive year.",
            "Sentiment": "positive",
            "PublishDate": 1762143492047,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Expects Continued Growth in Q4 After Strong Festive Season Performance",
            "Summary": "Schaeffler India reported strong results during the festive season and anticipates maintaining growth momentum in Q4. The company's performance during the festive period has positioned it well for continued expansion in the upcoming quarter.",
            "Sentiment": "positive",
            "PublishDate": 1761919576695,
            "Source": "stock"
        },
        {
            "Title": "Schaeffler India Reports Quarterly Results and Appoints PriceWaterhouse as New Statutory Auditor",
            "Summary": "Schaeffler India Limited's Board of Directors approved unaudited standalone and consolidated financial results for the quarter ended September 30, 2025. The company also approved the appointment of PriceWaterhouse, Chartered Accountants LLP as statutory auditors for five consecutive years from the 63rd Annual General Meeting to the conclusion of the 68th AGM, subject to shareholder approval in the 2026 AGM. The Board meeting was held on October 31, 2025. The company operates through two main segments: Mobility components and related solutions (including Automotive Technologies, Vehicle Lifetime Solutions, and Bearings & Industrial Solutions) and Others. The financial results were reviewed by Walker Chandiok & Co LLP and include both standalone and consolidated statements covering the holding company and its subsidiary KRSV Innovative Auto Solutions Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761908815439,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Reports Strong Q2 Performance with 22% Jump in Net Profit",
            "Summary": "Schaeffler India delivered robust quarterly results with consolidated net profit rising to 2.89 billion rupees from 2.36 billion rupees year-over-year. Revenue increased to 24.35 billion rupees compared to 21.16 billion rupees in the same period last year. EBITDA grew to 456 million rupees from 368.8 million rupees, while EBITDA margin improved to 18.73% from 17.43% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1761908430027,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Plans INR 4,500 Crore Investment by 2030, Localization Ratio Reaches 79%",
            "Summary": "Schaeffler India disclosed plans for INR 4,500 crore investment over the next five years until 2030, as announced by the group CEO. The company has invested INR 1,700 crores in the last three years, achieving a localization ratio of 79% compared to 74% previously. Current year capex is expected at INR 400 crores with similar amounts planned for next year. The company secured e-axle business with Tata Harrier EV and is implementing phased localization strategy. Schaeffler's portfolio comprises 60% bearings and 40% non-bearings, with non-bearing localization at 90%. The company has integrated Vitesco operations for e-mobility capabilities and operates with 910 engineers at Bangalore R&D center. Export revenues peaked at INR 1,100 crores in 2022 with current mix of 50% Europe, 10% USA, and 40% Asia. Wind segment investments target higher capacity turbines beyond 4 megawatts. Railway segment focuses on electric locomotives and Class K products for improved performance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1758281269656,
            "Source": "stock"
        },
        {
            "Title": "Schaeffler India Block Trade Worth Rs. 55.25 Crores Executed on NSE",
            "Summary": "Schaeffler India Ltd. executed a block trade on the National Stock Exchange involving approximately 144,118 shares at a price of Rs. 3,833.80 per share. The total transaction value amounted to Rs. 55.25 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1757309318329,
            "Source": "order&deals"
        },
        {
            "Title": "Schaeffler India Expands Large Industrial Bearings Product Line with Local Manufacturing",
            "Summary": "Schaeffler India has expanded its large industrial bearings product line by adding locally manufactured spherical roller bearings, cast steel housings, and accessories. This expansion represents the company's growth in the industrial bearings segment through domestic production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1754019828403,
            "Source": "stock"
        },
        {
            "Title": "Schaeffler India Reports Strong Q2 Performance with 10.1% Revenue Growth and Inaugurates Fifth Manufacturing Plant",
            "Summary": "Schaeffler India delivered robust quarterly results with revenue of INR 2,282 crores, marking 10.1% year-on-year growth and 8.2% sequential growth. The company achieved EBITDA of INR 449 crores (19.7% margin) and profit after tax of INR 296 crores (13% margin). Strong performance was driven by automotive technologies, vehicle lifetime solutions, and exports, with export business growing 23% in the six-month period. The company inaugurated its fifth manufacturing facility in Bangalore for clutch and drivetrain applications, with INR 330 crores investment. Schaeffler commenced series production of e-axles for Tata Harrier platform and improved localization rate to 78%. The company generated strong free cash flow of INR 287 crores and maintained capacity utilization above 85% across plants. Parent company Schaeffler AG announced €500 million investment plan for India over next five years starting 2026.",
            "Sentiment": "positive",
            "PublishDate": 1753878106181,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Focuses on Long-Term Growth Through Plant Expansion and E-Mobility",
            "Summary": "Schaeffler India is pursuing long-term growth through multiple strategic initiatives including ramping up operations at a new plant, scaling up e-mobility business, and increasing localization efforts. The company's growth strategy is supported by volume-driven margin expansion and strong free cash flow generation.",
            "Sentiment": "positive",
            "PublishDate": 1753449860181,
            "Source": "stock"
        },
        {
            "Title": "Schaeffler India Reports Strong Q2 2025 Results with 16.7% Revenue Growth",
            "Summary": "Schaeffler India Limited reported robust quarterly results for the quarter ended June 30, 2025. Revenue from operations increased to ₹22,821 million compared to ₹20,719.3 million in the same quarter last year, marking a 10.1% growth. Profit for the quarter rose to ₹2,962.3 million from ₹2,535.4 million in the previous year. For the six-month period, revenue grew to ₹43,921.2 million from ₹39,211.5 million, while profit increased to ₹5,616.4 million from ₹4,812.1 million. Basic earnings per share for the quarter stood at ₹19.0 compared to ₹16.2 in the corresponding quarter last year. The company operates through two main segments: Mobility components and related solutions, and Others, with the former contributing significantly to overall revenue. Walker Chandiok & Co LLP conducted the independent auditor's review and found no material misstatements in the financial information.",
            "Sentiment": "positive",
            "PublishDate": 1753447965561,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Reports Strong Q1 Growth with Net Profit Rising 18% to 2.96 Billion Rupees",
            "Summary": "Schaeffler India delivered robust quarterly performance with net profit increasing to 2.96 billion rupees from 2.5 billion rupees in the same period last year. Revenue grew to 22.82 billion rupees compared to 20.7 billion rupees year-over-year. The company's EBITDA rose to 4.31 billion rupees from 3.79 billion rupees, while EBITDA margin improved to 18.88% from 18.32% in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1753441274165,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Reports Quarterly Results; Independent Director Amit Kalyani Resigns",
            "Summary": "Schaeffler India Limited announced its unaudited financial results for the quarter and half year ended June 30, 2025. The board meeting was held on July 25, 2025, where directors approved both standalone and consolidated financial results. The company also noted the resignation of Mr. Amit Kalyani as Independent Director, effective from the close of business hours on July 23, 2025. The financial results were prepared in accordance with Indian Accounting Standard 34 and reviewed by statutory auditors Walker Chandiok & Co LLP, who found no material misstatements in the financial statements.",
            "Sentiment": "neutral",
            "PublishDate": 1753440261663,
            "Source": "earnings"
        },
        {
            "Title": "Amit Kalyani Resigns as Independent Director of Schaeffler India",
            "Summary": "Amit Kalyani has resigned from his position as Independent Director of Schaeffler India Limited, effective July 23, 2025. He cited other professional commitments as the reason for his resignation. Kalyani confirmed there were no material reasons for his departure beyond those mentioned. At Schaeffler India, he served as Chairperson of the Nomination and Remuneration Committee and was a member of the Audit Committee and Corporate Social Responsibility Committee. Kalyani also holds directorships in multiple other listed entities including Bharat Forge Limited as Executive Director, and various non-executive positions in companies such as Kalyani Steels Limited, BF Utilities Limited, Kalyani Investment Company Limited, Hikal Limited, and BF Investment Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753271443495,
            "Source": "corporate_governance"
        },
        {
            "Title": "Schaeffler India Limited: New Manufacturing Facility Inaugurated in Tamil Nadu",
            "Summary": "Schaeffler India Limited opened its fifth manufacturing facility in Shoolagiri, Tamil Nadu on May 28, 2025. The 16,500 square meter Phase 1 facility will produce conventional and hybrid powertrain components, focusing on planetary gear systems and hybrid transmission components. Full production capacity is expected by Q4 2025. The company has invested ₹1,700 crore over the past three years, exceeding its initial commitment of ₹1,500 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748420841000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schaeffler India Inaugurates Fifth Manufacturing Facility in Tamil Nadu",
            "Summary": "Schaeffler India has announced the inauguration of its fifth manufacturing facility in Shoolagiri, Tamil Nadu. The new facility is designed to produce both conventional and hybrid powertrain components.",
            "Sentiment": "positive",
            "PublishDate": 1748409014000,
            "Source": "default"
        },
        {
            "Title": "Schaeffler India: Q1 2025 Results Drive 7% Share Price Surge",
            "Summary": "Schaeffler India's Q1 2025 results show 14.5% increase in net profit to ₹251.6 crore, 16% revenue growth to ₹2,174.4 crore, and improved EBITDA margin of 18.2%. Domestic operations grew 12.7% while exports surged 23.2%.",
            "Sentiment": "positive",
            "PublishDate": 1746002240000,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Reports Q4 Financial Results",
            "Summary": "Schaeffler India has announced its Q4 financial results. The company's net profit increased to 2.65 billion rupees, up from 2.28 billion rupees year-over-year and 2.49 billion rupees quarter-over-quarter. Revenue also saw growth, reaching 21.1 billion rupees compared to 18.49 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1745972738000,
            "Source": "default"
        },
        {
            "Title": "Schaeffler India Reports Strong Q4 Financial Results",
            "Summary": "Schaeffler India has announced its Q4 financial results, showing significant year-over-year growth. The company's EBITDA increased to 4.01 billion rupees from 3.35 billion rupees, with EBITDA margin improving to 19.02% from 18.13%. Revenue rose to 21.1 billion rupees from 18.49 billion rupees. Net profit also saw an increase, reaching 2.65 billion rupees compared to 2.28 billion rupees in the previous year and 2.49 billion rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1745928491000,
            "Source": "result"
        },
        {
            "Title": "Schaeffler India: Q1 Profit Surges 16.6% on Strong Auto Demand",
            "Summary": "Schaeffler India reported a 16.6% increase in Q1 profit to 2.65 billion rupees, driven by robust demand for automotive components. Revenue rose 14.1% to 21.1 billion rupees, outpacing the 9.8% increase in material costs.",
            "Sentiment": "positive",
            "PublishDate": 1745927315000,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India: Intensifies Anti-Counterfeit Efforts with Successful Raids",
            "Summary": "Schaeffler India conducted about 100 legal activities including raids in Delhi, Mumbai, and Kolkata to combat counterfeit products. The company seized fake items branded as FAG, INA, and LuK. Measures implemented include unique identification codes and a mobile app for product authentication.",
            "Sentiment": "positive",
            "PublishDate": 1743670320000,
            "Source": "normal_news"
        },
        {
            "Title": "Schaeffler India: Record Date Set for Dividend Payment",
            "Summary": "Schaeffler India has set April 23, 2025, as the record date for its 62nd AGM and dividend payment. The company has proposed a dividend of ₹28 per share, subject to shareholder approval. If approved, the dividend will be paid within 30 days of the AGM scheduled for April 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1741679807000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schaeffler India: Q4 Profit Rises 13.2% YoY to ₹237.28 Crore",
            "Summary": "Schaeffler India reported Q4 FY24 results with profit up 13.2% YoY to ₹237.28 crore and revenue up 13.95% YoY to ₹2136.06 crore. EPS increased 11.44% YoY to ₹15.2. Operating income grew 12.86% YoY despite a slight QoQ decline. Analyst consensus remains 'Buy'.",
            "Sentiment": "positive",
            "PublishDate": 1740725488000,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Reports Strong Q3 Results and Declares Dividend",
            "Summary": "Schaeffler India has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 2.5 billion rupees, up from 2.1 billion rupees in the same quarter last year. Revenue also saw a rise to 20.8 billion rupees from 18.55 billion rupees year-over-year. Additionally, Schaeffler India has declared a dividend of 28 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1740702276000,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India: Q4 Profit Rises 13.2%, Announces ₹28 Dividend",
            "Summary": "Schaeffler India reported a 13.2% YoY increase in Q4 net profit to ₹237.3 crore. Revenue grew 13.9% YoY to ₹2,136 crore. EBITDA rose 14.2% YoY to ₹370.2 crore, with margin flat at 17.3%. The company recommended a final dividend of ₹28 per share for FY2024.",
            "Sentiment": "positive",
            "PublishDate": 1740657647000,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Declares Dividend of 28 Rupees per Share",
            "Summary": "Schaeffler India has announced a dividend of 28 rupees per share for its shareholders. This corporate action represents a distribution of profits to the company's investors.",
            "Sentiment": "positive",
            "PublishDate": 1740657170000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schaeffler India Reports Improved Q3 EBITDA and Margin",
            "Summary": "Schaeffler India has announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 3.8 billion rupees, up from 3.3 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 18.13% from 17.69% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1740657116000,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Reports Q3 Financial Results",
            "Summary": "Schaeffler India has announced its financial results for the third quarter. The company's net profit increased to 2.5 billion rupees, up from 2.1 billion rupees year-over-year and 2.47 billion rupees quarter-over-quarter. Revenue also saw growth, reaching 20.8 billion rupees compared to 18.55 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1740657021000,
            "Source": "earnings"
        },
        {
            "Title": "Schaeffler India Showcases Innovative Motion Technology at IMTEX 2025",
            "Summary": "Schaeffler India is presenting its smart and innovative motion technology solutions at IMTEX 2025, an industrial exhibition held in Bengaluru. The company is demonstrating its latest advancements in motion control and automation technologies, highlighting its commitment to innovation in the manufacturing sector.",
            "Sentiment": "positive",
            "PublishDate": 1737605627000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schaeffler India: New HR and CSR Head Appointed",
            "Summary": "Schaeffler India has appointed Shibi Mathew as Head of Human Resources and Corporate Social Responsibility, effective November 4, 2024. Mathew brings 22 years of strategic HR experience and will join the Executive Leadership Team, focusing on building high-performing teams and advancing the company's people-first approach.",
            "Sentiment": "positive",
            "PublishDate": 1733206885000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Schaeffler to Cut 4,700 Jobs in Europe",
            "Summary": "German industrial and automotive supplier Schaeffler has announced plans to reduce its workforce by 4,700 positions across Europe. This significant job cut is likely part of a restructuring or cost-saving initiative, though specific reasons are not provided in the brief news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1730790649000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schaeffler India: Q3 PAT Rises Marginally to Rs 236.41 Crore",
            "Summary": "Schaeffler India reported a slight increase in Q3 PAT to Rs 236.41 crore from Rs 232.76 crore year-over-year. Revenue grew 14% to Rs 2,116.3 crore. The company's domestic business maintained growth momentum despite challenging market conditions.",
            "Sentiment": "neutral",
            "PublishDate": 1729693500000,
            "Source": "result"
        },
        {
            "Title": "Schaeffler India Reports Q2 Financial Results",
            "Summary": "Schaeffler India has announced its Q2 financial results. The company's EBITDA increased to 3.75 billion rupees from 3.42 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 18.11% from 18.50% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1729682318000,
            "Source": "result"
        },
        {
            "Title": "Schaeffler India Reports Q2 Revenue Growth",
            "Summary": "Schaeffler India has announced its Q2 revenue of 20.7 billion rupees, compared to 18.5 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729682308000,
            "Source": "result"
        },
        {
            "Title": "Schaeffler India Reports Q2 Net Profit of 2.5B Rupees",
            "Summary": "Schaeffler India has announced its Q2 financial results. The company reported a net profit of 2.5 billion rupees, showing a year-over-year increase from 2.35 billion rupees. Compared to the previous quarter, there was a slight decrease from 2.53 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729682294000,
            "Source": "result"
        }
    ]
}