{
    "Symbol": "SCHNEIDER",
    "ISIN": "INE839M01018",
    "News": [
        {
            "Title": "Schneider Electric Infra Q3FY26 Net Profit at ₹97.03 Cr",
            "Summary": "Schneider Electric Infrastructure reported Q3FY26 net profit of ₹97.03 crore with revenue of ₹1,029.17 crore. Board approved postal ballot for related party transactions and employee stock options.",
            "Sentiment": "positive",
            "PublishDate": 1770900144089,
            "Source": "co_actions_results"
        },
        {
            "Title": "Schneider Electric Infra Gets Stay on Tax Demand",
            "Summary": "Schneider Electric Infrastructure receives stay order from Income Tax Appellate Tribunal on INR 13.82 crore tax demand for AY 2021-22, required to pay 20% within two weeks.",
            "Sentiment": "positive",
            "PublishDate": 1770813088623,
            "Source": "stocks"
        },
        {
            "Title": "Schneider Electric Infra Board Meet on Feb 12",
            "Summary": "Schneider Electric Infrastructure Limited announces board meeting scheduled for February 12, 2026 to consider Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770279423990,
            "Source": "co_actions_results"
        },
        {
            "Title": "Schneider Electric Infra faces ₹3.28 Cr customs duty",
            "Summary": "Schneider Electric Infrastructure received customs order demanding ₹3.28 crore differential duty plus penalty for alleged misclassification of imported goods during 2020-2024.",
            "Sentiment": "negative",
            "PublishDate": 1769271773951,
            "Source": "stocks"
        },
        {
            "Title": "Schneider Electric CEO highlights India automation focus",
            "Summary": "CEO Gwenaelle Avice Huet outlines company's strategic focus on India's water, hydrogen, and green steel sectors, emphasizing 28,000+ workforce and local R&D capabilities at Davos 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768915893284,
            "Source": "global"
        },
        {
            "Title": "Schneider Electric Infra Faces ₹3.25 Cr GST Demand",
            "Summary": "Schneider Electric Infrastructure receives GST demand order worth ₹3.25 crores from Vadodara tax authorities for excess input tax credit claims related to FY2021-22 returns.",
            "Sentiment": "negative",
            "PublishDate": 1765875712208,
            "Source": "stocks"
        },
        {
            "Title": "CCI Approves Schneider Electric SE's Stake Acquisition in Schneider Electric India and SEJV2",
            "Summary": "The Competition Commission of India has approved Schneider Electric SE's acquisition of stakes in Schneider Electric India and SEJV2 from Macritchie Investments. This regulatory clearance enables the parent company to proceed with increasing its ownership in these entities.",
            "Sentiment": "positive",
            "PublishDate": 1765284986439,
            "Source": "order&deals"
        },
        {
            "Title": "Schneider Electric Infrastructure Receives GST Appeal Order Confirming Tax Demand for FY 2019-20",
            "Summary": "Schneider Electric Infrastructure Limited received an appeal order from Joint Commissioner CGST Appeals, Vadodara confirming the tax demand related to alleged wrong availment of Input Tax Credit for financial year 2019-20, though the penalty amount differs from the original order. The company states there is no material impact on financials or operations, with impact limited to the extent of demand in the appeal order.",
            "Sentiment": "negative",
            "PublishDate": 1764936583700,
            "Source": "stock"
        },
        {
            "Title": "Schneider Electric Infrastructure Receives Tax Demand Order for Wrong Input Tax Credit Availment",
            "Summary": "Schneider Electric Infrastructure Limited received a demand order from CGST Commissionerate-II, Pune for wrong availment of Input Tax Credit totaling INR 28,11,898 in tax and equal penalty for periods FY2018-19, 2021-22, and 2022-23. The company states there is no material impact on financials or operations and is evaluating appropriate legal remedy against the order.",
            "Sentiment": "negative",
            "PublishDate": 1764151064730,
            "Source": "stock"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports 28% Order Growth in H1 Despite Revenue Slowdown",
            "Summary": "Schneider Electric Infrastructure Limited reported robust order growth of 28% in the first half and 15.6% in the second quarter, while revenue growth remained modest at 6.6% for H1 and 8.4% for Q2. The company won the Golden Peacock Award for ESG performance and was recognized as a top 15 employer by TIME and Statista. EBITDA margins stood at 11.6% for H1 and 12.5% for Q2. The company is expanding capacity with ongoing CAPEX programs including vacuum interrupter plants in Kolkata and switchgear expansion in Vadodara. Management highlighted opportunities in power grid modernization, data centers, renewables, and mobility segments, with the government's RDSS scheme allocation of INR 3 lakh crores supporting infrastructure development. The revenue mix showed systems at 65%, transactional at 20%, and services at 15% for H1. Finished goods inventory increased by INR 59 crores due to delayed customer clearances, expected to be resolved in Q3.",
            "Sentiment": "neutral",
            "PublishDate": 1762985517032,
            "Source": "earnings"
        },
        {
            "Title": "Schneider Electric Infrastructure Seeks Shareholder Approval for Two Independent Director Appointments",
            "Summary": "Schneider Electric Infrastructure Limited has issued a postal ballot notice seeking shareholder approval for the appointment of two new Non-Executive Independent Directors. The company proposes to appoint Dr. Shalini Sarin (DIN: 06604529) and Mr. Sundaram Damodarannair (DIN: 00016304) as Independent Directors for a three-year term from October 24, 2025 to October 23, 2028. Both appointments require special resolution approval. Additionally, the company seeks approval to increase commission payment to Non-Executive Independent Directors from INR 5 lakh to INR 10 lakh per annum through an ordinary resolution. The e-voting period runs from November 12, 2025 to December 11, 2025, with results to be announced by December 15, 2025. Dr. Sarin brings expertise in human resources and sustainable business practices, while Mr. Damodarannair has extensive experience in corporate finance and governance.",
            "Sentiment": "neutral",
            "PublishDate": 1762848751068,
            "Source": "corporate_governance"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Strong Q2 FY26 Growth with 28% Order Increase",
            "Summary": "Schneider Electric Infrastructure Limited announced its quarterly results for the second quarter and half year ended September 30, 2025. The company reported strong performance with H1 orders reaching INR 1,749 crores, representing 28% year-over-year growth, while Q2 orders stood at INR 838 crores with 15.6% growth. H1 sales were INR 1,272 crores (6.6% YoY growth) and Q2 sales reached INR 681 crores (12.5% growth). The company's order backlog as of September 30, 2025 was INR 1,805 crores, showing 25% year-over-year growth. The results were approved by the Board of Directors in their meeting held on November 7, 2025. The company highlighted strategic wins across segments and emphasized growth through future-ready solutions including cybersecurity and compact solutions.",
            "Sentiment": "positive",
            "PublishDate": 1762750316088,
            "Source": "earnings"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Quarterly Results and Announces Board Appointments via Postal Ballot",
            "Summary": "Schneider Electric Infrastructure Limited's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs. 35,459 lakhs for the quarter and Rs. 70,265 lakhs for the half-year. Net profit stood at Rs. 4,284 lakhs for the quarter and Rs. 8,993 lakhs for the half-year. Basic and diluted earnings per share was Rs. 18.20 for the quarter and Rs. 38.20 for the half-year. The Board also approved conducting a postal ballot for shareholder approval on three matters: appointment of Dr. Shalini Sarin as Non-Executive Independent Director, appointment of Mr. Sundaram Damodarannair as Non-Executive Independent Director, and payment of remuneration by way of commission to Non-Executive Independent Directors. The statutory auditors provided an unmodified opinion on the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762530547770,
            "Source": "earnings"
        },
        {
            "Title": "Schneider Electric Infra Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Schneider Electric Infra reported Q2 revenue of 6.5 billion rupees, up from 6 billion rupees in the same period last year. EBITDA increased to 838 million rupees from 742 million rupees year-over-year, with EBITDA margin improving to 12.9% from 12.37%. However, net profit declined to 523 million rupees compared to 543 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762509785911,
            "Source": "earnings"
        },
        {
            "Title": "Schneider Electric Infrastructure Limited Announces Board Changes as Independent Director Completes Tenure",
            "Summary": "Schneider Electric Infrastructure Limited announced that Ms. Namrata Kaul (DIN: 00994532) completed her second and final term as Independent Director on November 5, 2025, and ceased to hold the position effective from close of business hours that day. Ms. Kaul also ceased to be the Chairperson of the Board from the same date. The Board of Directors appointed Mr. Pravin Kumar Purang as the new Chairperson of the Board, effective from November 6, 2025. The Board and Management expressed appreciation for Ms. Kaul's guidance, contribution, and support during her association with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1762404247054,
            "Source": "corporate_governance"
        },
        {
            "Title": "Schneider Electric Infrastructure Director Anil Chaudhry Resigns Due to Personal Reasons",
            "Summary": "Anil Chaudhry has resigned from his position as Non-Executive Non-Independent Director of Schneider Electric Infrastructure Limited with immediate effect on October 30, 2025. The resignation was attributed to personal reasons. Chaudhry expressed gratitude for his time serving on the board and working with the management team over the years, while wishing the company future success.",
            "Sentiment": "neutral",
            "PublishDate": 1761854903577,
            "Source": "corporate_governance"
        },
        {
            "Title": "Schneider Electric Infrastructure Appoints Two Independent Directors and New Chairperson",
            "Summary": "Schneider Electric Infrastructure Limited's Board of Directors approved the appointment of Mr. Sundaram Damodarannair and Dr. Shalini Sarin as Additional Non-Executive Independent Directors for three consecutive years starting October 24, 2025, subject to shareholder approval. The Board also approved the appointment of Mr. Pravin Kumar Purang as Chairperson effective November 6, 2025. Mr. Sundaram brings extensive experience in corporate finance, business performance, and governance, having served as CFO of Hindustan Unilever Limited and holding directorships in companies including Crompton Greaves and Infosys Limited. Dr. Shalini Sarin has expertise in human resources and sustainable business practices, previously serving as global CHRO for Philips Professional Lighting and CHRO for Schneider Electric South Asia, with board positions at Linde and Kirloskar Oil Engines. Both appointees hold no shares in the company and are not related to existing directors or key managerial personnel.",
            "Sentiment": "positive",
            "PublishDate": 1761290796352,
            "Source": "corporate_governance"
        },
        {
            "Title": "Schneider Electric Infrastructure CFO Suparna Banerjee Bhattacharyya Resigns to Pursue External Opportunity",
            "Summary": "Suparna Banerjee Bhattacharyya has resigned from her position as Chief Financial Officer, Key Managerial Personnel and Senior Management Personnel of Schneider Electric Infrastructure Limited, effective from the close of business hours on September 15, 2025. In her resignation letter, Bhattacharyya cited her decision to pursue a career opportunity outside the organization. She confirmed there are no other material reasons for her resignation beyond what was stated in her letter. The company has notified stock exchanges BSE and NSE about the resignation in compliance with regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1758012814990,
            "Source": "corporate_governance"
        },
        {
            "Title": "Schneider Electric Infrastructure Limited Appoints Omkar Prasad as CFO Following Suparna Banerjee Bhattacharyya's Resignation",
            "Summary": "Schneider Electric Infrastructure Limited's Board of Directors approved the resignation of Ms. Suparna Banerjee Bhattacharyya from the Chief Financial Officer position, effective September 15, 2025, to pursue career opportunities outside the organization. The company simultaneously appointed Mr. Omkar Prasad as CFO, effective September 16, 2025. Prasad serves as Chief Accounting Officer for Greater India at Schneider Electric, overseeing operations across India, Sri Lanka, and Bangladesh. He brings over two decades of experience in finance controllership, tax compliances, risk management, and digital transformation. Prasad is a Fellow Chartered Accountant with certifications in Business Responsibility and Sustainability Reporting, and holds a master's degree in economics from Indian Institute of Management Bengaluru. He holds 2 equity shares in the company, while the outgoing CFO held no shares.",
            "Sentiment": "neutral",
            "PublishDate": 1756366590986,
            "Source": "corporate_governance"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports 42% Order Growth Despite Muted Sales in Q1 FY26",
            "Summary": "Schneider Electric Infrastructure Limited reported strong order intake of INR 910 crores, marking a 42.1% increase over the previous year, while sales grew modestly at 5% to INR 622 crores. The company's gross margins declined to INR 241 crores (down 1.5%) and EBIT fell to INR 67 crores (down 2.5 points). PAT stood at INR 41 crores, 1.5% lower than the corresponding period. The company attributed the moderate sales growth to project spillovers and delays that shifted to subsequent quarters. Management highlighted a 25% increase in order backlog, providing confidence for accelerated sales in coming quarters. The company is expanding capacity with INR 200+ crores investment and currently operates at 85-90% capacity utilization. Key growth drivers include renewable energy projects, data centers, EV charging infrastructure, and smart grid solutions. Power and Grid segment contributes 40-45% of overall business, with the company focusing on technology-driven solutions and selective order booking for better margins and payment terms.",
            "Sentiment": "neutral",
            "PublishDate": 1755008924262,
            "Source": "earnings"
        },
        {
            "Title": "Schneider Electric Infra Reports ₹910 Cr Order Surge with ₹1,635 Cr Backlog",
            "Summary": "Schneider Electric Infra experienced a significant order surge of ₹910 crores in Q1FY26. The company maintains a substantial backlog of ₹1,635 crores and is positioning for multi-year growth driven by energy transition megatrends and new digital offerings.",
            "Sentiment": "positive",
            "PublishDate": 1754576586593,
            "Source": "stock"
        },
        {
            "Title": "Schneider Electric Infra Reports Mixed Q1 Results with Revenue Growth but Declining Profitability",
            "Summary": "Schneider Electric Infra reported Q1 revenue of 6.22 billion rupees, up from 5.93 billion rupees in the same period last year. However, the company's profitability declined with net profit falling to 412 million rupees from 485 million rupees year-over-year. EBITDA dropped to 693 million rupees from 817 million rupees, while EBITDA margin compressed to 11.15% from 13.78% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1754566810890,
            "Source": "earnings"
        },
        {
            "Title": "Schneider Electric Infrastructure Limited Secures Stay Order Against INR 18.53 Crore Income Tax Demand",
            "Summary": "Schneider Electric Infrastructure Limited obtained a stay order from the Gujarat High Court against an Income Tax Assessment Order demanding INR 18.53 crore for Assessment Year 2017-18. The court granted the stay order on August 5, 2025, suspending the enforcement and execution of the assessment order until the company's writ petition is disposed of. The assessment was made under Section 147 read with Section 144B of the Income Tax Act after income adjustments by the Assessment Unit of the Income Tax Department.",
            "Sentiment": "positive",
            "PublishDate": 1754478007224,
            "Source": "stock"
        },
        {
            "Title": "Schneider Electric Infrastructure CFO Suparna Banerjee Bhattacharyya Resigns",
            "Summary": "Suparna Banerjee Bhattacharyya has resigned from her position as Chief Financial Officer of Schneider Electric Infrastructure Limited, effective July 21, 2025. She is leaving to pursue career opportunities outside the organization. Her resignation also means she will relinquish her roles as Key Managerial Personnel and Senior Management Official of the company. The company has informed stock exchanges BSE and NSE about the resignation, with her last working day to be communicated later.",
            "Sentiment": "neutral",
            "PublishDate": 1753098718044,
            "Source": "corporate_governance"
        },
        {
            "Title": "Schneider Electric Aims to Acquire Temasek's 35% Stake",
            "Summary": "Schneider Electric is reportedly seeking to purchase Temasek's 35% share in Schneider Electric, according to CNBC TV18. No further details about the potential acquisition or its implications were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1752659311000,
            "Source": "default"
        },
        {
            "Title": "Schneider Electric Infrastructure Schedules Analyst and Investor Meeting",
            "Summary": "Schneider Electric Infrastructure has announced plans to hold an Analyst and Investor Meeting on July 7. No further details about the meeting's agenda or purpose were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1751456288000,
            "Source": "default"
        },
        {
            "Title": "Schneider Electric Infrastructure Ltd: Goldman Sachs Upgrades to 'Buy', Shares Rise 4%",
            "Summary": "Goldman Sachs upgraded Schneider Electric Infrastructure Ltd. to 'Buy' from 'Sell' with a price target of ₹910. Key drivers include expected increase in Total Addressable Market to $14.5 billion by FY32, market share growth to 3.3%, margin expansion to 39.6%, potential undervaluation, government support, and projected 31% CAGR in order inflows over FY25-FY28E.",
            "Sentiment": "positive",
            "PublishDate": 1750147113000,
            "Source": "normal_news"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Significant Profit Increase in Q4",
            "Summary": "Schneider Electric Infrastructure has reported a substantial increase in net profit for the fourth quarter. The company's net profit rose to 546 million rupees, compared to 32.8 million rupees in the same quarter of the previous year. This represents a significant year-over-year growth. Sequentially, the profit increased from 1.1 billion rupees in the previous quarter. The company's revenue for Q4 also saw growth, reaching 5.9 billion rupees, up from 4.72 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748304352000,
            "Source": "default"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Q4 EBITDA Growth",
            "Summary": "Schneider Electric Infrastructure has reported its Q4 EBITDA as 867 million rupees, compared to 732 million rupees in the same quarter of the previous year, showing a year-over-year increase. However, the Q4 EBITDA margin decreased to 14.77% from 15.52% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748260286000,
            "Source": "result"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Significant Profit Increase in Q4",
            "Summary": "Schneider Electric Infrastructure has reported a substantial increase in net profit for Q4, rising to 546 million rupees from 32.8 million rupees year-over-year. This also represents an increase from 1.1 billion rupees quarter-over-quarter. The company's Q4 revenue grew to 5.9 billion rupees, up from 4.72 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748260157000,
            "Source": "result"
        },
        {
            "Title": "Schneider Electric: Transforming Rural India with Climate-Smart Villages",
            "Summary": "Schneider Electric's Climate Smart Village initiative in Jharkhand, India, is replacing diesel-powered irrigation with solar energy, tripling crop yields and increasing farmer incomes. The project provides solar-powered streetlights, clean energy for homes, and trains villagers in agri-processing and sustainable farming. Electric vehicles are improving market access for farmers. The company plans to expand this model across India and globally.",
            "Sentiment": "positive",
            "PublishDate": 1743518537000,
            "Source": "normal_news"
        },
        {
            "Title": "Bisleri International Partners with Schneider Electric for Solar Power Expansion",
            "Summary": "Bisleri International has entered into a partnership with Schneider Electric to improve energy efficiency and expand solar power capacity. The collaboration involves installing up to 13.6 MW of solar power across six major Bisleri International plants.",
            "Sentiment": "positive",
            "PublishDate": 1743090783000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schneider Electric Partners with South Bihar Power Distribution Company and Tata Power for Infrastructure Upgrades",
            "Summary": "Schneider Electric has announced two significant partnerships in India's power sector. The company is collaborating with South Bihar Power Distribution Company to transform power distribution infrastructure in Bihar, deploying EcoStruxure Grid Solutions for improved grid connectivity and reliability. Additionally, Schneider Electric has secured a contract from Tata Power to deploy 11kV SF6-free Ring Main Units using their RM AirSet SF6-free technology. This project is expected to be completed by April 2025 and could result in lifecycle cost savings of up to 50% for Tata Power.",
            "Sentiment": "positive",
            "PublishDate": 1741651518000,
            "Source": "order&deals"
        },
        {
            "Title": "Schneider Electric Secures Contract from Tata Power for SF6-Free Technology",
            "Summary": "Schneider Electric has been awarded a contract by Tata Power for the deployment of 11kV SF6-free Ring Main Units (RMUs) using Schneider's RM AirSet SF6 free technology. The project is scheduled to be completed by April 2025 and is expected to result in lifecycle cost savings of up to 50% for Tata Power.",
            "Sentiment": "positive",
            "PublishDate": 1741614082000,
            "Source": "order&deals"
        },
        {
            "Title": "Schneider Electric Infrastructure Approves ₹15.8 Crore Capex to Increase RMU Capacity",
            "Summary": "Schneider Electric Infrastructure has approved a capital expenditure of ₹15.8 crore to boost its Ring Main Unit (RMU) production capacity by 25%. This investment aims to enhance the company's manufacturing capabilities and meet growing market demand for electrical distribution equipment.",
            "Sentiment": "positive",
            "PublishDate": 1741581706000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schneider Electric: Sustainability Drives Innovation and Community Impact",
            "Summary": "Schneider Electric integrates sustainability into core business strategy, leading to enhanced profitability and innovation. The company focuses on reducing Scope 1, 2, and 3 emissions, customizing global sustainability goals for local contexts, and combining electrification with digital technologies to move towards a low-carbon future. Schneider's Access to Energy program creates long-term economic resilience in underserved communities, particularly in India.",
            "Sentiment": "positive",
            "PublishDate": 1741347195000,
            "Source": "normal_news"
        },
        {
            "Title": "Schneider Electric: Plans to Open Three New Manufacturing Plants in India",
            "Summary": "Schneider Electric announces plans to establish three new manufacturing plants in Kolkata, Hyderabad, and Ahmednagar, adding to its existing 31 plants in India. The company has already committed to investing Rs 3,200 crore to expand its industrial footprint in the country, aiming to add 1.2 million sq.ft. of area by 2026. India is Schneider's third-largest market globally and one of its four global hubs.",
            "Sentiment": "positive",
            "PublishDate": 1740234410000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schneider Electric Anticipates Order Increase in Next Quarter",
            "Summary": "Schneider Electric has announced expectations for an increase in orders during the upcoming quarter. The company is focusing on building up its order backlog by the end of the year, as revealed in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1739330319000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schneider Electric to Expand Transformer Manufacturing Capacity",
            "Summary": "Schneider Electric plans to increase its transformer manufacturing capacity from 5,500 MVA to 7,000 MVA by the fiscal year 2025-26. This expansion involves adding 1,500 MVA to their current capacity. The company is investing ₹13.6 crore in this expansion project.",
            "Sentiment": "positive",
            "PublishDate": 1739262498000,
            "Source": "corporate_action"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Q3 Revenue Increase",
            "Summary": "Schneider Electric Infrastructure announced its third quarter revenue, which rose to 8.6 billion rupees from 7.44 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739260529000,
            "Source": "earnings"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Improved Q3 EBITDA and Margin",
            "Summary": "Schneider Electric Infrastructure has announced its Q3 financial results. The company's EBITDA increased to 1.40 billion rupees, up from 1.1 billion rupees in the same quarter last year. Additionally, the EBITDA margin improved to 16.35% from 14.85% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739260518000,
            "Source": "earnings"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Q3 Net Profit Increase",
            "Summary": "Schneider Electric Infrastructure has reported a net profit of 1.1 billion rupees for the third quarter, compared to 910 million rupees in the same period last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1739260430000,
            "Source": "earnings"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Q2 EBITDA Growth",
            "Summary": "Schneider Electric Infrastructure has reported its Q2 financial results. The company's EBITDA increased to 742 million rupees from 626 million rupees in the same quarter last year. However, the EBITDA margin slightly decreased to 12.37% from 12.63% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731567690000,
            "Source": "result"
        },
        {
            "Title": "Schneider Electric Infrastructure Reports Q2 Profit Increase",
            "Summary": "Schneider Electric Infrastructure has reported a net profit of 543 million rupees for the second quarter, up from 429 million rupees in the same period last year. This represents a year-over-year increase in profitability for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731567621000,
            "Source": "result"
        },
        {
            "Title": "Schneider Electric: Tax Appeal for ₹2.2 Crore Rejected",
            "Summary": "<p><span class='neutral'>Schneider Electric Infrastructure Ltd's</span> <span class='negative'>appeal against</span> a <span class='negative'>₹2.21 crore tax demand</span> for FY 2017-18 was <span class='negative'>rejected</span> by the Office of the Joint Commissioner of Commercial Taxes in Bengaluru. The demand includes <span class='negative'>₹87.75 lakh in tax</span>, <span class='negative'>₹1.24 crore in interest</span>, and <span class='negative'>₹8.77 lakh in penalties</span>. The company is <span class='neutral'>evaluating legal options</span> but states <span class='positive'>no material impact on financials or operations</span>.<br/><b>Key figures:</b><br/>• Total tax demand: ₹2.21 crore<br/>• Tax: ₹87.75 lakh<br/>• Interest: ₹1.24 crore<br/>• Penalties: ₹8.77 lakh</p>",
            "Sentiment": "negative",
            "PublishDate": 1728390586000,
            "Source": "normal_news"
        },
        {
            "Title": "Supreme Court Rules in Favor of IT Department Against Schneider Electric Infrastructure",
            "Summary": "<p>Schneider Electric Infrastructure has reported that the <span class='neutral'>Supreme Court of India</span> has issued a <span class='negative'>ruling in favor</span> of the <span class='neutral'>Income Tax Department</span> in a <b>case</b> involving the company.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728029267000,
            "Source": "corporate_action"
        }
    ]
}