{
    "Symbol": "SCI",
    "ISIN": "INE109A01011",
    "News": [
        {
            "Title": "SCI Reports Strong Q3FY26 Results, Declares Dividend",
            "Summary": "The Shipping Corporation of India posted net profit of ₹39,337 lakhs in Q3FY26, up from ₹6,480 lakhs in Q3FY25. Board declared second interim dividend of ₹3.5 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770391812956,
            "Source": "co_actions_results"
        },
        {
            "Title": "SCI Receives ₹199.76 Crore Tax Refund from ITAT Order",
            "Summary": "The Shipping Corporation of India Limited received a favourable income tax refund of ₹199.76 crore on February 3, 2026, following a positive ITAT ruling on FY 2009-10 disputes.",
            "Sentiment": "positive",
            "PublishDate": 1770200731582,
            "Source": "stocks"
        },
        {
            "Title": "SCI Board Meeting on Feb 6 for Q3FY26 Results",
            "Summary": "The Shipping Corporation of India Limited has scheduled a board meeting on February 6, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769747683328,
            "Source": "co_actions_results"
        },
        {
            "Title": "SCI Clarifies Container Shipping Line Collaboration News",
            "Summary": "Shipping Corporation of India responds to BSE query on container shipping line collaboration news, referencing July 2024 board approval for business partnerships with state and private entities.",
            "Sentiment": "neutral",
            "PublishDate": 1769524140157,
            "Source": "stocks"
        },
        {
            "Title": "SECI Awards 1.2 GW Solar-Storage Projects to Four Firms",
            "Summary": "Engie Energy India, NLC India Renewables, RPIL Power Three, and Oriana Power won SECI's Tranche XXI auction for 1,200 MW solar projects with 3,600 MWh storage at tariffs of ₹3.12-3.13/kWh.",
            "Sentiment": "positive",
            "PublishDate": 1767970445010,
            "Source": "co_actions_results"
        },
        {
            "Title": "SCI Appoints Uttam Gharde as Deputy CVO",
            "Summary": "The Shipping Corporation of India Limited announces the appointment of Mr. Uttam Gharde as Deputy Chief Vigilance Officer, effective January 1, 2026, following an internal order.",
            "Sentiment": "neutral",
            "PublishDate": 1767959321993,
            "Source": "stocks"
        },
        {
            "Title": "SCI Announces Board Changes with New Director Finance",
            "Summary": "The Shipping Corporation of India appoints Capt. Som Raj as Director (Finance) with additional charge effective January 1, 2026, replacing Shri Vikram Dingley whose tenure ends December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767011413751,
            "Source": "stocks"
        },
        {
            "Title": "SCI Promotes Jothi Krishnan to General Manager Role",
            "Summary": "The Shipping Corporation of India announces internal promotion of Mr. Jothi Krishnan Kandasamy to General Manager position, effective December 24, 2025, heading Internal Audit Department.",
            "Sentiment": "positive",
            "PublishDate": 1766591775517,
            "Source": "stocks"
        },
        {
            "Title": "SCI and Public Sector Oil Refiners Hold Discussions with Korean Shipyards on Indian Shipbuilding Facility",
            "Summary": "Shipping Corporation of India (SCI) and public sector oil refiners engaged in discussions with three major Korean shipyards regarding establishing a shipbuilding facility in India. The talks represent potential collaboration between Indian state-owned companies and Korean shipbuilding expertise for domestic maritime infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1764299224347,
            "Source": "stock"
        },
        {
            "Title": "Shipping Corporation of India Reports 39% Drop in Net Profit to Rs 176 Crore",
            "Summary": "Shipping Corporation of India reported weak quarterly results with net profit declining 39% to Rs 176 crore compared to Rs 290 crore in the same quarter last year. Operating revenue fell 8% to Rs 1,339 crore from Rs 1,451 crore, while EBITDA dropped 13% to Rs 504 crore. For the first half, revenue decreased 10.4% to Rs 2,654 crore and net profit slipped 10% to Rs 519 crore. The company showed mixed segment performance - Liner segment revenue at Rs 213 crore, Bulk Carrier at Rs 201 crore, Tanker at Rs 858 crore, and Technical & Offshore at Rs 74 crore. The company declared an interim dividend of Rs 3 per share with November 19 as record date. Shares gained 2.1% to close at Rs 265.95, delivering 57% returns over the past six months.",
            "Sentiment": "negative",
            "PublishDate": 1762747460737,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India Reports Strong Q2 Results, Declares Rs 3 Interim Dividend",
            "Summary": "The Shipping Corporation of India Limited approved unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board declared an interim dividend of Rs 3 per equity share (30% on face value of Rs 10 each) for FY 2025-26, with record date set as November 19, 2025. The company reported standalone profit after tax of Rs 17,008 lakhs for Q2 and Rs 25,157 lakhs for H1. Revenue from operations stood at Rs 74,548 lakhs for the quarter. During the quarter, the company sold vessel Maharshi Parshuram and took delivery of two Very Large Gas Carrier vessels - Sahyadri and Shivalik. The company operates across four segments: Liner, Bulk Carrier, Tanker, and Technical & Offshore services. Strategic disinvestment process by DIPAM continues with Virtual Data Room open for qualified interested parties.",
            "Sentiment": "positive",
            "PublishDate": 1762529672854,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India Reports Decline in Q2 Financial Performance",
            "Summary": "Shipping Corporation of India reported Q2 consolidated net profit of 1.89 billion rupees, down from 2.9 billion rupees in the same period last year. Revenue decreased to 13.39 billion rupees from 14.51 billion rupees year-over-year. EBITDA fell to 4.07 billion rupees compared to 5.32 billion rupees previously, while EBITDA margin compressed to 30.36% from 36.71% in the prior year period.",
            "Sentiment": "negative",
            "PublishDate": 1762525805572,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India Schedules Q2 Results Release for November 7, Considers Interim Dividend",
            "Summary": "Shipping Corporation of India will announce its unaudited standalone and consolidated financial results for the quarter and half-year ended September 30 on November 7. The Board will also consider declaring an interim dividend, which if approved, will be paid within 30 days. The company's trading window has been closed since October 1 and will remain shut until 48 hours after the results announcement. An earnings call is scheduled for November 10 at 4 p.m. IST. In Q1 FY26, the company reported a 13.1% decline in consolidated revenue to Rs 1,316.04 crore, while net profit increased 22% to Rs 354.17 crore. The company's shares have risen 16.69% in the last month and 23.66% year-to-date, trading at Rs 261.55 with a 52-week high of Rs 280.50.",
            "Sentiment": "neutral",
            "PublishDate": 1762404591418,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India Appoints New Government Nominee Director",
            "Summary": "The Shipping Corporation of India Limited announced a change in its Board composition. Shri R. Lakshmanan, Joint Secretary, has been appointed as Part-time Government Nominee Director, replacing Shri Venkatesapathy S., Joint Secretary. The Ministry of Ports, Shipping and Waterways approved this nomination. Both the appointment of Lakshmanan and cessation of Venkatesapathy became effective on November 4, 2025. The company is completing statutory formalities for the appointment and will provide additional details as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762297077818,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shipping Corporation of India Land & Assets Reports Mixed Q2 Results",
            "Summary": "Shipping Corporation of India Land & Assets reported quarterly net profit of 41.9 million rupees, down from 128.6 million rupees in the same period last year. However, the company's revenue increased to 61.3 million rupees compared to 40 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762265049902,
            "Source": "earnings"
        },
        {
            "Title": "Government Likely to Pause Shipping Corporation of India Privatisation",
            "Summary": "The government is likely to pause the privatisation of Shipping Corporation of India as it reviews the plan due to changing global trade and geopolitical conditions. Sources indicate the government now aims to strengthen the national carrier to handle disruptions in global shipping routes and reduce India's reliance on foreign vessels. The focus is shifting from divestment to capacity building.",
            "Sentiment": "neutral",
            "PublishDate": 1761276494817,
            "Source": "stock"
        },
        {
            "Title": "Shipping Corporation of India Appoints Rear Admiral Jaswinder Singh as Director (BC&T) on Additional Charge",
            "Summary": "The Shipping Corporation of India Limited announced the appointment of Rear Admiral Jaswinder Singh as Director (BC&T) on additional charge basis from October 1, 2025 to December 31, 2025. The appointment was approved by the Ministry of Ports, Shipping and Waterways. Rear Admiral Singh currently serves as Director (L&PS) at SCI and has over three and half decades of maritime experience including distinguished service in the Indian Navy and Coast Guard. He has been with SCI since 2023, heading the Liner and Passenger Services segment, and previously held additional charge of the Bulk and Tanker segment for three months. Singh is not related to any company director and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1760535693369,
            "Source": "corporate_governance"
        },
        {
            "Title": "SCI: Government Working to Stabilize Freight Rates Amid Global Uncertainty",
            "Summary": "The government is undertaking efforts to stabilize freight rates during a period of global uncertainty. The initiative involves SCI (Shipping Corporation of India) as part of measures to address volatility in shipping costs.",
            "Sentiment": "neutral",
            "PublishDate": 1760510914177,
            "Source": "stock"
        },
        {
            "Title": "SCI Plans Bold Expansion and Growth Strategy",
            "Summary": "The Shipping Secretary announced that Shipping Corporation of India (SCI) is pursuing an ambitious expansion and growth plan. The statement indicates the state-owned shipping company's strategic focus on scaling operations.",
            "Sentiment": "positive",
            "PublishDate": 1760509736278,
            "Source": "stock"
        },
        {
            "Title": "Government Plans Investment in SCI to Enhance Fleet Operations",
            "Summary": "The government has announced plans to invest in Shipping Corporation of India (SCI) with the objective of enhancing the company's fleet capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1760068074133,
            "Source": "stock"
        },
        {
            "Title": "Shipping Corporation Of India Signs MoU With Oil PSUs For Joint Fleet Operations",
            "Summary": "Shipping Corporation Of India has signed a Memorandum of Understanding with Bharat Petroleum Corporation Limited (BPCL), Hindustan Petroleum Corporation Limited (HPCL), and Indian Oil Corporation Limited (IOCL). The agreement aims to jointly operate a fleet to support Atmanirbhar Bharat initiatives and enhance energy security.",
            "Sentiment": "positive",
            "PublishDate": 1758500180102,
            "Source": "order&deals"
        },
        {
            "Title": "Shipping Corporation of India Partners with Oil PSUs for Joint Fleet Operations",
            "Summary": "The Shipping Corporation of India Ltd. has signed a Memorandum of Understanding with Bharat Petroleum Corporation Ltd., Hindustan Petroleum Corporation Ltd., and Indian Oil Corporation Ltd. The collaboration aims to jointly acquire, own, operate, and manage vessels for international trade and coastal transport of petroleum, petroleum products, petrochemicals, and other hydrocarbon cargoes. The partnership is part of a Government of India initiative through the Ministry of Ports, Shipping and Waterways and the Ministry of Petroleum and Natural Gas, designed to strengthen India's shipping capacity and improve the country's energy security while supporting the Atmanirbhar Bharat vision.",
            "Sentiment": "positive",
            "PublishDate": 1758357667123,
            "Source": "order&deals"
        },
        {
            "Title": "Shipping Corporation Of India Acquires Secondhand Gas Carrier Vessel Shivalik",
            "Summary": "Shipping Corporation Of India has taken delivery of a secondhand large gas carrier named 'Shivalik' with a deadweight tonnage of 54,534 MT. The acquisition expands the company's fleet capacity in the gas transportation segment.",
            "Sentiment": "positive",
            "PublishDate": 1757500387195,
            "Source": "stock"
        },
        {
            "Title": "Shipping Sector May Gain Infrastructure Status to Improve Funding Access",
            "Summary": "The shipping sector might receive infrastructure status, which would ease funding for shipping companies. This potential classification change could improve access to capital for companies in the shipping industry.",
            "Sentiment": "positive",
            "PublishDate": 1755507470238,
            "Source": "sectoral"
        },
        {
            "Title": "Shipping Corporation Wins CESTAT Mumbai Ruling, Expects ₹1.46 Billion Demand Reduction",
            "Summary": "Shipping Corporation received a favorable ruling from CESTAT Mumbai. The company anticipates a ₹1.46 billion reduction in demand and interest as a result of this ruling.",
            "Sentiment": "positive",
            "PublishDate": 1755165003682,
            "Source": "stock"
        },
        {
            "Title": "Shipping Corporation of India Takes Delivery of Secondhand VLGC 'SAHYADRI'",
            "Summary": "The Shipping Corporation of India Limited has taken physical delivery of a secondhand Very Large Gas Carrier (VLGC) named 'SAHYADRI' with a capacity of 53,999 DWT and 47,058 GT. The Protocol of Delivery & Acceptance was signed on August 14, 2025, at 12:30 PM IST. The company had previously provided intimation about this acquisition on July 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755164741624,
            "Source": "stock"
        },
        {
            "Title": "SCI Sells Crude Oil Tanker M.T. Maharshi Parashuram at Colombo Anchorage",
            "Summary": "The Shipping Corporation of India Limited sold its crude oil tanker M.T. Maharshi Parashuram on August 8, 2025, at Colombo Anchorage, Sri Lanka. The vessel was sold on an 'as is where is what is basis' and 'no complaint basis'. The physical handover to the buyer's representative occurred at 2100 hours IST on the same date at Colombo Anchorage.",
            "Sentiment": "neutral",
            "PublishDate": 1754670901601,
            "Source": "stock"
        },
        {
            "Title": "Shipping Corporation of India Reports 19.6% Rise in Quarterly Profit to ₹343 Crores, Appoints New Secretarial Auditor",
            "Summary": "The Shipping Corporation of India Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported a standalone net profit of ₹343.23 crores compared to ₹286.92 crores in the same quarter last year, representing a 19.6% increase. Revenue from operations declined to ₹1,315.68 crores from ₹1,514.07 crores year-on-year. The company's earnings per share increased to ₹7.37 from ₹6.16. On a consolidated basis, net profit rose to ₹354.17 crores from ₹291.48 crores in the previous year quarter. The Board also approved the appointment of M/s Upendra Shukla & Associates as Secretarial Auditor for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company continues to face ongoing matters including Performance Related Pay issues worth ₹11.03 crores and is undergoing strategic disinvestment process managed by DIPAM.",
            "Sentiment": "positive",
            "PublishDate": 1754660207880,
            "Source": "earnings"
        },
        {
            "Title": "Lok Sabha Approves The Merchant Shipping Bill",
            "Summary": "The Lok Sabha has approved The Merchant Shipping Bill. The approval relates to SCI (Shipping Corporation of India).",
            "Sentiment": "positive",
            "PublishDate": 1754472528829,
            "Source": "stock"
        },
        {
            "Title": "Shipping Corporation of India Land and Assets Reports 19% Growth in Q1 Net Profit",
            "Summary": "Shipping Corporation of India Land and Assets posted a net profit of 143 million rupees in Q1, representing a year-over-year increase from 120 million rupees in the same quarter last year. The company achieved growth of 23 million rupees compared to the previous year's corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1754468914481,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India Schedules Board Meeting on August 8 for Quarterly Results",
            "Summary": "The Shipping Corporation of India has scheduled a Board of Directors meeting for August 8, 2025 to consider and approve the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company's trading window has been closed since July 1, 2025 and will remain closed until 48 hours after the results declaration as per the company's insider trading code of conduct.",
            "Sentiment": "neutral",
            "PublishDate": 1754030092524,
            "Source": "corporate_action"
        },
        {
            "Title": "Shipping Corporation of India Appoints New Government Director, R. Lakshmanan Steps Down",
            "Summary": "The Ministry of Ports, Shipping and Waterways approved the appointment of Shri Venkatesapathy S., Joint Secretary (Shipping), as Government Director on the Board of Shipping Corporation of India Limited. The appointment was approved on July 28, 2025. Simultaneously, Shri R. Lakshmanan, Joint Secretary (Ports), ceased to be the Part-time Director (Government Nominee Director) on the SCI Board with immediate effect from the same date. SCI is completing statutory formalities for the new appointment and will provide additional details as required under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753708600992,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shipping Corporation of India's Finance Director C.L. Acharya's Premature Termination Approved by Cabinet Committee",
            "Summary": "The Appointments Committee of the Cabinet has approved the premature termination of C.L. Acharya from his position as Director (Finance) at Shipping Corporation of India Limited, effective from May 5, 2025, which was the date of his dismissal from service. The Ministry of Ports, Shipping and Waterways conveyed this approval on July 21, 2025. This follows an earlier disclosure by the company regarding Acharya's dismissal on the same date in May.",
            "Sentiment": "negative",
            "PublishDate": 1753161085827,
            "Source": "corporate_governance"
        },
        {
            "Title": "SCI Land And Assets Receives Stamp Duty Exemption for Demerger Plan",
            "Summary": "SCI Land And Assets has obtained approval from the Maharashtra Government for stamp duty exemption on its demerger plan. This development is significant for the company's restructuring efforts.",
            "Sentiment": "positive",
            "PublishDate": 1752675669000,
            "Source": "default"
        },
        {
            "Title": "Shipping Corp to Acquire Two Very Large Gas Carriers",
            "Summary": "Shipping Corp has executed a Memorandum of Agreement (MoA) for the acquisition of two Very Large Gas Carriers (VLGCs). These vessels, each with a cargo carrying capacity of 82,000 cubic meters, are scheduled to be inducted into the SCI fleet in FY 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1751846876000,
            "Source": "default"
        },
        {
            "Title": "Shipping Corp to Acquire Two Large Gas Carriers",
            "Summary": "Shipping Corp has signed an agreement to purchase two large gas carriers, each with a capacity of 82,000 CBM. These vessels are expected to join the SCI fleet in fiscal year 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1751637440000,
            "Source": "default"
        },
        {
            "Title": "Shipping Corporation of India: Shares Surge 8% on Expansion Plans",
            "Summary": "Shipping Corporation of India's shares rose 8% following news of a business development plan created with Deloitte. The plan aims to expand fleet size, replace existing vessels, and increase capacity. The company may sign MoUs with ONGC, Indian Oil, HPCL, and GAIL to boost participation in oil import vessel operations.",
            "Sentiment": "positive",
            "PublishDate": 1747902408000,
            "Source": "normal_news"
        },
        {
            "Title": "Shipping Corporation of India Reports Q4 Financial Results and Dividend",
            "Summary": "Shipping Corporation of India announced its Q4 consolidated net profit of 1.85 billion rupees, down from 3.07 billion rupees year-over-year but up from 755 million rupees quarter-over-quarter. Q4 revenue was 13.2 billion rupees, compared to 14.13 billion rupees in the same quarter last year. The company has recommended a dividend of 6.59 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1747613578000,
            "Source": "default"
        },
        {
            "Title": "Shipping Corporation of India: Q4 Profit Plunges 40%, Revenue Dips",
            "Summary": "Shipping Corporation of India reported a 40% drop in Q4 FY2025 consolidated net profit to Rs 185 crore. Revenue decreased 6.2% to Rs 1,325 crore. EBITDA fell 10% to Rs 364.6 crore with margins narrowing to 27.5%. The board recommended a dividend of Rs 6.59 per share for FY2025.",
            "Sentiment": "negative",
            "PublishDate": 1747407821000,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India Reports Q4 Results and Dividend",
            "Summary": "Shipping Corporation of India has announced its quarterly results and dividend. The company recommended a dividend of 6.59 rupees per equity share. For Q4, the company reported an EBITDA of 3.64 billion rupees, down from 4.07 billion rupees year-over-year. The EBITDA margin was 27.52%, compared to 28.82% in the same period last year. The consolidated net profit for Q4 was 1.85 billion rupees, down from 3.07 billion rupees year-over-year but up from 755 million rupees quarter-over-quarter. Q4 revenue stood at 13.2 billion rupees, down from 14.13 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747404114000,
            "Source": "result"
        },
        {
            "Title": "Shipping Corporation of India: Share Price Surges 10% Ahead of Q4 Results and Dividend Announcement",
            "Summary": "Shipping Corporation of India's share price increased by over 10% intraday, reaching ₹190.50. The company's board meeting is scheduled for May 16, 2025, to approve Q4 and FY 2024-25 financial results and consider a final dividend recommendation. The trading window is closed until 48 hours after the financial results declaration.",
            "Sentiment": "positive",
            "PublishDate": 1747380392000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shipping Corporation of India: Q4 Results Date Set, Dividend to be Considered",
            "Summary": "Shipping Corporation of India Ltd. will announce Q4 and FY 2025 results on May 16, 2025. The board will also consider recommending a final dividend. Trading window for company securities closed from April 1 until 48 hours post-results announcement.",
            "Sentiment": "neutral",
            "PublishDate": 1747282764000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shipping Corporation of India to Consider Q4 Results on May 16",
            "Summary": "Shipping Corporation of India (SCI) has announced that it will consider and approve its financial results for the fourth quarter on May 16.",
            "Sentiment": "neutral",
            "PublishDate": 1746704693000,
            "Source": "default"
        },
        {
            "Title": "Shipping Corporation of India Receives 1.57 Billion Rupees Income Tax Refund",
            "Summary": "Shipping Corporation of India has received an income tax refund of 1.57 billion rupees. This unexpected financial inflow could potentially improve the company's cash position and financial statements.",
            "Sentiment": "positive",
            "PublishDate": 1744762142000,
            "Source": "default"
        },
        {
            "Title": "Shipping Corporation of India Receives Significant Income Tax Refund",
            "Summary": "Shipping Corporation of India (SCI) has received an income tax refund of 1.57 billion rupees. This substantial refund could potentially improve the company's financial position and liquidity.",
            "Sentiment": "positive",
            "PublishDate": 1744723029000,
            "Source": "default"
        },
        {
            "Title": "Shipping Corporation of India Reports Q3 FY24 Financial Results",
            "Summary": "Shipping Corporation of India has announced its Q3 consolidated financial results. The company reported a net profit of 755 million rupees, which is lower compared to 1.34 billion rupees in the same quarter last year and 2.9 billion rupees in the previous quarter. Revenue for Q3 stood at 13.2 billion rupees, slightly down from 13.41 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1739146381000,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India Reports Decline in Q3 EBITDA",
            "Summary": "Shipping Corporation of India (SCI) has reported a decrease in its Q3 EBITDA, which fell to 3.6 billion rupees from 4.17 billion rupees year-over-year. The company's EBITDA margin also declined, dropping to 27.16% from 31.10% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1738936559000,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India Reports Q3 Financial Results",
            "Summary": "Shipping Corporation of India (SCI) has reported its Q3 consolidated net profit at 755 million rupees, showing a decrease from 1.34 billion rupees year-over-year and 2.9 billion rupees quarter-over-quarter. The company's Q3 revenue stood at 13.2 billion rupees, slightly down from 13.41 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738936492000,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India to Consider Q3 Results",
            "Summary": "Shipping Corporation of India has announced that it will consider its third quarter (Q3) financial results on February 7th. This indicates the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1737978971000,
            "Source": "result"
        },
        {
            "Title": "Shipping Corporation of India Reports Strong Q2 Financial Performance",
            "Summary": "Shipping Corporation of India has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA increased to 5.3 billion rupees, up from 2.36 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 36.71% from 21.56% year-over-year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1731072664000,
            "Source": "result"
        }
    ]
}