{
    "Symbol": "SCILAL",
    "ISIN": "INE0PB301013",
    "News": [
        {
            "Title": "SCILAL Reports Q3FY26 Results with Strong Performance",
            "Summary": "Shipping Corporation of India Land and Assets Limited posted net profit of ₹1,113 lakhs in Q3FY26, with total income at ₹2,656 lakhs. Nine-month profit reached ₹2,966 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770209699591,
            "Source": "co_actions_results"
        },
        {
            "Title": "SCILAL Extends CMD Additional Charge to Capt. B.K. Tyagi",
            "Summary": "Shipping Corporation of India Land and Assets Limited announces extension of additional charge of CMD post to Capt. B.K. Tyagi for one year from January 1, 2026, following ACC approval.",
            "Sentiment": "neutral",
            "PublishDate": 1770038588459,
            "Source": "stocks"
        },
        {
            "Title": "SCILAL Board Meet Set for Feb 3 to Approve Q3FY26 Results",
            "Summary": "Shipping Corporation of India Land and Assets Limited has scheduled a board meeting on February 3, 2026, to approve Q3FY26 unaudited financial results. Trading window closed from January 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769603827428,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shipping Corporation of India Fined Rs. 5.42 Lakh Each by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "The Shipping Corporation of India received fines totaling Rs. 5,42,800 each from BSE and NSE for non-compliance with SEBI Listing Regulations regarding Board of Directors composition. The Navratna PSU is coordinating with competent authorities for appointment of requisite Independent Directors including Independent Women Director, as only the competent authority has powers to nominate directors on SCI's board.",
            "Sentiment": "negative",
            "PublishDate": 1764337145556,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shipping Corporation of India Land and Assets Reports Quarterly Financial Results",
            "Summary": "Shipping Corporation of India Land and Assets Limited announced its unaudited standalone financial results for the quarter and half year ended September 30, 2025. The company reported a profit of Rs 587 lakhs for the quarter compared to Rs 1,760 lakhs in the previous quarter and Rs 357 lakhs in the same quarter last year. For the half year, profit stood at Rs 2,522 lakhs versus Rs 3,390 lakhs in the previous year. Revenue from operations was Rs 300 lakhs for the quarter, down from Rs 747 lakhs in the previous quarter. The company's earnings per share for the quarter was Rs 0.09 compared to Rs 0.31 in the previous quarter. Total assets stood at Rs 3,54,628 lakhs as of September 30, 2025. The Board of Directors approved these results at their meeting held on November 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762266731541,
            "Source": "earnings"
        },
        {
            "Title": "Shipping Corporation of India Land and Assets Limited Reports Q1 FY2026 Results and Appoints New Secretarial Auditor",
            "Summary": "Shipping Corporation of India Land and Assets Limited's Board of Directors approved unaudited standalone financial results for the quarter ended June 30, 2025. The company reported total segment revenue of ₹2,681 crores compared to ₹2,462 crores in the same quarter last year, representing an increase. Profit before tax stood at ₹1,935 crores versus ₹1,630 crores in the corresponding quarter of the previous year. The company operates through two segments: MTI (training institution) which generated ₹490 crores in revenue, and Others segment which contributed ₹2,191 crores. Total segment assets increased to ₹352,501 crores from ₹350,110 crores year-over-year. Additionally, the Board appointed M/s Upendra Shukla & Associates as Secretarial Auditor for five consecutive financial years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company received a 'NIL' comment from the Comptroller & Audit General of India for FY 2024-25 financials.",
            "Sentiment": "positive",
            "PublishDate": 1754469406103,
            "Source": "earnings"
        },
        {
            "Title": "SCILAL Appoints New Government Director as Board Composition Changes",
            "Summary": "The Ministry of Ports, Shipping and Waterways has approved the appointment of Shri Venkatesapathy S., Joint Secretary (Shipping), as Government Director on SCILAL's Board, effective July 28, 2025. Simultaneously, Shri Rajesh Kumar Sinha, Special Secretary at the ministry, ceased to be the Government Nominee Director on the same board. SCILAL is taking necessary action to complete statutory formalities for the new appointment and will provide requisite details as per regulatory requirements in due course.",
            "Sentiment": "neutral",
            "PublishDate": 1753709187717,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shipping Corporation of India Land and Assets Reports Q2 Total Income",
            "Summary": "Shipping Corporation of India Land and Assets has reported a total income of 254 million rupees for the second quarter, compared to 259 million rupees in the same period last year. This represents a slight year-over-year decrease in total income.",
            "Sentiment": "neutral",
            "PublishDate": 1730879754000,
            "Source": "result"
        }
    ]
}