{
    "Symbol": "SCODATUBES",
    "ISIN": "INE090501011",
    "News": [
        {
            "Title": "Scoda Tubes Files Q3 FY26 IPO Proceeds Report",
            "Summary": "Scoda Tubes Limited submitted its monitoring agency report for Q3 FY26, showing utilization of Rs 229.22 million from IPO proceeds and Rs 82.39 million from pre-IPO funds during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1770808636561,
            "Source": "co_actions_results"
        },
        {
            "Title": "Scoda Tubes Q3 FY26 Revenue Rises 17.25% to ₹1,523.99 Million",
            "Summary": "Scoda Tubes Limited reported Q3 FY26 revenue of ₹1,523.99 million, up 17.25% YoY, with net profit at ₹114.72 million. Nine-month revenue reached ₹3,950.81 million, marking 9.39% growth.",
            "Sentiment": "positive",
            "PublishDate": 1769776447949,
            "Source": "co_actions_results"
        },
        {
            "Title": "Scoda Tubes schedules plant visit for January 9, 2026",
            "Summary": "Scoda Tubes Limited has organized a physical plant visit for investors and analysts on January 9, 2026, at its Gujarat facility. The event will host 12 prominent investment firms including DSP Mutual Fund and Kotak Securities.",
            "Sentiment": "positive",
            "PublishDate": 1767173733900,
            "Source": "stocks"
        },
        {
            "Title": "Scoda Tubes schedules investor meet on Jan 2, 2026",
            "Summary": "Scoda Tubes Limited has scheduled an investor meeting for January 2, 2026 at 5:00 PM, arranged by Capital Bridge Advisors. The one-on-one meeting will be conducted online.",
            "Sentiment": "neutral",
            "PublishDate": 1767004895499,
            "Source": "stocks"
        },
        {
            "Title": "Scoda Tubes Reports 5% Revenue Growth in H1FY26, Expands Seamless Capacity to 20,000 MT",
            "Summary": "Scoda Tubes Limited delivered consolidated revenue growth of 5% and net earnings growth of 49% in H1FY26, with seamless tube capacity expanding from 10,000 to 17,000 metric tons per annum and targeting 20,000 MT by December. The company acquired Poland-based Arvind sp.z.o.o. to strengthen its European footprint and maintains an order book of INR 194 crores, targeting 20% revenue growth with new capacity coming online.",
            "Sentiment": "positive",
            "PublishDate": 1763454734613,
            "Source": "earnings"
        },
        {
            "Title": "Scoda Tubes Limited Reports Monitoring Agency Update on IPO and Pre-IPO Fund Utilization",
            "Summary": "Scoda Tubes Limited submitted CRISIL's monitoring report for quarterly results ended September 30, 2025, showing utilization of Rs 946.20 million from IPO and pre-IPO proceeds totaling Rs 2,757.29 million. The funds were deployed toward expanding production capacity of seamless and welded tubes, working capital requirements, and general corporate purposes with Rs 1,134.72 million remaining unutilized.",
            "Sentiment": "positive",
            "PublishDate": 1763128655456,
            "Source": "earnings"
        },
        {
            "Title": "₹19,000 Crore Worth of Shares from Four Companies Set to Unlock for Trading",
            "Summary": "195 million shares worth over ₹19,300 crore from four companies will become eligible for trading as their shareholder lock-in periods end. Premier Energies will see 185.2 million shares (41% of outstanding equity) worth ₹18,347 crore unlock after its one-year lock-in period. Aditya Infotech will have 4.3 million shares (4% of outstanding equity) worth ₹539 crore become tradeable after its one-month lock-in period, with the stock up 85% from its IPO price of ₹675 per share. Scoda Tubes and Laxmi India Finance will each see 2.4 million shares unlock, valued at ₹41 crore and ₹31 crore respectively. Scoda Tubes trades just above its IPO price of ₹140 per share, while Laxmi India Finance trades below its issue price of ₹158 per share. The unlocking makes shares eligible for trading but does not guarantee they will be sold in the open market.",
            "Sentiment": "neutral",
            "PublishDate": 1756682122108,
            "Source": "corporate_action"
        },
        {
            "Title": "SCODA TUBES Reports 48% Jump in Q1 Net Profit to 71M Rupees",
            "Summary": "SCODA TUBES reported quarterly net profit of 71 million rupees compared to 48 million rupees in the same period last year. Revenue increased to 974 million rupees from 919 million rupees year-over-year. However, EBITDA declined to 142 million rupees from 146 million rupees, while EBITDA margin compressed to 14.58% from 15.89% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1754918968060,
            "Source": "earnings"
        },
        {
            "Title": "Scoda Tubes: Seamless Products Contribute 80% of Revenue",
            "Summary": "Scoda Tubes reported that their seamless products account for approximately 80% of the company's total revenue. The information is specific to FY25.",
            "Sentiment": "positive",
            "PublishDate": 1750826105000,
            "Source": "default"
        },
        {
            "Title": "Scoda Tubes Plans Capacity Expansion by FY26",
            "Summary": "Scoda Tubes has announced plans to significantly increase its production capacity by the fiscal year 2026. The company aims to double its seamless capacity to 20,068 MTPA, increase welded capacity to 13,150 MTPA, and add a new mother hollow capacity of 20,000 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1750826041000,
            "Source": "default"
        }
    ]
}