{
    "Symbol": "SCPL",
    "ISIN": "INE501Y01019",
    "News": [
        {
            "Title": "Sheetal Cool Products Q3FY26 Profit Jumps 87%",
            "Summary": "Sheetal Cool Products reported strong Q3FY26 results with net profit rising 87% to ₹400.92 lakhs. Revenue grew 25% to ₹6,388.07 lakhs driven by improved operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770901761801,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sheetal Cool Products Issues 2nd EGM Corrigendum",
            "Summary": "Sheetal Cool Products Limited issues second corrigendum to EGM notice for preferential issue of 8.40 lakh convertible warrants worth ₹26.68 crore to non-promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1769790474729,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sheetal Cool Products EGM for ₹26.63 cr warrant issue",
            "Summary": "Sheetal Cool Products Limited schedules EGM on February 05, 2026, to approve issuance of 8,40,000 fully convertible warrants worth ₹26.63 crores to non-promoters at ₹317 per warrant for business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1767967965355,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sheetal Cool Products Appoints New Company Secretary",
            "Summary": "Sheetal Cool Products Limited has appointed Rajshri M. Indoria as Company Secretary and Compliance Officer with effect from January 05, 2026, following board approval based on nomination committee recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1767619475747,
            "Source": "stocks"
        },
        {
            "Title": "Sheetal Cool Products' Secretarial Auditor Resigns",
            "Summary": "Sheetal Cool Products Limited announced the immediate resignation of M/s. Chetan Patel & Associates from their Secretarial Auditor position effective January 3, 2026, as disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767447235974,
            "Source": "stocks"
        },
        {
            "Title": "Sheetal Cool Products Company Secretary Resigns",
            "Summary": "Sheetal Cool Products Limited announces immediate resignation of Company Secretary and Compliance Officer Mr. Bharat Trivedi due to personal circumstances, effective January 3, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767446919392,
            "Source": "stocks"
        },
        {
            "Title": "Sheetal Cool Products Plans Fundraising on Jan 7",
            "Summary": "Sheetal Cool Products has announced plans to raise funds on January 7, marking a significant corporate development for the FMCG company with a market capitalization of ₹213.20 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767357122932,
            "Source": "stocks"
        },
        {
            "Title": "Sheetal Cool Products Board Meet on Jan 7 for Fund Raise",
            "Summary": "Sheetal Cool Products Limited has scheduled a board meeting on January 7, 2026, to consider raising funds through preferential issue of convertible equity warrants and/or equity shares under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767354584214,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sheetal Cool Products Reports 159% Jump in Quarterly Profit to ₹159.49 Lakhs",
            "Summary": "Sheetal Cool Products Limited reported a net profit of ₹159.49 lakhs for the quarter ended September 30, 2025, compared to ₹63.95 lakhs in the same quarter last year, marking a 159% increase. Revenue from operations rose to ₹5,591.23 lakhs from ₹5,299.01 lakhs year-on-year. For the half-year period, the company posted a profit of ₹384.68 lakhs versus ₹1,061.83 lakhs in the previous year. The Board of Directors approved the unaudited financial results at their meeting held on November 7, 2025. The company operates in two segments - Milk and Milk Products, and Namkeen Products, though the namkeen segment does not meet quantitative threshold criteria for separate reporting.",
            "Sentiment": "positive",
            "PublishDate": 1762527658785,
            "Source": "earnings"
        },
        {
            "Title": "Sheetal Cool Products Limited Appoints Three Whole Time Directors and New Auditors",
            "Summary": "Sheetal Cool Products Limited shareholders approved the appointment of three Whole Time Directors and new auditors at their 12th Annual General Meeting. Mr. Bhupatbhai Dakubhai Bhuva, Mr. Dineshbhai Dakubhai Bhuva, and Mr. Sanjaybhai Dakubhai Bhuva were reappointed as Whole Time Directors for five years from September 5, 2025 to September 4, 2030. The three directors are brothers with experience in administration, leadership, and public relations. M/s. Chetan Patel & Associates was appointed as Secretarial Auditor for five years from FY2025-26 to FY2029-30. M/s. H.B. Kalaria & Associates was reappointed as Statutory Auditors for a second consecutive five-year term from the conclusion of the 12th Annual General Meeting until the 17th Annual General Meeting in 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1758359341760,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sheetal Cool Products Limited Reappoints Three Whole Time Directors and Auditors for Five-Year Terms",
            "Summary": "Sheetal Cool Products Limited's Board of Directors approved the reappointment of three Whole Time Directors - Mr. Bhupatbhai Dakubhai Bhuva, Mr. Dineshbhai Dakubhai Bhuva, and Mr. Sanjaybhai Dakubhai Bhuva - for five years from September 5, 2025 to September 4, 2030. All three directors are brothers with backgrounds in commerce and experience in administration, leadership, and public relations. The Board also approved the appointment of M/s. Chetan Patel & Associates as Secretarial Auditor for five years (FY2025-26 to FY2029-30) and the re-appointment of M/s. H.B. Kalaria & Associates as Statutory Auditors for a second consecutive five-year term from the 12th Annual General Meeting until the 17th Annual General Meeting in 2030. All appointments are subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1756121358889,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sheetal Cool Products Reports Quarterly Financial Results with Revenue of Rs 11,289.87 Lakhs",
            "Summary": "Sheetal Cool Products Limited's Board approved standalone unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 11,289.87 lakhs compared to Rs 12,375.48 lakhs in the same quarter last year. Net profit for the quarter was Rs 534.46 lakhs versus Rs 743.51 lakhs in the previous year quarter. Total income reached Rs 11,298.52 lakhs while total expenses were Rs 10,579.72 lakhs. Basic and diluted earnings per share stood at Rs 5.09 compared to Rs 7.08 in the corresponding previous year quarter. The company operates in two segments - Milk and Milk Products, and Namkeen Products, with the latter not meeting quantitative thresholds for separate segment reporting. The results were reviewed by auditors HB Kalaria & Associates.",
            "Sentiment": "neutral",
            "PublishDate": 1754373944067,
            "Source": "earnings"
        }
    ]
}