{
    "Symbol": "SDBL",
    "ISIN": "INE480C01038",
    "News": [
        {
            "Title": "Som Distilleries Shares Q3 FY26 Earnings Call Recording",
            "Summary": "Som Distilleries & Breweries Limited has uploaded the audio recording of its Q3 FY26 earnings conference call held on February 12, 2026, with transcript to follow soon.",
            "Sentiment": "neutral",
            "PublishDate": 1770896978763,
            "Source": "co_actions_results"
        },
        {
            "Title": "SOM Distilleries Reports Q3 FY26 Results",
            "Summary": "SOM Distilleries & Breweries posted Q3 FY26 standalone net profit of ₹747.46 lakh vs ₹1,031.87 lakh in Q3 FY25. Revenue declined to ₹15,599.76 lakh from ₹18,101.44 lakh YoY.",
            "Sentiment": "negative",
            "PublishDate": 1770731136229,
            "Source": "co_actions_results"
        },
        {
            "Title": "SOM Distilleries Schedules Q3 FY2026 Earnings Call",
            "Summary": "SOM Distilleries & Breweries Limited announces Q3 FY2025-26 earnings conference call scheduled for February 12, 2026 at 4:00 PM IST to discuss quarterly results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770299609426,
            "Source": "co_actions_results"
        },
        {
            "Title": "Som Distilleries Responds To MP Excise Actions",
            "Summary": "Som Distilleries And Breweries addresses regulatory actions by Madhya Pradesh Excise Department concerning a 2012 case in which the company states it was not involved.",
            "Sentiment": "neutral",
            "PublishDate": 1770295058414,
            "Source": "stocks"
        },
        {
            "Title": "Som Distilleries Board Approves Rs. 49.99 Crore Rights Issue by Subsidiary Woodpecker Green Agri Nutrients",
            "Summary": "Som Distilleries and Breweries Limited's board approved a rights issue offer of 49,990,000 equity shares worth Rs. 49.99 crores by its wholly owned subsidiary Woodpecker Green Agri Nutrients Pvt Ltd. The rights issue involves shares of Rs. 10 each and was recommended by the Audit Committee prior to board approval on December 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765181843999,
            "Source": "corporate_action"
        },
        {
            "Title": "Som Distilleries And Breweries Plans Rights Issue Worth ₹499.9 Million",
            "Summary": "Som Distilleries And Breweries is planning to evaluate a rights issue worth ₹499.9 million rupees. The proposed rights offering would allow existing shareholders to purchase additional shares and provide the company with capital for its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764768276032,
            "Source": "corporate_action"
        },
        {
            "Title": "Som Distilleries Reports Mixed Q2FY26 Results with 15% EBITDA Growth Despite Volume Decline",
            "Summary": "Som Distilleries achieved total income of INR 2,700 million with EBITDA growing 15.1% to INR 405 million and net profit of INR 195 million, though beer volumes dropped 19% to 36 lakh cases due to underperformance in Karnataka. The company expects recovery in Q3-Q4 driven by new brand Sunny Beaches and its upcoming UP plant scheduled for June 2026, while expanding premium IMFL portfolio with Mahavat whiskey and planned single malt launch.",
            "Sentiment": "neutral",
            "PublishDate": 1763621160255,
            "Source": "earnings"
        },
        {
            "Title": "Som Distilleries Completes Acquisition of Woodpecker Greenagri Nutrients as Wholly Owned Subsidiary",
            "Summary": "Som Distilleries and Breweries Limited has completed the acquisition of 100% equity in Woodpecker Greenagri Nutrients Private Limited, making it a wholly owned subsidiary. The acquisition includes an integrated alcoholic beverage manufacturing project in Farrukhabad, UP, with Phase I establishing a brewery to enhance SDBL's market reach in UP and northern regions, and Phase II planned to include a distillery.",
            "Sentiment": "positive",
            "PublishDate": 1763366597531,
            "Source": "order&deals"
        },
        {
            "Title": "Som Distilleries Reports Mixed Q2 Results with Strong IMFL Growth Despite Beer Volume Decline",
            "Summary": "Som Distilleries and Breweries posted total income of Rs. 2,700 million in Q2 FY2026 with EBITDA growing 15.1% to Rs. 405 million, while beer volumes declined 19% year-on-year to 35.7 lakh cases. The company's IMFL portfolio surged 65% in volume growth driven by new whiskey brand Mahavat launch, with net profit reaching Rs. 195 million despite overall volume pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1763210938877,
            "Source": "earnings"
        },
        {
            "Title": "Som Distilleries Reports Mixed Q2 Results, Approves Acquisition of Woodpecker Green Agri Nutrients",
            "Summary": "Som Distilleries and Breweries Limited reported a 7.2% decline in total income to ₹270.02 crore in Q2 FY26 due to weaker Karnataka sales, though EBITDA grew 15.1% to ₹40.52 crore with improved margins. The Board approved acquiring entire equity of Woodpecker Green Agri Nutrients Private Limited as a wholly-owned subsidiary, subject to shareholder approval at an EGM scheduled for December 12, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763050608898,
            "Source": "order&deals"
        },
        {
            "Title": "Som Distilleries Confirms Customs Department Visit for Import-Export Inquiry",
            "Summary": "Som Distilleries confirmed that the Customs Department conducted a visit to inquire about the company's import-export activities. The company reported that no violations were found during the inquiry and stated there would be no financial impact from this visit.",
            "Sentiment": "neutral",
            "PublishDate": 1757675361323,
            "Source": "stock"
        },
        {
            "Title": "Som Distilleries Reports 3.2% Revenue Growth Despite Volume Decline in Q1 FY26",
            "Summary": "Som Distilleries & Breweries Limited reported total income of Rs. 5,301 million, up 3.2% year-over-year, with EBITDA of Rs. 721 million and net profit of Rs. 421 million. Total volume reached 8.9 million cases, with beer volumes declining 2.5% to 8.5 million cases while IMFL volumes surged 58% to 0.4 million cases. The company faced challenges from unseasonal rains and excise duty hikes in Karnataka, which led to over 20% volume decline in that market and reduced market share from 17.5-18% to 12.5-13%. Beer realization improved to Rs. 566 per case from Rs. 550 previously. The company launched Mahavat Whisky in Madhya Pradesh and is constructing a new brewery in Uttar Pradesh with Rs. 370 crores capex, expected to commission in H1 FY27 with 10 million case capacity. Management revised full-year revenue growth guidance to 15-17% from earlier 20-22% but expects recovery in coming quarters following partial rollback of Karnataka excise duties.",
            "Sentiment": "neutral",
            "PublishDate": 1755601225852,
            "Source": "earnings"
        },
        {
            "Title": "Som Distilleries Targets Rs 2,000 Crore Revenue by FY27 with Major UP Expansion",
            "Summary": "Som Distilleries and Breweries aims to achieve Rs 2,000 crore revenue by FY27, with Uttar Pradesh expected to contribute Rs 400 crore in FY26 and Rs 600 crore in FY27. The company announced a Rs 600 crore investment in UP in March. Managing Director Jagdish Kumar Arora indicated these are conservative estimates, noting the company has historically surpassed its projections. Som Distilleries is shifting focus toward premiumisation and the IMFL segment, launching new products including an upcoming premium single malt 'Bheembetka.' The company is moving away from beer due to slowing growth from increased taxation. IMFL currently represents less than 10% of sales but is expected to reach 20% by FY27, offering higher margins than beer. In Q1FY26, the company reported total income of Rs 530 crore (up 3.2% YoY), EBITDA of Rs 72 crore (up 11.1% YoY) with margins improving to 13.6%, and net profit of Rs 42 crore (up 3.7% YoY). Shares closed at Rs 140, down 7.44%.",
            "Sentiment": "positive",
            "PublishDate": 1755050492100,
            "Source": "stock"
        },
        {
            "Title": "Som Distilleries & Breweries Shares Q1 FY2026 Earnings Call Recording",
            "Summary": "Som Distilleries & Breweries Limited conducted an earnings conference call on August 12, 2025, to discuss its unaudited financial results for Q1 FY2026. The company has uploaded the audio recording of the call and will share the transcript with stock exchanges and on their website at www.somindia.com. The communication was made under Regulation 30 of SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1755012947018,
            "Source": "earnings"
        },
        {
            "Title": "Som Distilleries Reports Mixed Q1 Results with Higher Margins Despite Revenue Decline",
            "Summary": "Som Distilleries & Breweries reported Q1 EBITDA of 703.5 million rupees compared to 642 million rupees in the same period last year. The company's EBITDA margin improved to 7.95% from 6.34% year-over-year. Consolidated net profit increased to 420.6 million rupees from 405 million rupees. However, revenue declined to 8.84 billion rupees from 10.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1754920835415,
            "Source": "earnings"
        },
        {
            "Title": "Som Distilleries Launches Mahavat Whisky in Delhi Market",
            "Summary": "Som Distilleries has launched its new product Mahavat Whisky in the Delhi market, expanding its alcoholic beverage portfolio in the region.",
            "Sentiment": "positive",
            "PublishDate": 1753686988531,
            "Source": "stock"
        },
        {
            "Title": "SOM Group Launches Mahavat Whisky in Mid-Premium Segment at ₹1000-1100",
            "Summary": "SOM Group of Companies has launched Mahavat Whisky, marking its entry into the mid-premium whisky segment priced at ₹1000-1100. The product features a taste profile with pear, smoke, candied sweetness, woody richness and subtle cocoa. The whisky is initially available in select outlets across Bhopal, with plans to expand across Madhya Pradesh, followed by Delhi NCR and other key markets. Chairman J.K. Arora described it as one of the most ambitious rollouts in the company's portfolio, positioning it to compete with leading regular whisky brands. CEO Deepak Arora noted the product development involved extensive research with expert blenders and flavor specialists. The launch represents SOM's strategic move from value and mass segments into the premium beverage space.",
            "Sentiment": "positive",
            "PublishDate": 1753364291023,
            "Source": "stock"
        },
        {
            "Title": "Dolly Khanna Increases Stake in SOM Distilleries & Breweries",
            "Summary": "Investor Dolly Khanna has raised her stake in SOM Distilleries & Breweries by 0.42% during the first quarter. This increase in shareholding indicates a positive investment move by the prominent investor in the company.",
            "Sentiment": "positive",
            "PublishDate": 1752759680000,
            "Source": "default"
        },
        {
            "Title": "Som Distilleries Reports 70% Volume Growth in IMFL Portfolio",
            "Summary": "Som Distilleries And Breweries has reported a nearly 70% volume growth in their Indian Made Foreign Liquor (IMFL) portfolio for the months of April and May 2025. The company's performance indicates significant expansion in their liquor sales during this two-month period.",
            "Sentiment": "positive",
            "PublishDate": 1750928712000,
            "Source": "default"
        },
        {
            "Title": "Som Distilleries: Multibagger Stock Surges 900% in Five Years",
            "Summary": "Som Distilleries and Breweries Ltd, backed by investor Dolly Khanna, has seen a 909.86% return in the last five years. The company plans to increase its focus on Indian Made Foreign Liquor (IMFL) from 6% to 20% of total business in 2025. MD JK Arora expects higher beer volumes due to a new excise structure.",
            "Sentiment": "positive",
            "PublishDate": 1750664960000,
            "Source": "normal_news"
        },
        {
            "Title": "SOM Distilleries & Breweries Reports Q4 Financial Results",
            "Summary": "SOM Distilleries & Breweries has released its Q4 financial results. The company's EBITDA was 418 million rupees, compared to 419 million rupees in the same quarter last year. The EBITDA margin improved to 6.12% from 5.67% year-over-year. Consolidated net profit increased to 237 million rupees from 200 million rupees in the previous year and 215 million rupees in the previous quarter. However, revenue decreased to 6.8 billion rupees from 7.4 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1748444669000,
            "Source": "result"
        },
        {
            "Title": "SOM Distilleries Announces Rs 600 Crore Greenfield Project with Large Beer Bottling Capacity",
            "Summary": "SOM Distilleries & Breweries has conducted a Bhoomi Pujan for its upcoming greenfield project worth Rs 600 crore. The company states that this new plant will be one of its largest, with a bottling capacity exceeding 12 million cases of beer annually.",
            "Sentiment": "positive",
            "PublishDate": 1747887500000,
            "Source": "default"
        },
        {
            "Title": "Som Distilleries Reports 32% Growth at Bhopal Plant in April 2025",
            "Summary": "Som Distilleries has announced that its Bhopal plant experienced significant growth of over 32% in April 2025 compared to the same month in the previous year. The company specifically highlighted the performance of its Bhopal facility, indicating a substantial year-over-year improvement in operations or sales for that location.",
            "Sentiment": "positive",
            "PublishDate": 1747722523000,
            "Source": "default"
        },
        {
            "Title": "Som Distilleries Becomes Second-Largest Beer Company in Jharkhand",
            "Summary": "Som Distilleries and Breweries has announced that it has become the second-largest beer company in Jharkhand, capturing a 22% market share in the state.",
            "Sentiment": "positive",
            "PublishDate": 1746543779000,
            "Source": "default"
        },
        {
            "Title": "Som Distilleries: IMFL Focus to Increase from 6% to 20% of Total Business in 2025",
            "Summary": "Som Distilleries plans to increase its focus on Indian Made Foreign Liquor (IMFL) from 6% to 20% of total business in 2025. The company expects a revival in beer volumes starting May due to new excise structures. IMFL has outperformed beer in Karnataka for seven consecutive months, with beer sales declining 16.3% year-on-year in April 2025 while IMFL volumes rose 5.5%.",
            "Sentiment": "positive",
            "PublishDate": 1746537518000,
            "Source": "normal_news"
        },
        {
            "Title": "Som Distilleries Begins Beer Dispatch from Karnataka Plant to Tamil Nadu",
            "Summary": "Som Distilleries and Breweries has initiated the dispatch of beer from its Karnataka plant to the state of Tamil Nadu. This move suggests an expansion of the company's distribution network and potentially increased market presence in South India.",
            "Sentiment": "positive",
            "PublishDate": 1745390303000,
            "Source": "default"
        },
        {
            "Title": "Investor Dolly Khanna Increases Stake in SDBL",
            "Summary": "Renowned investor Dolly Khanna has increased her stake in Som Distilleries & Breweries Limited (SDBL) by 1% during the fourth quarter. Following this acquisition, her total shareholding in the company now stands at 2.41%.",
            "Sentiment": "positive",
            "PublishDate": 1744796444000,
            "Source": "default"
        },
        {
            "Title": "Som Distilleries & Breweries: Stock Breaks Out from 6-Month Consolidation",
            "Summary": "Som Distilleries & Breweries Ltd's stock has broken out from a 6-month consolidation pattern in March 2025. Experts suggest short-term traders could consider buying the stock with a potential target of Rs 148-150 in the next 1-2 months.",
            "Sentiment": "positive",
            "PublishDate": 1742254200000,
            "Source": "normal_news"
        },
        {
            "Title": "SOM Distilleries Subsidiary to Set Up 600 Crore Rupee Greenfield Project",
            "Summary": "Woodpecker Greenagri Nutrients Private Limited, a subsidiary of SOM Distilleries and Breweries Limited, is establishing a new greenfield project with an investment of 600 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1740895677000,
            "Source": "corporate_action"
        },
        {
            "Title": "Som Distilleries & Breweries Reports Q3 Financial Results",
            "Summary": "Som Distilleries & Breweries has announced its Q3 consolidated financial results. The company's net profit increased to 192 million rupees, up from 180 million rupees year-over-year and 164 million rupees quarter-over-quarter. Revenue for Q3 rose to 5.6 billion rupees, compared to 5.01 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738109859000,
            "Source": "earnings"
        },
        {
            "Title": "Som Distilleries & Breweries Reports Improved Q3 EBITDA and Margin",
            "Summary": "Som Distilleries & Breweries has announced its Q3 financial results. The company's EBITDA increased to 363 million rupees, up from 318 million rupees in the same quarter last year. Additionally, the EBITDA margin improved slightly to 6.46% from 6.36% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738065861000,
            "Source": "earnings"
        },
        {
            "Title": "SOM Distilleries & Breweries Reports Q3 Financial Results",
            "Summary": "SOM Distilleries & Breweries has announced its Q3 consolidated financial results. The company's net profit increased to 192 million rupees, up from 180 million rupees year-over-year and 164 million rupees quarter-over-quarter. Revenue for Q3 rose to 5.6 billion rupees, compared to 5.01 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1738065788000,
            "Source": "earnings"
        },
        {
            "Title": "SOM Distilleries & Breweries Reports Q2 EBITDA Growth",
            "Summary": "SOM Distilleries & Breweries has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 340 million rupees, up from 272 million rupees in the same quarter last year. Additionally, the EBITDA margin improved slightly to 5.93% from 5.83% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731572107000,
            "Source": "result"
        },
        {
            "Title": "SOM Distilleries & Breweries Reports Q2 Revenue Growth",
            "Summary": "SOM Distilleries & Breweries has announced its second quarter revenue for the current fiscal year. The company reported revenue of 5.7 billion rupees, compared to 4.6 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731571783000,
            "Source": "result"
        },
        {
            "Title": "SOM Distilleries & Breweries Reports Q2 Profit Increase",
            "Summary": "SOM Distilleries & Breweries has announced its Q2 consolidated net profit, which rose to 187 million rupees from 148.5 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731571713000,
            "Source": "result"
        }
    ]
}