{
    "Symbol": "SEAMECLTD",
    "ISIN": "INE497B01018",
    "News": [
        {
            "Title": "SEAMEC Board Meeting Set for January 30 for Q3FY26 Results",
            "Summary": "SEAMEC Limited has scheduled a board meeting on January 30, 2026, to consider and approve unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769515642200,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEAMEC Vessel Paladin Heads to Dubai for Maintenance",
            "Summary": "SEAMEC's vessel Paladin is proceeding to Dubai for scheduled maintenance work and will return to ONGC charter operations upon completion of the maintenance activities.",
            "Sentiment": "neutral",
            "PublishDate": 1768796099295,
            "Source": "stocks"
        },
        {
            "Title": "SEAMEC Takes Vessel SEAMEC AGASTYA Off Field",
            "Summary": "SEAMEC Limited has temporarily taken its vessel SEAMEC AGASTYA out of field for technical reasons effective January 12, 2026, with operations expected to resume within 3-4 days after repairs.",
            "Sentiment": "neutral",
            "PublishDate": 1768289371158,
            "Source": "stocks"
        },
        {
            "Title": "SEAMEC PALADIN vessel temporarily off-hire for drydock",
            "Summary": "SEAMEC Limited announces temporary off-hire of vessel SEAMEC PALADIN from January 10, 2026, for statutory drydocking operations expected to last around 70 days.",
            "Sentiment": "neutral",
            "PublishDate": 1768189700795,
            "Source": "stocks"
        },
        {
            "Title": "SEAMEC Vessel AGASTYA Begins Charter Operations",
            "Summary": "SEAMEC Limited announces that its vessel SEAMEC AGASTYA has commenced charter operations with HAL Offshore Limited under an ONGC contract, effective January 2, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767421158410,
            "Source": "stocks"
        },
        {
            "Title": "SEAMEC III Begins Second Pipeline Replacement Phase",
            "Summary": "SEAMEC's vessel SEAMEC III has commenced its second Part Replacement Pipeline Project for ONGC, including PRP-VIII A and DSF II projects. The company awarded diving services contract to Adsun Offshore.",
            "Sentiment": "positive",
            "PublishDate": 1766640662385,
            "Source": "stocks"
        },
        {
            "Title": "Seamec Limited to Appear on NDTV Profit Interview",
            "Summary": "Seamec Limited officials will participate in a virtual interview with NDTV Profit on December 30, 2025, from 1:30 PM to 1:40 PM, discussing publicly available company information.",
            "Sentiment": "neutral",
            "PublishDate": 1766577083265,
            "Source": "stocks"
        },
        {
            "Title": "SEAMEC Closes Arbitration Cases with Two Partners",
            "Summary": "SEAMEC Limited announces the closure of arbitration proceedings with Maria Offshore International and Jumbo Offshore, resolving pending legal disputes.",
            "Sentiment": "positive",
            "PublishDate": 1766144902490,
            "Source": "stocks"
        },
        {
            "Title": "Seamec Wins $3.25M Contract from Adsun Offshore",
            "Summary": "Seamec Limited awarded Letter of Award worth approximately USD 3.25 million to Adsun Offshore Diving Contractors for diving services on ONGC projects during 2025-26 working season.",
            "Sentiment": "positive",
            "PublishDate": 1766058365342,
            "Source": "co_actions_results"
        },
        {
            "Title": "Seamec Secures $16.72M Charter Deal with G R Infraprojects",
            "Summary": "Seamec enters vessel charter agreement for 'Seamec III' worth USD 16.72 million over 150 days. Project involves subsea installation and diving operations for ONGC through G R Infraprojects partnership.",
            "Sentiment": "positive",
            "PublishDate": 1765434187319,
            "Source": "co_actions_results"
        },
        {
            "Title": "Seamec Limited Enters 9-Year Office Lease Agreement with Related Party",
            "Summary": "Seamec Limited executed a lease deed with Mrs. Deepti Agrawal for additional office premises at Mumbai for 9 years effective October 1, 2025, with monthly lease fees of Rs. 7,86,060 and 15% escalation every 3 years. The transaction involves a related party as Mrs. Deepti Agrawal is the spouse of the company's Chairman Mr. Sanjeev Agrawal and holds 0.39% equity stake in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765284336915,
            "Source": "corporate_action"
        },
        {
            "Title": "Seamec Secures $43.07 Million Vessel Charter Contract",
            "Summary": "Seamec has obtained a vessel charter contract valued at approximately $43.07 million. The contract represents a significant business win for the marine services company, adding substantial revenue to its order book.",
            "Sentiment": "positive",
            "PublishDate": 1764893182188,
            "Source": "order&deals"
        },
        {
            "Title": "Seamec Limited Completes ONGC NLM9 Project Ahead of Schedule",
            "Summary": "Seamec Limited announced the completion of ONGC's NLM9 project ahead of schedule, with vessel MV GOODMAN being off-hired effective December 2, 2025. The early project completion demonstrates operational efficiency and may positively impact the company's project execution capabilities and client relationships.",
            "Sentiment": "positive",
            "PublishDate": 1764659378613,
            "Source": "stock"
        },
        {
            "Title": "Seamec Limited's HAL Vessel MV GOODMAN Returns to Service After Repairs",
            "Summary": "Seamec Limited announced that its HAL vessel MV GOODMAN has been hired and returned to operational service on November 22, 2025 at 14:00 hrs after completing repairs. The vessel deployment affects the company's marine operations and represents a return of the asset to revenue-generating status.",
            "Sentiment": "positive",
            "PublishDate": 1763968477451,
            "Source": "stock"
        },
        {
            "Title": "Seamec's HAL Vessel MV Goodman Experiences Technical Snag, Temporarily Off-Hired",
            "Summary": "Seamec Limited's HAL vessel MV Goodman developed a technical snag and was off-hired effective November 18, 2025 at 20:00 hours for repairs. The company expects the vessel to return to field operations shortly and anticipates no impact on project schedules due to the short off-hire duration.",
            "Sentiment": "neutral",
            "PublishDate": 1763540084167,
            "Source": "stock"
        },
        {
            "Title": "Seamec Limited Reports Q2FY26 Loss Due to Vessel Breakdown, Secures New Contracts",
            "Summary": "Seamec Limited reported a consolidated loss of INR 26 crores in Q2FY26 compared to profit of INR 0.2 crores in Q2FY25, primarily due to technical breakdown of vessel SWORDFISH which operated only 22 days during the quarter. The company secured new charter agreements including 150-day contract with L&T for barge Seamec Glorious and signed MoU with DG Shipping for INR 1,000 crores maritime investment, with vessel Anant expected to be mobilized by February 2026.",
            "Sentiment": "negative",
            "PublishDate": 1763383956362,
            "Source": "earnings"
        },
        {
            "Title": "Seamec Limited's Barge SEAMEC GLORIOUS Commences Operations",
            "Summary": "Seamec Limited announced that its Barge SEAMEC GLORIOUS was put on hire on November 13, 2025 at 13:00 hours. The company disclosed this operational update to stock exchanges BSE and NSE as part of regulatory compliance requirements.",
            "Sentiment": "positive",
            "PublishDate": 1763094614837,
            "Source": "stock"
        },
        {
            "Title": "Seamec Limited Files Legal Proceedings Against Asian Energy Services and Hardy Exploration for Charter Hire Dues",
            "Summary": "Seamec Limited has instituted legal proceedings against Asian Energy Services Limited and Hardy Exploration Production (India) Inc. under Section 9 of the Arbitration and Conciliation Act, 1996, seeking recovery of charter hire dues worth INR 24,51,79,985.75 inclusive of interest. The dispute relates to non-payment of overdue charter hire for work carried out by the company's Vessel Seamec III in offshore oil fields, with the matter being heard in Bombay High Court.",
            "Sentiment": "negative",
            "PublishDate": 1763043317195,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Limited Reports Mixed Q2FY26 Results with Revenue Decline and Loss",
            "Summary": "SEAMEC Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported standalone revenue of Rs. 91.4 crore in Q2FY26, down 10% year-on-year from Rs. 101.7 crore in Q2FY25. EBITDA decreased to Rs. 9.2 crore from Rs. 36.6 crore, with EBITDA margin falling to 10.0% from 35.9%. The company posted a standalone loss after tax of Rs. 25.8 crore compared to a profit of Rs. 3.0 crore in the previous year. For the half year, revenue grew 2% to Rs. 314.3 crore with PAT of Rs. 54.5 crore, up 1% year-on-year. The revenue decline was attributed to dry docking of SEAMEC III and lower deployment due to monsoon conditions. The company operates 6 diving support vessels, 1 offshore support vessel, and 1 accommodation barge. SEAMEC entered into agreements including an MOU with Directorate General of Shipping for capex of Rs. 1,000 crore and charter hire agreements for various vessels. The company took delivery of SEAMEC Agastya in Singapore, which is currently undergoing dry dock in Colombo.",
            "Sentiment": "negative",
            "PublishDate": 1762815140451,
            "Source": "earnings"
        },
        {
            "Title": "Seamec Outlines Growth Strategy With Fleet Modernization and Subsea Services Expansion",
            "Summary": "Seamec has outlined its strategy for sustained offshore growth through fleet modernization and long-term charter visibility. The company is expanding into energy infrastructure and deepwater projects while diversifying its subsea services. Seamec is focusing on improving vessel utilization and operating margins. The company has planned strategic capital expenditure for fleet upgradation to strengthen its global competitiveness.",
            "Sentiment": "positive",
            "PublishDate": 1762784635733,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Reports Q2 Net Loss of 275M Rupees Despite Revenue Growth",
            "Summary": "SEAMEC reported a consolidated net loss of 275 million rupees in Q2, compared to a profit of 1.1 million rupees in the same period last year. The company's Q2 revenue increased to 974 million rupees from 879 million rupees year-over-year, showing revenue growth of approximately 11% despite the shift to losses.",
            "Sentiment": "negative",
            "PublishDate": 1762768137437,
            "Source": "earnings"
        },
        {
            "Title": "SEAMEC Reaches Friendly Agreement with Jumbo Offshore Limited on Arbitration and Vessel Tug Maria",
            "Summary": "SEAMEC has entered into a friendly agreement with Jumbo Offshore Limited regarding an arbitration matter and the vessel named Tug Maria. The agreement resolves the dispute between the two companies.",
            "Sentiment": "positive",
            "PublishDate": 1762443321257,
            "Source": "stock"
        },
        {
            "Title": "Seamec Limited's HAL Vessel MV GOODMAN Begins Operations for ONGC's NLM9 Project",
            "Summary": "Seamec Limited announced that its HAL vessel MV GOODMAN has been deployed for ONGC's NLM9 project, with operations commencing from November 1, 2025 at 23:00 hours. The company informed stock exchanges BSE and NSE about this vessel deployment status as part of its regulatory disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1762139426013,
            "Source": "stock"
        },
        {
            "Title": "Seamec Revises MV Goodman Vessel Delivery Timeline to November 1-7",
            "Summary": "Seamec signed an addendum with promoter Hal Offshore to revise the delivery schedule of MV Goodman vessel to November 1-7. The charter terms for the vessel remain unchanged despite the delivery timeline adjustment.",
            "Sentiment": "neutral",
            "PublishDate": 1761906638187,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Limited Shareholders Approve Enhanced Transaction Limits with HAL Offshore",
            "Summary": "SEAMEC Limited shareholders approved an ordinary resolution through postal ballot to enhance monetary limits for transactions with HAL Offshore Limited, its holding company. The resolution passed with 99.14% approval (23,02,426 votes in favor vs 19,881 votes against). The enhanced limits cover charter hire of vessels, diving and allied activities for a period of 5 years until the Annual General Meeting in 2030. The postal ballot was conducted through remote e-voting from October 1-30, 2025, with M/s. Satyajit Mishra & Co. serving as scrutinizer. The Board of Directors and Audit Committee are authorized to scrutinize individual transactions under this resolution.",
            "Sentiment": "positive",
            "PublishDate": 1761850411887,
            "Source": "corporate_action"
        },
        {
            "Title": "Seamec Limited Signs MoU for Rs 1000 Crore Investment with Directorate General of Shipping",
            "Summary": "Seamec Limited entered into a Memorandum of Understanding with the Directorate General of Shipping on October 28, 2025, during India Maritime Week 2025. The agreement involves an investment of approximately Rs 1000 crores in the company's line of business, to be made progressively in the future. The MoU was signed at 09:30 hours on the specified date.",
            "Sentiment": "positive",
            "PublishDate": 1761650213601,
            "Source": "order&deals"
        },
        {
            "Title": "SEAMEC Limited's Vessel 'SEAMEC SWORDFISH' Returns to Service After Technical Issue Resolution",
            "Summary": "SEAMEC Limited announced that its vessel 'SEAMEC SWORDFISH' has been put back on hire from October 22, 2025 at 07:29 hours after resolving a technical defect. The company had previously taken the vessel off hire due to the technical issue. The vessel is now operational and available for commercial use.",
            "Sentiment": "positive",
            "PublishDate": 1761121879065,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Limited Delivers Vessel SEAMEC III for Charter Operations",
            "Summary": "SEAMEC Limited announced the delivery of its vessel SEAMEC III for mobilization. The company stated that charter operations for the vessel will commence within two days. The announcement was made on October 17, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760705296681,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Limited's Vessel 'SEAMEC SWORDFISH' Goes Out of Service Due to Technical Breakdown",
            "Summary": "SEAMEC Limited announced that its vessel 'SEAMEC SWORDFISH' is out of service due to a technical breakdown that occurred on October 17 at 07:35 hours. The company stated it is addressing the technical issues on priority and will provide updates on the vessel's rectification and resumption of service in due course. The disclosure was made under SEBI listing regulations.",
            "Sentiment": "negative",
            "PublishDate": 1760704164543,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Limited Secures Rs 28.86 Crore Charter Contract with Larsen & Toubro",
            "Summary": "SEAMEC Limited has entered into a Bimco Charter Party agreement with Larsen & Toubro Limited for the charter hire of their barge 'SEAMEC GLORIOUS'. The contract is valued at Rs. 28,85,62,500 exclusive of GST, covering a firm period of 150 days with an extension option. The charter will commence between October 1-30, 2025. The barge will be deployed for offshore accommodation and hook-up work in Mumbai High & West Coast Offshore, supporting an ONGC project. The agreement is part of SEAMEC's normal course of business and does not involve any related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1760518541194,
            "Source": "order&deals"
        },
        {
            "Title": "SEAMEC Limited Signs Rs 6.3 Crore Vessel Charter Agreement with HAL Offshore",
            "Summary": "SEAMEC Limited entered into a Bimco Charter Party agreement with HAL Offshore Limited on October 13, 2025, for the charter hire of vessel MV GOODMAN. The contract is valued at Rs 6,30,00,000 (exclusive of GST) for a firm period of 45 days, with an option to extend for an additional 45 days. The vessel will work in ONGC's Mumbai High Offshore Oil Field for the NLM9 project. The charter will commence between October 16-31, 2025. This is a related party transaction conducted at arm's length, as HAL Offshore Limited holds 70.77% shareholding in SEAMEC Limited and is the company's promoter.",
            "Sentiment": "positive",
            "PublishDate": 1760422319816,
            "Source": "order&deals"
        },
        {
            "Title": "SEAMEC Limited Signs USD 3.14 Million Addendum for Additional ONGC Pipeline Installation Work",
            "Summary": "SEAMEC Limited entered into Addendum 01 with Posh India Offshore Private Limited on September 16, 2025, expanding their existing subcontract agreement from March 20, 2025. The addendum covers additional installation activities including riser clamps, bow string and other installation work for ONGC's Pipeline Replacement Project VIII and Daman Upside Development Project. The contract value is approximately USD 3.14 million, exclusive of GST, based on unit rates for the maximum indicated quantity of additional scope work. The parties are not related to SEAMEC's promoter group and the transaction does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758012432463,
            "Source": "order&deals"
        },
        {
            "Title": "SEAMEC Limited Commences Second Season Operations for Pipeline and Development Projects",
            "Summary": "SEAMEC Limited announced that its vessel SEAMEC PRINCESS began its second season of Pipeline Replacement Project VIII and Daman Upside Development Project on September 13, 2025 at 1600 hours. The company notified stock exchanges BSE and NSE about the deployment status of the vessel for these offshore projects.",
            "Sentiment": "neutral",
            "PublishDate": 1757907724040,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Limited Approves Vessel Charter and Increases Related Party Transaction Limit",
            "Summary": "SEAMEC Limited's Board approved the charter of vessel 'MV Goodman' from parent company HAL Offshore Limited for repair and replacement work on NLM 9 Platform in Mumbai High Offshore under an ONGC contract. The Board also approved increasing the annual monetary limit for related party transactions with HAL Offshore from USD 30 million to USD 50 million, which requires shareholder approval through postal ballot. The company will send a postal ballot notice to shareholders for this approval.",
            "Sentiment": "neutral",
            "PublishDate": 1757679107355,
            "Source": "corporate_action"
        },
        {
            "Title": "SEAMEC Limited Resumes Charter for Vessel SEAMEC SWORDFISH After Defect Rectification",
            "Summary": "SEAMEC Limited announced that its vessel SEAMEC SWORDFISH has resumed charter operations with Safeen Al Behar Limited effective September 11, 2025 at 17:35 hours. The resumption follows the rectification of a previously reported defect that had caused the vessel to go off-hire. The company had earlier communicated about the vessel going off-hire in a letter dated August 28, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757659594911,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Limited Deploys Vessel SEAMEC II for ONGC Contract",
            "Summary": "SEAMEC Limited announced the deployment of its vessel SEAMEC II for an ONGC contract, effective September 9, 2025 at 19:00 hours, following completion of customs clearances and necessary formalities. The vessel has been hired to continue with the ONGC contract operations.",
            "Sentiment": "positive",
            "PublishDate": 1757495564712,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Enters Arbitration Proceedings with Jumbo Offshore in Tug Maria Dispute",
            "Summary": "SEAMEC has become a party to arbitration proceedings with Jumbo Offshore regarding a dispute involving Tug Maria. The company is now involved in the arbitration process to resolve the matter with Jumbo Offshore.",
            "Sentiment": "neutral",
            "PublishDate": 1756811541917,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Limited's Vessel 'SEAMEC SWORDFISH' Temporarily Off-Hired Due to Breakdown",
            "Summary": "SEAMEC Limited announced that its vessel 'SEAMEC SWORDFISH' has been temporarily off-hired due to a breakdown. The company is working on rectifying the defect and will return the vessel to charter service once repairs are completed. The event occurred on August 28, 2025 at 12:41 hours.",
            "Sentiment": "negative",
            "PublishDate": 1756368120171,
            "Source": "stock"
        },
        {
            "Title": "HAL Offshore Limited Acquires Additional 45,000 Shares in SEAMEC Limited",
            "Summary": "HAL Offshore Limited, a promoter of SEAMEC Limited, acquired 45,000 equity shares of the company through open market purchase on August 26, 2025. The acquisition increased HAL Offshore's shareholding from 1,79,48,406 shares (70.59%) to 1,79,93,406 shares (70.77%) of SEAMEC's total equity share capital of 25,42,50,000 shares. The transaction represents 0.18% of the company's total share capital. The disclosure was made under SEBI's Substantial Acquisition of Shares and Takeovers Regulations. HAL Offshore operates as a promoter entity along with persons acting in concert including Mr. Sanjeev Agrawal and Mrs. Deepti Agrawal. SEAMEC Limited is listed on BSE and National Stock Exchange of India.",
            "Sentiment": "neutral",
            "PublishDate": 1756360331544,
            "Source": "corporate_action"
        },
        {
            "Title": "HAL Offshore Limited Acquires Additional 28,000 Shares in SEAMEC Limited",
            "Summary": "HAL Offshore Limited, a promoter of SEAMEC Limited, acquired 28,000 equity shares of the company through open market transactions on August 25, 2025. The acquisition increased HAL Offshore's shareholding from 1,79,20,406 shares (70.48%) to 1,79,48,406 shares (70.59%) in SEAMEC Limited. The transaction represents 0.11% of SEAMEC's total voting capital. HAL Offshore acts in concert with Mr. Sanjeev Agrawal and Mrs. Deepti Agrawal as persons acting in concert. SEAMEC Limited's equity share capital remained unchanged at 25,42,50,000 shares. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1756180888509,
            "Source": "corporate_action"
        },
        {
            "Title": "HAL Offshore Limited Acquires Additional 30,712 Shares in SEAMEC Limited",
            "Summary": "HAL Offshore Limited, a promoter of SEAMEC Limited, acquired 30,712 equity shares of the company through open market transactions. The acquisition increased HAL Offshore's shareholding from 1,78,89,694 shares (70.36%) to 1,79,20,406 shares (70.48%) of SEAMEC's total voting capital. The transaction was completed on August 22, 2025, and disclosed under SEBI's Substantial Acquisition of Shares and Takeovers Regulations. SEAMEC Limited is listed on both BSE and National Stock Exchange of India, with a total equity share capital of 25,42,50,000 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1756119020896,
            "Source": "corporate_action"
        },
        {
            "Title": "SEAMEC's Vessel 'SEAMEC II' Returns to Mumbai After Statutory Drydocking",
            "Summary": "SEAMEC's vessel 'SEAMEC II' has returned to Mumbai following completion of statutory drydocking. The vessel is set to resume its ONGC contract operations once necessary clearances are obtained.",
            "Sentiment": "neutral",
            "PublishDate": 1755773918433,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Limited Removes CEO Rakesh Ayri Due to Non-Performance",
            "Summary": "SEAMEC Limited's Board of Directors removed Mr. Rakesh Ayri from his position as Chief Executive Officer, effective August 19, 2025. The decision was made following a recommendation from the Nomination and Remuneration Committee, citing non-performance as the reason for his removal. The Board meeting that formalized this decision was held on August 18, 2025, lasting 16 minutes from 18:00 to 18:16 hours.",
            "Sentiment": "negative",
            "PublishDate": 1755523249665,
            "Source": "corporate_governance"
        },
        {
            "Title": "Seamec Plans Fleet Upgrades and Market Expansion to Leverage Offshore Vessel Demand",
            "Summary": "Seamec is positioning itself to benefit from increased offshore vessel demand through fleet upgrades, long-term charter agreements, and expansion into new markets. The company's strategy includes maintaining a diversified service portfolio and securing global contracts to enhance earnings visibility.",
            "Sentiment": "positive",
            "PublishDate": 1755102892579,
            "Source": "stock"
        },
        {
            "Title": "SEAMEC Reports Strong Q1 Performance with 29% Jump in Net Profit Despite Revenue Decline",
            "Summary": "SEAMEC delivered strong quarterly results with consolidated net profit rising to 758 million rupees from 499 million rupees year-over-year, representing a 52% increase. EBITDA grew to 939 million rupees compared to 728 million rupees in the same period last year. The company's EBITDA margin expanded significantly to 44.51% from 33.85% year-over-year. However, revenue declined slightly to 2.1 billion rupees from 2.15 billion rupees in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1755097968291,
            "Source": "earnings"
        },
        {
            "Title": "SEAMEC Signs 611.3 Million Rupee Charter Party Agreement with A.D. Engineers & Contractors",
            "Summary": "SEAMEC has entered into a charter party agreement with A.D. Engineers & Contractors valued at 611.3 million rupees. The agreement represents a significant contract for the company's operations.",
            "Sentiment": "positive",
            "PublishDate": 1754913181972,
            "Source": "order&deals"
        },
        {
            "Title": "HAL Offshore Terminates Agreement with SEAMEC Over Undelivered Vessel 'Sea Pearl'",
            "Summary": "HAL Offshore has ended its agreement with SEAMEC for the vessel 'Sea Pearl' due to the company's failure to deliver the vessel. As a result of this termination, SEAMEC may face financial penalties.",
            "Sentiment": "negative",
            "PublishDate": 1754397450923,
            "Source": "stock"
        },
        {
            "Title": "HAL Offshore Terminates Vessel Charter Agreement with SEAMEC Limited",
            "Summary": "HAL Offshore Limited has terminated its Memorandum of Understanding with SEAMEC Limited for the charter hire of vessel 'SEA PEARL', which was originally signed on December 26, 2023. The termination was communicated on August 5, 2025, effective from July 28, 2025. The reason for termination was SEAMEC's inability to deliver the vessel to HAL due to non-delivery by the vessel owner. As a result, SEAMEC Limited may have to bear liquidated damages for the non-delivery of the vessel to HAL Offshore Limited.",
            "Sentiment": "negative",
            "PublishDate": 1754397011356,
            "Source": "order&deals"
        },
        {
            "Title": "Seamec Reports Vessel Arrest During Maintenance",
            "Summary": "Seamec has reported that its vessel, Seamec II, has been arrested during drydock maintenance in Colombo. The company disclosed this information, indicating a potential legal or regulatory issue affecting one of its assets.",
            "Sentiment": "negative",
            "PublishDate": 1752764470000,
            "Source": "default"
        },
        {
            "Title": "SEAMEC Secures Contract Worth 392 Million Rupees",
            "Summary": "SEAMEC has been awarded a contract valued at 392 million rupees. The news brief does not provide additional details about the nature of the contract, its duration, or the client involved.",
            "Sentiment": "positive",
            "PublishDate": 1751979305000,
            "Source": "default"
        }
    ]
}