{
    "Symbol": "SECMARK",
    "ISIN": "INE0BTM01013",
    "News": [
        {
            "Title": "SecMark Consultancy Board Meet Set for Feb 13, 2026",
            "Summary": "SecMark Consultancy Limited has scheduled a board meeting on February 13, 2026, to approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770637681904,
            "Source": "co_actions_results"
        },
        {
            "Title": "SecMark Consultancy acquires trading platforms for ₹8 cr",
            "Summary": "SecMark Consultancy Limited signed agreements worth ₹28 crores including software purchase from Codifi entities and consultancy services for trading platform development and maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1767087945069,
            "Source": "co_actions_results"
        },
        {
            "Title": "SecMark Consultancy Reports Marginal Profit of ₹0.51 Lakh for September 2025 Quarter",
            "Summary": "SecMark Consultancy Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported a net profit after tax of ₹0.51 lakh for the quarter, compared to a loss of ₹9.90 lakh in the previous quarter. For the half-year period, the company posted a loss of ₹20.75 lakh. Total income for the quarter was ₹639.80 lakh, while total expenses were ₹843.19 lakh. The company operates in software consultancy and technology services. The board meeting was held on November 12, 2025, where these unaudited financial results were approved. The company's equity share capital stands at ₹1,044.70 lakh with a face value of ₹10 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1763000170010,
            "Source": "earnings"
        },
        {
            "Title": "SecMark Consultancy Reports Loss of Rs 89.99 Lakhs in Q1 FY2026, Appoints New Secretarial Auditor",
            "Summary": "SecMark Consultancy Limited reported a net loss of Rs 89.99 lakhs for the quarter ended June 30, 2025, compared to a profit of Rs 15.77 lakhs in the same quarter last year. Revenue from operations increased to Rs 605.38 lakhs from Rs 583.07 lakhs year-on-year. Total expenses rose to Rs 812.03 lakhs from Rs 582.16 lakhs in the previous year quarter. The company's earnings per share declined to negative Rs 0.87 from positive Rs 0.15. The Board also approved the appointment of M/s. K.P. Ghelani & Associates as Secretarial Auditor for five years from FY 2025-26 to 2029-30, subject to shareholder approval. The company operates in software consultancy and technology services segment.",
            "Sentiment": "negative",
            "PublishDate": 1755096757397,
            "Source": "earnings"
        }
    ]
}