{
    "Symbol": "SECURKLOUD",
    "ISIN": "INE650K01021",
    "News": [
        {
            "Title": "SecureKloud Appoints Two Independent Directors",
            "Summary": "SecureKloud Technologies appointed Mr. Duraiswamy Basuvaiah and Mrs. Annaganala Srimathi Venkata Narayanan as Additional Independent Directors for a 5-year term from February 12, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770903186407,
            "Source": "stocks"
        },
        {
            "Title": "SecureKloud Technologies corrects company name error",
            "Summary": "SecureKloud Technologies Limited files addendum to correct company name error in director resignation letter dated December 31, 2025, changing reference from Private Limited to Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769693732760,
            "Source": "stocks"
        },
        {
            "Title": "SecureKloud Technologies Independent Director Resigns",
            "Summary": "Mrs. Panchi Samuthirakani resigned as Independent Director of SecureKloud Technologies effective December 31, 2025, citing personal reasons and preoccupations.",
            "Sentiment": "neutral",
            "PublishDate": 1767195884401,
            "Source": "stocks"
        },
        {
            "Title": "SecureKloud Technologies Reports Mixed Quarterly Results with Standalone Profit Despite Consolidated Losses",
            "Summary": "SecureKloud Technologies Limited announced quarterly results for September 30, 2025, showing standalone net profit of INR 241.46 lakhs but consolidated net loss of INR 1,532.25 lakhs. The company faces going concern uncertainties due to continuing operating losses and working capital challenges, with auditors highlighting material uncertainty about its ability to continue operations.",
            "Sentiment": "negative",
            "PublishDate": 1763108479002,
            "Source": "earnings"
        },
        {
            "Title": "SecureKloud Technologies Signs Master Service Agreement with Subsidiary Healthcare Triangle",
            "Summary": "SecureKloud Technologies Limited entered into a Master Service Agreement with its subsidiary Healthcare Triangle Private Limited on October 13, 2025. The agreement is for sharing of services with a size not exceeding INR 5 crores. SecureKloud holds 99.99% shares in Healthcare Triangle Private Limited. The transaction is classified as a related party transaction conducted on an arm's length basis.",
            "Sentiment": "neutral",
            "PublishDate": 1760347971010,
            "Source": "stock"
        },
        {
            "Title": "SecureKloud Technologies' Subsidiaries Enter Master Service Agreement Worth Up to INR 15 Crores",
            "Summary": "SecureKloud Technologies Limited announced that its subsidiaries Healthcare Triangle Private Limited and Healthcare Triangle Inc. have entered into a Master Service Agreement on October 10, 2025. The agreement is for sharing of services between the fellow subsidiaries with a value not exceeding INR 15 crores. The transaction is classified as a related party transaction conducted on an arm's length basis.",
            "Sentiment": "neutral",
            "PublishDate": 1760185916841,
            "Source": "stock"
        },
        {
            "Title": "SecureKloud Technologies Corrects Board Meeting Outcome on Statutory Auditor Appointment Date",
            "Summary": "SecureKloud Technologies Limited issued a correction to their Board Meeting outcome filed on August 14, 2025, regarding the appointment of Statutory Auditors. The company corrected an error in the date of their Annual General Meeting, clarifying that M/s. K. Gopal Rao & Co will be re-appointed as Statutory Auditors for a second term of 5 years, subject to shareholder approval at the AGM to be held on September 29, 2025, not September 30 as initially stated. The re-appointment will be from the conclusion of the 40th AGM till the conclusion of the 45th AGM, based on the Audit Committee's recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1755184689491,
            "Source": "corporate_action"
        },
        {
            "Title": "SecureKloud Technologies Reports Massive Loss of INR 12,573 Crores Due to Subsidiary Bankruptcy",
            "Summary": "SecureKloud Technologies Limited reported a significant net loss of INR 12,572.93 crores for the quarter ended June 30, 2025, compared to a profit of INR 40.50 crores in the same period last year. The massive loss was primarily due to exceptional items worth INR 12,720.37 crores, including provisions for doubtful receivables of INR 2,608 crores and investment impairment of INR 10,112 crores related to its subsidiary SecureKloud Technologies Inc, which filed for bankruptcy under Chapter 7 in the United States on June 14, 2025. Revenue from operations declined to INR 972.99 crores from INR 1,067.81 crores year-over-year. The company's auditors expressed substantial doubt about its ability to continue as a going concern, noting that subsidiaries contribute 93% of total revenue. In governance changes, the company appointed Venkatesh Rajaratnam as Additional Independent Director and reappointed K. Gopal Rao & Co as statutory auditors for a second five-year term, both subject to shareholder approval. V.V. Sampath Kumar resigned as Independent Director due to personal reasons.",
            "Sentiment": "negative",
            "PublishDate": 1755177499169,
            "Source": "earnings"
        },
        {
            "Title": "SecureKloud's Subsidiary HCTI Launches QuantumNexis for Healthcare AI",
            "Summary": "SecureKloud Technologies Limited's subsidiary, Healthcare Triangle Inc. (HCTI), has introduced QuantumNexis, a new AI solution for the global healthcare industry. The product was unveiled at an exclusive event in Kuala Lumpur, aiming to enhance AI applications in healthcare worldwide.",
            "Sentiment": "positive",
            "PublishDate": 1750333996000,
            "Source": "default"
        },
        {
            "Title": "SecureKloud Tech's Healthcare Triangle Acquires Niyama Healthcare and Ezovion Solutions",
            "Summary": "Healthcare Triangle, a subsidiary of SecureKloud Tech, has completed the strategic acquisition of two companies: Niyama Healthcare and Ezovion Solutions. This acquisition is expected to strengthen Healthcare Triangle's position in the healthcare technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1750085768000,
            "Source": "default"
        },
        {
            "Title": "SecureKloud Technologies Launches DocuGenie.AI",
            "Summary": "SecureKloud Technologies has introduced a new product called DocuGenie.AI. This offering aims to improve document management by leveraging automation and artificial intelligence technology.",
            "Sentiment": "positive",
            "PublishDate": 1749130954000,
            "Source": "default"
        },
        {
            "Title": "SecureKloud's Unit QuantumNexis to Acquire Healthcare Companies",
            "Summary": "SecureKloud Technologies' subsidiary QuantumNexis is set to acquire Niyama Healthcare and Ezovion Solutions. The acquisitions aim to drive Gen AI-powered healthcare SaaS. The deals are structured as a mix of cash, stock, and performance-based earn-outs, with a combined acquisition value of $5.7 million. The acquisitions are expected to be completed within 90 days.",
            "Sentiment": "positive",
            "PublishDate": 1748360429000,
            "Source": "default"
        }
    ]
}