{
    "Symbol": "SEJALLTD",
    "ISIN": "INE955I01044",
    "News": [
        {
            "Title": "Sejal Glass Reports Q3 FY26 Financial Results",
            "Summary": "Sejal Glass Limited published unaudited financial results for quarter and nine months ended December 31, 2025, with consolidated revenue of ₹10,170.29 lakhs in Q3 FY26 versus ₹6,204.32 lakhs in Q3 FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1770223311271,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sejal Glass Board Meet on Feb 2 for Q3 Results",
            "Summary": "Sejal Glass Limited has scheduled a board meeting on February 02, 2026, to consider Q3FY26 financial results and preferential equity issuance to non-promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1769500753442,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sejal Glass Appoints New Auditor for UAE Subsidiary",
            "Summary": "Sejal Glass Limited announces appointment of N R Doshi and Partners as statutory auditor for its material subsidiary in UAE, effective January 13, 2026, strengthening compliance framework.",
            "Sentiment": "neutral",
            "PublishDate": 1768313333185,
            "Source": "stocks"
        },
        {
            "Title": "Sejal Glass Material Subsidiary Loses Statutory Auditor Due to Bank of Baroda Appointment",
            "Summary": "CNK and Associates LLP resigned as statutory auditors of Sejal Glass and Glass Manufacturing Products LLC, a UAE-based material subsidiary of Sejal Glass Limited, effective November 27, 2025. The resignation was mandatory as CNK accepted a concurrent auditor role with Bank of Baroda across UAE branches, requiring withdrawal from auditing clients with borrowings or credit facilities from the bank.",
            "Sentiment": "neutral",
            "PublishDate": 1764338801089,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sejal Glass Reports Strong Q2 FY26 Results with 69.75% Revenue Growth",
            "Summary": "Sejal Glass Limited delivered robust quarterly results with revenue of Rs. 105.04 crores (up 69.75% YoY) and net profit of Rs. 8.12 crores (up 231.43% YoY), driven by strong international operations contributing 72% of H1 revenue mix. The company completed Glasstech acquisition, signed exclusive supply agreement with Saint Gobain, and secured technology licensing deal with Polymer Technology SRO for fire-rated glass manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1764000074734,
            "Source": "earnings"
        },
        {
            "Title": "Sejal Glass Limited Schedules Earnings Conference Call for Q2 and H1 FY26 Results",
            "Summary": "Sejal Glass Limited will conduct an earnings conference call on Tuesday, November 18, 2025, at 4:30 PM IST to discuss operational and financial performance for the second quarter and half year ended September 30, 2025. The call will be hosted by management representatives Mr. Amrut Gada and Mr. Chandresh Rambhia. Participants can join via universal dial-in numbers or through Diamond Pass login registration, with joining recommended 10 minutes prior to the scheduled time.",
            "Sentiment": "neutral",
            "PublishDate": 1763038290661,
            "Source": "earnings"
        },
        {
            "Title": "Sejal Glass Limited Provides Corporate Guarantee of AED 10 Million for UAE Subsidiary",
            "Summary": "Sejal Glass Limited has extended a corporate guarantee for AED 10,000,000 (Arab Emirates Dirhams Ten Million) to facilitate credit facilities from Bank of Baroda, UAE for its material subsidiary Sejal Glass and Glass Manufacturing Products LLC. The guarantee is provided on an arms-length basis with no promoter or promoter group interest in the transaction. The company states there is currently no impact from the guarantee other than disclosure requirements in financial statements, as the subsidiary is part of the consolidated group.",
            "Sentiment": "neutral",
            "PublishDate": 1762889602926,
            "Source": "corporate_action"
        },
        {
            "Title": "Sejal Glass Enters Into Deal With Saint-Gobain India",
            "Summary": "Sejal Glass has entered into a deal with Saint-Gobain India. No additional details about the nature, terms, or financial implications of the agreement were disclosed.",
            "Sentiment": "neutral",
            "PublishDate": 1762865999296,
            "Source": "order&deals"
        },
        {
            "Title": "Sejal Glass Clarifies Valuation Report Requirement for Preferential Issue",
            "Summary": "Sejal Glass Limited has issued a clarification regarding its preferential issue of 13,00,000 equity shares and 4,00,000 convertible warrants. The company initially stated that SEBI ICDR Regulation 166A was not applicable as the allotment would not exceed 5% of post-issue fully diluted share capital. Following a query from the National Stock Exchange, the company amended its position, acknowledging that the preferential issue will result in allotment of more than 5% of post-issue fully diluted share capital. In compliance with Regulation 166A, the company has obtained a clarification to the valuation report from independent registered valuer Mr. Nitish Chaturvedi for determining fair price of equity shares and convertible warrants. The valuation report clarification has been posted on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1762295794392,
            "Source": "corporate_action"
        },
        {
            "Title": "Sejal Glass Limited Reports Quarterly Financial Results for September 2025",
            "Summary": "Sejal Glass Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported standalone net sales of Rs. 2,510.00 lakhs for the quarter compared to Rs. 609.95 lakhs in the previous year quarter. Consolidated net sales reached Rs. 7,474.53 lakhs for the quarter versus Rs. 616.91 lakhs in the prior year. The company showed a standalone net loss of Rs. 34.12 lakhs for the quarter, while consolidated operations generated a net profit of Rs. 877.12 lakhs. The results include the impact of acquiring the architectural glass business of Glasstech Industries (India) Pvt. Ltd. through a Business Transfer Agreement executed on April 10, 2025. The company operates in architectural glass manufacturing and has one foreign subsidiary and one associate entity.",
            "Sentiment": "positive",
            "PublishDate": 1760798086215,
            "Source": "earnings"
        },
        {
            "Title": "Sejal Glass Issues Corrigendum to Postal Ballot Notice with Revised NAV Calculations",
            "Summary": "Sejal Glass Limited issued a corrigendum to its Postal Ballot Notice dated September 15, 2025, following directions from the National Stock Exchange. The corrigendum informs shareholders about an addendum dated October 06, 2025, issued by registered valuer Mr. Nitish Chaturvedi, which presents revised NAV calculations for the company. The remote e-voting facility for the postal ballot remains ongoing from September 16, 2025, until October 15, 2025. The company has made the valuation report and addendum available on its website. Shareholders who have already voted but wish to modify their votes in light of the revised information can do so by contacting the scrutinizer before the voting deadline. The corrigendum must be read in conjunction with the original postal ballot notice and a previous corrigendum dated October 07, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760102753711,
            "Source": "corporate_action"
        },
        {
            "Title": "Sejal Glass Limited Re-appoints Director and Approves Rs 24 Crore Fundraising Through Preference Shares",
            "Summary": "Sejal Glass Limited shareholders approved two key proposals at their 27th Annual General Meeting held on September 30, 2025. The company re-appointed Mr. Vijay Vasanji Mamania as a Non-Independent Non-Executive Director, who was liable to retire by rotation. The director has been confirmed as not debarred from holding directorship by any regulatory authority. Additionally, shareholders approved a fundraising proposal to raise up to Rs 24 crores through the issuance of Non-Cumulative Redeemable Preference Shares via private placement. The fundraising will involve 24,00,000 preference shares with a face value of Rs 100 each, with M/s. Dilesh Roadlines Private Limited (a promoter entity) identified as the investor. The fundraising is subject to necessary regulatory and statutory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1759220907232,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sejal Glass Limited Board Approves Rs. 94.35 Crore Fundraising Through Equity Shares and Convertible Warrants",
            "Summary": "Sejal Glass Limited's Board of Directors approved a proposal to raise up to Rs. 94.35 crore through preferential issue of equity shares and convertible warrants. The fundraising comprises 13 lakh fully paid-up equity shares at Rs. 555 per share (totaling Rs. 72.15 crore) and 4 lakh convertible warrants at Rs. 555 each (totaling Rs. 22.20 crore). The warrants can be converted into equity shares within 18 months from allotment date. Major proposed allottees include Abakkus Growth Fund-2 (5 lakh shares), Chandrakant Vallabhaji Gogri (4 lakh shares), and Vinod H Biyani (2 lakh shares). The issue is subject to shareholder approval and other regulatory clearances. The warrants require 25% payment upfront with remaining 75% due upon conversion.",
            "Sentiment": "positive",
            "PublishDate": 1757953336860,
            "Source": "corporate_action"
        },
        {
            "Title": "Sejal Glass Limited Board Approves Preferential Issue of 13 Lakh Equity Shares and 4 Lakh Convertible Warrants",
            "Summary": "Sejal Glass Limited's Board of Directors approved a fund-raising proposal through preferential issuance of 13,00,000 equity shares at Rs. 10 face value each and 4,00,000 unlisted convertible warrants. The equity shares will be issued to both promoter and non-promoter groups, while the convertible warrants will be issued only to the promoter group. The company will seek shareholder approval through postal ballot with e-voting scheduled from September 16 to October 15, 2025. The Board also constituted an implementation committee comprising three directors - Chirag H. Doshi, Neha R. Gada, and Jiggar L. Savla - to oversee the securities issuance process.",
            "Sentiment": "positive",
            "PublishDate": 1757918630840,
            "Source": "corporate_action"
        },
        {
            "Title": "Sejal Glass Considers Fundraising Through Equity Shares or Warrants",
            "Summary": "Sejal Glass is considering raising funds through equity shares or warrants. The company is exploring these financing options as potential methods to secure capital.",
            "Sentiment": "neutral",
            "PublishDate": 1757508230210,
            "Source": "stock"
        },
        {
            "Title": "Sejal Glass Signs Technology License Agreement with Czech Republic's Polymer Technology for Fire Rated Glass",
            "Summary": "Sejal Glass Limited has executed a Technology License and Supply Agreement with Polymer Technology SRO of Czech Republic. Under the agreement, Sejal Glass will pay Euro 215,000 to obtain perpetual, exclusive, royalty-free rights to use Polymer's Gel Technology for developing and manufacturing Fire Rated Glass in India and UAE. The company can sell these products globally under its own trademark. The agreement allows Sejal Glass to expand its product portfolio to include fire rated products. The licensing covers both domestic and international operations.",
            "Sentiment": "positive",
            "PublishDate": 1757146473151,
            "Source": "stock"
        },
        {
            "Title": "Sejal Glass Reports Q1 Results with Standalone Revenue at ₹2,181 Crores",
            "Summary": "Sejal Glass Limited approved its unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported net sales of ₹2,181.01 crores compared to ₹1,516.70 crores in the same quarter last year, and ₹1,673.39 crores in the previous quarter. Net profit stood at ₹13.10 crores versus a loss of ₹25.69 crores in the corresponding quarter of the previous year. On a consolidated basis, total income reached ₹7,776.24 crores with net profit of ₹441.63 crores compared to ₹139.87 crores in the same quarter last year. The results include the impact of acquiring the architectural glass business of Glasstech Industries through a Business Transfer Agreement executed on April 10, 2025, making current period figures not comparable to earlier periods. The company operates primarily in architectural glass manufacturing and has one foreign subsidiary and one associate entity.",
            "Sentiment": "positive",
            "PublishDate": 1754481741176,
            "Source": "earnings"
        },
        {
            "Title": "Sejal Glass Reports Strong Q1 Performance with Revenue Up 46% and Net Profit Tripling",
            "Summary": "Sejal Glass delivered robust quarterly results with revenue rising to 771 million rupees from 528 million rupees year-over-year. The company's consolidated net profit surged to 44 million rupees compared to 14 million rupees in the same period last year. EBITDA increased to 119 million rupees from 70 million rupees, while EBITDA margin improved to 15.40% from 13.29% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754480893898,
            "Source": "earnings"
        },
        {
            "Title": "Sejal Glass Reschedules Board Meeting to August 6 Due to Unforeseen Circumstances",
            "Summary": "Sejal Glass Limited has rescheduled its board meeting from July 30, 2025 to August 6, 2025 due to unforeseen circumstances. The meeting will consider and approve the unaudited financial results for the quarter ended June 30, 2025. The trading window will remain closed until 48 hours after the results are declared.",
            "Sentiment": "neutral",
            "PublishDate": 1753706920476,
            "Source": "corporate_action"
        }
    ]
}