{
    "Symbol": "SELMC",
    "ISIN": "INE105I01020",
    "News": [
        {
            "Title": "SEL Manufacturing Reports Rs 85.26 Crore Loss Amid Severe Financial Distress and Plant Shutdowns",
            "Summary": "SEL Manufacturing Company Limited reported a net loss of Rs 4,421.69 crore for the quarter ended September 30, 2025, and Rs 8,526.31 crore for the six-month period. The company's revenue from operations was Rs 531.24 crore for the quarter. The company is experiencing severe financial distress with major plants remaining shut during the quarter and has shifted to job work operations at one unit instead of manufacturing activities. SEL Manufacturing has defaulted on quarterly installments of Rs 21,500 crore due from September 2023 to September 2025, and unpaid interest of Rs 15,214 crore for the period July 2023 to September 2025. The company has accumulated total losses of Rs 72,616 crore since implementing its resolution plan. Shareholders passed a resolution for initiating Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code 2016 in an extraordinary general meeting held on October 13, 2023. The auditors expressed material uncertainty about the company's ability to continue as a going concern due to liquidity constraints and inability to meet financial obligations.",
            "Sentiment": "negative",
            "PublishDate": 1762773844824,
            "Source": "earnings"
        },
        {
            "Title": "SEL Manufacturing Shareholders Approve Director Appointments at 25th AGM",
            "Summary": "SEL Manufacturing Company Limited shareholders approved multiple director appointments at their 25th Annual General Meeting held on September 30, 2025. The approvals included the re-appointment of Mr. Shashankrai as Non-Executive, Non-Independent Director, and the regularization of three new appointments effective from August 5, 2025. Ms. Meghna Mahendra Savla and Ms. Menka Rajdev Yadav were appointed as Independent Directors for five-year terms, both being qualified Company Secretaries with experience in corporate compliance and governance. Mr. Dharminder Pal was appointed as Non-Executive, Non-Independent Director for a five-year term, bringing business and entrepreneurial experience. All appointed directors have no inter-relationships with existing directors or key management personnel and are not restricted by any regulatory orders.",
            "Sentiment": "positive",
            "PublishDate": 1759219151772,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEL Manufacturing Appoints Ratika Khandelwal as Company Secretary and Compliance Officer",
            "Summary": "SEL Manufacturing Company Limited appointed Ms. Ratika Khandelwal as Company Secretary and Compliance Officer effective September 13, 2025. The Board of Directors approved the appointment through a resolution by circulation. Khandelwal is a qualified Company Secretary with membership number A-62610. She brings experience from various roles including Senior Executive at NAV INDIA Back-office IT solutions, Financial Analyst at Deutsche Bank, and positions at company secretarial firms. Her expertise includes corporate compliances under Companies Act, LLP Act, accounting, tax work, and legal document drafting.",
            "Sentiment": "neutral",
            "PublishDate": 1757747444799,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEL Manufacturing Company Approves Q1 FY2026 Results, Faces Multiple Senior Leadership Resignations",
            "Summary": "SEL Manufacturing Company Limited approved its unaudited financial results for the quarter ended June 30, 2025. The board appointed M/s Lal Ghai & Associates as secretarial auditors for FY 2025-26 to 2029-30, subject to shareholder approval, and M/s Jatin Sharma & Co. as cost auditors for FY 2025-26. The company scheduled its 25th Annual General Meeting for September 30, 2025, via video conferencing. However, the company experienced significant leadership changes with multiple resignations: Mrs. Seema Singh and Mr. Manjit Singh Kochar resigned as independent directors effective July 29, 2025, Mr. Dinesh Kumar Mehtani resigned as Non-Executive Director effective July 18, 2025, CFO Mr. Navneet Gupta resigned effective July 31, 2025, and Company Secretary Mr. Sumit Sushil Jain resigned effective August 11, 2025. The board approved the cost audit report for FY 2024-25 and the board's report with annexures for FY 2024-25.",
            "Sentiment": "negative",
            "PublishDate": 1755166517402,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEL Manufacturing Company Secretary Sumit Sushil Jain Resigns Due to Personal and Professional Commitments",
            "Summary": "SEL Manufacturing Company Limited announced that Mr. Sumit Sushil Jain has resigned from his position as Company Secretary & Compliance Officer, effective from the close of business hours on August 11, 2025. The resignation is attributed to personal and professional commitments. In his resignation letter, Jain stated the decision was made after careful consideration of his personal and professional priorities, and he committed to providing full cooperation for a smooth transition and completing pending compliance requirements. The company confirmed there are no material reasons for the resignation other than those stated.",
            "Sentiment": "neutral",
            "PublishDate": 1754897044195,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEL Manufacturing Appoints Three New Directors and Reconstitutes Board Committees",
            "Summary": "SEL Manufacturing Company Limited appointed three new directors to its board on August 5, 2025. Ms. Meghna Mahendra Savla and Ms. Menka Rajdev Yadav were appointed as Additional Independent Directors, while Mr. Dharminder Pal was appointed as Additional Director. Ms. Savla was also appointed as Chairperson of the company. The appointments follow the resignations of three directors: Mr. Manjit Singh Kochar (Independent Director and Chairperson), Mrs. Seema Singh (Independent Director), and Mr. Dinesh Kumar Mehtani (Director). The company reconstituted four board committees - Audit Committee, Nomination and Remuneration Committee, Risk Management Committee, and Stakeholders Relationship Committee - with the new directors taking key positions. Additionally, Mr. Naveen Arora, who is already a Whole-Time Director, was appointed as Chief Financial Officer following the resignation of Mr. Navneet Gupta from the CFO position on July 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754389274213,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEL Manufacturing CFO Navneet Gupta Resigns Due to Professional Commitments",
            "Summary": "SEL Manufacturing Company Limited announced the resignation of Mr. Navneet Gupta from his position as Chief Financial Officer and Key Managerial Personnel, effective July 31, 2025. The resignation was attributed to other professional commitments and pre-occupations. Gupta confirmed there are no material reasons for his resignation beyond those stated. The company disclosed this information to both NSE and BSE exchanges, with Whole-time Director Naveen Arora signing the regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1754123881964,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEL Manufacturing Company Announces Resignation of Two Independent Directors",
            "Summary": "SEL Manufacturing Company Limited announced the resignations of two Independent Directors effective July 29, 2025. Mrs. Seema Singh resigned from her position as Independent Director, citing personal commitments and professional obligations. She also stepped down from her roles as member of the Audit Committee and Stakeholders Relationship Committee, and as Chairman of the Nomination and Remuneration Committee. Mr. Manjit Singh Kochar resigned from his position as Independent Director and Chairperson of the company, also citing personal commitments. He ceased to be a member of the Stakeholders Relationship Committee, Risk Management Committee, and Nomination and Remuneration Committee, as well as Chairman of the Audit Committee. Both directors confirmed there are no material reasons for their resignations other than those mentioned in their resignation letters. Mrs. Singh also holds directorship at PNC Infratech Limited as an Independent Director.",
            "Sentiment": "neutral",
            "PublishDate": 1753783188950,
            "Source": "corporate_governance"
        }
    ]
}