{
    "Symbol": "SEMAC",
    "ISIN": "INE617A01013",
    "News": [
        {
            "Title": "Semac Construction Q3 FY26 Results Show Strong Growth",
            "Summary": "Semac Construction Limited reported consolidated revenue of ₹5,895.66 lakhs for Q3 FY26, up from ₹4,604.78 lakhs in Q3 FY25. Net profit reached ₹156.98 lakhs compared to a loss of ₹124.09 lakhs in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770285015151,
            "Source": "co_actions_results"
        },
        {
            "Title": "Semac Construction Forms JV for Railway Project",
            "Summary": "Semac Construction Limited has entered into a joint venture with Ukraine-based ALTIS HOLDING CORPORATION to bid for the redevelopment of Barauni Junction Railway Station project under East Central Railways.",
            "Sentiment": "positive",
            "PublishDate": 1768842043069,
            "Source": "co_actions_results"
        },
        {
            "Title": "Semac Construction Reports Mixed Quarterly Results with Revenue Growth and Profit Recovery",
            "Summary": "Semac Construction Limited announced its quarterly results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs. 5,588.58 lakhs for the quarter compared to Rs. 7,503.85 lakhs in the previous quarter. Net profit after tax showed improvement to Rs. 104.03 lakhs for the half-year ended September 30, 2025, compared to a loss of Rs. 555.76 lakhs in the corresponding period last year. The company operates in Engineering, Procurement and Construction Services segment. During the quarter, Semac acquired 50% equity shares from shareholders of its associate company Semac Construction Technologies India Private Limited, making it a wholly owned subsidiary. The Board approved a scheme of amalgamation between the subsidiary and parent company, which has been filed with NCLT for approval. The company's cash and cash equivalents stood at Rs. 37.28 lakhs as of September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762339784800,
            "Source": "earnings"
        },
        {
            "Title": "Semac Construction Limited Approves Merger with Wholly-Owned Subsidiary",
            "Summary": "Semac Construction Limited's Board of Directors approved a scheme of amalgamation to merge its wholly-owned subsidiary, Semac Construction Technologies India Private Limited (SCTPL), into itself. The merger will be effective from July 1, 2025, subject to regulatory approvals including National Company Law Tribunal consent. SCTPL, engaged in construction of buildings, has a paid-up capital of ₹1 lakh and net worth of negative ₹13.91 lakh, while Semac Construction has a paid-up capital of ₹31.17 crore and net worth of ₹6,490.87 lakh. No new shares will be issued as consideration since SCTPL is wholly-owned by Semac Construction. The merger aims to reduce regulatory compliances, simplify group structure, ease management, and reduce administrative overheads. The company's shareholding pattern will remain unchanged as no shares are being issued in connection with the scheme.",
            "Sentiment": "positive",
            "PublishDate": 1753870851948,
            "Source": "corporate_action"
        },
        {
            "Title": "Semac Construction Limited Approves Quarterly Financial Results and Schedules 48th Annual General Meeting",
            "Summary": "Semac Construction Limited's Board of Directors approved the unaudited standalone and consolidated financial statements for the quarter ended June 30, 2025, during a meeting held on July 30, 2025. The board also approved reports from statutory auditors S S Kothari Mehta and Company on these financial results. Additionally, the company scheduled its 48th Annual General Meeting for September 12, 2025, to be held at the company's registered office in Coimbatore. The board meeting lasted from 10:00 AM to 3:00 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1753869534026,
            "Source": "earnings"
        },
        {
            "Title": "SEMAC Consultants Reports Significant Revenue Growth in Q2",
            "Summary": "SEMAC Consultants has reported a substantial year-over-year increase in revenue for the second quarter. The company's revenue rose to 282 million rupees, up from 168 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1730117223000,
            "Source": "result"
        },
        {
            "Title": "SEMAC Consultants Reports Q2 Net Loss",
            "Summary": "SEMAC Consultants has reported a net loss of 32.7 million rupees for the second quarter. This represents an improvement from the loss of 38 million rupees in the same quarter last year (YoY), but a slight increase from the loss of 27 million rupees in the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1730117214000,
            "Source": "result"
        }
    ]
}