{
    "Symbol": "SENCO",
    "ISIN": "INE602W01027",
    "News": [
        {
            "Title": "Senco Gold Board Meet on Feb 12 for Q3FY26 Results",
            "Summary": "Senco Gold Limited has scheduled a board meeting on February 12, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1770303191277,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senco Gold Opens First Franchisee Store in Chhattisgarh",
            "Summary": "Senco Gold Limited has opened its first franchisee showroom in Ambikapur, Chhattisgarh, marking the company's expansion into the state with a new retail outlet.",
            "Sentiment": "positive",
            "PublishDate": 1769250917565,
            "Source": "stocks"
        },
        {
            "Title": "Senco Gold Acquires 68% Stake in Melorra Brand Owner",
            "Summary": "Senco Gold Limited announces ₹68 crore investment to acquire 68% equity stake in August Jewellery Private Limited, owner of the Melorra brand, strengthening its digital and omnichannel strategy for young consumers.",
            "Sentiment": "positive",
            "PublishDate": 1769006271841,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senco Gold shares surge 14% on strong Q3 performance",
            "Summary": "Senco Gold shares jumped 14% amid strong Q3 jewellery sector performance. Titan led Nifty 50 gains with 40% revenue growth, while broader markets declined on profit-taking and geopolitical concerns.",
            "Sentiment": "positive",
            "PublishDate": 1767773646355,
            "Source": "stocks"
        },
        {
            "Title": "Senco Gold Shares Rally 14% on Robust Q3 Business Update",
            "Summary": "Senco Gold shares surged 14% to ₹369 following strong Q3 performance with 51% YoY growth, ₹8,000 cr TTM revenue milestone, and confident 25%+ FY26 growth guidance.",
            "Sentiment": "positive",
            "PublishDate": 1767712212049,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senco Gold Shares Rally 14% on Strong Q3 Performance",
            "Summary": "Senco Gold shares surged 14% to ₹368.40 following strong Q3 business update showing 51% revenue growth, 49% retail business growth, and 39% same-store sales growth with confident FY26 outlook.",
            "Sentiment": "positive",
            "PublishDate": 1767712141808,
            "Source": "stocks"
        },
        {
            "Title": "Senco Gold Confident About Revenue Growth Targets",
            "Summary": "Senco Gold expresses confidence in meeting its revenue growth objectives, indicating positive outlook for the jewelry retailer's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1767241786866,
            "Source": "stocks"
        },
        {
            "Title": "Senco Gold Extends August Jewellery Partnership",
            "Summary": "Senco Gold has extended its partnership agreement with August Jewellery, continuing the collaboration until March 2026 to strengthen its market presence.",
            "Sentiment": "positive",
            "PublishDate": 1767018572185,
            "Source": "stocks"
        },
        {
            "Title": "Senco Gold Reports 300% PAT Jump in Q2FY26 Despite Revenue Slowdown, October Sales Hit Record High",
            "Summary": "Senco Gold Limited achieved a 300% year-on-year increase in PAT to INR 48.8 crore for Q2FY26, while consolidated revenue grew modestly by 2% to INR 1,536 crore due to high gold prices and consumer purchase deferrals. The company recorded its highest-ever monthly sales of INR 1,700 crore in October with 50% growth, maintaining full-year revenue growth guidance of 18-20% and EBITDA margin guidance of 7.2-7.4%.",
            "Sentiment": "positive",
            "PublishDate": 1763642142723,
            "Source": "earnings"
        },
        {
            "Title": "Senco Gold Opens New Franchisee Store in Hazaribagh, Expands to 186 Stores Nationwide",
            "Summary": "Senco Gold Limited opened a new franchisee store in Hazaribagh, marking its ninth store in Jharkhand state. The expansion brings the company's total store count across India to 186 stores.",
            "Sentiment": "positive",
            "PublishDate": 1763129129560,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Targets 20% Revenue Growth in FY26 with Rs. 7,400 Crore Revenue Projection",
            "Summary": "Senco Gold announced ambitious growth targets for FY26, aiming for 20% revenue growth with projected revenue exceeding Rs. 7,400 crore and EBITDA margins between 7.2-7.4%. The guidance indicates the jewelry retailer's expansion strategy and profitability outlook for investors and stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1763092629957,
            "Source": "earnings"
        },
        {
            "Title": "Senco Gold Reports Strong Q2 Performance with Net Profit Surging to 531M Rupees",
            "Summary": "Senco Gold delivered robust quarterly results with net profit reaching 531 million rupees compared to 168 million rupees in the same period last year. Revenue grew to 15.5 billion rupees from 14.6 billion rupees year-over-year. The company's EBITDA increased significantly to 1.1 billion rupees from 556 million rupees, while EBITDA margin expanded to 6.97% from 3.81% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762960898063,
            "Source": "earnings"
        },
        {
            "Title": "Senco Gold Reports October Sales Exceed 17 Billion Rupees, Forecasts 18-20% Growth",
            "Summary": "Senco Gold reported October sales surpassing 17 billion rupees. The company has predicted growth of 18% to 20% for the remaining period of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762344087508,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Opens First Store in Rajasthan, Expands Network to 185 Outlets",
            "Summary": "Senco Gold Limited opened its first franchisee store in Bikaner, Rajasthan. This expansion brings the company's total store count across India to 185 outlets. The new store represents Senco's entry into the Rajasthan market.",
            "Sentiment": "positive",
            "PublishDate": 1760536964492,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Opens New Franchisee Store in Etawah, Total Store Count Reaches 184",
            "Summary": "Senco Gold Limited opened a new franchisee store in Etawah, Uttar Pradesh. With this addition, the company's total store count in India has reached 184. The company announced this expansion through a communication to stock exchanges BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1760265010096,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Expands Retail Network with New Franchise Store in West Bengal",
            "Summary": "Senco Gold has opened a new franchise store in Naihati, West Bengal. With this addition, the company's total store count in India has reached 183 locations.",
            "Sentiment": "positive",
            "PublishDate": 1760170451647,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Shares Drop 4.5% Despite 6.5% Revenue Growth in Q2",
            "Summary": "Senco Gold shares fell 4.5% to Rs 323.90 after reporting 6.5% year-on-year revenue growth for the September quarter. The jewellery retailer's first-half revenue increased 17.8% year-on-year, driven by 16% retail business expansion and 7.5% same-store sales growth. The company faced headwinds including high gold prices averaging Rs 1,16,500 per 10 grams (up 43% year-on-year), seasonal demand weakness during the Shraddh period, consumer shift toward capital goods due to GST reductions, and flood-like conditions in West Bengal. Senco added five new showrooms in the quarter, expanding its network to 184 stores. Diamond jewellery sales grew 12% in Q2 and 31% for the first half, while silver jewellery sales surged 54%.",
            "Sentiment": "neutral",
            "PublishDate": 1759984620358,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Projects 18-20% Revenue Growth for FY26 Amid Strong Quarterly Performance",
            "Summary": "Senco Gold expects revenue growth of 18% to 20% for FY26. The company reported 6.5% year-over-year revenue growth in Q2 despite record gold prices. The retail business achieved 16% growth in H1 FY26 with same-store sales growing by 7.5%. The company anticipates Q3 to be the best quarter for the jewelry sector due to major festivals including Dhanteras and Diwali, along with the wedding season.",
            "Sentiment": "positive",
            "PublishDate": 1759925805173,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Promoter Group Acquires Additional 37,900 Shares Through Open Market",
            "Summary": "Suvankar Sen, representing the Promoter and Promoter Group of Senco Gold Limited, acquired 37,900 equity shares representing 0.02% of the company's paid-up equity share capital through open market transactions on September 29, 2025. The acquisition involved multiple entities including Jai Hanuman Shri Siddhivinayak Trust (29,200 shares), Mr. Suvankar Sen (2,900 shares), Mrs. Joita Sen (1,450 shares), and Om Gaan Ganpataye Bajrangbali Trust (4,350 shares). Following this transaction, the total Promoter and Promoter Group shareholding increased from 10,53,88,952 shares (64.37%) to 10,54,26,852 shares (64.39%). The company's total equity share capital remains at Rs. 81,85,91,660 consisting of 16,37,18,332 equity shares of Rs. 5 each.",
            "Sentiment": "neutral",
            "PublishDate": 1759300963348,
            "Source": "corporate_action"
        },
        {
            "Title": "Senco Gold Extends Strategic Partnership with Melorra Owner Until December 2025",
            "Summary": "Senco Gold Limited has extended its strategic and marketing partnership with August Jewellery Private Limited, the owner of omnichannel jewelry brand Melorra. The tie-up, which was originally set to expire on September 30, 2025, has been extended until December 31, 2025, maintaining the same terms and conditions as the original agreement. This is a domestic arrangement described as a short-term strategic and marketing tie-up, with no acquisition involved and no related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1758968611707,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Partners With Sky Gold to Launch 9KT Gold Jewelry Line",
            "Summary": "Senco Gold has partnered with Sky Gold to introduce 9KT gold jewelry products. The partnership aims to offer affordable and fashionable gold pieces specifically targeting young buyers and new customers in the jewelry market.",
            "Sentiment": "positive",
            "PublishDate": 1758254904587,
            "Source": "order&deals"
        },
        {
            "Title": "Senco Gold Maintains 20% Growth Target Despite Record Gold Prices Impacting Sales Volumes",
            "Summary": "Senco Gold and Diamonds experienced challenging quarterly results with value growth in low single digits as record-high gold prices impacted consumer purchase volumes. MD and CEO Suvankar Sen noted that while consumer interest remains high, budgets haven't kept pace with rising gold prices, leading customers to shift from 22-karat gold to more affordable 18-karat, 14-karat, or diamond jewelry. Old gold exchanges surged to 45% of sales from the usual 35-40%. Despite volume pressures, the company maintains its annual guidance of 20% revenue growth and 7% EBITDA margins, expecting purchases to materialize during festive and wedding seasons. Gold reached fresh records at $3,686.39 per ounce amid expectations of US Federal Reserve rate cuts. Senco Gold's market capitalization stands at ₹6,084 crore, with shares trading at ₹372.50 and declining 42% over the past year.",
            "Sentiment": "neutral",
            "PublishDate": 1757998501616,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Seeks Saudi Arabia Partnerships for Gulf Expansion While Targeting 20% Domestic Growth",
            "Summary": "Senco Gold & Diamonds is pursuing collaboration opportunities in Saudi Arabia's $8.3 billion luxury market as part of its Gulf expansion strategy. The company participated in the Saudi Arabia Jewellery Exhibition (SAJEX) alongside over 200 Indian exhibitors. CEO Suvankar Sen noted that Indian jewellery has been losing market share to Turkish competitors in the Gulf region. The company is targeting Saudi Arabia's younger demographic who prefer modern, lightweight jewellery designs. Senco sees potential in cross-border e-commerce and hopes for reduced trade barriers through potential free trade agreements, though Saudi Arabia currently imposes high tariffs on jewellery imports. The company has launched lab-grown diamond jewellery under its Senes sub-brand and increased recycled gold usage. Domestically, Senco invested ₹700-800 crore in the current financial year, opening 10-12 new stores with more planned. The company reported ₹6,400 crore turnover last year and is targeting 20% growth this fiscal year. Diamond jewellery sales have outperformed gold jewellery due to high gold prices. Senco plans to open 16-18 stores this fiscal year and is open to joint ventures with Saudi firms.",
            "Sentiment": "positive",
            "PublishDate": 1757759199232,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Limited Publishes Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Senco Gold Limited has published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, in national and regional newspapers including Business Standard (English) and Dainik Statesman (Bengali Daily). The results were approved by the Board of Directors at their meeting held on August 12, 2025. The company informed stock exchanges NSE and BSE about the newspaper publication dated August 14, 2025, through a regulatory communication signed by Company Secretary Mukund Chandak.",
            "Sentiment": "neutral",
            "PublishDate": 1755171155104,
            "Source": "earnings"
        },
        {
            "Title": "Senco Gold Plans 20 New Store Openings, Projects 18-20% Revenue Growth",
            "Summary": "Senco Gold announced plans to open 20 stores this year with potential for 2 additional locations. The company is experiencing strong growth in diamond sales, with margins for diamonds outperforming plain gold jewelry. The stud ratio has increased from 9-9.5% to over 11%. The company projects 18-20% revenue growth for the full financial year and 16-18% year-over-year growth for Q2. EBITDA margins are guided at 6.8-7.3% for the full year.",
            "Sentiment": "positive",
            "PublishDate": 1755141688144,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Co-CEO Projects 18%-20% Revenue Growth with Improved Margin Targets",
            "Summary": "Senco Gold's Co-CEO has stated that the company is positioned for an 18%-20% revenue increase. The company is targeting an EBITDA margin range of 6.8%-7.2% and a PAT margin range of 3.7%-4.0%.",
            "Sentiment": "positive",
            "PublishDate": 1755051530064,
            "Source": "stock"
        },
        {
            "Title": "SENCO Gold Submits Monitoring Report on QIP Proceeds Utilization",
            "Summary": "SENCO Gold Limited submitted a monitoring agency report through ICRA Limited on the utilization of proceeds from its Qualified Institutional Placement for Q1 FY2026. The company raised INR 459 crores through the QIP in December 2024, with net proceeds of INR 443.42 crores. The report shows no deviation from the stated objects of the issue. Out of the total proceeds, INR 350 crores was allocated for repayment of outstanding borrowings, which has been completed. INR 93.42 crores was designated for general corporate purposes and working capital requirements, which was fully utilized during the quarter. Issue-related expenses of INR 15.58 crores were also accounted for, with INR 1.31 crores remaining unutilized and held in a monitoring account. The monitoring agency confirmed that all utilization was in line with the offer document disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1755012328750,
            "Source": "corporate_action"
        },
        {
            "Title": "Senco Gold Reports Strong Q1 FY2026 Performance with Revenue Growth and Higher Profitability",
            "Summary": "Senco Gold Limited announced its quarterly results for the period ended June 30, 2025. On a standalone basis, the company reported revenue from operations of ₹18,245.67 million compared to ₹14,149.58 million in the same quarter last year, representing significant growth. Profit after tax increased to ₹1,035.22 million from ₹533.44 million in the corresponding quarter of the previous year. On a consolidated basis, revenue from operations reached ₹18,262.76 million versus ₹14,038.89 million in the prior year quarter, while consolidated profit after tax rose to ₹1,046.54 million from ₹512.72 million. The company's earnings per share on a standalone basis improved to ₹3.43 from ₹3.79 in the same quarter last year. The Board meeting was held on August 12, 2025, where these results were reviewed by the Audit Committee and approved by the Board of Directors. Walker Chandiok & Co LLP conducted the limited review of the financial statements.",
            "Sentiment": "positive",
            "PublishDate": 1755009309836,
            "Source": "earnings"
        },
        {
            "Title": "Senco Gold Sets August 20, 2025 Record Date for Final Dividend Eligibility",
            "Summary": "Senco Gold Limited has set August 20, 2025 as the record date for determining shareholder eligibility for final dividend payment for FY 2024-2025. The dividend is subject to approval at the company's 31st Annual General Meeting scheduled for August 27, 2025 at 11:30 AM IST at Kala Mandir, Kolkata. The record date applies to equity shares of Rs 5 each.",
            "Sentiment": "neutral",
            "PublishDate": 1754317131116,
            "Source": "corporate_action"
        },
        {
            "Title": "Senco Gold Opens 77th Franchisee Store in Bihar, Total Store Count Reaches 183",
            "Summary": "Senco Gold Limited opened its 77th franchisee store in Bettiah, West Champaran District of Bihar, increasing the company's total store count in India to 183. The expansion brings Bihar's store count to 7. The company now operates 106 own stores (including 4 Sennes stores) and 77 franchisee stores (including 5 in FOCO model). This opening aligns with Senco Gold's plan to launch 20 new stores in FY 2026 - 10 company-owned and 10 franchisee stores. The company has launched 10 stores so far in FY 2026, comprising 4 company-owned stores and 5 franchisee stores in the first quarter, plus this latest store in the second quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753885145830,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Plans Growth Through Retail Expansion and Franchising Strategy",
            "Summary": "Senco Gold has outlined its growth strategy focusing on retail expansion through asset-light franchising, regional market penetration, digital initiatives, and premium product offerings. The company aims to accelerate growth by expanding its retail footprint while maintaining a capital-efficient franchise model.",
            "Sentiment": "positive",
            "PublishDate": 1753283061397,
            "Source": "stock"
        },
        {
            "Title": "9-Karat Gold Hallmarking to Boost Affordable Diamond and Fashion Jewellery Market",
            "Summary": "The Bureau of Indian Standards has introduced 9-karat gold hallmarking, which Senco Gold and Diamonds CEO Suvankar Sen views as opening new opportunities in affordable jewellery. 9-karat gold contains 37.5% gold with the remainder being alloy, making it significantly cheaper than higher karat options - priced around ₹3,750-₹3,800 per 100 grams compared to ₹1 lakh for 24-karat gold. This move aligns with international markets like the UK and US where lower karat jewellery is common. The change is expected to boost diamond and studded jewellery sales, particularly for everyday wear and gifts under ₹20,000-₹30,000, targeting younger and budget-conscious consumers. Sen clarified that 9-karat jewellery is intended for diamond and fashion buyers, not gold investors, while 22-karat remains standard for traditional and wedding jewellery. He noted that while making charges may appear similar in absolute terms across different karat levels, the lower gold content makes 9-karat pieces more accessible. The industry awaits clarity on new BIS regulations regarding 24-karat coin manufacturing by authorized mints and refineries.",
            "Sentiment": "positive",
            "PublishDate": 1753092419400,
            "Source": "stock"
        },
        {
            "Title": "Senco Gold Aims for 19-20% Growth, Confident in Meeting FY26 Goals",
            "Summary": "Senco Gold has expressed confidence in achieving its fiscal year 2026 targets, with a focus on 19-20% growth. The company's management has shared this optimistic outlook, though specific details about the goals or current performance metrics were not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751868538000,
            "Source": "default"
        },
        {
            "Title": "Senco Gold: Q1 Revenue Surges 28% on Festive Demand, Expansion",
            "Summary": "Senco Gold reported 28% YoY revenue growth in Q1 FY26, driven by festive demand and store expansion. Retail revenue up 24%, same-store sales growth at 19%. Launched 9 new showrooms, totaling 179. Diamond jewellery volume grew 35%. Company on track for FY26 target of 20 new stores.",
            "Sentiment": "positive",
            "PublishDate": 1751868498000,
            "Source": "result"
        },
        {
            "Title": "Senco Gold Reports Strong Q1 FY26 Performance",
            "Summary": "Senco Gold has reported significant growth in its Q1 FY26 results. The company achieved a 28% increase in total revenue, a 24% year-over-year growth in retail revenue, and a 19% rise in same-store sales. These figures indicate robust performance across various aspects of the company's business operations.",
            "Sentiment": "positive",
            "PublishDate": 1751846905000,
            "Source": "default"
        },
        {
            "Title": "Senco Gold Ltd: Q1 Revenue Surges 28% Amid Festival Demand",
            "Summary": "Senco Gold Ltd reported a 28% increase in total revenue for Q1, with retail growth up 24%. Same-store sales grew 19%. Diamond jewelry sales increased by 35%. The company opened nine new showrooms. Gold price rise led to a 6.5% reduction in average weight purchased.",
            "Sentiment": "positive",
            "PublishDate": 1751636986000,
            "Source": "earnings"
        },
        {
            "Title": "Senco Gold Reports Strong Q1 FY26 Performance",
            "Summary": "Senco Gold has reported significant growth in its Q1 FY26 financial results. The company's total revenue increased by 28%, while retail revenue saw a 24% rise. Additionally, same-store sales grew by 19% during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1751633432000,
            "Source": "default"
        },
        {
            "Title": "Senco Gold Ltd: Diamond Jewellery to Drive 18-20% Revenue Growth in FY26",
            "Summary": "Senco Gold Ltd targets 18-20% revenue growth in FY26, aiming for Rs 7,500 crore. Plans to open 18-20 new stores, with 50% as franchises in tier 2-4 cities. Targets 20% non-gold portfolio contribution, including 15% from diamonds. Adjusts hedging strategy to 65-80% due to anticipated gold price volatility.",
            "Sentiment": "positive",
            "PublishDate": 1749264705000,
            "Source": "normal_news"
        },
        {
            "Title": "Senco Gold: Q4 Profit Doubles, Shares Hit Upper Circuit",
            "Summary": "Senco Gold Ltd reported a 94% surge in Q4 consolidated net profit to Rs 62 crore. Revenue grew 21% to Rs 1,378 crore. The company saw 23% growth in retail operations and 18.4% same-store sales growth. Shares hit upper circuit, rising 4.99% to Rs 399.70.",
            "Sentiment": "positive",
            "PublishDate": 1748580001000,
            "Source": "earnings"
        },
        {
            "Title": "Senco Gold Reports Strong Q4 Results and Declares Dividend",
            "Summary": "Senco Gold has reported its Q4 consolidated net profit at 624 million rupees, up from 322 million rupees year-over-year and 335 million rupees quarter-over-quarter. The company's Q4 revenue increased to 13.8 billion rupees from 11.4 billion rupees in the same quarter last year. Additionally, Senco Gold has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748559758000,
            "Source": "default"
        },
        {
            "Title": "Senco Gold: Q4 Profit Soars 94%, Revenue Up 21%",
            "Summary": "Senco Gold Ltd. reported a 94% increase in consolidated net profit to Rs 62 crore for Q4 FY2025. Revenue grew 21% to Rs 1,378 crore. EBITDA rose 44.9% to Rs 127 crore, with margin expanding to 9.2%.",
            "Sentiment": "positive",
            "PublishDate": 1748534345000,
            "Source": "earnings"
        },
        {
            "Title": "SENCO GOLD Reports Q4 Results and Dividend Announcement",
            "Summary": "SENCO GOLD has announced its Q4 financial results and a dividend recommendation. The company's Q4 consolidated net profit increased to 624 million rupees, up from 322 million rupees year-over-year and 335 million rupees quarter-over-quarter. Q4 revenue rose to 13.8 billion rupees from 11.4 billion rupees year-over-year. EBITDA for Q4 reached 1.27 billion rupees, up from 878 million rupees year-over-year, with EBITDA margin improving to 9.22% from 7.72%. The company has recommended a dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748531572000,
            "Source": "result"
        },
        {
            "Title": "Senco Gold: Stock Hits Upper Circuit as Gold Prices Fall",
            "Summary": "Senco Gold shares hit 5% upper circuit for second consecutive day amid sharp correction in gold prices. Gold futures on MCX dropped over 4% to ₹92,588 per 10 grams. The stock's rally is attributed to anticipated improved demand and easing input volatility due to falling gold rates. Global gold prices weakened as geopolitical tensions eased following trade deals and potential truces.",
            "Sentiment": "positive",
            "PublishDate": 1747110502000,
            "Source": "normal_news"
        },
        {
            "Title": "Senco Gold Forms Strategic Partnership with August Jewellery",
            "Summary": "Senco Gold has entered into a strategic tie-up with August Jewellery. This partnership likely aims to enhance Senco Gold's market presence or product offerings in the jewelry sector.",
            "Sentiment": "positive",
            "PublishDate": 1745540020000,
            "Source": "default"
        },
        {
            "Title": "Senco Gold Forms Strategic Partnership with August Jewellery",
            "Summary": "Senco Gold has entered into a strategic tie-up with August Jewellery. This partnership is likely aimed at expanding Senco Gold's market presence or enhancing its product offerings in the jewelry sector.",
            "Sentiment": "positive",
            "PublishDate": 1745513016000,
            "Source": "default"
        },
        {
            "Title": "Senco Gold Ltd: Strong Q4 Performance with 18% Same Store Sales Growth",
            "Summary": "Senco Gold reported 23% retail growth and 18.4% same store sales growth in Q4 FY25, despite rising gold prices. The company achieved its highest-ever Q4 revenue of over ₹1,300 crore. For FY25, revenue grew 19.1% and diamond jewellery sales increased 14.1%. Senco Gold opened 15 new showrooms in FY25, bringing the total to 175. The company expects a robust Q1 FY26 driven by festive and wedding demand.",
            "Sentiment": "positive",
            "PublishDate": 1744167763000,
            "Source": "result"
        },
        {
            "Title": "Senco Gold Reports Strong Q4 Performance with 23% YoY Retail Growth",
            "Summary": "Senco Gold experienced robust demand during the wedding season in Q4, resulting in a 23% year-over-year retail growth and an 18.4% same-store sales growth (SSSG), despite rising gold prices. The company achieved its highest ever Q4 revenue of Rs 1300 crore.",
            "Sentiment": "positive",
            "PublishDate": 1744157479000,
            "Source": "earnings"
        },
        {
            "Title": "Senco Gold Ltd.: Record Q4 Revenue Driven by Strong Wedding Season Demand",
            "Summary": "Senco Gold Ltd. reported a 19.1% total revenue growth in Q4, reaching over Rs 1,300 crore, its highest-ever quarterly revenue. The company saw a 23% jump in retail growth despite rising gold prices. FY2025 revenue exceeded Rs 6,200 crore with 19.4% retail growth. Diamond jewelry sales grew 39%, and the company opened 15 new showrooms in FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1744121949000,
            "Source": "earnings"
        },
        {
            "Title": "Senco Gold Reports Strong Q4 Performance with 23% YoY Retail Growth",
            "Summary": "Senco Gold experienced robust demand during the wedding season in Q4, resulting in a 23% year-over-year retail growth and an 18.4% same-store sales growth (SSSG), despite rising gold prices. The company achieved its highest ever Q4 revenue of Rs 1300 crore.",
            "Sentiment": "positive",
            "PublishDate": 1744115553000,
            "Source": "result"
        },
        {
            "Title": "Senco Gold Ltd.: Promoters Increase Stake, Stock Hits Upper Circuit",
            "Summary": "Senco Gold's stock reached the upper circuit after promoter Jai Hanuman Shri Siddhivinayak Trust acquired 1,61,000 shares (0.01% stake) via open market transactions. The company plans to open 8-10 new showrooms in Q4 FY2025 and expects 18-20% growth, aiming to normalize EBITDA margins to 7-7.5%. However, profitability is declining due to high gold prices and slower store additions.",
            "Sentiment": "positive",
            "PublishDate": 1742452054000,
            "Source": "corporate_action"
        }
    ]
}