{
    "Symbol": "SENORES",
    "ISIN": "INE0RB801010",
    "News": [
        {
            "Title": "Senores Pharma EGM Approves Warrant Issuance",
            "Summary": "Senores Pharmaceuticals' EGM on January 31, 2026 approved issuance of 11,70,000 convertible equity warrants to promoter group via preferential allotment with 96.45% votes in favor.",
            "Sentiment": "positive",
            "PublishDate": 1769876457268,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senores Pharma Q3FY26 Results Show Strong Growth",
            "Summary": "Senores Pharmaceuticals delivers robust Q3FY26 performance with 64% revenue growth to INR175 crores and 86% EBITDA growth to INR54 crores, driven by regulated markets expansion and emerging market improvements.",
            "Sentiment": "positive",
            "PublishDate": 1769519930751,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senores Pharma Q3FY26 IPO Proceeds Report Filed",
            "Summary": "Senores Pharmaceuticals submitted monitoring agency report for Q3FY26 showing ₹362.12 cr utilized from ₹500 cr IPO proceeds with minor delays in two objectives completed in Q1FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1768904222261,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senores Pharmaceuticals Q3 Net Profit Jumps 86%",
            "Summary": "Senores Pharmaceuticals reported consolidated net profit of ₹317 million in Q3, marking an 86% year-on-year growth from ₹170 million in the corresponding quarter of previous year.",
            "Sentiment": "positive",
            "PublishDate": 1768896574477,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senores Pharma Board Approves ₹950 Cr Warrant Issue",
            "Summary": "Senores Pharmaceuticals board approves issuance of 11.70 lakh convertible equity warrants at ₹812 per unit, totaling ₹950.04 crores to promoter group, with EGM scheduled for January 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1767790845302,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senores Pharmaceuticals Gets ₹24.84L GST Demand",
            "Summary": "Senores Pharmaceuticals receives GST demand order of ₹24.84 lakhs plus equal penalty from Central GST Authority for alleged non-reversal of excess Input Tax Credit and non-payment of IGST.",
            "Sentiment": "negative",
            "PublishDate": 1767015022277,
            "Source": "stocks"
        },
        {
            "Title": "Senores Pharma Grants ₹15 Cr Loan to Apnar Pharma",
            "Summary": "Senores Pharmaceuticals enters into loan agreement with Apnar Pharma Private Limited for inter-corporate loan of up to ₹15 crores at 10% interest rate, with ₹1 crore already disbursed.",
            "Sentiment": "neutral",
            "PublishDate": 1766223075820,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senores Pharma New Plant to Add ₹100-120Cr Revenue",
            "Summary": "Senores Pharmaceuticals management projects new plant will generate ₹100-120 crores revenue with 30% EBITDA margins in first operational year during FY26-27.",
            "Sentiment": "positive",
            "PublishDate": 1765864798646,
            "Source": "stocks"
        },
        {
            "Title": "Senores Pharma Completes 75% Stake Acquisition",
            "Summary": "Senores Pharmaceuticals completes first tranche acquisition of 75% stake in Apnar Pharma for ₹11.46 crores on January 16, 2026, with remaining 25% expected by Q2 FY2027.",
            "Sentiment": "positive",
            "PublishDate": 1765808753027,
            "Source": "co_actions_results"
        },
        {
            "Title": "Senores Pharma Launches Deferiprone Tablets in US",
            "Summary": "Senores Pharmaceuticals announces FDA approval and launch of Deferiprone Tablets USP 500mg/1000mg, bioequivalent to Ferriprox, to be marketed by Dr. Reddy's in the US market worth $70 million.",
            "Sentiment": "positive",
            "PublishDate": 1765469383365,
            "Source": "stocks"
        },
        {
            "Title": "Senores Pharmaceuticals Receives Philippine FDA Approval for 10 Products Across Multiple Therapeutic Areas",
            "Summary": "Senores Pharmaceuticals Limited received marketing authorizations from the Philippine FDA for 10 products spanning cardiovascular, CNS, and pain management therapies as part of its Southeast Asia expansion strategy. The approvals provide access to a market valued at US$23 million for these particular drugs, strengthening the company's position in the Asia-Pacific region.",
            "Sentiment": "positive",
            "PublishDate": 1764928342285,
            "Source": "stock"
        },
        {
            "Title": "Senores Pharmaceuticals Promoter Group Pledges 4 Lakh Shares to Bajaj Finance",
            "Summary": "Renosen Pharmaceuticals Private Limited, a promoter group entity of Senores Pharmaceuticals Limited, pledged 4,00,000 equity shares (0.87% of total share capital) to Bajaj Finance Limited on December 03, 2025. The pledge was created as collateral for a loan taken by the company, with the disclosure made to BSE and NSE under SAST regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1764911398713,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals Reports 61% Revenue Growth in Q2 FY26, Maintains 50% Annual Growth Guidance",
            "Summary": "Senores Pharmaceuticals delivered strong quarterly results with consolidated income of INR 162 crores in Q2 FY26, representing 61% year-over-year growth. EBITDA reached INR 50 crores with margins improving to 31%, up 750 basis points year-over-year. The company's regulated markets segment drove growth with 87% increase, while the product portfolio expanded to 81 products with 8 new launches during the quarter. Operating cash flow improved significantly to INR 31 crores in H1 FY26 compared to INR 9 crores in the previous year. Management confirmed guidance of at least 50% top-line growth and 100% PAT growth for FY26. The company expects third manufacturing line at its US facility to be operational in Q3 FY26, expanding capacity from 1.2 billion to 2 billion units. Emerging markets business turned cash flow positive despite slower growth due to dollar appreciation and geopolitical issues affecting commercialization timelines.",
            "Sentiment": "positive",
            "PublishDate": 1763013426790,
            "Source": "earnings"
        },
        {
            "Title": "Senores Pharmaceuticals Reports No Deviation in IPO Fund Utilization for September Quarter",
            "Summary": "Senores Pharmaceuticals Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing utilization of Rs. 309.07 crore out of Rs. 500 crore raised through its IPO. CARE Ratings Limited, the monitoring agency, reported no deviation from stated objectives. The company completed repayment of certain borrowings totaling Rs. 93.30 crore during the quarter. Key utilizations included Rs. 3.67 crore for Atlanta facility setup, Rs. 39.61 crore for working capital requirements, and Rs. 45.36 crore for subsidiary investments. The company maintains Rs. 190.93 crore in unutilized proceeds, primarily deployed in fixed deposits with HDFC Bank and ICICI Bank. Some delays were noted in implementation timelines, with management committee approvals granted for extensions. The report was reviewed by the Audit Committee and approved by the Board on November 6, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762460331461,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals Reports Strong Q2 Performance with 61% Revenue Growth and Senior Management Appointment",
            "Summary": "Senores Pharmaceuticals Limited announced its quarterly results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue of Rs. 162 crores for Q2, representing 61% year-on-year growth, with profit after tax of Rs. 30 crores showing 131% year-on-year increase. For the half year, consolidated revenue reached Rs. 300 crores with 66% growth and profit after tax of Rs. 51 crores with 114% growth. The regulated markets segment delivered 87% year-on-year growth in Q2, while the branded generics business witnessed significant growth with revenues growing more than tenfold year-on-year. The company generated Rs. 31.4 crores in operating cash flow for the half year. Additionally, the board approved the appointment of Mr. Manohar Lalge as President-Research and Development and categorized him as Senior Management Personnel effective November 6, 2025. Mr. Lalge brings over 25 years of experience in pharmaceutical formulation development.",
            "Sentiment": "positive",
            "PublishDate": 1762457791484,
            "Source": "earnings"
        },
        {
            "Title": "Senores Pharmaceuticals Reports 60% Revenue Growth in Q2",
            "Summary": "Senores Pharmaceuticals reported quarterly revenue of 1.6 billion rupees compared to 1 billion rupees in the same period last year, representing a year-over-year increase of 60%.",
            "Sentiment": "positive",
            "PublishDate": 1762419378778,
            "Source": "earnings"
        },
        {
            "Title": "Senores Pharmaceuticals Reports Strong Q2 Performance with Net Profit Rising to 330M Rupees",
            "Summary": "Senores Pharmaceuticals delivered strong quarterly results with consolidated net profit increasing to 330 million rupees compared to 130 million rupees in the same period last year. The company's EBITDA grew to 465 million rupees from 227 million rupees year-over-year. EBITDA margin improved to 30.33% versus 23.14% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762418149431,
            "Source": "earnings"
        },
        {
            "Title": "Senores Pharmaceuticals' US Subsidiary Receives FDA Inspection Report After Resolving Minor Observations",
            "Summary": "Senores Pharmaceuticals Limited announced that its material subsidiary Havix Group Inc. (Aavis Pharmaceuticals) has received an Establishment Inspection Report (EIR) from the US FDA on November 4, 2025. The FDA had conducted an inspection of Havix's manufacturing facility in Hoschton, Georgia from July 21-25, 2025, which resulted in 3 minor observations under Form 483. Havix has addressed and resolved all the observations identified during the inspection.",
            "Sentiment": "positive",
            "PublishDate": 1762366320974,
            "Source": "stock"
        },
        {
            "Title": "Senores Pharmaceuticals Forms U.S. Subsidiary and Acquires Majority Stake in Zoraya Pharmaceuticals",
            "Summary": "Senores Pharmaceuticals has established a step-down subsidiary in the United States and acquired a 51% stake in Zoraya Pharmaceuticals LLC, a Delaware-based company. This move represents the company's expansion into the U.S. market through strategic acquisition and subsidiary formation.",
            "Sentiment": "positive",
            "PublishDate": 1762349838887,
            "Source": "order&deals"
        },
        {
            "Title": "Senores Pharmaceuticals Invests $2M in US Subsidiary",
            "Summary": "Senores Pharmaceuticals has invested $2 million in its wholly owned US subsidiary, Senores Pharmaceuticals Inc. The investment represents the company's capital allocation to its American operations.",
            "Sentiment": "positive",
            "PublishDate": 1758192468263,
            "Source": "stock"
        },
        {
            "Title": "Senores Pharmaceuticals Completes Acquisition of 8,454 Equity Shares in Havix Group Inc.",
            "Summary": "Senores Pharmaceuticals Limited has completed its acquisition of 8,454 equity shares of Havix Group Inc. D/B/A Aavis Pharmaceuticals. The company had previously acquired 7,914 shares directly, while the remaining 540 shares were acquired through its wholly owned US subsidiary, Senores Pharmaceuticals Inc. The acquisition of the final 540 shares through the subsidiary was necessary due to certain regulatory approval requirements from the Reserve Bank of India. The transaction, which began with earlier intimations in March 2025, is now fully completed.",
            "Sentiment": "positive",
            "PublishDate": 1757679819184,
            "Source": "order&deals"
        },
        {
            "Title": "Senores Pharmaceuticals Acquires Two USFDA-Approved ANDAs from Teva Pharmaceuticals USA",
            "Summary": "Senores Pharmaceuticals Limited, through its wholly-owned subsidiary Senores Pharmaceuticals Inc. USA, has signed an agreement to acquire two USFDA-approved Abbreviated New Drug Applications (ANDAs) from Teva Pharmaceuticals USA Inc. The addressable opportunity of the acquired ANDAs in the USA is approximately USD 38 million according to IQVIA data and USD 120 million according to Symphony data. The acquisition will be funded through proceeds from the company's Initial Public Offer, aligning with the stated IPO objectives. Senores Pharmaceuticals operates as a global research-driven pharmaceutical company with manufacturing facilities in Atlanta, US and Chhatral, India, maintaining a current portfolio of 70 ANDA and 27 CMO/CDMO commercial products permitted for US distribution.",
            "Sentiment": "positive",
            "PublishDate": 1755013385824,
            "Source": "order&deals"
        },
        {
            "Title": "Senores Pharmaceuticals Reports 72% Revenue Growth in Q1FY26, Achieves Positive Operating Cash Flow",
            "Summary": "Senores Pharmaceuticals delivered strong quarterly results with consolidated revenue growing 72% year-on-year to INR 138 crores. EBITDA increased 60% to INR 34 crores with a margin of 24.8%, while profit after tax surged 95% to INR 21 crores. The company achieved positive operating cash flow of INR 11 crores. Regulated markets revenue grew 69% year-on-year to INR 90 crores, aided by CDMO-CMO segment contributions. The company received USFDA approval for 4 products, bringing total approved products to 70, and commercially launched 2 new products. Management maintains guidance of 50% revenue growth and 100% PAT growth for FY26. The company is expanding US manufacturing capacity from 1.2 billion to 2 billion units with third and fourth production lines expected by Q3FY26 and end of FY26 respectively. Emerging markets revenue grew 32% to INR 29 crores with improved realization increasing from INR 1.2-1.3 per unit to INR 1.8 per unit. The domestic branded generics business reached INR 8 crores, growing over 4x year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1753875020988,
            "Source": "earnings"
        },
        {
            "Title": "Havix Completes USFDA Inspection with 3 Minor Observations",
            "Summary": "Havix has completed a USFDA inspection and received 3 observations related to minor issues. The company has 15 days to respond to these observations from the regulatory authority.",
            "Sentiment": "neutral",
            "PublishDate": 1753698550503,
            "Source": "stock"
        },
        {
            "Title": "Senores Pharmaceuticals Reports 72% Revenue Growth in Q1FY26 with Strong Performance Across Segments",
            "Summary": "Senores Pharmaceuticals Limited reported strong quarterly results with total income rising 72% year-over-year to Rs. 138 crores. EBITDA increased 60% to Rs. 34.2 crores while profit after tax surged 95% to Rs. 21.2 crores. The company achieved positive operating cash flow of Rs. 11 crores and increased its stake in subsidiary Havix to 73% from 66.6% in December 2024. Regulated Markets contributed 65% of total revenue at Rs. 90.1 crores, up 69% year-over-year. The Branded Generics business showed exceptional growth of 358% to Rs. 8.2 crores. The company received ANDA approval for 4 products, commercialized 2 products, and launched 5 new products during the quarter. Senores operates across 40+ countries with 308 approved products in emerging markets and 70 approved ANDA products in regulated markets. The company maintains manufacturing facilities in Atlanta, US and Ahmedabad, India, serving both regulated and emerging markets.",
            "Sentiment": "positive",
            "PublishDate": 1753282999187,
            "Source": "earnings"
        },
        {
            "Title": "Senores Pharmaceuticals Reports Strong Q1 FY26 Results with 72% Revenue Growth and Key Leadership Appointment",
            "Summary": "Senores Pharmaceuticals Limited announced its quarterly results for the quarter ended June 30, 2025, showing consolidated total income of Rs 138 crores, representing 72% year-on-year growth. The company reported EBITDA of Rs 34 crores (60% Y-o-Y growth) and profit after tax of Rs 21 crores (95% Y-o-Y growth). Regulated Markets revenue reached Rs 90 crores with 69% Y-o-Y growth, while Emerging Markets revenue stood at Rs 29 crores with 32% Y-o-Y growth. The company launched 2 ANDA products and received approval for 4 products during the quarter. Additionally, the board appointed Mr. Jignesh Shashikant Desai as President-Finance and categorized him as Senior Management Personnel effective July 23, 2025. The company reported positive operating cash flow of Rs 11 crores for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753277228192,
            "Source": "earnings"
        },
        {
            "Title": "SenoRes Pharma Poised for Government Contracts",
            "Summary": "According to NDTV Profit, SenoRes Pharma is reportedly in a position to secure multiple government contracts. The news suggests a positive development for the company's business prospects.",
            "Sentiment": "positive",
            "PublishDate": 1749200070000,
            "Source": "default"
        },
        {
            "Title": "Senores Pharmaceuticals Acquires ANDA for Enalapril Maleate Tablets",
            "Summary": "Senores Pharmaceuticals has acquired the Abbreviated New Drug Application (ANDA) for Enalapril Maleate Tablets in strengths of 2.5mg, 5mg, 10mg, and 20mg from Wockhardt. The market size for Enalapril tablets in the USA was reported to be approximately USD 28.60 million (MAT December 2024) according to IQVIA data, and approximately USD 109.24 million (MAT March 2025) as per Symphony, a specialty data aggregator.",
            "Sentiment": "positive",
            "PublishDate": 1747740434000,
            "Source": "default"
        },
        {
            "Title": "Senores Pharma Reports Q4 Financial Results",
            "Summary": "Senores Pharma announced its Q4 financial results. The company's EBITDA decreased to 190 million rupees from 230 million rupees year-over-year. The EBITDA margin fell to 16.67% from 22.55% in the same period last year. However, consolidated net profit increased to 178 million rupees from 159 million rupees year-over-year and 172 million rupees quarter-over-quarter. Revenue for Q4 grew to 1.14 billion rupees from 1.02 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747317444000,
            "Source": "result"
        },
        {
            "Title": "Senores Pharma to Consider Q4 Results on May 15",
            "Summary": "Senores Pharma has announced that it will consider its fourth quarter results on May 15. This is a routine financial reporting event for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1746792610000,
            "Source": "default"
        },
        {
            "Title": "Senores Pharmaceuticals Acquires ANDA for Tramadol Tablets",
            "Summary": "Senores Pharmaceuticals has acquired the Abbreviated New Drug Application (ANDA) for Tramadol Tablets from APDM Pharmaceuticals. This acquisition allows Senores to manufacture and market the generic version of Tramadol, a pain medication, in the United States.",
            "Sentiment": "positive",
            "PublishDate": 1746761362000,
            "Source": "default"
        },
        {
            "Title": "Senores Pharmaceuticals: Acquires USFDA-Approved Epilepsy Drug ANDA from Wockhardt",
            "Summary": "Senores Pharmaceuticals is acquiring the USFDA-approved ANDA for Topiramate tablets from Wockhardt, expanding its U.S. product portfolio. The acquisition, funded by IPO proceeds, includes tablets used for epilepsy and migraine treatment. The U.S. market for Topiramate is valued at about $111.47 million as of December 2024.",
            "Sentiment": "positive",
            "PublishDate": 1746505173000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals Acquires ANDA for Topiramate Tablets",
            "Summary": "Senores Pharmaceuticals has acquired the Abbreviated New Drug Application (ANDA) for Topiramate HCl tablets in 25, 50, 100, and 200 mg strengths. The market size for Topiramate tablets in the USA was approximately USD 111.47 million as of December 2024, according to IQVIA data. The acquisition will be funded using proceeds from Senores Pharmaceuticals' Initial Public Offering (IPO).",
            "Sentiment": "positive",
            "PublishDate": 1746490109000,
            "Source": "default"
        },
        {
            "Title": "Senores Pharmaceuticals Acquires ANDA for Topiramate Tablets",
            "Summary": "Senores Pharmaceuticals has acquired the Abbreviated New Drug Application (ANDA) for Topiramate HCl tablets in strengths of 25, 50, 100, and 200 mg. The market size for Topiramate tablets in the USA was approximately $111.47 million as of December 2024, according to IQVIA data. The company plans to fund this acquisition using proceeds from their Initial Public Offering (IPO).",
            "Sentiment": "positive",
            "PublishDate": 1746446837000,
            "Source": "default"
        },
        {
            "Title": "Senores Pharmaceuticals to Acquire Stake in Havix Group",
            "Summary": "Senores Pharmaceuticals has announced plans to acquire 8,454 equity shares of Havix Group at a price of USD 160 per share. This acquisition represents a strategic move by Senores Pharmaceuticals to expand its portfolio or market presence.",
            "Sentiment": "neutral",
            "PublishDate": 1741739457000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals to Acquire Equity Shares in Havix Group",
            "Summary": "Senores Pharmaceuticals has announced plans to acquire 8,454 equity shares of Havix Group at a price of USD 160 per share. This acquisition represents a strategic move by Senores Pharmaceuticals to expand its holdings or influence in the Havix Group.",
            "Sentiment": "neutral",
            "PublishDate": 1741694311000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals Announces $421 Million Market Opportunity for Acquired ANDAs in USA",
            "Summary": "Senores Pharmaceuticals has reported that the addressable market opportunity for their recently acquired Abbreviated New Drug Applications (ANDAs) in the United States is approximately $421 million. This suggests a significant potential for the company's expansion in the US pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1741077967000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals Acquires 14 ANDAs from Dr. Reddy's Laboratories",
            "Summary": "Senores Pharmaceuticals has acquired 14 Abbreviated New Drug Applications (ANDAs) from Dr. Reddy's Laboratories. This acquisition likely expands Senores Pharmaceuticals' product portfolio and potential market reach in the pharmaceutical industry.",
            "Sentiment": "positive",
            "PublishDate": 1741077894000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals Launches Second API Manufacturing Facility in Gujarat",
            "Summary": "Senores Pharmaceuticals has announced the commencement of operations at its second Active Pharmaceutical Ingredient (API) manufacturing facility in Gujarat. This expansion marks a significant step in the company's growth strategy and production capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1740615370000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals Launches Second API Manufacturing Facility in Gujarat",
            "Summary": "Senores Pharmaceuticals has announced the commencement of operations at its second Active Pharmaceutical Ingredient (API) manufacturing facility located in Gujarat. This expansion marks a significant step in the company's production capabilities and potential market reach.",
            "Sentiment": "positive",
            "PublishDate": 1740574061000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals Acquires ANDA for Roflumilast Tablets",
            "Summary": "Senores Pharmaceuticals has acquired the Abbreviated New Drug Application (ANDA) for Roflumilast tablets in 250 mcg and 500 mcg strengths. The market size for Roflumilast in the USA was approximately USD 32 million (MAT June 2024) according to IQVIA data, and about USD 46 million (MAT September 2024) as per Symphony, a specialty data aggregator.",
            "Sentiment": "positive",
            "PublishDate": 1740096460000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals Acquires ANDA for Roflumilast Tablets",
            "Summary": "Senores Pharmaceuticals has acquired the Abbreviated New Drug Application (ANDA) for Roflumilast tablets in 250 mcg and 500 mcg strengths. The market size for Roflumilast in the USA was approximately USD 32 million (MAT June 2024) according to IQVIA data, and around USD 46 million (MAT September 2024) based on Symphony, a specialty data aggregator.",
            "Sentiment": "positive",
            "PublishDate": 1740070354000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharma Realigns Go-to-Market Strategy for Emerging Markets",
            "Summary": "Senores Pharma has announced a strategic realignment of its go-to-market models, specifically targeting its emerging markets operations. The company aims to enhance profitability in these regions through this restructuring. This information was shared during an investor presentation, indicating the company's focus on improving its financial performance and operational efficiency in developing markets.",
            "Sentiment": "positive",
            "PublishDate": 1737634718000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharma to Expand API Manufacturing Capacity",
            "Summary": "Senores Pharma has announced plans to set up a greenfield unit to significantly increase its Active Pharmaceutical Ingredient (API) manufacturing capacity. According to the company's investor presentation, the expansion will boost their API production capacity from 25 MTPA (Metric Tonnes Per Annum) to 169 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1737634358000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharma Reports Strong Q3 and 9M FY25 Performance",
            "Summary": "Senores Pharma's Managing Director announced strong performance for the third quarter and nine months of fiscal year 2025. The company attributes its success to its strategy of developing niche products for regulated markets and expanding its CDMO/CMO (Contract Development and Manufacturing Organization/Contract Manufacturing Organization) operations.",
            "Sentiment": "positive",
            "PublishDate": 1737621882000,
            "Source": "earnings"
        },
        {
            "Title": "Senores Pharma Reports Strong Q3 Revenue Growth",
            "Summary": "Senores Pharma announced its third-quarter revenue, which reached 1.03 billion rupees, compared to 787 million rupees in the same period last year. This represents a significant year-over-year increase in the company's revenue performance.",
            "Sentiment": "positive",
            "PublishDate": 1737620474000,
            "Source": "earnings"
        },
        {
            "Title": "Senores Pharmaceuticals Reports Strong Q3 EBITDA Growth",
            "Summary": "Senores Pharmaceuticals has announced its Q3 financial results, showing significant year-over-year improvement. The company's EBITDA increased to 250 million rupees from 142 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 24.27% from 17.97% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737620453000,
            "Source": "earnings"
        },
        {
            "Title": "Senores Pharmaceuticals Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "Senores Pharmaceuticals announced its Q3 consolidated net profit, which has risen to 170 million rupees from 71 million rupees in the same period last year, marking a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1737620390000,
            "Source": "earnings"
        },
        {
            "Title": "Senores Pharma Receives ANDA Approval for Metoprolol Tartrate and Hydrochlorothiazide Tablet",
            "Summary": "Senores Pharma has obtained Abbreviated New Drug Application (ANDA) approval for marketing Metoprolol Tartrate and Hydrochlorothiazide Tablet USP. The annual sales for these products are estimated to be between USD 6 million and USD 10 million respectively.",
            "Sentiment": "positive",
            "PublishDate": 1736474875000,
            "Source": "corporate_action"
        },
        {
            "Title": "Senores Pharmaceuticals: Strong Market Debut and US Expansion Plans",
            "Summary": "Senores Pharmaceuticals made a successful stock market debut with shares listing at a 53.45% premium on NSE. The company plans to use IPO proceeds to set up a manufacturing facility in Atlanta and expand its CDMO/CMO business in the US. With 51 products awaiting approval, Senores aims to drive growth in the US market over the next two years.",
            "Sentiment": "positive",
            "PublishDate": 1735623647000,
            "Source": "normal_news"
        }
    ]
}