{
    "Symbol": "SEPC",
    "ISIN": "INE964H01014",
    "News": [
        {
            "Title": "SEPC Wins ₹314 Crore Smart Metering Project in Punjab",
            "Summary": "SEPC Limited receives Letter of Intent from TCIL for ₹313.96 crore smart prepaid metering project in Punjab under RDSS scheme, to be executed on DBFOOT basis in consortium with Adya Smart Metering.",
            "Sentiment": "positive",
            "PublishDate": 1770700061034,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEPC Limited Reports Strong Q3 FY26 Financial Results",
            "Summary": "SEPC Limited announced Q3 FY26 results with consolidated revenue of ₹34,206.71 lakhs and net profit of ₹1,495.96 lakhs. Nine-month revenue reached ₹79,688.64 lakhs with profit of ₹3,980.50 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770486248557,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEPC Board Meet on Feb 2 for Issue Object Variation",
            "Summary": "SEPC Limited has scheduled a board meeting on February 02, 2026, to consider variation in objects of the issue mentioned in Letter of Offer dated May 22, 2025, subject to shareholder approval via special resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1769615356226,
            "Source": "stocks"
        },
        {
            "Title": "India's Services Exports Set to Overtake Goods in 2 Years",
            "Summary": "Services exports growing at 12-13% annually could surpass merchandise exports within 18-24 months. SEPC seeks ₹45,000-50,000 crore duty remission framework to boost competitiveness.",
            "Sentiment": "positive",
            "PublishDate": 1768412200736,
            "Source": "stocks"
        },
        {
            "Title": "SEPC Ltd Wins ₹230 Crore Turnkey Mining Project",
            "Summary": "SEPC Ltd secures major ₹230 crore order from MOIL Limited for turnkey project involving design and construction of 3rd vertical shaft at Chikla Mine, strengthening company's mining infrastructure portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1766980506253,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEPC Wins ₹270 Cr Railway Infrastructure Order",
            "Summary": "SEPC Limited secures major purchase order worth ₹269.69 crores from Vishnu Prakash R Punglia Limited for railway infrastructure project under Ajmer-Chanderiya Doubling Project of North Western Railway.",
            "Sentiment": "positive",
            "PublishDate": 1765857964421,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEPC Wins ₹270 Crore Contract Order",
            "Summary": "SEPC Limited secures significant new order worth ₹270.00 crores, marking a major business development for the infrastructure company.",
            "Sentiment": "positive",
            "PublishDate": 1765857705518,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEPC Secures ₹3,300 Cr Mining Project with Strong H1 FY26",
            "Summary": "SEPC Limited executed MOU for ₹3,300 crore Rampur Batura coal mining project with JARPL-AT Consortium. Company reported strong H1 FY26 performance with ₹455 cr revenue and ₹24.85 cr net profit.",
            "Sentiment": "positive",
            "PublishDate": 1765773720955,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEPC JV Wins ₹86 Cr Bihta Airport Project",
            "Summary": "SEPC Limited announces joint venture success in securing major aviation infrastructure contract worth ₹86 crores at Bihta Airport, Patna, marking significant business development.",
            "Sentiment": "positive",
            "PublishDate": 1765375174431,
            "Source": "co_actions_results"
        },
        {
            "Title": "SEPC Limited Settles Arbitration with Hindustan Copper Limited for Rs 30.44 Crore",
            "Summary": "SEPC Limited executed a settlement deed with Hindustan Copper Limited to resolve inter-se claims and counterclaims in arbitration proceedings Case No. AP No. 163 of 2023. Under the settlement terms, SEPC will receive Rs 30.44 crore and obtain a supplementary work order worth Rs 72.55 crore for existing vertical shaft sinking work.",
            "Sentiment": "positive",
            "PublishDate": 1765341048654,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC-Led Joint Venture Secures Rs 86 Crore Aviation Infrastructure Contract at Bihta Airport",
            "Summary": "SEPC announced that its joint venture has won an aviation infrastructure project worth Rs 86 crore at Bihta Airport in Patna. The contract award represents a significant business development for the company and its JV partners in the aviation infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1765322836828,
            "Source": "stock"
        },
        {
            "Title": "Sepc Secures AED 35 Million UAE Energy Infrastructure Contract",
            "Summary": "Sepc has won a AED 35 million (approximately ₹85 crore) subcontract for energy infrastructure enhancement in the UAE, involving installation of ESD system, nitrogen generation unit, and PAGA system on Mubarazz Island. The agreement extends until December 2026, positioning the company for multi-year revenue generation in the Middle East energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1764301219218,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC Limited Reports No Deviations in Rs 350 Crore Rights Issue Fund Utilization",
            "Summary": "SEPC Limited confirmed no deviations in utilization of proceeds from its Rs 350 crore rights issue, with Rs 175 crore received and funds deployed for working capital, debt repayment and corporate purposes as planned. The monitoring agency Infomerics Valuation and Rating Limited validated the proper fund deployment for the quarter ended September 30, 2025, with audit committee and board approval.",
            "Sentiment": "positive",
            "PublishDate": 1763147901043,
            "Source": "corporate_action"
        },
        {
            "Title": "SEPC Limited Shareholders Approve Re-designation of Whole-Time Director as Managing Director",
            "Summary": "SEPC Limited shareholders approved the re-designation of Mr. Venkataramani Jaiganesh from Whole-Time Director to Managing Director through postal ballot voting that concluded on November 12, 2025. The resolution was passed with requisite majority, with 27 members participating in the e-voting process that ran from October 14 to November 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763142579611,
            "Source": "corporate_action"
        },
        {
            "Title": "SEPC Limited Reports Q2 FY26 Results with Qualified Auditor Opinion on Key Assets",
            "Summary": "SEPC Limited announced unaudited financial results for the quarter and half-year ended September 30, 2025, showing consolidated profit after tax of Rs 829.82 lakhs for Q2 and Rs 2,484.54 lakhs for H1. The auditors issued a qualified opinion citing concerns over Rs 29,036.46 lakhs deferred tax assets and overdue contract assets/trade receivables totaling Rs 7,454.62 lakhs from stalled projects.",
            "Sentiment": "positive",
            "PublishDate": 1763138446750,
            "Source": "earnings"
        },
        {
            "Title": "SEPC Limited Converts 30.07 Crore Partly Paid-up Shares to Fully Paid-up Status",
            "Summary": "SEPC Limited received call money payments for 30.07 crore partly paid-up equity shares out of 35 crore shares for which First and Final Call Notices were sent. The Rights Issue Committee approved converting these 30.07 crore shares into fully paid-up equity shares upon receipt of the final call money of ₹5 per share. The company had set September 30, 2025 as the record date and the call period ran from October 24 to November 7, 2025. The committee also approved issuing reminder call letters to provide a second opportunity for shareholders who missed the payment window for their partly paid-up shares that were allotted on June 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762991108497,
            "Source": "corporate_action"
        },
        {
            "Title": "SEPC Secures Orders Worth ₹550.62 Crore in H1 FY2025",
            "Summary": "SEPC has secured orders totaling ₹550.62 crore during H1 FY2025. The orders include ₹442.8 crore for an irrigation project, ₹75.19 crore from Geos Solutions, and an international order worth AED 13.5 million from Avenir International.",
            "Sentiment": "positive",
            "PublishDate": 1762228461746,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC Limited Issues First and Final Call Notice for Rights Issue Shares",
            "Summary": "SEPC Limited has issued a First and Final Call Notice requiring shareholders to pay ₹5 per partly paid-up equity share by November 7, 2025. The company originally issued rights shares at ₹10 per share in an 11:50 ratio through a Letter of Offer dated May 22, 2025, with shareholders initially paying ₹5 and the remaining ₹5 now due. The record date for eligible shareholders is September 30, 2025. Trading of the partly paid-up shares has been suspended from September 30, 2025. Payment can be made through ASBA (online or physical) or 3-in-1 trading accounts. Failure to pay the call money may result in forfeiture of shares, including amounts already paid. The company allows partial payments, which will be converted proportionally to fully paid shares. Cash payments are not accepted, and all payments must be made from the shareholder's own bank account.",
            "Sentiment": "neutral",
            "PublishDate": 1760437232132,
            "Source": "corporate_action"
        },
        {
            "Title": "SEPC Limited Seeks Shareholder Approval for Managing Director Re-designation Through Postal Ballot",
            "Summary": "SEPC Limited has initiated a postal ballot process to seek shareholder approval for the re-designation of Mr. Venkataramani Jaiganesh as Managing Director. The Board of Directors approved his re-designation from Whole-Time Director to Managing Director for a five-year term effective September 29, 2025, subject to shareholder approval. The postal ballot notice was sent electronically to registered shareholders on October 10, 2025. The e-voting period runs from October 14, 2025 at 9:00 AM IST to November 12, 2025 at 5:00 PM IST. CDSL will provide the remote e-voting facility, and M/s. Alagar & Associates LLP has been appointed as the scrutinizer for the postal ballot process. Only shareholders holding shares as of the cut-off date of October 8, 2025 are entitled to vote, with voting rights proportional to their paid-up equity share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1760101171167,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEPC Limited Appoints New Whole-Time Director and Secretarial Auditor at 25th AGM",
            "Summary": "SEPC Limited shareholders approved key appointments at their 25th Annual General Meeting held on September 29, 2025. Mr. Venkataramani Jaiganesh was appointed as Director and Whole-Time Director for a five-year term from July 14, 2025 to July 13, 2030. Jaiganesh is a Chartered Accountant with a Postgraduate Diploma in International Business and brings 20 years of experience across trading, manufacturing, services, investments, EPC, and Oil & Gas sectors, including international market expansion in USA, Qatar, Oman, and Saudi Arabia. Additionally, shareholders appointed SJN & Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to 2029-30. The firm specializes in secretarial audits, SEBI regulations, capital market services, and complex regulatory matters. Both appointees are not related to any existing directors of the company.",
            "Sentiment": "positive",
            "PublishDate": 1759245950316,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEPC Limited Secures AED 13.5 Million Engineering Services Contract from Abu Dhabi Firm",
            "Summary": "SEPC Limited has been awarded a work order worth AED 13,500,000 (approximately ₹32.63 crore) from Avenir International Engineers and Consultants LLC, Abu Dhabi. The contract involves providing engineering services for various ADNOC projects through a sub-contract arrangement. This is an international contract with an international entity, and the schedule and timelines will be provided by the counterparty. The company confirmed that promoters and group companies have no interest in the awarding entity, and the contract does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1759116937172,
            "Source": "stock"
        },
        {
            "Title": "SEPC Limited Secures Rs. 75.19 Crore Construction Materials Supply Order",
            "Summary": "SEPC Limited received a purchase order worth Rs. 75.19 crore from Gefos Solutions Private Limited for supplying construction materials for four infrastructure projects involving residential buildings. The domestic contract is to be executed within 8 to 9 months. The order involves supply and delivery of construction materials and does not constitute a related party transaction.",
            "Sentiment": "positive",
            "PublishDate": 1758684967927,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC Limited's Managing Director N K Suryanarayanan Completes Tenure, Transitions to Non-Executive Director",
            "Summary": "SEPC Limited announced that N K Suryanarayanan's tenure as Managing Director and CEO ended on September 23, 2025. He will continue serving the company as a Non-Executive Director starting September 24, 2025. The company confirmed that Suryanarayanan is not debarred from holding directorship positions by SEBI or any other authority. The transition represents a completion of his executive tenure rather than a resignation or removal.",
            "Sentiment": "neutral",
            "PublishDate": 1758634659996,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEPC Limited Secures ₹443 Crore Irrigation Project Order in Bihar",
            "Summary": "SEPC Limited has won a major irrigation project contract valued at ₹442.8 crore from the Chief Engineer, Irrigation, Generation, Water Resources Department in Dehri, Bihar. The project involves executing the 'Jamaniyan to Kakrait Gangajal Lift Irrigation Scheme' in Kaimur district under the Pragati Yatra initiative, with a 24-month execution timeline. The water supply and irrigation scheme aims to improve agricultural water availability and support farmers in the region. Whole Time Director Venkataramani Jaiganesh emphasized the project's significance for rural development and SEPC's strengthened position in water infrastructure. SEPC Limited is an EPC company operating across water, roads, industrial infrastructure, and mining sectors. In FY25, the company reported standalone revenue of ₹597.65 crore, EBITDA of ₹98.94 crore, and net profit of ₹24.84 crore.",
            "Sentiment": "positive",
            "PublishDate": 1758514554964,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC Limited Secures Rs. 4,428 Million Irrigation Project Contract",
            "Summary": "SEPC Limited has been awarded a Work Allocation Order for the Jamaniyan to Kakrait Gangajal Uvah Irrigation Scheme by the Generation, Water Resources Department, Delhi. The contract is valued at Rs. 4,427.99 million and involves a water supply scheme under the Pragati Yatra project in Kaimur district's Zamanian Pump Canal Division, Mohania. The project has a 24-month execution timeline and is classified as a domestic contract with no related party transactions involved.",
            "Sentiment": "positive",
            "PublishDate": 1758167730349,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC Reports No Financial Impact from Enforceable Foreign Arbitral Award Due to Indemnification",
            "Summary": "The Supreme Court has ruled that a foreign arbitral award against SEPC is enforceable in India. However, SEPC states that this ruling will have no financial impact on the company due to indemnification arrangements.",
            "Sentiment": "neutral",
            "PublishDate": 1756382667328,
            "Source": "stock"
        },
        {
            "Title": "SEPC Limited Reports 105% Jump in Net Profit to ₹17 Cr in Q1 FY26",
            "Summary": "SEPC Limited announced its Q1 FY26 results showing net profit surge of 104.8% to ₹16.5 crore compared to ₹8.1 crore in Q1 FY25. Total income grew 14.4% to ₹203.8 crore while EBITDA increased 11.9% to ₹29.8 crore. The company raised ₹350 crore through a rights issue of 3.5 crore partly paid-up shares at ₹10 each. SEPC secured multiple contracts including ₹18 crore operation and maintenance services for power plants in Uttar Pradesh, a USD 8.9 million international contract through its UAE subsidiary for steel tank construction in Fujairah, and a ₹650 crore solar EPC project for 133 MW capacity across Maharashtra. The Engineering, Procurement, and Construction company operates across Water & Municipal Services, Roads, Industrial Infrastructure, and Mining sectors.",
            "Sentiment": "positive",
            "PublishDate": 1755488809124,
            "Source": "earnings"
        },
        {
            "Title": "SEPC Limited Reports Strong Q1 Performance with 61% Revenue Growth and Key Leadership Changes",
            "Summary": "SEPC Limited announced quarterly results for the period ended June 30, 2025, showing consolidated revenue from operations of Rs 20,379.45 lakhs, representing significant growth from Rs 12,611.41 lakhs in the previous quarter and Rs 17,820.70 lakhs in the same quarter last year. The company reported consolidated profit after tax of Rs 1,654.72 lakhs compared to Rs 1,002.44 lakhs in the previous quarter and Rs 807.97 lakhs in the corresponding quarter of the previous year. Standalone revenue reached Rs 8,055.90 lakhs with profit after tax of Rs 685.99 lakhs. The board designated Mr. Venkataramani Jaiganesh, a Chartered Accountant with 20 years of experience across international markets including USA, Qatar, Oman, and Saudi Arabia, as Key Managerial Personnel. The company also appointed M/s SJN & Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to 2029-30, subject to shareholder approval. During the quarter, SEPC allotted 35 crore equity shares of Rs 10 each aggregating to Rs 35,000 lakhs to eligible shareholders on a rights basis. The company operates in the Engineering, Procurement and Construction (EPC) sector and has accumulated losses of Rs 2,09,178.77 lakhs as of June 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755184457693,
            "Source": "earnings"
        },
        {
            "Title": "SEPC Reports Strong Q1 Performance with Net Profit Doubling Year-over-Year",
            "Summary": "SEPC delivered robust quarterly results with consolidated net profit surging to 165 million rupees from 81 million rupees in the same period last year. Revenue grew to 2.02 billion rupees compared to 1.76 billion rupees year-over-year. The company's EBITDA increased to 282 million rupees from 242 million rupees, while EBITDA margin improved slightly to 13.96% from 13.77% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755181635679,
            "Source": "earnings"
        },
        {
            "Title": "SEPC Limited Updates on Supreme Court Order for Rs 39.5 Crore Disbursement",
            "Summary": "SEPC Limited received a Supreme Court order dated August 1, 2025, regarding a case involving GPE (India) Limited and Twarit Consultancy Services Private Limited. The Supreme Court had previously directed the respondents to deposit Rs 29.50 crore with interest to the court registry. Twarit Consultancy had already deposited Rs 31 crore in earlier payments and submitted additional demand drafts totaling Rs 8.50 crore on August 1, 2025. The Supreme Court accepted these payments and ordered the registry to disburse the total amount of Rs 39.50 crore along with accrued interest to GPE (India) Limited. SEPC Limited stated there would be no financial impact on the company as it is fully indemnified under an agreement dated September 29, 2015, with Twarit Consultancy Services Private Limited and Shri Housing Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754313971673,
            "Source": "stock"
        },
        {
            "Title": "SEPC Receives LOA for 133 MW Solar Power Project in Maharashtra",
            "Summary": "SEPC has received a Letter of Award (LOA) from Parmeshi Urja Ltd, Kolkata, for the Engineering, Procurement, and Construction (EPC) of a 133 MW AC Solar Power Project. The project will be spread across 26 locations in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1749687238000,
            "Source": "default"
        },
        {
            "Title": "SEPC Ltd: Secures ₹650 Crore EPC Order for Maharashtra Solar Project",
            "Summary": "SEPC Ltd received a Letter of Award worth ₹650 crore from Parmeshi Urja Ltd for EPC of a 133 MW solar power project across 26 locations in Maharashtra. The project spans four districts, with execution timelines to be finalized at kick-off meetings.",
            "Sentiment": "positive",
            "PublishDate": 1749638816000,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC Wins 133 MW Solar Power Project in Maharashtra",
            "Summary": "SEPC has received a Letter of Award from Parmeshi Urja Ltd, Kolkata, for the Engineering, Procurement, and Construction of a 133 MW AC Solar Power project. The project will be spread across 26 sites in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1749637414000,
            "Source": "default"
        },
        {
            "Title": "SEPC Reports Improved Q4 Financial Results",
            "Summary": "SEPC has announced its Q4 financial results. The company's EBITDA increased to 153 million rupees from 69 million rupees year-over-year. The EBITDA margin improved to 12.98% from 4.63% in the same period last year. Consolidated net profit rose to 100 million rupees, up from 67 million rupees year-over-year and 44 million rupees quarter-on-quarter. However, revenue decreased to 1.2 billion rupees from 1.48 billion rupees compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1748527776000,
            "Source": "result"
        },
        {
            "Title": "SEPC Ltd: UAE Subsidiary Secures Rs 75.6-Crore Order, Stock Surges",
            "Summary": "SEPC Ltd's UAE-based subsidiary, SEPC FZE, Sharjah, received an order worth Rs 75.6 crore ($8.9 million) from Lauren Engineers & Constructors INC. The order involves construction, supply, and installation of four 45,000-liter capacity steel tanks, to be completed in 15 months. Following the news, SEPC's share price rose 7.21% to Rs 15.31.",
            "Sentiment": "positive",
            "PublishDate": 1748412012000,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC Secures $8.9 Million Order for Steel Tank Construction",
            "Summary": "SEPC has won an order for the construction, supply, and installation of four units of 45,000-liter capacity steel tanks. The total value of the order is USD 8.9 million, which is equivalent to approximately Rs 756 million.",
            "Sentiment": "positive",
            "PublishDate": 1748407590000,
            "Source": "default"
        },
        {
            "Title": "SEPC Secures 180 Million Rupee Order",
            "Summary": "SEPC (likely Shriram EPC Limited) has won a new order valued at 180 million rupees. This represents a significant business development for the company, potentially boosting its revenue and order book.",
            "Sentiment": "positive",
            "PublishDate": 1747282278000,
            "Source": "default"
        },
        {
            "Title": "SEPC Ltd Receives Final Acceptance Certificates from SAIL Durgapur Steel Plant",
            "Summary": "SEPC Ltd has obtained Final Acceptance Certificates from Steel Authority of India Limited (SAIL), Durgapur Steel Plant for a project worth ₹39 crore. This signifies the successful completion and acceptance of SEPC's work by the client.",
            "Sentiment": "positive",
            "PublishDate": 1743048957000,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC: Secures ₹2,200 Crore Saudi Infrastructure Deal",
            "Summary": "SEPC has signed a framework agreement with ROSHN Group Company for infrastructure projects in Saudi Arabia, valued at ₹2,200 crore. The company has submitted a bid for projects in Jeddah North, Phase 1A, with an estimated value of SAR 893 million.",
            "Sentiment": "positive",
            "PublishDate": 1741846001000,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC Signs Framework Agreement with Saudi Arabia's ROSHN Group for Infrastructure Projects",
            "Summary": "SEPC has executed a framework agreement with ROSHN Group Company in Riyadh, Saudi Arabia, to undertake infrastructure works. The company has bid for projects in three zones of Jeddah North, Phase 1A, with an approximate value of 2200 crore rupees. SEPC's current market capitalization is 2100 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1741753429000,
            "Source": "order&deals"
        },
        {
            "Title": "SEPC Reports Significant Profit Growth in Q3",
            "Summary": "SEPC has reported a substantial increase in its Profit Before Tax (PBT) for the third quarter. The company's PBT rose to 195 million rupees, compared to 55 million rupees in the same period last year. This represents a year-over-year growth of over 250%. Additionally, SEPC reported an exceptional item of 139 million rupees, which contributed to the improved financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1739454636000,
            "Source": "earnings"
        },
        {
            "Title": "SEPC Reports Improved Q3 EBITDA Performance",
            "Summary": "SEPC has reported a significant improvement in its Q3 EBITDA performance. The company achieved an EBITDA gain of 34 million rupees, compared to a loss of 19 million rupees in the same quarter of the previous year. Additionally, SEPC's Q3 EBITDA margin stood at 2.56%.",
            "Sentiment": "positive",
            "PublishDate": 1739454632000,
            "Source": "earnings"
        },
        {
            "Title": "SEPC Reports Decline in Q3 Financial Performance",
            "Summary": "SEPC has announced its Q3 financial results, showing a decrease in both net profit and revenue compared to the same period last year. The company's consolidated net profit for Q3 fell to 44 million rupees from 55 million rupees year-over-year. Similarly, revenue declined to 1.33 billion rupees from 1.41 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1739454626000,
            "Source": "earnings"
        },
        {
            "Title": "SEPC to Raise Funds Up to 3.5 Billion Rupees",
            "Summary": "SEPC (likely referring to SEPC Limited, formerly known as Shriram EPC Limited) has announced plans to raise funds up to 3.5 billion Indian rupees. This fundraising initiative suggests the company is seeking to bolster its financial position, potentially for expansion, debt reduction, or other strategic purposes.",
            "Sentiment": "positive",
            "PublishDate": 1731595322000,
            "Source": "corporate_action"
        },
        {
            "Title": "SEPC Reports Q2 Financial Results",
            "Summary": "SEPC announced its Q2 financial results. The consolidated net profit decreased to 23 million rupees, down from 57 million rupees year-over-year and 81 million rupees quarter-over-quarter. However, the company's revenue increased to 1.7 billion rupees from 1.29 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731585156000,
            "Source": "result"
        },
        {
            "Title": "SEPC Board to Consider Rights Issue",
            "Summary": "SEPC has announced a board meeting scheduled for November 14 to consider issuing shares to existing shareholders on a rights basis.",
            "Sentiment": "neutral",
            "PublishDate": 1731324434000,
            "Source": "corporate_action"
        }
    ]
}