{
    "Symbol": "SERVOTECH",
    "ISIN": "INE782X01033",
    "News": [
        {
            "Title": "Servotech Power incorporates CSR subsidiary",
            "Summary": "Servotech Renewable Power incorporates Servotech Foundation as wholly owned subsidiary for CSR activities. Stock down 61% from recent highs despite new product launches in EV segment.",
            "Sentiment": "neutral",
            "PublishDate": 1768913958638,
            "Source": "stocks"
        },
        {
            "Title": "Servotech Enters E-Three Wheeler Battery Market",
            "Summary": "Servotech Renewable Power expands product portfolio with lithium-ion batteries and chargers for electric three-wheeler segment, marking strategic diversification.",
            "Sentiment": "positive",
            "PublishDate": 1767600635980,
            "Source": "stocks"
        },
        {
            "Title": "Servotech Renewable Power System Receives Patent for EV Charging Conversion Technology",
            "Summary": "Servotech Renewable Power System has been granted a patent for CCS2 to GBT EV charging conversion technology that addresses compatibility issues in electric vehicle charging infrastructure. The innovation enables GBT-based vehicles to charge seamlessly using CCS2 DC fast chargers, potentially expanding charging accessibility for different EV standards.",
            "Sentiment": "positive",
            "PublishDate": 1764046363084,
            "Source": "stock"
        },
        {
            "Title": "Servotech Renewable Power System Secures ₹16.31 Crore Solar Power Plant Order from Railway Energy Management Company",
            "Summary": "Servotech Renewable Power System received a ₹16.31 crore order from Railway Energy Management Company Ltd for solar power plants with a 12-month completion timeline. The contract represents a significant business win for the renewable energy company in the railway sector infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1763709725482,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Renewable Power System Secures ₹73.70 Crore Solar Contract from NREDCAP",
            "Summary": "Servotech Renewable Power System has won a ₹73.70 crore contract from NREDCAP for rooftop solar plant installations. The company has committed to complete the project within a 6-month timeline.",
            "Sentiment": "positive",
            "PublishDate": 1763544895363,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Renewable Power System Establishes Dubai Subsidiary for UAE EV Charging and Solar Market Entry",
            "Summary": "Servotech Renewable Power System has formed a new subsidiary in Dubai to enter the UAE's electric vehicle charging and solar markets. The company aims to support the UAE's 2050 net-zero emissions target through this expansion.",
            "Sentiment": "positive",
            "PublishDate": 1760422335750,
            "Source": "stock"
        },
        {
            "Title": "Servotech Renewable Power System Secures 2.58MW Solar Rooftop Contract from South Eastern Railway",
            "Summary": "Servotech Renewable Power System has secured a contract from South Eastern Railway for a 2.58MW solar rooftop project in the Ranchi Division. The project is scheduled to be completed within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1760329506826,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Renewable Power Wins ₹13 Crore Solar Contract from Northern Central Railway",
            "Summary": "Servotech Renewable Power has secured a ₹13 crore contract from Northern Central Railway's Agra Division for a 3MWP solar rooftop project. The contract represents a significant business development for the renewable energy company in the railway infrastructure sector.",
            "Sentiment": "positive",
            "PublishDate": 1759120916892,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Renewable Power System Wins ₹57.55 Crore Solar Contract from Northern Railway",
            "Summary": "Servotech Renewable Power System has secured a ₹57.55 crore contract for a 1.2 MW rooftop solar project from Northern Railway's Moradabad Division. The project is expected to be completed within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1758000173467,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Renewable Power System Partners with Enovra Energy Solutions for Mauritius Expansion",
            "Summary": "Servotech Renewable Power System has signed an agreement with Enovra Energy Solutions Ltd. to expand solar and EV charger operations in Mauritius. The deal provides the company with exclusive rights in the region and guarantees long-term business stability for its renewable energy and electric vehicle charging infrastructure business.",
            "Sentiment": "positive",
            "PublishDate": 1757911148170,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Renewable Power System Subsidiary Acquires Hertz and Pixelz",
            "Summary": "Servotech Renewable Power System announced that its subsidiary has signed an agreement to acquire Hertz and Pixelz. The deal represents an expansion move for the renewable energy company through its subsidiary operations.",
            "Sentiment": "positive",
            "PublishDate": 1757496429340,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Renewable Power System Partners With Zhuhai Piwin New Energy For Battery Storage Systems In India",
            "Summary": "Servotech Renewable Power System has formed an exclusive partnership with Zhuhai Piwin New Energy Co., Ltd. The partnership aims to enhance technology support and enable local production of advanced battery energy storage systems in India.",
            "Sentiment": "positive",
            "PublishDate": 1757304883627,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Renewable Power System Forms Joint Venture With Bekem Infra Projects",
            "Summary": "Servotech Renewable Power System has established a joint venture with Bekem Infra Projects focused on renewable energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1756456295161,
            "Source": "stock"
        },
        {
            "Title": "Servotech Renewable Power Secures ₹288.4 Million Order",
            "Summary": "Servotech Renewable Power has secured a new order worth ₹288.4 million. The company operates in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1755613297102,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Renewable Power System Reports Growth in Q1 Results",
            "Summary": "Servotech Renewable Power System reported consolidated net profit of 52 million rupees compared to 45 million rupees in the same period last year. The company's revenue increased to 1.4 billion rupees from 1.12 billion rupees year-over-year for the first quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753886279362,
            "Source": "earnings"
        },
        {
            "Title": "Servotech Renewable to Install EV Chargers at Bengaluru Airport",
            "Summary": "Servotech Renewable will install 10 electric vehicle chargers for airside operations at Bengaluru Airport. This initiative aims to support electric vehicle infrastructure at the airport.",
            "Sentiment": "positive",
            "PublishDate": 1751287742000,
            "Source": "default"
        },
        {
            "Title": "Servotech Renewable Power System Secures 600 Million Rupee Order",
            "Summary": "Servotech Renewable Power System has obtained an order valued at 600 million rupees. The news briefly mentions this significant business development without providing additional details about the nature of the order or its impact on the company.",
            "Sentiment": "positive",
            "PublishDate": 1750766035000,
            "Source": "default"
        },
        {
            "Title": "Servotech Renewable Power System Acquires 27% Stake in Rhine Solar Ltd.",
            "Summary": "Servotech Renewable Power System has acquired a 27% stake in Rhine Solar Ltd. This acquisition is aimed at strengthening Servotech's solar manufacturing capabilities. The move suggests a strategic expansion in the renewable energy sector, particularly in solar power technology.",
            "Sentiment": "positive",
            "PublishDate": 1750420667000,
            "Source": "default"
        },
        {
            "Title": "Servotech Renewable Power System Secures 336 Million Rupee Solar Project Order",
            "Summary": "Servotech Renewable Power System has received an order worth 336 million rupees for a grid-connected solar rooftop project. The news indicates a significant business development for the company in the renewable energy sector.",
            "Sentiment": "positive",
            "PublishDate": 1748995715000,
            "Source": "default"
        },
        {
            "Title": "Servotech Renewable Power System Secures 336 Million Rupees Solar Project Order",
            "Summary": "Servotech Renewable Power System has announced securing an order worth 336 million rupees for a grid-connected solar rooftop project. This project demonstrates the company's dedication to renewable energy solutions and is expected to expand its market presence.",
            "Sentiment": "positive",
            "PublishDate": 1748956412000,
            "Source": "default"
        },
        {
            "Title": "Servotech Renewable Power Engages Errol Musk as Strategic Advisor",
            "Summary": "Servotech Renewable Power has appointed Errol Musk to its Global Advisory Board as a strategic advisor. Mr. Musk will assess the company's manufacturing and operational facilities to understand Servotech's capabilities and support its global growth strategy.",
            "Sentiment": "positive",
            "PublishDate": 1746418068000,
            "Source": "default"
        },
        {
            "Title": "Servotech Renewable Power System: Subsidiary Incorporation Boosts Stock",
            "Summary": "Servotech Renewable Power System has incorporated Dream League of India as a wholly-owned subsidiary of Servotech Sports and Entertainment Private Limited. The new entity will focus on sports and entertainment businesses. The company also secured a 4.1 MW solar project worth ₹15.8 crore from East Coast Railway. The board will meet on May 6, 2025, to consider financial results and dividend payment.",
            "Sentiment": "positive",
            "PublishDate": 1745837667000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Secures 4.1 MW Solar Project from East Coast Railway",
            "Summary": "Servotech Renewable Power System has been awarded a contract for a 4.1 MW on-grid rooftop solar project by the Waltair Division of East Coast Railway in Visakhapatnam, Andhra Pradesh. The project is valued at 158.9 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745453439000,
            "Source": "default"
        },
        {
            "Title": "Servotech Renewable Power Systems: Secures 4.1 MW Solar Project from Indian Railways",
            "Summary": "Servotech Renewable Power System Ltd. has won a ₹15.8 crore contract for a 4.1 MW on-grid rooftop solar project from the Waltair Division of East Coast Railway. The project involves design, manufacturing, supply, installation, testing, and commissioning of solar PV plants across multiple sites in Visakhapatnam, Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1745423611000,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Secures 4.1 MW Solar Project from East Coast Railway",
            "Summary": "Servotech Renewable Power System has been awarded a contract for a 4.1 MW on-grid rooftop solar project by the Waltair Division of East Coast Railway in Visakhapatnam, Andhra Pradesh. The project is valued at 158.9 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1745413002000,
            "Source": "default"
        },
        {
            "Title": "Servotech Renewable Power System: Secures 20-Year Patent for Energy-Saving Technology",
            "Summary": "Servotech Renewable Power System has been granted a 20-year patent for its 'System and Method for Peak Shaving' technology. The innovation aims to reduce peak electricity demand, improve energy efficiency, and lower costs. The company's Q3 FY2025 results showed a significant increase in net profit and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1743150875000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Power Systems Granted Patent for Peak Shaving Technology",
            "Summary": "Servotech Power Systems has announced that it has been granted a patent for its 'breakthrough peak shaving technology'. This technology is likely aimed at managing electricity demand during peak usage periods, potentially offering significant benefits in energy management and cost reduction for users.",
            "Sentiment": "positive",
            "PublishDate": 1743075757000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Power Systems and CIMSME Partner to Boost Solar Home Initiative",
            "Summary": "Servotech Renewable Power System has signed a Memorandum of Understanding (MoU) with the Chamber of Indian Micro, Small & Medium Enterprises (CIMSME) to develop a user-friendly mobile application. This collaboration aims to accelerate the goal of establishing 100,000 solar homes by 2026 under the PM Surya Ghar Yojana initiative.",
            "Sentiment": "positive",
            "PublishDate": 1740657230000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Renewable Power System: Shares Jump 5% on EV Charger Deal",
            "Summary": "Servotech Renewable Power System Ltd shares rose 5.4% from intraday lows after announcing an agreement with France's Watt & Well to develop and manufacture EV charger components in India. The partnership will initially focus on creating a 30kW power module for the Indian EV charging market.",
            "Sentiment": "positive",
            "PublishDate": 1740035787000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Power Systems Signs Agreement with Watt & Well for EV Charger Components",
            "Summary": "Servotech Renewable Power System has entered into an agreement with France-based company Watt & Well to develop and manufacture electric vehicle (EV) charger components in India. This collaboration aims to boost the production of EV charging infrastructure components domestically.",
            "Sentiment": "positive",
            "PublishDate": 1739971601000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Power Systems: Q3 Profit Soars 617% YoY, Revenue Up 316%",
            "Summary": "Servotech Power Systems reported Q3 FY25 results with profit at ₹7.96 crore, up 617.12% YoY. Revenue increased 315.88% YoY to ₹216.3 crore. EPS rose to ₹0.36, a 620% YoY increase. However, profit decreased 29.62% QoQ despite 8.33% revenue growth from the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737609447000,
            "Source": "earnings"
        },
        {
            "Title": "Servotech Power Systems: Promoter Stake Increase and Q3 Profit Surge",
            "Summary": "Servotech Power Systems' promoter Raman Bhatia converted 5 lakh share warrants into equity shares worth ₹3.12 crore. The company reported a 619% increase in Q3 net profit to ₹7.98 crore, with revenue rising 315% to ₹216.29 crore. The company's paid-up capital increased to ₹22.46 crore following the warrant conversion.",
            "Sentiment": "positive",
            "PublishDate": 1737471259000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Power Secures Large Order for Grid-Connected Agriculture Pumps",
            "Summary": "Servotech Power Systems Limited has received an order for approximately 1,100 grid-connected agriculture pumps from UPNEDA (Uttar Pradesh New and Renewable Energy Development Agency) under the KUSUM Component C-1 scheme. This order is part of India's efforts to promote solar energy use in agriculture.",
            "Sentiment": "positive",
            "PublishDate": 1735537911000,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Power Systems Changes Company Name",
            "Summary": "Servotech Power Systems Limited has officially changed its name to Servotech Renewable Power System Limited. This name change likely reflects a shift in the company's focus or strategy, potentially towards renewable energy systems.",
            "Sentiment": "neutral",
            "PublishDate": 1734514483000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Power Systems Ltd: Secures Partnership for Solar EV Charging in Germany",
            "Summary": "Servotech Power Systems Ltd partners with LESSzwei GmbH to develop solar-powered EV charging infrastructure for micromobility in Germany. The project, named 'EnerMAAS', is grant-financed by BMWK for 2.7 years. Servotech will manufacture and supply 100 charging systems for 50 German cities, while LESSzwei handles AI and application components.",
            "Sentiment": "positive",
            "PublishDate": 1733727739000,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Power Partners with Lesszwei GmbH for Solar-Powered EV Charging in Germany",
            "Summary": "Servotech Power Systems Limited has announced a partnership with Lesszwei GmbH to develop 100% solar-powered electric vehicle (EV) charging infrastructure for micromobility in Germany. This collaboration aims to create sustainable charging solutions for small electric vehicles, potentially advancing eco-friendly transportation options in the European market.",
            "Sentiment": "positive",
            "PublishDate": 1733724068000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Power Systems: Secures 5.6 MW Rooftop Solar Order in Uttarakhand",
            "Summary": "Servotech Power Systems has won a 5.6 MW on-grid rooftop solar power plant order from Uttarakhand New and Renewable Energy Development Agency, valued at Rs 30.2 crore. The company will design, supply, install, and commission solar installations across various government buildings in Uttarakhand, with a 5-year warranty maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1732795863000,
            "Source": "order&deals"
        },
        {
            "Title": "Servotech Power Systems: EV Stock Surges 5%, Up 146% from 52-Week Low",
            "Summary": "Servotech Power Systems stock hit 5% upper circuit at Rs 179.56, gaining 145.97% from its 52-week low. Q2 FY25 results show 131% revenue growth to Rs 20,006.93 lakhs, 223% EBITDA increase, and 260% PAT growth. FII stake increased from 5.53% to 5.95% in Q2. Company launched new solar products aligned with government initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1732000213000,
            "Source": "normal_news"
        },
        {
            "Title": "Servotech Power Systems: Secures 2 MW Solar Project from UP Government",
            "Summary": "Servotech Power Systems Ltd has been awarded a 2 MW on-grid solar project by UPNEDA in Uttar Pradesh. The company will design, supply, install, test, and commission solar power plants at 67 locations, with a 5-year warranty maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1731399771000,
            "Source": "normal_news"
        },
        {
            "Title": "Servotech Power Systems Reports Strong Q2 EBITDA Growth",
            "Summary": "Servotech Power Systems has reported a significant increase in its Q2 EBITDA, rising to 189 million rupees from 53.1 million rupees in the same quarter last year. The company's EBITDA margin also improved, increasing to 9.46% from 6.18% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730134111000,
            "Source": "result"
        },
        {
            "Title": "Servotech Power Systems: Q2 Net Profit Soars to Rs 11.24 Crore",
            "Summary": "Servotech Power Systems reported a consolidated net profit of Rs 11.24 crore for Q2, more than tripling from Rs 3.12 crore year-over-year. H1 net profit doubled to Rs 15.73 crore. Total income more than doubled to Rs 200.06 crore. The company launched new energy solutions including solar inverters and battery storage systems.",
            "Sentiment": "positive",
            "PublishDate": 1730126162000,
            "Source": "result"
        },
        {
            "Title": "Servotech Power Systems: Stock Hits Upper Circuit Ahead of Q2 Results, Launches New Solar Products",
            "Summary": "Servotech Power Systems' stock hit the upper circuit limit of 5% on NSE, reaching ₹168.17. The company is expected to announce Q2 results today. Over the weekend, Servotech launched a new range of solar products, including on-grid inverters, hybrid inverters, and battery storage systems, aligned with government schemes.",
            "Sentiment": "positive",
            "PublishDate": 1730100808000,
            "Source": "normal_news"
        },
        {
            "Title": "Servotech Power Systems: Launches New Solar Solutions Aligned with Government Schemes",
            "Summary": "Servotech Power Systems introduced a new line of solar products including on-grid inverters, hybrid inverters, micro inverters, battery storage systems, and solar pump controllers. These products align with government initiatives like PM Surya Ghar Muft Bijli Yojana and PM-KUSUM Scheme. The company recently signed a distribution deal to expand its EV charger network in the UK and North America.",
            "Sentiment": "positive",
            "PublishDate": 1730090706000,
            "Source": "normal_news"
        },
        {
            "Title": "Servotech Power Systems: Expands EV Charger Business to UK and North America",
            "Summary": "Servotech Power Systems Ltd. has signed a sole distribution agreement with UK-based Ensmart Power to expand their EV charger distribution network in the UK and North America. The partnership aims to leverage the growing adoption of electric vehicles in these regions. Servotech will also supply and install 29 additional EV charging stations for the Nashik Municipal Corporation.",
            "Sentiment": "positive",
            "PublishDate": 1729137658000,
            "Source": "normal_news"
        },
        {
            "Title": "Servotech Power Systems Partners with UK's Ensmart Power for EV Charger Expansion",
            "Summary": "Servotech Power Systems has formed a collaboration with UK-based Ensmart Power to expand its electric vehicle (EV) charger business in the United Kingdom and potentially other markets. This partnership aims to enhance Servotech's presence in the growing EV infrastructure sector internationally.",
            "Sentiment": "positive",
            "PublishDate": 1729077886000,
            "Source": "corporate_action"
        },
        {
            "Title": "Servotech Power: Secures Additional EV Charging Station Order in Maharashtra",
            "Summary": "<p><span class='positive'>Servotech Power Systems</span> has received an <b>order</b> to set up <span class='positive'>9 additional EV charging stations</span> in <b>Maharashtra</b> from <span class='neutral'>Nashik Municipal Corporation</span>, bringing their total to <span class='positive'>29 stations</span> in the area.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728316005000,
            "Source": "normal_news"
        },
        {
            "Title": "Servotech Power Systems Secures Additional EV Charging Station Order",
            "Summary": "<p><span class=\"positive\">Servotech Power Systems</span> has received an <b>additional order</b> from <span class=\"neutral\">Nashik Municipal Corporation</span> to construct <span class=\"positive\">20 electric vehicle (EV) charging stations</span>. This development indicates an <span class=\"positive\">expansion of EV infrastructure</span> in Nashik and potentially reflects <span class=\"positive\">growing demand</span> for EV charging facilities.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728294715000,
            "Source": "corporate_action"
        }
    ]
}