{
    "Symbol": "SESHAPAPER",
    "ISIN": "INE630A01024",
    "News": [
        {
            "Title": "Seshasayee Paper seeks shareholder nod for key appointments",
            "Summary": "Seshasayee Paper and Boards Limited seeks shareholder approval through postal ballot for re-appointing N Gopalaratnam as Chairman for three years and appointing Anurag Mishra as Nominee Director.",
            "Sentiment": "neutral",
            "PublishDate": 1770622954225,
            "Source": "stocks"
        },
        {
            "Title": "Seshasayee Paper Appoints New Director",
            "Summary": "Seshasayee Paper and Boards Limited appoints Sri Anurag Mishra as Additional Director and re-appoints Sri N Gopalaratnam as Chairman, both subject to shareholder approval via postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1769850029153,
            "Source": "stocks"
        },
        {
            "Title": "Seshasayee Paper Q3 FY26 Results Show Mixed Performance",
            "Summary": "Seshasayee Paper and Boards reported Q3 FY26 standalone net profit of ₹15.53 crores vs ₹15.81 crores in Q3 FY25. Revenue declined to ₹386.81 crores from ₹431.27 crores YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1769849493594,
            "Source": "co_actions_results"
        },
        {
            "Title": "Seshasayee Paper Board Meeting Set for Jan 31, 2026",
            "Summary": "Seshasayee Paper and Boards Limited has scheduled a board meeting on January 31, 2026, to consider and approve Q3FY26 standalone and consolidated unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768392253183,
            "Source": "co_actions_results"
        },
        {
            "Title": "Seshasayee Paper Board Meeting Set for Jan 31, 2026",
            "Summary": "Seshasayee Paper and Boards Limited has scheduled a board meeting on January 31, 2026, to consider and approve Q3FY26 standalone and consolidated unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768392173125,
            "Source": "co_actions_results"
        },
        {
            "Title": "Seshasayee Paper Wins GST Appeal, Demand Cut 98%",
            "Summary": "Seshasayee Paper And Boards successfully appeals GST demand, reducing liability from ₹712.24 lakhs to just ₹16.00 lakhs, achieving significant tax relief for the company.",
            "Sentiment": "positive",
            "PublishDate": 1768207583016,
            "Source": "stocks"
        },
        {
            "Title": "Seshasayee Paper Gets Relief in GST Appeal Case",
            "Summary": "Seshasayee Paper and Boards Limited receives favorable ruling in GST appeal with demand reduced from ₹712.24 lakhs to ₹16.00 lakhs. Commissioner (Appeals) rules materially in company's favor.",
            "Sentiment": "positive",
            "PublishDate": 1768207558512,
            "Source": "stocks"
        },
        {
            "Title": "Dhanashree Investments Acquires 0.015% Stake in Seshasayee",
            "Summary": "Dhanashree Investments Private Limited acquired 9,276 equity shares of Seshasayee Paper & Boards through open market purchases on December 12, 2025, increasing its shareholding to 4.74%.",
            "Sentiment": "neutral",
            "PublishDate": 1765518923764,
            "Source": "co_actions_results"
        },
        {
            "Title": "Time Square Investments Acquires Additional Stake in Seshasayee Paper and Boards",
            "Summary": "Time Square Investments Private Limited acquired 55,000 equity shares of Seshasayee Paper and Boards Limited through open market purchases at Rs. 254.06 per share on November 14, 2025. The acquisition increased Time Square's shareholding from 10.128% to 10.215% in the paper manufacturing company, with the transaction disclosed under SEBI takeover regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763121350519,
            "Source": "corporate_action"
        },
        {
            "Title": "Seshasayee Paper Reports 28% Decline in Q2 Revenue to ₹346 Crores",
            "Summary": "Seshasayee Paper and Boards Limited reported revenue from operations of ₹346.25 crores for the quarter ended September 30, 2025, compared to ₹398.40 crores in the same period last year. Net profit after tax decreased to ₹17.80 crores from ₹24.78 crores year-over-year. For the six-month period, revenue declined to ₹731.58 crores from ₹820.56 crores, while net profit dropped to ₹34.86 crores from ₹63.12 crores. The company invested ₹26 crores in Navia One Power Private Limited to acquire a 26.1% stake for developing solar and wind power capacity. Basic earnings per share for the quarter stood at ₹2.96 compared to ₹4.11 in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761381766753,
            "Source": "earnings"
        },
        {
            "Title": "Seshsayee Paper and Boards Gets Environmental Clearance for 20% Expansion at Erode Plant",
            "Summary": "Seshsayee Paper and Boards has received environmental clearance to expand its facility at the Erode plant by 20%. The clearance enables the company to proceed with the expansion of its manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1754120205478,
            "Source": "stock"
        },
        {
            "Title": "Seshasayee Paper and Boards Appoints Two Nominee Directors Through Postal Ballot",
            "Summary": "Seshasayee Paper and Boards Limited shareholders approved the appointment of two nominee directors through postal ballot on July 25, 2025. Sri Kumar Jayant, IAS, was appointed as nominee director not liable to retire by rotation, while Sri Ashish Kumar Srivastava, IFS, was appointed as nominee director liable to retire by rotation. Both resolutions were passed with overwhelming majority, receiving 99.95% votes in favor. The e-voting process was conducted through NSDL from June 25 to July 24, 2025. Sri Kumar Jayant serves as Chairman and Managing Director of The Tamilnadu Industrial Investment Corporation Limited, while Sri Ashish Kumar Srivastava is Special Secretary (Forests) in the Environment, Climate Change and Forests Department, Government of Tamilnadu. The company has 22,850 shareholders as of the cut-off date of June 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753428088769,
            "Source": "corporate_action"
        },
        {
            "Title": "Seshasayee Paper and Boards Reports Q1 FY2026 Results with Net Profit of ₹17.06 Crores",
            "Summary": "Seshasayee Paper and Boards Limited announced its quarterly results for the quarter ended June 30, 2025. The company recorded total income from operations of ₹399.69 crores on standalone basis and ₹398.96 crores on consolidated basis. Net profit after tax stood at ₹17.06 crores for standalone operations and ₹15.43 crores on consolidated basis. The company's earnings per share was ₹2.83 on both basic and diluted basis. Paper remains the only reportable business segment for the company. The results were approved by the Board of Directors on July 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753181972895,
            "Source": "earnings"
        },
        {
            "Title": "Seshasayee Paper and Boards Reports Promoter Group Changes Following Managing Director's Death",
            "Summary": "Seshasayee Paper and Boards Limited announced changes in its promoter group classification following the death of Managing Director K S Kasi Viswanathan on March 08, 2025. His 2,910 shares were transmitted to his legal heir Mrs Rajam Kasi Viswanathan, who previously held 500 shares classified under 'Relative of promoters'. Mrs Rajam Kasi Viswanathan, now holding 3,410 shares total, has been reclassified as part of the promoter group. The deceased Managing Director's name was automatically excluded from the promoter group list upon his demise.",
            "Sentiment": "neutral",
            "PublishDate": 1753158149205,
            "Source": "corporate_governance"
        },
        {
            "Title": "Seshasayee Paper And Boards Reports Decline in Q1 Financial Performance",
            "Summary": "Seshasayee Paper And Boards reported quarterly results showing a decline across key financial metrics. Net profit fell to 171 million rupees from 383 million rupees in the same period last year. Revenue decreased to 3.85 billion rupees compared to 4.2 billion rupees previously. EBITDA dropped to 220 million rupees from 490 million rupees, while EBITDA margin contracted to 5.71% from 11.61% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1753057219912,
            "Source": "earnings"
        },
        {
            "Title": "Seshasayee Paper and Boards Reports Decline in Q1 Financial Performance",
            "Summary": "Seshasayee Paper and Boards reported weaker quarterly results with EBITDA falling to 220 million rupees from 490 million rupees year-over-year. The company's EBITDA margin compressed to 5.71% compared to 11.61% in the same period last year. Net profit decreased to 171 million rupees from 383 million rupees year-over-year, while revenue declined to 3.85 billion rupees from 4.2 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1752914291281,
            "Source": "earnings"
        },
        {
            "Title": "Seshasayee Paper And Boards to Review Q1 Results on July 19",
            "Summary": "Seshasayee Paper And Boards has announced that it will review its Q1 results on July 19. The company has scheduled a meeting to discuss and potentially approve the financial results for the first quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751890060000,
            "Source": "default"
        },
        {
            "Title": "Seshasayee Paper and Boards Declares Dividend",
            "Summary": "Seshasayee Paper and Boards has announced a dividend of 2.5 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746875962000,
            "Source": "result"
        },
        {
            "Title": "Seshasayee Paper and Boards Reports Significant Drop in Q4 EBITDA",
            "Summary": "Seshasayee Paper and Boards experienced a substantial decline in its Q4 EBITDA, which fell to 250 million rupees from 690 million rupees year-over-year. The company's EBITDA margin also decreased significantly, dropping to 4.98% from 12.80% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1746875864000,
            "Source": "result"
        },
        {
            "Title": "Seshasayee Paper and Boards Reports Q4 Financial Results",
            "Summary": "Seshasayee Paper and Boards announced its Q4 financial results. The company's net profit decreased to 256 million rupees, down from 532 million rupees year-over-year and 158 million rupees quarter-over-quarter. Revenue for Q4 was 5 billion rupees, compared to 5.4 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1746875646000,
            "Source": "result"
        },
        {
            "Title": "Seshasayee Paper to Acquire Stake in Wind-Solar Hybrid Power Project",
            "Summary": "Seshasayee Paper plans to acquire up to 26.1% equity stake in a Special Purpose Vehicle (SPV) that will develop a 39 MWp wind-solar hybrid power facility in Tamil Nadu. The project will consist of 33 MWp (DC) / 22 MW (AC) of solar capacity and 6 MW of wind capacity. The company will invest up to ₹16.56 crore for this acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1745599719000,
            "Source": "default"
        },
        {
            "Title": "Seshasayee Paper & Boards Reports Q3 Financial Results",
            "Summary": "Seshasayee Paper & Boards has announced its Q3 consolidated financial results. The company reported a net profit of 166.3 million rupees, which is a significant decrease from 690 million rupees in the same quarter last year. Revenue for Q3 stood at 4.31 billion rupees, down from 4.7 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1737333546000,
            "Source": "earnings"
        },
        {
            "Title": "Seshasayee Paper & Boards Reports Significant Drop in Q3 EBITDA",
            "Summary": "Seshasayee Paper & Boards experienced a substantial decline in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 76.4 million rupees from 876.7 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased significantly from 18.52% to 1.77% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1737128962000,
            "Source": "earnings"
        },
        {
            "Title": "Seshasayee Paper & Boards Reports Q3 Revenue Decline",
            "Summary": "Seshasayee Paper & Boards has reported a decrease in its third-quarter revenue. The company's Q3 revenue stood at 4.31 billion rupees, compared to 4.7 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737128923000,
            "Source": "earnings"
        },
        {
            "Title": "Seshasayee Paper & Boards Reports Decline in Q3 Net Profit",
            "Summary": "Seshasayee Paper & Boards has reported a significant decrease in its consolidated net profit for the third quarter. The company's net profit fell to 166.3 million rupees, compared to 690 million rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737128915000,
            "Source": "earnings"
        },
        {
            "Title": "Seshasayee Paper Reports Significant Drop in Q2 EBITDA",
            "Summary": "Seshasayee Paper has reported a substantial decrease in its Q2 EBITDA, which fell to 307 million rupees from 894 million rupees year-over-year. The company's EBITDA margin also declined sharply, dropping to 7.72% from 24.70% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729341905000,
            "Source": "result"
        },
        {
            "Title": "Seshasayee Paper Reports Decline in Q2 Net Profit",
            "Summary": "Seshasayee Paper has reported its Q2 financial results. The company's net profit decreased to 248 million rupees from 691 million rupees year-over-year. However, revenue increased to 3.98 billion rupees from 3.62 billion rupees compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729341889000,
            "Source": "result"
        },
        {
            "Title": "Seshasayee Paper and Boards Schedules Q2 Results Meeting",
            "Summary": "<p><span class=\"neutral\">Seshasayee Paper and Boards</span> has announced a <b>board meeting</b> on <span class=\"neutral\">October 19</span> to <span class=\"neutral\">consider and approve</span> the <b>financial results</b> for the <span class=\"neutral\">second quarter</span> of the current <span class=\"neutral\">fiscal year</span>.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728039232000,
            "Source": "corporate_action"
        }
    ]
}