{
    "Symbol": "SETCO",
    "ISIN": "INE878E01021",
    "News": [
        {
            "Title": "Setco Automotive Gets BSE Approval for Debenture Terms",
            "Summary": "Setco Automotive's subsidiary Setco Auto Systems receives BSE in-principle approval to extend non-convertible debenture maturity from December 2025 to January 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767793259013,
            "Source": "stocks"
        },
        {
            "Title": "Setco Automotive Receives Warning Letters from BSE, NSE",
            "Summary": "Setco Automotive Limited received warning letters from BSE and NSE for non-compliance with SEBI regulations regarding Nomination and Remuneration Committee meetings during FY 2024-25.",
            "Sentiment": "negative",
            "PublishDate": 1767790592140,
            "Source": "stocks"
        },
        {
            "Title": "Setco Auto Systems Wins Two Asian Brand Awards for Automotive Manufacturing Excellence",
            "Summary": "Setco Auto Systems received Asia's Leading Brand 2025 and Asia's Most Trusted Brand 2025 awards in automotive manufacturing at the Asian Brand and Leadership Conclave 2025 in Bangkok. The recognition highlights the company's four-decade legacy in manufacturing clutches for Medium and Heavy Commercial Vehicles, reinforcing its position among OEMs, fleet operators, and drivers in the MHCV ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1764076104422,
            "Source": "stock"
        },
        {
            "Title": "Setco Automotive Reports Mixed Results with Standalone Profit but Consolidated Loss",
            "Summary": "Setco Automotive Limited reported standalone profit of Rs 19 lakhs for the quarter ended September 30, 2025, while consolidated operations posted a loss of Rs 4,127 lakhs due to subsidiary performance. The company's subsidiaries face material uncertainty with negative net worth, and non-convertible debentures worth Rs 57,450 lakhs have been extended to December 1, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763113423595,
            "Source": "earnings"
        },
        {
            "Title": "Setco Automotive Reports 7.8% Revenue Growth in Q1 FY26, Launches New Water Pump Product",
            "Summary": "Setco Automotive Limited reported Q1 FY26 revenues of Rs. 178.8 crore, representing 7.8% year-on-year growth from Rs. 165.8 crore in Q1 FY25. EBITDA increased 11.9% to Rs. 21.6 crore compared to Rs. 19.3 crore in the previous year, with EBITDA margin improving to 12.1% from 11.6%. The growth was driven by continued demand for the company's products, higher sales, favorable segment mix, and improved operational efficiencies. The company launched a new Automotive Water Pump for Light Commercial Vehicles and MHCVs, expanding into the engine cooling segment. Additionally, Setco entered suspension solutions for the MHCV segment with the launch of Load Cushion and Torque Rod Bush products. Chairman & MD Harish Sheth highlighted the company's entry into tractor segments and noted gross margins improved to 54%. The company operates 5 manufacturing units with over 100 products and has research facilities in India and the UK.",
            "Sentiment": "positive",
            "PublishDate": 1755017727065,
            "Source": "earnings"
        },
        {
            "Title": "Setco Automotive Reports Mixed Q1 Results, Appoints Auditors for 42nd AGM",
            "Summary": "Setco Automotive Limited's Board approved quarterly results for the quarter ended June 30, 2025. On a standalone basis, the company reported a profit of Rs. 99 lakhs compared to a loss of Rs. 94 lakhs in the previous quarter, with revenue from operations at Rs. 38 lakhs. However, consolidated results showed a loss of Rs. 4,223 lakhs versus Rs. 2,182 lakhs loss in the previous quarter, with consolidated revenue declining to Rs. 17,875 lakhs from Rs. 21,063 lakhs. The Board scheduled the 42nd Annual General Meeting for September 25, 2025, and approved the re-appointment of M/s. Sharp & Tannan Associates as statutory auditors and appointment of M/s. Shravan A. Gupta & Associates as secretarial auditor, both for five-year terms. The company's register of members will remain closed from September 19-25, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754991087458,
            "Source": "earnings"
        },
        {
            "Title": "Setco Automotive Introduces New Suspension Products",
            "Summary": "Setco Automotive has launched new suspension products, including a load cushion and torque rod bush. These components are typically used in vehicle suspension systems to improve ride quality and handling.",
            "Sentiment": "positive",
            "PublishDate": 1750685594000,
            "Source": "default"
        },
        {
            "Title": "Setco Automotive Launches New Automotive Water Pump",
            "Summary": "Setco Automotive has introduced a new automotive water pump as their latest innovation. No further details about the product or its features were provided in the brief news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749101309000,
            "Source": "default"
        },
        {
            "Title": "Setco Automotive Limited: Revenue Grows 9.6% in First Nine Months of FY25",
            "Summary": "Setco Automotive reported consolidated revenue of ₹499.8 crore for the nine months ended December 31, 2024, up 9.6% YoY. Q3 revenue increased 7.4% to ₹177.3 crore. EBITDA for nine months grew 36% to ₹68.6 crore with margins improving to 13.7%. The company attributes performance to robust MHCV demand and operational efficiencies.",
            "Sentiment": "positive",
            "PublishDate": 1739520179000,
            "Source": "earnings"
        },
        {
            "Title": "Setco Automotive Limited: US Flywheel Export Shipment Marks Expansion Milestone",
            "Summary": "Setco Automotive Limited has shipped flywheels and covers to the US market through its subsidiary Lava Cast on December 5th, 2024. The shipment targets leading auto and aftermarket distributors in the United States. The company plans to scale up international operations for clutches, flywheels, and castings, aiming for higher margins in export markets.",
            "Sentiment": "positive",
            "PublishDate": 1733476494000,
            "Source": "normal_news"
        },
        {
            "Title": "Setco Automotive's Unit Lava Cast Exports Flywheels and Covers to USA",
            "Summary": "Setco Automotive's subsidiary, Lava Cast, has successfully shipped flywheels and covers to the United States market. This export achievement marks a significant step for the company in expanding its international presence and tapping into the American automotive components market.",
            "Sentiment": "positive",
            "PublishDate": 1733442781000,
            "Source": "corporate_action"
        },
        {
            "Title": "Setco Automotive's Unit Lava Cast Exports Flywheels and Covers to USA",
            "Summary": "Setco Automotive has announced that its subsidiary, Lava Cast, has successfully exported flywheels and covers to the United States market. This development indicates an expansion of the company's international business operations and potential growth in its export segment.",
            "Sentiment": "positive",
            "PublishDate": 1733405316000,
            "Source": "order&deals"
        }
    ]
}