{
    "Symbol": "SETL",
    "ISIN": "INE0M4D01010",
    "News": [
        {
            "Title": "Standard Engineering Technology Unveils New Corporate Logo",
            "Summary": "Standard Engineering Technology Limited launches new corporate identity effective February 13, 2026, reflecting expanded engineering capabilities beyond core glass lining business.",
            "Sentiment": "positive",
            "PublishDate": 1770908184932,
            "Source": "stocks"
        },
        {
            "Title": "Standard Engineering Technology Q3FY26 Earnings Call",
            "Summary": "Standard Engineering Technology Limited schedules earnings call for February 05, 2026 at 05:00 PM IST to discuss Q3FY26 financial performance and business updates for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769779088388,
            "Source": "co_actions_results"
        },
        {
            "Title": "Standard Glass Lining Tech Promoter Pledges Shares",
            "Summary": "Promoter Ramakrishna Kandula pledged 37.22 lakh equity shares (1.86% stake) of Standard Glass Lining Technology to three financial institutions for personal borrowing needs.",
            "Sentiment": "neutral",
            "PublishDate": 1768385863145,
            "Source": "co_actions_results"
        },
        {
            "Title": "Standard Engineering Tech Receives IT Assessment Order",
            "Summary": "Standard Engineering Technology Limited receives income tax assessment order imposing ₹1.65 crore demand for FY 2019-20, company plans to file appeal maintaining transaction legitimacy.",
            "Sentiment": "negative",
            "PublishDate": 1768306584644,
            "Source": "stocks"
        },
        {
            "Title": "Standard Engineering Technology Promoter Pledges Shares",
            "Summary": "Promoter K.V. Ramani pledged 9,41,124 equity shares (0.44% stake) of Standard Engineering Technology Limited to SMEq India Credit Co. Ltd. for personal borrowing worth ₹10.00 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768280597932,
            "Source": "co_actions_results"
        },
        {
            "Title": "Standard Glass Lining Tech Promoter Pledges Shares",
            "Summary": "Promoter Ramakrishna Kandula pledged 37.22 lakh equity shares (1.86% stake) of Standard Glass Lining Technology to three financial institutions for personal borrowing requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1768280572291,
            "Source": "co_actions_results"
        },
        {
            "Title": "Standard Engineering Tech Promoter Pledges Shares",
            "Summary": "Promoter K.V. Ramani pledged 9,41,124 equity shares (0.44% stake) of Standard Engineering Technology Limited to SMEG India Credit Co. Ltd for personal borrowing purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1768280330972,
            "Source": "stocks"
        },
        {
            "Title": "Standard Engineering Tech Promoter Pledges Shares",
            "Summary": "Ramakrishna Kandula pledges 37.22 lakh equity shares (1.86% stake) to three financial institutions for personal borrowing, creating encumbrance on promoter holding.",
            "Sentiment": "neutral",
            "PublishDate": 1768280053079,
            "Source": "co_actions_results"
        },
        {
            "Title": "Standard Glass Lining Tech Promoters Pledge Shares",
            "Summary": "S2 Engineering Services pledges 1.15 crore equity shares (5.74% stake) in Standard Glass Lining Technology to SMFG India Credit and Tata Capital for personal borrowing worth ₹72.70 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767417359384,
            "Source": "stocks"
        },
        {
            "Title": "Standard Engineering Technology Gets Revised CA Certificate",
            "Summary": "Standard Engineering Technology Limited receives revised CA certificate for name change compliance under SEBI Regulations 30 and 45, completing regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1765802959610,
            "Source": "co_actions_results"
        },
        {
            "Title": "Standard Glass Lining Technology Completes 51% Acquisition of C2C Engineering Private Limited",
            "Summary": "Standard Glass Lining Technology Limited has completed the acquisition of 51% shareholding in C2C Engineering Private Limited after remitting purchase consideration and executing the Shareholders Agreement on November 19, 2025. The acquisition makes C2C Engineering a subsidiary of Standard Glass Lining Technology, with the acquirer holding board control through three director nominations out of five total board positions.",
            "Sentiment": "positive",
            "PublishDate": 1763572398875,
            "Source": "order&deals"
        },
        {
            "Title": "Standard Glass Lining Technology Executes Share Purchase Agreement to Acquire 51% Stake in C2C Engineering",
            "Summary": "Standard Glass Lining Technology Limited executed a share purchase agreement on November 14, 2025, to acquire 51% equity shares in C2C Engineering Private Limited. Upon successful completion of the acquisition, C2C Engineering will become a subsidiary company of Standard Glass Lining Technology.",
            "Sentiment": "positive",
            "PublishDate": 1763144068881,
            "Source": "order&deals"
        },
        {
            "Title": "Standard Glass Lining Technology Seeks Shareholder Approval for ESOP Ratification and Company Name Change",
            "Summary": "Standard Glass Lining Technology Limited has issued a postal ballot notice seeking shareholder approval for ratifying its Employee Stock Option Scheme 2024 covering up to 18,16,345 options and extending benefits to subsidiary and associate company employees. The company also proposes to change its name to Standard Engineering Technology Limited and amend business objects to reflect its expanded operations beyond glass-lining into high-precision engineering and advanced manufacturing solutions.",
            "Sentiment": "positive",
            "PublishDate": 1763112244554,
            "Source": "earnings"
        },
        {
            "Title": "Standard Glass Lining Technology Reports 17.4% Revenue Growth in H1FY26, Announces Strategic Acquisitions",
            "Summary": "Standard Glass Lining Technology Limited reported total income of ₹366.4 crore for H1FY26, marking a 17.4% year-on-year growth from ₹312.1 crore. The company achieved EBITDA of ₹68.7 crore with margins of 18.8%, while net profit increased 14.6% to ₹41.6 crore. For the second quarter, revenue reached ₹188.2 crore with 5.6% sequential growth. The company signed definitive agreements to acquire Scigenics (India) Private Limited for ₹9 crore and entered binding terms to acquire 51% stake in C2C Engineering Private Limited. Export dispatches of ₹40-45 crore were deferred to Q3-Q4FY26. The company received approval for name change to Standard Engineering Technology Limited and plans ₹130 crore capex over the next 2-3 years for facility expansion of 5.5 lakh square feet.",
            "Sentiment": "positive",
            "PublishDate": 1762457754052,
            "Source": "earnings"
        },
        {
            "Title": "Standard Glass Lining Technology Reports No Deviation in IPO Fund Utilization for Q2 FY2026",
            "Summary": "Standard Glass Lining Technology Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from stated IPO objectives. ICRA Limited, serving as the monitoring agency, confirmed that the utilization of issue proceeds remains aligned with the disclosed objects of the IPO issue. The company's IPO, which opened on January 6, 2025 and closed on January 8, 2025, raised INR 410.051 crore with net proceeds of INR 193.425 crore. The funds were allocated across five main objectives: capital expenditure for machinery and equipment (INR 10 crore), debt repayment and subsidiary investment (INR 130 crore), subsidiary capital expenditure funding (INR 30 crore), strategic investments and acquisitions (INR 20 crore), and general corporate purposes (INR 42.240 crore including Pre-IPO placement). The monitoring report indicates proper fund utilization without any material deviations from the original prospectus disclosures.",
            "Sentiment": "positive",
            "PublishDate": 1762370462220,
            "Source": "corporate_action"
        },
        {
            "Title": "Standard Glass Reports Mixed Q2 Results with Revenue Growth but Lower Margins",
            "Summary": "Standard Glass reported Q2 consolidated net profit of 201.8 million rupees, up from 195 million rupees year-over-year. Revenue increased to 1.83 billion rupees from 1.65 billion rupees in the same period last year. However, EBITDA declined to 286.1 million rupees from 338.3 million rupees year-over-year, with EBITDA margin compressing to 15.66% from 20.46% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762336880787,
            "Source": "earnings"
        },
        {
            "Title": "Standard Glass Lining Technology Reports Quarterly Results and Approves Strategic Corporate Changes",
            "Summary": "Standard Glass Lining Technology Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported consolidated revenue of Rs 18,278.41 lakhs for the quarter compared to Rs 16,536.02 lakhs in the previous quarter. Net profit attributable to equity holders was Rs 1,969.52 lakhs for the quarter versus Rs 2,087.30 lakhs previously. The Board also approved several strategic decisions including a proposed company name change, amendments to the Employee Stock Option Scheme 2024, and extension of stock options to subsidiary and associate company employees. Additionally, the company entered into a term sheet on November 3, 2025, for acquiring 51% equity stake in C2C Engineering Private Limited, which provides design and engineering services to pharmaceutical, chemical, and allied industries. The record date for postal ballot voting was set as November 7, 2025. All approvals are subject to member approval through the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1762334532915,
            "Source": "earnings"
        },
        {
            "Title": "Standard Glass Lining Tech to Acquire Majority Stake in C2C Engineering",
            "Summary": "Standard Glass Lining Tech announced it will acquire a 51% stake in C2C Engineering for 122.4 million rupees. This acquisition will give Standard Glass Lining Tech majority control of C2C Engineering.",
            "Sentiment": "positive",
            "PublishDate": 1762180112866,
            "Source": "order&deals"
        },
        {
            "Title": "Standard Glass Lining Technology's Subsidiary Acquires Scigenics India Business for Rs 90 Crore",
            "Summary": "Standard Scigenics Private Limited, a subsidiary of Standard Glass Lining Technology Limited, entered into definitive agreements on October 31, 2025 to acquire the business of Scigenics (India) Private Limited as a going concern on a slump sale basis for Rs 9 crore cash consideration. Scigenics India, incorporated in December 1991 and based in Tamil Nadu, manufactures process equipment and machinery for biotechnology, biologics, chemical, and industrial process industries. The target company has an authorized share capital of Rs 2 crore and paid-up capital of Rs 1.85 crore. The acquisition aims to strengthen Standard Glass Lining's product portfolio and expand its market footprint. The board structure will include 3 directors nominated by Standard Glass Lining and 2 existing directors from the acquired entity. The transaction is not a related party transaction and requires fulfillment of conditions precedent as per the definitive agreements.",
            "Sentiment": "positive",
            "PublishDate": 1761928257725,
            "Source": "order&deals"
        },
        {
            "Title": "Standard Glass Lining Technology Incorporates New Subsidiary Standard Scigenics Private Limited",
            "Summary": "Standard Glass Lining Technology Limited incorporated a new subsidiary named Standard Scigenics Private Limited on September 16, 2025. The subsidiary has an authorized share capital of Rs. 10 lakh and is registered in Hyderabad, Telangana. Standard Glass Lining Technology holds 51% shareholding in the new entity through initial capital subscription in cash. The subsidiary will operate in the manufacturing sector, focusing on designing, developing, assembling, and supplying upstream and downstream process equipment and machinery for biotechnology, biologics, chemical, pharmaceutical, pollution control, and industrial process industries.",
            "Sentiment": "positive",
            "PublishDate": 1758101538937,
            "Source": "corporate_action"
        },
        {
            "Title": "Standard Glass Lining Technology Appoints RPR & Associates as Secretarial Auditors for Five-Year Term",
            "Summary": "Standard Glass Lining Technology Limited shareholders approved the appointment of M/s. RPR & Associates as the company's Secretarial Auditors at the 13th Annual General Meeting held on September 12, 2025. The appointment is for a five-year term from the conclusion of the 13th Annual General Meeting until the conclusion of the 18th Annual General Meeting. RPR & Associates is a practicing company secretaries firm with over 24 years of experience in corporate governance and compliance, specializing in secretarial audits, compliance audits, and due diligence across various sectors including banking, IPOs, and mergers and acquisitions.",
            "Sentiment": "neutral",
            "PublishDate": 1757767593994,
            "Source": "corporate_governance"
        },
        {
            "Title": "Standard Glass Lining Technology Deletes Pre-IPO Provisions from Articles of Association",
            "Summary": "Standard Glass Lining Technology Limited shareholders approved alterations to the company's Articles of Association during the 13th Annual General Meeting held on September 12, 2025. The company deleted Part B entirely, which contained provisions from pre-IPO shareholders' and investors' agreements including board representation, affirmative voting rights, and transfer restrictions. The Board recommended this deletion to align with applicable laws, current governance framework, and business requirements, noting that the pre-IPO agreement ceased to be effective upon the company's listing on BSE and NSE. Shareholders approved the deletion through a special resolution.",
            "Sentiment": "neutral",
            "PublishDate": 1757766544277,
            "Source": "corporate_action"
        },
        {
            "Title": "Standard Glass Lining Technology Reports 23.6% Revenue Growth in Q1 FY26, Launches New Heat Exchanger Product",
            "Summary": "Standard Glass Lining Technology Limited reported total income of INR 178 crores in Q1 FY26, marking a 23.6% year-over-year increase. The company's EBITDA grew 31.9% to INR 35 crores with a margin of 19.5%, while profit after tax increased 37.6% to INR 21 crores. The glass-lined equipment segment showed strong performance, growing from INR 41 crores to INR 67 crores compared to the same quarter last year. The company launched shell and tube glass-lined heat exchangers domestically and received initial orders from key clients. Standard Glass Lining expanded internationally through a partnership with BioCon Solutions for Southeast Asian markets and incorporated a subsidiary in South Carolina, USA. The company plans significant capacity expansion with INR 40-50 crores investment in automation and a new greenfield project requiring INR 150-180 crores. Management guided for 20-25% revenue growth and aims to increase exports from 4% to 12-15% of revenue by year-end. The company holds a 30-35% market share in glass-lining equipment and maintains cash reserves of INR 209 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754746560233,
            "Source": "earnings"
        },
        {
            "Title": "Standard Glass Lining Technology Reports No Deviation in IPO Proceeds Utilization for Q1 FY2026",
            "Summary": "Standard Glass Lining Technology Limited submitted its monitoring agency report for the quarter ended June 30, 2025, showing compliant utilization of IPO proceeds. ICRA Limited, the monitoring agency, reported no deviation from the stated objects of the issue. The company raised INR 410.051 crore through its IPO in January 2025, with net proceeds of INR 193.425 crore. During Q1 FY2026, the company utilized INR 145.079 crore, primarily for debt repayment (INR 130 crore fully completed), capital expenditure (INR 0.704 crore), and subsidiary investment (INR 0.914 crore). Unutilized proceeds of INR 104.916 crore are deployed in fixed deposits with ICICI Bank and HDFC Bank, earning returns between 7.25% to 7.5%. The company's IPO proceeds are allocated across five objects: machinery purchase (INR 10 crore), debt repayment (INR 130 crore), subsidiary investment (INR 30 crore), inorganic growth funding (INR 20 crore), and general corporate purposes (INR 42.240 crore).",
            "Sentiment": "neutral",
            "PublishDate": 1754305955320,
            "Source": "stock"
        },
        {
            "Title": "Standard Glass Lining Technology Reports Strong Q1FY26 Results with 37.6% PAT Growth",
            "Summary": "Standard Glass Lining Technology Limited delivered robust quarterly results with total income rising 23.6% year-on-year to ₹178 crores. The company achieved significant profit growth with PAT increasing 37.6% to ₹21 crores and EBITDA growing 31.9% to ₹35 crores. EBITDA margins improved to 19.5% from 18.2% in the previous year, driven by favorable product mix and export contributions. Revenue from operations grew 22% to ₹173.1 crores, supported by timely project execution and deliveries. The company incorporated Standard Engineering Inc. as a wholly-owned subsidiary in South Carolina, USA, and entered a long-term agency agreement with Biocon Solutions covering Southeast Asian markets including Singapore, Indonesia, Malaysia, and Thailand. Management highlighted strong performance in the CDMO business segment and expressed confidence in technology development, product diversification, and international market expansion initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1754292719670,
            "Source": "earnings"
        },
        {
            "Title": "Standard Glass Lining Technology Reports 42% Jump in Q1 Net Profit",
            "Summary": "Standard Glass Lining Technology, a new listing, reported consolidated net profit of 209 million rupees in Q1, compared to 147 million rupees in the same period last year, representing a year-on-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1754288322157,
            "Source": "earnings"
        },
        {
            "Title": "Standard Glass Lining Establishes US Subsidiary",
            "Summary": "Standard Glass Lining has announced the establishment of a wholly-owned subsidiary in the United States. This move represents an expansion of the company's operations into the US market.",
            "Sentiment": "positive",
            "PublishDate": 1749654452000,
            "Source": "default"
        },
        {
            "Title": "Standard Glass Reports Q4 EBITDA Decline",
            "Summary": "Standard Glass has reported its Q4 EBITDA at 236 million rupees, down from 315 million rupees in the same quarter last year. The company's Q4 EBITDA margin also decreased to 14.21% from 15.66% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748001809000,
            "Source": "result"
        },
        {
            "Title": "Standard Glass Reports Q4 Financial Results",
            "Summary": "Standard Glass has announced its Q4 financial results. The company's consolidated net profit for Q4 was 151 million rupees, compared to 232 million rupees year-over-year and 150 million rupees quarter-over-quarter. Q4 revenue was reported at 1.7 billion rupees, down from 2 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748001711000,
            "Source": "result"
        },
        {
            "Title": "Standard Glass Lining Technology: Launches New Heat Exchanger Product",
            "Summary": "Standard Glass Lining Technology Ltd announced the launch of Glass Lined Shell and Tube Heat Exchangers, developed in collaboration with AGI Group, Japan. The company secured a 20-year exclusive license to manufacture and sell these products in India, targeting the pharmaceutical and chemical industries with superior durability and safety features compared to conventional graphite heat exchangers.",
            "Sentiment": "positive",
            "PublishDate": 1747213860000,
            "Source": "corporate_action"
        },
        {
            "Title": "Standard Glass Lining Partners with AGI Group for Glass-Lined Heat Exchangers",
            "Summary": "Standard Glass Lining has formed a strategic partnership with Japan's AGI Group to introduce the world's first glass-lined shell and tube heat exchangers in India. This collaboration aims to bring innovative technology to the Indian market, potentially enhancing industrial processes that require corrosion-resistant heat exchange equipment.",
            "Sentiment": "positive",
            "PublishDate": 1747191006000,
            "Source": "default"
        },
        {
            "Title": "Standard Glass Lining Technology Enters Agency Agreement with Biocon Solutions for Export",
            "Summary": "Standard Glass Lining Technology has entered into a long-term agency agreement with Biocon Solutions. This agreement enables the company to export its products to Singapore, Indonesia, Malaysia, and Thailand.",
            "Sentiment": "positive",
            "PublishDate": 1744330100000,
            "Source": "corporate_action"
        },
        {
            "Title": "Standard Glass Lining Technology Enters Long-Term Agency Agreement with Biocon Solutions",
            "Summary": "Standard Glass Lining Technology has entered into a long-term agency agreement with Biocon Solutions. This agreement will enable the company to export its products to Singapore, Indonesia, Malaysia, and Thailand, potentially expanding its market presence in Southeast Asia.",
            "Sentiment": "positive",
            "PublishDate": 1744200159000,
            "Source": "corporate_action"
        },
        {
            "Title": "Standard Glass Lining Technology Enters Export Agreement with Gale Process Solutions",
            "Summary": "Standard Glass Lining Technology's subsidiary has entered into a long-term agreement with Gale Process Solutions. This agreement will facilitate the export of steel and alloy products, potentially expanding the company's international market presence and revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1741651391000,
            "Source": "corporate_action"
        },
        {
            "Title": "Standard Glass Lining Technology Unit Signs Long-Term Export Agreement",
            "Summary": "A unit of Standard Glass Lining Technology has entered into a long-term agreement with Gale Process Solutions. This agreement will facilitate the export of steel and alloy products.",
            "Sentiment": "positive",
            "PublishDate": 1741614230000,
            "Source": "order&deals"
        },
        {
            "Title": "Standard Glass Lining Technology Limited: Reports 33% Revenue Growth in First Post-IPO Results",
            "Summary": "SGLTL reported 33% YoY revenue growth to ₹45,493.22 lakh for first 9 months of FY25. Profit after tax grew 45% to ₹5,215.86 lakh. Plans to establish U.S. subsidiary by Q4 FY25. Taking possession of new 100,000 sq. ft. facility. Launching new products targeting ₹2,000 crore market opportunity in India.",
            "Sentiment": "positive",
            "PublishDate": 1739437622000,
            "Source": "earnings"
        },
        {
            "Title": "Standard Glass Lining Technology Ltd: Shares Close at 16% Premium on Debut",
            "Summary": "Standard Glass Lining Technology Ltd shares closed at Rs 162.75 on BSE and Rs 163.2 on NSE, marking a 16.2% and 16.5% premium respectively over the IPO price of Rs 140. The Rs 410.05-crore IPO was oversubscribed 183.18 times, with strong demand from qualified institutional buyers.",
            "Sentiment": "positive",
            "PublishDate": 1736763580000,
            "Source": "result"
        },
        {
            "Title": "Standard Glass Lining Technology: Shares Debut with 26% Premium",
            "Summary": "Standard Glass Lining Technology Ltd. shares listed on BSE at Rs 176, a 25.7% premium over the issue price of Rs 140. On NSE, it listed at Rs 172, a 22.86% premium. The Rs 410.05-crore IPO was oversubscribed 183.18 times. The company plans to use the proceeds for capital expenditure, debt repayment, and potential acquisitions.",
            "Sentiment": "positive",
            "PublishDate": 1736742174000,
            "Source": "normal_news"
        },
        {
            "Title": "Standard Glass Lining Technology: Strong Market Debut Expected with 35% Premium",
            "Summary": "Standard Glass Lining Technology shares are set to list on BSE and NSE today, January 13, 2025. The IPO was oversubscribed 185.48 times. Grey market premium indicates a listing price of ₹190, a 35.71% premium over the issue price of ₹140. The ₹410.05 crore IPO included fresh issuance and an OFS component.",
            "Sentiment": "positive",
            "PublishDate": 1736729145000,
            "Source": "corporate_action"
        }
    ]
}