{
    "Symbol": "SFL",
    "ISIN": "INE916U01025",
    "News": [
        {
            "Title": "Sheela Foam Issues 4,88,146 Shares to Kurlon",
            "Summary": "Sheela Foam has issued 4,88,146 equity shares to Kurlon shareholders as part of corporate restructuring activities involving the two foam manufacturing entities.",
            "Sentiment": "neutral",
            "PublishDate": 1770124656444,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sheela Foam Q3 Net Profit Surges 212% to ₹521M",
            "Summary": "Sheela Foam reports strong Q3 performance with consolidated net profit jumping to ₹521 million from ₹167 million year-on-year, while revenue grows 10.3% to ₹10.7 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770124605444,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sheela Foam Board Meet Set for Feb 3 for Q3FY26 Results",
            "Summary": "Sheela Foam Limited has scheduled its board meeting for February 3, 2026, to approve Q3FY26 unaudited standalone and consolidated financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769673831587,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sheela Foam completes subsidiary merger process",
            "Summary": "Sheela Foam Limited announces completion of merger between wholly owned subsidiaries Staqo World Private Limited and Staqo Software Private Limited, with NCLT approval received in November 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768920887006,
            "Source": "co_actions_results"
        },
        {
            "Title": "Prime Focus' Auditor Converts to LLP Structure",
            "Summary": "Prime Focus Limited announces that its statutory auditor M S K A & Associates has converted into a Limited Liability Partnership, now operating as M S K A & Associates LLP while continuing audit duties.",
            "Sentiment": "neutral",
            "PublishDate": 1768393554323,
            "Source": "stocks"
        },
        {
            "Title": "Sheela Foam Reports Strong Q2 FY26 Performance with Double-Digit EBITDA Margins",
            "Summary": "Sheela Foam Limited reported robust growth for Q2 and H1 FY26, achieving core EBITDA margins above 10% on a consolidated basis. The company's mattress business grew 13% by volume in Q2, with Sleepwell growing 14% and Kurlon 13%. For H1 FY26, mattress volumes increased 11% while foam business registered 8% volume growth. The company expanded its network by 420 net new showrooms in H1 FY26, with plans to add another 800 by year-end. Consolidated revenue grew 5% year-on-year to Rs. 1,696 crores, with core EBITDA increasing 31% to Rs. 177 crores. The merger of Kurlon with Sheela Foam received final NCLT approval, effective October 20, 2023. Furlenco, the company's investment, achieved PAT of Rs. 9 crores in H1 FY26 with an exit revenue run rate above Rs. 350 crores per annum. The company expects to reduce debt significantly over the next 2-3 years through asset monetization and cash flow generation.",
            "Sentiment": "positive",
            "PublishDate": 1762809190321,
            "Source": "earnings"
        },
        {
            "Title": "Sheela Foam Appoints Rahul Gautam as Chairman & MD, Elevates Tushaar Gautam to Vice Chairman",
            "Summary": "Sheela Foam Limited's Board of Directors appointed Rahul Gautam as Chairman and Managing Director with immediate effect on November 4, 2025. The company also elevated Tushaar Gautam to Vice Chairman and Joint Managing Director, effective immediately. These leadership changes were made to strengthen operational leadership following the merger of Kurlon Enterprise Limited and its subsidiaries with Sheela Foam Limited, for which the NCLT merger order was received on October 30, 2025. The appointments were based on recommendations from the Nomination and Remuneration Committee. The terms and conditions, including tenure of their re-appointment as approved by shareholders through postal ballot on January 25, 2024, remain unchanged. Rahul Gautam is the husband of Director Namita Gautam and father of Director Tushaar Gautam, while Tushaar Gautam is the son of Directors Rahul Gautam and Namita Gautam.",
            "Sentiment": "positive",
            "PublishDate": 1762290214681,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sheela Foam Constitutes Amalgamation Committee to Oversee Multi-Company Merger Scheme",
            "Summary": "Sheela Foam Limited's Board of Directors has constituted an Amalgamation Committee comprising board members to oversee and implement a composite scheme of arrangement. The scheme involves the merger of five companies - Belvedore International Limited, Kanvas Concepts Private Limited, Kurlon Retail Limited, Komfort Universe Products And Services Limited, and Starship Value Chain and Manufacturing Private Limited - into Kurlon Enterprise Limited, which will then merge into Sheela Foam Limited. The committee has been authorized to take all necessary actions in connection with the scheme implementation. The company received approval from the NCLT Mumbai Bench and will inform exchanges about the effective date once the certified copy is filed with the Registrar of Companies.",
            "Sentiment": "positive",
            "PublishDate": 1762283453175,
            "Source": "corporate_action"
        },
        {
            "Title": "Sheela Foam Reports Mixed Q2 Results with Profit Decline and Exceptional Losses",
            "Summary": "Sheela Foam Limited announced its quarterly results for the period ended September 30, 2025. The company reported standalone revenue from operations of Rs 566.60 crores compared to Rs 574.75 crores in the previous quarter. Standalone profit after tax declined to Rs 5.65 crores from Rs 10.70 crores in the previous quarter. The company recorded exceptional losses of Rs 7.84 crores due to the sale of certain land and buildings in Uttarakhand and Bangalore. On a consolidated basis, revenue from operations was Rs 874.94 crores with profit after tax of Rs 9.96 crores. The Board of Directors approved the amalgamation scheme of subsidiary Kurlon Enterprises Limited, which was sanctioned by the National Company Law Tribunal on September 17, 2025. The company's debt service coverage ratio stood at 0.15 times and current ratio at 0.51 times for the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762273688349,
            "Source": "earnings"
        },
        {
            "Title": "Sheela Foam Board Approves ₹30 Crore Investment in House Of Kieraya (Furlenco)",
            "Summary": "Sheela Foam's board has approved a ₹30 crore investment in House Of Kieraya, which operates under the Furlenco brand. The investment aims to increase Sheela Foam's stake in the company and strengthen its furniture business operations.",
            "Sentiment": "positive",
            "PublishDate": 1762265918404,
            "Source": "order&deals"
        },
        {
            "Title": "Sheela Foam Reports Mixed Q2 Results with Revenue Growth but Lower Net Profit",
            "Summary": "Sheela Foam reported quarterly net profit of 96.6 million rupees compared to 199.4 million rupees in the same period last year, representing a decline. Revenue increased to 8.75 billion rupees from 8.13 billion rupees year-over-year. EBITDA rose to 871.3 million rupees from 703.3 million rupees, while EBITDA margin improved to 9.96% from 8.65% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762258621456,
            "Source": "earnings"
        },
        {
            "Title": "Sheela Foam Limited Receives NCLT Approval for Multi-Company Amalgamation Scheme",
            "Summary": "The National Company Law Tribunal Mumbai Bench approved a Composite Scheme of Arrangement involving Sheela Foam Limited and five other companies on September 17, 2025. The scheme involves the amalgamation of Belvedore International Limited, Kanvas Concepts Private Limited, Kurlon Retail Limited, Komfort Universe Products And Services Limited, and Starship Value Chain and Manufacturing Private Limited into Kurlon Enterprise Limited, which will then merge into Sheela Foam Limited. The arrangement covers the companies along with their respective shareholders and creditors under sections 230 to 232 of the Companies Act, 2013. The scheme will become effective once the certified copy of the NCLT order is filed with the Registrar of Companies, Mumbai.",
            "Sentiment": "positive",
            "PublishDate": 1758194697610,
            "Source": "corporate_action"
        },
        {
            "Title": "Sheela Foam Reports 47% Jump in Core EBITDA to Rs 75 Crores in Q1 FY26",
            "Summary": "Sheela Foam Limited reported strong quarterly results with core EBITDA growing 47% to Rs 75 crores compared to Rs 51 crores in the same quarter last year. EBITDA margins improved to 11.7% from 8.4% previously. The company achieved 10% volume growth in mattresses, with Sleepwell growing 22% and Kurlon 6%. India business revenues reached Rs 644 crores, up 5% year-on-year. The company has realized Rs 190 crores in cost savings from Kurlon integration, with an additional Rs 60 crores expected by end of FY26. Gross margins improved to 43.5%, representing a 400 basis point increase from pre-acquisition levels. The company signed up 392 new showrooms in Q1, with 234 already operational, and targets opening 1,000 new showrooms this fiscal year. E-commerce business grew 66% year-on-year and generated Rs 200 crores revenue in FY25. Small-town initiative products Tarang and Aaram achieved 60% volume growth with an annual run rate of Rs 80 crores. Furlenco, the company's investment, reported Rs 4 crores PAT in Q1 and plans to raise Rs 100-125 crores for expansion.",
            "Sentiment": "positive",
            "PublishDate": 1754662664426,
            "Source": "earnings"
        },
        {
            "Title": "Sheela Foam Targets Growth Through Kurlon Synergies and Retail Expansion",
            "Summary": "Sheela Foam is pursuing scalable growth through synergies with Kurlon, leveraging over 20,000 retail touchpoints and accelerating e-commerce operations. The company is focusing on margin expansion and expects festive season momentum to support stronger performance in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754405360582,
            "Source": "stock"
        },
        {
            "Title": "Sheela Foam Designates Rakesh Chahar as Deputy Managing Director",
            "Summary": "Sheela Foam Limited has designated Rakesh Chahar as Deputy Managing Director (Whole-time Director) with immediate effect. The Board of Directors approved this designation based on the recommendation of the Nomination & Remuneration Committee. The terms and conditions including tenure of his appointment remain the same as approved by shareholders in the AGM held on August 18, 2022. The company clarified that this is a designation change rather than a new appointment or reappointment.",
            "Sentiment": "neutral",
            "PublishDate": 1754403245539,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sheela Foam Reports 84% Drop in Quarterly Net Profit Despite Revenue Growth",
            "Summary": "Sheela Foam's consolidated net profit declined significantly to 74.3 million rupees from 460 million rupees in the same quarter last year. The company's revenue showed modest growth, increasing to 8.21 billion rupees from 8.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754397468621,
            "Source": "earnings"
        },
        {
            "Title": "Sheela Foam: US-China Tariff War Yields No Export Gains",
            "Summary": "Sheela Foam reports no significant benefits from US-China trade tensions. High freight costs, logistics issues, and US import duties make exports commercially unviable. The company targets 10-15% revenue growth and 10-11% margin recovery by FY26. Post-Kurlon acquisition, backend integration is complete with manufacturing units reduced from 18 to 12. Volume growth is healthy at 8-9% with increased market share. Plans to expand exclusive outlets from 4,500 to 6,500 over three years.",
            "Sentiment": "neutral",
            "PublishDate": 1747308165000,
            "Source": "normal_news"
        },
        {
            "Title": "Sheela Foam Reports Significant Drop in Q4 EBITDA and Net Profit",
            "Summary": "Sheela Foam's Q4 financial results show a substantial decline in performance compared to the previous year. The company's EBITDA fell to 330 million rupees from 806 million rupees year-over-year, with EBITDA margin dropping to 3.88% from 9.53%. Consolidated net profit decreased to 215 million rupees from 646 million rupees year-over-year and 188 million rupees quarter-over-quarter. However, revenue remained relatively stable at 8.5 billion rupees compared to 8.45 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1747233752000,
            "Source": "result"
        },
        {
            "Title": "Sheela Foam to Consider Q4 Results on May 14",
            "Summary": "Sheela Foam has announced that it will consider its fourth quarter (Q4) financial results on May 14. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746798948000,
            "Source": "default"
        },
        {
            "Title": "Sheela Foam Ltd.: E-commerce Efficiency to Drive Margin Recovery by Early FY26",
            "Summary": "Sheela Foam Ltd. expects to restore margins to normal levels in early FY26 through improved e-commerce efficiency. The company's Ebitda margin hit a low of 8.4% in the nine months ending December 2024. Executive Chairman Rahul Gautam anticipates margin normalization within two months, citing slower integration and e-commerce growth as factors affecting current margins.",
            "Sentiment": "positive",
            "PublishDate": 1738722877000,
            "Source": "normal_news"
        },
        {
            "Title": "Sheela Foam Reports Improved Q3 EBITDA and Margin",
            "Summary": "Sheela Foam has announced its Q3 financial results, showing an improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 870 million rupees from 762 million rupees in the same quarter last year. The EBITDA margin also improved to 9% from 8.70% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738328903000,
            "Source": "earnings"
        },
        {
            "Title": "Sheela Foam Reports Q3 Financial Results",
            "Summary": "Sheela Foam announced its Q3 consolidated net profit of 188 million rupees, showing a decrease from 307 million rupees year-over-year. However, it increased from 98 million rupees quarter-over-quarter. The company's Q3 revenue rose to 9.7 billion rupees from 8.8 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1738328826000,
            "Source": "earnings"
        },
        {
            "Title": "Sheela Foam Receives Regulatory Approvals for Corporate Action",
            "Summary": "Sheela Foam Ltd has received observation letters from BSE Limited and NSE Limited regarding a corporate action. BSE provided 'No Adverse Observations' while NSE gave a 'No Objection' response. This suggests that the company has cleared a significant regulatory hurdle for a proposed corporate action.",
            "Sentiment": "positive",
            "PublishDate": 1732695779000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sheela Foam Reports Mixed Q2 Results",
            "Summary": "Sheela Foam's Q2 EBITDA increased to 690 million rupees from 662 million rupees year-over-year. However, the EBITDA margin decreased to 8.49% from 10.80% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730204041000,
            "Source": "result"
        },
        {
            "Title": "Sheela Foam Reports Significant Decline in Q2 Profit",
            "Summary": "Sheela Foam's Q2 consolidated net profit dropped to 98 million rupees, down from 440 million rupees year-over-year and 460 million rupees quarter-over-quarter. However, the company's revenue increased to 8.12 billion rupees from 6.13 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1730203959000,
            "Source": "result"
        },
        {
            "Title": "Sheela Foam: Rs 107 Crore Investment in House of Kieraya Approved",
            "Summary": "<p>Sheela Foam's board has approved a <span class='positive'>Rs 107 crore investment</span> in House of Kieraya (Furlenco). This includes <b>subscribing to 50,45,540 equity shares</b> in a rights issue, <b>exercising 56,00,995 partly paid-up warrants</b>, and <b>purchasing up to 3,50,000 shares</b> from existing shareholders.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728379260000,
            "Source": "corporate_action"
        }
    ]
}