{
    "Symbol": "SGFIN",
    "ISIN": "INE618R01015",
    "News": [
        {
            "Title": "SG Finserve Gets RBI Nod for Director Appointment",
            "Summary": "SG Finserve Limited receives RBI approval for appointing Deepak Kumar as Director, following October 2025 board authorization. Company to proceed with formal appointment process.",
            "Sentiment": "positive",
            "PublishDate": 1769610113236,
            "Source": "stocks"
        },
        {
            "Title": "SG Finserve Q3FY26 Monitoring Report Filed",
            "Summary": "SG Finserve Limited filed its Q3FY26 monitoring agency report with CARE Ratings showing no deviations in fund utilization. The company received ₹112.50 crores from warrant allotment.",
            "Sentiment": "neutral",
            "PublishDate": 1769159218083,
            "Source": "stocks"
        },
        {
            "Title": "SG Finserve Plans ₹400 Cr Investment in New Units",
            "Summary": "SG Finserve announces strategic expansion with ₹400 crore investment to establish new subsidiaries in asset reconstruction and insurance broking sectors.",
            "Sentiment": "positive",
            "PublishDate": 1769158749726,
            "Source": "stocks"
        },
        {
            "Title": "SG Finserv Reports Strong Q3 Growth in Profit & Revenue",
            "Summary": "SG Finserv delivered impressive Q3 performance with net profit rising 37.13% to ₹32.50 crores and revenue more than doubling to ₹86.30 crores compared to the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769157895223,
            "Source": "co_actions_results"
        },
        {
            "Title": "SG Finserve schedules Q3FY26 earnings call for Jan 23",
            "Summary": "SG Finserve Limited has scheduled an earnings conference call on January 23, 2026, at 5:30 PM IST to discuss Q3FY26 financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768826400674,
            "Source": "co_actions_results"
        },
        {
            "Title": "SG Finserv Issues ₹30 Cr Commercial Paper at 7.30%",
            "Summary": "SG Finserv Limited has issued commercial papers worth ₹30 crores with a 49-day tenure at 7.30% interest rate, allotted to India Shelter Finance Corporation Limited on January 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767871992041,
            "Source": "co_actions_results"
        },
        {
            "Title": "SG Finserv Gets RBI Nod for Factoring Operations",
            "Summary": "SG Finserv Limited receives regulatory approval from Reserve Bank of India to operate under the Factoring Regulation Act, 2011, enabling the company to expand its financial services portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1767794443146,
            "Source": "stocks"
        },
        {
            "Title": "SG Finserv Q3FY26 Loan Book Reaches ₹32.11 Billion",
            "Summary": "SG Finserve Limited reports loan book totalling ₹32.11 billion for Q3FY26, reflecting the company's lending portfolio performance during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1767273603032,
            "Source": "co_actions_results"
        },
        {
            "Title": "SG Finserve Files Loan Book Disclosure for Dec 2025",
            "Summary": "SG Finserve Limited submitted mandatory stock exchange filing regarding its loan book position as on December 31, 2025, under SEBI LODR compliance requirements to NSE and BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1767273184618,
            "Source": "stocks"
        },
        {
            "Title": "SG Finserve Gets ICRA Credit Rating Reaffirmation",
            "Summary": "SG Finserve Limited received credit rating reaffirmations from ICRA on December 23, 2025, covering bank facilities worth ₹650 crores and commercial paper of ₹200 crores with stable outlook.",
            "Sentiment": "positive",
            "PublishDate": 1766556649556,
            "Source": "stocks"
        },
        {
            "Title": "SG Finserve Seeks Shareholder Approval for Key Resolutions",
            "Summary": "SG Finserve Limited announces postal ballot for re-appointment of two independent directors and approval of ₹3,000 crore related party transactions with SGupta Holding Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1766055724033,
            "Source": "stocks"
        },
        {
            "Title": "SG Finserve Receives Certificate of Registration for Factoring",
            "Summary": "SG Finserve Limited receives Certificate of Registration from RBI on January 07, 2026 for factoring business operations with conditions to commence within 6 months and amend MOA within 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1765978907123,
            "Source": "stocks"
        },
        {
            "Title": "SGFinserve Issues Rs 25 Crore Commercial Paper with December 2025 Maturity",
            "Summary": "SGFinserve Limited has issued commercial papers worth Rs 25 crore to India Shelter Finance Corporation Limited, with maturity date of December 30, 2025. The commercial papers carry ICRA A1 credit rating and will be listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1763043237884,
            "Source": "corporate_action"
        },
        {
            "Title": "SG Finserve Appoints Lalit Gupta as Chief Business Officer",
            "Summary": "SG Finserve Limited's Board of Directors approved the appointment of Mr. Lalit Gupta as Chief Business Officer, categorized as Senior Management Personnel, effective from November 10, 2025. The appointment was made based on the recommendation of the Nomination and Remuneration Committee through a board resolution dated November 4, 2025. Lalit Gupta brings over 27 years of strategic experience in banking and financial services across institutions including Axis Bank, Barclays, HDFC Bank, and SBI. He has expertise in Corporate Banking, Trade Finance, and Supply Chain Financing. At Axis Bank, he served as Country Head-Sales, Trade SCF, leading one of India's top two SCF portfolios. He has also worked with Vayana Network, scaling operations across India, the US, and Singapore, and played a foundational role in setting up Barclays Corporate Investment Banking franchise in North and East India. Gupta is not related to any Director of the company.",
            "Sentiment": "positive",
            "PublishDate": 1762254508378,
            "Source": "corporate_governance"
        },
        {
            "Title": "SG Finserve Issues Rs 50 Crore Commercial Paper at 7.50% Interest Rate",
            "Summary": "SG Finserve Limited has issued commercial papers worth Rs 50 crore with a 91-day tenure at an interest rate of 7.50%. The commercial papers were allotted on October 28, 2025, and will mature on January 27, 2026. The papers have been issued in favor of Quant Mutual Fund-A/C Quant Liquid Plan and carry an [ICRA] A1+ credit rating. The commercial papers will be listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761657484420,
            "Source": "corporate_action"
        },
        {
            "Title": "SG Finserve Reports 15% Loan Book Growth in Q2-FY26 Amid Leadership Transition",
            "Summary": "SG Finserve Limited reported a 15% quarter-on-quarter loan book growth to INR 2,878 crores in Q2-FY26, leading to a 14% increase in PBT and 16% increase in net profit. The company maintains zero NPAs after disbursing INR 52,000 crores since inception 36 months ago. CEO Sorabh Dhawan and CFO/COO Sahil Sikka announced their resignations to pursue new opportunities. Vinay Gupta, a chartered accountant with over 20 years of banking experience, will join as the new CEO in November. Sanjay Rajput, currently Head of Finance and Accounts, will take over as CFO. The company revised its FY26 PAT guidance downward from INR 150 crores to INR 120-125 crores due to macro economic slowdown affecting customer businesses. Management expects 10% quarter-on-quarter earnings growth going forward and targets INR 6,000 crores loan book by FY27. The company operates in supply chain financing, serving over 1,000 MSMEs with anchor partnerships including Tata Motors, Mahindra & Mahindra, and Tata Steel.",
            "Sentiment": "neutral",
            "PublishDate": 1760692608598,
            "Source": "earnings"
        },
        {
            "Title": "SG Finserve Expects Strong Growth from Lending Expansion and MSME Focus",
            "Summary": "SG Finserve anticipates strong growth driven by increased lending activities and improved yield spreads. The company plans to expand in MSME and retail sectors while maintaining double-digit return on equity expectations.",
            "Sentiment": "positive",
            "PublishDate": 1760370027874,
            "Source": "stock"
        },
        {
            "Title": "SG Finserve Reports Strong Q2 Performance with Net Profit Doubling Year-on-Year",
            "Summary": "SG Finserve delivered robust quarterly results with net profit rising to 283.9 million rupees from 141.2 million rupees in the same period last year. Revenue increased significantly to 747.1 million rupees compared to 309 million rupees year-on-year. The company's EBITDA grew to 689.3 million rupees from 207.9 million rupees, while EBITDA margin expanded to 92.26% from 67.31% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760364573631,
            "Source": "earnings"
        },
        {
            "Title": "SG Finserve Announces Leadership Changes and Director Re-appointments",
            "Summary": "SG Finserve Limited's Board approved the re-appointment of two Independent Directors, H.S.U. Kamath and Dukhabandhu Rath, for second five-year terms effective February 2026 and January 2026 respectively, subject to shareholder approval. The company also authorized an RBI application for appointing Deepak Kumar as Non-Executive Non-Independent Director. Several key management changes were announced: Sorabh Dhawan will resign as CEO effective November 3, 2025, with Vinay Gupta expected to join as replacement by November 24, 2025. Sahil Sikka will resign as CFO and COO on December 31, 2025, with Sanjay Rajput being elevated to CFO from January 1, 2026. Kush Mishra was appointed as Company Secretary effective October 13, 2025, while Saurabh Mishra will join as Head of Internal Audit by November 10, 2025, replacing Prince Kumar Shukla. The Board also approved quarterly results for the period ended September 30, 2025, and deferred the proposed issuance of Non-Convertible debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1760364161527,
            "Source": "corporate_action"
        },
        {
            "Title": "SG Finserve Loan Book Grows to INR 2,878 Crores with Strong Growth Momentum",
            "Summary": "SG Finserve's loan book reached INR 2,878 crores by September 30, 2025. The company achieved 28% growth in H1 FY2026 and 15% sequential growth in Q2 FY2026. Since FY2023, the loan book has grown at a compound annual growth rate of approximately 52%.",
            "Sentiment": "positive",
            "PublishDate": 1759301917508,
            "Source": "stock"
        },
        {
            "Title": "SG Finserve Limited Receives NSE Trading Approval, Shares to List on August 5, 2025",
            "Summary": "SG Finserve Limited has received trading approval from the National Stock Exchange of India Limited (NSE) for listing its equity shares. The company's 55,895,000 equity shares of Rs. 10/- each will be admitted for trading on NSE under the symbol SGFIN starting August 5, 2025, at 09:30 a.m. The shares will trade in the EQ series with a market lot of 1. The company had previously submitted its listing application on May 8, 2025, and received the trading approval on August 1, 2025. There are no lock-in details applicable to these shares.",
            "Sentiment": "positive",
            "PublishDate": 1754114827103,
            "Source": "stock"
        },
        {
            "Title": "SG Finserve Gets Final Credit Rating Confirmation from CRISIL for Rs 1000 Crore Bank Facilities",
            "Summary": "CRISIL Limited has converted SG Finserve Limited's credit rating from provisional to final for Rs 1000 crore bank loan facilities, maintaining the CRISIL AA (CE)/Positive rating. The facilities include term loans and working capital demand loans from multiple banks including HDFC Bank (Rs 400 crore), ICICI Bank (Rs 150 crore), Bank of Baroda (Rs 125 crore), Union Bank of India (Rs 100 crore), Axis Bank (Rs 100 crore), The South Indian Bank (Rs 51 crore), Aditya Birla Finance (Rs 40 crore), and a proposed long-term facility (Rs 34 crore). The rating confirmation was communicated through a letter dated July 25, 2025, with SG Finserve informing BSE about this development on July 27, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753607836912,
            "Source": "stock"
        },
        {
            "Title": "SG Finserve Reports 13% QoQ AUM Growth to ₹2,630 Crores, PAT Reaches ₹25 Crores in Q1 FY26",
            "Summary": "SG Finserve Limited reported quarterly results showing Assets Under Management (AUM) of ₹2,630 crores, representing 13% quarter-on-quarter growth and 86% year-on-year increase. The company achieved profit after tax of ₹24.52 crores, up 3% quarter-on-quarter and 27% year-on-year. Operating income rose to ₹67.59 crores, marking 25% quarter-on-quarter and 55% year-on-year growth. Net interest income increased 20% to ₹42.79 crores. Gross disbursements during the quarter stood at ₹5,284 crores. The company maintained zero gross NPAs and reported annualized ROA of 4.68% and ROE of 9.54%. ESOP costs of ₹2.7 crores impacted the quarter's results. The NBFC has disbursed ₹50,000 crores worth of loans to over 1,000 MSME customers since commencement. Management expanded the MOU portfolio to ₹6,400 crores and added partnerships with 48 corporates. The company targets AUM of ₹3,500-4,000 crores for FY26 and ₹6,000 crores for FY27. Supply chain financing constitutes 85% of the loan book, with dealer financing representing 90% of that segment.",
            "Sentiment": "positive",
            "PublishDate": 1753606973710,
            "Source": "earnings"
        },
        {
            "Title": "SG Finserve Shares Audio Recording Link for Quarterly Results Conference Call",
            "Summary": "SG Finserve Limited provided the audio recording link for a conference call held with investors and analysts on July 23, 2025, to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The conference call was conducted at 12:00 PM IST and the audio recording is available at https://www.sgfinserve.com/schedule-analyst. The company secretary Ritu Nagpal communicated this information to BSE Limited's listing department.",
            "Sentiment": "neutral",
            "PublishDate": 1753274108883,
            "Source": "earnings"
        },
        {
            "Title": "SG Finserve Limited Announces Resignation of Company Secretary Ms. Ritu Nagpal",
            "Summary": "SG Finserve Limited announced that Ms. Ritu Nagpal has resigned from her position as Company Secretary and Compliance Officer. Her resignation will be effective from the close of business hours on August 31, 2025. The resignation letter was dated July 22, 2025. The company stated that a successor will be appointed in due course and the stock exchanges will be notified accordingly. Ms. Ritu Nagpal is not related to any other director or key managerial personnel of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753192579113,
            "Source": "corporate_governance"
        },
        {
            "Title": "SG Finserve Appoints S.P. Chopra & Company as New Statutory Auditors for Three-Year Term",
            "Summary": "SG Finserve Limited's Board approved the appointment of S.P. Chopra & Company, Chartered Accountants as statutory auditors for a three-year term from the conclusion of the 31st AGM till the 34th AGM, subject to shareholder approval. The appointment follows the conclusion of the term of existing auditors M/s AKGVG and Associates. S.P. Chopra & Company is a 75-year-old firm established in 1949, empanelled with RBI since 1970, and has served as statutory auditor for over 25 BFSI entities including public/private banks, NBFCs, and insurance companies. The firm employs 135+ professionals including 12 partners and maintains offices in New Delhi with branches across India and Toronto.",
            "Sentiment": "neutral",
            "PublishDate": 1753191277590,
            "Source": "corporate_governance"
        },
        {
            "Title": "SG Finserve Reports Strong Q2 2025 Results, Approves New Auditor and Employee Stock Option Plan",
            "Summary": "SG Finserve Limited reported quarterly results for the period ended June 30, 2025, showing revenue from operations of Rs 67.59 crores compared to Rs 43.54 crores in the same quarter last year. Net profit increased to Rs 24.52 crores from Rs 19.39 crores year-over-year. The company's board approved several key decisions including the recommendation to appoint M/s. S.P. Chopra & Company as statutory auditors for three years replacing M/s. AKGVG & Associates. The board also approved the re-appointment of Ms. Asha Anil Agarwal as Independent Director for a second five-year term and instituted the SG Finserve Employee Stock Option Plan 2025 covering 20 lakh stock options. The company maintains a debt-equity ratio of 1.64 and capital to risk-weighted assets ratio of 39.47%. All approvals are subject to shareholder consent at the upcoming annual general meeting.",
            "Sentiment": "positive",
            "PublishDate": 1753190770539,
            "Source": "corporate_action"
        },
        {
            "Title": "SG Finserve Re-appoints Asha Anil Agarwal as Independent Director for Second Five-Year Term",
            "Summary": "SG Finserve Limited's Board of Directors approved the re-appointment of Ms. Asha Anil Agarwal as an independent director for a second term of five consecutive years, subject to shareholder approval at the upcoming Annual General Meeting. Ms. Agarwal, who holds DIN 09722160, brings four decades of experience from her role as Principal Chief Commissioner of Income Tax in the Indian Revenue Service. Her expertise spans taxation, finance, and general management. The re-appointment will commence from the conclusion of the 31st Annual General Meeting until the conclusion of the 36th Annual General Meeting. Ms. Agarwal currently serves as director on eight companies including APL Apollo Tubes Limited and Authum Investment & Infrastructure Limited. She is not related to any other director or key managerial personnel of the company and is not debarred from holding directorship by any regulatory authority.",
            "Sentiment": "positive",
            "PublishDate": 1753190148239,
            "Source": "corporate_governance"
        },
        {
            "Title": "SG Finserve Reports 26% Jump in Quarterly Net Profit to 245M Rupees",
            "Summary": "SG Finserve reported quarterly net profit of 245 million rupees compared to 194 million rupees in the same period last year, representing a year-over-year increase. The company's quarterly revenue grew to 648 million rupees from 435 million rupees in the previous year, marking significant growth across both profit and revenue metrics.",
            "Sentiment": "positive",
            "PublishDate": 1753189639656,
            "Source": "earnings"
        },
        {
            "Title": "SG Finserve Reports 13% Growth in Assets Under Management for Q1",
            "Summary": "SG Finserve has announced a 13% growth in Assets Under Management (AUM) for the first quarter. The company did not provide specific financial figures or comparisons to previous periods. The news focuses solely on the AUM growth percentage for Q1.",
            "Sentiment": "positive",
            "PublishDate": 1751354288000,
            "Source": "default"
        },
        {
            "Title": "SG Finserve Q4 Results: Steady Profit, Revenue Decline",
            "Summary": "SG Finserve reported Q4 net profit of 238 million rupees, unchanged from the same period last year. However, revenue decreased to 541 million rupees from 585 million rupees in the previous year, indicating a year-over-year decline.",
            "Sentiment": "neutral",
            "PublishDate": 1746757167000,
            "Source": "result"
        },
        {
            "Title": "SG Finserve Reports AUM of Rs 2,325 Crores for FY2025",
            "Summary": "SG Finserve has announced that it concluded the fiscal year 2025 with Assets Under Management (AUM) of approximately Rs 2,325 crores.",
            "Sentiment": "positive",
            "PublishDate": 1743482450000,
            "Source": "result"
        },
        {
            "Title": "Madhusudan Kela Acquires Significant Stake in SG Finserv",
            "Summary": "Renowned investor Madhusudan Kela has purchased 9.51 lakh shares of SG Finserv at a price of ₹350.01 per share. This substantial acquisition indicates a notable investment in the company by a prominent market player.",
            "Sentiment": "positive",
            "PublishDate": 1742873429000,
            "Source": "block_deals"
        },
        {
            "Title": "SG Finserve: Madhusudan Kela Acquires 1.7% Stake in Bulk Deal",
            "Summary": "Veteran investor Madhusudan Kela bought 9.51 lakh shares (1.7% stake) of SG Finserve at Rs 350.01 per share in a bulk deal on BSE. Dinesh Pareekh sold 3 lakh shares (0.53% stake) at Rs 350 per share. SG Finserve's stock closed 6.26% higher at Rs 360.55.",
            "Sentiment": "positive",
            "PublishDate": 1742835307000,
            "Source": "block_deals"
        },
        {
            "Title": "SG FINSERV Announces Ambitious Loan Book Growth Targets",
            "Summary": "SG FINSERV reports a Q3 loan book of 15.7 billion and sets aggressive growth targets for the coming years. The company aims to achieve a loan book of 25 billion in FY25, 40 billion in FY26, and 60 billion in FY27, projecting a compound annual growth rate (CAGR) of 60%.",
            "Sentiment": "positive",
            "PublishDate": 1737108599000,
            "Source": "earnings"
        },
        {
            "Title": "SG Finserv Secures MOUs Worth 50 Billion for FY27 Loan Book Target",
            "Summary": "SG Finserv has announced that it has already secured Memorandums of Understanding (MOUs) worth 50 billion, which aligns with their fiscal year 2027 loan book target of 60 billion. This development indicates significant progress towards the company's long-term financial goals.",
            "Sentiment": "positive",
            "PublishDate": 1737108230000,
            "Source": "corporate_action"
        },
        {
            "Title": "SG Finserve Reports Q3 Revenue Decline",
            "Summary": "SG Finserve has reported its third-quarter revenue of 425 million rupees, which represents a decrease from the previous year's figure of 525 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1737106566000,
            "Source": "earnings"
        },
        {
            "Title": "SG Finserve Reports Increased Q3 Net Profit",
            "Summary": "SG Finserve has announced its Q3 standalone net profit of 237 million rupees, showing an increase from 217 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737106508000,
            "Source": "earnings"
        },
        {
            "Title": "SG Finserve Reports 60% Growth in Loans and Advances",
            "Summary": "SG Finserve has achieved a significant 60% growth in its loans and advances portfolio, reaching approximately INR 1,311 crores as of October 31, 2024. This represents an addition of INR 489 crores over the course of one month.",
            "Sentiment": "positive",
            "PublishDate": 1730726072000,
            "Source": "result"
        },
        {
            "Title": "SG Finserv Allots 1.1 Million Shares to Investor Ashish Kacholia",
            "Summary": "SG Finserv has allotted 1.1 million shares to investor Ashish Kacholia at a price of 450 rupees per share. This represents a significant investment by a prominent market player in the company.",
            "Sentiment": "positive",
            "PublishDate": 1729833077000,
            "Source": "corporate_action"
        },
        {
            "Title": "SG Finserve Reports Q2 Revenue Decline",
            "Summary": "<p>SG Finserve has reported its <span class='neutral'>second quarter revenue</span> of <span class='neutral'>309 million rupees</span>, which represents a <span class='negative'>decrease</span> from <span class='neutral'>439 million rupees</span> in the same quarter of the <b>previous year</b>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728989974000,
            "Source": "result"
        },
        {
            "Title": "SG Finserve Reports Q2 Net Profit Decline",
            "Summary": "<p>SG Finserve has reported a <span class='neutral'>net profit</span> of <b>141 million rupees</b> for the second quarter, down from <b>175 million rupees</b> in the same period last year, representing a <span class='negative'>year-over-year decrease</span>.</p>",
            "Sentiment": "negative",
            "PublishDate": 1728989962000,
            "Source": "result"
        },
        {
            "Title": "SG Finserve Receives New NBFC Registration Certificate",
            "Summary": "<p><span class='positive'>SG Finserve</span> has been granted a <b>new certificate of registration</b> as a <span class='neutral'>Non-Banking Financial Company - Investment and Credit Company (Type II)</span> by the <span class='neutral'>Reserve Bank of India (RBI)</span>. This certification <span class='positive'>authorizes</span> the company to conduct its business and operations as an <span class='neutral'>Investment and Credit Company (Type II)</span> in <span class='positive'>compliance</span> with applicable RBI regulations.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728567583000,
            "Source": "corporate_action"
        }
    ]
}