{
    "Symbol": "SGIL",
    "ISIN": "INE00QT01015",
    "News": [
        {
            "Title": "Synergy Green Industries Q3FY26 Earnings Call Feb 11",
            "Summary": "Synergy Green Industries Ltd announces earnings conference call scheduled for February 11, 2026 at 4:00 PM IST to discuss Q3FY26 operational and financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770382439804,
            "Source": "stocks"
        },
        {
            "Title": "Solidarity Advisors raises stake in Synergy Green",
            "Summary": "Solidarity Advisors Private Limited acquired additional 37,393 shares in Synergy Green Industries through open market purchase, increasing total holding to 5.21% of equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1768982750322,
            "Source": "co_actions_results"
        },
        {
            "Title": "Synergy Green Industries Reports 16.4% Revenue Drop in Q2 FY26 Despite Improved Margins",
            "Summary": "Synergy Green Industries reported a 16.4% quarter-on-quarter revenue decline to approximately 74 crores in Q2 FY26, primarily due to customer scheduling delays and slower domestic wind industry offtake in the first half. The company maintained its 20% full-year growth guidance backed by strong order book visibility, while PBDIT margins improved to 15.74% from better export business growth and stable raw material prices.",
            "Sentiment": "neutral",
            "PublishDate": 1763189295506,
            "Source": "earnings"
        },
        {
            "Title": "Synergy Green Industries Reports 4.9% Revenue Decline in H1 FY2025-26 Despite Margin Improvement",
            "Summary": "Synergy Green Industries Limited recorded total income of ₹159.75 crores in H1 FY2025-26, down 4.9% from ₹167.93 crores in the corresponding previous period. The revenue decline was attributed to lower schedules from domestic wind and OEM exports, though the company saw growth in Direct Exports, Gearbox and Non Wind segments. Export revenues grew 52% from ₹31 crores to ₹47 crores. PBDIT increased 4.8% to ₹24.86 crores with margins improving 128 basis points from 14.13% to 15.56%. The company is expanding its foundry capacity from 30,000 TPA to 45,000 TPA, expected to be operational in Q3 FY2025-26. An 8MW solar project has been commissioned. The company projects 20% order book growth for FY2025-26 with product development activities for Envision, Nordex and Adani on track. Management expects PBDIT margins to expand by 100 basis points for the full year FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1763021098123,
            "Source": "earnings"
        },
        {
            "Title": "Synergy Green Industries Reports Q2 Results, Appoints Internal Auditor",
            "Summary": "Synergy Green Industries Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs. 7,200.33 lakhs for the quarter compared to Rs. 8,355.86 lakhs in the previous quarter. For the half year, revenue stood at Rs. 15,556.19 lakhs versus Rs. 16,767.54 lakhs in the corresponding previous period. Profit after tax for the quarter was Rs. 236.08 lakhs compared to Rs. 337.71 lakhs in the previous quarter. The company also appointed Mr. Jitendra Patil as Internal Auditor. The Board recommended a final equity dividend of Rs. 1 per equity share of Rs. 10 each for financial year 2024-25 and a preference dividend of Rs. 10 per preference share. An Employee Stock Option Plan was approved offering employees the right to buy shares at Rs. 70 per share for 22,980 options.",
            "Sentiment": "neutral",
            "PublishDate": 1763019421059,
            "Source": "earnings"
        },
        {
            "Title": "Synergy Green Industries Reports 41% Decline in Q2 Net Profit to Rs 24 Million",
            "Summary": "Synergy Green Industries reported a net profit of Rs 24 million for Q2, compared to Rs 41 million in the same quarter of the previous year, representing a year-over-year decline of approximately 41%.",
            "Sentiment": "negative",
            "PublishDate": 1763018742219,
            "Source": "earnings"
        },
        {
            "Title": "Synergy Green Industries Sets Record Date for Final Dividend Eligibility",
            "Summary": "Synergy Green Industries Limited has set September 17, 2025 as the record date for determining shareholder eligibility for final dividend for the financial year ended March 31, 2025. The dividend payment is subject to approval at the company's 15th Annual General Meeting. Shareholders whose names appear in the register of members on or before the record date will be entitled to receive the final dividend if approved by members at the AGM. The record date also applies for e-voting eligibility on all resolutions in the Annual General Meeting notice.",
            "Sentiment": "neutral",
            "PublishDate": 1758008653622,
            "Source": "corporate_action"
        },
        {
            "Title": "Synergy Green Industries Reports 8% Revenue Growth in Q1, Plans Major Capacity Expansion",
            "Summary": "Synergy Green Industries Limited reported quarterly revenue of ₹85.38 crores, representing an 8% increase from the previous year's corresponding quarter. The company's EBITDA rose 25% to ₹13.16 crores with margins improving to 15.41%. The wind casting manufacturer is expanding capacity from 30,000 to 45,000 metric tons and investing ₹187 crores in foundry expansion, in-house machining capabilities, and renewable energy infrastructure. The company has secured schedules worth ₹167 crores from Vestas for 2026 execution and successfully produced India's largest wind turbine casting of 29.5 metric tons for Nordex. Management expects 20% revenue growth for the full year and EBITDA margin expansion of over 100 basis points. The company serves major wind OEMs including Vestas, Siemens Gamesa, and GE Vernova, with 70% of products going to wind castings, 15% to wind gearbox castings, and 15% to general engineering applications.",
            "Sentiment": "positive",
            "PublishDate": 1754992702919,
            "Source": "earnings"
        },
        {
            "Title": "Synergy Green Industries Reports 8% Revenue Growth and 25% PBDIT Increase in Q1 Results",
            "Summary": "Synergy Green Industries Limited reported total income of ₹85.38 crores in Q1 FY 2025-26, representing 8% growth compared to ₹79.06 crores in the same quarter last year. Export revenues surged 140% from ₹12.60 crores to ₹30.30 crores. PBDIT increased 25% to ₹13.15 crores with margins improving 210 basis points to 15.4%. The company is expanding its foundry capacity from 30,000 TPA to 45,000 TPA, expected operational by Q3 FY 2025-26, and commissioning an 8 MW solar project. Synergy signed agreements with Vestas for ₹167 crores of orders to be executed in CY 2026, while Siemens Gamesa resumed lifting schedules from Q3 FY 2025-26. The company successfully developed India's largest wind casting weighing 29.5 MT for Nordex's 5 MW platform. Management projects 20% revenue growth for full year FY 2025-26 with PBDIT margins expected to expand by 100 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1754641853206,
            "Source": "earnings"
        },
        {
            "Title": "Synergy Green Industries Reports Growth in Quarterly Financial Performance",
            "Summary": "Synergy Green Industries reported quarterly EBITDA of 113 million rupees compared to 102 million rupees in the same period last year. The company's EBITDA margin improved to 13.6% from 13% year-over-year. Net profit increased to 34 million rupees from 30 million rupees, while revenue grew to 836 million rupees from 787 million rupees in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1754639842314,
            "Source": "earnings"
        },
        {
            "Title": "Synergy Green Industries: Shares Surge on Adani Wind Order",
            "Summary": "Synergy Green Industries' shares jumped 11% to Rs 576.8 after securing a development order from Adani Wind for 3.3 MW turbine parts. The order is expected to double the company's order book with Adani Wind from Rs 20 crore in FY25 to Rs 40 crore in FY26. Development phase completion is anticipated in Q3 FY26, with serial production starting in Q4.",
            "Sentiment": "positive",
            "PublishDate": 1752043014000,
            "Source": "order&deals"
        },
        {
            "Title": "Synergy Green Industries Reports Strong Q4 Financial Results",
            "Summary": "Synergy Green Industries has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 149 million rupees from 96 million rupees in the previous year, with EBITDA margin expanding to 15.26% from 11.63%. Net profit rose to 38 million rupees from 32 million rupees year-over-year, while revenue grew to 975 million rupees from 823 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1746792864000,
            "Source": "result"
        },
        {
            "Title": "Synergy Green Industries Reports Improved Q3 EBITDA and Margin",
            "Summary": "Synergy Green Industries has reported a significant improvement in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 139 million rupees, up from 98 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 14.34% from 11.06% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738830610000,
            "Source": "earnings"
        },
        {
            "Title": "Synergy Green Industries Reports Strong Q3 Financial Results",
            "Summary": "Synergy Green Industries has announced its Q3 financial results, showing significant year-over-year growth. The company's net profit increased to 59 million rupees, up from 26 million rupees in the same quarter last year. Revenue also saw an improvement, rising to 971 million rupees from 882 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738830381000,
            "Source": "earnings"
        },
        {
            "Title": "Synergy Green Industries Limited: Major Wind Turbine Casting Contract Secured with Envision Energy",
            "Summary": "Synergy Green Industries Limited has signed a significant supply agreement with Envision Energy India Pvt Ltd to manufacture wind turbine castings. The contract involves supplying over 10,000 metric tons of castings annually for three years. Product development is expected to take six months, with serial production anticipated in H2 FY2026.",
            "Sentiment": "positive",
            "PublishDate": 1733478870000,
            "Source": "order&deals"
        },
        {
            "Title": "Synergy Green Industries Announces New Product Development",
            "Summary": "Synergy Green Industries has announced a new product development initiative. The company expects the development process to take approximately six months. They project that the new product will enter serial production during the second half of the fiscal year 2026.",
            "Sentiment": "positive",
            "PublishDate": 1733468847000,
            "Source": "corporate_action"
        },
        {
            "Title": "Synergy Green Industries Expects Capacity Utilization Boost from Envision Energy",
            "Summary": "Synergy Green Industries anticipates exceeding 10,000 MT/annum of capacity utilization from Envision Energy over the next three years. This projection suggests a significant increase in production and potential growth for the company.",
            "Sentiment": "positive",
            "PublishDate": 1733468838000,
            "Source": "corporate_action"
        },
        {
            "Title": "Synergy Green Industries Signs Supply Agreement with Envision Energy India",
            "Summary": "Synergy Green Industries has entered into a supply agreement with Envision Energy India. While specific details of the agreement are not provided in the given news snippet, this partnership likely involves Synergy Green supplying components or materials to Envision Energy, a company known for its work in renewable energy solutions.",
            "Sentiment": "positive",
            "PublishDate": 1733468760000,
            "Source": "order&deals"
        },
        {
            "Title": "Synergy Green Industries Reports Improved Q2 EBITDA",
            "Summary": "Synergy Green Industries has announced its Q2 financial results. The company's EBITDA increased to 131 million rupees, up from 104 million rupees in the same quarter last year. The EBITDA margin also improved slightly, rising to 14.76% from 14.48% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731396360000,
            "Source": "result"
        },
        {
            "Title": "Synergy Green Industries Reports Q2 FY2024 Financial Results",
            "Summary": "Synergy Green Industries has announced its financial results for the second quarter. The company's net profit increased to 42 million rupees from 33 million rupees in the same quarter last year, representing a year-over-year growth. Revenue also saw an improvement, rising to 889 million rupees from 719 million rupees in the corresponding period of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731396324000,
            "Source": "result"
        }
    ]
}