{
    "Symbol": "SGL",
    "ISIN": "INE353H01010",
    "News": [
        {
            "Title": "STL Global Q3FY26 Results Show Strong Recovery",
            "Summary": "STL Global Limited reports Q3FY26 net profit of ₹30.52 lakhs vs ₹11.57 lakhs YoY, with revenue at ₹2,975.03 lakhs. Nine-month profit stands at ₹48.85 lakhs against previous loss.",
            "Sentiment": "positive",
            "PublishDate": 1770800118329,
            "Source": "co_actions_results"
        },
        {
            "Title": "STL Global CIT Appeal Dismissed for Rs 3.05 Crores",
            "Summary": "STL Global Limited's CIT appeal for income tax demand of Rs 3.05 crores covering FY 2015-16 to 2020-21 dismissed. Company plans ITAT appeal with no material financial impact expected.",
            "Sentiment": "negative",
            "PublishDate": 1770045483459,
            "Source": "stocks"
        },
        {
            "Title": "STL Global Limited Reports Quarterly Results for Period Ended September 30, 2025",
            "Summary": "STL Global Limited's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported revenue from operations of Rs. 2,602.36 lakhs for the quarter, compared to Rs. 2,517.38 lakhs in the previous quarter and Rs. 2,285.05 lakhs in the same quarter last year. For the half-year period, revenue reached Rs. 5,119.74 lakhs versus Rs. 4,776.15 lakhs in the previous year. The company posted a profit after tax of Rs. 2.05 lakhs for the quarter, with diluted earnings per share of Rs. 0.10. Total assets stood at Rs. 6,100.81 lakhs as of September 30, 2025, while total equity was Rs. 2,641.76 lakhs. The company's cash and cash equivalents decreased to Rs. 11.56 lakhs from Rs. 21.52 lakhs. The results were reviewed by statutory auditors M.M. Goyal & Co., who provided a clean limited review report.",
            "Sentiment": "neutral",
            "PublishDate": 1762940057467,
            "Source": "earnings"
        },
        {
            "Title": "STL Global Reports Q1 Loss, Approves Director Re-appointment and AGM Date",
            "Summary": "STL Global Limited reported a net loss of Rs 9.55 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 12.03 lakhs in the same period last year. Revenue from operations declined to Rs 2,511.73 lakhs from Rs 2,485.46 lakhs year-over-year. The board approved the re-appointment of Mr. Sanjiv Kumar Agarwal as Whole Time Director for five years starting October 1, 2025, subject to shareholder approval. The company appointed Mr. Vijay Bahadur as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30. The 28th Annual General Meeting is scheduled for September 30, 2025, via video conference, with the register of members closed from September 24-30, 2025. The company operates primarily in the textile business with one reportable segment.",
            "Sentiment": "negative",
            "PublishDate": 1754645007991,
            "Source": "earnings"
        },
        {
            "Title": "STL Global Limited Reports Q2 2025 Loss, Approves Director Re-appointment and AGM Date",
            "Summary": "STL Global Limited's board approved quarterly results showing a net loss of Rs 9.55 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 12.03 lakhs in the same period last year. Revenue from operations was Rs 2,511.73 lakhs versus Rs 2,485.46 lakhs in the previous year quarter. The board approved the re-appointment of Sanjiv Kumar Agarwal as Whole Time Director for five years starting October 1, 2025, subject to shareholder approval. The company scheduled its Annual General Meeting for September 30, 2025, via video conference. The board also appointed Vijay Bahadur of Vijay Mourya & Associates as Secretarial Auditor for five years from FY 2025-26 to FY 2029-30. Basic and diluted earnings per share stood at negative Rs 0.04 for the quarter. The company operates primarily in the textile business with one reportable segment.",
            "Sentiment": "negative",
            "PublishDate": 1754643648953,
            "Source": "corporate_action"
        }
    ]
}