{
    "Symbol": "SGMART",
    "ISIN": "INE385F01024",
    "News": [
        {
            "Title": "SG Mart Completes ₹1,150 Crore Preferential Issue",
            "Summary": "SG Mart Limited has fully utilized all proceeds from its ₹1,150 crore preferential issue, with the final ₹17.53 crore deployed during Q3 FY26 for working capital requirements.",
            "Sentiment": "positive",
            "PublishDate": 1769155831548,
            "Source": "stocks"
        },
        {
            "Title": "SG Mart Q3 Net Profit Drops 60% to ₹110 Million",
            "Summary": "SG Mart reported consolidated net profit of ₹110 million in Q3, marking a significant 60% decline from ₹276 million in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1769152100407,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sameer Gupta to Acquire 35.08% Stake in SG Mart Limited Through Family Gift Transfer",
            "Summary": "Sameer Gupta will acquire 4.42 crore equity shares of SG Mart Limited, representing 35.08% of the company's total shareholding, through gift transfers from immediate family members. The acquisition involves receiving 3.28 crore shares from his son Dhruv Gupta and 1.14 crore shares from his wife Meenakshi Gupta on or after November 11, 2025. The transaction is structured as an inter-family transfer by way of gift with no monetary consideration involved. Following completion of this transaction, Sameer Gupta will be classified as a Promoter of the company. The transfer is exempt from open offer requirements under SEBI regulations as it constitutes an inter-se transfer between immediate relatives. Post-transaction, Dhruv Gupta's shareholding will reduce from 27.22% to 1.19%, while Meenakshi Gupta's stake will decrease from 9.05% to 0%.",
            "Sentiment": "neutral",
            "PublishDate": 1762182563865,
            "Source": "corporate_action"
        },
        {
            "Title": "SG Mart Revises FY26 EBITDA Target, Cites Weak Q2 Performance",
            "Summary": "SG Mart management announced that the company will not achieve its FY26 EBITDA target of ₹200 crore due to lower-than-expected Q2 performance. The company expects Q3 FY26 performance to be similar to Q2 levels, with recovery projected to begin in Q4 FY26.",
            "Sentiment": "negative",
            "PublishDate": 1761997582057,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart Faces Margin Pressure from Steel Trading Decline and Renewable Business Costs",
            "Summary": "SG Mart's Executive Director reported that the company's margins are experiencing pressure due to reduced earnings from steel trading operations and elevated costs associated with their new renewable energy business segment.",
            "Sentiment": "negative",
            "PublishDate": 1761816588804,
            "Source": "stock"
        },
        {
            "Title": "SG MART Reports 66% Jump in Quarterly Net Profit to 265M Rupees",
            "Summary": "SG MART reported consolidated net profit of 265 million rupees for the quarter, compared to 159.5 million rupees in the same period last year. The company's EBITDA increased to 280 million rupees from 149 million rupees year-over-year. EBITDA margin improved to 1.64% from 0.83% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761815719318,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart to List 12.6 Crore Equity Shares on NSE from September 12",
            "Summary": "SG Mart will list 12.6 crore equity shares on the National Stock Exchange (NSE) starting September 12. The listing represents the company's entry into public trading on the exchange platform.",
            "Sentiment": "neutral",
            "PublishDate": 1757507389188,
            "Source": "stock"
        },
        {
            "Title": "SG Mart Sees Rs 116.06 Crore Block Trade on BSE",
            "Summary": "SG Mart executed a block trade worth Rs 116.06 crores on BSE involving approximately 3,543,938 shares at Rs 327.5 per share. The transaction was conducted through multiple blocks.",
            "Sentiment": "neutral",
            "PublishDate": 1756971581659,
            "Source": "order&deals"
        },
        {
            "Title": "SG Mart Reports 3% EBITDA Margin Despite 50% Volume Drop in Q1FY26, Maintains Rs 200 Crore Full-Year Guidance",
            "Summary": "SG Mart Limited reported quarterly results with EBITDA margins exceeding 3% despite a significant volume decline due to steel supply shortages. The company's B2B metal trading volumes dropped approximately 50% as Indian steel producers' sales volumes declined 11% versus the previous quarter. The service center business now operates at 40,000 tons monthly from 5 operational centers in Ghaziabad, Raipur, Bangalore, Pune, and Dubai, contributing 50% to revenue and 60% to EBITDA. The company added two leased service centers in Indore and Ahmedabad for Q2 operations. TMT business volumes increased to 39,000 tons from 33,000 tons in the previous quarter. The newly launched renewable business secured an order book of Rs 285 crores, executable over 6 months, with expectations of Rs 400-500 crores annual business. Working capital days improved to 15 days, generating 21% ROCE on an annualized basis. Management maintains full-year EBITDA guidance of Rs 200 crores, expecting quarterly improvements from Q2 onwards as new steel capacity of 7 million tons becomes operational in the second half through Jindal Steel and Power and Jindal Stainless blast furnaces.",
            "Sentiment": "neutral",
            "PublishDate": 1753966419799,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart Limited Shares Audio Recording of Investor Conference Call on Quarterly Results",
            "Summary": "SG Mart Limited provided an audio recording link for a conference call held with investors and analysts on July 28, 2025, to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The recording is available on the company's investor relations website at https://sgmart.co.in/investor-relations/disclosures-regulation-30/. The company was formerly known as Kintech Renewables Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1753708029566,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart Reports 23% Jump in Q1 Net Profit to 323 Million Rupees",
            "Summary": "SG Mart delivered strong Q1 financial performance with consolidated net profit rising to 323 million rupees from 263 million rupees in the previous year, marking a 23% year-on-year increase. Revenue grew modestly to 11.44 billion rupees compared to 11.33 billion rupees last year. The company's EBITDA showed significant improvement, jumping to 359 million rupees from 247 million rupees, while EBITDA margin expanded to 3.14% from 2.18% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1753662621299,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart Projects 50% Annual Growth Over Next Three Years",
            "Summary": "SG Mart anticipates achieving 50% annual growth over the next three years. The company's growth strategy is supported by three key initiatives: expanding service centers nationwide, investing in eco-friendly infrastructure, and strengthening B2B supply chain connections.",
            "Sentiment": "positive",
            "PublishDate": 1753449877478,
            "Source": "stock"
        },
        {
            "Title": "SG Mart Reports 45% Jump in Quarterly EBITDA to 359 Million Rupees",
            "Summary": "SG Mart reported quarterly EBITDA of 359 million rupees compared to 247 million rupees in the same period last year, representing a year-over-year increase. The company's EBITDA margin improved to 3.14% from 2.18% in the previous year, indicating enhanced operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1753444707325,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart Limited Approves Q1 2025 Results, Board Changes, and New Employee Stock Option Plan",
            "Summary": "SG Mart Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing consolidated revenue of ₹1,143.77 crores and net profit of ₹32.31 crores. The company appointed Arun Agarwal as Non-Executive Director effective July 25, 2025, while Whole Time Director Shiv Kumar Bansal resigned effective July 31, 2025, citing personal reasons. The Board recommended M/s. Parikh & Associates as Secretarial Auditors for five years from the 40th AGM to the 45th AGM in 2030. Additionally, the company approved re-pricing of unexercised stock options under the existing 2023 scheme and instituted a new 'SG Mart Employees Stock Option Plan 2025' covering 20 lakh options exercisable into equity shares of ₹1 face value each. The new ESOP will be implemented through a trust route with secondary market acquisitions. All appointments and the ESOP plans are subject to shareholder approval at the upcoming Annual General Meeting.",
            "Sentiment": "neutral",
            "PublishDate": 1753444677340,
            "Source": "corporate_action"
        },
        {
            "Title": "SG MART Reports 23% Jump in Q1 Net Profit to 323 Million Rupees",
            "Summary": "SG MART posted a consolidated net profit of 323 million rupees in Q1, marking a 23% increase from 263 million rupees in the same period last year. The company's revenue grew marginally to 11.44 billion rupees compared to 11.33 billion rupees year-over-year, representing a 1% increase.",
            "Sentiment": "positive",
            "PublishDate": 1753444169180,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart Secures ₹266 Crore Contract",
            "Summary": "SG Mart has obtained a new contract valued at ₹266 crores. This contract is described as a significant achievement for the company, indicating its ongoing efforts to expand its market presence.",
            "Sentiment": "positive",
            "PublishDate": 1749888938000,
            "Source": "default"
        },
        {
            "Title": "SG Mart Launches Solar Module Mounting Structures",
            "Summary": "SG Mart has entered the renewable energy sector by launching solar module mounting structures under a new brand called APL Apollo Sunsteel. This move marks the company's expansion into the solar energy market.",
            "Sentiment": "positive",
            "PublishDate": 1749718105000,
            "Source": "default"
        },
        {
            "Title": "SG MART Secures ₹266 Crore Contract",
            "Summary": "SG MART has been awarded a contract valued at ₹266 crores. The news appears to be positive for the company, indicating a significant business development.",
            "Sentiment": "positive",
            "PublishDate": 1749718031000,
            "Source": "default"
        },
        {
            "Title": "SG Mart Reports Q4 Results and Approves Capex Plan",
            "Summary": "SG Mart has reported its Q4 financial results and approved a significant capital expenditure plan. The company's Q4 revenue increased to 13.5 billion rupees from 12.78 billion rupees year-over-year. However, Q4 EBITDA decreased to 245.4 million rupees from 318.3 million rupees, with EBITDA margin falling to 1.82% from 2.49%. Net profit for Q4 declined to 222.8 million rupees from 336 million rupees year-over-year and 276.3 million rupees quarter-over-quarter. Additionally, SG Mart has approved a capex plan of 6 billion rupees for capacity increase.",
            "Sentiment": "neutral",
            "PublishDate": 1747395833000,
            "Source": "default"
        },
        {
            "Title": "SG Mart to Consider Q4 Results on May 16",
            "Summary": "SG Mart has announced that it will consider its fourth quarter financial results on May 16. This indicates that the company is preparing to release its earnings report for the most recent fiscal quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1746456194000,
            "Source": "default"
        },
        {
            "Title": "SG Mart Reports Strong Q3 Financial Results",
            "Summary": "SG Mart has announced its financial results for the third quarter. The company's net profit increased significantly to 276 million rupees, up from 172 million rupees in the same period last year. Revenue also saw substantial growth, reaching 12.82 billion rupees compared to 7.48 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1737678310000,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart Reports Mixed Q3 Financial Results",
            "Summary": "SG Mart's Q3 EBITDA increased to 208 million rupees from 166 million rupees year-over-year. However, the EBITDA margin decreased to 1.63% from 2.23% in the same period last year. This indicates higher earnings but lower profitability in terms of margin.",
            "Sentiment": "neutral",
            "PublishDate": 1737630248000,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart Reports Significant Increase in Q3 Net Profit and Revenue",
            "Summary": "SG Mart has announced its Q3 financial results, showing substantial year-over-year growth. The company's net profit increased to 276 million rupees from 172 million rupees in the same quarter last year. Revenue also saw a significant rise, reaching 12.82 billion rupees compared to 7.48 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1737630244000,
            "Source": "earnings"
        },
        {
            "Title": "SG Mart Ltd Block Trade: 1.56 Million Shares Sold for Rs. 57.54 Crores",
            "Summary": "A significant block trade occurred on the Bombay Stock Exchange (BSE) for SG Mart Ltd. Approximately 1,555,144 shares were traded at a price of Rs. 370.00 per share, totaling Rs. 57.54 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1735203169000,
            "Source": "block_deals"
        },
        {
            "Title": "SG Mart Reports Q2 EBITDA Growth, Margin Decline",
            "Summary": "SG Mart announced its Q2 financial results. The company's EBITDA increased to 153 million rupees from 114 million rupees year-over-year. However, the EBITDA margin decreased to 0.84% from 2.25% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731329302000,
            "Source": "result"
        },
        {
            "Title": "SG MART Reports Strong Q2 Financial Results",
            "Summary": "SG MART has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit reached 160 million rupees, up from 90 million rupees in the same quarter last year and 263 million rupees in the previous quarter. Revenue for Q2 increased substantially to 18 billion rupees, compared to 5.1 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731329218000,
            "Source": "result"
        }
    ]
}