{
    "Symbol": "SHAH",
    "ISIN": "INE482J01021",
    "News": [
        {
            "Title": "Shah Metacorp Q3FY26 Results Show Mixed Performance",
            "Summary": "Shah Metacorp Limited reported Q3FY26 consolidated revenue of ₹5,003.97 lakhs with net profit of ₹71.60 lakhs. Company initiated ₹50 crore rights issue process and increased authorized capital to ₹130 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1770905214469,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shah Metacorp Approves ₹50 Cr Rights Issue & US Investment",
            "Summary": "Shah Metacorp Limited board approves rights issue worth up to ₹50.00 crores and USD 100,000.00 investment in US subsidiary. Company also modifies loan agreement for debt-to-equity conversion.",
            "Sentiment": "positive",
            "PublishDate": 1767027743558,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shah Metacorp faces NCLT insolvency application",
            "Summary": "Tejomay Exim Corporation has filed an insolvency application against Shah Metacorp Limited under Section 9 of IBC, 2016 at NCLT Ahmedabad. Financial implications remain undetermined.",
            "Sentiment": "negative",
            "PublishDate": 1766514296179,
            "Source": "stocks"
        },
        {
            "Title": "Shah Metacorp Receives Stock Exchange Approval for Listing 25.58 Crore Equity Shares",
            "Summary": "Shah Metacorp Limited received listing approval from BSE and NSE for 25,58,32,190 equity shares of Re. 1 each issued at premium of Rs. 3.71, comprising shares issued to non-promoters on preferential basis and shares issued to promoters and non-promoters pursuant to share swap. The approvals were granted by BSE on November 14, 2025 and NSE on December 1, 2025, with trading approval pending completion of additional regulatory requirements including confirmation from depositories.",
            "Sentiment": "positive",
            "PublishDate": 1764701175648,
            "Source": "corporate_action"
        },
        {
            "Title": "Shah Metacorp Reports No Deviation in Rs 1,700 Crore Preferential Allotment Fund Utilization",
            "Summary": "Shah Metacorp Limited confirmed no deviation or variation in the utilization of funds raised through multiple preferential allotments totaling Rs 1,700.31 lakhs conducted between July 2-5, 2025, for working capital, debt repayment, and share swapping purposes. The company's statement for the quarter ended September 30, 2025, shows all funds were utilized according to the original objects stated in the Letter of Offer, with audit committee review confirming compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1763204744402,
            "Source": "earnings"
        },
        {
            "Title": "Shah Metacorp Receives Trading Approval for 3.55 Crore Equity Shares from NSE and BSE",
            "Summary": "Shah Metacorp Limited has received trading approval from NSE and BSE for 3,55,00,000 equity shares of Re. 1/- each. These shares were allotted pursuant to conversion of warrants issued on preferential basis to promoters at an issue price of Rs. 4.02 per share (Re. 1/- face value plus Rs. 3.02 premium). The shares are listed and admitted for trading from November 3, 2025, with a lock-in period until May 2, 2027. The allotment date was August 9, 2025. These new shares rank pari-passu with existing equity shares of the company.",
            "Sentiment": "positive",
            "PublishDate": 1761976568326,
            "Source": "corporate_action"
        },
        {
            "Title": "Shah Metacorp Reports Net Profit of ₹252.97 Lakhs in Q1 FY2026, Raises ₹3,738 Lakhs Through Preferential Issues",
            "Summary": "Shah Metacorp Limited reported unaudited standalone financial results for the first quarter of FY2026. The company posted a net profit of ₹252.97 lakhs with revenue from operations at ₹2,889.95 lakhs and total income of ₹2,960.69 lakhs. Basic earnings per share stood at ₹0.04. The company raised funds through six preferential issues totaling ₹3,738.84 lakhs, including ₹1,788.9 lakhs from warrant conversions and multiple issues ranging from ₹235.5 lakhs to ₹522.81 lakhs. The funds were allocated for working capital, debt repayment, capital expenses including solar installation and plant machinery upgradation, and general corporate purposes. Total financial indebtedness stands at ₹17.08 lakhs. The company operates in a single segment of S.S Products.",
            "Sentiment": "positive",
            "PublishDate": 1755023546480,
            "Source": "earnings"
        },
        {
            "Title": "Shah Alloys Reports Q1 Results, Approves Cost Auditor Appointment and Share Capital Increase",
            "Summary": "Shah Alloys Limited reported its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board approved the appointment of M/s. R J & Associates as cost auditor for financial year 2025-2026, subject to shareholder ratification. The company proposed increasing its authorized share capital from Rs. 110 crores to Rs. 130 crores, subject to shareholder approval. The board also approved related party transactions with promoter group companies and remuneration for CEO Viral Shah, both requiring shareholder approval. The 26th Annual General Meeting is scheduled for September 30, 2025, to be held through video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1754983635721,
            "Source": "earnings"
        },
        {
            "Title": "Shah Metacorp Appoints DDH & Associates as Internal Auditor Following Firm Merger",
            "Summary": "Shah Metacorp Limited has appointed M/s DDH & Associates, Chartered Accountants, as the new Internal Auditor for the Financial Year 2025-26, following the merger of their previous auditor M/s. J N A D & Co. with DDH & Associates. The Board had initially appointed J N A D & Co. as Internal Auditors in June 2025, but due to the firm merger, DDH & Associates will now conduct the internal audit. The appointment was approved by the Board based on the Audit Committee's recommendation. DDH & Associates is a two-partner firm with expertise in audits, taxation, company law matters, and fund raising, with partners CA Deep Shah and CA Dhruv Zaveri bringing specialized experience in direct taxation, indirect taxation, and auditing across various industries.",
            "Sentiment": "neutral",
            "PublishDate": 1753165223065,
            "Source": "corporate_governance"
        }
    ]
}