{
    "Symbol": "SHAHALLOYS",
    "ISIN": "INE640C01011",
    "News": [
        {
            "Title": "Shah Alloys Board Approves Rs 18 Cr OTS with HDFC Bank",
            "Summary": "Shah Alloys Limited's board approved a One Time Settlement of Rs 18 crore with HDFC Bank on January 27, 2026, ending a legal battle that began in 2019 at the Debt Recovery Tribunal.",
            "Sentiment": "positive",
            "PublishDate": 1769522566067,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shah Alloys Reports Rs 35.76 Crore Profit Despite Plant Closure, Sells Rolling Mill for Rs 1,700 Crore",
            "Summary": "Shah Alloys Limited posted a standalone net profit of Rs 35.76 crore for the quarter ended September 30, 2025, driven by an exceptional gain of Rs 16.92 crore from selling its 16-inch Rolling Mill Plant for Rs 1,700 lakhs. The company shut down its Iron and Steel plant in August 2025 due to technology obsolescence and rising production costs, raising concerns about its going concern status among auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1763141139914,
            "Source": "earnings"
        },
        {
            "Title": "Shah Alloys Divests Stake in Associate Company S.A.L Steel Limited to Sree Metaliks",
            "Summary": "Shah Alloys Limited approved the divestment of its equity shareholding in associate company S.A.L Steel Limited. The company will sell 3,02,56,989 equity shares of face value ₹10 each to Sree Metaliks Limited through a Share Purchase Agreement dated September 04, 2025. The transaction will result in Sree Metaliks being classified as the new promoter of S.A.L Steel Limited, while existing promoters will be reclassified as public shareholders. Additionally, the board appointed Shri Rajnikant Amrutlal Vyas as Additional Director designated as Whole-time Director with effect from September 04, 2025, for a period of 5 years subject to shareholder approval. Vyas brings over 25 years of experience in sales, marketing, and operations management. The board also approved the notice for the 35th Annual General Meeting to be held on September 26, 2025, through video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1756984850354,
            "Source": "order&deals"
        },
        {
            "Title": "Shah Alloys Appoints Independent Director, Shuts Down Iron & Steel Plant Operations",
            "Summary": "Shah Alloys Ltd appointed Smt Nipa Jairaj Shah as Additional Non-Executive Independent Director for five years, effective August 14, 2025, subject to shareholder approval. The company also approved continuation of Shri Ashok Sharma as Whole Time Director despite reaching 70 years of age. The Board approved the 35th Annual General Meeting scheduled for September 26, 2025. The company declared closure of its Iron and Steel plant at Santej, Gujarat by end of August 2025 due to technology obsolescence and higher production costs causing persistent losses. For the quarter ended June 30, 2025, the company reported a net loss of Rs 2.83 crores compared to Rs 19.36 crores loss in the previous year quarter. Revenue from operations was Rs 23.64 crores versus Rs 29.76 crores in the corresponding previous quarter. The auditors expressed concerns about the company's going concern status due to the plant closure.",
            "Sentiment": "negative",
            "PublishDate": 1755163416883,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shah Alloys Limited to Close Entire Iron and Steel Plant Operations in Gujarat Within One Month",
            "Summary": "Shah Alloys Limited's board approved the closure of its entire Iron and Steel Plant operations at Santej, Gujarat. The closure is expected to be completed within one month. The plant contributed 100% of the company's operations with revenue of Rs 26,728 lakh in FY 2024-25, but recorded a loss after tax of Rs 2,729 lakh. The company cited lack of competitiveness due to aging plant and machinery, technology obsolescence, and higher production costs that cannot be recovered from customers. The Iron and Steel Plant has been making losses for several years. The company plans to explore new options following the shutdown.",
            "Sentiment": "negative",
            "PublishDate": 1753156516555,
            "Source": "stock"
        }
    ]
}