{
    "Symbol": "SHAILY",
    "ISIN": "INE151G01028",
    "News": [
        {
            "Title": "Shaily Engineering Plastics Q3FY26 Results Show Growth",
            "Summary": "Shaily Engineering Plastics reports strong Q3FY26 performance with 27% revenue growth to Rs. 250.5 crores and 48% PAT increase to Rs. 37.4 crores.",
            "Sentiment": "positive",
            "PublishDate": 1770901002996,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shaily Engineering Plastics Q3FY26 Earnings Call Set",
            "Summary": "Shaily Engineering Plastics Limited announces earnings call on February 13, 2026 to discuss Q3FY26 and 9M FY26 operational and financial performance with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770285422875,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shaily Engineering Plastics Wins CII Innovation Award",
            "Summary": "Shaily Engineering Plastics Limited receives prestigious Top 50 Innovative Company award from Confederation of Indian Industry (CII) in recognition of its innovation excellence in December 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766143676991,
            "Source": "stocks"
        },
        {
            "Title": "Shaily Engineering Plastics Receives Best Exporter Award from Plexcouncil",
            "Summary": "Shaily Engineering Plastics Limited received the Best Exporter Award for Engineering Components of Plastics for FY2023-24 and FY2024-25 from The Plastics Export Promotion Council. The company was recognized for achieving the highest numbers of engineering plastic components exports by any Indian plastic manufacturer.",
            "Sentiment": "positive",
            "PublishDate": 1763373422447,
            "Source": "stock"
        },
        {
            "Title": "Amit Sanghvi Reduces Stake in Shailya Engineering Plastics Through Share Disposal",
            "Summary": "Promoter Amit Mahendra Sanghvi disposed of 1,00,000 shares in Shailya Engineering Plastics Limited, reducing his holding from 2.84% to 2.62% of the company's total share capital. The disposal represents 0.22% of the company's equity shares, with the transaction completed on November 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763364973184,
            "Source": "corporate_action"
        },
        {
            "Title": "Laxman Sanghvi Reduces Stake in Shaily Engineering Plastics",
            "Summary": "Laxman Sanghvi disposed of 50,000 shares (0.11%) in Shaily Engineering Plastics Limited, reducing his shareholding from 5.18% to 5.07%. The disposal was executed through off-market transaction, with the company maintaining total equity share capital of Rs. 9.19 crore comprising 4.59 crore shares of Rs. 2 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763361934899,
            "Source": "corporate_action"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Strong Q2 FY26 Results with 34% Revenue Growth",
            "Summary": "Shaily Engineering Plastics delivered robust quarterly results with revenue growing 34% to INR 257 crores and EBITDA margins expanding by over 1,000 basis points to 31.8%, driven by 163% growth in Healthcare segment. The company is expanding pen manufacturing capacity from 40 million to 80 million units by end of FY26 with INR 125 crores investment, while launching next-generation GLP-1 device Axiom Max and securing new projects across therapeutic areas.",
            "Sentiment": "positive",
            "PublishDate": 1763351809060,
            "Source": "earnings"
        },
        {
            "Title": "Morgan Stanley and Motilal Oswal Acquire Stakes in Shaily Engineering as Promoters Book Profits",
            "Summary": "Morgan Stanley purchased 40,000 shares worth Rs 10.34 crore and Motilal Oswal bought 50,000 shares at Rs 2,585.10 per share in Shaily Engineering through block deals, while promoters Amit Mahendra Sanghvi and Laxman Sanghvi sold 1 lakh and 50,000 shares respectively. The multibagger stock has delivered 147% returns over one year, with the company reporting 134% jump in net profit to Rs 51 crore and 34% revenue growth to Rs 259 crore in the September quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763129334765,
            "Source": "order&deals"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Strong Q2 Results with 14% Revenue Growth",
            "Summary": "Shaily Engineering Plastics Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported consolidated revenue from operations of Rs 24,600.27 lakhs compared to Rs 21,621.02 lakhs in the same quarter last year, representing growth of approximately 14%. Net profit after tax increased to Rs 5,254.6 lakhs from Rs 4,143.4 lakhs in the previous year's corresponding quarter. For the half-year period, consolidated revenue reached Rs 49,200.84 lakhs versus Rs 42,330.17 lakhs in the prior year. The company operates in manufacturing of customised components of plastic and other materials. Basic earnings per share for the quarter stood at Rs 11.44 compared to Rs 9.02 in the same quarter last year. The Board of Directors approved these unaudited standalone and consolidated financial results in their meeting held on November 8, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762610076969,
            "Source": "earnings"
        },
        {
            "Title": "Shaily Engineering Plastics Grants 94,500 Stock Options to Employees",
            "Summary": "Shaily Engineering Plastics Limited's Nomination and Remuneration Committee approved the grant of 94,500 stock options to eligible employees under the Shaily Employee Stock Option Plan 2019. The options cover equity shares with a face value of Rs. 2 each and will vest in three equal tranches over three years - one-third each after completion of one, two, and three years from the grant date. The pricing formula is set at one-third of the market price on the vesting date for each tranche. Options can be exercised within four years from the vesting date. The company's members had previously approved the ESOP 2019 plan authorizing up to 131,570 employee stock options, with the numbers adjusted following a share subdivision from Rs. 10 to Rs. 2 face value per share.",
            "Sentiment": "positive",
            "PublishDate": 1762603685509,
            "Source": "corporate_action"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Strong Q2 Performance with 134% Jump in Net Profit",
            "Summary": "Shaily Engineering Plastics delivered robust quarterly results with consolidated net profit surging to 512.5 million rupees from 219.2 million rupees year-over-year. Revenue increased to 2.57 billion rupees compared to 1.92 billion rupees in the same period last year. EBITDA rose significantly to 793 million rupees from 403 million rupees, while EBITDA margin expanded to 30.91% from 20.97% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762602728077,
            "Source": "earnings"
        },
        {
            "Title": "Shaily Engineering Plastics Grants USD 1 Million Unsecured Loan to Dubai Subsidiary",
            "Summary": "Shaily Engineering Plastics Limited has granted an unsecured loan of up to USD 1 million to its wholly owned subsidiary, Shaily Innovations FZCO in Dubai, UAE. The loan carries an 8% annual interest rate with a maximum tenure of 10 years. The subsidiary will use the funds for capital expenditure, business development, and operational expenses during its initial phase. The funds were remitted on October 29, 2025. The transaction qualifies as a related party transaction conducted at arm's length, as the borrower is a 100% owned subsidiary of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761910927774,
            "Source": "corporate_action"
        },
        {
            "Title": "Shaily Engineering Plastics Shares Drop 13% Following Dr. Reddy's Semaglutide Approval Delay",
            "Summary": "Shaily Engineering Plastics shares fell 13% on Thursday, marking the worst single-day decline since May 2022. The drop followed news that Dr. Reddy's Laboratories experienced a delay in approval for its Semaglutide injection in the Canadian market. Dr. Reddy's is listed as a top client for Shaily Engineering in the pharmaceutical sector. The healthcare segment now contributes 31% to Shaily's revenue mix, doubled from previous levels. The company has installed 19 injection molding machines and added capacity for 25 million pens annually to meet increased customer demand. Shaily plans additional capacity of 25 million pens for another Semaglutide pen variant, with total planned capex of ₹125 crore. The company's Managing Director stated they hold 60% of the generic market share on Semaglutide across opening markets. Dr. Reddy's shares also declined 5% on Thursday. Despite the fall, Shaily's stock has gained over 65% in 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761798221014,
            "Source": "stock"
        },
        {
            "Title": "ADIA and Other Institutional Investors Acquire 2.9% Stake in Shaily Engineering Plastics for ₹284 Crore",
            "Summary": "Abu Dhabi Investment Authority (ADIA), Motilal Oswal Mutual Fund, BofA Securities, Societe Generale, and other institutional investors collectively purchased over 13 lakh shares representing a 2.9% stake in Shaily Engineering Plastics Ltd for ₹284 crore through open market transactions. The buyers included 360 One Group, Aditya Birla Sun Life Mutual Fund, Trust Mutual Fund, Stallion Asset Pvt Ltd, Samyak Enterprises, and Subhkam Ventures I. They acquired 13,33,155 shares at an average price of ₹2,134 per share. Private equity firm Lighthouse Funds sold the shares through its arm Lighthouse India Fund III Ltd in 11 tranches at the same price. Lighthouse's holding in the company decreased to 1.37% from 4.27%. Promoters and promoter group entities held a 43.72% stake as of June 2025. Shaily Engineering Plastics shares surged 11.91% to close at ₹2,408.15 on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1759852216565,
            "Source": "order&deals"
        },
        {
            "Title": "Shaily Engineering Surges Over 7% as Stock Continues Strong Performance",
            "Summary": "Shaily Engineering Plastics Ltd. shares rose over 7% to Rs 2,324 on Tuesday, following a 2.45% gain on Monday. The stock has delivered strong returns across multiple timeframes: 3.26% in one month, 40.42% in three months, 53.90% in six months, and 142.84% over 12 months. The company, established in 1987 by Mike Sanghvi, operates as India's largest exporter of plastic components with over 2,000 employees across seven manufacturing units and more than 200 injection molding machines. Shaily supplies to medical, healthcare, consumer, and automotive sectors, specializing in high-performance polymers and serving as the only licensed processor of Torlon in India. Trading volume reached 45 times the 30-day average with an RSI of 56. Among four analysts covering the stock, two recommend 'buy' and two suggest 'hold', with the average price target indicating 3.7% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1759813188038,
            "Source": "stock"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Strong Q1 FY26 Results with 38% Revenue Growth",
            "Summary": "Shaily Engineering Plastics delivered robust quarterly results with revenue rising 38% to ₹246.7 crores. The healthcare segment was the primary growth driver, surging 181% to ₹77.2 crores and now contributing 31% of total revenue. EBITDA jumped 95% to ₹70.4 crores with margins expanding to 28.5%, while PAT increased 136% to ₹41.1 crores. The company started commercial manufacturing of GLP-1 pens for semaglutide and is expanding capacity with plans to add 25 million pens per annum by end of Q2 FY26. Consumer segment revenue grew 14% to ₹151.4 crores, while industrial segment declined to ₹18.1 crores. Exports accounted for 76% of total revenue. The company processed 7,016 tonnes of polymers with machine utilization improving to 49%. Management expects the healthcare segment to drive significant revenue and profitability growth, with total planned capex of ₹125 crores for capacity expansion.",
            "Sentiment": "positive",
            "PublishDate": 1755508916648,
            "Source": "earnings"
        },
        {
            "Title": "Shaily Engineering Targets Growth Through Healthcare Expansion and GLP-1 Drug Delivery Devices",
            "Summary": "Shaily Engineering is pursuing rapid growth through healthcare sector expansion, new FMCG achievements, and increased export efforts. The company is utilizing high-profit GLP-1 drug delivery devices and maintains a strong balance sheet with ROCE exceeding 40%.",
            "Sentiment": "positive",
            "PublishDate": 1754923187818,
            "Source": "stock"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Quarterly Results, Re-appoints Whole-time Director",
            "Summary": "Shaily Engineering Plastics Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹20,328.41 lakhs and net profit of ₹2,376.10 lakhs for the quarter. Consolidated revenue stood at ₹24,669.27 lakhs with net profit of ₹4,112.27 lakhs. The Board re-appointed Mrs. Tilottama Sanghvi as Whole-time Director for three years from February 1, 2026 to January 31, 2029, subject to shareholder approval at the 45th Annual General Meeting. The company set September 19, 2025 as the record date for final dividend distribution for FY 2024-25. Additionally, the Board approved a revised Code of Conduct for Prevention of Insider Trading. During the quarter, the company invested AED 100,000 in its wholly owned subsidiary Shaily Innovations FZCO in Dubai.",
            "Sentiment": "positive",
            "PublishDate": 1754905170224,
            "Source": "earnings"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Strong Q1 Growth with Revenue Up 37% Year-on-Year",
            "Summary": "Shaily Engineering Plastics delivered robust quarterly performance with revenue rising to 2.45 billion rupees from 1.79 billion rupees year-on-year. The company's EBITDA nearly doubled to 683 million rupees compared to 354 million rupees in the previous year, while EBITDA margin expanded significantly to 27.7% from 19.75%. Consolidated net profit more than doubled to 411 million rupees from 174 million rupees year-on-year, reflecting strong operational efficiency and profitability improvements.",
            "Sentiment": "positive",
            "PublishDate": 1754904556094,
            "Source": "earnings"
        },
        {
            "Title": "Shaily Engineering Plastics: Multibagger Stock Soars 300% Since Listing",
            "Summary": "Shaily Engineering Plastics Ltd. has become a multibagger, rising over 300% since its listing two years ago. The company reported strong Q4 results with revenue up 27.7% and net profit increasing 47.9% year-on-year. Ashish Kacholia holds a 3.22% stake in the company.",
            "Sentiment": "positive",
            "PublishDate": 1750822416000,
            "Source": "earnings"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Strong Q4 Results and Dividend",
            "Summary": "Shaily Engineering Plastics has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 545 million rupees from 347 million rupees, with EBITDA margin rising to 25.02% from 20.34%. Consolidated net profit grew to 286 million rupees from 193 million rupees in the previous year. Revenue for Q4 reached 2.2 billion rupees, up from 1.7 billion rupees. Additionally, the company has recommended a dividend of 2 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747142549000,
            "Source": "result"
        },
        {
            "Title": "Shaily Engineering Plastics to Consider Q4 Results on May 13",
            "Summary": "Shaily Engineering Plastics has announced that it will consider its fourth quarter (Q4) financial results on May 13. This announcement indicates the company's scheduled board meeting to review and approve the financial performance for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746451891000,
            "Source": "default"
        },
        {
            "Title": "Shaily Engineering Plastics Ltd: Oral GLP-1 Success May Impact Device Demand",
            "Summary": "Eli Lilly's successful phase 3 trial of oral GLP-1 drug orforglipron could affect demand for GLP-1 devices manufactured by Shaily Engineering. The company plans to double pen capacity but oral alternatives may impact future demand. Shaily's shares fell 9.77% following the news.",
            "Sentiment": "negative",
            "PublishDate": 1745292591000,
            "Source": "normal_news"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Strong Q3 Financial Results",
            "Summary": "Shaily Engineering Plastics has announced its consolidated financial results for the third quarter. The company's net profit increased significantly to 252 million rupees, compared to 145 million rupees in the same period last year. Revenue also saw substantial growth, reaching 1.98 billion rupees, up from 1.58 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739146176000,
            "Source": "earnings"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Improved Q3 EBITDA and Margin",
            "Summary": "Shaily Engineering Plastics has announced its Q3 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 459 million rupees from 319 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 23.22% from 20.11% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739017835000,
            "Source": "earnings"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Strong Q3 Financial Results",
            "Summary": "Shaily Engineering Plastics has announced its Q3 consolidated financial results. The company's net profit increased to 252 million rupees, up from 145 million rupees in the same quarter last year. Revenue also saw growth, reaching 1.98 billion rupees compared to 1.58 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739017832000,
            "Source": "earnings"
        },
        {
            "Title": "Shaily Engineering Plastics: Small-Cap Stock Soars 900% in 4 Years",
            "Summary": "Shaily Engineering Plastics, a leading exporter of engineered plastic products, has seen its stock price surge 910% in the last four years, reaching ₹1,513. The company is focusing on expanding its healthcare segment, which doubled its revenue to ₹107 crore in FY24. Shaily aims for medical devices to account for 25% of revenues in the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1738307040000,
            "Source": "normal_news"
        },
        {
            "Title": "Shaily Engineering Plastics Incorporates New Unit in Dubai",
            "Summary": "Shaily Engineering Plastics has announced the incorporation of a new unit, Shaily Innovations Fzco, in Dubai. This new entity will focus on the design and development of drug delivery device contracts.",
            "Sentiment": "positive",
            "PublishDate": 1735863365000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shaily Engineering Plastics Incorporates New Unit in Dubai",
            "Summary": "Shaily Engineering Plastics has announced the incorporation of a new unit, Shaily Innovations FZCO, in Dubai. This new entity will focus on the design and development of drug delivery device contracts.",
            "Sentiment": "positive",
            "PublishDate": 1735829534000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Strong Q2 Financial Performance",
            "Summary": "Shaily Engineering Plastics has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 236 million rupees to 403 million rupees. Additionally, the EBITDA margin expanded from 14.96% to 20.97%.",
            "Sentiment": "positive",
            "PublishDate": 1730114391000,
            "Source": "result"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Q2 Revenue Growth",
            "Summary": "Shaily Engineering Plastics has announced its Q2 revenue, which stands at 1.9 billion rupees, compared to 1.57 billion rupees in the same quarter last year. This represents a year-over-year increase in revenue for the company.",
            "Sentiment": "positive",
            "PublishDate": 1730114382000,
            "Source": "result"
        },
        {
            "Title": "Shaily Engineering Plastics Reports Q2 Profit Growth",
            "Summary": "Shaily Engineering Plastics has reported a consolidated net profit of 219 million rupees for the second quarter, showing significant growth compared to both the previous year (108 million rupees) and the previous quarter (174 million rupees).",
            "Sentiment": "positive",
            "PublishDate": 1730114375000,
            "Source": "result"
        }
    ]
}