{
    "Symbol": "SHAKTIPUMP",
    "ISIN": "INE908D01010",
    "News": [
        {
            "Title": "Shakti Pumps Board Meet on Feb 13 for Q3FY26 Results",
            "Summary": "Shakti Pumps (India) Limited has scheduled a board meeting on February 13, 2026, to consider and approve unaudited Q3FY26 financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770397073769,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps ESG Rating Improves to 67.6 for FY25",
            "Summary": "Shakti Pumps (India) Limited reports ESG rating improvement from 60.7 in FY24 to 67.6 for FY25, as assessed by SEBI-registered SES ESG Research Private Limited in an independent evaluation.",
            "Sentiment": "positive",
            "PublishDate": 1769245914372,
            "Source": "stocks"
        },
        {
            "Title": "Shakti Pumps Invests ₹750 Crores in Subsidiary",
            "Summary": "Shakti Pumps (India) Limited announces significant capital investment of ₹750 million in its subsidiary operations, marking a major strategic expansion move.",
            "Sentiment": "positive",
            "PublishDate": 1768572890660,
            "Source": "stocks"
        },
        {
            "Title": "Shakti Pumps Invests ₹75 Cr in Solar Manufacturing",
            "Summary": "Shakti Pumps invests ₹75 crores in subsidiary Shakti Energy Solutions for establishing 2.20 GW solar DCR cell and PV modules manufacturing plant in Pithampur, Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1768569914505,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps gains 7% on ₹654 cr Karnataka order win",
            "Summary": "Shakti Pumps India shares jumped 7% after securing a ₹654.03 crore order for 16,780 solar water pumps in Karnataka under PM-KUSUM scheme, strengthening its order book to ₹1,300 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768197560544,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Secures ₹654 Cr Solar Pump Order",
            "Summary": "Shakti Pumps has won a significant solar pump order worth ₹654 crores, marking a major milestone for the company's solar pumping solutions business and strengthening its market position.",
            "Sentiment": "positive",
            "PublishDate": 1768188022811,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Wins ₹654 Cr Karnataka Solar Order",
            "Summary": "Shakti Pumps (India) Limited secures major contract from Karnataka Renewable Energy Development Limited for 16,780 solar water pumping systems worth ₹654.03 crores under PM-KUSUM scheme.",
            "Sentiment": "positive",
            "PublishDate": 1768187695254,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Wins ₹23.54 Cr Solar Pump Order",
            "Summary": "Shakti Pumps India secures order from Haryana Renewable Energy Department for 792 solar water pumping systems worth ₹23.54 crores under PM-KUSUM scheme with 90-day completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767336667745,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Wins ₹67.32 Cr Solar Pump Order",
            "Summary": "Shakti Pumps India secures major order worth ₹67.32 crores from Madhya Pradesh Urja Vikas Nigam Limited for supply of 1,952 off-grid DC solar pumping systems with 120-day delivery timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767250625814,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Shares Rise 4% on ₹170 Cr Order Win",
            "Summary": "Shakti Pumps secured ₹170.25 crore order from MP Urja Vikas Nigam for 4,840 solar pumps under PM-KUSUM scheme. Stock gains 4% post announcement, marking third order this month.",
            "Sentiment": "positive",
            "PublishDate": 1767158112712,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Secures ₹21 Cr Solar Pump Order",
            "Summary": "Shakti Pumps receives third order from Jharkhand for 1,000 solar water pumping systems worth ₹21.00 crores under PM-KUSUM scheme, to be completed within 120 days.",
            "Sentiment": "positive",
            "PublishDate": 1767080161543,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Wins ₹21 Cr Solar Pump Order",
            "Summary": "Shakti Pumps India secures ₹21 crore order from Jharkhand Renewable Energy Development Agency for supply of 1,000 solar water pumps with 120-day completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767079903739,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Wins ₹65.20 Cr Solar Pump Order",
            "Summary": "Shakti Pumps secures major work order from Madhya Pradesh Urja Vikas Nigam Limited for 1,897 solar photovoltaic water pumping systems under PM-KUSUM scheme, valued at ₹65.20 crores including GST.",
            "Sentiment": "positive",
            "PublishDate": 1766567584126,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Secures ₹65 Crore Order",
            "Summary": "Shakti Pumps (India) Ltd has secured a significant order worth ₹65 crores, marking a notable business development for the capital goods company in the non-electrical equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1766567297800,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Wins ₹356.77 Cr Solar Pump Order",
            "Summary": "Shakti Pumps India receives approval from Maharashtra State Electricity Distribution Company for 12,883 off-grid DC solar pump systems worth ₹356.77 crores with 60-day completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1766469325782,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Secures ₹71.25 Cr Solar Pump Order",
            "Summary": "Shakti Pumps India receives significant order for 2,033 solar water pumping systems from Madhya Pradesh Urja Vikas Nigam, valued at ₹71.25 crores with 120-day completion timeline under PM-KUSUM scheme.",
            "Sentiment": "positive",
            "PublishDate": 1765524653057,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Wins ₹23.98 Cr Solar Pump Order",
            "Summary": "Shakti Pumps receives second order from Jharkhand for 1,200 solar water pumping systems under PM-KUSUM scheme worth ₹23.98 crores including GST from Jharkhand Renewable Energy Development Agency.",
            "Sentiment": "positive",
            "PublishDate": 1765520285135,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Wins ₹444 Crore Solar Pump Order",
            "Summary": "Shakti Pumps receives empanelment letter from Maharashtra State Electricity Distribution Company Limited for 16,025 off-grid DC solar photovoltaic water pumping systems worth ₹443.78 crores under PM Kusum B Scheme.",
            "Sentiment": "positive",
            "PublishDate": 1765435866850,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shakti Pumps Leads Maharashtra's Guinness World Record Solar Pump Installation with 8,846 Units",
            "Summary": "Maharashtra achieved a Guinness World Record by installing 45,911 solar water pumps in one month under the Magel Tyala Solar Pump initiative, with Shakti Pumps (India) Limited emerging as the largest contributor with 8,846 installations. The record-setting achievement reinforces Shakti Pumps' position as a national leader in solar pumping technology and demonstrates the company's strong engineering capabilities in renewable irrigation solutions.",
            "Sentiment": "positive",
            "PublishDate": 1765185160407,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps (India) Loses Independent Director and Audit Committee Chairperson",
            "Summary": "Mrs. Vandana Bhagavatula has resigned from her positions as Independent Director and Audit Committee Chairperson at Shakti Pumps (India). The resignation affects the company's board composition and audit committee leadership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1765151666921,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shakti Pumps Solar Project Targets ₹3,000 Crores Revenue with 15% EBITDA Margins",
            "Summary": "Shakti Pumps announced that its solar project could generate ₹3,000 crores in revenue at 75% capacity utilization, with projected EBITDA margins of 15% and a 3-year payback period. The company expects better performance in the second half compared to the first half, based on historical trends.",
            "Sentiment": "positive",
            "PublishDate": 1762831829511,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps Maintains FY26 Guidance of 20-25% Revenue Growth and 24% EBITDA Margins",
            "Summary": "Shakti Pumps has reaffirmed its guidance targeting 20-25% revenue growth and 24% EBITDA margins for FY26. The company expects to achieve a 120-day receivable cycle by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1762831332591,
            "Source": "stock"
        },
        {
            "Title": "Shakti Sons Trust Acquires Additional 27,000 Shares in Shakti Pumps",
            "Summary": "Shakti Sons Trust acquired 27,000 equity shares of Shakti Pumps (India) Limited through open market transactions. The acquisition increased the trust's shareholding from 2,26,18,600 shares (18.33%) to 2,26,45,600 shares (18.35%) of the company's total equity capital. The shares were acquired at Rs. 10 per share. Shakti Pumps has a total equity share capital of Rs. 123,39,79,650 comprising 12,33,97,965 equity shares of Rs. 10 each. The company's shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762782304646,
            "Source": "corporate_action"
        },
        {
            "Title": "Shakti Future Trust Acquires Additional 11,000 Shares in Shakti Pumps",
            "Summary": "Shakti Future Trust acquired 11,000 equity shares of Shakti Pumps (India) Limited through open market transactions. The acquisition increased the trust's shareholding from 90,05,000 shares (7.30%) to 90,16,000 shares (7.31%) of the company's total voting capital. The transaction represents a 0.01% increase in the trust's stake. Shakti Pumps has a total equity share capital of Rs. 123,39,79,650 comprising 12,33,97,965 equity shares of Rs. 10 each. The company's shares are listed on BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1762763278345,
            "Source": "corporate_action"
        },
        {
            "Title": "Shakti Pumps Reports Record Quarterly Revenue of Rs 6,664 Million Despite Extended Monsoon Impact",
            "Summary": "Shakti Pumps (India) Limited delivered record quarterly revenue of Rs 6,664 million in Q2 FY26, representing a 5% year-over-year growth despite extended monsoon conditions affecting installations. The company installed 22,304 solar pumps during the quarter, up 21% year-over-year. However, EBITDA margin declined to 20.4% from 23.4% in the previous year due to 3-4% increases in raw material prices including copper, steel, and solar panels. Profit after tax decreased to Rs 907 million from Rs 1,014 million in Q2 FY25. The company maintains a strong order book of Rs 13,000 million as of November 7, 2025, with Maharashtra leading in order inflows and execution. Export business showed momentum with revenue of Rs 1,029 million in Q2 FY26. The company's cash sales business generated revenue of Rs 428 million in H1 FY26, growing 67% year-over-year, while expanding solar rooftop operations into three new states. Receivables stood at Rs 16,390 million as of September 30, 2025, impacted by prolonged monsoon conditions affecting farmer urgency for pump operations. The company is progressing with its Rs 17,000 million capacity expansion plan and received an ESG rating of 75 from ICRA Ratings Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762688767956,
            "Source": "earnings"
        },
        {
            "Title": "Shakti Pumps Reports No Deviation in QIP Fund Utilization for September Quarter",
            "Summary": "Shakti Pumps (India) Limited submitted monitoring agency reports for two Qualified Institutional Placements (QIPs) conducted on March 22, 2024 and July 5, 2025, for the quarter ended September 30, 2025. India Ratings & Research Private Limited, the monitoring agency, reported no deviation from stated objectives for both QIPs. The first QIP raised ₹2,000 million through 16,54,944 equity shares at ₹1,208.50 per share, while the second QIP raised ₹2,925.60 million through 31,87,365 equity shares at ₹918.00 per share. Funds are being utilized for capacity expansion of pumps, motors, inverters, and solar projects, with unused proceeds invested in fixed deposits with various banks earning returns between 4.25% to 5.95%. The company has acquired 23.35 acres of land in Pithampur, Madhya Pradesh for manufacturing expansion, with acquisition of remaining 22.31 acres in process.",
            "Sentiment": "neutral",
            "PublishDate": 1762579859186,
            "Source": "corporate_action"
        },
        {
            "Title": "Shakti Pumps Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Shakti Pumps (India) reported Q2 consolidated net profit of 907 million rupees, down from 1.01 billion rupees year-over-year. Revenue increased to 6.66 billion rupees from 6.34 billion rupees in the same period last year. EBITDA declined to 1.36 billion rupees from 1.48 billion rupees year-over-year, while EBITDA margin compressed to 20.4% from 23.44% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762521827888,
            "Source": "earnings"
        },
        {
            "Title": "Shakti Pumps Schedules Earnings Call for Q2 FY2026 Results",
            "Summary": "Shakti Pumps (India) Limited will hold a conference call on November 10, 2025 at 2:00 PM IST to discuss its unaudited financial results for the quarter and half-year ended September 30, 2025. The earnings call will include key management representatives including Chairman Dinesh Patidar, Managing Director Ramesh Patidar, CFO Dinesh Patel, Company Secretary Ravi Patidar, and CEO of Shakti Energy Solutions Limited Ramakrishna Sataluri. Dial-in details and contact information for Ernst & Young LLP have been provided for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1762173530822,
            "Source": "corporate_action"
        },
        {
            "Title": "Shakti Pumps India Invests ₹25 Crore in Subsidiary for Solar Manufacturing Plant",
            "Summary": "Shakti Pumps India has invested ₹25 crore in its subsidiary Shakti Energy Solutions Limited to establish a solar DCR cell and PV modules manufacturing plant. The facility will have a capacity of 2.20 GW and will be located in Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1760697938090,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps Secures Third Tranche Worth Rs. 86.40 Crores Under PM-KUSUM Scheme in Maharashtra",
            "Summary": "Shakti Pumps (India) Limited has been selected for a third tranche of 3,127 solar water pumping systems under the PM-KUSUM scheme in Maharashtra, valued at approximately Rs. 86.40 Crores. The company was empanelled by Maharashtra State Electricity Distribution Company Limited (MSEDCL) for supply and installation of 34,720 Off-Grid DC Solar Photovoltaic Water Pumping Systems. Across three tranches, 25,578 systems have been selected by farmers totaling Rs. 702.69 Crores. The first tranche of 10,000 systems worth Rs. 268.88 Crores was fully booked within 1.5 hours, while the second tranche of 12,451 systems was valued at Rs. 347.41 Crores. Chairman Dinesh Patidar expressed satisfaction with farmer adoption and confidence in completing orders on time. The company manufactures solar pumps, energy-efficient pumps, and related components with manufacturing capacity of 500,000 pumps and motors per year from facilities in Pithampur, Madhya Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1758283023169,
            "Source": "order&deals"
        },
        {
            "Title": "Shakti Pumps Shares Surge 13% as Maharashtra Solar Pump Orders Worth Rs 616 Crore Get Fully Booked",
            "Summary": "Shakti Pumps shares rallied 6.6% to Rs 915, marking a 13% gain over two sessions after farmers in Maharashtra fully subscribed to the second tranche of solar pump systems under the state's subsidy programme. The Maharashtra State Electricity Distribution Company opened its portal for 12,451 off-grid DC solar photovoltaic water pumping systems valued at Rs 347.41 crore, which was completely booked by farmers. Combined with the first tranche of 10,000 pumps worth Rs 268.88 crore that was subscribed within 1.5 hours in late August, Shakti Pumps now has orders for 22,451 pumps totaling Rs 616.30 crore under the Magel Tyala Saur Krushi Pump Yojana / PM KUSUM B scheme. The company reported net profit of Rs 96.8 crore in quarterly results, up 4.5% year-on-year, with EBITDA at Rs 143.6 crore representing a 5.7% increase and EBITDA margin of 23.1%. The company's order book stands at approximately Rs 1,350 crore as of August 1, 2025, with operations spanning multiple states and exports to over 100 countries.",
            "Sentiment": "positive",
            "PublishDate": 1757918346186,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps Secures Additional Rs. 347 Crores Order for 12,451 Solar Water Pumps in Maharashtra",
            "Summary": "Shakti Pumps (India) Limited announced that farmers have selected an additional 12,451 Off-Grid DC Solar Photovoltaic Water Pumping Systems under the Magel Tyala Saur Krushi Pump Yojana / PM KUSUM B scheme, valued at approximately Rs. 347.41 crores including GST. This follows the company's empanelment by Maharashtra State Electricity Distribution Company Limited (MSEDCL) for supplying 34,720 solar pumping systems. The first tranche of 10,000 systems worth Rs. 268.88 crores was fully booked by farmers within 1.5 hours on August 27, 2025. With 22,451 systems now booked across two tranches, the total order value stands at Rs. 616.30 crores. Chairman Dinesh Patidar emphasized the company's strong presence in Maharashtra and commitment to delivering sustainable water solutions for farmers. Shakti Pumps manufactures energy-efficient pumps and motors with manufacturing facilities in Pithampur, Madhya Pradesh, having a combined capacity of 500,000 pumps and motors per year.",
            "Sentiment": "positive",
            "PublishDate": 1757767239127,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps Secures ₹268.88 Crore Order for 34,720 Solar Pumps from MSEDCL",
            "Summary": "Shakti Pumps has been selected by MSEDCL to supply 34,720 off-grid solar pumps with a total order value of approximately ₹268.88 crores. The first batch of 10,000 units was completely reserved by farmers within 1.5 hours, indicating strong demand for the solar pump systems.",
            "Sentiment": "positive",
            "PublishDate": 1756369665864,
            "Source": "order&deals"
        },
        {
            "Title": "Shakti Pumps Falls 24% in 2025 Despite 523% Gains in 2024 and Strong Institutional Backing",
            "Summary": "Shakti Pumps India, a solar pump and EV motor manufacturer, has declined 24% in 2025 after delivering 523% returns in 2024. The company raised ₹292 crore through a QIP at ₹918 per share in July, backed by PineBridge, LIC MF, and Bank of India MF. The funds will support building a 2.2 GW solar DCR cell and PV module plant in Pithampur, Madhya Pradesh. The company holds approximately 25% market share in the PM Kusum Yojana across major beneficiary states. In the June quarter, revenue growth slowed to 9.7% while PAT growth decelerated to 4.5%, with EBITDA margins declining 87 basis points to 23.1%. The stock is trading at 10-year median PE of 23x FY26 estimated PAT. Analysts highlight the company's diversification into EV motors and solar rooftop solutions, along with its 16 patents and projected 25-30% compound growth over the next few years.",
            "Sentiment": "neutral",
            "PublishDate": 1755928342281,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps Secures Rs. 1,037 Crore Solar Water Pumping Systems Contract from Maharashtra",
            "Summary": "Shakti Pumps (India) Limited received a Letter of Empanelment from Maharashtra State Electricity Distribution Company Limited for 34,720 Off-Grid DC Solar Photovoltaic Water Pumping Systems worth Rs. 1,037 crores. The contract covers the entire state of Maharashtra under the Magel Tyala Saur Krushi Pump Yojana/PM KUSUM B scheme. The empanelment is valid for one year, with installation to be completed within 60 days from work order issuance. The scope includes design, manufacture, supply, transport, installation, testing and commissioning of the solar pumping systems. Chairman Dinesh Patidar stated this will enhance their order book position and solidify their market leadership in solar pumps across key states including Maharashtra, Madhya Pradesh, Rajasthan, Haryana, Punjab, Uttar Pradesh, and Jharkhand.",
            "Sentiment": "positive",
            "PublishDate": 1755025561012,
            "Source": "order&deals"
        },
        {
            "Title": "Shakti Pumps Targets Revenue Growth and Operational Improvements Through FY26",
            "Summary": "Shakti Pumps plans to reduce receivable days from 152 to 120 by FY26 and is targeting ₹500 crore in exports this year. The company anticipates 25-30% revenue increase in FY26 and plans to sustain growth for 3-4 years. Shakti Pumps aims for annual revenue of ₹3,000 crore while maintaining 24% EBITDA margins year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1754364253015,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps India Shares Fall 8% Despite Strong Q1 Financial Performance",
            "Summary": "Shakti Pumps India shares declined nearly 8% to Rs 865 despite reporting positive quarterly results. The company posted a 4.5% year-on-year increase in net profit to Rs 96.8 crore, up from Rs 92.7 crore in the previous year. Revenue from operations grew 9.7% to Rs 622.5 crore, while EBITDA increased 5.7% to Rs 143.6 crore with a margin of 23.1%. The company invested Rs 12 crore in subsidiary Shakti Energy Solutions for a solar manufacturing plant in Madhya Pradesh with 2.2 GW capacity. Credit ratings were upgraded to IND AA-/Stable and IND A1+ by India Ratings. The company raised Rs 2,926 million through a QIP to fund solar projects and targets 25-30% revenue growth. Order book stands at approximately Rs 1,350 crore. Year-to-date, shares have declined 24.64%, though they gained 565% over two years and 2,768% over five years.",
            "Sentiment": "neutral",
            "PublishDate": 1754287975747,
            "Source": "earnings"
        },
        {
            "Title": "Shakti Pumps Shares Drop 7% Despite Quarterly Profit Growth",
            "Summary": "Shakti Pumps (India) Ltd.'s share price fell to a three-month low, declining 7.98% to Rs 822 per share. The drop followed the company's announcement of a Rs 5 crore investment in subsidiary Shakti EV Mobility, bringing total consolidated investment to Rs 55 crore for 50 lakh shares. Despite the share price decline, the company reported positive quarterly results with net profit rising 4.5% to Rs 96.8 crore, revenue increasing 9.7% to Rs 623 crore, and EBITDA growing 5.7% to Rs 144 crore. However, margins slightly decreased to 23.1% from 23.9%. Trading volume was 6.7 times the 30-day average, and the RSI of 29.88 indicated oversold conditions. Two analysts maintain buy ratings with a consensus price target suggesting 27.4% upside potential.",
            "Sentiment": "negative",
            "PublishDate": 1754283910347,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps Reports Strong Q1FY26 Results with 9.7% Revenue Growth and Rs 13,500 Million Order Book",
            "Summary": "Shakti Pumps (India) Limited delivered solid quarterly results with revenue rising 9.7% to Rs 6,225 million in Q1FY26 from Rs 5,676 million in Q1FY25. EBITDA increased 5.7% to Rs 1,436 million with margins at 23.1%. PAT grew 4.5% to Rs 968 million. The company maintains approximately 25% market share in the PM-KUSUM scheme and holds an order book of Rs 13,500 million as of August 1, 2025. Management targets 25-30% revenue growth for FY26. The company is executing a Rs 17,000 million capex plan including doubling capacity for pumps and motors (Rs 2,500 million), establishing EV facilities (Rs 2,500 million), and setting up a 2.2 GW solar DCR cell and PV module plant (Rs 12,000 million). Receivable days improved from 178 days in FY24 to 152 days in FY25, with management targeting 120 days by end of FY26. The company successfully raised Rs 2,926 million through QIP to partially fund expansion projects.",
            "Sentiment": "positive",
            "PublishDate": 1754142770086,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps Chairman Sets 25-30% Revenue Growth Target",
            "Summary": "Shakti Pumps' Chairman has announced the company's revenue growth target of 25-30% for FY26. The leadership has affirmed this ambitious growth goal for the upcoming fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1754131497377,
            "Source": "stock"
        },
        {
            "Title": "Shakti Pumps Reports Higher Q1 Revenue and Profit with Slight Margin Decline",
            "Summary": "Shakti Pumps (India) reported Q1 consolidated net profit of 968 million rupees compared to 926 million rupees in the same period last year. Revenue increased to 6.22 billion rupees from 5.67 billion rupees year-over-year. EBITDA rose to 1.44 billion rupees from 1.36 billion rupees, though EBITDA margin declined to 23.06% from 23.94% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754055872131,
            "Source": "earnings"
        },
        {
            "Title": "Shakti Pumps Board Approves Q1 Results, AGM Date, and Key Leadership Appointments",
            "Summary": "Shakti Pumps (India) Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and set September 25, 2025, as the date for its 30th Annual General Meeting. The Board re-appointed Mr. Sunil Patidar as Whole-time Director for five years starting January 29, 2026, subject to shareholder approval. Additionally, the Board approved a significant remuneration increase for Chairman cum Whole-Time Director Mr. Dinesh Patidar from Rs. 9 crores to Rs. 18 crores annually, noting no increase in his compensation over the past four years. The company also approved borrowing powers up to Rs. 3,000 crores and the ability to create charges on assets for the same amount, both requiring shareholder approval. M/s. M.P. Turakhia & Associates was appointed as Cost Auditor for 2025-26. The record date for dividend entitlement was fixed as September 18, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754055777751,
            "Source": "earnings"
        },
        {
            "Title": "Shakti Pumps Invests ₹12 Crore in Solar Manufacturing Unit",
            "Summary": "Shakti Pumps has invested ₹12 crore to establish a 2.2 GW solar cell and PV module manufacturing plant in Madhya Pradesh. This investment represents a significant expansion into solar energy production capabilities for the company.",
            "Sentiment": "positive",
            "PublishDate": 1752476472000,
            "Source": "default"
        },
        {
            "Title": "Shakti Pumps Completes QIP, Raises ₹292.60 Crores",
            "Summary": "Shakti Pumps has announced the successful completion of its Qualified Institutional Placement (QIP), raising ₹292.60 crores. The company has not provided any additional details about the use of funds or the investors involved in the QIP.",
            "Sentiment": "positive",
            "PublishDate": 1751880597000,
            "Source": "default"
        },
        {
            "Title": "Shakti Pumps Raises ₹2,926 Million Through QIB Share Allocation",
            "Summary": "Shakti Pumps has announced the allocation of 3,187,365 equity shares to Qualified Institutional Buyers (QIBs) at a price of ₹918 per share. This share allocation has resulted in the company raising approximately ₹2,926 million.",
            "Sentiment": "positive",
            "PublishDate": 1751695882000,
            "Source": "default"
        },
        {
            "Title": "Shakti Pumps Plans Qualified Institutional Placement",
            "Summary": "Shakti Pumps is planning to launch a Qualified Institutional Placement (QIP) with a set floor price of ₹965.96 per share.",
            "Sentiment": "positive",
            "PublishDate": 1751508904000,
            "Source": "default"
        },
        {
            "Title": "Shakti Pumps (India) Limited: Secures Rs 114 Crore Order for Solar Water Pumps",
            "Summary": "Shakti Pumps (India) Limited has received a Letter of Award from Maharashtra Energy Department Agency (MEDA) for supplying and installing 4,500 off-grid Solar Photovoltaic Water Pumping Systems across Maharashtra. The order, worth Rs 114.58 crore including GST, is part of the PM-KUSUM scheme. The project is to be completed within 90 days of work order issuance.",
            "Sentiment": "positive",
            "PublishDate": 1749709559000,
            "Source": "order&deals"
        },
        {
            "Title": "Shakti Pumps Secures ₹115 Crore Order",
            "Summary": "Shakti Pumps has announced securing an order valued at ₹115 crore. The company states that this order is expected to contribute approximately 20% to its quarterly revenue. Additionally, Shakti Pumps mentions that the work order will be finalized within 90 days of issuance.",
            "Sentiment": "positive",
            "PublishDate": 1749703080000,
            "Source": "default"
        },
        {
            "Title": "Shakti Pumps: Targets ₹3,000 Crore Revenue in FY26",
            "Summary": "Shakti Pumps aims for ₹3,000 crore revenue in FY26, driven by solar demand, EV battery business expansion, and government orders. Current order book stands at ₹1,650 crore, with expected new orders from Punjab and Madhya Pradesh. Exports to contribute ₹500 crore. Company operating at 60% capacity utilization, expecting ramp-up with new orders.",
            "Sentiment": "positive",
            "PublishDate": 1747215144000,
            "Source": "normal_news"
        },
        {
            "Title": "Shakti Pumps Q4 Results: Net Profit and Revenue Increase, Dividend Declared",
            "Summary": "Shakti Pumps (India) reported a consolidated net profit of 1.1 billion rupees in Q4, up from 897 million rupees year-over-year and 1.04 billion rupees quarter-over-quarter. Q4 revenue increased to 6.65 billion rupees from 6.1 billion rupees year-over-year. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747008686000,
            "Source": "default"
        }
    ]
}