{
    "Symbol": "SHALPAINTS",
    "ISIN": "INE849C01026",
    "News": [
        {
            "Title": "Shalimar Paints Shareholders Approve Director Reappointment",
            "Summary": "Shalimar Paints Limited shareholders approved the reappointment of Ms. Shan Jain as Independent Director through postal ballot with 99.945% votes in favor. The e-voting process concluded on February 06, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770643285886,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shalimar Paints Board Meet Set for Feb 12, 2026",
            "Summary": "Shalimar Paints Limited has scheduled a board meeting on February 12, 2026, to consider Q3FY26 unaudited financial results. Trading window closed from January 1 to February 14, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770384964870,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shalimar Paints Board Approves Promoter Reclassification",
            "Summary": "Shalimar Paints' board approved reclassification of 8 promoter group members to public category under Regulation 31A, subject to regulatory approvals from SEBI and stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1768286579778,
            "Source": "stocks"
        },
        {
            "Title": "Shalimar Paints Completes Postal Ballot Notice Dispatch",
            "Summary": "Shalimar Paints Limited has completed dispatch of postal ballot notice for Ms. Shan Jain's re-appointment as Independent Director. The notice was published in newspapers on January 7, 2026, with e-voting scheduled from January 8 to February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767356084378,
            "Source": "stocks"
        },
        {
            "Title": "Hella Infra Pledges 80.5L Shalimar Paints Shares",
            "Summary": "Hella Infra Market Limited pledged 80.50 lakh equity shares of Shalimar Paints in two tranches during September-December 2025 in favor of Catalyst Trusteeship Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765514992137,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shalimar Paints Pledges Additional Shares to Catalyst Trusteeship for Debenture Security",
            "Summary": "Shalimar Paints Limited pledged 57,47,126 equity shares (6.87% of total capital) on December 4, 2025, and 23,03,621 shares (2.75%) on September 29, 2025, with Catalyst Trusteeship Limited acting as debenture trustee. The total encumbered shareholding increased to 4,42,42,921 shares representing 52.85% of the company's total share capital, securing non-convertible debenture obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1765253541676,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalimar Paints Receives Revised Reclassification Request from Promoter Group Member",
            "Summary": "Shalimar Paints received a revised request from Ms. Hina Devi Goyal to reclassify from Promoter Group to Public category, correcting her shareholding from NIL to 60 equity shares (0.0001%). The company has now received reclassification requests from 8 promoter group members and will seek approval from the Board of Directors and stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1764333234495,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shalimar Paints Receives Reclassification Requests from Two Promoter Group Members",
            "Summary": "Shalimar Paints received requests from Ms. Sarika Jhunjhnuwala and Ms. Kusum Mittal to reclassify them from Promoter Group to Public category after they sold all their shares. The reclassification requires approval from the Board of Directors and both stock exchanges, with the company to follow necessary regulatory processes.",
            "Sentiment": "neutral",
            "PublishDate": 1763643187748,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shalimar Paints Receives Reclassification Requests from Three Promoter Group Members",
            "Summary": "Shalimar Paints received requests from three promoter group members - Ms. Hina Devi Goyal, Ms. Sarita Devi Jain, and Mr. Shivang Jhunjhnuwala - seeking reclassification from promoter group to public category after selling their shares. The reclassification requires approval from the Board of Directors and stock exchanges BSE and NSE, with the company to follow necessary regulatory processes under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1763467357158,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalimar Paints Reports Loss of ₹30.53 Crores for H1 FY26 Despite 6% Revenue Growth",
            "Summary": "Shalimar Paints Limited reported a consolidated loss of ₹30.53 crores for the six months ended September 30, 2025, compared to a loss of ₹46.62 crores in the same period last year. Revenue from operations increased 6% to ₹300.28 crores versus ₹284.07 crores in H1 FY25. The company launched differentiated products in the emulsion category contributing 10% sales in Q2, appointed 100 distributors to strengthen rural market reach, and achieved a 20% increase in active dealer base. Management reported margin improvement of 5.1% over previous year H1, EBITDA improvement of ₹20 crores (7.6% over previous year H1), and reduced total inventory holding by ₹10 crores while implementing effective cost control measures across manpower, supply chain, and manufacturing costs.",
            "Sentiment": "neutral",
            "PublishDate": 1762991883166,
            "Source": "earnings"
        },
        {
            "Title": "Shalimar Paint Reports Revenue Decline But Reduces Net Loss in Q2",
            "Summary": "Shalimar Paint reported Q2 revenue of 1.3 billion rupees, down from 1.4 billion rupees in the same quarter last year. The company's consolidated net loss narrowed to 141 million rupees compared to a loss of 196 million rupees in the prior year period.",
            "Sentiment": "neutral",
            "PublishDate": 1762939379976,
            "Source": "earnings"
        },
        {
            "Title": "Shalimar Paint Reports Narrower Q1 Loss Despite Revenue Growth",
            "Summary": "Shalimar Paint reported a consolidated net loss of 167 million rupees in Q1, an improvement from the 270 million rupee loss in the same period last year. The company's revenue increased to 1.5 billion rupees compared to 1.28 billion rupees year-over-year. EBITDA loss also narrowed significantly to 74 million rupees from 211 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754900562314,
            "Source": "earnings"
        },
        {
            "Title": "Shalimar Paints to Raise Up to ₹70 Crore Through NCDs",
            "Summary": "The board of Shalimar Paints has approved raising funds up to ₹70 crore through the issuance of Non-Convertible Debentures (NCDs). This decision represents a significant financial move for the company, potentially aimed at supporting its operations or growth initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1748251372000,
            "Source": "result"
        },
        {
            "Title": "Shalimar Paints Reports Improved Q4 Financial Results",
            "Summary": "Shalimar Paints has reported its Q4 financial results. The company's EBITDA loss narrowed to 73 million rupees from 224 million rupees in the same quarter last year. Revenue increased to 1.78 billion rupees from 1.44 billion rupees year-over-year. The consolidated net loss for Q4 reduced to 95 million rupees, compared to a loss of 265 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748251323000,
            "Source": "result"
        },
        {
            "Title": "Shalimar Paints: 34 Entities Settle Takeover Norms Violation with SEBI",
            "Summary": "34 entities, including Urvi Jindal, have settled proceedings with SEBI for alleged violations of takeover norms in Shalimar Paints Ltd. The settlement amount paid was Rs 3.04 lakh. The violation involved a delayed disclosure of a 1,65,545 equity share acquisition, which changed shareholding by more than 2%.",
            "Sentiment": "neutral",
            "PublishDate": 1742216104000,
            "Source": "corporate_governance"
        }
    ]
}