{
    "Symbol": "SHALBY",
    "ISIN": "INE597J01018",
    "News": [
        {
            "Title": "Shalby Re-appoints Independent Director for 5 Years",
            "Summary": "Shalby Limited's Board approves re-appointment of Mr. Shyamal Shivkumar Joshi as Independent Director for second term of 5 years from May 17, 2026 to May 16, 2031, subject to shareholder approval through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1770822114728,
            "Source": "stocks"
        },
        {
            "Title": "Shalby Discontinues SOCE Operations at Two Cities",
            "Summary": "Shalby Limited announces discontinuation of SOCE operations at Rajkot and Lucknow facilities from January 31, 2026 and February 15, 2026 respectively, while maintaining OPD services.",
            "Sentiment": "neutral",
            "PublishDate": 1769862618387,
            "Source": "stocks"
        },
        {
            "Title": "Shalby Limited Employee Exercises 1,000 Stock Options",
            "Summary": "Shalby Limited reports exercise of 1,000 employee stock options under ESOP Scheme 2021, realizing ₹10,000 through employee welfare trust with no change to paid-up share capital.",
            "Sentiment": "neutral",
            "PublishDate": 1768916558028,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shalby Limited Reports Mixed Q2 FY26 Results with 5.5% Revenue Growth and 200% PAT Surge",
            "Summary": "Shalby Limited achieved consolidated revenue of INR 289 crores in Q2 FY26 versus INR 274 crores in Q2 FY25, marking 5.5% growth, while consolidated PAT jumped 200% to INR 7.3 crores from INR 2.4 crores year-on-year. The company faces challenges with Shalby International Hospital reporting 22.7% revenue decline and 21% occupancy rate, though management expects positive EBITDA within two quarters through rebranding and leadership restructuring initiatives.",
            "Sentiment": "neutral",
            "PublishDate": 1763625565881,
            "Source": "earnings"
        },
        {
            "Title": "Shalby Reports Strong Q2 Performance with 146% Jump in Net Profit",
            "Summary": "Shalby delivered robust quarterly results with consolidated net profit surging to 83.8 million rupees from 34 million rupees year-on-year, while revenue grew to 2.85 billion rupees from 2.67 billion rupees. The healthcare company's EBITDA increased to 416 million rupees with margin expansion to 14.58% from 12.2%, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763074558908,
            "Source": "earnings"
        },
        {
            "Title": "Shalby Limited Appoints Amit Kumar as Chief Financial Officer",
            "Summary": "Shalby Limited's Board of Directors approved the appointment of Amit Kumar as Chief Financial Officer and Key Managerial Personnel effective November 13, 2025, based on the Nomination and Remuneration Committee's recommendation. Kumar, a Chartered Accountant with over 18 years of experience across EdTech, Mobility and Telecom sectors, previously served as Senior Vice President-Finance Controller at Leadership Boulevard Pvt. Ltd. and held key finance positions at ECOS Mobility & Hospitality, Telenor, TATA Group, and Bharti Airtel.",
            "Sentiment": "positive",
            "PublishDate": 1763067841962,
            "Source": "earnings"
        },
        {
            "Title": "Shalby Limited Grants 19,000 Stock Options Under ESOP Scheme 2021",
            "Summary": "Shalby Limited's Nomination and Remuneration Committee approved the grant of 19,000 stock options convertible into equal number of equity shares with face value of ₹10 each to eligible employees under its Employee Stock Options Scheme 2021. The options are priced at ₹100 per option, will vest after 2 years from grant date, and must be exercised within 1 year of vesting, with existing shares being channelized from secondary market without increasing share capital.",
            "Sentiment": "positive",
            "PublishDate": 1763050020030,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby Reports Strong Q2 Performance with 146% Net Profit Growth and Corporate Restructuring",
            "Summary": "Shalby Advanced Tech Inc. is transferring its shareholding in Shalby Advanced Tech India to Shalby MedTech while providing licensing and manufacturing rights to SAT India. The company delivered robust quarterly results with net profit surging 146% to 83.8 million rupees and revenue growing to 2.85 billion rupees, while EBITDA margin expanded to 14.58%.",
            "Sentiment": "positive",
            "PublishDate": 1763043876328,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby Limited Employee Exercises 2,000 Stock Options Under ESOP Scheme",
            "Summary": "Shalby Limited announced that an eligible employee exercised 2,000 stock options on November 12, 2025, under the company's Employee Stock Options Scheme-2021. The options were originally granted on October 27, 2023, and vested on October 27, 2025. The exercise price was Rs. 10 per option, generating Rs. 20,000 for the Shalby Limited Employees Welfare Trust. The company's paid-up share capital remains unchanged as the shares were sourced through the secondary market. Out of the original 6,000 options granted, 4,000 options have lapsed. The diluted earnings per share following this exercise is Rs. 0.71 based on financials for the quarter ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762983188292,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby Limited Issues ₹716 Crore Corporate Guarantee for Subsidiary's Credit Facilities",
            "Summary": "Shalby Limited has issued a corporate guarantee of up to ₹716 crore in favor of HDFC Bank Limited for fund and non-fund based credit facilities granted to its subsidiary company, PK Healthcare Private Limited. The guarantee was issued on November 7, 2025. The company stated that promoters and promoter group companies do not have any interest in this transaction, while PK Healthcare is interested in the transaction. Shalby expects no financial or operational impact from providing this guarantee.",
            "Sentiment": "neutral",
            "PublishDate": 1762568168755,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby Limited CFO Amit Pathak Resigns to Pursue External Career Opportunities",
            "Summary": "Amit Pathak resigned from his position as Chief Financial Officer and Key Managerial Personnel at Shalby Limited effective October 24, 2025. Pathak cited pursuing career opportunities outside the organization as the reason for his departure. The company confirmed there are no material reasons for the resignation beyond those stated in his resignation letter. Following his resignation, Pathak will also cease to be the Key Managerial Personnel authorized for determining materiality of events and making disclosures to stock exchanges. Shalby Limited indicated it will announce his replacement shortly.",
            "Sentiment": "neutral",
            "PublishDate": 1761308894900,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shah Family Trust Acquires 60,000 Shalby Limited Shares Worth Rs 1.44 Crore",
            "Summary": "Shah Family Trust, a promoter of Shalby Limited, purchased 60,000 equity shares of the company through open market transactions on September 19, 2025. The acquisition was valued at Rs 1.44 crore. Following this purchase, Shah Family Trust's shareholding increased from 3,75,17,132 shares (34.73%) to 3,75,77,132 shares (34.79%) of the company's total equity capital of 108,009,770 shares. The transaction was disclosed under SEBI regulations for insider trading and substantial acquisition of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758363269047,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby Limited Issues ₹25 Crore Corporate Guarantee for Subsidiary's Equipment Lease Facilities",
            "Summary": "Shalby Limited has issued a corporate guarantee of up to ₹25 crore in favor of Easy Assets Private Limited and Aditya Birla Capital Limited for lease rental facilities granted to its wholly-owned subsidiary, Shalby Medtech Limited (formerly Mars Medical Devices Ltd). The guarantee covers equipment rentals for the subsidiary. The company states that promoters and promoter groups have no interest in this transaction, and no financial or operational impact is expected on the listed entity.",
            "Sentiment": "neutral",
            "PublishDate": 1756388115993,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby Ltd. Partners with Bhartiya Skill Development University to Launch Healthcare Education Programs",
            "Summary": "Shalby Ltd. has signed a Memorandum of Understanding with Bhartiya Skill Development University, Jaipur to jointly offer Bachelor of Vocation programs in Allied Health and Paramedic Skills. The collaboration will provide B.Voc programs in Medical Laboratory Technology, Operation Theatre & Anesthesia Technology, and Medical Radiology Imaging Technology. The programs follow a Swiss Dual Learning Model with four days of clinical training at Shalby Hospitals and two days of academic learning at BSDU. Shalby will provide hands-on training at its Jaipur facilities and offer preferential placement opportunities for top-performing students within the Shalby Hospital network. This marks Shalby Academy's 11th academic collaboration across India and its second in Rajasthan.",
            "Sentiment": "positive",
            "PublishDate": 1756115240099,
            "Source": "stock"
        },
        {
            "Title": "Shalby Limited Reports Mixed Q1 Results with Revenue Crossing INR 300 Crores for First Time",
            "Summary": "Shalby Limited reported consolidated revenue of INR 303 crores, growing 12.3% quarter-on-quarter and 5.1% year-on-year, marking the first time crossing INR 300 crores. Consolidated EBITDA reached INR 48.5 crores with 16% margin, up 85.6% quarterly but down 11.6% annually. Consolidated profit after tax was INR 7.7 crores, increasing 163% quarterly while declining 47% yearly. The hospital business faced challenges with occupancy dropping to 45% from 49.5% previously, though average revenue per occupied bed rose 5.3% to INR 45,673. Shalby Sanar's revenue fell 2.2% to INR 23.25 crores due to geopolitical issues affecting international patients. The implant business showed strong growth with revenue up 74.2% to INR 30.8 crores and reduced EBITDA losses. Management expects 12-15% consolidated revenue growth and occupancy improvement to 50%+ levels, while targeting $100 million implant revenue in 4-5 years.",
            "Sentiment": "neutral",
            "PublishDate": 1755596510600,
            "Source": "earnings"
        },
        {
            "Title": "Shalby Focuses on Hospital Network Expansion and Ortho Implant Business Growth",
            "Summary": "Shalby is expanding its hospital network while growing its orthopedic implant business and boosting medical tourism operations to generate high-profit healthcare revenue.",
            "Sentiment": "positive",
            "PublishDate": 1755101250570,
            "Source": "stock"
        },
        {
            "Title": "Shalby Limited Reports 72% Decline in Quarterly Profit Despite Revenue Growth",
            "Summary": "Shalby Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of ₹2,366.54 million compared to ₹2,327.16 million in the same quarter last year. However, net profit declined significantly to ₹256.95 million from ₹304.66 million in the previous year quarter. On a consolidated basis, revenue increased to ₹2,964.26 million from ₹2,788.90 million year-on-year, but profit dropped to ₹76.78 million from ₹147.41 million. The company's healthcare services segment generated revenue of ₹2,683.63 million while manufacturing of implants contributed ₹280.62 million. Basic earnings per share on standalone basis was ₹2.39 compared to ₹2.84 in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1755086220760,
            "Source": "earnings"
        },
        {
            "Title": "Shalby Limited Subsidiary PK Healthcare Faces Petition from Minority Shareholders at NCLT",
            "Summary": "Shalby Limited disclosed that a petition has been filed against its subsidiary PK Healthcare Pvt. Ltd. at the National Company Law Tribunal, Delhi under sections 241 and 242 of the Companies Act, 2013. The petition was filed on July 31, 2025, by minority shareholders including Mr. Tarun Sheth and others. The dispute is primarily related to pre-acquisition management issues at PK Healthcare. According to the petition, there are no expected financial implications and the quantum of claims is not quantifiable.",
            "Sentiment": "negative",
            "PublishDate": 1754048554266,
            "Source": "stock"
        },
        {
            "Title": "Shalby Hospitals Performs World's First Fully Autonomous Robotic Joint Replacement Surgery",
            "Summary": "Shalby Multi-Specialty Hospitals successfully performed the world's first fully autonomous robotic joint replacement surgery using a revolutionary system with a 7-axis robotic arm. The technology features the world's only saw-based robotic arm with 7-axis movement, designed to enhance surgical accuracy, bone cut precision, and enable minimally invasive procedures. The system is expected to improve outcomes, reduce recovery times, and provide greater patient comfort. Shalby Hospitals was founded by Dr. Vikram Shah and operates 11 multispecialty hospitals and 5 orthopedic centers across India with over 2,200 hospital beds. The company has performed more than 150,000 joint replacement procedures and holds a 15% market share in India's organized joint replacement market.",
            "Sentiment": "positive",
            "PublishDate": 1753599885486,
            "Source": "stock"
        },
        {
            "Title": "Shalby Partners with SVVV Indore for Healthcare Management Programs",
            "Summary": "Shalby has formed a partnership with SVVV Indore to introduce healthcare management programs. This collaboration aims to provide education in the field of healthcare management, potentially enhancing the skills and knowledge of future healthcare professionals.",
            "Sentiment": "positive",
            "PublishDate": 1751976913000,
            "Source": "default"
        },
        {
            "Title": "Shalby's Unit Receives International Accreditation from AACI America LLC",
            "Summary": "A unit of Shalby has been awarded international accreditation from AACI America LLC. This accreditation is a significant achievement for the company, indicating recognition of quality standards on an international level.",
            "Sentiment": "positive",
            "PublishDate": 1750397623000,
            "Source": "default"
        },
        {
            "Title": "Shalby Ltd: Q4 Losses Widen, Margins Narrow to Multi-Year Low",
            "Summary": "Shalby Ltd reported a Q4 FY25 loss of ₹11.82 crore, widening from ₹5.75 crore in Q3. Revenue decreased to ₹265 crore from ₹276 crore in Q3. EBITDA fell to ₹20.8 crore, with margins narrowing to 7.9%. For FY25, revenue increased to ₹1,087 crore, but the company reported a loss of ₹0.7 crore compared to a profit in FY24. Shares declined 5.4% following the results.",
            "Sentiment": "negative",
            "PublishDate": 1748593152000,
            "Source": "earnings"
        },
        {
            "Title": "Shalby Reports Decline in Q4 EBITDA and Margin",
            "Summary": "Shalby's Q4 EBITDA decreased to 209 million rupees from 389 million rupees year-over-year. The company's Q4 EBITDA margin also declined to 7.89% from 15.93% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1748531144000,
            "Source": "result"
        },
        {
            "Title": "Shalby Reports Q4 Financial Results",
            "Summary": "Shalby has reported its Q4 consolidated financial results. The company's net loss decreased to 110 million rupees from 166 million rupees year-over-year. However, compared to the previous quarter, the loss increased from 18 million rupees. Revenue for Q4 increased to 2.6 billion rupees from 2.44 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748531023000,
            "Source": "result"
        },
        {
            "Title": "Shalby Terminates Franchise Agreement with Divine Super Specialty Hospital",
            "Summary": "Shalby has announced the termination of its franchise agreement with Divine Super Specialty Hospital in Ranchi. The decision was made due to multiple breaches of the agreement's terms and conditions by the franchisee.",
            "Sentiment": "negative",
            "PublishDate": 1742913940000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby Hospital Approved for Hand Transplant Registration",
            "Summary": "Shalby Hospital in Ahmedabad has received approval from the State Authorization Committee, Government of Gujarat, for registration to conduct hand transplant procedures under the Transplantation of Human Organs Act, 1994. This approval enables the hospital to perform hand transplant surgeries, expanding its range of medical services.",
            "Sentiment": "positive",
            "PublishDate": 1739284386000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Shalby, a healthcare company, has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 340 million rupees from 423 million rupees in the same quarter last year. Additionally, the EBITDA margin dropped to 12.34% from 19.59% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738591997000,
            "Source": "earnings"
        },
        {
            "Title": "Shalby Reports Q3 Financial Results",
            "Summary": "Shalby Limited has announced its Q3 financial results. The company reported a consolidated net loss of 30 million rupees, which is an improvement compared to the 191 million rupees loss in the same quarter last year. However, it's a slight decline from the previous quarter's loss of 24 million rupees. On a positive note, Shalby's revenue for Q3 increased to 2.75 billion rupees, up from 2.16 billion rupees in the same period last year, showing significant year-over-year growth.",
            "Sentiment": "neutral",
            "PublishDate": 1738591948000,
            "Source": "earnings"
        },
        {
            "Title": "Shalby Launches India's Largest and Gujarat's First Tissue & Bone Bank",
            "Summary": "Shalby Limited has announced the launch of India's largest and Gujarat's first Tissue & Bone Bank. This initiative represents a significant advancement in medical infrastructure and healthcare services, potentially improving access to critical tissues and bones for medical procedures and research.",
            "Sentiment": "positive",
            "PublishDate": 1737016612000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby's US Subsidiary Receives FDA Clearance for Knee Replacement Device",
            "Summary": "Shalby Advanced Technologies Inc., a USA-based subsidiary of Shalby, has obtained FDA 510(k) premarket notification clearance for DURANIOTM, their primary total knee replacement device featuring TiNbN coating. This regulatory approval allows the company to market and sell the device in the United States.",
            "Sentiment": "positive",
            "PublishDate": 1736945190000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shalby Reports Decline in Q2 EBITDA and Margin",
            "Summary": "Shalby, a healthcare company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 326 million rupees from 527 million rupees in the same quarter last year. Additionally, the EBITDA margin fell to 12.19% from 22.14% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730272107000,
            "Source": "result"
        },
        {
            "Title": "Shalby Reports Q2 Revenue Increase",
            "Summary": "Shalby, an Indian healthcare company, has reported its second quarter revenue for the current fiscal year. The company's revenue has grown to 2.7 billion rupees, up from 2.4 billion rupees in the same quarter of the previous year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730271878000,
            "Source": "result"
        },
        {
            "Title": "Shalby Reports Significant Drop in Q2 Net Profit",
            "Summary": "Shalby, an Indian healthcare company, has reported a consolidated net profit of 24 million rupees for the second quarter, compared to 276 million rupees in the same period last year. This represents a substantial year-over-year decrease in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1730271850000,
            "Source": "result"
        }
    ]
}