{
    "Symbol": "SHANKARA",
    "ISIN": "INE274V01019",
    "News": [
        {
            "Title": "Shankara Building Products Q3FY26 Results",
            "Summary": "Shankara Building Products reported Q3FY26 consolidated revenue of ₹420.40 crores with net profit of ₹1.23 crores. Board approved MD reappointment for 5 years.",
            "Sentiment": "positive",
            "PublishDate": 1770718024778,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shankara Building Products Winds Up Singapore Unit",
            "Summary": "Shankara Building Products completes liquidation of non-operating Singapore subsidiary Steel Network Holdings Pte Limited effective December 26, 2025, with no financial impact on operations.",
            "Sentiment": "neutral",
            "PublishDate": 1767597157056,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shankara Building Products Faces Credit Rating Downgrade",
            "Summary": "CRISIL downgrades Shankara Building Products' long-term rating to BBB/Stable from BBB+ and short-term rating to A3+ from A2, affecting ₹595 crore bank facilities across multiple lenders.",
            "Sentiment": "negative",
            "PublishDate": 1767325702081,
            "Source": "stocks"
        },
        {
            "Title": "Shankara Building Products Reports Strong Q2 Performance with 31% Steel Volume Growth",
            "Summary": "Shankara Building Products achieved its highest Q2 steel volume of 2.52 lakh tons with 31% year-on-year growth, driving consolidated revenue to INR 1,681 crores (26% growth) and net profit to INR 25 crores (66% increase). The company received in-principle approval from NSE and BSE for listing its marketplace business Shankara Buildpro Limited by end of November, completing the demerger to separate manufacturing and marketplace operations.",
            "Sentiment": "positive",
            "PublishDate": 1763616187962,
            "Source": "earnings"
        },
        {
            "Title": "Shankara Building Products Plans Aggressive Retail Expansion With 150+ Stores Target",
            "Summary": "Shankara Building Products has announced plans for rapid expansion of its retail home-improvement stores, targeting over 150 stores within 3 years. The company will allocate capital expenditure for warehousing and product diversification, expecting margin expansion from increased retail share and branded product portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1763056117429,
            "Source": "stock"
        },
        {
            "Title": "Shankara Building Products Reports Strong Q2H1FY26 Results with 31% Steel Volume Growth",
            "Summary": "Shankara Building Products delivered robust quarterly results with steel volumes reaching 2.52 lakh tonnes (31% YoY growth) and steel revenue of ₹1,526 crore (28% YoY growth), while maintaining EBITDA margin at 3.03%. The company completed its demerger implementation with trading approval pending, separating its marketplace business (SBL) from manufacturing operations (SBPL) to create focused business units.",
            "Sentiment": "positive",
            "PublishDate": 1763055712408,
            "Source": "earnings"
        },
        {
            "Title": "Shankara Building Products Reports Loss in Q2 FY2025 Following Business Demerger",
            "Summary": "Shankara Building Products Limited reported a net loss of Rs. 6.27 crores for the quarter ended September 30, 2025, compared to a loss of Rs. 1.80 crores in the same period last year. Revenue from operations declined to Rs. 200.04 crores from Rs. 323.20 crores year-over-year. The company completed a demerger scheme approved by NCLT on August 21, 2025, which became effective on September 9, 2025, transferring its trading business to Shankara BuildPro Limited. Due to this demerger, previous period figures have been restated to reflect only the continuing business operations, making them non-comparable with previously published results. The company's cash and cash equivalents stood at Rs. 0.01 crores as of September 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1763024309027,
            "Source": "earnings"
        },
        {
            "Title": "Franklin Templeton Mutual Fund Exits Shankara Building Products with Complete 4.34% Stake Sale",
            "Summary": "Franklin Templeton Mutual Fund has completely disposed of its entire stake in Shankara Building Products Limited, selling 1,052,838 shares representing 4.342% of the company's total shareholding. The disposal was executed through open market transactions on October 9, 2025. The sale was conducted entirely through the Franklin India Small Cap Fund scheme. Following the transaction, Franklin Templeton's holding in the company has reduced to zero from its previous 4.342% stake. Shankara Building Products' shares are listed on both the National Stock Exchange of India and BSE Limited, with the company's total equity share capital standing at 24,249,326 shares.",
            "Sentiment": "neutral",
            "PublishDate": 1760097086081,
            "Source": "corporate_action"
        },
        {
            "Title": "Shankara Building Products CFO Alex Varghese Resigns to Join Shankara BuildPro Limited",
            "Summary": "Alex Varghese has resigned from his position as CFO of Shankara Building Products. His resignation will be effective on October 3, 2025. Varghese is stepping down to work at Shankara BuildPro Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1759483997124,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shankara Building Products Provides Cost Apportionment Guidelines Following Demerger with Shankara Buildpro",
            "Summary": "Shankara Building Products Limited has issued guidance to shareholders on apportioning the cost of acquisition of equity shares following a demerger with Shankara Buildpro Limited. The National Company Law Tribunal sanctioned the scheme of arrangement on August 21, 2025, involving the transfer of the trading business undertaking from Shankara Building Products to Shankara Buildpro. Under the arrangement, shareholders will receive one fully paid-up equity share of Rs 10 face value in Shankara Buildpro for every share held in Shankara Building Products. The record date is September 24, 2025. For cost allocation purposes, shareholders should apportion their pre-demerger acquisition cost as 34.19% for Shankara Building Products shares and 65.81% for Shankara Buildpro shares. The share issuance is not taxable under Section 47(vid) of the Income Tax Act, and the acquisition date for capital gains purposes remains the original purchase date of Shankara Building Products shares.",
            "Sentiment": "neutral",
            "PublishDate": 1758623837175,
            "Source": "corporate_action"
        },
        {
            "Title": "Shankara Building Products Sets September 24, 2025 as Record Date for Demerger with Shankara Buildpro",
            "Summary": "Shankara Building Products Limited has fixed September 24, 2025 as the record date for its demerger with Shankara Buildpro Limited. Under the scheme of arrangement, shareholders of Shankara Building Products will receive one fully paid-up equity share of Rs 10 face value in Shankara Buildpro for every one equity share held in the demerged company. The new equity shares will be listed on NSE and BSE subject to regulatory approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1757660837105,
            "Source": "corporate_action"
        },
        {
            "Title": "Shankara Building Products Demerger Scheme with Shankara Buildpro Becomes Effective",
            "Summary": "Shankara Building Products Limited announced that its demerger scheme with Shankara Buildpro Limited became effective on September 9, 2025, with an appointed date of April 1, 2024. The company filed form INC-28 with the Registrar of Companies, Karnataka to formalize the arrangement. Under the scheme, Shankara Building Products serves as the demerged company while Shankara Buildpro Limited is the resulting company. The record date for determining eligible shareholders who will receive equity shares in Shankara Buildpro Limited will be announced later.",
            "Sentiment": "neutral",
            "PublishDate": 1757401568276,
            "Source": "corporate_action"
        },
        {
            "Title": "Shankara Building Products Reports Strong Q1FY26 Results with 35% Steel Volume Growth",
            "Summary": "Shankara Building Products delivered robust quarterly performance with steel volume reaching 2.38 lakh tons, marking 35% year-on-year growth and the highest Q1 volume on record. The company achieved revenue growth of 27% with EBITDA margins improving to 3.58% from 3.20% in the previous quarter. Net profit surged 102% year-on-year to Rs. 32 crores. All steel segments showed strong performance - flat products grew 65%, roofing 35%, and pipes & tubes 32%. However, the non-steel business faced headwinds with only 5% growth. The company maintained disciplined working capital management at 29 days and opened two new fulfillment centers in Jabalpur and Gannavaram. Management remains confident about achieving the target of 1 million tons for FY26 and expects the demerger process to conclude in Q3FY26 following the next NCLT hearing scheduled for end-August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754110952506,
            "Source": "earnings"
        },
        {
            "Title": "Shankara Building Products Makes Q1FY26 Earnings Call Audio Recording Available",
            "Summary": "Shankara Building Products Limited has made the audio recording of their Q1FY26 earnings call available on their company website. The earnings call was held on July 29, 2025 at 11:30 AM IST. The audio recording can be accessed through a direct link provided on the company's website at shankarabuildpro.com. The company notified stock exchanges BSE and NSE about the availability of this recording.",
            "Sentiment": "neutral",
            "PublishDate": 1753792931676,
            "Source": "earnings"
        },
        {
            "Title": "Shankara Building Products Reports Strong Q1 Growth with Revenue Up 27% and Net Profit Doubling",
            "Summary": "Shankara Building Products delivered robust quarterly performance with revenue rising to 16.44 billion rupees from 12.9 billion rupees in the same period last year. The company's consolidated net profit more than doubled to 324 million rupees compared to 160 million rupees previously. EBITDA increased to 585 million rupees from 407 million rupees, while EBITDA margin improved to 3.56% from 3.15% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753690008492,
            "Source": "earnings"
        },
        {
            "Title": "Shankara Building Products Schedules Q1FY26 Earnings Conference Call for July 29, 2025",
            "Summary": "Shankara Building Products Limited will host a conference call on July 29, 2025 at 11:30 AM IST to discuss the company's financial results for the quarter ended June 30, 2025. The management team participating includes Managing Director Sukumar Srinivas, Director C Ravikumar, Executive Director Dhananjay Mirlay Srinivas, and Chief Financial Officer Alex Varghese. The company has provided dial-in numbers and registration details for investors and analysts to join the earnings discussion.",
            "Sentiment": "neutral",
            "PublishDate": 1753346248355,
            "Source": "earnings"
        },
        {
            "Title": "Singularity Equity Fund Acquires Shankara Building Products Shares",
            "Summary": "Madhu Kela's Singularity Equity Fund has purchased 460,000 shares of Shankara Building Products in a block deal on June 9. The shares were acquired at a price of ₹926.10 per share.",
            "Sentiment": "positive",
            "PublishDate": 1749525832000,
            "Source": "default"
        },
        {
            "Title": "Shankara Building Products Reports Q4 Results and Declares Dividend",
            "Summary": "Shankara Building Products announced its quarterly results and dividend. The company declared a dividend of 3 rupees per share. For Q4, the company reported revenue of 16.4 billion rupees, up from 13.77 billion rupees year-over-year. EBITDA increased to 514 million rupees from 430 million rupees, with the EBITDA margin slightly improving to 3.14% from 3.12%. The consolidated net profit for Q4 rose to 285 million rupees from 242.2 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1747389490000,
            "Source": "result"
        },
        {
            "Title": "Shankara Building Products Targets Steel Volume Growth",
            "Summary": "Shankara Building Products has announced its steel volume targets for the upcoming fiscal years. The company is on track to achieve 0.8 million tonnes of steel volume in FY25 and is aiming for 1.0 million tonnes in FY26, according to their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1738586339000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shankara Building Products Reports Q3 Revenue Growth",
            "Summary": "Shankara Building Products has reported a significant increase in revenue for the third quarter. The company's revenue rose to 14.4 billion rupees, up from 11.8 billion rupees in the same period last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738572689000,
            "Source": "earnings"
        },
        {
            "Title": "Shankara Building Products Reports Q3 Revenue Growth",
            "Summary": "Shankara Building Products has reported a revenue of 14.3 billion rupees for the third quarter, compared to 11.8 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1738572611000,
            "Source": "earnings"
        },
        {
            "Title": "Shankara Building Products Reports Mixed Q3 Financial Results",
            "Summary": "Shankara Building Products has reported its Q3 financial results. The company's EBITDA increased to 400 million rupees from 384 million rupees year-over-year. However, the EBITDA margin decreased to 2.78% from 3.26% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738572492000,
            "Source": "earnings"
        },
        {
            "Title": "Shankara Building Products Reports Q3 Net Profit Decline",
            "Summary": "Shankara Building Products has reported a consolidated net profit of 180 million rupees for the third quarter, down from 214 million rupees in the same period last year. This represents a year-over-year decrease in profitability for the company.",
            "Sentiment": "negative",
            "PublishDate": 1738572439000,
            "Source": "earnings"
        },
        {
            "Title": "Shankara Building Products Reports Q2 EBITDA and Margin",
            "Summary": "Shankara Building Products announced its Q2 financial results. The company's EBITDA increased slightly to 360 million rupees from 354.5 million rupees year-over-year. However, the EBITDA margin decreased to 2.71% from 3.10% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730713122000,
            "Source": "result"
        },
        {
            "Title": "Shankara Building Products Reports Q2 Revenue Growth",
            "Summary": "Shankara Building Products has announced its Q2 revenue figures. The company reported revenue of 13.3 billion rupees, compared to 11.42 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730713077000,
            "Source": "result"
        },
        {
            "Title": "Shankara Building Products Reports Q2 Net Profit Decline",
            "Summary": "Shankara Building Products reported a consolidated net profit of 152 million rupees for the second quarter, down from 182 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730713055000,
            "Source": "result"
        }
    ]
}