{
    "Symbol": "SHANTIGEAR",
    "ISIN": "INE631A01022",
    "News": [
        {
            "Title": "Shanthi Gears Reclassifies Promoter Group Entity",
            "Summary": "Shanthi Gears Limited has submitted applications to stock exchanges for reclassification of Algvista Greentech Private Limited from promoter group to public shareholder category under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769156999277,
            "Source": "stocks"
        },
        {
            "Title": "Shanthi Gears Q3 Net Profit Drops 38.4% YoY to ₹16.20 Cr",
            "Summary": "Shanthi Gears reported a significant decline in Q3 net profit, falling to ₹16.20 crores from ₹26.30 crores in the same quarter last year, marking a 38.4% year-on-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1769070856921,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shanthi Gears Auditors Change Name to LLP Structure",
            "Summary": "Shanthi Gears Limited announces statutory auditors M S K A & Associates have converted to Limited Liability Partnership structure, becoming M S K A & Associates LLP effective January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768579897273,
            "Source": "stocks"
        },
        {
            "Title": "Shanthi Gears Board Meet on Jan 22 for Q3 Results",
            "Summary": "Shanthi Gears Limited has scheduled a board meeting on January 22, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768215959001,
            "Source": "co_actions_results"
        },
        {
            "Title": "Tube Investments Receives Promoter Reclassification Request",
            "Summary": "Tube Investments of India Limited receives request from Algavista Greentech Private Limited to reclassify from promoter group to public category shareholders under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766049696351,
            "Source": "stocks"
        },
        {
            "Title": "Shanthi Gears Receives Warning Letters from NSE and BSE for Delayed Disclosure Compliance",
            "Summary": "Shanthi Gears Limited received warning letters from NSE and BSE on December 1, 2025, for delayed disclosure regarding their promoter reclassification application submitted on October 25, 2025, but disclosed only on November 8, 2025. The exchanges cited non-compliance with SEBI LODR Regulation 31A(8)(c) which requires disclosure within 24 hours of material events, with NSE noting a 13-day delay in the disclosure process.",
            "Sentiment": "negative",
            "PublishDate": 1764611961471,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shanthi Gears Receives Stock Exchange Approval for Promoter Group Reclassification",
            "Summary": "NSE and BSE have granted no-objection approvals for the reclassification of Coromandel Engineering Company Limited and Yanmar Coromandel Agrisolutions Private Limited from Shanthi Gears' promoter group category. The approvals were issued on December 1, 2025, following the company's application dated October 25, 2025, allowing these entities to exit the promoter group classification.",
            "Sentiment": "neutral",
            "PublishDate": 1764608483842,
            "Source": "corporate_action"
        },
        {
            "Title": "Shanthi Gears Seeks Stock Exchange Approval for Promoter Declassification",
            "Summary": "Shanthi Gears Limited has applied to the National Stock Exchange and BSE seeking no objection for declassification of two promoter group entities - Yanmaar Coromandel Agrisolutions Private Limited and Coromandel Engineering Company Limited - from the promoter category. The application follows earlier disclosures made in September 2025 regarding re-classification of these promoter group members. The company is seeking approval under Regulation 31A of the Listing Regulations for the declassification process.",
            "Sentiment": "neutral",
            "PublishDate": 1762594758774,
            "Source": "corporate_action"
        },
        {
            "Title": "Shanthi Gears Reports Decline in Q2 Financial Performance",
            "Summary": "Shanthi Gears reported quarterly results showing a decline across key financial metrics. Revenue fell to 1.32 billion rupees from 1.55 billion rupees in the same period last year. Net profit decreased to 215 million rupees compared to 256 million rupees year-over-year. EBITDA dropped to 265 million rupees from 341 million rupees, while EBITDA margin compressed to 20.1% from 22.03% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1761297110504,
            "Source": "earnings"
        },
        {
            "Title": "Shanthi Gears Receives Reclassification Request from Promoter Group Member",
            "Summary": "Shanthi Gears Limited received a request from Coromandel Engineering Company Limited to reclassify from 'promoter and promoter group' category to 'public' category shareholder. The request was made through a letter dated September 24, 2025. Currently, Coromandel Engineering Company Limited holds no equity shares in Shanthi Gears. The reclassification requires approval from Shanthi Gears' Board of Directors, National Stock Exchange of India Limited, and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758786626719,
            "Source": "corporate_action"
        },
        {
            "Title": "Shanthi Gears Receives Reclassification Request from Promoter Group Member",
            "Summary": "Shanthi Gears Limited received a request from Yanmar Coromandel Agrisolutions Private Limited to reclassify from 'promoter and promoter group' category to 'public' category under SEBI regulations. The request was made through a letter dated September 16, 2025. Yanmar Coromandel Agrisolutions Private Limited currently holds no equity shares in the company. The reclassification requires approval from Shanthi Gears' Board of Directors, National Stock Exchange of India Limited, and BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1758106706183,
            "Source": "corporate_action"
        },
        {
            "Title": "Shanthi Gears Seeks Shareholder Approval for Independent Director Appointment and Chairman's Remuneration via Postal Ballot",
            "Summary": "Shanthi Gears Limited has issued a postal ballot notice seeking shareholder approval for two proposals through e-voting from August 19, 2025, to September 17, 2025. The first proposal seeks approval for appointing Ms. Aruna Thangaraj as Non-Executive Independent Director for a five-year term from July 30, 2025, to July 29, 2030. Ms. Thangaraj is Managing Director of AGT Electronics Limited and holds directorships in Elgi Equipments Limited and Tidel Park Coimbatore. The second proposal requests approval for paying Rs. 1 crore commission to Non-Executive Chairman Mr. M A M Arunachalam for financial year 2024-25, which exceeds 50% of total remuneration payable to all other Non-Executive Directors. The Board justified this amount based on his significant role in guiding the company's growth and business development. Results will be declared by September 19, 2025, with Mr. M.D. Selvaraj appointed as scrutinizer for the voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1755498091617,
            "Source": "corporate_action"
        },
        {
            "Title": "Shanti Gears Reports 5% PAT Growth in Q1, Appoints New Independent Director",
            "Summary": "Shanti Gears Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company recorded revenue of ₹134.89 crores compared to ₹138.82 crores in the same quarter last year. Profit before tax increased 6% to ₹30.62 crores from ₹28.95 crores, while profit after tax grew 5%. The company achieved a Return on Invested Capital of 49% and generated free cash flow of ₹26.1 crores, up 24% year-over-year. During the quarter, Shanti Gears booked orders worth ₹145 crores with an unexecuted order book of ₹249 crores as of June 30, 2025. The board announced that Ms. Soundara Kumar completed her tenure as Non-Executive & Independent Director after serving two consecutive five-year terms. Ms. Aruna Thangaraj was appointed as Additional Director and Independent Director for a five-year term from July 30, 2025 to July 29, 2030, subject to shareholder approval. Ms. Thangaraj is Managing Director of AGT Electronics Limited and holds engineering qualifications from REC Trichy and universities in the US.",
            "Sentiment": "positive",
            "PublishDate": 1753863468602,
            "Source": "earnings"
        },
        {
            "Title": "Shanthi Gears Reports Mixed Q1 Results with Profit Growth Despite Revenue Decline",
            "Summary": "Shanthi Gears reported quarterly net profit of 227 million rupees, up from 216 million rupees in the same period last year. However, revenue declined to 1.35 billion rupees from 1.38 billion rupees year-over-year. The company's EBITDA improved to 305 million rupees from 286 million rupees, while EBITDA margin expanded to 22.62% from 20.64% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753863002285,
            "Source": "earnings"
        },
        {
            "Title": "Shanthi Gears Schedules Board Meeting on July 30 to Approve Q1 Financial Results",
            "Summary": "Shanthi Gears Limited has scheduled a Board of Directors meeting on July 30, 2025, to approve unaudited standalone financial results for the first quarter ended June 30, 2025. The company announced that the trading window for designated persons will remain closed until 48 hours after the results declaration, in accordance with SEBI insider trading regulations and the company's internal code.",
            "Sentiment": "neutral",
            "PublishDate": 1753171430028,
            "Source": "corporate_action"
        },
        {
            "Title": "Shanthi Gears Reports Q4 Net Profit Decline",
            "Summary": "Shanthi Gears has reported a net profit of 225 million rupees for the fourth quarter, down from 257 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1745486705000,
            "Source": "result"
        },
        {
            "Title": "Shanthi Gears Reports Significant EBITDA Growth in Q3",
            "Summary": "Shanthi Gears has reported a substantial increase in its Q3 EBITDA, rising to 340 million rupees from 230 million rupees year-over-year. The company's EBITDA margin also improved, reaching 21.52% compared to 18.25% in the same period last year. This performance indicates strong financial growth and improved operational efficiency for the company.",
            "Sentiment": "positive",
            "PublishDate": 1738227655000,
            "Source": "earnings"
        },
        {
            "Title": "Shanthi Gears Reports Strong Q3 Financial Results",
            "Summary": "Shanthi Gears has announced its financial results for the third quarter. The company's net profit increased to 263 million rupees, up from 174 million rupees in the same period last year. Revenue also saw significant growth, reaching 1.57 billion rupees compared to 1.25 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738227558000,
            "Source": "earnings"
        },
        {
            "Title": "Shanthi Gears Reports Improved Q2 EBITDA and Margin",
            "Summary": "Shanthi Gears has announced its Q2 financial results. The company's EBITDA increased to ₹304 million from ₹287 million year-over-year. The EBITDA margin also improved to 21.94% from 21.22% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729587153000,
            "Source": "result"
        },
        {
            "Title": "Shanthi Gears Reports Q2 Revenue Growth",
            "Summary": "Shanthi Gears has announced its Q2 revenue, which stands at 1.5 billion rupees, compared to 1.35 billion rupees in the same quarter last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729587104000,
            "Source": "result"
        },
        {
            "Title": "Shanthi Gears Reports 22% Increase in Q2 Net Profit",
            "Summary": "Shanthi Gears Limited has announced its financial results for the second quarter, reporting a net profit of 256 million rupees. This represents a year-over-year increase from 210 million rupees in the same quarter of the previous year, indicating a growth of approximately 22% in net profit.",
            "Sentiment": "positive",
            "PublishDate": 1729587076000,
            "Source": "result"
        }
    ]
}