{
    "Symbol": "SHANTIGOLD",
    "ISIN": "INE06ZD01017",
    "News": [
        {
            "Title": "Shanti Gold International Schedules Q3 FY26 Call",
            "Summary": "Shanti Gold International Ltd announces earnings call on February 11, 2026 at 12:00 PM IST to discuss Q3 FY26 and 9M FY26 unaudited financial results with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1770363573667,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shanti Gold clarifies credit rating agency switch",
            "Summary": "Shanti Gold International clarifies switch from Infomerics to CARE Ratings, maintaining CARE A- (Stable) rating while Infomerics assigns INC status due to discontinued engagement.",
            "Sentiment": "neutral",
            "PublishDate": 1770272667309,
            "Source": "stocks"
        },
        {
            "Title": "Shanti Gold Gets CARE A- Credit Rating",
            "Summary": "CARE Ratings assigns CARE A- (Stable) rating to Shanti Gold International's ₹223.53 crore bank facilities, marking the company's first credit rating assessment.",
            "Sentiment": "positive",
            "PublishDate": 1769145589297,
            "Source": "stocks"
        },
        {
            "Title": "Shanti Gold Announces ₹8.50 Cr Capacity Expansion",
            "Summary": "Shanti Gold International Limited approves capacity expansion of 4,000 kg per annum at its jewellery manufacturing facility, requiring investment of ₹8.50 crores to be funded through internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1769063307098,
            "Source": "stocks"
        },
        {
            "Title": "Shanti Gold International Reports 61.6% Revenue Growth in Q2 FY26, Plans Jaipur Facility Expansion",
            "Summary": "Shanti Gold International Limited reported strong quarterly results with revenue from operations rising 61.6% to INR 430 crores in Q2 FY26 compared to INR 266 crores in Q2 FY25. EBITDA surged 228.46% to INR 63.27 crores with margins improving to 14.75% from 7.24%. For H1 FY26, revenue grew 42.8% to INR 722.85 crores while EBITDA increased 184.50% to INR 102.86 crores. The company, a manufacturer of 22-carat CZ gold casting jewelry, currently operates at 60% capacity utilization with 2,700 kg annual manufacturing capacity. Management announced construction of a new Jaipur facility requiring INR 46 crores capex, expected to commence operations by May-June 2026, adding 1,200 kg capacity for machine-made plain gold jewelry. The company processed 750 kgs of gold in H1 and projects closing FY26 at 1,900-2,000 kgs. October sales reached INR 302 crores, representing 3x growth year-on-year. Management targets revenue guidance of INR 1,900-2,000 crores for FY26 and expects to maintain core EBITDA margins of 7-8% going forward, with current elevated margins attributed to inventory appreciation from lower cost base procurement.",
            "Sentiment": "positive",
            "PublishDate": 1762975062646,
            "Source": "earnings"
        },
        {
            "Title": "Shanti Gold International Reports Record Monthly Revenue of Rs. 303 Crores in October 2025",
            "Summary": "Shanti Gold International Ltd. achieved record monthly revenue of Rs. 303 crores in October 2025, representing a 195% growth compared to Rs. 103 crores in October 2024. Sales volume increased to 256 kgs from 141 kgs in the same period last year, marking an 81% volume growth. The company attributed this performance to healthy demand from B2B clients and onboarding of new customers. Management noted that current volatility in gold prices makes near-term forecasting challenging, but expressed encouragement about demand for their jewelry products.",
            "Sentiment": "positive",
            "PublishDate": 1762453578843,
            "Source": "stock"
        },
        {
            "Title": "Shanti Gold International Reports Quarterly Financial Results for September 2025",
            "Summary": "Shanti Gold International Limited's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The board meeting was held on November 4, 2025, from 4:20 p.m. to 5:10 p.m. IST. The company's statutory auditor, J. Kala Associates, issued a Limited Review Report on the financial results. The results were prepared in accordance with Indian Accounting Standard 34 and comply with SEBI listing regulations. The company operates in the gold business and is listed on BSE (scrip code: 544459) and NSE (symbol: SHANTIGOLD).",
            "Sentiment": "neutral",
            "PublishDate": 1762295399024,
            "Source": "earnings"
        },
        {
            "Title": "Shanti Gold International Plans to Establish Fully Owned Subsidiary in UAE",
            "Summary": "Shanti Gold International has announced plans to establish a fully owned subsidiary in the United Arab Emirates. The company is expanding its operations into the UAE market through this new subsidiary structure.",
            "Sentiment": "positive",
            "PublishDate": 1762266765171,
            "Source": "stock"
        },
        {
            "Title": "Shanti Gold Reports Strong Q2 Performance with 374% Jump in Net Profit",
            "Summary": "Shanti Gold delivered robust quarterly results with net profit surging to 438.1 million rupees from 92.5 million rupees year-over-year. Revenue grew significantly to 4.3 billion rupees compared to 2.66 billion rupees in the same period last year. EBITDA more than tripled to 606 million rupees from 173 million rupees, while EBITDA margin expanded substantially to 14.09% from 6.50% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762261615184,
            "Source": "earnings"
        },
        {
            "Title": "Shanti Gold International Expects Continued Growth and Strong Product Demand",
            "Summary": "Shanti Gold International anticipates sustained growth and robust demand for its products in the upcoming quarter. The company has expressed optimistic expectations for its business performance in the near term.",
            "Sentiment": "positive",
            "PublishDate": 1759916069425,
            "Source": "stock"
        },
        {
            "Title": "Shanti Gold International Reports 60% Revenue Growth in Q2 FY26",
            "Summary": "Shanti Gold International achieved a 60% year-over-year revenue increase in Q2 FY26. The company experienced strong demand from both local and international B2B clients. The growth was supported by the popularity of new festive and bridal collections.",
            "Sentiment": "positive",
            "PublishDate": 1759915625828,
            "Source": "earnings"
        },
        {
            "Title": "Shanti Gold Reports Strong Q1 Performance with 154% Jump in EBITDA",
            "Summary": "Shanti Gold delivered robust quarterly results with EBITDA rising to 384 million rupees from 151 million rupees year-over-year. The company's EBITDA margin expanded significantly to 13.1% from 6.3% in the same period last year. Net profit increased to 246 million rupees compared to 90 million rupees year-over-year, while revenue grew to 2.93 billion rupees from 2.4 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1755747711310,
            "Source": "earnings"
        }
    ]
}