{
    "Symbol": "SHARDACROP",
    "ISIN": "INE221J01015",
    "News": [
        {
            "Title": "Sharda Cropchem Q3FY26 Results: Revenue Up 38.6% YoY",
            "Summary": "Sharda Cropchem reported strong Q3FY26 consolidated revenue of ₹128,875.74 lakhs, up 38.6% YoY. Net profit surged to ₹14,511.45 lakhs vs ₹3,114.46 lakhs in Q3FY25. Board declared interim dividend of ₹6 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769678410039,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sharda Cropchem Board Meet Set for Jan 29, 2026",
            "Summary": "Sharda Cropchem Limited has scheduled its Board meeting for January 29, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768915459538,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sharda Cropchem Raises FY26 Margin and Revenue Growth Guidance",
            "Summary": "Sharda Cropchem has increased its FY26 margin guidance to 18-20% from the previous 15-18% range and raised its revenue growth forecast from 15% to 20%. The upward revision in financial projections indicates improved business outlook and operational efficiency expectations for the agrochemical company.",
            "Sentiment": "positive",
            "PublishDate": 1763626863744,
            "Source": "stock"
        },
        {
            "Title": "Sharda Cropchem Reports 20% Revenue Growth to INR 929 Crores in Q2 with Strong Volume Recovery",
            "Summary": "Sharda Cropchem Limited reported total revenue of INR 929 crores in Q2, representing 20% year-on-year growth driven by 35% overall volume growth. The agrochemical segment grew 27% to INR 803 crores while non-agrochemical business declined 11% to INR 126 crores. Gross margins expanded significantly by 690 basis points to 34.5% due to input cost stabilization. EBITDA increased 71% to INR 139 crores with margins at 15%, while PAT grew 75% to INR 74 crores. For H1, revenue reached INR 1,914 crores (23% growth) with PAT of INR 217 crores (212% growth). The company maintains 2,994 product registrations globally with 1,068 applications pending approval. Working capital days improved to 84 days from 118 days in March 2025. Management expects EBITDA margins of 15-18% for the full year and plans capex of INR 450-500 crores. The company remains debt-free with cash and liquid investments of INR 794 crores.",
            "Sentiment": "positive",
            "PublishDate": 1762478273828,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Targets 15-18% EBITDA Margins for FY26",
            "Summary": "Sharda Cropchem's Managing Director has confirmed that the company expects to maintain healthy EBITDA margins in the range of 15-18% for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761817784426,
            "Source": "stock"
        },
        {
            "Title": "Sharda Cropchem Reports Strong Q2 Growth with Revenue Up 19% and Net Profit Nearly Doubling",
            "Summary": "Sharda Cropchem delivered robust quarterly performance with revenue rising to 9.3 billion rupees from 7.8 billion rupees in the same period last year. The company's consolidated net profit surged to 743 million rupees compared to 420 million rupees year-over-year. EBITDA increased to 1.33 billion rupees from 1 billion rupees, while EBITDA margin improved to 14.30% from 12.96% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761816572713,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Schedules Conference Call to Discuss 2Q & 1HFY26 Earnings",
            "Summary": "Sharda Cropchem Limited has scheduled a conference call for analysts and investors on Friday, October 31, 2025 at 12:30 P.M. IST to discuss its 2Q & 1HFY26 earnings results. The call will be hosted by Antique Stock Broking Limited and will feature senior management including Chairman & Managing Director Mr. Ramprakash V. Bubna, CFO Mr. Shailesh Mehendale, and Company Secretary Mr. Jetkin Gudhka. The company has provided dial-in details for participants from multiple countries including India, US, UK, and other international locations.",
            "Sentiment": "neutral",
            "PublishDate": 1761320029798,
            "Source": "corporate_action"
        },
        {
            "Title": "Sharda Cropchem Targets Over 18% EBITDA Margins in FY26 on Stable Market Conditions",
            "Summary": "Sharda Cropchem expects to achieve EBITDA margins exceeding 18% in FY26, driven by improving pricing trends, stable euro-dollar exchange rates, and operational efficiencies. Chairman and Managing Director Ramprakash V Bubna stated that concerns regarding pricing, volume, and destocking pressures from the past two years have stabilized, with global inventory levels returning to normal. The company logged strong growth in the first quarter and expects momentum to continue. Sharda Cropchem's business performance is significantly impacted by euro-dollar exchange rates, as 95% of sourcing is from China in dollars while majority sales are in Europe. The company does not expect Trump's tariffs to hurt business due to strict US government approval requirements for their products, allowing them to pass tariff increases to customers. The company holds approximately Rs 790 crore in cash and cash equivalents with no immediate acquisition plans, though it doubled dividends in FY25 and may consider further increases.",
            "Sentiment": "positive",
            "PublishDate": 1758352589287,
            "Source": "stock"
        },
        {
            "Title": "Sharda Crop Shares Audio Recording of Q1 FY 2025-26 Earnings Conference Call",
            "Summary": "Sharda Crop has made available the audio recording of its Q1 FY 2025-26 earnings conference call with analysts and investors. The call was conducted digitally on July 25, 2025, at 5:30 PM IST. The company has provided a Google Drive link to access the audio recording on its website. The disclosure was signed by Jetkin Gudhka, Company Secretary & Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1753453690125,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Reports Strong Q1 FY26 Results with 25% Revenue Growth and 424% PAT Surge",
            "Summary": "Sharda Cropchem Limited reported quarterly results with total revenue increasing 25% to Rs. 985 crores compared to Rs. 785 crores in the previous year quarter. The agrochemical segment contributed 86% of total revenue at Rs. 846 crores, growing 25% year-on-year, while the non-agrochemical segment reached Rs. 139 crores, up 31%. Profit after tax surged 424% to Rs. 143 crores from Rs. 27 crores in the same quarter last year. EBITDA grew 67% to Rs. 142 crores with margins improving to 14.4%. Gross margins expanded 630 basis points to 35.5%. The company achieved volume growth of approximately 13% overall, with agrochemical volumes up 11.4% and non-agrochemical volumes rising 58.5%. Europe remained the largest market contributing 62% of agrochemical segment revenue. Working capital reduced by 18 days to 100 days. The company operates across 80+ countries with 525+ distributors and 500+ sales force personnel.",
            "Sentiment": "positive",
            "PublishDate": 1753431289891,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Targets 15% Revenue Growth with EBITDA Margin of 15-18%",
            "Summary": "Sharda Cropchem's Managing Director announced the company's plan to achieve 15% revenue growth while maintaining EBITDA margins between 15% and 18%. The growth target reflects the company's strategic focus on expanding its business operations while preserving profitability levels within the specified margin range.",
            "Sentiment": "positive",
            "PublishDate": 1753430855133,
            "Source": "stock"
        },
        {
            "Title": "Sharda Cropchem Reports Strong Q1 Performance with Net Profit Surge to 1.4B Rupees",
            "Summary": "Sharda Cropchem delivered robust quarterly results with consolidated net profit jumping to 1.4 billion rupees from 272 million rupees year-over-year. Revenue increased to 9.85 billion rupees compared to 7.8 billion rupees in the same period last year. EBITDA rose significantly to 2.15 billion rupees from 770 million rupees year-over-year, while EBITDA margin expanded to 21.86% from 9.81% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753429074550,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Targets Over 15% Top Line Growth for FY '26",
            "Summary": "Sharda Cropchem has announced its aim to grow its top line by more than 15% in FY '26. The company also expects gross margins to improve in the financial year, with anticipated price increases. This information was shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1747366065000,
            "Source": "default"
        },
        {
            "Title": "Sharda Cropchem Reports Q4 Financial Results",
            "Summary": "Sharda Cropchem announced its Q4 financial results. Revenue increased to 18.3 billion rupees from 13.12 billion rupees year-over-year. EBITDA rose to 3.03 billion rupees from 2.53 billion rupees. However, EBITDA margin decreased to 16.58% from 19.28% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1747214710000,
            "Source": "result"
        },
        {
            "Title": "Sharda Cropchem Reports 42.7% Increase in Q4 Net Profit",
            "Summary": "Sharda Cropchem, an agrochemical company, has reported a consolidated net profit of 2.04 billion rupees for the fourth quarter, up from 1.43 billion rupees in the same period last year. This represents a significant year-over-year increase of 42.7%.",
            "Sentiment": "positive",
            "PublishDate": 1747214160000,
            "Source": "result"
        },
        {
            "Title": "Sharda Cropchem to Consider Q4 Results on May 14",
            "Summary": "Sharda Cropchem has announced that it will consider its fourth quarter financial results on May 14. This is a routine corporate announcement regarding the company's upcoming earnings release.",
            "Sentiment": "neutral",
            "PublishDate": 1746445164000,
            "Source": "default"
        },
        {
            "Title": "Sharda Cropchem Reports Strong Q3 Results and Declares Interim Dividend",
            "Summary": "Sharda Cropchem announced its Q3 consolidated net profit of 311 million rupees, a significant increase from 46 million rupees in the same quarter last year. The company's revenue also grew to 9.3 billion rupees from 6.3 billion rupees year-over-year. Additionally, Sharda Cropchem declared an interim dividend of 3 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1737936850000,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem: Q3 Profit Soars 571% YoY, Revenue Up 47%",
            "Summary": "Sharda Cropchem reported Q3 FY25 results with net profit rising 571.34% YoY to ₹31.15 crore. Revenue increased 46.94% YoY to ₹929.33 crore. EPS stood at ₹3.45, up 576.47% YoY. Operating income grew 477.68% YoY. Analysts maintain a 'Buy' consensus.",
            "Sentiment": "positive",
            "PublishDate": 1737786031000,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Announces Capex Plan for FY25",
            "Summary": "Sharda Cropchem has expressed confidence in its ongoing plan to increase product registrations in FY25. The company has provided a capex guidance of Rs. 400-450 crores, which they believe will enable them to meet their FY25 targets. This information was shared in an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1737728829000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sharda Cropchem Reports Improved Gross Margins",
            "Summary": "Sharda Cropchem has announced an improvement in gross margins by 660 basis points, reaching 32.7%. The company expects further improvement in the current financial year, with anticipated price increases according to their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1737728554000,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Reports Strong Volume Growth in Q3 FY25",
            "Summary": "Sharda Cropchem has reported significant volume growth in both its agrochemical and non-agrochemical segments for the third quarter of fiscal year 2025. According to the company's investor presentation, agrochemical volumes increased by 49.5%, while non-agrochemical volumes grew by 42.4% during this period.",
            "Sentiment": "positive",
            "PublishDate": 1737728500000,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Declares Interim Dividend",
            "Summary": "Sharda Cropchem has announced an interim dividend of Rs 3 per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1737723413000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sharda Cropchem Reports Significant Growth in Q3 EBITDA",
            "Summary": "Sharda Cropchem has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.15 billion rupees, up from 695 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 12.34% from 11% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737723406000,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Sharda Cropchem has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit increased from 46 million rupees to 311 million rupees. Revenue also saw a significant rise, climbing from 6.3 billion rupees to 9.3 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1737723399000,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem to Consider Q3 Results on January 24",
            "Summary": "Sharda Cropchem has announced that it will consider its third quarter (Q3) financial results on January 24. This indicates that the company is preparing to disclose its performance for the most recent fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737031072000,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Cropchem Reports Significant Q2 EBITDA Growth",
            "Summary": "Sharda Cropchem has reported a substantial increase in its Q2 EBITDA, rising to 896.2 million rupees from 212 million rupees year-over-year. The company's EBITDA margin also improved significantly, reaching 11.54% compared to 3.65% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729849437000,
            "Source": "result"
        },
        {
            "Title": "Sharda Cropchem Reports Q2 Revenue Growth",
            "Summary": "Sharda Cropchem has announced its Q2 revenue, which stands at 7.8 billion rupees, compared to 5.8 billion rupees in the same quarter last year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1729849255000,
            "Source": "result"
        },
        {
            "Title": "Sharda Cropchem Reports Q2 Profit Turnaround",
            "Summary": "Sharda Cropchem has reported a consolidated net profit of 420 million rupees for the second quarter, marking a significant turnaround from a loss of 276 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729849227000,
            "Source": "result"
        }
    ]
}