{
    "Symbol": "SHARDAMOTR",
    "ISIN": "INE597I01028",
    "News": [
        {
            "Title": "Sharda Motor Q3FY26 Results: Revenue Up 27.8% YoY",
            "Summary": "Sharda Motor Industries reported strong Q3FY26 results with revenue rising 27.8% YoY to ₹88,155.02 lakh. Net profit grew 7.2% to ₹8,013.01 lakh. Company announced new manufacturing unit in Haridwar.",
            "Sentiment": "positive",
            "PublishDate": 1770387028651,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sharda Motor Industries restructures senior management",
            "Summary": "Sharda Motor Industries announced organizational restructuring effective January 31, 2026, resulting in two senior management personnel no longer classified as SMPs while continuing as employees.",
            "Sentiment": "neutral",
            "PublishDate": 1769859378077,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential MF crosses 5% stake in Sharda Motor",
            "Summary": "ICICI Prudential Mutual Fund acquired 1.50 lakh shares of Sharda Motor Industries on January 13, 2026, increasing its shareholding from 4.99% to 5.25% and triggering mandatory disclosure requirements under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1768392368439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sharda Motor Industries Reports 11% Revenue Growth, Partners with Donghee for Advanced Suspension Technology",
            "Summary": "Sharda Motor Industries achieved consolidated revenues of INR 787.2 crores in Q2 FY26 with 11% year-on-year growth, while entering a technology license agreement with Donghee Industrial Company for chassis and suspension components manufacturing. The company secured new orders worth $14 million annually in lightweighting vertical and $4.8 million in global business, with EBITDA margins at 12.8% amid rising input costs from catalyst price increases.",
            "Sentiment": "positive",
            "PublishDate": 1763546834129,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Motor Industries Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Sharda Motor Industries reported Q2 consolidated net profit of 747 million rupees, down from 787 million rupees in the same quarter last year. Revenue increased to 7.87 billion rupees from 7.11 billion rupees year-over-year. EBITDA declined to 1.01 billion rupees from 1.03 billion rupees, while EBITDA margin compressed to 12.83% from 14.44% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762868299106,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Motor Industries Partners with Donghee Industries for Suspension Technology License",
            "Summary": "Sharda Motor Industries has entered into a technology license agreement with Donghee Industries to enhance its suspension products. The partnership aims to increase local production capabilities for Indian original equipment manufacturers (OEMs) operating in the SUV, electric vehicle, and premium vehicle segments.",
            "Sentiment": "positive",
            "PublishDate": 1761749257184,
            "Source": "stock"
        },
        {
            "Title": "Sharda Motor Industries Faces Rs 31.84 Lakh GST Penalty Over E-way Bill Discrepancy",
            "Summary": "Sharda Motor Industries Limited received an order from the Additional Commissioner Grade 2 (Appeal) Second (State Tax), Meerut, Uttar Pradesh, imposing a penalty of Rs 31.84 lakhs. The penalty relates to an alleged discrepancy in E-way Bill 221963516737 dated May 19, 2025, specifically the non-generation of Part B of the E-way bill. The company stated there is no material impact on its financial operations and plans to file an appeal in accordance with the law. The order is applicable for Financial Year 2025-26.",
            "Sentiment": "negative",
            "PublishDate": 1761488987171,
            "Source": "stock"
        },
        {
            "Title": "Sharda Motor's 609.2 Million Rupee Demand to be Nullified Following Tax Order",
            "Summary": "Sharda Motor announced that a demand of 609.2 million rupees against the company will become zero due to a tax order. The development eliminates the financial obligation that was previously outstanding.",
            "Sentiment": "positive",
            "PublishDate": 1759925488089,
            "Source": "stock"
        },
        {
            "Title": "Sharda Motor Industries Reports 10% Revenue Growth to ₹756.2 Crores in Q1 FY26",
            "Summary": "Sharda Motor Industries Limited, an auto component manufacturer specializing in emission control systems and suspension systems, reported revenue of ₹756.2 crores for Q1 FY26, representing 10% year-over-year growth. The company's profit after tax increased to ₹99.9 crores from ₹76.8 crores in the previous year, boosted by an exceptional gain of ₹22.4 crores from land sale. EBITDA grew 3% to ₹98.4 crores with a margin of 13%. The company started operations at its new suspension plant and added two new export customers - a Japanese construction equipment company and a heavy industry machinery company. Sharda Motor operates at 80% capacity utilization and appointed Ashwani Maheshwari as Deputy Managing Director. The company filed 2 new patents, bringing total patents to 15. Management is exploring M&A opportunities in powertrain agnostic areas while focusing on light-weighting technologies and export expansion in US and Europe markets.",
            "Sentiment": "positive",
            "PublishDate": 1755513330080,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Motor Industries Reports Q1FY26 Results with 10% Revenue Growth",
            "Summary": "Sharda Motor Industries Limited submitted an investor presentation for the quarter ended June 30, 2025, alongside unaudited financial results. The company reported revenue from operations of ₹756.2 crores in Q1FY26, representing a 10% year-over-year increase from ₹685.4 crores in Q1FY25. EBITDA grew 3% to ₹98.4 crores compared to ₹95.7 crores in the previous year quarter. Profit after tax increased 30% to ₹99.9 crores from ₹76.8 crores year-over-year. The company operates through three business verticals: Emission Control, Lightweighting, and Global Business, with eight manufacturing facilities across India. Sharda Motor holds approximately 30% value market share in passenger vehicle and light commercial vehicle exhaust systems, and 12.5% market share in control arms. The company has filed 15 patents with 3 granted over the last 3 years and employs over 1,000 people.",
            "Sentiment": "positive",
            "PublishDate": 1754887704340,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Motor Industries Reports Q1 FY2026 Results, Appoints New Auditors",
            "Summary": "Sharda Motor Industries Limited reported its unaudited financial results for Q1 FY2026 ended June 30, 2025. The company posted a profit of Rs 99.94 crore for the quarter compared to Rs 76.83 crore in the previous quarter and Rs 83.77 crore in the same quarter last year. Revenue from operations stood at Rs 756.25 crore versus Rs 749.85 crore in the previous quarter. The company recorded an exceptional item of Rs 22.41 crore representing profit on sale of land and building. The board reappointed M/s Gurdeep Singh & Associates as cost auditors for FY2026 and appointed M/s VKC & Associates as secretarial auditors for a five-year term from FY2026 to FY2030, subject to shareholder approval at the 40th Annual General Meeting. Basic earnings per share for the quarter was Rs 34.82 compared to Rs 29.24 in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1754660380043,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Motor Industries Obtains Factory License for New Plant",
            "Summary": "Sharda Motor Industries has received a factory license for its new plant from Maharashtra's Directorate of Industrial Safety and Health. The company plans to commence commercial production at this facility on June 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1750490372000,
            "Source": "default"
        },
        {
            "Title": "Sharda Motor Industries: Stock Rebounds 6% from Recent Lows",
            "Summary": "Sharda Motor Industries' stock rose 6% intraday, reaching a high of ₹1720.70 after touching a low of ₹1609.95. The company has agreed to transfer leasehold rights of its Haridwar property to Avadh Rail Infra Limited for ₹23.05 Crores, to be completed within 60 days.",
            "Sentiment": "positive",
            "PublishDate": 1740470265000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sharda Motor Industries Reports Stable Q3 EBITDA",
            "Summary": "Sharda Motor Industries announced its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 945 million rupees, compared to 943 million rupees in the same quarter last year. The EBITDA margin for Q3 was 13.70%, slightly up from 13.69% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738677216000,
            "Source": "earnings"
        },
        {
            "Title": "Sharda Motor Industries Reports Q3 Financial Results",
            "Summary": "Sharda Motor Industries has announced its Q3 consolidated financial results. The company reported a net profit of 754 million rupees, slightly down from 760 million rupees in the same quarter last year. Revenue for the quarter stood at 6.90 billion rupees, marginally up from 6.89 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738677210000,
            "Source": "earnings"
        }
    ]
}