{
    "Symbol": "SHAREINDIA",
    "ISIN": "INE932X01026",
    "News": [
        {
            "Title": "Share India Securities faces MCX penalty of Rs 1.36 lakh",
            "Summary": "Share India Securities Limited disclosed that MCX imposed a penalty of Rs 1,36,613 for higher Order-to-Trade Ratio during normal broking operations. Company states no material impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1770039883072,
            "Source": "stocks"
        },
        {
            "Title": "Share India Securities Q3FY26 Earnings Call Available",
            "Summary": "Share India Securities Limited has made available the audio recording of its conference call held on January 28, 2026 to discuss Q3FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769608712557,
            "Source": "co_actions_results"
        },
        {
            "Title": "Share India Securities Board Meet on Jan 27 for Q3 Results",
            "Summary": "Share India Securities has scheduled its board meeting for January 27, 2026, to approve Q3FY26 financial results and consider declaring the third interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769000481297,
            "Source": "co_actions_results"
        },
        {
            "Title": "Share India Securities Auditor Firm Converts to LLP",
            "Summary": "Share India Securities announces conversion of statutory auditor MSKA & Associates into LLP structure effective January 13, 2026, with continued audit responsibilities for remaining tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1768469642370,
            "Source": "stocks"
        },
        {
            "Title": "Share India Securities Gets CRISIL A1+ Rating",
            "Summary": "Share India Securities Limited receives CRISIL A1+ rating for ₹250 crore Commercial Papers program, reflecting strong credit quality and liquidity position in capital markets.",
            "Sentiment": "positive",
            "PublishDate": 1768377829656,
            "Source": "stocks"
        },
        {
            "Title": "Share India Securities Forms New Wholly Owned Subsidiary",
            "Summary": "Share India Securities Limited successfully incorporated its wholly owned subsidiary Share India Cred Capital Private Limited on January 06, 2026, with CIN U64990UP2026PTC240582 registered in Kanpur.",
            "Sentiment": "positive",
            "PublishDate": 1767701133952,
            "Source": "stocks"
        },
        {
            "Title": "Share India Securities Raises ₹35 Crores via NCDs",
            "Summary": "Share India Securities completes allotment of 3,500 non-convertible debentures through private placement on December 31, 2025, raising ₹35.00 crores with each debenture valued at ₹1.00 lakh.",
            "Sentiment": "positive",
            "PublishDate": 1767162093533,
            "Source": "co_actions_results"
        },
        {
            "Title": "Share India Securities Withdraws from Project Drone, Cancels Subsidiary Plans",
            "Summary": "Share India Securities Limited has rescinded its approval for Project Drone and decided not to proceed with incorporating a subsidiary for the project. The company stated that other stakeholders involved in the project may continue without Share India's participation.",
            "Sentiment": "neutral",
            "PublishDate": 1764547051638,
            "Source": "stock"
        },
        {
            "Title": "ShareIndia Securities Senior VP Prabhakar Tiwari Resigns with Immediate Effect",
            "Summary": "Prabhakar Tiwari, Senior Vice President and designated Senior Management Personnel at ShareIndia Securities Limited, resigned with immediate effect on November 28, 2025, citing strategic transitions. The resignation affects the company's senior management structure as ShareIndia acknowledged his contributions and initiated necessary relieving formalities.",
            "Sentiment": "neutral",
            "PublishDate": 1764412051127,
            "Source": "corporate_governance"
        },
        {
            "Title": "Share India Securities Withdraws from Drone Project and Abandons Subsidiary Formation Plans",
            "Summary": "Share India Securities has withdrawn its approval for a drone project and decided not to proceed with the formation of a related subsidiary. The other parties involved in the project may continue their operations without the company's participation.",
            "Sentiment": "neutral",
            "PublishDate": 1764410402524,
            "Source": "stock"
        },
        {
            "Title": "Share India Securities Fined Rs 1.5 Lakh by NSE for Algorithmic Trading Compliance Breach",
            "Summary": "National Stock Exchange imposed a monetary penalty of Rs 1,50,000 on Share India Securities for non-compliance with regulatory requirements pertaining to tagging of Unique Identifiers for algorithmic orders. The company stated the penalty was levied in normal course of stockbroking operations and has no material impact on its financials, operations, or business activities.",
            "Sentiment": "negative",
            "PublishDate": 1764065614157,
            "Source": "corporate_governance"
        },
        {
            "Title": "ShareIndia Securities Calls EGM to Approve USD 50 Million Foreign Currency Convertible Bonds Issuance",
            "Summary": "ShareIndia Securities Limited has scheduled an Extra-Ordinary General Meeting on December 17, 2025, to seek shareholder approval for raising up to USD 50 million through Foreign Currency Convertible Bonds via private placement. The funds will be used for augmenting financial resources, enhancing market presence, meeting working capital requirements, financing capital expenditure, and other general corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1764054757439,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Incorporates Wholly Owned Subsidiary Share India Wealth Multiplier Solutions",
            "Summary": "Share India Securities Limited has incorporated a wholly owned subsidiary named Share India Wealth Multiplier Solutions Private Limited. The subsidiary was incorporated on November 6, 2025, with CIN U66309UP2025PTC235957 and registered with the Registrar of Companies in Kanpur. The company received the Certificate of Incorporation from the Ministry of Corporate Affairs on November 6, 2025. The Board of Directors had previously approved the incorporation and investment in the subsidiary through subscription to its equity share capital in meetings held on October 29, 2024 and September 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762511754319,
            "Source": "corporate_action"
        },
        {
            "Title": "ShareIndia Securities Reports 7% PAT Growth in Q2 FY26, Declares 20% Interim Dividend",
            "Summary": "ShareIndia Securities Limited reported quarterly results with total revenue from operations at INR 265.20 crores, reflecting a 2.9% decline quarter-on-quarter. However, profit after tax increased 7% to INR 73.34 crores, with earnings per share at INR 0.35. The company declared a second interim dividend of INR 0.40 per share (20% on face value of INR 2). For the half-year, revenue reached INR 538 crores with a 22% year-on-year decline, while PAT stood at INR 142.07 crores. The company's MTF book grew 35-40% quarter-on-quarter to INR 430 crores. ShareIndia obtained PMS license from SEBI and plans to launch its first fund in November. The company received board approval for FCCB fundraising up to $50 million and established ShareIndia GreyHill for debt market operations. Management targets INR 1,000 crores MTF AUM by December 2027 and plans to expand with 12 new branches across Maharashtra, Gujarat, Uttar Pradesh, and Rajasthan over the next 12 months. Project Drone, a WealthTech initiative, is expected to launch its MVP in Q4 FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762242546433,
            "Source": "earnings"
        },
        {
            "Title": "Share India Securities Penalized Rs 1.18 Lakh by NSE Clearing for Trading Violation",
            "Summary": "Share India Securities Limited has been imposed a monetary penalty of Rs 1,18,000 (including IGST of Rs 18,000) by NSE Clearing Limited. The penalty relates to violation of NSE circular dated August 26, 2004, due to inadvertent increase in existing positions or creation of new positions in the underlying security of Sammaan Capital Limited. The penalty invoice was generated on October 29, 2025. The company states this penalty was levied in the normal course of stock broking operations and has no material impact on its financials, operations, or other business activities. Share India Securities has committed to maintaining high compliance standards and taking necessary steps to address the issue.",
            "Sentiment": "negative",
            "PublishDate": 1761849931725,
            "Source": "stock"
        },
        {
            "Title": "Share India Securities Approves $50 Million FCCB Fundraising and Forms New Venture",
            "Summary": "Share India Securities has approved fundraising through Foreign Currency Convertible Bonds (FCCBs) up to $50 million. The company has also announced the formation of Share India Greyhill with an investment of up to 60 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1761837234988,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Reports Q2 Revenue Decline Despite Improved Margins, Declares Interim Dividend",
            "Summary": "Share India Securities reported Q2 consolidated net profit of 932.2 million rupees, down from 1.24 billion rupees in the same quarter last year. Revenue fell to 3.41 billion rupees from 4.53 billion rupees year-over-year. However, EBITDA margin improved to 46.68% from 41.18% in the previous year, while absolute EBITDA decreased to 1.59 billion rupees from 1.86 billion rupees. The company recommended an interim dividend of 40 paise per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761836667233,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Fined Rs 1.18 Lakh by NSE Clearing for Position Violation",
            "Summary": "Share India Securities Limited received a monetary penalty of Rs 1,18,000 (including IGST of Rs 18,000) from NSE Clearing Limited. The penalty relates to violation of NSE circular NSCC/F&O/C&S/365 dated August 26, 2004, due to inadvertent increase in existing positions or creation of new positions in the underlying security of Sammaan Capital Limited. The penalty invoice was generated on October 27, 2025. The company stated this penalty occurred during normal stock broking operations and has no material impact on its financials, operations, or business activities. Share India Securities committed to maintaining high compliance standards and addressing the issue.",
            "Sentiment": "negative",
            "PublishDate": 1761652453600,
            "Source": "stock"
        },
        {
            "Title": "Share India Securities Schedules Board Meeting for Q2 Results and Dividend Declaration",
            "Summary": "Share India Securities Limited has scheduled a Board of Directors meeting for October 30, 2025 to consider and approve unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The board will also consider raising funds through foreign currency convertible bonds and declare a second interim dividend for financial year 2025-2026. The company has set November 6, 2025 as the record date for determining shareholder eligibility for the interim dividend payment.",
            "Sentiment": "neutral",
            "PublishDate": 1760961684362,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Approves INR 50 Crore NCD Issuance on Private Placement Basis",
            "Summary": "Share India Securities Limited's Finance Committee approved the issuance of up to 5,000 Non-Convertible Debentures with a face value of INR 1,00,000 each, totaling INR 50,00,00,000. The NCDs are secured, rated, listed, taxable, transferable, and redeemable, to be issued on a private placement basis. The debentures offer a 10.50% per annum coupon rate payable monthly, with a tenure of 712 days from allotment. Principal repayment will be made quarterly in instalments of 12.5% of face value. The NCDs will be listed on BSE's wholesale debt market segment and are secured by first ranking pari passu charge on MTF loan receivables, securities for trade, and current assets with minimum 1.5x cover, along with personal guarantees from promoters. In case of payment default exceeding three months, an additional 2% per annum will be charged over the coupon rate.",
            "Sentiment": "neutral",
            "PublishDate": 1760440004146,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Files Joint Petition with NCLT for Amalgamation with Silverleaf Capital Services",
            "Summary": "Share India Securities Limited and Silverleaf Capital Services Private Limited filed a joint petition on September 27, 2025, with the NCLT Ahmedabad Bench seeking approval for their Scheme of Amalgamation. Under this scheme, Silverleaf Capital Services will be the transferor company merging with Share India Securities as the transferee company. The companies had previously intimated about this amalgamation on July 12, 2025. The draft scheme and related documents have received 'No Adverse Observations' or 'No Objection' from stock exchanges and are available on Share India's website. The company disclosed this development under SEBI Listing Regulations to BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1759040961602,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Invests ₹28 Crore in Wholly Owned Subsidiary",
            "Summary": "Share India Securities Limited approved an additional investment of ₹27.99 crore in its wholly owned subsidiary, Share India Capital Services Private Limited (SICSPL). The investment involves subscribing to 81,63,265 equity shares at ₹34.30 per share on a rights basis. SICSPL operates as a Category-1 Merchant Banker in the financial services sector and reported a turnover of ₹23.03 crore in FY 2024-25, up from ₹18.81 crore in FY 2023-24. The company's net worth stands at ₹17.96 crore as of March 31, 2025. The investment aims to enhance SICSPL's financial strength and support business expansion. The transaction will be completed within seven working days and is being conducted on an arm's length basis.",
            "Sentiment": "positive",
            "PublishDate": 1758526907743,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Board Recommends Re-appointment of Whole-time Director and AGM Scheduled",
            "Summary": "Share India Securities Limited's Board of Directors recommended the re-appointment of Mr. Suresh Kumar Arora as Whole-time Director for five consecutive years from June 01, 2026 to May 30, 2031, subject to shareholder approval. The Board also recommended continuation of Dr. Gopalapillai Prasanna Kumar as Non-Executive Non-Independent Director post attaining age 75 years. The company scheduled its 31st Annual General Meeting for September 29, 2025 at 04:30 p.m. through video conferencing. The Board fixed September 10, 2025 as the record date for determining shareholder eligibility for final dividend payment for financial year 2024-25, pending AGM approval. Mr. Arora holds 31 years of experience in Indian and global financial markets, while Dr. Kumar is a retired IAS officer with over 38 years of civil service experience.",
            "Sentiment": "neutral",
            "PublishDate": 1756991155860,
            "Source": "corporate_governance"
        },
        {
            "Title": "Share India Securities Invests Rs. 28 Crores for 1.582% Stake in NCDEX",
            "Summary": "Share India Securities Limited's Finance Committee approved an investment of up to Rs. 28 crores to acquire 14,18,871 equity shares in National Commodity & Derivatives Exchange Limited (NCDEX), representing a 1.582% stake in the commodity exchange. The acquisition will be made at Rs. 197.34 per share through cash consideration. NCDEX, incorporated in 2003, operates as a technology-driven online commodity exchange platform with a net worth of Rs. 615.94 crores and turnover of Rs. 122.06 crores in FY 2024-25. Share India Securities stated the investment aligns with its strategic goal of strengthening presence in the financial services and securities market ecosystem. The transaction is not a related party deal and is expected to complete within 60 working days.",
            "Sentiment": "positive",
            "PublishDate": 1755608693071,
            "Source": "order&deals"
        },
        {
            "Title": "Share India Securities Completes ₹30 Crore Acquisition of 1.36% Stake in Metropolitan Stock Exchange",
            "Summary": "Share India Securities Limited has completed its acquisition of 15 crore equity shares in Metropolitan Stock Exchange of India Limited (MSE) for ₹30 crores, representing 1.36% of MSE's post-issue capital. The transaction was finalized after both companies fulfilled the conditions outlined in their share subscription and shareholder's agreement. The fund transfer was completed at 3:45 p.m. on the announcement date, following an earlier disclosure made in July 2025 regarding the approval for this investment.",
            "Sentiment": "positive",
            "PublishDate": 1755000580497,
            "Source": "order&deals"
        },
        {
            "Title": "Share India Securities Reports Strong Q1 Recovery with 45.6% Revenue Growth and Launches WealthTech Venture",
            "Summary": "Share India Securities reported standalone revenue of INR 273 crores for Q1 FY26, marking a 45.6% increase from the previous quarter's INR 188 crores. Profit before tax surged 427% to INR 89 crores, while profit after tax jumped 324% to INR 69 crores quarter-on-quarter. On consolidated basis, revenue reached INR 341 crores, up 42.57% from the previous quarter. The company's MTF book grew 40% to INR 315 crores from INR 186 crores in Q4. Share India successfully closed a INR 100 crores NCD at 10.75% and received SEBI approval for PMS license, with the first PMS team expected to launch by September. The company announced Project Drone, a WealthTech venture led by new hire Prabhakar Tiwari, former Chief Growth Officer of Angel One. The venture aims to create an integrated wealth platform targeting Tier 2, 3, and 4 cities with an MVP expected in 6-9 months. Share India also received regulatory approval for the merger of Silverleaf, which specializes in HST and Quant trading. The company declared a dividend of INR 0.30 per share and reported EPS of INR 3.15 on standalone basis.",
            "Sentiment": "positive",
            "PublishDate": 1754397169601,
            "Source": "earnings"
        },
        {
            "Title": "Share India Securities Publishes Q1 FY2026 Financial Results in Newspapers",
            "Summary": "Share India Securities Limited has published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025 in Financial Express (English) and Gandhinagar Samachar (Gujarati) newspapers. The company informed BSE Limited and National Stock Exchange of India Limited about the newspaper publication through a letter dated August 01, 2025, signed by Company Secretary & Compliance Officer Vikas Aggarwal. The results are also available on the company's website at www.shareindia.com. The publication was done in compliance with SEBI regulations 47 and 52 of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1754031224456,
            "Source": "earnings"
        },
        {
            "Title": "Share India Securities Declares Rs 0.30 Interim Dividend, Approves Rs 300 Crore Debt Fundraising and Subsidiary Formation",
            "Summary": "Share India Securities Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and declared an interim dividend of Rs 0.30 per equity share with face value of Rs 2 each. The record date is set for August 5, 2025, with payment by August 28, 2025. The Board approved raising up to Rs 300 crores through debt securities including Non-Convertible Debentures and Commercial Papers via private placement, with interest rates up to 11% per annum and tenure up to 3 years. The company approved incorporating a subsidiary named 'AnchorFort Wealth Private Limited' or 'Bharat Vantage Wealth Private Limited' with an investment of Rs 10.32 crores for 92.81% shareholding. The subsidiary will develop a WealthTech platform targeting emerging and mass affluent investors in Tier 2, 3, and 4 cities. Additionally, the Board appointed M/s Abhishek Gupta & Associates as Secretarial Auditors for five years from 2025-26 to 2029-30, subject to shareholder approval, and classified Ms. Beena Sadhwani and Mr. Gajendra Nagpal as Senior Management Personnel.",
            "Sentiment": "positive",
            "PublishDate": 1753889511997,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Plans ₹10.33 Crore Investment in WealthTech Subsidiary",
            "Summary": "Share India Securities plans to invest ₹10.33 crore in a new WealthTech subsidiary. The subsidiary will target wealthy investors in Tier 2 to 4 cities.",
            "Sentiment": "positive",
            "PublishDate": 1753889158109,
            "Source": "stock"
        },
        {
            "Title": "Share India Securities Reports Strong Q1 Results with 324% Jump in Standalone Net Profit",
            "Summary": "Share India Securities Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone net profit of Rs 6,872.91 lakhs compared to Rs 1,620.34 lakhs in the previous quarter, representing significant growth. Consolidated net profit stood at Rs 8,437.72 lakhs versus Rs 1,864.60 lakhs in the prior quarter. Total standalone revenue from operations reached Rs 27,314.31 lakhs, up from Rs 18,759.83 lakhs in the previous quarter. The board declared an interim dividend of Rs 0.30 per equity share and approved fundraising of up to Rs 300 crores through debt instruments. The company also received SEBI approval for Portfolio Management Services and made several strategic investments including Rs 41 crores in Master Trust Limited and Rs 30 crores in Metropolitan Stock Exchange of India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1753887915899,
            "Source": "earnings"
        },
        {
            "Title": "Share India Securities Schedules Earnings Call for Quarter Results",
            "Summary": "Share India Securities Limited has scheduled a conference call with analysts and investors on July 31, 2025, at 4:30 PM IST to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The management team will be represented by Managing Director Kamlesh Shah, Director Rajesh Gupta, CEO & Whole-time Director Sachin Gupta, and other senior management personnel. The company has stated that no price sensitive information will be disclosed during the call. Dial-in details and international toll-free numbers have been provided for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1753705401652,
            "Source": "earnings"
        },
        {
            "Title": "Share India Securities Schedules Board Meeting to Consider Quarterly Results, Interim Dividend, and Fundraising Proposal",
            "Summary": "Share India Securities Limited has scheduled a board meeting for July 30, 2025 to consider and approve unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board will also consider declaring the first interim dividend for financial year 2025-2026 and approve a proposal for raising funds through issuance of Non-Convertible Debentures or Commercial Papers on a private placement basis. The company has set August 5, 2025 as the record date for determining shareholder eligibility for the interim dividend payment, if declared by the board.",
            "Sentiment": "positive",
            "PublishDate": 1753267628993,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Approves Rs. 49.99 Crore Additional Investment in Wholly Owned Subsidiary",
            "Summary": "Share India Securities Limited's Finance Committee approved an additional investment of Rs. 49.99 crore in its wholly owned subsidiary, Share India Fincap Private Limited (SIFPL). The investment involves subscribing to 12,25,490 equity shares at Rs. 408 per share on a rights basis. SIFPL operates as a Non-Banking Financial Company offering services including women entrepreneurship loans, small enterprise loans, and loan against securities. The company has a net worth of Rs. 122.46 crore and reported turnover of Rs. 61.38 crore for FY 2024-25. The investment aims to enhance SIFPL's financial strength and support business expansion, with completion expected within four working days. SIFPL will continue as a wholly owned subsidiary following this transaction.",
            "Sentiment": "positive",
            "PublishDate": 1753098046079,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Receives Approval for Merger with Silverleaf Capital",
            "Summary": "Share India Securities has obtained approval from the National Stock Exchange (NSE) and received no negative feedback from the Bombay Stock Exchange (BSE) regarding its merger with Silverleaf Capital.",
            "Sentiment": "positive",
            "PublishDate": 1752305901000,
            "Source": "default"
        },
        {
            "Title": "Share India Supports Drone Wealthtech Venture",
            "Summary": "Share India is supporting a project called Drone Wealthtech, which is being led by fintech expert Prabhakar Tiwari. The venture appears to be related to drone technology in the wealth management or financial technology sector.",
            "Sentiment": "positive",
            "PublishDate": 1751291478000,
            "Source": "default"
        },
        {
            "Title": "Share India Securities Approves 410 Million Rupee Investment in Master Trust",
            "Summary": "Share India Securities has approved an investment of 410 million rupees in Master Trust. No further details about the nature of the investment or the reasons behind it were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750938564000,
            "Source": "default"
        },
        {
            "Title": "Share India Securities Allots ₹99.9 Crore NCDs via Private Placement",
            "Summary": "Share India Securities has allotted Non-Convertible Debentures (NCDs) worth ₹99.9 crores through a private placement. This financial move indicates the company is raising funds, potentially for business expansion or other corporate purposes.",
            "Sentiment": "positive",
            "PublishDate": 1750683274000,
            "Source": "default"
        },
        {
            "Title": "Share India Securities Reports Q4 Financial Results",
            "Summary": "Share India Securities has reported its Q4 consolidated net profit at 187.6 million rupees, compared to 1.16 billion rupees in the same quarter last year and 819.6 million rupees in the previous quarter. The company's Q4 revenue stood at 2.4 billion rupees, down from 4.65 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748223245000,
            "Source": "default"
        },
        {
            "Title": "Share India Securities Reports Q4 Financial Results",
            "Summary": "Share India Securities has released its Q4 financial results. The company reported revenue of 2.4 billion rupees, down from 4.65 billion rupees in the same quarter last year. The consolidated net profit for Q4 was 187.6 million rupees, a decrease from 1.16 billion rupees year-over-year and 819.6 million rupees quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1748015894000,
            "Source": "result"
        },
        {
            "Title": "Share India Securities Approved for Portfolio Management Services",
            "Summary": "The Securities and Exchange Board of India (Sebi) has granted approval to Share India Securities to begin offering portfolio management services. This regulatory approval allows the company to expand its financial service offerings and potentially enter a new market segment.",
            "Sentiment": "positive",
            "PublishDate": 1746490095000,
            "Source": "default"
        },
        {
            "Title": "SEBI Approves Share India Securities' Portfolio Management Services",
            "Summary": "The Securities and Exchange Board of India (SEBI) has granted approval to Share India Securities for their application to begin offering portfolio management services.",
            "Sentiment": "positive",
            "PublishDate": 1746450256000,
            "Source": "default"
        },
        {
            "Title": "Share India Securities Reports Q3 Financial Results",
            "Summary": "Share India Securities has announced its Q3 consolidated financial results. The company reported a net profit of 820 million rupees, which is lower compared to 1.15 billion rupees in the same quarter last year and 1.24 billion rupees in the previous quarter. The Q3 revenue stood at 3.4 billion rupees, down from 3.74 billion rupees in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1738109811000,
            "Source": "earnings"
        },
        {
            "Title": "Share India Securities Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Share India Securities has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter stood at 1.3 billion rupees, down from 1.82 billion rupees in the same quarter last year. The EBITDA margin also decreased to 38.35% from 48.80% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738074545000,
            "Source": "earnings"
        },
        {
            "Title": "Share India Securities Reports Q3 Financial Results",
            "Summary": "Share India Securities has announced its Q3 consolidated financial results. The company reported a net profit of 820 million rupees, which is lower compared to both the previous year (1.15 billion rupees) and the previous quarter (1.24 billion rupees). Revenue for Q3 stood at 3.4 billion rupees, down from 3.74 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1738074487000,
            "Source": "earnings"
        },
        {
            "Title": "Share India Securities to Consider Q3 Results",
            "Summary": "Share India Securities has announced that it will consider its third quarter (Q3) financial results on January 28.",
            "Sentiment": "neutral",
            "PublishDate": 1737464557000,
            "Source": "earnings"
        },
        {
            "Title": "Share India Securities Expands into Portfolio Management Services",
            "Summary": "Share India Securities has announced its entry into the business of providing Portfolio Management Services (PMS). The company states that this strategic move is expected to increase its penetration in the retail market, potentially expanding its customer base and diversifying its service offerings.",
            "Sentiment": "positive",
            "PublishDate": 1737073128000,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Expands into Portfolio Management Services",
            "Summary": "Share India Securities has announced its entry into the business of providing Portfolio Management Services (PMS). The company states that this strategic move is expected to increase its penetration in the retail market, potentially expanding its customer base and service offerings.",
            "Sentiment": "positive",
            "PublishDate": 1737041304000,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities Approves 595 Million Rupee Investment in MSE",
            "Summary": "Share India Securities has approved an investment of 595 million rupees in MSE (Metropolitan Stock Exchange of India). This significant financial commitment suggests the company is expanding its involvement in India's stock exchange infrastructure.",
            "Sentiment": "positive",
            "PublishDate": 1735050186000,
            "Source": "corporate_action"
        },
        {
            "Title": "Share India Securities: Fee-Based Business Drives Q2 Growth",
            "Summary": "Share India Securities reported strong Q2 numbers, driven by growth in margin trading facility (MTF), merchant banking, and institutional desk. The company plans to focus on retail business expansion and fee-based services. EBITDA margins improved to 42%. Share India is launching a wealth management subsidiary offering AIF and PMS services. The company is raising up to Rs 100 crore via NCDs for working capital needs, primarily for MTF expansion.",
            "Sentiment": "positive",
            "PublishDate": 1731320860000,
            "Source": "result"
        },
        {
            "Title": "Share India Securities Reports Q2 Results and Plans to Raise Funds",
            "Summary": "Share India Securities announced its Q2 financial results, showing a consolidated net profit of 1.24 billion rupees, up from 1.12 billion rupees year-over-year and 1.03 billion rupees quarter-over-quarter. Total revenue for Q2 increased to 4.5 billion rupees from 3.6 billion rupees in the previous year. The company also plans to raise 1 billion rupees through the issuance of non-convertible debentures.",
            "Sentiment": "positive",
            "PublishDate": 1730246097000,
            "Source": "corporate_action"
        }
    ]
}