{
    "Symbol": "SHEKHAWATI",
    "ISIN": "INE268L01046",
    "News": [
        {
            "Title": "Shekhawati Industries Withdraws LLP Investment Plan",
            "Summary": "Shekhawati Industries Limited has decided not to proceed with its proposed investment in Shekhawati & Shubhraj Developers LLP, reversing its earlier December 2025 board decision.",
            "Sentiment": "neutral",
            "PublishDate": 1770814132434,
            "Source": "stocks"
        },
        {
            "Title": "Shekhawati Industries Q3FY26 Loss Widens to ₹51.28 Lakhs",
            "Summary": "Shekhawati Industries reported a net loss of ₹51.28 lakhs for Q3FY26 compared to profit of ₹151.20 lakhs in Q3FY25, despite revenue from operations of ₹213.62 lakhs during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1768997374063,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shekhawati Industries Approves Investment in Real Estate LLP",
            "Summary": "Shekhawati Industries board approves up to 50% partnership investment in proposed Shekhawati Shubhraj Developers LLP, a real estate development company focused on high-quality projects.",
            "Sentiment": "positive",
            "PublishDate": 1765791569634,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shekhawati Industries Approves Quarterly Results and Reconstitutes Board Committees",
            "Summary": "Shekhawati Industries Limited's Board of Directors approved the unaudited financial results for the quarter ended September 30, 2025, along with a Limited Review Report. The board also reconstituted its Audit Committee and Stakeholder Relationship Committee. Both committees now comprise four members each: Mr. Sushil Kumar Poddar as Chairman, Mr. Mukesh Ramniranjan Ruia, Mr. Nirmal Bagri, and Mrs. Shweta Mundra as members. The board meeting was held on October 18, 2025, at the company's registered office in Mumbai.",
            "Sentiment": "neutral",
            "PublishDate": 1760781309275,
            "Source": "earnings"
        },
        {
            "Title": "Shekhawati Industries Acquires Additional Land in Khandala for Premium Villa Project Expansion",
            "Summary": "Shekhawati Industries Limited acquired an additional land parcel in Khandala, Maharashtra on August 26, 2025, to expand its premium luxury villa project. The acquisition aims to enhance the scale of development while maintaining exclusivity and quality standards associated with Shekhawati Villas.",
            "Sentiment": "positive",
            "PublishDate": 1756194781302,
            "Source": "stock"
        },
        {
            "Title": "Shekhawati Industries Approves Q2 2025 Financial Results and Multiple Auditor Appointments",
            "Summary": "Shekhawati Industries Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025, during a meeting held on July 24, 2025. The Board reappointed M/s. Sunil Kudva & Co. as Internal Auditor and M/s. N. Ritesh & Associates as Cost Auditor for FY 2025-2026. Additionally, the Board appointed M/s. SGCO & Co. LLP as Statutory Auditor and Dipesh Gosar & Co. as Secretarial Auditor for five years, both subject to shareholder approval at the 34th Annual General Meeting. The Board also appointed Mrs. Kalpana Mukesh Ruia as Additional Executive Director for a five-year term, who is identified as a relative of the Chairman & Managing Director. The company scheduled its 34th Annual General Meeting for September 10, 2025, via video conferencing and approved material related party transactions with M/s. SKI Realtech Private Limited and Mrs. Kalpana Mukesh Ruia for five years.",
            "Sentiment": "neutral",
            "PublishDate": 1753354964848,
            "Source": "corporate_action"
        },
        {
            "Title": "Shekhawati Industries: Q3 Profit Drops 36%, Revenue Up 16.6%",
            "Summary": "Shekhawati Industries reported Q3 FY25 results with profit falling 36.02% YoY to ₹1.51 crore, while revenue increased 16.63% YoY to ₹15.29 crore. Compared to Q2, revenue declined 14.44% and profit decreased 41.02%. EPS stood at ₹0.44, down 37.14% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737178609000,
            "Source": "earnings"
        }
    ]
}