{
    "Symbol": "SHEMAROO",
    "ISIN": "INE363M01019",
    "News": [
        {
            "Title": "Shemaroo Entertainment Postal Ballot for Preferential Issue",
            "Summary": "Shemaroo Entertainment announces postal ballot through remote e-voting from February 12 to March 13, 2026, seeking shareholder approval for preferential allotment of 14,10,000 equity shares to promoters and promoter group.",
            "Sentiment": "neutral",
            "PublishDate": 1770813280094,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shemaroo Entertainment Re-appoints Internal Auditor",
            "Summary": "Shemaroo Entertainment's Board approved the re-appointment of M/s. Mahajan & Aibara as Internal Auditor for FY 2026-2027, effective from April 01, 2026 to March 31, 2027.",
            "Sentiment": "neutral",
            "PublishDate": 1769756369635,
            "Source": "stocks"
        },
        {
            "Title": "Shemaroo Entertainment Q3FY26 Earnings Call Jan 30",
            "Summary": "Shemaroo Entertainment announces earnings conference call scheduled for January 30, 2026 at 12:00 PM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769154249251,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shemaroo Entertainment Faces Rs. 267 Crores Tax Demand in CGST Appeals Order",
            "Summary": "Shemaroo Entertainment received an order dated November 28, 2025 from CGST Central Excise Commissioner demanding recovery of Rs. 70.26 crores in Input Tax Credit along with penalties totaling Rs. 63.35 crores on the company and Rs. 133.61 crores each on its Joint Managing Director, CEO, and CFO. The company disputes the demand as legally unsustainable and plans to file a further appeal before the appropriate judicial forum.",
            "Sentiment": "negative",
            "PublishDate": 1765199662174,
            "Source": "stock"
        },
        {
            "Title": "Shemaroo Entertainment Grants 9,000 Stock Options to Employees at 41% Discount",
            "Summary": "Shemaroo Entertainment's Nomination and Remuneration Committee approved the grant of 9,000 stock options to eligible employees under its Employee Stock Option Scheme-2021, with an exercise price of Rs. 67 per option. The exercise price represents a 41% discount to the closing market price as of November 20, 2025, with options vesting within one year and exercisable within one year from vesting date.",
            "Sentiment": "positive",
            "PublishDate": 1763732697185,
            "Source": "corporate_action"
        },
        {
            "Title": "Shemaroo Entertainment Reports 11.5% Revenue Decline in Q2 with Net Loss of INR 453 Million",
            "Summary": "Shemaroo Entertainment Limited reported quarterly results with revenue from operations declining 11.5% year-on-year to INR 1,434 million. The company posted a net loss of INR 453 million with an EPS of negative INR 16.57 per share. EBITDA stood at negative INR 548 million with a margin of negative 38.20%. Digital Media business declined 10.29% year-on-year to INR 602 million, primarily due to deferment of syndication deals. Traditional Media business fell 12.40% to INR 831 million, with broadcast business remaining under pressure due to muted festive-season advertising and subdued FMCG spending on television. The company's margins remained under pressure due to ongoing accelerated inventory charge-offs as part of a strategic initiative. During the quarter, Shemaroo launched a new Hindi movie channel called Shemaroo Josh on September 1, 2025. The company's YouTube channels showed strong performance with Shemaroo Filmi Gaane surpassing 73.5 million subscribers and Shemaroo Ent crossing 60 million subscribers, garnering over 11 billion views across its portfolio channels.",
            "Sentiment": "negative",
            "PublishDate": 1762395844651,
            "Source": "earnings"
        },
        {
            "Title": "Shemaroo Entertainment Reports Leadership Changes and Employee Stock Option Grant",
            "Summary": "Shemaroo Entertainment announced the resignation of Namrata Shinde as Compliance Officer due to personal reasons, effective November 4, 2025. The company appointed Meenakshi A. Pansari as the new Company Secretary and Compliance Officer from November 5, 2025. Pansari brings 12 years of experience including 9 years in secretarial and compliance functions, with qualifications as Company Secretary and Cost Accountant. The board also approved granting 590,485 employee stock options under the existing ESOP scheme - 480,485 options at Rs. 67 per share (40% discount to market price) and 110,000 options at Rs. 100 per share (10% discount to market price). The company released its unaudited financial results for the quarter ended September 30, 2025, showing consolidated net loss of Rs. 4,505.75 lakhs for the quarter and Rs. 10,083.25 lakhs for the half-year period.",
            "Sentiment": "neutral",
            "PublishDate": 1762346551605,
            "Source": "corporate_action"
        },
        {
            "Title": "Shemaroo Entertainment Schedules Q2/H1-FY26 Earnings Conference Call for November 6, 2025",
            "Summary": "Shemaroo Entertainment Limited has announced an earnings conference call for investors to discuss its unaudited financial results for the quarter ended September 30, 2025. The call is scheduled for Thursday, November 6, 2025 at 12:00 PM IST. The management team will be represented by CEO Hiren Gada, COO Arghya Chakravarty, and CFO Amit Haria. The company has provided multiple dial-in numbers including universal, US, UK, Singapore, and Hong Kong toll-free access numbers for participants.",
            "Sentiment": "neutral",
            "PublishDate": 1761913699587,
            "Source": "earnings"
        },
        {
            "Title": "Shemaroo Entertainment Reports 10% Revenue Decline and INR 46 Crore Net Loss in Q1 FY26",
            "Summary": "Shemaroo Entertainment reported revenue of INR 140 crores for Q1 FY26, declining 10% year-on-year, with an EBITDA loss of INR 56 crores and net loss of INR 46 crores. The company attributed the decline to re-entry of major broadcast channels (Star Utsav, Colors Rishtey, Zee Anmol, Sony Pal) on Free Dish platform, causing viewership redistribution and impacting advertising revenues by 15-25% across channels. Digital media revenues grew 18% to INR 67 crores, while traditional media revenues fell 26% to INR 72 crores. The company spent INR 32 crores on new initiatives during the quarter and continues accelerated inventory charge-offs of approximately INR 35 crores quarterly, with total planned charge-offs of INR 140 crores for FY26. Current debt stands at INR 306 crores, up INR 5 crores from March. Management expects continued pressure on broadcast revenues but anticipates slower decline rates going forward, with seasonal advertising pickup expected during festive season.",
            "Sentiment": "negative",
            "PublishDate": 1753787529809,
            "Source": "earnings"
        },
        {
            "Title": "Shemaroo Entertainment Reports Loss of INR 458 Million in Q1-FY26 Amid Traditional Media Decline",
            "Summary": "Shemaroo Entertainment reported a net loss of INR 458 million for Q1-FY26, compared to a loss of INR 171 million in the same quarter last year. Revenue from operations declined 9.6% year-on-year to INR 1,395 million. The company's EBITDA was negative INR 555 million with a margin of -39.78%. While digital media revenue grew 17.7% to INR 673 million, traditional media revenue fell 25.7% to INR 722 million. The company attributed the traditional media decline to re-entry of major broadcaster channels on Free Dish platform, packed sports calendar, and continued softness in FMCG advertising. Digital highlights included Shemaroo Filmi Gaane crossing 72.5 million YouTube subscribers and over 10 billion views across portfolio channels during the quarter. The company released 6 new Gujarati titles on ShemarooMe platform. Margins remain under pressure due to ongoing accelerated inventory charge-offs initiated six quarters ago. The company expects seasonal uptick in advertising spends in upcoming quarters driven by festive period.",
            "Sentiment": "negative",
            "PublishDate": 1753371444204,
            "Source": "earnings"
        },
        {
            "Title": "Shemaroo Entertainment Focuses on Digital Growth Strategy",
            "Summary": "Shemaroo Entertainment is emphasizing digital expansion and strategic realignment as its traditional business faces challenges. The company is targeting long-term value creation through improved operational efficiency and expects benefits from increased festive season advertising activity.",
            "Sentiment": "neutral",
            "PublishDate": 1753370987251,
            "Source": "stock"
        },
        {
            "Title": "Shemaroo Entertainment Reports Wider Quarterly Loss and Revenue Decline",
            "Summary": "Shemaroo Entertainment reported a consolidated net loss of 458 million rupees in Q1, significantly higher than the previous quarter's loss of 171 million rupees. The company's revenue also declined to 1.39 billion rupees from 1.54 billion rupees in the previous quarter, representing a sequential decrease in both profitability and top-line performance.",
            "Sentiment": "negative",
            "PublishDate": 1753364443332,
            "Source": "earnings"
        },
        {
            "Title": "Shemaroo Entertainment Re-appoints Key Leadership and Transfers Broadcasting License",
            "Summary": "Shemaroo Entertainment Limited announced the re-appointment of three senior executives for three-year terms starting January 1, 2026, subject to shareholder approval. Raman Maroo will continue as Managing Director, Atul Maru as Joint Managing Director, and Hiren Gada as Whole-time Director and CEO. The company also appointed Namrata Shinde as Compliance Officer effective July 24, 2025. Additionally, Shemaroo will transfer its Mango TV broadcasting license to Mango Mass Media Private Limited for a consideration of at least Rs. 25 lakh, pending approval from the Ministry of Information and Broadcasting. The company reported quarterly results showing a consolidated net loss of Rs. 4,580.94 lakhs for the quarter ended June 30, 2025, compared to Rs. 1,725.06 lakhs in the same period last year. Revenue from operations decreased to Rs. 13,951.64 lakhs from Rs. 15,439.43 lakhs year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1753363279414,
            "Source": "corporate_action"
        },
        {
            "Title": "Shemaroo Entertainment Re-appoints Key Leadership Team for 3-Year Terms Starting January 2026",
            "Summary": "Shemaroo Entertainment's board approved the re-appointment of three key executives for 3-year terms from January 1, 2026 to December 31, 2028, subject to shareholder approval. Raman Maroo will continue as Managing Director, Atul Maru as Joint Managing Director, and Hiren Gada as Whole-Time Director and CEO. The company also appointed Namrata Shinde as Compliance Officer effective July 24, 2025. Additionally, the board approved unaudited quarterly results for the quarter ended June 30, 2025, showing consolidated revenue of Rs 13,951.64 lakhs and a net loss of Rs 4,580.94 lakhs. The company also approved the transfer of Mango TV's broadcasting license to Mango Mass Media Private Limited for a consideration of not less than Rs 25 lakhs, subject to regulatory approval.",
            "Sentiment": "neutral",
            "PublishDate": 1753361627289,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shemaroo Entertainment Employees Granted Relief in GST Penalty Case",
            "Summary": "The High Court has provided relief to Shemaroo Entertainment employees in a case involving a Rs 400 crore GST penalty. This decision suggests a favorable outcome for the company and its staff in a significant tax-related legal matter.",
            "Sentiment": "positive",
            "PublishDate": 1745194847000,
            "Source": "default"
        },
        {
            "Title": "Bombay High Court Grants Relief to Shemaroo Employees in GST Penalty Case",
            "Summary": "The Bombay High Court has provided relief to employees of Shemaroo Entertainment in a case involving a Rs 400 crore GST penalty. The court's decision offers protection to the company's staff members who were facing potential legal consequences related to the tax dispute.",
            "Sentiment": "positive",
            "PublishDate": 1744909938000,
            "Source": "default"
        },
        {
            "Title": "Shemaroo Entertainment: Bombay High Court Stays ₹400 Crore GST Penalty on Employees",
            "Summary": "Bombay High Court grants interim relief to three senior Shemaroo Entertainment employees facing ₹400 crore personal GST penalties. Court stays coercive action pending final hearing on June 10, 2025. Case challenges constitutionality and proportionality of penalties under GST law.",
            "Sentiment": "positive",
            "PublishDate": 1744903627000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shemaroo Entertainment: Q3 Losses Widen Despite Revenue Growth",
            "Summary": "Shemaroo Entertainment reported Q3 FY25 results with revenue up 5.41% YoY to ₹164.37 crore, but losses increased 21.48% YoY to ₹36.37 crore. Operating income declined 128.96% YoY, while SG&A expenses rose 16.04% YoY. EPS decreased to ₹-13.35, down 21.14% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1737093465000,
            "Source": "earnings"
        },
        {
            "Title": "Shemaroo Entertainment Incorporates New Digital Unit in Dubai",
            "Summary": "Shemaroo Entertainment has announced the incorporation of a new subsidiary, Shemarooverse Digital, in Dubai. The new unit is established with an initial paid-up capital of 50,000 USD and will focus on digital entertainment and Web3 technologies.",
            "Sentiment": "positive",
            "PublishDate": 1735518169000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shemaroo Entertainment Establishes Digital Subsidiary in Dubai",
            "Summary": "Shemaroo Entertainment has announced the incorporation of a new subsidiary named Shemarooverse Digital in Dubai. The new unit is established with an initial paid-up capital of 50,000 USD and will focus on digital entertainment and Web3 technologies.",
            "Sentiment": "positive",
            "PublishDate": 1735302144000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shemaroo Entertainment Reports Q2 Revenue Decline",
            "Summary": "Shemaroo Entertainment's second-quarter revenue has decreased to 1.52 billion rupees from 1.91 billion rupees in the same quarter last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1729168980000,
            "Source": "result"
        },
        {
            "Title": "Shemaroo Entertainment Reports Q2 Net Loss",
            "Summary": "Shemaroo Entertainment has reported a net loss of 269 million rupees for the second quarter, compared to a profit of 46 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729168967000,
            "Source": "result"
        },
        {
            "Title": "Shemaroo Entertainment Schedules Q2 Results Board Meeting",
            "Summary": "<p><span class='neutral'>Shemaroo Entertainment</span> has announced a <b>board meeting</b> scheduled for <span class='neutral'>October 17</span> to consider and approve the company's <span class='neutral'>financial results</span> for the <b>second quarter</b> of the current fiscal year.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1728472740000,
            "Source": "corporate_action"
        }
    ]
}