{
    "Symbol": "SHERA",
    "ISIN": "INE0MM001019",
    "News": [
        {
            "Title": "Shera Energy Starts Copper Cathode Production in Zambia",
            "Summary": "Shera Energy Limited has commenced copper cathode production at its facility in Zambia, marking a significant operational milestone for the non-ferrous metals company.",
            "Sentiment": "positive",
            "PublishDate": 1766127630487,
            "Source": "stocks"
        },
        {
            "Title": "Shera Energy Reports 30% Revenue Growth in H1",
            "Summary": "Shera Energy reported H1 revenue of 7.8 billion rupees compared to 6 billion rupees in the same period last year, representing a year-over-year increase of 30%.",
            "Sentiment": "positive",
            "PublishDate": 1762494908876,
            "Source": "earnings"
        },
        {
            "Title": "Shera Energy Reports 58% Jump in H1 Net Profit to 120M Rupees",
            "Summary": "Shera Energy reported H1 consolidated net profit of 120 million rupees compared to 76 million rupees in the same period last year. The company's EBITDA increased to 394 million rupees from 301 million rupees year-on-year. EBITDA margin improved to 5.1% versus 4.46% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762494376537,
            "Source": "earnings"
        },
        {
            "Title": "SHERA Group Acquires Copper Facility in Zambia",
            "Summary": "SHERA Group has expanded its global presence by acquiring a copper facility in Zambia. This acquisition is described as a significant step in the company's expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1749535721000,
            "Source": "default"
        },
        {
            "Title": "Shera Energy Reports H2 Financial Results",
            "Summary": "Shera Energy has released its financial results for the second half (H2). The company's revenue increased to 6.7 billion rupees from 4.9 billion rupees year-over-year. EBITDA rose to 301 million rupees from 266 million rupees. However, the EBITDA margin decreased to 4.46% from 5.42%. Consolidated net profit improved to 102 million rupees from 68 million rupees compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1748421380000,
            "Source": "result"
        },
        {
            "Title": "Shera Energy Reports Significant Sales Growth in FY 2023-24",
            "Summary": "Shera Energy has announced consolidated sales of approximately Rs 1,278 crore for the fiscal year 2023-24, marking a substantial increase from Rs 875 crore in the previous year. This impressive growth demonstrates the company's strong performance and market position.",
            "Sentiment": "positive",
            "PublishDate": 1743664350000,
            "Source": "earnings"
        },
        {
            "Title": "Shera Energy Reports Consolidated Provisional Sales of ₹900.13 Crore",
            "Summary": "Shera Energy, an SME with a market capitalization of ₹425 crore, has announced consolidated provisional sales figures of ₹900.13 crore. This financial update provides insight into the company's recent performance.",
            "Sentiment": "positive",
            "PublishDate": 1735720037000,
            "Source": "earnings"
        },
        {
            "Title": "Shera Energy Increases Production Capacity by 15%",
            "Summary": "Shera Energy Group has announced a significant increase in its production capacity. The company has secured an expansion from 41,130 MT to 46,750 MT, representing an approximate 15% increase in their production capabilities. This development is likely to boost the company's output and potentially its market position. The company currently has a market capitalization of 419 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1735551634000,
            "Source": "corporate_action"
        }
    ]
}