{
    "Symbol": "SHILCTECH",
    "ISIN": "INE024F01011",
    "News": [
        {
            "Title": "Shilchar Technologies Postal Ballot for Director Appointments",
            "Summary": "Shilchar Technologies seeks shareholder approval via postal ballot for director appointments and remuneration increases, with e-voting from February 5-March 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770139670161,
            "Source": "stocks"
        },
        {
            "Title": "Shilchar Technologies Q3 FY26 Results Show Strong Growth",
            "Summary": "Shilchar Technologies reported net profit of ₹4,233.77 lakhs for Q3 FY26, up from ₹3,477.29 lakhs in Q3 FY25. Nine-month net profit reached ₹12,976.95 lakhs compared to ₹9,148.74 lakhs in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769848203897,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shilchar Technologies Board Meet Set for Jan 31",
            "Summary": "Shilchar Technologies Limited has scheduled a board meeting for January 31, 2026, to review and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769184732759,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shilchar Tech Receives NSE Approval for Listing of 1.14 Crore Equity Shares",
            "Summary": "Shilchar Tech has received NSE approval for listing 1.14 crore equity shares effective November 24, 2025, with the trading symbol 'SHILCTECH'. The approval enables the company's shares to be traded on the National Stock Exchange, providing liquidity access for shareholders and investors.",
            "Sentiment": "positive",
            "PublishDate": 1763679167263,
            "Source": "stock"
        },
        {
            "Title": "Shilchar Technologies Reports 31% Revenue Growth, Announces Major Capacity Expansion",
            "Summary": "Shilchar Technologies delivered revenue of INR 171 crores in Q2 FY26, marking 31% year-on-year growth. Net profit surged 40% to INR 46 crores while maintaining EBITDA margins at 31%. The company announced its largest capacity expansion, adding 6,500 MVA to reach 14,000 MVA by April 2027 with INR 90 crores investment funded through internal accruals. The expansion will enable manufacturing of 220 kV class transformers up to 100 MVA. Current order book stands at INR 300 crores with management targeting INR 750 crores revenue for FY26. Export business faces 50% US tariffs implemented from August 27, though customers continue paying the additional duties. The company maintains 50% export-domestic revenue split, with US exports comprising 12-15% of total revenue. Capacity utilization reached 90-95% in Q2, with full capacity expected to generate INR 1,400-1,500 crores revenue.",
            "Sentiment": "positive",
            "PublishDate": 1761302606525,
            "Source": "earnings"
        },
        {
            "Title": "Shilchar Technologies Promoter Alay Jitendra Shah Sells 1.02% Stake for ₹117,000 Shares",
            "Summary": "Alay Jitendra Shah, promoter of Shilchar Technologies Limited, sold 117,000 equity shares representing 1.0227% of the company through open market transactions on October 21, 2025. Following the sale, Shah's shareholding decreased from 25.5813% to 24.5585%. The company's total equity share capital remains at 11,440,200 shares, and its shares are listed on BSE Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1761205880278,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilchar Technologies Plans Capacity Expansion in Power and Distribution Transformers",
            "Summary": "Shilchar Technologies is planning capacity expansion in power and distribution transformers. The company is experiencing rising export orders and strong margin visibility. The company is focusing on renewable energy and rail electrification segments.",
            "Sentiment": "positive",
            "PublishDate": 1760718470227,
            "Source": "stock"
        },
        {
            "Title": "Shilchar Technologies Reports 31% Revenue Growth in Q2FY26, Announces Major Capacity Expansion",
            "Summary": "Shilchar Technologies reported revenue from operations of ₹171 crore in Q2FY26, marking 31% year-on-year growth. The company's EBITDA stood at ₹53.60 crore with a margin of 31.3%, while profit after tax reached ₹45.94 crore, representing 40% growth. For the half-year period, revenue increased 39% to ₹330 crore with PAT growing 54% to ₹87.43 crore. The company announced its largest capacity expansion project, adding 6,500 MVA to reach total capacity of 14,000 MVA by April 2027, funded through internal accruals with capital expenditure of ₹90 crore. Management cited strong momentum in domestic power and renewable energy sectors, with India adding 21.7 GW of solar capacity during H1FY26. The company maintains a debt-free balance sheet and expects order pipeline of ₹750-800 crore for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1760713678432,
            "Source": "earnings"
        },
        {
            "Title": "Shilchar Tech Reports 40% Jump in Q2 Net Profit to 459M Rupees",
            "Summary": "Shilchar Tech reported quarterly net profit of 459 million rupees compared to 327 million rupees in the same period last year. Revenue increased to 1.7 billion rupees from 1.31 billion rupees year-over-year. EBITDA rose to 536 million rupees from 409 million rupees, while EBITDA margin remained relatively stable at 31.29% versus 31.35% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760702038933,
            "Source": "earnings"
        },
        {
            "Title": "Shilchar Technologies Approves Unaudited Financial Results for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Shilchar Technologies Limited's Board of Directors approved the company's unaudited financial results for the quarter and half year ended September 30, 2025. The board meeting was held on October 17, 2025, from 4:00 PM to 5:00 PM. The results were accompanied by a Limited Review Report from the statutory auditors. The company has submitted these results to BSE Limited as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1760701920195,
            "Source": "earnings"
        },
        {
            "Title": "Shilchar Technologies Plans Rs. 90 Crore Capacity Expansion at Vadodara Plant",
            "Summary": "Shilchar Technologies Limited announced a capacity expansion plan for its plant in Gavasad, Vadodara. The company plans to add 6500MVA to its existing 7500MVA capacity by April 2027, investing approximately Rs. 90 Crores from internal funds. The existing capacity is currently operating at 100% utilization. The expansion is aimed at meeting customer demand.",
            "Sentiment": "positive",
            "PublishDate": 1758098831909,
            "Source": "stock"
        },
        {
            "Title": "Shilchar Technologies Plans Capacity Expansion and High-Value Product Shift",
            "Summary": "Shilchar Technologies is focusing on improving order fulfillment and expanding exports while transitioning to high-value transformers. The company has outlined plans for capacity expansion and R&D investments with targets to increase revenue and improve margins by FY26-28.",
            "Sentiment": "positive",
            "PublishDate": 1755016907926,
            "Source": "stock"
        },
        {
            "Title": "Shilchar Technologies Reports 48% Revenue Growth in Q1FY26, Maintains Strong Profitability",
            "Summary": "Shilchar Technologies Limited reported revenue from operations of ₹158.75 crores for the first quarter ended June 30, 2025, representing a 48% year-on-year growth from ₹106.99 crores in Q1FY25. The company's EBITDA increased 78% to ₹52.42 crores with margins expanding to 33% from 27.6% in the previous year. Profit after tax grew 73% to ₹41.49 crores, while earnings per share reached ₹36.27. The transformer manufacturer attributed growth to accelerated renewable energy installations, particularly in the solar sector, which added 10.6 GW of the total 12.3 GW new capacity added to the national grid during the quarter. The company maintains its annual revenue target of ₹750-800 crores for FY26 and is assessing opportunities for further capacity expansion. Shilchar operates with a debt-free balance sheet and has production capacity of 7,500 MVA, focusing on custom-made transformers for renewables and industrial applications across 25+ countries.",
            "Sentiment": "positive",
            "PublishDate": 1755004614051,
            "Source": "earnings"
        },
        {
            "Title": "Shilchar Technologies Approves Quarterly Financial Results",
            "Summary": "Shilchar Technologies Limited's Board of Directors approved the company's unaudited financial results for the quarter ended June 30, 2025. The board meeting was held on August 12, 2025, from 12:30 P.M. to 01:00 P.M. The approved results include a Limited Review Report from statutory auditors. The company has submitted these results to BSE Limited as part of regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1754985204877,
            "Source": "earnings"
        },
        {
            "Title": "Shilchar Technologies Approves 1:2 Bonus Share Issue",
            "Summary": "The Board of Directors of Shilchar Technologies has approved a bonus share issue at a ratio of 1:2. This means shareholders will receive one additional share for every two shares they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1749444634000,
            "Source": "default"
        },
        {
            "Title": "Shilchar Technologies Approves Dividend and Bonus Issue",
            "Summary": "Shilchar Technologies has approved a final dividend of Rs 12.50 per share. Additionally, the company has approved a bonus issue in the ratio of 2:1, meaning shareholders will receive two additional shares for every one share held.",
            "Sentiment": "positive",
            "PublishDate": 1745226348000,
            "Source": "default"
        },
        {
            "Title": "Shilchar Technologies Reports Strong Q4 Financial Results",
            "Summary": "Shilchar Technologies has announced its Q4 financial results, showing significant year-over-year growth. The company's revenue increased to 2.3 billion rupees from 1.05 billion rupees in the same quarter last year. Additionally, the standalone net profit rose to 554 million rupees, up from 250 million rupees in the previous year's Q4.",
            "Sentiment": "positive",
            "PublishDate": 1745225980000,
            "Source": "result"
        },
        {
            "Title": "Shilchar Technologies to Consider Bonus Share Issue",
            "Summary": "Shilchar Technologies has announced a board meeting scheduled for April 21 to consider the issuance of bonus equity shares to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1744762266000,
            "Source": "default"
        },
        {
            "Title": "Shilchar Technologies to Consider Bonus Share Issue",
            "Summary": "Shilchar Technologies has announced a board meeting scheduled for April 21 to consider the issuance of bonus equity shares to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1744717484000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilchar Tech Reaffirms Revenue Target for FY25",
            "Summary": "Shilchar Tech has reaffirmed its commitment to achieving a revenue target of Rs 550 crore for the fiscal year 2025. The company also stated that it is on track to fully utilize its increased production capacity by fiscal year 2026, as per their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1729774118000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilchar Tech Reports Strong Q2 Financial Performance",
            "Summary": "Shilchar Tech has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA increased from 297 million rupees to 409 million rupees. Additionally, the EBITDA margin improved from 27.93% to 31.35%.",
            "Sentiment": "positive",
            "PublishDate": 1729771282000,
            "Source": "result"
        },
        {
            "Title": "Shilchar Technologies Reports Q2 Revenue Growth",
            "Summary": "Shilchar Technologies has announced its Q2 revenue, which stands at 1.3 billion rupees, compared to 1.06 billion rupees in the same quarter last year, indicating a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1729771273000,
            "Source": "result"
        },
        {
            "Title": "Shilchar Technologies Reports Q2 Net Profit Increase",
            "Summary": "Shilchar Technologies has reported a net profit of 327 million rupees for the second quarter, showing a year-over-year increase from 244 million rupees and a quarter-over-quarter increase from 239.8 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1729771262000,
            "Source": "result"
        }
    ]
}