{
    "Symbol": "SHILPAMED",
    "ISIN": "INE790G01031",
    "News": [
        {
            "Title": "Shilpa Medicare Q3 Net Profit Surges 40% YoY",
            "Summary": "Shilpa Medicare reports consolidated net profit of 445 million rupees in Q3, marking significant 40% growth compared to 318 million rupees in the same quarter previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770369368158,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shilpa Medicare Q3FY26 Earnings Call on Feb 6",
            "Summary": "Shilpa Medicare Limited announces earnings conference call scheduled for February 6, 2026 at 16:00 hrs to discuss third quarter FY26 results ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769758985927,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shilpa Medicare Gets FDA Orphan Drug Status",
            "Summary": "Shilpa Medicare and Mabtree Biologics receive U.S. FDA orphan drug designation for biologic targeting rare blood cancers, securing regulatory benefits and development support.",
            "Sentiment": "positive",
            "PublishDate": 1769591217305,
            "Source": "stocks"
        },
        {
            "Title": "Shilpa Medicare Sells Canadian Subsidiary for CAD 2000",
            "Summary": "Shilpa Medicare Limited divests its wholly owned subsidiary Koanna Healthcare Canada Inc. to an individual buyer for CAD 2000, with no impact on company financials.",
            "Sentiment": "neutral",
            "PublishDate": 1768451636931,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shilpa Medicare receives court injunction on Ruxolitinib",
            "Summary": "Delhi High Court restrains Shilpa Medicare and subsidiaries from manufacturing pharmaceutical products containing Ruxolitinib due to patent infringement allegations. Company states no financial impact.",
            "Sentiment": "negative",
            "PublishDate": 1767082271867,
            "Source": "stocks"
        },
        {
            "Title": "Shilpa Medicare Gets European Approval for Patch",
            "Summary": "Shilpa Medicare receives initial authorization for Rotigotine transdermal patch in Europe with USD 222 million market potential. Launch planned by FY27 for treating Parkinson's disease and Restless Leg Syndrome.",
            "Sentiment": "positive",
            "PublishDate": 1765520669752,
            "Source": "stocks"
        },
        {
            "Title": "Shilpa Medicare Receives FDA Form 483 with Eight Observations After Facility Inspection",
            "Summary": "The USFDA completed a 10-day inspection of Shilpa Medicare's Unit IV facility in Jadcherla, Telangana, and issued a Form 483 containing eight observations. The company noted that none of the observations are repeat in nature, indicating they are new regulatory findings from this inspection.",
            "Sentiment": "neutral",
            "PublishDate": 1763942813407,
            "Source": "stock"
        },
        {
            "Title": "USFDA Issues Form 483 With Eight Observations After Inspecting Shilpa Medicare's Jadcherla Unit IV",
            "Summary": "The USFDA completed a 10-day inspection at Shilpa Medicare's Jadcherla Unit IV facility and issued a Form 483 citing eight new regulatory observations. This regulatory action affects Shilpa Medicare's manufacturing operations and indicates areas requiring corrective measures to meet FDA compliance standards.",
            "Sentiment": "neutral",
            "PublishDate": 1763799570606,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Medicare Reports Record Q2 FY26 Results with Highest Quarterly EBITDA of INR 110 Crores",
            "Summary": "Shilpa Medicare achieved highest quarterly revenues of INR 372 crores (7% YoY growth) and crossed INR 100 crores EBITDA milestone for first time, with 30% EBITDA margin and 21% growth. The company launched its first NCE product NorUDCA in India and expects commercial supplies from multiple pipeline products including NCE programs, Semaglutide, and biosimilars to drive future growth across API, formulations and biologics segments.",
            "Sentiment": "positive",
            "PublishDate": 1763548762380,
            "Source": "earnings"
        },
        {
            "Title": "Shilpa Medicare Launches World's First NODUCA Therapy for Liver Disease Treatment in India",
            "Summary": "Shilpa Medicare Limited launched NODUCA (NorUDCA), a first-in-class therapy for metabolic dysfunction-associated fatty liver disease (MAFLD) following CDSCO approval in August 2025, making it the first company globally to bring this treatment to market. The drug targets MAFLD affecting 188 million patients in India, with Phase 3 trials showing 83.3% of patients achieving fibrosis reversal and 90% reaching normal liver enzyme levels within 3 months.",
            "Sentiment": "positive",
            "PublishDate": 1763355865443,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Medicare Expands Operations with New R&D Center and Manufacturing Facility in Raichur",
            "Summary": "Shilpa Medicare is building a new R&D center and manufacturing facility in Raichur while expanding its oncology, biologics, and API exports business. The company is targeting high-margin complex generics and CRAMS opportunities through strategic partnerships with U.S. and EU clients to strengthen its global presence.",
            "Sentiment": "positive",
            "PublishDate": 1763051649197,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Medicare Reports Record Quarterly Performance with 7% Revenue Growth and 30% EBITDA Margin",
            "Summary": "Shilpa Medicare Limited reported its highest quarterly revenue of INR 372 crores in Q2 FY26, representing 7% year-over-year growth. The company achieved record quarterly EBITDA of INR 110 crores with margins expanding to 30%, up from 26% in the previous year. For the first half of FY26, revenue grew 8% to INR 700 crores while EBITDA increased 20% to INR 208 crores. The API segment drove growth with 14% quarterly increase, led by commercialization of expanded capacities and key base business products. The formulations business reported 16% revenue growth, with key products gaining US market share through partners. The company is preparing to launch NorUDCA in Q3 FY26, India's first-in-class therapy for NAFLD, through strategic partnerships with three Indian companies. In biologics, two Novel Biologic Entity projects are expected to enter human studies in FY27. The company filed 23 new DMFs across markets and received 36 new approvals in the first half.",
            "Sentiment": "positive",
            "PublishDate": 1763033252555,
            "Source": "earnings"
        },
        {
            "Title": "Shilpa Medicare Reports Mixed Q2 Results with Revenue Growth but Exceptional Losses",
            "Summary": "Shilpa Medicare Limited reported quarterly results with revenue from operations of Rs 9,203.31 lakhs compared to Rs 2,968.24 lakhs in the previous quarter. Net profit for the quarter was Rs 3,082.83 lakhs versus Rs 2,069.73 lakhs in the prior quarter. However, the company recorded exceptional losses of Rs 156.64 lakhs in standalone financials, primarily due to provisions for impairment on foreign subsidiary advances and investments. The company also announced the allotment of 9,77,90,908 bonus equity shares in a 1:1 ratio and entered into an agreement to sell 31% stake in joint venture Sravathi Advance Process Technologies for Rs 4,960.05 lakhs. Basic earnings per share stood at Rs 1.58 for the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763027095141,
            "Source": "earnings"
        },
        {
            "Title": "Shilpa Medicare Reports Strong Q2 Performance with 146% Jump in Net Profit",
            "Summary": "Shilpa Medicare delivered robust quarterly results with consolidated net profit surging to 440 million rupees from 179 million rupees year-over-year. Revenue grew to 3.7 billion rupees compared to 3.4 billion rupees in the same period last year. The company's EBITDA increased to 1.08 billion rupees from 860 million rupees, while EBITDA margin expanded to 29.27% from 25.01% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1763025626032,
            "Source": "earnings"
        },
        {
            "Title": "Shilpa Medicare Completes Postal Ballot for Promoter Group Reclassification",
            "Summary": "Shilpa Medicare Limited announced the successful completion of a postal ballot process for reclassifying two promoter group members to public category. The company received approval from shareholders for reclassifying Mr. Suraj Kumar Inani and Ms. Priya Inani from promoter group category to public category. The postal ballot notice was dated October 7, 2025, with e-voting conducted from October 9 to November 8, 2025. Both ordinary resolutions were passed with requisite majority, with over 97% votes in favor for each resolution. The scrutinizer Mr. Santosh Kumar Gunemoni from VCAN Associates confirmed the voting process was conducted fairly and transparently. The cut-off date for eligible shareholders was October 3, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762769957172,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilpa Medicare Reports Positive Phase 3 Results for Oeris™ Drug",
            "Summary": "Shilpa Medicare announced positive Phase 3 clinical trial results for its drug Oeris™. The treatment showed an 89% complete response rate compared to 82% for standard treatment. The company reported no serious side effects were observed during the trial. Shilpa Medicare plans to submit the drug for regulatory approval based on these results.",
            "Sentiment": "positive",
            "PublishDate": 1762759083922,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Pharma Life Sciences Receives EcoVadis Gold Medal for Sustainability Excellence",
            "Summary": "Shilpa Pharma Life Sciences Limited, a material subsidiary of Shilpa Medicare Limited, has been awarded the Gold Medal by EcoVadis for excellence in sustainability. The company achieved a score of 82/100, placing it in the 98th percentile globally among 130,000 companies evaluated by EcoVadis. EcoVadis assesses organizations on four key pillars: Environment, Labor Human Rights, Ethics, and Sustainable Procurement. Mr. Keshav Bhutada, ED CEO of Shilpa Pharma Life Sciences, stated that sustainability and innovation are integral to Shilpa's CDMO growth strategy to work with global innovator companies for their New Chemical Entity programs. The recognition positions the company among the top few global companies rated for sustainable business operations and strengthens Shilpa's credentials with global customers, investors, and partners as a trusted global CDMO partner.",
            "Sentiment": "positive",
            "PublishDate": 1762752018996,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Medicare to Sell 31% Stake in Sravathi Advance Process Technologies for ₹496 Million",
            "Summary": "Shilpa Medicare has entered into an agreement to sell its 31% shareholding in Sravathi Advance Process Technologies for ₹496 million. The transaction involves buyers Ash Ingredients Inc. and Varcatalyst LLP as part of the new agreement.",
            "Sentiment": "positive",
            "PublishDate": 1761564761347,
            "Source": "order&deals"
        },
        {
            "Title": "Shilpa Medicare Promoters Enter Inter-se Agreement for Securities Transfer Framework",
            "Summary": "Promoters of Shilpa Medicare Limited entered into an Inter-se Agreement on October 16, 2025, establishing terms for transfer and sale of securities among the promoter group. The agreement covers restrictions on securities transfer, Right of First Refusal provisions, Drag-Along Rights for the Bhutada Group, and liabilities related to personal guarantees for company loans. The promoter group collectively holds 78,496,648 shares representing 40.14% of the company. The agreement involves 21 promoters and promoter group members from the Bhutada and Innani families. Shilpa Medicare Limited is not a party to this agreement, which formalizes inter-se arrangements without altering overall promoter group shareholding or control of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1760615036864,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilpa Medicare Gets NSE Approval for Promoter Group Reclassification Worth 4.09% Shareholding",
            "Summary": "Shilpa Medicare Limited received approval from the National Stock Exchange for reclassifying two promoter group shareholders to public category. Suraj Kumar Inani, holding 39,20,695 shares (4.01%), and Priya Inani, holding 80,696 shares (0.08%), have been reclassified from promoter group to public shareholders. The total reclassification represents 40,01,391 shares or 4.09% of the company's shareholding structure. The approval was granted under Regulation 31A of SEBI (LODR) Regulations, 2015, following the company's application submitted in August 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1758888297796,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilpa Medicare Receives European Authorization for Generic Rivaroxaban Orodispersible Films",
            "Summary": "Shilpa Medicare Limited received Initial Authorization from the European Medicine Agency for Rivaroxaban 10 mg, 15 mg, and 20 mg Orodispersible Films, a generic version of Bayer AG's Xarelto. The approval covers the company's manufacturing facility in Dabaspet, Bengaluru. The anticoagulant medicine is used to treat deep vein thrombosis, pulmonary embolism, and prevent atherothrombotic events in adults. Shilpa's product is bioequivalent to Xarelto and represents the only Rivaroxaban in orodispersible film form, designed for patient comfort particularly in geriatric patients. The European market for oral Rivaroxaban formulations is valued at USD 2.5 billion. This marks the third approval of a prescription oral mouth dissolving film product in European markets from the Bengaluru facility.",
            "Sentiment": "positive",
            "PublishDate": 1758562684032,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Medicare Subsidiary Forms Joint Venture with Saudi Company PPI for Pharmaceutical Manufacturing Facility",
            "Summary": "Koanna International FZ LLC, a wholly owned subsidiary of Shilpa Medicare Limited, has entered into a definitive agreement with Pharma Pharmaceutical Industries & Biological Products (PPI) to form a joint venture company in Saudi Arabia. The partnership will establish a new pharmaceutical manufacturing facility with PPI holding a 70% majority stake and Koanna holding 30%. The venture will operate in two phases: Phase One involves Shilpa Group supplying finished products in bulk for repackaging while PPI establishes the manufacturing facility, and Phase Two includes full technology transfer from Shilpa Group to enable local production. Shilpa Group will handle regulatory registration with the Saudi Food and Drug Authority and obtain necessary market authorization. The joint venture aims to strengthen Shilpa's global footprint and consolidate its presence in the MENA region, while aligning with Saudi Arabia's Vision 2030 goals for economic diversification and localizing strategic industries.",
            "Sentiment": "positive",
            "PublishDate": 1756351056524,
            "Source": "order&deals"
        },
        {
            "Title": "Shilpa Medicare Reports 9% Revenue Growth to INR 328 Crores in Q1 FY26",
            "Summary": "Shilpa Medicare Limited reported revenue of INR 328 crores with 9% year-over-year growth in Q1 FY26. EBITDA grew 18% to INR 98 crores with a 30% margin, while gross margin improved 700 basis points to 76%. The API segment generated INR 187 crores (8% growth), formulations contributed INR 98 crores, and biologics added INR 73 crores. The company received approval for Nor-Ursodeoxycholic acid, its first NCE, and has 3 NDA products approved in the US market. The biologics division entered agreements for two NBE programs and expects Nivolumab biosimilar to enter human studies by end of FY26. Net debt stands at INR 550 crores as of June 30, 2025, with capex of INR 70 crores in the quarter. The company plans to launch NorUDCA in India by October 2025 and expects commercialization of 2 CDMO NCE projects in FY27.",
            "Sentiment": "positive",
            "PublishDate": 1755509692167,
            "Source": "earnings"
        },
        {
            "Title": "Shilpa Medicare's Norduca Becomes First Globally Approved NAFLD Therapy",
            "Summary": "Shilpa Medicare announced that its drug Norduca has received approval as the first therapy globally for NAFLD (Non-Alcoholic Fatty Liver Disease). This represents a significant milestone for the pharmaceutical company in addressing a major liver condition.",
            "Sentiment": "positive",
            "PublishDate": 1755151729872,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Medicare Positioned for Growth Through Oncology API Leadership and Biologics Expansion",
            "Summary": "Shilpa Medicare is positioned for strong growth through its oncology API leadership, new formulation launches, and biologics expansion. The company's growth strategy includes capacity investments and global partnerships aimed at boosting export revenues and margins.",
            "Sentiment": "positive",
            "PublishDate": 1755101324688,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Medicare Seeks Reclassification of Two Promoter Group Members to Public Category",
            "Summary": "Shilpa Medicare Limited has applied to BSE and NSE for reclassification of two promoter group members - Suraj Kumar Inani and Priya Inani - from 'Promoter Group' category to 'Public' category. Suraj Kumar Inani holds 39,20,695 shares representing 4.01% of paid-up capital, while Priya Inani holds 80,696 shares representing 0.08% of paid-up capital. The total shareholding involved in the reclassification is 40,01,391 shares, accounting for 4.09% of the company's paid-up capital. The application was submitted on 13th August 2025 under Regulation 31A(8)(c) of SEBI LODR Regulations, 2015.",
            "Sentiment": "neutral",
            "PublishDate": 1755100868402,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilpa Medicare Sets Record Dates for Final Dividend and 1:1 Bonus Share Issue",
            "Summary": "Shilpa Medicare Limited has announced two key record dates for shareholders. The company set September 17, 2025 as the record date for determining shareholder eligibility for the final dividend for financial year 2024-25, subject to approval at the Annual General Meeting scheduled for September 23, 2025. Additionally, the Board of Directors approved a 1:1 bonus share issue with the record date fixed as September 26, 2025. Under this bonus issue, shareholders will receive one new equity share for every existing equity share held. The dividend will be paid within the statutory time limit if approved by shareholders at the AGM.",
            "Sentiment": "positive",
            "PublishDate": 1755086005217,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilpa Medicare Approves 1:1 Bonus Issue and Board Changes in August Meeting",
            "Summary": "Shilpa Medicare's Board approved unaudited financial results for the quarter ended June 30, 2025, and announced a 1:1 bonus share issue by capitalizing Rs. 9.78 crores from securities premium account. The bonus issue will increase paid-up capital from Rs. 9.78 crores to Rs. 19.56 crores, with record date set for September 26, 2025. The Board reappointed Om Prakash Inani as Chairman and Sharath Reddy Kalakota as Whole Time Director for 5 years. Ashraf Loutfy Abdelhamid Allam was appointed as Additional Independent Director for 2 years, replacing Dr. Kamal Kishore Sharma. Dr. Anita Bandyopadhyay was reappointed as Women Independent Director for 3 years. The company scheduled its 38th AGM for September 23, 2025, via video conferencing. The Board also recommended reclassification of promoters Mr. Suraj Kumar Inani and Ms. Priya Inani from promoter group to public category, subject to stock exchange and shareholder approvals.",
            "Sentiment": "positive",
            "PublishDate": 1755080377970,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilpa Medicare Reports Strong Q1 Growth with Revenue Up to 3.2B Rupees, Approves 1:1 Bonus",
            "Summary": "Shilpa Medicare reported Q1 revenue of 3.2 billion rupees compared to 2.9 billion rupees in the same period last year. The company's EBITDA increased to 916 million rupees from 736 million rupees year-over-year, with EBITDA margin improving to 28.51% from 25.16%. Consolidated net profit surged to 470 million rupees versus 141 million rupees in the previous year. The company has approved a bonus issue in the ratio of 1:1.",
            "Sentiment": "positive",
            "PublishDate": 1755079511590,
            "Source": "earnings"
        },
        {
            "Title": "Shilpa Pharma Lifesciences Fully Redeems Outstanding Non-Convertible Debentures",
            "Summary": "Shilpa Pharma Lifesciences Limited, a wholly-owned material subsidiary of Shilpa Medicare Limited, has fully redeemed its outstanding senior, secured, rated, unlisted, and redeemable Non-Convertible Debentures on 11 August 2025. Following this redemption, the subsidiary has no outstanding NCDs remaining. The company had previously provided intimation about this matter on 12 August 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1755002318637,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilpa Medicare Gets CDSCO Approval for First-in-Class NAFLD Treatment Drug",
            "Summary": "Shilpa Medicare received approval from the Central Drugs Standard Control Organisation for Nor Ursodeoxycholic Acid Tablets 500 mg, used to treat Non-Alcoholic Fatty Liver Disease. The approval makes Shilpa Medicare the first company globally to launch this drug for NAFLD treatment. NAFLD affects 25% of the world's population, including 188 million individuals in India. The NorUDCA tablets represent a first-in-class treatment for NAFLD in India and address unmet medical needs in Hepatology. The drug has choleretic and anti-inflammatory properties that enhance bile flow and reduce hepatic inflammation. Shilpa Medicare shares closed 0.3% higher at ₹825, though the stock has declined 8% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1754873841864,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Medicare Receives World's First Approval for NAFLD Treatment Drug",
            "Summary": "Shilpa Medicare Limited received approval from the Central Drugs Standard Control Organization (CDSCO) for Nor Ursodeoxycholic Acid Tablets 500 mg, making it the first company globally to launch this product for Non-Alcoholic Fatty Liver Disease (NAFLD) treatment. The drug is described as a first-in-class treatment for NAFLD in India, addressing a condition that affects approximately 25% of the world's population and an estimated 188 million individuals in India. NorUDCA demonstrated superior efficacy over placebo with no significant safety concerns identified. The company's Managing Director, Vishnukant Bhutada, stated they will introduce the tablets in India immediately while advancing global regulatory efforts. Shilpa Medicare is an integrated pharmaceutical group with expertise in oncology and non-oncology APIs, peptides, polymers, and differentiated finished dosage formulations.",
            "Sentiment": "positive",
            "PublishDate": 1754717659584,
            "Source": "stock"
        },
        {
            "Title": "Shilpa Medicare to Discuss Bonus Issue on August 13",
            "Summary": "Shilpa Medicare has scheduled a meeting on August 13 to discuss a bonus issue. The pharmaceutical company will deliberate on this corporate action during the upcoming meeting.",
            "Sentiment": "positive",
            "PublishDate": 1754645655325,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilpa Medicare Invests $2 Million in US Biotech Alveolus Bio for Lung Disease Therapies",
            "Summary": "Shilpa Medicare Limited's wholly owned subsidiary, Shilpa Pharma Inc, has agreed to invest US$ 2 million in SAFE Notes in Alveolus Bio, a US-based biotech startup developing inhaled therapies for lung diseases. The investment will convert to shares at a later stage, with shareholding percentage dependent on future valuation conditions. Under the strategic partnership, Shilpa Biologics Private Limited will serve as the exclusive global development and manufacturing partner for Alveolus Bio. Alveolus Bio, incorporated in 2021, focuses on inhaled live biotherapeutics and small molecule therapies for conditions including COPD, Bronchopulmonary Dysplasia, and Pulmonary Fibrosis through its proprietary resMIT platform. The company reported income of US$ 1,189,942 in 2024, up from US$ 432,989 in 2023 and US$ 84,775 in 2022. The investment will fund Alveolus Bio's lead COPD program through Phase 2 clinical trials and accelerate additional preclinical programs. The investment is expected to be completed within one month of signing definitive agreements.",
            "Sentiment": "positive",
            "PublishDate": 1753364379288,
            "Source": "order&deals"
        },
        {
            "Title": "Shilpa Medicare: FDA Inspection Clearance Boosts Stock",
            "Summary": "Shilpa Medicare's Bengaluru unit received an Establishment Inspection Report with Voluntary Action Indicated classification from the US FDA. The facility, which focuses on oral dissolving films and transdermal systems, has been approved by multiple international regulatory bodies. The stock gained over 4% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1752646296000,
            "Source": "normal_news"
        },
        {
            "Title": "Shilpa Medicare Receives EIR from USFDA for Bengaluru Unit VI",
            "Summary": "Shilpa Medicare has received an Establishment Inspection Report (EIR) from the United States Food and Drug Administration (USFDA) for its Unit VI located in Bengaluru. This indicates that the FDA has completed its inspection of the facility.",
            "Sentiment": "positive",
            "PublishDate": 1752640664000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Medicare's Bengaluru Facility Receives SFDA Saudi Arabia GMP Certification",
            "Summary": "Shilpa Medicare has announced that its Bengaluru facility has successfully obtained GMP (Good Manufacturing Practice) certification from SFDA (Saudi Food and Drug Authority) Saudi Arabia. The certification was granted with zero observations, indicating a high level of compliance with quality standards.",
            "Sentiment": "positive",
            "PublishDate": 1752130996000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Medicare's Pharma Unit Passes ANVISA Inspection",
            "Summary": "Shilpa Medicare's Shilpa Pharma Lifesciences Unit-1 has successfully completed a GMP inspection by ANVISA (Brazilian Health Regulatory Agency). The audit concluded with no critical or major observations, indicating a positive outcome for the company's manufacturing practices.",
            "Sentiment": "positive",
            "PublishDate": 1751846950000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Pharma Lifesciences: Clears Brazilian GMP Inspection with Minor Observations",
            "Summary": "Shilpa Pharma Lifesciences Limited, Unit-1, a wholly-owned subsidiary of Shilpa Medicare Limited, successfully completed a Good Manufacturing Practice (GMP) inspection by Brazil's ANVISA from June 30 to July 4, 2025. The audit concluded with no critical or major observations, only a few procedural points. The company will submit a Corrective and Preventive Action (CAPA) plan within the given timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1751638144000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shilpa Medicare's Pharma Unit Passes ANVISA Inspection",
            "Summary": "Shilpa Medicare's Shilpa Pharma Lifesciences Unit-1 has successfully passed a Good Manufacturing Practice (GMP) inspection conducted by ANVISA (Brazilian Health Regulatory Agency) with no major issues identified.",
            "Sentiment": "positive",
            "PublishDate": 1751630301000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Medicare's Amalgamation Plan with InM Technologies Approved by NCLT",
            "Summary": "Shilpa Medicare has received approval from the National Company Law Tribunal (NCLT) Bengaluru for its plan to amalgamate with its subsidiary, InM Technologies.",
            "Sentiment": "positive",
            "PublishDate": 1751106662000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Medicare Provides Updates on Drug Development Pipeline",
            "Summary": "Shilpa Medicare announced updates on its drug development pipeline during a conference call. The company expects its NCE molecule NORUDCA to receive product approval in the first half of FY26, with a planned launch in the same period. Additionally, the company reported that product development for Nivolumab and Pembrolizumab is complete at the R&D scale. Pre-clinical studies for these drugs are ongoing, with human studies expected to commence in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1748316121000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Medicare Provides Updates on Product Launches and Business Outlook",
            "Summary": "Shilpa Medicare shared several updates during a concall: Axitinib's Europe launch is expected in Q1 FY26 with supply orders in place. Methotrexate's CEP review is ongoing with approval expected in FY26. A Phase II molecule received clearance for clinical studies, with trials expected to start in Q1 FY26. The company anticipates increased CDMO revenue and margin improvement following US facility approval. Lower interest costs are expected to lead to savings. Revenue from a $4 million polymer order is expected in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1748316093000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Medicare Announces Dividend of ₹1 Per Share",
            "Summary": "The board of Shilpa Medicare has decided to pay a dividend of ₹1 per equity share to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1748260590000,
            "Source": "result"
        },
        {
            "Title": "Shilpa Medicare Reports Q4 Financial Results",
            "Summary": "Shilpa Medicare has released its Q4 financial results. The company's EBITDA for Q4 was 768 million rupees, compared to 700 million rupees in the same quarter last year. The EBITDA margin decreased slightly to 23.21% from 23.97% year-over-year. Consolidated net profit for Q4 was 145 million rupees, down from 245 million rupees year-over-year, but up from 318 million rupees quarter-over-quarter. Q4 revenue increased to 3.3 billion rupees from 2.92 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748260440000,
            "Source": "result"
        },
        {
            "Title": "Shilpa Medicare Unit Partners with Orion Corporation for European Distribution",
            "Summary": "A unit of Shilpa Medicare has entered into a strategic partnership with Orion Corporation. This partnership grants exclusive rights to distribute, market, and sell Shilpa Medicare's recombinant human albumin in Europe.",
            "Sentiment": "positive",
            "PublishDate": 1747992658000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Medicare's Unit Receives EIR from USFDA",
            "Summary": "Shilpa Medicare's subsidiary, Shilpa Pharma Lifesciences Ltd, Unit-1, has received an Establishment Inspection Report (EIR) from the US Food and Drug Administration (USFDA). The inspection was conducted between March 3-7, 2025, and the site has been classified as Voluntary Action Indicated (VAI).",
            "Sentiment": "positive",
            "PublishDate": 1747267551000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Medicare's Unit Receives EIR from USFDA",
            "Summary": "Shilpa Medicare's subsidiary, Shilpa Pharma Lifesciences Ltd, Unit-1, has received an Establishment Inspection Report (EIR) from the US Food and Drug Administration (USFDA). The inspection was conducted between March 3-7, 2025, and the site has been classified as Voluntary Action Indicated (VAI).",
            "Sentiment": "positive",
            "PublishDate": 1747235662000,
            "Source": "default"
        },
        {
            "Title": "Shilpa Medicare: EU Regulator Grants GMP Certification to Bengaluru Facility",
            "Summary": "Shilpa Medicare's Unit VI in Bengaluru received GMP certification from the European Medicines Agency for manufacturing Oral Mouth Dissolving Films and Transdermal Systems. This approval enables the company to market these products in the European Union.",
            "Sentiment": "positive",
            "PublishDate": 1746517355000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shilpa Medicare Receives GMP Approval for Bengaluru Unit",
            "Summary": "Shilpa Medicare has obtained Good Manufacturing Practice (GMP) approval from the European Medicines Agency for its Unit VI located in Bengaluru. This approval is significant as it allows the company to manufacture pharmaceutical products for the European market, potentially expanding its international presence and revenue streams.",
            "Sentiment": "positive",
            "PublishDate": 1746512781000,
            "Source": "default"
        }
    ]
}