{
    "Symbol": "SHIVATEX",
    "ISIN": "INE705C01020",
    "News": [
        {
            "Title": "Shiva Texyarn Q3 FY26 Results Show Mixed Performance",
            "Summary": "Shiva Texyarn reported Q3 FY26 revenue of ₹7,641.73 lakhs with net profit of ₹164.93 lakhs. Nine-month revenue reached ₹25,857.82 lakhs with profit of ₹940.21 lakhs, showing strong year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1770282188112,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shiva Texyarn Reports 247% Jump in Quarterly Profit to Rs 548 Lakhs",
            "Summary": "Shiva Texyarn Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported a standalone net profit of Rs 548.05 lakhs compared to Rs 157.97 lakhs in the previous quarter, marking a significant increase. Revenue from operations stood at Rs 10,505.30 lakhs for the quarter. For the half-year period, the company achieved a net profit of Rs 775.43 lakhs on revenue of Rs 18,188.44 lakhs. The Board of Directors approved these results at their meeting held on November 5, 2025. The company is primarily engaged in manufacturing textile and related products. The results were reviewed by statutory auditors M/s. VKS Aiyer & Co., who provided an unmodified opinion.",
            "Sentiment": "positive",
            "PublishDate": 1762330408301,
            "Source": "earnings"
        },
        {
            "Title": "Shiva Texyarn Reports 75% Jump in Quarterly Profit to ₹2.21 Crore",
            "Summary": "Shiva Texyarn Limited reported a standalone net profit of ₹2.21 crore for the quarter ended June 30, 2025, marking a 75% increase from ₹1.27 crore in the same period last year. Revenue from operations rose 26% to ₹76.18 crore compared to ₹60.68 crore in the previous year quarter. However, quarterly revenue declined from ₹91.58 crore in the preceding quarter. The textile manufacturer's consolidated profit reached ₹2.46 crore, up from ₹1.36 crore year-over-year. Employee benefit expenses increased to ₹17.27 crore from ₹13.89 crore, while other expenses rose to ₹22.72 crore from ₹16.06 crore. The company's earnings per share improved to ₹1.75 from ₹0.98 in the corresponding quarter last year. The results were reviewed by statutory auditors VKS Aiyer & Co., who provided an unmodified opinion.",
            "Sentiment": "positive",
            "PublishDate": 1754554642840,
            "Source": "earnings"
        },
        {
            "Title": "Shiva Texyarn Limited Announces Rs. 0.60 Per Share Dividend with August 14 Record Date",
            "Summary": "Shiva Texyarn Limited has declared a dividend of Rs. 0.60 per equity share, representing 6% on the face value of Rs. 10 each. The company has set August 14, 2025 as the record date for dividend eligibility. Shareholders on record as of this date will be entitled to receive the dividend payment, which will be disbursed on or before September 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753791311541,
            "Source": "corporate_action"
        },
        {
            "Title": "Shiva Texyarn Secures 9 Crore Rupee Order from Indian Air Force",
            "Summary": "Shiva Texyarn has received an order worth 9 crore rupees from the Indian Air Force. This significant contract demonstrates the company's ability to secure high-value deals with prestigious clients in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1737193579000,
            "Source": "order&deals"
        },
        {
            "Title": "Shiva Texyarn Secures 36 Crore Rupee Order",
            "Summary": "Shiva Texyarn, a company with a market capitalization of 290 crore rupees, has won an order worth 36 crore rupees. This order represents a significant business opportunity for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1735886042000,
            "Source": "order&deals"
        },
        {
            "Title": "Shiva Texyarn Reports Significant Q2 EBITDA Growth",
            "Summary": "Shiva Texyarn has announced its Q2 financial results, showing substantial year-over-year improvements. The company's EBITDA increased to 98.6 million rupees, up from 55.8 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 10.36% from 5.65% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731312271000,
            "Source": "result"
        },
        {
            "Title": "Shiva Texyarn Reports Profit in Q2 FY2024",
            "Summary": "Shiva Texyarn has reported a consolidated net profit of 27 million rupees in the second quarter, compared to a loss of 26 million rupees in the same period last year. This represents a significant turnaround in the company's financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1731312204000,
            "Source": "result"
        },
        {
            "Title": "Shiva Texyarn Secures ₹41 Crore Order",
            "Summary": "Shiva Texyarn has won an order worth 41 crore rupees. This represents a significant business development for the company, potentially boosting its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1729751416000,
            "Source": "corporate_action"
        }
    ]
}