{
    "Symbol": "SHIVAMAUTO",
    "ISIN": "INE637H01024",
    "News": [
        {
            "Title": "Shivam Autotech Q3 FY26 Loss Widens to ₹24.53 Crores",
            "Summary": "Shivam Autotech reported widened losses in Q3 FY26 with net loss of ₹24.53 crores compared to ₹11.86 crores in Q3 FY25, while revenue declined 14.78% to ₹96.41 crores.",
            "Sentiment": "negative",
            "PublishDate": 1770277368908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shivam Autotech Gets In-Principle Approval for OCDs",
            "Summary": "Shivam Autotech Limited received in-principle approval from NSE and BSE for preferential issue of 12,000 optionally convertible debentures worth ₹1,00,000 each, convertible into 4,16,52,204 equity shares.",
            "Sentiment": "positive",
            "PublishDate": 1770029277688,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shivam Autotech Promoters Won't Subscribe to OCD Issue",
            "Summary": "Shivam Autotech Limited discloses that none of its promoters, directors, or key management personnel intend to subscribe to the preferential issue of optionally convertible debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1767284695527,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shivam Autotech Raises ₹32 Crore Through Private Placement of Non-Convertible Debentures",
            "Summary": "Shivam Autotech Limited has allotted 3,200 secured, unlisted, unrated redeemable Non-Convertible Debentures with a face value of ₹1,00,000 each, raising ₹32 crore through private placement to Alpha Alternatives (Indian Rupees Structured Credit Opportunities Fund). The NCDs carry an interest rate of 11.49% and have a tenure of up to 36 months with an 18-month moratorium period.",
            "Sentiment": "positive",
            "PublishDate": 1765198989607,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech Allots ₹45 Crore Non-Convertible Debentures Through Private Placement",
            "Summary": "Shivam Autotech Limited has allotted 4,500 secured, unlisted, unrated redeemable Non-Convertible Debentures with face value of ₹1,00,000 each, totaling ₹45 crore on private placement basis. The NCDs were issued to Alpha Alternatives Structured Credit Opportunities Fund with tenure up to 36 months including 18-month moratorium and interest rate of 14% per annum.",
            "Sentiment": "neutral",
            "PublishDate": 1764951342860,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech Raises ₹200 Crore Through Private Placement of Non-Convertible Debentures",
            "Summary": "Shivam Autotech Limited has allotted 20,000 secured, unlisted, unrated redeemable Non-Convertible Debentures with a face value of ₹1,00,000 each, raising ₹200 crore through private placement to Alpha Alternatives Structured Credit Opportunities Fund. The NCDs carry a tenure of up to 48 months with 12-month moratorium and an interest rate of 19% per annum, providing the company with debt financing for its operations.",
            "Sentiment": "neutral",
            "PublishDate": 1764926662461,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech Seeks Shareholder Approval for Rs 120 Crore Convertible Debenture Issue",
            "Summary": "Shivam Autotech Limited has issued a postal ballot notice seeking shareholder approval for issuing 12,000 optionally convertible debentures worth Rs 120 crore to Alpha Alternative Structured Credit Opportunities Fund on preferential basis. The company also seeks approval for granting special rights to the investor including board nomination rights and amendments to articles of association, with voting scheduled from December 2-31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764573881522,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech Board Approves ₹120 Crore OCD Fundraising from Alpha Alternative Fund",
            "Summary": "Shivam Autotech's board approved raising up to ₹120 crores through issuance of 12,000 optionally convertible debentures to Alpha Alternative Structured Credit Opportunities Fund at ₹1 lakh per OCD with 10% coupon rate. The OCDs carry 18-month tenure with conversion option into equity shares and grant special rights including nominee director appointment, subject to shareholder and regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1764427777721,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech Board Approves Rs 2,105 Crore NCD Fundraising Plan",
            "Summary": "Shivam Autotech Limited's Board of Directors approved a proposal to raise funds up to Rs 2,105 crore through secured, redeemable Non-Convertible Debentures via private placement in one or more tranches. The fundraising is subject to necessary approvals, consents, sanctions, permissions, compliance with applicable laws and shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1764142213106,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech Reports Quarterly Loss, Approves Rs 2,245 Crore NCD Fundraising Plan",
            "Summary": "Shivam Autotech Limited reported a net loss of Rs 9.10 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 11.98 lakhs in the previous quarter. Revenue from operations stood at Rs 11,553.60 lakhs. The Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. Additionally, the company's Board approved a proposal to raise funds up to Rs 2,245 crores through issuance of secured, redeemable, Non-Convertible Debentures via private placement in one or more tranches, subject to necessary approvals and shareholder consent. The company operates in the automobile parts segment. Auditors highlighted emphasis of matter regarding deferred tax assets of Rs 1,989.25 lakhs and MAT credit entitlements of Rs 619.86 lakhs, with deferred tax assets recognized only till March 31, 2021 as a matter of prudence.",
            "Sentiment": "negative",
            "PublishDate": 1762969451218,
            "Source": "earnings"
        },
        {
            "Title": "Shivam Autotech to Consider Fund Raising Through NCDs at Board Meeting",
            "Summary": "Shivam Autotech Limited has updated its board meeting agenda scheduled for November 12, 2025. In addition to reviewing unaudited financial results for the quarter and half year ended September 30, 2025, the board will consider a proposal for raising funds through borrowings. The fund raising options include issuing secured, unlisted, redeemable Non-Convertible Debentures (NCDs) on a private placement or preferential allotment basis, or through other modes as determined by the board based on market conditions, applicable laws, and company funding requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1762684535833,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech Receives GST Show Cause Notice for Late Filing Penalties",
            "Summary": "Shivam Autotech Limited received a show cause notice from the Central Goods & Services Tax office in Haridwar for not filing GSTR-9/9C returns for periods 2020-21 and 2021-22. The notice involves late fees of Rs. 6,07,600 and penalty of Rs. 2,00,000. The company stated that the liability has already been discharged and there is no material impact on its financial, operational or other activities.",
            "Sentiment": "neutral",
            "PublishDate": 1761795404274,
            "Source": "stock"
        },
        {
            "Title": "Shivam Autotech Board Approves ₹225 Crore NCD Fundraising Through Private Placement",
            "Summary": "Shivam Autotech Limited's Board of Directors approved a proposal to raise funds up to ₹225 crore through the issuance of secured, redeemable, Non-Convertible Debentures (NCDs) via private placement. The board meeting was held and concluded the same day. The fundraising is subject to necessary approvals, consents, sanctions, permissions, and compliance with applicable laws and regulations, including shareholders' approval. The NCDs will not be listed on any stock exchange. Key terms including tenure, interest rates, payment schedules, and redemption details will be determined according to the Debenture Trust Deed to be executed between the company and the Debenture Trustee.",
            "Sentiment": "positive",
            "PublishDate": 1761042635420,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech Board Approves Q1 2025 Results, Sets AGM Date and Director Re-appointments",
            "Summary": "Shivam Autotech Limited's Board of Directors approved the company's unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 14, 2025. The company reported a net loss of Rs. 1,765.61 lakhs for Q1 2025, compared to a loss of Rs. 1,033.28 lakhs in the previous quarter and Rs. 1,475.69 lakhs in Q1 2024. Revenue from operations stood at Rs. 9,114.49 lakhs. The Board scheduled the 20th Annual General Meeting for September 22, 2025, to be conducted through video conferencing. Subject to shareholder approval, the Board recommended the re-appointment of Ms. Charu Munjal as Executive Director, Mr. Neeraj Munjal as Managing Director for an additional five-year term, and the continuation of Mr. Anil Kumar Gupta as Non-Executive Independent Director beyond age 75. The Board also approved the appointment of M/s. Yogesh K & Associates as Secretarial Auditors for five consecutive financial years.",
            "Sentiment": "negative",
            "PublishDate": 1755167358707,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech Approves ₹25 Crore Non-Convertible Debentures Issuance",
            "Summary": "Shivam Autotech Limited's Board of Directors approved the issuance of Secured, Unlisted, Redeemable, Non-Convertible Debentures worth up to ₹25 crores through private placement. The NCDs will comprise up to 250 debentures with a face value of ₹10 lakh each, offering 12% annual interest. The debentures will be secured by a first-ranking exclusive charge over specified receivables through a Supplemental Deed to the Debenture Trust Deed and a Deed of Hypothecation. The tenure, allotment date, and maturity date will be determined by the Board. The rights and privileges will be governed by the debenture trust deed between the company and debenture trustee.",
            "Sentiment": "neutral",
            "PublishDate": 1754629504543,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivam Autotech's Credit Rating Outlook Revised to Negative Amid Continued Losses",
            "Summary": "CARE Ratings reaffirmed Shivam Autotech Limited's credit ratings while revising the long-term outlook from Stable to Negative. The company reported total operating income of ₹453.98 crore with a PBILDT margin of 9.78%, but continued to post net losses of ₹48.04 crore. The company's overall gearing deteriorated to 10.94x from 7.29x, with total outstanding debt of ₹344.55 crore. Key concerns include underutilization of manufacturing capacities, stretched liquidity position, and revenue concentration risk with Hero MotoCorp contributing around 40% of revenue. The company received a GST show cause notice for ₹50.10 crore in tax liability for FY2018-2021. Despite these challenges, the company benefits from experienced promoters, strong operational linkages with Hero MotoCorp, and locational advantages of its manufacturing facilities.",
            "Sentiment": "negative",
            "PublishDate": 1753181322425,
            "Source": "stock"
        },
        {
            "Title": "Shivam Autotech Reports Reduced Q3 Net Loss",
            "Summary": "Shivam Autotech has reported financial results for the third quarter. The company's net loss narrowed to 119 million rupees, compared to a loss of 146 million rupees in the same period last year. However, revenue decreased to 1.13 billion rupees from 1.2 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738932340000,
            "Source": "earnings"
        }
    ]
}