{
    "Symbol": "SHIVALIK",
    "ISIN": "INE788J01021",
    "News": [
        {
            "Title": "Shivalik Rasayan Director's Relative Receives 1.12L Shares",
            "Summary": "Shivalik Rasayan disclosed that Mrs. Kanchan Sharma, immediate relative of Director Mr. Ashwani Kumar Sharma, received 1,12,000 equity shares as gift under SEBI insider trading regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766399393497,
            "Source": "stocks"
        },
        {
            "Title": "Shivalik Rasayan Limited Publishes Un-Audited Quarterly Financial Results",
            "Summary": "Shivalik Rasayan Limited's Board of Directors approved and published the company's un-audited standalone and consolidated financial results for the quarter ended September 30, 2025, at their meeting held on November 14, 2025. The results along with Limited Review Report have been posted on the company's website and published in Financial Express and Vir Arjun newspapers on November 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763197800244,
            "Source": "earnings"
        },
        {
            "Title": "Shivalik Rasayan Reports Q1 FY2026 Results, Plans Pesticide Formulation Subsidiary",
            "Summary": "Shivalik Rasayan Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone net sales of Rs 4,626.45 lakhs compared to Rs 3,158.11 lakhs in the same quarter last year, with net profit of Rs 122.08 lakhs versus Rs 306.92 lakhs previously. Consolidated revenue reached Rs 8,930.93 lakhs with net profit of Rs 282.13 lakhs. The board approved the incorporation of a wholly-owned subsidiary for manufacturing and marketing pesticide formulations as a forward integration strategy. Other approvals included the annual report for FY2025, cost audit report, and re-designation of Ashwani Kumar Sharma as Non-Executive, Non-Independent Director. The company declared a proposed final dividend of 10% or Rs 0.50 per equity share for FY2025, subject to shareholder approval at the 47th AGM scheduled for September 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755005356282,
            "Source": "earnings"
        },
        {
            "Title": "Shivalik Rasayan Reports Q4 Financial Results",
            "Summary": "Shivalik Rasayan has released its Q4 financial results. The company's EBITDA for Q4 was 58 million rupees, down from 93 million rupees in the same quarter last year. The EBITDA margin decreased to 8.30% from 13.04% year-over-year. Consolidated net profit for Q4 was 41 million rupees, up from 34 million rupees year-over-year, but down from 53 million rupees quarter-over-quarter. Q4 revenue was reported at 694 million rupees, compared to 712 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748619591000,
            "Source": "result"
        },
        {
            "Title": "Shivalik Rasayan Reports Improved Q3 EBITDA and Margin",
            "Summary": "Shivalik Rasayan has reported a significant increase in its Q3 EBITDA, rising to 133 million rupees from 89 million rupees in the same quarter last year. The company's EBITDA margin also improved, reaching 15.61% compared to 12.62% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739277522000,
            "Source": "earnings"
        },
        {
            "Title": "Shivalik Rasayan Reports Strong Q3 Financial Results",
            "Summary": "Shivalik Rasayan has announced its Q3 consolidated financial results. The company's net profit increased to 53 million rupees, up from 31 million rupees year-over-year and 40 million rupees quarter-over-quarter. Revenue for Q3 rose to 853 million rupees, compared to 702 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1739277476000,
            "Source": "earnings"
        },
        {
            "Title": "Shivalik Rasayan to Consider Q3 Results on February 11",
            "Summary": "Shivalik Rasayan has announced that it will consider its third quarter (Q3) financial results on February 11. This announcement indicates the company's scheduled date for reviewing and potentially approving its quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1738672434000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shivalik Rasayan Reports Q2 EBITDA Growth",
            "Summary": "Shivalik Rasayan announced its Q2 financial results. The company's EBITDA increased to 118 million rupees from 96 million rupees year-over-year. However, the EBITDA margin slightly decreased to 14.28% from 14.39% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731595679000,
            "Source": "result"
        },
        {
            "Title": "Shivalik Rasayan Reports Strong Q2 Financial Results",
            "Summary": "Shivalik Rasayan has announced its Q2 financial results, showing significant year-over-year and quarter-over-quarter growth. The company's consolidated net profit increased to 40 million rupees, up from 19 million rupees in the same quarter last year and 35 million rupees in the previous quarter. Revenue also saw a substantial rise to 824 million rupees, compared to 670 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731595607000,
            "Source": "result"
        },
        {
            "Title": "Shivalik Rasayan Receives FDA Inspection Report for Dahej Facility",
            "Summary": "<p>The <span class='neutral'>US Food and Drug Administration (FDA)</span> has released an <span class='neutral'>Establishment Inspection Report (EIR)</span> for <b>Shivalik Rasayan's Dahej facility</b>. This indicates that the FDA has <span class='positive'>concluded</span> its <span class='neutral'>inspection</span> of the facility and <span class='neutral'>provided its findings</span> to the company.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727960315000,
            "Source": "corporate_action"
        }
    ]
}