{
    "Symbol": "SHIVAMILLS",
    "ISIN": "INE644Y01017",
    "News": [
        {
            "Title": "Shiva Mills Q3FY26 Loss Widens to ₹70.97 Lakhs",
            "Summary": "Shiva Mills reported a net loss of ₹70.97 lakhs for Q3FY26 compared to ₹146.97 lakhs loss in Q3FY25. Revenue declined to ₹3,425.81 lakhs from ₹3,597.73 lakhs year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770294443812,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shiva Mills Reports Net Loss of Rs 78.60 Lakhs for Six Months Ended September 2025",
            "Summary": "Shiva Mills Limited announced its unaudited financial results for the quarter and six months ended September 30, 2025. The company reported a net loss of Rs 78.60 lakhs for the six-month period, compared to a net loss of Rs 157.32 lakhs in the previous year. Revenue from operations for the six months was Rs 6,800.46 lakhs, down from Rs 9,228.92 lakhs in the corresponding period last year. For the quarter ended September 2025, the company posted a net loss of Rs 16.15 lakhs versus Rs 71.88 lakhs loss in the same quarter last year. The company operates solely in the textile business segment. The results were reviewed by the Audit Committee and approved by the Board of Directors at their meeting held on November 5, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762342384875,
            "Source": "earnings"
        },
        {
            "Title": "Shiva Mills Reports Net Loss of Rs 62.45 Lakhs in Q1 Results",
            "Summary": "Shiva Mills Limited reported a net loss of Rs 62.45 lakhs for the quarter ended June 30, 2025, compared to a net loss of Rs 85.44 lakhs in the same period last year. Revenue from operations declined to Rs 3,756.01 lakhs from Rs 4,421.50 lakhs year-over-year. Total income decreased to Rs 3,766.45 lakhs from Rs 4,436.89 lakhs. The company's earnings per share stood at negative Rs 0.72. The textile business operator's total expenditure was Rs 3,832.76 lakhs, resulting in a loss before tax of Rs 66.31 lakhs. The Board of Directors approved these unaudited results on August 7, 2025, following review by the Audit Committee and statutory auditors VKS Aiyer & Co.",
            "Sentiment": "negative",
            "PublishDate": 1754566686134,
            "Source": "earnings"
        }
    ]
}