{
    "Symbol": "SHK",
    "ISIN": "INE500L01026",
    "News": [
        {
            "Title": "SH Kelkar Reports Strong Q3 FY26 Performance",
            "Summary": "SH Kelkar & Company posted consolidated revenue of ₹583.80 crores in Q3 FY26, up from ₹543.21 crores in Q3 FY25. The company declared an interim dividend of Re. 1 per share and approved AED 5 million investment in Keva Middle East FZE.",
            "Sentiment": "positive",
            "PublishDate": 1770389320604,
            "Source": "co_actions_results"
        },
        {
            "Title": "Keva Constructions Pledges Additional SH Kelkar Shares",
            "Summary": "Keva Constructions Private Limited pledged additional 10,00,000 shares of SH Kelkar and Company Limited on January 29, 2026, increasing total pledged shares to 53,00,000 (3.83% stake).",
            "Sentiment": "neutral",
            "PublishDate": 1769836781958,
            "Source": "co_actions_results"
        },
        {
            "Title": "SH Kelkar Board Meet on Feb 6 for Q3 Results",
            "Summary": "SH Kelkar & Company has scheduled its board meeting for February 06, 2026, to consider Q3FY26 unaudited financial results and interim dividend declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769498064017,
            "Source": "co_actions_results"
        },
        {
            "Title": "S H Kelkar Appoints Avik Ghosh as Executive VP-HR",
            "Summary": "S H Kelkar and Company Limited announces the appointment of Mr. Avik Ghosh as Executive Vice President – HR, Asia and Senior Management Personnel with immediate effect from January 19, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768818166726,
            "Source": "stocks"
        },
        {
            "Title": "S H Kelkar Appoints Avik Ghosh as Executive VP-HR",
            "Summary": "S H Kelkar and Company Limited announces the appointment of Mr. Avik Ghosh as Executive Vice President – HR, Asia and Senior Management Personnel with immediate effect from January 19, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768817778174,
            "Source": "stocks"
        },
        {
            "Title": "S H Kelkar Q3 FY26 Revenue Grows 11% to ₹1,717 Cr",
            "Summary": "S H Kelkar And Company Ltd reports consolidated revenue of ₹1,717 crore for Q3 FY 2025-26, marking 11% growth from previous year. Gross margins remain steady while net debt stands at ₹698 crore.",
            "Sentiment": "positive",
            "PublishDate": 1767951421375,
            "Source": "co_actions_results"
        },
        {
            "Title": "SH Kelkar Promoter Ramesh Vaze Acquires Additional Shares",
            "Summary": "Ramesh Vaze, promoter of SH Kelkar & Company, acquired 31,000 equity shares through off-market transfer from promoter group member, increasing his shareholding to 1.07% from 1.05%.",
            "Sentiment": "neutral",
            "PublishDate": 1766744207368,
            "Source": "stocks"
        },
        {
            "Title": "T-Care Promoter Group Share Transfer Disclosure",
            "Summary": "Milena Kedar Vaze acquires 10,00,000 equity shares (0.72%) from promoter group member through off-market transfer. Post-transaction, other promoter group members hold 54.15% stake in T-Care.",
            "Sentiment": "neutral",
            "PublishDate": 1766558522617,
            "Source": "stocks"
        },
        {
            "Title": "S H Kelkar Establishes Fully Owned Subsidiary in UAE",
            "Summary": "S H Kelkar has formed a fully owned subsidiary named 'Keva Middle East FZE' in the United Arab Emirates. This expansion move establishes the company's direct presence in the Middle East market through its new UAE-based entity.",
            "Sentiment": "positive",
            "PublishDate": 1764768895172,
            "Source": "corporate_action"
        },
        {
            "Title": "SH Kelkar Reports 12% Revenue Growth in H1 FY26 Amid Margin Pressure from New Initiative Investments",
            "Summary": "SH Kelkar achieved 12% year-on-year consolidated revenue growth in H1 FY26 driven by steady demand across core categories, though EBITDA margins were pressured by Rs. 32 crore investment in new creative development centers across India, Europe, and U.S. The company expects margins to improve in the second half as raw material costs decline and new factory operations commence, with adjusted EBITDA margin at 14.5% compared to 14.4% in H2 FY25.",
            "Sentiment": "neutral",
            "PublishDate": 1763173436069,
            "Source": "earnings"
        },
        {
            "Title": "SH Kelkar Reports 12.2% Revenue Growth in H1 FY26, Appoints New CFO",
            "Summary": "SH Kelkar and Company, India's largest Indian-origin fragrance and flavour company, announced its financial results for the quarter and half-year ended September 30, 2025. The company reported consolidated revenue growth of 12.2% year-on-year for the half-year, with revenues from operations at Rs. 1,135 crore. Adjusted EBITDA stood at Rs. 164 crore with margins at 14.5%, while reported EBITDA was Rs. 126 crore. PBT (before exceptional items) was Rs. 46.1 crore. The growth was driven by resilient demand across core categories and continued traction with existing and new customers. Domestic business maintained healthy momentum supported by deeper engagement with small and mid-sized clients, while European operations remained steady amid subdued market conditions. The company appointed Jagdish Agarwal as Chief Financial Officer effective December 2, 2025, bringing over 28 years of experience in manufacturing, telecommunications, and banking. Two key capacity expansion projects - the greenfield facility at Vanavate and brownfield expansion at Holland Aromatics - are progressing well and expected to be commissioned by Q4 FY2026. The company is investing in strategic initiatives across Germany, UK, and US, along with capacity expansion in Netherlands, expecting margins and profitability to improve over the next 15-18 months.",
            "Sentiment": "positive",
            "PublishDate": 1762826207884,
            "Source": "earnings"
        },
        {
            "Title": "SH Kelkar & Company Reports Quarterly Results and Announces CFO Leadership Change",
            "Summary": "SH Kelkar & Company's Board approved unaudited standalone and consolidated financial results for the quarter and half-year ended September 30, 2025. The company announced key management changes in its Chief Financial Officer position. Ms. Deepti Chandratre will step down as Interim Chief Financial Officer effective December 1, 2025, and will continue as Global Legal Counsel and Company Secretary. Mr. Jagdish Agarwal has been appointed as Chief Financial Officer designated as Group Chief Financial Officer effective December 2, 2025. Agarwal brings over 28 years of experience across manufacturing, telecommunications, and banking sectors, having held senior positions at organizations including Reliance Communications, ICICI Bank, Owens Corning, and Huhtamaki India. He is a Chartered Accountant and Cost and Management Accountant with a Bachelor's degree in Commerce from Calcutta University.",
            "Sentiment": "neutral",
            "PublishDate": 1762568186796,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar Reports 77% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "S H Kelkar and Co reported Q2 consolidated net profit of 91.8 million rupees, down from 398 million rupees in the same quarter last year. Revenue increased to 5.54 billion rupees from 5.42 billion rupees year-over-year. EBITDA declined to 527 million rupees from 808 million rupees, while EBITDA margin compressed to 9.51% from 14.89% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762522995375,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar And Co Reports 13% Revenue Growth to ₹1,140 Crores in H1 FY2026",
            "Summary": "S H Kelkar And Co reported consolidated revenues of ₹1,140 crores for H1 FY2026, representing an increase of approximately 13% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1759840414085,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar Appoints Deepti Chandrate as Interim CFO",
            "Summary": "S H Kelkar and Company has appointed Ms. Deepti Chandrate as Interim CFO starting October 07, 2025. She will continue her existing roles as Global Legal Counsel and Company Secretary while serving as interim CFO until a permanent replacement is found. Chandrate has previous work experience with Mahindra & Mahindra.",
            "Sentiment": "neutral",
            "PublishDate": 1759828346281,
            "Source": "corporate_governance"
        },
        {
            "Title": "S H Kelkar Approves Corporate Restructuring and Reports Q1 FY26 Results",
            "Summary": "S H Kelkar and Company Limited's Board approved internal corporate restructuring to align group entities with business units. The restructuring includes the sale of Keva UK Limited to Keva Fragrances Private Limited by Keva Europe BV for Euro 2 million, sale of Keva USA Inc. to Keva Fragrances Private Limited by the Company for USD 2 million, and incorporation of Keva Middle East FZE as a subsidiary of Keva Fragrances Private Limited with AED 150,000 investment. The company also reported quarterly results for the period ended June 30, 2025, showing consolidated revenue from operations of Rs 580.63 crores and profit for the period of Rs 25.55 crores. The fragrance segment generated revenue of Rs 509.96 crores while the flavours segment contributed Rs 68.60 crores. The company realized Rs 2.11 crores from sale of scrap related to the previous year's fire incident at Vashivali plant, presented as exceptional item. Basic and diluted earnings per share stood at Rs 1.85.",
            "Sentiment": "positive",
            "PublishDate": 1754662255701,
            "Source": "corporate_action"
        },
        {
            "Title": "S H Kelkar Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "S H Kelkar and Company reported quarterly results showing revenue growth to 5.8 billion rupees from 4.7 billion rupees year-over-year. The company posted a consolidated net profit of 256 million rupees compared to a loss of 866 million rupees in the same period last year. However, profit before tax declined to 344 million rupees from 465 million rupees year-over-year. EBITDA decreased to 720 million rupees from 790 million rupees, with EBITDA margin compressing to 12.39% from 16.81%. The company had an exceptional item of 1.2 billion rupees in the previous year's results.",
            "Sentiment": "neutral",
            "PublishDate": 1754660654181,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar Reports 14% Revenue Growth in Q1, European Business Stable",
            "Summary": "S H Kelkar and Co reported consolidated revenues of 5.74 billion rupees in the latest quarter, representing a 14% year-over-year growth. The company also noted stability in its European business for the same period.",
            "Sentiment": "positive",
            "PublishDate": 1751545349000,
            "Source": "default"
        },
        {
            "Title": "S H Kelkar CFO Rohit Saraogi Resigns",
            "Summary": "Rohit Saraogi has resigned from his position as Group Chief Financial Officer (CFO) at S H Kelkar And Co. No further details about the resignation or potential replacement were provided in the news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1751544838000,
            "Source": "default"
        },
        {
            "Title": "S H Kelkar Provides Guidance on Debt Reduction and Growth Expectations",
            "Summary": "S H Kelkar has provided guidance on its financial outlook. The company expects to reduce its debt to around INR 650 crore by the end of the year, with a further reduction to approximately INR 550 crore in FY '26. They anticipate receiving insurance money of about INR 300 crore, estimated at INR 100 crore per year, which will aid in debt reduction. The company is guiding for a 12% plus CAGR growth year-on-year, despite strong growth in the previous year, and expects no slowdown in growth for the coming year.",
            "Sentiment": "positive",
            "PublishDate": 1747971296000,
            "Source": "default"
        },
        {
            "Title": "S H Kelkar and Co Recommends Dividend of 1 Rupee per Equity Share",
            "Summary": "S H Kelkar and Co has recommended a dividend of 1 rupee per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1747408944000,
            "Source": "result"
        },
        {
            "Title": "S H Kelkar and Co Reports Q4 Financial Results",
            "Summary": "S H Kelkar and Co has reported its Q4 financial results. The company's consolidated net profit increased to 1.02 billion rupees from 339 million rupees year-over-year. Revenue rose to 5.7 billion rupees from 5.13 billion rupees in the same period last year. However, EBITDA decreased to 740 million rupees from 900 million rupees, with EBITDA margin falling to 13.05% from 17.54%. The company also reported an exceptional item of 593 million rupees and a profit before tax (PBT) of 377 million rupees, down from 588 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747408901000,
            "Source": "result"
        },
        {
            "Title": "S H Kelkar Reports Healthy Growth in Q4 FY25, Limited US Export Impact",
            "Summary": "S H Kelkar has announced that it maintains healthy growth in the fourth quarter of fiscal year 2025. The company also stated that it has limited export sales to the United States and does not anticipate any significant impact from tariffs.",
            "Sentiment": "positive",
            "PublishDate": 1743686576000,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar Projects Revenue Growth and Debt Position for FY2025",
            "Summary": "S H Kelkar has announced its financial projections for the fiscal year 2025. The company expects consolidated revenues to reach 21.10 billion rupees, representing a 15% year-over-year increase. Additionally, S H Kelkar forecasts its net debt position as of March 31, 2025, to be 6.70 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1743686568000,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar Receives Interim Insurance Relief for Fire Incident",
            "Summary": "S H Kelkar has received an interim relief of 950 million rupees from New India Assurance for a fire incident. The final assessment of the insurance claim is still ongoing.",
            "Sentiment": "positive",
            "PublishDate": 1743686561000,
            "Source": "corporate_action"
        },
        {
            "Title": "S H Kelkar and Co Reports Decline in Q3 EBITDA and Margin",
            "Summary": "S H Kelkar and Co experienced a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 644 million rupees from 760 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 11.85% from 15.11% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739368817000,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar and Co Reports Q3 Financial Results",
            "Summary": "S H Kelkar and Co announced its Q3 financial results. The company's consolidated net profit decreased to 175 million rupees from 322 million rupees year-over-year. However, revenue increased to 5.43 billion rupees from 4.72 billion rupees compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739368812000,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar to Consider Q3 Results on February 12",
            "Summary": "S H Kelkar and Company Limited has announced that it will consider its financial results for the third quarter on February 12. This indicates the company is preparing to release its earnings report for the latest fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1738847348000,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar Reports 17% Revenue Growth in First 9 Months of FY2025",
            "Summary": "S H Kelkar and Company announced consolidated revenues of 15.48 billion rupees for the first nine months of fiscal year 2025, representing a 17% year-over-year increase. The company noted that gross margins are under pressure due to supply constraints. Despite this, S H Kelkar remains confident in achieving double-digit growth for the full financial year.",
            "Sentiment": "positive",
            "PublishDate": 1736162061000,
            "Source": "earnings"
        },
        {
            "Title": "S H Kelkar and Co Reports Q2 EBITDA Growth",
            "Summary": "S H Kelkar and Co announced its Q2 financial results. The company's EBITDA increased to 800 million rupees from 712 million rupees year-over-year. However, the EBITDA margin decreased slightly to 14.73% from 15.64% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731592746000,
            "Source": "result"
        },
        {
            "Title": "S H Kelkar Reports Mixed Q2 Results",
            "Summary": "S H Kelkar and Company reported a year-over-year increase in Q2 consolidated net profit to 398 million rupees from 293 million rupees. However, the company experienced a loss of 866 million rupees compared to the previous quarter. Q2 revenue rose to 5.4 billion rupees from 4.33 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731592669000,
            "Source": "result"
        },
        {
            "Title": "S H Kelkar Reports Strong H1 FY2025 Revenue Growth",
            "Summary": "<p><b>S H Kelkar</b>, a company in the <span class='neutral'>fragrance and flavor industry</span>, has announced its <span class='neutral'>financial results</span> for the first half of fiscal year 2025. The company reported <span class='positive'>consolidated revenues</span> of <b>1,000 crore rupees</b>, marking a <span class='positive'>significant year-over-year growth</span> of <b>17.4%</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728018288000,
            "Source": "result"
        }
    ]
}