{
    "Symbol": "SHOPERSTOP",
    "ISIN": "INE498B01024",
    "News": [
        {
            "Title": "Shoppers Stop CFO Transition Announced",
            "Summary": "Shoppers Stop announces CFO Karunakaran Mohanasundaram's resignation effective February 17, 2026, and appoints Pankaj Chaturvedi as new CFO from April 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770781351919,
            "Source": "stocks"
        },
        {
            "Title": "Shoppers Stop Targets Mid-Teen Revenue Growth by FY27",
            "Summary": "Shoppers Stop management provides guidance for mid-teen revenue growth trajectory for FY27 during recent conference call, indicating positive business outlook for the retail chain.",
            "Sentiment": "positive",
            "PublishDate": 1769048712216,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shoppers Stop Q3FY26 Results Show Mixed Performance",
            "Summary": "Shoppers Stop reported Q3FY26 standalone net profit of ₹12.61 cr vs ₹48.78 cr YoY, with revenue at ₹1,320.85 cr. Nine-month results show net loss of ₹27.96 cr vs profit of ₹4.27 cr in previous year.",
            "Sentiment": "negative",
            "PublishDate": 1768913628944,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shoppers Stop Allots 5,224 Shares Under ESOP Plan",
            "Summary": "Shoppers Stop Limited allotted 5,224 equity shares under its Employee Stock Option Plan 2022 on January 20, 2026, increasing total share capital to ₹55.05 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1768905442525,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shoppers Stop Receives Promoter Reclassification Request",
            "Summary": "Two promoter group entities of Shoppers Stop have requested reclassification to public shareholder category. Board to consider requests on January 20, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768572516247,
            "Source": "stocks"
        },
        {
            "Title": "Shoppers Stop Q3FY26 Earnings Call on Jan 21",
            "Summary": "Shoppers Stop Limited has scheduled an analyst and investor conference call for January 21, 2026, at 11:00 AM IST to discuss Q3FY26 and nine-month financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1768283254169,
            "Source": "stocks"
        },
        {
            "Title": "Shoppers Stop Board Meet Set for Jan 20 Q3 Results",
            "Summary": "Shoppers Stop Limited has scheduled its board meeting for January 20, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1768226038495,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shoppers Stop Completes ₹3 Cr Divestment Deal",
            "Summary": "Shoppers Stop's subsidiary Global SS Beauty Brands has completed the divestment of its entire stake in Pahadi Goodness for ₹3.00 crores, marking the completion of its strategic exit from the investment.",
            "Sentiment": "neutral",
            "PublishDate": 1766205928311,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shoppers Stop Shares Analyst Day Presentation Highlighting Premium Strategy and Business Expansion",
            "Summary": "Shoppers Stop provided its presentation materials for an Analyst Day Meet organized by K. Raheja Corp Group, showcasing the company's premiumization strategy across 303 stores and INR 54.3B gross revenue. The presentation highlighted the retailer's focus on strengthening brand portfolio, expanding beauty operations through partnerships with global brands, and growth in value fashion segment through INTUNE stores.",
            "Sentiment": "positive",
            "PublishDate": 1764668786252,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop Invests Rs 10 Crores in Beauty Subsidiary GSSBL",
            "Summary": "Shoppers Stop completed its fourth tranche investment of Rs 10 crores in wholly-owned subsidiary Global SS Beauty Brands Limited through subscription to 1,000 preference shares, bringing total preference share investment to Rs 105 crores. The funds will support GSSBL's expansion plans in beauty product distribution and specialty retail stores, as the subsidiary reported Rs 220 crores turnover in FY24-25.",
            "Sentiment": "positive",
            "PublishDate": 1764070375134,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop Subsidiary Completes Rs 3 Crore Divestment of Pahadi Goodness Holdings",
            "Summary": "Global SS Beauty Brands Limited, a wholly owned subsidiary of Shoppers Stop, has executed a Securities Transfer Agreement to sell its entire holding of 40,000 Optionally Convertible Debentures in Pahadi Goodness Private Limited to Augusta Consultants Advisors Private Limited for Rs 3 crores. The transaction represents a complete exit from the investment and is classified as a non-related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1763973035839,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop Reports Strong Q2 Performance with 9.4% Like-for-Like Growth and Return to Profitability",
            "Summary": "Shoppers Stop delivered robust quarterly results with departmental store like-for-like sales growing 9.4%, marking the highest growth in 10 years. The company's core business turned profitable with profit before tax of Rs. 9 crores compared to a loss of Rs. 12 crores in the previous period, representing a Rs. 21 crore improvement. EBITDA grew 42% driven by the company's premiumization strategy. Key performance indicators showed customer entries increased 6% like-for-like, average transaction value rose 8%, and premium product mix grew 16% to account for 69% of total sales. The First Citizen loyalty program expanded to 13 million members contributing 83% of total sales. Beauty segment outperformed with 22% growth led by fragrances, while watches and handbags recorded double-digit growth of 13% and 11% respectively. The company's new businesses INTUNE and ssbeauty.in remain in investment phase with planned losses, while the beauty distribution business through Global SSBeauty grew 103% year-on-year. Management expects to open 9-10 departmental stores for the full year and anticipates continued double-digit growth momentum in the festive season.",
            "Sentiment": "positive",
            "PublishDate": 1761201626482,
            "Source": "earnings"
        },
        {
            "Title": "Shoppers Stop Reports Net Loss of Rs 40.57 Crores for Half Year Ended September 2025",
            "Summary": "Shoppers Stop Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported a standalone net loss of Rs 22.68 crores for the quarter and Rs 40.57 crores for the half year, compared to losses of Rs 22.00 crores and Rs 44.51 crores respectively in the previous year. Revenue from operations increased to Rs 1,175.31 crores for the quarter (vs Rs 1,068.10 crores last year) and Rs 2,269.50 crores for the half year (vs Rs 2,101.80 crores last year). On a consolidated basis, the net loss was Rs 20.11 crores for the quarter and Rs 35.84 crores for the half year. The company faces a pending service tax matter of Rs 16.60 crores (standalone) relating to retrospective levy from 2007-2010, which is before the Supreme Court.",
            "Sentiment": "negative",
            "PublishDate": 1760690774865,
            "Source": "earnings"
        },
        {
            "Title": "Shoppers Stop Expects Strong Festive Quarter Growth Following GST Reforms",
            "Summary": "Shoppers Stop anticipates a strong festive quarter driven by increased demand following GST reforms that reduced tax rates on apparel. Managing Director Kavindra Mishra expects a 'bumper Q3' and better second half performance, citing encouraging store footfalls after GST changes took effect on September 22. The reforms reduced GST rates on apparel priced between Rs 1,000-2,500 from 12% to 5%, while rates on apparel below Rs 1,000 remained at 5%. The company reported 6% like-for-like growth in Q1 and expects high single-digit growth in Q2. Mishra noted that 40% of their portfolio is non-apparel and unaffected by GST changes, with margins expected to remain neutral despite higher demand. The luxury segment showed 9% growth, indicating continued premiumisation trends driving overall performance.",
            "Sentiment": "positive",
            "PublishDate": 1758628004392,
            "Source": "stock"
        },
        {
            "Title": "Shoppers Stop Invests Additional ₹10 Crores in Subsidiary GSSBL for Beauty Retail Expansion",
            "Summary": "Shoppers Stop has invested an additional ₹10 crores in its wholly-owned subsidiary GSSBL. This brings the total investment in the subsidiary to ₹85 crores. The investment is aimed at supporting expansion in the beauty retail segment.",
            "Sentiment": "positive",
            "PublishDate": 1758029659936,
            "Source": "stock"
        },
        {
            "Title": "Shoppers Stop ESG Rating Improves to 69.1 from 68.2",
            "Summary": "Shoppers Stop Limited received an ESG rating of 69.1 from SES ESG Research Private Limited based on FY 2024-25 disclosures, representing an improvement from the previous rating of 68.2 for FY 2023-24. The assessment was conducted voluntarily by SES ESG on July 23, 2025, without any engagement from Shoppers Stop. SES ESG independently prepared the report using publicly available data pertaining to the company's FY 2024-25 performance.",
            "Sentiment": "positive",
            "PublishDate": 1753359433643,
            "Source": "stock"
        },
        {
            "Title": "Shoppers Stop Opens New Warehouse in Karnataka to Boost Delivery Efficiency",
            "Summary": "Shoppers Stop Limited announced the commencement of operations at its new warehouse in Bangalore Rural District, Karnataka, effective July 25, 2025. The facility is located at Lakkenahalli Village and Kuluvanahalli Village, Nelamangala Taluka. The company stated this new warehouse will enhance its ability to deliver products more efficiently to customers and stores.",
            "Sentiment": "positive",
            "PublishDate": 1753191993281,
            "Source": "stock"
        },
        {
            "Title": "Shoppers Stop Reports 68% EBITDA Growth in Q1 FY26 Despite Value Retail Challenges",
            "Summary": "Shoppers Stop delivered resilient performance with 6% sales growth and 68% EBITDA increase in quarterly results. Departmental stores showed strong momentum with 5% like-for-like growth and 145% EBITDA improvement, driven by premiumization strategy reaching 67%. Customer entry improved 2% on like-for-like basis while average transaction value increased 6%. Beauty business grew 17% with Global SS Beauty subsidiary doubling sales to INR84 crores. However, INTUNE value format faced headwinds due to competitive discounting in June, though management expects continued investment losses in near term. Company enrolled 58,000 customers through India Weds campaign generating INR154 crores sales, while Black Card memberships hit record enrollments. Personal shoppers now contribute 25% of total sales, up 700 basis points year-over-year. Management reduced outright inventory by INR110 crores and plans to open 7-8 departmental stores and 30-40 INTUNE stores during fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1753190724579,
            "Source": "earnings"
        },
        {
            "Title": "Shoppers Stop Reports Strong Q1 Performance with 68% EBITDA Growth",
            "Summary": "Shoppers Stop, a premium omni-channel retailer in India, has reported significant growth in its Q1 results. The company achieved a 68% increase in EBITDA, driven by premium product sales, a doubling of Intune sales, and a 117% increase in beauty distribution. These factors have strengthened Shoppers Stop's position as a leading premium retailer in the country.",
            "Sentiment": "positive",
            "PublishDate": 1752769072000,
            "Source": "default"
        },
        {
            "Title": "Shoppers Stop: Q1 Loss Narrows, Revenue Grows 9% YoY",
            "Summary": "Shoppers Stop's Q1 FY26 net loss reduced to ₹15.74 crore from ₹22.72 crore YoY. Revenue increased 8.6% to ₹1,161 crore, EBITDA rose 20% to ₹171.49 crore, and EBITDA margin improved to 14.7%. Total sales reached ₹1,336 crore with 6% growth. Premium portfolio contribution increased to 67% of total sales. Chairman B S Nagesh announced retirement after 34 years.",
            "Sentiment": "positive",
            "PublishDate": 1752759796000,
            "Source": "earnings"
        },
        {
            "Title": "Shoppers Stop Expects Higher Demand Due to Favorable Conditions",
            "Summary": "Shoppers Stop anticipates increased consumer demand due to two factors: an expected above-average monsoon and reduced income tax rates. These conditions are seen as potentially beneficial for the company's business outlook.",
            "Sentiment": "positive",
            "PublishDate": 1752758314000,
            "Source": "default"
        },
        {
            "Title": "Shoppers Stop Reports Q1 Financial Results",
            "Summary": "Shoppers Stop has announced its Q1 financial results. The company reported a consolidated net loss of 157 million rupees, compared to a loss of 227 million rupees in the same quarter last year. Revenue for Q1 stood at 11.61 billion rupees, up from 10.69 billion rupees in the year-ago period.",
            "Sentiment": "neutral",
            "PublishDate": 1752758012000,
            "Source": "result"
        },
        {
            "Title": "Shoppers Stop Q4 Results and Investment Approval",
            "Summary": "Shoppers Stop reported a Q4 consolidated net profit of 20 million rupees, down from 231.8 million rupees year-over-year. Revenue increased to 10.64 billion rupees from 10.46 billion rupees in the same period last year. The company has approved an investment of up to 500 million rupees in Global SS Beauty Brands Limited (GSBBL).",
            "Sentiment": "neutral",
            "PublishDate": 1745972706000,
            "Source": "default"
        },
        {
            "Title": "Shoppers Stop: Q4 Profit Plunges 91% Amid Weak Demand",
            "Summary": "Shoppers Stop reported a 91% drop in Q4 profit to 19.9 million rupees due to muted consumer demand. Revenue growth slowed to 1.7%, with same-store sales up 3%. The company's premium segment contributed 65% to Q4 revenue, up from 58% last year.",
            "Sentiment": "negative",
            "PublishDate": 1745938362000,
            "Source": "earnings"
        },
        {
            "Title": "Shoppers Stop Reports Q4 FY23 Financial Results",
            "Summary": "Shoppers Stop announced its Q4 FY23 financial results. The company reported a consolidated net profit of 20 million rupees, down from 231.8 million rupees year-over-year and 522 million rupees quarter-over-quarter. Revenue for Q4 stood at 10.64 billion rupees, slightly up from 10.46 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1745932835000,
            "Source": "result"
        },
        {
            "Title": "Shoppers Stop Announces Expansion with Nine New Store Openings",
            "Summary": "Shoppers Stop, a prominent retail company, has announced plans to commence operations from nine new store locations. This expansion move indicates the company's strategy for growth and increased market presence.",
            "Sentiment": "positive",
            "PublishDate": 1742567161000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop Announces Inventory Management and Expansion Plans",
            "Summary": "Shoppers Stop aims to maintain an inventory level of six to eight weeks in its stores. The company plans to open 12 to 15 new stores in FY26, with six stores expected to open in Q4. This information was shared during a concall update.",
            "Sentiment": "positive",
            "PublishDate": 1736998157000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop Plans Expansion with 32 New Stores in Q4",
            "Summary": "Shoppers Stop has announced plans to open 32 new stores in the fourth quarter. The company has also reaffirmed its previous guidance of 5% like-for-like growth in the second half of the fiscal year, which is expected to continue into the upcoming quarter. This information was shared during a company conference call.",
            "Sentiment": "positive",
            "PublishDate": 1736997970000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop Projects Strong Revenue for Global SS Beauty Business",
            "Summary": "Shoppers Stop anticipates its Global SS Beauty business to generate revenue between Rs 240 crore to Rs 250 crore for the full year. The company also expects sales at customer prices for Global SS Beauty to exceed Rs 400 crore for the same period, as revealed during a conference call.",
            "Sentiment": "positive",
            "PublishDate": 1736997926000,
            "Source": "earnings"
        },
        {
            "Title": "Shoppers Stop Reports Q3 Profit Growth and Expansion Plans",
            "Summary": "Shoppers Stop announced a consolidated net profit of 520 million rupees for Q3, up from 367 million rupees year-over-year, but down from a 208 million rupee loss quarter-over-quarter. Revenue increased to 13.8 billion rupees from 12.4 billion rupees year-over-year. The company's strategic focus is on making private brands profitable, with Q3 revenue growth being volume-led. Shoppers Stop plans to add 26 Intune and 6 department stores in Q4, with a target of opening 85 stores by the end of FY25.",
            "Sentiment": "positive",
            "PublishDate": 1736900223000,
            "Source": "earnings"
        },
        {
            "Title": "Shoppers Stop Plans Expansion with New Stores in Q4",
            "Summary": "Shoppers Stop has announced plans to expand its retail presence by adding 26 Intune stores and 6 department stores during the fourth quarter of the current fiscal year, according to their investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1736864128000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop Focuses on Private Brand Profitability and Reports Volume-Led Q3 Revenue Growth",
            "Summary": "Shoppers Stop has announced a strategic focus on making its private brands profitable. The company also reported that its third-quarter revenue growth was primarily driven by increased sales volume rather than price increases.",
            "Sentiment": "positive",
            "PublishDate": 1736860651000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop Reports Improved Q3 EBITDA and Margin",
            "Summary": "Shoppers Stop, an Indian retail company, has announced its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 2.45 billion rupees, up from 2.18 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin improved to 17.75% from 17.62% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1736855278000,
            "Source": "earnings"
        },
        {
            "Title": "Shoppers Stop Reports Mixed Q3 Financial Results",
            "Summary": "Shoppers Stop announced its Q3 financial results. The company's consolidated net profit increased to 520 million rupees, up from 367 million rupees year-over-year. However, it reported a loss of 208 million rupees compared to the previous quarter. Revenue for Q3 rose to 13.8 billion rupees from 12.4 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1736855156000,
            "Source": "earnings"
        },
        {
            "Title": "Shoppers Stop Ltd. Experiences Significant Block Trade on NSE",
            "Summary": "A block trade of approximately 500,375 shares of Shoppers Stop Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 621.00 per share. The total value of this transaction amounted to Rs. 31.07 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1734940153000,
            "Source": "block_deals"
        },
        {
            "Title": "Shoppers Stop Launches Joyology Beauty Brand",
            "Summary": "Shoppers Stop has introduced a new beauty brand called Joyology Beauty. The brand is positioned as a celebration of joyful self-expression through innovative beauty products.",
            "Sentiment": "positive",
            "PublishDate": 1733821162000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop: Quick Commerce Entry with 3-Hour Delivery Promise",
            "Summary": "Shoppers Stop plans to enter quick commerce, offering 3-hour delivery for clothing, jewelry, and home decor. The company is updating its app to support this service, aiming to expand market size and compete with e-commerce trends.",
            "Sentiment": "positive",
            "PublishDate": 1730963011000,
            "Source": "normal_news"
        },
        {
            "Title": "Shoppers Stop: Q2 Results Show Soft Revenue Growth, Impacting Profitability",
            "Summary": "Shoppers Stop's second quarter results indicate weak revenue growth, which has negatively affected the company's profitability, according to a review by Motilal Oswal.",
            "Sentiment": "negative",
            "PublishDate": 1729759617000,
            "Source": "result"
        },
        {
            "Title": "Shoppers Stop Plans Significant Store Expansion",
            "Summary": "Shoppers Stop has announced plans to expand its retail presence by adding 50 Intune stores, 7 department stores, 6 beauty stores, and 2 Homestop stores during the third and fourth quarters of the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1729603771000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shoppers Stop Reports Q2 EBITDA Decline",
            "Summary": "Shoppers Stop, an Indian retail company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.5 billion rupees from 1.60 billion rupees year-over-year. Additionally, the EBITDA margin dropped to 13.44% from 15.49% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1729602171000,
            "Source": "result"
        },
        {
            "Title": "Shoppers Stop Reports 7.3% Revenue Growth in Q2",
            "Summary": "Shoppers Stop, an Indian retail company, has announced its financial results for the second quarter. The company's revenue increased to 11.15 billion rupees, up from 10.39 billion rupees in the same period last year, representing a year-over-year growth of approximately 7.3%.",
            "Sentiment": "positive",
            "PublishDate": 1729602162000,
            "Source": "result"
        },
        {
            "Title": "Shoppers Stop Reports Q2 Net Loss of 206M Rupees",
            "Summary": "Shoppers Stop, an Indian retail company, has reported a consolidated net loss of 206 million rupees for the second quarter. This represents a significant decline from the profit of 27 million rupees in the same quarter last year. Additionally, the loss has widened from 227 million rupees in the previous quarter.",
            "Sentiment": "negative",
            "PublishDate": 1729602152000,
            "Source": "result"
        }
    ]
}