{
    "Symbol": "SHREEJISPG",
    "ISIN": "INE1B6101010",
    "News": [
        {
            "Title": "Shreeji Shipping Secures Strategic Port Agreement",
            "Summary": "Shreeji Shipping Global Limited enters strategic port handling agreement with Karanja Terminal & Logistics, securing exclusive rights to handle 3 MMT cargo annually at 200-meter waterfront facility in Maharashtra.",
            "Sentiment": "positive",
            "PublishDate": 1770831147763,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shreeji Shipping Global Q3 Profit Surges 135%",
            "Summary": "Shreeji Shipping Global reports strong Q3 performance with consolidated net profit jumping 135% YoY to ₹325 million, while revenue grows 32% to ₹1.98 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770302116520,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shreeji Shipping Files Court Applications for Vessel Release",
            "Summary": "Shreeji Shipping Global Limited has filed two applications before Gujarat High Court seeking reduction of security amount and vacation of arrest orders for five vessels in ongoing admiralty proceedings.",
            "Sentiment": "neutral",
            "PublishDate": 1768995497543,
            "Source": "stocks"
        },
        {
            "Title": "Shreeji Shipping Gets Relief: 2 of 5 Arrested Vessels Released",
            "Summary": "High Court of Gujarat orders release of 2 vessels belonging to Shreeji Shipping Global on furnishing security, while company pursues legal action to vacate remaining arrests and reduce security requirements.",
            "Sentiment": "positive",
            "PublishDate": 1766845278215,
            "Source": "stocks"
        },
        {
            "Title": "Shreeji Shipping Enters Coastal Cargo Movement with AMNS Partnership",
            "Summary": "Shreeji Shipping Global Limited's wholly owned subsidiary entered a Time Charter Party Agreement with AMNS Shipping and Logistics Private Limited for deploying vessel MV SJ LILY for coastal cargo movement along the Indian coastline, with delivery made on December 1, 2025. This marks the company's strategic expansion from lighterage stevedoring services to becoming a fully integrated maritime logistics player, positioning it in the rapidly emerging coastal shipping opportunity in India.",
            "Sentiment": "positive",
            "PublishDate": 1764693175500,
            "Source": "order&deals"
        },
        {
            "Title": "Shreeji Shipping Global Reports IPO Proceeds Utilization for Quarter Ended September 30, 2025",
            "Summary": "Shreeji Shipping Global Limited submitted its monitoring agency report for IPO proceeds utilization for the quarter ended September 30, 2025. The company raised gross proceeds of Rs 4,107.10 million through its IPO conducted from August 19-21, 2025. During the quarter, the company utilized Rs 230 million for repayment of outstanding borrowings and Rs 951.88 million for general corporate purposes including purchase of fixed assets (Rs 591.88 million) and repayment of working capital demand loan (Rs 350 million). No utilization was observed for vessel acquisition during this quarter. The company has Rs 1,543.33 million in unutilized proceeds deployed in fixed deposits and bank accounts. CRISIL Ratings Limited, serving as the monitoring agency, reported no deviations from disclosed objects and confirmed all utilization was as per prospectus disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1761911420183,
            "Source": "corporate_action"
        },
        {
            "Title": "Shreeji Shipping Reports 34% EBITDA Growth in H1 FY26, Profit Margin Improves by 325 bps",
            "Summary": "Shreeji Shipping Global Limited announced its H1 FY26 results with revenue from operations reaching ₹323.39 crore compared to ₹275.80 crore in H1 FY25, marking a 17.26% increase. EBITDA (excluding exceptional items) grew 34.14% to ₹118.63 crore from ₹88.44 crore, with margin improving to 36.68% from 32.07%. Net profit before exceptional items and tax increased 29.64% to ₹97.35 crore. However, net profit after tax declined slightly to ₹79.91 crore from ₹80.95 crore due to exceptional income of ₹31.78 crore in the previous period. EPS (Diluted) stood at ₹5.32 compared to ₹5.74 in H1 FY25. The company received a Letter of Intent to establish Floating Crane Facilities at Diamond Harbour under Syama Prasad Mukharjee Port Trust Kolkata. Management noted that net profit for Q2 FY26 increased 14.75% over Q1 FY26, driven by efficient cargo handling and cost optimization. The company operates a fleet of over 80 vessels and more than 370 earthmoving equipment, focusing on dry bulk cargo logistics at ports in India and Sri Lanka.",
            "Sentiment": "positive",
            "PublishDate": 1761623092853,
            "Source": "earnings"
        },
        {
            "Title": "Shreeji Shipping Global Reports Mixed Q2 Results with Revenue Growth but Profit Decline",
            "Summary": "Shreeji Shipping Global reported quarterly net profit of 427 million rupees, down from 561 million rupees in the same period last year. Revenue increased to 1.62 billion rupees from 1.46 billion rupees year-over-year. EBITDA rose to 531 million rupees from 489 million rupees, while EBITDA margin decreased slightly to 32.75% from 33.59% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1761579481988,
            "Source": "earnings"
        },
        {
            "Title": "Shreeji Shipping Global Reports Q1 FY26 Results with Revenue of Rs 1,301 Million",
            "Summary": "Shreeji Shipping Global Limited reported quarterly results for the quarter ended June 30, 2025. The company recorded consolidated revenue from operations of Rs 1,300.69 million and total income of Rs 1,313.24 million. Net profit for the quarter stood at Rs 248.54 million with earnings per share of Rs 1.77. The company operates in shipping and logistics services with operations both within India (Rs 1,181.64 million revenue) and outside India (Rs 119.05 million revenue). The results were approved by the Board of Directors on September 13, 2025. The company completed its IPO of 1.63 million equity shares at Rs 252 per share and got listed on NSE and BSE on August 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757773372344,
            "Source": "earnings"
        }
    ]
}