{
    "Symbol": "SHREDIGCEM",
    "ISIN": "INE232A01011",
    "News": [
        {
            "Title": "Shree Digvijay Cement Q3FY26 Results Approved",
            "Summary": "Shree Digvijay Cement Company Limited's Board approved unaudited standalone and consolidated financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770614750806,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Digvijay Cement CEO & MD Resigns",
            "Summary": "Krishnakumar Ramanujan steps down as CEO & Managing Director of Shree Digvijay Cement Company with immediate effect from February 6, 2026. Board initiates search for replacement.",
            "Sentiment": "neutral",
            "PublishDate": 1770391053485,
            "Source": "stocks"
        },
        {
            "Title": "Shree Digvijay Cement Open Offer Concludes",
            "Summary": "India Resurgence Fund completes open offer for Shree Digvijay Cement, acquiring 1,34,07,285 shares at INR 92.20 per share, with consideration payment scheduled for January 27, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769744333755,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Digvijay Cement Board Meet on Feb 6, 2026",
            "Summary": "Shree Digvijay Cement Company Limited has scheduled a board meeting for February 6, 2026, to consider Q3 FY26 financial results. Trading window remains closed until February 8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769487094911,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Digvijay Cement Board Changes Post Acquisition",
            "Summary": "Shree Digvijay Cement announces board changes following India Resurgence Fund's 45.01% stake acquisition. Pramod Kabra resigns as director while Shitij Kale joins as nominee director.",
            "Sentiment": "neutral",
            "PublishDate": 1766063369803,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Block Trade Worth ₹79.55 Crores on NSE",
            "Summary": "Shree Cement executed a major block trade on NSE involving 30,053 shares at ₹26,470.00 per share, totaling ₹79.55 crores in transaction value, reflecting increased institutional activity.",
            "Sentiment": "positive",
            "PublishDate": 1765781525055,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Digvijay Cement Gets Partial Relief in Regulatory Appeal, Penalty Reduced",
            "Summary": "The Regional Director partially allowed Shree Digvijay Cement's appeal against ROC penalties for non-compliance with beneficial ownership filing requirements, dropping Rs. 8,48,400 in penalties under Section 90(4A) while maintaining Rs. 4,50,000 in fines under other sections. The violations related to non-filing of BEN-1 and BEN-4 forms concerning former promoter Votorantim's shareholding, with the company stating no material impact on operations.",
            "Sentiment": "positive",
            "PublishDate": 1765292899513,
            "Source": "corporate_governance"
        },
        {
            "Title": "CCI Approves Shree Digvijay Cement's Distribution Deal with Hi-Bond Cement and India Resurgence Fund Acquisition",
            "Summary": "The Competition Commission of India approved Shree Digvijay Cement Company Limited's distribution agreement with Hi-Bond Cement Private Limited for exclusive long-term cement distribution and an option to acquire 100% equity shares of Hi-Bond. The approval also covers India Resurgence Fund's proposed acquisition of shares in Shree Digvijay Cement, clearing regulatory hurdles for both transactions.",
            "Sentiment": "positive",
            "PublishDate": 1763543027649,
            "Source": "order&deals"
        },
        {
            "Title": "Shree Digvijay Cement Reports Quarterly Financial Results for September 2025",
            "Summary": "Shree Digvijay Cement Company Limited published its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the results on October 17, 2025. The results were published in Financial Express newspapers in English and Gujarati editions and uploaded on the company's website. The company reported total income from operations of ₹130,564.10 lakhs for the quarter, net profit before tax of ₹33,130.32 lakhs, and net profit after tax of ₹24,845.95 lakhs. Earnings per share stood at ₹710.86 for the quarter. The company's net worth was ₹1,393,371.56 lakhs with a debt equity ratio of 2.58.",
            "Sentiment": "neutral",
            "PublishDate": 1760857308581,
            "Source": "earnings"
        },
        {
            "Title": "Shree Digvijay Cement Reports Strong Q2 Performance with 25x Jump in Net Profit",
            "Summary": "Shree Digvijay Cement Company delivered robust Q2 results with standalone net profit surging to 102 million rupees compared to 4 million rupees in the same quarter last year. The company's EBITDA more than doubled to 194 million rupees from 81 million rupees year-over-year. EBITDA margin expanded significantly to 12.04% versus 5.57% in the corresponding quarter of the previous year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1760687461697,
            "Source": "earnings"
        },
        {
            "Title": "Shree Digvijay Cement Doubles Production Capacity with New Grinding Plant Launch",
            "Summary": "Shree Digvijay Cement has launched a new cement grinding plant that doubles the company's annual production capacity from 1.5 million tonnes to 3.0 million tonnes. This capacity expansion represents a significant increase in the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1759301912895,
            "Source": "stock"
        },
        {
            "Title": "Shree Digvijay Cement Seeks Shareholder Approval to Increase Borrowing Limit to INR 750 Crores",
            "Summary": "Shree Digvijay Cement Company Limited has issued a postal ballot notice seeking shareholder approval for three special resolutions. The company proposes to increase its borrowing powers from INR 500 crores to INR 750 crores, create charges on company assets, and expand investment limits to INR 1,200 crores under Section 186 of the Companies Act. The increased borrowing capacity is needed to fund a distribution agreement with Hi-Bond Cement (India) Private Limited, requiring a refundable deposit of up to INR 400 crores. The company currently has sanctioned borrowings of INR 300 crores, with INR 196 crores utilized. The distribution agreement grants exclusive long-term distribution rights for Hi-Bond's cement products and is valued at approximately INR 600 crores. Additionally, the company has approved an options agreement to potentially acquire 100% equity shares of Hi-Bond within eight years. E-voting will be conducted from September 19, 2025, to October 18, 2025, with results announced by October 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758033368172,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Digvijay Cement Reports Mixed Results, Recommends Rs 1.50 Dividend",
            "Summary": "Shree Digvijay Cement Company announced audited financial results for the year ended March 31, 2025. The company reported revenue from operations of Rs 72,515 lacs for the year, compared to Rs 79,164 lacs in the previous year. EBITDA declined to Rs 6,706 lacs from Rs 15,494 lacs year-on-year. Profit after tax decreased to Rs 2,520 lacs from Rs 8,776 lacs in the prior year. However, quarterly performance showed improvement with sales volume increasing 10% quarter-on-quarter to 3.94 lacs tons. The Board recommended a dividend of Rs 1.50 per equity share (15% on face value of Rs 10). The company's new grinding unit expansion is progressing and expected to be commissioned in Q1 FY2026. The 80th Annual General Meeting is scheduled for August 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1757084021676,
            "Source": "earnings"
        },
        {
            "Title": "Shree Digvijay Cement: True North Fund Sells 50.10% Stake to India Resurgence Fund, Triggers Open Offer",
            "Summary": "True North Fund VI LLP has entered into a share purchase agreement to sell up to 50.10% equity stake (7,42,71,009 shares) in Shree Digvijay Cement Company Limited to India Resurgence Fund entities for a minimum of 45.01% and maximum of 50.10% of share capital. The transaction is subject to regulatory approvals including Competition Commission of India clearance and will trigger a mandatory open offer to public shareholders. Additionally, Shree Digvijay Cement's board approved a distribution agreement with Hi-Bond Cement (India) Private Limited for exclusive 10-year cement distribution rights valued at approximately INR 600 crore annually, along with an options agreement to potentially acquire 100% of Hi-Bond Cement. The company will provide a refundable deposit of up to INR 400 crore to Hi-Bond Cement and gain the right to nominate one director on Hi-Bond's board. Upon completion, India Resurgence Fund will acquire control of Shree Digvijay Cement, reconstitute the board, and be reclassified as promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1757043561953,
            "Source": "order&deals"
        },
        {
            "Title": "Shree Digvijay Cement Board Approves Stake Sale Transaction",
            "Summary": "Shree Digvijay Cement's board has approved key Share Purchase Agreement (SPA) and distribution transactions. True North Fund will sell its 50.10% stake in the company to IRF entities as part of these approved transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1757000793971,
            "Source": "order&deals"
        },
        {
            "Title": "Shree Digvijay Cement in Talks for Exclusive Distribution Rights with Hi-Bond Cement",
            "Summary": "Shree Digvijay Cement is in discussions with Hi-Bond Cement to secure exclusive distribution rights and explore other business opportunities. The proposal requires board approval, which is scheduled for September 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756871145852,
            "Source": "order&deals"
        },
        {
            "Title": "Shree Digvijay Cement Denies Knowledge of Adani Group's Interest in Assets",
            "Summary": "Shree Digvijay Cement has stated that it has no knowledge of Adani Group's interest in its plant and port assets. The company's statement addresses speculation regarding potential interest from the Adani Group in acquiring these specific business assets.",
            "Sentiment": "neutral",
            "PublishDate": 1756129602007,
            "Source": "stock"
        },
        {
            "Title": "Adani Group Considers Acquiring Shree Digvijay Cement's Plant and Port Assets",
            "Summary": "Adani Group is considering the purchase of Shree Digvijay Cement's manufacturing plant and port facilities. The potential acquisition would involve industrial and logistics infrastructure assets from the cement company.",
            "Sentiment": "neutral",
            "PublishDate": 1756114917949,
            "Source": "order&deals"
        },
        {
            "Title": "Shree Digvijay Cement Reports 22% YoY Profit Growth in Q1 FY26 Despite Price Pressures",
            "Summary": "Shree Digvijay Cement Co. Limited delivered strong quarterly results with sales volume increasing 6% year-over-year to 3.59 lakh tons, revenue growing 11% to Rs 19,595 lakhs, and profit after tax rising 22% to Rs 1,379 lakhs. EBITDA reached Rs 2,519 lakhs with EBITDA per ton at Rs 701. Executive Chairman Anil Singhvi noted that performance was impacted by lower cement prices in Gujarat and subdued demand, though he expects improvement as cement demand shows signs of recovery. The company's capacity expansion project to double production from 1.5 million tons to 3.0 million tons is nearing completion, with the new cement grinding plant currently undergoing trial runs ahead of commercial launch.",
            "Sentiment": "positive",
            "PublishDate": 1753888752227,
            "Source": "earnings"
        },
        {
            "Title": "Shree Digvijay Cement: Q4 Profit Plunges 42%, Dividend Announced",
            "Summary": "Shree Digvijay Cement reported a 42% YoY drop in Q4 net profit to ₹18.3 crore. Revenue fell 3.6% to ₹216.4 crore. EBITDA decreased 42.2% with margins narrowing to 12.8%. The company announced a dividend of ₹1.50 per share for FY2025.",
            "Sentiment": "negative",
            "PublishDate": 1745830449000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Digvijay Cement Reports Q4 Financial Results",
            "Summary": "Shree Digvijay Cement Co. has released its Q4 financial results. The company reported revenue of 2.2 billion rupees, slightly down from 2.24 billion rupees in the same quarter last year. EBITDA for Q4 was 277 million rupees, a significant decrease from 480 million rupees year-over-year. The EBITDA margin also declined to 12.8% from 21.39% in the previous year's Q4.",
            "Sentiment": "negative",
            "PublishDate": 1745828224000,
            "Source": "result"
        },
        {
            "Title": "Shree Digvijay Cement Reports Q4 Net Profit Decline",
            "Summary": "Shree Digvijay Cement Co. reported a net profit of 184 million rupees for the fourth quarter, down from 317 million rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1745828082000,
            "Source": "result"
        },
        {
            "Title": "Shree Digvijay Cement Reports Q3 Revenue of 1.86 Billion Rupees",
            "Summary": "Shree Digvijay Cement Co. has reported its third-quarter revenue at 1.86 billion rupees, compared to 1.9 billion rupees in the same period last year. This represents a slight year-over-year decrease in revenue for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1737704750000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Digvijay Cement Reports Q3 Net Loss",
            "Summary": "Shree Digvijay Cement Company has reported a net loss of 48 million rupees in the third quarter, compared to a profit of 314 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1737704679000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Digvijay Cement Reports Q2 Revenue Decline",
            "Summary": "Shree Digvijay Cement Co. has reported a revenue of 1.45 billion rupees for the second quarter, compared to 1.84 billion rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731483673000,
            "Source": "result"
        },
        {
            "Title": "Shree Digvijay Cement Reports Decline in Q2 EBITDA",
            "Summary": "Shree Digvijay Cement Co. reported a significant decrease in its Q2 EBITDA, which fell to 81 million rupees from 202 million rupees year-over-year. The company's EBITDA margin also declined, dropping to 5.57% from 10.99% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731483580000,
            "Source": "result"
        },
        {
            "Title": "Shree Digvijay Cement Reports Significant Decline in Q2 Net Profit",
            "Summary": "Shree Digvijay Cement Co. has reported a net profit of 4 million rupees for the second quarter, marking a substantial decrease from 74 million rupees in the same period last year. This represents a year-over-year decline of approximately 95% in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1731483517000,
            "Source": "result"
        }
    ]
}