{
    "Symbol": "SHREEPUSHK",
    "ISIN": "INE712K01011",
    "News": [
        {
            "Title": "Shree Pushkar Q3 FY26 Revenue Grows 14.6% to Rs 248.9 Cr",
            "Summary": "Shree Pushkar Chemicals & Fertilisers reports Q3 FY26 revenue of Rs 248.9 crores, up 14.6% YoY, with PAT rising 13.5% to Rs 18.1 crores. Company progresses expansion plans at Ratnagiri and Meghnagar facilities.",
            "Sentiment": "positive",
            "PublishDate": 1770822055587,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Pushkar Allots 7.36L Convertibles to Promoter",
            "Summary": "Shree Pushkar Chemicals & Fertilisers allotted 7,36,196 convertible securities to promoter Gautam Makaria at ₹407.50 each, receiving 25% subscription amount of ₹7.50 crores upfront.",
            "Sentiment": "neutral",
            "PublishDate": 1766825851835,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Pushkar Chemicals Establishes 98.04% Subsidiary in Bangladesh",
            "Summary": "Shree Pushkar Chemicals has formed a 98.04% owned subsidiary called 'Dyecol Bangladesh Limited' to enhance its marketing operations in Bangladesh. This expansion move allows the company to strengthen its presence and business activities in the Bangladeshi market.",
            "Sentiment": "positive",
            "PublishDate": 1763993938281,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Pushkar Chemicals Reports 45% Revenue Growth, Announces Rs 350 Crore Expansion",
            "Summary": "Shree Pushkar Chemicals & Fertilisers delivered strong Q2 FY26 performance with revenue rising 45.2% to Rs 255 crores and PAT growing 36.7% to Rs 18.2 crores, driven by higher realizations across fertilizer and chemical segments. The company announced a new Rs 350 crore expansion project at Meghnagar adding 3 lakh metric tons capacity, targeting commissioning by FY28, while facing delays in Unit 5 and Unit 6 commissioning due to electricity connection issues expected to resolve by February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1763142511551,
            "Source": "earnings"
        },
        {
            "Title": "Shree Pushkar Chemicals Approves Rs 350 Crore Expansion and Warrant Issue to Promoter",
            "Summary": "Shree Pushkar Chemicals & Fertilisers Limited's board approved several key decisions including unaudited financial results for the second quarter and half year ended September 30, 2025. The company announced a Rs 350 crore capital expenditure for expanding its wholly owned subsidiary Madhya Bharat Phosphate Private Limited at Meghnagar, Jhabua, Madhya Pradesh, adding 3,00,000 MTPA capacity for complex fertilizers by March 2028. To fund this expansion, the board approved issuing up to 7,36,196 fully convertible warrants at Rs 407.50 each to promoter Gautam Gopikishan Makharia, raising approximately Rs 30 crores. The company also approved increasing authorized share capital from Rs 32.50 crores to Rs 33.50 crores and scheduled an extraordinary general meeting for December 10, 2025. The consolidated revenue from operations for the quarter was Rs 25,508.62 lakhs compared to Rs 17,562.28 lakhs in the previous year quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762604142209,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Reports 37% Jump in Q2 Net Profit to 182 Million Rupees",
            "Summary": "Shree Pushkar Chemicals & Fertilisers reported consolidated net profit of 182 million rupees in Q2, up from 133 million rupees in the same period last year. Revenue increased to 2.55 billion rupees from 1.76 billion rupees year-over-year. EBITDA rose to 262 million rupees compared to 191 million rupees previously. However, EBITDA margin declined slightly to 10.28% from 10.86% in the corresponding quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1762603054886,
            "Source": "earnings"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Schedules Board Meeting for Q2 Results and Fundraising Plans",
            "Summary": "Shree Pushkar Chemicals & Fertilisers Limited has scheduled a board meeting for November 8, 2025. The board will consider and approve the un-audited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. Additionally, the meeting will address potential fundraising through preferential issue, increase in authorized share capital with consequential amendments to the memorandum of association, and other business matters. The company has closed its trading window for designated and connected persons from October 1, 2025, which will remain closed until 48 hours after the declaration of the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1762176908371,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Pushkar Chemicals Establishes New Unit Dyecol Color Technologies for Dyes Sector Expansion",
            "Summary": "Shree Pushkar Chemicals has established a new unit called Dyecol Color Technologies aimed at growth in the dyes sector. The company is expanding its operations through this new business unit to strengthen its position in the dyes market.",
            "Sentiment": "positive",
            "PublishDate": 1756952886111,
            "Source": "stock"
        },
        {
            "Title": "Shree Pushkar Chemicals Reports 31% Revenue Growth in Q1 FY26 Driven by Strong Fertilizer Demand",
            "Summary": "Shree Pushkar Chemicals & Fertilizers delivered strong quarterly results with revenue from operations reaching Rs. 254.5 crores, marking 31.1% year-on-year growth and 16% sequential increase. The fertilizer segment drove performance with 33.4% revenue growth year-on-year, supported by 9.4% volume growth. EBITDA expanded to Rs. 29.1 crores (64% year-on-year growth) with margins improving to 11.4% from 9.1% in the previous year. Profit after tax increased 63.2% to Rs. 21 crores with PAT margin at 8.2%. The chemical segment faced pressure with 6.9% volume decline year-on-year but showed 48% sequential recovery. The company maintains a net cash positive position with Rs. 112 crores in deposits. Management approved incorporation of wholly-owned subsidiary Dyecol Color Technologies for marketing dyes business. Unit-5 expansion nears completion with commercial production expected within 1-2 months, while Unit-6 trials are planned for December 2025. The company invested Rs. 13 crores in capex during the quarter and is expanding solar capacity with additional projects planned.",
            "Sentiment": "positive",
            "PublishDate": 1755608713757,
            "Source": "earnings"
        },
        {
            "Title": "Shree Pushkar Chemicals Plans ₹85 Crore Investment for Capacity and Solar Expansion",
            "Summary": "Shree Pushkar Chemicals & Fertilisers is targeting steady growth through increased fertiliser volumes and strengthening its dye brands. The company plans to invest ₹85 crore for capacity expansion and solar power expansion to 19.5 MW. The investment will be supported by the company's strong cash position and promoter funding.",
            "Sentiment": "positive",
            "PublishDate": 1755016919302,
            "Source": "stock"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Reports Strong Q1 Growth with 64% Jump in Net Profit",
            "Summary": "Shree Pushkar Chemicals & Fertilisers delivered robust quarterly performance with consolidated net profit rising to 210 million rupees from 128 million rupees year-over-year. Revenue increased to 2.54 billion rupees compared to 1.94 billion rupees in the same period last year. EBITDA grew to 291 million rupees from 177 million rupees, while EBITDA margin expanded to 11.44% from 9.1% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755009807875,
            "Source": "earnings"
        },
        {
            "Title": "Shree Pushkar Chemicals Approves Q1 FY2026 Results and Key Board Appointments",
            "Summary": "Shree Pushkar Chemicals & Fertilisers Limited's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company re-appointed key leadership including Chairman & Managing Director Punit Gopikishan Makharia and Joint Managing Director Gautam Gopikishan Makharia for five-year terms from April 2026 to March 2031. Two independent directors, Barkharani Harsh Nevatia and Ishtiaq Ali, were also re-appointed for second five-year terms. The board appointed Dilip M. Bathija as Cost Auditor for FY2025-26 and DSM & Associates as Secretarial Auditor for five years from April 2025 to March 2030. The 32nd Annual General Meeting is scheduled for September 29, 2025, with the record date for final dividend eligibility set as September 19, 2025. All appointments are subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1755005619252,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Reports Q4 Results and Dividend",
            "Summary": "Shree Pushkar Chemicals & Fertilisers announced its quarterly results and dividend. The company recommended a dividend of 2 rupees per equity share. For Q4, the company reported an EBITDA of 247 million rupees, up from 187 million rupees year-over-year. The EBITDA margin improved to 11.26% from 9.82% in the same period last year. The consolidated net profit for Q4 was 165 million rupees, compared to 131 million rupees year-over-year and 159 million rupees quarter-over-quarter. Q4 revenue stood at 2.2 billion rupees, up from 1.9 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747402767000,
            "Source": "result"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Reports Strong Q3 Financial Results",
            "Summary": "Shree Pushkar Chemicals & Fertilisers has announced its Q3 financial results, showing significant year-over-year growth. The company's consolidated net profit increased to 159 million rupees, up from 76 million rupees in the same quarter last year. Revenue also saw a substantial rise, reaching 2.2 billion rupees compared to 1.7 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739320455000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Reports Improved Q3 EBITDA",
            "Summary": "Shree Pushkar Chemicals & Fertilisers has reported a significant increase in its Q3 EBITDA, rising to 225 million rupees from 139 million rupees year-over-year. The company's EBITDA margin also improved, increasing to 10.34% from 7.99% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739281173000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "Shree Pushkar Chemicals & Fertilisers has announced its Q3 financial results, showing substantial year-over-year growth. The company's consolidated net profit rose to 159 million rupees, up from 76 million rupees in the same quarter last year. Revenue also increased, reaching 2.2 billion rupees compared to 1.7 billion rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1739281007000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Pushkar Chemicals Approves Amalgamation of Subsidiaries",
            "Summary": "Shree Pushkar Chemicals has approved the amalgamation of its subsidiary Madhya Bharat Phosphate Private Limited (MBPPL) with another subsidiary, Kisan Phosphates Private Limited (KPPL). According to the share exchange ratio determined by a registered valuer, shareholders of MBPPL will receive 1.01 shares of KPPL for every 1 share they hold in MBPPL.",
            "Sentiment": "neutral",
            "PublishDate": 1734912689000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Pushkar Chemicals Approves Amalgamation of Subsidiaries",
            "Summary": "Shree Pushkar Chemicals has approved the amalgamation of its subsidiary Madhya Bharat with Kisan Phosphates. According to the share exchange ratio determined by a registered valuer, shareholders of Madhya Bharat will receive 1.01 shares of Kisan Phosphates for every 1 share they hold.",
            "Sentiment": "neutral",
            "PublishDate": 1734699592000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Reports Q2 EBITDA Growth",
            "Summary": "Shree Pushkar Chemicals & Fertilisers has reported a significant increase in its Q2 EBITDA, rising to 191 million rupees from 142 million rupees year-over-year. The company's EBITDA margin also improved, reaching 10.86% compared to 7.64% in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731489339000,
            "Source": "result"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Reports Q2 Revenue",
            "Summary": "Shree Pushkar Chemicals & Fertilisers has reported a quarterly revenue of 1.8 billion rupees for Q2, compared to 1.85 billion rupees in the same quarter last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1731489271000,
            "Source": "result"
        },
        {
            "Title": "Shree Pushkar Chemicals & Fertilisers Reports Q2 Profit Increase",
            "Summary": "Shree Pushkar Chemicals & Fertilisers has reported a consolidated net profit of 133 million rupees for the second quarter, up from 85 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731489246000,
            "Source": "result"
        }
    ]
}