{
    "Symbol": "SHREECEM",
    "ISIN": "INE070A01015",
    "News": [
        {
            "Title": "Shree Digvijay Cement Q3 Loss Widens to ₹70M",
            "Summary": "Shree Digvijay Cement reports wider net loss of ₹70 million in Q3 compared to ₹48 million loss in previous year, while revenue declined to ₹1.8 billion from ₹1.86 billion year-on-year.",
            "Sentiment": "negative",
            "PublishDate": 1770369464517,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Cement Block Trade Worth Rs. 52.72 Crores",
            "Summary": "Shree Cement executed a significant NSE block trade valued at Rs. 52.72 crores involving approximately 19,519 shares at Rs. 27,010.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1770111174120,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Cement announces senior management changes",
            "Summary": "Shree Cement Limited announces leadership transition with Vinod Kumar Chaturvedi ceasing as Chief Human Resources Officer and Manmohan Rathi taking additional CHRO responsibilities effective January 31, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769958837672,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Q3FY26 Results Call on Feb 6, 2026",
            "Summary": "Shree Cement Limited announces conference call scheduled for February 6, 2026 at 5:00 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025, hosted by ICICI Securities.",
            "Sentiment": "neutral",
            "PublishDate": 1769602673489,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Cement Gets AAA Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirmed Shree Cement's CARE AAA stable rating for long-term facilities worth ₹3,095.42 crores and CARE A1+ for short-term facilities of ₹2,500.00 crores, covering total bank facilities of ₹5,595.42 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769178127582,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Gets CRISIL AAA Rating Reaffirmation",
            "Summary": "CRISIL Ratings Limited reaffirmed Shree Cement's credit ratings with CRISIL AAA/Stable for long-term facilities worth ₹2,000.00 crores and CRISIL A1+ for short-term facilities of ₹2,500.00 crores.",
            "Sentiment": "positive",
            "PublishDate": 1769178071501,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Block Trade Worth ₹19.66 Crores on NSE",
            "Summary": "Shree Cement witnessed a significant block trade on NSE involving 7,072 shares valued at ₹19.66 crores, executed at ₹27,805.00 per share, indicating institutional investor activity.",
            "Sentiment": "neutral",
            "PublishDate": 1768884066037,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Cement Gets CareEdge BBB+ Foreign Currency Rating",
            "Summary": "Shree Cement Limited receives long-term Foreign Currency Issuer rating of 'CareEdge BBB+ with stable outlook' from CareEdge Global IFSC Limited, maintaining its strong credit profile with existing AAA/Stable domestic ratings.",
            "Sentiment": "positive",
            "PublishDate": 1768030820449,
            "Source": "stocks"
        },
        {
            "Title": "MCA Orders Probe Into Shree Cement Under Companies Act",
            "Summary": "Ministry of Corporate Affairs has initiated investigation into Shree Cement under Section 210(1)(c) of Companies Act 2013. The cement maker received communication on January 1 and will provide requested information in due course.",
            "Sentiment": "negative",
            "PublishDate": 1767363627856,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement faces MCA investigation order",
            "Summary": "Shree Cement receives communication from Regional Director seeking information under Section 210(1)(c) of Companies Act 2013. Company states no financial impact expected as only information is sought.",
            "Sentiment": "neutral",
            "PublishDate": 1767341941359,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Receives GST Demand Orders Worth ₹70.29 Lakh",
            "Summary": "Shree Cement Limited received GST demand orders from tax authorities in Chhattisgarh and Karnataka totaling ₹70.29 lakh for alleged input tax credit violations. Company plans to file appeals.",
            "Sentiment": "negative",
            "PublishDate": 1767186899471,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Receives ₹69.14 Lakh GST Demand Order",
            "Summary": "Shree Cement Limited has received a GST demand order of ₹69.14 lakh from Karnataka tax authorities for alleged non-payment of GST. The company plans to file an appeal by March 29, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1767090476238,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Receives GST Demand Order Worth ₹80.79 Lakh",
            "Summary": "Shree Cement faces GST demand order of ₹33.64 lakh plus interest and penalty totaling ₹80.79 lakh from Punjab tax authorities over alleged wrong input tax credit availment.",
            "Sentiment": "negative",
            "PublishDate": 1766996804691,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Board Meet Set for Q3 FY26 Results",
            "Summary": "Shree Cement Limited announces Board meeting on February 6, 2026, to approve Q3 FY26 financial results for quarter ending December 31, 2025. Trading window closure from January 1-8, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1766405102654,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Cement Receives ₹11.40 Cr GST Demand Order",
            "Summary": "Shree Cement receives GST demand order of ₹5.70 cr with equal penalty from Karnataka tax authorities over input tax credit dispute. Company plans appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766146848407,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Withdraws Lockout at Chhattisgarh Plant",
            "Summary": "Shree Cement withdraws lockout at Baloda Bazar plant effective December 22, 2025, after management and workmen reach amicable settlement, ending 4-day production disruption of 10,000 tons daily.",
            "Sentiment": "positive",
            "PublishDate": 1766112347087,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Shareholders Approve Director Appointment",
            "Summary": "Shree Cement Limited shareholders unanimously approved the appointment of Mr. Chandra Kumar Dhanuka as Non-Executive Independent Director through postal ballot voting concluded on December 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765791602126,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Gets ESG Score of 66 from NSE Analytics",
            "Summary": "Shree Cement Limited receives an ESG score of 66 from NSE Sustainability Ratings Analytics for FY2025, placing it in the 'Aspiring ESG rating' category through independent evaluation.",
            "Sentiment": "positive",
            "PublishDate": 1765448905783,
            "Source": "stocks"
        },
        {
            "Title": "Shree Cement Appoints Shailesh Ambastha as Chief Logistics Officer",
            "Summary": "Shree Cement has appointed Mr. Shailesh Ambastha as Chief Logistics Officer and designated him as Senior Management Person effective December 8, 2025. Ambastha, who previously held the position of President-Sales, transitions to this new role while continuing his full-time employment with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1765200257886,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shree Cement Appoints Navin Malhotra as President-Sales, Replaces Shailesh Ambastha",
            "Summary": "Shree Cement appointed Navin Malhotra as President-Sales effective December 8, 2025, replacing Shailesh Ambastha who is transitioning to a new role within the company. Malhotra brings significant cement industry experience, having previously served as Chief Sales Marketing Officer at Adani Cement.",
            "Sentiment": "neutral",
            "PublishDate": 1765194900300,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shree Cement's Head of Marketing Sushrut Pant Resigns",
            "Summary": "Sushrut Pant, Head-Marketing and Senior Management Personnel at Shree Cement Limited, resigned from his position effective November 30, 2025, to pursue opportunities outside the organization. The resignation affects the company's senior management structure as Pant was designated as a key personnel in the marketing division.",
            "Sentiment": "neutral",
            "PublishDate": 1764571128316,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shree Cement Launches New Cement Mill With 3.0 MTPA Capacity",
            "Summary": "Shree Cement has launched a cement mill with a capacity of 3.0 million tonnes per annum (MTPA). This represents an expansion of the company's manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1762937019266,
            "Source": "stock"
        },
        {
            "Title": "Shree Cement Reports 46% EBITDA Growth in Q2 with Strong UAE Performance and Premium Product Focus",
            "Summary": "Shree Cement reported quarterly results with cement sales volume up 6.8% year-on-year to 7.9 million tons. Realization per ton increased from INR 4,451 to INR 4,840, driven by premium products share rising from 15% to 21%. Total EBITDA grew 46% from INR 582 crores to INR 851 crores. EBITDA per ton increased 43% from INR 772 to INR 1,105 after adjusting for one-time impact. The company's UAE operations delivered best-ever quarterly performance with sales up 34% to 13.1 lakh tons and EBITDA increasing 158% to AED 52.53 million. Shree Cement commissioned a clinkerisation unit of 3.65 million tons at Jaitaran, Rajasthan, with cement mill of 3 million tons expected shortly. The company expanded its RMC portfolio to 24 operational plants and achieved 63% green electricity share in total consumption. Management maintained its value-over-volume strategy and passed GST rate reduction benefits from 28% to 18% to customers. The company increased interim dividend payout to INR 80 and expects capex of INR 3,000 crores for FY26-27.",
            "Sentiment": "positive",
            "PublishDate": 1762174776989,
            "Source": "earnings"
        },
        {
            "Title": "Shree Cement Delays Capacity Expansion Timeline, Projects Rs 2,450 Crore Depreciation",
            "Summary": "Shree Cement has revised its capacity expansion plans, pushing back its 80 million tonnes capacity target to FY29 due to market conditions. The company expects cement sales of 37-38 million tonnes in the current fiscal year and full-year depreciation of Rs 2,450 crores. For FY27, the company aims for 72-75 million tonnes capacity with estimated capital expenditure of Rs 3,000 crores. Additionally, Shree Cement targets establishing 40 RMC (Ready Mix Concrete) plants by FY28.",
            "Sentiment": "neutral",
            "PublishDate": 1761708572423,
            "Source": "stock"
        },
        {
            "Title": "Shree Cement Designates Kumar Ankit as Senior Management Person for Head - Legal Role",
            "Summary": "Shree Cement Limited has designated Kumar Ankit as a Senior Management Person in his role as Head - Legal, effective October 28, 2025. Ankit has been associated with the company since 2023 and heads the Legal Department. He is a Law Graduate and Qualified Company Secretary with over 16 years of experience in Corporate legal affairs and Compliance management. His term of appointment continues as existing full-time employment with the company.",
            "Sentiment": "neutral",
            "PublishDate": 1761654410940,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shree Cement Q2 Net Profit Nearly Triples to ₹277 Crore on Revenue Growth",
            "Summary": "Shree Cement reported a net profit of ₹277 crore for the second quarter, nearly three times the ₹93 crore from the same period last year, though below analyst estimates of ₹349 crore. Revenue grew 15.5% to ₹4,303 crore from ₹3,727 crore year-on-year, driven by higher volumes and focus on premium products. EBITDA increased 43.5% to ₹851.8 crore, with operating margin improving to 19.8% from 15.9%. Premium products now account for 21.1% of total trade volume, up from 14.9% previously. UAE operations showed strong performance with 50% revenue growth to AED 231.80 million. The company commissioned a 3.65 MTPA clinkerisation line in Rajasthan and added 20 MW solar capacity, bringing total green power generation to 612.5 MW. Green electricity comprises 63.15% of total consumption. Shares closed down 0.23% at ₹28,534.50.",
            "Sentiment": "positive",
            "PublishDate": 1761652845522,
            "Source": "earnings"
        },
        {
            "Title": "Shree Cement Reports Rs 188.10 Crore Quarterly Profit, Declares Rs 80 Interim Dividend",
            "Summary": "Shree Cement Limited reported a net profit of Rs 188.10 crore for the quarter ended September 30, 2025, compared to Rs 618.51 crore in the previous quarter. Revenue from operations stood at Rs 4,947.98 crore for the quarter. The company's Board of Directors declared an interim dividend of Rs 80 per equity share of Rs 10 each for Financial Year 2025-26, payable to shareholders holding shares on the record date of November 3, 2025. The dividend will be paid from November 14, 2025. During the quarter, the company transferred certain power transmission assets to Government Transmission Corporation, resulting in a one-time charge of Rs 23.68 crore under 'Other Expenses'. The company operates primarily in cement manufacturing and sales, with no separate reportable segments.",
            "Sentiment": "neutral",
            "PublishDate": 1761650232747,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Cement Commissions New 3.65 MTPA Clinkerisation Unit in Rajasthan",
            "Summary": "Shree Cement Limited commissioned a new Clinkerisation unit with a capacity of 3.65 MTPA at its Integrated Cement Plant in Tehsil Jaitaran, District Beawar, Rajasthan on September 30th, 2025. The commissioning represents an expansion of the company's cement manufacturing capacity through this new production facility.",
            "Sentiment": "positive",
            "PublishDate": 1759284248864,
            "Source": "stock"
        },
        {
            "Title": "Shree Cement Board to Consider Interim Dividend Declaration on October 28, 2025",
            "Summary": "Shree Cement Limited announced that its Board of Directors will consider declaring an interim dividend for financial year 2025-26 at their meeting on October 28, 2025. The company has set November 3, 2025 as the record date for determining shareholder eligibility for the interim dividend, if declared. The board meeting will also review unaudited standalone and consolidated financial results for the quarter and half year ending September 30, 2025. The trading window for the company's securities will remain closed from October 1, 2025 until 48 hours after the financial results announcement, up to October 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759030972569,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Cement Sees Rs. 74.29 Crore Block Trade on NSE",
            "Summary": "Shree Cement executed a block trade worth Rs. 74.29 crores on the National Stock Exchange. The transaction involved approximately 24,958 shares at a price of Rs. 29,765.00 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1758257500744,
            "Source": "order&deals"
        },
        {
            "Title": "Shree Cement Schedules Q2 Results Review for October 28",
            "Summary": "Shree Cement has announced that it will review its Q2 results on October 28. The company has set this date for the quarterly results review process.",
            "Sentiment": "neutral",
            "PublishDate": 1758005642708,
            "Source": "earnings"
        },
        {
            "Title": "Shree Digvijay Cement Promoter Divests Majority Stake to India Resurgence Fund for ₹631 Crore",
            "Summary": "True North Fund VI LLP agreed to sell up to 50.1% of its 54.6% stake in Shree Digvijay Cement to India Resurgence Fund at ₹85 per share, representing a 10% discount to the previous closing price. The transaction is valued at ₹631 crore and will be executed in two tranches. The deal triggered an open offer for an additional 26% stake from public shareholders at ₹92 per share. Separately, Shree Digvijay Cement signed a 10-year exclusive cement distribution agreement with Hi-Bond Cement worth ₹600 crore annually, requiring a ₹400 crore refundable deposit. The company also secured a call option to acquire 100% of Hi-Bond within eight years. Shree Digvijay operates a 3 MT plant in Gujarat's Jamnagar, while Hi-Bond runs a 3.2 MT unit in Rajkot. The stock closed 0.9% lower at ₹95.86 but has gained 16% over the past month.",
            "Sentiment": "positive",
            "PublishDate": 1757034302541,
            "Source": "order&deals"
        },
        {
            "Title": "Shree Digvijay Cement Denies Knowledge of Adani Group's Interest in Assets",
            "Summary": "Shree Digvijay Cement has stated that it is not aware of any interest from the Adani Group regarding the company's plant and port assets.",
            "Sentiment": "neutral",
            "PublishDate": 1756168091342,
            "Source": "stock"
        },
        {
            "Title": "Shree Cement's Income Tax Demand Reduced to ₹221.72 Crore After Rectification Order",
            "Summary": "Shree Cement's income tax demand has been decreased to ₹221.72 crore following a rectification order. The reduction indicates a favorable outcome for the company regarding its tax obligations.",
            "Sentiment": "positive",
            "PublishDate": 1755684419031,
            "Source": "stock"
        },
        {
            "Title": "Shree Cement Wins Tax Dispute as Rajasthan High Court Quashes Income Tax Reassessment Proceedings",
            "Summary": "Shree Cement Limited has won a legal challenge against the Income Tax Department's reassessment proceedings for FY 2016-17 and 2017-18. The Rajasthan High Court quashed these proceedings through an order dated August 5, 2025, which the company received from its counsel on August 11, 2025. The company had challenged the tax department's reassessment proceedings through a writ petition. Shree Cement stated there are no financial implications for the company following this court order.",
            "Sentiment": "positive",
            "PublishDate": 1755002768711,
            "Source": "stock"
        },
        {
            "Title": "Shree Cement Shareholders Approve All Resolutions at 46th AGM Including Rs 60 Final Dividend",
            "Summary": "Shree Cement Limited held its 46th Annual General Meeting on August 4, 2025, where shareholders approved all proposed resolutions with required majority. Key approvals included adoption of audited financial statements for the year ended March 31, 2025, declaration of final dividend of Rs 60 per equity share, confirmation of interim dividend of Rs 50 per share, and re-appointment of Director Neeraj Akhoury. Shareholders also approved the appointment of M/s. Pinchaa & Co. as Secretarial Auditor for five consecutive years and ratified remuneration of M/s. K. G. Goyal and Associates as Cost Auditors for the financial year ending March 31, 2026. The meeting had 26,175 shareholders on record as of the cut-off date of July 28, 2025, with voting conducted through e-voting and polling papers.",
            "Sentiment": "positive",
            "PublishDate": 1754401580243,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Cement Reports Sales Volume Below Market Estimates",
            "Summary": "Shree Cement reported sales volume of 8.95 million tonnes, which fell short of the estimated 9.60 million tonnes. The actual sales volume was approximately 6.8% lower than market expectations.",
            "Sentiment": "negative",
            "PublishDate": 1754299532600,
            "Source": "stock"
        },
        {
            "Title": "Shree Cement Reports Strong Q1 Performance with Revenue Growth and Margin Expansion",
            "Summary": "Shree Cement delivered solid quarterly results with revenue rising to 50 billion rupees from 48.4 billion rupees year-over-year. The company's EBITDA increased significantly to 14.3 billion rupees compared to 10.5 billion rupees in the same period last year. EBITDA margin expanded to 28.9% from 21.7% year-over-year. Net profit nearly doubled to 6.2 billion rupees from 3.17 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754295774335,
            "Source": "earnings"
        },
        {
            "Title": "Shree Cement Subsidiary Wins Bid for Limestone Block in Rajasthan",
            "Summary": "A subsidiary of Shree Cement has successfully won a bid for the Joga-IV Limestone Block in Rajasthan. The block covers an area of 368 hectares and is estimated to contain 2223.3 million tons of cement-grade limestone.",
            "Sentiment": "positive",
            "PublishDate": 1751291062000,
            "Source": "default"
        },
        {
            "Title": "Shree Cement: Shares Drop on ₹589 Crore Tax Demand Notice",
            "Summary": "Shree Cement shares fell 3.38% after receiving a tax demand of ₹588.65 crore for FY2021-22. The company claims there are errors in the order and expects the amount to reduce significantly upon rectification. Remedial actions are being initiated, and the company is confident of resolving the matter without material impact.",
            "Sentiment": "negative",
            "PublishDate": 1748425539000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shree Cement: Share Price Hits 52-Week High After Q4 Results",
            "Summary": "Shree Cement's share price rose over 3% to reach a 52-week high of ₹31,702 following the release of its Q4FY25 results.",
            "Sentiment": "positive",
            "PublishDate": 1747283021000,
            "Source": "result"
        },
        {
            "Title": "Shree Cement Forecasts Strong Cement Industry Growth for FY26",
            "Summary": "Shree Cement projects that the cement industry will experience a robust demand growth of 6.5-7.5% during the fiscal year 2026. This growth is expected to be driven by three main factors: ongoing infrastructure projects, recovery in rural areas, and momentum in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1747214999000,
            "Source": "default"
        },
        {
            "Title": "Shree Cement: Q4 Profit and Revenue Beat Estimates, ₹60 Dividend Declared",
            "Summary": "Shree Cement reported Q4 net profit of ₹556 crore, down 16% YoY but above estimates. Revenue increased 3% to ₹5,240 crore. EBITDA rose 4.1% to ₹1,381 crore with margin expansion. The company declared a ₹60 per share dividend. Cement and clinker sales volume reached a quarterly record of 9.84 million tonnes. Total installed cement production capacity now stands at 62.8 MTPA.",
            "Sentiment": "positive",
            "PublishDate": 1747214922000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Cement Reports Lower-Than-Expected Sales Volume",
            "Summary": "Shree Cement has reported sales volume of 9.84 million tonnes, falling short of the estimated 10 million tonnes.",
            "Sentiment": "negative",
            "PublishDate": 1747214898000,
            "Source": "result"
        },
        {
            "Title": "Shree Cement Reports Strong Q4 EBITDA Growth",
            "Summary": "Shree Cement's Q4 EBITDA increased to 15 billion rupees from 13.27 billion rupees year-over-year, exceeding estimates of 12.98 billion. The EBITDA margin improved to 29% from 26.01% last year, also surpassing expectations. However, net profit declined to 5.56 billion rupees from 6.6 billion rupees in the same period last year, though still beating estimates of 5.24 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1747214358000,
            "Source": "result"
        },
        {
            "Title": "Shree Cement Increases Clinker Production Capacity at Nawalgarh Plant",
            "Summary": "Shree Cement has announced an increase in clinker production capacity at its Nawalgarh plant to 4.50 MTPA (Million Tonnes Per Annum). The company achieved this capacity expansion through strategic investments in mining equipment and assets.",
            "Sentiment": "positive",
            "PublishDate": 1743167680000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Cement: Stock Hits 52-Week High After Nomura Upgrade",
            "Summary": "Shree Cement's stock surged 4% to ₹31,215, hitting a 52-week high after Nomura upgraded it to 'buy' from 'neutral'. Nomura raised the target price to ₹34,000, citing expected market share growth due to increased utilization in key markets. The brokerage revised volume estimates upward for FY26 and FY27, projecting 41 million tonnes and 46 million tonnes respectively.",
            "Sentiment": "positive",
            "PublishDate": 1743147091000,
            "Source": "normal_news"
        },
        {
            "Title": "Shree Cement to Consider Q4 Results on May 14",
            "Summary": "Shree Cement has announced that it will consider its fourth quarter (Q4) financial results on May 14. This indicates that the company is preparing to release its earnings report for the last quarter of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1742996906000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Cement Ltd. Sees Large Block Trade on NSE",
            "Summary": "A significant block trade occurred for Shree Cement Ltd. on the National Stock Exchange (NSE). Approximately 35,199 shares were traded at a price of Rs. 29,830.00 per share, totaling Rs. 105.00 crores in value.",
            "Sentiment": "neutral",
            "PublishDate": 1742890538000,
            "Source": "block_deals"
        },
        {
            "Title": "Shree Cement: North India Capacity Concentration to Boost Profitability",
            "Summary": "Shree Cement's 60% capacity concentration in North India is expected to significantly enhance profitability over FY25-27. Analysts project a 57% rise in net profit for FY26, outpacing competitors. The northern region is experiencing favorable supply-demand dynamics and higher cement price increases compared to other regions.",
            "Sentiment": "positive",
            "PublishDate": 1742191690000,
            "Source": "normal_news"
        }
    ]
}