{
    "Symbol": "SHREERAMA",
    "ISIN": "INE879A01019",
    "News": [
        {
            "Title": "Shree Rama Multi-Tech Q3 Net Profit Rises to ₹55M",
            "Summary": "Shree Rama Multi-Tech reported a net profit of ₹55 million in Q3, showing growth from ₹53 million in the same quarter of the previous year, reflecting steady operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770018485019,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shree Rama Multi-Tech Clarifies Price Movement",
            "Summary": "Shree Rama Multi-Tech responds to BSE inquiry on recent share price volatility, stating movements are market-driven with no company involvement or undisclosed material information.",
            "Sentiment": "neutral",
            "PublishDate": 1766387617421,
            "Source": "stocks"
        },
        {
            "Title": "ShreeRama Multi-Tech Reports Q2 Results and Appoints New CFO",
            "Summary": "ShreeRama Multi-Tech Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a net profit of Rs 737.33 lakhs for the quarter, compared to Rs 528.83 lakhs in the previous year quarter. For the half-year period, net profit increased to Rs 1,472.05 lakhs from Rs 944.54 lakhs in the corresponding previous period. Total revenue from operations for the quarter stood at Rs 9,331.35 lakhs versus Rs 5,574.60 lakhs in the prior year quarter. The company also appointed Mr. Krunal Shah as Chief Financial Officer with effect from November 13, 2025. Shah is a Chartered Accountant with over 17 years of experience in business, finance, and accounts, previously serving as CFO at Dholera Industrial City Development Limited. The auditors issued a qualified review report citing non-consolidation of accounts of wholly owned subsidiary ShreeRama (Mauritius) Limited.",
            "Sentiment": "positive",
            "PublishDate": 1763019381505,
            "Source": "earnings"
        },
        {
            "Title": "Shree Rama Multi-Tech Limited CFO Hemant Shah Resigns",
            "Summary": "Hemant Shah, Chief Financial Officer of Shree Rama Multi-Tech Limited, has resigned from his position. Shah submitted his resignation letter on August 1, 2025, and the management accepted and approved his resignation effective from the closure of business hours on October 31, 2025. The company confirmed that Shah stated there are no material reasons for his resignation. Shree Rama Multi-Tech Limited is an ISO certified company engaged in manufacturing lami-tubes, tube laminates, multilayer films, and flexible laminates.",
            "Sentiment": "neutral",
            "PublishDate": 1761910105464,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shree Rama Multi-Tech Reports Strong Q1 Performance with 234% Profit Growth",
            "Summary": "Shree Rama Multi-Tech Limited reported unaudited financial results for the quarter ended June 30, 2025. The company achieved total income of Rs. 5,684.87 lakhs compared to Rs. 4,330.80 lakhs in the same quarter last year. Net profit increased significantly to Rs. 734.72 lakhs from Rs. 219.77 lakhs in the previous year quarter. Revenue from operations grew to Rs. 5,534.96 lakhs versus Rs. 4,297.77 lakhs year-over-year. The company's board approved the 31st Annual General Meeting scheduled for September 6, 2025, via video conferencing. Remote e-voting will be available from September 3-5, 2025, with August 30, 2025 as the cut-off date for shareholder eligibility. The board also appointed M/s. Chirag Shah & Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company operates in packaging materials manufacturing as its single business segment.",
            "Sentiment": "positive",
            "PublishDate": 1754381142166,
            "Source": "earnings"
        },
        {
            "Title": "Shree Rama Multi-Tech Launches Commercial Production with New Tubing Machine",
            "Summary": "Shree Rama Multi-Tech Limited has commenced commercial production using a newly installed tubing machine. This development indicates an expansion or upgrade in the company's manufacturing capabilities, potentially enhancing its production capacity or efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1743501570000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shree Rama Multi-Tech Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Shree Rama Multi-Tech has announced its financial results for the third quarter. The company's net profit has more than doubled to 53 million rupees, compared to 21 million rupees in the same quarter last year. Revenue also saw a substantial increase, rising to 526 million rupees from 435 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738747186000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Rama Multi-Tech Reports Improved Q3 EBITDA and Margin",
            "Summary": "Shree Rama Multi-Tech has reported significant year-over-year improvements in its financial performance for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 76 million rupees, up from 36 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin expanded to 14.39% from 8.33% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738747128000,
            "Source": "earnings"
        },
        {
            "Title": "Shree Rama Multi-Tech Reports Improved Q2 EBITDA and Margin",
            "Summary": "Shree Rama Multi-Tech has announced its Q2 financial results. The company's EBITDA increased to 73 million rupees, up from 40.6 million rupees in the same quarter last year. The EBITDA margin also improved, rising to 13.90% from 9.33% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1730984733000,
            "Source": "result"
        },
        {
            "Title": "Shree Rama Multi-Tech Reports Q2 Revenue Growth",
            "Summary": "Shree Rama Multi-Tech Limited has reported a revenue of 525 million rupees for the second quarter, compared to 436 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730984723000,
            "Source": "result"
        },
        {
            "Title": "Shree Rama Multi-Tech Reports Q2 Net Profit Increase",
            "Summary": "Shree Rama Multi-Tech has reported a net profit of 52.8 million rupees for the second quarter, showing significant growth compared to both the previous year (26 million rupees) and the previous quarter (42 million rupees).",
            "Sentiment": "positive",
            "PublishDate": 1730984709000,
            "Source": "result"
        }
    ]
}