{
    "Symbol": "SHREYANIND",
    "ISIN": "INE231C01019",
    "News": [
        {
            "Title": "Shreyans Industries Board Meet on Feb 10, 2026",
            "Summary": "Shreyans Industries Limited has scheduled a board meeting on February 10, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770013520924,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shreyans Industries Reports CCI Officials Visit Delhi Office for Investigation",
            "Summary": "Officials from the Competition Commission of India (CCI) visited Shreyans Industries Limited's Delhi office on November 11, 2025, in connection with an investigation. The company has provided complete support and cooperation to the authorities throughout their investigation as part of their commitment to regulatory compliance and corporate transparency. Shreyans Industries assured compliance with all relevant regulatory requirements and committed to providing timely updates to stock exchanges regarding any further material developments on this matter.",
            "Sentiment": "neutral",
            "PublishDate": 1762974764416,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shreyans Industries Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Shreyans Industries Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 1,247.44 lakhs for the quarter. The Board of Directors approved these results in their meeting held on November 11, 2025. The company operates in the writing and printing paper segment and has only one reportable business segment. The financial results were reviewed by the Audit Committee and received an unmodified opinion from statutory auditors. The meeting commenced at 1:00 p.m. and concluded at 2:30 p.m.",
            "Sentiment": "neutral",
            "PublishDate": 1762857726527,
            "Source": "earnings"
        },
        {
            "Title": "Shreyans Industries Reports 23.6% Revenue Growth in Latest Quarterly Results",
            "Summary": "Shreyans Industries Limited's Board of Directors approved unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 15,363.37 lakhs compared to Rs 13,555.81 lakhs in the same quarter last year, marking a 13.3% increase. Total income reached Rs 16,472.95 lakhs versus Rs 14,299.32 lakhs in the previous year quarter. Net profit for the quarter stood at Rs 1,726.63 lakhs, up from Rs 1,397.01 lakhs in the corresponding quarter last year. Basic earnings per share increased to Rs 12.49 from Rs 10.11 in the same quarter of the previous year. The company's total expenses were Rs 14,244.32 lakhs. The financial results were reviewed by the Audit Committee and received an unmodified opinion from statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1754996251253,
            "Source": "earnings"
        }
    ]
}