{
    "Symbol": "SHRIRAMPPS",
    "ISIN": "INE217L01019",
    "News": [
        {
            "Title": "Shriram Properties Q3 FY26 Earnings Call Feb 14",
            "Summary": "Shriram Properties announces investor call on February 14, 2026 at 4:00 PM IST to discuss Q3 and 9M FY26 operational and financial performance with senior management participation.",
            "Sentiment": "neutral",
            "PublishDate": 1770802446586,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shriram Properties Acquires Shrivision Upscale Spaces",
            "Summary": "Shriram Properties Limited announced the acquisition of 100% equity shares of Shrivision Upscale Spaces Private Limited for ₹10 per share, making it a wholly owned subsidiary as of February 9, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770643483310,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shriram Properties Reports Strong Q2 Sales Growth Despite Regulatory Delays in Bangalore",
            "Summary": "Shriram Properties achieved 39% quarter-on-quarter growth in sales volume to 1.14 million square feet valued at INR 685 crores, but revenue recognition was impacted by BBMP division into 5 municipal corporations causing approval delays. The company expects strong H2 performance with over INR 1,000 crores revenue recognition potential from 2,800 units ready for handover as regulatory issues normalize.",
            "Sentiment": "neutral",
            "PublishDate": 1763470011411,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Properties Reports Mixed Q2FY26 Results Amid Regulatory Challenges",
            "Summary": "Shriram Properties Limited announced its quarterly results with strong operational performance but subdued financial results. The company achieved sales volumes of 1.1 million square feet (39% QoQ growth) valued at Rs. 685 crores (55% QoQ growth) in Q2FY26. For the half-year, cumulative sales reached 2.0 million square feet valued at Rs. 1,126 crores. However, financial performance was impacted by temporary deferment of revenue recognition due to delays in receiving Occupancy Certificates and eKhata processes following Greater Bengaluru Authority's regulatory transition. Total revenues for Q2FY26 stood at Rs. 229 crores (48% YoY growth), while the company reported a net loss of Rs. 8.67 crores for the quarter. The company added 5 new projects with 2.3 million square feet development potential and GDV of Rs. 2,350 crores during FY26. Management expects robust H2 performance as regulatory issues normalize, with most delayed OCs now received and eKhata processes begun. The company maintains its FY26 guidance and remains confident about achieving its 3-year strategic objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1762937777254,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Properties Reports Quarterly Loss Despite Revenue Growth",
            "Summary": "Shriram Properties reported a net loss of ₹926 lakhs for the quarter ended September 30, 2025, compared to a profit of ₹185 lakhs in the same quarter last year. Revenue from operations increased significantly to ₹6,535 lakhs from ₹1,674 lakhs year-over-year. For the six-month period, the company posted a net loss of ₹1,821 lakhs against a loss of ₹2,236 lakhs in the previous year. The company's consolidated results showed a net profit of ₹357 lakhs for the quarter versus a loss of ₹297 lakhs last year. The auditors included an emphasis of matter regarding an Enforcement Directorate search operation conducted at the company's premises in October 2024, with no formal communication received regarding findings. The company maintains there is nothing to implicate the organization or its directors in connection with the allegations.",
            "Sentiment": "neutral",
            "PublishDate": 1762936397140,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Properties Reports Q2 Net Profit of 86M Rupees, Reversing Previous Year Loss",
            "Summary": "Shriram Properties achieved a consolidated net profit of 86 million rupees in Q2, compared to a loss of 7.9 million rupees in the same period last year. The company's revenue increased to 2 billion rupees from 1.4 billion rupees year-over-year. However, EBITDA loss widened to 50 million rupees from 12.8 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1762934552045,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Properties Signs Joint Development Deal for 5-Acre Bengaluru Project Worth Over ₹350 Crores",
            "Summary": "Shriram Properties has entered into a joint development agreement for a 5-acre project in Bannerghatta, South Bengaluru. The project has a potential Gross Development Value (GDV) exceeding ₹350 crores, with the launch expected in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1762147736195,
            "Source": "stock"
        },
        {
            "Title": "Shriram Properties Gets Credit Rating Reaffirmed by Crisil",
            "Summary": "Shriram Properties announced that Crisil Ratings Limited has reaffirmed the credit rating for the company's bank loan facilities. The long-term bank facilities worth ₹263.1 crores have been rated as Crisil A-/Positive. The rating reaffirmation indicates the rating agency's assessment of the company's creditworthiness remains unchanged.",
            "Sentiment": "positive",
            "PublishDate": 1761847003355,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties Signs ₹700 Crore Joint Development Agreement in Pune",
            "Summary": "Shriram Properties has entered into a joint development agreement for a 0.7 million square feet project valued at ₹700 crore in Hinjewadi, Pune. This agreement represents the company's expansion of its presence in the Pune real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1761805450684,
            "Source": "stock"
        },
        {
            "Title": "Shriram Properties Signs Joint Development Agreement for ₹600 Crore Row Housing Project in Bengaluru",
            "Summary": "Shriram Properties Limited has signed a Joint Development Agreement for approximately 7 acres of land in Yelahanka, North Bengaluru, which is part of a larger 15-acre land parcel. The company plans to develop a premium row houses project with an estimated Gross Development Value of ₹600 crores. The project is strategically located next to the upcoming Madappanahalli Biodiversity Park, spanning 154 acres and nicknamed 'Mini Lalbagh'. The development is planned for launch in the next fiscal year and aligns with SPL's asset-light growth strategy. The project will focus on modern architecture with sustainable and nature-inspired design principles, targeting North Bengaluru's growing residential market.",
            "Sentiment": "positive",
            "PublishDate": 1761556231465,
            "Source": "stock"
        },
        {
            "Title": "Shriram Properties Acquires 6.5 Acres in North Bengaluru for ₹500 Crore Revenue Project",
            "Summary": "Shriram Properties has signed an agreement to acquire 6.5 acres of land in North Bengaluru. The project is expected to generate revenue of ₹500 crores and will offer 0.6 million square feet of saleable space. The company plans to launch the project in the next fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1757048822341,
            "Source": "stock"
        },
        {
            "Title": "Shriram Properties Reports Record Q1 FY26 Performance with 17% Sales Growth",
            "Summary": "Shriram Properties delivered its strongest first quarter performance with sales volume reaching 0.82 million square feet, up 17% year-on-year, valued at INR 441 crores. The company achieved record Q1 collections of INR 388 crores and handed over 740+ units. Revenue grew 24% to INR 262 crores with gross margins at 34% and net profit at INR 20.6 crores, up 18% year-on-year. The company successfully launched its maiden project in Pune under Codename Superstar, selling 150+ units in four weeks. Construction progress remained strong across key markets of Bangalore, Chennai, and Pune. The company added one new project in Bangalore worth INR 200 crores GDV and has 6 projects totaling 3 million square feet nearing closure. Management maintained FY26 guidance for 3,300-3,600 unit handovers and expects revenue of INR 1,250-1,300 crores. Gross debt stood at INR 567 crores with net debt-to-equity ratio of 0.28.",
            "Sentiment": "positive",
            "PublishDate": 1755604959685,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Properties Publishes Quarterly Financial Results for June 2025",
            "Summary": "Shriram Properties Limited published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025, in newspapers including Makkal Kural (Tamil), Trinity Mirror (English), and Businessline (English) on August 13-14, 2025. The financial results were reviewed by the Audit Committee and approved by the Board of Directors at their meeting on August 12, 2025. The results are available on BSE and NSE websites as well as the company's website. The company fulfilled its regulatory publication requirements under SEBI listing obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1755169824283,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Properties Reports 18% Growth in Q1 Net Profit to ₹206 Million",
            "Summary": "Shriram Properties reported consolidated net profit of ₹206 million in Q1, representing an 18% increase from ₹174 million in the same period last year. The company's revenue grew significantly to ₹2.4 billion compared to ₹1.5 billion year-over-year, marking a 60% increase. The results show strong performance across both profitability and revenue metrics for the real estate developer.",
            "Sentiment": "positive",
            "PublishDate": 1754991179523,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Properties: New Bengaluru Project Launched with ₹350 Crore Revenue Potential",
            "Summary": "Shriram Properties launched 'Codename: The One' in Bengaluru's Electronic City corridor, offering 340 residences with 5 lakh sq ft saleable area. The project, expected to be completed in three years, is located near key tech hubs and has a revenue potential of ₹350 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751615140000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties Launches 'Codename: The One' Project",
            "Summary": "Shriram Properties has announced a new project called 'Codename: The One'. The project features 340 units and has a potential revenue of ₹350 crore. It is located in an area described as an important growth area.",
            "Sentiment": "positive",
            "PublishDate": 1751611580000,
            "Source": "default"
        },
        {
            "Title": "Shriram Properties Provides Growth Projections and FY'26 Guidance",
            "Summary": "Shriram Properties has expressed confidence in adding new projects to support growth momentum beyond an 18-month period. For FY'26, the company expects to deliver 5.2-5.5 million square feet of sales, with a sales value of Rs. 3,000 - 3,300 crore, and collections of around Rs. 1,800 crore. The company met its revised guidance for FY'25. The FY'26 guidance includes expected EBITDA margins of 20% to 25% and PAT levels of 8% to 10%.",
            "Sentiment": "positive",
            "PublishDate": 1748402829000,
            "Source": "default"
        },
        {
            "Title": "Shriram Properties: Q4 Profit Doubles, Margins Expand Sharply",
            "Summary": "Shriram Properties reported a 137% increase in Q4 net profit to ₹48 crore. Revenue rose 35% to ₹407.7 crore. EBITDA margin improved to 11.95% from 3.14%. The company achieved record quarterly handovers of over 1,400 homes/plots. For FY25, net profit reached ₹77.3 crore, with total revenue at ₹973.4 crore. Net debt reduced by 26% to ₹326 crore.",
            "Sentiment": "positive",
            "PublishDate": 1748334869000,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Properties Optimistic About Medium-Term Goals and Future Outlook",
            "Summary": "Shriram Properties has stated that it is progressing well towards achieving its medium-term mission. The company has expressed a strong and encouraging outlook for the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1748333565000,
            "Source": "default"
        },
        {
            "Title": "Shriram Properties Reports Increased Q4 Revenue and Net Profit",
            "Summary": "Shriram Properties has announced its Q4 financial results. The company's revenue increased to 4.1 billion rupees from 3 billion rupees in the same quarter last year. The consolidated net profit for Q4 rose to 478 million rupees, up from 202 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1748332902000,
            "Source": "result"
        },
        {
            "Title": "SPL Acquires Premium Land in North Bengaluru for Villa Development",
            "Summary": "SPL (likely Sobha Puravankara Limited) has acquired a premium land parcel in Yelahanka, North Bengaluru. The company plans to develop row-houses or villas on this land, with an estimated Gross Development Value (GDV) of over ₹200 crores.",
            "Sentiment": "positive",
            "PublishDate": 1745397661000,
            "Source": "default"
        },
        {
            "Title": "Shriram Properties Reports Decline in Q3 Profit and Revenue",
            "Summary": "Shriram Properties has announced its Q3 financial results. The company's consolidated net profit decreased to 130 million rupees from 185 million rupees in the same quarter last year. Revenue also saw a significant decline, dropping to 1.2 billion rupees from 2.2 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739363328000,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Properties Signs JDA for Land Parcel in Chennai",
            "Summary": "Shriram Properties has signed a Joint Development Agreement (JDA) for a prime land parcel in Chennai. The project is expected to have a saleable area of 3.2 lakh square feet with a revenue potential of ₹350-400 crores.",
            "Sentiment": "positive",
            "PublishDate": 1739233212000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties Signs Joint Development Agreement for Chennai Land Parcel",
            "Summary": "Shriram Properties has entered into a Joint Development Agreement (JDA) for a prime land parcel in Chennai. The project is expected to yield 3.2 lakh square feet of saleable area with a potential revenue of ₹350-400 crores.",
            "Sentiment": "positive",
            "PublishDate": 1739188678000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties Sells 3.9 Acre Land in Chennai for Monetization",
            "Summary": "Shriram Properties has sold a 3.9-acre land parcel in Chennai as part of its strategy to monetize assets through equity divestment. This move indicates the company's efforts to generate capital or optimize its land holdings in the region.",
            "Sentiment": "neutral",
            "PublishDate": 1735603229000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties to Divest Subsidiary for Rs 93 Crore",
            "Summary": "Shriram Properties has signed a definitive agreement to sell its wholly-owned subsidiary, SPL Shelters Pvt Ltd, for an enterprise value of Rs 93 crore. The transaction is expected to be completed by January 31, 2025, with final proceeds to be received by that date.",
            "Sentiment": "positive",
            "PublishDate": 1735603223000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties to Divest Subsidiary SPL Shelters",
            "Summary": "Shriram Properties has signed a definitive agreement to sell its wholly-owned subsidiary, SPL Shelters Pvt Ltd, for an enterprise value of Rs 93 crore. The final proceeds from this divestment are expected to be received by January 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1735562695000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties Sells 3.9 Acre Land in Chennai",
            "Summary": "Shriram Properties has announced the sale of a 3.9-acre land parcel in Chennai. The company plans to monetize this land through equity divestment, indicating a strategic move to potentially raise capital or streamline its asset portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1735562690000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties: SEBI Approves Acquisition of 13.38 Lakh Shares from SPHPL",
            "Summary": "SEBI has approved Shriram Properties' acquisition of 13.38 lakh equity shares from Shriram Properties Holdings Private Limited (SPHPL). The transaction, an inter-se promoter transfer, will not alter SPL's overall shareholding structure or control. M. Murali has already acquired 531,531 shares, now holding 48.47% of SPHPL, equivalent to a 13.44% stake in SPL.",
            "Sentiment": "neutral",
            "PublishDate": 1734443998000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties: Chairperson Increases Indirect Stake to 13.44%",
            "Summary": "M Murali, chairperson of Shriram Properties, received SEBI approval to acquire 13.4 lakh shares of Shriram Properties Holdings Pvt. from Shriram Group Executive Welfare Trust. This inter-se promoter transfer increases Murali's indirect stake in Shriram Properties to 13.44%. The transaction will not change aggregate promoter holdings or impact company control.",
            "Sentiment": "neutral",
            "PublishDate": 1734371792000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Properties: SEBI Approves CMD's Indirect Acquisition",
            "Summary": "SEBI has approved Shriram Properties' CMD Murali Malayappan's indirect acquisition of 70.86% stake in Shriram Properties Holdings Private Limited (SPHPL) from Shriram Group Executives Welfare Trust. This will increase Malayappan's holding in SPHPL from 20% to 91.19%. The acquisition is exempt from open offer requirements as it doesn't change control of Shriram Properties, where promoter group stake remains at 27.94%.",
            "Sentiment": "neutral",
            "PublishDate": 1733147876000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shriram Properties Reports Q2 EBITDA Loss",
            "Summary": "Shriram Properties has reported an EBITDA loss of 12.8 million rupees in the second quarter, compared to a gain of 400 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1731582457000,
            "Source": "result"
        },
        {
            "Title": "Shriram Properties Reports Q2 Revenue Decline",
            "Summary": "Shriram Properties has announced its second quarter revenue of 1.4 billion rupees, which represents a decrease from the 2.1 billion rupees reported in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1731582243000,
            "Source": "result"
        },
        {
            "Title": "Shriram Properties Reports Q2 Net Loss",
            "Summary": "Shriram Properties has reported a consolidated net loss of 7.9 million rupees in the second quarter, compared to a profit of 201 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter, where the company had reported a profit of 174.6 million rupees.",
            "Sentiment": "negative",
            "PublishDate": 1731582207000,
            "Source": "result"
        },
        {
            "Title": "Shriram Properties: Rs 750 Crore Revenue Expected from New Pune Project",
            "Summary": "Shriram Properties has signed a joint development agreement for a six-acre land in Undri, Pune. The project will include over 650 apartments and retail/commercial spaces, totaling over 1 million sq ft. Expected revenue is Rs 700-750 crore, with launch planned for H2 FY25.",
            "Sentiment": "positive",
            "PublishDate": 1730221123000,
            "Source": "normal_news"
        },
        {
            "Title": "Shriram Properties Signs Joint Development Agreement for Prime Land in Pune",
            "Summary": "Shriram Properties has entered into a Joint Development Agreement (JDA) for a 6-acre prime land parcel in Pune. The project is estimated to have an aggregate revenue potential of approximately ₹700 - ₹750 crores.",
            "Sentiment": "positive",
            "PublishDate": 1730201107000,
            "Source": "corporate_action"
        },
        {
            "Title": "ED Conducts Search at Shriram Properties Offices",
            "Summary": "The Enforcement Directorate (ED) is conducting search activities at Shriram Properties' office premises in Bengaluru and Chennai. The company has acknowledged this development.",
            "Sentiment": "negative",
            "PublishDate": 1729817110000,
            "Source": "corporate_action"
        }
    ]
}