{
    "Symbol": "SHRIPISTON",
    "ISIN": "INE526E01018",
    "News": [
        {
            "Title": "Shriram Pistons Gets Credit Rating Upgrade to IND AA+",
            "Summary": "India Ratings upgrades Shriram Pistons & Rings' credit rating to IND AA+/Stable from IND AA, covering bank facilities worth INR 5,738.61 million and proposed NCDs of INR 10,000 million.",
            "Sentiment": "positive",
            "PublishDate": 1770907275720,
            "Source": "stocks"
        },
        {
            "Title": "Shriram Pistons Seeks Name Change to SPR Auto Technologies",
            "Summary": "Shriram Pistons & Rings Limited announces postal ballot for special resolutions including company name change to SPR Auto Technologies Limited, reflecting expanded automotive technology focus.",
            "Sentiment": "positive",
            "PublishDate": 1770691003026,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shriram Pistons Q3 Revenue Jumps 20% to ₹10.2B",
            "Summary": "Shriram Pistons & Rings reports strong Q3 performance with revenue rising 20% YoY to ₹10.2 billion and net profit growing marginally to ₹1.23 billion from ₹1.20 billion in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1770036794346,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shriram Pistons Board Meet Set for Feb 2, 2026",
            "Summary": "Shriram Pistons & Rings schedules board meeting on February 2, 2026 to consider Q3FY26 results, interim dividend, and INR 1,000 crore NCD fundraising proposal.",
            "Sentiment": "neutral",
            "PublishDate": 1769253085960,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shriram Pistons Reports Zero Physical Share Transfers",
            "Summary": "Shriram Pistons & Rings Limited reported no physical share transfer requests received or processed during December 7, 2025 to January 6, 2026 period under SEBI's re-lodgement framework.",
            "Sentiment": "neutral",
            "PublishDate": 1768203829387,
            "Source": "stocks"
        },
        {
            "Title": "Shriram Pistons Issues ₹10,000 Cr Commercial Paper",
            "Summary": "Shriram Pistons & Rings Limited successfully issued and allotted commercial papers worth ₹10,000 million on private placement basis with 6.37% coupon rate and 62-day tenure, maturing in February 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766582151965,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shriram Pistons Completes First Tranche of Asset Deal",
            "Summary": "Shriram Pistons & Rings completes first tranche of ₹28 crore asset purchase agreement, paying ₹10 crores for piston manufacturing assets from Sunbeam Lightweighting Solutions.",
            "Sentiment": "positive",
            "PublishDate": 1766130966648,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shriram Pistons Gets Credit Rating Watch with Positive Outlook",
            "Summary": "India Ratings places Shriram Pistons & Rings' long-term issuer rating on Rating Watch with Positive Implications, covering ₹4,889.20 million bank facilities and new commercial paper programme.",
            "Sentiment": "positive",
            "PublishDate": 1765975497702,
            "Source": "stocks"
        },
        {
            "Title": "Shriram Pistons Acquires Antolin India for ₹16,700 cr",
            "Summary": "Shriram Pistons & Rings Limited announces definitive agreement to acquire 100% stake in Grupo Antolin's Indian operations for EUR 159 million, expanding into automotive interior solutions.",
            "Sentiment": "positive",
            "PublishDate": 1765632497939,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shriram Pistons & Rings Acquires Three Grupo Antolin Companies for Euro 159 Million",
            "Summary": "Shriram Pistons & Rings Limited entered into a Share Purchase Agreement to acquire 100% stakes in three Grupo Antolin companies - Antolin Lighting India, Grupo Antolin India, and Grupo Antolin Chakan - at an aggregate Enterprise Value of Euro 159 Million (approximately INR 16,700 Million). The acquisition will expand SPRL's presence in automotive interior solutions including headliners, door panels, lighting systems, and other components for major OEMs, strengthening its position in the auto components industry beyond powertrain technologies.",
            "Sentiment": "positive",
            "PublishDate": 1765184838970,
            "Source": "order&deals"
        },
        {
            "Title": "Shriram Pistons & Rings Acquires 100% Stake in Grupo Antolin's Indian Operations for Rs. 16,700 Million",
            "Summary": "Shriram Pistons & Rings Limited announced a definitive agreement to acquire 100% shareholding in three Grupo Antolin companies in India for approximately Rs. 16,700 million on a debt-free, cash-free basis. The acquisition of these automotive interior solutions providers with annual revenues of Rs. 11,791 million marks SPRL's strategic diversification beyond traditional ICE powertrain components into the fast-growing automotive interiors segment.",
            "Sentiment": "positive",
            "PublishDate": 1764943068041,
            "Source": "order&deals"
        },
        {
            "Title": "Shriram Pistons Rings Reports 15% Revenue Growth Despite Auto Industry Challenges",
            "Summary": "Shriram Pistons Rings Limited achieved 14.9% year-on-year growth in consolidated total income and 14.2% growth in consolidated EBITDA for the first half of FY26. The company maintained a consolidated EBITDA margin of 22.4% and PAT margin of 13.6% during the quarter, with quarterly consolidated total income growing 15% year-on-year. The domestic automotive industry showed mixed performance with passenger vehicles declining 1% while 2-wheeler volumes registered 7% growth. GST reforms implemented from September 22, 2025 initially impacted sales mix but led to improved demand from OEMs post-implementation. The company's EV motor and controller plant at Coimbatore has completed commissioning and expects to start commercial production during the ongoing quarter. Phase 2 expansion at SEL Pithampur facility has been completed with Phase III expansion already underway due to excess customer demand. International operations remained resilient despite geopolitical headwinds, with presence across more than 45 countries. The company continues to outperform industry growth rates across all subsidiaries and product segments.",
            "Sentiment": "positive",
            "PublishDate": 1762981045125,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Pistons & Rings Reports Strong Q2 Performance with Revenue Growth and Strategic Subsidiary Investment",
            "Summary": "Shriram Pistons & Rings Limited announced its unaudited financial results for the quarter and six months ended September 30, 2025. The company reported standalone revenue from operations of Rs. 8,730 million for the quarter, compared to Rs. 7,940 million in the corresponding period of the previous year. For the six-month period, standalone revenue reached Rs. 17,086 million versus Rs. 15,552 million in the prior year. The company's profit after tax for the quarter stood at Rs. 1,339 million, with earnings per share of Rs. 30.40. During the quarter, the company invested Rs. 500 million in SPR Engenious Limited, its wholly-owned subsidiary, by subscribing to 50 million equity shares of Rs. 10 each. The consolidated results show revenue of Rs. 9,414 million for the quarter. The Board of Directors approved these results in their meeting held on November 4, 2025, with the meeting commencing at 4:00 PM and concluding at 5:00 PM.",
            "Sentiment": "positive",
            "PublishDate": 1762257204158,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Pistons & Rings Subsidiary Increases Stake in SPR EMF Innovations to 72.58%",
            "Summary": "SPR Engenious Limited, a wholly owned subsidiary of Shriram Pistons & Rings Limited, has increased its equity stake in SPR EMF Innovations Private Limited from 66.42% to 72.58%. The acquisition was completed through further issue and allotment of equity shares, with SPR Engenious now owning 1,55,71,507 equity shares in SPR EMF Innovations. This represents the latest in a series of stake increases, following previous acquisitions that brought the holding from an initial 51% to 66.42%.",
            "Sentiment": "neutral",
            "PublishDate": 1757606779421,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Pistons & Rings Reports Strong Financial Performance with Board Changes and Dividend Recommendation",
            "Summary": "Shriram Pistons & Rings Limited announced audited financial results for the quarter and year ended March 31, 2025. On standalone basis, the company reported revenue from operations of Rs 317,951 lacs for the year compared to Rs 295,372 lacs in the previous year. Net profit increased to Rs 49,780 lacs from Rs 44,678 lacs. On consolidated basis, revenue reached Rs 354,983 lacs versus Rs 308,933 lacs previously, with net profit of Rs 51,556 lacs compared to Rs 43,866 lacs. The board recommended a final dividend of Rs 10 per share (including interim dividend of Rs 5 already paid). Key board changes include resignation of independent director Shinichi Unno and appointment of Akihiro Ozaki as new independent director. The company also appointed new secretarial and cost auditors, with the 61st Annual General Meeting scheduled for August 1, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757133415586,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Pistons & Rings Reports Strong Q1 FY26 Results with 14.9% Revenue Growth",
            "Summary": "Shriram Pistons & Rings Limited delivered robust quarterly results with consolidated total income growing 14.9% year-on-year to Rs. 9,917 million. The company achieved 16.5% growth in consolidated EBITDA to Rs. 2,234 million, expanding EBITDA margins to 22.5%. Consolidated PAT increased 15.1% to Rs. 1,348 million with margins maintained at 13.6%. Standalone revenue grew 9.8%, significantly outperforming the overall automotive industry production growth of approximately 1%. The company attributed its outperformance to diversification into newer segments including marine engines, defense applications, railway engines, and lawn mower applications. Management highlighted progress in EV motors and controllers business, with a new Coimbatore facility expected to start production by end of September. The company continues to focus on expanding its multi-product franchise through strategic partnerships and potential M&A opportunities while maintaining its leading position across automotive and non-automotive segments.",
            "Sentiment": "positive",
            "PublishDate": 1754569280728,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Pistons & Rings Reports Quarterly Financial Results for Quarter Ended June 30, 2025",
            "Summary": "Shriram Pistons & Rings Limited's Board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 8,548 million compared to Rs 7,612 million in the previous quarter and Rs 8,356 million in the same quarter last year. Net profit stood at Rs 1,144 million versus Rs 1,298 million in the previous quarter and Rs 1,385 million in the corresponding quarter of the previous year. Basic earnings per share was Rs 25.95. On a consolidated basis, revenue from operations was Rs 9,633 million compared to Rs 8,371 million in the previous quarter and Rs 9,884 million in the same quarter last year. Consolidated net profit was Rs 1,349 million versus Rs 1,172 million in the previous quarter and Rs 1,515 million in the corresponding quarter last year. The company acquired 100% equity stake in Kama Intertech Private Limited for Rs 50 million on April 01, 2025, making it a wholly-owned subsidiary. The automotive component company's results were reviewed by Walker Chandiok & Co LLP as statutory auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1754043549760,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Pistons & Rings Reports Q4 Results and Dividend",
            "Summary": "Shriram Pistons & Rings has announced its Q4 financial results and dividend recommendation. The company's EBITDA for Q4 increased to 2.1 billion rupees from 1.8 billion rupees year-over-year. The EBITDA margin also improved to 21.28% from 20.69% in the same period. Additionally, the company has recommended a dividend of 10 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746625544000,
            "Source": "result"
        },
        {
            "Title": "Shriram Pistons & Rings Reports Q4 Profit and Revenue Growth",
            "Summary": "Shriram Pistons & Rings has announced its Q4 financial results. The company's consolidated net profit increased to 1.5 billion rupees, up from 1.19 billion rupees year-over-year and 1.2 billion rupees quarter-over-quarter. Revenue for Q4 rose to 9.9 billion rupees, compared to 8.56 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1746625089000,
            "Source": "result"
        },
        {
            "Title": "Shriram Pistons & Rings Completes Acquisition of Karna Intertech",
            "Summary": "Shriram Pistons & Rings Limited (SPRL) has successfully completed the acquisition of Karna Intertech. This acquisition marks a significant corporate action for SPRL, potentially expanding its business operations or market presence.",
            "Sentiment": "positive",
            "PublishDate": 1743552720000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Pistons & Rings Completes Acquisition of Karna Intertech",
            "Summary": "Shriram Pistons & Rings Limited (SPRL) has successfully completed the acquisition of Karna Intertech. This corporate action represents a significant business expansion for SPRL, potentially strengthening its market position and capabilities in the automotive components sector.",
            "Sentiment": "positive",
            "PublishDate": 1743511424000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Pistons & Rings to Acquire Karna Intertech for 50 Million Rupees",
            "Summary": "Shriram Pistons & Rings has announced its plan to acquire a 100% equity stake in Karna Intertech. The acquisition is set to cost 50 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1741357742000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Pistons Reports Q3 Profit Growth and Declares Interim Dividend",
            "Summary": "Shriram Pistons announced its Q3 financial results, reporting a consolidated net profit of 1.20 billion rupees, up from 1.07 billion rupees in the same quarter last year. The company's revenue increased to 8.48 billion rupees from 7.66 billion rupees year-over-year. Additionally, Shriram Pistons declared an interim dividend of 5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1738628074000,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Pistons Declares Interim Dividend",
            "Summary": "Shriram Pistons has announced an interim dividend of 5 rupees per share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1738586865000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Pistons Reports Q3 EBITDA and Margin Results",
            "Summary": "Shriram Pistons has reported its Q3 financial results. The company's EBITDA increased to 1.71 billion rupees from 1.61 billion rupees year-over-year. However, the EBITDA margin decreased to 20.12% from 21.06% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738586853000,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Pistons Reports Q3 Financial Results",
            "Summary": "Shriram Pistons announced its Q3 consolidated financial results. The company reported a net profit of 1.20 billion rupees, up from 1.07 billion rupees in the same quarter last year. Revenue also increased to 8.48 billion rupees from 7.66 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738586846000,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Pistons Projects Strong EBITDA Growth for FY25 and FY26",
            "Summary": "Shriram Pistons has announced projected EBITDA figures for the upcoming fiscal years. For FY25, the company expects an EBITDA of ₹7.5 billion, representing a 16.73% increase from FY2024, with an anticipated EBITDA margin of 21%. Looking further ahead to FY26, the projected EBITDA is ₹8.5 billion, indicating a 13.65% growth from FY2025, with an expected EBITDA margin of 21.78%. These projections were shared during an investor call.",
            "Sentiment": "positive",
            "PublishDate": 1735172457000,
            "Source": "earnings"
        },
        {
            "Title": "Shriram Pistons & Rings Ltd: Emkay Raises Target Price Following Strategic Acquisition",
            "Summary": "Shriram Pistons & Rings Ltd's share price hit a two-month high after Emkay Research raised its target price by 13.5% to Rs 2,950. The increase follows Shriram's acquisition of TGPEL Precision Engineering, viewed as strategically important for diversification. TGPEL specializes in precision tooling and plastic injection moulded components.",
            "Sentiment": "positive",
            "PublishDate": 1733891813000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Pistons & Rings Acquires TGPEL Precision Engineering",
            "Summary": "Shriram Pistons & Rings has acquired 100% shareholding in TGPEL Precision Engineering for 2.2 billion rupees. This acquisition represents a significant corporate action that expands Shriram Pistons & Rings' business portfolio and manufacturing capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1733822132000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Pistons & Rings Renews Technical Collaboration Agreement with Fuji Oozx",
            "Summary": "Shriram Pistons & Rings has executed a renewal of its technical collaboration agreement with Fuji Oozx. The new agreement will be effective for five years starting from December 5, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1733401276000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shriram Pistons & Rings Reports Q2 Financial Results",
            "Summary": "Shriram Pistons & Rings announced its Q2 financial results. The company's EBITDA increased to 1.78 billion rupees from 1.58 billion rupees year-over-year. However, the EBITDA margin decreased slightly to 20.3% from 20.97% in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1730133993000,
            "Source": "result"
        },
        {
            "Title": "Shriram Pistons & Rings Reports Q2 Revenue Growth",
            "Summary": "Shriram Pistons & Rings has reported a revenue of 8.77 billion rupees for the second quarter, compared to 7.52 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730133984000,
            "Source": "result"
        },
        {
            "Title": "Shriram Pistons & Rings Reports Q2 Profit Increase",
            "Summary": "Shriram Pistons & Rings announced its Q2 consolidated net profit of 1.25 billion rupees, showing an increase from 1.14 billion rupees year-over-year. The profit also rose from 1.15 billion rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730133977000,
            "Source": "result"
        }
    ]
}