{
    "Symbol": "SHYAMMETL",
    "ISIN": "INE810G01011",
    "News": [
        {
            "Title": "Shyam Metalics Seeks Shareholder Approval for New Director",
            "Summary": "Shyam Metalics and Energy Limited issues postal ballot notice for appointment of Mr. Subrata Bhattacharya as Independent Director for 5-year term from February 1, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770809291135,
            "Source": "stocks"
        },
        {
            "Title": "Shyam Metalics Reports 5.36% Drop in January Steel Sales",
            "Summary": "Shyam Metalics And Energy experienced a decline in stainless steel sales during January, with volumes dropping by 5.36% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1770187911457,
            "Source": "stocks"
        },
        {
            "Title": "Shyam Metalics schedules investor meetings Feb 9-10",
            "Summary": "Shyam Metalics and Energy Limited announces scheduled analyst and institutional investor meetings at Systematix and Nuvama conferences in Mumbai on February 9-10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770125849260,
            "Source": "stocks"
        },
        {
            "Title": "Shyam Metalics Q3 Revenue Jumps 17.7% to ₹44.2B",
            "Summary": "Shyam Metalics & Energy reported Q3 consolidated revenue of ₹44.2 billion, up 17.7% YoY, while net profit remained flat at ₹1.97 billion compared to ₹1.98 billion in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1769252563005,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shyam Metalics Schedules Q3FY26 Earnings Call",
            "Summary": "Shyam Metalics & Energy Limited announces conference call with investors and analysts on January 27, 2026 at 4:00 PM IST to discuss Q3FY26 and nine-month financial results ending December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768886453823,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shyam Metalics Auditor Firm Converts to LLP Structure",
            "Summary": "Shyam Metalics and Energy Limited announces conversion of statutory auditor M S K A & Associates into LLP format effective January 13, 2026, with no impact on ongoing audit services.",
            "Sentiment": "neutral",
            "PublishDate": 1768473219120,
            "Source": "stocks"
        },
        {
            "Title": "Shyam Metalics Block Trade Worth ₹18.05 Crores",
            "Summary": "Shyam Metalics and Energy Ltd. witnessed a significant block trade on NSE involving 222,053 shares at ₹812.75 per share, totaling ₹18.05 crores in transaction value.",
            "Sentiment": "neutral",
            "PublishDate": 1768298185233,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shyam Metalics Gets ESG Rating of 55 from NSE",
            "Summary": "Shyam Metalics and Energy Limited receives voluntary ESG rating of 55 from NSE Sustainability Ratings based on FY25 data, disclosed under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767875908161,
            "Source": "stocks"
        },
        {
            "Title": "Shyam Metalics Q3 volumes mixed, stainless steel up 19%",
            "Summary": "Shyam Metalics reports 19% YoY growth in December stainless steel volumes to 9,393 tonnes with improved realisations, though Q3 sequential volumes declined 10%. Mixed performance across segments.",
            "Sentiment": "neutral",
            "PublishDate": 1767683233073,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shyam Metalics Reports Mixed Product Sales Performance",
            "Summary": "Shyam Metalics And Energy shows varied product performance with stainless steel sales up 19.07% YoY, specialty alloys surging 50.05%, while aluminium foil and carbon steel sales decline.",
            "Sentiment": "neutral",
            "PublishDate": 1767676895777,
            "Source": "stocks"
        },
        {
            "Title": "Shyam Metalics Starts New 0.45 MTPA Blast Furnace",
            "Summary": "Shyam Metalics subsidiary RIL commenced commercial production at its modern blast furnace with 0.45 MTPA capacity and zero water discharge design on December 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1767074472965,
            "Source": "stocks"
        },
        {
            "Title": "Shyam Metalics Schedules Investor Meet Dec 18-19",
            "Summary": "Shyam Metalics and Energy Limited announces institutional investor meeting at West Bengal plants on December 18-19, 2025, focusing on publicly available information only.",
            "Sentiment": "neutral",
            "PublishDate": 1765786172415,
            "Source": "stocks"
        },
        {
            "Title": "Shyam Metalics Reports Mixed November 2025 Sales Performance Across Product Lines",
            "Summary": "Shyam Metalics And Energy reported November 2025 sales results showing varied performance across its product portfolio, with pellet sales surging 131.06% YoY and specialty alloys rising 19.64% YoY. The company experienced declines in sponge iron sales (7.65% YoY), aluminium foil sales (4.58% YoY), and HR tube sales (7.95% MoM), while stainless steel sales grew 7.48% YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1764927537998,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Seeks Shareholder Approval for Director Re-appointment and Remuneration Revisions",
            "Summary": "Shyam Metalics and Energy Limited has issued a postal ballot notice seeking shareholder approval for re-appointing Ms. Rajni Mishra as Independent Director for a second 5-year term and revising remuneration for two Whole-Time Directors. The e-voting period runs from November 24, 2025 to December 23, 2025, with proposed salary increases for Mr. Sheetij Agarwal (Rs. 2-5 crores annually) and Mr. Dev Kumar Tiwari (Rs. 50 lakhs to Rs. 1.5 crores annually).",
            "Sentiment": "neutral",
            "PublishDate": 1763727871917,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shyam Metalics Reports 23% Revenue Growth to INR 4,457 Crores in Q2 FY26",
            "Summary": "Shyam Metalics and Energy Limited delivered strong quarterly results with revenue growing 23% year-on-year to INR 4,457 crores and EBITDA increasing 32% to INR 609 crores, driven by 24% volume growth and enhanced value-added product mix. The company discontinued its DI pipe project due to technological shifts while progressing with its INR 9,425 crore capex program, with CRISIL upgrading its long-term rating to AA stable reflecting strong financial discipline.",
            "Sentiment": "positive",
            "PublishDate": 1763042971047,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Metalics Acquires 26% Stake in Emerge Green Power for Solar Energy Supply",
            "Summary": "Shyam Metalics and Energy Limited has signed a Solar Power Purchase Agreement with Emerge Green Power Private Limited (EGPPL) and acquired a 26% equity stake in the company for ₹75.01 lakh. Under the agreement, EGPPL will supply solar power to Shyam Metalics as a captive generator. The company subscribed to 26,000 equity shares at ₹288.51 per share (face value ₹10 plus premium of ₹278.51). EGPPL, incorporated in February 2025, is yet to commence business operations and will become an associate company of Shyam Metalics. The acquisition aims to reduce energy costs, lower dependence on grid power, improve EBITDA margins, and support environmental goals through renewable energy usage. The transaction is expected to be completed by May 11, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1762891961685,
            "Source": "corporate_action"
        },
        {
            "Title": "Shyam Metalics And Energy Signs Solar Power Deal With EGPPL Worth 7.5 Million Rupees",
            "Summary": "Shyam Metalics And Energy has entered into a solar power agreement with EGPPL valued at 7.5 million rupees. The deal represents the company's engagement in renewable energy arrangements.",
            "Sentiment": "positive",
            "PublishDate": 1762864851925,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Reports Mixed October 2025 Sales Performance Across Product Lines",
            "Summary": "Shyam Metalics And Energy reported mixed sales results for October 2025. The company experienced declines in stainless steel sales by 2.47% year-over-year and aluminium foil sales by 11.59% year-over-year. However, pellet sales showed strong growth of 43.13% year-over-year, while CR coil sales surged dramatically by 1851.54% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1762849444859,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Reports Quarterly Results, Credit Rating Upgraded to AA+ by CRISIL",
            "Summary": "Shyam Metalics and Energy Limited's Board approved unaudited financial results for the second quarter and half year ended September 30, 2025. The company reported consolidated revenue from operations of ₹4,457.02 crores for the quarter and ₹8,875.86 crores for the half year. Net profit after tax stood at ₹260.45 crores for the quarter and ₹351.12 crores for the half year. CRISIL upgraded the company's credit rating from AA (Positive) to AA+ (Stable), citing strong financial position and prudent capital management. The Board also approved the re-appointment of Ms. Rajni Mishra as Independent Director for a second five-year term from February 12, 2026 to February 11, 2031, subject to shareholder approval. A postal ballot notice was approved to seek member approval for the director's re-appointment and revision in remuneration of whole-time directors.",
            "Sentiment": "positive",
            "PublishDate": 1762501667280,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Metalics Reports 23% Revenue Growth in Q2",
            "Summary": "Shyam Metalics reported quarterly revenue of 44.6 billion rupees compared to 36.3 billion rupees in the same period last year, representing a year-over-year increase of approximately 23%.",
            "Sentiment": "positive",
            "PublishDate": 1762501202660,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Metalics and Energy Reports Higher Q2 EBITDA and Margin",
            "Summary": "Shyam Metalics and Energy reported Q2 EBITDA of 6.1 billion rupees compared to 4.8 billion rupees in the same period last year. The company's EBITDA margin improved to 13.65% from 13.24% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762500769272,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Metalics Reports 21% Growth in Q2 Consolidated Net Profit",
            "Summary": "Shyam Metalics and Energy reported a consolidated net profit of 2.6 billion rupees for Q2, representing a year-over-year increase from 2.15 billion rupees in the same quarter last year. This marks a growth of approximately 21% in quarterly profit for the metals and energy company.",
            "Sentiment": "positive",
            "PublishDate": 1762500322626,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Metalics Credit Rating Upgraded to CRISIL AA-/Stable on Strong Financial Profile",
            "Summary": "CRISIL Ratings upgraded Shyam Metalics and Energy Limited's long-term credit rating to CRISIL AA-/Stable from CRISIL AA-/Positive, while reaffirming short-term and commercial paper ratings at CRISIL A1. The upgrade covers total bank loan facilities of Rs 3,600 crore. The rating reflects the company's strong financial profile, prudent capital structure, robust liquidity, operational efficiencies, and consistent business growth. The company reported consolidated EBITDA of Rs 1,868 crore with EBITDA per tonne of Rs 4,797. CRISIL expects blended consolidated EBITDA per tonne to increase to more than Rs 5,000. The company maintains strong financial metrics with total outside liabilities to tangible net worth ratio of 0.45 times and interest coverage ratio of over 14 times. The group plans capital expenditure of Rs 6,500-7,000 crore over the next three years, to be funded through internal accruals.",
            "Sentiment": "positive",
            "PublishDate": 1762419723574,
            "Source": "corporate_action"
        },
        {
            "Title": "Shyam Metalics Unit Acquires Complete Ownership of Star Metalworks",
            "Summary": "A subsidiary of Shyam Metalics And Energy has acquired full ownership of Star Metalworks. The acquisition represents a complete takeover of the company by Shyam Metalics' unit.",
            "Sentiment": "positive",
            "PublishDate": 1761737015211,
            "Source": "order&deals"
        },
        {
            "Title": "Ramsarup Industries Plans ₹369 Crore Investment in New Blast Furnace and Sinter Plant",
            "Summary": "Ramsarup Industries plans to launch a new blast furnace and linear sinter plant with an investment of ₹369 crore. The production from these facilities is expected to begin by November 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761725752483,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Employees Exercise 57,900 Stock Options Worth ₹12.8 Crore",
            "Summary": "Shyam Metalics and Energy Limited announced that eligible employees exercised 57,900 stock options on October 24, 2025, under the SMEL Loyalty ESOP Scheme (ESOP II - 2023). The options were exercised at ₹221 per share, representing a 50% discount to the market price on the grant date of September 27, 2023. The exercise generated ₹12.8 crore for the company. These options were part of 2,16,000 total options granted to 5 eligible employees, with vesting occurring over three years - 40% after the first anniversary and 30% each after the second and third anniversaries. The 57,900 options that vested on September 27, 2025, represented the second-year vesting tranche and were exercised within the permitted 6-month exercise window.",
            "Sentiment": "positive",
            "PublishDate": 1761296950730,
            "Source": "corporate_action"
        },
        {
            "Title": "Shyam Metalics Announces Vision 2031 with 2.5x Revenue Growth Target to ₹400bn",
            "Summary": "Shyam Metalics and Energy Limited unveiled its Vision 2031 strategy targeting 2.5x revenue growth to ₹400 billion by 2031. The company plans ₹100 billion in capital expenditure, primarily funded through internal accruals, to expand aggregate capacity from 15 million tons to 27 million tons covering intermediate and finished products. The expansion will focus on downstream and high value-added segments including specialty steel, stainless steel, flat products, and aluminum through brownfield expansions across West Bengal, Odisha, and Madhya Pradesh. SMEL expects EBITDA margin improvement of 200-300 basis points post expansion and aims to double export revenues from $150 million to $300 million. The growth program is projected to create over 10,000 new direct and indirect jobs, bringing total employment to around 27,500. The company recently secured iron ore mining assets in Maharashtra and will leverage European technology partnerships for product development. Chairman & Managing Director Brij Bhushan Agarwal emphasized the strategy reflects confidence in India's long-term growth story and aims to deliver sustainable growth and stronger shareholder value.",
            "Sentiment": "positive",
            "PublishDate": 1760602323313,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Commences Phase I of Greenfield Cold Rolling Mill in West Bengal",
            "Summary": "Shyam Metalics and Energy Limited has commenced Phase I of its greenfield cold rolling mill at the Jamuria plant in West Bengal. The facility began trial runs in September 2024 under Shyam Metalics Flat Products Pvt Ltd., a wholly owned step-down subsidiary. The new Cold Rolling Mill has a total capacity of 400,000 tons annually with a total capital cost of ₹603 crores, of which ₹346 crores has been invested and ₹257 crores remains pending. The mill will produce pre-painted galvalume coils (PPGL) and galvanized iron/galvanized steel coils (GI/GL). Vice Chairman and Managing Director Brij Bhushan Aggarwal stated the company aims to achieve optimal utilization within two years, expecting the facility to contribute 8% to 10% of company revenue and EBITDA. The facility is strategically located in eastern India to address the region's shortage of colour-coated sheet manufacturing units and will support housing, warehousing, and industrial applications including affordable housing initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1760601063356,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Reports Mixed Performance with Sponge Iron Decline and Specialty Alloys Growth",
            "Summary": "Shyam Metalics reported a 27.66% drop in sponge iron volumes and a 2.93% decrease in realization on a quarterly basis. However, the company showed positive momentum in specialty alloys with a 17.53% rise in sales and 11.97% growth in volume on a month-over-month basis.",
            "Sentiment": "neutral",
            "PublishDate": 1759817502499,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Shows Mixed Performance Across Product Segments",
            "Summary": "Shyam Metalics reported varied performance across its product lines. The company saw a 20.77% increase in CR Coil/Sheets volumes with a 1.22% rise in realization on a quarterly basis. However, overall sales volume dropped 12.20% compared to the previous month, though realizations increased 1.11%. The HR Tube/Pipe segment experienced challenges with volumes declining 30.15% and realizations falling 5.84% compared to the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1759817075653,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Enters Crash Barrier Manufacturing with ₹100 Crore Investment",
            "Summary": "Shyam Metalics has launched crash barrier manufacturing operations at its Giridih facility with 24,000 MTPA capacity and over 150 employees. The company targets 8-10% market share in FY 2025-26. A new ₹50 crore facility in Sambalpur with 60,000 MTPA capacity is planned to serve South and West markets. Phase 2 expansion at Giridih will add ₹50 crore investment in FY 2026-27 for transmission line towers, railway electrification structures, and solar panel structures. Chairman Brij Bhushan Agarwal stated the crash barrier business could add 50% more value to Giridih operations. The company currently serves Indian Railways and National Highways projects and plans to explore exports to Middle East, Europe, and Africa. Shares closed 1.09% lower at ₹920.05 but have gained 24% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1757558391127,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Enters Crash Barrier Manufacturing Business",
            "Summary": "Shyam Metalics has entered the crash barrier manufacturing sector focusing on road and rail safety applications. The company has set a target to capture 8-10% market share in FY 2025-26.",
            "Sentiment": "positive",
            "PublishDate": 1757508626500,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Reports Mixed August 2025 Sales Performance Across Product Segments",
            "Summary": "Shyam Metalics and Energy Limited released consolidated sales figures for August 2025. The company showed mixed performance across product segments. Pellet sales surged 216.17% year-over-year to 1,37,392 MT with realizations up 13.87%. Stainless steel volumes increased 32.83% year-over-year to 9,378 MT, though realizations dropped 15.96%. Sponge iron sales declined 34.51% year-over-year to 56,575 MT with realizations down 1.60%. Specialty alloys volumes fell 17.28% year-over-year to 14,849 MT with realizations decreasing 5.51%. Carbon steel volumes dropped slightly 2.14% year-over-year to 1,39,057 MT. The company's newer segments showed growth - Pig Iron sales reached 67,780 MT with 20.85% month-over-month increase, while HR Tube/Pipe volumes jumped 381.16% month-over-month to 332 MT. The company implemented blast furnace and color coated plants at its Jamuria location in November 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1757067513677,
            "Source": "stock"
        },
        {
            "Title": "Shyam Sel and Power Limited Acquires 26% Stake in Emerge Solar Projects for ₹25 Lakh",
            "Summary": "Shyam Sel and Power Limited, a material wholly-owned subsidiary of Shyam Metalics and Energy Limited, has acquired 26% equity stake in Emerge Solar Projects Private Limited for ₹25,00,004. The acquisition involved allotment of 2,600 equity shares at ₹10 face value with ₹951.54 premium per share. This strategic investment enables SSPL to qualify as a captive user under the Electricity Act, 2003, allowing access to preferential tariffs and reducing overall energy costs. Emerge Solar Projects is an Indian company incorporated in March 2024 with the objective to setup solar power generation units and has not yet commenced business operations. The acquisition aims to reduce dependence on grid power, lower energy costs, improve EBITDA margins, and support environmental goals through increased usage of renewable energy for SSPL's energy-intensive industrial operations.",
            "Sentiment": "positive",
            "PublishDate": 1755177255130,
            "Source": "corporate_action"
        },
        {
            "Title": "Shyam Metalics Reports Mixed Performance Across Product Lines in July 2025 Sales",
            "Summary": "Shyam Metalics and Energy Limited released its consolidated sales report for July 2025. The company showed strong volume growth in stainless steel (42.16% year-over-year), specialty alloys (13.12% YoY), and carbon steel (5.69% YoY). Aluminium foil volumes increased 9.13% YoY with realizations also up 9.51%. However, pellet sales declined 15.10% YoY and sponge iron dropped 19.66% YoY. The company's new blast furnace plant at Jamuria location, implemented in November 2024, enabled pig iron sales of 56,085 MT with a 50.64% month-over-month increase. The color-coated plant also began commercial operations, producing CR coils/sheets with 10.15% monthly volume growth. Overall, the company demonstrated mixed performance with growth in premium products offset by declines in basic materials.",
            "Sentiment": "neutral",
            "PublishDate": 1754379230466,
            "Source": "stock"
        },
        {
            "Title": "Shyam Metalics Reports 22% Revenue Growth and 19% EBITDA Rise in Q1 FY26",
            "Summary": "Shyam Metalics and Energy Limited delivered strong quarterly performance with revenue growth of 22% year-on-year to Rs. 4,490 crores and operating EBITDA rising 19% to Rs. 580 crores (13.12% margin). Volume growth was notable at 32% year-on-year. The company's newly commissioned blast furnace achieved 104% utilization while the color-coated unit reached 70% utilization. Profit after tax stood at Rs. 291 crores, up 5.3% year-on-year. The company has spent Rs. 7,003 crores on capital expenditure, representing 70% of total planned CAPEX, with Rs. 4,900 crores capitalized. Most carbon steel CAPEX is expected to be operational by FY26, while stainless steel and aluminum projects are targeted for FY27 commissioning. The company declared an interim dividend of Rs. 1.8 per share and approved enabling resolutions for fundraising up to Rs. 7,500 crores. Management expects to maintain annual CAGR of around 15% and anticipates EBITDA margins to sustain between 11-13% despite ongoing geopolitical challenges.",
            "Sentiment": "positive",
            "PublishDate": 1753706361185,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Metalics Declares Rs 1.80 Interim Dividend, Approves Rs 4,500 Crore Fundraising Plan",
            "Summary": "Shyam Metalics and Energy Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing consolidated revenue from operations of Rs 4,418.84 crore and profit after tax of Rs 290.67 crore. The company declared an interim dividend of Rs 1.80 per equity share (18% of face value) with record date set for July 28, 2025. The Board approved fundraising plans up to Rs 4,500 crore through various instruments including equity shares, convertible securities, and private placements. Additionally, the company approved issuance of Non-Convertible Debentures up to Rs 3,000 crore and scheduled its 23rd Annual General Meeting for August 26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753177716350,
            "Source": "corporate_action"
        },
        {
            "Title": "Shyam Metalics Reports Higher Q1 Profit and Revenue, Board Approves ₹4,500 Crore Fundraising",
            "Summary": "Shyam Metalics and Energy reported Q1 consolidated net profit of ₹2.9 billion compared to ₹2.76 billion in the previous year. The company's quarterly revenue increased to ₹44.2 billion from ₹36.11 billion year-over-year. EBITDA rose to ₹6.3 billion from ₹5.4 billion, though EBITDA margin declined slightly to 14.33% from 14.9%. The board has approved raising ₹4,500 crores through the issuance of different securities.",
            "Sentiment": "positive",
            "PublishDate": 1753177284695,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Metalics Reports Significant Growth in Product Volumes",
            "Summary": "Shyam Metalics has reported substantial growth in various product segments. Color-coated Cr Coils/sheets volumes nearly doubled year-over-year to 31,604 MT, also showing a 93% increase quarter-on-quarter. HR Tubes/pipes, produced from slitted HR coil scrap, saw a 152% quarter-on-quarter increase to 1,005 MT, accompanied by a 7% rise in average price. Aluminium-foil sales increased by 52% year-over-year to 4,783 MT.",
            "Sentiment": "positive",
            "PublishDate": 1751846844000,
            "Source": "default"
        },
        {
            "Title": "Shyam Metalics and Energy Ltd: Q1 Update Shows Mixed Performance",
            "Summary": "Shyam Metalics reported an 18% QoQ decline in stainless steel sales volume to 19,813 tonnes for Q1 FY26, but average realisation increased 8% to ₹1.38 lakh per tonne. Aluminium foil sales volume decreased 3% QoQ to 5,440 tonnes, with a 4% rise in average realisation to ₹3.65 lakh per tonne.",
            "Sentiment": "neutral",
            "PublishDate": 1751723381000,
            "Source": "result"
        },
        {
            "Title": "Shyam Metalics Reports Significant Growth in Metal Product Volumes",
            "Summary": "Shyam Metalics has reported substantial growth in two key product categories. The company's colour-coated CR coils/sheets volumes increased by 93% compared to the previous quarter, reaching 31,604 MT. Additionally, HR tubes/pipes volumes saw a 152% quarter-on-quarter increase to 1,005 MT, with the average price rising by 7%. The company also mentioned aluminium in their report, but no specific details were provided.",
            "Sentiment": "positive",
            "PublishDate": 1751709912000,
            "Source": "default"
        },
        {
            "Title": "Shyam Metalics and Energy Ltd: Stainless Steel Sales Grow, Aluminium Foil Stable in May",
            "Summary": "Shyam Metalics reported a year-on-year increase in stainless steel sales for May 2025, despite a 2% sequential decline to 6,999 tonnes. Aluminium foil sales rose 32% month-on-month and 1% year-on-year to 2,082 metric tonnes. Stainless steel price realisations slightly decreased year-on-year but improved month-on-month, while aluminium foil prices increased year-on-year but marginally decreased month-on-month.",
            "Sentiment": "positive",
            "PublishDate": 1749122807000,
            "Source": "normal_news"
        },
        {
            "Title": "Shyam Metalics Reports 41% Increase in Stainless Steel Sales Volume for May",
            "Summary": "Shyam Metalics has reported a 41% year-over-year increase in stainless steel sales volume for May. However, the company also experienced a slight decline of 0.2% year-over-year in realisations.",
            "Sentiment": "positive",
            "PublishDate": 1749117360000,
            "Source": "default"
        },
        {
            "Title": "Shyam Metalics and Energy Ltd: Enters Wagon Manufacturing with New Facility",
            "Summary": "Shyam Metalics is entering the wagon manufacturing segment with a new greenfield facility in Kharagpur, West Bengal. The plant, developed under subsidiary Ramsarup Industries Ltd, will start operations by March 2026. It will have an initial capacity of 2,400 wagons per annum, expanding to 4,800 wagons annually in Phase II. The facility will produce various types of wagons and feature rooftop solar installations.",
            "Sentiment": "positive",
            "PublishDate": 1747732618000,
            "Source": "corporate_action"
        },
        {
            "Title": "Shyam Metalics to Enter Wagon Manufacturing at Kharagpur Plant",
            "Summary": "Shyam Metalics and Energy has announced plans to expand into wagon manufacturing at their Kharagpur plant in West Bengal. The company will establish a new greenfield facility capable of producing 4,800 wagons annually. This state-of-the-art facility aims to enhance efficiency through sustainable design and indigenous technology.",
            "Sentiment": "positive",
            "PublishDate": 1747656689000,
            "Source": "default"
        },
        {
            "Title": "Shyam Metalics Q4 Results: Revenue and EBITDA Up, Dividend Declared",
            "Summary": "Shyam Metalics and Energy reported Q4 FY23 results with revenue of 41.4B rupees, up from 36.1B YoY. EBITDA increased to 5.7B rupees from 4.9B YoY, with EBITDA margin slightly improving to 13.75% from 13.66%. Consolidated net profit rose marginally to 2.19B rupees from 2.17B YoY. The company declared a dividend of 2.25 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1746776077000,
            "Source": "result"
        },
        {
            "Title": "Shyam Metalics and Energy Reports Strong Growth in Stainless Steel Segment",
            "Summary": "Shyam Metalics and Energy has reported significant growth in its stainless steel business for Q4. The company saw a 66% increase in volume compared to the previous full year, along with a 17% increase in realizations on a yearly basis. This growth is attributed to the company's focus on producing higher value products. On a quarterly basis, volumes increased by 18%, while realizations remained stable.",
            "Sentiment": "positive",
            "PublishDate": 1744119693000,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Metalics and Energy Reports Growth in Aluminium Foil Business",
            "Summary": "Shyam Metalics and Energy has released its Q4 business update for the aluminium foil segment. The company reported a 27% increase in volume on a full-year basis, with realizations up by 6%. For the quarter, volumes increased by 3% while realizations saw a slight uptick of 1%.",
            "Sentiment": "positive",
            "PublishDate": 1744119674000,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Metalics & Energy Ltd: Potential Gains from India's Trade Restrictions on China",
            "Summary": "Shyam Metalics & Energy Ltd. shares have risen 22% in the past month due to two trade restrictions by India. The company could benefit from an anti-dumping duty on Chinese aluminium foil and a potential 12% safeguard duty on certain steel imports from China and Vietnam. The aluminium foil duty could generate additional EBITDA of Rs 100-125 crore over two years. The steel safeguard duty may improve EBITDA per tonne in the color-coated sheets business.",
            "Sentiment": "positive",
            "PublishDate": 1742877435000,
            "Source": "normal_news"
        },
        {
            "Title": "Shyam Metalics and Energy Ltd: Anti-Dumping Duty Boosts Outlook, UBS Raises Target",
            "Summary": "UBS increased its price target for Shyam Metalics to Rs 1,175, the highest among analysts, due to India's new anti-dumping duty on Chinese aluminium foil. The duty is expected to add Rs 1-1.25 billion to Shyam Metalics' Ebitda over two years. The company is expanding its aluminium foil and color-coated steel capacities, with ongoing projects including an oxygen plant and captive power plant.",
            "Sentiment": "positive",
            "PublishDate": 1742821321000,
            "Source": "normal_news"
        }
    ]
}