{
    "Symbol": "SHYAMCENT",
    "ISIN": "INE979R01011",
    "News": [
        {
            "Title": "Shyam Century Ferrous Shareholders Approve Asset Disposal",
            "Summary": "Shyam Century Ferrous Limited shareholders approved the disposal of substantially whole assets through postal ballot with 99.97% votes in favour. The resolution was passed with requisite majority on February 9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770740006863,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shyam Century Ferrous Q3FY26 Loss Widens to ₹613.83 Lakhs",
            "Summary": "Shyam Century Ferrous reported a net loss of ₹613.83 lakhs for Q3FY26 compared to ₹6.33 lakhs profit in Q3FY25. Revenue declined 97.44% YoY to ₹83.69 lakhs amid plant closure since May 2025.",
            "Sentiment": "negative",
            "PublishDate": 1770377667265,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shyam Century Ferrous Board Approves Asset Disposal Plan",
            "Summary": "Shyam Century Ferrous Limited's board has given in-principle approval to dispose of substantially all company assets including plant & machinery, and authorized postal ballot for shareholder approval under Regulation 37A.",
            "Sentiment": "neutral",
            "PublishDate": 1767793732281,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mahabir Prasad Agarwal Group Reduces Stake in Shyam Century Ferrous Limited",
            "Summary": "Mahabir Prasad Agarwal and persons acting in concert reduced their combined shareholding in Shyam Century Ferrous Limited from 19.213% to 18.551% through open market transactions. The group sold 14,03,952 shares (0.661% stake) between November 25-26, 2025, affecting their position as significant shareholders in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1764332338478,
            "Source": "corporate_action"
        },
        {
            "Title": "Shyam Century Ferrous Reports Loss as Plant Operations Cease Due to Power Tariff Hikes",
            "Summary": "Shyam Century Ferrous Limited reported a net loss of ₹328.29 lakhs for the second quarter ended September 30, 2025, compared to a loss of ₹636.84 lakhs in the same period last year. The company ceased operations at its plant in Byrnihat, Meghalaya from May 7, 2025 due to significant increases in power tariffs making operations economically unviable. Total income dropped to ₹1,019.70 lakhs from ₹1,333.27 lakhs year-over-year. The Board approved the quarterly results and management is evaluating restructuring and revival measures to restore plant viability. The company is primarily engaged in manufacturing and selling ferrosilicon.",
            "Sentiment": "negative",
            "PublishDate": 1762255905024,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Century Ferrous Limited Announces Key Appointments at Annual General Meeting",
            "Summary": "Shyam Century Ferrous Limited shareholders approved several key appointments at their 14th Annual General Meeting held on September 23, 2025. The company appointed Mr. Ghanshyam Agarwal as a Non-Executive Director and reappointed Mr. Nirmalya Bhattacharyya as an Independent Director for a second five-year term from April 1, 2026 to March 31, 2031. Additionally, M/s. MKB & Associates was appointed as Secretarial Auditors for a five-year term covering financial years 2025-26 through 2029-30.",
            "Sentiment": "neutral",
            "PublishDate": 1758628378554,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shyam Century Ferrous Appoints New Non-Executive Director and Re-appoints Independent Director",
            "Summary": "Shyam Century Ferrous Limited's Board of Directors appointed Mr. Ghanshyam Agarwal as an Additional Director in Non-Executive category effective August 8, 2025, and re-appointed Mr. Nirmalya Bhattacharyya as an Independent Director for a five-year term from April 1, 2026 to March 31, 2031. Both appointments are subject to shareholder approval at the upcoming Annual General Meeting. Mr. Agarwal, aged 50, holds a Bachelor's degree in Commerce and has 29 years of experience in accounts, finance and capital markets. Mr. Bhattacharyya's present term expires on March 31, 2026. The company confirmed that neither director is related to any existing directors and both are not debarred from holding directorial positions.",
            "Sentiment": "neutral",
            "PublishDate": 1754652989269,
            "Source": "corporate_governance"
        },
        {
            "Title": "Shyam Century Ferrous Reports Net Loss of ₹402.80 Lakhs in Q1 FY2026, Plant Operations Ceased Due to Power Tariff Hikes",
            "Summary": "Shyam Century Ferrous Limited reported a net loss of ₹402.80 lakhs for the quarter ended June 30, 2025, compared to a net loss of ₹270.05 lakhs in the same period last year. Revenue from operations declined to ₹1,419.46 lakhs from ₹2,694.62 lakhs year-on-year. The company ceased operations at its Meghalaya plant on May 7, 2025, due to significant increases in power tariffs that made operations economically unviable. Total comprehensive income turned positive at ₹675.50 lakhs due to other comprehensive income of ₹1,078.30 lakhs, primarily from fair value changes in equity investments. Management is evaluating restructuring and revival measures to restore plant viability. The company manufactures and sells ferro silicon with no separate reportable segments.",
            "Sentiment": "negative",
            "PublishDate": 1754650711743,
            "Source": "earnings"
        }
    ]
}