{
    "Symbol": "SHYAMTEL",
    "ISIN": "INE635A01023",
    "News": [
        {
            "Title": "Shyam Telecom Board Meet Set for Feb 12, 2026",
            "Summary": "Shyam Telecom Limited has scheduled a board meeting for February 12, 2026, to consider and approve Q3 FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770383709491,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shyam Telecom Reports Quarterly Results Amid Going Concern Uncertainty",
            "Summary": "Shyam Telecom Limited approved unaudited financial results for the quarter and half year ended 30 September 2025, with the board meeting held on 14 November 2025. The company faces material uncertainty about its ability to continue as a going concern due to fully eroded net worth, net cash losses, and current liabilities substantially exceeding current assets.",
            "Sentiment": "negative",
            "PublishDate": 1763110016854,
            "Source": "earnings"
        },
        {
            "Title": "Shyam Telecom Reports Zero Revenue and ₹394.58 Lakh Net Loss in Q1 Results",
            "Summary": "Shyam Telecom Limited reported no revenue from operations and a net loss of ₹394.58 lakhs for the quarter ended June 30, 2025. The company generated only ₹3.57 lakhs in other income against total expenses of ₹398.29 lakhs, resulting in earnings per share of -₹3.50. The company's net worth has been fully eroded and current liabilities exceed current assets substantially. Despite these financial challenges, management continues to prepare results on a going concern basis. The Board also approved arrangements for the 32nd Annual General Meeting to be held via video conferencing and appointed scrutinizers for the e-voting process.",
            "Sentiment": "negative",
            "PublishDate": 1754903386830,
            "Source": "earnings"
        }
    ]
}