{
    "Symbol": "SICALLOG",
    "ISIN": "INE075B01020",
    "News": [
        {
            "Title": "Sical Logistics Announces Rs 928 Crore Rights Issue",
            "Summary": "Sical Logistics board approves rights issue of 1.45 crore equity shares at Rs 64 per share, raising up to Rs 928 crore with record date February 18, 2026 and subscription opening February 26, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770908335256,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics Board Meet on Feb 10 for Rights Issue",
            "Summary": "Sical Logistics has scheduled a board meeting for February 10, 2026, to finalize terms of its Rs. 11,000 lakh rights issue including pricing, entitlement ratio, and record date determination.",
            "Sentiment": "neutral",
            "PublishDate": 1770213817138,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics Approves ₹110 Cr Rights Issue",
            "Summary": "Sical Logistics board approves ₹110 crore rights issue and ₹25 crore additional credit facilities from HDFC Bank to meet business requirements and fund expansion plans.",
            "Sentiment": "positive",
            "PublishDate": 1769172431568,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics Appoints Sharad Kumar as Independent Director",
            "Summary": "Sical Logistics Limited appointed Mr. Sharad Kumar as additional non-executive independent director effective January 14, 2026. Kumar brings over 30 years of banking experience from ICICI, HDFC Bank.",
            "Sentiment": "positive",
            "PublishDate": 1768398282752,
            "Source": "stocks"
        },
        {
            "Title": "Sical Logistics Surges 5% on ₹4,038 Cr Order Win",
            "Summary": "Sical Logistics stock hits upper circuit after securing massive ₹4,038 crore contract from South Eastern Coalfields Limited for Porda Chimtapani Open Cast Project in Raigarh, Chhattisgarh.",
            "Sentiment": "positive",
            "PublishDate": 1768294677378,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics Wins ₹4,038 Cr Coal Contract",
            "Summary": "Sical Logistics secures major ₹40.38 billion contract from South Eastern Coalfields Limited, marking significant business expansion for the logistics company.",
            "Sentiment": "positive",
            "PublishDate": 1768262875816,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics shareholders approve key resolutions",
            "Summary": "Sical Logistics Limited shareholders approved re-appointment of whole-time director Mr. Seshadri Rajappan and material modification in related party transaction with Pristine Malwa through postal ballot concluded January 09, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768229353246,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics shareholders approve key resolutions",
            "Summary": "Sical Logistics Limited shareholders approved re-appointment of whole-time director Seshadri Rajappan and modification of related party transaction with holding company through postal ballot voting.",
            "Sentiment": "positive",
            "PublishDate": 1768229107472,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics shareholders approve director reappointment",
            "Summary": "Sical Logistics Limited shareholders approved the re-appointment of Mr. Seshadri Rajappan as whole-time director and related party transaction modifications through postal ballot voting concluded on January 09, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768229076591,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics wins ₹4,038-crore SECL contract",
            "Summary": "Sical Logistics secures major mining contract from South Eastern Coalfields for Porda Chimtapani project in Chhattisgarh, to be executed over 4,214 days. Shares gained 0.94% following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1768228869181,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics Wins ₹4,038 Cr Coal Contract",
            "Summary": "Sical Logistics has secured a significant ₹40.38 billion contract from South Eastern Coalfields Limited, marking a major business development for the logistics company.",
            "Sentiment": "positive",
            "PublishDate": 1768227302771,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics Wins ₹4,038 Cr Coal Mining Contract",
            "Summary": "Sical Logistics Limited secured a major contract worth ₹4,038.18 crores from South Eastern Coalfields Limited for coal mining operations at Porda Chimtapani Open Cast Project in Raigarh, Chhattisgarh.",
            "Sentiment": "positive",
            "PublishDate": 1768226997146,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics Concludes Postal Ballot E-Voting",
            "Summary": "Sical Logistics Limited completed its postal ballot proceedings on January 09, 2026, covering re-appointment of whole-time director and approval of related party transaction modifications.",
            "Sentiment": "neutral",
            "PublishDate": 1767966125952,
            "Source": "stocks"
        },
        {
            "Title": "Sical Logistics Independent Director Resigns",
            "Summary": "Sical Logistics announces resignation of independent director Mr. Vinay Kumar Pabba effective January 09, 2026, citing personal grounds for his departure from the board.",
            "Sentiment": "neutral",
            "PublishDate": 1767965329208,
            "Source": "stocks"
        },
        {
            "Title": "Sical Logistics Pays Fine for SEBI Compliance Delay",
            "Summary": "Sical Logistics Limited paid ₹5,900 fine to BSE and NSE for one-day delay in submitting related party transaction disclosures under SEBI LODR Regulation 23(9) for half-year ended September 2025.",
            "Sentiment": "negative",
            "PublishDate": 1767792682268,
            "Source": "stocks"
        },
        {
            "Title": "Sical Logistics Board Approves ₹20 Cr Guarantee",
            "Summary": "Sical Logistics board approves ₹20.00 crore corporate guarantee for subsidiary SMART's credit facilities from CSB Bank, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1767791693637,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sical Logistics Completes ₹33.09 Cr Asset Sale to Wisteria",
            "Summary": "Sical Logistics has completed the sale of non-core assets in Tamil Nadu to Wisteria Towers Private Limited for ₹33.09 crore as part of its approved resolution plan under the Insolvency and Bankruptcy Code.",
            "Sentiment": "neutral",
            "PublishDate": 1767013356516,
            "Source": "stocks"
        },
        {
            "Title": "Sical Logistics Seeks Shareholder Approval for Director Re-appointment and Related Party Transaction Modification",
            "Summary": "Sical Logistics has issued a postal ballot notice seeking member approval for re-appointing Mr. Seshadri Rajappan as whole-time director for three years (January 2026-2029) with remuneration up to Rs. 74 lakh per annum. The company also seeks approval to modify its material related party transaction with holding company Pristine Malwa Logistics Park, reducing leased commercial equipment from 59 to 38 units and revising lease rent to Rs. 21.08 crore, Rs. 15.67 crore, and Rs. 15.01 crore for financial years 2025-26, 2026-27, and 2027-28 respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1765276463509,
            "Source": "corporate_action"
        },
        {
            "Title": "Southern Railway Approves Gati Shakti Cargo Terminal Launch for Sical Logistics",
            "Summary": "Southern Railway has granted approval for the launch of a Gati Shakti Cargo Terminal project involving Sical Logistics. This development affects Sical Logistics' cargo terminal operations and represents progress in the company's logistics infrastructure expansion.",
            "Sentiment": "positive",
            "PublishDate": 1763731187573,
            "Source": "stock"
        },
        {
            "Title": "Sical Logistics Reports Quarterly Profit of Rs 994 Lakhs, Re-appoints Whole-time Director",
            "Summary": "Sical Logistics Limited reported a standalone profit of Rs 994 lakhs for the quarter ended September 30, 2025, compared to a loss of Rs 799 lakhs in the same quarter last year. For the half-year period, the company posted a profit of Rs 363 lakhs versus a loss of Rs 2,638 lakhs in the previous year. Revenue from operations stood at Rs 3,663 lakhs for the quarter. The company's other income for the quarter included a significant profit of Rs 2,854 lakhs from land sale. Additionally, the board re-appointed Mr. Seshadri Rajappan as whole-time director for three consecutive years from January 11, 2026 to January 10, 2029, subject to shareholder approval. The company completed its final installment payment under an approved resolution plan and received no-objection certificates from major financial creditors.",
            "Sentiment": "positive",
            "PublishDate": 1762992683562,
            "Source": "corporate_action"
        },
        {
            "Title": "Sical Logistics Promoter to Sell 0.15% Stake to Meet Public Shareholding Norms",
            "Summary": "Pristine Malwa Logistics Park Private Limited, the promoter of Sical Logistics Limited, plans to sell 1,00,000 equity shares representing 0.15% of the company's total paid-up equity share capital in the open market from September 24-30, 2025. The sale aims to comply with the mandatory minimum public shareholding requirement of 25%. Pristine Malwa acquired 95% of Sical Logistics' total paid-up equity share capital on February 26, 2023, following approval of its resolution plan by the National Company Law Tribunal on December 08, 2022. The company has been maintaining minimum public shareholding of 10% during the prescribed period post implementation of the approved resolution plan. The promoter has provided an undertaking not to purchase any shares in the open market during the sale period.",
            "Sentiment": "neutral",
            "PublishDate": 1758545041477,
            "Source": "corporate_action"
        },
        {
            "Title": "Sical Logistics Sells 1.37 Acres of Vacant Land in Chennai for Rs 29 Crore",
            "Summary": "Sical Logistics Limited completed the sale of non-core assets consisting of 1.37 acres of vacant land located in Madhavaram Village, Chennai, for Rs 29 crore. The transaction was executed on September 4, 2025, with the buyer being M/s. Avantara Projects LLP, which is not affiliated with the promoter or group companies. The sale aligns with the company's resolution plan submitted by Pristine Malwa Logistics Park Private Limited and approved by the National Company Law Tribunal, Chennai bench, under the Insolvency and Bankruptcy Code in December 2022.",
            "Sentiment": "neutral",
            "PublishDate": 1756992477997,
            "Source": "stock"
        },
        {
            "Title": "Sical Logistics Reports Net Loss of ₹1,130 Lakhs Despite ₹4,622 Lakhs Revenue",
            "Summary": "Sical Logistics Limited published its unaudited consolidated financial results for the quarter ended June 30, 2025. The company reported total income from operations of ₹4,622 lakhs but recorded a net loss of ₹1,130 lakhs. EBITDA stood at ₹418 lakhs, while earnings per share (basic and diluted) was negative at ₹(0.65). The company's net worth was ₹6,525 lakhs. The board approved these results on August 8, 2025, and the company published them in newspapers as required. Sical Logistics operates in port and terminal operations, surface logistics, mining, and cold chain solutions.",
            "Sentiment": "negative",
            "PublishDate": 1754908636787,
            "Source": "earnings"
        },
        {
            "Title": "Sical Logistics Approves Q2 2025 Financial Results and Rs. 30 Crore Credit Facility from HDFC Bank",
            "Summary": "Sical Logistics Limited's board approved unaudited financial results for the quarter ended June 30, 2025, during a meeting held on August 8, 2025. The board also authorized obtaining credit facilities up to Rs. 30 crore from HDFC Bank Limited to meet business requirements. The facilities include both fund-based and non-fund-based options. The company completed its resolution plan by remitting the final installment with applicable interest and received no objection certificates from major financial creditors. Sical Logistics operates primarily in integrated logistics services within India.",
            "Sentiment": "neutral",
            "PublishDate": 1754657689364,
            "Source": "earnings"
        },
        {
            "Title": "Sical Logistics Reports Strong Q1 Performance with Revenue More Than Doubling",
            "Summary": "Sical Logistics delivered significantly improved quarterly results with revenue rising to 975 million rupees from 420 million rupees year-over-year. The company's EBITDA surged to 229 million rupees compared to 15 million rupees in the same period last year, while EBITDA margin expanded substantially to 23.51% from 3.62%. Despite the operational improvements, the company recorded a consolidated net loss of 30 million rupees, though this represents a considerable reduction from the previous year's loss of 177 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1754656993453,
            "Source": "earnings"
        },
        {
            "Title": "Sical Logistics Concludes Postal Ballot Process for Three Special Resolutions",
            "Summary": "Sical Logistics Limited completed its remote e-voting process for three special resolutions. The voting concluded on August 07, 2025 at 5:00 p.m. IST. The resolutions included: creating a mortgage on land and building of subsidiary Sical Multimodal and Rail Transport Limited to secure company facilities, approving material related party transactions with the same subsidiary, and creating a pledge on shares of material subsidiary Sical Infra Assets Limited. The postal ballot notice was dispatched electronically to shareholders on July 08, 2025, with voting commencing July 09, 2025. M/s KRA & Associates was appointed as scrutinizer to conduct the process, while Central Depository Services facilitated the remote e-voting. The company will declare voting results based on the scrutinizer's report and submit them to stock exchanges within prescribed timelines.",
            "Sentiment": "neutral",
            "PublishDate": 1754573128494,
            "Source": "corporate_action"
        },
        {
            "Title": "Sical Logistics Extends Loan Repayment Period from 2 to 5 Years with Holding Company",
            "Summary": "Sical Logistics Limited executed a first addendum to extend the repayment period of an existing Rs. 11 crore unsecured loan from its ultimate holding company, Pristine Logistics & Infraprojects Limited. The original loan agreement was executed on January 11, 2024, with a two-year repayment term, which has now been extended to five years. The modification aligns with the company's current financial planning and operational needs. The loan amount remains up to Rs. 11 crore, available in one or more tranches, with the full amount currently outstanding. The transaction is conducted on an arm's length basis between the related parties, as Pristine Logistics & Infraprojects Limited is part of the promoter group structure.",
            "Sentiment": "neutral",
            "PublishDate": 1753527852439,
            "Source": "corporate_action"
        }
    ]
}