{
    "Symbol": "SIEMENS",
    "ISIN": "INE003A01024",
    "News": [
        {
            "Title": "Siemens Delays ₹1.86 Billion Metro Car Investment",
            "Summary": "Siemens has indefinitely postponed its ₹1.86 billion investment plan for establishing a metro car assembly setup, marking a significant delay in the company's expansion strategy.",
            "Sentiment": "negative",
            "PublishDate": 1770366544670,
            "Source": "stocks"
        },
        {
            "Title": "Siemens Q3 Net Profit Drops 53% to ₹2.8B",
            "Summary": "Siemens reported Q3 consolidated net profit of ₹2.80 billion, down 53% from ₹6.00 billion in the same quarter last year, missing analyst estimates of ₹4.00 billion.",
            "Sentiment": "negative",
            "PublishDate": 1770366475676,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siemens Board Meet Set for Feb 6 to Review Q3FY26 Results",
            "Summary": "Siemens Limited announces board meeting scheduled for February 6, 2026 to consider unaudited financial results for quarter ended December 31, 2025 under regulatory compliance.",
            "Sentiment": "neutral",
            "PublishDate": 1770134082321,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siemens Limited Postal Ballot Results January 2026",
            "Summary": "Siemens Limited announces postal ballot voting results for continuation of Mr. Matthias Rebellius as Special Director. Resolution passed with 95.36% votes in favour from 314.59 crore shares polled.",
            "Sentiment": "positive",
            "PublishDate": 1769792643926,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siemens Eyes India as Key Global Manufacturing Hub",
            "Summary": "Siemens CEO Cedric Neike highlights India's potential to become one of four main global locations for the company, citing robust infrastructure and growing manufacturing capabilities at Davos 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768911262901,
            "Source": "global"
        },
        {
            "Title": "YES Research Upgrades Siemens India to Neutral Rating",
            "Summary": "YES Research has upgraded Siemens India to a Neutral rating with a target price of ₹3,300. The research firm's revised stance reflects updated assessment of the company's prospects.",
            "Sentiment": "neutral",
            "PublishDate": 1767930785927,
            "Source": "stocks"
        },
        {
            "Title": "Equirus Initiates Reduce Rating on Siemens Energy",
            "Summary": "Equirus Securities initiates coverage on Siemens Energy India with Reduce rating and ₹2,695 target price, citing stretched valuations despite strong positioning in energy transition and 49% order inflow surge.",
            "Sentiment": "neutral",
            "PublishDate": 1767240996583,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Maintains Buy Rating on Siemens Energy",
            "Summary": "Jefferies maintains its 'Buy' recommendation on Siemens Energy with a price target of ₹4,000.00, reflecting continued confidence in the company's prospects.",
            "Sentiment": "positive",
            "PublishDate": 1765424909927,
            "Source": "stocks"
        },
        {
            "Title": "Siemens Acquires Full Stake in Cognitech for ₹500 Cr",
            "Summary": "Siemens completes acquisition of full stake in Cognitech for ₹500 crores to strengthen digital solutions capabilities and enhance AI expertise in its technology portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1765376218060,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siemens International Holding to Acquire 3.56 Million Siemens Shares for Rs 11.41 Billion",
            "Summary": "Siemens International Holding will purchase 3.56 million shares of Siemens at Rs 3,203.37 per share, representing a total transaction value of Rs 11.41 billion. This share acquisition involves the parent holding company increasing its stake in Siemens through a significant equity investment.",
            "Sentiment": "neutral",
            "PublishDate": 1765342612325,
            "Source": "corporate_action"
        },
        {
            "Title": "Siemens Acquires Full Stake In Cognitech For ₹500 Crore",
            "Summary": "Siemens has acquired complete ownership of Cognitech in a ₹500 crore transaction. The acquisition aims to strengthen Siemens' digital solutions capabilities and enhance AI expertise within the organization.",
            "Sentiment": "positive",
            "PublishDate": 1765342340046,
            "Source": "order&deals"
        },
        {
            "Title": "Siemens Board Approves INR 2,200 Crore Sale of Motors Business to Innomotics India",
            "Summary": "Siemens' board has approved the sale of its low voltage motors and geared motors business to Innomotics India Private Limited for INR 2,200 crore. The transaction represents a significant divestiture for Siemens as it exits this specific motors segment in favor of Innomotics India.",
            "Sentiment": "neutral",
            "PublishDate": 1765237792461,
            "Source": "order&deals"
        },
        {
            "Title": "Siemens Limited Receives INR 62.94 Million Tax Demand from Income Tax Department",
            "Summary": "Siemens Limited received a final assessment order from the Income Tax Department for Assessment Year 2022-23 with a tax demand of INR 62.94 million due to transfer pricing adjustments. The company is filing an appeal against the order and does not expect any material financial impact from this demand.",
            "Sentiment": "neutral",
            "PublishDate": 1764688862464,
            "Source": "stock"
        },
        {
            "Title": "Siemens Limited Announces Senior Management Changes with New Appointments in HR and Safety Roles",
            "Summary": "Siemens Limited announced multiple senior management changes effective January 1, 2026, including the appointment of Ms. Sabine Schneider as Head-People Organisation and Ms. Sweta Praharaj as Head-Environmental Health and Safety, replacing outgoing executives. The company also categorized its Head-Strategy Sustainability position as Senior Management, reflecting organizational restructuring in key operational areas.",
            "Sentiment": "neutral",
            "PublishDate": 1764648687400,
            "Source": "corporate_governance"
        },
        {
            "Title": "Siemens Limited Wins GST Case as Gujarat High Court Quashes Rs. 34.83 Crore Show Cause Notice",
            "Summary": "The Gujarat High Court quashed a GST show cause notice proposing to levy Rs. 34.83 crore along with interest and penalty on Siemens Limited related to transfer of leasehold interest in Halol, Gujarat property. The court's order dated November 21, 2025 follows its earlier decisions on similar matters, providing relief to the company from the Central GST authorities' demand.",
            "Sentiment": "positive",
            "PublishDate": 1764217089355,
            "Source": "stock"
        },
        {
            "Title": "Siemens Energy Reports Strong Q2 Growth with 33% Jump in Net Profit",
            "Summary": "Siemens Energy delivered robust quarterly performance with net profit rising to 3.6 billion rupees from 2.7 billion rupees year-on-year, while revenue grew to 26.5 billion rupees from 20.8 billion rupees. The company recommended a dividend of Rs. 4 per equity share, though EBITDA margin slightly declined to 18.12% from 18.52% despite absolute EBITDA growth to 4.8 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1764029017487,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Q2 Results: Revenue Jumps 16% But Net Profit Drops 42%",
            "Summary": "Siemens reported mixed Q2 results with revenue rising to 51.71 billion rupees from 44.57 billion rupees year-over-year, while net profit declined significantly to 4.85 billion rupees from 8.31 billion rupees. The company's EBITDA grew to 6.17 billion rupees from 5.45 billion rupees, though EBITDA margin compressed slightly to 11.93% from 12.22%.",
            "Sentiment": "neutral",
            "PublishDate": 1763337158842,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Limited Reports 16% Revenue Growth to INR 5,171 Crore in Q4 Results",
            "Summary": "Siemens Limited delivered strong quarterly performance with 16% revenue growth driven by Mobility and Smart Infrastructure businesses, though profit was impacted by comparison to prior year property sale gains. The company changed its financial year from October-September to April-March cycle, with current transitional period running 18 months from October 2024 to March 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1763123728004,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Ltd. Records Two Large Block Trades Worth Rs. 51.31 Crores on NSE",
            "Summary": "Siemens Ltd. witnessed two significant block trades on the National Stock Exchange. The first transaction involved 83,995 shares at Rs. 3,187.50 per share, totaling Rs. 26.77 crores. The second block trade comprised 77,156 shares at Rs. 3,180.00 per share, amounting to Rs. 24.54 crores. Combined, these transactions represent approximately 1.61 lakh shares worth Rs. 51.31 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1757567119933,
            "Source": "order&deals"
        },
        {
            "Title": "Siemens Shares Drop 2% on Quarterly Profit Decline Despite Revenue Growth",
            "Summary": "Siemens Ltd shares fell 2.16% to Rs 2,965.20 following a 3.1% decline in profit after tax to Rs 423 crore for the June quarter, down from Rs 437 crore in the same period last year. The company attributed the profit drop to lower other income. However, revenue from operations grew 15.5% to Rs 4,347 crore, while earnings per share decreased to Rs 11.89 from Rs 12.28. Operational metrics showed strength with new orders rising 13% to Rs 5,680 crore, order backlog increasing 8% to Rs 42,845 crore, and profit from operations growing 9.2% to Rs 454 crore. Brokerage firms provided mixed ratings: Motilal Oswal maintained neutral with a Rs 3,300 target price, Avendus kept reduce rating with Rs 2,879 target, while Antique maintained buy rating and raised target price to Rs 3,892 from Rs 3,179.",
            "Sentiment": "negative",
            "PublishDate": 1754892467897,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Q1 Results: Revenue Rises 24% to 46.5b Rupees, Net Profit Falls 28%",
            "Summary": "Siemens reported Q1 consolidated net profit of 4.2 billion rupees, down from 5.8 billion rupees in the same quarter last year, missing analyst estimates of 4.81 billion rupees. Revenue increased to 46.5 billion rupees from 37.6 billion rupees year-over-year, exceeding estimates of 42.59 billion rupees. EBITDA declined to 5.2 billion rupees from 6.9 billion rupees, falling short of the 5.31 billion rupee estimate. EBITDA margin compressed to 12% from 13.3% in the previous year, below the estimated 12.6%.",
            "Sentiment": "neutral",
            "PublishDate": 1754872113771,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Limited Announces Leadership Change in Digital Industries Business",
            "Summary": "Siemens Limited announced changes in its senior management personnel. Suprakash Chaudhuri will cease to be the Head of the Digital Industries business effective September 30, 2025, as he takes up a new role within Siemens overseas. Swapnil Deosthali has been appointed as the new Head of Digital Industries business effective October 1, 2025. Deosthali is a seasoned professional serving as Country Business Unit Head within the Digital Industries business, bringing nearly 30 years of experience in Sales, Business Development, and P&L Management. He has held leadership positions across India, ASEAN, and Europe, and holds a Bachelor of Engineering degree from Government College of Engineering Pune.",
            "Sentiment": "neutral",
            "PublishDate": 1754668982471,
            "Source": "corporate_governance"
        },
        {
            "Title": "Siemens Limited Reports Q3 Results with 13% Order Growth and Approves Financial Year Change",
            "Summary": "Siemens Limited's Board approved unaudited financial results for the third quarter and nine months ended June 30, 2025. The company reported new orders rising 13% to INR 5,680 crore, with order backlog growing 8% to INR 42,845 crore. Revenue from operations increased 15.5% to INR 4,347 crore on a consolidated basis. However, profit after tax declined 3.1% to INR 423 crore due to lower other income. The Board also approved changing the company's financial year from October-September to April-March, subject to regulatory approvals. The current financial year will be extended to 18 months (October 2024 to March 2026). Managing Director Sunil Mathur highlighted strong performance across all businesses, including significant order wins in the Mobility segment, while noting that Digital Industries is showing signs of recovery as the destocking phase concludes.",
            "Sentiment": "positive",
            "PublishDate": 1754668175138,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Siemens delivered mixed quarterly results with revenue rising to 46.5 billion rupees from 37.6 billion rupees year-over-year, exceeding estimates of 42.59 billion rupees. However, profitability declined as EBITDA fell to 5.2 billion rupees from 6.9 billion rupees, slightly below the 5.31 billion rupee estimate. EBITDA margin compressed to 12% from 13.3% previously, missing the estimated 12.6%. Consolidated net profit dropped to 4.2 billion rupees from 5.8 billion rupees, falling short of the 4.81 billion rupee estimate.",
            "Sentiment": "neutral",
            "PublishDate": 1754667760065,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Energy Reports Strong Q1 Growth with 60% Jump in Net Profit",
            "Summary": "Siemens Energy delivered robust quarterly performance with net profit rising to 2.6 billion rupees from 1.5 billion rupees year-over-year. Revenue increased to 17.85 billion rupees compared to 14.8 billion rupees in the same period last year. The company's EBITDA grew significantly to 3.4 billion rupees from 2.13 billion rupees, while EBITDA margin expanded to 19.07% from 14.38% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1754313458204,
            "Source": "earnings"
        },
        {
            "Title": "Siemens AG and Other Shareholders Sign Agreement for Siemens Energy India",
            "Summary": "Siemens AG and other shareholders have entered into a shareholders' agreement related to Siemens Energy India. The agreement is designed to manage the relationship among the shareholders of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753974442562,
            "Source": "corporate_governance"
        },
        {
            "Title": "Siemens: Secures Rs 773 Crore Orders for Nagpur Metro Phase 2",
            "Summary": "Siemens has won two orders worth Rs 773 crore from Maharashtra Metro Rail Corporation Ltd for the Nagpur Metro Rail project. The company will provide advanced signalling and telecommunication technologies for Phase 2, including augmentation of Phase 1. The project covers 32 stations over a 43.8-kilometre network, with a 42-month execution period.",
            "Sentiment": "positive",
            "PublishDate": 1752461869000,
            "Source": "order&deals"
        },
        {
            "Title": "Siemens Secures 773 Crore Order for Nagpur Metro Phase 2",
            "Summary": "Siemens has received orders valued at 773 crores for advanced signaling and telecom technologies for the Nagpur Metro Phase 2 project. The order involves implementing cutting-edge signaling and communication systems for the metro expansion.",
            "Sentiment": "positive",
            "PublishDate": 1752218359000,
            "Source": "default"
        },
        {
            "Title": "Siemens Restores Full Access to Export-Controlled Software for Chinese Clients",
            "Summary": "Siemens AG has resumed sales and support services for its Chinese clients. The company has restored full access to its export-controlled software and technology for customers in China.",
            "Sentiment": "positive",
            "PublishDate": 1751514737000,
            "Source": "default"
        },
        {
            "Title": "Siemens Energy India Limited Approved for Listing and Trading on BSE and NSE",
            "Summary": "Siemens Energy India Limited has received approvals from both the Bombay Stock Exchange (BSE) and the National Stock Exchange (NSE) for listing and trading of its shares. The company's shares will be available for trading starting June 19.",
            "Sentiment": "positive",
            "PublishDate": 1750260250000,
            "Source": "default"
        },
        {
            "Title": "Siemens Consortium to Provide Signaling and Telecommunication Tech for India's High-Speed Rail",
            "Summary": "A consortium involving Siemens has been selected to provide advanced signaling and telecommunication technologies for India's first high-speed rail project. This initiative marks a significant step in India's railway infrastructure development.",
            "Sentiment": "positive",
            "PublishDate": 1750141293000,
            "Source": "default"
        },
        {
            "Title": "Siemens Announces Strong Global Outlook for FY2024",
            "Summary": "Siemens has released its financial outlook for the fiscal year 2024, projecting adjusted revenue growth of 8-10% globally. The parent company has also reaffirmed its fiscal year 2025 outlook, expecting comparable revenue growth of 3-7%.",
            "Sentiment": "positive",
            "PublishDate": 1747285635000,
            "Source": "default"
        },
        {
            "Title": "Siemens: Strong Inflows Amid Weak Execution, Motilal Oswal Maintains Neutral Stance",
            "Summary": "Motilal Oswal maintains a 'Neutral' rating on Siemens with a target price of Rs 3,200, valuing it at 45x Mar'27E EPS. The company shows strong inflows but weak execution. The stock currently trades at P/E ratios of 54x/44x/38x for FY25E/FY26E/FY27E based on non-energy business proforma financials.",
            "Sentiment": "neutral",
            "PublishDate": 1747201652000,
            "Source": "result"
        },
        {
            "Title": "Siemens Ltd: Q2 Results Disappoint Despite Strong Order Inflows",
            "Summary": "Siemens reported a 32% YoY decline in Q2 FY25 operating income, missing estimates. Revenue grew 2% YoY, with mobility segment down 18%. EBIT margins contracted 460 bps YoY. Order inflows surged 43% YoY. Digital industries segment faces softness. Bank of America reiterates 'underperform' rating, citing execution challenges and weak private capex outlook.",
            "Sentiment": "negative",
            "PublishDate": 1747193208000,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Ltd: Q2 Profit Drops 25% But Beats Estimates",
            "Summary": "Siemens Ltd reported a 24.8% year-on-year decline in standalone net profit to Rs 674 crore for Q2 FY2025, surpassing analyst estimates. Revenue increased by 2.5% to Rs 3,809 crore, while EBITDA fell 29.4% to Rs 386 crore. The company's profit margin contracted to 10% from 14.7% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1747131712000,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Reports Significant Drop in Q4 EBITDA",
            "Summary": "Siemens has reported a substantial decrease in its Q4 EBITDA, falling to 4.68 billion rupees from 8.8 billion rupees year-over-year. The company's EBITDA margin also declined, dropping to 10.98% from 15.27% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1747130452000,
            "Source": "result"
        },
        {
            "Title": "Siemens Reports Decline in Q4 Consolidated Net Profit",
            "Summary": "Siemens has reported a consolidated net profit of 5.8 billion rupees for the fourth quarter, down from 8.03 billion rupees in the same period last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1747130362000,
            "Source": "result"
        },
        {
            "Title": "Siemens to Consider Q4 Results on May 13",
            "Summary": "Siemens has announced that it will consider its fourth quarter (Q4) financial results on May 13. This indicates that the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the most recent fiscal period.",
            "Sentiment": "neutral",
            "PublishDate": 1746704790000,
            "Source": "default"
        },
        {
            "Title": "Siemens Energy Raises Fiscal Year 2025 Revenue Growth Outlook",
            "Summary": "Siemens Energy has revised its financial outlook for fiscal year 2025, now projecting a comparable revenue growth range of 13% to 15% for the group.",
            "Sentiment": "positive",
            "PublishDate": 1746689627000,
            "Source": "default"
        },
        {
            "Title": "Siemens Ltd.: Stock Rises Over 11% Post-Demerger",
            "Summary": "Siemens Ltd. stock has risen over 11% since its energy division demerger on April 7. The company allotted 35.6 crore equity shares in a 1:1 ratio for Siemens Energy India Ltd. The stock is currently trading higher, despite a 13% decline year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1745817455000,
            "Source": "corporate_action"
        },
        {
            "Title": "Siemens Ltd.: Shares Drop as BofA Downgrades Post Energy Demerger",
            "Summary": "Siemens Ltd. shares fell over 2% after Bank of America lowered its target price to Rs 2,450 from Rs 4,350, citing expensive valuations and growth concerns following the demerger of its energy division. BofA retained an 'underperform' rating, expecting slower earnings growth for Siemens compared to the carved-out energy business.",
            "Sentiment": "negative",
            "PublishDate": 1745211832000,
            "Source": "corporate_action"
        },
        {
            "Title": "Siemens Ltd: Share Price Rises on Post-Demerger Momentum",
            "Summary": "Siemens Ltd shares rose for the fourth consecutive session, up nearly 9% in April. The company recently completed a demerger of its energy business into Siemens Energy India Ltd, with shareholders receiving one share of the new entity for each Siemens Ltd share held. The demerger became effective on April 7, and the new entity is expected to list within 30 to 90 days from the record date.",
            "Sentiment": "positive",
            "PublishDate": 1744863094000,
            "Source": "corporate_action"
        },
        {
            "Title": "Siemens Ltd: Share Price Gains 1% Amid Recent Demerger",
            "Summary": "Siemens Ltd shares rose 1% to Rs 2,866, continuing a three-day advance. The stock has gained nearly 9% in April following the demerger of its energy business into Siemens Energy India. Shareholders received one share of Siemens Energy India for each Siemens Ltd share held. The new entity is expected to list within 30 to 90 days from the April 7 record date.",
            "Sentiment": "positive",
            "PublishDate": 1744776242000,
            "Source": "corporate_action"
        },
        {
            "Title": "Morgan Stanley Reduces Siemens Price Target Due to Digital Industries Outlook",
            "Summary": "Morgan Stanley has lowered its price target for Siemens from EUR 250 to EUR 215, citing a weak outlook for the company's Digital Industries segment. Despite this reduction, it's noted that Siemens' India Digital segment now accounts for 22% of the company's total revenue.",
            "Sentiment": "negative",
            "PublishDate": 1744703611000,
            "Source": "corporate_action"
        },
        {
            "Title": "Siemens India's Organic Growth Forecast for FY25",
            "Summary": "Analysts are forecasting a -9% organic growth for Siemens India in fiscal year 2025, which is below the company's own guidance range of +1% to -6%. This projection suggests a more pessimistic outlook for the company's performance compared to its official expectations.",
            "Sentiment": "negative",
            "PublishDate": 1744703589000,
            "Source": "earnings"
        },
        {
            "Title": "Siemens India's Digital Industries Segment Performance and Guidance Update",
            "Summary": "Siemens India reports that its Digital Industries segment now contributes over 22% to the company's topline for its India business. However, the company anticipates missing its fiscal year 2025 sales growth guidance for the Digital Industries segment.",
            "Sentiment": "neutral",
            "PublishDate": 1744703540000,
            "Source": "earnings"
        },
        {
            "Title": "Siemens Energy India Allots Shares to Siemens Ltd Shareholders",
            "Summary": "Siemens Energy India has allotted 356.1 million shares to Siemens Ltd shareholders. The share entitlement ratio is 1:1 for Siemens Energy India Limited (SEIL) and Siemens Limited (SL) shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1744647549000,
            "Source": "corporate_action"
        },
        {
            "Title": "Siemens Energy India: Double EPS Growth Expected Post-Demerger",
            "Summary": "Jefferies predicts Siemens Energy India Ltd., soon to be listed after demerger from Siemens Ltd., will see EPS growth at twice the pace of the remaining business. This growth is driven by expected 2.5x increase in India's power capex to over $300 billion between FY2024-2030. Siemens is investing Rs 460 crore to double power transformer capacity. The energy business is valued at Rs 2,116 per share, down from earlier estimates. Jefferies adjusted Siemens Ltd.'s price target to Rs 3,300.",
            "Sentiment": "positive",
            "PublishDate": 1744082189000,
            "Source": "corporate_action"
        },
        {
            "Title": "Siemens Ltd: Shares Surge 20% on Energy Business Spin-Off",
            "Summary": "Siemens Ltd shares hit 20% upper circuit on the ex-date for its energy business spin-off. Shareholders will receive one Siemens Energy India share for each Siemens share held. The demerger was approved by NCLT on March 26, with listing expected in 60-90 days.",
            "Sentiment": "positive",
            "PublishDate": 1744003108000,
            "Source": "corporate_action"
        },
        {
            "Title": "Siemens: Demerger and F&O Contract Adjustments Announced",
            "Summary": "Siemens has set April 7 as the ex-date for its demerger, issuing one share of Siemens Energy India for each Siemens share. Existing F&O contracts expired on April 4, with new contracts to be introduced on April 7. Index weightages will be revised based on April 7 closing price, effective from April 9. Separately, NSE announced no new derivative contracts for Berger Paints India from April 25.",
            "Sentiment": "neutral",
            "PublishDate": 1743869236000,
            "Source": "corporate_action"
        }
    ]
}