{
    "Symbol": "SIGACHI",
    "ISIN": "INE0D0K01022",
    "News": [
        {
            "Title": "Sigachi Industries Q3FY26 Earnings Call on Feb 14",
            "Summary": "Sigachi Industries Limited has scheduled its Q3 FY 2025-26 earnings conference call for February 14, 2026 at 4:30 PM IST to discuss unaudited financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1770636060183,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sigachi Industries MD Gets High Court Bail Approval",
            "Summary": "High Court approves bail for Sigachi Industries MD & CEO Amit Raj Sinha amid ongoing legal proceedings. Company expresses condolences and commits to enhanced safety measures.",
            "Sentiment": "neutral",
            "PublishDate": 1770184570685,
            "Source": "stocks"
        },
        {
            "Title": "Sigachi Industries: RPS Industries Reports Pledge Invocation",
            "Summary": "RPS Industries Private Limited invoked 1,15,03,000 pledged equity shares of Sigachi Industries Limited across multiple dates in January 2026, reducing its encumbered shareholding to 12.52%.",
            "Sentiment": "negative",
            "PublishDate": 1769757673784,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sigachi Industries Achieves R&D Milestone in APIs",
            "Summary": "Sigachi Industries reaches important R&D goal in cystic fibrosis APIs, expecting to generate around ₹250.00 crore annually starting Q4 of FY 2026-27.",
            "Sentiment": "positive",
            "PublishDate": 1768974445097,
            "Source": "stocks"
        },
        {
            "Title": "Sigachi Industries Appoints Atul Dhavle as CPO",
            "Summary": "Sigachi Industries has named Atul Dhavle as Chief People Officer. Dhavle brings extensive experience from senior roles at Granules, Bharat Forge, Dr. Reddy's, DuPont Fibers, and Mahindra.",
            "Sentiment": "positive",
            "PublishDate": 1767701874139,
            "Source": "stocks"
        },
        {
            "Title": "Sigachi Industries Clarifies Delayed CPO Appointment",
            "Summary": "Sigachi Industries provides clarification to BSE regarding delayed disclosure of Atul Dhavle's appointment as Chief People Officer, citing oversight as reason for delay beyond 12-hour requirement.",
            "Sentiment": "neutral",
            "PublishDate": 1767587210492,
            "Source": "stocks"
        },
        {
            "Title": "Sigachi Industries shares in focus after CEO remanded",
            "Summary": "Sigachi Industries shares expected in focus after MD & CEO Amit Raj Sinha remanded in Hyderabad fire probe. 40 killed, 33 injured in June incident. Deputy CEO takes interim charge.",
            "Sentiment": "negative",
            "PublishDate": 1766919584371,
            "Source": "stocks"
        },
        {
            "Title": "Sigachi MD & CEO Remanded in Fire Incident Investigation",
            "Summary": "Sigachi Industries' Managing Director & CEO Amit Raj Sinha was remanded on December 27, 2025, in connection with the ongoing investigation into the Hyderabad plant fire incident that occurred on June 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1766732955069,
            "Source": "stocks"
        },
        {
            "Title": "Sigachi Industries Shareholders Approve Four Special Resolutions Through Postal Ballot",
            "Summary": "Sigachi Industries Limited shareholders approved four special resolutions via postal ballot including deviation in IPO objects timeline extension to March 31, 2027, and increased borrowing limits under Companies Act provisions. All resolutions passed with over 97% approval rates, with 46 shareholders dissenting on the IPO object variation resolution out of 465 participants.",
            "Sentiment": "positive",
            "PublishDate": 1764249667549,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Reports 47 Dissenting Shareholders in IPO Fund Utilization Extension Vote",
            "Summary": "Sigachi Industries Limited disclosed that 47 out of 466 shareholders voted against a postal ballot resolution to extend the timeline until March 31, 2027 for full utilization of IPO funds for one of their public issue projects from the 2021 prospectus. The company will provide an exit opportunity to the dissenting shareholders as per regulatory requirements, with the list of dissenting shareholders submitted to stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1764076586142,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Reports Mixed Progress on Fund Utilization with Deviations in Timeline and Amount",
            "Summary": "Sigachi Industries submitted monitoring agency reports for quarterly results ended September 30, 2025, showing full utilization of IPO proceeds for two expansion projects while facing delays and partial non-utilization in convertible share warrant funds. The company reported Rs. 0.43 crore remaining unutilized from the Rs. 286.45 crore convertible share warrant issue, with Rs. 68.63 crore not received from warrant holders within stipulated timelines, affecting planned expansion activities.",
            "Sentiment": "negative",
            "PublishDate": 1763100936495,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Targets Rs. 575 Crore Revenue for FY26 with New MCC Expansion",
            "Summary": "Sigachi Industries plans to improve profit margins by enhancing its product range and boosting operational efficiency. The company anticipates minimum revenue of Rs. 575 crore for FY26, with possible growth by March. The new 12,000 MT MCC expansion at Dahej is expected to generate Rs. 250 crore at full capacity. The company is seeking regulatory approvals in Europe, with nine Certificate of Suitability applications under review.",
            "Sentiment": "positive",
            "PublishDate": 1761536644012,
            "Source": "stock"
        },
        {
            "Title": "Sigachi Industries Reports 53% Drop in Q2 Net Profit to 103 Million Rupees",
            "Summary": "Sigachi Industries reported consolidated net profit of 103 million rupees in Q2, down from 218 million rupees in the same quarter last year. Revenue declined to 1.1 billion rupees from 1.25 billion rupees year-over-year. EBITDA fell significantly to 75 million rupees compared to 172 million rupees in the previous year's Q2. The company's EBITDA margin compressed to 6.82% from 13.79% in the corresponding quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761523759848,
            "Source": "earnings"
        },
        {
            "Title": "Sigachi Industries Reports Q2 FY26 Results Following Fire Incident at Hyderabad Plant",
            "Summary": "Sigachi Industries Limited announced its quarterly results for the quarter ended September 30, 2025. The company reported revenue from operations of Rs. 839.43 crores in Q2 FY26 compared to Rs. 1,090.79 crores in Q2 FY25, representing a 19% decline. EBITDA margin dropped to 6.78% from 21.38% in the previous year. The company recorded a net profit of Rs. 117.62 crores versus Rs. 217.23 crores in Q2 FY25. A fire accident occurred at the Hyderabad plant located at Pashamylaram on June 30, 2025, resulting in 46 casualties, 8 unaccounted team members, and 28 injured employees. The incident caused damage to property, plant, equipment and inventories, with losses accounted under exceptional items totaling Rs. 1,163.50 crores. Operations at the affected plant have been temporarily paused for an estimated 180 days. Production has been reallocated to Dahej and Jhagadia units to maintain business continuity. The company is fast-tracking a 12,000 MTPA capacity expansion at Dahej SEZ and has made its Hyderabad API R&D center fully operational.",
            "Sentiment": "negative",
            "PublishDate": 1761308991709,
            "Source": "earnings"
        },
        {
            "Title": "Sigachi Industries Seeks Shareholder Approval for IPO Object Deviation and Enhanced Financial Limits",
            "Summary": "Sigachi Industries has issued a postal ballot notice seeking shareholder approval for four special resolutions. The company is requesting extension of timeline until March 31, 2027 for utilizing Rs. 32.30 crores earmarked for manufacturing Croscarmellose Sodium at Dahej, Gujarat, citing delays in obtaining administrative approvals from Gujarat government authorities. The company also seeks approval to increase overall limits for loans, guarantees, securities and investments to Rs. 1,000 crores under Section 186, and to raise borrowing limits to Rs. 1,000 crores under Section 180(1)(c) of the Companies Act. Additionally, approval is sought for creating mortgage or charge on company assets up to Rs. 1,000 crores to secure borrowings for business expansion and capital expenditure requirements. E-voting will be conducted from October 23 to November 21, 2025, with results to be declared within two working days thereafter.",
            "Sentiment": "neutral",
            "PublishDate": 1761128364333,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Board Approves Key Financial Decisions Including Borrowing Limits and Asset Charges",
            "Summary": "Sigachi Industries Limited's Board of Directors approved several financial and operational decisions during a meeting held on October 18, 2025. The approvals include borrowing limits under section 180(1)(c) of the Companies Act 2013, creation of mortgage or charge on company assets under section 180(1)(a), overall limits for loans, guarantees, securities and investments under section 186, and deviation in the object clause of the initial public issue as stated in the company's prospectus. All decisions are subject to shareholder approval. The board also approved a postal ballot notice. The meeting was conducted via video conference from 10:00 am to 10:55 am.",
            "Sentiment": "neutral",
            "PublishDate": 1760766004050,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Shares Surge 9% Ahead of Dividend Record Date",
            "Summary": "Sigachi Industries shares rallied 9% to Rs 46.70, marking the fifth consecutive trading session of gains and a 50% increase over six sessions ahead of the September 16 dividend record date. The board recommended a 10% dividend of Rs 0.10 per equity share. Trading volumes reached 13 crore shares, significantly above the weekly average of 7 crore and monthly average of 2 crore shares. The company reported mixed quarterly results with revenue rising 34% to Rs 128.2 crore and EBITDA increasing to Rs 24.1 crore, but posted a net loss of Rs 101.0 crore compared to a Rs 12.8 crore profit in the same quarter last year. Gross margins contracted to 42.64% from 49.79%. Despite recent gains, the stock remains down 10% year-to-date.",
            "Sentiment": "positive",
            "PublishDate": 1757923975909,
            "Source": "stock"
        },
        {
            "Title": "Sigachi Industries Surges 40% in Two Sessions Despite Recent Challenges",
            "Summary": "Sigachi Industries shares jumped 15% to Rs 43.24, marking a nearly 40% gain over two trading sessions. The rally was driven by optimism around potential US-India trade deals, high trading volumes of 14 crore shares, and an upcoming dividend record date of September 16. The company declared a 10% dividend of Rs 0.10 per share totaling Rs 3.82 crore payout. In quarterly results, revenue increased 34% to Rs 128.2 crore, though the company reported a net loss of Rs 101.0 crore compared to a Rs 12.8 crore profit in the previous year. A dust explosion at the Hyderabad facility resulted in 46 fatalities and temporary operations suspension, with estimated revenue loss of Rs 60 crore. Despite recent gains, the stock remains down 15% year-to-date.",
            "Sentiment": "neutral",
            "PublishDate": 1757664415681,
            "Source": "stock"
        },
        {
            "Title": "Sigachi Industries Sets September 16, 2025 as Record Date for Dividend",
            "Summary": "Sigachi Industries Limited has fixed September 16, 2025 as the record date for dividend distribution for the financial year ended March 31, 2025. The company communicated this decision to BSE and NSE exchanges through Company Secretary & Compliance Officer Vivek Kumar.",
            "Sentiment": "positive",
            "PublishDate": 1756973542906,
            "Source": "corporate_action"
        },
        {
            "Title": "RPS Industries Invokes 39.5 Lakh Pledged Shares in Sigachi Industries",
            "Summary": "RPS Industries Private Limited has invoked 39,50,000 pledged equity shares of Sigachi Industries Limited. The invocation occurred in two tranches - 16,00,000 shares on August 6, 2025, and 23,50,000 shares on August 7, 2025. The shares were pledged to Comfort Fincap Limited and Jio Finance Services Limited respectively, with the stated reason being equity participation by the promoter. Following the invocation, RPS Industries' encumbered shareholding in Sigachi Industries decreased from 19.00% to 17.97% of total share capital. RPS Industries holds a total of 7,48,07,250 shares representing 19.58% of Sigachi Industries' total share capital.",
            "Sentiment": "negative",
            "PublishDate": 1755067353567,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Reports Rs 68.63 Crore Shortfall in Warrant Proceeds, Fire Incident Impacts Hyderabad Facility",
            "Summary": "Sigachi Industries Limited submitted its monitoring agency report for the quarter ended June 30, 2025, revealing significant challenges in its Rs 286.45 crore convertible share warrants issue. The company has not received Rs 68.63 crore from warrant holders within the stipulated timeline, representing 24% of the total issue size. A fire incident at the Hyderabad facility during the quarter is expected to adversely impact planned capital expenditure and expansion initiatives. Of the total Rs 286.45 crore raised, Rs 197.91 crore has been utilized across various objectives including API manufacturing facility expansion (Rs 86.51 crore), manufacturing facility upgrades at Dahej and Jhagadia (Rs 50 crore), working capital (Rs 36.40 crore), and general corporate purposes (Rs 25 crore). The Hyderabad facility expansion project shows nil utilization during the quarter. Promoters have infused only 59% of their committed Rs 135.72 crore investment, with Rs 56.77 crore still pending. The monitoring agency noted that the fire incident may materially affect investor decision-making, while the company maintains Rs 19.91 crore in unutilized proceeds deployed in inter-corporate deposits and fixed deposits.",
            "Sentiment": "negative",
            "PublishDate": 1755061667210,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Discloses Share Pledge Invocation and Announces New MCC Capacity Expansion",
            "Summary": "Sigachi Industries Limited disclosed the invocation of 10,00,000 pledged shares by promoter Amit Raj Sinha to KNAB Finance Advisors Pvt Ltd on August 1, 2025. Following the invocation, Sinha's shareholding decreased from 6.15% to 5.90% of total share capital. Separately, the company announced initiation of civil works for a new 12,000 MTPA Microcrystalline Cellulose (MCC) project at its Dahej SEZ unit in Gujarat, expected to be operational within 9 months. This expansion will increase Sigachi's total installed MCC capacity to 30,000 MTPA. The company referenced a recent incident at its Pashamylaram unit and emphasized that the new facility will incorporate enhanced safety features. Sigachi manufactures pharmaceutical excipients, APIs, and specialty ingredients across facilities in Telangana, Gujarat, and Karnataka, serving customers in over 65 countries.",
            "Sentiment": "neutral",
            "PublishDate": 1754542973417,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Expands Microcrystalline Cellulose Production with 12,000 MTPA Dahej Project",
            "Summary": "Sigachi Industries is expanding its microcrystalline cellulose manufacturing capacity through a new 12,000 MTPA (metric tonnes per annum) project at Dahej SEZ. This expansion represents the company's growth strategy in increasing production capacity for microcrystalline cellulose, a key pharmaceutical excipient.",
            "Sentiment": "positive",
            "PublishDate": 1754542175202,
            "Source": "stock"
        },
        {
            "Title": "Sigachi Industries Promoter Amit Raj Sinha Faces Pledge Invocation of 10 Lakh Shares",
            "Summary": "Promoter Amit Raj Sinha reported the invocation of pledged shares in Sigachi Industries Limited on August 1, 2025. Out of 25 lakh equity shares previously pledged on July 16, 2024, 10 lakh shares (0.26% of total share capital) were invoked. Following the invocation, Sinha's shareholding decreased from 2.35 crore shares (6.15%) to 2.00 crore shares (5.24%). His remaining pledged shares stand at 15 lakh shares (0.39% of total share capital). The promoter group includes multiple family members and entities, with total holdings of 13.85 crore shares (36.25% of share capital) after the transaction.",
            "Sentiment": "negative",
            "PublishDate": 1754455853203,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Reports INR121 Crore Loss from Hyderabad Plant Fire, Operations Suspended for 180 Days",
            "Summary": "Sigachi Industries reported a fire incident at its Pashamylaram unit in Hyderabad on June 30, 2025, triggered by dust explosion in spray drying machine, resulting in casualties and injuries. The company recorded INR121 crores in losses including INR51.48 crores in plant and machinery damage, INR7.66 crores stock loss, and INR59.35 crores estimated compensation. The affected unit contributed 29% of total capacity (6,400 metric tons of 24,000 metric tons annually) and remains shut for approximately 180 days. For Q1 FY2026, Sigachi posted operating income of INR128 crores (up from INR95 crores previous year) but reported net loss of INR101 crores versus INR13 crores profit last year. The company expects INR60 crores revenue impact over next 6 months, with production reallocated to Dahej and Jhagadia units. Management indicated insurance coverage of INR90 crores for losses and business interruption policy covering operational profits up to INR25 crores for 12 months.",
            "Sentiment": "negative",
            "PublishDate": 1754043578512,
            "Source": "earnings"
        },
        {
            "Title": "RPS Industries Invokes 510,000 Pledged Shares in Sigachi Industries",
            "Summary": "RPS Industries Private Limited has invoked 510,000 pledged shares of Sigachi Industries Limited. The invocation occurred on July 24, 2025, with Jio Finance Services Limited as the entity in whose favor the shares were encumbered. Following this invocation, RPS Industries' total holding in Sigachi Industries decreased from 75,317,250 shares (19.71%) to 72,600,000 shares (19.00%). The pledged shares represented 0.13% of Sigachi's total share capital. The encumbrance was created for equity participation by the promoter. RPS Industries disclosed this information to BSE and NSE on July 28, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1753764368386,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Makes Q1 FY 2025-26 Earnings Call Audio Recording Available",
            "Summary": "Sigachi Industries Limited has made the audio recording of their Q1 FY 2025-26 earnings call available on the company website at www.sigachi.com. The company notified stock exchanges BSE and NSE about the availability of this recording through a formal communication signed by Company Secretary & Compliance Officer Vivek Kumar.",
            "Sentiment": "neutral",
            "PublishDate": 1753455290352,
            "Source": "earnings"
        },
        {
            "Title": "Sigachi Industries Expects Strong Recovery Despite Hyderabad Fire Disruption",
            "Summary": "Sigachi Industries anticipates a strong recovery in the second half following operational changes. The company aims to achieve higher margins, commercialize CCS (Croscarmellose Sodium), and drive API (Active Pharmaceutical Ingredients) growth. These plans come despite facing disruption from a fire incident at their Hyderabad facility.",
            "Sentiment": "positive",
            "PublishDate": 1753450370229,
            "Source": "stock"
        },
        {
            "Title": "Sigachi Industries Expects 600 Million Rupee Revenue Drop After Hyderabad Facility Accident",
            "Summary": "Sigachi Industries anticipates a revenue decline of 600 million rupees due to an accident at its Hyderabad facility. The incident is expected to impact the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1753443689156,
            "Source": "stock"
        },
        {
            "Title": "Sigachi Industries Reports Mixed Q1 Results with Revenue Growth Offset by Net Loss",
            "Summary": "Sigachi Industries reported quarterly results showing revenue growth to 1.28 billion rupees from 957.1 million rupees year-over-year. The company recorded a consolidated net loss of 1.01 billion rupees compared to a profit of 131.6 million rupees in the same period last year. EBITDA increased to 241 million rupees from 210.3 million rupees, though EBITDA margin declined to 18.79% from 21.96%. Profit before tax improved to 200 million rupees versus 164 million rupees year-over-year. The company reported an exceptional item of 1.2 billion rupees during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1753440855889,
            "Source": "earnings"
        },
        {
            "Title": "Sigachi Industries Disburses ₹5.80 Crore as Interim Compensation Following Pashamylaram Unit Incident",
            "Summary": "Sigachi Industries has begun disbursing interim ex-gratia payments to families affected by an incident at its Pashamylaram unit in Hyderabad. The company has paid ₹10 lakh each to fifteen families of deceased team members in the presence of Deputy Commissioner of Labor, Telangana. Total disbursements of ₹5.80 crore include ₹10 lakh each to 15 families as death compensation, ₹15 lakh each to families of 8 team members who remain unaccounted, and ₹1 lakh each to 25 employees as injury compensation. The company is covering all hospitalization and medical expenses, with three individuals currently under medical care. Sigachi has established an internal task force for relief and compliance oversight and is cooperating with an external safety review committee. Managing Director Amit Raj Sinha stated the company is taking every step to support affected employees and families with care and urgency.",
            "Sentiment": "negative",
            "PublishDate": 1753277204328,
            "Source": "stock"
        },
        {
            "Title": "Sigachi Industries Schedules Board Meeting for July 25, 2025 to Approve Q1 FY2026 Financial Results",
            "Summary": "Sigachi Industries Limited has scheduled a Board of Directors meeting for July 25, 2025, to be held through video conference. The board will consider and approve the standalone and consolidated unaudited financial results for the first quarter ended June 30, 2025. The meeting will also address any other business matters with the permission of the Chair.",
            "Sentiment": "neutral",
            "PublishDate": 1753175977003,
            "Source": "earnings"
        },
        {
            "Title": "Sigachi Industries: Telangana Plant Explosion Death Toll Rises to 46",
            "Summary": "The death toll from the June 30 explosion at Sigachi Industries' pharma plant in Telangana has increased to 46. Eight injured are still in hospitals, and eight others remain missing. Police have filed an FIR against the company management. The state government has announced compensation of ₹1 crore for families of the deceased.",
            "Sentiment": "negative",
            "PublishDate": 1752844088000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sigachi Industries: Explosion Death Toll Rises to 42, CM Reddy to Visit Delhi",
            "Summary": "The death toll from the June 30 explosion at Sigachi Industries' pharmaceutical plant in Telangana has reached 42, with 8 workers still missing. 18 remain hospitalized. CM Revanth Reddy will visit New Delhi on July 7-8 to meet Union Ministers regarding infrastructure projects.",
            "Sentiment": "negative",
            "PublishDate": 1751867868000,
            "Source": "normal_news"
        },
        {
            "Title": "Sigachi Industries: Explosion Toll Rises to 41 at Telangana Plant",
            "Summary": "The death toll from the June 30 explosion at Sigachi Industries' pharma plant in Sangareddy district, Telangana, has increased to 41. 18 people are still undergoing treatment, while 14 have been discharged. Nine people remain missing. A committee of experts is investigating the cause of the accident.",
            "Sentiment": "negative",
            "PublishDate": 1751798647000,
            "Source": "normal_news"
        },
        {
            "Title": "Sigachi Industries: Nine Still Missing After Fatal Factory Blast",
            "Summary": "Nine people remain missing following an explosion at Sigachi Industries' pharma plant in Telangana, which killed 38 and injured 35. An expert committee is set to investigate the incident. The company has announced a solatium of Rs 1 crore for each deceased victim's family.",
            "Sentiment": "negative",
            "PublishDate": 1751526648000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sigachi Industries: Shares Plummet 11% Following Fatal Fire Incident",
            "Summary": "Sigachi Industries' stock price fell nearly 11% on Wednesday, continuing a three-day decline following a fire at its Hyderabad facility on June 30 that claimed 36 lives. The company awaits clearance from the fire department and is cooperating with authorities for rescue and restoration efforts.",
            "Sentiment": "negative",
            "PublishDate": 1751437967000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sigachi Industries: FIR Filed Against Management for Deadly Blast, No Fire NoC",
            "Summary": "Police filed an FIR against Sigachi Industries' management following a blast at their pharma unit in Sangareddy that killed 36 and injured 34. The company lacked a fire department NoC and basic safety mechanisms. DNA profiling is underway to identify victims. Telangana CM promised ₹1 crore compensation to deceased families.",
            "Sentiment": "negative",
            "PublishDate": 1751436174000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sigachi Industries: Telangana CM Announces Rs 1 Crore Compensation for Plant Explosion Victims",
            "Summary": "Telangana CM Revanth Reddy announced Rs 1 crore compensation for families of those who died in the Sigachi Industries pharma plant explosion. The death toll has risen to 36. Seriously injured will receive Rs 10 lakh, while others will get Rs 5 lakh. The state government will also provide immediate relief funds. The company is expected to contribute to the compensation.",
            "Sentiment": "negative",
            "PublishDate": 1751360913000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sigachi Industries: Blast Aftermath Requires DNA Profiling for Victim Identification",
            "Summary": "A blast at Sigachi Industries' plant in Pashamylaram industrial estate has resulted in at least 12 deaths and 35 injuries. Six bodies require DNA profiling for identification. Officials suspect the blast originated in the drying unit. Debris removal and search operations are ongoing.",
            "Sentiment": "negative",
            "PublishDate": 1751330199000,
            "Source": "normal_news"
        },
        {
            "Title": "Fire at Sigachi Industries' Hyderabad Plant Halts Operations",
            "Summary": "Sigachi Industries reported a fire at their Hyderabad plant, leading to a suspension of operations for 90 days. The affected plant contributes 6,000 MTPA to the company's total production capacity of 21,700 MTPA.",
            "Sentiment": "negative",
            "PublishDate": 1751284621000,
            "Source": "default"
        },
        {
            "Title": "Sigachi Industries: Explosion at Manufacturing Plant Causes Injuries and Potential Fatalities",
            "Summary": "A major blast occurred at Sigachi Industries' manufacturing plant in Pashmylaram industrial area, resulting in over a dozen critical injuries and possible fatalities. The incident took place early Monday, causing significant damage to the building. Fire services responded with 11 tenders. The company's stock dropped 9% on the BSE, trading at ₹49.71 by noon.",
            "Sentiment": "negative",
            "PublishDate": 1751265489000,
            "Source": "normal_news"
        },
        {
            "Title": "Sigachi Industries Receives Approval for New Manufacturing Plant",
            "Summary": "Sigachi Industries has announced that it has received Terms of Reference approval for its new API and specialty chemicals manufacturing plant. The plant is located in Orvakal, Andhra Pradesh.",
            "Sentiment": "positive",
            "PublishDate": 1749785044000,
            "Source": "default"
        },
        {
            "Title": "Sigachi Industries Reports Mixed Q4 Results",
            "Summary": "Sigachi Industries has reported its Q4 financial results. The company's EBITDA increased to 286 million rupees from 163 million rupees year-over-year. The EBITDA margin improved to 22.27% from 15.68% in the same period last year. However, the consolidated net profit decreased to 133 million rupees from 150 million rupees year-over-year, but increased from 214 million rupees quarter-over-quarter. Revenue for Q4 grew to 1.28 billion rupees from 1.04 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748611105000,
            "Source": "result"
        },
        {
            "Title": "Sigachi Industries Obtains CEP for Metformin Hydrochloride",
            "Summary": "Sigachi Industries has successfully received a Certificate of Suitability (CEP) from the European Directorate for the Quality of Medicines & HealthCare (EDQM) for Metformin Hydrochloride. This certification is a significant achievement that validates the quality and safety of the company's product for use in the European market.",
            "Sentiment": "positive",
            "PublishDate": 1746602065000,
            "Source": "default"
        },
        {
            "Title": "Sigachi Industries: Subsidiary Signs MoU for Nanofiber Drug Delivery Tech",
            "Summary": "Sigachi Industries' subsidiary, Sigachi MENA FZCO, signed an MoU with Respilon Group to develop nanofiber-based drug delivery technologies. The stock jumped 5% from its intraday low following the announcement.",
            "Sentiment": "positive",
            "PublishDate": 1745833610000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sigachi Industries Signs MOU with Respilon for Nanofiber Technology",
            "Summary": "Sigachi Industries' subsidiary has entered into a Memorandum of Understanding (MOU) with Respilon Group S.R.O. The partnership aims to utilize Respilon's Nuenex nanofiber technology to improve patient experience and therapeutic outcomes through non-invasive, precision drug delivery methods.",
            "Sentiment": "positive",
            "PublishDate": 1745822089000,
            "Source": "default"
        },
        {
            "Title": "Sigachi Industries Obtains Environmental Clearance for Dahej 2 SEZ Facility",
            "Summary": "Sigachi Industries has successfully secured environmental clearance for its facility located in the Dahej 2 Special Economic Zone (SEZ). This regulatory approval is a crucial step for the company's operations in the specified area, potentially allowing for expansion or commencement of activities at the site.",
            "Sentiment": "positive",
            "PublishDate": 1744882523000,
            "Source": "default"
        },
        {
            "Title": "Sigachi Industries: Share Price Rises Despite Promoter Pledge",
            "Summary": "Sigachi Industries' stock gained 3.33% to ₹36.30 despite weak market conditions and a promoter's share pledge. Promoter Dharani Devi Chidambaranatham pledged 9,10,000 shares (0.23% of equity) on March 25. The company plans to invest $1 million in a new R&D center in Hyderabad.",
            "Sentiment": "neutral",
            "PublishDate": 1743494275000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sigachi Industries: Partners with Indian Navy for Health Initiative in Visakhapatnam",
            "Summary": "Sigachi Industries signed an MoU with Indian Navy's INS Kalinga on March 10, 2025, to jointly promote a monthly health and fitness program in Visakhapatnam from March to October 2025. The initiative aims to encourage community wellness and physical fitness.",
            "Sentiment": "positive",
            "PublishDate": 1741847647000,
            "Source": "corporate_action"
        }
    ]
}