{
    "Symbol": "SIGIND",
    "ISIN": "INE529F01035",
    "News": [
        {
            "Title": "Signet Industries Board Meet on Feb 14 for Q3 Results",
            "Summary": "Signet Industries has scheduled a board meeting on February 14, 2026, to consider and approve standalone unaudited financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770318212596,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mukesh Sangla Acquires Additional 25,868 Equity Shares in Signet Industries",
            "Summary": "Mukesh Sangla purchased 25,868 equity shares of Signet Industries Limited from the open market on November 28, 2025, increasing his total holding to 1,018,241 shares representing 3.46% of the company's total share capital. The acquisition was disclosed under SEBI regulations for substantial acquisition of shares and takeovers.",
            "Sentiment": "neutral",
            "PublishDate": 1764574463625,
            "Source": "corporate_action"
        },
        {
            "Title": "Signet Industries Reports Strong Q2 Performance Despite Fire-Related Losses",
            "Summary": "Signet Industries Limited reported revenue from operations of Rs 306.51 crores for the quarter ended September 30, 2025, with profit after tax of Rs 346.54 lacs, despite exceptional losses of Rs 499.37 lacs from a fire incident at their Pithampur plant in April 2025. The company's board approved unaudited financial results showing improved performance across manufacturing, windmill, and trading segments, with total assets reaching Rs 88,909.91 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1763174792081,
            "Source": "earnings"
        },
        {
            "Title": "Signet Industries Approves Final Dividend of Rs. 0.50 Per Share for FY 2024-25",
            "Summary": "Signet Industries Limited announced that shareholders at the 40th Annual General Meeting held on September 30, 2025, approved a final dividend of Rs. 0.50 (5%) per equity share for the financial year 2024-25. The dividend applies to 2,94,37,000 equity shares of Rs. 10 each. Shareholders on record as of September 23, 2025, will be eligible for the dividend payment, which will be credited to their registered bank accounts within the prescribed timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1759309329127,
            "Source": "corporate_action"
        },
        {
            "Title": "Signet Industries Reports Q1 Results with Fire-Related Exceptional Loss of Rs 499.37 Lacs",
            "Summary": "Signet Industries Limited reported quarterly results for the period ended June 30, 2025. The company posted a net profit of Rs 68.69 lacs compared to Rs 49.33 lacs in the same quarter last year. Revenue from operations stood at Rs 25,952.08 lacs versus Rs 25,264.15 lacs in the previous year quarter. The company recorded an exceptional loss of Rs 499.37 lacs due to a fire incident on April 11, 2025, at its Pithampur plant, which damaged HDPE pipes and sprinkler pipes stored in an open area. The fire caused no human casualties. The Board approved these results on August 13, 2025, and also announced the 40th Annual General Meeting scheduled for September 30, 2025, via video conferencing. The company's register of members will remain closed from September 24-30, 2025, for dividend and AGM purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1755082697190,
            "Source": "earnings"
        }
    ]
}