{
    "Symbol": "SIGMAADV",
    "ISIN": "INE933B01012",
    "News": [
        {
            "Title": "Sigma Advanced Systems Acquires 51% Stake in AS Strategic",
            "Summary": "Sigma Advanced Systems Limited signs agreement to acquire 51% stake in AS Strategic Private Limited for INR 20 crores, expanding aerospace & defence capabilities through European OEM partnerships.",
            "Sentiment": "positive",
            "PublishDate": 1770744577527,
            "Source": "co_actions_results"
        },
        {
            "Title": "Megasoft Changes Name to Sigma Advanced Systems",
            "Summary": "Megasoft Limited officially changes company name to Sigma Advanced Systems Limited with new trading symbol SIGMAADV effective February 9, 2026, following regulatory approvals from MCA and stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1770220594626,
            "Source": "stocks"
        },
        {
            "Title": "Sigma Advanced Systems Acquisition Disclosure",
            "Summary": "Yash Dubey acquires 47,716 shares (0.0271%) in Sigma Advanced Systems Limited through scheme of amalgamation with Megasoft Limited under SEBI Takeover Regulations exemption.",
            "Sentiment": "neutral",
            "PublishDate": 1769153639455,
            "Source": "co_actions_results"
        },
        {
            "Title": "Chintalapati Holdings Acquires 46.31% Stake in Sigma",
            "Summary": "Chintalapati Holdings Private Limited acquired 8.16 crore equity shares representing 46.31% stake in Sigma Advanced Systems Limited through amalgamation scheme approved by NCLT Chennai.",
            "Sentiment": "neutral",
            "PublishDate": 1769051382349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sigma Advanced Systems Completes Amalgamation Process",
            "Summary": "Sigma Advanced Systems Limited completes amalgamation with private entity, allots 10.25 crore shares, appoints new independent director, and relocates offices.",
            "Sentiment": "positive",
            "PublishDate": 1767361423697,
            "Source": "co_actions_results"
        },
        {
            "Title": "Megasoft Board Approves Amalgamation with Sigma Advanced",
            "Summary": "Megasoft Limited's Board approves scheme of amalgamation with Sigma Advanced Systems, announces name change to Sigma Advanced Systems Limited, and sets record date as January 14, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1766464470254,
            "Source": "stocks"
        },
        {
            "Title": "Megasoft Limited Fined Rs. 5.42 Lakh Each by BSE and NSE for Board Composition Non-Compliance",
            "Summary": "Megasoft Limited received fines totaling Rs. 5.42 lakh each from BSE and NSE for violating SEBI listing regulations regarding board composition, as the company currently has 5 directors against the minimum requirement of 6 following Krishna Yeachuri's resignation as Director. The company stated there is no material impact on its financial or operational activities and is in the process of remedying the non-compliance while proceeding with an amalgamation of Sigma Advanced Systems Private Limited.",
            "Sentiment": "negative",
            "PublishDate": 1764405195566,
            "Source": "corporate_governance"
        },
        {
            "Title": "Megasoft Limited Reports Mixed Q2 FY26 Results with Property Sale Gains",
            "Summary": "Megasoft Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company operates in the Aerospace and Defence segment and has two subsidiaries: Velapan Systems Private Limited and Sigma Advanced Systems UK Limited. Key developments include the sale of landed property in April 2025, with resulting profits disclosed in the half-yearly statements. The company has entered into a share agreement to divest its entire stake in associate Extrovis AG, treating the investment as an Asset Held for Sale. A Scheme of Amalgamation with Sigma Advanced Systems Private Limited has been approved by shareholders and petitions filed with NCLT Chennai, awaiting orders. The Board meeting was held on November 8, 2025, approving both standalone and consolidated results. The company maintains operations across Chennai and Hyderabad offices.",
            "Sentiment": "neutral",
            "PublishDate": 1762600810582,
            "Source": "earnings"
        },
        {
            "Title": "Megasoft Subsidiary Acquires 100% Stake in UK's Nasmyth Group Limited",
            "Summary": "Megasoft's wholly owned subsidiary, Sigma Advanced Systems UK LTD, has signed a Share Purchase Agreement to acquire 100% shareholding in Nasmyth Group Limited, a UK-based company. The transaction represents a complete acquisition of the target company by Megasoft through its UK subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1761925843442,
            "Source": "order&deals"
        },
        {
            "Title": "Megasoft Subsidiary Acquires UK's Nasmyth Group for ₹213 Crore",
            "Summary": "Megasoft's wholly owned subsidiary Sigma Advanced Systems UK Ltd signed an agreement to acquire 100% stake in Nasmyth Group Ltd, UK for ₹213 crore in cash. The transaction will complete within four weeks and provides Megasoft a global platform in aerospace and defence sector. Nasmyth Group operates manufacturing facilities in the UK and India, specializing in precision engineering and advanced metal treatments for aerospace and defence OEM customers. The group reported revenue of GBP 59.92 million for the twelve-month period ending April 2025, up from GBP 54.03 million in April 2024. Megasoft shares hit 5% upper circuit to close at ₹185.43, with the stock surging over 110% in 2025.",
            "Sentiment": "positive",
            "PublishDate": 1761617306414,
            "Source": "order&deals"
        },
        {
            "Title": "Megasoft Limited Approves GBP 20 Million Loan Agreement with UK Subsidiary for Aerospace and Defense Acquisitions",
            "Summary": "Megasoft Limited's Board of Directors approved entering into a loan agreement with its wholly owned subsidiary, Sigma Advanced Systems UK LTD. The loan facility is up to GBP 20 million (approximately INR 240 crores) to be disbursed in one or more tranches. The funds will enable the subsidiary to pursue potential acquisitions in the Aerospace and Defense sectors in the US and UK as part of the company's strategic growth plans. The unsecured loan carries an interest rate of 8.25% per annum compounded annually, with a tenure of 3 years or repayable on demand, whichever is earlier. The agreement is expected to be executed on or before October 31, 2025. The transaction qualifies as a related-party transaction but is conducted at arm's length.",
            "Sentiment": "positive",
            "PublishDate": 1760778130267,
            "Source": "stock"
        },
        {
            "Title": "Megasoft Limited Reports Strong Q1 Results with Rs 13,643.55 Lakh Net Profit",
            "Summary": "Megasoft Limited reported quarterly results for the period ended June 30, 2025, with net profit of Rs 13,643.55 lakh on standalone basis and Rs 13,622.79 lakh on consolidated basis. The company's earnings per share increased to Rs 18.49 from Rs 0.07 in the same quarter last year. Total revenue reached Rs 18,765.08 lakh standalone and Rs 18,746.41 lakh consolidated, primarily driven by profit on sale of property worth Rs 18,463.74 lakh. The company paid current tax of Rs 3,100 lakh. Megasoft has one subsidiary, Velapan Systems Private Limited, and one associate, Extrovis AG. The company has entered into a scheme of amalgamation with Sigma Advanced Systems Private Limited and signed an agreement to divest its entire stake in associate Extrovis AG.",
            "Sentiment": "positive",
            "PublishDate": 1754647282145,
            "Source": "earnings"
        },
        {
            "Title": "Megasoft Limited Seeks Shareholder Approval to Enhance Borrowing Limits to Rs 800 Crores Through Postal Ballot",
            "Summary": "Megasoft Limited has issued a postal ballot notice seeking shareholder approval for three special resolutions. The company proposes to enhance its overall borrowing limits to Rs 800 crores over and above paid-up capital and free reserves, superseding the earlier limit of Rs 200 crores approved in November 2014. The second resolution seeks approval for creating security on company assets to secure borrowings up to Rs 800 crores. The third resolution requests approval for granting loans, investments, and corporate guarantees up to Rs 800 crores, replacing the previous limit of Rs 200 crores. The Board approved these proposals on July 16, 2025, citing the company's growth and expansion plans in the Aerospace and Defence Sector. E-voting will be conducted from August 4, 2025 at 9:00 AM to September 2, 2025 at 5:00 PM. The cut-off date for eligible voting members is July 25, 2025. M. Damodaran of M Damodaran & Associates LLP has been appointed as the scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1754027419473,
            "Source": "corporate_action"
        },
        {
            "Title": "Megasoft Limited Announces Shareholder Meeting for Sigma Advanced Systems Merger on August 30, 2025",
            "Summary": "Megasoft Limited has announced a court-ordered meeting of equity shareholders on August 30, 2025, to consider and approve a Scheme of Amalgamation with Sigma Advanced Systems Private Limited. The National Company Law Tribunal, Chennai Bench has directed the meeting to be held at 10:00 AM through video conferencing. Under the proposed scheme, shareholders of Sigma will receive 316 equity shares of Megasoft for every 100 shares held, based on a valuation report by BDO Valuation Advisory LLP. The merger will result in promoter shareholding increasing from 35.07% to 72.82%, while public shareholding will decrease from 64.93% to 27.18%. The appointed date for the scheme is April 1, 2024, and the amalgamation aims to provide Megasoft access to defense business and technology while enabling Sigma to leverage new markets and enhanced R&D capabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1753773011216,
            "Source": "corporate_action"
        },
        {
            "Title": "Megasoft Ltd: Selling 36.52% Stake in Swiss Arm for $15 Million",
            "Summary": "Megasoft Ltd's board approves sale of entire 36.52% stake in Extrovis AG, Switzerland, to Refex Life Sciences Pvt Ltd for $15 million. Share purchase agreement pending. Sale to be completed in tranches. Shareholder approval to be sought via postal ballot.",
            "Sentiment": "neutral",
            "PublishDate": 1751384827000,
            "Source": "corporate_action"
        },
        {
            "Title": "Megasoft to Sell 36.52% Stake in Extrovis AG for $15 Million",
            "Summary": "Megasoft has announced plans to sell a 36.52% stake in Extrovis AG, a Switzerland-based company, for $15 million.",
            "Sentiment": "neutral",
            "PublishDate": 1751381062000,
            "Source": "default"
        },
        {
            "Title": "Megasoft Approves Amalgamation with Sigma Advanced Systems",
            "Summary": "Megasoft has announced the approval of the amalgamation of Sigma Advanced Systems into their company. This corporate action represents a significant structural change for both entities involved.",
            "Sentiment": "neutral",
            "PublishDate": 1729261170000,
            "Source": "corporate_action"
        }
    ]
}