{
    "Symbol": "SIGNATURE",
    "ISIN": "INE903U01023",
    "News": [
        {
            "Title": "Signatureglobal Reports Q3FY26 Consolidated Loss",
            "Summary": "Signatureglobal (India) Limited reported consolidated net loss of ₹453.38 million for Q3FY26, with revenue declining to ₹3,127.63 million. Company issued NCDs worth ₹8,750 million to IFC.",
            "Sentiment": "negative",
            "PublishDate": 1770299474853,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signatureglobal Growth Slows to 15% Amid NCR Surge",
            "Summary": "Signatureglobal expects future sales growth to moderate to 15% from previous 60% CAGR as Delhi NCR housing launches surge 39% in Q3 FY25, indicating market normalization trends.",
            "Sentiment": "neutral",
            "PublishDate": 1770263048886,
            "Source": "stocks"
        },
        {
            "Title": "SignatureGlobal Lowers FY26 Sales Target to ₹150 Billion",
            "Summary": "SignatureGlobal reduces FY26 sales guidance to INR 150 billion due to Sarvam launch timing and Delhi NCR pollution restrictions despite major March launch plans.",
            "Sentiment": "negative",
            "PublishDate": 1770262993755,
            "Source": "stocks"
        },
        {
            "Title": "Signatureglobal Reports Q3 FY26 Loss of ₹453.38 Million",
            "Summary": "Signatureglobal (India) Limited reported a consolidated net loss of ₹453.38 million for Q3 FY26, compared to a profit of ₹291.35 million in Q3 FY25. Revenue declined 65.62% to ₹2,844.38 million.",
            "Sentiment": "negative",
            "PublishDate": 1770145599348,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signature Global clarifies volume surge is market driven",
            "Summary": "Signature Global India Limited responds to BSE inquiry about increased trading volume, stating it's purely market driven with no pending price-sensitive disclosures under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1770014583726,
            "Source": "stocks"
        },
        {
            "Title": "Signature Global Board Meet Set for Feb 3, 2026",
            "Summary": "Signature Global India Limited schedules board meeting on February 3, 2026 to consider Q3FY26 unaudited financial results. Trading window remains closed until February 5, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769510905471,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signature Global shares fall 7% on weak Q3 performance",
            "Summary": "Signature Global shares declined 7% after Q3 FY26 pre-sales dropped 27% YoY to ₹2,020 crore. The company acknowledged it will miss its ₹12,700 crore annual target due to weakening demand in the real estate sector.",
            "Sentiment": "negative",
            "PublishDate": 1768211223144,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signatureglobal Shares Hit Two-Year Low on Q3 Decline",
            "Summary": "Signatureglobal shares fell 6.5% to ₹935.90 after reporting 27% decline in Q3 pre-sales to ₹2,020 crore, though collections rose 14% to ₹1,230 crore during October-December period.",
            "Sentiment": "negative",
            "PublishDate": 1768194421168,
            "Source": "co_actions_results"
        },
        {
            "Title": "SignatureGlobal Cuts Pre-Sales Guidance Amid Market Softness",
            "Summary": "SignatureGlobal has revised its pre-sales guidance downward, citing a softer overall market environment that has impacted the company's performance expectations for the period.",
            "Sentiment": "negative",
            "PublishDate": 1768190932785,
            "Source": "stocks"
        },
        {
            "Title": "Signatureglobal cuts FY26 guidance on soft demand",
            "Summary": "Signatureglobal indicates it's unlikely to meet FY26 pre-sales guidance of ₹12,700 cr, citing soft market conditions. Q3 pre-sales dropped 27% to ₹2,020 cr while average realisations improved 22%.",
            "Sentiment": "negative",
            "PublishDate": 1768188260279,
            "Source": "co_actions_results"
        },
        {
            "Title": "SignatureGlobal Reports Strong Financial Performance",
            "Summary": "SignatureGlobal achieves higher realizations at ₹15,182 per sq.ft with collections reaching ₹30.90 billion, while maintaining net debt at ₹10.20 billion despite challenging market conditions.",
            "Sentiment": "positive",
            "PublishDate": 1768182175989,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signatureglobal Q3FY26 Presales Drop 27% to ₹20.2 Bn",
            "Summary": "Signatureglobal India reports significant decline in presales with Q3FY26 dropping 27% to ₹20.20 billion and 9MFY26 falling 23% to ₹66.80 billion compared to previous year periods.",
            "Sentiment": "negative",
            "PublishDate": 1768182154363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signatureglobal cuts FY26 pre-sales guidance amid soft market",
            "Summary": "Real estate developer Signatureglobal India reports 27% decline in Q3 pre-sales to ₹2,020 crore, unable to meet ₹12,700 crore FY26 guidance due to challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1768172703147,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signature Global Q3FY26 Pre-Sales Drop 27% to ₹20.2bn",
            "Summary": "Signature Global India reported Q3FY26 pre-sales of ₹20.2 billion, down 27% YoY, while collections grew 14% to ₹12.3 billion. Average sales realization improved to ₹15,182 per sq ft in 9MFY26.",
            "Sentiment": "neutral",
            "PublishDate": 1768106467826,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signature Global Q3 FY26: Pre-sales ₹20.2 billion",
            "Summary": "Signature Global reports pre-sales of ₹20.2 billion in Q3 FY26 with collections rising 14% to ₹12.3 billion. Average sales realization improved to ₹15,182 per sq. ft. in 9M FY26.",
            "Sentiment": "positive",
            "PublishDate": 1768105348263,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signature Global Reports Q2 FY26 Results, Plans 8 Million Sq Ft Launches in H2",
            "Summary": "Signature Global achieved sales of INR 46.6 billion in H1 FY26 and plans to launch 8 million square feet worth INR 130-140 billion in H2, including 3.6 million sq ft in Sector 37D and over 4 million sq ft in Sector 71. The company raised INR 8.75 billion through NCDs from IFC and maintains guidance of INR 125 billion presales, INR 48 billion revenue recognition, and INR 60 billion collections for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1763389203589,
            "Source": "earnings"
        },
        {
            "Title": "Signature Global Reports 21% Decline in H1FY26 Sales to INR 46.6 Billion, Maintains FY26 Guidance",
            "Summary": "Signature Global (India) Limited reported sales of INR 46.6 billion in H1FY26, down from INR 59.0 billion in H1FY25. The company sold 1,330 units at an average ticket size of INR 34.8 million during the period. Sales realization increased to INR 15,731 per square foot in H1FY26 from INR 12,457 per square foot in FY25. Collections stood at INR 18.6 billion in H1FY26 compared to INR 21.3 billion in H1FY25. The company achieved operating cash surplus before investment in land of INR 4.0 billion. Revenue from operations was INR 12.0 billion with adjusted gross profit of INR 3.4 billion and margin of 29.0%. The company reported a loss after tax of INR 0.1 billion for H1FY26. Net debt increased to INR 9.7 billion as of September 30, 2025 from INR 8.8 billion in March 2025. The company maintains its FY26 guidance of INR 125 billion in pre-sales, with 75% of launches planned for H2. Portfolio addition of 2.3 million square feet was achieved during H1FY26 in focus micromarkets.",
            "Sentiment": "neutral",
            "PublishDate": 1762529248899,
            "Source": "stock"
        },
        {
            "Title": "Signature Global India Reports Q2 Net Loss of 468.6M Rupees, Revenue Drops to 3.38B Rupees",
            "Summary": "Signature Global India posted a consolidated net loss of 468.6 million rupees in Q2, compared to a profit of 41 million rupees in the same period last year. The company's quarterly revenue declined to 3.38 billion rupees from 7.49 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1762520152918,
            "Source": "earnings"
        },
        {
            "Title": "Signature Global President-Legal Sapan Bebarta Resigns to Pursue Better Opportunities",
            "Summary": "Signature Global (India) Limited announced the resignation of Mr. Sapan Bebarta from his position as President-Legal, designated as Senior Management Personnel. Bebarta tendered his resignation to pursue better opportunities, with the resignation being accepted and effective from the closing of business hours on November 5, 2025. The resignation letter, dated September 5, 2025, was addressed to Directors Nikhil Agarwal and Ravi Agarwal, where Bebarta expressed gratitude for his tenure and committed to ensuring a smooth transition during his departure.",
            "Sentiment": "neutral",
            "PublishDate": 1762368601259,
            "Source": "corporate_governance"
        },
        {
            "Title": "Signature Global Raises INR 8.75 Billion Through NCDs from IFC for Mid-Income Housing Projects",
            "Summary": "Signature Global (India) Ltd. raised INR 8.75 billion through private placement of Non-Convertible Debentures to International Finance Corporation, a World Bank Group member. The NCDs carry 'A+' stable ratings from CareEdge Ratings and have a tenure of 3 years, 2 months and 30 days, maturing on January 15, 2029. This marks the company's first-ever listed debt transaction. The funds will be used to develop mid-income and sustainable housing projects, with a portion allocated to reduce existing debt. IFC will provide advisory support for the company's sustainability strategy and help achieve EDGE Advanced certification for the Daxin project. Signature Global has 17 EDGE certified projects and scored 84 in its GRESB debut. The company achieved pre-sales of INR 102.9 billion in FY 2024-25 and targets INR 125 billion for the current financial year. It holds 13% market share in NCR and 20% in Gurugram within the INR 20-50 million price range.",
            "Sentiment": "positive",
            "PublishDate": 1761661011262,
            "Source": "stock"
        },
        {
            "Title": "Signature Global India Executes ₹62.28 Crore Block Trade on NSE",
            "Summary": "Signature Global (India) Ltd. completed a block trade worth ₹62.28 crores on the National Stock Exchange. The transaction involved approximately 579,427 shares at a price of ₹1,074.90 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761634677546,
            "Source": "order&deals"
        },
        {
            "Title": "Signatureglobal Allots Rs 875 Crore Non-Convertible Debentures on Private Placement",
            "Summary": "Signatureglobal (India) Limited has allotted 87,500 non-convertible debentures worth Rs 875 crores through private placement. The debentures carry an 11% interest rate, are rated, listed, secured, and redeemable, with each having a face value of Rs 1,00,000. The NCDs will be listed on BSE Limited's Debt Market segment. The company's Debenture Committee approved the allotment in a meeting held on October 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760590528845,
            "Source": "corporate_action"
        },
        {
            "Title": "Signature Global Achieves 84 Score in GRESB Debut, Receives Full Marks in Leadership & Governance",
            "Summary": "Signature Global (India) Ltd. announced its debut participation in the Global Real Estate Sustainability Benchmark (GRESB), achieving a score of 84 which places it among top-performing first-time participants globally. The company scored 100 in Leadership & Governance with clearly defined ESG roles and objectives. The company has established comprehensive Environmental and Social policies and uses the Global Reporting Initiative (GRI) framework for environmental and social disclosures. Signature Global recently received multiple awards including 'Sustainable Business Leader of the Year' at the 17th Realty+ Conclave & Excellence Awards 2025 and 'Most Environment-Friendly Residential Project' for Signature Global Titanium SPR. The company holds a 13% market share in NCR and 20% share in Gurugram within the INR 20-50 million price range. As of Q1FY26, the company has delivered 15.7 million sq. ft. of real estate with a robust pipeline of 50.8 million sq. ft. across various stages. In FY25, Signature Global reported sales bookings of INR 102.9 billion and achieved a 58% CAGR in sales between FY22 to FY25.",
            "Sentiment": "positive",
            "PublishDate": 1760361212317,
            "Source": "stock"
        },
        {
            "Title": "Signature Global Reports 28% Decline in Q2FY26 Pre-Sales to INR 20.1 Billion Despite Higher Realizations",
            "Summary": "Signature Global (India) Limited reported pre-sales of INR 20.1 billion for Q2FY26, down 28% from INR 27.8 billion in Q2FY25. The company achieved average sales realization of INR 15,000 per sq. ft. compared to INR 12,457 per sq. ft. in FY25. Collections increased marginally to INR 9.4 billion from INR 9.2 billion year-over-year. The company acquired 33.47 acres of land during the quarter, with 30.86 acres in collaboration within the Sohna micro-market, offering development potential of approximately 1.76 million sq. ft. Net debt rose to INR 9.7 billion at the end of H1FY26 from INR 8.8 billion at FY25 end. The company sold 573 units covering 1.34 million sq. ft. in Q2FY26, compared to 1,053 units and 2.38 million sq. ft. in the previous year quarter. Management expressed comfort with their guidance across operating metrics including pre-sales, collections and net debt.",
            "Sentiment": "negative",
            "PublishDate": 1760200661569,
            "Source": "stock"
        },
        {
            "Title": "SignatureGlobal Approves ₹875 Crore Debenture Issuance at 11% Coupon Rate",
            "Summary": "SignatureGlobal (India) has approved the issuance of 87,500 secured redeemable non-convertible debentures worth ₹875 crores. The debentures carry an annual coupon rate of 11% and have a maturity period of 3 years. This debt instrument will provide the company with capital while offering investors a fixed return over the specified tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1760001085989,
            "Source": "corporate_action"
        },
        {
            "Title": "SignatureGlobal Shareholders Approve Re-appointment of Independent Director and New Secretarial Auditor",
            "Summary": "SignatureGlobal (India) Limited shareholders approved two key appointments at their 26th Annual General Meeting held on September 23, 2025. Mr. Kundan Mal Agarwal was re-appointed as Independent Director for a second five-year term starting April 2, 2026. Agarwal, a Chartered Accountant since 1974 with a Commerce degree from University of Ranchi, previously served on boards of SMC Global Securities Limited and Moneywise Financial Services Private Limited. Shareholders also appointed M/s. Deepak Sharma & Associates as Secretarial Auditor for five years from Financial Year 2025-26 to 2029-30. The firm is led by Mr. Deepak Parasar Sharma, a practicing Company Secretary with over 20 years of experience in corporate laws, mergers and amalgamations, and legal advisory services.",
            "Sentiment": "neutral",
            "PublishDate": 1758731133211,
            "Source": "corporate_governance"
        },
        {
            "Title": "Signatureglobal Subsidiary Acquires 33.47 Acres in Gurugram for Real Estate Development",
            "Summary": "Signatureglobal Business Park Limited, a wholly owned subsidiary of Signatureglobal (India) Limited, executed three sale deeds on August 14, 2025, to purchase approximately 33.47 acres of land in Tehsil Sohna, District Gurugram, Haryana. The acquired land has a total developable area of about 1.76 million square feet. Of the purchased land, approximately 30.86 acres was previously in collaboration as disclosed in the company's Red Herring Prospectus dated September 12, 2023.",
            "Sentiment": "positive",
            "PublishDate": 1755197171360,
            "Source": "stock"
        },
        {
            "Title": "Signatureglobal Reports 7x Revenue Growth in Q1 FY2026, Approves Rs 8,750 Million Fundraising",
            "Summary": "Signatureglobal (India) Limited reported consolidated revenue of Rs 8,983.52 million for Q1 FY2026, up from Rs 1,279.83 million in Q1 FY2025. Net profit increased to Rs 435.00 million compared to Rs 67.96 million in the previous year. The company approved raising up to Rs 8,750 million through secured listed redeemable non-convertible debentures on private placement basis. It acquired the remaining equity stake in Indeed Fincap Private Limited for Rs 28.23 million, making it a wholly-owned subsidiary. The company also granted 850,000 stock options to eligible employees under its ESOP plan. EPS increased to Rs 2.45 per share from Rs 0.48 in Q1 FY2025.",
            "Sentiment": "positive",
            "PublishDate": 1754715858162,
            "Source": "earnings"
        },
        {
            "Title": "Signature Global Targets ₹10,000 Crore Sales by FY27 with Premium Housing Focus",
            "Summary": "Signature Global has set a target to achieve ₹10,000 crore in sales by FY27. The company is transitioning towards premium housing and strategically acquiring land while increasing construction activities. The company aims to achieve a 25% compound annual growth rate (CAGR) as it capitalizes on the affordable housing surge in the NCR region.",
            "Sentiment": "positive",
            "PublishDate": 1754583343789,
            "Source": "stock"
        },
        {
            "Title": "Signature Global Schedules Investor Call for August 8, 2025, Reports Q1 FY26 Results",
            "Summary": "Signature Global (India) Limited has scheduled an investors/analysts call for August 8, 2025, and provided the presentation materials. The company reported sales of INR 26.4 billion in Q1 FY26 compared to INR 31.2 billion in Q1 FY25, achieving approximately 21% of annual sales guidance. Average sales realization increased to INR 16,296 per square foot in Q1 FY26 from INR 12,457 per square foot in FY25, driven by the launch of premium project 'Cloverdale SPR'. Collections stood at INR 9.3 billion versus INR 12.1 billion in the previous year quarter, representing about 15% of collection guidance. The company achieved operating cash surplus of INR 1.9 billion before land investment. Revenue from operations was INR 8.7 billion with adjusted EBITDA of INR 1.0 billion (11.6% margin) and profit after tax of INR 0.3 billion. Net debt remained stable at INR 8.9 billion as of June 30, 2025. The company has a portfolio of 50.8 million square feet saleable area with 9.2 million square feet ongoing projects, 17.1 million square feet recent launches, and 24.5 million square feet forthcoming projects.",
            "Sentiment": "neutral",
            "PublishDate": 1754582052645,
            "Source": "stock"
        },
        {
            "Title": "Signature Global India Reports Strong Q1 Growth with 5x Revenue Increase",
            "Summary": "Signature Global India delivered robust quarterly results with revenue surging to 8.65 billion rupees from 4 billion rupees year-over-year. The company turned around its EBITDA performance, posting 332 million rupees compared to a loss of 15 million rupees in the same period last year. EBITDA margin improved significantly to 3.83% from negative 0.37% year-over-year. Consolidated net profit rose substantially to 344 million rupees from 68 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754579132767,
            "Source": "earnings"
        },
        {
            "Title": "Signatureglobal Alters Articles of Association to Allow Nominee Director Appointments",
            "Summary": "Signatureglobal (India) Limited has approved an alteration to its Articles of Association through a special resolution passed by postal ballot on August 1, 2025. The amendment adds Article 98A, which allows the Board of Directors to appoint a Nominee Director upon request from Debenture Trustees. This provision aligns with Securities and Exchange Board of India (Debenture Trustees) Regulations, 1993. The altered Articles of Association will be available on the company's website.",
            "Sentiment": "neutral",
            "PublishDate": 1754147754585,
            "Source": "corporate_action"
        },
        {
            "Title": "SignatureGlobal Plans Rs 6,000 Crore Housing Launch in Gurugram Despite Q1 Sales Decline",
            "Summary": "SignatureGlobal India Ltd plans to launch homes worth Rs 6,000 crore in Gurugram during the current quarter, covering 3.5-4 million square feet of space. The company was the fifth-largest listed real estate firm in terms of sales bookings, with record pre-sales of Rs 10,290 crore last fiscal. However, sales bookings declined 15% to Rs 2,640 crore in the June quarter compared to Rs 3,120 crore year-ago, with unit sales dropping to 778 homes from 968 units. Chairman Pradeep Kumar Aggarwal noted strong demand in the Rs 2-4 crore category and dismissed concerns about a housing market bubble in Gurugram. The company maintains its target to sell Rs 12,500 crore worth of homes this fiscal and plans to raise Rs 875 crore through non-convertible debentures. Net profit jumped to Rs 101.2 crore last fiscal from Rs 16.32 crore previously, while total income grew to Rs 2,637.99 crore from Rs 1,324.55 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1753007273408,
            "Source": "stock"
        },
        {
            "Title": "Signatureglobal (India) Ltd.: Q1 Pre-Sales Drop 15% YoY, Rise 63% QoQ",
            "Summary": "Signatureglobal reported Q1FY26 pre-sales of Rs 2,640 crore, down 15% YoY but up 63% QoQ. Average sales realization increased to Rs 16,296 per sq. ft. Collections were Rs 930 crore, and net debt stood at Rs 890 crore. The company acquired 10 acres in Sohna with 0.53 million sq. ft. development potential.",
            "Sentiment": "neutral",
            "PublishDate": 1751999810000,
            "Source": "earnings"
        },
        {
            "Title": "Signature Global Reports Strong Growth and Confidence in FY26 Targets",
            "Summary": "Signature Global has expressed confidence in achieving its FY26 targets, citing 49.8 million sq. ft. of ongoing projects. The company has reported a significant sales growth of 57% from FY21 to FY25. This growth trajectory and substantial project pipeline suggest a positive outlook for the real estate firm's future performance.",
            "Sentiment": "positive",
            "PublishDate": 1751993670000,
            "Source": "normal_news"
        },
        {
            "Title": "Signature Global Reports ₹26.4 Billion in Pre-Sales for Q1 FY26",
            "Summary": "Signature Global, a real estate company, has announced pre-sales of ₹26.4 billion for the first quarter of fiscal year 2026. This figure indicates strong sales growth for the company in the real estate sector.",
            "Sentiment": "positive",
            "PublishDate": 1751992649000,
            "Source": "default"
        },
        {
            "Title": "Signature Global India Ltd: Plans Rs 2,200 Crore Investment in New Gurugram Housing Project",
            "Summary": "Signature Global India Ltd is investing Rs 2,200 crore in a new premium housing project 'Cloverdale' in Gurugram, featuring 770 apartments. The company aims to achieve over 20% growth in pre-sales this fiscal year, targeting Rs 12,500 crore. Additionally, they plan to raise Rs 875 crore through non-convertible debentures for debt refinancing and business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1751186429000,
            "Source": "corporate_action"
        },
        {
            "Title": "Signature Global Plans to Raise ₹875 Crore Through Debentures",
            "Summary": "Signature Global aims to raise ₹875 crore by August through the issuance of debentures. The funds will be used to pay off existing debt and support future growth initiatives of the company.",
            "Sentiment": "positive",
            "PublishDate": 1750926502000,
            "Source": "default"
        },
        {
            "Title": "SignatureGlobal Receives Approval for NCD Issuance",
            "Summary": "SignatureGlobal has obtained approval to issue Non-Convertible Debentures (NCDs) worth up to 8.75 billion rupees.",
            "Sentiment": "positive",
            "PublishDate": 1750857867000,
            "Source": "default"
        },
        {
            "Title": "Signature Global's Subsidiary Acquires Land in Sohna, Gurugram",
            "Summary": "A subsidiary of Signature Global has purchased land in Sohna, Gurugram. The acquired land covers 0.53 million square feet, providing nearly 10 acres of development opportunity. This acquisition suggests potential for future real estate development projects in the area.",
            "Sentiment": "positive",
            "PublishDate": 1750697404000,
            "Source": "default"
        },
        {
            "Title": "SignatureGlobal (India) to Consider Fundraising via Non-Convertible Debentures",
            "Summary": "SignatureGlobal (India) has announced plans to explore fundraising through Non-Convertible Debentures. The company will consider this option at a meeting scheduled for June 25.",
            "Sentiment": "neutral",
            "PublishDate": 1750432815000,
            "Source": "default"
        },
        {
            "Title": "SignatureGlobal Targets Significant Growth in Collections, Completions, and Sales",
            "Summary": "SignatureGlobal has announced ambitious targets for the coming year. The company expects collections to increase by over 40% to Rs. 60 billion. Completions are targeted to double, reaching Rs. 48 billion. Sales are expected to achieve an implied EBITDA of 35%. The company aims for a surplus exceeding 40% of collections. SignatureGlobal's guidance includes achieving Rs. 60 billion in collections, representing a 35% growth compared to the current year. The company is targeting fresh launches worth over Rs. 170 billion, with pre-sales expected to grow by more than 20% to Rs. 125 billion.",
            "Sentiment": "positive",
            "PublishDate": 1747624994000,
            "Source": "default"
        },
        {
            "Title": "SignatureGlobal India Reports Record Annual Pre-Sales of ₹103 Billion in FY25",
            "Summary": "SignatureGlobal India announced during a conference call that it has exceeded its pre-sale guidance for FY25, achieving a record annual pre-sale of ₹103 billion. This represents a significant year-over-year growth of 42%.",
            "Sentiment": "positive",
            "PublishDate": 1747624555000,
            "Source": "default"
        },
        {
            "Title": "Signature Global India Reports Q4 Financial Results",
            "Summary": "Signature Global India has released its Q4 financial results. The company's EBITDA increased to 435.6 million rupees from 201 million rupees year-over-year. The EBITDA margin improved to 8.37% from 2.9% in the same period. However, revenue decreased to 5.2 billion rupees from 6.94 billion rupees year-over-year. The consolidated net profit rose to 611 million rupees, up from 412 million rupees year-over-year and 291.2 million rupees quarter-over-quarter.",
            "Sentiment": "mixed",
            "PublishDate": 1747326036000,
            "Source": "result"
        },
        {
            "Title": "Signature Global India Ltd: Q4 Sale Bookings Drop 61% to Rs 1,620 Crore",
            "Summary": "Signature Global reported Q4 FY24 sale bookings of Rs 1,620 crore, down 61% YoY. FY25 pre-sales rose 42% to Rs 10,290 crore, surpassing annual guidance. Annual collections increased 41% to Rs 4,380 crore. Net debt reduced to Rs 880 crore by FY25 end. Company acquired 47.71 acres in FY25 with 7.97 million sq ft development potential.",
            "Sentiment": "neutral",
            "PublishDate": 1744127632000,
            "Source": "earnings"
        },
        {
            "Title": "Signature Global Reduces Net Debt in FY25",
            "Summary": "Signature Global has reported a significant reduction in its net debt, which decreased to ₹8.8 billion at the end of fiscal year 2025, down from ₹11.6 billion in fiscal year 2024. This represents a substantial improvement in the company's financial position.",
            "Sentiment": "positive",
            "PublishDate": 1744122090000,
            "Source": "corporate_action"
        },
        {
            "Title": "Signature Global Achieves Record Pre-Sales in FY25",
            "Summary": "Signature Global reported its highest-ever annual pre-sales of ₹102.9 billion for the fiscal year 2025, exceeding its guidance with a 42% year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1744121922000,
            "Source": "result"
        },
        {
            "Title": "Signatureglobal India's Unit Acquires Land for Potential 2 Million Sqft Development",
            "Summary": "A subsidiary of Signatureglobal (India) has purchased land with the potential for developing approximately 2 million square feet. This acquisition suggests the company is expanding its real estate portfolio and preparing for future development projects.",
            "Sentiment": "positive",
            "PublishDate": 1742516319000,
            "Source": "corporate_action"
        },
        {
            "Title": "SignatureGlobal Unit Acquires Land for 2 Million Sq Ft Development",
            "Summary": "A subsidiary of SignatureGlobal (India) has purchased land with the potential to develop approximately 2 million square feet. This acquisition suggests the company is expanding its real estate portfolio and planning for future development projects.",
            "Sentiment": "positive",
            "PublishDate": 1742484534000,
            "Source": "corporate_action"
        },
        {
            "Title": "Signature Global Reports Strong Pre-Sales Growth",
            "Summary": "Signature Global, a real estate company, has reported significant growth in pre-sales. According to CNBC TV18, the company's pre-sales were approximately ₹7,300 crore last year and are expected to reach around ₹10,000 crore this year, indicating a substantial increase in their sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1742275380000,
            "Source": "earnings"
        }
    ]
}