{
    "Symbol": "SIGNPOST",
    "ISIN": "INE0KGZ01021",
    "News": [
        {
            "Title": "Signpost India Q3FY26 Results: Revenue Up 26.9%",
            "Summary": "Signpost India Limited reported strong Q3FY26 results with revenue rising 26.9% YoY to ₹14,234.22 lakh. Net profit surged 215% to ₹1,811.34 lakh. Company also appointed new Company Secretary.",
            "Sentiment": "positive",
            "PublishDate": 1770649891044,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signpost India Board Meet on Feb 9 for Q3FY26 Results",
            "Summary": "Signpost India Limited has scheduled its board meeting for February 09, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 01, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769770324265,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signpost India CSO Roch Dsouza Resigns for Better Opportunity",
            "Summary": "Signpost India Limited announces resignation of Chief Strategy Officer Mr. Roch Dsouza effective January 30, 2026, citing better career opportunity as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1769769785934,
            "Source": "stocks"
        },
        {
            "Title": "Signpost India Completes Promoter Reclassification",
            "Summary": "Signpost India Limited successfully reclassified certain promoter and promoter group shareholders to public category following postal ballot approval, with promoter holding now at 60.38%.",
            "Sentiment": "neutral",
            "PublishDate": 1769080350484,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signpost India postal ballot results announced",
            "Summary": "Signpost India Limited successfully passes two key resolutions through postal ballot voting, including appointment of independent director and promoter reclassification with over 99% approval rates.",
            "Sentiment": "positive",
            "PublishDate": 1769001797855,
            "Source": "co_actions_results"
        },
        {
            "Title": "Signpost India's Company Secretary Jenny Shah Resigns",
            "Summary": "Signpost India Limited announces resignation of Company Secretary Ms. Jenny Shah effective January 16, 2026, citing better opportunity as reason for departure from key managerial position.",
            "Sentiment": "neutral",
            "PublishDate": 1768566629193,
            "Source": "stocks"
        },
        {
            "Title": "Signpost India Receives Stock Exchange Approval for Promoter Reclassification",
            "Summary": "Signpost India Limited received no-objection letters from BSE and NSE for reclassifying three individuals (Wiren Chand Suchanti, Navin Chand Suchanti, Pramina Suchanti) and one entity (Pressman Realty Private Limited) from promoter/promoter group category to public shareholders category. The reclassification was approved under Regulation 31A of SEBI Listing Regulations, following the company's application dated July 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1764767463827,
            "Source": "corporate_action"
        },
        {
            "Title": "Signpost India Releases First Investor Presentation Covering Q2 and H1 FY26 Financial Performance",
            "Summary": "Signpost India Limited submitted its first investor presentation to stock exchanges covering financial performance for the second quarter and half year ended September 30, 2025. The presentation will be used in future investor and analyst meetings and has been uploaded to the company's website for stakeholder reference.",
            "Sentiment": "neutral",
            "PublishDate": 1763350309942,
            "Source": "stock"
        },
        {
            "Title": "Signpost India Reports 15.7% Revenue Growth in Q2 FY26, Appoints New Independent Director",
            "Summary": "Signpost India Limited reported revenue from operations of Rs 13,402.47 lakh for the quarter ended September 30, 2025, compared to Rs 12,970.24 lakh in the same period last year. The company's profit after tax increased to Rs 1,561.94 lakh from Rs 1,586.69 lakh in the previous year quarter. For the half-year period, revenue grew to Rs 27,167.22 lakh from Rs 23,016.99 lakh year-on-year, while profit after tax rose to Rs 3,089.96 lakh from Rs 2,707.56 lakh. The Board approved the appointment of Mr. Sanidhya Mittal as Additional Independent Director effective November 12, 2025, for a five-year term ending November 11, 2030, subject to member approval. Mr. Mittal serves as Joint Managing Director of Greenply Industries Limited and has extensive experience in sales, marketing, finance, and business development. The company operates in a single reportable segment of advertising business.",
            "Sentiment": "positive",
            "PublishDate": 1762913856460,
            "Source": "corporate_action"
        },
        {
            "Title": "Income Tax Department Visits Signpost India's Subsidiary Under Section 132 Proceedings",
            "Summary": "Income Tax Department officials visited Signpost India Ltd's subsidiary, S2 Signpost India Pvt. Ltd., in Mumbai as part of proceedings under Section 132 of the Income Tax Act. The subsidiary was formed to conduct advertising business operations for Netaji Subhash Chandra Bose International Airport in Kolkata. Signpost India is cooperating with the officials and states there is currently no material impact on the parent company's business operations. The company will make further disclosures if any material updates arise that require regulatory intimation.",
            "Sentiment": "neutral",
            "PublishDate": 1760547858951,
            "Source": "stock"
        },
        {
            "Title": "Signpost India Secures Exclusive Advertising Rights for 67 Metro Stations in 9-Year Deal",
            "Summary": "Signpost India has been awarded exclusive advertising rights for 67 metro stations under a 9-year contract. The deal has a revenue potential of 6-7 billion rupees over the contract period.",
            "Sentiment": "positive",
            "PublishDate": 1756080667158,
            "Source": "stock"
        },
        {
            "Title": "Signpost India Secures Exclusive Advertising Rights for 67 Metro Stations",
            "Summary": "Signpost India has obtained exclusive advertising rights for 67 metro stations under a 9-year agreement. The company estimates the revenue potential from this contract at 6-7 billion rupees over the contract period.",
            "Sentiment": "positive",
            "PublishDate": 1755865261362,
            "Source": "stock"
        },
        {
            "Title": "Signpost India Reports Strong Q1 Results with 37% Revenue Growth, Appoints New Independent Director",
            "Summary": "Signpost India Limited announced its Q1 results for the quarter ended June 30, 2025, showing revenue from operations of Rs 13,764.75 lakh compared to Rs 10,046.75 lakh in the same quarter last year, representing a 37% increase. Profit after tax rose to Rs 1,528.02 lakh from Rs 1,120.87 lakh year-over-year. The company appointed Mrs. Amita Desai as Additional Independent Director for a 5-year term from August 14, 2025 to August 13, 2030, subject to shareholder approval. Mrs. Desai brings over 30 years of experience in corporate governance and compliance, and is a Fellow Member of ICSI and Registered Insolvency Professional. The company also saw leadership changes with Mr. Jitesh Rajput resigning as Company Secretary and Compliance Officer effective August 14, 2025, and Ms. Jenny Shah being appointed to the same role from August 15, 2025. Ms. Shah has over 18 years of experience in corporate secretarial functions and previously worked with companies including Mahindra Holidays & Resorts and J.B. Chemicals & Pharmaceuticals.",
            "Sentiment": "positive",
            "PublishDate": 1755187491097,
            "Source": "earnings"
        },
        {
            "Title": "Signpost India Corrects Board Meeting Outcome on Senior Management Appointments",
            "Summary": "Signpost India Limited issued a correction regarding their board meeting outcome from July 04, 2025. The company clarified that Mr. Roch Dsouza (Chief Strategy Officer) and Mrs. Swati Sinha (Head – Human Resources) were appointed as Senior Management Personnel, not Key Managerial Personnel as initially reported. Both appointments were effective from July 04, 2025. Mr. Dsouza brings over 20 years of strategy and marketing experience with companies like Parle, Bisleri, Pantaloons, Future Group, and Metro Brands. Mrs. Sinha has close to 20 years of HR experience across different industries, specializing in talent strategy and organizational development. The company described the initial misstatement as an inadvertent oversight.",
            "Sentiment": "neutral",
            "PublishDate": 1754649159727,
            "Source": "corporate_action"
        },
        {
            "Title": "Signpost India: Bengaluru Advertising Operations Resume After Court Order",
            "Summary": "Karnataka High Court allows Signpost India to resume advertising operations in Bengaluru, overturning a previous notice to dismantle structures. The company can now continue its 20-year PPP agreement, which includes maintaining traffic surveillance kiosks and generating ad revenue from 400 prime junctions.",
            "Sentiment": "positive",
            "PublishDate": 1751621776000,
            "Source": "order&deals"
        },
        {
            "Title": "Signpost India Reports Decline in Q4 EBITDA and Net Profit",
            "Summary": "Signpost India has reported its Q4 financial results. The company's EBITDA decreased to 124 million rupees from 303 million rupees year-over-year. The EBITDA margin fell to 11.18% from 29.30% in the same period last year. Net profit for Q4 dropped to 9 million rupees, compared to 179 million rupees year-over-year and 57 million rupees quarter-on-quarter. However, revenue increased to 1.1 billion rupees from 1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748619968000,
            "Source": "result"
        },
        {
            "Title": "Signpost India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Signpost India experienced a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 185 million rupees from 223 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin declined to 16.44% from 21.35% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739517164000,
            "Source": "earnings"
        },
        {
            "Title": "Signpost India Reports Q3 Revenue Growth",
            "Summary": "Signpost India has announced its third quarter revenue results. The company reported revenue of 1.12 billion rupees, compared to 1 billion rupees in the same quarter of the previous year, indicating a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1739517023000,
            "Source": "earnings"
        },
        {
            "Title": "Signpost India Reports Decline in Q3 Net Profit",
            "Summary": "Signpost India has reported a net profit of 57 million rupees for the third quarter, down from 95 million rupees in the same period last year. This represents a significant year-over-year decrease in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1739516989000,
            "Source": "earnings"
        },
        {
            "Title": "Signpost India Reports Strong Q2 Financial Performance",
            "Summary": "Signpost India has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 262 million rupees from 112 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 20.25% from 13.11% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731567791000,
            "Source": "result"
        },
        {
            "Title": "Signpost India Reports Strong Q2 Revenue Growth",
            "Summary": "Signpost India has announced its Q2 revenue of 1.3 billion rupees, showing a significant increase from 852 million rupees in the same quarter last year. This represents a year-over-year growth of approximately 52.6%.",
            "Sentiment": "positive",
            "PublishDate": 1731567692000,
            "Source": "result"
        },
        {
            "Title": "Signpost India Reports Significant Profit Growth in Q2",
            "Summary": "Signpost India has reported a consolidated net profit of 159 million rupees for the second quarter, compared to 64 million rupees in the same period last year, marking a substantial year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731567652000,
            "Source": "result"
        }
    ]
}