{
    "Symbol": "SIL",
    "ISIN": "INE173A01025",
    "News": [
        {
            "Title": "Standard Industries Q3FY26 Loss Widens to ₹385.56 Cr",
            "Summary": "Standard Industries reported a net loss of ₹385.56 crores for Q3FY26, compared to ₹639.42 crores loss in Q3FY25. Revenue from operations grew 29% YoY to ₹716.38 crores. Board declared interim dividend of ₹0.55 per share.",
            "Sentiment": "negative",
            "PublishDate": 1770887492363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Standard Industries Reports Net Loss of Rs 769.86 Lakhs in H1 FY2026",
            "Summary": "Standard Industries Limited reported a consolidated net loss of Rs 769.86 lakhs for the six months ended September 30, 2025, compared to a loss of Rs 341.08 lakhs in the corresponding period last year. The company's revenue from operations increased to Rs 1,687.77 lakhs from Rs 1,136.52 lakhs year-over-year. For the quarter ended September 30, 2025, the company posted a net loss of Rs 665.21 lakhs versus Rs 206.13 lakhs in the same quarter last year. The company sold 9,04,845 equity shares in Duville Estates Pvt. Ltd. at Rs 212 per share, with the profit of Rs 1,954.43 lakhs included in Other Comprehensive Income. Standard Industries operates through property division, trading, and manufacturing segments, with trading contributing Rs 1,407.37 lakhs to revenue in the first half.",
            "Sentiment": "negative",
            "PublishDate": 1762157156384,
            "Source": "earnings"
        },
        {
            "Title": "Standard Industries Limited Sells Entire 9.64% Stake in Duville Estates Private Limited",
            "Summary": "Standard Industries Limited's Board of Directors approved the sale of its complete shareholding in Duville Estates Private Limited. The transaction involves 14,47,714 equity shares priced at Rs.212 per share, representing 9.64% of Duville Estates' share capital. Following the sale, Standard Industries will no longer hold any shares in Duville Estates Private Limited. The company stated this transaction is not a related party transaction, and Duville Estates is not an associate company. No promoter, promoter group, or group companies have any interest in this transaction. The sale is expected to complete by September 30, 2025, and may be executed in one or more tranches.",
            "Sentiment": "neutral",
            "PublishDate": 1756121768015,
            "Source": "corporate_action"
        },
        {
            "Title": "Standard Industries Reports Net Loss of ₹102 Crore in Q1 FY26",
            "Summary": "Standard Industries Limited reported a net loss of ₹101.99 crore for the quarter ended June 30, 2025, compared to a loss of ₹137.97 crore in the same period last year. Revenue from operations increased to ₹1,049.49 crore from ₹683.70 crore year-on-year. The company operates through property, trading, and manufacturing divisions, with trading contributing ₹796.84 crore and manufacturing ₹252.65 crore to quarterly revenue. Total expenses stood at ₹1,447.66 crore. The company holds an investment of ₹5,969.82 lakhs in its wholly-owned subsidiary Standard Salt Works Limited. Basic and diluted earnings per share were negative at ₹0.16 each. The board meeting was held on August 1, 2025, to approve these unaudited financial results.",
            "Sentiment": "negative",
            "PublishDate": 1754036358744,
            "Source": "earnings"
        },
        {
            "Title": "Standard Industries: Q3 FY25 Loss Widens, Revenue Grows",
            "Summary": "Standard Industries reported Q3 FY25 results with revenue increasing 46.21% YoY to ₹7.72 crore, but loss widened by 113.69% YoY to ₹5.62 crore. Operating income improved 25.42% YoY. EPS declined to ₹-0.87, down 112.2% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739345749000,
            "Source": "earnings"
        }
    ]
}