{
    "Symbol": "SILINV",
    "ISIN": "INE923A01015",
    "News": [
        {
            "Title": "SW Investments Q3FY26 Net Profit Rises 26.32% YoY",
            "Summary": "SW Investments Limited reported net profit of ₹5.76 lakhs for Q3FY26, up 26.32% YoY. Revenue from operations grew 47.42% to ₹11.72 lakhs while nine-month profit surged 112.33% to ₹16.01 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770294373225,
            "Source": "co_actions_results"
        },
        {
            "Title": "SIL Investments Q3FY26 Profit Jumps 29% to ₹1,659 Lakhs",
            "Summary": "SIL Investments Limited reported standalone net profit of ₹1,659 lakhs for Q3FY26, up 29% YoY. Total income rose to ₹2,286 lakhs driven by dividend income of ₹1,645 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1770192481271,
            "Source": "co_actions_results"
        },
        {
            "Title": "SIL Investments Board Meet Set for Feb 4, 2026",
            "Summary": "SIL Investments Limited has scheduled a board meeting on February 04, 2026, to consider and approve unaudited financial results for Q3FY26 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769093514123,
            "Source": "stocks"
        },
        {
            "Title": "How Market Crashes Impact SIP Investments Over Time",
            "Summary": "Market crashes affect SIP investments through NAV declines, but systematic investing during downturns enables rupee cost averaging, allowing investors to accumulate more units at lower prices for long-term wealth creation.",
            "Sentiment": "neutral",
            "PublishDate": 1768910443430,
            "Source": "mutualfunds"
        },
        {
            "Title": "SIL Investments Board Approves Independent Director Appointment and Rs 250 Crore Loan Proposals",
            "Summary": "SIL Investments Limited's Board approved seeking shareholder approval for appointing Shri Suresh Kumar Khandelia as Independent Director for 5 years effective January 1, 2026, and proposed granting unsecured loans totaling Rs 250 crore to six related party entities. The loan proposals include Rs 100 crore to Sutlej Textiles and Industries Limited and varying amounts to five other companies, requiring shareholder approval as Material Related Party Transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1763709686578,
            "Source": "corporate_governance"
        },
        {
            "Title": "SIL Investments Increases Stake in Morton Foods to 8.85% Through Rights Issue Participation",
            "Summary": "SIL Investments Limited acquired 10,61,454 additional equity shares in Morton Foods Limited through a rights issue subscription worth Rs. 2,44,13,442. The acquisition increases SIL's total holding in Morton Foods to 31,58,466 equity shares, representing 8.85% of Morton Foods' equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1763468847824,
            "Source": "stock"
        },
        {
            "Title": "SIL Investments Reports Strong Q2 Performance, Approves Rs 2.5 Crore Investment in Morton Foods",
            "Summary": "SIL Investments Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported standalone earnings per share of Rs 14.81 for the quarter, with total income of Rs 2,244 lakhs driven primarily by dividend income of Rs 2,010 lakhs and interest income of Rs 289 lakhs. The Board also approved an investment of up to Rs 2.5 crore in Morton Foods Limited through a rights issue. Morton Foods operates in the FMCG sector with products including canned fruits, vegetables, jams, and ready-to-eat meals, reporting a turnover of Rs 44.66 crore for 2024-25. On a consolidated basis, SIL Investments achieved earnings per share of Rs 18.44 for the quarter, with consolidated total income reaching Rs 2,795 lakhs. The company paid a final dividend of Rs 2.50 per equity share aggregating to Rs 264.90 lakhs to shareholders in August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762934459545,
            "Source": "earnings"
        },
        {
            "Title": "SIL Investments Reports Strong Q1 Performance with 480 Lakh Profit Despite Other Comprehensive Income Loss",
            "Summary": "SIL Investments Limited approved its unaudited financial results for the quarter ended June 30, 2025. The company reported a standalone profit of Rs. 480 lakhs compared to a loss of Rs. 133 lakhs in the previous quarter and Rs. 176 lakhs profit in the same quarter last year. Total income increased significantly to Rs. 897 lakhs from Rs. 125 lakhs in the previous quarter, driven by interest income of Rs. 304 lakhs, dividend income of Rs. 7 lakhs, and net gain on fair value changes of Rs. 488 lakhs. However, the company experienced a substantial other comprehensive loss of Rs. 14,443 lakhs, resulting in total comprehensive loss of Rs. 13,963 lakhs. On a consolidated basis, the company reported higher profit of Rs. 819 lakhs with total income of Rs. 1,367 lakhs. Basic and diluted earnings per share stood at Rs. 4.54 for standalone results and Rs. 7.47 for consolidated results. The company operates primarily in investments and financing activities segment.",
            "Sentiment": "neutral",
            "PublishDate": 1755156960460,
            "Source": "earnings"
        },
        {
            "Title": "SIL Investment Reports 126% Jump in Q1 Consolidated Net Profit to Rs 79 Million",
            "Summary": "SIL Investment reported a consolidated net profit of Rs 79 million for Q1, representing a significant increase from Rs 35 million in the same period last year. This marks a year-over-year growth of 126% in the company's quarterly earnings.",
            "Sentiment": "positive",
            "PublishDate": 1755155934958,
            "Source": "earnings"
        },
        {
            "Title": "SIL Investments Schedules Board Meeting to Approve Quarterly Financial Results",
            "Summary": "SIL Investments Limited has scheduled a Board of Directors meeting for August 14, 2025, to consider and approve the unaudited financial results for the quarter ended June 30, 2025. The meeting will address both standalone and consolidated financial results. The company has informed the National Stock Exchange of India and BSE Limited about this scheduled meeting through a formal communication signed by Company Secretary and Compliance Officer Lokesh Gandhi.",
            "Sentiment": "neutral",
            "PublishDate": 1753339620266,
            "Source": "corporate_action"
        }
    ]
}