{
    "Symbol": "SILVERTUC",
    "ISIN": "INE625X01018",
    "News": [
        {
            "Title": "Silver Touch Tech Q3 Net Profit Jumps 109% YoY",
            "Summary": "Silver Touch Technologies reports consolidated net profit of ₹110 million in Q3, marking significant 109% year-on-year growth from ₹52.6 million in previous year same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1770020489363,
            "Source": "co_actions_results"
        },
        {
            "Title": "Silver Touch Board Meet Set for Feb 2 Q3FY26 Results",
            "Summary": "Silver Touch Technologies schedules board meeting on February 2, 2026 to consider Q3FY26 unaudited financial results. Trading window closed from January 1, 2026 until 48 hours post results declaration.",
            "Sentiment": "neutral",
            "PublishDate": 1769240896338,
            "Source": "co_actions_results"
        },
        {
            "Title": "Silver Touch Wins Major UP E-Governance Project",
            "Summary": "Silver Touch Technologies Limited has been selected by the Transport Department, Government of Uttar Pradesh for a statewide E-Governance project involving Smart Card Driving Licences delivery and IT systems.",
            "Sentiment": "positive",
            "PublishDate": 1769058146150,
            "Source": "stocks"
        },
        {
            "Title": "Silver Touch Re-selected by MEA for Digital Platform",
            "Summary": "Silver Touch Technologies continues decade-long partnership with Ministry of External Affairs for strategic digital transformation engagement covering website redesign, development and maintenance.",
            "Sentiment": "positive",
            "PublishDate": 1769057576703,
            "Source": "stocks"
        },
        {
            "Title": "Silver Touch Technologies Holds Investor Meet",
            "Summary": "Silver Touch Technologies participated in a virtual investor interaction organized by Finportal Investments on January 19, 2026, covering business overview and growth strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1768830711537,
            "Source": "stocks"
        },
        {
            "Title": "Silver Touch Technologies Announces Stock Split & Bonus",
            "Summary": "Silver Touch Technologies seeks shareholder approval for 1:5 stock split (₹10 to ₹2 face value), capital increase to ₹30 crores, and 1:1 bonus share issue through postal ballot ending February 18, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768810294945,
            "Source": "co_actions_results"
        },
        {
            "Title": "Silver Touch Technologies Announces Stock Split & Bonus",
            "Summary": "Silver Touch Technologies board approves 1:5 stock split from ₹10 to ₹2 face value, 1:1 bonus issue, and authorized capital increase to ₹46 crores. Stock surges 135% in past year.",
            "Sentiment": "positive",
            "PublishDate": 1768555857172,
            "Source": "co_actions_results"
        },
        {
            "Title": "Silver Touch Technologies Announces Stock Split & Bonus",
            "Summary": "Silver Touch Technologies board approves 1:5 stock split from ₹10 to ₹2 face value, 1:1 bonus issue, and authorized capital increase to ₹46 crores, subject to shareholder approval via postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1768555775484,
            "Source": "co_actions_results"
        },
        {
            "Title": "Silver Touch Technologies Announces Stock Split & Bonus",
            "Summary": "Silver Touch Technologies board approves 1:5 stock split from ₹10 to ₹2 face value, 1:1 bonus issue, and authorized capital increase to ₹46 crores, subject to shareholder approval via postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1768555686147,
            "Source": "co_actions_results"
        },
        {
            "Title": "Silver Touch Technologies Surges 80% in 14 Sessions",
            "Summary": "Silver Touch Technologies shares jumped 80% in 14 sessions before announcing 1:5 stock split and 1:1 bonus issue. Stock gained 4.1% on Friday after corporate action announcement.",
            "Sentiment": "positive",
            "PublishDate": 1768555351644,
            "Source": "co_actions_results"
        },
        {
            "Title": "Silver Touch Technologies Board Approves Share Split & Bonus",
            "Summary": "Silver Touch Technologies' board approved share subdivision from ₹10 to ₹2, capital increase to ₹46 crores, and 1:1 bonus issue. All proposals require shareholder approval through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1768555294331,
            "Source": "co_actions_results"
        },
        {
            "Title": "Silver Touch Wins National Digital Platform Project",
            "Summary": "Silver Touch Technologies secures major government order to develop unified digital transformation platform for Government of India portals, strengthening digital governance ecosystem.",
            "Sentiment": "positive",
            "PublishDate": 1768218212548,
            "Source": "co_actions_results"
        },
        {
            "Title": "Silver Touch Wins Indian Navy IPADSV2 Defense Contract",
            "Summary": "Silver Touch Technologies secures prestigious Indian Navy IPADSV2 mandate for digital transformation platform implementation, strengthening defense portfolio and enhancing multi-year revenue visibility.",
            "Sentiment": "positive",
            "PublishDate": 1767006094694,
            "Source": "co_actions_results"
        },
        {
            "Title": "SilverTouch Technologies Gets Credit Ratings Reaffirmed by Infomerics",
            "Summary": "SilverTouch Technologies received reaffirmation of its credit ratings from Infomerics Valuation and Rating Limited, with long-term bank facilities of Rs 48.91 crores and short-term facilities of Rs 25.00 crores maintaining IVRBBB/Stable and IVRA2 ratings respectively. The company also saw enhancements in facility limits and withdrawal of a Rs 5.00 crore bank guarantee facility rating.",
            "Sentiment": "positive",
            "PublishDate": 1764674008972,
            "Source": "stock"
        },
        {
            "Title": "SilverTouch Technologies Reports Strong Q2FY26 Results with 69.55% PAT Growth",
            "Summary": "SilverTouch Technologies delivered robust quarterly results with revenue growing 14.25% YoY to ₹83.99 crores and PAT surging 69.55% to ₹7.46 crores, driven by steady execution in domestic e-governance projects and increased traction from overseas subsidiaries. The company secured strategic mandates from Airports Authority of India and National Medical Commission, reinforcing its position as a trusted technology partner for critical national infrastructure projects.",
            "Sentiment": "positive",
            "PublishDate": 1763121219609,
            "Source": "earnings"
        },
        {
            "Title": "Silver Touch Technologies Reports Strong Q2 Growth with 70% Jump in Net Profit",
            "Summary": "Silver Touch Technologies reported consolidated net profit of 75 million rupees in Q2, up from 44 million rupees in the same period last year. Revenue increased to 840 million rupees from 740 million rupees year-over-year. EBITDA rose significantly to 123 million rupees compared to 64.7 million rupees previously, while EBITDA margin expanded to 14.61% from 8.74% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762779386192,
            "Source": "earnings"
        },
        {
            "Title": "SilverTouch Technologies Wins National Medical Commission Digital Transformation Contract",
            "Summary": "SilverTouch Technologies Limited has been awarded the mandate to manage and modernize the National Medical Commission's Digital Mission Mode Project under the Ministry of Health and Family Welfare, Government of India. The company will serve as the Managed Service Provider responsible for the complete takeover, modernization, and operation of NMC's digital ecosystem covering 27 integrated modules, cloud infrastructure, and the National Command and Control Centre. The project will revamp existing systems using open-source, cloud-ready, and AI-powered architectures to enable enhanced performance, real-time monitoring, and interoperability across medical colleges, state medical councils, universities, and healthcare institutions. The initiative aims to improve medical education regulation, doctor registration and verification, data-driven policy decisions, and public transparency. Executive Director Himanshu Jain described the project as a mission to strengthen India's healthcare governance and align digital infrastructure with global standards.",
            "Sentiment": "positive",
            "PublishDate": 1762420138655,
            "Source": "order&deals"
        },
        {
            "Title": "Silver Touch Technologies Reports 11% Revenue Growth and 38% EBITDA Jump in Q1 FY26",
            "Summary": "Silver Touch Technologies Limited released its investor presentation for Q1 FY26, showing revenue from operations of ₹627.49 million, an 11% year-on-year increase from ₹566.62 million in Q1 FY25. EBITDA grew 38% to ₹90.28 million compared to ₹65.50 million in the previous year, with EBITDA margin improving by 200 basis points to 14%. Profit after tax increased 22% to ₹40.36 million from ₹33.20 million, while earnings per share rose 21% to ₹3.18. The company attributed growth to a larger order book, higher average order sizes, and increased focus on high-margin software development projects. Silver Touch operates across software services (51% of business), e-governance services (20%), system integration (15%), ERP implementation services (9%), and cloud & facility management services (5%). The IT services company has over 30 years of experience, serves 1500+ clients worldwide, employs 2000+ IT professionals, and has delivered 4000+ projects with global presence in India, USA, UK, and Canada.",
            "Sentiment": "positive",
            "PublishDate": 1758092033053,
            "Source": "earnings"
        },
        {
            "Title": "Silver Touch Technologies Secures Airports Authority of India Project Across 15 Airports",
            "Summary": "Silver Touch Technologies Limited has been awarded a contract by the Airports Authority of India for the Supply, Installation, Testing, and Commissioning of VHF Active Multicoupler systems and secure network security solutions across 15 airports in India. The project will be implemented in Air Traffic Control towers to enhance communication infrastructure and provide protection against intrusion. Executive Director Minesh V Doshi stated the company is proud to associate with AAI in developing the country's aviation infrastructure, emphasizing their focus on providing state-of-the-art, secure technology solutions for mission-critical environments.",
            "Sentiment": "positive",
            "PublishDate": 1757482570622,
            "Source": "order&deals"
        },
        {
            "Title": "Silver Touch Technologies Promoters Pledge 109,000 Shares as Loan Collateral",
            "Summary": "Four promoters of Silver Touch Technologies Limited have pledged a total of 109,000 shares as collateral for loans to be taken by the company. Vipul Haridas Thakkar (Managing Director) pledged 36,850 shares, Jignesh A Patel (Whole Time Director) pledged 36,850 shares, Minesh Vinodchandra Doshi (Whole Time Director) pledged 27,500 shares, and Palak Vinubhai Shah (Whole Time Director) pledged 8,800 shares. The pledging activities were disclosed under SEBI regulations for substantial acquisition of shares and takeovers. The company trades on BSE with scrip code 543525 and on NSE with symbol SILVERTUC.",
            "Sentiment": "neutral",
            "PublishDate": 1754629495763,
            "Source": "corporate_action"
        },
        {
            "Title": "Silver Touch Technologies Approves Q1 FY2026 Results, Recommends ₹0.50 Final Dividend",
            "Summary": "Silver Touch Technologies' Board approved unaudited financial results for Q1 FY2025-26 ended June 30, 2025. The company reported standalone revenue of ₹5,801.08 lakhs and net profit of ₹428.38 lakhs for the quarter. The Board recommended a final dividend of ₹0.50 per equity share (5%) for FY2024-25, subject to shareholder approval at the 31st Annual General Meeting scheduled for August 26, 2025. Key appointments include M/s. Sandip Sheth & Associates as Secretarial Auditors for five years from April 2025 to March 2030. The Board also approved re-appointments of several directors including Managing Director Vipul Haridas Thakkar for three years from April 2026 to March 2029, and Whole-time Directors for similar terms. The company set a record date of August 19, 2025 for dividend eligibility and approved increasing borrowing limits to ₹150 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754485686958,
            "Source": "corporate_action"
        },
        {
            "Title": "Silver Touch Technologies Board Approves Re-appointment of Five Directors for Three-Year Terms",
            "Summary": "Silver Touch Technologies' Board of Directors approved the re-appointment of five key executives for three-year terms, subject to shareholder approval at the 31st Annual General Meeting on August 26, 2025. Vipul Haridas Thakkar will continue as Managing Director from April 1, 2026 to March 31, 2029. Jignesh Amritlal Patel, Minesh Vinodchandra Doshi, and Palak Vinubhai Shah were re-appointed as Whole-time Directors for the same period. Himanshu Jain was re-appointed as Whole-time Director for a slightly different term from January 1, 2026 to December 31, 2028. All appointments were recommended by the Nomination and Remuneration Committee and include remuneration packages. The company trades on NSE under symbol SILVERTUC and on BSE with scrip code 543525.",
            "Sentiment": "positive",
            "PublishDate": 1753974354217,
            "Source": "corporate_governance"
        },
        {
            "Title": "Silver Touch Technologies Reports Q1 FY2026 Results, Recommends ₹0.50 Final Dividend",
            "Summary": "Silver Touch Technologies Ltd reported its Q1 FY2025-26 unaudited financial results for the quarter ended June 30, 2025. The Board recommended a final dividend of ₹0.50 per equity share for FY2024-25, subject to shareholder approval at the 31st Annual General Meeting scheduled for August 26, 2025. The company appointed M/s. Sandip Sheth & Associates as Secretarial Auditors for five years from April 2025 to March 2030. The Board approved re-appointments of key directors including Managing Director Vipul Haridas Thakkar and Whole-time Directors for three-year terms starting April 2026. The company also approved increasing borrowing limits to ₹150 crores for working capital and capital expenditure requirements. Record date for dividend eligibility is set for August 19, 2025, with the register of members closing from August 20-26, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753969615421,
            "Source": "corporate_action"
        },
        {
            "Title": "Silver Touch Tech Reports Strong Q1 Performance with 34% Jump in EBITDA",
            "Summary": "Silver Touch Tech delivered robust quarterly results with EBITDA rising to 86 million rupees from 64 million rupees year-over-year, representing a 34% increase. The company's EBITDA margin improved to 13.67% from 11.33% in the same period last year. Consolidated net profit grew to 40 million rupees compared to 33 million rupees year-over-year, while revenue increased to 627 million rupees from 567 million rupees, marking an 11% growth.",
            "Sentiment": "positive",
            "PublishDate": 1753969108976,
            "Source": "earnings"
        },
        {
            "Title": "Silver Touch Technologies Schedules Board Meeting for July 31, 2025 to Approve Q1 FY2026 Results and Final Dividend",
            "Summary": "Silver Touch Technologies Limited has scheduled a Board of Directors meeting for July 31, 2025 at 5:00 p.m. through video conferencing. The board will consider and approve standalone and consolidated unaudited financial results for the first quarter ended June 30, 2025, along with the auditor's limited review report. The meeting will also address recommending a final dividend on equity shares for the financial year ended March 31, 2025, subject to shareholder approval at the upcoming 31st Annual General Meeting. Additionally, the board will fix the date, time and venue for the Annual General Meeting. The company has implemented a trading window closure for designated persons from July 1, 2025 until August 2, 2025, which is 48 hours after the declaration of the quarterly results.",
            "Sentiment": "neutral",
            "PublishDate": 1753365779686,
            "Source": "corporate_action"
        },
        {
            "Title": "Silver Touch Technologies Appointed as Digital Transformation Partner by Gujarat Government",
            "Summary": "Silver Touch Technologies Ltd. has been appointed as the Digital Transformation Partner by the Industrial Extension Bureau (iNDEXTb) of the Government of Gujarat for their Investor Facilitation Portal (IFP) initiative. The IFP is designed to enhance Gujarat's ease of doing business by providing a unified digital platform for domestic and international investors. The platform will feature unified investor registration, integration with Gujarat Single Window System, real-time tracking of applications, automated workflows, digital documentation, and comprehensive reporting capabilities. Executive Director Minesh V Doshi stated the company is honored to collaborate on this initiative and contribute to Gujarat's vision of inclusive industrial growth and digital governance. Silver Touch Technologies is a global IT consulting and business process services company with presence across India, the United States, the United Kingdom, and Canada.",
            "Sentiment": "positive",
            "PublishDate": 1753265444365,
            "Source": "order&deals"
        },
        {
            "Title": "Silver Touch Tech Reports Q3 Financial Results",
            "Summary": "Silver Touch Tech has announced its Q3 financial results. The company's consolidated net profit increased to 53 million rupees, up from 47 million rupees in the same quarter last year. Revenue also saw significant growth, reaching 732 million rupees compared to 520 million rupees in the previous year's Q3.",
            "Sentiment": "positive",
            "PublishDate": 1738328714000,
            "Source": "earnings"
        },
        {
            "Title": "Silver Touch Tech Reports Q2 Financial Results",
            "Summary": "Silver Touch Tech announced its Q2 financial results. The company's EBIT (Earnings Before Interest and Taxes) increased to 64.7 million rupees, up from 47 million rupees in the same quarter last year. However, the EBIT margin decreased slightly to 8.74% from 9.12% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730202998000,
            "Source": "result"
        },
        {
            "Title": "Silver Touch Tech Reports Q2 Revenue Growth",
            "Summary": "Silver Touch Tech has announced its Q2 revenue of 740 million rupees, showing a significant increase from 515 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730202739000,
            "Source": "result"
        },
        {
            "Title": "Silver Touch Tech Reports Q2 Profit Increase",
            "Summary": "Silver Touch Tech announced its Q2 consolidated net profit of 44 million rupees, showing an increase from 36 million rupees year-over-year and 33 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730202727000,
            "Source": "result"
        }
    ]
}