{
    "Symbol": "SIMBHALS",
    "ISIN": "INE748T01016",
    "News": [
        {
            "Title": "Simbhaoli Sugars IRP Meeting Set for Feb 13, 2026",
            "Summary": "Simbhaoli Sugars schedules IRP meeting for February 13, 2026 to review Q3FY26 results. Company under CIRP since July 2024 following NCLT order.",
            "Sentiment": "neutral",
            "PublishDate": 1770379233525,
            "Source": "co_actions_results"
        },
        {
            "Title": "Simbhaoli Sugars Shuts Hapur Distillery Unit",
            "Summary": "Simbhaoli Sugars closes its Hapur distillery operations from February 5th, 2026, following CPCB environmental compliance directions under the Environment Protection Act.",
            "Sentiment": "negative",
            "PublishDate": 1770315278543,
            "Source": "stocks"
        },
        {
            "Title": "Simbhaoli Sugars Resumes Operations at Brijnathpur Unit",
            "Summary": "Simbhaoli Sugars Limited announces resumption of operations at its Brijnathpur unit following repair of 8MW turbine, effective January 24, 2026, after previous operational disruptions.",
            "Sentiment": "positive",
            "PublishDate": 1769692748875,
            "Source": "stocks"
        },
        {
            "Title": "Simbhaoli Sugars Cane Centers Reallocated Due to Turbine",
            "Summary": "Simbhaoli Sugars' 5 cane purchase centers at Brijnathpur unit reallocated to Bindals Papers Mills due to ongoing turbine breakdown. Repair expected by January 15, 2026 with 4-5 additional days for operations.",
            "Sentiment": "negative",
            "PublishDate": 1767180896222,
            "Source": "stocks"
        },
        {
            "Title": "Simbhaoli Sugars Commences Crushing Operations at Two Units for 2025-26 Season",
            "Summary": "Simbhaoli Sugars Limited started cane-crushing operations at its Simbhaoli Complex on November 7, 2025, and Brijnathpur Complex on November 6, 2025, while Chilwaria Complex remains non-operational due to lack of cane allocation. The company reported a slight reduction in cane allocation for the Simbhaoli and Brijnathpur units compared to the previous season.",
            "Sentiment": "neutral",
            "PublishDate": 1764227576921,
            "Source": "stock"
        },
        {
            "Title": "Simbhaoli Sugars Appoints New Company Secretary Under Insolvency Process",
            "Summary": "Simbhaoli Sugars Limited, currently under Corporate Insolvency Resolution Process, has appointed Ms. Jagriti Sharma as Company Secretary and Compliance Officer effective November 21, 2025. The appointment was made by Interim Resolution Professional Anurag Goel, who is managing the company's affairs after the Board of Directors' powers were suspended following NCLT order dated July 11, 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1763723350038,
            "Source": "corporate_governance"
        },
        {
            "Title": "Simbhaoli Sugars Delays Q2 Financial Results Due to Ongoing Insolvency Proceedings",
            "Summary": "Simbhaoli Sugars Limited has delayed submission of its unaudited financial results for the quarter ended September 30, 2025, citing procedural complexities arising from the Corporate Insolvency Resolution Process (CIRP) initiated on July 11, 2024. The delay is attributed to additional verification requirements, coordination among multiple parties during CIRP, departure of key finance personnel, and operational focus on the cane crushing season coinciding with the review period.",
            "Sentiment": "negative",
            "PublishDate": 1763128764992,
            "Source": "corporate_action"
        },
        {
            "Title": "Simbhaoli Sugars Company Secretary Anil Sharma Ceases Employment",
            "Summary": "Simbhaoli Sugars Limited announced that Company Secretary and Compliance Officer Anil Sharma (Membership No. A13430) ceased employment with effect from October 31, 2025. The company is under Corporate Insolvency Resolution Process (CIRP) with Anurag Goel serving as Interim Resolution Professional following NCLT Allahabad Bench order dated July 11, 2024. The Board of Directors' powers are suspended and vested with the IRP. The company has commenced the process of shortlisting potential candidates for the role and will finalize within prescribed SEBI timelines. A separate termination letter indicates the decision was based on performance review after completion of probation period on September 17, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762420537115,
            "Source": "corporate_governance"
        },
        {
            "Title": "Simbhaoli Sugars IRP Meeting Scheduled for October 28 to Review Quarterly Results",
            "Summary": "Simbhaoli Sugars Limited has scheduled an Interim Resolution Professional (IRP) convened meeting for October 28, 2025, to review standalone unaudited financial results for the quarter ended June 30, 2025. The company has been under Corporate Insolvency Resolution Process (CIRP) since July 11, 2024, following an order from the National Company Law Tribunal, Allahabad Bench. The trading window for company shares will remain closed until October 30, 2025, which is 48 hours after the financial results declaration. The meeting is being held in accordance with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760700958913,
            "Source": "corporate_action"
        },
        {
            "Title": "Simbhaoli Sugars Unable to Hold AGM by September 30, 2025 Due to Ongoing Insolvency Proceedings",
            "Summary": "Simbhaoli Sugars Limited announced it cannot hold its Annual General Meeting by September 30, 2025, due to ongoing Corporate Insolvency Resolution Process (CIRP) that began July 11, 2024. The company's management is currently under Interim Resolution Professional Anurag Goel, with the Board of Directors' powers suspended. A promoter, Ms. Gursimran Kaur Mann, has appealed the NCLT order at the National Company Law Appellate Tribunal, which issued an interim order on July 24, 2024, directing no further steps be taken. The company faces significant operational challenges including high employee turnover in finance and secretarial departments, delays in consolidated financial statements for the year ended March 31, 2025, and inability to form the Committee of Creditors due to the appellate proceedings. The company will announce the AGM date after receiving due approval.",
            "Sentiment": "negative",
            "PublishDate": 1757074266867,
            "Source": "corporate_action"
        },
        {
            "Title": "Simbhaoli Sugars Limited Announces Change in Statutory Auditors",
            "Summary": "Simbhaoli Sugars Limited notified stock exchanges about a change in their statutory auditors on August 27, 2025. The company submitted relevant disclosures to both the National Stock Exchange of India Limited and Bombay Stock Exchange Limited. The notification was signed by Anil Kumar, Company Secretary and Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1756297240605,
            "Source": "corporate_governance"
        },
        {
            "Title": "Simbhaoli Sugars Delays Financial Statements Due to Insolvency Process and Staff Departures",
            "Summary": "Simbhaoli Sugars Limited has been undergoing Corporate Insolvency Resolution Process since July 11, 2024, with Anurag Goel appointed as Interim Resolution Professional. The company's board powers have been suspended and transferred to the IRP. Promoter Gursimran Kaur Mann has filed an appeal with NCLAT, which issued an interim order on July 24, 2024, directing no further steps be taken. The company is experiencing delays in submitting financial statements due to senior finance department employees leaving during the insolvency process, causing difficulties in preparing annual and quarterly statements and coordinating with subsidiaries. Technical issues from previous years are affecting consolidated statements for March 2025. The company is working to resolve these issues and complete audits for both standalone and consolidated financial statements for various periods, with one subsidiary ICCPL having already provided its statements.",
            "Sentiment": "negative",
            "PublishDate": 1755071112820,
            "Source": "corporate_action"
        }
    ]
}