{
    "Symbol": "SIMPLEXINF",
    "ISIN": "INE059B01024",
    "News": [
        {
            "Title": "Simplex Infrastructures Wins Rs. 91.96 Crore Contract",
            "Summary": "Simplex Infrastructures Limited secures new power sector contract worth Rs. 91.96 crores, expected to strengthen company's order book and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1770397868656,
            "Source": "co_actions_results"
        },
        {
            "Title": "Simplex Infrastructures Wins ₹154 Cr Power EPC Deal",
            "Summary": "Simplex Infrastructures Limited has secured a new Engineering, Procurement and Construction (EPC) contract in the power sector worth approximately ₹154 crores, strengthening its project portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1768987896746,
            "Source": "co_actions_results"
        },
        {
            "Title": "Simplex Infrastructures Reports Strong Turnaround with Q2 Profit of 85M Rupees",
            "Summary": "Simplex Infrastructures achieved a net profit of 85 million rupees in Q2, reversing from a loss of 108 million rupees in the same period last year, despite revenue declining to 2.5 billion rupees from 2.7 billion rupees. The company's EBITDA surged to 160 million rupees from 30 million rupees year-over-year, with EBITDA margin improving significantly to 6.44% from 1.13%.",
            "Sentiment": "positive",
            "PublishDate": 1763130598328,
            "Source": "earnings"
        },
        {
            "Title": "Simplex Infrastructures Receives Trading Approval for Preferential Issue of 1.17 Million Equity Shares",
            "Summary": "Simplex Infrastructures Limited received trading approval from NSE and BSE for a preferential issue of 1,173,000 equity shares of Rs. 2 each at a premium of Rs. 292. The shares, bearing distinctive numbers from 78552347 to 79725346, were issued to non-promoters on a preferential basis. Trading commenced on September 16, 2025, with the securities now listed on both exchanges. The shares are subject to a lock-in period until March 15, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1758021626501,
            "Source": "corporate_action"
        },
        {
            "Title": "Simplex Infrastructures Submits Q1 FY2026 Financial Results to Stock Exchanges",
            "Summary": "Simplex Infrastructures Limited has submitted newspaper publications of its standalone and consolidated unaudited financial results for the quarter ended June 30, 2025, to stock exchanges including NSE, BSE, and Calcutta Stock Exchange. The company published its quarterly results in Financial Express (English) and Ekdin (Bengali) newspapers dated August 15, 2025, as required under Regulation 30 of LODR. The submission was made by B.L. Bajoria, Senior Vice President & Company Secretary.",
            "Sentiment": "neutral",
            "PublishDate": 1756293666163,
            "Source": "earnings"
        },
        {
            "Title": "Simplex Infrastructures Returns to Profit Despite 22.6% Revenue Decline in Q1",
            "Summary": "Simplex Infrastructures Limited reported total income from operations of Rs. 162.30 crore in Q1 FY2026, down from Rs. 209.69 crore in Q1 FY2025, representing a 22.6% decline. Despite the revenue drop, the company turned profitable with a net profit after tax of Rs. 3.52 crore compared to a loss of Rs. 10.52 crore in the same quarter last year. Earnings per share improved to Rs. 0.50 from negative Rs. 1.84 in the previous year. The results indicate improved operational efficiency and cost optimization despite lower topline performance.",
            "Sentiment": "positive",
            "PublishDate": 1755246088375,
            "Source": "earnings"
        },
        {
            "Title": "Simplex Infrastructures Reports Q1 Results, Announces Leadership Changes and Board Restructuring",
            "Summary": "Simplex Infrastructures Limited held a board meeting on August 13, 2025, approving unaudited financial results for Q1 ended June 30, 2025. The company reported standalone revenue of Rs. 153.53 crores and consolidated revenue of Rs. 281.94 crores. Key leadership changes include the retirement of CFO Sukumar Dutta effective September 1, 2025, and the appointment of Samiran Kumar Bhattacharyya as Whole-time Director and new CFO. The company also appointed new secretarial auditors and reconstituted board committees. Care Ratings Limited submitted monitoring agency reports for the company's preferential issue proceeds, showing Rs. 14.68 crores utilized out of Rs. 209.22 crores raised, with remaining funds maintained in share application accounts. The company has overdue debts of Rs. 296.83 crores to non-assigned lenders and continues discussions for debt restructuring.",
            "Sentiment": "neutral",
            "PublishDate": 1755096989460,
            "Source": "earnings"
        },
        {
            "Title": "Simplex Infra Reports Strong Quarterly Turnaround with 46M Rupees Net Profit",
            "Summary": "Simplex Infra delivered a significant quarterly performance improvement with EBITDA rising to 77 million rupees from 8.5 million rupees year-over-year, while EBITDA margin expanded to 3.15% from 0.29%. The company turned profitable with a consolidated net profit of 46 million rupees compared to a loss of 99 million rupees in the same period last year. However, revenue declined to 2.4 billion rupees from 2.96 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1755093040361,
            "Source": "earnings"
        },
        {
            "Title": "Simplex Infra Reports Q4 Net Profit of 434m Rupees, Revenue Decline",
            "Summary": "Simplex Infra announced its Q4 financial results. The company reported a consolidated net profit of 434 million rupees, compared to 1.64 billion rupees in the same quarter last year. This represents a year-over-year decline. Sequentially, the company reported a loss of 112 million rupees compared to the previous quarter. Q4 revenue stood at 2.8 billion rupees, down from 3.6 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748390429000,
            "Source": "default"
        },
        {
            "Title": "Simplex Infra Reports Q4 Financial Results",
            "Summary": "Simplex Infra announced its Q4 consolidated net profit at 434 million rupees, compared to 1.64 billion rupees year-over-year. The company reported a loss of 112 million rupees quarter-over-quarter. Q4 revenue stood at 2.8 billion rupees, down from 3.6 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748355898000,
            "Source": "result"
        },
        {
            "Title": "Simplex Infrastructures Signs Restructuring Agreement with NARCL",
            "Summary": "Simplex Infrastructures has executed a Master Restructuring Agreement with the National Asset Reconstruction Company Limited (NARCL). This agreement likely involves the restructuring of Simplex Infrastructures' debt or assets, potentially to improve the company's financial position or operational efficiency.",
            "Sentiment": "neutral",
            "PublishDate": 1736985817000,
            "Source": "corporate_action"
        },
        {
            "Title": "Simplex Infrastructures Executes Master Restructuring Agreement with NARCL",
            "Summary": "Simplex Infrastructures has entered into a Master Restructuring Agreement with the National Asset Reconstruction Company Limited (NARCL). This agreement suggests a significant financial restructuring for the company, potentially aimed at addressing debt or financial challenges. NARCL, being a government-backed 'bad bank', typically deals with distressed assets, indicating that this agreement could be part of a broader strategy to manage Simplex Infrastructures' financial obligations.",
            "Sentiment": "neutral",
            "PublishDate": 1736953617000,
            "Source": "corporate_action"
        },
        {
            "Title": "Simplex Infrastructures Reports Decline in Q2 EBITDA",
            "Summary": "Simplex Infrastructures experienced a significant decrease in its Q2 EBITDA, dropping from 55 million rupees in the previous year to 30 million rupees this year. The company's EBITDA margin also declined, falling from 1.77% to 1.13% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731587491000,
            "Source": "result"
        },
        {
            "Title": "Simplex Infrastructures Reports Increased Q2 Loss",
            "Summary": "Simplex Infrastructures reported a net loss of 108 million rupees in Q2, compared to a loss of 72 million rupees in the same quarter last year. The loss has also increased from 99 million rupees in the previous quarter. The company's revenue for Q2 decreased to 2.7 billion rupees from 3.1 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731587410000,
            "Source": "result"
        }
    ]
}