{
    "Symbol": "SINCLAIR",
    "ISIN": "INE985A01022",
    "News": [
        {
            "Title": "Sinclairs Hotels Q3 Net Profit Jumps to ₹58M",
            "Summary": "Sinclairs Hotels reported a significant increase in Q3 standalone net profit to ₹58 million compared to ₹11 million in the same quarter last year, marking strong year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1770018048659,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sinclairs Hotels Board Meet Set for Feb 2, 2026",
            "Summary": "Sinclairs Hotels Limited has scheduled a board meeting on February 2, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768393502929,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sinclairs Hotels Reports Profit Decline in H1 FY26, Launches New Udaipur Property",
            "Summary": "Sinclairs Hotels Limited reported a decline in profits for the quarter and half year ended September 30, 2025. The company attributed the reduction to notional diminution in investment values, initial expenses for the leased property Sinclairs Palace Retreat Udaipur, and losses from two Udaipur units. The company launched Sinclairs Palace Retreat Udaipur on August 1, 2025, spread over 5 acres with a 7000 sq.ft. banquet hall targeting destination weddings and corporate events. Current booking trends indicate revenue growth rebound, with operations in the third quarter starting strong. Year-on-year revenue in October 2025 grew by approximately 35%. The company operates 10 hotels across India with 581 rooms, targeting expansion to around 700 rooms. Promoters hold 62.66% stake with zero pledging. The company has consistently paid dividends for 16 years and completed three share buybacks since 2013.",
            "Sentiment": "neutral",
            "PublishDate": 1762944999318,
            "Source": "earnings"
        },
        {
            "Title": "Sinclairs Hotels Reports Loss of ₹203.59 Lakh in Q2 Despite Revenue Growth",
            "Summary": "Sinclairs Hotels Limited reported a net loss of ₹203.59 lakh for the quarter ended September 30, 2025, compared to a profit of ₹224.24 lakh in the same quarter last year. Revenue from operations increased to ₹898.48 lakh from ₹808.44 lakh year-over-year. For the half-year period, the company posted a profit of ₹414.89 lakh versus ₹909.05 lakh in the previous year. Total expenses for the quarter rose to ₹1,205.33 lakh, resulting in a loss before tax of ₹276.27 lakh. The company's 95-room hotel Sinclairs Palace Retreat Udaipur commenced operations on August 1, 2025. Other expenses included a diminution in fair value of investments amounting to ₹76.37 lakh. The board approved these unaudited financial results in a meeting held on November 10, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1762789200253,
            "Source": "earnings"
        },
        {
            "Title": "Sinclairs Hotels Reports Lower Q1 Profits Due to Operation Sindoor Impact, Launches New Udaipur Property",
            "Summary": "Sinclairs Hotels Limited reported lower profits for the quarter ended June 30, 2025, primarily due to Operation Sindoor affecting bookings in May, resulting in major cancellations across properties and an estimated revenue loss of Rs 2 crore. The company also incurred pre-opening expenses for its new property, Sinclairs Palace Retreat Udaipur, which commenced operations on August 1, 2025. Despite challenges, the company maintained a strong EBITDA margin of 50% and net profit margin of 32% for the quarter. Revenue from operations stood at Rs 1,569.31 lakh with net profit after tax of Rs 618.48 lakh. The new Udaipur property spans 5 acres with 95 rooms and features a 7,000 sq ft banquet hall, targeting destination weddings and corporate events. The company operates 10 hotels across India with 581 rooms and plans to expand to around 700 rooms by FY 26-27. Promoters hold 62.66% stake with zero pledge of shares.",
            "Sentiment": "neutral",
            "PublishDate": 1754658055714,
            "Source": "stock"
        },
        {
            "Title": "Sinclairs Hotels Reports Decline in Q1 Financial Performance",
            "Summary": "Sinclairs Hotels reported quarterly revenue of Rs 157 million, down from Rs 165 million in the same period last year. The company's net profit decreased to Rs 62 million from Rs 68 million year-over-year. EBITDA fell to Rs 59 million compared to Rs 74 million in the previous year, while EBITDA margin compressed to 37.9% from 45% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1754636334105,
            "Source": "earnings"
        },
        {
            "Title": "Sinclairs Hotels Reports Q4 EBITDA and Margin Decline",
            "Summary": "Sinclairs Hotels has reported its Q4 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 49 million rupees from 57 million rupees in the same quarter last year. The EBITDA margin also declined to 34.27% from 38.32% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1747726752000,
            "Source": "result"
        },
        {
            "Title": "Sinclairs Hotels Reports Q4 Net Profit of 38M Rupees",
            "Summary": "Sinclairs Hotels has reported a net profit of 38 million rupees for the fourth quarter, compared to 53 million rupees in the same period last year, indicating a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1747726496000,
            "Source": "result"
        },
        {
            "Title": "Sinclairs Hotels Reports Decline in Q2 EBITDA",
            "Summary": "Sinclairs Hotels experienced a decrease in Q2 EBITDA, dropping from 11.5 million rupees in the previous year to 7.7 million rupees. The company's EBITDA margin also declined from 13.50% to 9.53% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1731048367000,
            "Source": "result"
        },
        {
            "Title": "Sinclairs Hotels Reports Q2 Net Profit Increase",
            "Summary": "Sinclairs Hotels has reported a net profit of 22 million rupees for the second quarter, compared to 13 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731048209000,
            "Source": "result"
        }
    ]
}