{
    "Symbol": "SINDHUTRAD",
    "ISIN": "INE325D01025",
    "News": [
        {
            "Title": "Sindhu Trade Links CEO Alok Gupta Resigns",
            "Summary": "Sindhu Trade Links Limited announces resignation of CEO Alok Gupta effective January 31, 2026, citing personal reasons for departure from key managerial position.",
            "Sentiment": "neutral",
            "PublishDate": 1770028284566,
            "Source": "stocks"
        },
        {
            "Title": "Sindhu Trade Links Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Sindhu Trade Links Limited published its unaudited consolidated financial results for the quarter and half-year ended September 30, 2025, showing standalone net profit after tax of ₹636.44 lakhs compared to ₹1,454.53 lakhs in the same period last year. The company's total income from operations reached ₹41,423.71 lakhs on standalone basis, with the Board approving these results at their meeting held on November 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1763208799054,
            "Source": "earnings"
        },
        {
            "Title": "Sindhu Trade Links Reports Q1 FY2025 Results with Standalone Net Profit of ₹427.61 Lakhs",
            "Summary": "Sindhu Trade Links Limited's Board of Directors approved unaudited financial results for Q1 FY2025 ended June 30, 2025. On standalone basis, the company reported total income of ₹12,273.24 lakhs compared to ₹12,861.10 lakhs in Q1 FY2024. Net profit after tax stood at ₹427.61 lakhs versus ₹1,665.04 lakhs in the previous year quarter. On consolidated basis, total income was ₹17,443.07 lakhs against ₹56,096.59 lakhs in Q1 FY2024, with net profit of ₹1,879.34 lakhs compared to ₹7,149.67 lakhs. The company operates across four segments: Transportation, Logistics & Construction; Oil, Lubricants & Spares; Finance Operations; and Oil Drilling Operations. The Board also approved the notice for Annual General Meeting for FY2025 and appointed a scrutinizer for e-voting process.",
            "Sentiment": "neutral",
            "PublishDate": 1755091966360,
            "Source": "earnings"
        },
        {
            "Title": "Sindhu Trade Links Explores Investment Opportunities in Solar Power, Lithium, and Indonesian Mines",
            "Summary": "Sindhu Trade Links has announced several strategic initiatives for long-term growth. The company is exploring investment opportunities in a solar power project, demonstrating interest in renewable energy. Additionally, the board has approved plans to invest in lithium and rare earth minerals, aligning with the growing demand for these resources in various industries. Furthermore, Sindhu Trade Links has received approval to acquire mines in Indonesia, potentially expanding its resource portfolio and geographical presence.",
            "Sentiment": "positive",
            "PublishDate": 1752135914000,
            "Source": "default"
        },
        {
            "Title": "Sindhu Trade Links Reports Q4 Financial Results",
            "Summary": "Sindhu Trade Links has reported its Q4 financial results. The company's consolidated net loss for Q4 is 590 million rupees, compared to a loss of 1 billion rupees in the same quarter last year, showing a year-over-year improvement. However, compared to the previous quarter, the loss has increased from 75 million rupees. Q4 revenue stands at 2.97 billion rupees, down from 4.46 billion rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748607816000,
            "Source": "result"
        },
        {
            "Title": "Sindhu Trade Links Reports Q3 Financial Results",
            "Summary": "Sindhu Trade Links has reported its Q3 consolidated financial results. The company posted a net loss of 75 million rupees, which is an improvement compared to the 931 million rupees loss in the same quarter last year. However, it's a decline from the previous quarter's loss of 1.16 billion rupees. The company's revenue for Q3 increased to 5.1 billion rupees, up from 4.16 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739751523000,
            "Source": "earnings"
        },
        {
            "Title": "Sindhu Trade Links Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Sindhu Trade Links has reported a decrease in its Q3 EBITDA, which fell to 573 million rupees from 659 million rupees in the same quarter last year. The company's EBITDA margin also declined, dropping to 11.21% from 15.83% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739535047000,
            "Source": "earnings"
        },
        {
            "Title": "Sindhu Trade Links Reports Q3 Financial Results",
            "Summary": "Sindhu Trade Links has reported its Q3 financial results. The company experienced a consolidated net loss of 75 million rupees, compared to a loss of 931 million rupees in the same quarter last year and 1.16 billion rupees in the previous quarter. Revenue for Q3 increased to 5.1 billion rupees from 4.16 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1739534893000,
            "Source": "earnings"
        },
        {
            "Title": "Sindhu Trade Links to Sell 25% Stake in Coal Subsidiary",
            "Summary": "Sindhu Trade Links has announced plans to transfer a 25% stake in its subsidiary, Param Mitra Coal Resources Two. The sale is set to be completed for a consideration of $29 million.",
            "Sentiment": "neutral",
            "PublishDate": 1737719950000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sindhu Trade Links Reports Significant Increase in Q2 Other Income",
            "Summary": "Sindhu Trade Links has reported a substantial increase in its other income for the second quarter. The company's other income rose to 2.7 billion rupees, compared to 789 million rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1731589411000,
            "Source": "result"
        },
        {
            "Title": "Sindhu Trade Links Reports Q2 EBITDA Loss",
            "Summary": "Sindhu Trade Links has reported an EBITDA loss of 926 million rupees in the second quarter, compared to a gain of 195 million rupees in the same period last year. This represents a significant year-over-year decline in the company's operational performance.",
            "Sentiment": "negative",
            "PublishDate": 1731589364000,
            "Source": "result"
        },
        {
            "Title": "Sindhu Trade Links Reports Significant Profit Growth in Q2",
            "Summary": "Sindhu Trade Links has reported a substantial increase in consolidated net profit for the second quarter. The company's net profit rose to 1.16 billion rupees, up from 503 million rupees year-over-year and 715 million rupees quarter-over-quarter. However, revenue decreased slightly to 3.69 billion rupees from 3.96 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731589291000,
            "Source": "result"
        }
    ]
}