{
    "Symbol": "SIRCA",
    "ISIN": "INE792Z01011",
    "News": [
        {
            "Title": "Sirca Paints Reports No Deviation in Fund Usage",
            "Summary": "Sirca Paints India Limited confirms no deviation in utilization of Rs 75.29 crore raised through preferential issue for Q3 FY26, with funds deployed across manufacturing capex and working capital.",
            "Sentiment": "neutral",
            "PublishDate": 1769878748100,
            "Source": "stocks"
        },
        {
            "Title": "Sirca Paints Q3FY26 Revenue Jumps 27% to ₹11,279 Lakh",
            "Summary": "Sirca Paints India Limited reported strong Q3FY26 results with revenue rising 27.2% YoY to ₹11,278.60 lakh and net profit growing 31.2% to ₹1,503.45 lakh, driven by robust operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1769854247527,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sirca Paints Shares Investor Meet Audio Recording",
            "Summary": "Sirca Paints India Limited has published the audio recording of its investor interaction held on January 22, 2026, organized by Finportal Investments Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1769083911277,
            "Source": "stocks"
        },
        {
            "Title": "Sirca Paints India Receives Stock Exchange Approvals for Listing 1.984 Million Preferential Equity Shares",
            "Summary": "Sirca Paints India Limited has received in-principle approval from NSE and BSE for listing 1,984,000 equity shares of Rs. 10 each issued on preferential basis at a premium of Rs. 369.50 per share. The company will proceed with corporate actions through depositories and submit final trading applications to complete the listing process.",
            "Sentiment": "positive",
            "PublishDate": 1764404956007,
            "Source": "corporate_action"
        },
        {
            "Title": "Sirca Paints Reports 24% Revenue Growth in Q2FY26, Extends Italy Partnership Until 2041",
            "Summary": "Sirca Paints India Limited reported revenue growth of 24.37% to INR 131.17 crores in Q2FY26, with EBITDA increasing 44.52% to INR 27.40 crores and profit after tax rising 36.3% to INR 18.10 crores. The company extended its agreement with Sirca S.P.A Italy for brand distribution and manufacturing until 2041, while consolidating Wembley manufacturing units and targeting 35-40% CAGR growth with aspirations to reach INR 1,000 crores revenue by FY30.",
            "Sentiment": "positive",
            "PublishDate": 1763198492632,
            "Source": "earnings"
        },
        {
            "Title": "Sirca Paints Announces Expansion Strategy with New Product Lines and Enhanced Distribution Network",
            "Summary": "Sirca Paints has outlined an expansion strategy featuring the launch of new Wembley and Oikos product lines. The company plans to strengthen its retail presence through over 900 studios and OEM partnerships. Distribution expansion includes scaling to 20+ branches and 1,400+ outlets across India. Sirca Paints is targeting leadership in the premium wood and wall finishes segment while investing in brand-building under the tagline 'Your Italian Autograph' to increase market share.",
            "Sentiment": "positive",
            "PublishDate": 1762786479222,
            "Source": "stock"
        },
        {
            "Title": "Sirca Paints India Extends Technology Agreement with Italian Partner Until 2041",
            "Summary": "Sirca Paints India Limited has extended its agreement with Sirca S.p.A., Italy until 2041 for distribution, manufacturing, and use of the Sirca brand. Under the extended arrangement, Sirca Italy will transfer technical know-how to enable local manufacturing of high-quality acrylic, UV, and polyester-based wood coating products that are currently imported. The company will pay a royalty of 0.75% on reported turnover quarterly to Sirca Italy starting January 1, 2026. Sirca Italy holds 23,63,500 shares in Sirca Paints India Limited. The local production is expected to strengthen market position, enhance pricing power and product offerings, and improve inventory control and supply chain flexibility.",
            "Sentiment": "positive",
            "PublishDate": 1762762368981,
            "Source": "stock"
        },
        {
            "Title": "Sirca Paints India Reports Strong Q2 Growth with 39% Jump in Net Profit",
            "Summary": "Sirca Paints India delivered robust quarterly performance with net profit rising to 181 million rupees from 130 million rupees year-over-year. The company's revenue grew to 1.3 billion rupees compared to 1.06 billion rupees in the same period last year. EBITDA increased significantly to 274 million rupees from 190 million rupees, while EBITDA margin expanded to 20.9% from 17.98% year-over-year, indicating improved operational efficiency and profitability across key financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1762759076897,
            "Source": "earnings"
        },
        {
            "Title": "Sirca Paints India Limited Reconstitutes Board Committees with Leadership Changes",
            "Summary": "Sirca Paints India Limited's Board of Directors approved the re-constitution of four board committees effective September 11, 2025. Key changes include Mr. Aman Arora taking over as Chairperson of the Audit Committee from Mr. Shyam Lal Goyal, and becoming Chairperson of the Stakeholder Relationship Committee, replacing Mrs. Anu Chauhan. Mrs. Anu Chauhan retains her position as Chairperson of both the Nomination and Remuneration Committee and Risk Management Committee. The reconstituted committees include Audit Committee, Nomination and Remuneration Committee, Stakeholder Relationship Committee, and Risk Management Committee, with various membership adjustments across all committees involving directors Mr. Aman Arora, Mr. Shyam Lal Goyal, Mr. Sanjay Kapoor, Mrs. Anu Chauhan, and changes from the previous composition that included Mr. Apoorv Agarwal and Mr. Gurjit Singh Bains.",
            "Sentiment": "neutral",
            "PublishDate": 1757607969225,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sirca Paints India Sets September 5, 2025 as Record Date for ₹1.50 Final Dividend",
            "Summary": "Sirca Paints India Limited has set September 5, 2025 as the record date for a final dividend of ₹1.50 per equity share (15% on par value of ₹10). The dividend recommendation is for the financial year ended March 31, 2025 and requires shareholder approval at the Annual General Meeting scheduled for September 20, 2025. The dividend will be paid within 30 days from the AGM date to eligible shareholders as of the record date.",
            "Sentiment": "positive",
            "PublishDate": 1756217399295,
            "Source": "corporate_action"
        },
        {
            "Title": "Sirca Paints India Shareholders Approve Issuance of 20.11 Lakh Equity Shares on Preferential Basis",
            "Summary": "Sirca Paints India Limited held an Extraordinary General Meeting on August 05, 2025, where shareholders approved the issuance of 20,11,000 equity shares on preferential basis to certain identified non-promoter persons through a special resolution. The meeting was conducted via video conferencing with 70 shareholders present, representing 39,166,848 shares or 80.04% of the capital. The resolution received overwhelming support with 99.9985% votes in favor and only 0.0015% against. The voting included both remote e-voting (conducted from August 2-4, 2025) and e-voting during the meeting. Pravesh Kumar & Associates served as the scrutinizer for the voting process, confirming that the special resolution was passed with requisite majority.",
            "Sentiment": "positive",
            "PublishDate": 1754459181273,
            "Source": "corporate_action"
        },
        {
            "Title": "Sirca Paints India Reports Strong Q1 Growth with 37% Revenue Jump",
            "Summary": "Sirca Paints India delivered robust Q1 performance with net profit rising to Rs 1.4 billion from Rs 1.02 billion year-over-year. Revenue grew significantly to Rs 11.4 billion compared to Rs 7.86 billion in the same period last year. EBITDA increased to Rs 2.25 billion from Rs 1.41 billion, while EBITDA margin improved to 19.74% from 17.89% year-over-year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754265743237,
            "Source": "earnings"
        },
        {
            "Title": "Sirca Paints India Reports 45% Revenue Growth in Q1 Results",
            "Summary": "Sirca Paints India reported Q1 revenue of ₹11.4 billion, representing a significant increase from ₹7.86 billion in the same period last year. The company's EBITDA rose to ₹2.25 billion from ₹1.41 billion year-over-year. EBITDA margin improved to 19.74% compared to 17.89% in the previous year, indicating enhanced operational efficiency alongside revenue growth.",
            "Sentiment": "positive",
            "PublishDate": 1754124943860,
            "Source": "earnings"
        },
        {
            "Title": "Sirca Paints India Reports 39% Jump in Q1 Net Profit to Rs 1.42 Billion",
            "Summary": "Sirca Paints India reported a net profit of Rs 1.42 billion for Q1, representing a significant increase from Rs 1.02 billion in the same period last year. The company achieved a year-over-year growth of 39% in its quarterly net profit.",
            "Sentiment": "positive",
            "PublishDate": 1754124582849,
            "Source": "earnings"
        },
        {
            "Title": "Sirca Paints India Modifies Preferential Allotment List, Adds New Investor",
            "Summary": "Sirca Paints India Limited has approved changes to its preferential allotment of equity shares. The company removed New Spice Sales and Solution Limited from the allottee list and added Cellucom Retail India Private Limited as a new investor. The revised allotment will issue up to 20,11,000 equity shares to 67 non-promoter investors at ₹379.50 per share, raising approximately ₹76.31 crores. The largest allocations go to Sirca S.P.A (2,63,500 shares) and N-3 Shares and Stock Vision Private Limited (1,31,000 shares). The total issue size, price per share, and overall fundraising amount remain unchanged from the original plan announced on July 14, 2025. The company will issue a corrigendum to the Extraordinary General Meeting notice scheduled for August 5, 2025, to reflect these changes in the proposed allottee list.",
            "Sentiment": "neutral",
            "PublishDate": 1753946424363,
            "Source": "corporate_action"
        },
        {
            "Title": "SIRCA PAINTS INDIA Reports Q4 Financial Results",
            "Summary": "SIRCA PAINTS INDIA has reported its Q4 financial results. The company's net profit increased to 142 million rupees from 125 million rupees in the same quarter last year. Revenue for Q4 rose to 1 billion rupees from 826 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747907546000,
            "Source": "result"
        },
        {
            "Title": "Sirca Paints India Acquires Business Undertaking of Wembley Group",
            "Summary": "Sirca Paints India has acquired the business undertaking of Wembley Group in a transaction valued at 815 million rupees. The acquisition does not include the manufacturing facilities of the Wembley Group.",
            "Sentiment": "positive",
            "PublishDate": 1742775320000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sirca Paints India Acquires Wembley Group's Business Undertaking",
            "Summary": "Sirca Paints India has acquired the business undertaking of Wembley Group for 815 million rupees. The transaction excludes the manufacturing facilities of Wembley Group.",
            "Sentiment": "positive",
            "PublishDate": 1742566679000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sirca Paints India Acquires Wembley Group Business for 815 Million Rupees",
            "Summary": "Sirca Paints India has announced the acquisition of the Wembley Group business in a transaction valued at 815 million rupees. This acquisition represents a significant corporate action for Sirca Paints India, potentially expanding its market presence and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1742475161000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sirca Paints India Reports Q3 EBITDA Growth with Margin Decline",
            "Summary": "Sirca Paints India has reported its Q3 financial results. The company's EBITDA increased to 154 million rupees from 138 million rupees in the same quarter last year. However, the EBITDA margin decreased to 17.41% from 19.00% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739271335000,
            "Source": "earnings"
        },
        {
            "Title": "SIRCA PAINTS INDIA Reports Q3 Financial Results",
            "Summary": "SIRCA PAINTS INDIA has announced its Q3 financial results. The company's consolidated net profit increased to 115 million rupees, up from 105 million rupees in the same quarter last year. Revenue also saw growth, rising to 887 million rupees from 724 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739271329000,
            "Source": "earnings"
        },
        {
            "Title": "Sirca Paints India Reports Q2 Financial Results",
            "Summary": "Sirca Paints India has announced its financial results for the second quarter. The company reported a net profit of 133 million rupees, down from 155 million rupees in the same quarter last year. However, revenue increased to 1 billion rupees from 836 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731571192000,
            "Source": "result"
        }
    ]
}