{
    "Symbol": "SIS",
    "ISIN": "INE285J01028",
    "News": [
        {
            "Title": "SIS Limited Q3 FY26 Results: Revenue Crosses ₹4,000 Cr",
            "Summary": "SIS Limited reported record quarterly revenue of ₹4,185.2 cr in Q3 FY26, up 24.5% YoY. Operating EBITDA reached ₹196.3 cr, highest ever. Company declared interim dividend of ₹7 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769693860594,
            "Source": "co_actions_results"
        },
        {
            "Title": "SIS Limited Allots 50,733 Shares Under ESOP",
            "Summary": "SIS Limited's Nomination and Remuneration Committee approved allotment of 50,733 equity shares under Employee Stock Option Plan, increasing paid-up share capital to INR 706,166,570.",
            "Sentiment": "positive",
            "PublishDate": 1769663081918,
            "Source": "co_actions_results"
        },
        {
            "Title": "SIS Limited Q3FY26 Earnings Call on January 30",
            "Summary": "SIS Limited announces earnings conference call scheduled for January 30, 2026 at 2:00 PM IST to discuss Q3FY26 operational and financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769001169938,
            "Source": "co_actions_results"
        },
        {
            "Title": "SIS Limited Hosts Investor Call on New Labor Codes Impact",
            "Summary": "SIS Limited conducted an investor and analyst conference call to discuss the New Labor Codes and their impact on the company's security, cash logistics, and facility management operations. The management views these labor reforms as a growth tailwind for organized players like SIS, comparing it to the GST moment for labor, while emphasizing their fully compliant platform and ability to pass through statutory costs to clients.",
            "Sentiment": "positive",
            "PublishDate": 1764336211847,
            "Source": "stock"
        },
        {
            "Title": "SIS Limited Chairman Ravindra Kishore Sinha Resigns Due to Health Issues, Wife Rita Appointed as New Chairperson",
            "Summary": "Ravindra Kishore Sinha resigned from his position as Executive Director Chairman of SIS Limited effective November 24, 2025, citing personal health grounds. The Board appointed his wife Rita Kishore Sinha, a Non-Executive Director, as the new Chairperson effective November 25, 2025, maintaining family leadership continuity in the security and facility management company.",
            "Sentiment": "neutral",
            "PublishDate": 1764165741732,
            "Source": "corporate_governance"
        },
        {
            "Title": "SIS Limited Allots 22,023 Equity Shares Under Employee Stock Option Plan",
            "Summary": "SIS Limited's Nomination and Remuneration Committee approved the allotment of 22,023 equity shares of INR 5 each under the company's Employee Stock Option Plan. The allotment increased the company's paid-up share capital to INR 705,003,460 divided into 141,000,692 equity shares of INR 5 each.",
            "Sentiment": "neutral",
            "PublishDate": 1763723429721,
            "Source": "corporate_action"
        },
        {
            "Title": "SIS Limited Reports Record Revenue Growth and Completes AP Securitas Acquisition",
            "Summary": "SIS Limited reported record quarterly results with consolidated revenue reaching INR 3,759 crore, marking a 15% year-on-year growth and achieving the highest-ever monthly revenue run rate of INR 1,300 crore. All three business segments showed strong performance: India Security posted INR 1,544 crore (11.5% growth), Facility Management reached INR 629 crore (13.7% growth), and International Security achieved INR 1,607 crore (19.3% growth). The company successfully closed its acquisition of 51% stake in AP Securitas for INR 71.2 crore, which is expected to add 17% to India Security's monthly run rate. Consolidated EBITDA grew 16.2% to INR 168 crore with margins at 4.5%. Operating PAT stood at INR 93 crore with a 2.5% margin. The company reduced net debt by 23% to INR 663 crore and improved return on capital employed to 14.3% from 11.7% a year ago. Management expressed confidence about achieving 6% EBITDA margins for both India Security and Facility Management businesses and indicated FY26 as a strong rebound year with potential for INR 400 crore profit after tax.",
            "Sentiment": "positive",
            "PublishDate": 1762899170286,
            "Source": "earnings"
        },
        {
            "Title": "SIS Limited Submits Security Cover Certificate for Quarter Ended September 30, 2025",
            "Summary": "SIS Limited submitted its Security Cover Certificate for the quarter ended September 30, 2025, to BSE Limited. The certificate was issued by SS Kothari Mehta Co. LLP, the company's statutory auditor, in compliance with SEBI regulations. The auditor confirmed that book values mentioned in the statement are in agreement with the unaudited standalone financial results and underlying books of accounts for the quarter. The certificate was prepared for submission to stock exchanges and the debenture trustee, Axis Trustee Services Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1762356331477,
            "Source": "corporate_action"
        },
        {
            "Title": "SIS Limited Reports Strong Q2 Performance with 15% Revenue Growth and Highest-Ever EBITDA",
            "Summary": "SIS Limited announced quarterly results with revenue of Rs. 3,758.5 crores, marking 15.0% year-over-year growth and 5.9% quarter-over-quarter growth. The company achieved its highest-ever quarterly EBITDA of Rs. 168.3 crores, up 16.2% year-over-year. Operating profit after tax reached Rs. 93.0 crores, representing 35.1% year-over-year growth. The company completed acquisition of 51% stake in AP Securitas, one of India's oldest security service providers, for Rs. 71.29 crores. All three business segments showed growth: Security Solutions-India grew 11.5% year-over-year to Rs. 1,544 crores, Security Solutions-International increased 19.3% to Rs. 1,607 crores, and Facility Management Solutions rose 13.7% to Rs. 629 crores. Net debt decreased by Rs. 194 crores to Rs. 663 crores, resulting in Net Debt/EBITDA ratio of 1.03. The company invested Rs. 4.5 crores in Installco Wiffy Technology Private Limited as part of SIS Ventures initiative.",
            "Sentiment": "positive",
            "PublishDate": 1762351039410,
            "Source": "earnings"
        },
        {
            "Title": "SIS Limited Completes Acquisition of 51% Stake in AP Securitas for INR 71.29 Crores",
            "Summary": "SIS Limited has completed the acquisition of 64,556 equity shares in AP Securitas Private Limited from existing shareholders for a total consideration of INR 71.29 crores. This acquisition gives SIS Limited a 51% shareholding in AP Securitas. The company had previously disclosed its approval for this acquisition in September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762286533582,
            "Source": "order&deals"
        },
        {
            "Title": "SIS Limited Completes Acquisition of CCPS in Installco Wify Technology",
            "Summary": "SIS Limited has completed the acquisition of Compulsorily Convertible Preference Shares in Installco Wify Technology Private Limited. The company was allotted 4,197 CCPS with a face value of INR 10 each. This acquisition is part of SIS Limited's previously announced investment plan of up to INR 8 crores in Wify, which includes both acquisition of equity shares from existing shareholders and subscription to CCPS, targeting a total shareholding of 4.56%.",
            "Sentiment": "neutral",
            "PublishDate": 1760617459632,
            "Source": "order&deals"
        },
        {
            "Title": "SIS Limited's Australian Subsidiary Acquires State Medical Assistance Holdings for AUD 2.5 Million",
            "Summary": "SIS Australia Group Pty Ltd, a step-down subsidiary of SIS Limited, signed definitive agreements to acquire 100% shareholding in State Medical Assistance Holdings Pty Ltd for AUD 2.5 million in cash consideration. The target company, incorporated in 2013, operates in Non-Emergency Patient Transport, event medical support, clinical governance, and aged care services across New South Wales, Victoria and Western Australia. State Medical Assistance Holdings reported revenue of AUD 12.7 million for the financial year ended June 30, 2025, with previous years showing AUD 13.5 million in 2024 and AUD 12.1 million in 2023. The acquisition is strategically aligned with SIS's Medical & Rescue business in Australia and will enhance the portfolio by adding patient transport services. The transaction does not involve related parties and requires no governmental or regulatory approvals.",
            "Sentiment": "positive",
            "PublishDate": 1760102025107,
            "Source": "order&deals"
        },
        {
            "Title": "SIS Limited Transfers 5.06% Stake in Australian Subsidiary for INR 90 Crores in Internal Restructuring",
            "Summary": "SIS Limited entered into a Share Purchase Agreement on September 30, 2025, to transfer 800,000 equity shares representing 5.06% shareholding in SIS Australia Group Pty. Limited to SIS Australia Holdings Pty. Limited for approximately INR 90 crores. Both entities are wholly owned subsidiaries of SIS Limited, making this an intra-group related party transaction conducted on an arms' length basis as part of internal restructuring. SIS Australia Group contributed INR 65.72 crores in income (0.50% of consolidated total income) and had a net worth of INR 228.69 crores (9.50% of consolidated net worth) for FY 2024-25. The transaction is expected to complete on or before October 15, 2025, subject to necessary formalities.",
            "Sentiment": "neutral",
            "PublishDate": 1759284280527,
            "Source": "corporate_action"
        },
        {
            "Title": "SIS Limited Acquires 51% Stake in A P Securitas for INR 73.4 Crore",
            "Summary": "SIS Limited announced the acquisition of a 51% stake in A P Securitas Private Limited, a 40-year-old security services company with revenues of over INR 1,000 crore. The transaction values the first tranche at approximately 8.3x EBITDA multiple, with the remaining 49% to be acquired over 3-4 years through a performance-linked structure. A P Securitas operates pan-India with around 40,000 employees, serving primarily private sector clients with 34% revenue from BFSI sector. The company reported 4.3% EBITDA margins and 2.27% PAT margins, with net debt of INR 100 crore and net worth of INR 86 crore. Post-acquisition, SIS's combined security business will have a run rate of INR 6,100 crore, making it twice the size of its nearest competitor. The deal is funded through internal accruals and maintains SIS's net debt-to-EBITDA ratio below 1x. Consolidation is expected from Q3 onwards, with APS continuing to operate independently under current management for at least three years.",
            "Sentiment": "positive",
            "PublishDate": 1757673521104,
            "Source": "order&deals"
        },
        {
            "Title": "SIS Limited Acquires 100% Stake in A P Securitas for INR 73.40 Crores in Two-Tranche Deal",
            "Summary": "SIS Limited's Board of Directors approved the acquisition of 100% shareholding in A P Securitas Private Limited through a two-tranche structure. The first tranche involves acquiring 51% shareholding with an interim consideration of INR 73.40 crores, subject to net debt and working capital adjustments, to be completed by November 1, 2025. The remaining shares will be acquired by 2029. A P Securitas, incorporated in 1986, provides security and facility management services through its subsidiaries Proton Facility Solutions and Scientific Security Management Services. The target company reported unaudited FY25 revenue of INR 1,119 crores, employs over 37,500 people, and serves more than 1,000 clients across banking, logistics, education and other sectors. The acquisition aims to increase SIS Limited's market share in India's security services industry. SIS will conduct an investor conference call on September 8, 2025, to discuss the strategic transaction.",
            "Sentiment": "positive",
            "PublishDate": 1757093666835,
            "Source": "order&deals"
        },
        {
            "Title": "SIS Limited Reports Record Quarterly Revenue of ₹3,549 Crore, Crosses ₹1,200 Crore Monthly Run Rate",
            "Summary": "SIS Limited achieved its highest ever quarterly revenue of ₹3,549 crore in Q1 FY26, marking a 13.4% year-on-year growth and crossing the ₹1,200 crore monthly revenue run rate for the first time. All three business segments reported record revenues: India Security at ₹1,460 crore (9.2% growth), Facility Management at ₹594 crore (12.1% growth), and International at ₹1,513 crore (18.5% growth). The International business has become a 1 billion AUD standalone operation. Consolidated EBITDA grew 10.7% to ₹152 crore with a margin of 4.3%. PAT increased 44.7% to ₹93 crore, driven by higher 80JJAA benefits. The company improved its financial position with net debt reduced to ₹540 crore from ₹1,023 crore in the previous year, bringing net debt-to-EBITDA ratio down to 0.87. DSO improved by 6 days to 68 days. The company received regulatory approvals for its Cash JV IPO and invested ₹6 crore in fintech platform Adhikosh. Management indicated expectations of margin improvement toward their aspiration of 6% EBITDA margin, though International margins faced temporary pressure due to SXP business restructuring costs.",
            "Sentiment": "positive",
            "PublishDate": 1754497416075,
            "Source": "earnings"
        },
        {
            "Title": "SIS Limited Reports Strong Q1 FY26 Results with 44.7% PAT Growth and Revenue of ₹3,548.5 Crores",
            "Summary": "SIS Limited reported quarterly results with revenue of ₹3,548.5 crores, marking 44.7% year-on-year growth and 13.4% year-on-year increase. EBITDA reached ₹152.1 crores with 10.7% year-on-year growth. Profit After Tax stood at ₹92.9 crores, up 44.7% year-on-year. The company achieved consolidated monthly revenue run rate exceeding ₹1,200 crores across all three segments. Security Solutions India reported 9.2% year-on-year revenue growth to ₹1,459.9 crores with new wins of ₹38 crores monthly revenue. Security Solutions International posted 18.5% year-on-year growth to ₹1,512.5 crores. Facility Management Solutions grew 12.1% year-on-year to ₹594.3 crores with new wins of ₹25 crores monthly revenue. The company completed its fourth buyback worth ₹150 crores, returning over ₹500 crores to shareholders since listing. Net debt decreased to ₹540.3 crores with Net Debt to EBITDA ratio at 0.87. SIS was recognized among India's top 10 workplaces for 2025 by Great Place to Work Institute. The company invested ₹6 crores in Adhikosh Financial Advisory as part of SIS Ventures initiative.",
            "Sentiment": "positive",
            "PublishDate": 1753899433501,
            "Source": "earnings"
        },
        {
            "Title": "SIS Reports 45% Jump in Quarterly Net Profit to 929 Million Rupees",
            "Summary": "SIS delivered strong quarterly results with consolidated net profit rising to 929 million rupees compared to 642 million rupees in the same period last year, marking a 45% year-on-year increase. The company's revenue also grew significantly to 35.48 billion rupees from 31.3 billion rupees in the previous year, representing a 13% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1753882934559,
            "Source": "earnings"
        },
        {
            "Title": "SIS Limited Independent Director Rajan Verma Completes Second Term, Steps Down",
            "Summary": "Rajan Verma completed his second consecutive term as an Independent Director of SIS Limited on July 27, 2025, and ceased to be a Director of the Company. The Board of Directors and Management expressed appreciation and gratitude for his significant contributions during his tenure. Following his departure, Verma's membership in all Board committees has ended. The company has updated the composition of its statutory committees, with the Audit Committee now comprising Upendra Kumar Sinha as Chairman, along with members Sunil Srivastav and Uday Singh. The Risk Management Committee is chaired by Upendra Kumar Sinha, with Deepak Kumar and Uday Singh as members.",
            "Sentiment": "neutral",
            "PublishDate": 1753632979670,
            "Source": "corporate_governance"
        },
        {
            "Title": "SIS Ltd: Board Approves Rs 150 Crore Share Buyback",
            "Summary": "SIS Ltd. has approved a share buyback of up to Rs 150 crore at Rs 404 per share. The buyback will open on June 12 and close on June 18, with a settlement date of June 25. This marks the company's fourth buyback since April 2021.",
            "Sentiment": "positive",
            "PublishDate": 1749578572000,
            "Source": "corporate_action"
        },
        {
            "Title": "SIS Reports Q4 Consolidated Net Loss of 2.23 Billion Rupees",
            "Summary": "Security and Intelligence Services (SIS) has reported a consolidated net loss of 2.23 billion rupees for the fourth quarter, compared to a loss of 117 million rupees in the same period last year. This represents a significant increase in losses year-over-year. However, the company had reported a profit of 1.02 billion rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1746105399000,
            "Source": "result"
        },
        {
            "Title": "SIS Ltd: Board Approves ₹150 Crore Share Buyback at 18% Premium",
            "Summary": "SIS Ltd's board has approved a buyback of 37.12 lakh shares at ₹404 per share, an 18.3% premium to the previous closing price. The ₹150 crore buyback represents 2.57% of the company's paid-up capital. This is SIS's fourth buyback in four years, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1742956151000,
            "Source": "corporate_action"
        },
        {
            "Title": "SIS Approves Share Buyback Program",
            "Summary": "The board of SIS has approved a share buyback program worth up to 1.50 billion rupees. The company will repurchase its equity shares at a price of 404 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1742912786000,
            "Source": "corporate_action"
        },
        {
            "Title": "SIS Board to Consider Share Buyback on March 25",
            "Summary": "The board of directors of SIS (Security and Intelligence Services) is scheduled to meet on March 25 to consider a potential share buyback program. This corporate action, if approved, would involve the company repurchasing its own shares from the open market.",
            "Sentiment": "neutral",
            "PublishDate": 1742482081000,
            "Source": "corporate_action"
        },
        {
            "Title": "SIS Reports Improved Q3 EBITDA and Margin",
            "Summary": "Security and Intelligence Services (SIS) has reported its Q3 financial results. The company's EBITDA increased to 1.7 billion rupees from 1.55 billion rupees in the same quarter last year. Additionally, SIS's EBITDA margin improved slightly to 5.09% from 5.04% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738068225000,
            "Source": "earnings"
        },
        {
            "Title": "SIS Reports Significant Increase in Q3 Net Profit and Revenue",
            "Summary": "Security and Intelligence Services (SIS) has reported a substantial year-over-year increase in its consolidated net profit for the third quarter, rising from 369 million rupees to 1.02 billion rupees. This represents a 176% increase. The company also saw a quarter-over-quarter improvement from 688 million rupees. Revenue for Q3 grew to 33.6 billion rupees, up from 30.7 billion rupees in the same quarter last year, marking a 9.4% increase.",
            "Sentiment": "positive",
            "PublishDate": 1738067964000,
            "Source": "earnings"
        },
        {
            "Title": "SIS to Consider Q3 Results on January 28",
            "Summary": "Security and Intelligence Services (India) Limited (SIS) has announced that it will consider its third quarter (Q3) financial results on January 28.",
            "Sentiment": "neutral",
            "PublishDate": 1737122589000,
            "Source": "earnings"
        },
        {
            "Title": "SIS Ltd Approves Proposal to Raise 600 Million Rupees",
            "Summary": "SIS Ltd has approved a proposal to raise funds amounting to 600 million rupees. This decision indicates the company's intent to secure additional capital, potentially for expansion, debt reduction, or other strategic purposes.",
            "Sentiment": "positive",
            "PublishDate": 1732514451000,
            "Source": "corporate_action"
        },
        {
            "Title": "SIS Board Meeting to Consider Debt-Based Fundraising",
            "Summary": "Security and Intelligence Services (SIS) has announced a board meeting scheduled for November 25. The primary agenda is to consider a proposal for raising funds through the issuance of debt instruments, specifically debentures. This decision will be subject to necessary approvals.",
            "Sentiment": "neutral",
            "PublishDate": 1732029373000,
            "Source": "corporate_action"
        },
        {
            "Title": "SIS: International Business Faces Short-Term Challenges",
            "Summary": "SIS's Q2 results reveal short-term hurdles in its international business segment, according to a review by Motilal Oswal.",
            "Sentiment": "negative",
            "PublishDate": 1730269687000,
            "Source": "result"
        },
        {
            "Title": "SIS Reports Stable Q2 EBITDA, Slight Margin Decline",
            "Summary": "Security and Intelligence Services (SIS) has reported Q2 EBITDA of 1.5 billion rupees, which is unchanged from the same period last year. However, the Q2 EBITDA margin has decreased slightly from 4.97% to 4.57% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1730120065000,
            "Source": "result"
        },
        {
            "Title": "SIS Reports Q2 Revenue Growth",
            "Summary": "Security and Intelligence Services (SIS) India Ltd. has reported a revenue of 32.7 billion rupees for the second quarter, compared to 30.7 billion rupees in the same period last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1730120056000,
            "Source": "result"
        },
        {
            "Title": "SIS Reports Q2 Consolidated Net Profit of 688M Rupees",
            "Summary": "Security and Intelligence Services (SIS) India Limited has reported its Q2 consolidated net profit at 688 million rupees. This represents a year-over-year decrease from 752 million rupees and a quarter-over-quarter increase from 642 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1730120047000,
            "Source": "result"
        }
    ]
}