{
    "Symbol": "SITINET",
    "ISIN": "INE965H01011",
    "News": [
        {
            "Title": "Siti Networks Delays Q2FY26 Results Due to CIRP Process",
            "Summary": "Siti Networks Limited explains delay in Q2FY26 financial results submission, citing ongoing corporate insolvency resolution process, staff resignations, and subsidiary complications. Results expected by January 31, 2026.",
            "Sentiment": "negative",
            "PublishDate": 1765458217553,
            "Source": "stocks"
        },
        {
            "Title": "Siti Networks Discloses Default on Bank Loans Worth Over ₹1,000 Crores",
            "Summary": "Siti Networks Limited disclosed defaults on loan payments to multiple lenders including ARCIL, IDBI Bank, RBL Bank, Axis Bank, and others, with total outstanding claims exceeding ₹1,000 crores as of October 31, 2025. The company is currently undergoing Corporate Insolvency Resolution Process (CIRP) initiated in February 2023, with ongoing legal proceedings at the Supreme Court regarding financial creditor claims and payment obligations.",
            "Sentiment": "negative",
            "PublishDate": 1764583527688,
            "Source": "corporate_action"
        },
        {
            "Title": "SITI Networks Reports ₹437.64 Million Quarterly Loss Amid Ongoing Insolvency Process",
            "Summary": "SITI Networks Limited reported a standalone net loss of ₹437.64 million for the quarter ended June 30, 2025, compared to ₹530.17 million loss in the previous quarter. Revenue from operations declined to ₹799.55 million from ₹818.25 million in the prior quarter. The company operates under Corporate Insolvency Resolution Process (CIRP) since February 2023, with Resolution Professional managing operations. Financial creditors have submitted claims of ₹12,060.33 million, with ₹11,292.66 million admitted. The company faces negative net worth of ₹13,380.37 million and negative working capital of ₹17,278.93 million. On a consolidated basis, the group reported a net loss of ₹441.32 million with revenue from operations at ₹2,706.76 million. Statutory auditors have disclaimed their opinion citing multiple uncertainties related to the insolvency proceedings.",
            "Sentiment": "negative",
            "PublishDate": 1762784586470,
            "Source": "earnings"
        },
        {
            "Title": "Siti Networks Reports Default on Bank Loans Totaling Over ₹1,200 Crores",
            "Summary": "Siti Networks Limited disclosed defaults on loan payments to multiple lenders including ARCIL, IDBI Bank, RBL, Axis Bank, ABFL, Indusind Bank, Vani Agencies Pvt. Ltd., and ICNCL. The default occurred on September 30, 2025, and continues beyond 30 days. The company's total outstanding borrowings exceed ₹1,200 crores across various financial institutions. The company is currently undergoing Corporate Insolvency Resolution Process (CIRP) initiated by the National Company Law Tribunal on February 22, 2023, with Mr. Rohit Mehra appointed as the Interim Resolution Professional. The powers of the Board of Directors are suspended and vested in the IRP. Multiple appeals are pending before the Supreme Court regarding the insolvency proceedings, with the court staying certain NCLAT orders through October 2025.",
            "Sentiment": "negative",
            "PublishDate": 1761911944323,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLAT Dismisses Appeals by Banks, Orders Refund of ₹143 Crore to SITI Networks",
            "Summary": "The National Company Law Appellate Tribunal dismissed appeals filed by Axis Bank, Aditya Birla Capital, IDBI Bank, IndusInd Bank, and RBL Bank against SITI Networks Limited. The banks had withdrawn ₹143.15 crore from SITI Networks' account during a stay period between March 2023 and August 2023, when the company's insolvency proceedings were temporarily halted. NCLAT ruled that the moratorium remained in effect despite the stay order and directed all financial creditors to return the withdrawn amounts to the corporate debtor with accrued interest. The tribunal applied the principle of restitution, stating that parties who benefited from interim orders must restore those benefits when appeals are ultimately dismissed. NCLAT rejected the banks' arguments that they had contractual rights to withdraw funds, emphasizing that insolvency proceedings are 'in rem' and continue even during stay periods. The judgment also criticized the Resolution Professional for improperly handing over management to suspended directors during the stay period.",
            "Sentiment": "negative",
            "PublishDate": 1754033987180,
            "Source": "stock"
        },
        {
            "Title": "Siti Networks: Tribunal Orders Lenders to Return ₹148 Crore",
            "Summary": "<p>The <span class='neutral'>National Company Law Tribunal</span> has directed <span class='neutral'>Axis Bank</span> and other <span class='neutral'>financial creditors</span> of <span class='negative'>insolvent</span> <span class='neutral'>Siti Networks</span> to <span class='positive'>repay ₹143 crore</span> to the company. The order comes after <span class='negative'>unlawful fund withdrawals</span> were made during a <span class='neutral'>stay on insolvency proceedings</span>. Lenders have <b>four weeks</b> to comply with the order.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1727869796000,
            "Source": "normal_news"
        }
    ]
}