{
    "Symbol": "SIYSIL",
    "ISIN": "INE076B01028",
    "News": [
        {
            "Title": "Siyaram Silk Mills Q3FY26 Results & Dividend",
            "Summary": "Siyaram Silk Mills reports Q3FY26 standalone net profit of ₹4,189.86 lakhs, declares interim dividend of ₹3 per share (150%), and appoints new VP Finance.",
            "Sentiment": "positive",
            "PublishDate": 1769526192595,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siyaram Silk Mills Board Meet on Jan 27 for Q3 Results",
            "Summary": "Siyaram Silk Mills has scheduled its board meeting for January 27, 2026, to approve Q3FY26 unaudited financial results and consider declaring second interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768911579943,
            "Source": "co_actions_results"
        },
        {
            "Title": "Siyaram Silk Mills Promoters Execute Share Transfer of 70,000 Equity Shares",
            "Summary": "Abhishek S. Poddar sold 70,000 equity shares of Siyaram Silk Mills Limited to DPP Enterprises LLP on November 28, 2025, through open market transactions. The transfer occurred between promoter entities, with DPP Enterprises LLP's shareholding increasing from 10.13% to 10.29% of the company's total equity capital.",
            "Sentiment": "neutral",
            "PublishDate": 1764599589435,
            "Source": "corporate_action"
        },
        {
            "Title": "Siyaram Silk Mills Reports 18.1% Revenue Growth in Q2 FY26, Announces INR 4 Interim Dividend",
            "Summary": "Siyaram Silk Mills Limited reported total income of INR 743 crores in Q2 FY26 compared to INR 629 crores in the same quarter last year, marking an 18.1% year-on-year growth. For the first half of FY26, total income reached INR 1,143 crores against INR 960 crores in H1 FY25, reflecting a 19.1% increase. The company's EBITDA for the quarter was INR 145 crores with a margin of 19.5%, while PAT stood at INR 87 crores with an 11.7% margin, representing a 27.2% year-on-year increase. The Board approved an interim dividend of INR 4 per share for a face value of INR 2 each. Fabric business contributed 77% of total revenue, garments 15%, and yarn and other segments 8%. The company opened 7 new ZECODE stores and 2 new DEVO stores during the quarter, bringing the total store count to 23 ZECODE and 12 DEVO stores. Management revised revenue guidance from 10-12% to 12-14% for the fiscal year, citing strong performance in the first half. The new retail brands ZECODE and DEVO generated approximately INR 30 crores in revenue for the first half.",
            "Sentiment": "positive",
            "PublishDate": 1762904457987,
            "Source": "earnings"
        },
        {
            "Title": "Siyaram Silk Mills Reports Strong Q2 Results, Declares Rs 4 Interim Dividend",
            "Summary": "Siyaram Silk Mills Limited approved its unaudited financial results for the quarter and half year ended September 30, 2025. The company declared an interim dividend of Rs 4 per equity share (200% on face value of Rs 2), with payment scheduled for November 19, 2025 to shareholders on record as of November 11, 2025. The Board also approved key management changes, with William Fernandes retiring as Company Secretary and GM (Legal) on November 14, 2025, to be relieved on February 13, 2026. Mahipal Thakur has been appointed as the new Company Secretary and Compliance Officer effective November 15, 2025. The company's standalone revenue from operations was Rs 70,555.39 lakhs for the quarter, with profit before tax at Rs 11,821.23 lakhs. The results were reviewed by the Audit Committee and approved by the Board of Directors at their meeting held on November 4, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762275821319,
            "Source": "earnings"
        },
        {
            "Title": "Siyaram Silk Mills Reports 27% Growth in Q2 Net Profit to 870 Million Rupees",
            "Summary": "Siyaram Silk Mills reported quarterly net profit of 870 million rupees compared to 684 million rupees in the same period last year. Revenue increased to 7.1 billion rupees from 6.1 billion rupees year-over-year. EBITDA rose to 1.1 billion rupees from 890 million rupees, while EBITDA margin improved to 15.24% from 14.64% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762267760428,
            "Source": "earnings"
        },
        {
            "Title": "DPP Enterprises LLP Acquires 70,000 Shares of Siyaram Silk Mills from Promoter Abhishek S. Poddar",
            "Summary": "DPP Enterprises LLP has acquired 70,000 equity shares of Siyaram Silk Mills Limited from Abhishek S. Poddar, representing 0.15% of the company's share capital. The transaction is an off-market transfer among promoters scheduled for on or after September 29, 2025. DPP Enterprises LLP is identified as a promoter of Siyaram Silk Mills. The acquisition price will be at market price prevailing on the date of acquisition, with the volume weighted average market price for 60 trading days being Rs. 695.97 based on National Stock Exchange trading data. The acquirer has declared that the acquisition price will not exceed 25% above the computed price. The transaction falls under promoter inter-se transfer regulations and is exempt from making an open offer.",
            "Sentiment": "neutral",
            "PublishDate": 1758622130940,
            "Source": "corporate_action"
        },
        {
            "Title": "Siyaram Silk Mills Reports 21% Revenue Growth to INR 400 Crores in Q1 FY26",
            "Summary": "Siyaram Silk Mills Limited reported total income of INR 400 crores in Q1 FY26, up 21% from INR 331 crores in Q1 FY25. The company's revenue mix comprised Fabrics (76%), Garments (13%), and Others (11%). EBITDA declined to INR 33 crores from INR 34 crores year-on-year, with margins at 8%. Profit after tax dropped to INR 5 crores from INR 12 crores in the previous year. The company achieved volume growth of approximately 20% in Fabrics and 18% in Garments segments. Siyaram opened 7 new stores (4 ZECODE, 3 DEVO) during the quarter, bringing total stores to 26 across both brands. The new retail business contributed roughly 3% to overall company revenue. Management maintained annual revenue growth guidance of 10-12% and expects to achieve target of opening 35 stores across both brands in FY26. The company anticipates INR 75-80 crores revenue from new retail business this year.",
            "Sentiment": "neutral",
            "PublishDate": 1754400611976,
            "Source": "earnings"
        },
        {
            "Title": "Siyaram Silk Mills Plans Store Expansion Amid Expected Festive Demand",
            "Summary": "Siyaram Silk Mills anticipates an increase in consumer demand driven by the upcoming festive season. The company plans to open approximately 35 stores for both its brands by FY26 as part of its expansion strategy.",
            "Sentiment": "positive",
            "PublishDate": 1753801557852,
            "Source": "stock"
        },
        {
            "Title": "Siyaram Silk Mills Reports Q1 FY2026 Financial Results with Standalone Profit of ₹460.30 Lakhs",
            "Summary": "Siyaram Silk Mills Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹38,849.77 lakhs compared to ₹30,650.61 lakhs in the same quarter last year. Standalone profit for the period was ₹460.30 lakhs versus ₹1,201.82 lakhs in the previous year quarter. On a consolidated basis, the company posted revenue from operations of ₹38,948.38 lakhs and profit of ₹464.03 lakhs for the quarter. The Board of Directors approved these results in a meeting held on July 29, 2025. The company operates primarily in the textile business and has recognized government grants related to capital subsidies for property, plant and equipment.",
            "Sentiment": "neutral",
            "PublishDate": 1753788451830,
            "Source": "earnings"
        },
        {
            "Title": "Siyaram Silk Mills Reports Q4 Results and Dividend Announcement",
            "Summary": "Siyaram Silk Mills has announced its Q4 financial results and a dividend recommendation. The company's Q4 consolidated net profit increased to 720 million rupees from 690 million rupees year-over-year. Revenue rose to 7.4 billion rupees from 6.47 billion rupees in the same period. EBITDA for Q4 was 1.1 billion rupees, up from 1 billion rupees year-over-year, although the EBITDA margin decreased to 15.12% from 16.37%. The company has recommended a dividend of 5 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747062381000,
            "Source": "result"
        },
        {
            "Title": "Siyaram Silk Mills to Consider Q4 Results on May 12",
            "Summary": "Siyaram Silk Mills has announced that it will consider its fourth quarter (Q4) financial results on May 12. This is a standard corporate procedure where the company's board will review and potentially approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1746621741000,
            "Source": "default"
        },
        {
            "Title": "Siyaram's Launches Cadini Italy Perfume Collection in India",
            "Summary": "Siyaram Silk Mills has introduced the Cadini Italy Perfume Collection to the Indian market for the first time. This launch represents a significant expansion of Siyaram's product offerings, venturing into the luxury fragrance segment with an internationally recognized brand.",
            "Sentiment": "positive",
            "PublishDate": 1734048730000,
            "Source": "corporate_action"
        },
        {
            "Title": "Siyaram's Launches Cadini Italy Perfume Collection in India",
            "Summary": "Siyaram Silk Mills has introduced the Cadini Italy Perfume Collection to the Indian market for the first time. This launch represents a significant expansion of Siyaram's product offerings, moving beyond their traditional textile and apparel business into the luxury fragrance sector.",
            "Sentiment": "positive",
            "PublishDate": 1734007935000,
            "Source": "corporate_action"
        },
        {
            "Title": "Siyaram Silk Mills: Q2 Profit Up 11%, Announces Dividend and Bonus Preference Shares",
            "Summary": "Siyaram Silk Mills reported Q2 FY2024-25 net profit of ₹68.2 crore, up 11.3% YoY. Revenue increased 3.7% to ₹608 crore. EBITDA rose 1.1% to ₹89 crore. The company declared an interim dividend of ₹4 per equity share and approved a scheme to issue bonus preference shares to existing shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729955299000,
            "Source": "result"
        },
        {
            "Title": "Siyaram Silk Mills to Consider Q2 Results and Bonus Issue",
            "Summary": "Siyaram Silk Mills has announced a board meeting scheduled for October 26 to consider the company's Q2 results. Additionally, the board will discuss the potential issuance of bonus securities.",
            "Sentiment": "positive",
            "PublishDate": 1729684166000,
            "Source": "corporate_action"
        }
    ]
}