{
    "Symbol": "SJLOGISTIC",
    "ISIN": "INE0F3301020",
    "News": [
        {
            "Title": "S J Logistics Secures ₹42 Crore Order",
            "Summary": "S J Logistics has secured an order valued at ₹42 crores. The company operates in the logistics sector and is classified as a small and medium enterprise (SME).",
            "Sentiment": "positive",
            "PublishDate": 1756362593391,
            "Source": "order&deals"
        },
        {
            "Title": "KTPL Promoters Offer ₹472 Crore to Settle ₹590 Crore Debt, Outbidding Prudent ARC",
            "Summary": "Promoters of Karanja Terminal & Logistics (KTPL), led by Nikhil Gandhi, have offered ₹472 crore to lenders led by Canara Bank for a one-time settlement of the company's ₹590 crore debt. This offer surpasses Prudent Asset Reconstruction Company's ₹460 crore bid received through a Swiss challenge auction process. Gandhi initially offered ₹430 crore, which was put through the Swiss challenge auction where counteroffers are invited to maximize lender recovery. KTPL operates a port and logistics facility at Karanja Creek in Navi Mumbai, with good connectivity to highways and proximity to JNPT and Mumbai Port.",
            "Sentiment": "positive",
            "PublishDate": 1753405155500,
            "Source": "order&deals"
        },
        {
            "Title": "S J Logistics Becomes Approved Logistics Service Provider for SAIL",
            "Summary": "S J Logistics has been approved as a logistics service provider for Steel Authority of India Limited (SAIL). This development suggests a new business relationship between the two companies, with S J Logistics set to provide logistics services to SAIL.",
            "Sentiment": "positive",
            "PublishDate": 1751263146000,
            "Source": "default"
        },
        {
            "Title": "S J Logistics (India) Reports Significant Revenue Growth in Q3",
            "Summary": "S J Logistics (India) has announced its third-quarter financial results, reporting a substantial increase in revenue. The company's Q3 revenue reached 1.36 billion rupees, compared to 792 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738739656000,
            "Source": "earnings"
        },
        {
            "Title": "S J Logistics (India) Reports Strong Q3 EBITDA Growth",
            "Summary": "S J Logistics (India) has announced its Q3 financial results, showing significant improvement in EBITDA performance. The company's EBITDA increased to 203 million rupees, up from 87 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 14.91% from 10.97% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1738739597000,
            "Source": "earnings"
        },
        {
            "Title": "S J Logistics (India) Reports Significant Increase in Q3 Consolidated Net Profit",
            "Summary": "S J Logistics (India) has announced its financial results for the third quarter, reporting a consolidated net profit of 142 million rupees. This represents a substantial increase from the 62 million rupees reported in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738739408000,
            "Source": "earnings"
        }
    ]
}