{
    "Symbol": "SJS",
    "ISIN": "INE284S01014",
    "News": [
        {
            "Title": "SJS Enterprises Reports Strong Q3FY26 Results",
            "Summary": "SJS Enterprises delivered robust Q3FY26 performance with consolidated revenue of ₹2,435.31 million and net profit of ₹450.39 million, alongside strategic wind power investment approval.",
            "Sentiment": "positive",
            "PublishDate": 1769594407861,
            "Source": "co_actions_results"
        },
        {
            "Title": "SJS Enterprises Q3FY26 Earnings Call on Jan 29",
            "Summary": "SJS Enterprises announces board meeting on January 28, 2026 to approve Q3FY26 financial results, followed by investor call on January 29, 2026 at 10:30 AM IST with senior management.",
            "Sentiment": "neutral",
            "PublishDate": 1768988081430,
            "Source": "co_actions_results"
        },
        {
            "Title": "SJS Enterprises Outpaces Auto Ancillary Rally",
            "Summary": "India-based auto ancillary supplier SJS Enterprises, which counts John Deere among its clients, delivered 31% revenue growth in FY25, significantly outpacing industry growth of 9.5%.",
            "Sentiment": "positive",
            "PublishDate": 1766752710932,
            "Source": "stocks"
        },
        {
            "Title": "SJS Enterprises Signs Tech License Deal with BOE",
            "Summary": "SJS Enterprises enters technology license cum supply agreement with BOE Varitronix Limited for optical bonding of automotive displays, expanding technological capabilities in display solutions.",
            "Sentiment": "positive",
            "PublishDate": 1766492162650,
            "Source": "stocks"
        },
        {
            "Title": "SJS Enterprises Reports Record Q2 Performance with 25.4% Revenue Growth and 29.6% EBITDA Margins",
            "Summary": "SJS Enterprises Limited delivered its highest ever quarterly performance with revenue of INR 2,417.6 million, growing 25.4% year-on-year, significantly outperforming the combined 2-wheeler and passenger vehicle industry growth of 9.5%. The company achieved record EBITDA margins of 29.6% and PAT margins of 17.9%. Automotive segment revenue grew 29.5% driven by 44.3% growth in 2-wheelers and 16.5% in passenger vehicles. Export revenue reached a record INR 231.9 million, up 40.9% year-on-year. The company signed an MOU with BOE Varitronix for automotive display solutions manufacturing and added new customers including Orafol USA (Nissan supplier), River (EV 2-wheeler), and Azad (EV bus manufacturer). SJS maintains a debt-free position with net cash of INR 1,588.8 million and has revised its guidance upwards, expecting to outperform industry growth by over 2.5x in FY26. The company targets export revenue share of 14-15% by FY28 and continues capacity expansion projects at Bangalore and Pune facilities.",
            "Sentiment": "positive",
            "PublishDate": 1762533255242,
            "Source": "earnings"
        },
        {
            "Title": "SJS Enterprises Raises Growth Guidance and Margin Targets",
            "Summary": "SJS Enterprises has revised its guidance upwards, expecting to outperform industry growth rate by over 2.5x in FY'26. The company anticipates sustaining EBITDA margins around 27%, an improvement from historical levels of 25-26%. SJS Enterprises plans capital expenditure of INR 220-230 crore over three years and targets exports to comprise 14-15% of consolidated sales by FY'28.",
            "Sentiment": "positive",
            "PublishDate": 1762400139536,
            "Source": "stock"
        },
        {
            "Title": "S.J.S. Enterprises Targets Export Growth to 14-15% of Revenue by FY28",
            "Summary": "S.J.S. Enterprises plans to increase its export contribution to 14-15% of total revenue by FY28. The company intends to achieve this growth through acquiring new customers and business diversification strategies.",
            "Sentiment": "positive",
            "PublishDate": 1762183030306,
            "Source": "stock"
        },
        {
            "Title": "SJS Enterprises Strengthens Design-Led Export Growth in Automotive Aesthetics and Consumer Durables",
            "Summary": "SJS Enterprises is strengthening its design-led export growth in premium automotive aesthetics and consumer durables. The company's growth strategy is guided by global OEM partnerships, capacity expansion, and rising international demand for differentiated products.",
            "Sentiment": "positive",
            "PublishDate": 1762181404161,
            "Source": "stock"
        },
        {
            "Title": "S.J.S. Enterprises Reports Strong Q2 Results and Allots 5.62 Lakh Equity Shares Under ESOP",
            "Summary": "S.J.S. Enterprises Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved the allotment of 5,62,000 equity shares of face value Rs. 10 each to employees under the SJS Enterprises Employee Stock Option Plan 2021. The allotment increased the company's paid-up equity share capital from Rs. 31.39 crore to Rs. 31.95 crore. The exercise price was Rs. 263.86 per share for 5,42,000 shares and Rs. 324.14 per share for 20,000 shares. The company operates in manufacturing and selling self-adhesive labels, automotive dials, overlays, badges and logos for automotive, electronics and appliances industries. The financial results were reviewed by the Audit Committee and approved by the Board at their meeting held on November 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762167649951,
            "Source": "earnings"
        },
        {
            "Title": "S.J.S. Enterprises Reports Strong Q2 Performance with 48% Jump in Net Profit",
            "Summary": "S.J.S. Enterprises delivered robust Q2 results with consolidated net profit rising to 432.7 million rupees from 291.5 million rupees year-over-year. Revenue increased to 2.42 billion rupees compared to 1.93 billion rupees in the same period last year. EBITDA grew to 683.6 million rupees from 499.5 million rupees, while EBITDA margin improved to 28.28% from 25.91% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762166155234,
            "Source": "earnings"
        },
        {
            "Title": "S.J.S. Enterprises Appoints Ranjit Nambiar as Group Chief Operating Officer",
            "Summary": "S.J.S. Enterprises Limited appointed Mr. Ranjit Raghunath Nambiar as Group Chief Operating Officer (GCOO) effective September 29, 2025. The Board of Directors approved the appointment on September 25, 2025, based on the recommendation of the Nomination and Remuneration Committee. Nambiar will also be designated as Senior Management Personnel. He brings over 30 years of experience across chemicals, polymers, consumer appliances, automotive systems, and EV components. His previous roles include CEO at Spark Minda's Interiors & Plastics Division, Business Unit Head for EV Component Solutions at Tata AutoComp, and Director of India Operations at International Automotive Components, where he built operations from inception to over ₹800 crore. He holds a Post Graduate Diploma in Plastics Technology and has completed leadership programs at IIM Ahmedabad. Nambiar is not related to any Director or Key Managerial Personnel of the company.",
            "Sentiment": "positive",
            "PublishDate": 1758866703855,
            "Source": "corporate_governance"
        },
        {
            "Title": "SJS Enterprises to Participate in Arihant Capital's Virtual Investor Conference on September 23, 2025",
            "Summary": "SJS Enterprises has scheduled participation in Arihant Capital's virtual investor conference called 'Bharat Connect Conference: Rising Stars' on September 23, 2025. The company's management will engage with over 70 institutional investors and financial advisors during this virtual group meeting. The participants include various investment firms such as NB Investments, DT Capital, Quantum Advisors, Barclays PMS, InCred Asset Management, and numerous other portfolio management services and capital advisory firms. The company clarified that no unpublished price sensitive information will be discussed during the interactions. A correction was made to earlier communication that incorrectly mentioned Centrum Broking instead of Arihant Capital as the organizer.",
            "Sentiment": "neutral",
            "PublishDate": 1758196484146,
            "Source": "stock"
        },
        {
            "Title": "S.J.S. Enterprises Signs MoU with BOE Varitronix for Automotive Display Manufacturing in India",
            "Summary": "S.J.S. Enterprises Limited has signed a Memorandum of Understanding with BOE Varitronix Limited, Hong Kong, to collaborate on manufacturing automotive displays in India. The agreement involves technology transfer for assembly and optical bonding of display screens, including localization of cover glass and backlight units for the four-wheeler automotive market. The arrangement may be formalized through a Technical Assistance Agreement or Joint Venture, subject to successful feasibility study and necessary approvals. The MoU provides mutual exclusivity for both parties and is valid for six months, with potential for extension by mutual agreement. BOE Varitronix is not related to S.J.S. Enterprises' promoter group, and the transaction does not fall under related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1758024874732,
            "Source": "order&deals"
        },
        {
            "Title": "SJS Enterprises Targets Revenue Doubling in 3-4 Years Through Premiumisation Strategy",
            "Summary": "SJS Enterprises aims to double its revenue within three to four years, driven by premiumisation trends and technological advancement. Group CEO Sanjay Thapar expressed confidence in achieving this target, stating the company will grow at twice the industry rate. The recent acquisition of Spanish firm Walter Pack serves as a key catalyst, enhancing capabilities in complex tooling and specialized 2K moulding technology. This acquisition has already increased the company's kit value per vehicle from Rs 1,500 to nearly Rs 5,000, with projections reaching Rs 10,000 per four-wheeler over the next three to four years. The company maintains historical margins of 25-26%. While two-wheeler revenue share decreased from 70% in 2019 to 35-36% currently, this reflects rapid four-wheeler segment growth rather than two-wheeler decline. Four-wheelers and consumer appliances are expected to drive future growth, particularly in export markets. SJS shares closed 0.87% higher at Rs 1,358 on Tuesday.",
            "Sentiment": "positive",
            "PublishDate": 1756277664088,
            "Source": "stock"
        },
        {
            "Title": "SJS Enterprises Reports 11.2% Revenue Growth with Strong 2-Wheeler Performance in Q1 FY26",
            "Summary": "SJS Enterprises delivered consolidated revenue of INR 2,096.6 million in Q1 FY26, marking 11.2% year-on-year growth despite muted industry growth of 1.2%. The automotive business segment achieved exceptional 22.8% growth, driven by 32.7% growth in 2-wheeler segment and 13.8% in passenger vehicles. The company added Hero MotoCorp as a new customer and started supplies during the quarter. EBITDA grew 16.3% to INR 587.2 million with margins expanding to 27.6%, while PAT increased 22.6% to INR 346.2 million with 16.5% margins. The company secured new export orders from Autoliv, FCA, and added Yazaki as a domestic customer. Capacity expansion projects are underway at Pune and Bangalore locations. SJS maintained strong cash generation with 101% of EBITDA converting to operating cash flows and holds a net cash position of INR 1,311.4 million. Management expects to outperform industry growth by 2x and targets export contribution of 14-15% of revenue by FY28.",
            "Sentiment": "positive",
            "PublishDate": 1754305519983,
            "Source": "earnings"
        },
        {
            "Title": "SJS Enterprises Targets Doubled Industry Growth by FY26 with Premium Products and Global Expansion",
            "Summary": "SJS Enterprises expects to achieve double the industry growth rate by FY26, driven by premium products, major OEM contracts, and global expansion initiatives. The company maintains its EBITDA margin guidance of over 27%.",
            "Sentiment": "positive",
            "PublishDate": 1753798362018,
            "Source": "stock"
        },
        {
            "Title": "SJS Enterprises Reports Strong Q1 FY26 Results, Allots 24,250 ESOP Shares",
            "Summary": "SJS Enterprises Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. On a consolidated basis, the company reported revenue from operations of Rs 2,096.58 million compared to Rs 1,886.24 million in the previous quarter, with profit after tax of Rs 346.16 million versus Rs 337.34 million. On a standalone basis, revenue increased to Rs 1,237.22 million from Rs 1,028.26 million, while net profit rose to Rs 273.13 million from Rs 245.56 million. The Board also approved allotment of 24,250 equity shares under the Employee Stock Option Plan 2021, increasing the paid-up share capital to Rs 313,574,040. The company operates in manufacturing self-adhesive labels, automotive dials, overlays, badges and logos for automotive, electronics and appliances industries. Additionally, subsidiaries SDPL and WPI entered solar power purchase agreements and made investments in Amplus Kaveri Solar Private Limited totaling Rs 1.67 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753786490755,
            "Source": "earnings"
        },
        {
            "Title": "S.J.S. Enterprises Announces Q4 Results and Final Dividend",
            "Summary": "S.J.S. Enterprises reported its Q4 financial results and declared a final dividend. The company's Q4 consolidated net profit increased to 334 million rupees from 267 million rupees year-over-year. Revenue rose to 2 billion rupees from 1.87 billion rupees in the same period. EBITDA for Q4 was 510 million rupees, up from 476 million rupees, with a slight decrease in EBITDA margin to 25.44% from 25.48%. The company also announced a final dividend of 2.5 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746706975000,
            "Source": "result"
        },
        {
            "Title": "SJS Enterprises Subsidiaries Sign Solar Power Purchase Agreement",
            "Summary": "SJS Enterprises has announced that its subsidiaries, EPPL and WPI, have entered into a Solar Power Purchase Agreement. The agreement is for the supply of 4.65 MWp of solar power.",
            "Sentiment": "positive",
            "PublishDate": 1744381959000,
            "Source": "corporate_action"
        },
        {
            "Title": "High Court Upholds SJS Enterprises' Management Authority in Labor Dispute",
            "Summary": "SJS Enterprises reports that the High Court has affirmed management's authority to address workplace indiscipline. The court has also ordered the reinstatement of 164 workmen, indicating a resolution to a labor dispute within the company.",
            "Sentiment": "neutral",
            "PublishDate": 1742559021000,
            "Source": "corporate_governance"
        },
        {
            "Title": "S.J.S. Enterprises Reports Improved Q3 EBITDA and Margin",
            "Summary": "S.J.S. Enterprises has announced its Q3 financial results. The company's EBITDA increased to 452.8 million rupees, up from 403.6 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 25.36% from 25.10% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738238657000,
            "Source": "earnings"
        },
        {
            "Title": "S.J.S. Enterprises Reports Q3 Revenue Growth",
            "Summary": "S.J.S. Enterprises has announced its third-quarter revenue results. The company reported revenue of 1.79 billion rupees, compared to 1.6 billion rupees in the same quarter of the previous year, indicating year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738238650000,
            "Source": "earnings"
        },
        {
            "Title": "S.J.S. Enterprises Reports Increased Q3 Consolidated Net Profit",
            "Summary": "S.J.S. Enterprises has reported a consolidated net profit of 275.6 million rupees for the third quarter. This represents an increase from 208 million rupees year-over-year and 290 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738238641000,
            "Source": "earnings"
        },
        {
            "Title": "SJS Enterprises to Consider Q3 Results on January 30",
            "Summary": "SJS Enterprises has announced that it will be considering its third quarter (Q3) financial results on January 30. This indicates that the company is preparing to review and potentially approve its quarterly financial performance report.",
            "Sentiment": "neutral",
            "PublishDate": 1737726137000,
            "Source": "result"
        },
        {
            "Title": "S.J.S. Enterprises Reports Strong Q2 EBITDA Growth",
            "Summary": "S.J.S. Enterprises has announced its Q2 financial results, showing significant improvement in EBITDA. The company's EBITDA increased to 499 million rupees from 360 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 25.91% from 22.09% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1730117829000,
            "Source": "result"
        },
        {
            "Title": "S.J.S. Enterprises Reports Q2 Revenue Growth",
            "Summary": "S.J.S. Enterprises has announced its second quarter revenue, which amounts to 1.93 billion rupees. This represents an increase from the previous year's figure of 1.6 billion rupees for the same quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730117818000,
            "Source": "result"
        },
        {
            "Title": "S.J.S. Enterprises Reports Q2 Profit Growth",
            "Summary": "S.J.S. Enterprises has announced its Q2 consolidated net profit, which stands at 290 million rupees. This represents a year-over-year increase from 193 million rupees and a quarter-over-quarter increase from 278 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730117809000,
            "Source": "result"
        }
    ]
}