{
    "Symbol": "SJVN",
    "ISIN": "INE002L01015",
    "News": [
        {
            "Title": "SJVN Reports Strong Q3 FY26 Results, Declares Dividend",
            "Summary": "SJVN Limited announced Q3 FY26 financial results with revenue of ₹846.13 crore and net profit of ₹251.71 crore. Board declared interim dividend of ₹1.15 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770824225123,
            "Source": "co_actions_results"
        },
        {
            "Title": "SJVN Commences 70 MW Dhubri Solar Project Operations",
            "Summary": "SJVN has successfully started operations of its 70 MW solar power project in Dhubri, Assam, marking another milestone in the company's renewable energy expansion across India.",
            "Sentiment": "positive",
            "PublishDate": 1770295174913,
            "Source": "stocks"
        },
        {
            "Title": "SJVN Board to Meet on Feb 11 for NCD Fundraising",
            "Summary": "SJVN has scheduled a board meeting for February 11, 2026, to discuss fundraising through non-convertible debentures as part of its capital mobilization strategy.",
            "Sentiment": "neutral",
            "PublishDate": 1770017508933,
            "Source": "stocks"
        },
        {
            "Title": "SJVN extends CMD additional charge to Bhupender Gupta",
            "Summary": "Ministry of Power extends additional charge of SJVN Chairman & Managing Director to Shri Bhupender Gupta for six months from February 1, 2026, or until full-time appointment.",
            "Sentiment": "neutral",
            "PublishDate": 1769796161184,
            "Source": "stocks"
        },
        {
            "Title": "SJVN Announces Senior Management Change Due to Retirement",
            "Summary": "SJVN Limited reported a change in senior management as Anil Kumar ceased his position due to superannuation effective January 30, 2026, in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769770264969,
            "Source": "stocks"
        },
        {
            "Title": "SJVN Board Meeting Set for Feb 11 to Review Q3 Results",
            "Summary": "SJVN Limited has scheduled a board meeting for February 11, 2026, to consider Q3FY26 financial results and potential interim dividend. Trading window closed from January 1 until February 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769766409171,
            "Source": "co_actions_results"
        },
        {
            "Title": "SJVN Changes Registrar Agent to MAS Services",
            "Summary": "SJVN Limited appointed MAS Services Limited as new Registrar and Share Transfer Agent, replacing Alankit Assignments Limited effective January 23, 2026, following regulatory compliance under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769183698628,
            "Source": "stocks"
        },
        {
            "Title": "SJVN Changes RTA from Alankit to MAS Services",
            "Summary": "SJVN Limited appoints MAS Services Limited as new Registrar and Share Transfer Agent for three years, replacing Alankit Assignments Limited whose contract expired on December 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768560626187,
            "Source": "stocks"
        },
        {
            "Title": "SJVN Inaugurates 70 MW Dhubri Solar Project in Assam",
            "Summary": "Assam CM inaugurates SJVN's first operational project in Northeast - 70 MW Dhubri Solar Power Project worth ₹367.44 crores, expected to generate 3,230 MU over 25 years.",
            "Sentiment": "positive",
            "PublishDate": 1768474269677,
            "Source": "stocks"
        },
        {
            "Title": "SJVN clarifies trading volume surge to BSE",
            "Summary": "SJVN Limited responds to BSE inquiry about recent trading volume increase, attributing it to market conditions while confirming compliance with disclosure regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1767604228162,
            "Source": "stocks"
        },
        {
            "Title": "SJVN Commissions 1,000 MW Bikaner Solar Project",
            "Summary": "SJVN Limited successfully achieves Commercial Operation Date for its 1,000 MW Bikaner solar project, developed at a total cost of ₹54.92 billion, marking a significant milestone in renewable energy expansion.",
            "Sentiment": "positive",
            "PublishDate": 1766714553317,
            "Source": "stocks"
        },
        {
            "Title": "SJVN Achieves COD for 1,000 MW Bikaner Solar Project",
            "Summary": "SJVN Green Energy Limited achieves Commercial Operation Date for 1,000 MW Bikaner solar project, expected to generate 2,454.55 million units in first year with maximum usage charges of ₹2.57 per unit.",
            "Sentiment": "positive",
            "PublishDate": 1766582398332,
            "Source": "stocks"
        },
        {
            "Title": "SJVN Green Energy Achieves 100.56 MW Solar Milestone",
            "Summary": "SJVN Green Energy Limited successfully commissions 100.56 MW at Bikaner Solar Power Project, bringing total operational capacity to 830.70 MW out of planned 1,000 MW target.",
            "Sentiment": "positive",
            "PublishDate": 1765607398278,
            "Source": "stocks"
        },
        {
            "Title": "SJVN Extends Additional Finance Director Charge to Sipan Kumar Garg for Three Months",
            "Summary": "The Ministry of Power has extended the additional charge of Director (Finance) at SJVN Limited to Shri Sipan Kumar Garg for three months starting December 1, 2025, or until a full-time incumbent is appointed. Garg, who currently serves as Director (Finance) at THDC India Limited and assumed additional CMD charge there in November 2025, brings over 24 years of power sector experience to the role.",
            "Sentiment": "positive",
            "PublishDate": 1764653988048,
            "Source": "corporate_governance"
        },
        {
            "Title": "SJVN Achieves Commercial Operation of 660MW Unit at Buxar Thermal Power Project",
            "Summary": "SJVN successfully commenced commercial operations of Unit-1 (660MW) of its 1320MW Buxar Thermal Power Project through subsidiary SJVN Thermal Private Limited. The supercritical technology project will generate 9,828.72 million units annually with 85% power allocated to Bihar, enhancing power availability in the Eastern Region.",
            "Sentiment": "neutral",
            "PublishDate": 1763101420510,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Reports Strong Q2 Performance with ₹630.79 Crore Net Profit, Appoints New CFO",
            "Summary": "SJVN Limited reported quarterly results for the period ended September 30, 2025, with standalone net profit of ₹630.79 crore and consolidated net profit of ₹535.38 crore. Revenue from operations stood at ₹942.03 crore for standalone and ₹1,032.40 crore for consolidated operations. The company appointed Shri Sipan Kumar Garg as Chief Financial Officer, who brings over 23 years of experience in finance and power sector operations. SJVN also approved raising funds up to ₹1,000 crore through securitization of future revenue from Nathpa Jhakri Hydro Electric Project under National Monetization Pipelines for FY2025-26. The board meeting was held on November 10, 2025, where these financial results and strategic decisions were approved.",
            "Sentiment": "positive",
            "PublishDate": 1762783623216,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Net Profit Drops 30% to ₹308 Crore Despite Improved Operating Margins",
            "Summary": "SJVN Ltd. reported a 30.2% decline in net profit to ₹308 crore for the September quarter, down from ₹441 crore in the same period last year. Revenue from operations remained nearly flat at ₹1,032 crore compared to ₹1,038 crore previously. EBITDA increased 3% to ₹860 crore from ₹836 crore, with operating margins improving to 83.3% from 81.5%. The company plans to raise up to ₹1,000 crore through securitisation of future revenue from its 1,500 MW Nathpa Jhakri Hydro Electric Project as part of FY25-26 targets under the National Monetisation Pipeline. SJVN shares traded 0.93% lower at ₹84.06 following the results announcement and are down 24% year-to-date.",
            "Sentiment": "negative",
            "PublishDate": 1762763817405,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Board Approves ₹1,000 Crore Fundraising Through Securitization of Nathpa Jhakri Project Income",
            "Summary": "SJVN's board has approved a plan to raise up to ₹1,000 crores through securitization of future income from the Nathpa Jhakri Hydro Electric Project. This fundraising mechanism involves monetizing expected future cash flows from the hydroelectric project.",
            "Sentiment": "positive",
            "PublishDate": 1762762436136,
            "Source": "stock"
        },
        {
            "Title": "SJVN Reports Flat Q2 Revenue at 10.3B Rupees, Net Profit Drops to 3.1B Rupees",
            "Summary": "SJVN reported quarterly revenue of 10.3 billion rupees, unchanged from the same period last year. The company's consolidated net profit declined to 3.1 billion rupees compared to 4.4 billion rupees in the previous year. EBITDA increased to 8.6 billion rupees from 8.35 billion rupees, while EBITDA margin improved to 83.30% from 81.43%.",
            "Sentiment": "negative",
            "PublishDate": 1762761881817,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Announces Board Meeting for Q2FY26 Results on November 10",
            "Summary": "SJVN Ltd., a Navratna public sector undertaking specializing in hydroelectric power generation and transmission, will announce its second quarter and half-year results for the period ended September 30, 2025, on November 10. The board meeting will also consider a proposal for raising funds through asset securitization. An earnings call is scheduled for 2:30 PM on the same day with MD Bhupendra Gupta and Director Finance Sipan Garg. The trading window for designated employees remains closed from October 1 to November 12. In the previous quarter, SJVN reported a 36.3% decline in consolidated net profit to Rs 227.58 crore, while total income increased 1.4% to Rs 971.59 crore. SJVN shares have declined 23.55% year-to-date and closed 1.37% lower at Rs 84.75 on Friday.",
            "Sentiment": "neutral",
            "PublishDate": 1762603389639,
            "Source": "earnings"
        },
        {
            "Title": "SJVN's 660 MW Buxar Thermal Power Unit-1 Completes 72-Hour Trial Run",
            "Summary": "SJVN Limited announced that the 660 MW Unit-1 of its 1320 MW Buxar Thermal Power Project in Bihar successfully completed its 72-hour trial run operation on November 5, 2025. Chairman Managing Director Bhupender Gupta stated that the company is now ready for commercial operation of this unit. The project is being implemented by SJVN Thermal Private Limited (STPL), a wholly owned subsidiary of SJVN, using supercritical technology for higher efficiency and reduced environmental impact. Once fully commissioned, the project will generate approximately 9,828.72 million units of electricity annually. Company directors praised the achievement as a significant milestone demonstrating SJVN's technical capabilities and the dedication of employees, contractors, and stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1762465840677,
            "Source": "stock"
        },
        {
            "Title": "SJVN Extends Additional CMD Charge to NHPC's Bhupender Gupta for Three Months",
            "Summary": "SJVN Limited announced that the Ministry of Power has extended the additional charge of Chairman Managing Director to Shri Bhupender Gupta, who is CMD of NHPC Limited. The extension is effective from November 01, 2025, for three months or until a full-time incumbent is appointed or further orders, whichever is earliest. Gupta holds a bachelor's degree in electrical engineering and MBA in Operations Management, with over 34 years of experience including 31 years in Power CPSUs. He previously worked with SJVN for 12 years starting in 1995, where he was responsible for planning, erection, and commissioning of the 1500MW Nathpa Jhakri Hydro Power Plant. He is not related to any director on SJVN's Board and is not debarred from holding directorship.",
            "Sentiment": "neutral",
            "PublishDate": 1762235988481,
            "Source": "corporate_governance"
        },
        {
            "Title": "SJVN Schedules Board Meeting to Review Q2 FY25 Results and Discuss Asset Securitization Fundraising",
            "Summary": "SJVN has scheduled a board meeting for November 10, 2025, with two key agenda items: reviewing Q2 FY25 financial results and discussing fundraising through asset securitization. The company has implemented a trading window closure from October 1 to November 12, 2025, during this period.",
            "Sentiment": "neutral",
            "PublishDate": 1762163998825,
            "Source": "corporate_action"
        },
        {
            "Title": "SJVN Limited Promotes Seven Officials to Executive Director Positions",
            "Summary": "SJVN Limited promoted seven officials to Executive Director (Senior Management) positions effective October 14, 2025. The promoted executives are Rajeev Kumar, Sanjay Kumar Garg, Rajesh Kumar Gupta, Anil Kumar Goel, Ajay Kumar Singh, Ravi Ranjan, and Pulak Kumar Mukhopadhyay. These officials bring extensive experience ranging from 5 to 34 years across various functions including design engineering, project construction, renewable energy development, and thermal power operations. The appointments are co-terminus with their superannuation date or until further orders. Ajay Kumar Singh serves as Chief Executive Officer of SJVN Green Energy Limited, where he led the company's renewable portfolio growth from 2.1 GW to 7.2 GW in less than three years.",
            "Sentiment": "positive",
            "PublishDate": 1760534829133,
            "Source": "corporate_governance"
        },
        {
            "Title": "SJVN Green Energy Achieves Commercial Operation of 128.88 MW Solar Capacity",
            "Summary": "SJVN Green Energy has achieved commercial operation of 128.88 MW capacity at its 1,000 MW Bikaner Solar Power Project. This represents a partial commissioning of the larger solar project located in Bikaner.",
            "Sentiment": "positive",
            "PublishDate": 1759232371278,
            "Source": "stock"
        },
        {
            "Title": "SJVN Limited Submits Voting Results of 37th Annual General Meeting",
            "Summary": "SJVN Limited submitted voting results from its 37th Annual General Meeting held on September 25, 2025, through video conferencing. The meeting addressed eight resolutions including adoption of audited financial statements for the year ended March 31, 2025, confirmation of interim dividend and declaration of final dividend for FY 2024-25, and various director appointments. Key appointments approved include Bhupender Gupta as Chairman and Managing Director, and Ajay Kumar Sharma as Whole-Time Director (Personnel). The company also approved the re-appointment of Dr. Udeeta Tyagi as Non-Official Independent Director, appointment of secretarial auditor, and ratification of cost auditor remuneration for FY 2025-26. Total shareholding stands at 3,929,795,175 shares with 1,484,316 shareholders on record date. The meeting saw participation from 2 promoter group representatives and 82 public shareholders through video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1758873405319,
            "Source": "corporate_action"
        },
        {
            "Title": "PM Modi Lays Foundation Stone for SJVN's 200 MW Khavda Solar Power Project in Gujarat",
            "Summary": "Prime Minister Narendra Modi laid the foundation stone for SJVN's 200 MW solar power project in Khavda, Gujarat. The project represents SJVN's expansion into renewable energy infrastructure in the state.",
            "Sentiment": "positive",
            "PublishDate": 1758500175129,
            "Source": "stock"
        },
        {
            "Title": "PM Modi Lays Foundation Stone for SJVN's 200 MW Khavda Solar Power Project in Gujarat",
            "Summary": "Prime Minister Narendra Modi laid the foundation stone for SJVN's 200 MW solar power project in Khavda, Gujarat. This represents a significant renewable energy infrastructure development for the state-owned power company.",
            "Sentiment": "positive",
            "PublishDate": 1758359677906,
            "Source": "stock"
        },
        {
            "Title": "SJVN Appoints Shubh Karan Singh as Part-Time Official Director",
            "Summary": "SJVN Limited has appointed Shri Shubh Karan Singh, Special Secretary (Power), Government of Himachal Pradesh as Part Time Official Director - Government of Himachal Pradesh Nominee on the Board of Directors, effective immediately. The appointment was made by the Ministry of Power through order No. 15-22/1/2018-HYDEL-II(MoP) dated September 11, 2025. Singh is a 2015 batch Indian Administrative Services (IAS) Officer who serves as Special Secretary (MPP & Power) and Non-Conventional Energy Sources in the Government of Himachal Pradesh. He previously served as Chief Executive Officer of HIMURJA and has held several administrative positions in the Himachal Pradesh Government during his career spanning more than 26 years. The appointed director is not related to any existing board member and is not debarred from holding directorship by any authority.",
            "Sentiment": "neutral",
            "PublishDate": 1757595137585,
            "Source": "corporate_governance"
        },
        {
            "Title": "SJVN Sets Record Date for Final Dividend of ₹0.31 Per Share for FY 2024-25",
            "Summary": "SJVN Limited has set September 18, 2025, as the record date for determining shareholder eligibility for a final dividend of ₹0.31 per equity share for FY 2024-25. The dividend payment is subject to approval at the company's 37th Annual General Meeting scheduled for September 25, 2025. The Board of Directors fixed this record date in compliance with SEBI listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1756968734312,
            "Source": "corporate_action"
        },
        {
            "Title": "BSE, NSE Fine SJVN Rs 6.74 Lakh Each for Board Composition Non-Compliance",
            "Summary": "Stock exchanges BSE and NSE imposed fines of Rs 6,73,780 each on state-owned SJVN for non-compliance with listing regulations. The penalties relate to inadequate composition of the Board, Audit Committee, Nomination Committee, and Remuneration Committee due to insufficient independent directors. SJVN stated the non-compliance has no financial or operational impact on the company. As a government entity, director appointments require approval from the President of India through the Ministry of Power. The company is actively working with the Ministry of Power to appoint the required number of independent directors and has indicated that committees have been reconstituted following proper appointments, bringing the company into full compliance with SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1756747368861,
            "Source": "corporate_governance"
        },
        {
            "Title": "SJVN Connects First Unit of 1320 MW Buxar Thermal Power Project to National Grid",
            "Summary": "SJVN has successfully synchronized the first unit of its 1320 MW Buxar Thermal Power Project with the National Grid. This marks a significant operational milestone for the power generation company's thermal power project.",
            "Sentiment": "positive",
            "PublishDate": 1755791906381,
            "Source": "stock"
        },
        {
            "Title": "SJVN Reports Mixed Q1 Results with 20.9% Drop in Standalone Profit Despite Revenue Growth",
            "Summary": "SJVN Limited reported quarterly results with standalone revenue of ₹822.44 crore, declining 1.1% year-over-year, while standalone net profit fell 20.9% to ₹258.51 crore. Consolidated revenue grew 5.4% to ₹917.45 crore, but consolidated net profit dropped significantly by 36.3% to ₹227.58 crore. The company's hydro power generation revenue increased 2.7% to ₹801.05 crore, and renewable energy revenue grew 21.9% to ₹19.12 crore. SJVN commissioned 501.02 MW of its 1000 MW Bikaner Solar Project during the quarter, generating ₹32.99 crore in revenue. The company's standalone net worth increased to ₹14,537.71 crore with an improved debt-equity ratio of 0.72x. However, the Devasari Hydro Electric Project remains on hold, with ₹199.21 crore expenditure carried as capital work in progress. The board appointed Shri Vivek Bhatnagar as Chief Internal Auditor.",
            "Sentiment": "negative",
            "PublishDate": 1754908815482,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Reports Higher Q1 Revenue and EBITDA with Improved Margins",
            "Summary": "SJVN reported Q1 revenue of 9.2 billion rupees compared to 8.7 billion rupees in the same period last year. The company's EBITDA increased to 7.42 billion rupees from 6.7 billion rupees year-over-year. EBITDA margin improved to 80.9% versus 76.7% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754906914840,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Reports 37% Decline in Quarterly Consolidated Net Profit",
            "Summary": "SJVN's consolidated net profit dropped to 2.28 billion rupees in the first quarter, down from 3.6 billion rupees in the same period last year, representing a year-over-year decline of approximately 37%.",
            "Sentiment": "negative",
            "PublishDate": 1754906170613,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Scheduled to Release Q1 FY26 Results on August 11",
            "Summary": "State-owned power generation company SJVN Ltd. will announce its quarterly results on Monday, August 11. The company's trading window has been closed since July 1 and will remain shut until August 13. In the previous quarter, SJVN reported consolidated revenue of Rs 504 crore, up 4.5% year-on-year, but posted a net loss of Rs 127.6 crore compared to a profit of Rs 61 crore in the same period last year. SJVN shares have declined significantly, falling 17.24% year-to-date and 34.15% over the past year. The stock closed at Rs 91.74 on Friday, down 1.68%.",
            "Sentiment": "negative",
            "PublishDate": 1754743282178,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Limited Announces Key Leadership Changes with CFO Cessation Due to Superannuation",
            "Summary": "SJVN Limited announced leadership changes affecting two senior positions. Shri Sanjay Kumar ceased as Chief Financial Officer effective July 31, 2025, due to superannuation. Additionally, Shri Shailender Aggarwal ceased as Chief Internal Auditor on the same date following an internal transfer within the company. The changes were communicated to stock exchanges as part of regulatory compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1754030120209,
            "Source": "corporate_governance"
        },
        {
            "Title": "SJVN Ltd: Subsidiary Achieves Commercial Operation of 100 MW Solar Capacity",
            "Summary": "SJVN Green Energy Ltd, a subsidiary of SJVN Ltd, has achieved commercial operation of 100.25 MW part capacity out of 1,000 MW for its Bikaner Solar Power Project. The total commissioned capacity now stands at 501.02 MW, with the remaining expected to be operational soon.",
            "Sentiment": "positive",
            "PublishDate": 1751344877000,
            "Source": "corporate_action"
        },
        {
            "Title": "SJVN Green Energy Completes 100.25 MW Bikaner Solar Project",
            "Summary": "SJVN Green Energy has announced the completion of its 100.25 MW solar power project in Bikaner. The project's completion date has been achieved, marking a significant milestone in the company's renewable energy initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1751289028000,
            "Source": "default"
        },
        {
            "Title": "SJVN Ltd: Final Dividend Announced for FY25, Q4 Results Reported",
            "Summary": "SJVN Ltd declared a final dividend of Rs 0.31 per share for FY25, in addition to the interim dividend of Rs 1.15. Q4FY25 results show revenue up 4.5% to Rs 504 crore, but a net loss of Rs 127.6 crore. The company also reported on the utilization of its Rs 1,000 crore NCD issue from 2021.",
            "Sentiment": "neutral",
            "PublishDate": 1748578215000,
            "Source": "corporate_action"
        },
        {
            "Title": "SJVN Ltd: Q4 FY25 Results Show Net Loss of Rs 127.6 Crore",
            "Summary": "SJVN Ltd reported a net loss of Rs 127.6 crore in Q4 FY25, compared to a profit of Rs 61 crore in Q4 FY24. Revenue increased 4.5% YoY to Rs 504 crore. The company announced a dividend of Rs 3.1 per share.",
            "Sentiment": "negative",
            "PublishDate": 1748576635000,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Ltd: Q4 Loss Despite Revenue Growth, Dividend Declared",
            "Summary": "SJVN Ltd reported a net loss of Rs 127.6 crore in Q4 FY23, despite a 4.5% increase in revenue to Rs 504 crore. The company declared a final dividend of Rs 0.31 per share.",
            "Sentiment": "negative",
            "PublishDate": 1748530798000,
            "Source": "earnings"
        },
        {
            "Title": "SJVN Approves Securitization of NJHPS Cash Flow for Fundraising",
            "Summary": "SJVN has approved raising funds through securitization of partial future unencumbered free cash flow from the Nathpa Jhakri Hydro Power Station (NJHPS). This decision indicates a strategic move by the company to leverage its existing assets for financial purposes.",
            "Sentiment": "positive",
            "PublishDate": 1748530238000,
            "Source": "default"
        },
        {
            "Title": "SJVN Reports Q4 Financial Results",
            "Summary": "SJVN has released its Q4 financial results. The company reported an EBITDA of 2.4 billion rupees, unchanged from the same period last year. The EBITDA margin decreased to 47.76% from 49.64% year-over-year. SJVN reported a consolidated net loss of 1.3 billion rupees, compared to a loss of 611 million rupees in the same quarter last year. However, this represents an improvement from the previous quarter's profit of 1.5 billion rupees. Revenue for Q4 increased to 5 billion rupees from 4.83 billion rupees in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748530137000,
            "Source": "result"
        },
        {
            "Title": "SJVN Ltd: Q4FY25 Results Date Set, Dividend and Fundraising on Agenda",
            "Summary": "SJVN Ltd will announce Q4 and FY25 results on May 29, 2025. Board to consider dividend declaration and fundraising proposals. Earnings call scheduled for May 30. Trading window closed for designated persons until 48 hours post-results.",
            "Sentiment": "neutral",
            "PublishDate": 1748407219000,
            "Source": "corporate_action"
        },
        {
            "Title": "SJVN to Consider Fundraising via Asset Securitization",
            "Summary": "SJVN has announced a board meeting scheduled for May 29 to consider raising funds through the securitization of assets.",
            "Sentiment": "neutral",
            "PublishDate": 1748259736000,
            "Source": "default"
        },
        {
            "Title": "SJVN Begins Commercial Operations of 78.23 MW Solar Project in Bikaner",
            "Summary": "SJVN has commenced commercial operations of a 78.23 MW capacity solar project located in Bikaner. This marks a significant milestone in the company's renewable energy portfolio expansion.",
            "Sentiment": "positive",
            "PublishDate": 1747316996000,
            "Source": "default"
        },
        {
            "Title": "SJVN to Consider Q4 Results on May 29",
            "Summary": "SJVN Limited has announced that it will consider its fourth quarter financial results on May 29. This is a standard corporate procedure where the company's board of directors will review and approve the financial statements for the last quarter of their fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1747137072000,
            "Source": "default"
        },
        {
            "Title": "SJVN Appoints New Chairman and Managing Director",
            "Summary": "India's Ministry of Power has appointed Bhupendra Gupta as the new Chairman and Managing Director of SJVN, a state-owned power company.",
            "Sentiment": "neutral",
            "PublishDate": 1746190443000,
            "Source": "default"
        },
        {
            "Title": "SJVN Ltd: Pays Rs 121 Crore Interim Dividend to Himachal Pradesh Government",
            "Summary": "SJVN Ltd has paid an interim dividend of Rs 121.33 crore to the Himachal Pradesh government for FY 2024-25. The company declared a total interim dividend of Rs 451.93 crore, with Rs 248.55 crore paid to the Government of India and Rs 82.05 crore to public shareholders. SJVN is currently implementing 95 power projects across India and Nepal, with an installed capacity of 2,708.27 MW and a total project portfolio of 66,107.4 MW.",
            "Sentiment": "positive",
            "PublishDate": 1744816824000,
            "Source": "corporate_action"
        }
    ]
}