{
    "Symbol": "SKFINDIA",
    "ISIN": "INE640A01023",
    "News": [
        {
            "Title": "SKF India Industrial Gets Listed Status & New CIN",
            "Summary": "SKF India (Industrial) Limited officially changes CIN from U28140PN2024PLC236396 to L28140PN2024PLC236396, reflecting its transition from unlisted to listed status following December 2025 stock exchange listing.",
            "Sentiment": "positive",
            "PublishDate": 1770637299932,
            "Source": "co_actions_results"
        },
        {
            "Title": "SKF India Appoints Samdani & Co as Tax Auditor",
            "Summary": "SKF India Limited has appointed M/s Samdani & Co, Chartered Accountants as Tax and GST Auditors for FY 2025-26, following board approval on February 05, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770305429800,
            "Source": "stocks"
        },
        {
            "Title": "SKF India Reports Q3 FY26 Results with Demerger Impact",
            "Summary": "SKF India announced Q3 FY26 results showing revenue of ₹5,766.4 million and net profit of ₹620.0 million. The company completed demerger of industrial operations and appointed new auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1770303389208,
            "Source": "co_actions_results"
        },
        {
            "Title": "SKF India Plans ₹653 Cr Factory in Pune by 2030",
            "Summary": "SKF India announces investment of ₹653 crore for new manufacturing facility in Pune, to be funded through internal resources with timeline spanning 2026-2030.",
            "Sentiment": "positive",
            "PublishDate": 1770172539573,
            "Source": "stocks"
        },
        {
            "Title": "SKF India Appoints Poorva Bang as Company Secretary",
            "Summary": "SKF India (Industrial) Limited announces appointment of Ms. Poorva Bang as Company Secretary & Compliance Officer effective February 03, 2026, replacing Mr. Ranjan Kumar who resigned.",
            "Sentiment": "neutral",
            "PublishDate": 1770140130260,
            "Source": "stocks"
        },
        {
            "Title": "SKF India Board Meeting Set for February 3, 2026",
            "Summary": "SKF India (Industrial) Limited has scheduled a board meeting on February 3, 2026, to consider and approve unaudited financial results for Q3 and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769534958276,
            "Source": "co_actions_results"
        },
        {
            "Title": "SKF India Reports Insider Trading Code Violation",
            "Summary": "SKF India Limited disclosed that a designated person violated insider trading regulations by executing contra-trades within six months, prompting company action and regulatory reporting.",
            "Sentiment": "negative",
            "PublishDate": 1768478510815,
            "Source": "stocks"
        },
        {
            "Title": "SKF India Director Mukund Vasudevan Resigns",
            "Summary": "SKF India announces resignation of Non-Executive Director Mukund Vasudevan effective January 12, 2026, citing other occupancies and commitments as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768221688190,
            "Source": "stocks"
        },
        {
            "Title": "SKF India Director Karl Landholm Resigns Jan 2026",
            "Summary": "SKF India announces resignation of Non-Executive Director Karl Robin Joakim Landholm effective January 12, 2026, citing other occupancies and commitments as reason for departure.",
            "Sentiment": "neutral",
            "PublishDate": 1768221274080,
            "Source": "stocks"
        },
        {
            "Title": "SKF India Director Kerstin Enochsson Resigns",
            "Summary": "SKF India announces resignation of Ms. Kerstin Enochsson as Non-Executive, Non-Independent Director effective January 12, 2026, citing other occupancies and commitments as the reason.",
            "Sentiment": "neutral",
            "PublishDate": 1768220618938,
            "Source": "stocks"
        },
        {
            "Title": "SKF India Appoints 3 New Directors, 3 Resign",
            "Summary": "SKF India Limited announced appointment of three Additional Directors (Non-Executive, Non-Independent) effective January 13, 2026, while three existing directors resigned due to other commitments.",
            "Sentiment": "neutral",
            "PublishDate": 1768046953266,
            "Source": "stocks"
        },
        {
            "Title": "SKF India Appoints 3 New Directors, 3 Resign",
            "Summary": "SKF India Limited announced appointment of three Additional Directors and resignation of three existing Directors effective January 13, 2026, following Board approval on January 10, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768044127664,
            "Source": "stocks"
        },
        {
            "Title": "SKF India Block Trade Worth ₹21.38 Crores on NSE",
            "Summary": "SKF India witnessed a significant block trade on NSE involving 115,503 shares valued at ₹21.38 crores, executed at ₹1,851.30 per share, indicating substantial institutional interest.",
            "Sentiment": "neutral",
            "PublishDate": 1767241613200,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mirae Asset MF Raises SKF India Stake to 8.65%",
            "Summary": "Mirae Asset Mutual Fund acquired 1.90 lakh shares of SKF India (Industrial) Ltd through open market purchase, increasing its shareholding from 8.26% to 8.65% on December 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766472647008,
            "Source": "co_actions_results"
        },
        {
            "Title": "Mirae Asset Mutual Fund Acquires 6.32% in SKF India",
            "Summary": "Mirae Asset Mutual Fund acquired 31,25,019 shares representing 6.32% stake in SKF India (Industrial) Ltd through open market transactions on December 9, 2025, following demerger with SKF India Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1765378729144,
            "Source": "co_actions_results"
        },
        {
            "Title": "SKF India Submits Compliance Response to BSE for Demerger Scheme with SKF India (Industrial) Limited",
            "Summary": "SKF India Limited has submitted a detailed compliance letter to BSE addressing 17 observations regarding its demerger scheme with SKF India (Industrial) Limited, confirming adherence to disclosure requirements and regulatory provisions. The company filed its NCLT application on April 9, 2025, within the six-month deadline, with the tribunal dispensing the requirement for unsecured creditors' meetings and directing shareholder approval through e-voting.",
            "Sentiment": "neutral",
            "PublishDate": 1764339067978,
            "Source": "corporate_action"
        },
        {
            "Title": "SKF India Provides Cost Allocation Guidance Post-Demerger Following NCLT Approval",
            "Summary": "SKF India Limited has issued guidance to shareholders on apportioning acquisition costs following the NCLT-approved demerger of its Industrial Business into SKF India (Industrial) Limited, with shareholders receiving one equity share of the new entity for every share held. The company recommends allocating 46.88% of original acquisition costs to SKF India Limited shares and 53.12% to SKF India (Industrial) Limited shares for tax calculation purposes.",
            "Sentiment": "neutral",
            "PublishDate": 1763730462523,
            "Source": "corporate_action"
        },
        {
            "Title": "SKF India Shareholders Approve Key Resolutions Through Postal Ballot",
            "Summary": "SKF India shareholders approved three resolutions via postal ballot including material related party transactions with SKF India (Industrial) Limited, appointment of Shailesh Kumar Sharma as Managing Director for 5 years, and appointment of Mukund Vasudevan as Non-Executive Director. All resolutions passed with requisite majority through remote e-voting process conducted from October 17 to November 15, 2025, with voting results showing over 97% approval rates across all proposals.",
            "Sentiment": "positive",
            "PublishDate": 1763376594813,
            "Source": "corporate_action"
        },
        {
            "Title": "Mutual Funds Increase SKF India Stakes as Stock Breaks 10-Day Losing Streak",
            "Summary": "SKF India shares gained 5% after a 10-day decline, with mutual funds continuing to increase exposure in October through significant purchases by HDFC MF (₹1,300 crore), Mirae MF (₹805 crore), and ICICI Prudential (₹260 crore). The auto ancillary company now has 23.83% mutual fund ownership, with analyst coverage showing five buy ratings versus three hold and one sell recommendation.",
            "Sentiment": "positive",
            "PublishDate": 1763356333957,
            "Source": "stock"
        },
        {
            "Title": "SKF India Reports 5.2% Revenue Growth to Rs 13,091 Million in Q2, Completes Strategic Demerger",
            "Summary": "SKF India announced consolidated revenue of Rs 13,090.6 million for Q2 FY2025-26, marking 5.2% year-over-year growth, with profit before tax at Rs 1,406.2 million compared to Rs 1,268.8 million in the previous year. The company has completed its demerger into two focused entities - SKF Industrial and SKF Automotive - with planned investments of Rs 8,000-9,500 million and Rs 4,100-5,100 million respectively by 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1763193812427,
            "Source": "earnings"
        },
        {
            "Title": "SKF India Reports Strong Q2 Performance with 34% EBITDA Growth",
            "Summary": "SKF India's Q2 EBITDA increased to 1.66 billion rupees from 1.24 billion rupees year-over-year, representing significant growth in profitability. The company's EBITDA margin expanded to 12.66% from 9.95% in the same period last year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1763135518718,
            "Source": "earnings"
        },
        {
            "Title": "SKF India Completes Demerger with Share Allotment to Industrial Unit",
            "Summary": "SKF India Limited's board approved the allotment of 4,94,37,963 equity shares of ₹10 face value each to SKF India (Industrial) Limited as part of a demerger scheme. The shares will be distributed to SKF India shareholders who held shares on the record date of October 15, 2025. SKF India (Industrial) Limited cancelled its pre-scheme share capital of 10,000 equity shares that were entirely held by SKF India. The resulting company will apply for listing its equity shares on BSE and NSE, with shares remaining frozen until trading permission is granted by the stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1760720090012,
            "Source": "corporate_action"
        },
        {
            "Title": "SKF India Shares Show 54% Drop Due to Demerger Adjustment, Actual Decline Only 5%",
            "Summary": "SKF India shares appeared to crash 54% on October 15, opening at Rs 2,395.85 after closing at Rs 5,010.75 the previous day. However, this dramatic fall was due to a price adjustment following the demerger of its automotive and industrial businesses, with the actual market decline being only 5%. The stock hit its lower circuit at Rs 2,276.10. The demerger became effective October 1, with October 15 as the record date for shareholder eligibility. Post-demerger, existing SKF India shares represent the automotive business, while the new industrial entity shares are expected to list in November 2024. Shareholders will receive one share of SKF India (Industrial) for every share held in the parent company. The company stated this restructuring aims to create two focused organizations with dedicated management teams and improve agility in responding to market dynamics.",
            "Sentiment": "neutral",
            "PublishDate": 1760519123120,
            "Source": "corporate_action"
        },
        {
            "Title": "SKF India Seeks Shareholder Approval for Material Related Party Transactions and New Managing Director Appointment",
            "Summary": "SKF India Limited has issued a postal ballot notice seeking shareholder approval for three key resolutions through remote e-voting. The company is requesting approval for material related party transactions with SKF India (Industrial) Limited worth up to ₹19,355 million for FY 2025-26, following a demerger scheme that became effective from October 1, 2025. The transactions include reimbursements, services under interim agreements, trading goods, and manufacturing support services between the two entities. Additionally, shareholders will vote on appointing Shailesh Kumar Sharma as Managing Director for five years with effect from October 1, 2025, and continuing Mukund Vasudevan as Non-Executive Director after his resignation from the Managing Director position. The e-voting period runs from October 17, 2025 at 9:00 AM to November 15, 2025 at 5:00 PM. The company has appointed Jayavant B Bhave as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1760372189744,
            "Source": "corporate_action"
        },
        {
            "Title": "SKF India Appoints Bhavna Panigrahi as Interim HR Head for Automotive India Division",
            "Summary": "SKF India Limited has appointed Ms. Bhavna Panigrahi as Interim HR Head, Automotive India, joining the Senior Management Team. The appointment was approved by the Board of Directors on September 30, 2025, based on the Nomination and Remuneration Committee's recommendation. Ms. Panigrahi holds an MBA in Human Resource Management and Industrial Relations and brings 17 years of HR experience across India and Southeast Asia. Her expertise includes aligning human capital with business objectives, diversity and inclusion initiatives, and organizational change management. She previously worked with Schneider Electric India Pvt. Ltd. from September 2016 to May 2022 and Tata Consultancy Services from May 2008 to September 2016. She is not related to any Directors, Key Managerial Personnel, or Promoters of the Company.",
            "Sentiment": "positive",
            "PublishDate": 1759242507388,
            "Source": "corporate_governance"
        },
        {
            "Title": "SKF India Appoints Mukund Vasudevan as Non-Executive Non-Independent Director",
            "Summary": "SKF India Limited appointed Mr. Mukund Vasudevan as a Non-executive Non-Independent Director effective October 1, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval. Vasudevan holds a Bachelor of Technology from IIT Mumbai and an MBA in Finance and Strategy from the University of Chicago. He brings over 25 years of experience in P&L management, strategy development, sales and M&A across India, the Middle East and USA. His previous roles include Managing Director positions at Moglix and ECOLAB, and senior positions at Pentair, McKinsey & Company, and Schlumberger. The company confirmed that Vasudevan is not debarred from holding directorship and is not related to any existing directors, key managerial personnel, or promoters of the company.",
            "Sentiment": "positive",
            "PublishDate": 1759238193495,
            "Source": "corporate_governance"
        },
        {
            "Title": "NCLT Approves SKF India's Industrial Business Demerger into Separate Listed Entity",
            "Summary": "The National Company Law Tribunal Mumbai Bench has sanctioned the demerger of SKF India Limited's Industrial Business to SKF India (Industrial) Limited. Under the scheme, shareholders will receive one share of the new industrial company for every share held in SKF India. The industrial business will operate as a separate listed entity on BSE and NSE, while SKF India retains its automotive business. The demerger aims to provide focused management for each business segment, enable independent growth strategies, and unlock shareholder value. Both companies will maintain the same shareholding pattern, with the industrial entity becoming independently listed. The scheme received no objections from regulatory authorities including Income Tax Department, RBI, and stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1758896890911,
            "Source": "corporate_action"
        },
        {
            "Title": "AB SKF to Acquire 6.73% Stake in SKF India Through Inter-se Transfer",
            "Summary": "AB SKF, the promoter of SKF India Limited, will acquire 3,326,004 equity shares representing 6.73% of total shareholding through an off-market inter-se transfer. The shares will be transferred from two promoter group entities - SKF (U.K.) Limited (3,129,581 shares or 6.33%) and SKF Förvaltning AB (196,423 shares or 0.40%). The transaction is structured as a dividend in kind distribution and will occur on or after October 1, 2025, without any monetary consideration. Following the transfer, AB SKF's shareholding will increase from 45.85% to 52.58%, while the aggregate promoter group holding remains unchanged. The transaction falls under regulatory exemptions as an inter-se transfer among promoters.",
            "Sentiment": "neutral",
            "PublishDate": 1758781060355,
            "Source": "corporate_action"
        },
        {
            "Title": "SKF India Q1 FY26 Results: Revenue Grows 6% YoY Despite 530 bps Margin Drop Due to Demerger Costs",
            "Summary": "SKF India reported 6% year-on-year revenue growth in Q1 FY26, driven by strong 13% growth in Industrial business from railways, wind and heavy sectors, while Automotive business remained flat with 0.4% decline. The company's margins dropped by 530 basis points primarily due to demerger-related costs of INR 184 million, including IT implementation and consulting expenses. Cash flow improved 13% year-on-year. The demerger process has progressed with NCLT filing completed and shareholder approval received on July 14. Manufacturing line allocation finalized with Bangalore getting 7 automotive and 3 industrial lines, while Pune will have 12 automotive and 10 industrial lines. The company expects demerger costs to continue until first half of next financial year, impacting margins by 1.5-2%. Management anticipates reaching 16-19% margin range from 2028 onwards post-demerger completion.",
            "Sentiment": "neutral",
            "PublishDate": 1755092819375,
            "Source": "earnings"
        },
        {
            "Title": "SKF India Makes Q1 FY 2025-26 Earnings Call Audio Recording Available Online",
            "Summary": "SKF India Limited has made the audio recording of its Q1 FY 2025-26 investor earnings call available on its website. The earnings call was held on August 7, 2025, at 10:30 a.m. IST. The audio recording can be accessed through the company's investor relations section at https://www.skf.com/in/investors/shareholder-information. The company has notified stock exchanges NSE and BSE about the availability of this recording for shareholders and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1754624769168,
            "Source": "earnings"
        },
        {
            "Title": "SKF India Reports Q1 FY26 Results with Revenue of ₹12,831.5 Million",
            "Summary": "SKF India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025. The company reported standalone revenue from operations of ₹12,831.5 million compared to ₹12,062.2 million in the same quarter last year. Standalone profit for the period was ₹1,186.0 million versus ₹1,590.4 million in the previous year quarter. On a consolidated basis, profit was ₹1,182.1 million compared to ₹1,589.3 million in the corresponding quarter. Basic earnings per share stood at ₹24.0 for standalone and ₹23.9 for consolidated results. The statutory auditors Deloitte Haskins & Sells LLP issued limited review reports with unmodified opinions on both standalone and consolidated results. The consolidated results include SKF India (Industrial) Limited as subsidiary and two associates - Sunstrength Renewables Private Limited and Clean Max Taiyo Private Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1754498581382,
            "Source": "earnings"
        },
        {
            "Title": "SKF India Shareholders Approve Demerger Scheme to Split Automotive and Industrial Businesses",
            "Summary": "SKF India Limited held an NCLT-convened meeting where equity shareholders approved a scheme of arrangement to demerge the company's industrial business into a separate entity, SKF India (Industrial) Limited. The demerger will create two independent companies - one focused on automotive and another on industrial segments. Shareholders will receive one share in the new industrial company for every share held in SKF India. The company expects NCLT approval by September-October 2025 and aims to complete the entire process by Q4 2025. Management stated the demerger aims to create two fit-for-purpose companies that can serve their respective markets better and grow faster. The automotive business is 95% localized while industrial is around 50% localized, with plans to increase industrial localization to 70%. Annual CAPEX is expected to increase from 150 crores to 350-400 crores to support capacity expansion and build a dedicated industrial factory. Shares of the new industrial entity will be listed on BSE and NSE upon scheme effectiveness.",
            "Sentiment": "positive",
            "PublishDate": 1753160374818,
            "Source": "corporate_action"
        },
        {
            "Title": "SKF India Shareholders Approve Demerger Plan",
            "Summary": "Shareholders of SKF India have approved a demerger plan involving SKF India (Industrial) Ltd through a meeting ordered by the National Company Law Tribunal (NCLT). The plan involves separating a part of SKF India's business into a new entity.",
            "Sentiment": "positive",
            "PublishDate": 1752510081000,
            "Source": "default"
        },
        {
            "Title": "SKF India: Rs 1,460 Crore Investment Plan by 2030",
            "Summary": "SKF India plans to invest up to Rs 1,460 crore by 2030 to enhance manufacturing capabilities across key facilities in industrial and automotive segments. The investment includes Rs 800-950 crore for industrial business and Rs 410-510 crore for automotive business, focusing on capacity increases in Haridwar, Pune, and Bangalore plants.",
            "Sentiment": "positive",
            "PublishDate": 1751295166000,
            "Source": "corporate_action"
        },
        {
            "Title": "SKF India Announces Major Investment and EBITDA Projections",
            "Summary": "SKF India has announced significant investment plans and EBITDA projections. The company plans to invest 4.5 to 5 billion rupees in capital expenditures over the next 5 years for a new plant. Additionally, it plans to invest 3.5 - 4.5 billion rupees in capex over the next five years for channel growth. SKF India expects its industrial business EBITDA to remain between 16% and 18% for the next three years. The company also anticipates its automotive business EBITDA will remain between 17-19% for the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1751257252000,
            "Source": "default"
        },
        {
            "Title": "SKF India Plans to Double Capex and Expects Margin Expansion",
            "Summary": "SKF India announced plans to double its current capital expenditure (capex) from Rs 130-150 crores in the current fiscal year. The company expects its capex to double in the next 2-3 years, currently in the range of around Rs 130 crores. Additionally, SKF India anticipates margin expansion on both sides of its business over the next 3 years.",
            "Sentiment": "positive",
            "PublishDate": 1747711260000,
            "Source": "default"
        },
        {
            "Title": "SKF India: Q4 Profit Surges 20%, Declares Dividend",
            "Summary": "SKF India reported a 20% YoY increase in Q4FY25 net profit to ₹275.65 crore. Revenue slightly rose to ₹1,213.4 crore. EBITDA grew 33% YoY to ₹284 crore. The company declared a final dividend of ₹14.5 per share. Stock rallied 9% on results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1747375022000,
            "Source": "result"
        },
        {
            "Title": "SKF India: Q4 Margins Soar on Cost Controls, Shares Surge 8%",
            "Summary": "SKF India's Q4 profit rose 16% YoY to ₹203 crore. Revenue increased 1% to ₹1,213 crore. EBITDA margin expanded to 23.5% from 17.7% last year. Cost controls and reduced raw material costs boosted gross margin to 49%. Shares surged up to 8.4% on May 16.",
            "Sentiment": "positive",
            "PublishDate": 1747372176000,
            "Source": "earnings"
        },
        {
            "Title": "SKF India to Consider Q4 Results on May 15",
            "Summary": "SKF India has announced that it will consider and approve its financial results for the fourth quarter on May 15. This is a routine corporate announcement regarding the company's upcoming earnings release.",
            "Sentiment": "neutral",
            "PublishDate": 1746713452000,
            "Source": "default"
        },
        {
            "Title": "SKF India Ltd. Block Trade: 47,934 Shares Sold for Rs. 18.07 Crores",
            "Summary": "A block trade of approximately 47,934 shares of SKF India Ltd. was executed on the National Stock Exchange (NSE) at a price of Rs. 3770.00 per share. The total value of the transaction amounted to Rs. 18.07 Crores.",
            "Sentiment": "neutral",
            "PublishDate": 1743746755000,
            "Source": "block_deals"
        },
        {
            "Title": "SKF India Reports Q3 Financial Results",
            "Summary": "SKF India has announced its financial results for the third quarter. The company reported a consolidated net profit of 1.1 billion rupees, down from 1.32 billion rupees in the same period last year. However, revenue increased to 12.56 billion rupees from 10.92 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739405807000,
            "Source": "earnings"
        },
        {
            "Title": "SKF India Reports Decline in Q3 EBITDA and Margin",
            "Summary": "SKF India has reported its financial results for the third quarter. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 1.21 billion rupees from 1.72 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 9.65% from 15.77% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739370312000,
            "Source": "earnings"
        },
        {
            "Title": "SKF India Reports Q3 Financial Results",
            "Summary": "SKF India has announced its financial results for the third quarter. The company's consolidated net profit decreased to 1.1 billion rupees from 1.32 billion rupees in the same period last year. However, revenue increased to 12.56 billion rupees from 10.92 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739370306000,
            "Source": "earnings"
        },
        {
            "Title": "SKF India to Consider Q3 Results on February 12",
            "Summary": "SKF India has announced that it will consider its third quarter (Q3) financial results on February 12. This is a routine quarterly financial reporting event for the company.",
            "Sentiment": "neutral",
            "PublishDate": 1738756396000,
            "Source": "result"
        },
        {
            "Title": "SKF India to Demerge Industrial Business",
            "Summary": "SKF India has announced a demerger of its industrial business. The scheme will result in the creation of two separate listed companies with mirror shareholding. Shareholders of the demerged company will receive one share in the resulting company for every share they hold in the original company.",
            "Sentiment": "neutral",
            "PublishDate": 1735223919000,
            "Source": "corporate_action"
        },
        {
            "Title": "SKF India Reports Q2 Financial Results",
            "Summary": "SKF India has announced its Q2 financial results. The company's EBITDA for the quarter was 1.24 billion rupees, compared to 1.2 billion rupees in the same quarter last year. The EBITDA margin decreased to 9.95% from 10.8% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731499609000,
            "Source": "result"
        },
        {
            "Title": "SKF India Reports Q2 Financial Results",
            "Summary": "SKF India has announced its Q2 financial results. The company's consolidated net profit for the quarter is 942 million rupees, showing a year-over-year increase from 900 million rupees. However, it's a decrease from the previous quarter's 1.6 billion rupees. Revenue for Q2 stands at 12.4 billion rupees, up from 11.25 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731499570000,
            "Source": "result"
        },
        {
            "Title": "SKF India Approves Evaluation of Industrial Business Demerger and New Subsidiary",
            "Summary": "<p><span class='neutral'>SKF India's</span> board has <span class='positive'>approved</span> two significant corporate actions: 1) The <b>evaluation and selection process</b> for <span class='neutral'>demerging</span> its <b>Industrial Business</b>, and 2) The <b>incorporation</b> of a new <span class='neutral'>wholly owned subsidiary</span>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728390856000,
            "Source": "corporate_action"
        }
    ]
}