{
    "Symbol": "SKIPPER",
    "ISIN": "INE439E01022",
    "News": [
        {
            "Title": "Skipper Gets NSE Cautionary Letter on Compliance",
            "Summary": "Skipper Limited received a cautionary letter from NSE on January 27, 2026, regarding secretarial compliance observations reported by the auditor for FY25, with no financial impact on operations.",
            "Sentiment": "negative",
            "PublishDate": 1769772487106,
            "Source": "stocks"
        },
        {
            "Title": "Skipper Limited Board Meet on Jan 29 for Q3FY26 Results",
            "Summary": "Skipper Limited has scheduled a board meeting on January 29, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769238736996,
            "Source": "co_actions_results"
        },
        {
            "Title": "Skipper Limited Gets CARE A1 Rating for Bank Facilities",
            "Summary": "CARE Ratings assigns CARE A1 rating to Skipper Limited's ₹150 crore short-term bank facilities, reflecting strong credit quality and liquidity position of the engineering company.",
            "Sentiment": "positive",
            "PublishDate": 1768472561599,
            "Source": "stocks"
        },
        {
            "Title": "Skipper Limited Gets CARE A1 Rating for Bank Facilities",
            "Summary": "CARE Ratings Limited has assigned CARE A1 rating to Skipper Limited's short term bank facilities worth ₹100.00 crores. The company disclosed this credit rating assignment under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1768205256148,
            "Source": "stocks"
        },
        {
            "Title": "Skipper Ltd Initiates Coverage with Buy Rating at ₹490",
            "Summary": "India's largest transmission line tower manufacturer receives Buy rating with target price of ₹490. Company plans to double capacity to 0.6mn TPA by FY29 with strong order book of ₹8,800 crores.",
            "Sentiment": "positive",
            "PublishDate": 1767102713835,
            "Source": "stocks"
        },
        {
            "Title": "Systematix Initiates Coverage on Skipper with Buy Rating",
            "Summary": "Systematix Securities has initiated coverage on Skipper Ltd with a 'Buy' rating, citing the company's integrated manufacturing capabilities, strong domestic T&D capex visibility, and expansion into developed geographies.",
            "Sentiment": "positive",
            "PublishDate": 1767069716270,
            "Source": "stocks"
        },
        {
            "Title": "Skipper Limited Gets CRISIL A/Stable Credit Rating",
            "Summary": "Skipper Limited receives CRISIL A/Stable long-term rating and CRISIL A1 short-term rating from CRISIL Ratings Limited, reflecting the company's creditworthiness and financial stability.",
            "Sentiment": "positive",
            "PublishDate": 1766401401991,
            "Source": "stocks"
        },
        {
            "Title": "Skipper Limited Receives CGST Demand Order Worth ₹14.46 Lakh",
            "Summary": "Skipper Limited disclosed receiving a CGST demand order totaling ₹14.46 lakh from Chhattisgarh tax authorities under Section 73 of CGST Act 2017. Company states no material impact on operations and plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766225434839,
            "Source": "stocks"
        },
        {
            "Title": "Skipper Limited Implements SAP S/4HANA RISE ERP Platform",
            "Summary": "Skipper Limited has successfully implemented SAP S/4HANA RISE as its enterprise-wide ERP platform under Project GARUDA, covering finance, supply chain, manufacturing and other business functions. The implementation aims to enhance business agility through real-time data analytics and streamlined processes, with no immediate material impact on revenue or profitability expected.",
            "Sentiment": "positive",
            "PublishDate": 1764934578910,
            "Source": "stock"
        },
        {
            "Title": "Skipper Gets Relief as Tax Demand of ₹102.1 Million Withdrawn",
            "Summary": "Skipper has received relief as a tax demand of ₹102.1 million against the company has been withdrawn. This development removes a significant financial liability from the company's books, potentially improving its financial position.",
            "Sentiment": "positive",
            "PublishDate": 1764588307969,
            "Source": "stock"
        },
        {
            "Title": "Skipper Limited Forfeits 33,198 Partly Paid-Up Equity Shares Due to Non-Payment",
            "Summary": "Skipper Limited's Board of Directors decided to forfeit 33,198 partly paid-up equity shares with face value of Re. 1 each due to shareholders' failure to pay First and Final Call money by the deadline of August 20, 2025. The forfeiture affects shareholders who did not respond to multiple notices since November 2024, resulting in extinction of all their interests and claims in the forfeited shares.",
            "Sentiment": "negative",
            "PublishDate": 1763463637070,
            "Source": "corporate_action"
        },
        {
            "Title": "Skipper Limited Promotes Jalaj Kumar Malpani to Chief Operating Officer",
            "Summary": "Skipper Limited redesignated Mr. Jalaj Kumar Malpani from President-Business Excellence to Chief Operating Officer effective November 18, 2025. The promotion recognizes his versatile experience across HR, IT Digital Transformation, EHS Sustainability, and Power Improvement Initiatives within the company.",
            "Sentiment": "positive",
            "PublishDate": 1763460992246,
            "Source": "corporate_governance"
        },
        {
            "Title": "Skipper Limited Reports Record Q2 Revenue of INR 1,262 Crores, Up 14% YoY with Strong Order Book Growth",
            "Summary": "Skipper Limited achieved its highest-ever second quarter revenue of INR 1,262 crores with 14% year-on-year growth, driven by strong engineering product supply execution and EBITDA reaching INR 131 crores (10.4% margin). The company's order book hit a record high of INR 8,820 crores as of September 2025, with management maintaining 25% revenue growth guidance for FY26 and targeting INR 9,000-10,000 crores closing order book by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1763045714879,
            "Source": "earnings"
        },
        {
            "Title": "Skipper Limited Reports No Deviation in Rights Issue Fund Utilization for Quarter Ended September 2025",
            "Summary": "Skipper Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no deviation from stated objectives in its rights issue fund utilization. India Ratings and Research Private Limited, the appointed monitoring agency, confirmed that the company has utilized funds as disclosed in the offer document. The rights issue, conducted from January 30, 2024 to February 8, 2024, raised funds through 1,02,67,021 rights equity shares at Rs. 194 per share. As of September 30, 2025, the company has received Rs. 1,986.98 million out of the total issue size of Rs. 1,991.80 million. The funds were primarily allocated for augmenting working capital requirements (Rs. 1,598.63 million utilized out of Rs. 1,600 million), general corporate purposes (Rs. 375.78 million utilized out of Rs. 380.80 million), and issue-related expenses (Rs. 9.76 million utilized out of Rs. 11 million). The monitoring agency found no unfavorable events affecting project viability and confirmed all utilization was as per the offer document disclosures.",
            "Sentiment": "positive",
            "PublishDate": 1762593742251,
            "Source": "corporate_action"
        },
        {
            "Title": "Skipper Limited Reports Quarterly Results and Board Decisions on Tax Settlement and Management Changes",
            "Summary": "Skipper Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company settled a disputed entry tax of ₹142.39 million for ₹106.79 million under West Bengal Sales Tax settlement rules, resulting in an exceptional item that reduced profit after tax by ₹79.91 million and basic EPS by ₹0.71 per share. The Board approved forfeiture of 33,198 partly paid-up equity shares where call money remains unpaid and designated Mr. Durga Singh Shekhawat as Senior Management Personnel with the role of President-Tower (Domestic). A postal ballot notice was approved to seek member approval for increasing borrowing powers and mortgage/charge creation on company assets. The company also entered into commodity hedge contracts during the quarter, with ₹65.54 million recognized in other comprehensive income under cash flow hedge reserve.",
            "Sentiment": "neutral",
            "PublishDate": 1762507745381,
            "Source": "earnings"
        },
        {
            "Title": "Skipper Reports Strong Q2 Performance with Revenue Growth to 12.6B Rupees",
            "Summary": "Skipper announced its Q2 financial results showing revenue of 12.6 billion rupees compared to 11.1 billion rupees in the same quarter last year. The company's EBITDA increased to 1.31 billion rupees from 1.1 billion rupees year-over-year, while EBITDA margin improved to 10.36% from 10.13%. Consolidated net profit rose to 370 million rupees versus 329 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1762506855631,
            "Source": "earnings"
        },
        {
            "Title": "Skipper Limited Sets Record Date for Final Dividend Payment",
            "Summary": "Skipper Limited has announced September 16, 2025 as the record date for final dividend payment for Financial Year 2024-25. The dividend payment is subject to shareholder approval at the upcoming Annual General Meeting. The company trades on NSE under symbol SKIPPER and on BSE with scrip code 538562.",
            "Sentiment": "positive",
            "PublishDate": 1757152040159,
            "Source": "corporate_action"
        },
        {
            "Title": "Skipper Limited Reports Strong Q1 FY26 Results with 15% Revenue Growth and Record Order Book",
            "Summary": "Skipper Limited delivered its best first quarter performance with net revenue of INR 2,539 million, up 15% year-on-year. The company achieved record EBITDA of INR 272 million (up 22%) and highest-ever quarterly EBITDA margins of 10.1%. Engineering segment revenue grew 24% to INR 1,248 million, while Polymer segment surged 34% to INR 272 million. Export revenue in engineering increased 30% to INR 254 million. The company secured significant order inflows of INR 1,977 million (up 158%), including three 765 kV transmission line projects from Power Grid Corporation. Current order book reached all-time high of INR 8,520 million. Stand-alone PAT increased 41% to INR 447 million with improved margins of 3.6%. The company commissioned 75,000 tons additional capacity and plans another 75,000 tons expansion by year-end, targeting 600,000 tons capacity by FY28. Management guided for 25% revenue growth in FY26 and expects order inflows of INR 6,500-7,000 crores for the year.",
            "Sentiment": "positive",
            "PublishDate": 1754463121448,
            "Source": "earnings"
        },
        {
            "Title": "Skipper Targets 25% Revenue Growth for FY'26, Expands Capacity to 600,000 MTPA by FY'28",
            "Summary": "Skipper has announced a 25% revenue growth target for FY'26, attributing the projected growth to innovation and execution capabilities. The company has made its new 75,000 MTPA capacity fully operational and has another 75,000 MTPA expansion currently in progress. Skipper aims to achieve a total capacity of 600,000 MTPA by FY'28 to address increasing domestic and export demand.",
            "Sentiment": "positive",
            "PublishDate": 1753974437608,
            "Source": "stock"
        },
        {
            "Title": "Skipper Limited Approves Rs 500 Crore Corporate Guarantees and Global Expansion Plans",
            "Summary": "Skipper Limited's Board approved corporate guarantees totaling Rs 500 crores - Rs 350 crores for wholly owned subsidiaries in USA, UAE, and Brazil, and Rs 150 crores for joint venture Skipper-Metzer India LLP. The company reported quarterly results with revenue from operations of Rs 12,538.62 million and profit of Rs 446.60 million. The Board also approved establishing three wholly owned subsidiaries in UAE, USA, and Brazil for selling towers and poles, with investments up to USD 10,000 in UAE, USD 50,000 in USA, and USD 20,000 in Brazil. Additionally, the Board reappointed Yash Pall Jain as Whole-Time Director for three years from September 6, 2025, established a new corporate office in Kolkata, and scheduled the 44th Annual General Meeting for September 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753957498041,
            "Source": "corporate_action"
        },
        {
            "Title": "Skipper Limited Reports Q1 2025 Results, Reappoints Director, and Plans Global Expansion",
            "Summary": "Skipper Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of ₹12,538.62 million compared to ₹10,917.44 million in the same quarter last year. Net profit increased to ₹446.60 million from ₹315.90 million year-over-year. The company reappointed Yash Pall Jain as Whole-Time Director for three years from September 6, 2025, to September 5, 2028. The Board established a new Corporate Office in Kolkata and approved incorporation of wholly owned subsidiaries in UAE, USA, and Brazil for selling towers and poles. The company will invest up to USD 10,000 in UAE, USD 50,000 in USA, and USD 20,000 in Brazil. The 44th Annual General Meeting is scheduled for September 23, 2025, via video conferencing, with a record date of September 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753954895417,
            "Source": "earnings"
        },
        {
            "Title": "Skipper Limited Reports Strong Q1 2025 Results, Plans Global Expansion with Three New Subsidiaries",
            "Summary": "Skipper Limited's Board approved unaudited financial results for Q1 2025, showing revenue from operations of ₹12,538.62 million compared to ₹10,917.44 million in the same quarter last year. Net profit increased to ₹446.60 million from ₹315.90 million year-over-year. The company operates through three segments: Engineering Products (₹10,247.83 million revenue), Polymer Products (₹1,271.93 million), and Infrastructure Projects (₹1,018.86 million). The Board reappointed Mr. Yash Pall Jain as Whole-Time Director for three years from September 6, 2025, to September 5, 2028. The company approved incorporation of wholly-owned subsidiaries in UAE (up to USD 10,000 investment), USA (up to USD 50,000), and Brazil (up to USD 20,000) for selling towers and poles. A new corporate office was established in Kolkata. The 44th Annual General Meeting is scheduled for September 23, 2025, via video conferencing, with record date set for September 16, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753952811595,
            "Source": "corporate_action"
        },
        {
            "Title": "Skipper Reports Strong Q1 Growth with Net Profit Rising 41% to 447 Million Rupees",
            "Summary": "Skipper delivered robust quarterly results with net profit increasing to 447 million rupees from 316 million rupees in the same period last year. Revenue grew to 12.5 billion rupees compared to 11 billion rupees year-over-year. EBITDA rose to 1.27 billion rupees from 1.04 billion rupees, while EBITDA margin improved to 10.14% from 9.59% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753952055295,
            "Source": "earnings"
        },
        {
            "Title": "Skipper Ltd: Multibagger Stock Soars 900% in Five Years",
            "Summary": "Skipper Ltd, an integrated transmission tower manufacturer, has seen its stock price surge over 900% in the last five years. Despite a 9% year-to-date decline, analysts remain bullish with all five tracking the stock maintaining a 'buy' rating. The average target price is Rs 612.33, suggesting a 24.5% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1750838460000,
            "Source": "normal_news"
        },
        {
            "Title": "Skipper Reduces Net Debt by Rs 1.1 Billion",
            "Summary": "Skipper Limited has reported a reduction in its net debt, including interest-bearing acceptances, by Rs 1.1 billion year-over-year. As of March 31, 2025, the company's net debt stands at Rs 10.2 billion.",
            "Sentiment": "positive",
            "PublishDate": 1746016816000,
            "Source": "default"
        },
        {
            "Title": "Skipper Reports Strong Q4 Financial Results",
            "Summary": "Skipper Limited has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 1.24 billion rupees from 1.09 billion rupees, with the EBITDA margin rising to 9.60% from 9.41%. Revenue grew to 12.88 billion rupees from 11.5 billion rupees. Net profit saw a substantial increase to 443.9 million rupees, up from 239 million rupees in the same quarter last year and 359 million rupees in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1746013913000,
            "Source": "result"
        },
        {
            "Title": "Skipper Reports Improved Q3 EBITDA and Margin",
            "Summary": "Skipper Limited has announced its Q3 financial results, showing significant improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 1.11 billion rupees from 771 million rupees in the same quarter last year. The EBITDA margin also saw a slight improvement, rising to 9.76% from 9.62% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738760243000,
            "Source": "earnings"
        },
        {
            "Title": "Skipper Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "Skipper Limited has announced its financial results for the third quarter, showing substantial year-over-year growth. The company's net profit increased to 359 million rupees, up from 178 million rupees in the same period last year. Revenue also saw a significant rise, reaching 11.3 billion rupees compared to 8 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738760237000,
            "Source": "earnings"
        },
        {
            "Title": "Skipper Limited to Consider Q3 Results",
            "Summary": "Skipper Limited has announced that it will consider its third quarter (Q3) financial results on February 5th. This indicates the company is preparing to release its quarterly earnings report, which will provide insight into its financial performance for the most recent three-month period.",
            "Sentiment": "neutral",
            "PublishDate": 1738161299000,
            "Source": "earnings"
        },
        {
            "Title": "Skipper Limited Approves Fund Raising of Up to 6 Billion Rupees",
            "Summary": "Skipper Limited has approved a plan to raise funds up to 6 billion rupees (approximately $72 million USD) through various modes including Qualified Institutional Placement (QIP) and Follow-on Public Offering (FPO). This decision indicates the company's intent to secure significant capital for potential expansion or operational needs.",
            "Sentiment": "positive",
            "PublishDate": 1730120930000,
            "Source": "corporate_action"
        },
        {
            "Title": "Skipper Reports Strong Q2 Financial Performance",
            "Summary": "Skipper Limited has announced its Q2 financial results, showing significant improvement in key metrics. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 1.1 billion rupees, up from 736 million rupees in the same quarter last year. Additionally, Skipper's EBITDA margin improved to 10.13%, compared to 9.54% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1730118619000,
            "Source": "result"
        },
        {
            "Title": "Skipper Reports Strong Q2 Revenue Growth",
            "Summary": "Skipper Limited has reported a significant increase in its second quarter revenue. The company's revenue for Q2 reached 11.1 billion rupees, compared to 7.7 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1730118608000,
            "Source": "result"
        },
        {
            "Title": "Skipper Reports Q2 Profit Increase",
            "Summary": "Skipper Limited has announced its Q2 consolidated net profit of 329 million rupees, showing a significant year-over-year increase from 198 million rupees. The profit also improved quarter-over-quarter from 324 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1730118597000,
            "Source": "result"
        },
        {
            "Title": "Skipper Ltd: Ambitious Revenue Target Set for FY29",
            "Summary": "<p>Skipper Ltd aims to achieve a <span class='positive'>revenue</span> of <span class='positive'>₹10,000 crore</span> by fiscal year 2029, signaling <span class='positive'><b>significant growth</b></span> plans for the company.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728458777000,
            "Source": "normal_news"
        }
    ]
}