{
    "Symbol": "SKYGOLD",
    "ISIN": "INE01IU01018",
    "News": [
        {
            "Title": "Sky Gold grants 13,230 stock options, allots 10,000 shares",
            "Summary": "Sky Gold and Diamonds Limited grants 13,230 stock options to employees, modifies vesting schedules, and allots 10,000 equity shares under ESOP 2024 scheme, increasing paid-up capital to Rs. 1,54,87,38,840.",
            "Sentiment": "positive",
            "PublishDate": 1770782903123,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sky Gold Reports Strong Q3FY26 Results",
            "Summary": "Sky Gold and Diamonds Limited delivered robust Q3FY26 performance with standalone revenue of ₹1,37,570.95 lakhs and net profit of ₹6,106.34 lakhs for quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770620629257,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sky Gold Confirms Director Designation Change",
            "Summary": "Sky Gold and Diamonds Limited confirms change in designation of Mr. Virupaksh Kolla from Additional Non-Executive Independent Director to Non-Executive Independent Director effective October 1, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765639496899,
            "Source": "co_actions_results"
        },
        {
            "Title": "SkyGold Diamonds Reports 93% Revenue Growth in Q2 FY26, Achieves Highest-Ever Quarterly Performance",
            "Summary": "SkyGold Diamonds Limited recorded revenue of INR 1,484 crores in Q2 FY26, marking 93.1% year-on-year growth, with PAT rising 82% to INR 67 crores. The company expanded operations through acquisitions, established a Dubai office for international growth, and remains on track to achieve its FY26 revenue target of INR 5,400 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763642248781,
            "Source": "earnings"
        },
        {
            "Title": "Sky Gold Shares Rise 1.26% Following Strong Q2 Results and Strategic Expansion Moves",
            "Summary": "Sky Gold reported 93.1% revenue growth to ₹1,484.5 crore and 82.6% profit jump to ₹67 crore in Q2 FY26, while launching Dubai operations and acquiring Speed Bangle Private Limited. The Mumbai-based B2B jewellery manufacturer aims to increase exports to 15-20% of revenue and build a ₹7,600 crore enterprise by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1763098073254,
            "Source": "earnings"
        },
        {
            "Title": "SkyGold and Diamonds Reports Q2FY26 Results, Expands Operations to Dubai and Southeast Asia",
            "Summary": "SkyGold and Diamonds Limited announced its Q2FY26 results for the quarter ended September 30, 2025, highlighting continued growth momentum backed by rising exports and capacity enhancement plans. The B2B gold jewellery manufacturer opened a Dubai office for Middle East expansion, launched a strategic collaboration with SENCO Gold for 9KT jewellery, and acquired Speed Bangle Private Limited to enter the lightweight Italian bangles segment.",
            "Sentiment": "positive",
            "PublishDate": 1763064093695,
            "Source": "earnings"
        },
        {
            "Title": "Sky Gold Plans Multi-Year Expansion Into Lightweight Jewelry and High-End Retail",
            "Summary": "Sky Gold is targeting expansion through entry into lightweight gold jewelry and high-end retail chains while commissioning a new Mumbai facility to boost manufacturing capacity. The company is diversifying exports to Middle East and U.S. markets and focusing on design-led collections and digital channels to strengthen profit margins.",
            "Sentiment": "positive",
            "PublishDate": 1763052190797,
            "Source": "stock"
        },
        {
            "Title": "SkyGold and Diamonds Limited Grants 12,690 Stock Options to Employees",
            "Summary": "SkyGold and Diamonds Limited's Nomination and Remuneration Committee approved the grant of 12,690 stock options to eligible employees under the SKYGOLD-ESOP 2024 plan. Each stock option is convertible into one equity share with a face value of Rs. 10. The options will vest after a minimum period of one year from the grant date, with a maximum vesting period of 5 years. The exercise price is Re. 1 per option. The company trades on BSE with scrip code 541967 and on NSE with symbol SKYGOLD.",
            "Sentiment": "positive",
            "PublishDate": 1763014861745,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold's Subsidiary Starmangalsutra to Acquire 51% Stake in Jewellery Manufacturer Shri Rishab Gold",
            "Summary": "Starmangalsutra Private Limited, a wholly owned subsidiary of Sky Gold & Diamonds Limited, has approved a proposal to acquire 51% partnership interest in Shri Rishab Gold, a partnership firm engaged in jewellery manufacturing. The acquisition is valued at approximately Rs. 10 crores and is expected to be completed within 12 months. Shri Rishab Gold reported a turnover of Rs. 48.9 crores and EBITDA of Rs. 3.87 crores for the year ending March 31, 2025. The firm specializes in the mangalsutra jewellery segment and has a client base that includes one of India's largest jewellery brands. The acquisition aims to expand customer portfolio and deepen market penetration in the traditional mangalsutra jewellery segment. The transaction will be funded through cash consideration and is subject to customary closing conditions and requisite approvals.",
            "Sentiment": "positive",
            "PublishDate": 1760772304339,
            "Source": "order&deals"
        },
        {
            "Title": "Sky Gold Reports Strong Demand During Navratri And Diwali Seasons",
            "Summary": "Sky Gold reported strong demand during the Navratri and Diwali festival seasons. The company experienced increased customer interest during these traditional Indian festivals, which are typically associated with gold purchases.",
            "Sentiment": "positive",
            "PublishDate": 1759738553924,
            "Source": "stock"
        },
        {
            "Title": "SkyGold Ltd Appoints Siddharth Sipani as CFO as Mangesh Chauhan Steps Down to Focus on MD Role",
            "Summary": "SkyGold Ltd's Board of Directors approved the appointment of Mr. Siddharth Sipani as Chief Financial Officer effective September 27, 2025. The appointment was based on recommendations from the Nomination and Remuneration Committee and Audit Committee. Simultaneously, Mr. Mangesh Ramesh Chauhan resigned from his CFO position to focus on his strategic and operational responsibilities as Managing Director. Sipani is a Chartered Accountant and Company Secretary with over 20 years of experience in finance, accounts, compliance, treasury, and strategic business management. He previously served as Group CFO with Gold Star Jewellery and has led initiatives in financial planning, liquidity management, automation, fund-raising and cost optimization. Chauhan cited the need to better align his focus with growing operational scale and evolving business requirements as the reason for stepping down from the CFO role while continuing as Managing Director.",
            "Sentiment": "neutral",
            "PublishDate": 1758968275187,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sky Gold And Diamonds Partners With Senco Gold To Launch 9KT Gold Jewelry Line",
            "Summary": "Sky Gold And Diamonds has partnered with Senco Gold And Diamonds to introduce 9KT gold jewelry products. The collaboration targets young buyers and first-time customers by focusing on affordable fashion jewelry options.",
            "Sentiment": "positive",
            "PublishDate": 1758254437193,
            "Source": "order&deals"
        },
        {
            "Title": "Sky Gold & Diamonds Reports 56% Revenue Growth in Q1 FY26, Targets INR 5,400 Crores for Full Year",
            "Summary": "Sky Gold & Diamonds Limited reported consolidated revenue of INR 1,131 crores for Q1 FY26, marking a 56% year-on-year growth from INR 723 crores in Q1 FY25. The company achieved monthly production volume of 456 kg, up 30% from 349 kg in the previous year. EBITDA grew 91% to INR 71 crores with margins improving to 6.3% from 5.2%. PAT increased to INR 43 crores from INR 21 crores, with margins rising to 3.9% from 2.9%. The company onboarded new clients including Reliance Retail, PMJ Jewellery, and Kalamandir, while expanding wallet share with existing clients like Aditya Birla and CaratLane. Advanced gold business increased from 4% to 5% quarter-on-quarter, and 18-carat volumes rose from 4% to 7%. Export sales reached INR 131 crores, representing 12% of total revenue. The company secured gold metal loan limits of INR 190 crores from three banks and plans to acquire a subsidiary in Dubai for Middle East expansion. Management guided for revenue targets of INR 5,400 crores in FY26 and INR 7,600 crores in FY27, with volume guidance of 650-700 kg per month by FY26 exit.",
            "Sentiment": "positive",
            "PublishDate": 1753874502437,
            "Source": "earnings"
        },
        {
            "Title": "Sky Gold Limited Allots 60.95 Lakh Equity Shares at Rs 369 Each for Ganna N Gold Acquisition",
            "Summary": "Sky Gold Limited has allotted 60,95,074 equity shares at Rs 369 per share on a preferential basis to acquire 100% shareholding in Ganna N Gold Private Limited. The shares were issued for consideration other than cash, with the total consideration valued at Rs 224.91 crores. The allotment was approved by the Board of Directors and received prior shareholder approval through postal ballot. Post-allotment, the company's paid-up equity share capital increased from Rs 148.77 crores to Rs 154.86 crores. The shares were allotted equally to two non-promoter individuals - Mr. Jinesh Navratanmal Ganna and Mr. Vikas Navratanmal Ganna, each receiving 30,47,537 shares. The company has received in-principle approvals from BSE and NSE for the preferential issue and will apply for listing and trading approval for the newly allotted shares.",
            "Sentiment": "neutral",
            "PublishDate": 1753858374923,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold Sets Ambitious Growth Targets with Revenue Goals of Rs. 7,600 Crore by FY27",
            "Summary": "Sky Gold has outlined aggressive growth plans targeting revenue of Rs. 5,400 crore in FY26 and Rs. 7,600 crore in FY27. The company expects PAT margins to reach 4.25-4.5% by FY27 with steady quarterly growth. Production volumes are planned to increase from the current 456 kg monthly to 580 kg in Q2 and 650 kg by Q4. The company aims to grow export revenue contribution to 17-20% in FY26 and 25% in FY27. These targets were shared during the company's earnings call.",
            "Sentiment": "positive",
            "PublishDate": 1753673363765,
            "Source": "stock"
        },
        {
            "Title": "Sky Gold & Diamonds Limited Makes Earnings Call Audio Recording Available Online",
            "Summary": "Sky Gold & Diamonds Limited has made the audio recording of their earnings conference call available on their company website. The call, held on July 25, 2025, discussed the company's unaudited standalone and consolidated financial results and operations for the quarter ended June 30, 2025. The company will subsequently provide the transcript of the conference call to stock exchanges and publish it on their website. The communication was signed by Mangesh Chauhan, Managing Director & CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1753435921192,
            "Source": "earnings"
        },
        {
            "Title": "Sky Gold Sets Rs 7,600 Crore Revenue Target by FY27, Reports Strong Q1 Growth",
            "Summary": "Sky Gold and Diamonds Ltd. has set a revenue target of Rs 7,600 crore by FY27, aiming to double its current revenue. The B2B jewellery manufacturer reported strong quarterly results with net profit more than doubling to Rs 43 crore from Rs 21 crore in the same quarter last year, while consolidated revenue surged 56.5% to Rs 1,131 crore from Rs 723 crore. Managing Director Mangesh Chauhan attributed the growth to new product launches including 18-carat, white gold and studded jewellery, along with expansion of advanced gold business and onboarding new clients. The company expects advanced gold business to contribute 7.5% this year and 10% next year, supporting margin improvements. Sky Gold has diversified its client base to include mid-sized firms and smaller retailers with 3-5 stores. The company anticipates benefiting from clients opening 2,500 new stores across India and the ongoing shift from unorganised to organised market, which currently represents only 35% of the Rs 9-10 lakh crore total market. Shares closed 5% lower at Rs 307.8.",
            "Sentiment": "positive",
            "PublishDate": 1753408725443,
            "Source": "stock"
        },
        {
            "Title": "Sky Gold And Diamonds Targets 76 Billion Rupees Revenue by FY27",
            "Summary": "Sky Gold And Diamonds has set a revenue target of 76 billion rupees by FY27. The company expects its monthly volume to double by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1753274258068,
            "Source": "stock"
        },
        {
            "Title": "Sky Gold and Diamonds Reports Strong Q1 FY26 Results with 56.5% Revenue Growth",
            "Summary": "Sky Gold and Diamonds Limited reported robust quarterly results with revenue from operations rising 56.5% to ₹1,131 crores compared to ₹723 crores in the previous year. Profit after tax surged 105.3% to ₹43.6 crores from ₹21.2 crores, while EBITDA increased 91.5% to ₹71.4 crores. The company achieved a PAT margin of 3.9% and EBITDA margin of 6.3%. Export contribution reached 12% of revenue, up from 8% in FY25. The B2B gold jewellery manufacturer added new clients including Aditya Birla's Indriya, Reliance Retail, CaratLane, PN Gadgil, and others. The company is expanding internationally with plans for a Dubai office and targets exports to contribute 25% of revenue over the next 18-24 months. Sky Gold aims to achieve consolidated revenue of ₹7,600 crores by FY27 and is developing a 540,000 sq. ft. integrated jewellery park. The company added 18KT lightweight jewellery to its product portfolio and is focusing on advanced gold model customers to optimize working capital.",
            "Sentiment": "positive",
            "PublishDate": 1753274151818,
            "Source": "earnings"
        },
        {
            "Title": "Sky Gold and Diamonds Reports Strong Q1 Growth with 54% Jump in Net Profit",
            "Summary": "Sky Gold and Diamonds delivered robust quarterly performance with net profit rising to 326 million rupees from 212 million rupees year-over-year. Revenue increased to 8.1 billion rupees compared to 7.23 billion rupees in the same period last year. The company's EBITDA grew significantly to 536 million rupees from 372 million rupees, while EBITDA margin improved to 6.61% from 5.15% year-over-year, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1753255035130,
            "Source": "earnings"
        },
        {
            "Title": "Sky Gold & Diamonds Converts Warrants and Issues Bonus Shares",
            "Summary": "Sky Gold & Diamonds has converted 2.07 lakh warrants into equity shares. Additionally, the company has issued bonus shares. No further details about the conversion rate, timing, or the bonus share ratio were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750943391000,
            "Source": "default"
        },
        {
            "Title": "Sky Gold And Diamonds: Ambitious Export Growth and Business Expansion Plans",
            "Summary": "Sky Gold and Diamonds Ltd. aims to increase export revenue contribution to 25% in two years, plans to open a Dubai subsidiary, expands into advanced gold business and new product lines. Three promoters recently sold a 4.97% stake to institutional investors.",
            "Sentiment": "positive",
            "PublishDate": 1750907873000,
            "Source": "normal_news"
        },
        {
            "Title": "SKY Gold and Diamonds Approves Business Acquisition in Dubai",
            "Summary": "SKY Gold and Diamonds has announced approval for purchasing a business in Dubai. The company has proposed a capital investment of up to 1.2 million rupees for this acquisition.",
            "Sentiment": "positive",
            "PublishDate": 1750765080000,
            "Source": "default"
        },
        {
            "Title": "Sky Gold: Promoters Sell 5% Stake via Block Deals",
            "Summary": "Promoter entities of Sky Gold and Diamonds Ltd. sold over 5% stake through block deals. Bank of India Mutual Fund acquired 7.8 lakh shares. The stock is under Stage 3 ASM, requiring 100% upfront margin and has a 5% circuit filter. Shares ended 5% lower at ₹344, marking a 30% correction from recent highs.",
            "Sentiment": "negative",
            "PublishDate": 1750299092000,
            "Source": "block_deals"
        },
        {
            "Title": "Sky Gold and Diamonds Aims to Increase Profit Margins and Complete Acquisition",
            "Summary": "Sky Gold and Diamonds plans to increase its Profit After Tax (PAT) margins from 3.7% to 5%. The company cites advanced gold, gold metal loans, and its high-margin diamond business as key drivers for this expansion, along with operating leverages from scale. Additionally, the company is in the process of an acquisition, which will be completed after the June quarter. The acquisition is expected to improve gross margins and EBITDA, and its impact will be added to the company's guidance once completed.",
            "Sentiment": "positive",
            "PublishDate": 1748575964000,
            "Source": "default"
        },
        {
            "Title": "Sky Gold and Diamonds Outlines Growth Projections in Concall",
            "Summary": "Sky Gold and Diamonds shared future projections during a concall. The company expects exports to represent 20% of its volume by FY27. They provided guidance of Rs. 5,400 Cr and Rs. 7,600 Cr based on a conservative gold rate of Rs. 90,000 per 10 grams. Advanced Gold is anticipated to contribute 10% of total revenues by FY27 and 30% by FY29-30. Diamond revenue contribution is expected to increase from 1% to 4% by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1748575840000,
            "Source": "default"
        },
        {
            "Title": "Sky Gold and Diamonds Reports Q4 Financial Results",
            "Summary": "Sky Gold and Diamonds has released its Q4 financial results. The company's EBITDA increased to 452 million rupees from 253 million rupees year-over-year. The EBITDA margin improved to 5.99% from 4.93%. Revenue grew to 7.55 billion rupees from 5.1 billion rupees. Net profit rose to 264 million rupees from 136 million rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748338886000,
            "Source": "result"
        },
        {
            "Title": "Sky Gold & Diamonds Acquires Ganna N Gold to Enter Gold Bangles Segment",
            "Summary": "Sky Gold & Diamonds has acquired a 100% stake in Ganna N Gold through a share swap valued at Rs. 225 crore. This strategic acquisition allows the company to enter the gold bangles segment, expanding its product range and potentially increasing profitability. The move is expected to fulfill 75% of the company's retail store gold jewellery needs.",
            "Sentiment": "positive",
            "PublishDate": 1745073456000,
            "Source": "default"
        },
        {
            "Title": "Sky Gold and Diamonds Schedules Board Meeting to Discuss Fundraising",
            "Summary": "Sky Gold and Diamonds has announced a board meeting on April 18 to consider a fundraising proposal. This meeting suggests the company may be looking to raise capital for future operations or expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1744727453000,
            "Source": "default"
        },
        {
            "Title": "Sky Gold and Diamonds Secures Major Export Order",
            "Summary": "Sky Gold and Diamonds has obtained a significant recurring export order of 200 kg per month from a renowned jewellery industry player. This order represents a substantial business opportunity for the company and indicates strong demand for their products in the international market.",
            "Sentiment": "positive",
            "PublishDate": 1744350461000,
            "Source": "order&deals"
        },
        {
            "Title": "Sky Gold and Diamonds to Open B2B Office in Dubai",
            "Summary": "Sky Gold and Diamonds has announced plans to establish a Business-to-Business (B2B) office in Dubai. This strategic move is aimed at increasing the company's export revenue. By opening an office in Dubai, a major global hub for the diamond and jewelry trade, Sky Gold and Diamonds is positioning itself to expand its international presence and tap into new markets.",
            "Sentiment": "positive",
            "PublishDate": 1743593324000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold Ltd: Name Change to Sky Gold and Diamonds Ltd Effective April 3",
            "Summary": "Sky Gold Ltd will officially change its name to Sky Gold and Diamonds Ltd on April 3, following board approval and regulatory clearances. The company, specializing in lightweight gold jewelry, reported strong Q3 sales driven by wedding season demand.",
            "Sentiment": "positive",
            "PublishDate": 1743090739000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold: Adapting Strategy Amid Rising Gold Prices",
            "Summary": "Sky Gold CFO Mangesh Chauhan outlines growth plans amid rising gold prices. The company is adjusting inventory and designs to meet changing consumer demands, with a 10% reduction in average ticket size. Q3 saw a 25% quarter-on-quarter increase in sales volume, reaching 475 kg per month.",
            "Sentiment": "positive",
            "PublishDate": 1740197297000,
            "Source": "normal_news"
        },
        {
            "Title": "Sky Gold Reports Significant EBITDA Growth in Q3",
            "Summary": "Sky Gold has announced its Q3 financial results, showing substantial year-over-year improvement. The company's EBITDA increased from 180 million rupees to 573 million rupees. Additionally, Sky Gold's EBITDA margin expanded from 3.92% to 5.74% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1738569545000,
            "Source": "earnings"
        },
        {
            "Title": "Sky Gold Expands Market Presence with Aditya Birla Jewellery Partnership and Portfolio Diversification",
            "Summary": "Sky Gold has strengthened its market position by onboarding Aditya Birla Jewellery as a partner and diversifying its product portfolio. This strategic move is expected to enhance the company's reach and offerings in the jewelry market.",
            "Sentiment": "positive",
            "PublishDate": 1736922706000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold Ltd: Record Date Set for 9:1 Bonus Share Issue",
            "Summary": "Sky Gold Ltd has fixed December 16, 2024, as the record date for its 9:1 bonus share issue. The stock will trade ex-bonus today. Shareholders must own shares before the ex-date to be eligible for the bonus issue. The company's stock has shown significant gains, rising 3862.21% in the past year and 3381.40% in the last 6 months.",
            "Sentiment": "positive",
            "PublishDate": 1734319165000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold to Enter Lab-Grown Diamonds Segment",
            "Summary": "Sky Gold Limited has announced plans to enter the lab-grown diamonds segment within the next two quarters. This strategic move represents a significant expansion of the company's product portfolio and could potentially open up new market opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1734158528000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold Ltd: Plans Entry into Lab-Grown Diamond Segment",
            "Summary": "Sky Gold Ltd. intends to enter the lab-grown diamond market within the next two quarters. The company is currently analyzing market response and plans to create product samples. Sky Gold aims to increase export contributions to 15-20% of revenue, focusing on expansion in Middle Eastern countries.",
            "Sentiment": "positive",
            "PublishDate": 1734151618000,
            "Source": "normal_news"
        },
        {
            "Title": "Sky Gold Ltd: Record Date Set for 9:1 Bonus Share Issue",
            "Summary": "Sky Gold Ltd has fixed December 16 as the record date for its 9:1 bonus share issue. Eligible shareholders will receive nine free shares for every one share held. The stock is currently under Stage 4 of the Additional Surveillance Measures (ASM) framework.",
            "Sentiment": "positive",
            "PublishDate": 1733195170000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold Approves 9:1 Bonus Share Issue",
            "Summary": "Sky Gold Limited has approved the issuance of bonus shares in a ratio of 9:1. This means shareholders will receive 9 additional shares for every 1 share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1732635229000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold: Ebitda Margin Expected to Exceed 5% in Coming Quarters",
            "Summary": "Sky Gold's MD Mangesh Chauhan anticipates Ebitda margin to reach 5.75% in the next 3-4 quarters. The company plans to increase margins through rose gold and white gold jewelry introduction, studded jewelry expansion, and onboarding of new clients Caratlane and PN Gadgil Jewellers. Q2 results showed significant YoY improvements with Ebitda up 154% and net profit up 405%.",
            "Sentiment": "positive",
            "PublishDate": 1732160337000,
            "Source": "normal_news"
        },
        {
            "Title": "Sky Gold Aims for Rs 6,300 Crore Revenue by FY27",
            "Summary": "Sky Gold's Managing Director has announced the company's target to achieve Rs 6,300 crore in revenue by fiscal year 2027. The company anticipates 25-30% retail growth, driven by strong sales during the festive and wedding season in the December quarter.",
            "Sentiment": "positive",
            "PublishDate": 1731752806000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold Reports Strong Q2 EBITDA Growth",
            "Summary": "Sky Gold has announced its Q2 financial results, showing significant year-over-year improvement. The company's EBITDA increased from 153 million rupees to 371 million rupees. Additionally, the EBITDA margin expanded from 3.85% to 5.16% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731509082000,
            "Source": "result"
        },
        {
            "Title": "Sky Gold Reports Significant Profit and Revenue Growth in Q2",
            "Summary": "Sky Gold has announced its Q2 financial results, showing substantial year-over-year and quarter-over-quarter growth. The company's net profit increased to 359 million rupees, up from 73 million rupees in the same quarter last year and 212 million rupees in the previous quarter. Revenue also saw a significant rise to 7.2 billion rupees, compared to 4 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731509023000,
            "Source": "result"
        },
        {
            "Title": "Sky Gold Secures Major Clients and Raises Funds Through QIP",
            "Summary": "Sky Gold has onboarded two significant clients, CaratLane and P. N. Gadgil Jewellers, expanding its customer base in the jewelry industry. Additionally, the company has successfully raised Rs. 270 crores through a Qualified Institutional Placement (QIP), indicating strong investor interest and potential for growth.",
            "Sentiment": "positive",
            "PublishDate": 1730189252000,
            "Source": "corporate_action"
        },
        {
            "Title": "SkyGold Approves 9:1 Bonus Share Issue",
            "Summary": "SkyGold has approved the issuance of bonus shares in the ratio of 9:1, meaning shareholders will receive 9 additional shares for every 1 share they currently hold.",
            "Sentiment": "positive",
            "PublishDate": 1729937610000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold to Consider Bonus Share Issuance",
            "Summary": "Sky Gold Limited has scheduled a board meeting for October 26 to consider the issuance of bonus equity shares to its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1729690775000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold Approves Investment in Two Private Companies",
            "Summary": "Sky Gold has approved investments of up to 700 million rupees in shares of two private companies: Starmangalsutra Pvt Ltd and Sparkling Chains Pvt Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1729604639000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sky Gold: Diamond & 18-Carat Segment May Boost Margins",
            "Summary": "<p>Sky Gold is focusing on expanding its <span class='positive'>diamond</span> and <span class='positive'>18-carat gold</span> segment, which could potentially lead to <span class='positive'>higher profit margins</span> for the company.</p>",
            "Sentiment": "positive",
            "PublishDate": 1727265275000,
            "Source": "normal_news"
        }
    ]
}