{
    "Symbol": "SMARTLINK",
    "ISIN": "INE178C01020",
    "News": [
        {
            "Title": "Smartlink Holdings Q3 FY26 Results Show Mixed Performance",
            "Summary": "Smartlink Holdings reported Q3 FY26 results with consolidated profit of ₹223.92 lakhs vs standalone loss of ₹81.81 lakhs. Nine-month consolidated profit reached ₹627.76 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1770364163707,
            "Source": "co_actions_results"
        },
        {
            "Title": "Smartlink Holdings Promoter Acquires 2.03% Stake",
            "Summary": "Dr. Lakshana Amit Sharma acquired 2,02,892 equity shares (2.03%) in Smartlink Holdings through gift transfer from mother, increasing total holding to 10.00% on December 22, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766580011925,
            "Source": "stocks"
        },
        {
            "Title": "Smartlink Holdings Promoter Withdraws Share Acquisition",
            "Summary": "Arati Naik, promoter of Smartlink Holdings Limited, has withdrawn her intention to acquire equity shares under SEBI SAST regulations, following an earlier intimation dated December 9, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766398803733,
            "Source": "stocks"
        },
        {
            "Title": "Smartlink Holdings Promoters Execute Inter-Family Share Transfers via Gift",
            "Summary": "Lakshana Amit Sharma will acquire 2,02,892 equity shares (2.03% voting rights) from mother Sudha Kamalaksha Naik, while Arati Naik will acquire 62,667 equity shares (0.63% voting rights) from father Kamalaksha Rama Naik through gift transactions between December 15-30, 2025. The off-market inter-se transfers between immediate relatives within Smartlink Holdings' promoter group are exempt from open offer requirements under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765280035267,
            "Source": "corporate_action"
        },
        {
            "Title": "Smartlink Holdings Reports Mixed Quarterly Performance with Standalone Loss and Consolidated Profit",
            "Summary": "Smartlink Holdings Limited announced its financial results for the quarter ended September 30, 2025. On a standalone basis, the company reported a loss of Rs 38.60 lakhs compared to a profit of Rs 14.94 lakhs in the previous quarter. However, on a consolidated basis, the company showed a profit of Rs 186.33 lakhs for the quarter versus Rs 217.51 lakhs in the previous quarter. For the half-year period, standalone results showed a loss of Rs 26.66 lakhs while consolidated results reported a profit of Rs 403.84 lakhs. The company operates primarily in the Networking/IT Products segment and includes its wholly-owned subsidiary Digisol Systems Limited in consolidated results. The Board meeting was held on November 6, 2025, and the results were reviewed by the Audit Committee with statutory auditors expressing an unmodified opinion.",
            "Sentiment": "neutral",
            "PublishDate": 1762486422501,
            "Source": "earnings"
        },
        {
            "Title": "Smartlink Holdings Receives RBI Confirmation for NBFC Registration Cancellation",
            "Summary": "Smartlink Holdings Limited received confirmation from the Reserve Bank of India regarding the cancellation of its Certificate of Registration as a Non-Banking Financial Company. The cancellation follows the company's voluntary surrender of its NBFC registration, which was originally issued on May 02, 2018, for operating as a Non-Deposit taking Non-banking Financial Company. The company surrendered the registration because it was not meeting the Principal Business Criteria required by RBI, as its financial income was less than 50 percent of total income. The RBI confirmed the cancellation under Section 45-IA of the Reserve Bank of India Act, 1934, through a letter dated August 12, 2025. The company had initially informed about the surrender in February 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755078455666,
            "Source": "corporate_action"
        },
        {
            "Title": "Smartlink Holdings Reports Quarterly Profit of Rs 11.94 Lakhs in Standalone Results",
            "Summary": "Smartlink Holdings Limited reported standalone profit of Rs 11.94 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 71.48 lakhs in the same quarter last year. Revenue from operations increased to Rs 1,877.52 lakhs from Rs 1,115.65 lakhs year-over-year. On a consolidated basis, the company posted profit of Rs 217.51 lakhs versus a loss of Rs 44.42 lakhs in the corresponding quarter. Consolidated revenue from operations declined to Rs 3,702.33 lakhs from Rs 4,007.53 lakhs year-over-year. The company operates in the Networking/IT Products segment and has one wholly-owned subsidiary, Digisol Systems Limited. Earnings per share improved to Rs 0.12 on standalone basis and Rs 2.18 on consolidated basis.",
            "Sentiment": "positive",
            "PublishDate": 1755002418878,
            "Source": "earnings"
        }
    ]
}