{
    "Symbol": "SMARTWORKS",
    "ISIN": "INE0NAZ01010",
    "News": [
        {
            "Title": "Smartworks Schedules Analyst Meet for Feb 12, 2026",
            "Summary": "Smartworks Coworking Spaces Limited announces analyst and institutional investor meeting scheduled for February 12, 2026, under SEBI Regulation 30 compliance requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1770895993799,
            "Source": "stocks"
        },
        {
            "Title": "Smartworks Expands Mumbai Footprint with 182,300 Sq Ft",
            "Summary": "Smartworks Coworking Spaces Limited adds 182,300 sq ft managed office space at The Square in Andheri East, crossing 2 million sq ft portfolio milestone in Mumbai with strategic location near airport.",
            "Sentiment": "positive",
            "PublishDate": 1770800797774,
            "Source": "stocks"
        },
        {
            "Title": "Smartworks Makes Q3FY26 Analyst Meet Recording Available",
            "Summary": "Smartworks Coworking Spaces has made the audio recording of its analyst meet held on January 16, 2026, available on its website to discuss Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768561276127,
            "Source": "co_actions_results"
        },
        {
            "Title": "Smartworks Posts Record Q3 Performance",
            "Summary": "Smartworks Coworking Spaces delivered its strongest quarterly results with normalised EBITDA of ₹85 crore and 18% margins in Q3 FY26, while revenue grew 34% YoY to ₹472 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768556216285,
            "Source": "co_actions_results"
        },
        {
            "Title": "Smartworks Reports Q3 FY26 IPO Fund Utilization",
            "Summary": "CARE Ratings confirms Smartworks utilized ₹34.46 crores in Q3 FY26, with ₹172.70 crores remaining from its ₹445 crore IPO. Company completed debt repayment and continues expansion investments.",
            "Sentiment": "neutral",
            "PublishDate": 1768550280962,
            "Source": "stocks"
        },
        {
            "Title": "Smartworks Q3FY26: Revenue up 34% YoY to ₹472 cr",
            "Summary": "Smartworks Coworking Spaces reported strong Q3FY26 results with revenue growing 34% YoY to ₹4,721 mn. Normalized EBITDA surged 86% YoY to ₹847 mn with margins expanding 150 bps QoQ to 17.9%. Company achieved first-time Ind-AS PAT positive.",
            "Sentiment": "positive",
            "PublishDate": 1768529821569,
            "Source": "co_actions_results"
        },
        {
            "Title": "Smartworks Reports Record Q3 EBITDA Growth",
            "Summary": "Smartworks Coworking Spaces achieves EBITDA of ₹306 million with 64.75% margin in Q3, up from ₹218 million and 62.02% margin in previous year, showing strong profitability improvement.",
            "Sentiment": "positive",
            "PublishDate": 1768487676654,
            "Source": "co_actions_results"
        },
        {
            "Title": "Smartworks Q3 Profit ₹12cr vs ₹160cr Loss, Revenue Up 34%",
            "Summary": "Smartworks Coworking Spaces reported consolidated net profit of ₹12.40 crores in Q3 vs loss of ₹160.25 crores YoY. Revenue grew 34.20% to ₹4,721.28 crores with EBITDA margin improving to 64.75%.",
            "Sentiment": "positive",
            "PublishDate": 1768487288697,
            "Source": "co_actions_results"
        },
        {
            "Title": "Smartworks Posts Q3 FY26 Profit After 9 Quarters",
            "Summary": "Smartworks Coworking Spaces reported a standalone profit of ₹2.93 crores in Q3 FY26, marking a turnaround from losses in previous quarters, with revenue growing 35.47% YoY to ₹4,609.85 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768483617561,
            "Source": "co_actions_results"
        },
        {
            "Title": "Smartworks Schedules Q3FY26 Earnings Call on Jan 16",
            "Summary": "Smartworks Coworking Spaces Limited announces conference call with investors and analysts on January 16, 2026 at 12:00 PM IST to discuss Q3FY26 performance and business updates under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1768226014443,
            "Source": "stocks"
        },
        {
            "Title": "Kotak Initiates Buy On Smartworks, Sets ₹600 Target",
            "Summary": "Kotak Institutional Equities initiates coverage on Smartworks with Buy rating and ₹600 target price, citing scale expansion and flexible workspace growth potential in India's commercial real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1767325053610,
            "Source": "stocks"
        },
        {
            "Title": "Smartworks Allots 7,650 Shares Under ESOP 2022",
            "Summary": "Smartworks Coworking Spaces allotted 7,650 equity shares under Employee Stock Option Plan 2022, increasing paid-up capital to ₹114.26 crores with 11,42,62,076 total shares.",
            "Sentiment": "neutral",
            "PublishDate": 1766497623107,
            "Source": "co_actions_results"
        },
        {
            "Title": "India's Flex Space Market to Hit $9-10 Billion by 2028",
            "Summary": "Smartworks reports India's flexible workspace market expected to reach $9-10 billion by 2028, driven by GCC expansion. Flex spaces anticipated to capture nearly 50% of office demand by 2030.",
            "Sentiment": "positive",
            "PublishDate": 1766060154701,
            "Source": "stocks"
        },
        {
            "Title": "Smartworks Coworking Spaces Announces Senior Management Changes with CTO Transition",
            "Summary": "Smartworks Coworking Spaces announced the resignation of Gokul Nolambur Rajasekaras as Senior Management Personnel and Group Chief Technology Officer effective December 17, 2025, while appointing Siddharth Banerjee as his replacement effective December 9, 2025. The leadership transition involves key technology roles across the company and its wholly owned subsidiary Smartworks Tech Solutions Private Limited, with the new CTO bringing 19+ years of experience in AI, PropTech, and scalable technology platforms.",
            "Sentiment": "neutral",
            "PublishDate": 1765273793463,
            "Source": "corporate_governance"
        },
        {
            "Title": "Smartworks Signs Largest Flex-Office Deal in Kolkata, Leases 1.68 Lakh Sq. Ft. to IT Major",
            "Summary": "Smartworks Coworking Spaces Limited leased 1.68 lakh sq. ft. across two campuses in Kolkata's Salt Lake City to a leading global IT services provider, marking the largest flex-office deal in the region. The transaction strengthens Smartworks' position as India's largest managed office platform with 14 million sq. ft. portfolio across 14 cities, demonstrating growing enterprise adoption of managed campus models.",
            "Sentiment": "positive",
            "PublishDate": 1764841312498,
            "Source": "stock"
        },
        {
            "Title": "Smartworks Coworking Spaces Gets Credit Rating Reaffirmation from CARE Ratings",
            "Summary": "CARE Ratings Limited reaffirmed Smartworks Coworking Spaces Limited's credit ratings at CARE A- (Stable) for long-term bank facilities and CARE A1 for short-term bank facilities, following an earlier upgrade on November 6, 2025. The reaffirmation reflects the company's continued improvement in operations, successful IPO listing on BSE and NSE from July 17, 2025, and strengthened financial profile with enhanced capital structure and debt coverage indicators.",
            "Sentiment": "positive",
            "PublishDate": 1763812048268,
            "Source": "stock"
        },
        {
            "Title": "Smartworks Coworking Spaces Projects Faster Growth in Second Half of FY26",
            "Summary": "Smartworks Coworking Spaces has projected accelerated growth during the second half of FY26. The company expects improved business performance in the latter part of the fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1763392607175,
            "Source": "stock"
        },
        {
            "Title": "Smartworks COO Prashant Hakim Resigns for Personal Reasons",
            "Summary": "Prashant Hakim has stepped down from his position as Chief Operating Officer at Smartworks Coworking Spaces for personal reasons. His resignation is effective November 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763021294642,
            "Source": "corporate_governance"
        },
        {
            "Title": "Smartworks Reports 21% Revenue Growth to Rs 425 Crores in Q2 FY26",
            "Summary": "Smartworks Coworking Spaces Limited delivered strong quarterly results with revenue reaching Rs 425 crores, marking 21% year-on-year growth and 12% sequential growth. The company's normalized EBITDA rose 46% year-on-year to Rs 70 crores with a 16.4% margin. The managed office platform operates 12.7 million square feet across 14 cities serving 760+ clients, with mature portfolio occupancy at 88%. Global Capability Centers (GCCs) now contribute over 15% of rental revenue. The company signed a major 815,000 square foot deal with Hiranandani group in Mumbai at Rs 120 per square foot rental. Smartworks maintains net-debt-negative position at Rs 9 crores and achieved 14.3% annualized ROCE. The company launched SmartVantage, a dedicated GCC enablement platform, and reported that 35% of rental revenue comes from clients occupying 1,000+ seats. Care Edge Rating upgraded the company's rating from BBB to A Stable. Management expects GCC revenue to double in the next couple of years and projects continued margin expansion driven by operational leverage.",
            "Sentiment": "positive",
            "PublishDate": 1762959752398,
            "Source": "earnings"
        },
        {
            "Title": "Smartworks Coworking Spaces Gets Credit Rating Upgrade from CARE Ratings",
            "Summary": "Smartworks Coworking Spaces Limited received upgraded credit ratings from CARE Ratings Limited. The long-term bank facilities rating was upgraded to CARE A- (Stable) from CARE BBB+ (Positive), while short-term bank facilities were upgraded to CARE A1 from CARE A2. The upgrade reflects continued improvement in scale of operations through expanding space under management and healthy occupancy levels. CARE Ratings noted the company's listing on BSE and NSE from July 17, 2025, following a successful IPO, which improved the financial risk profile and capital structure. The company operates over 10.1 million operational square feet across 56 centers in 15 cities with over 730 customers. Key strengths include strong presence in flexible workspace sector, diverse tenant profile, and stable operating cash flows. However, ratings remain constrained by continuous accounting losses, leveraged capital structure, and significant expansion plans that pose market risks.",
            "Sentiment": "positive",
            "PublishDate": 1762473170027,
            "Source": "stock"
        },
        {
            "Title": "Smartworks Reports 21% Revenue Growth, Achieves Negative Net Debt Position",
            "Summary": "Smartworks Coworking Spaces Limited reported revenue of ₹4,248 million for Q2 FY26, representing 21% year-on-year growth and 12% sequential growth. The company's normalised EBITDA increased 46% year-on-year to ₹696 million with a 16.4% margin. Net debt turned negative at ₹590 million, while operating cash flow reached ₹614 million. The company has reduced gross debt by nearly 45% since its IPO. Smartworks signed a landmark 815,000 sq.ft. campus at Eastbridge, Mumbai, which becomes the world's largest managed office campus operated by any flex-space company globally. The company's total portfolio stands at 12.7 million sq.ft. across 14 cities with an operational footprint of 9.1 million sq.ft. across 54 centres. CareEdge Ratings upgraded Smartworks' rating to A- Stable from BBB+ Positive. The company serves 760 corporate clients with 90% of rental revenue coming from large enterprises and maintains 81% overall occupancy.",
            "Sentiment": "positive",
            "PublishDate": 1762445930806,
            "Source": "earnings"
        },
        {
            "Title": "Smartworks Coworking Spaces Reports Quarterly Loss Despite Revenue Growth",
            "Summary": "Smartworks Coworking Spaces Limited announced its quarterly results for the quarter and six months ended September 30, 2025. The company reported revenue from operations of Rs 436.03 million for the quarter, compared to Rs 347.85 million in the same period last year. However, the company posted a net loss of Rs 34.96 million for the quarter versus Rs 45.08 million loss in the previous year quarter. For the six-month period, revenue stood at Rs 841.09 million against Rs 783.96 million last year, while net loss was Rs 147.44 million compared to Rs 372.44 million in the prior year period. The company successfully completed its Initial Public Offering during the quarter, raising Rs 4,450 million through fresh issue of shares. The IPO proceeds are being utilized for debt repayment, capital expenditure for new centers, and general corporate purposes. Basic earnings per share for the quarter was negative Rs 0.33 compared to negative Rs 0.48 in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762435786938,
            "Source": "earnings"
        },
        {
            "Title": "Smartworks Signs Deal for 815,000 Sq. Ft. Coworking Campus in Mumbai",
            "Summary": "Smartworks Coworking Spaces has signed a deal for an 815,000 square feet flexible workspace campus in Eastbridge, Mumbai. The campus is set to launch in Q4 of 2026 and will feature premium amenities. This represents the company's biggest flexible workspace campus.",
            "Sentiment": "positive",
            "PublishDate": 1762157219398,
            "Source": "order&deals"
        },
        {
            "Title": "Smartworks Appoints Ho Kiam Kheong as Non-Executive Director and Re-appoints Neetish Sarda as Managing Director",
            "Summary": "Smartworks Coworking Spaces Limited shareholders approved key leadership changes at their 10th Annual General Meeting held on September 29, 2025. Ho Kiam Kheong was appointed as Non-Executive Director, transitioning from his previous role as Additional Non-Executive Director. He serves as chief executive officer for India at Keppel Capital International Pte. Ltd., bringing over 35 years of experience in real estate investments and development. Neetish Sarda was re-appointed as Managing Director for a five-year term from March 8, 2026 to March 7, 2031. Additionally, shareholders approved the appointment of M/s. SBYN & Associates LLP as Secretarial Auditor for five consecutive years, from the conclusion of the 10th Annual General Meeting until the 15th Annual General Meeting for financial year 2029-30.",
            "Sentiment": "positive",
            "PublishDate": 1759284387995,
            "Source": "corporate_governance"
        },
        {
            "Title": "Smartworks Launches 'Smartvantage' Service for Global Capability Centers in India",
            "Summary": "Smartworks Coworking Spaces Limited has introduced 'Smartvantage', a new service designed to support Global Capability Centers in India. The offering includes customized large-scale campuses and a curated partner network aimed at enhancing efficiency and innovation for these centers.",
            "Sentiment": "positive",
            "PublishDate": 1759138799423,
            "Source": "stock"
        },
        {
            "Title": "Smartworks Opens Largest Mumbai Campus at 557,000 Sq. Ft., Mumbai Portfolio Crosses 1 Million Sq. Ft.",
            "Summary": "Smartworks Coworking Spaces Limited has established its largest Mumbai campus spanning over 557,000 sq. ft. at Intellion Park, Navi Mumbai, developed by Tata Realty and Infrastructure Limited. This expansion brings the company's total leased portfolio in Mumbai above 1 million sq. ft. The campus is located on Thane Belapur Road and features pre-certifications including LEED Platinum, IFC Edge, and WELL Gold, with sustainable features like solar power and smart automation. The facility is designed to attract enterprise clients with comprehensive amenities including cafeterias, gyms, sports zones, and medical centers. Smartworks operates as India's largest managed office platform with approximately 12 million sq. ft. across 14 cities in India and Singapore, serving over 730 clients including Google, Persistent, Groww, and EY. The company now operates four large campuses exceeding 500,000 sq. ft. each, including a flagship 700,000 sq. ft. campus in Bengaluru.",
            "Sentiment": "positive",
            "PublishDate": 1758107502188,
            "Source": "stock"
        },
        {
            "Title": "Smartworks Stock Gains 29% Since IPO on Strong Quarterly Results and Growth Outlook",
            "Summary": "Smartworks Coworking Spaces has gained 29% over its IPO price since listing on July 17, with 12.5% of the gains coming after declaring June quarter results on August 12. The company reported 21% revenue growth to ₹379.2 crore and 3.7% Ebitda growth to ₹241 crore for the June quarter. Net loss reduced to ₹4.2 crore from ₹23 crore in the previous year quarter. Normalised Ebitda margins improved to 16% from 9.3% in the previous year. The company has 1.1 million square feet scheduled for handover in two quarters and expects margin expansion in the second half of FY26 as new capacity comes online. Smartworks has guided for 30% year-on-year revenue growth in FY26. The company operates 8.3 million square feet currently, with plans to reach 12 million square feet capacity by end of FY26, translating to 275,000 seats from current 190,000 seats. Operating expenses as percentage of revenue declined to 27.3% from 32% in the year-ago quarter.",
            "Sentiment": "positive",
            "PublishDate": 1756861786701,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Rejects NGO's Civil Appeal Against Smartworks Coworking, Issues Warning on False Evidence",
            "Summary": "The Supreme Court has rejected a civil appeal filed by an NGO against Smartworks Coworking. The court has warned of serious consequences for presenting false evidence in the case.",
            "Sentiment": "positive",
            "PublishDate": 1756440818103,
            "Source": "stock"
        },
        {
            "Title": "Smartworks Completes Stake Dilution in Clean Max DOS, Shareholding Drops to 9.08%",
            "Summary": "Smartworks Coworking Spaces Limited has completed the dilution of its stake in Clean Max DOS Private Limited, reducing its shareholding from 24.82% to 9.08%. The company received net consideration of INR 99,07,807 from the transaction. The sale agreement was entered into on August 21, 2025, with completion occurring on August 26, 2025. The buyer, Clean Max Enviro Energy Solutions Limited, does not belong to the promoter or group companies. The transaction is not classified as a related party transaction. All formalities and compliances related to this stake dilution have been finalized.",
            "Sentiment": "neutral",
            "PublishDate": 1756218232405,
            "Source": "stock"
        },
        {
            "Title": "Supreme Court Dismisses Infrastructure Watchdog's Appeal Against Smartworks IPO",
            "Summary": "The Supreme Court of India dismissed an appeal filed by Infrastructure Watchdog on August 25, 2025, challenging a Securities Appellate Tribunal order related to Smartworks Coworking Spaces Limited's initial public offering. The original SAT order was connected to the company's IPO disclosed in its prospectus dated July 14, 2025. The case involved the company's promoters Neetish Sarda, NS Niketan LLP, and SNS Infrarealty LLP as parties. Smartworks had previously filed multiple intimations regarding this litigation between July and August 2025.",
            "Sentiment": "positive",
            "PublishDate": 1756117099197,
            "Source": "stock"
        },
        {
            "Title": "Smartworks CoWorking Reduces Clean Max Stake to 9.08%, Loses Associate Company Status",
            "Summary": "Smartworks CoWorking has reduced its ownership stake in Clean Max from 24.82% to 9.08%. As a result of this reduction, Clean Max is no longer classified as an associate company of Smartworks CoWorking.",
            "Sentiment": "neutral",
            "PublishDate": 1755829912759,
            "Source": "stock"
        },
        {
            "Title": "Smartworks Reports 21% Revenue Growth and 109% Jump in Normalized EBITDA in Q1 Results",
            "Summary": "Smartworks Coworking Spaces Limited reported revenue of INR 3,792 million with 21% year-over-year growth for the quarter ended June 30, 2025. The company achieved normalized EBITDA of INR 607 million, marking 109% growth, with normalized EBITDA margin at 16%. Operating cash flow increased 71% to INR 855 million. The company operates 8.3 million sq ft of operational area with 83% overall occupancy and added 5,900 occupied seats during the quarter. Smartworks maintains over 700 enterprise clients across 56 centers in 15 cities, with client retention rate exceeding 80%. The company has 1 million sq ft to be added in the next 2-3 quarters and targets reaching 275,000 seats in 4-5 quarters. Management expects to maintain 25-30% annual growth and aims to become free cash flow positive soon.",
            "Sentiment": "positive",
            "PublishDate": 1755603575697,
            "Source": "earnings"
        },
        {
            "Title": "Smartworks Coworking Spaces Updates on IPO-Related Supreme Court Litigation",
            "Summary": "Smartworks Coworking Spaces Limited provided an update on ongoing litigation related to their initial public offering. The company disclosed details of an appeal filed by Infrastructure Watchdog before the Securities Appellate Tribunal. The matter was listed before the Supreme Court on August 14, 2025, and has been adjourned to August 18, 2025, with the matter pending admission. The company's promoters - Neetish Sarda, NS Niketan LLP, and SNS Infrarealty LLP - are parties to the case. The company stated it will provide further updates when there are substantial developments in the matter.",
            "Sentiment": "neutral",
            "PublishDate": 1755177040343,
            "Source": "stock"
        },
        {
            "Title": "Smartworks Reports 21% Revenue Growth and Doubled EBITDA in Q1FY26 Results",
            "Summary": "Smartworks Coworking Spaces Limited reported revenue of INR 3,792 million for Q1FY26, marking 21% year-over-year growth from INR 3,134 million in Q1FY25. The company's normalized EBITDA more than doubled to INR 607 million compared to INR 290 million in the previous year quarter, with EBITDA margin improving to 16.0% from 9.3%. Normalized operating cash flow increased 71% to INR 855 million. The company achieved normalized profit before tax of INR 168 million versus a loss of INR 102 million in Q1FY25. Annualized return on capital employed doubled to 13.0% from 6.5% in FY25. Smartworks operates across 15 cities with 10.1 million square feet of leased space, 54 leased centers, and 232,000 leased capacity seats. The company maintains 83% overall occupancy rate with 90% revenue from enterprise clients and an average client tenure of 49 months for large clients.",
            "Sentiment": "positive",
            "PublishDate": 1754998733876,
            "Source": "earnings"
        },
        {
            "Title": "Smartworks Coworking Spaces Approves Quarterly Financial Results",
            "Summary": "Smartworks Coworking Spaces Limited's Board of Directors approved the company's unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The board meeting was held on August 12, 2025, lasting from 2:30 PM to 3:02 PM IST. The financial results, along with the Limited Review Report, were reviewed by the Audit Committee before board approval. The company will host this information on its investor website at smartworksoffice.com/investors.",
            "Sentiment": "neutral",
            "PublishDate": 1754993611045,
            "Source": "earnings"
        },
        {
            "Title": "Smartworks Coworking Spaces Updates Supreme Court Hearing Date for IPO-Related Appeal",
            "Summary": "Smartworks Coworking Spaces Limited updated stock exchanges about a change in the Supreme Court hearing date for an appeal filed by Infrastructure Watchdog before the Securities Appellate Tribunal regarding the company's initial public offering. The Supreme Court matter, previously scheduled for August 8, 2025, has been rescheduled to August 14, 2025. The company's promoters - Neetish Sarda, NS Niketan LLP, and SNS Infrarealty LLP - are parties to the case. This update follows previous disclosures made on July 19, July 22, and August 4, 2025, regarding the pending litigation related to the company's IPO as disclosed in its prospectus dated July 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754499750413,
            "Source": "stock"
        },
        {
            "Title": "Smartworks Coworking Spaces Updates on Supreme Court Litigation Related to IPO",
            "Summary": "Smartworks Coworking Spaces Limited provided an update on ongoing litigation related to their initial public offering. The appeal filed by Infrastructure Watchdog is pending before the Supreme Court, with the next hearing scheduled for August 4, 2025. The company's promoters are also parties to the case.",
            "Sentiment": "neutral",
            "PublishDate": 1753166025147,
            "Source": "stock"
        }
    ]
}