{
    "Symbol": "SMCGLOBAL",
    "ISIN": "INE103C01036",
    "News": [
        {
            "Title": "SMC Global Securities Schedules Q3 FY26 Earnings Call",
            "Summary": "SMC Global Securities announces earnings conference call on February 3, 2026 at 4:00 PM IST to discuss Q3 FY26 and 9M FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769521622402,
            "Source": "co_actions_results"
        },
        {
            "Title": "SMC Global Securities Promoter Group Reduces Stake",
            "Summary": "Jai Ambey Share Broking Limited reduces shareholding in SMC Global Securities from 0.53% to 0.51% through open market sale of 40,000 equity shares on December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766735574860,
            "Source": "co_actions_results"
        },
        {
            "Title": "SMC Global Securities clarifies price movement",
            "Summary": "SMC Global Securities confirms no pending material information or events behind recent significant price movement in its equity shares, attributing it to market-driven factors.",
            "Sentiment": "neutral",
            "PublishDate": 1765875941337,
            "Source": "stocks"
        },
        {
            "Title": "SMC Global Securities Shareholders Approve Alteration of Object Clause via Postal Ballot",
            "Summary": "SMC Global Securities Limited successfully passed a special resolution to alter the Object Clause of its Memorandum of Association through remote e-voting conducted from November 4 to December 3, 2025. The resolution received unanimous approval with 73,159,094 votes (100%) in favor and zero votes against, affecting the company's operational scope and business activities.",
            "Sentiment": "positive",
            "PublishDate": 1764851089155,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Completes 1:1 Bonus Share Allotment of 10.47 Crore Shares",
            "Summary": "SMC Global Securities' Bonus Issue Committee approved the allotment of 10.47 crore bonus equity shares in a 1:1 ratio, doubling the company's paid-up share capital from ₹20.94 crores to ₹41.88 crores. The bonus shares, funded through capitalization of securities premium and capital redemption reserves, were credited to eligible shareholders' demat accounts and will be listed on BSE and NSE.",
            "Sentiment": "positive",
            "PublishDate": 1763352951259,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Approaches Ex-Date for 1:1 Bonus Issue",
            "Summary": "SMC Global Securities shares will trade ex-bonus from Friday, November 14, following the company's 1:1 bonus issue announcement. Investors must purchase shares by November 13 to be eligible for the bonus entitlement. The company will issue one bonus share for every share held as of the record date of November 14, 2025. In a 1:1 bonus issue, shareholders receive one additional share for every share held, effectively doubling their shareholding without changing total investment value. The bonus shares are issued from the company's free reserves to improve liquidity and broaden investor participation. Shares purchased from November 14 onward will not carry bonus eligibility. Sampre Nutritions will also trade ex-bonus and ex-split from Friday, with a 1:1 bonus issue and stock split from Rs 10 to Rs 5 face value.",
            "Sentiment": "neutral",
            "PublishDate": 1763001567036,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Sets Record Date for 1:1 Bonus Share Issue",
            "Summary": "SMC Global Securities Limited has fixed November 14, 2025 as the record date for determining shareholder entitlement for bonus equity shares in a 1:1 ratio. Shareholders will receive one bonus equity share of face value Rs. 2 for every fully paid-up equity share held. The bonus issue was approved by equity shareholders through postal ballot on October 25, 2025. The deemed allotment date is November 17, 2025, with trading to commence on November 18, 2025. The company's paid-up capital stands at Rs. 20.94 crores with face value of Rs. 2 per share. Physical shareholders must dematerialize their shares by the record date to receive bonus shares in their demat accounts.",
            "Sentiment": "positive",
            "PublishDate": 1762567737446,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Seeks Shareholder Approval to Amend Business Objects Through Postal Ballot",
            "Summary": "SMC Global Securities Limited has issued a postal ballot notice seeking shareholder approval for amendments to its Memorandum of Association's Object Clause. The company proposes to alter clauses 2, 3, and 5 to explicitly include margin trading facilities, technology-enabled digital trading platforms, fintech and AI-driven systems, and custodian services. The amendments also seek to add distribution of third-party financial products like mutual funds, bonds, and insurance. Additionally, the company is correcting a typographical error in clause 3, changing 'arbitrary' to 'arbitrage' business. The e-voting period runs from November 4, 2025, to December 3, 2025, with results to be declared by December 5, 2025. The company states these amendments are primarily clarificatory and align with its existing business activities in financial services including stock broking, portfolio management, and investment management to Alternative Investment Funds.",
            "Sentiment": "neutral",
            "PublishDate": 1762178503376,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Reports Mixed Q2 Performance with Declining Profits Despite Revenue Growth",
            "Summary": "SMC Global Securities Limited announced its quarterly results for the period ended September 30, 2025. On a standalone basis, the company reported total revenue from operations of ₹21,653.03 lakhs for the quarter, with profit after tax of ₹634.20 lakhs. For the half-year period, standalone revenue reached ₹46,265.10 lakhs with profit after tax of ₹2,917.53 lakhs. On a consolidated basis, the company achieved total revenue of ₹44,026.86 lakhs for the quarter and ₹86,519.94 lakhs for the half-year, with consolidated profit after tax of ₹2,099.98 lakhs and ₹5,094.99 lakhs respectively. The Board also approved a 1:1 bonus issue of 10.47 crore equity shares, subject to shareholder approval, which would double the paid-up equity share capital to ₹4,188 lakhs. Additionally, the company successfully raised ₹13,385.86 lakhs through Non-Convertible Debentures (NCDs) with interest rates ranging from 10% to 10.50% and varying maturity periods from 2026 to 2030. The company operates through three main business segments: broking, distribution and trading; insurance broking services; and financing activities.",
            "Sentiment": "neutral",
            "PublishDate": 1761854361127,
            "Source": "earnings"
        },
        {
            "Title": "SMC Global Amends Charter for Tech-Financial Services Expansion Amid Q2 Profit Decline",
            "Summary": "SMC Global Securities amended its memorandum object clauses to include technology-enabled financial services and SEBI-approved custodian business. This aligns with the company's strategy toward integrated capital market infrastructure, regulatory compliance, and growth in digital and institutional segments. The company reported Q2 consolidated net profit of 206.6 million rupees compared to 453 million rupees year-over-year. Q2 revenue declined to 4.4 billion rupees from 4.5 billion rupees year-over-year. EBITDA dropped to 843.8 million rupees from 1.19 billion rupees year-over-year, with EBITDA margin falling to 19.17% from 26.38% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761842808521,
            "Source": "stock"
        },
        {
            "Title": "SMC Global Securities Allots 13.39 Lakh Non-Convertible Debentures Worth Rs. 1,339 Crore",
            "Summary": "SMC Global Securities Limited has completed the allotment of 13,38,586 secured, rated, listed, redeemable non-convertible debentures with a face value of Rs. 1,000 each on October 30, 2025. The debentures were issued under a public issue with a base size of Rs. 7,500 lakh and green shoe option of Rs. 7,500 lakh, totaling Rs. 15,000 lakh. The NCDs are offered across six series with tenors ranging from 24 to 60 months and coupon rates between 9.75% to 10.25% per annum. The debentures are secured by a pari passu charge over trade receivables and margin trading facility (MTF) of the company, maintaining a security cover of at least 110% of outstanding principal amounts. The allotment was approved by the Non-Convertible Debenture Committee during a meeting held from 11:00 AM to 11:15 AM.",
            "Sentiment": "positive",
            "PublishDate": 1761840684364,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Shareholders Approve Bonus Share Issuance Through Postal Ballot",
            "Summary": "SMC Global Securities Limited conducted a postal ballot through remote e-voting to seek shareholder approval for issuing bonus shares to equity shareholders. The voting period ran from September 26, 2025 to October 25, 2025. The ordinary resolution was passed with overwhelming support, receiving 73,174,366 votes in favor (100% of valid votes cast) and only 11 votes against. Out of 26,574 total shareholders on record, the voting saw participation across promoter groups and public shareholders. Arvind Kumar Roy served as the scrutinizer for the postal ballot process. The company appointed MUFG Intime India Private Limited as the authorized agency for providing e-voting facilities to members.",
            "Sentiment": "positive",
            "PublishDate": 1761551961313,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Prepones NCD Issue Dates to October 16-24, 2025",
            "Summary": "SMC Global Securities Limited has revised the schedule for its upcoming Non-Convertible Debentures (NCDs) public issuance. The issue opening date has been moved from October 27, 2025 to October 16, 2025, while the closing date has been advanced from November 10, 2025 to October 24, 2025. The company cited encouraging investor interest and early receipt of operational and statutory approvals as reasons for the preponed dates. The NCD issue is for Rs. 7,500 Lakh with a green shoe option of an additional Rs. 7,500 Lakh, featuring secured, rated, listed, redeemable debentures with a face value of Rs. 1,000 each. The company also approved an addendum to the prospectus dated September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1760342679866,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Approves Rs 15,000 Crore Non-Convertible Debenture Issue",
            "Summary": "SMC Global Securities Limited's Non-convertible Debenture Committee approved a prospectus for public issuance of secured, rated, listed, redeemable non-convertible debentures. The issue has a base size of Rs 7,500 crore with a green shoe option to retain oversubscription up to Rs 7,500 crore, totaling up to Rs 15,000 crore. Each debenture carries a face value of Rs 1,000. The NCDs are rated 'ICRA A Stable' by ICRA Limited for up to Rs 40,000 crore. The company received in-principle approval from BSE Limited for listing. The NCDs will be secured by pari passu charge over trade receivables and margin trading facility of the company, maintaining a security cover of at least 110% of outstanding principal and interest.",
            "Sentiment": "positive",
            "PublishDate": 1759246750716,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Board Approves 1:1 Bonus Share Issue Worth ₹20.94 Crores",
            "Summary": "SMC Global Securities Limited's Board of Directors approved and recommended a 1:1 bonus equity share issue on September 24, 2025. Shareholders will receive one bonus equity share of face value ₹2 for every existing fully paid-up equity share held. The company will issue 10.47 crore bonus shares worth ₹20.94 crores by capitalizing funds from its capital redemption reserve (₹1.69 crores) and securities premium account (₹252.02 crores). The proposal requires shareholder approval through postal ballot, with the bonus shares expected to be credited within two months of board approval, by November 23, 2025. Post-bonus issue, the company's paid-up share capital will double from 10.47 crore shares to 20.94 crore shares.",
            "Sentiment": "positive",
            "PublishDate": 1758715624653,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Schedules Board Meeting to Consider Bonus Share Issuance",
            "Summary": "SMC Global Securities Limited has scheduled a Board of Directors meeting on September 24, 2025 to consider and recommend the issuance of bonus equity shares through capitalization of reserves, subject to shareholder approval. The trading window for company securities will be closed for designated persons from September 18, 2025 to September 26, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1758176366965,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Acquires 14.51% Stake in Oval Projects Engineering as Designated Market Maker",
            "Summary": "SMC Global Securities Limited has acquired 30,12,800 equity shares representing a 14.51% stake in Oval Projects Engineering Limited through its role as Designated Market Maker in the company's IPO. The acquisition comprised 3,04,000 shares allotted prior to listing and 27,08,800 shares purchased through open market at an average price of Rs. 85.25 per share. Oval Projects Engineering is an infrastructure services company providing engineering, procurement and construction services primarily in the Oil & Gas sector, headquartered in Agartala-Tripura. The company reported turnover of Rs. 10,228.99 lakhs in 2024-25, Rs. 7,796.54 lakhs in 2023-24, and Rs. 5,902.14 lakhs in 2022-23. SMC Global will serve as market maker for three years from the listing date. The transaction does not constitute a related party transaction.",
            "Sentiment": "neutral",
            "PublishDate": 1756992502003,
            "Source": "order&deals"
        },
        {
            "Title": "SMC Global Securities Reports 632% PAT Growth in Q1 FY26 Despite Regulatory Headwinds",
            "Summary": "SMC Global Securities delivered consolidated revenue of ₹425.1 crores in Q1 FY26, marking 0.9% quarter-on-quarter growth. The company achieved significant profitability improvement with EBITDA rising 59% to ₹100.3 crores and PAT surging 632% to ₹30 crores compared to the previous quarter. The broking segment added over 26,000 new clients during the quarter, while mutual fund AUM reached ₹4,519 crores, representing 8.2% year-on-year growth. The financing segment showed 25% quarter-on-quarter revenue growth to ₹51 crores, though NBFC AUM remained flat at ₹1,191 crores due to tightened underwriting policies and discontinuation of large-ticket loans. Asset quality faced pressure with GNPA rising to 3.9% and NNPA to 2.6%, primarily from the secured portfolio. The insurance broking division reported revenue of ₹116 crores but experienced decline due to reduced motor insurance demand. The company operates through 2,137 authorized persons across 412 cities and targets doubling mutual fund AUM to ₹8,000 crores within one year through technology upgrades and expanded distributor support.",
            "Sentiment": "positive",
            "PublishDate": 1754136132999,
            "Source": "earnings"
        },
        {
            "Title": "SMC Global Securities Makes Q1FY26 Earnings Call Audio Recording Available",
            "Summary": "SMC Global Securities Limited has made the audio recording of their Q1FY26 earnings conference call available on their website. The call was held on July 28, 2025 at 4:30 PM. The company confirmed that no unpublished price sensitive information was shared during the call. The transcript will be uploaded to their website and shared with stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1753709850604,
            "Source": "earnings"
        },
        {
            "Title": "SMC Global Securities Approves Rs 15,000 Lakh NCD Issue and Appoints New Key Managerial Personnel",
            "Summary": "SMC Global Securities' Board approved a proposal to raise funds through a public issue of non-convertible debentures with a base size of Rs 7,500 lakhs and oversubscription option of Rs 7,500 lakhs, totaling Rs 15,000 lakhs. The NCDs will have a face value of Rs 1,000 each and will be secured, rated, listed, and redeemable. The company also reported complete utilization of Rs 120.30 crore raised from its previous NCD issue that was listed on BSE on April 25, 2025, with no deviations from stated objectives. Additionally, the Board designated Ganesh Badhani, Chief Information & Security Officer, as Key Managerial Personnel effective July 26, 2025. Badhani brings over 18 years of experience in cybersecurity and holds certifications including CISA, C-CISO, and DCPP.",
            "Sentiment": "positive",
            "PublishDate": 1753533260462,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Reports Q1 Results and Approves Rs 15,000 Crore Debenture Issue",
            "Summary": "SMC Global Securities Limited's board approved unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company reported consolidated revenue from operations of Rs 42,508.81 lakhs and net profit after tax of Rs 2,995.01 lakhs. On a standalone basis, revenue was Rs 24,612.07 lakhs with net profit of Rs 2,283.33 lakhs. The board also approved raising funds through a public issue of secured, rated, listed, redeemable, non-convertible debentures up to Rs 15,000 lakhs, comprising a base issue size of Rs 7,500 lakhs with a green shoe option of Rs 7,500 lakhs. During the quarter, the company successfully raised Rs 12,030.42 lakhs through NCDs allotted on April 24, 2025, which were listed on BSE Limited for trading on April 25, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753531602725,
            "Source": "earnings"
        },
        {
            "Title": "SMC Global Securities Schedules Q1 FY2025-26 Earnings Conference Call for July 28",
            "Summary": "SMC Global Securities Limited will hold an earnings conference call on July 28, 2025, at 4:30 PM IST to discuss its unaudited financial results for the quarter ended June 30, 2025. The call will feature senior management including CMD Subhash C. Aggarwal, Vice CMD Mahesh C. Gupta, and other key executives from SMC Group companies. Access will be provided through domestic and international dial-in numbers, with the session also hosted on the company's website. The call aims to discuss operational and financial performance with investors and analysts.",
            "Sentiment": "neutral",
            "PublishDate": 1753191398195,
            "Source": "earnings"
        },
        {
            "Title": "SMC Global Securities Receives Warning Letter from SEBI",
            "Summary": "SMC Global Securities has received a warning letter from the Securities and Exchange Board of India (SEBI). The exact nature of the warning or the reasons behind it are not specified in the provided news snippet. This action by SEBI, India's market regulator, suggests potential compliance issues or regulatory concerns regarding SMC Global Securities' operations or practices.",
            "Sentiment": "negative",
            "PublishDate": 1743034409000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SEBI Issues Warning Letter to SMC Global Securities",
            "Summary": "SMC Global Securities has received a warning letter from the Securities and Exchange Board of India (SEBI). The specific details of the warning or the reasons behind it are not provided in the given news snippet.",
            "Sentiment": "negative",
            "PublishDate": 1742997885000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SMC Global Securities Declares Dividend",
            "Summary": "SMC Global Securities has announced a dividend of 1.2 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1738161258000,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Reports Q3 EBITDA and Margin Figures",
            "Summary": "SMC Global Securities has released its financial results for the third quarter. The company reported an EBITDA of 1.1 billion rupees, compared to 1.13 billion rupees in the same quarter last year. The EBITDA margin for Q3 stood at 24.54%, down from 26.46% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1738161207000,
            "Source": "earnings"
        },
        {
            "Title": "SMC Global Securities Reports Q3 Financial Results",
            "Summary": "SMC Global Securities announced its Q3 consolidated net profit of 437 million rupees, showing a decrease from 517 million rupees year-over-year and 453 million rupees quarter-over-quarter. The company's Q3 revenue increased to 4.55 billion rupees from 4.3 billion rupees in the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738161152000,
            "Source": "earnings"
        },
        {
            "Title": "SMC Global Securities: Future Growth Strategy",
            "Summary": "SMC Global Securities is focusing on global expansion, increasing fee-based income, and continuing to adapt and innovate in their business approach. This strategy suggests the company is positioning itself for long-term growth and sustainability in the financial services sector.",
            "Sentiment": "positive",
            "PublishDate": 1730087081000,
            "Source": "corporate_action"
        },
        {
            "Title": "SMC Global Securities Reports Q2 Financial Results",
            "Summary": "SMC Global Securities announced its Q2 consolidated net profit of 453 million rupees, showing an increase from 396 million rupees year-over-year. However, it decreased from 530 million rupees quarter-over-quarter. The company's total revenue for Q2 reached 4.5 billion rupees, up from 3.89 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729871544000,
            "Source": "result"
        }
    ]
}