{
    "Symbol": "SMLMAH",
    "ISIN": "INE294B01019",
    "News": [
        {
            "Title": "SML Mahindra Q3FY26 profit jumps 3,209% to ₹17.54 cr",
            "Summary": "SML Mahindra Limited reported exceptional Q3FY26 results with net profit surging 3,209% YoY to ₹17.54 crores. Revenue grew 62.53% to ₹539.27 crores, with EBITDA rising to ₹41.40 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768567379736,
            "Source": "co_actions_results"
        },
        {
            "Title": "SML Mahindra Reports Strong Growth in December 2025",
            "Summary": "SML Mahindra Limited achieved significant growth in December 2025 with commercial vehicle production rising 39.10% and sales surging 76.91% year-on-year, despite lower export volumes.",
            "Sentiment": "positive",
            "PublishDate": 1767874310812,
            "Source": "stocks"
        },
        {
            "Title": "SML Mahindra Reports 67% Growth in December Sales",
            "Summary": "SML Mahindra achieved strong sales growth of 67% in December with total vehicle sales reaching 1,044 units compared to 626 units in December 2024. Cargo vehicles led with 76% growth.",
            "Sentiment": "positive",
            "PublishDate": 1767236469126,
            "Source": "stocks"
        },
        {
            "Title": "SML Mahindra Board Meet Set for Jan 16 for Q3 Results",
            "Summary": "SML Mahindra Limited has scheduled its board meeting for January 16, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closes from January 1-19, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767009892687,
            "Source": "co_actions_results"
        },
        {
            "Title": "SML Mahindra Wins Appeal, Penalty Set Aside by MCA",
            "Summary": "SML Mahindra Limited successfully appealed against ROC penalty of ₹2.0 lakh on company and ₹0.5 lakh each on three officers. Regional Director set aside the original order dated August 21, 2024.",
            "Sentiment": "positive",
            "PublishDate": 1765964143919,
            "Source": "stocks"
        },
        {
            "Title": "SML Mahindra Receives Income Tax Order with ₹16.41 Lacs",
            "Summary": "SML Mahindra Limited receives appeal effect order from Income Tax Department with total adjustments of ₹16.41 lacs for AY 2022-23, following transfer pricing disputes.",
            "Sentiment": "negative",
            "PublishDate": 1765380496267,
            "Source": "stocks"
        },
        {
            "Title": "SML Mahindra Faces Rs 168.64 Lakh Transfer Pricing Adjustment from Income Tax Department",
            "Summary": "The Transfer Pricing Officer has passed an order under Section 92CA(3) of the Income-tax Act, 1961, with an adjustment of Rs 168.64 lakhs to SML Mahindra's international transactions, disputing the company's arms length pricing methods for manufacturing segment and corporate guarantee fee payments. The company plans to file an appeal against this order while facing potential penalty proceedings under section 270A of the Income-tax Act.",
            "Sentiment": "negative",
            "PublishDate": 1764582703846,
            "Source": "stock"
        },
        {
            "Title": "SML Mahindra Limited Receives New Commercial Paper Rating from ICRA",
            "Summary": "ICRA Limited assigned SML Mahindra Limited a new rating of ICRA [A1] for Rs. 200 crores commercial papers, while reaffirming existing ratings for short-term and long-term banking facilities worth Rs. 250 crores and Rs. 391 crores respectively. The rating update affects the company's credit profile and provides investors with updated assessment of its commercial paper issuance capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1764327965453,
            "Source": "corporate_action"
        },
        {
            "Title": "SML Mahindra's Tax Appeal Dismissed, Faces Rs 9.92 Lacs Transfer Pricing Adjustment",
            "Summary": "The Dispute Resolution Panel dismissed SML Mahindra Limited's appeal against a draft assessment order under section 144C(1), which included transfer pricing adjustments of Rs 9.92 Lacs for assessment year 2022-23. The authority disputed the company's arms length price and method for corporate guarantee fee payments to associated enterprises, with the company planning to file an appeal against the final assessment order.",
            "Sentiment": "negative",
            "PublishDate": 1763800419030,
            "Source": "stock"
        },
        {
            "Title": "SML Isuzu Limited Changes Name to SML Mahindra Limited",
            "Summary": "SML Isuzu Limited has officially changed its name to SML Mahindra Limited, with the change approved by the Registrar of Companies and both BSE and NSE stock exchanges effective November 10, 2025. The company's trading symbol has been updated from SMLISUZU to SMLMAH on both exchanges, while the BSE scrip code remains 505192. The company operates in the trucks and buses segment with its registered office in Punjab.",
            "Sentiment": "neutral",
            "PublishDate": 1762258996173,
            "Source": "corporate_action"
        },
        {
            "Title": "SML Isuzu Reports 32% Jump in October Sales to 1,059 Units",
            "Summary": "SML Isuzu recorded total sales of 1,059 units in October compared to 801 units in the same period last year, representing a year-on-year increase of 258 units.",
            "Sentiment": "positive",
            "PublishDate": 1761980097816,
            "Source": "stock"
        },
        {
            "Title": "SML Mahindra Limited Reports 88.01 Crore Profit for Half Year Ended September 2025",
            "Summary": "SML Mahindra Limited's Board approved unaudited financial results for the second quarter and half year ended September 30, 2025. The company reported a profit of 21.05 crore for the quarter compared to 21.80 crore in the same quarter last year. For the half year, profit increased to 88.01 crore from 68.19 crore in the previous year. Revenue from operations for the half year was 1,401.00 crore compared to 1,295.81 crore last year. The company's name was changed from SML Isuzu Limited to SML Mahindra Limited effective October 8, 2025, following Mahindra & Mahindra Limited's acquisition of 58.96% equity stake on August 1, 2025. Basic and diluted earnings per share for the half year stood at 60.82 rupees compared to 47.12 rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1760775958768,
            "Source": "earnings"
        },
        {
            "Title": "SML Isuzu Reports 10% Decline in September Vehicle Sales, Year-to-Date Sales Up 7%",
            "Summary": "SML Isuzu reported total vehicle sales of 950 units in September 2025, down 10% from 1,055 units in September 2024. Cargo vehicles declined 9% to 370 units while passenger vehicles fell 10% to 580 units. However, the company's April-September performance showed growth with total sales reaching 8,145 units, up 7% from 7,627 units in the same period last year. Cargo vehicles drove the year-to-date growth with a 29% increase to 2,422 units, while passenger vehicles remained flat at 5,723 units.",
            "Sentiment": "neutral",
            "PublishDate": 1759287356071,
            "Source": "stock"
        },
        {
            "Title": "SML Isuzu Receives Mixed GST Order - Rs 1.72 Crore Demand Waived, Rs 0.70 Crore Confirmed",
            "Summary": "SML Isuzu Limited received an order from the Assistant Commissioner, Central Goods & Services Tax Division-III, Chandigarh regarding GST demands. The order waived off Rs 1.72 crore in total demand (comprising Rs 1.56 crore interest and Rs 0.16 crore penalty) for the period July 2017 to March 2020. However, it confirmed a demand of Rs 0.70 crore (comprising Rs 0.59 crore interest and Rs 0.11 crore penalty) for the period April 2020 to March 2023. The violation relates to non-payment of IGST under reverse charge mechanism on certain services. The company plans to file an appeal against the confirmed demand before the Goods and Services Tax Appellate Tribunal.",
            "Sentiment": "neutral",
            "PublishDate": 1758286976836,
            "Source": "stock"
        },
        {
            "Title": "SML Isuzu August Sales Fall 15% to 815 Units, Exports Drop by Half",
            "Summary": "SML Isuzu reported a 15% decline in sales to 815 units in August compared to 932 units in the same month last year. Exports dropped significantly to 27 units from 58 units year-on-year, while production increased modestly to 1,045 units from 974 units. The company's shares closed at ₹3,699 on NSE, down 1.76%. The company is preparing to rebrand as SML Mahindra Ltd following board approval, with final clearances pending from shareholders and regulators. This follows Mahindra & Mahindra's acquisition of a majority stake from promoters Sumitomo and Isuzu for ₹650 per share, and M&M's subsequent open offer for an additional 26% stake at ₹1,554.6 per share. For the June quarter, SML Isuzu posted net profit of ₹67 crore, up 44% year-on-year, with revenue rising 13% to ₹846 crore and EBITDA improving 15% to ₹105 crore.",
            "Sentiment": "negative",
            "PublishDate": 1757327479887,
            "Source": "stock"
        },
        {
            "Title": "SML Isuzu Vehicle Sales Drop 15% to 842 Units in August",
            "Summary": "SML Isuzu sold 842 units in August, representing a decline from 990 units sold in the same month last year. The commercial vehicle manufacturer experienced a year-over-year decrease of 148 units in its monthly sales performance.",
            "Sentiment": "negative",
            "PublishDate": 1756709311626,
            "Source": "stock"
        },
        {
            "Title": "SML Isuzu Board Approves Name Change to SML Mahindra Limited",
            "Summary": "SML Isuzu Limited's board has approved changing the company's name to SML Mahindra Limited after receiving name reservation from the Registrar of Companies. The name change requires shareholder approval at the upcoming Annual General Meeting and other statutory approvals to become effective. This follows Mahindra & Mahindra's acquisition of SML Isuzu for ₹555 crore, where it acquired a 43.96% stake from Sumitomo Corporation and 15% from Isuzu Motors, with plans for an additional 26% open offer. SML Isuzu, incorporated in 1983, operates in the trucks and buses segment. Shares closed at ₹3,998, down 2.74%.",
            "Sentiment": "neutral",
            "PublishDate": 1755622074438,
            "Source": "corporate_action"
        },
        {
            "Title": "SML Isuzu Receives Income Tax Department Order Nullifying Rs 5,830 TDS Demand",
            "Summary": "SML Isuzu Limited disclosed that the Income Tax Department's Centralized Processing Cell has nullified a demand of Rs 5,830 related to short deduction of tax. The nullification was based on a revised TDS return (Form 26Q) filed under Plant TAN for Q-1 FY 2025-26. This follows a previous intimation/order dated August 2, 2025, which was communicated to stock exchanges on August 5, 2025. The company received the latest order on August 8, 2025, from the Assistant Commissioner of Income Tax (Centralized Processing Cell)-TDS.",
            "Sentiment": "positive",
            "PublishDate": 1754661917575,
            "Source": "stock"
        },
        {
            "Title": "SML Isuzu's Independent Directors Recommend Mahindra & Mahindra's Open Offer at Rs 1,554.60 per Share",
            "Summary": "SML Isuzu Limited's Committee of Independent Directors (IDC) has recommended Mahindra & Mahindra Limited's open offer to acquire up to 37,62,626 equity shares (28% of voting share capital) at Rs 1,554.60 per share. The IDC, comprising C.S. Verma (Chairperson), Arun Kumar Malhotra, and Ravi Venkatraman, concluded the offer price is fair and reasonable based on SEBI regulations. The offer price equals the volume-weighted average market price over 60 trading days preceding the public announcement and is higher than the negotiated acquisition price of Rs 650 per share. However, the committee noted that the closing market prices on NSE and BSE as of August 1, 2025 were Rs 3,471.30 and Rs 3,489.40 respectively, which are significantly higher than the offer price. The IDC unanimously approved the recommendation and advised shareholders to independently evaluate the offer before making their decision.",
            "Sentiment": "neutral",
            "PublishDate": 1754390364968,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra & Mahindra Acquires 58.96% Stake in SML Isuzu Limited for ₹144.7 Crore",
            "Summary": "Mahindra and Mahindra Limited completed the acquisition of 85,33,053 equity shares representing 58.96% of SML Isuzu Limited's equity share capital on August 1, 2025. The acquisition was executed through two separate share purchase agreements - 43.96% (63,62,306 shares) purchased from Sumitomo Corporation and 15.00% (21,70,747 shares) from Isuzu Motors Limited. Both agreements were originally dated April 26, 2025, and amended on July 29, 2025. The transaction was completed through off-market transfers. Following this acquisition, M&M has become the promoter of SML Isuzu with effect from August 1, 2025. SML Isuzu's total equity share capital stands at ₹14.47 crore divided into 1,44,71,646 equity shares of ₹10 face value each. Sumitomo Corporation, which previously held 43.96% as a promoter, has been reclassified from promoter to public category after selling its entire stake to M&M.",
            "Sentiment": "neutral",
            "PublishDate": 1754283076303,
            "Source": "order&deals"
        },
        {
            "Title": "SML Isuzu Appoints New Executive Chairman, Changes CFO and COO Positions, Replaces Statutory Auditors",
            "Summary": "SML Isuzu Limited announced significant leadership changes effective August 2025. Vinod Kumar Sahay was appointed as Executive Chairman from August 3, 2025, while Chandra Shekhar Verma stepped down from the Chairman role to continue as Non-Executive Independent Director. The company restructured its CFO position with Rakesh Bhalla's term ending September 30, 2025, after which he will become Advisor to Executive Director & CEO. Pushkar Patwardhan was appointed as CFO-Designate and will assume full CFO responsibilities from October 1, 2025. Ritesh Agrawal joined as Chief Operating Officer. Due to organizational restructuring, Sandeep Chandna and Vikas Sharma ceased to be Senior Management Personnel but remain with the company. Walker Chandiok & Co LLP resigned as statutory auditors citing independence concerns related to non-audit services provided to the holding company Mahindra & Mahindra. B S R & Co. LLP was appointed as replacement statutory auditors to fill the vacancy until the next AGM, with board approval for a five-year term subject to shareholder consent.",
            "Sentiment": "neutral",
            "PublishDate": 1754135450557,
            "Source": "corporate_governance"
        },
        {
            "Title": "SML ISUZU Appoints Pushkar Patwardhan as New CFO, Vinod Kumar Sahay to Become Executive Chairman",
            "Summary": "SML ISUZU Limited announced key managerial personnel changes approved by its Board of Directors. Mr. Pushkar Patwardhan will take over as Chief Financial Officer from October 1, 2025, replacing Mr. Rakesh Bhalla who will serve until September 30, 2025. Additionally, Mr. Vinod Kumar Sahay will transition from Executive Director to Executive Chairman effective August 3, 2025. Dr. Venkataraman Srinivas continues as Executive Director and Chief Executive Officer, while Mr. Parvesh Madan remains as Company Secretary and Compliance Officer. The company has updated contact details for all key managerial personnel and made this information available on its website.",
            "Sentiment": "neutral",
            "PublishDate": 1754134752090,
            "Source": "corporate_governance"
        },
        {
            "Title": "SML Isuzu Terminates Shareholders' Agreement as Sumitomo and Isuzu Transfer Stakes to Mahindra & Mahindra",
            "Summary": "SML Isuzu Limited terminated the shareholders' agreement between Sumitomo Corporation and Isuzu Motors Limited effective August 1, 2025. The termination follows the completion of share purchase agreements where Sumitomo transferred its 43.96% stake and Isuzu transferred its 15% stake in SML Isuzu to Mahindra & Mahindra Limited. The original shareholders' agreement was dated November 25, 2011, and governed the rights and obligations of Sumitomo and Isuzu as shareholders. With the completion of the share transfers, both Sumitomo and Isuzu ceased to be shareholders of the company, making the shareholders' agreement redundant.",
            "Sentiment": "neutral",
            "PublishDate": 1754073386956,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra & Mahindra Acquires 58.96% Stake in SML Isuzu Limited",
            "Summary": "Mahindra & Mahindra Limited completed the acquisition of 58.96% stake in SML Isuzu Limited on August 1, 2025, purchasing 85,33,053 equity shares from Sumitomo Corporation (43.96%) and Isuzu Motors Limited (15%). The transaction was originally agreed upon in April 2025 and amended in July 2025. Following the acquisition, M&M has been classified as the promoter of SML Isuzu, while Sumitomo ceases to be a promoter. The company's board approved changing the name from 'SML Isuzu Limited' to 'SML Mahindra Limited' subject to regulatory approvals. A complete board restructuring occurred with seven directors resigning and six new directors being appointed, including Dr. Venkataraman Srinivas as Executive Director and CEO, and Mr. Vinod Kumar Sahay as Executive Director.",
            "Sentiment": "positive",
            "PublishDate": 1754065938812,
            "Source": "order&deals"
        },
        {
            "Title": "SML Isuzu Reports 18.6% Growth in July Sales to 1,427 Units",
            "Summary": "SML Isuzu recorded total sales of 1,427 units in July, representing an increase from 1,203 units in the same period last year. This reflects a year-over-year growth in the company's vehicle sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1754037157256,
            "Source": "stock"
        },
        {
            "Title": "SML Isuzu Modifies Delivery Schedule and Board Nomination Terms with Sumitomo and M&M",
            "Summary": "SML Isuzu has announced changes to its delivery schedule and board nomination terms involving Sumitomo and Mahindra & Mahindra (M&M). The company has modified the existing arrangements with these two partners regarding delivery timelines and board representation terms.",
            "Sentiment": "neutral",
            "PublishDate": 1753839385141,
            "Source": "corporate_governance"
        },
        {
            "Title": "SML Isuzu Amends Share Purchase Agreements with Sumitomo, Mahindra & Mahindra, and Isuzu Motors",
            "Summary": "SML Isuzu Limited entered into amendment agreements on July 29, 2025, with Sumitomo Corporation, Mahindra & Mahindra Limited, and Isuzu Motors Limited to modify provisions of previously executed share purchase agreements. The amendments include changes to delivery schedules for parts supplied by Sumitomo to SML Isuzu for vehicle manufacturing, based on revised supply timelines to meet business requirements. The agreements also modify the appointment structure, allowing M&M's nominee to be designated as 'Key Managerial Personnel' instead of 'Managing Director' to provide flexibility in designation. Additionally, procedural aspects for passing Board and shareholders' resolutions were amended to allow options for Circular Resolution or Board Meeting, and shareholders' resolutions via Annual General Meeting or Postal Ballot. Sumitomo currently owns 43.96% of SML Isuzu's equity share capital, while Isuzu holds 15%. M&M does not currently hold any equity shares in the company. The transactions are not classified as related party transactions.",
            "Sentiment": "neutral",
            "PublishDate": 1753811515195,
            "Source": "order&deals"
        },
        {
            "Title": "SML Isuzu Reports 44% Jump in Net Profit to Rs 67 Crores in Q1",
            "Summary": "SML Isuzu Limited reported quarterly results with revenue from operations rising to Rs 845.89 crores compared to Rs 746.01 crores in the same quarter last year. Net profit increased to Rs 66.96 crores from Rs 46.39 crores year-over-year. Earnings per share stood at Rs 46.27 versus Rs 32.06 in the previous year quarter. The company operates primarily in commercial vehicle manufacturing. Mahindra & Mahindra has agreements to acquire stakes from Sumitomo Corporation and Isuzu Motors, with an open offer for additional shares at Rs 1,554.60 per share pending completion of conditions. The company addressed anonymous complaints regarding employee-dealer financial dealings, with an external review finding no substantiated evidence of financial impropriety or fraud.",
            "Sentiment": "positive",
            "PublishDate": 1753169715564,
            "Source": "earnings"
        },
        {
            "Title": "SML Isuzu to Review Q1 Results on July 22",
            "Summary": "SML Isuzu has announced that it will review its first quarter results on July 22. The company has scheduled a meeting to examine and discuss the financial performance for the most recent quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751983875000,
            "Source": "default"
        },
        {
            "Title": "SML Isuzu Reports Increase in June Sales",
            "Summary": "SML Isuzu has reported sales of 1,871 units in June, compared to 1,760 units in the same month last year, indicating a year-over-year increase in sales.",
            "Sentiment": "positive",
            "PublishDate": 1751350984000,
            "Source": "default"
        },
        {
            "Title": "SML ISUZU Reports May Sales Figures",
            "Summary": "SML ISUZU reported total sales of 1,543 units for May, compared to 1,563 units in the same period last year, showing a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1748849061000,
            "Source": "default"
        },
        {
            "Title": "SML ISUZU Reports Q4 Financial Results",
            "Summary": "SML ISUZU has released its Q4 financial results. The company's revenue increased to 7.7 billion rupees from 6.8 billion rupees year-over-year. EBITDA rose to 904 million rupees from 712 million rupees, with the EBITDA margin improving to 11.72% from 10.5%. Net profit slightly increased to 530 million rupees from 523 million rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748594268000,
            "Source": "result"
        },
        {
            "Title": "SML Isuzu Reports 43% Increase in April Sales",
            "Summary": "SML Isuzu has reported total sales of 1,512 units in April, compared to 1,056 units in the same month last year, representing a year-over-year increase of 43%.",
            "Sentiment": "positive",
            "PublishDate": 1746144579000,
            "Source": "default"
        },
        {
            "Title": "SML ISUZU Reports 43% Increase in April Sales",
            "Summary": "SML ISUZU announced that its total sales for April reached 1,512 units, compared to 1,056 units in the same month last year, representing a year-over-year increase of 43%.",
            "Sentiment": "positive",
            "PublishDate": 1746089821000,
            "Source": "default"
        },
        {
            "Title": "SML ISUZU Announces New Managing Director and CEO",
            "Summary": "SML ISUZU has announced that Yasushi Nishikawa will join the company as Managing Director and CEO, effective April 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1744808177000,
            "Source": "default"
        },
        {
            "Title": "SML ISUZU Reports Increase in March Sales",
            "Summary": "SML ISUZU announced total sales of 2,315 units for March, compared to 1,868 units in the same month last year, representing a year-over-year increase.",
            "Sentiment": "positive",
            "PublishDate": 1743495779000,
            "Source": "result"
        },
        {
            "Title": "Ashok Leyland Denies Reports of Acquiring Stake in SML Isuzu",
            "Summary": "Ashok Leyland has refuted reports suggesting that it is acquiring the promoter's stake in SML Isuzu. The company has stated that these acquisition reports are factually incorrect, emphasizing the inaccuracy of the circulating information.",
            "Sentiment": "neutral",
            "PublishDate": 1742978806000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Ashok Leyland Considers Majority Stake Acquisition in SML Isuzu",
            "Summary": "According to a report in The Economic Times, Ashok Leyland is considering taking a majority stake in SML Isuzu. This potential acquisition could significantly change the ownership structure of SML Isuzu, a commercial vehicle manufacturer.",
            "Sentiment": "neutral",
            "PublishDate": 1742963094000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra & Mahindra Potential Acquisition of Promoter Stake in SML Isuzu",
            "Summary": "According to CNBC Awaz, Mahindra & Mahindra (M&M) has the opportunity to acquire the promoter stake in SML Isuzu. This news suggests a potential significant corporate action involving two major players in the automotive industry.",
            "Sentiment": "neutral",
            "PublishDate": 1742798297000,
            "Source": "corporate_action"
        },
        {
            "Title": "Mahindra & Mahindra to Acquire Promoter Stake in SML Isuzu",
            "Summary": "Mahindra & Mahindra (M&M) is reportedly planning to purchase the promoter stake in SML Isuzu, according to CNBC Awaaz. This acquisition would represent a significant corporate action, potentially changing the ownership structure of SML Isuzu.",
            "Sentiment": "neutral",
            "PublishDate": 1742798296000,
            "Source": "corporate_action"
        },
        {
            "Title": "SML ISUZU Secures 24 Crore Rupee Order for Troop Carriers",
            "Summary": "SML ISUZU has won an order worth 24 crore rupees for the supply of BS VI compliant, 4-wheel drive troop carriers with 20 seats. This order represents a significant business opportunity for the company in the defense sector.",
            "Sentiment": "positive",
            "PublishDate": 1741760032000,
            "Source": "order&deals"
        },
        {
            "Title": "SML ISUZU Reports 27.5% Increase in February Sales",
            "Summary": "SML ISUZU, a commercial vehicle manufacturer, has reported total sales of 1,288 units in February, compared to 1,010 units in the same month last year. This represents a year-over-year increase of 27.5% in total sales.",
            "Sentiment": "positive",
            "PublishDate": 1740893773000,
            "Source": "result"
        },
        {
            "Title": "SML ISUZU Reports Decline in Q3 Profit and Revenue",
            "Summary": "SML ISUZU has reported a significant decrease in its third-quarter financial results. The company's net profit fell to 5 million rupees, down from 26 million rupees in the same quarter last year. Revenue also declined to 3.3 billion rupees from 3.9 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738915083000,
            "Source": "earnings"
        },
        {
            "Title": "SML ISUZU Reports Decline in Q3 EBITDA and Margin",
            "Summary": "SML ISUZU has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 180 million rupees from 218 million rupees in the same quarter last year. The EBITDA margin also saw a slight decline, dropping to 5.42% from 5.65% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738915073000,
            "Source": "earnings"
        },
        {
            "Title": "SML ISUZU Reports Decline in January Sales",
            "Summary": "SML ISUZU has reported total sales of 1,025 units for January, compared to 1,320 units in the same month of the previous year, indicating a year-over-year decrease in sales.",
            "Sentiment": "negative",
            "PublishDate": 1738394109000,
            "Source": "result"
        },
        {
            "Title": "SML ISUZU to Consider Q3 Results on February 7",
            "Summary": "SML ISUZU has announced that it will consider its third quarter (Q3) financial results on February 7. This indicates that the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the latest three-month period.",
            "Sentiment": "neutral",
            "PublishDate": 1737030990000,
            "Source": "result"
        },
        {
            "Title": "SML ISUZU Reports Decline in December Sales",
            "Summary": "SML ISUZU's total sales for December decreased to 626 units, compared to 946 units in the same month of the previous year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1735715934000,
            "Source": "result"
        },
        {
            "Title": "SML ISUZU Reports Decline in November Sales",
            "Summary": "SML ISUZU reported total sales of 539 units in November, compared to 647 units in the same month last year, representing a year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1733123064000,
            "Source": "result"
        },
        {
            "Title": "SML ISUZU Reports Improved Q2 EBITDA and Margin",
            "Summary": "SML ISUZU has announced its Q2 financial results, showing an increase in EBITDA to 447 million rupees from 382 million rupees year-over-year. The company's EBITDA margin also improved to 8.13% from 7.66% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1731310978000,
            "Source": "result"
        },
        {
            "Title": "SML ISUZU Reports Q2 Revenue Growth",
            "Summary": "SML ISUZU has announced its second quarter revenue, which increased to 5.5 billion rupees from 5 billion rupees in the same quarter last year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731310971000,
            "Source": "result"
        }
    ]
}