{
    "Symbol": "SMLT",
    "ISIN": "INE017W01010",
    "News": [
        {
            "Title": "Sarthak Metals Reports Q2 FY26 Results with Core Business Decline Offset by Welding Division Growth",
            "Summary": "Sarthak Metals experienced a 14% year-on-year decline in core wire business volumes during Q2 FY26 due to intense competition and low-cost steel imports, while its welding division achieved strong momentum with monthly volumes exceeding 100 tons. The company is diversifying beyond traditional steel products into welding consumables and biotechnology, with advanced discussions underway with ethanol distilleries for technology integration in a market opportunity exceeding ₹1,000 crores.",
            "Sentiment": "negative",
            "PublishDate": 1763103475847,
            "Source": "earnings"
        },
        {
            "Title": "Sarthak Metals Reports Quarterly Results and Proposes Business Diversification into Biotechnology",
            "Summary": "Sarthak Metals Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported total income of Rs 3647.93 lakhs for the quarter, with profit after tax of Rs 65.91 lakhs. The Board proposed re-appointment of Mr. Sunil Dutt Bhatt as Independent Director for a second five-year term from August 2026 to August 2031. Additionally, the company seeks to amend its main object clause to include biotechnology business activities, including research, development, manufacture, and trading of biotechnological products, enzymes, bio-based chemicals, pharmaceuticals, and related products. Both proposals require shareholder approval through postal ballot, with e-voting scheduled from November 13 to December 12, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762930784772,
            "Source": "corporate_action"
        },
        {
            "Title": "Sarthak Metals CFO Anirudh Singhal Resigns Effective July 31, 2025",
            "Summary": "Anirudh Singhal has resigned from his position as Chief Financial Officer and Key Managerial Personnel of Sarthak Metals Limited, with his resignation taking effect from the close of business hours on July 31, 2025. The company acknowledged his contributions during his tenure and stated there were no material reasons provided for his resignation. The disclosure was delayed because the company initially received only an email notification without an attached formal resignation letter. Sarthak Metals expressed appreciation for Singhal's services and contribution during his time as CFO.",
            "Sentiment": "neutral",
            "PublishDate": 1755320729920,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sarthak Metals Reports Quarterly Results and CFO Transition",
            "Summary": "Sarthak Metals Limited announced its unaudited financial results for the quarter ended June 30, 2025. The company reported revenue from operations of Rs 4,622.44 lakhs and profit for the period of Rs 106.05 lakhs, with earnings per share of Rs 0.77. The company underwent a leadership change with Mr. Anirudh Singhal resigning as CFO effective July 31, 2025, to focus on his personal project. Mr. Narendra Dewangan was appointed as the new CFO from August 1, 2025. Dewangan brings over 35 years of experience in accountancy, finance, and taxation, and has been associated with the Deshraj Bansal Group for more than 20 years. The Board expressed appreciation for Singhal's contributions and strategic leadership during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1755068796879,
            "Source": "earnings"
        },
        {
            "Title": "Sarthak Metals CFO Anirudh Singhal Resigns, Company Seeks Replacement",
            "Summary": "Anirudh Singhal has resigned from his position as Chief Financial Officer and Key Managerial Personnel at Sarthak Metals Limited, effective July 31, 2025. Singhal confirmed there are no material reasons for his resignation. The company expressed appreciation for his services and contribution during his tenure. Sarthak Metals is currently in the process of appointing a suitable replacement for the CFO position and will inform stock exchanges once the appointment is made.",
            "Sentiment": "neutral",
            "PublishDate": 1754101850046,
            "Source": "corporate_governance"
        }
    ]
}