{
    "Symbol": "SMSPHARMA",
    "ISIN": "INE812G01025",
    "News": [
        {
            "Title": "SMS Pharma Q3FY26 Results: Revenue Up 21% YoY",
            "Summary": "SMS Pharmaceuticals reported strong Q3FY26 performance with revenue of ₹210.45 crore (up 21% YoY), EBITDA growth of 31% YoY, and PAT increase of 29% YoY, driven by volume growth and operating leverage.",
            "Sentiment": "positive",
            "PublishDate": 1770646161132,
            "Source": "co_actions_results"
        },
        {
            "Title": "SMS Pharma Board Meet on Feb 7 for Q3FY26 Results",
            "Summary": "SMS Pharmaceuticals Limited has scheduled a board meeting on February 7, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from January 1-9, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769862002415,
            "Source": "co_actions_results"
        },
        {
            "Title": "SMS Pharma Increases SMS Peptides Stake to 99.99%",
            "Summary": "SMS Pharmaceuticals has significantly increased its ownership in SMS Peptides to 99.99% through a new share issuance, strengthening its control over the subsidiary company.",
            "Sentiment": "positive",
            "PublishDate": 1766757629029,
            "Source": "co_actions_results"
        },
        {
            "Title": "SMS Pharma Forms New Unit SMS Colab Pvt Ltd",
            "Summary": "SMS Pharmaceuticals has established a new subsidiary unit called SMS Colab Pvt Ltd, marking a strategic expansion in the company's organizational structure.",
            "Sentiment": "positive",
            "PublishDate": 1766557824117,
            "Source": "stocks"
        },
        {
            "Title": "SMS Pharmaceuticals Forms New Subsidiary SMSco Lab",
            "Summary": "SMS Pharmaceuticals incorporates wholly owned subsidiary SMSco Lab Private Limited with ₹15.00 lakh authorized capital to manufacture pharmaceutical products in new therapeutic categories.",
            "Sentiment": "positive",
            "PublishDate": 1766557545581,
            "Source": "co_actions_results"
        },
        {
            "Title": "SMS Pharma Clears USFDA Inspection at Vizag Plant",
            "Summary": "SMS Pharmaceuticals successfully completed USFDA inspection at its Vizag API manufacturing facility from December 08-12, 2025, with only one minor procedural observation in Form 483.",
            "Sentiment": "positive",
            "PublishDate": 1765550157284,
            "Source": "stocks"
        },
        {
            "Title": "SMS Pharmaceuticals Receives Credit Rating Upgrade from CARE Ratings",
            "Summary": "CARE Ratings reaffirmed SMS Pharmaceuticals' long-term bank facilities rating at CARE A with outlook revised from Stable to Positive, and upgraded short-term bank facilities from CARE A2 to CARE A1. The rating actions cover total facilities of Rs. 403.70 crore, with long-term facilities of Rs. 350.87 crore and short-term facilities of Rs. 52.83 crore.",
            "Sentiment": "positive",
            "PublishDate": 1764822850816,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Pharmaceuticals' Associate Company VKT Pharma Receives US FDA Approval for Reformulated Ranitidine",
            "Summary": "SMS Pharmaceuticals announced that its associate company VKT Pharma has received US FDA approval for reformulated Ranitidine tablets in 150mg and 300mg strengths, marking the re-entry of this acid-reducing medication into the US market after a five-year absence. The approval follows extensive safety testing and manufacturing improvements that address previous concerns regarding NDMA impurity formation, and is expected to increase patient access to this important medication.",
            "Sentiment": "positive",
            "PublishDate": 1764125806690,
            "Source": "stock"
        },
        {
            "Title": "SMS Pharmaceuticals Reports 80% PAT Growth in Q2 FY26, Driven by Backward Integration",
            "Summary": "SMS Pharmaceuticals delivered its highest-ever quarterly PAT of INR 25.3 crores with 80% year-on-year growth, supported by 23% revenue growth to INR 242.4 crores and EBITDA margins expanding to 20%. The strong performance was driven by backward integration projects worth INR 150 crores over 12-18 months, improved product mix optimization, and stabilized operations across key intermediates, with the company maintaining its FY26 targets of 20% growth and 20% EBITDA margin.",
            "Sentiment": "positive",
            "PublishDate": 1763042923203,
            "Source": "earnings"
        },
        {
            "Title": "SMS Pharmaceuticals Reports 80% YoY PAT Growth in Q2FY26 Driven by Backward Integration",
            "Summary": "SMS Pharmaceuticals Limited reported strong quarterly results with PAT growing 80% YoY to ₹25.32 crore, marking the highest quarterly profit on record. Revenue from operations increased 23% YoY to ₹242.43 crore, supported by higher volumes and market share gains across key APIs. Gross margins expanded 30% YoY due to backward integration initiatives. EBITDA margins improved to 20% in Q2FY26, up 54% YoY, aided by backward integration and operating leverage. For H1FY26, revenue reached ₹438.48 crore (21% YoY growth) with PAT at ₹45.80 crore (50% YoY growth). The company's ₹280 crore capacity expansion program remains on track for completion by November 2026. Management maintains guidance of 20% revenue growth and 20% EBITDA margins for FY26. Operating cash flows remained strong at ₹42.32 crore in H1FY26, supporting ongoing capex investments.",
            "Sentiment": "positive",
            "PublishDate": 1762811083918,
            "Source": "earnings"
        },
        {
            "Title": "SMS Pharmaceuticals Reports 10% Revenue Growth to ₹212Cr with Margin Recovery and Expansion Plans",
            "Summary": "SMS Pharmaceuticals reported quarterly revenue of ₹212 crores, representing a 10% year-over-year increase. The company achieved margin recovery at 18% and expects stronger growth driven by exports contributing 60% to revenue. SMS Pharmaceuticals is expanding capacity for oncology and antiviral APIs while investing ₹150 crores in capital expenditure for R&D and backward integration. The company plans to file over 15 Drug Master Files over the next two years to strengthen its presence in regulated markets.",
            "Sentiment": "positive",
            "PublishDate": 1762784643686,
            "Source": "earnings"
        },
        {
            "Title": "SMS Pharmaceuticals Reports Strong Q2 Performance with Revenue Growth and Warrant Conversions",
            "Summary": "SMS Pharmaceuticals Limited reported standalone revenue from operations of Rs. 24,242.95 lakhs for the quarter ended September 30, 2025, compared to Rs. 19,604.71 lakhs in the previous quarter. Net profit after tax increased to Rs. 2,514.30 lakhs from Rs. 1,820.75 lakhs quarter-on-quarter. The company completed conversion of all 90 lakh convertible warrants into equity shares during the period - 40 lakh warrants converted in March 2025 and remaining 50 lakh warrants in September 2025, raising total proceeds of Rs. 1,143 crores. For the half-year period, revenue reached Rs. 43,847.66 lakhs with net profit of Rs. 4,335.05 lakhs. The company paid a dividend of Rs. 0.40 per equity share aggregating to Rs. 354.61 lakhs. The Board approved both standalone and consolidated unaudited financial results for Q2 and H1 FY26. The company confirmed no deviation in utilization of preferential issue proceeds from stated objectives.",
            "Sentiment": "positive",
            "PublishDate": 1762593053599,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Pharma Reports Strong Q2 Performance with 79.7% Jump in Net Profit",
            "Summary": "SMS Pharma delivered robust quarterly results with consolidated net profit rising to 253.1 million rupees from 140.9 million rupees year-over-year. Revenue increased to 2.42 billion rupees compared to 1.97 billion rupees in the same period last year. EBITDA grew significantly to 483.6 million rupees from 314.6 million rupees, while EBITDA margin expanded to 19.95% from 15.99% year-over-year, indicating improved operational efficiency and profitability across the business.",
            "Sentiment": "positive",
            "PublishDate": 1762591751297,
            "Source": "earnings"
        },
        {
            "Title": "SMS Pharmaceuticals Lists 5 Crore Equity Shares from Warrant Conversion on BSE and NSE",
            "Summary": "SMS Pharmaceuticals Limited has received trading approval from BSE and NSE for 50,00,000 equity shares of Re. 1 each issued at a premium of Rs. 126 per share. The shares were allotted to promoters on a preferential basis pursuant to conversion of warrants. The equity shares are listed and admitted for trading on both exchanges with effect from November 7, 2025, bearing distinctive numbers from 88652031 to 93652030. The shares have a lock-in period until October 30, 2027.",
            "Sentiment": "positive",
            "PublishDate": 1762531690817,
            "Source": "corporate_action"
        },
        {
            "Title": "Vistra ITCL Releases 1.06 Crore Pledged Shares of SMS Pharmaceuticals",
            "Summary": "Vistra ITCL (India) Limited, acting as debenture trustee, released 1,06,20,000 equity shares of SMS Pharmaceuticals Limited from pledge on November 3, 2025. Following this release, Vistra's encumbered shareholding in SMS Pharmaceuticals decreased from 23.58% to 12.24% of the total share capital. The company's total equity share capital remains at 9,36,52,030 shares with a face value of Rs. 1 each. Vistra filed this disclosure under SEBI takeover regulations as a precautionary measure, noting that the primary compliance responsibility lies with the lender and debenture holder rather than the trustee.",
            "Sentiment": "neutral",
            "PublishDate": 1762400939277,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Pharmaceuticals Promoter Releases Pledge on 1.06 Crore Equity Shares",
            "Summary": "HimaBindu Potluri, a promoter of SMS Pharmaceuticals Limited, released pledge on 1,06,20,000 equity shares on November 3, 2025. The pledge release was related to security created against debentures issued by VKT Pharma Private Limited, an associate company. Following this release, Potluri's total shareholding remains at 1,50,08,840 shares (16.03% of total share capital), but pledged shares reduced from 1,36,20,000 to 30,00,000 shares. The company's total equity share capital stands at 9,36,52,030 equity shares of Rs. 1 each. The shares are listed on BSE Limited and National Stock Exchange of India Limited.",
            "Sentiment": "positive",
            "PublishDate": 1762301225012,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Pharmaceuticals Provides Non-Disposal Undertaking to Exim Bank for VKT Pharma Shares",
            "Summary": "SMS Pharmaceuticals' Board approved a change in security structure for its shareholding in associate company VKT Pharma Limited. The company will provide a Non-Disposal Undertaking to Exim Bank, pledging not to sell its 38,50,165 equity shares (34.83% stake) in VKT Pharma without prior consent. This arrangement supports VKT Pharma's Rs. 150 crore rupee term loan from Exim Bank to refinance existing Non-Convertible Debentures of Rs. 130 crores previously subscribed by Avendus Finance Private Limited. The existing security structure with Avendus Finance will be replaced with the undertaking to Exim Bank by November 30, 2025. SMS Pharmaceuticals' liability is limited to its shareholding extent, with an investment value of Rs. 45 crores. The transaction involves related parties as SMS Pharmaceuticals' Chairman & Managing Director and Executive Director hold directorships in VKT Pharma.",
            "Sentiment": "neutral",
            "PublishDate": 1760598207741,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Pharmaceuticals Promoters Convert 5 Crore Warrants Into Equity Shares",
            "Summary": "SMS Pharmaceuticals Limited disclosed that promoters Trilok Potluri and Vamsi Krishna Potluri converted 50 lakh warrants into equity shares through preferential allotment on September 10, 2025. Each promoter converted 25 lakh warrants into an equal number of equity shares. Following this conversion, the promoter group's total shareholding increased from 41.35% to 46.99% of the company's voting capital. The company's total equity share capital expanded from 8.87 crore shares to 9.37 crore shares, each with a face value of Re 1. The conversion was completed after receipt of the remaining balance amount for the warrants.",
            "Sentiment": "neutral",
            "PublishDate": 1757748884365,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Pharma Receives FDA Clearance for Hyderabad Laboratory Operations",
            "Summary": "SMS Pharma has received an Establishment Inspection Report (EIR) from the US FDA with 'No Action Indicated' status for its Central Laboratory Analytical Services facility in Hyderabad. This classification indicates that the FDA found no significant regulatory issues during its inspection of the laboratory facility.",
            "Sentiment": "positive",
            "PublishDate": 1756339863490,
            "Source": "stock"
        },
        {
            "Title": "SMS Pharma Receives Favorable USFDA Inspection Report for Hyderabad Laboratory",
            "Summary": "SMS Pharma received a USFDA Establishment Inspection Report (EIR) with \"No Action Indicated\" status for its Central Laboratory Analytical Services facility in Hyderabad. This classification indicates that the FDA found no significant regulatory violations during their inspection of the laboratory facility.",
            "Sentiment": "positive",
            "PublishDate": 1756209731237,
            "Source": "stock"
        },
        {
            "Title": "Vistra ITCL Acquires 3.38% Stake in SMS Pharmaceuticals Through Share Pledge",
            "Summary": "Vistra ITCL (India) Limited, acting as Debenture Trustee, acquired 30,00,000 shares of SMS Pharmaceuticals Limited through encumbrance or pledge on August 20, 2025. This acquisition represents 3.38% of SMS Pharmaceuticals' total share capital. Following this transaction, Vistra's total shareholding in SMS Pharmaceuticals increased from 21.53% to 24.91%. SMS Pharmaceuticals has an equity share capital of 8,86,52,030 shares with a face value of Rs. 1 each. The shares are listed on BSE Limited and National Stock Exchange of India Limited. Vistra clarified that while the primary compliance responsibility lies with the lender and debenture holder, they are making this disclosure as a precautionary measure in their capacity as security trustee and debenture trustee.",
            "Sentiment": "neutral",
            "PublishDate": 1756113514249,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Pharmaceuticals Reports Monitoring Agency Update on Rs 114.30 Crore Warrant Issue Proceeds",
            "Summary": "SMS Pharmaceuticals Limited submitted a monitoring agency report from CARE Ratings Limited regarding the utilization of proceeds from their preferential issue of convertible warrants for the quarter ended June 30, 2025. The company raised Rs 114.30 crore through a private placement of convertible share warrants issued between March 7-13, 2024. The funds were allocated for capital expenditure (Rs 62.87 crore), working capital (Rs 40.00 crore), and general corporate purposes (Rs 11.43 crore). As of June 2025, Rs 28.57 crore has been utilized with Rs 17.14 crore for capital expenditure and Rs 11.43 crore for working capital requirements. The company temporarily deployed Rs 38.10 crore towards working capital needs, including Rs 27.10 crore to repay working capital demand loans and Rs 10.41 crore for reducing outstanding working capital balances. CARE Ratings reported no deviations from the stated objects and confirmed all utilization was as per the offer document. The monitoring agency noted that any delay in raising balance funds may impact completion of proposed capital expenditure, though promoters are willing to infuse funds as required within the given timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1755177804793,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Pharmaceuticals Reports 24% PAT Growth in Q1FY26, Revenue Up 19% YoY",
            "Summary": "SMS Pharmaceuticals Limited reported strong quarterly results with revenue from operations rising 19% year-on-year to ₹196.05 crore, driven by higher volumes and strong demand for key APIs. PAT increased 24% YoY to ₹20.50 crore while maintaining a stable 10% PAT margin. EBITDA grew 17% YoY to ₹39.37 crore with margins steady at 20%. The anti-diabetic segment led growth with 45% YoY increase to ₹65.16 crore, while ARV products surged 199% to ₹38.48 crore. The company successfully commissioned its backward integration project for key APIs and expects margin improvements in coming quarters. SMS Pharma is executing a ₹250 crore capacity expansion program funded through internal accruals and debt, while doubling R&D investment over 18 months. The company targets 20% revenue growth for FY26 with EBITDA margins above 20%, aiming for around 30 regulatory submissions over the next three years.",
            "Sentiment": "positive",
            "PublishDate": 1755024671136,
            "Source": "earnings"
        },
        {
            "Title": "SMS Pharmaceuticals Reports 18.6% Revenue Growth in Q1 FY2026",
            "Summary": "SMS Pharmaceuticals Limited reported revenue of ₹196.64 crore in Q1 FY2026, marking an 18.6% increase from ₹165.82 crore in the same quarter last year. The pharmaceutical company, which manufactures active pharmaceutical ingredients and intermediates, posted net profit of ₹18.21 crore, up 11.5% from ₹16.33 crore in Q1 FY2025. EBITDA grew 9.5% to ₹23.86 crore from ₹21.78 crore. Earnings per share increased to ₹2.05 from ₹1.93. The revenue growth was driven by higher sales volumes and improved product mix, though EBITDA margin contracted to 12.1% from 13.1% due to input cost pressures. The company continues investing in R&D for complex APIs and exploring expansion in regulated markets including the US and Europe.",
            "Sentiment": "positive",
            "PublishDate": 1754892313751,
            "Source": "earnings"
        },
        {
            "Title": "SMS Pharma Targets 20% Revenue Growth for FY26 with Strong Margin Goals",
            "Summary": "SMS Pharma has outlined ambitious financial targets for FY26, aiming for 20% revenue growth alongside maintaining an EBITDA margin above 20% and achieving a 1X asset turnover ratio. The company positions these goals as placing it among industry leaders in the pharmaceutical sector.",
            "Sentiment": "positive",
            "PublishDate": 1754880147488,
            "Source": "stock"
        },
        {
            "Title": "SMS Pharmaceuticals Reports No Deviation in Preferential Issue Fund Utilization for June 2025 Quarter",
            "Summary": "SMS Pharmaceuticals Limited reported no deviation in the utilization of funds raised through a preferential issue of convertible warrants for the quarter ended June 30, 2025. The company had previously allotted 90,00,000 warrants on March 19, 2024, raising Rs. 1,14,30,00,000 at Rs. 127 per warrant. Out of these, 40,00,000 warrants were converted to equity shares on March 27, 2025, upon receipt of the balance 75% payment from two allottees. The funds were allocated for capital expenditure including production capacity expansion (Rs. 6,287 lakhs), working capital requirements (Rs. 4,000 lakhs), and general corporate purposes (Rs. 1,143 lakhs). As of June 30, 2025, Rs. 1,714 lakhs was utilized for capital expenditure and Rs. 4,953 lakhs for working capital, with Rs. 3,810 lakhs temporarily deployed during the quarter. M/s. CARE Ratings Limited serves as the monitoring agency.",
            "Sentiment": "neutral",
            "PublishDate": 1754728439288,
            "Source": "corporate_action"
        },
        {
            "Title": "SMS Pharma Reports Strong Q1 Results with 19% Revenue Growth, Sets AGM Date",
            "Summary": "SMS Pharmaceuticals delivered robust quarterly results with consolidated revenue growing 19.2% to Rs 196.05 crores and net profit surging 24.3% to Rs 20.49 crores. Standalone performance showed similar revenue growth of 19.2% with net profit increasing 11.5% to Rs 18.21 crores. EBITDA margins contracted slightly to 20.1% from 21.2% in the previous year. The company continues to focus on manufacturing Active Pharmaceutical Ingredients (APIs) and intermediates. The Board scheduled the 37th Annual General Meeting for September 29, 2025, via video conference and fixed the record date for dividend as September 22, 2025. Associate company VKT Pharma reported revenue of Rs 58.87 crores and net profit of Rs 5.10 crores, while newly incorporated subsidiary SMS Peptides recorded a net loss of Rs 0.12 crores with no revenue.",
            "Sentiment": "positive",
            "PublishDate": 1754727473771,
            "Source": "earnings"
        },
        {
            "Title": "SMS Pharmaceuticals Increases Stake in SMS Peptides",
            "Summary": "SMS Pharmaceuticals has increased its ownership in SMS Peptides from 93% to 99.98%. This represents a significant boost in the company's stake in its subsidiary.",
            "Sentiment": "positive",
            "PublishDate": 1751028666000,
            "Source": "default"
        },
        {
            "Title": "SMS Pharma Passes USFDA Inspection at Central Laboratory",
            "Summary": "SMS Pharma has announced a successful U.S. Food and Drug Administration (USFDA) inspection of its Central Laboratory Analytical Services. The inspection was completed without any observations, indicating full compliance with regulatory standards.",
            "Sentiment": "positive",
            "PublishDate": 1750852909000,
            "Source": "default"
        },
        {
            "Title": "SMS Pharma Receives FDA EIR for Hyderabad Facility",
            "Summary": "SMS Pharma has successfully closed an inspection by the US Food and Drug Administration (FDA) at its Hyderabad facility. The company received an Establishment Inspection Report (EIR) from the FDA, indicating the successful completion of the inspection.",
            "Sentiment": "positive",
            "PublishDate": 1748616837000,
            "Source": "default"
        },
        {
            "Title": "SMS Pharma Reports Q4 Financial Results",
            "Summary": "SMS Pharma has announced its Q4 financial results. The company's EBITDA increased to 408 million rupees from 336 million rupees year-over-year. The EBITDA margin improved to 16.45% from 13.68% in the same period. Consolidated net profit rose to 203 million rupees from 173 million rupees year-over-year and 182 million rupees quarter-over-quarter. Q4 revenue remained stable at 2.5 billion rupees compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1748608626000,
            "Source": "result"
        },
        {
            "Title": "SMS Pharma's Vizag Plant Receives WHO Prequalification",
            "Summary": "SMS Pharma has announced that its manufacturing facility in Visakhapatnam (Vizag) has received prequalification from the World Health Organization (WHO) in Geneva. This certification is a significant achievement for the company, as it validates the quality and safety standards of the plant's pharmaceutical production processes.",
            "Sentiment": "positive",
            "PublishDate": 1746166446000,
            "Source": "default"
        },
        {
            "Title": "SMS Pharmaceuticals Completes USFDA Inspection at Hyderabad API Facility",
            "Summary": "SMS Pharmaceuticals announced the completion of a USFDA inspection at its Active Pharmaceutical Ingredient (API) manufacturing facility in Hyderabad, Telangana. The inspection concluded with one observation noted in Form 483.",
            "Sentiment": "neutral",
            "PublishDate": 1742775291000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SMS Pharmaceuticals Completes USFDA Inspection at Hyderabad API Facility",
            "Summary": "SMS Pharmaceuticals has announced the completion of a USFDA inspection at its Active Pharmaceutical Ingredient (API) manufacturing facility in Hyderabad, Telangana. The inspection concluded with one observation noted in Form 483.",
            "Sentiment": "neutral",
            "PublishDate": 1742575056000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SMS Pharma Reports Improved Q3 EBITDA and Margin",
            "Summary": "SMS Pharma has announced its Q3 financial results, showing an increase in EBITDA from 289 million rupees to 333 million rupees year-over-year. The company's EBITDA margin also improved, rising from 17.80% to 19.21% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739350120000,
            "Source": "earnings"
        },
        {
            "Title": "SMS Pharmaceuticals Reports Q3 Net Profit Increase",
            "Summary": "SMS Pharmaceuticals has announced its financial results for the third quarter, reporting a net profit of 172 million rupees. This represents a significant increase from the 122 million rupees reported in the same quarter of the previous year, indicating a year-over-year growth in profitability.",
            "Sentiment": "positive",
            "PublishDate": 1739350006000,
            "Source": "earnings"
        },
        {
            "Title": "SMS Pharmaceuticals to Consider Q3 Results on February 12",
            "Summary": "SMS Pharmaceuticals has announced that it will consider its third quarter (Q3) financial results on February 12. This indicates that the company is preparing to review and potentially approve its quarterly financial performance for public disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1738761140000,
            "Source": "result"
        },
        {
            "Title": "SMS Pharma Reports Q2 EBITDA Growth",
            "Summary": "SMS Pharma has announced its Q2 financial results. The company's EBITDA increased to 315 million rupees from 278 million rupees year-over-year. However, the EBITDA margin decreased slightly to 15.99% from 16.69% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731072221000,
            "Source": "result"
        },
        {
            "Title": "SMS Pharma Reports Q2 Financial Results",
            "Summary": "SMS Pharma announced its Q2 consolidated financial results. The company reported a net profit of 139 million rupees, up from 120.4 million rupees year-over-year, but down from 164 million rupees quarter-over-quarter. Revenue for Q2 increased to 1.96 billion rupees from 1.66 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731072162000,
            "Source": "result"
        }
    ]
}