{
    "Symbol": "SNOWMAN",
    "ISIN": "INE734N01019",
    "News": [
        {
            "Title": "Snowman Logistics Declares Rs. 0.50 Interim Dividend",
            "Summary": "Snowman Logistics announces first interim dividend of Rs. 0.50 per equity share for FY 2025-26, with record date set for February 12, 2026. Board approved dividend at meeting held February 06, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1770362749382,
            "Source": "co_actions_results"
        },
        {
            "Title": "Snowman Logistics Board Meet on Feb 6 for Q3 Results",
            "Summary": "Snowman Logistics schedules board meeting on February 06, 2026 to approve Q3FY26 unaudited financial results and consider first interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1770038436968,
            "Source": "co_actions_results"
        },
        {
            "Title": "Gateway Distriparks and Snowman Logistics Report Mixed Q2 FY26 Results with Rail Growth Offset by Transportation Challenges",
            "Summary": "Gateway Distriparks reported rail EBITDA per TEU of INR 9,300 and CFS EBITDA per TEU of INR 1,000 for Q2 FY26. The company expects 10-15% volume growth over the next 2-3 years from existing locations, driven by trade deals with UK, EU, and US. Double stack percentage increased from 39% to 41% quarter-over-quarter. However, CFS margins were impacted by one-off legal costs, repair expenses, and a dip in exports due to US tariffs. The company has commenced domestic services from Ankleshwar, targeting 1,000+ TEUs monthly within two years. Snowman Logistics faced challenges in its transportation segment, with PBT margins dropping to breakeven levels due to realignment of the business model and removal of low-margin operations. The warehousing segment maintained INR 60 crores revenue but saw PBT margins decline from 12% to 3% due to reduced capacity utilization, weather-related power cuts increasing diesel consumption, and stress in seafood warehouses. Management expects positive traction from December onwards and aims to restore transportation margins to high single-digit PBT levels.",
            "Sentiment": "neutral",
            "PublishDate": 1762914361225,
            "Source": "earnings"
        },
        {
            "Title": "Snowman Logistics Reports Q2 Net Loss of 29M Rupees Despite Revenue Growth",
            "Summary": "Snowman Logistics reported a net loss of 29 million rupees in Q2, compared to a profit of 6 million rupees in the same period last year. The company's revenue increased to 1.56 billion rupees from 1.4 billion rupees year-over-year. However, EBITDA declined to 200 million rupees from 220 million rupees, with EBITDA margin dropping to 12.84% from 15.36% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762240260397,
            "Source": "earnings"
        },
        {
            "Title": "Snowman Logistics to Build New Temperature-Controlled Warehouse in Pune",
            "Summary": "Snowman Logistics will construct a new temperature-controlled warehouse facility in Pune through a built-to-suit agreement. The company is set to begin construction of this cold storage infrastructure project.",
            "Sentiment": "positive",
            "PublishDate": 1759808091985,
            "Source": "stock"
        },
        {
            "Title": "Snowman Logistics Appoints Raghav Garg as CFO Following Balakrishna N's Resignation",
            "Summary": "Snowman Logistics Limited announced a change in its Chief Financial Officer position on August 25, 2025. Balakrishna N resigned from his role as CFO and Key Managerial Personnel due to personal reasons, specifically to relocate back to his family in Bangalore. The company simultaneously appointed Raghav Garg as the new CFO and Key Managerial Personnel, effective immediately. Balakrishna N will continue with the organization during his notice period until September 5, 2025. Raghav Garg brings over 19 years of experience across textiles, packaging, FMCG, and recycling industries. He is a Chartered Accountant and B.Com (Honours) graduate from Punjab University, with expertise in finance strategy, financial planning, audits, risk management, treasury, and taxation. He has previously served as CFO at IDVB Recycling operations, Pearl Global Industries, Trident Limited, and Umang Dairies Limited. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation.",
            "Sentiment": "neutral",
            "PublishDate": 1756115639356,
            "Source": "corporate_governance"
        },
        {
            "Title": "Gateway Distriparks and Snowman Logistics Report Strong Q1 Performance Despite Operational Challenges",
            "Summary": "Gateway Distriparks and Snowman Logistics held their quarterly earnings conference call discussing performance improvements compared to the previous year, largely due to the absence of Red Sea disruptions that impacted the prior period. Gateway's rail business achieved EBITDA of INR9,100 per TEU, though slightly down due to higher empty container movements and reduced double stacking at 39%. The CFS business showed improvement with EBITDA of INR1,500 per TEU. The company maintains market shares of 16-17% in NCR, 27% in Ludhiana, and 37% in Uttarakhand. Management expects margins to recover to INR9,500 per TEU with improved trade balance and targets double-digit volume growth for the year. Snowman continues expanding capacity in Calcutta, Krishnapatnam, and Kundli, with plans for 5-6 new facilities over three years and targeting over 200,000 pallets capacity. The company achieved 5-7% price increases across segments and is expanding its 5PL services with clients including IKEA, Tim Hortons, and Kopi Kenangan on a pan-India basis.",
            "Sentiment": "positive",
            "PublishDate": 1754378448089,
            "Source": "earnings"
        },
        {
            "Title": "Snowman Logistics Reports 16% Revenue Growth to ₹162.7 Crore in Q1FY26",
            "Summary": "Snowman Logistics achieved revenue of ₹162.7 crore in Q1FY26, marking a 16% year-on-year growth from ₹140.2 crore in Q1FY25. The company expanded its cold chain infrastructure by commissioning two temperature-controlled facilities in Kolkata and Krishnapatnam, adding 9,557 pallet positions to reach a total capacity of 1,50,754 pallets across 43 warehouses in 20 cities. The warehousing services segment grew 6.2% year-on-year, while the trading and distribution vertical registered strong 46.2% growth. However, the transportation segment experienced a decline due to customer mix changes. EBITDA increased to ₹25.1 crore from ₹24.2 crore, though margins compressed to 15.3% from 17.2%. Net profit rose to ₹2.5 crore from ₹1.8 crore. The company added high-quality clients including Unilever and Kopi Kenangan as part of its 5PL model expansion.",
            "Sentiment": "positive",
            "PublishDate": 1753770878677,
            "Source": "earnings"
        },
        {
            "Title": "Snowman Logistics Reports 39% Jump in Q1 Net Profit to Rs 25 Million",
            "Summary": "Snowman Logistics reported a net profit of Rs 25 million in Q1, up from Rs 18 million in the same period last year. The company's revenue increased to Rs 1.6 billion from Rs 1.4 billion year-over-year. EBITDA rose to Rs 243 million from Rs 234 million, though the EBITDA margin declined to 14.96% from 16.72% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1753689611800,
            "Source": "earnings"
        },
        {
            "Title": "Snowman Logistics Schedules Board Meeting to Review Q1 Results on July 28",
            "Summary": "Snowman Logistics has announced that its board will convene on July 28 to review the company's Q1 results. The meeting represents a scheduled review of the company's quarterly financial performance.",
            "Sentiment": "neutral",
            "PublishDate": 1753113723681,
            "Source": "corporate_action"
        },
        {
            "Title": "Snowman Logistics Expands Capacity with New Long-Term Lease",
            "Summary": "Snowman Logistics has expanded its storage capacity by adding 3,576 pallet positions through a new long-term lease agreement. This addition brings the company's total capacity to 154,330 pallets across 44 warehouses located in 21 cities.",
            "Sentiment": "positive",
            "PublishDate": 1751947415000,
            "Source": "default"
        },
        {
            "Title": "Snowman Logistics Opens New Facility in Kundli",
            "Summary": "Snowman Logistics has expanded its operations by opening a new facility in Kundli. This strategic move aims to enhance the company's logistics capabilities and extend its reach in the region.",
            "Sentiment": "positive",
            "PublishDate": 1751947360000,
            "Source": "default"
        },
        {
            "Title": "Snowman Logistics Expands Network with Two New Temperature-Controlled Warehouses",
            "Summary": "Snowman Logistics has expanded its network by adding two new temperature-controlled warehouses. This expansion increases the company's operational capacity and geographical reach.",
            "Sentiment": "positive",
            "PublishDate": 1750824201000,
            "Source": "default"
        },
        {
            "Title": "Snowman Logistics Plans Capacity Expansion",
            "Summary": "Snowman Logistics aims to expand its capacity by an additional 10,000–15,000 pallets in FY'26. This expansion is expected to potentially increase the company's annual revenue by approximately 10%.",
            "Sentiment": "positive",
            "PublishDate": 1748327340000,
            "Source": "default"
        },
        {
            "Title": "Snowman Logistics Reports Q4 Financial Results",
            "Summary": "Snowman Logistics has released its Q4 financial results. The company's EBITDA decreased to 240.5 million rupees from 270 million rupees year-over-year. EBITDA margin declined to 17.55% from 21.33% year-over-year. Revenue increased to 1.37 billion rupees from 1.27 billion rupees year-over-year. Net profit rose to 39 million rupees from 21.5 million rupees year-over-year, but decreased from a loss of 6.1 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748262159000,
            "Source": "result"
        },
        {
            "Title": "Snowman Logistics Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Snowman Logistics experienced a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 198 million rupees from 263 million rupees in the same quarter of the previous year. Additionally, the EBITDA margin dropped to 14.98% from 21.32% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738570388000,
            "Source": "earnings"
        },
        {
            "Title": "Snowman Logistics Reports Q3 Net Loss of 6 Million Rupees",
            "Summary": "Snowman Logistics has reported a net loss of 6 million rupees for the third quarter, compared to a profit of 42 million rupees in the same period last year. This represents a significant year-over-year decline in the company's financial performance.",
            "Sentiment": "negative",
            "PublishDate": 1738570335000,
            "Source": "earnings"
        },
        {
            "Title": "Gateway Distriparks Increases Stake in Snowman Logistics to 50.01%",
            "Summary": "Gateway Distriparks Limited (GDL) has acquired an additional 16,65,284 shares of Snowman Logistics, increasing its stake to 50.01%. As a result of this acquisition, Snowman Logistics has now become a subsidiary company of GDL.",
            "Sentiment": "neutral",
            "PublishDate": 1735270067000,
            "Source": "corporate_action"
        },
        {
            "Title": "Snowman Logistics Reports Q2 EBITDA Decline",
            "Summary": "Snowman Logistics reported a decrease in Q2 EBITDA to 220 million rupees, down from 240 million rupees year-over-year. The company's EBITDA margin also declined to 15.36% from 19.35% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731308413000,
            "Source": "result"
        },
        {
            "Title": "Snowman Logistics Reports Q2 Financial Results",
            "Summary": "Snowman Logistics announced its Q2 financial results. The company's net profit decreased to 6 million rupees from 29 million rupees year-over-year. However, revenue increased to 1.4 billion rupees from 1.24 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731308292000,
            "Source": "result"
        }
    ]
}