{
    "Symbol": "SOBHA",
    "ISIN": "INE671H01015",
    "News": [
        {
            "Title": "Sobha Q3 bookings surge 52% YoY to ₹21.2b",
            "Summary": "Motilal Oswal maintains BUY rating on Sobha with target price of ₹1,825, citing strong booking growth driven by Bangalore projects. Company achieved ₹21.2b total bookings in Q3.",
            "Sentiment": "positive",
            "PublishDate": 1768982391543,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sobha Expects Stronger Q4 Profits With ₹500 Cr Revenue",
            "Summary": "Sobha Ltd anticipates stronger Q4 profits with ₹500 crores revenue from Q3 delays and projects net margins of 18-19% for 12-15 months projects, 24% for longer projects.",
            "Sentiment": "positive",
            "PublishDate": 1768796570921,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sobha Expects 5.2-5.3M Sq Ft Completion in FY26",
            "Summary": "Sobha Ltd expects to complete 5.2-5.3 million sq ft in FY26, marking 16-17% growth from last year's 4.54 million sq ft, with Q4 completion target of 1.5-1.7 million sq ft.",
            "Sentiment": "positive",
            "PublishDate": 1768796524249,
            "Source": "stocks"
        },
        {
            "Title": "Sobha Q3 FY26: Record Sales but Profit Drops 29%",
            "Summary": "Sobha Limited reports record Q3 FY26 sales of ₹2,115 crores with 52% YoY growth, but profit declines 29% to ₹15.4 crores. Company increases construction costs and land investments of ₹240 crores in Q3.",
            "Sentiment": "neutral",
            "PublishDate": 1768571245603,
            "Source": "co_actions_results"
        },
        {
            "Title": "SOBHA Rights Issue Proceeds Monitoring Report Q3FY26",
            "Summary": "SOBHA Limited's monitoring agency ICRA reports no deviation in ₹1,984.25 crore rights issue proceeds utilization for Q3FY26, with ₹252.74 crore remaining unutilized and invested in fixed deposits.",
            "Sentiment": "neutral",
            "PublishDate": 1768570543528,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sobha Files Rights Issue Fund Utilization Report",
            "Summary": "Sobha Limited filed Statement of Deviation for Q3FY26 under Regulation 32, showing ₹1,744.55 crores utilized out of ₹1,999.03 crores raised through rights issue in July 2024.",
            "Sentiment": "neutral",
            "PublishDate": 1768566578087,
            "Source": "co_actions_results"
        },
        {
            "Title": "SOBHA Q3FY26: EBITDA Falls 42.3% to ₹388M, Margin Drops",
            "Summary": "SOBHA Limited's Q3FY26 EBITDA declined 42.3% YoY to ₹388 million with margin compression to 4.11% from 5.5%. Revenue fell 22.8% despite strong nine-month growth of 21.1%.",
            "Sentiment": "negative",
            "PublishDate": 1768565599125,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sobha Limited Q3FY26 Results Call on Jan 17",
            "Summary": "Sobha Limited has scheduled a conference call with analysts and institutional investors on January 17, 2026 at 4:00 PM IST to discuss Q3FY26 operational and financial performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768307859137,
            "Source": "co_actions_results"
        },
        {
            "Title": "SOBHA Records ₹60.97 Billion Sales, Expands to 13 Cities",
            "Summary": "Real estate developer SOBHA achieves record sales of ₹60.97 billion with 37.3% growth in 9M-FY25 while expanding operations to 13 cities across India, marking significant business expansion.",
            "Sentiment": "positive",
            "PublishDate": 1767584371597,
            "Source": "stocks"
        },
        {
            "Title": "SOBHA achieves record Q3 sales of ₹2,115 crore",
            "Summary": "SOBHA Ltd reports highest quarterly real estate sales of ₹2,115 crore in Q3 FY26, up 52.3% YoY. Bengaluru leads with ₹1,512 crore contribution while company enters Mumbai market.",
            "Sentiment": "positive",
            "PublishDate": 1767449672850,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sobha Reports Rs 13,000 Crore Unsold Inventory, Plans Major Project Launches",
            "Summary": "Sobha Ltd holds unsold inventories worth Rs 13,000 crore across 10 million sq ft in existing projects. The company plans to launch 15 new projects covering 16.7 million sq ft across nine cities including Bengaluru, Mumbai, Delhi-NCR, Pune, and Chennai over the next 4-6 quarters, with estimated revenue potential of Rs 22,000 crore. Sobha targets Rs 8,500 crore in pre-sales for 2025-26, representing over 30% growth. The company achieved record sales bookings of Rs 3,981.4 crore in the first half, up 30% year-over-year. Quarterly results showed sales bookings of Rs 1,902.6 crore, a 61% increase, while net profit nearly tripled to Rs 72.52 crore. Total income rose to Rs 1,469.3 crore from Rs 965.29 crore. The company has Rs 18,000 crore in unrecognised revenue from completed sales.",
            "Sentiment": "positive",
            "PublishDate": 1761474180938,
            "Source": "stock"
        },
        {
            "Title": "SOBHA Limited Reports Strong Q2 Performance with Record Collections Despite Margin Pressures",
            "Summary": "SOBHA Limited reported strong quarterly results with record collections of INR2,046 crores, marking the first time crossing the INR2,000 crores milestone. Real estate sales value reached INR3,981 crores in the first half, up 30% year-over-year, supported by 1,576 homes sold across 2.84 million square feet. The company maintained a net cash position of INR751 crores and generated net operational cash flow of INR909 crores for the half-year period. However, EBITDA margins remained under pressure at 10.7% for Q2 and 9.7% for H1, with PAT margins at 4.9% and 3.6% respectively. The company took a provision of INR27 crores for ground rent demands from Bangalore authorities. SOBHA plans to launch 8-9 million square feet across 7-8 projects in the second half, including the upcoming Sobha Magnus project in South Bangalore. Management expects significant margin improvement from next financial year as higher-margin projects reach completion, with unrecognized revenue of INR18,000 crores from sold units providing future cash flow visibility.",
            "Sentiment": "positive",
            "PublishDate": 1761131036543,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Sets INR 8,500 Crore Sales Target for FY26, Plans Margin Expansion to 30% by FY27",
            "Summary": "Sobha has confirmed a sales target of INR 8,500 crores for FY26, with management expressing hopes to exceed this figure. The company aims to increase its gross margins from the current 20% to 30% by FY27, though exact estimates for this margin expansion are still pending.",
            "Sentiment": "positive",
            "PublishDate": 1760930268302,
            "Source": "stock"
        },
        {
            "Title": "Sobha Limited Reports Record H1 FY26 Performance with ₹39.81 Bn Sales and Net Cash Position",
            "Summary": "Sobha Limited achieved its highest ever half-year sales value of ₹39.81 billion in H1 FY26, representing a 30% increase compared to the previous year. The company sold 2.84 million square feet of saleable area with an average price realization of ₹14,028 per square foot. Total revenue grew 45% to ₹23.71 billion, with real estate revenue contributing ₹18.89 billion. The company generated record operational cash inflows of ₹38.24 billion and maintained a net cash position of ₹7.51 billion with gross debt of ₹10.10 billion. EBITDA increased 19% to ₹2.31 billion with a margin of 9.7%, while profit after tax grew 168% to ₹861 million. Sobha completed 1,185 homes spanning 2.25 million square feet and launched 3 new projects across 2 cities. The company expanded its operations to 12 cities with the addition of Greater Noida and received credit rating upgrades, with Ind-RA upgrading outlook to positive.",
            "Sentiment": "positive",
            "PublishDate": 1760703071939,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Limited Reports Strong Q2 Performance with 305% Jump in Quarterly Profit",
            "Summary": "Sobha Limited's Board approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported standalone profit of ₹1,037.66 million for Q2 FY2026, representing a significant increase from ₹256.00 million in the corresponding quarter of the previous year. Revenue from operations reached ₹14,833.70 million compared to ₹9,121.71 million in Q2 FY2025. For the half year, profit stood at ₹1,496.47 million versus ₹346.38 million in the previous year. Basic earnings per share for the quarter was ₹9.70 compared to ₹2.55 in the same quarter last year. The company paid a final dividend of ₹3 per equity share for FY2025. The results include ongoing legal proceedings related to land parcels worth ₹2,016.05 million under provisional attachment by the Enforcement Directorate and Income Tax Department demands totaling ₹672 million, against which the company has filed appeals.",
            "Sentiment": "positive",
            "PublishDate": 1760699866286,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Reports Record H1 Sales Value of Rs 3,981 Crore with 30.4% Growth",
            "Summary": "Sobha achieved its highest-ever half-yearly sales value of Rs 3,981 crore in H1 FY26, marking a 30.4% increase compared to H1 FY25. The company's total sales value reached Rs 1,902.6 crore, showing a 61.44% year-on-year growth but declining 8.5% quarter-on-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1759709609116,
            "Source": "stock"
        },
        {
            "Title": "Sobha Reports 61% Jump in Q2 Sales to ₹1,903 Crore, Achieves Record H1 Sales",
            "Summary": "Sobha Ltd reported total sales value of ₹1,902.6 crore for Q2 FY26, marking a 61.4% year-on-year increase but declining 8.5% sequentially. The company's share of sales value reached ₹1,537 crore, up 56.3% annually. New sales area stood at 1.39 million square feet with average price realization improving to ₹13,648 per square foot. Bengaluru contributed 69.7% of quarterly sales at ₹1,326.4 crore, while NCR accounted for ₹309.7 crore and Kerala added ₹184.8 crore. For H1 FY26, Sobha achieved record sales value of ₹3,981.4 crore, up 30.4% year-on-year. The company completed 1.18 million square feet of saleable area and delivered 591 homes across multiple projects. Sobha also launched an extension of Sobha Lifestyle villa project in North Bangalore. Company shares closed at ₹1,470.45, down 3.04%.",
            "Sentiment": "positive",
            "PublishDate": 1759563401556,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Ltd Sees Block Trade Worth Rs. 72.50 Crores on NSE",
            "Summary": "Sobha Ltd witnessed a block trade on the National Stock Exchange involving approximately 500,086 shares at a price of Rs. 1,449.70 per share. The total transaction value amounted to Rs. 72.50 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1756964989537,
            "Source": "order&deals"
        },
        {
            "Title": "SOBHA Limited Reports Record Q1 FY26 Sales of INR 2,079 Crores, Driven by Greater Noida Launch",
            "Summary": "SOBHA Limited achieved its highest ever quarterly real estate sales of INR 2,078.8 crores in Q1 FY26, marking the first time the company crossed INR 2,000 crores in a quarter. The strong performance was driven by the successful launch of Sobha Aurum in Greater Noida, which sold 80% of its inventory and contributed INR 833 crores to sales. Total sales were supported by 1.44 million square feet sold across operational markets at an average realization of INR 14,395 per square feet. The company launched two projects totaling 1.62 million square feet during the quarter. However, margins were impacted as five Bangalore projects faced delays in obtaining Occupancy Certificates, preventing recognition of INR 650 crores in revenue and INR 150 crores in PBT. Total income reached INR 901 crores with EBITDA of INR 73 crores (8.1% margin) and PAT of INR 13.6 crores (1.5% margin). Collections hit a record INR 1,778 crores, up 15% from Q1 FY25. The company maintains strong liquidity with INR 1,706 crores cash against INR 1,019 crores gross debt. SOBHA has INR 17,245 crores in unrecognized revenue from sold units and plans to launch 7-8 million square feet worth approximately INR 10,000 crores in the remaining nine months.",
            "Sentiment": "positive",
            "PublishDate": 1753869997080,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Ltd Reports 123% Jump in Q1 Profit, Achieves Record Quarterly Sales of Rs 2,079 Crore",
            "Summary": "Sobha Ltd reported strong quarterly results with profit after tax surging 123% to Rs 13 crore compared to the previous year. Revenue increased 35% to Rs 901 crore for the quarter. The real estate developer achieved record quarterly sales of Rs 2,079 crore, crossing the Rs 2,000 crore milestone for the first time, representing an 11% increase year-on-year. Total collections rose 15% to Rs 1,778 crore. The company maintained a strong financial position with negative net debt of Rs 687 crore and a Net Debt-to-Equity ratio of -0.15. Operationally, new area sold increased 23% to 1.44 million square feet with average price realization of Rs 14,395 per square foot. Managing Director Jagadish Nangineni attributed the performance to robust demand across key cities and highlighted the successful launch of the company's first project in Greater Noida. Sobha shares closed 1% lower at Rs 1,612.65 ahead of the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1753674635814,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Plans 8 Million Square Feet Project Launch with Rs 10,000 Crore Sales Target",
            "Summary": "Sobha expects to launch 8 million square feet of projects over the next 9 months, anticipating sales potential of approximately Rs 10,000 crore. The company projects that half of this sales potential will come from new launches and the remaining half from existing inventory. Additionally, Sobha aims to achieve a 10% increase in operating cash flow for FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753674113012,
            "Source": "stock"
        },
        {
            "Title": "Sobha Targets ₹10,000 Crore Sales with 30% Pre-Sales Growth Projection",
            "Summary": "Real estate developer Sobha expects a 30% increase in pre-sales compared to the previous fiscal year. The company has set an ambitious target of achieving ₹10,000 crore in sales for the upcoming year, indicating strong growth expectations in its residential projects business.",
            "Sentiment": "positive",
            "PublishDate": 1753673743581,
            "Source": "stock"
        },
        {
            "Title": "Sobha Targets Over ₹7,000 Crore Annual Sales Through ₹16,500 Crore Launch Pipeline",
            "Summary": "Sobha has outlined strategic goals to achieve annual sales exceeding ₹7,000 crore while maintaining double-digit margins and reducing debt. The company plans to accomplish these objectives through a ₹16,500 crore launch pipeline, premiumization strategy, and strengthening its leadership position in South India.",
            "Sentiment": "positive",
            "PublishDate": 1753458835830,
            "Source": "stock"
        },
        {
            "Title": "Sobha Limited Reports Record Q1 FY26 Sales of Rs 2,079 Crore, Net Profit Surges 123%",
            "Summary": "Sobha Limited achieved its highest-ever quarterly real estate sales value of Rs 20.79 billion in Q1 FY26, crossing the Rs 2,000 crore milestone for the first time with an 11% year-over-year increase. Net profit jumped 123% to Rs 0.13 billion, while revenue grew 35% to Rs 9.01 billion. The company sold 1.44 million sq. ft. of new area, up 23% year-over-year, with average price realization at Rs 14,395 per sq. ft. Collections increased 15% to Rs 17.78 billion. Net debt reduced to -6.87 billion, resulting in a Net Debt-to-Equity ratio of -0.15. The company launched its first project in Greater Noida and attributed the performance to strong demand across cities and its backward integrated delivery model.",
            "Sentiment": "positive",
            "PublishDate": 1753451518545,
            "Source": "earnings"
        },
        {
            "Title": "SOBHA Limited Reports Fund Utilization Status for Rights Issue Proceeds",
            "Summary": "SOBHA Limited has submitted its quarterly statement on the utilization of funds raised through a Rights Issue for the quarter ended June 30, 2025. The company raised INR 1,999.03 crore through the Rights Issue dated July 11, 2024, and has received INR 1,996.70 crore as of June 30, 2025. Out of the received amount, SOBHA has utilized INR 1,686.52 crore towards the stated objectives, leaving INR 310.18 crore unutilized. The funds were allocated across four main objectives: repayment of borrowings (INR 905.00 crore allocated, none utilized), funding project-related expenses for ongoing and forthcoming projects (INR 212.36 crore allocated, INR 107.31 crore utilized), purchase of equipment and machinery (INR 210.03 crore allocated, INR 29.49 crore utilized), and funding acquisition of land parcels and general corporate purposes (INR 658.59 crore allocated, INR 632.09 crore utilized). The company also allocated INR 13.05 crore for issue-related expenses, of which INR 12.63 crore has been utilized. The statement indicates no deviation from the original objects stated in the Letter of Offer dated June 12, 2024, and the utilization has been reviewed by the Audit Committee. ICRA Limited serves as the monitoring agency for the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1753450869253,
            "Source": "corporate_action"
        },
        {
            "Title": "Sobha Limited Reports No Deviation in Rights Issue Fund Utilization for Q1 FY2026",
            "Summary": "Sobha Limited submitted its monitoring agency report for Q1 FY2026, prepared by ICRA Limited, confirming no deviation in the utilization of proceeds from the company's Rights Issue. The report covers the utilization of Rs 1,983.64 crore from the Rights Issue that was conducted from June 28 to July 4, 2024. The funds were allocated across five main objectives: Rs 905 crore for repayment of borrowings (fully utilized), Rs 212.36 crore for project-related expenses (Rs 105.05 crore unutilized), Rs 210.03 crore for equipment and machinery purchase (Rs 180.54 crore unutilized), Rs 658.59 crore for land acquisition and general corporate purposes (Rs 26.49 crore unutilized), and Rs 13.06 crore for issue-related expenses. The total unutilized amount of Rs 310.18 crore has been deployed in fixed deposits with various banks earning returns between 4% to 7.8%. All project timelines remain on schedule for the FY2025-FY2028 period.",
            "Sentiment": "neutral",
            "PublishDate": 1753449720532,
            "Source": "corporate_action"
        },
        {
            "Title": "SOBHA Reports Mixed Q1 Results with Revenue Growth but EBITDA Decline",
            "Summary": "SOBHA delivered mixed quarterly results with revenue increasing to 8.5 billion rupees from 6.4 billion rupees year-over-year. Net profit more than doubled to 136 million rupees compared to 61 million rupees in the same period last year. Other income also rose to 495 million rupees from 295 million rupees. However, EBITDA declined significantly to 239 million rupees from 559 million rupees, causing the EBITDA margin to compress to 2.81% from 8.73% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1753447988154,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Ltd: Record Q1 Sales Driven by Greater Noida Project Launch",
            "Summary": "Sobha Ltd achieved its highest-ever quarterly sales value of ₹2,078.8 crore in Q1 FY24, with ₹1,717 crore as the company's share. The launch of SOBHA Aurum in Greater Noida significantly contributed to this growth. The company sold 1.44 million square feet at an average realisation of ₹14,395 per square foot. Bengaluru remained stable with ₹602.4 crore in sales, while Gurugram improved to ₹352.4 crore.",
            "Sentiment": "positive",
            "PublishDate": 1751941189000,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Achieves Record Quarterly Real Estate Sales of ₹20.79 Billion",
            "Summary": "Sobha, a real estate company, has reported record-breaking quarterly sales in its real estate segment. The company's sales reached ₹20.79 billion, surpassing the ₹2,000 crore milestone for the first time. This achievement marks a significant performance for Sobha in the real estate market.",
            "Sentiment": "positive",
            "PublishDate": 1751938093000,
            "Source": "default"
        },
        {
            "Title": "SOBHA Reports Q4 Results and Dividend Recommendation",
            "Summary": "SOBHA has announced its Q4 financial results and dividend recommendation. The company's Q4 consolidated net profit increased to 408.6 million rupees, up from 70 million rupees year-over-year and 216.9 million rupees quarter-over-quarter. Revenue rose to 12.4 billion rupees from 7.63 billion rupees year-over-year. EBITDA for Q4 was 940.6 million rupees, compared to 621 million rupees in the previous year, while the EBITDA margin decreased to 7.58% from 8.14% year-over-year. The company has recommended a dividend of 3 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1748518085000,
            "Source": "result"
        },
        {
            "Title": "Sobha Ltd: Q4 Profit Soars, Revenue Jumps 63%, Dividend Declared",
            "Summary": "Sobha Ltd reported Q4 net profit of ₹40.8 crore, up from ₹7 crore year-over-year. Revenue surged 63% to ₹1,240.6 crore. EBITDA increased 51.5% to ₹94 crore. The company declared a dividend of ₹3 per share for FY25, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1748517194000,
            "Source": "earnings"
        },
        {
            "Title": "SOBHA to Consider Q4 Results on May 29",
            "Summary": "SOBHA, a company, has announced that it will consider its fourth quarter (Q4) results on May 29. No additional details about the financial performance or the specific fiscal year were provided in the news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1747832837000,
            "Source": "default"
        },
        {
            "Title": "Sobha Ltd: Q4 Total Sales Value Surges 22%, Share Price Rises",
            "Summary": "Sobha Ltd's total sales value increased 22.1% year-on-year to Rs 1,836 crore in Q4. Sales value for new projects grew 7.53% to Rs 1,370 crore. Average price realization improved to Rs 11,781 per square feet. However, FY25 total sales value declined 5.53% to Rs 62,765 crore.",
            "Sentiment": "positive",
            "PublishDate": 1744086227000,
            "Source": "result"
        },
        {
            "Title": "SOBHA Ltd Achieves Record New Launches and Realization in FY 2024",
            "Summary": "SOBHA Ltd reports significant achievements for FY 2024, including the highest number of new project launches and record-breaking average realization. The company launched 8 new projects across 4 cities, totaling 8.76 million square feet. Additionally, SOBHA achieved its highest-ever average realization of ₹13,412 per square foot, marking a 22.8% improvement compared to the previous fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1744081704000,
            "Source": "result"
        },
        {
            "Title": "SOBHA Ltd Reports Strong Q4 FY 2025 Sales Growth",
            "Summary": "SOBHA Ltd has announced its Q4 FY 2025 results, reporting a sales value of ₹18.36 billion. This represents a significant increase of 32.2% quarter-on-quarter and 22.1% year-on-year, indicating robust growth in the company's real estate sales performance.",
            "Sentiment": "positive",
            "PublishDate": 1744081487000,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Ltd: FY25 Sales Value Declines, Missing Guidance",
            "Summary": "Sobha Ltd reported total sales value of ₹6,277 crore for FY25, lower than FY24's ₹6,644 crore and missing the earlier guidance of ₹8,500 crore. Q4 sales value with Sobha's share was ₹1,370 crore. Average price realization improved to ₹13,412 per square feet for FY25, up from ₹10,922 in FY24.",
            "Sentiment": "negative",
            "PublishDate": 1744078591000,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Ltd Acquires Land Parcel in Parel for ₹211.32 Crore",
            "Summary": "Sobha Ltd has secured a land parcel located at Jerbai Wadia Road in Parel. The acquisition cost amounts to ₹211.32 crore, indicating a significant investment in prime real estate.",
            "Sentiment": "positive",
            "PublishDate": 1739416219000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sobha Ltd: Shares Decline 13% Amid Mixed Q3 Results and Analyst Revisions",
            "Summary": "Sobha Ltd shares fell 13% over four days following Q3 results. Net profit rose 44.7%, revenue up 78.7%, but EBITDA margin contracted. Analysts maintain 'buy' ratings with lowered target prices. Company plans expansion to three new cities.",
            "Sentiment": "neutral",
            "PublishDate": 1739171875000,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Ltd: Q3 Profit Jumps 44%, Revenue Soars 79%",
            "Summary": "Sobha Ltd reported a 44% increase in consolidated net profit to Rs 21.6 crore for Q3 FY25. Revenue surged 79% to Rs 1,224 crore. However, EBITDA declined 10% to Rs 67 crore, with margins narrowing to 5.5% from 10.8% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738844845000,
            "Source": "earnings"
        },
        {
            "Title": "SOBHA Limited Reports Strong Sales Growth in Q3",
            "Summary": "SOBHA Limited has reported significant growth in its sales value for the third quarter. The company's sales value increased by 17.8% quarter-over-quarter. Additionally, SOBHA's share sales value experienced a substantial growth of 27.2% compared to Q2, reaching ₹12.50 billion.",
            "Sentiment": "positive",
            "PublishDate": 1736301575000,
            "Source": "result"
        },
        {
            "Title": "SOBHA Ltd Reports Strong Q3-FY25 Sales Performance",
            "Summary": "SOBHA Ltd achieved sales of Rs. 13.88 billion in Q3-FY25, with a new sales area of 1.01 million square feet. The company's average price realization was Rs. 13,663 per square foot.",
            "Sentiment": "positive",
            "PublishDate": 1736301384000,
            "Source": "result"
        },
        {
            "Title": "Sobha Ltd: Q3 Sales Value Drops 29% YoY, Improves 18% QoQ",
            "Summary": "Sobha Ltd reported Q3 FY25 sales value of ₹1,388.6 crore, down 28.9% YoY but up 17.8% QoQ. New sales area was 1.01 million sq ft. Average price realization improved 16.5% YoY to ₹13,663 per sq ft. Bengaluru contributed 72.1% of total sales. Company's share in sales value increased to 90%, the highest ever.",
            "Sentiment": "neutral",
            "PublishDate": 1736272638000,
            "Source": "result"
        },
        {
            "Title": "Sobha Ltd: Q3 Sales Drop 29% to Rs 1,389 Crore",
            "Summary": "Sobha Ltd reported a 29% decline in Q3 sales to Rs 1,388.6 crore. The company sold 1.01 million sq. ft. at an average price of Rs 13,663 per sq. ft. Average price realization increased by 17% year-over-year. Bengaluru contributed 72.1% of total sales value. Sobha Ayana, a new project in Bengaluru, was launched during the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1736270891000,
            "Source": "earnings"
        },
        {
            "Title": "Sobha Ltd: HSBC Raises Target Price on Strong Launch Pipeline",
            "Summary": "HSBC increased Sobha Ltd's target price to Rs 2,150 from Rs 2,000, maintaining a 'buy' rating despite Q2 margin decline. The company's share price jumped nearly 5% following the news. HSBC cites Sobha's debt resolution, successful rights issue, and aggressive growth plans as positive factors. However, the brokerage notes concerns about continued margin pressure and uncertain legacy land monetization.",
            "Sentiment": "positive",
            "PublishDate": 1732251272000,
            "Source": "normal_news"
        },
        {
            "Title": "Sobha Ltd: Ambitious FY25 Pre-Sales Target at Risk",
            "Summary": "Sobha Ltd is behind on its FY25 pre-sales target after a 4% YoY decline in H1FY25. The company maintains its ₹8,500 crore guidance despite challenges. Delayed approvals in Bengaluru, where 40% of pre-sales originate, pose a significant risk. Sobha plans to launch 5.5msf of projects in H2FY25, focusing on middle-income segments to boost sales. The company has reduced its net debt to ₹280 crore and aims to diversify geographically.",
            "Sentiment": "neutral",
            "PublishDate": 1732149013000,
            "Source": "normal_news"
        },
        {
            "Title": "SOBHA Reports Q2 Financial Results",
            "Summary": "SOBHA, a real estate company, has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 771 million rupees, compared to 755 million rupees in the same quarter last year, showing a slight increase. However, the EBITDA margin has decreased from 10.18% to 8.26% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731598305000,
            "Source": "result"
        },
        {
            "Title": "SOBHA Reports Strong Q2 Revenue Growth",
            "Summary": "SOBHA, an Indian real estate company, has reported a significant increase in its second quarter revenue. The company's revenue for Q2 reached 9.3 billion rupees, compared to 7.4 billion rupees in the same quarter of the previous year, representing a year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731598182000,
            "Source": "result"
        },
        {
            "Title": "SOBHA Reports Significant Profit Growth in Q2",
            "Summary": "SOBHA, a real estate company, has reported a consolidated net profit of 260.9 million rupees for the second quarter. This represents a substantial year-over-year increase from 149 million rupees in the same quarter last year, and a quarter-over-quarter rise from 60.6 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1731598138000,
            "Source": "result"
        },
        {
            "Title": "SOBHA Ltd: Q2 Profit Soars 73%, Revenue Up 26%",
            "Summary": "SOBHA Ltd reported a 73.3% YoY increase in Q2 FY25 net profit to ₹26 crore. Revenue rose 26% to ₹933.5 crore. Real estate collections reached ₹1,222.7 crore, with net debt-to-equity ratio improving to 0.08. Sales performance hit ₹1,178 crore, with average price realisation up 24% YoY. Kerala achieved record quarterly sales of 0.30 million square feet.",
            "Sentiment": "positive",
            "PublishDate": 1731598044000,
            "Source": "result"
        },
        {
            "Title": "SOBHA to Consider Fund Raising via Private Placement of NCDs",
            "Summary": "SOBHA Limited has announced a board meeting scheduled for November 14 to consider a proposal for raising funds through the issuance of non-convertible debentures (NCDs) on a private placement basis.",
            "Sentiment": "neutral",
            "PublishDate": 1731074252000,
            "Source": "corporate_action"
        }
    ]
}