{
    "Symbol": "SOFTTECH",
    "ISIN": "INE728Z01015",
    "News": [
        {
            "Title": "SoftTech Engineers Files Q3 Fund Utilization Report",
            "Summary": "SoftTech Engineers Limited submitted its quarterly statement of deviation and variation for fund utilization under Regulation 32, reporting no deviations in the use of proceeds from two preferential issues.",
            "Sentiment": "neutral",
            "PublishDate": 1770904163066,
            "Source": "stocks"
        },
        {
            "Title": "SoftTech Engineers Limited Witnesses 16.23% Shareholding Transfer Between Entities",
            "Summary": "Elimath Advisors Pvt Ltd acquired 22,46,998 equity shares (16.23%) of SoftTech Engineers Limited through open market purchase on December 4, 2025. Simultaneously, Florintree Technologies LLP sold the same number of shares (16.23%) through open market sale, reducing their holding to nil.",
            "Sentiment": "neutral",
            "PublishDate": 1765253555520,
            "Source": "stock"
        },
        {
            "Title": "Florintree Technologies Sells Entire 16.23% Stake in SoftTech Engineers",
            "Summary": "Florintree Technologies LLP sold its complete shareholding of 22,46,998 equity shares (16.23% stake) in SoftTech Engineers Limited through open market transactions on December 4, 2025. The sale represents a complete exit by the LLP from SoftTech Engineers, reducing the company's investor base and potentially impacting its shareholding structure.",
            "Sentiment": "neutral",
            "PublishDate": 1765201899939,
            "Source": "corporate_action"
        },
        {
            "Title": "SoftTech Engineers Reports 34% Revenue Growth in Q2 FY2025-26 with Strong Order Book",
            "Summary": "SoftTech Engineers achieved revenue of Rs 25.71 crore in Q2 FY2025-26 compared to Rs 22.93 crore in Q2 FY2025, with EBITDA margin improving to 30% from 28%. The company secured significant orders including APCRDA worth Rs 28.91 crore and AAI worth Rs 17.67 crore, maintaining a strong order book of Rs 241.93 crore with expectations of a Dubai-Oman order worth Rs 334 crore.",
            "Sentiment": "positive",
            "PublishDate": 1764053078801,
            "Source": "earnings"
        },
        {
            "Title": "SoftTech Engineers Reports Quarterly Results for Quarter Ended September 30, 2025",
            "Summary": "SoftTech Engineers Limited announced its unaudited standalone and consolidated financial results for the quarter ended September 30, 2025. The Board of Directors approved the results at a meeting held on November 13, 2025. During the quarter, 35,000 employee stock options were exercised, resulting in the issuance of equity shares to employees. The company included financial results of its German subsidiary, SoftTech Digital AG, in the consolidated results. The consolidated results include nine subsidiaries. The company operates in a single segment of information technology and software services. Statutory auditors issued unmodified audit opinions for both standalone and consolidated results.",
            "Sentiment": "neutral",
            "PublishDate": 1763028041196,
            "Source": "earnings"
        },
        {
            "Title": "SoftTech Engineers Cancels Acquisition of Eximietas Developer Due to Agreement Difficulties",
            "Summary": "SoftTech Engineers Limited has cancelled its proposed acquisition of Eximietas Developer Private Limited due to difficulties in completing the Share Purchase Agreement. The company has terminated both the Share Purchase Agreement and Memorandum of Understanding, with the cancellation not entailing any liability on the company. The acquisition was originally announced on September 30, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1760706978354,
            "Source": "order&deals"
        },
        {
            "Title": "Softtech Engineers Approves Acquisition of Property Developer Eximietas",
            "Summary": "Softtech Engineers has approved the acquisition of Eximietas Developer Private Limited, a company engaged in property development activities both nationally and internationally.",
            "Sentiment": "positive",
            "PublishDate": 1759242986052,
            "Source": "order&deals"
        },
        {
            "Title": "SoftTech Engineers Secures INR 17.16 Crore Contract from Airports Authority of India for BIM-based Project Monitoring System",
            "Summary": "SoftTech Engineers Limited has been awarded a contract by Airports Authority of India for a BIM-based Project Monitoring System worth INR 17.16 crore. The company will deploy its AI and ML-enabled 'Civit INFRA' product to implement a unified enterprise solution integrated with BIM software. The system will manage end-to-end construction project processes including planning, budgeting, cost estimation, contract management, work execution, monitoring, communication, documentation and reporting through web and mobile interfaces.",
            "Sentiment": "positive",
            "PublishDate": 1758808931849,
            "Source": "order&deals"
        },
        {
            "Title": "SoftTech Engineers Transfers Initial Funds for German Entity Acquisition",
            "Summary": "SoftTech Engineers Limited has transferred initial funds for the acquisition of a German entity, purchasing 50,000 no-par value shares with a nominal value of EUR 1.00 each. This update follows previous disclosures made on May 19, 2025 and September 17, 2025 regarding the same acquisition.",
            "Sentiment": "neutral",
            "PublishDate": 1758635148957,
            "Source": "order&deals"
        },
        {
            "Title": "Softtech Engineers Acquires Full Stake in German Subsidiary for €1.1 Million, Appoints New CFO",
            "Summary": "Softtech Engineers' board has approved the acquisition of a complete stake in Softtech Digital AG for up to €1.1 million. The acquisition is part of the company's strategy to expand its presence in the German market. Additionally, Deepak Bang has been appointed as Chief Financial Officer with immediate effect.",
            "Sentiment": "positive",
            "PublishDate": 1758098039978,
            "Source": "order&deals"
        },
        {
            "Title": "SoftTech Engineers CFO Kamal Agrawal Resigns Due to Personal Reasons",
            "Summary": "SoftTech Engineers Limited announced the resignation of Kamal Agrawal from his position as Chief Financial Officer and Key Managerial Personnel, effective September 16, 2025. Agrawal cited personal reasons for his departure and confirmed there are no other material reasons for his resignation. His resignation will take effect from the close of business hours on September 16, 2025, after which he will cease to hold the CFO position and his Key Managerial Personnel responsibilities, including authority for determining materiality of events and making stock exchange disclosures.",
            "Sentiment": "neutral",
            "PublishDate": 1758026615097,
            "Source": "corporate_governance"
        },
        {
            "Title": "SoftTech Engineers Reports 12.7% Growth in Net Profit for Quarter Ended June 30, 2025",
            "Summary": "SoftTech Engineers Limited reported its unaudited financial results for the quarter ended June 30, 2025. The company achieved total income of Rs. 26.55 crore, representing a 5.7% year-on-year increase. EBITDA grew 8.2% to Rs. 6.29 crore, while net profit rose 12.7% to Rs. 2.93 crore compared to the same quarter last year. Earnings per share increased to Rs. 2.91 from Rs. 2.58 in the previous year. The Board of Directors approved these results on August 14, 2025, and they were published in Financial Express and Loksatta newspapers on August 15, 2025. The company showed growth across all key financial parameters, with profit metrics growing faster than revenue, indicating improved cost management.",
            "Sentiment": "positive",
            "PublishDate": 1755499130549,
            "Source": "earnings"
        },
        {
            "Title": "SoftTech Engineers Reports 632% Jump in Quarterly Profit, Announces AGM Date",
            "Summary": "SoftTech Engineers Limited reported standalone profit after tax of Rs 162.95 crores for the quarter ended June 30, 2025, compared to Rs 22.24 crores in the previous quarter. Revenue from operations declined to Rs 2,578.58 crores from Rs 2,986.46 crores in the preceding quarter. On a consolidated basis, profit after tax reached Rs 110.36 crores versus Rs 6.33 crores in the previous quarter, while consolidated revenue increased to Rs 2,701.29 crores from Rs 2,690.90 crores. The company scheduled its Annual General Meeting for September 26, 2025. Basic earnings per share improved to Rs 1.18 from Rs 0.16 in the previous quarter on standalone basis. The consolidated financial results include eight subsidiaries across various geographies including the US, Finland, Singapore, and India.",
            "Sentiment": "positive",
            "PublishDate": 1755158973322,
            "Source": "earnings"
        },
        {
            "Title": "Softtech Engineers Reports 37% Revenue Growth in Q1 Results",
            "Summary": "Softtech Engineers reported Q1 revenue of 270 million rupees, up from 197 million rupees year-over-year. The company's consolidated net profit increased to 9 million rupees from 6 million rupees in the same period last year. EBITDA rose to 74 million rupees compared to 60 million rupees year-over-year, though EBITDA margin decreased to 27.3% from 30.44% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1755157641891,
            "Source": "earnings"
        },
        {
            "Title": "SOFTTECH ENGINEERS Reports Q4 Financial Results",
            "Summary": "SOFTTECH ENGINEERS has released its Q4 financial results. The company's EBITDA decreased to 54 million rupees from 66 million rupees year-over-year. The EBITDA margin fell to 18.04% from 28.98% compared to the same period last year. Net profit for Q4 was 2 million rupees, down from 21 million rupees year-over-year and 10 million rupees quarter-on-quarter. However, revenue increased to 299 million rupees from 227 million rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1748262501000,
            "Source": "result"
        },
        {
            "Title": "Softtech Engineers to Consider Fundraising Options",
            "Summary": "Softtech Engineers has scheduled a board meeting for November 14 to discuss and potentially approve raising funds through a Qualified Institutional Placement (QIP) or other modes.",
            "Sentiment": "neutral",
            "PublishDate": 1731338392000,
            "Source": "corporate_action"
        }
    ]
}