{
    "Symbol": "SOLARWORLD",
    "ISIN": "INE0TY101024",
    "News": [
        {
            "Title": "Solarworld Energy Q3 Net Profit Rises 15.2%",
            "Summary": "Solarworld Energy Solutions reports consolidated net profit of 492 million rupees in Q3, marking a 15.2% increase from 427 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769590478458,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solarworld Files Arbitration Petition for 360 MW Projects",
            "Summary": "Solarworld Energy Solutions filed arbitration petition with Delhi High Court seeking relief on 260 MW and 100 MW projects with SJVN Green Energy, claiming total amounts of ₹92.38 crore.",
            "Sentiment": "negative",
            "PublishDate": 1769525715288,
            "Source": "stocks"
        },
        {
            "Title": "Solarworld Energy Solutions Q3FY26 Earnings Call Jan 28",
            "Summary": "Solarworld Energy Solutions Limited announces earnings call with analysts and investors on January 28, 2026 at 4:00 PM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769088065439,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solarworld Energy Wins ₹725-Crore NTPC Order",
            "Summary": "Solarworld Energy Solutions secures major EPC contract for 250 MWac solar project from NTPC Renewable, adding to its growing order book worth ₹3,223 crores as of October 31.",
            "Sentiment": "positive",
            "PublishDate": 1766816706556,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solarworld Energy Gets Solar Panel Supply Approval",
            "Summary": "Solarworld Energy's subsidiary Znshine Solarworld gets enlisted under ALMM Order 2019 with 1.55 GW annual capacity, enabling solar panel supply to grid-connected projects in India.",
            "Sentiment": "positive",
            "PublishDate": 1766419339610,
            "Source": "stocks"
        },
        {
            "Title": "SolarWorld Energy Solutions Secures ₹806.40 Crore Battery Storage Project in Gujarat",
            "Summary": "SolarWorld Energy Solutions has signed an agreement for a 200 MW/400 MWh battery storage project in Gujarat valued at approximately ₹806.40 crores over a 12-year period. The project represents a significant contract win for the company in India's growing energy storage sector.",
            "Sentiment": "positive",
            "PublishDate": 1765272105813,
            "Source": "order&deals"
        },
        {
            "Title": "Solarworld Energy Solutions Reports No IPO Proceeds Utilization in Q2 2025",
            "Summary": "Solarworld Energy Solutions Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing no utilization of IPO proceeds during the period. The company raised Rs 4,400 million through its IPO in September 2025 and Rs 1,100 million from pre-IPO placement in November 2024. CRISIL Ratings Limited, serving as the monitoring agency, reported that IPO proceeds of Rs 4,116.78 million allocated for investment in subsidiary KSPL for establishing a 12 GW solar PV TopCon cell manufacturing facility at Pandhurana, Madhya Pradesh remained unutilized during the quarter. Pre-IPO proceeds of Rs 975.91 million were previously utilized for general corporate purposes including payments to vendors, statutory dues, and employee salaries from November 2024 to June 2025. The company has deployed Rs 118.89 million of unutilized funds in fixed deposits with HDFC Bank. No deviations from disclosed objects or delays in implementation were reported.",
            "Sentiment": "neutral",
            "PublishDate": 1763028136483,
            "Source": "corporate_action"
        },
        {
            "Title": "Solarworld Energy Solutions Reports Quarterly Results and Addresses BSE Fine Issue",
            "Summary": "Solarworld Energy Solutions Limited approved its unaudited standalone and consolidated financial results for the quarter and half year ended September 30, 2025. The company's securities were listed on stock exchanges on September 30, 2025. The Board addressed a fine imposed by BSE for alleged non-compliance with annual report submission requirements under Regulation 34. The company clarified it had obtained an extension from the Registrar of Companies for holding its AGM for the financial year ended March 31, 2025, with approval received on September 11, 2025. The company stated it was not obligated to make disclosures under Listing Regulations prior to its listing date of September 30, 2025. The AGM is scheduled for November 28, 2025, and the company reaffirmed its commitment to regulatory compliance. The company completed its IPO of ₹4,900 million, including fresh issue proceeds of ₹4,400 million.",
            "Sentiment": "neutral",
            "PublishDate": 1762940408420,
            "Source": "earnings"
        },
        {
            "Title": "Solarworld Energy Solutions Reports 49% Drop in Q2 Net Profit Despite Flat Revenue",
            "Summary": "Solarworld Energy Solutions reported quarterly results showing mixed performance. Revenue remained flat at 1.4 billion rupees compared to the same period last year. However, profitability declined significantly with EBITDA falling to 152 million rupees from 296 million rupees year-over-year, causing EBITDA margin to compress to 11% from 20.9%. Consolidated net profit dropped to 93 million rupees from 223 million rupees in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762939369073,
            "Source": "earnings"
        },
        {
            "Title": "Solarworld Energy Secures 802 Crore Rupee Order",
            "Summary": "Solarworld Energy has won an order worth 802 crore rupees. The company's current market capitalization stands at 2,800 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1761722359940,
            "Source": "order&deals"
        },
        {
            "Title": "Solarworld Energy Solutions Expands Solar EPC and Battery Storage Operations with ₹25,000+ Million Order Book",
            "Summary": "Solarworld Energy Solutions is pursuing aggressive expansion in solar EPC (Engineering, Procurement, and Construction) and battery storage sectors. The company has secured an order book exceeding ₹25,000 million and is focusing on Battery Energy Storage System (BESS) projects as key drivers for its next growth phase.",
            "Sentiment": "positive",
            "PublishDate": 1760718490823,
            "Source": "stock"
        },
        {
            "Title": "Solarworld Energy Solutions Reports Strong Revenue Growth Despite Margin Decline in Q1",
            "Summary": "Solarworld Energy Solutions reported Q1 net profit of 166 million rupees, up from 84 million rupees year-over-year. Revenue surged to 683 million rupees from 226 million rupees in the same period last year. EBITDA increased to 103 million rupees from 72 million rupees year-over-year. However, EBITDA margin declined to 15.08% from 32.04% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760705431135,
            "Source": "earnings"
        },
        {
            "Title": "SolarWorld Energy Solutions Approves Q1 Results and Appoints New Secretarial Auditor",
            "Summary": "SolarWorld Energy Solutions Limited's Board of Directors approved the unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The company also appointed M/s. P Arora & Associates as its Secretarial Auditor for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. P Arora & Associates is a 7-year-old company secretarial firm led by Preeti Arora, who holds membership with the Institute of Company Secretaries of India and a Masters in Law degree. The firm provides advisory services across company law, compliance, corporate restructuring, and cross-border investment structures. The board meeting was held on October 17, 2025, lasting 17 minutes.",
            "Sentiment": "neutral",
            "PublishDate": 1760705305850,
            "Source": "corporate_action"
        }
    ]
}