{
    "Symbol": "SOLARA",
    "ISIN": "INE624Z01016",
    "News": [
        {
            "Title": "Solara Active Pharma Revises Key Corporate Policies",
            "Summary": "Solara Active Pharma Sciences board approves amendments to materiality disclosure and related party transaction policies in compliance with updated SEBI regulations on February 06, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1770368881074,
            "Source": "stocks"
        },
        {
            "Title": "Solara Active Pharma Reports Q3 Net Loss of ₹174M",
            "Summary": "Solara Active Pharma Sciences posted a consolidated net loss of ₹174 million in Q3, marking a significant reversal from the ₹80 million profit recorded in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1770366142848,
            "Source": "co_actions_results"
        },
        {
            "Title": "Veritas Finance Q3FY26 Results Show Strong Growth",
            "Summary": "Veritas Finance Limited reported robust Q3FY26 performance with total income rising to ₹46,182.77 lakhs and net profit after tax reaching ₹8,175.59 lakhs for the quarter ended December 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1770298071705,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solara Active Pharma Seeks Shareholder Approval for Director",
            "Summary": "Solara Active Pharma Sciences has issued a postal ballot notice seeking shareholder approval for the appointment of Mr. Mohanraj Sanjeevi as Whole-time Director with annual remuneration of Rs. 1.00 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1770226223396,
            "Source": "stocks"
        },
        {
            "Title": "Solara Active Pharma Sciences Q3FY26 Earnings Call",
            "Summary": "Solara Active Pharma Sciences has scheduled an earnings call for February 06, 2026 at 04:30 PM IST to discuss Q3FY26 financial results with analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1769785447705,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solara Active Pharma Reconstitutes Management Committee",
            "Summary": "Solara Active Pharma Sciences reconstituted its Management Committee with Mr. Arun Kumar Pillai as Chairperson, along with MD & CEO and CFO as members following board meeting on December 17, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1765949438045,
            "Source": "stocks"
        },
        {
            "Title": "Solara Active Pharma Sciences Receives VAI Classification from USFDA for Mangalore Facility Inspection",
            "Summary": "Solara Active Pharma Sciences announced successful closure of USFDA inspection at its Mangalore facility with Voluntary Action Indicated (VAI) classification, following inspection conducted between August 25-29, 2025. The company received two procedural Form FDA 483 observations and submitted formal response within timeline, with the agency issuing Establishment Inspection Report on November 18, 2025 and concluding the inspection as closed.",
            "Sentiment": "positive",
            "PublishDate": 1763528264179,
            "Source": "stock"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Q2 Net Loss of 101 Million Rupees",
            "Summary": "Solara Active Pharma Sciences reported a net loss of 101 million rupees in Q2, compared to a profit of 80 million rupees in the same period last year. Revenue declined to 3.14 billion rupees from 3.47 billion rupees year-over-year. EBITDA dropped to 347.3 million rupees from 613.1 million rupees, while EBITDA margin contracted to 11.08% from 17.67% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1762388871393,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Allots 8,040 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Solara Active Pharma Sciences Limited's Board of Directors approved the allotment of 8,040 equity shares of face value Rs. 10 each under the Solara Employee Stock Option Plan 2018. The allotment was approved at a Board Meeting on November 5, 2025. The company realized Rs. 30,15,000 from the exercise of these options. Following this allotment, the total paid-up capital increased from Rs. 44,47,93,723.50 to Rs. 44,48,74,123.50, with the number of fully paid equity shares rising from 3,61,63,267 to 3,61,71,307. The newly allotted shares rank pari-passu with existing equity shares. The diluted earnings per share pursuant to this issuance is Rs. 19 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1762378549875,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports No Deviation in Rights Issue Proceeds Utilization",
            "Summary": "Solara Active Pharma Sciences Limited disclosed that there is no deviation or variation in the use of proceeds raised through its Rights Issue for the quarter ended September 30, 2025. The company raised Rs. 308.85 crores, with Rs. 4.88 crores collected during the quarter pursuant to first call reminder notice. The funds were allocated for two main purposes: Rs. 334.71 crores for repayment or pre-payment of outstanding borrowings (with Rs. 233.61 crores utilized), and Rs. 111.57 crores for general corporate purposes (with Rs. 74.97 crores utilized, including Rs. 15.83 crores during the quarter). The Audit Committee noted and approved the utilization statement without any comments. As of September 30, 2025, Rs. 63,263.09 was held in the monitoring agency account and is yet to be utilized in upcoming quarters.",
            "Sentiment": "neutral",
            "PublishDate": 1762377422521,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Grants 25,000 Stock Options Under Employee Plan",
            "Summary": "Solara Active Pharma Sciences Limited's Board of Directors granted 25,000 stock options to eligible employees under the Solara Employee Stock Option Plan 2024. The options are priced at Rs. 375 per equity share with a minimum vesting period of one year from the grant date. The options will vest over three years and must be exercised within 120 days from the vesting date. The grant was approved at the board meeting held on November 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762374838365,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Appoints Mohanraj S as Chief Human Resources Officer",
            "Summary": "Solara Active Pharma Sciences Limited appointed Mr. Mohanraj S as Chief Human Resources Officer and designated him as Senior Management Personnel effective November 5, 2025. The appointment was approved by the Board of Directors based on the recommendation of the Nomination and Remuneration Committee. Mohanraj brings over 30 years of cross-industry experience spanning Pharma, Biotech, Engineering, Aerospace, Apparel, and Media sectors. His expertise includes Talent Management, Employee Relations, Organizational Development, HRIS, and Digital Transformation. He previously held HR leadership positions at Mylan Laboratories, The Manipal Group, and Tata Advanced Materials. Mohanraj holds a Masters in Social Work (HRM) from Madras University and a BA in Behavioural Sciences from St. Josephs College, Bangalore. He is also a certified ISO auditor and has served on the Board of Studies for Industrial Relations at St. Josephs University for two decades.",
            "Sentiment": "positive",
            "PublishDate": 1762371620551,
            "Source": "corporate_governance"
        },
        {
            "Title": "Solara Active Pharma Sciences Appoints New Chief Investor Relations Officer and Revises Management Remuneration",
            "Summary": "Solara Active Pharma Sciences' Board of Directors approved several key decisions. The company appointed Sarat Kumar Asuri, who serves as Chief Financial Officer, to the additional role of Chief Investor Relations Officer. The Board also approved a revision in remuneration for Whole-time Director Mohan Muthunarayanan within previously approved shareholder limits and company remuneration policy guidelines. Additionally, the company revised remuneration for eligible Senior Management Personnel and reviewed and confirmed its existing Risk Management Policy.",
            "Sentiment": "neutral",
            "PublishDate": 1762338679803,
            "Source": "corporate_governance"
        },
        {
            "Title": "Solara Active Pharma Sciences Non-Executive Director Resigns, Board Committees Reconstituted",
            "Summary": "Kartheek Chintalapati Raju resigned from his position as Non-Executive Director of Solara Active Pharma Sciences Limited effective November 5, 2025, citing preoccupation and personal commitments. His resignation also resulted in his departure from the Stakeholders Relationship Committee and Nomination and Remuneration Committee. The Board reconstituted both committees on the same date. The Stakeholders Relationship Committee now comprises Dr. Kausalya Santhanam as Chairperson, Sandeep Shashikantharao as Executive Director-Member, and Manish Gupta as Non-Executive Director-Member. The Nomination Remuneration Committee includes Rajendra Kumar Srivastava as Chairperson, along with members Dr. Kausalya Santhanam, R Ramakrishnan, and Rajiv Vijay Nabar, all serving as Independent Directors. The company acknowledged Raju's valuable contributions during his tenure.",
            "Sentiment": "neutral",
            "PublishDate": 1762336856651,
            "Source": "corporate_governance"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Q2 Net Loss of 101M Rupees",
            "Summary": "Solara Active Pharma Sciences reported a net loss of 101 million rupees in Q2, compared to a profit of 80 million rupees in the same period last year. Revenue declined to 3.14 billion rupees from 3.47 billion rupees year-over-year. EBITDA dropped to 347.3 million rupees from 613.1 million rupees, while EBITDA margin compressed to 11.08% from 17.67% in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1762336534320,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Quarterly Financial Results for September 2025",
            "Summary": "Solara Active Pharma Sciences Limited released its unaudited financial results for the quarter and half-year ended September 30, 2025. The Board of Directors approved these results at a meeting held on November 5, 2025, which commenced at 12:00 PM and concluded at 1:50 PM. The results include both standalone and consolidated financial statements, which have been reviewed by statutory auditors Deloitte Haskins Sells LLP. The consolidated results include financial information from subsidiaries with total assets of Rs 6.74 crores as of September 30, 2025, with nil revenue for both the quarter and six months ended September 30, 2025. The company's financial statements were prepared in accordance with Indian Accounting Standard 34 (Interim Financial Reporting) and comply with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762335342957,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Receives Rs 4.88 Crore Call Money, Converts 3.71 Lakh Partly Paid-Up Shares",
            "Summary": "Solara Active Pharma Sciences Limited received first call money of Rs 4,87,95,993.75 for 3,71,779 partly paid-up Rights Equity Shares. The company converted these shares from Rs 3.50 paid-up to Rs 7 paid-up status through a Rights Issue Committee circular resolution. Following this conversion, the company's paid-up capital increased to Rs 44,47,03,723.50. The paid-up capital is now divided into 3,61,54,267 fully paid-up equity shares, 1,17,61,546 partly paid-up Rights Equity Shares with Rs 7 paid-up, and 2,37,209 partly paid-up Rights Equity Shares with Rs 3.5 paid-up. The original rights equity shares were allotted on June 19, 2024, pursuant to a Letter of Offer dated May 09, 2024. The company will take necessary steps for corporate actions and obtaining listing and trading approvals for the converted shares.",
            "Sentiment": "positive",
            "PublishDate": 1755330885070,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports No Deviation in Rights Issue Fund Utilization for Q1 FY26",
            "Summary": "Solara Active Pharma Sciences Limited submitted its monitoring agency report for the quarter ended June 30, 2025, confirming no deviation in the utilization of Rights Issue proceeds from stated objectives. The company raised Rs 449.95 crore through a Rights Issue conducted from May 28, 2024 to June 11, 2024. CRISIL Ratings Limited, the appointed monitoring agency, reported that Rs 292.75 crore has been utilized out of total net proceeds of Rs 446.95 crore, with Rs 154.2 crore remaining unutilized. The funds were used for repayment of borrowings (Rs 233.61 crore utilized) and general corporate purposes (Rs 59.14 crore utilized). The company repaid loans to HDFC, RBL Bank, Yes Bank, and Radiant Computech. Rs 10.97 crore remains in the monitoring agency account, while Rs 134.99 crore is yet to be raised through a second call planned for FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1755082679779,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Strong Q1 FY26 Results with 15% Revenue Growth",
            "Summary": "Solara Active Pharma Sciences delivered revenue of INR320 crores in Q1 FY26, marking 15% quarter-on-quarter growth. The company achieved gross margin of 54% and EBITDA of INR57 crores, reflecting 13% quarterly growth and 36% year-on-year growth. This represents the highest PAT in 12 quarters at INR105 million, with EPS of INR2.5 per share. Developed markets contributed 77% of overall sales. The company reduced debt by INR143 crores, bringing net debt-to-EBITDA ratio to 2.7x. Ibuprofen portfolio contributed approximately 30% of business, down from previous 50% dependency. Management guided for 10% revenue growth and 15-20% EBITDA growth for FY26. The company operates at 60-65% capacity utilization and plans to demerge its CRAMS business with INR200 crores debt allocation.",
            "Sentiment": "positive",
            "PublishDate": 1753786384400,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports No Deviation in Rights Issue Fund Utilization for Quarter Ended June 30, 2025",
            "Summary": "Solara Active Pharma Sciences Limited confirmed no deviation in the utilization of funds raised through its Rights Issue for the quarter ended June 30, 2025. The company raised Rs. 149.49 crores on May 6, 2025, with funds allocated for repayment of borrowings (Rs. 115 crores) and general corporate purposes (Rs. 23.27 crores). Out of the total funds raised, Rs. 138.27 crores were utilized during the quarter, while Rs. 0.26 crores remained in the escrow account and Rs. 10.96 crores in the monitoring account for future utilization. The Rights Issue involved 1,19,98,755 partly paid Rights Shares at Rs. 131.25 per share, with CRISIL Ratings Limited serving as the monitoring agency. The company's Audit Committee reviewed and approved the utilization statement without any comments.",
            "Sentiment": "neutral",
            "PublishDate": 1753431762172,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Reports Strong Q1 FY26 Results with 15% Revenue Growth and Positive Earnings",
            "Summary": "Solara Active Pharma Sciences Limited reported quarterly results for the period ended June 30, 2025, showing revenue of Rs. 319.15 crores, up 15% quarter-on-quarter from Rs. 273.01 crores. The company achieved a profit of Rs. 10.52 crores compared to a loss of Rs. 13.46 crores in the same quarter last year. Gross margins improved to 54.1% from 44.5% year-on-year, while EBITDA margins reached 18.0% versus 11.6% in the previous year. The company reduced gross debt from Rs. 7,760 million to Rs. 6,327 million during the quarter. Earnings per share turned positive at Rs. 2.46 compared to a loss of Rs. 3.50 per share in the corresponding quarter. The Board also appointed Mr. Rajesh Patro as Chief Risk Officer. Regulated markets constituted 77% of total revenues, and the company expects to raise Rs. 134.99 crores through pending rights issue calls.",
            "Sentiment": "positive",
            "PublishDate": 1753430758153,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Strong Q1 Profitability Turnaround",
            "Summary": "Solara Active Pharma Sciences delivered improved quarterly results with EBITDA rising to 570 million rupees from 419 million rupees year-over-year. The company's EBITDA margin expanded significantly to 17.87% compared to 11.5% in the same period last year. The pharmaceutical company turned profitable with a consolidated net profit of 105 million rupees, marking a turnaround from a loss of 135 million rupees in the previous year. However, revenue declined to 3.2 billion rupees from 3.63 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1753430012650,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Schedules Q1 FY26 Results Conference Call for July 25",
            "Summary": "Solara Active Pharma Sciences Limited has scheduled a conference call with investors and analysts on July 25, 2025, at 4:00 pm IST to discuss the company's financial results for the quarter ended June 30, 2025. The call will be led by key executives including Arun Kumar (Founder & Non-Executive Director), Sandeep Rao (MD & CEO), and Sarat Kumar (CFO). Participants can join via provided phone numbers or register early through the DiamondPass system. The company describes itself as focused on pure play APIs (Active Pharmaceutical Ingredients).",
            "Sentiment": "neutral",
            "PublishDate": 1753158744563,
            "Source": "stock"
        },
        {
            "Title": "Solara Active Pharma Sciences: Strategic Pivot Towards High-Value Markets",
            "Summary": "Solara Active Pharma Sciences is shifting focus to high-value regulated markets, which now contribute 76% of total business. The company plans to demerge its CRAMS and Polymers businesses into Synthix Global Pharma Solutions. Despite challenges in FY25, Solara projects 10% revenue growth and 15-20% EBITDA growth for FY26. The company is actively reducing debt, aiming for a net debt/EBITDA of 1.7-1.8x by Q1 FY27.",
            "Sentiment": "positive",
            "PublishDate": 1751792148000,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Revises FY25 Financial Guidance",
            "Summary": "Solara Active Pharma Sciences has adjusted its financial projections for fiscal year 2025. The company now expects EBITDA of 2.13 billion rupees, which is below their previous guidance of 2.3-2.6 billion rupees. Additionally, the company has revised its revenue forecast to 13 billion rupees, down from the earlier guidance of over 15 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1747300193000,
            "Source": "default"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Q4 Financial Results",
            "Summary": "Solara Active Pharma Sciences announced its Q4 consolidated financial results. The company reported a net loss of 2 billion rupees, an improvement from the 2.55 billion rupees loss in the same quarter last year. However, revenue decreased to 2.7 billion rupees from 2.99 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1747299328000,
            "Source": "result"
        },
        {
            "Title": "USFDA Inspection at Solara Active Pharma's Ambernath Facility Concludes with Zero Observations",
            "Summary": "The U.S. Food and Drug Administration (USFDA) has completed an inspection of Solara Active Pharma's facility in Ambernath with no Form 483 inspectional observations. This outcome indicates that the facility met all regulatory standards and no significant issues were identified during the inspection.",
            "Sentiment": "positive",
            "PublishDate": 1747008671000,
            "Source": "default"
        },
        {
            "Title": "USFDA Inspection at Solara Active Pharma's Ambernath Facility Concludes with Zero Observations",
            "Summary": "The United States Food and Drug Administration (USFDA) has completed an inspection of Solara Active Pharma's facility in Ambernath with no Form 483 observations. This outcome indicates that the inspection found no significant issues or violations of good manufacturing practices at the facility.",
            "Sentiment": "positive",
            "PublishDate": 1746873188000,
            "Source": "default"
        },
        {
            "Title": "Solara Active Pharma Sciences Approves Closure of Brazilian Subsidiary",
            "Summary": "Solara Active Pharma Sciences has approved the closure of its subsidiary, Solara Active Pharma Sciences Ltda, located in Brazil. This decision represents a significant corporate action that will likely impact the company's operations in the South American market.",
            "Sentiment": "neutral",
            "PublishDate": 1740355787000,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Approves Closure of Brazilian Subsidiary",
            "Summary": "Solara Active Pharma Sciences has approved the closure of its subsidiary, Solara Active Pharma Sciences LTDA, located in Brazil. This decision represents a significant corporate action that will likely impact the company's operations in the South American market.",
            "Sentiment": "neutral",
            "PublishDate": 1740139319000,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Revenue Impact Due to Market Conditions",
            "Summary": "Solara Active Pharma Sciences has reported that its earnings revenue has been negatively affected. The company attributes this impact to two main factors: increased competition in the Ibuprofen market and a strategic shift towards higher-margin products.",
            "Sentiment": "negative",
            "PublishDate": 1737710511000,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Revises Q4FY25 EBITDA Guidance Downwards",
            "Summary": "Solara Active Pharma Sciences has announced a downward revision of its Q4FY25 EBITDA guidance by 100 million rupees. This adjustment in financial outlook suggests potential challenges or changes in the company's expected performance for the specified quarter.",
            "Sentiment": "negative",
            "PublishDate": 1737710193000,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Significant EBITDA Turnaround in Q3",
            "Summary": "Solara Active Pharma Sciences has reported a substantial improvement in its financial performance for the third quarter. The company achieved an EBITDA profit of 576 million rupees, compared to a loss of 1.6 billion rupees in the same period last year. Additionally, the EBITDA margin for Q3 stood at 19.23%, indicating a strong operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737709987000,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Revises Q4 FY25 Revenue Guidance Downwards",
            "Summary": "Solara Active Pharma Sciences has announced a downward revision of its revenue guidance for the fourth quarter of fiscal year 2025. The company has adjusted its projected revenue from 4 billion rupees to a range of 3.4-3.6 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1737709907000,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Approves Demerger of CRAMS and Polymers Business",
            "Summary": "The board of Solara Active Pharma Sciences has granted in-principle approval for the demerger of its Contract Research and Manufacturing Services (CRAMS) and Polymers business. This strategic move is likely aimed at streamlining operations and potentially unlocking value for shareholders by separating distinct business segments.",
            "Sentiment": "positive",
            "PublishDate": 1737709614000,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Profit in Q3",
            "Summary": "Solara Active Pharma Sciences has reported a consolidated net profit of 80 million rupees in the third quarter, marking a significant turnaround from a loss of 2.75 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737709575000,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Strong Q2 EBITDA Growth",
            "Summary": "Solara Active Pharma Sciences has reported significant year-over-year improvements in its Q2 financial results. The company's EBITDA increased to 600.6 million rupees, up from 310.8 million rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 17.49% from 7.49% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1729500049000,
            "Source": "result"
        },
        {
            "Title": "Solara Active Pharma Science Reaffirms FY'25 Financial Outlook",
            "Summary": "Solara Active Pharma Science's Managing Director has reaffirmed the company's financial outlook for FY'25. The company expects to achieve revenue of Rs 15,000 million and full-year EBITDA between Rs 2,300 to Rs 2,600 million. For the Q4'25 exit quarter, the company projects revenue of approximately Rs 4,000 million and EBITDA ranging from Rs 800 to Rs 900 million, with EBITDA margins of 20-22%.",
            "Sentiment": "positive",
            "PublishDate": 1729499545000,
            "Source": "result"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Q2 Revenue Decline",
            "Summary": "Solara Active Pharma Sciences has reported a revenue of 3.5 billion rupees for the second quarter, which represents a year-over-year decrease from 4.25 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1729499385000,
            "Source": "result"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Profit in Q2",
            "Summary": "Solara Active Pharma Sciences has reported a consolidated net profit of 80 million rupees in the second quarter, marking a significant turnaround from a loss of 171.6 million rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1729499354000,
            "Source": "result"
        }
    ]
}