{
    "Symbol": "SOLARAPP1",
    "ISIN": "IN9624Z01022",
    "News": [
        {
            "Title": "Solara Active Pharma Reports Q3FY26 Loss of ₹17.43 Cr",
            "Summary": "Solara Active Pharma Sciences posted a net loss of ₹17.43 crores in Q3FY26 compared to a profit of ₹8.09 crores in Q3FY25. Revenue grew 16.22% YoY to ₹349.00 crores, but exceptional items of ₹6.75 crores impacted profitability.",
            "Sentiment": "negative",
            "PublishDate": 1770386323940,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solara Active Pharma Allots 1,500 Shares Under ESOP",
            "Summary": "Solara Active Pharma Sciences allotted 1,500 equity shares under its Employee Stock Option Plan 2018, raising ₹5.63 lakhs at ₹375 per share exercise price.",
            "Sentiment": "neutral",
            "PublishDate": 1765953057630,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solara Active Pharma Sciences' Whole Time Director and COO Resigns to Lead Subsidiary Operations",
            "Summary": "Mr. Mohan Muthunarayanan (DIN: 03610282) has resigned from his position as Whole Time Director and Chief Operating Officer of Solara Active Pharma Sciences Limited, effective December 31, 2025. He will transition to become Chief Operating Officer of Synthix Global Pharma Solutions Limited, a wholly owned subsidiary of Solara, focusing on developing the Polymers and CRAMs division and transforming the Vizag facility into a CDMO facility.",
            "Sentiment": "neutral",
            "PublishDate": 1764939034212,
            "Source": "corporate_governance"
        },
        {
            "Title": "Solara Active Pharma Reports 39% EBITDA Decline in Q2 Due to Mangalore Facility Shutdown",
            "Summary": "Solara Active Pharma Sciences reported quarterly results with revenue declining 2% to INR 314 crores. EBITDA dropped 39% to INR 35 crores due to an unscheduled 3-4 week operational shutdown at the Mangalore facility for upgrades. The shutdown resulted in lost sales of INR 30-35 crores and gross margin impact of INR 18-20 crores. Despite disruptions, gross margin remained at 51% and regulated markets contributed 75% of sales. The company successfully cleared a U.S. FDA audit with only 2 minor observations. Operating costs increased by INR 9 crores, including INR 4 crores in one-time upgrade costs. Management expects the disruption to be temporary and maintains outlook of 10% revenue growth and 15-20% EBITDA growth. Debt was reduced by INR 153 crores during the first half, with plans to further reduce debt to INR 446 crores by Q1 FY27. The company has 90-95 DMF filings in the U.S. with 35-40 active products.",
            "Sentiment": "negative",
            "PublishDate": 1762864760840,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports No Deviation in Rights Issue Proceeds Utilization",
            "Summary": "Solara Active Pharma Sciences Limited submitted its monitoring agency report for the quarter ended September 30, 2025, regarding the utilization of proceeds from its rights issue. The company raised Rs 449.95 crore through the rights issue conducted from May 28, 2024 to June 11, 2024, with net proceeds of Rs 446.95 crore. CRISIL Ratings Limited, serving as the monitoring agency, confirmed no deviation from the stated objectives in the Letter of Offer. The proceeds were allocated for two main purposes: Rs 334.71 crore for repayment of outstanding borrowings and Rs 112.24 crore for general corporate purposes. As of September 30, 2025, Rs 233.61 crore was utilized for debt repayment and Rs 15.83 crore for general corporate purposes, specifically vendor payments including settlement of legacy payables from previous financial years. The company has Rs 138.37 crore in unutilized proceeds, comprising funds yet to be raised through a second call and small amounts pending receipt.",
            "Sentiment": "neutral",
            "PublishDate": 1762481878997,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Allots 8,040 Equity Shares Under Employee Stock Option Plan",
            "Summary": "Solara Active Pharma Sciences Limited's Board of Directors approved the allotment of 8,040 equity shares with a face value of Rs. 10 each under the Solara Employee Stock Option Plan 2018. The allotment was made against the exercise of vested options by employees. The company realized Rs. 30,15,000 from the exercise of these options. Following this allotment, the company's paid-up share capital increased from Rs. 44,47,93,723.50 to Rs. 44,48,74,123.50. The newly issued shares rank pari-passu with existing equity shares in all respects. The diluted earnings per share following the issuance is Rs. 19 per share. Options under the plan must be exercised within 120 days from the vesting date.",
            "Sentiment": "neutral",
            "PublishDate": 1762378531717,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports No Deviation in Rights Issue Proceeds Utilization",
            "Summary": "Solara Active Pharma Sciences Limited confirmed no deviation or variation in the use of proceeds raised through its Rights Issue for the quarter ended September 30, 2025. The company raised Rs. 308.85 crores, with Rs. 4.88 crores collected during the quarter pursuant to first call reminder notice. The proceeds were allocated for repayment of outstanding borrowings (Rs. 334.71 crores modified allocation, Rs. 233.61 crores utilized) and general corporate purposes (Rs. 111.57 crores allocation, Rs. 74.97 crores utilized). The Rights Equity Shares were issued as partly paid-up at Rs. 131.25 per share. The Audit Committee approved the utilization statement without any comments during its meeting on November 5, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762377433902,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Grants 25,000 Stock Options to Employees",
            "Summary": "Solara Active Pharma Sciences Limited's Board of Directors granted 25,000 stock options to eligible employees under the Solara Employee Stock Option Plan 2024. The options are priced at Rs. 375 per equity share with a minimum vesting period of one year from the grant date. All granted options will vest over a three-year period, and employees must exercise the options within 120 days from the vesting date.",
            "Sentiment": "neutral",
            "PublishDate": 1762374846614,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Appoints Mohanraj S as Chief Human Resources Officer",
            "Summary": "Solara Active Pharma Sciences Limited appointed Mohanraj S as Chief Human Resources Officer and designated him as Senior Management Personnel effective November 5, 2025. The appointment was approved by the Board of Directors based on the Nomination and Remuneration Committee's recommendation. Mohanraj brings over 30 years of cross-industry experience spanning Pharma, Biotech, Engineering, Aerospace, Apparel, and Media sectors. His expertise includes Talent Management, Employee Relations, Organizational Development, HRIS, and Digital Transformation. He previously held HR leadership positions at Mylan Laboratories, The Manipal Group, and Tata Advanced Materials. Mohanraj holds a Masters in Social Work (HRM) from Madras University and a BA in Behavioural Sciences from St. Josephs College, Bangalore. He is also a certified ISO auditor and has served on the Board of Studies for Industrial Relations at St. Josephs University for two decades.",
            "Sentiment": "positive",
            "PublishDate": 1762371628370,
            "Source": "corporate_governance"
        },
        {
            "Title": "Solara Active Pharma Sciences Makes Key Leadership and Compensation Changes",
            "Summary": "Solara Active Pharma Sciences' Board of Directors approved several organizational changes. The company appointed Sarat Kumar Asuri, who serves as Chief Financial Officer, to the additional role of Chief Investor Relations Officer. The board also revised the remuneration of Whole-time Director Mohan Muthunarayanan within previously approved shareholder limits and updated compensation for eligible Senior Management Personnel. Additionally, the company reviewed and confirmed its existing Risk Management Policy.",
            "Sentiment": "neutral",
            "PublishDate": 1762338671814,
            "Source": "corporate_governance"
        },
        {
            "Title": "Solara Active Pharma Sciences Non-Executive Director Resigns, Board Committees Reconstituted",
            "Summary": "Kartheek Chintalapati Raju resigned from his position as Non-Executive Director of Solara Active Pharma Sciences Limited effective November 05, 2025, citing preoccupation and personal commitments. His resignation also resulted in his departure from the Stakeholders Relationship Committee and Nomination and Remuneration Committee. The Board reconstituted both committees on the same date. The new Stakeholders Relationship Committee includes Dr. Kausalya Santhanam as Chairperson, Sandeep Shashikantharao as Executive Director-Member, and Manish Gupta as Non-Executive Director-Member. The reconstituted Nomination Remuneration Committee comprises Rajendra Kumar Srivastava as Chairperson, along with members Dr. Kausalya Santhanam, R Ramakrishnan, and Rajiv Vijay Nabar, all serving as Independent Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1762336864425,
            "Source": "corporate_governance"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Solara Active Pharma Sciences Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved the consolidated and standalone financial results during a meeting held on November 5, 2025, which commenced at 12:00 PM and concluded at 1:50 PM. The results were reviewed by Deloitte Haskins Sells LLP as statutory auditors. The consolidated results include financial information from 2 subsidiaries that were not reviewed by their auditors, reflecting total assets of Rs 6.74 crores as of September 30, 2025, with nil revenue for both the quarter and six months ended September 30, 2025. The subsidiaries reported net losses of Rs 0.02 crores and Rs 0.03 crores for the quarter and six months respectively. The auditors noted that these subsidiary financial information are not material to the Group. The financial results are prepared in accordance with Indian Accounting Standard 34 and comply with SEBI listing regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1762335352580,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Receives Rs. 4.88 Crore Call Money, Converts Partly Paid-Up Rights Shares",
            "Summary": "Solara Active Pharma Sciences received first call money of Rs. 4.88 crore for 3,71,779 partly paid-up rights equity shares. The company's Rights Issue Committee approved converting these shares from Rs. 3.50 paid-up to Rs. 7 paid-up per share. The first call amount was Rs. 131.25 per share on outstanding partly paid-up equity shares that were allotted on June 19, 2024. Following this conversion, the company's paid-up capital increased to Rs. 44.47 crore, comprising 3,61,54,267 fully paid-up equity shares, 1,17,61,546 partly paid-up rights shares with Rs. 7 paid-up, and 2,37,209 partly paid-up rights shares with Rs. 3.50 paid-up. The company will take steps for corporate actions and obtaining listing approvals for the converted shares.",
            "Sentiment": "positive",
            "PublishDate": 1755330891649,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports No Deviation in Rights Issue Proceeds Utilization for Quarter Ended June 30, 2025",
            "Summary": "Solara Active Pharma Sciences Limited submitted its monitoring agency report for the quarter ended June 30, 2025, confirming no deviation in the utilization of Rights Issue proceeds from stated objectives. The company raised Rs 449.95 crore through a Rights Issue conducted from May 28, 2024 to June 11, 2024. CRISIL Ratings Limited, the appointed monitoring agency, reported that Rs 292.75 crore has been utilized out of the total net proceeds of Rs 446.95 crore, with Rs 154.2 crore remaining unutilized. The funds were deployed for repayment of borrowings (Rs 233.61 crore utilized) and general corporate purposes (Rs 59.14 crore utilized). The company repaid loans to HDFC, RBL Bank, Yes Bank, and Radiant Computech Private Limited. Rs 10.97 crore remains in the monitoring agency account, with Rs 134.99 crore yet to be raised through a second call planned for FY 27.",
            "Sentiment": "neutral",
            "PublishDate": 1755082705830,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports Strong Q1 FY26 Results with 15% Revenue Growth",
            "Summary": "Solara Active Pharma Sciences delivered revenue of INR320 crores in Q1 FY26, marking 15% quarter-on-quarter growth. The company achieved gross margin of 54% and EBITDA of INR57 crores, reflecting 13% quarter-on-quarter growth. This represents the highest PAT in 12 quarters at INR105 million, resulting in EPS of INR2.5 per share. Developed markets contributed 77% of total sales. The company reduced debt by INR143 crores, bringing net debt-to-EBITDA ratio to 2.7x. Ibuprofen and derivatives contributed approximately 30% of business, down from previous 50% dependency. Management guided for 10% revenue growth and 15-20% EBITDA growth for FY26. The company operates at 60-65% capacity utilization and plans to carve out its CRAMS and polymer business into a separate entity with INR200 crores debt transfer.",
            "Sentiment": "positive",
            "PublishDate": 1753786393980,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Reports No Deviation in Rights Issue Fund Utilization",
            "Summary": "Solara Active Pharma Sciences Limited confirmed no deviation in the utilization of proceeds from its Rights Issue for the quarter ended June 30, 2025. The company raised Rs. 149.49 crores through the Rights Issue on May 06, 2025, with funds allocated for repayment of borrowings (Rs. 115 crores) and general corporate purposes (Rs. 23.27 crores). Out of the total funds raised, Rs. 138.27 crores were utilized during the quarter, while Rs. 0.26 crores remained in the escrow account and Rs. 10.96 crores in the monitoring account for future utilization. The Audit Committee reviewed and approved the statement without any comments. CRISIL Ratings Limited serves as the monitoring agency for the fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1753431769319,
            "Source": "corporate_action"
        },
        {
            "Title": "Solara Active Pharma Reports Strong Q1 Results with 36% EBITDA Growth and Appoints New Chief Risk Officer",
            "Summary": "Solara Active Pharma Sciences reported quarterly results for the period ended June 30, 2025, showing revenue of Rs 319.15 crores compared to Rs 363.49 crores in the same quarter last year, representing a 12% year-over-year decline. However, the company achieved significant profitability improvements with profit after tax of Rs 10.52 crores versus a loss of Rs 13.46 crores in the previous year. EBITDA grew 36% year-over-year to Rs 57.5 crores with margins expanding to 18.0% from 11.6%. Gross margins improved substantially to 54.1% from 44.5% year-over-year, driven by better regulated market mix and focus on profitable products. The company reduced gross debt from Rs 776 crores to Rs 632.7 crores during the quarter. Regulated markets constituted 77% of total revenues. The Board also appointed Rajesh Patro as Chief Risk Officer. The company expects to raise an additional Rs 134.99 crores through pending rights issue calls and is exploring a demerger of its CRAMS and Polymers business into a separate listed entity.",
            "Sentiment": "positive",
            "PublishDate": 1753430821106,
            "Source": "earnings"
        },
        {
            "Title": "Solara Active Pharma Sciences Schedules Q1 FY26 Results Conference Call for July 25, 2025",
            "Summary": "Solara Active Pharma Sciences Limited has scheduled a conference call with investors and analysts on July 25, 2025, at 4:00 pm IST to discuss the company's financial results for the quarter ended June 30, 2025. The call will be led by key executives including Arun Kumar (Founder & Non-Executive Director), Sandeep Rao (MD & CEO), and Sarat Kumar (CFO). Participants can join via provided phone numbers or register early through the DiamondPass registration link. The company describes itself as a pure play APIs business.",
            "Sentiment": "neutral",
            "PublishDate": 1753160798171,
            "Source": "stock"
        }
    ]
}