{
    "Symbol": "SOLARINDS",
    "ISIN": "INE343H01029",
    "News": [
        {
            "Title": "Solar Industries Redeems Rs 50 Crore Commercial Paper",
            "Summary": "Solar Industries India Limited successfully redeemed its Rs 50 crore commercial paper on the due date of February 09, 2026, fulfilling its payment obligation to ICICI Bank Limited.",
            "Sentiment": "positive",
            "PublishDate": 1770655555154,
            "Source": "stocks"
        },
        {
            "Title": "Solar Industries Targets 27-28% EBITDA Margins",
            "Summary": "Solar Industries expects to maintain EBITDA margins at 27-28% over the next 3-5 years, driven by growth in defense and international business segments.",
            "Sentiment": "positive",
            "PublishDate": 1770263363057,
            "Source": "stocks"
        },
        {
            "Title": "Solar Industries Projects 15% Annual Growth",
            "Summary": "Solar Industries management expresses confidence in achieving 15% annual growth, with expectations of over 20% growth in 3-5 years driven by mining and defense sectors.",
            "Sentiment": "positive",
            "PublishDate": 1770263336485,
            "Source": "stocks"
        },
        {
            "Title": "Solar Industries Eyes Futuristic Tech Programs",
            "Summary": "Solar Industries management expresses strong interest in advanced technology programs including humanoid robots and other futuristic technologies during recent conference call.",
            "Sentiment": "positive",
            "PublishDate": 1770184717973,
            "Source": "stocks"
        },
        {
            "Title": "Solar Industries Projects ₹1626 Cr Defence Revenue",
            "Summary": "Solar Industries projects defence revenue of ₹1626 crores for 9M FY26, representing 54% achievement of full-year guidance of ₹3000 crores, indicating strong progress in defence segment.",
            "Sentiment": "positive",
            "PublishDate": 1770112409763,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solar Industries Q3 Net Profit Rises 42.86% YoY",
            "Summary": "Solar Industries reported consolidated net profit of ₹4.5 billion for Q3, marking significant growth from ₹3.15 billion in the previous year and exceeding analyst estimates of ₹4.35 billion.",
            "Sentiment": "positive",
            "PublishDate": 1770111325314,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solar Industries Wins ₹830 Crore Defence Export Order",
            "Summary": "Solar Industries India Limited and its subsidiary secured export orders worth ₹830 crores for defence products from international clients, to be delivered over 4 years.",
            "Sentiment": "positive",
            "PublishDate": 1769760376586,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solar Industries Seeks Shareholder Approval for New Director",
            "Summary": "Solar Industries India Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Shri Ramesh Madhavrao Bhujang as an Independent Director through remote e-voting from January 24 to February 23, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769162430786,
            "Source": "co_actions_results"
        },
        {
            "Title": "Defence Minister Inaugurates Solar Industries' Facility",
            "Summary": "Hon'ble Raksha Mantri Shri Rajnath Singh inaugurated Solar Defence and Aerospace Limited's state-of-the-art Medium Calibre Ammunition Manufacturing facility in Nagpur on January 18, 2026, strengthening indigenous defence capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1768804128468,
            "Source": "stocks"
        },
        {
            "Title": "Solar Industries Wins ₹1,746 Cr Additional CIL Order",
            "Summary": "Solar Industries India secures additional ₹1,746 crore order from Coal India Limited for bulk explosives, bringing total order value to ₹2,229 crores with two-year delivery timeline.",
            "Sentiment": "positive",
            "PublishDate": 1767164695349,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solar Industries Issues ₹100 Crore Commercial Paper",
            "Summary": "Solar Industries India Limited has issued commercial paper worth ₹100 crores on December 23, 2025, as per regulatory filing under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1766495680204,
            "Source": "co_actions_results"
        },
        {
            "Title": "Solar Industries India's Independent Director Jagdish Chandra Belwal Completes Tenure",
            "Summary": "Jagdish Chandra Belwal (DIN: 08644877) ceased to be Non-Executive Independent Director of Solar Industries India Limited effective December 5, 2025, upon completion of his first term. The Board and Management acknowledged his contributions during his association with the company over the years.",
            "Sentiment": "neutral",
            "PublishDate": 1764932592543,
            "Source": "corporate_governance"
        },
        {
            "Title": "Solar Industries India Appoints Ramesh M. Bhujang as Independent Director",
            "Summary": "Solar Industries India Limited appointed Shri Ramesh M. Bhujang as Additional Director (Non-Executive Independent Director) for a two-year term effective December 3, 2025, subject to shareholder approval. The appointee brings over four decades of experience in banking, infrastructure finance and industrial development, having held senior roles at L&T Infrastructure Finance Ltd and Asian Finance Investment Corporation Ltd.",
            "Sentiment": "positive",
            "PublishDate": 1764846318727,
            "Source": "corporate_governance"
        },
        {
            "Title": "Solar Industries India Secures INR 1400 Crores Export Orders for Defence Products",
            "Summary": "Solar Industries India Limited and its subsidiary have received export orders worth INR 1400 crores for supply of defence products to be delivered over a 4-year period. The significant order win strengthens the company's defence export portfolio and provides multi-year revenue visibility for Solar Industries and its stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1763451078715,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries Seeks Shareholder Approval for Two Independent Director Appointments via Postal Ballot",
            "Summary": "Solar Industries India Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Smt. Girija Balakrishnan and Shri Viswanathan Lakshmanan as Independent Directors for five-year terms. The remote e-voting process runs from November 18, 2025 to December 17, 2025, with results to be announced by December 19, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763374684764,
            "Source": "corporate_action"
        },
        {
            "Title": "Solar Industries Reports Record Q2 Performance with 21% Revenue Growth and Strong Defense Expansion",
            "Summary": "Solar Industries achieved record quarterly EBITDA of INR 582 crores and PAT of INR 361 crores in Q2 FY26, with total revenue growing 21% to INR 2,082 crores driven by international business expansion and defense segment crossing INR 500 crores. The company maintains its annual guidance despite domestic market challenges from prolonged monsoons affecting coal mining activities, with defense revenue showing 57% growth and international business recording highest-ever quarterly sales of INR 960 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763118824523,
            "Source": "earnings"
        },
        {
            "Title": "Solar Industries India Issues Rs. 50 Crore Commercial Paper",
            "Summary": "Solar Industries India Limited has issued commercial paper worth Rs. 50 crores on November 11, 2025. The company informed stock exchanges NSE and BSE about this debt instrument issuance. The commercial paper represents a short-term funding arrangement for the explosives and chemicals manufacturer. No payment delays or defaults were reported in connection with this issuance.",
            "Sentiment": "neutral",
            "PublishDate": 1762899140719,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries India Reports Quarterly Results and Approves Director Appointments",
            "Summary": "Solar Industries India Limited's Board of Directors approved unaudited financial results for the quarter and half year ended September 30, 2025. The company also approved a postal ballot notice seeking shareholder consent for the appointment of Smt. Girija Balakrishnan and Shri Viswanathan Lakshmanan as Non-Executive Directors for a five-year term. During the half year period, the company partially redeemed non-convertible debentures worth ₹15.84 crore and made interest payments totaling ₹1.42 crore. The outstanding NCD amount as of September 30, 2025 stands at ₹22.50 crore. The Board meeting was held on November 10, 2025, and the statutory auditors conducted a limited review of the financial results.",
            "Sentiment": "neutral",
            "PublishDate": 1762810081515,
            "Source": "earnings"
        },
        {
            "Title": "Solar Industries Expects Strong Orderbook to Drive FY26 Targets with Defense Growth Phase",
            "Summary": "Solar Industries expressed confidence that its strong orderbook will help the company achieve its FY26 targets. The company indicated that Q3 marks the beginning of a new growth phase in its defense segment.",
            "Sentiment": "positive",
            "PublishDate": 1762767315083,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries India Reports Strong Q2 Growth with Revenue Up 21% Year-on-Year",
            "Summary": "Solar Industries India delivered robust quarterly performance with revenue rising to 20.8 billion rupees from 17.2 billion rupees in the same period last year. Consolidated net profit increased to 3.5 billion rupees compared to 2.9 billion rupees year-on-year. EBITDA grew to 5.5 billion rupees from 4.46 billion rupees, while EBITDA margin improved to 26.6% from 26% in the previous year period.",
            "Sentiment": "positive",
            "PublishDate": 1762765296659,
            "Source": "earnings"
        },
        {
            "Title": "Solar Industries India Gets Commercial Paper Rating Revalidation from ICRA",
            "Summary": "ICRA Limited has revalidated the credit rating for Solar Industries India Limited's commercial paper program worth Rs. 250 crores, maintaining the [ICRA]A1+ rating with Outstanding status. The revalidation was requested by Solar Industries and confirms the rating validity that was last communicated in February 2025. The rating applies to the company's commercial paper issuance program, with ICRA noting that if the instrument is not issued within 3 months, the rating would need revalidation before issuance. Once issued, the rating remains valid throughout the program's life with a maximum maturity of twelve months.",
            "Sentiment": "neutral",
            "PublishDate": 1762250321514,
            "Source": "corporate_action"
        },
        {
            "Title": "Solar Industries Partners with Alpha Defence for CSIR-NAL Loitering Munition Production",
            "Summary": "Solar Industries has selected Alpha Defence as its partner for the production of CSIR-NAL loitering munitions. This partnership involves Solar Industries in the defense manufacturing sector, specifically in the development of loitering munition systems in collaboration with CSIR-NAL (Council of Scientific and Industrial Research - National Aerospace Laboratories).",
            "Sentiment": "positive",
            "PublishDate": 1761717567557,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries India Completes Rs. 113.89 Crore Block Trade on NSE",
            "Summary": "Solar Industries India executed a block trade worth Rs. 113.89 crores on the National Stock Exchange. The transaction involved approximately 81,120 shares at a price of Rs. 14,040 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1761627772265,
            "Source": "order&deals"
        },
        {
            "Title": "Solar Industries Secures INR 483 Crore Bulk Explosives Contract",
            "Summary": "Solar Industries India Limited has received an order worth INR 483 crore from South Eastern Coalfields Limited for the delivery of bulk explosives over a two-year period.",
            "Sentiment": "positive",
            "PublishDate": 1759915294817,
            "Source": "order&deals"
        },
        {
            "Title": "Solar Industries India Completes Interest Payment and Partial Redemption of 50 NCDs",
            "Summary": "Solar Industries India Limited made a quarterly interest payment of ₹18,60,164.39 (net of TDS) on September 23, 2025, for its Non-Convertible Debentures with ISIN INE343H08016. The company also completed partial redemption of 50 NCDs worth ₹5 crores on the same date. The debenture issue has a total size of ₹60 crores, with ₹5 crores remaining outstanding after the redemption. The gross interest amount was ₹20,66,849.32 before TDS deduction of ₹2,06,684.93. The redemption was conducted on a lot basis by quantity at maturity.",
            "Sentiment": "positive",
            "PublishDate": 1758625293657,
            "Source": "corporate_action"
        },
        {
            "Title": "Solar Industries India Completes Interest Payment and Partial Redemption of 292 NCDs Worth Rs 2.92 Crores",
            "Summary": "Solar Industries India Limited made timely payment of interest and principal for partial redemption of 292 Non-convertible Debentures. The company paid quarterly interest of Rs 42.37 lakh (net Rs 38.14 lakh after 10% TDS) on September 22, 2025, for NCDs with ISIN INE343H08024 having an issue size of Rs 35 crores. The partial redemption was conducted on a lot basis for maturity reasons, with 292 NCDs redeemed for Rs 2.92 crores, leaving an outstanding amount of Rs 17.50 crores. The interest payment record date was September 5, 2025, with the last interest payment made on June 20, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758542991606,
            "Source": "corporate_action"
        },
        {
            "Title": "Solar Industries India Appoints Two New Independent Directors",
            "Summary": "Solar Industries India Limited appointed two new Additional Directors to strengthen its board. Ms. Girija Balakrishnan, a law graduate from National Law School of India with over 31 years of experience in Corporate Laws, Mergers and Acquisitions, and Commercial Laws, was appointed as Non-Executive Independent Director for a five-year term effective September 18, 2025. Shri Viswanathan Lakshmanan, a Fellow Member of the Institute of Cost Accountants of India and Certified Public Accountant from the USA with 42 years of leadership experience across Financial Services, Information Technology, Media and Pharma industries, was appointed as Non-Executive Independent Director for a five-year term effective October 18, 2025. Both appointments were approved by the Board of Directors on September 17, 2025, based on recommendations from the Nomination and Remuneration Committee, and are subject to shareholder approval. Neither director is related to existing board members or debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1758112351949,
            "Source": "corporate_governance"
        },
        {
            "Title": "Tata Sons Chairman Visits Solar Industries' Defence Facility in Nagpur",
            "Summary": "N. Chandrasekaran, Chairman of Tata Sons, toured Solar Industries India's defence facility located in Nagpur.",
            "Sentiment": "neutral",
            "PublishDate": 1758016493568,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries Reports 28% Revenue Growth Driven by Defense and International Expansion",
            "Summary": "Solar Industries India Limited reported revenue of INR 2,154 crores, up 28% from INR 1,685 crores in the previous year quarter. The company achieved its highest ever quarterly EBITDA of INR 564 crores and PAT of INR 353 crores. Defense segment revenue surged 115% to INR 418 crores, while international business grew 43% to INR 826 crores. The company holds a defense order book of INR 15,000 crores and successfully tested Bhargavastra and Rudrastra missiles. Management targets INR 10,000 crore revenue for FY2026, including INR 3,000 crore from defense and INR 3,500-4,000 crore from international operations. The company plans INR 2,500 crores in capex investments. Early monsoon conditions impacted domestic explosives demand in the mining sector.",
            "Sentiment": "positive",
            "PublishDate": 1757050316721,
            "Source": "earnings"
        },
        {
            "Title": "Solar Industries Reports Factory Explosion with One Fatality and Eight Injuries",
            "Summary": "Solar Industries India Ltd experienced an explosion at its Chakdoh factory on September 4, 2025, resulting in one death and eight injuries. The company has activated safety systems and launched an investigation into the incident. Solar Industries has confirmed that adequate insurance coverage is in place to address the situation.",
            "Sentiment": "negative",
            "PublishDate": 1756963136968,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries Reports Record Q1 Results with 28% Revenue Growth to INR 2,154 Crores",
            "Summary": "Solar Industries India Limited achieved record quarterly performance with revenue of INR 2,154 crores, marking 28% year-on-year growth. The company posted highest-ever quarterly EBITDA of INR 564 crores and PAT of INR 353 crores. International business grew 43% to INR 826 crores, while defense revenue surged 115% to INR 418 crores. The company maintains a defense order book of INR 15,000 crores and expects to achieve annual revenue guidance of INR 10,000 crores, with INR 3,000 crores from defense segment. Domestic explosive demand was impacted by early monsoon and milder heat waves. The company successfully tested Bhargavastra and Rudrastra products and plans to start commercial production of 155mm shells. Management expects Pinaka rocket series commercialization from end of Q2 or start of Q3.",
            "Sentiment": "positive",
            "PublishDate": 1754911910599,
            "Source": "earnings"
        },
        {
            "Title": "Solar Industries Projects Overseas Revenue of ₹35-40 Billion for FY26",
            "Summary": "Solar Industries anticipates generating overseas revenue between ₹35-40 billion in FY26. This projection was shared during the company's conference calls.",
            "Sentiment": "positive",
            "PublishDate": 1754633853515,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries Targets 15% Volume Growth in FY26",
            "Summary": "Solar Industries management announced during a conference call that the company is targeting 15% volume growth in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754633026142,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries Plans to Start 155MM Artillery Shell Production",
            "Summary": "Solar Industries announced plans to begin production of 155MM artillery shells. The information was shared during a conference call with stakeholders.",
            "Sentiment": "positive",
            "PublishDate": 1754632585104,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries Reports 19% Defence Revenue Share in Q1FY26, Targets 30% for Full Year",
            "Summary": "Solar Industries achieved 19% of its revenue from defence operations in Q1FY26. The company has set guidance for defence revenue to reach 30% of total revenue for the full fiscal year FY26.",
            "Sentiment": "positive",
            "PublishDate": 1754561991011,
            "Source": "stock"
        },
        {
            "Title": "Solar Industries India Reports Strong Q1 Growth with Revenue Up 26% Year-on-Year",
            "Summary": "Solar Industries India delivered robust Q1 performance with revenue rising to 21.5 billion rupees from 17 billion rupees in the previous year. EBITDA increased to 5.34 billion rupees compared to 4.5 billion rupees year-on-year, though EBITDA margin compressed to 24.79% from 27%. Consolidated net profit grew to 3.4 billion rupees versus 2.9 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1754559876918,
            "Source": "earnings"
        },
        {
            "Title": "Solar Industries India Revises Conference Call Invitation Due to Technical Error",
            "Summary": "Solar Industries India Limited issued a revised intimation for a conference call scheduled for August 8, 2025, at 11:00 AM IST to discuss Q1 FY2026 unaudited financial results for the quarter ended June 30, 2025. The revision was necessary to correct a broken virtual meeting link in the earlier invitation sent on August 2, 2025. The call will be hosted by Phillip Capital and feature company management including MD & CEO Manish Nuwal, Joint CFOs Moneesh Agrawal and Shalinee Mandhana, and other executives. All other conference call details remain unchanged from the original invitation.",
            "Sentiment": "neutral",
            "PublishDate": 1754138244581,
            "Source": "earnings"
        },
        {
            "Title": "Solar Industries India Ltd: Block Trade on NSE",
            "Summary": "A block trade of approximately 40,008 shares of Solar Industries India Ltd occurred on the National Stock Exchange (NSE). The total value of the trade was Rs. 61.67 crores, with shares priced at Rs. 15,415.00 each.",
            "Sentiment": "neutral",
            "PublishDate": 1752557830000,
            "Source": "block_details"
        },
        {
            "Title": "Solar Industries India Ltd: Secures ₹158 Crore Defence Contract",
            "Summary": "Solar Industries India Ltd has won a ₹158 crore contract to supply defence products to the Ministry of Defence, to be executed within a year. The company recently reported a 43.4% increase in Q4 net profit to ₹348 crore, with revenue up 34.5% at ₹2,166.6 crore.",
            "Sentiment": "positive",
            "PublishDate": 1750666427000,
            "Source": "order&deals"
        },
        {
            "Title": "Solar Industries Secures ₹160 Crore Contract",
            "Summary": "Solar Industries has secured a contract valued at ₹160 crore. No further details about the nature of the contract or the client were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1750663312000,
            "Source": "default"
        },
        {
            "Title": "Solar Industries Receives Order for 450 Nagastra-1R Loitering Munitions from Indian Army",
            "Summary": "Solar Industries' Defence Division has secured an order from the Indian Army for 450 Nagastra-1R Loitering Munitions. This order signifies a notable development in the company's defence sector business, particularly in advanced military technology.",
            "Sentiment": "positive",
            "PublishDate": 1750658918000,
            "Source": "default"
        },
        {
            "Title": "Solar Industries Secures 402 Crore Rupees Order",
            "Summary": "Solar Industries has won an order worth 402 crore rupees. No further details about the nature of the order or the client were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1748835571000,
            "Source": "default"
        },
        {
            "Title": "Solar Industries India Ltd: Defence Stock Soars Post Operation Sindoor",
            "Summary": "Solar Industries India Ltd's market cap has increased by Rs 27,000 crore in a month following Operation Sindoor. The company's stock has risen 25.11% since the Pahalgam attack, with its current market cap at Rs 1.46 lakh crore. Q4 results show a 37% jump in consolidated net profit. The company has an order book of Rs 17,000 crore and aims for Rs 100 billion in overall revenue by fiscal 2026.",
            "Sentiment": "positive",
            "PublishDate": 1748421102000,
            "Source": "normal_news"
        },
        {
            "Title": "Solar Industries: Projects ₹10,000 Crore Revenue for FY26, Defence Business to Double",
            "Summary": "Solar Industries expects revenue of ₹10,000 crore in FY26, a 33% growth. Defence business projected to contribute ₹3,000 crore, doubling from FY25. Company plans ₹2,500 crore capex for FY26. Q4 results show 43.4% growth in net profit to ₹348 crore and 34.5% revenue growth to ₹2,166.6 crore. Dividend of ₹10 per share declared.",
            "Sentiment": "positive",
            "PublishDate": 1747736562000,
            "Source": "earnings"
        },
        {
            "Title": "Solar Industries India Reports Annual Defence Revenue of Rs 1355 Crore",
            "Summary": "Solar Industries India has reported an annual defence revenue of Rs 1355 crore, which falls short of the company's guidance of Rs 1500 crore.",
            "Sentiment": "negative",
            "PublishDate": 1747734931000,
            "Source": "default"
        },
        {
            "Title": "Solar Industries India Reports Strong EBITDA Margin and Declares Dividend",
            "Summary": "Solar Industries India has reported a full-year EBITDA margin of 26%, exceeding their guidance range of 23-25%. The company has also declared a dividend of 10 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747733869000,
            "Source": "result"
        },
        {
            "Title": "Solar Industries India Reports Q4 Financial Results",
            "Summary": "Solar Industries India has announced its Q4 financial results. The company's EBITDA increased to 5.39 billion rupees from 3.54 billion rupees year-over-year. The EBITDA margin improved to 24.91% from 21.96% in the same period. Revenue rose to 22 billion rupees from 16.1 billion rupees year-over-year. The consolidated net profit for Q4 reached 3.2 billion rupees, up from 2.35 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1747733559000,
            "Source": "result"
        },
        {
            "Title": "Solar Industries: Nagastra Drone Success Boosts Stock to 52-Week High",
            "Summary": "Solar Industries shares hit a 52-week high of Rs 13,934.90 after the government confirmed the use of Nagastra drones in Operation Sindoor. The company, in collaboration with ZMotion, developed these precision strike drones. The Indian Army received its first batch of Nagastra-1 drones in June 2024. The drones feature GPS-enabled precision strikes, a 30 km autonomous range, and 60-minute flight endurance.",
            "Sentiment": "positive",
            "PublishDate": 1747295035000,
            "Source": "normal_news"
        },
        {
            "Title": "Indian Army Uses Solar Industries' Nagastra Drones in Strike on Pakistan",
            "Summary": "The Indian Army has reportedly conducted a drone strike on Pakistan using Nagastra drones manufactured by Solar Industries. This marks a significant use of domestically produced military technology in an international operation.",
            "Sentiment": "neutral",
            "PublishDate": 1746762876000,
            "Source": "default"
        },
        {
            "Title": "Solar Industries India Ltd. Sees Significant Block Trade on NSE",
            "Summary": "A block trade of approximately 30,087 shares of Solar Industries India Ltd. was executed on the National Stock Exchange (NSE) for Rs. 28.29 Crores. The trade was carried out at a price of Rs. 9401.70 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1741328469000,
            "Source": "block_deals"
        }
    ]
}