{
    "Symbol": "SOMATEX",
    "ISIN": "INE314C01013",
    "News": [
        {
            "Title": "Soma Textiles Wins ₹343.95 Cr Construction Orders",
            "Summary": "Soma Textiles & Industries secures two major expressway construction contracts worth ₹343.95 crores from holding company Roadways Solutions India Infra Ltd for projects in Maharashtra and Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1766147461513,
            "Source": "co_actions_results"
        },
        {
            "Title": "Soma Textiles Secures ₹281 Crore Orders",
            "Summary": "Soma Textiles & Industries announces receipt of significant orders worth ₹281 crores, marking a major business development for the textile company.",
            "Sentiment": "positive",
            "PublishDate": 1766147278730,
            "Source": "co_actions_results"
        },
        {
            "Title": "Soma Textiles Postal Ballot Results Announced",
            "Summary": "Soma Textiles & Industries Limited announces successful completion of postal ballot process with all 12 resolutions passed. Key appointments include new independent directors and managing director positions.",
            "Sentiment": "positive",
            "PublishDate": 1765798645746,
            "Source": "co_actions_results"
        },
        {
            "Title": "Soma Textiles Reports Rs 300 Lakh Profit Amid Complete Promoter Change and Business Transformation",
            "Summary": "Soma Textiles Industries Limited reported a profit of Rs 300 lakhs for the quarter and half-year ended September 30, 2025, driven by trading activities and mutual fund investments after stopping manufacturing operations. The company underwent a complete promoter and management change through a share purchase agreement dated July 9, 2025, with new promoters Roadway Solutions India Infra Limited and the Gadhoke family taking control from the Somany family.",
            "Sentiment": "neutral",
            "PublishDate": 1763199567325,
            "Source": "earnings"
        },
        {
            "Title": "Soma Textiles Industries Seeks Shareholder Approval for Multiple Related Party Transactions Worth ₹6,100 Crore",
            "Summary": "Soma Textiles Industries has issued a postal ballot notice seeking shareholder approval for material related party transactions totaling ₹6,100 crore, including ₹5,300 crore with Roadways Solutions India Infra Limited and several other transactions with group entities. The company also proposes to appoint new independent directors, increase borrowing powers to ₹800 crore, and explore opportunities in tyre manufacturing with investments up to ₹100 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1763062065658,
            "Source": "corporate_action"
        },
        {
            "Title": "Soma Textiles Industries Appoints Two Independent Directors and Approves Material Related Party Transactions",
            "Summary": "Soma Textiles Industries Limited's Board of Directors approved several key decisions during a meeting held on November 5, 2025. The company appointed Mrs. Sunita Gangadhar Jamkhande and Mrs. Archana Dheeraj Sonaikar as additional independent directors. The Board approved material related party transactions with Roadway Solutions India Infra Limited for road project execution through EPC/HAM mode and inter-corporate deposits. Additional related party transactions were approved with Vadodra-Mumbai Express Package-8, Package-9, and Mumbai-Falcon for inter-corporate deposits. Other approvals included reconstitution of Board committees following an acquisition, appointment of DSK Legal as legal adviser, increase in borrowing powers under the Companies Act 2013, and enhanced remuneration for Whole-Time Director Shri S B Bhat within his appointment terms.",
            "Sentiment": "positive",
            "PublishDate": 1762375671153,
            "Source": "corporate_governance"
        },
        {
            "Title": "Soma Textiles Directors Sell 74.98% Stake to Roadway Solutions and Associates for Rs 87.67 Crores",
            "Summary": "Soma Textiles & Industries Limited directors have disclosed the sale of 2,47,68,058 equity shares representing 74.98% of the company's paid-up share capital under a Share Purchase Agreement dated July 9, 2025. The buyers include Roadway Solutions India Infra Limited (Acquirer), Ameet Harjinder Gadhoke, and Teja Ranade Gadhoke for a total consideration of Rs 87,67,42,526. The selling directors include Surendra Kumar Somany, Arvind Kumar Somany, their respective HUFs, Prasann Arvindkumar Somany, and Sarvopari Investment Pvt Ltd. Surendra Kumar Somany sold 36,65,735 shares (11.10%), with 3,33,834 shares going to Roadway Solutions and 33,31,901 shares to Ameet Harjinder Gadhoke. Surendra Kumar Somany HUF sold 74,02,578 shares (4.25%) to Ameet Harjinder Gadhoke, while Sarvopari Investments sold 76,572,996 shares (49.99%) to Roadway Solutions India Infra Limited.",
            "Sentiment": "neutral",
            "PublishDate": 1760518159854,
            "Source": "corporate_action"
        },
        {
            "Title": "Teja Ranade Gadhoke Acquires 2.60% Stake in Soma Textiles as Part of 74.98% Share Purchase Deal",
            "Summary": "Teja Ranade Gadhoke acquired 858,531 equity shares representing 2.60% of Soma Textiles & Industries Limited through an off-market transaction on October 13, 2025. This acquisition is part of a larger share purchase agreement where buyers including Roadway Solutions India Infra Limited, Ameet Harjinder Gadhoke, and Teja Ranade Gadhoke are acquiring 24,768,058 shares representing 74.98% of the company's paid-up equity share capital for a total consideration of Rs. 87.67 crores. Following this transaction, Gadhoke's total holding in Soma Textiles increased from 3.38% to 5.98%. The company's shares are listed on BSE and NSE, with a total equity share capital of Rs. 33.03 crores divided into 33,033,000 equity shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1760507208675,
            "Source": "order&deals"
        },
        {
            "Title": "Soma Textiles & Industries Merges With Subsidiary to Enhance Operational Efficiency",
            "Summary": "Soma Textiles & Industries has merged with its subsidiary as part of efforts to improve operations. The company aims to achieve better efficiency and reduce costs through this merger.",
            "Sentiment": "positive",
            "PublishDate": 1760355192565,
            "Source": "corporate_action"
        },
        {
            "Title": "Soma Textiles Undergoes Complete Board Restructuring with New Leadership Team",
            "Summary": "Soma Textiles & Industries Ltd announced significant board changes effective October 10, 2025, following a share purchase agreement dated July 9, 2025. The company appointed three new directors: Mr. Ameet Harjinder Gadhoke as Additional Director and Managing Director, Mrs. Teja Ranade Gadhoke as Additional Director and Non-executive Chairperson, and Mr. Narsingh Narain Giri as Additional Director and Non-Executive Independent Director. All appointments are subject to shareholder approval. Simultaneously, five directors resigned: Shri. Surendra Kumar Somany (Chairman and Director), Shri. Arvind Kumar Somany (Managing Director), Shri Om Prakash Laxminarayan Kabra (Non-Executive Independent Director), Shri Amit Nandkishore Shah (Non-Executive Independent Director), and Smt Rita Chatterjee (Non-Executive Independent Director). The changes stem from a share purchase agreement where the Somany family and Sarvopari Investments Private Limited sold their stakes to Roadway Solutions India Infra Limited and the Gadhoke family. Mr. Ameet Gadhoke brings over two decades of road construction experience, while Mrs. Teja Gadhoke has twenty years of finance and actuarial expertise. The couple are married to each other. All resigning directors confirmed no material reasons for resignation beyond those mentioned in their resignation letters.",
            "Sentiment": "neutral",
            "PublishDate": 1760346449601,
            "Source": "corporate_governance"
        },
        {
            "Title": "Soma Textiles Promoter Surendra Kumar Somany Sells 11.70% Stake to Roadway Solutions",
            "Summary": "Surendra Kumar Somany, a promoter of Soma Textiles & Industries Limited, has sold 36,65,725 equity shares representing 11.70% of the company to Roadway Solutions India Infra Limited and associated parties Ameet Harjinder Gadhoke and Teja Ranade Gadhoke. Additionally, Surendra Kumar Somany HUF sold 74,02,579 equity shares representing 4.25% of the company to the same buyers. These transactions are part of a larger deal where the buyers are acquiring 2,47,68,058 shares representing 74.95% of the company's paid-up equity share capital for a total consideration of Rs. 87,67,42,526. The transactions were completed through off-market sales on October 09, 2025. The company's total equity share capital remains Rs. 33,03,30,000 divided into 3,30,33,000 equity shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1760345293221,
            "Source": "corporate_action"
        },
        {
            "Title": "Soma Textiles Undergoes Complete Leadership Overhaul Following Share Purchase Agreement",
            "Summary": "Soma Textiles & Industries Ltd announced comprehensive board changes effective October 10, 2025. The company appointed Mr. Ameet Harjinder Gadhoke as Managing Director, Mrs. Teja Ranade Gadhoke as Non-executive Chairperson, and Mr. Narsingh Narain Giri as Non-Executive Independent Director. These appointments follow a share purchase agreement dated July 9, 2025, where shareholding transferred from the Somany family to new purchasers including Roadway Solutions India Infra Limited and the Gadhokes. Simultaneously, five directors resigned: Surendra Kumar Somany (Chairman and Director), Arvind Kumar Somany (Managing Director), Om Prakash Laxminarayan Kabra, Amit Nandkishore Shah, and Rita Chatterjee (all independent directors). The new Managing Director brings over two decades of road construction experience and holds a civil engineering degree with a Master's in Decorative Concrete. The new Chairperson is a Fellow of the Society of Actuaries with 20 years of finance and risk management experience. All appointments are subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1760102387401,
            "Source": "corporate_governance"
        },
        {
            "Title": "Roadway Solutions India Infra Limited Announces Open Offer for 25.02% Stake in Soma Textiles & Industries at INR 47.14 per Share",
            "Summary": "Roadway Solutions India Infra Limited, along with persons acting in concert Ameet Harjinder Gadhoke and Teja Ranade Gadhoke, has announced an open offer to acquire up to 82,64,942 equity shares representing 25.02% of the voting share capital of Soma Textiles & Industries Limited. The offer price is set at INR 47.14 per equity share with a face value of INR 10 each. The pre-offer advertisement and corrigendum to the Detailed Public Statement was published in multiple newspapers including Financial Express, Navshakti, Jansatta, and Ek Din on September 15, 2025. Mefcom Capital Markets Limited is acting as the manager to the open offer. The company has requested stock exchanges BSE and NSE to disseminate the information on their websites.",
            "Sentiment": "neutral",
            "PublishDate": 1757930018858,
            "Source": "order&deals"
        },
        {
            "Title": "Soma Textiles Publishes Independent Directors' Open Offer Recommendations",
            "Summary": "Soma Textiles & Industries Limited published recommendations from its Committee of Independent Directors regarding an open offer to shareholders on September 12, 2025. The recommendations were published in multiple newspapers across different languages including Financial Express (English), Jansatta (Hindi), Navshakti (Marathi), and Ek Din (Bengali). The publication was made in compliance with SEBI regulations under the Substantial Acquisition of Shares and Takeovers framework. The company trades on BSE with script code 521034 and on NSE with symbol SOMATEX.",
            "Sentiment": "neutral",
            "PublishDate": 1757659609880,
            "Source": "corporate_action"
        },
        {
            "Title": "Soma Textiles Modifies Motor Vehicle Sale Terms, Will Settle Outstanding Loans Itself",
            "Summary": "Soma Textiles & Industries Limited has modified the terms of a previously announced sale of two motor vehicles. The company will now sell the vehicles without transferring the associated loan, opting to fully settle the outstanding loan obligation itself. The Board of Directors approved this modification on July 28, 2025, following an earlier intimation dated July 7, 2025. The company is selling a Land Rover Range Rover Sport and a Cayenne V6 to Sarvopari Investment Private Ltd, a promoter shareholder, for Rs 2.46 crore in cash consideration. The vehicles are no longer required for business operations. The transaction is classified as a related party transaction conducted at arm's length, with completion expected on or before September 30, 2025, subject to shareholder approval.",
            "Sentiment": "neutral",
            "PublishDate": 1753706328210,
            "Source": "stock"
        },
        {
            "Title": "Roadway Solutions India Infra Launches Open Offer to Acquire 25.02% Stake in Soma Textiles at ₹47.14 Per Share",
            "Summary": "Roadway Solutions India Infra Limited, along with two individuals acting in concert (Ameet Harjinder Gadhoke and Teja Ranade Gadhoke), has launched an open offer to acquire up to 82,64,942 equity shares representing 25.02% of Soma Textiles & Industries Limited from public shareholders at ₹47.14 per share. The offer follows a share purchase agreement to acquire 74.98% stake from existing promoters at ₹35.40 per share. The acquirer has deposited ₹10 crores in escrow account and the tendering period is scheduled from August 29 to September 12, 2025. Upon completion, the acquirer will gain control and become the new promoter of the textile company.",
            "Sentiment": "neutral",
            "PublishDate": 1753289280324,
            "Source": "order&deals"
        }
    ]
}