{
    "Symbol": "SOMANYCERA",
    "ISIN": "INE355A01028",
    "News": [
        {
            "Title": "Somany Ceramics HR Head Atish Bhattacharya Resigns",
            "Summary": "Somany Ceramics announces resignation of Mr. Atish Bhattacharya from HR Head position effective 2nd February, 2026 due to change in delegation of responsibilities.",
            "Sentiment": "neutral",
            "PublishDate": 1770037288600,
            "Source": "stocks"
        },
        {
            "Title": "Somany Ceramics Plans Debt Reduction to INR 50 Crore",
            "Summary": "Somany Ceramics forecasts external debt reduction to INR 50 crore by FY28, with INR 70 crore repayment planned over FY27-FY28. Gas prices expected stable at INR 42.5-43 for Q4.",
            "Sentiment": "positive",
            "PublishDate": 1769660734177,
            "Source": "stocks"
        },
        {
            "Title": "Somany Ceramics Q3FY26 Results Show Strong Growth",
            "Summary": "Somany Ceramics reported Q3FY26 standalone revenue of Rs. 64,426 lakhs with net profit of Rs. 2,229 lakhs. Company also appointed Biju Sebastian as HR-Head.",
            "Sentiment": "positive",
            "PublishDate": 1769600511669,
            "Source": "co_actions_results"
        },
        {
            "Title": "Somany Ceramics Opens Special Window for Physical Share Transfer",
            "Summary": "Somany Ceramics Limited announces special window for re-lodgement of physical share transfer requests following SEBI circular, with notice amount of ₹18,17,998.00 published in newspapers on December 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766998388535,
            "Source": "stocks"
        },
        {
            "Title": "Somany Ceramics Reports 3.6% Growth Despite Northern Territory Floods and Plant Outage",
            "Summary": "Somany Ceramics Limited reported quarterly growth of 3.6% despite significant challenges including flooding in northern territories and a 20-25 day outage at the Kassar plant due to GAIL pipeline leakage. The company's EBITDA stood at 7.9% for both H1 and Q2, down from 8.5% previously, with the plant outage impacting EBITDA by approximately 1.2%. Northern territories, which constitute 46-47% of tiles sales, were severely affected by floods in Uttarakhand and other regions. Capacity utilization remained at 75% due to the outage and muted demand. The company maintained its guidance for mid-to-high single-digit growth and expects 150 basis points EBITDA margin improvement. GVT sales increased 1% while ceramics sales declined 1%. The company added 119 net dealers in H1, bringing total dealers to approximately 3,000 and exclusive showrooms to 520. Joint ventures continue to report losses, with Max JV losing INR 7.5 crores in the quarter. Somany Ceramics standalone remains debt-free and made repayments of INR 18 crores in H1. Management expects double-digit margins in the next couple of quarters and projects GVT sales to reach 50% within 12-18 months.",
            "Sentiment": "neutral",
            "PublishDate": 1762814396586,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics Reports Strong Q2 Performance, Approves Merger of Three Subsidiaries",
            "Summary": "Somany Ceramics Limited reported quarterly results for the period ended September 30, 2025, showing revenue from operations of Rs 65,563 lakhs compared to Rs 57,980 lakhs in the previous quarter. Net profit for the quarter stood at Rs 2,253 lakhs versus Rs 1,676 lakhs in the prior quarter. The company's Board approved a draft scheme of amalgamation to merge three wholly-owned subsidiaries - Somany Bathware Limited, Somany Excel Vitrified Private Limited, and SR Continental Limited - with the parent company. The merger aims to achieve business synergy, reduce operational overheads, eliminate duplicate compliance requirements, and enhance shareholder value. No cash consideration or share exchange will occur as these are wholly-owned subsidiaries. The scheme requires statutory and regulatory approvals including from the National Company Law Tribunal. During the quarter, manufacturing operations at the Kassar Plant in Haryana were temporarily impacted due to gas supply disruption from August 16 to September 20, 2025, following a pipeline leakage incident.",
            "Sentiment": "positive",
            "PublishDate": 1762539965985,
            "Source": "corporate_action"
        },
        {
            "Title": "Somany Ceramics Reports Mixed Q2 Results with Revenue Growth but Lower Profitability",
            "Summary": "Somany Ceramics reported Q2 consolidated net profit of 150 million rupees compared to 172 million rupees in the same period last year. Revenue increased to 6.8 billion rupees from 6.62 billion rupees year-over-year. EBITDA declined to 535 million rupees from 560 million rupees, while EBITDA margin compressed to 7.86% from 8.47% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1762515356024,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics Resumes Full Operations at Kassar Plant with Temporary Gas Supply from Gail",
            "Summary": "Somany Ceramics has resumed full operations at its Kassar plant after securing temporary gas supply from Gail. The company's manufacturing facility is now operating at full capacity with this interim gas arrangement.",
            "Sentiment": "positive",
            "PublishDate": 1758511127647,
            "Source": "stock"
        },
        {
            "Title": "Somany Ceramics Resumes Full Capacity Operations at Kassar Plant After Gas Supply Disruption",
            "Summary": "Somany Ceramics Limited has resumed full capacity operations at its Kassar Plant in Bahadurgarh, Haryana, following a temporary disruption caused by an incident in GAIL's Gauna-Bawana pipeline. GAIL (India) Limited has established an interim arrangement for natural gas supply to the plant, enabling operations to gradually scale up and achieve full capacity utilization. The company had previously informed about the operational disruption through communications dated August 17 and August 22, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1758373541845,
            "Source": "stock"
        },
        {
            "Title": "Somany Ceramics Invests Rs 30 Crores in Subsidiary Somany Max Private Limited",
            "Summary": "Somany Ceramics Limited invested Rs 30 crores in its subsidiary Somany Max Private Limited through a rights issue for equity share acquisition. The investment was made through cash consideration at par value of Rs 10 per equity share, acquiring 3 crore additional equity shares representing approximately 5.71% additional stake. Following this acquisition, Somany Ceramics' shareholding in SMPL increased to approximately 85.71%. SMPL, incorporated in February 2022, operates in manufacturing of large format tiles and slabs, with turnover of Rs 11,004.53 lakhs in financial year 2024-25. The investment aims to address SMPL's future cash flow requirements for loan repayment obligations and capital expenditure for the plant. The transaction was conducted on an arm's length basis between the related parties.",
            "Sentiment": "positive",
            "PublishDate": 1757947289745,
            "Source": "stock"
        },
        {
            "Title": "Somany Ceramics Sets September 11 Record Date for Final Dividend and AGM Details",
            "Summary": "Somany Ceramics Limited announced September 11, 2025 as the record date for determining shareholder eligibility for the final dividend for the financial year ended March 31, 2025. The company's 57th Annual General Meeting is scheduled for September 18, 2025. If approved at the AGM, the dividend will be distributed to shareholders within 30 days from the meeting date. Remote e-voting will be available from September 14 at 9:00 AM to September 17 at 5:00 PM, with September 11 as the cut-off date for voting eligibility.",
            "Sentiment": "neutral",
            "PublishDate": 1756130792685,
            "Source": "corporate_action"
        },
        {
            "Title": "Somany Ceramics Partially Restores Gas Supply at Kassar Plant, Resumes Operations",
            "Summary": "Somany Ceramics has partially restored gas supply at its Kassar plant and resumed operations in part. The company stated there is no impact on sales and that other plants remain fully operational.",
            "Sentiment": "positive",
            "PublishDate": 1755859595970,
            "Source": "stock"
        },
        {
            "Title": "Somany Ceramics Reports 4% Revenue Growth Despite Capacity Utilization Challenges in Q1 FY2026",
            "Summary": "Somany Ceramics Limited reported a 4% year-on-year revenue growth with consolidated revenue of Rs. 601 crores in Q1 FY2026. Sales volume increased by 3% year-on-year, while gross margin improved 3.2% quarter-on-quarter but declined 1.8% year-on-year. The company faced operational challenges with consolidated capacity utilization dropping from 81% to 77%, particularly affecting the Max plant which operated at only 51-52% utilization. The sanitaryware plant experienced a major kiln shutdown but has returned to 100% capacity. GVT segment showed strength, increasing to 40% of revenue from 37% last year, while ceramic tiles and PVT segments declined. The company launched a joint venture with Durabuild for construction chemicals, targeting the Rs. 6,000 crore waterproofing market. Management maintains guidance of high single-digit revenue growth for FY2026 and expects 1-1.5% EBITDA margin expansion, with confidence in improved performance in the second half of the fiscal year.",
            "Sentiment": "neutral",
            "PublishDate": 1755527697132,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics Halts Operations at Kassar Plant Due to Gas Supply Disruption",
            "Summary": "Somany Ceramics Limited temporarily suspended operations at its Kassar plant in Bahadurgarh, Haryana following a gas supply stoppage. GAIL India Limited reported a gas leakage incident at Chainage 17 km of its Gauna-Bawana pipeline caused by heavy rainfall and flood-like conditions. The manufacturing operations at the plant depend on uninterrupted natural gas supply from GAIL, leading to the production halt. GAIL has begun restoration work on the affected pipeline to resume gas supply. The company stated it has sufficient stock available to prevent any sales impact and confirmed all other plants remain fully operational.",
            "Sentiment": "neutral",
            "PublishDate": 1755415033349,
            "Source": "stock"
        },
        {
            "Title": "Somany Ceramics Plans Premium Tile Expansion and Export Market Entry",
            "Summary": "Somany Ceramics has announced plans to expand its premium tile segment, diversify its sanitaryware business, and enter export markets. The company aims to increase revenue and profits through these strategic initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1755101239646,
            "Source": "stock"
        },
        {
            "Title": "Somany Ceramics Reports Mixed Q1 Results with Revenue Growth but Lower Profitability",
            "Summary": "Somany Ceramics reported quarterly consolidated net profit of 104 million rupees, down from 123 million rupees in the same period last year. Revenue increased to 6 billion rupees from 5.8 billion rupees year-over-year. EBITDA declined to 482 million rupees from 490 million rupees, while EBITDA margin compressed to 8.01% from 8.43% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755089187148,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics Reports 4.4% Sales Growth to ₹601 Crores in Q1 FY26, Reappoints Managing Director",
            "Summary": "Somany Ceramics Limited reported quarterly sales growth of 4.4% to ₹601 crores despite muted demand conditions. The company achieved 3% year-on-year volume growth with operating margins at 8.0%, though margins were impacted by lower capacity utilization and pricing pressure. Profit before tax stood at ₹11 crores and profit after tax at ₹10 crores. The Board approved the reappointment of Mr. Abhishek Somany as Managing Director and CEO for three years from June 1, 2026 to May 31, 2029. Additionally, the company approved an investment of up to ₹50 crores in subsidiary Somany Max Private Limited for loan repayment obligations and capital expenditure. Capacity utilization stood at 77% in tiles, 56% in sanitaryware, and 89% in faucets. The company maintains tiles capacity of approximately 75 million square meters per annum including outsource tie-ups.",
            "Sentiment": "neutral",
            "PublishDate": 1755088842964,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics Plans Investment of Up to 500 Million Rupees in Somany Max Private",
            "Summary": "Somany Ceramics has announced plans to invest up to 500 million rupees in Somany Max Private. The investment represents a strategic capital allocation by the ceramics company into the private entity.",
            "Sentiment": "positive",
            "PublishDate": 1755086423099,
            "Source": "stock"
        },
        {
            "Title": "Somany Ceramics Schedules Q1 FY26 Earnings Conference Call for August 14, 2025",
            "Summary": "Somany Ceramics Limited has announced an earnings conference call scheduled for August 14, 2025, at 11:00 AM IST to discuss the company's financial performance for the quarter ended June 30, 2025. The call will be represented by MD & CEO Abhishek Somany and the management team. The company has provided multiple access options including Diamond Pass registration link, universal access numbers, and international toll-free numbers for various countries including the US, UK, Germany, Japan, and others.",
            "Sentiment": "neutral",
            "PublishDate": 1754399507496,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics Acquires Majority Stake in Dura Build Care",
            "Summary": "Somany Ceramics has acquired a 51% stake in Dura Build Care. This represents a significant corporate action, indicating an expansion or diversification strategy for Somany Ceramics.",
            "Sentiment": "positive",
            "PublishDate": 1752589980000,
            "Source": "default"
        },
        {
            "Title": "Somany Ceramics: HDFC Securities Downgrades to 'Add' on Limited Upside",
            "Summary": "HDFC Securities has downgraded Somany Ceramics to 'Add' rating, citing limited upside potential following a recent stock rally. The company's new large-sized tiles Max plant in Gujarat, with a 4.5MSM capacity, is expected to drive volume growth and improve product mix.",
            "Sentiment": "neutral",
            "PublishDate": 1751524122000,
            "Source": "normal_news"
        },
        {
            "Title": "Somany Ceramics Projects Growth and Margin Improvement",
            "Summary": "Somany Ceramics has provided guidance for the current year, expecting high single-digit to double-digit growth. The company also anticipates an improvement in EBITDA margins by 1% to 1.5% if the projected guidance is met, as reported in a recent conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1746673949000,
            "Source": "default"
        },
        {
            "Title": "Somany Ceramics: Q4 Profit Drops 31% Despite Revenue Growth",
            "Summary": "Somany Ceramics reported a 30.8% YoY decline in Q4 FY25 net profit to ₹21 crore, while revenue grew 4.6% to ₹772 crore. EBITDA fell 18% to ₹65.4 crore, with margins shrinking to 8.5%. The company cited subdued demand, pricing pressure, and lower capacity utilization as challenges. Management remains cautiously optimistic for the new fiscal year.",
            "Sentiment": "negative",
            "PublishDate": 1746621677000,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics Recommends Final Dividend",
            "Summary": "Somany Ceramics has recommended a final dividend of 3 rupees per equity share for its shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1746619620000,
            "Source": "result"
        },
        {
            "Title": "Somany Ceramics Reports Q4 Financial Results",
            "Summary": "Somany Ceramics has released its Q4 financial results. The company's EBITDA decreased to 625 million rupees from 795 million rupees year-over-year, with EBITDA margin falling to 8.16% from 10.86%. Consolidated net profit dropped to 213 million rupees from 308 million rupees year-over-year, but increased from 93 million rupees quarter-over-quarter. Revenue rose to 7.7 billion rupees from 7.32 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1746619575000,
            "Source": "result"
        },
        {
            "Title": "Somany Ceramics Divests 51% Stake in ATPL",
            "Summary": "Somany Ceramics has completed the disinvestment of its 51% stake in ATPL (likely Amora Tiles Private Limited) for 92.8 million rupees. This corporate action represents a significant change in the company's investment portfolio and ownership structure.",
            "Sentiment": "neutral",
            "PublishDate": 1743411107000,
            "Source": "corporate_action"
        },
        {
            "Title": "Somany Ceramics Invests 102 Million Rupees in Subsidiary SSCPL",
            "Summary": "Somany Ceramics has made an investment of 102 million rupees in its subsidiary company, SSCPL. This financial move indicates a strategic decision by the parent company to strengthen its subsidiary's operations or expand its capabilities.",
            "Sentiment": "neutral",
            "PublishDate": 1742998791000,
            "Source": "corporate_action"
        },
        {
            "Title": "Somany Ceramics: Q3 Performance Meets Expectations, Maintains Growth Outlook",
            "Summary": "Somany Ceramics reported Q3 results in line with expectations. The company maintains its guidance for mid to high-single digit growth and anticipates margin improvements with better utilization. Brand spending is expected to remain at approximately 2.5% of sales.",
            "Sentiment": "neutral",
            "PublishDate": 1738904135000,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics Reports Q3 Financial Results and Investment Plan",
            "Summary": "Somany Ceramics announced its Q3 consolidated net profit of 93 million rupees, down from 222 million rupees year-over-year but up from 172 million rupees quarter-over-quarter. Q3 revenue increased to 6.4 billion rupees from 6.09 billion rupees year-over-year. The company also plans to invest up to 105 million rupees in Dura Build Care.",
            "Sentiment": "neutral",
            "PublishDate": 1738885618000,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics to Invest Up to 105 Million Rupees in Dura Build Care",
            "Summary": "Somany Ceramics has announced plans to invest up to 105 million rupees in Dura Build Care. This investment decision suggests a strategic move by the company to potentially expand its operations or strengthen its market position in the building materials sector.",
            "Sentiment": "positive",
            "PublishDate": 1738845858000,
            "Source": "corporate_action"
        },
        {
            "Title": "Somany Ceramics Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Somany Ceramics has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 535 million rupees from 590 million rupees in the same period last year. Additionally, the EBITDA margin decreased to 8.35% from 9.70% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738843651000,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics Reports Q3 Financial Results",
            "Summary": "Somany Ceramics has announced its Q3 consolidated financial results. The company reported a net profit of 93 million rupees, which is lower compared to 222 million rupees in the same quarter last year (YoY) and 172 million rupees in the previous quarter (QoQ). However, the company's revenue increased to 6.4 billion rupees from 6.09 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738843571000,
            "Source": "earnings"
        },
        {
            "Title": "Somany Ceramics: Analysts Predict 32% Upside Potential",
            "Summary": "Nuvama maintains 'buy' rating on Somany Ceramics with a target of Rs 858, citing expected 5-6% volume growth in FY25 and improved EBITDA margins by FY26. The company focuses on strengthening its balance sheet and improving product mix, with new launches expected to boost plant utilization.",
            "Sentiment": "positive",
            "PublishDate": 1734602560000,
            "Source": "normal_news"
        },
        {
            "Title": "Somany Ceramics: CEO Forecasts Strong H2 Growth",
            "Summary": "Somany Ceramics' CEO expects high single-digit to double-digit growth in H2 FY2024-25, driven by improved capacity utilization and better margins. Q2 saw a 38.4% YoY drop in net profit due to lower capacity utilization. The company anticipates better performance in Q3 and Q4, with growth coming from own manufacturing plants and joint ventures in the tile segment.",
            "Sentiment": "positive",
            "PublishDate": 1731124586000,
            "Source": "normal_news"
        },
        {
            "Title": "Somany Ceramics: Lowers FY25 Revenue Growth Forecast",
            "Summary": "Somany Ceramics has reduced its revenue growth guidance for FY25 due to challenging market conditions.",
            "Sentiment": "negative",
            "PublishDate": 1730366409000,
            "Source": "normal_news"
        },
        {
            "Title": "Somany Ceramics: Q2 Results Show Subdued Performance",
            "Summary": "Somany Ceramics' Q2 results indicate subdued volume growth and a decline in Net Sales Realization (NSR), which negatively impacted earnings according to IDBI Capital's review.",
            "Sentiment": "negative",
            "PublishDate": 1730264168000,
            "Source": "result"
        },
        {
            "Title": "Somany Ceramics Reports Decreased Capacity Utilization in Q2",
            "Summary": "Somany Ceramics has experienced a significant impact on its capacity utilization, which decreased from 81% in Q1 to 77% in Q2, according to a company executive's statement in an investor presentation.",
            "Sentiment": "negative",
            "PublishDate": 1730214546000,
            "Source": "result"
        },
        {
            "Title": "Somany Ceramics Reports Soft Demand and Export Decline",
            "Summary": "According to an investor presentation, an executive from Somany Ceramics stated that the demand scenario remains soft. Additionally, there has been a continuous decline in exports, which has put further pressure on the domestic market.",
            "Sentiment": "negative",
            "PublishDate": 1730214491000,
            "Source": "normal_news"
        },
        {
            "Title": "Somany Ceramics Reports Q2 Financial Results",
            "Summary": "Somany Ceramics has released its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for Q2 is 560 million rupees, compared to 641 million rupees in the same quarter last year. The EBITDA margin has decreased from 9.83% to 8.47% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730206239000,
            "Source": "result"
        },
        {
            "Title": "Somany Ceramics Reports Q2 Revenue",
            "Summary": "Somany Ceramics announced its second quarter revenue of 6.6 billion rupees, compared to 6.5 billion rupees in the same period last year, showing a slight year-over-year increase.",
            "Sentiment": "neutral",
            "PublishDate": 1730206230000,
            "Source": "result"
        },
        {
            "Title": "Somany Ceramics Reports Q2 Financial Results",
            "Summary": "Somany Ceramics has announced its Q2 consolidated net profit of 171 million rupees, showing a decrease from 293 million rupees year-over-year and an increase from 123 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1730206221000,
            "Source": "result"
        },
        {
            "Title": "Somany Ceramics: CEO Discusses Demand Revival Strategies Amid Government's Realty Push",
            "Summary": "<p>Somany Ceramics' CEO addresses potential <span class='positive'>demand revival</span> in light of <span class='positive'>government initiatives</span> in the <b>real estate sector</b>. The discussion focuses on the company's <span class='neutral'>business strategy</span> to <span class='positive'>capitalize</span> on these developments.</p>",
            "Sentiment": "neutral",
            "PublishDate": 1726146545000,
            "Source": "normal_news"
        }
    ]
}