{
    "Symbol": "SOMICONVEY",
    "ISIN": "INE323J01019",
    "News": [
        {
            "Title": "Somi Conveyor Q3FY26 Net Profit Surges 60.52%",
            "Summary": "Somi Conveyor Beltings reports strong Q3FY26 results with revenue rising 35.68% to ₹3,748.44 lakhs and net profit jumping 60.52% to ₹237.82 lakhs compared to Q3FY25.",
            "Sentiment": "positive",
            "PublishDate": 1770460984816,
            "Source": "co_actions_results"
        },
        {
            "Title": "Somi Conveyor Belting Reports Q2 FY2026 Financial Results with Profit Growth",
            "Summary": "Somi Conveyor Belting Limited announced its unaudited financial results for the second quarter and half year ended September 30, 2025, showing profit after tax of Rs 2.38 crores for Q2 compared to Rs 2.02 crores in the previous year quarter. The company, which manufactures industrial conveyor belts, reported expansion of production capacity with additional machinery installations underway at its manufacturing unit.",
            "Sentiment": "positive",
            "PublishDate": 1763119647262,
            "Source": "earnings"
        },
        {
            "Title": "Somi Conveyor Belting Secures Rs 3.04 Crore Order from Steel Authority of India",
            "Summary": "Somi Conveyor Belting Limited has secured orders worth Rs 30,391,260 from Steel Authority of India Limited for supplying heavy duty material nylon conveyor belts. The order includes 800 meters of HR-120 grade belts at Rs 1,709.70 per unit, 4,000 meters of M24 grade belts at Rs 1,689.00 per unit, and 10,000 meters of M24 grade belts at Rs 2,226.75 per unit. The total quantity ordered is 14,800 meters with delivery scheduled by February 3, 2026. The company confirmed that promoter/promoter group/group companies have no interest in the entity awarding the order, and the transaction does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1762908712864,
            "Source": "order&deals"
        },
        {
            "Title": "Somi Conveyor Belting Secures Rs 30.67 Lakh Order from Essar Bulk Terminal",
            "Summary": "Somi Conveyor Belting Limited announced it has secured an order worth Rs 30,67,528 from Essar Bulk Terminal (Salaya) Limited. The domestic order involves supplying 400 meters of Open End Flat Conveyor Belt with 1800mm width, 6mm top thickness, and 3mm bottom thickness at a unit rate of Rs 6,499. The fabric conveyor belt is to be delivered within 15 days from the purchase order date. The company confirmed that promoter/promoter group/group companies have no interest in the entity awarding the order, and the transaction does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1762815524647,
            "Source": "order&deals"
        },
        {
            "Title": "Somi Conveyor Beltings Appoints Two Independent Directors and New Secretarial Auditors",
            "Summary": "Somi Conveyor Beltings Limited shareholders approved the appointment of Mr. Rajesh Garg and Mrs. Shashi Modi as Independent Directors for five-year terms from October 1, 2025 to September 30, 2030. The company also appointed M/s Saharia and Associates as Secretarial Auditors for five consecutive financial years from 2025-26 to 2029-30. Mr. Garg, 53, is a Commerce Graduate with over 17 years of experience in Corporate Law, Economics, Finance, and Taxation. Mrs. Modi, 43, holds a Science degree and brings 8 years of professional experience in Strategic Management. Both directors are not related to any other Directors or Key Managerial Personnel of the company. The appointments were approved at the company's 25th Annual General Meeting held on September 30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1759236678000,
            "Source": "corporate_governance"
        },
        {
            "Title": "SOMI Conveyor Beltings Reports Order Book of INR 85.50 Crores",
            "Summary": "SOMI Conveyor Beltings Limited disclosed its order book position of INR 85.50 crores as of September 15, 2025. The company communicated this information to both the National Stock Exchange of India Limited and BSE Limited through a formal letter signed by Whole-time Director Vimal Bhansali.",
            "Sentiment": "neutral",
            "PublishDate": 1758107096067,
            "Source": "stock"
        },
        {
            "Title": "Somi Conveyor Beltings Reports 62% Jump in Net Profit for Q1 FY2026",
            "Summary": "Somi Conveyor Beltings Limited reported net profit of Rs 120.38 lakhs for the quarter ended June 30, 2025, representing a 62% increase from Rs 74.39 lakhs in the same period last year. Revenue from operations rose to Rs 2,624.31 lakhs compared to Rs 1,522.63 lakhs in the previous year quarter. The company's earnings per share increased to Rs 1.02 from Rs 0.63. Total expenses were Rs 2,483.48 lakhs versus Rs 1,432.78 lakhs in the corresponding quarter. The company announced ongoing production expansion in its Mixing Line to increase compounding capacity for all grades of conveyor belts, with production expected to commence within the financial year. Somi Conveyor Beltings is exclusively engaged in manufacturing and sale of industrial conveyor belts and has no subsidiary companies.",
            "Sentiment": "positive",
            "PublishDate": 1755004595577,
            "Source": "earnings"
        },
        {
            "Title": "SOMI Conveyor Beltings Secures Major Order Worth 1,242 Lakh Rupees",
            "Summary": "SOMI Conveyor Beltings, a company with a market capitalization of 234 crore rupees, has won a significant order valued at 1,242 lakh rupees (equivalent to 124.2 million rupees). This order represents a substantial business opportunity for the company, potentially boosting its revenue and market position in the conveyor belt industry.",
            "Sentiment": "positive",
            "PublishDate": 1735897865000,
            "Source": "order&deals"
        }
    ]
}