{
    "Symbol": "SONATSOFTW",
    "ISIN": "INE269A01021",
    "News": [
        {
            "Title": "Sonata Software Q3 FY26 Results & Dividend",
            "Summary": "Sonata Software reports Q3 FY26 results with consolidated revenue of ₹3,080.60 crores, PAT before exceptional item of ₹127.50 crores (21.4% YoY growth), and declares third interim dividend of ₹1.25 per share.",
            "Sentiment": "positive",
            "PublishDate": 1770378531474,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sonata Software Board Meet on Feb 6 for Q3FY26 Results",
            "Summary": "Sonata Software announces board meeting on February 6, 2026 to consider Q3FY26 unaudited financial results and third interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769693474546,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sonata Software Reports 10% QoQ PAT Growth, Declares Second Interim Dividend of ₹1.25 Per Share",
            "Summary": "Sonata Software's consolidated profit after tax grew 10% quarter-on-quarter to ₹120.2 crores for Q2 FY26, with revenue at ₹2,119.3 crores despite a 28.5% QoQ decline. The Board approved a second interim dividend of ₹1.25 per equity share for FY 2025-26, with record date November 21, 2025 and payment on or after December 3, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765203216737,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Reports Q2 FY26 Results with Margin Expansion Despite Revenue Headwinds",
            "Summary": "Sonata Software delivered Q2 FY26 results with USD revenue at $82 million (1% growth in constant currency) and EBITDA improving to 17.3% from 16.6% sequentially, driven by operational efficiencies and AI adoption despite wage increment impact of 90 bps. The company faced headwinds from organizational changes at its largest BFSI client leading to significant ramp-down and decision delays at its largest TMT customer, but secured one large healthcare deal and expanded AI orderbook from 8% to 10% of total orderbook.",
            "Sentiment": "neutral",
            "PublishDate": 1763640453959,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Maintains Growth Targets and Expects Improved Financial Performance",
            "Summary": "Sonata Software management maintains its target to scale investment verticals (healthcare, life sciences, and banking/financial services) to $250 million revenue within 3-5 years. The company expects EBITDA improvement in Q3, higher profit after tax in the second half versus first half, and continued utilization rate improvements driven by AI-powered productivity gains.",
            "Sentiment": "positive",
            "PublishDate": 1763199953929,
            "Source": "stock"
        },
        {
            "Title": "Sonata Software Publishes Unaudited Financial Results for Second Quarter and Half Year Ended September 30, 2025",
            "Summary": "Sonata Software Limited has published its unaudited financial results for the second quarter and half year ended September 30, 2025 in Navshakti and Business Standard newspapers on November 14, 2025. The company has informed stock exchanges NSE and BSE about the publication of these quarterly results in compliance with SEBI listing regulations.",
            "Sentiment": "positive",
            "PublishDate": 1763120476386,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Reports Mixed Q2 Results with Higher Profit but Lower Revenue",
            "Summary": "Sonata Software reported Q2 consolidated net profit of 1.2 billion rupees, up from 1.1 billion rupees year-over-year. However, revenue declined to 21.2 billion rupees from 21.7 billion rupees in the same period last year. EBITDA decreased to 1.7 billion rupees from 1.8 billion rupees year-over-year, while EBITDA margin remained relatively stable at 8.15% compared to 8.17% in the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1763037143620,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Partners with Adesso for Global AI-Driven Business Modernization",
            "Summary": "Sonata Software has formed a global partnership with Adesso to deliver AI-driven modernization services and provide tangible benefits for businesses worldwide.",
            "Sentiment": "positive",
            "PublishDate": 1760438382570,
            "Source": "stock"
        },
        {
            "Title": "Sonata Software Receives 2025-2026 Microsoft AI Business Solutions Inner Circle Award",
            "Summary": "Sonata Software has been awarded the 2025-2026 Microsoft AI Business Solutions Inner Circle Award, marking the fifth time the company has received this recognition. The award places Sonata Software among the top tier of Microsoft's global AI Business Solutions partners and is based on outstanding sales achievements and ability to deliver transformative solutions. As an Inner Circle partner, Sonata Software gains direct engagement with Microsoft's product teams, providing customers early visibility into new capabilities and faster project outcomes. The company, with $1 billion in revenue, operates as an AI-led Modernization Engineering company with a three-decade collaboration with Microsoft. Sonata Software holds multiple Microsoft certifications including Dynamics Inner Circle membership, Microsoft Fabric launch partner status, and Azure Expert MSP designation.",
            "Sentiment": "positive",
            "PublishDate": 1758624226266,
            "Source": "stock"
        },
        {
            "Title": "Sonata Software Reports Minimal Impact from New U.S. H1B Visa Fee of $100,000",
            "Summary": "Sonata Software assessed the impact of new U.S. H1B visa regulations introduced through a Government Proclamation on September 19, 2025, and accompanying Memorandum on September 20, 2025, which impose a one-time fee of $100,000 per new H-1B petition. The company stated that H-1B visa utilization is not material to its operations, with existing H-1B employees and contractors remaining unaffected. Sonata assured service continuity through its workforce planning, visa compliance, global mobility initiatives, and local hiring practices. The company emphasized its strategic focus on expanding local and nearshore delivery centers to strengthen its global delivery model. Sonata is monitoring regulatory developments and committed to providing updates on any changes affecting clients or stakeholders.",
            "Sentiment": "neutral",
            "PublishDate": 1758606536090,
            "Source": "stock"
        },
        {
            "Title": "Sonata Software, Newgen Software, and Zen Technologies Surge 5-8% on Strong Trading Day",
            "Summary": "Three technology stocks posted significant gains on Thursday, with Sonata Software rising 8.02% to Rs 421.50, Newgen Software climbing 7.05% to Rs 947, and Zen Technologies advancing 5% to Rs 1,621.30. Both Sonata and Newgen outperformed the Nifty IT index, which gained 1.70%. The broader market rallied with Nifty 50 and Sensex trading nearly 0.5% higher following the US Federal Reserve's decision to cut benchmark lending rates by 25 basis points to 4-4.25%. Analyst coverage shows mixed outlooks: Sonata Software has 8 buy ratings and 3 hold ratings with 6.9% upside potential, Newgen Software has 2 buy, 3 hold, and 3 sell ratings with 11% upside potential, while Zen Technologies has 4 buy and 3 hold ratings with 17.4% upside potential.",
            "Sentiment": "positive",
            "PublishDate": 1758176853929,
            "Source": "stock"
        },
        {
            "Title": "Sonata Software Reports 0.6% QoQ Growth in International Services, Secures 3 Large Deals in Q1 FY26",
            "Summary": "Sonata Software's international services revenue grew 0.6% quarter-on-quarter to $81.8 million in Q1 FY26, while declining 1.1% year-on-year. The company secured three large deals with order bookings of $105 million, achieving a 1.28 book-to-bill ratio. EBITDA improved marginally to 16.6% from 16.5% in the previous quarter. The company now has 7 clients with more than $10 million annual run rate and added 7 new enterprise customers. Healthcare Life Sciences and Banking Financial Services verticals now contribute over 30% of total revenue, up from 13% three years ago. AI-enabled services are expected to contribute 20% of revenue over the next 3 years, with AI pipeline reaching $46 million. However, the company faces headwinds from global softness in Retail Manufacturing, budget pressures from two large clients in BFSI and High-Tech sectors, and potential risks in the domestic SITL business from partners considering direct engagement models. Domestic business revenue grew 18.6% quarter-on-quarter to INR 2,274.7 crores, though gross contribution declined 12.6%. The company declared its first interim dividend of INR 1.25 per share and expects to pay quarterly interim dividends going forward.",
            "Sentiment": "neutral",
            "PublishDate": 1754390403857,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Secures $456M in Deal Wins, Launches AgentBridge Platform",
            "Summary": "Sonata Software has secured $456 million in deal wins as part of its AI-led modernization strategy. The company launched AgentBridge and formed a strategic alliance with Microsoft. Sonata is targeting scalable growth through BFSI (Banking, Financial Services, and Insurance), cloud and data services, and global enterprise transformation initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1753887523752,
            "Source": "stock"
        },
        {
            "Title": "Sonata Software Reports Q1 FY2026 Results, Declares Rs 1.25 Interim Dividend",
            "Summary": "Sonata Software announced its unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue of Rs 2,965.2 crores, showing 13.3% quarter-on-quarter growth. Consolidated profit after tax stood at Rs 109.3 crores, representing 1.7% growth compared to the previous quarter. The Board declared an interim dividend of Rs 1.25 per equity share with August 8, 2025 as the record date for dividend payment. International IT Services revenue reached Rs 699.9 crores with a decline of 0.3% quarter-on-quarter, while Domestic Products & Services revenue grew 18.6% to Rs 2,274.7 crores. The company secured three large deals during the quarter, including a $73 million AI-led Digital Modernization deal with a US TMT company. EBITDA before other income and forex stood at Rs 159.6 crores, showing a decline of 7.6% quarter-on-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753879103934,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Reports Growth in Q1 Results with Revenue Rising to 29.51B Rupees",
            "Summary": "Sonata Software announced its Q1 consolidated results showing net profit of 1.09 billion rupees compared to 1.06 billion rupees in the same period last year. The company's revenue increased to 29.51 billion rupees from 25.27 billion rupees year-over-year, representing growth in both profitability and top-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1753877623529,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Reports Q1 FY26 Results, Declares Interim Dividend of Rs 1.25 Per Share",
            "Summary": "Sonata Software announced its unaudited financial results for the quarter ended June 30, 2025. The company reported consolidated revenue of Rs 2,965.2 crores, showing growth of 13.3% quarter-on-quarter, and consolidated profit after tax of Rs 109.3 crores, up 1.7% QoQ. International IT Services revenue stood at Rs 699.9 crores with a decline of 0.3% QoQ, while Domestic Products & Services revenue grew 18.6% QoQ to Rs 2,274.7 crores. The board approved an interim dividend of Rs 1.25 per equity share for FY 2025-26, with record date set for August 8, 2025, and payment on or after August 20, 2025. The company secured three large deals during the quarter - two in BFSI and one in TMT sectors, including a $73 million AI-led Digital Modernization deal with a US TMT company. Cash and cash equivalents stood at Rs 600 crores gross.",
            "Sentiment": "positive",
            "PublishDate": 1753877564984,
            "Source": "corporate_action"
        },
        {
            "Title": "Sonata Software Partners With Wharton AI For Agentic AI Project",
            "Summary": "Sonata Software has entered into a partnership with Wharton AI to collaborate on an agentic AI project. The partnership represents a strategic alliance between the software company and the AI organization to develop artificial intelligence capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1753362289357,
            "Source": "order&deals"
        },
        {
            "Title": "Sonata Software Partners with Wharton AI & Analytics Initiative for Agentic AI Research",
            "Summary": "Sonata Software announced a collaboration with the Wharton AI & Analytics Initiative to advance research in agentic AI for enterprise operations. As WAIAI's newest Thought Leadership Partner, the companies will evaluate agentic AI systems focusing on governance, compliance, human-AI collaboration, and enterprise adoption. They plan to refine Sonata's AgentBridge modular architecture with compliance and ethical safeguards. The partnership includes co-hosting an academic convening in Fall 2025 centered on agentic AI, featuring roundtable discussions and interactive demos. Insights from the event will inform a white paper on ethical deployment of agentic AI tools in enterprise contexts. This marks Sonata Software's first major engagement with a U.S. Ivy League institution, supporting its transformation into an AI-led Modernization leader. Sonata Software operates with $1 billion revenue and has previously partnered with Indian Institute of Science for AI-driven research.",
            "Sentiment": "positive",
            "PublishDate": 1753362246894,
            "Source": "stock"
        },
        {
            "Title": "Sonata Software Schedules Board Meeting for July 30, 2025 to Review Q1 Results and Consider Interim Dividend",
            "Summary": "Sonata Software Limited will hold a Board of Directors meeting on July 30, 2025 to consider and approve unaudited financial results for the quarter ended June 30, 2025. The board will also consider declaring an interim dividend for financial year 2025-26. If declared, the interim dividend will be subject to tax deduction at source as per Income Tax Act provisions. The company plans to conduct a conference call with analysts and investors, with details to be shared separately.",
            "Sentiment": "neutral",
            "PublishDate": 1753278791278,
            "Source": "corporate_action"
        },
        {
            "Title": "Sonata Software: Stock Surges 11% in 3 Days, Analysts Eye Further Upside",
            "Summary": "Sonata Software shares have risen 11.48% over the past three trading sessions, reaching near Rs 440. Analysts suggest potential for further upside to Rs 475, citing a breakout from a consolidation pattern. Key support is seen at Rs 420, with immediate resistance at Rs 453. The stock has climbed above its 100-day EMA, but remains below the 200-day EMA, indicating a cautious broader trend.",
            "Sentiment": "positive",
            "PublishDate": 1752046344000,
            "Source": "normal_news"
        },
        {
            "Title": "Sonata Software Collaborates with IISc's FSID for AI-Driven Research",
            "Summary": "Sonata Software has announced a collaboration with the Indian Institute of Science's Foundation of Science Innovation and Development (FSID) to advance AI-driven scientific research. The partnership aims to promote the adoption of a responsible-first AI approach. This collaboration is expected to contribute to the development and application of AI technologies in scientific research while emphasizing ethical considerations.",
            "Sentiment": "positive",
            "PublishDate": 1749553807000,
            "Source": "default"
        },
        {
            "Title": "Sonata Software Launches AgentBridge for Managed Agentic Workflows",
            "Summary": "Sonata Software has introduced AgentBridge, a new managed services offering designed for agentic workflows. The product aims to provide solutions for managing AI-driven processes, though specific details about its features or applications are not provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1747746474000,
            "Source": "default"
        },
        {
            "Title": "Sonata Software: Q4 Revenue Up 19%, Net Profit Dips 3%; Declares Dividend",
            "Summary": "Sonata Software reported Q4FY25 revenue of ₹2,617.2 crore, up 19.4% YoY, while net profit declined 2.56% to ₹107.53 crore. The company's international IT services segment saw a 4% sequential decline in Q4 revenue. The domestic products & services segment showed strong yearly growth but a quarterly decline. A final dividend of ₹4.40 per share was recommended.",
            "Sentiment": "neutral",
            "PublishDate": 1746623335000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Reports Q4 Results and Declares Dividend",
            "Summary": "Sonata Software has announced its Q4 financial results and dividend declaration. The company's Q4 consolidated net profit was 1.07 billion rupees, slightly down from 1.1 billion rupees year-over-year. Revenue increased to 26.2 billion rupees from 21.9 billion rupees in the same period last year. EBITDA rose to 1.7 billion rupees from 1.44 billion rupees, with a marginal improvement in EBITDA margin to 6.60%. The company has recommended a final dividend of 4.40 rupees per share.",
            "Sentiment": "neutral",
            "PublishDate": 1746620040000,
            "Source": "result"
        },
        {
            "Title": "Sonata Software Achieves AWS DevOps Competency Status",
            "Summary": "Sonata Software has announced that it has achieved Amazon Web Services (AWS) DevOps Competency status. This recognition highlights Sonata Software's expertise in providing DevOps solutions on the AWS platform, demonstrating their capability to help customers implement continuous integration and delivery practices or automate infrastructure provisioning and management with AWS.",
            "Sentiment": "positive",
            "PublishDate": 1746014020000,
            "Source": "default"
        },
        {
            "Title": "Sonata Software: Secures $73 Million Contract, Warns of Q4 Revenue Dip",
            "Summary": "Sonata Software secured a five-year, $73 million contract from a US-based TMT company. The deal involves establishing an AI-enabled Modernisation Engineering Center in India. However, the company warned of lower-than-expected Q4 international business revenue due to reduced estimates from its largest client.",
            "Sentiment": "neutral",
            "PublishDate": 1745819094000,
            "Source": "order&deals"
        },
        {
            "Title": "Sonata Software Secures $73M AI-Led Digital Modernization Deal",
            "Summary": "Sonata Software has announced a significant contract win, securing a $73 million deal for AI-led digital modernization with a leading US Technology, Media, and Telecom (TMT) company. This deal highlights Sonata's capabilities in delivering advanced technological solutions and marks a substantial business opportunity in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1745811565000,
            "Source": "default"
        },
        {
            "Title": "Sonata Software: Shares Plunge 14% on Q4 Revenue Warning",
            "Summary": "Sonata Software's shares dropped 14% to ₹288 after warning of lower Q4 revenue from its largest client. The stock has fallen 65% from its peak of ₹870, now trading at levels last seen in January 2023.",
            "Sentiment": "negative",
            "PublishDate": 1744864129000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Anticipates Lower Revenue from Largest Client in Q4 2024-25",
            "Summary": "Sonata Software has announced that revenue estimates for the fourth quarter of 2024-25 from its largest client are expected to be lower than previously anticipated. This reduction will likely result in decreased revenue from the company's international business for that quarter compared to earlier projections shared during a previous analyst/investor meeting.",
            "Sentiment": "negative",
            "PublishDate": 1744859712000,
            "Source": "default"
        },
        {
            "Title": "Sonata Software: Revenue Warning for International Business",
            "Summary": "Sonata Software warned that its international business revenue for Q4 FY2025 is likely to be lower than anticipated, primarily due to reduced revenue from its largest client. The impact may extend into Q1 FY2026. The company's CFO previously projected a 2.5% to 3.5% revenue decline for Q4 in the international IT services business.",
            "Sentiment": "negative",
            "PublishDate": 1744847024000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software: Order Momentum Offers Hope Amid Short-Term Challenges",
            "Summary": "Sonata Software's stock dropped 24% after weak Q3 results due to client ramp-down. Recovery expected in H2 FY26. Company added 11 new clients but faces increased client concentration. FY26 revenue target of $1.5 billion delayed to FY27. Analysts maintain buy rating but reduce FY26 estimates.",
            "Sentiment": "neutral",
            "PublishDate": 1740057353000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software: Q3 Results Trigger 19% Stock Plunge",
            "Summary": "Sonata Software's shares dropped 19% to a 52-week low after Q3 results. The company reported an unplanned client ramp-down in the hi-tech sector, expecting a 2.5-3% revenue decline in Q4. International IT Services revenue grew 2.8% QoQ to $87 million. Management guides for continued weakness in Q4 and potentially into Q1 FY25.",
            "Sentiment": "negative",
            "PublishDate": 1738905205000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software: Q3 Profit Drops on Margin Erosion",
            "Summary": "Sonata Software reported a 1.4% sequential decline in Q3 profit to Rs 105 crore due to margin erosion from a major client deal ramp-down. Operating margins narrowed to 4.6% from 6.7% in the previous quarter. The company expects a sequential revenue decline in Q4 but projects 20% of revenue from AI-driven services in three years.",
            "Sentiment": "negative",
            "PublishDate": 1738903309000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software: Q3 Profit Dips, Revenue Rises",
            "Summary": "Sonata Software reported a 1.4% QoQ decline in Q3 FY25 PAT to ₹105 crore. Revenue from international IT services grew 3.4% QoQ to ₹731.7 crore. The domestic products and services business saw 16.7% QoQ growth in gross contribution. The company won two large deals, including a multi-million-dollar deal on Microsoft Fabric and Gen AI modernization.",
            "Sentiment": "neutral",
            "PublishDate": 1738857324000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Sonata Software, an IT services company, has reported a decrease in its third quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 1.63 billion rupees from 2.08 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin contracted to 5.75% from 8.38% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738837575000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Reports Significant Profit Turnaround in Q3",
            "Summary": "Sonata Software has reported a substantial improvement in its financial performance for the third quarter. The company's consolidated net profit reached 1.05 billion rupees, compared to a loss of 462 million rupees in the same period last year. Revenue also saw an increase, rising to 28 billion rupees from 25 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738837569000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software to Consider Q3 Results on February 6",
            "Summary": "Sonata Software has announced that it will consider its third quarter financial results on February 6. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter to investors and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1738330668000,
            "Source": "earnings"
        },
        {
            "Title": "Sonata Software Launches AI-Powered Test Acceleration Platform",
            "Summary": "Sonata Software has introduced HARMONI.AI-powered IntelliQA, a test acceleration platform designed to drive digital transformation for global enterprises. This platform leverages artificial intelligence to enhance and streamline software testing processes.",
            "Sentiment": "positive",
            "PublishDate": 1734431666000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sonata Software Achieves AWS Generative AI Competency",
            "Summary": "Sonata Software has announced that it has achieved the Amazon Web Services (AWS) Generative AI Competency. This recognition highlights Sonata's expertise and capabilities in leveraging generative AI technologies on the AWS platform. The achievement likely positions Sonata Software as a valuable partner for businesses looking to implement generative AI solutions using AWS services.",
            "Sentiment": "positive",
            "PublishDate": 1733357096000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sonata Software Achieves AWS Generative AI Competency",
            "Summary": "Sonata Software has announced that it has achieved the Amazon Web Services (AWS) Generative AI Competency. This recognition highlights Sonata Software's expertise and capabilities in the field of generative artificial intelligence, specifically in relation to AWS technologies.",
            "Sentiment": "positive",
            "PublishDate": 1733310395000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sonata Software Secures Multi-Million Dollar Modernization Deal in Australia",
            "Summary": "Sonata Software has won a significant contract to support digital transformation initiatives for a client across 13 countries in the Asia-Pacific region. The deal, described as 'multi-million dollar', involves modernization efforts and will be implemented in Australia.",
            "Sentiment": "positive",
            "PublishDate": 1732753094000,
            "Source": "order&deals"
        },
        {
            "Title": "Sonata Software Secures Multi-Million Dollar Modernization Deal in Australia",
            "Summary": "Sonata Software has won a significant multi-million dollar modernization contract in Australia. The company will be supporting the client's digital transformation initiatives across 13 countries in the Asia-Pacific (APAC) region. This deal represents a major expansion of Sonata Software's presence in the APAC market and demonstrates their capabilities in delivering large-scale digital transformation projects.",
            "Sentiment": "positive",
            "PublishDate": 1732704104000,
            "Source": "order&deals"
        },
        {
            "Title": "Sonata Software Expects Strong Growth and AI Focus",
            "Summary": "Sonata Software anticipates better growth in the second half of the year compared to the first half. The company has made a strategic bet on artificial intelligence, aiming to generate 20% of its revenue from AI-enabled services by the end of 2027.",
            "Sentiment": "positive",
            "PublishDate": 1730950806000,
            "Source": "normal_news"
        },
        {
            "Title": "Sonata Software Outlines Growth Expectations for Key Verticals",
            "Summary": "Sonata Software anticipates its healthcare, life sciences, and banking verticals to achieve approximately $250 million in revenue within the next three to five years. The company also expects to recover from the impact of a large deal, with a 60-70 basis points improvement expected in Q4 and Q1.",
            "Sentiment": "positive",
            "PublishDate": 1730950700000,
            "Source": "normal_news"
        },
        {
            "Title": "Sonata Software Reports Q2 EBITDA Decline",
            "Summary": "Sonata Software's Q2 EBITDA decreased to 1.8 billion rupees from 1.97 billion rupees year-over-year. The company's EBITDA margin also fell to 8.17% from 10.32% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1730891133000,
            "Source": "result"
        },
        {
            "Title": "Sonata Software Reports Q2 Revenue Growth",
            "Summary": "Sonata Software announced its Q2 revenue of 21.7 billion rupees, showing an increase from 19.13 billion rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1730891121000,
            "Source": "result"
        },
        {
            "Title": "Sonata Software Reports Q2 FY24 Financial Results",
            "Summary": "Sonata Software, an IT services and solutions company, has announced its consolidated net profit for the second quarter. The company reported a net profit of 1.1 billion rupees, which represents a decrease from 1.24 billion rupees in the same quarter last year (YoY). However, the profit remains stable at 1.1 billion rupees compared to the previous quarter (QoQ).",
            "Sentiment": "neutral",
            "PublishDate": 1730891113000,
            "Source": "result"
        },
        {
            "Title": "Sonata Software Partners with Fortune 50 Tech Conglomerate for Global Retail Expansion",
            "Summary": "Sonata Software, an IT services company, has entered into a partnership with a Fortune 50 American multinational technology conglomerate. The collaboration aims to enhance customer experience and support the conglomerate's global retail expansion plans. This partnership highlights Sonata Software's capabilities in providing innovative solutions for large-scale retail operations.",
            "Sentiment": "positive",
            "PublishDate": 1730288893000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sonata Software: Secures Multi-Year AI-Driven Contract with Fortune 500 Manufacturer",
            "Summary": "Sonata Software has been selected as a strategic managed services partner for a Fortune 500 consumer goods and industrial products manufacturer. The multi-year contract focuses on leveraging Cloud and AI technologies to enhance operational efficiencies and drive business growth. The partnership aims to implement a scalable operating model supporting global expansion and digital transformation.",
            "Sentiment": "positive",
            "PublishDate": 1729595344000,
            "Source": "normal_news"
        },
        {
            "Title": "Sonata Software Secures AI-Powered Managed Services Contract",
            "Summary": "Sonata Software has been awarded a multi-year contract to provide AI-powered managed services. The company will be responsible for delivering a reliable and scalable operating model as part of this agreement.",
            "Sentiment": "positive",
            "PublishDate": 1729593929000,
            "Source": "corporate_action"
        }
    ]
}