{
    "Symbol": "SONACOMS",
    "ISIN": "INE073K01018",
    "News": [
        {
            "Title": "Sona Comstar Q3 FY26: Record Revenue Crosses ₹1,200 Cr",
            "Summary": "Sona BLW Precision Forgings achieves milestone quarter with revenue of ₹1,209 crores (39% YoY growth) and EBITDA of ₹305 crores, marking best-ever performance across all financial metrics.",
            "Sentiment": "positive",
            "PublishDate": 1769841854108,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sona BLW CEO eyes Europe opportunities amid supplier stress",
            "Summary": "Sona BLW's CEO highlights potential benefits from European supplier insolvencies and India-EU FTA, with three direct competitors filing for bankruptcy in six months creating new business opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1769503031502,
            "Source": "stocks"
        },
        {
            "Title": "Sona Comstar Q3 revenue jumps 38%, profit flat",
            "Summary": "Sona BLW Precision Forgings reported 38.2% revenue growth to ₹1,199 crore in Q3FY26, but net profit remained flat at ₹150.7 crore due to margin compression and ₹40 crore labour code impact.",
            "Sentiment": "neutral",
            "PublishDate": 1769170638149,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sona BLW Q3 Net Profit Remains Flat at ₹150 Crores",
            "Summary": "Sona BLW Precision Forgings reported consolidated net profit of ₹150.00 crores in Q3, marginally down from ₹151.00 crores in the same quarter last year, reflecting stable performance.",
            "Sentiment": "neutral",
            "PublishDate": 1769162765308,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sona BLW Allots 1.26L Shares to MD Under PSP 2025",
            "Summary": "Sona BLW Precision Forgings allotted 1,25,915 equity shares to Managing Director Vivek Vikram Singh under Performance Share Plan 2025, increasing paid-up capital to ₹621.85 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1769082784121,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sona BLW Q3FY26 Results Call Set for January 23",
            "Summary": "Sona BLW Precision Forgings will announce Q3FY26 results on January 23, 2026, followed by earnings conference call at 4:30 PM IST to discuss quarterly performance.",
            "Sentiment": "neutral",
            "PublishDate": 1768390620674,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sona BLW shares drop 40% amid operational challenges",
            "Summary": "Sona BLW Precision Forgings faces stock decline due to supply chain disruptions, margin pressures from business mix changes, and slower EV customer demand, though management indicates challenges are temporary.",
            "Sentiment": "negative",
            "PublishDate": 1767939289501,
            "Source": "stocks"
        },
        {
            "Title": "Sona BLW Precision Forgings: ₹24.60 Cr Block Trade",
            "Summary": "Sona BLW Precision Forgings executed a significant NSE block trade worth ₹24.60 crores involving 514,661 shares at ₹478.00 per share, indicating substantial institutional activity.",
            "Sentiment": "neutral",
            "PublishDate": 1767067611228,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sona BLW's Serbian Unit Novelic Establishes Indian Subsidiary",
            "Summary": "Sona BLW's Serbian subsidiary Novelic has established a new subsidiary called 'Novellic India Pvt Ltd' on November 28, 2025. This expansion into India represents a strategic move by the company to establish operations in the Indian market through its European unit.",
            "Sentiment": "positive",
            "PublishDate": 1764336884772,
            "Source": "corporate_action"
        },
        {
            "Title": "Sona BLW Precision Forgings Plans to Apply for India's Rare Earth Scheme, Seeks Foreign Technology Partners",
            "Summary": "Sona BLW Precision Forgings announced plans to apply for India's rare earth scheme while actively seeking foreign technology partnerships. The move positions the company to potentially expand into the strategic rare earth materials sector through government support and international collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1764249380444,
            "Source": "stock"
        },
        {
            "Title": "Sona BLW Precision Forging Seeks Shareholder Approval for Performance Share Plan for Managing Director",
            "Summary": "Sona BLW Precision Forging has issued a postal ballot notice seeking shareholder approval for a Performance Share Plan 2025, allowing up to 1.5 million equity shares to be granted to Managing Director Vivek Vikram Singh over 5 years based on EBITDA growth performance. The plan aims to retain and incentivize Singh, whose current compensation was found to be significantly below industry benchmarks at 0.57% of company PAT compared to 2.91% average among comparable companies.",
            "Sentiment": "positive",
            "PublishDate": 1763464134576,
            "Source": "corporate_action"
        },
        {
            "Title": "Sona BLW Precision Forgings Shows Technical Signs of Multi-Month Downtrend Reversal",
            "Summary": "Sona BLW Precision Forgings (SONACOMS) is showing technical indicators of a potential trend reversal after being in a multi-month downtrend for over a year. The stock declined from Rs. 760 in September to lows near Rs. 370 in April, but has been forming a base over recent months. Technical analysis shows the stock is trading above all key moving averages and took support at its 200-day moving average. The daily MACD remains bullish, RSI formed a fresh 14-period high, and the relative strength line against Nifty 500 has reversed higher. On-Balance Volume has reached new highs, indicating strong volume participation. A move higher could take the stock to Rs. 520, while a close below Rs. 475 would negate the current technical setup.",
            "Sentiment": "positive",
            "PublishDate": 1762675059824,
            "Source": "stock"
        },
        {
            "Title": "FPIs Sell $9.3 Billion in Indian Equities During September Quarter, Sona BLW and PNB Housing Finance Hit Hardest",
            "Summary": "Foreign portfolio investors sold $9.3 billion worth of Indian equities during the September quarter, continuing their selling streak. Sona BLW Precision Forgings experienced the largest drop in FPI holdings, falling to 23.5% from nearly 30% at the end of June. PNB Housing Finance saw foreign ownership decline to 18.6% from 24.2%. Other significantly affected stocks included Sammaan Capital, Indian Energy Exchange, and Computer Age Management Services, each witnessing at least 5 percentage point declines in foreign shareholding. The selloff was initially driven by expensive valuations and later intensified due to trade policy uncertainties imposed by US President Donald Trump. Since the beginning of 2025, foreign investors have sold $16.5 billion worth of Indian equities. However, overseas investors have turned modest buyers since October, adding about $550 million worth of shares. Indian equities continue trading at high valuations with Nifty50's one-year forward price-to-earnings multiple at 20.4 times. Market experts including Morgan Stanley's Ridham Desai suggest potential for a turnaround, noting that India's relative valuations have corrected to rarely seen levels.",
            "Sentiment": "negative",
            "PublishDate": 1762513597412,
            "Source": "stock"
        },
        {
            "Title": "Sona Comstar Reports Record Q2 FY26 Results Despite EV Revenue Decline",
            "Summary": "Sona BLW Precision Forgings Limited (Sona Comstar) achieved its highest-ever quarterly revenue, EBITDA, and net profit in Q2 FY26. Revenue grew 24% year-on-year to ₹1,144 crores, EBITDA increased 13% to ₹289 crores, and profit after tax rose 20% to ₹173 crores. However, BEV revenue declined 17% and now constitutes 32% of automotive revenue, primarily due to demand challenges from one global customer and a specific model's significant sales drop. The company secured its first order for its Mexico driveline plant worth ₹2.6 billion and received nominations for two suspension system programs valued at ₹8.2 billion. Sona Comstar successfully developed rare-earth-free traction motors using ferrite-assisted synchronous reluctance technology. The company revised its order book to ₹236 billion after removing programs with low production visibility, with EV programs maintaining a 70% share. Three European competitors filed for insolvency, resulting in increased inquiries from European customers. The railway business contributed significantly with ₹13 billion in orders expected to execute within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1761921324086,
            "Source": "earnings"
        },
        {
            "Title": "Sona BLW Faces Deal Cancellation with BYD, Hindalco Experiences Factory Fire",
            "Summary": "Sona BLW's deal with BYD has been canceled, with analysts warning of significant revenue impact. Additionally, Hindalco experienced a factory fire, raising concerns about demand implications. The developments were discussed in a conference call update.",
            "Sentiment": "negative",
            "PublishDate": 1761624354186,
            "Source": "stock"
        },
        {
            "Title": "Sona BLW Precision Expects Improved Return Ratios, Targets 24-26% Profit Margins Post Railway Acquisition",
            "Summary": "Sona BLW Precision announced expectations for gradual improvement in return ratios through growth initiative investments. The company declined to provide guidance for FY26 and FY27 plans, maintaining a no future guidance policy. Following its railway acquisition, the company aims to achieve profit margins in the range of 24-26%.",
            "Sentiment": "neutral",
            "PublishDate": 1761622515995,
            "Source": "stock"
        },
        {
            "Title": "Sona BLW Targets ₹6,500Cr Revenue by FY27 with 28% EV Drivetrain Sales",
            "Summary": "Sona BLW has announced revenue targets of ₹6,500 crores by FY27, with electric vehicle drivetrain sales expected to comprise 28% of total revenue. The company has secured global EV orders worth ₹23,000 crores and is implementing new e-axle programs. The company expects to maintain EBITDA margins at 25% during this period.",
            "Sentiment": "positive",
            "PublishDate": 1761581771617,
            "Source": "stock"
        },
        {
            "Title": "Sona Comstar Reports Q2 FY26 Results, Suspends China Joint Venture, Appoints New Senior Management",
            "Summary": "Sona BLW Precision Forgings Limited approved unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue of ₹11,383 million for Q2 FY26, representing 24% year-over-year growth, with EBITDA of ₹2,891 million and PAT of ₹1,728 million. BEV revenue declined 17% year-over-year but constituted 32% of automotive product sales. The board decided to suspend the proposed joint venture with China's Jinnaite Machinery Co. Ltd., with both parties agreeing to cooperate on select foundry products while remaining open to future collaboration. The company appointed Pratik Sachan as Head-Strategy & M&A and Senior Management Personnel. Sona Comstar maintains a net order book of ₹236 billion, representing 6.8 times FY25 revenue, and operates across 12 manufacturing plants serving global automotive customers.",
            "Sentiment": "neutral",
            "PublishDate": 1761563460761,
            "Source": "earnings"
        },
        {
            "Title": "Sona BLW Precision Forgings Grants 6.3 Lakh Employee Stock Options at ₹478.70 Exercise Price",
            "Summary": "Sona BLW Precision Forgings Limited's Nomination and Remuneration Committee approved the grant of 6,30,000 employee stock options to eligible employees under the Sona Employee Stock Option Plan 2023. The options were granted on October 27, 2025, with an exercise price of ₹478.70 per share, representing the fair market value on the grant date. Each option converts to one equity share with a face value of ₹10. The options will vest equally over four years starting October 27, 2026, with subsequent vesting dates in 2027, 2028, and 2029. Employees have a maximum of three years from each vesting date to exercise their options. The ESOP 2023 plan was previously approved by shareholders in the Annual General Meeting held on July 19, 2023.",
            "Sentiment": "positive",
            "PublishDate": 1761549921387,
            "Source": "corporate_action"
        },
        {
            "Title": "Sona Comstar Partners with Neura Robotics for Advanced Technology Development",
            "Summary": "Sona Comstar has formed a partnership with Neura Robotics to develop advanced technologies and introduce robots and humanoids to India and other markets. The collaboration aims to bring robotic and humanoid technology solutions to these regions.",
            "Sentiment": "positive",
            "PublishDate": 1760062346702,
            "Source": "order&deals"
        },
        {
            "Title": "Sona BLW Precision Forgings Schedules Q2 Results Review for October 27",
            "Summary": "Sona BLW Precision Forgings has announced it will review its Q2 results on October 27. The company has set this date for the quarterly results review.",
            "Sentiment": "neutral",
            "PublishDate": 1759835670545,
            "Source": "earnings"
        },
        {
            "Title": "Tesla Plans Cheaper Model Y Variant to Drive Sales Growth",
            "Summary": "Tesla is planning to launch a more affordable version of its Model Y vehicle as part of efforts to increase sales. The initiative appears to be aimed at making the electric SUV accessible to a broader customer base through reduced pricing.",
            "Sentiment": "positive",
            "PublishDate": 1759811403973,
            "Source": "global"
        },
        {
            "Title": "Sona BLW Shares Rise 2% as Delhi HC Orders Asset Disclosure in Sunjay Kapur Inheritance Battle",
            "Summary": "Sona BLW Precision Forgings shares gained 1.93% to ₹454.10 amid developments in the inheritance dispute over businessman Sunjay Kapur's ₹10,000 crore estate. The Delhi High Court is hearing a three-way battle between widow Priya Kapur, mother Rani Kapur, and children of ex-wife Karisma Kapoor. Rani Kapur alleged suspicious transactions involving ₹500 crore worth of Sona Comstar assets sold to Singapore-based entities and claimed she was left with nothing. Karisma Kapoor's children are seeking one-fifth of the assets for each child, alleging the will is forged, while Priya Kapur stated they already received ₹1,900 crore from the family trust. The court directed Priya Kapur to disclose all of Sunjay Kapur's known assets and submit a reply within three weeks, with the next hearing scheduled for October 9.",
            "Sentiment": "neutral",
            "PublishDate": 1757489065245,
            "Source": "stock"
        },
        {
            "Title": "Sona BLW Precision Forgings Receives PLI Certification for Three Additional Electric Vehicle Motor Products",
            "Summary": "Sona BLW Precision Forgings Limited has received certification for three additional products under the Production-Linked Incentive Scheme for the Automobile and Auto Component Industry. The certifications cover two traction motors for electric three-wheelers and one traction motor for electric two-wheelers. The Ministry of Heavy Industries approved these certifications on August 4, 2025, and they were released by the testing agency on August 23, 2025. These certifications enable the company to avail benefits and incentives under the PLI scheme. This follows the company's earlier intimations regarding PLI certifications throughout 2024.",
            "Sentiment": "positive",
            "PublishDate": 1756120169143,
            "Source": "stock"
        },
        {
            "Title": "Sona BLW Precision Forgings Sees Rs. 38.38 Crore Block Trade on NSE",
            "Summary": "Sona BLW Precision Forgings Ltd. witnessed a block trade worth Rs. 38.38 crores on the NSE. The transaction involved approximately 831,110 shares at a price of Rs. 461.80 per share.",
            "Sentiment": "neutral",
            "PublishDate": 1755597358736,
            "Source": "order&deals"
        },
        {
            "Title": "Sona BLW Reports Worst Quarter Since IPO with 5% Revenue Decline in Q1 FY26",
            "Summary": "Sona BLW Precision Forgings reported a challenging Q1 FY26 with revenue declining 5% year-over-year to ₹851 crores and EBITDA falling 19% to ₹203 crores. The company described it as their worst quarter since IPO due to four temporary factors: delayed revenue recognition from a European EV customer, sharp sales decline from a major global EV customer, shortage of heavy rare earth magnets from China affecting EV traction motor production, and US tariff uncertainties slowing customer procurement. BEV revenue dropped 25% to ₹210 crores, with BEV revenue share decreasing from 33% to 28%. Despite challenges, the company achieved its highest ever orderbook of ₹262 billion and received its largest single order in 2.5 years from a North American OEM. The company successfully integrated its newly acquired Railway business and signed a term sheet for a China joint venture with JNT, where Sona will hold 60% controlling stake. Management expects most issues to be temporary and resolve in coming quarters, with major EV order ramp-ups expected from Q4 FY26 onwards.",
            "Sentiment": "negative",
            "PublishDate": 1754741861916,
            "Source": "earnings"
        },
        {
            "Title": "UK Police Declare Sunjay Kapur's Death Non-Suspicious Despite Family's Concerns",
            "Summary": "Surrey Police stated that the death of Sunjay Kapur, Chairman of auto components company Sona BLW Precision Forgings (Sona Comstar), is being treated as non-suspicious. Kapur, 53, died on June 12 while playing polo at Guards Polo Club in Surrey. His mother, Rani Kapur, has approached UK authorities seeking investigation into what she calls highly suspicious circumstances. A coroner's report referenced in media indicates the cause of death as left ventricular hypertrophy and ischemic heart disease, both related to heart attack. Rani Kapur's legal representative noted discrepancies, including no mention of a bee sting in the report despite earlier claims. Following Kapur's death, Sona Comstar appointed Jeffery Mark Overly as chairman on June 23. The company's shareholders approved the appointment of Kapur's wife, Priya Sachdev Kapur, as non-executive director on July 25. Rani Kapur has claimed majority shareholding in Sona Group based on a 2015 will, though the company states she has not been a shareholder since at least 2019.",
            "Sentiment": "negative",
            "PublishDate": 1754450140517,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sona BLW Precision Announces Strategic Expansion Plans and Revenue Diversification Targets",
            "Summary": "Sona BLW Precision outlined several strategic initiatives during its conference call. The company expects revenue diversification with Asia (including India) likely to exceed 50% share and non-automotive revenue to increase to over 25% in coming quarters. Sona Comstar signed a term sheet to form a joint venture with JNT in China for local manufacturing of driveline systems, holding a 60% controlling stake with operations planned to begin in the second half of FY2026. The company revised its EBITDA margin guidance to 23.5-25% from the previous 25-27% range after incorporating the Railway Division. Main product launches focused on motors have been delayed by 1-2 months with major ramp-ups expected in Q4. Major product launches are planned for FY26-28, with several programs expected to generate Rs 200-300 crores per year. The company is developing new railway products including automatic plug door systems, HVAC systems, and electric control panels. Sona BLW expects a potential 3-4% revenue impact from US tariffs, though this would take 12-18 months to materialize if implemented.",
            "Sentiment": "neutral",
            "PublishDate": 1754365400746,
            "Source": "stock"
        },
        {
            "Title": "Rani Kapur Seeks UK Police Investigation Into Son Sanjay Kapur's Death, Disputes Sona Comstar Decisions",
            "Summary": "Rani Kapur, mother of deceased businessman Sanjay Kapur, has written to UK police requesting investigation into alleged questionable circumstances surrounding her son's death on June 12. Sanjay Kapur is survived by wife Priya Sachdev, two children, and sisters Mandira Kapur and Superna Motwane. Rani Kapur also wrote to Sona BLW Precision Forgings Ltd. board seeking deferment of the company's Annual General Meeting, alleging coercion, misuse of documents, and attempts to usurp the family's legacy following her son's death. Sona BLW responded that Rani Kapur is neither a shareholder nor company official and has no legal standing to influence corporate decisions. The company stated it is not a 'family run' business and that Rani Kapur has had no direct or indirect role in the company since at least 2019.",
            "Sentiment": "negative",
            "PublishDate": 1754306002639,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sona BLW Precision Forgings Reports Mixed Q1 Results with Revenue and Margin Decline",
            "Summary": "Sona BLW Precision Forgings reported Q1 revenue of 8.54 billion rupees, down from 8.91 billion rupees year-over-year, slightly below the estimated 8.56 billion rupees. The company's EBITDA declined to 2.03 billion rupees from 2.5 billion rupees in the previous year, falling short of the 2.05 billion rupees estimate. EBITDA margin compressed to 23.71% from 28.18% year-over-year, missing the estimated 24%. Consolidated net profit decreased to 1.25 billion rupees from 1.42 billion rupees year-over-year, though it marginally exceeded the estimate of 1.23 billion rupees.",
            "Sentiment": "negative",
            "PublishDate": 1754304363945,
            "Source": "earnings"
        },
        {
            "Title": "Sona BLW Reports 22.5% Drop in Quarterly Profit Despite Railway Business Acquisition",
            "Summary": "Sona BLW Precision Forgings reported a standalone profit of Rs 1,201.30 million for the quarter ended June 30, 2025, compared to Rs 1,549.60 million in the same period last year. Revenue from operations declined to Rs 7,673.14 million from Rs 8,300.65 million year-over-year. The company completed the acquisition of Railway Business from Escorts Kubota Limited on June 1, 2025, for Rs 16,382.00 million. On a consolidated basis, profit reached Rs 1,636.85 million versus Rs 1,217.09 million in the previous year quarter. The company incurred exceptional costs of Rs 91.74 million related to various acquisition opportunities. Earnings per share on standalone basis was Rs 1.93 compared to Rs 2.64 in the corresponding quarter last year. The board approved a final dividend of Rs 1.60 per equity share for the financial year ended March 31, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1754303589982,
            "Source": "earnings"
        },
        {
            "Title": "Government Considering ₹13,000 Crore Support Package for Auto Parts Sector",
            "Summary": "The government may offer a ₹13,000 crore support package for the auto parts sector. SONA BLW is mentioned in connection with this potential government initiative for the automotive components industry.",
            "Sentiment": "positive",
            "PublishDate": 1754026297409,
            "Source": "sectoral"
        },
        {
            "Title": "Sona BLW Issues Cease and Desist Letter to Rani Kapur Over Defamation Claims",
            "Summary": "Sona BLW Precision Forgings has sent a cease and desist letter to Rani Kapur, accusing her of defaming the company and causing reputational and financial harm. Kapur, mother of late industrialist Sunjay Kapur who passed away on June 12, had earlier sought postponement of the company's July 25 annual general meeting. She alleged coercion, misuse of documents, and unauthorized director appointments, claiming to be the majority shareholder through her late husband's will. Sona BLW rejected these allegations and proceeded with the AGM as scheduled. The company stated that Rani Kapur has not held any direct or indirect role since at least 2019 and is not listed as a shareholder in company records. The company called her claims 'baseless' and 'legally untenable,' stating that continued false narratives have hurt shareholders and damaged company interests.",
            "Sentiment": "negative",
            "PublishDate": 1753858421176,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sona BLW Precision Forgings to Announce Q1 FY26 Results on August 4, 2025",
            "Summary": "Sona BLW Precision Forgings Limited (Sona Comstar) will announce its quarterly results for the period ended June 30, 2025, on August 4, 2025. The mobility technology company, which provides mission-critical systems and components to automotive OEMs and safety systems for railways in India, will host an earnings conference call at 4:30 PM IST on the same day. The earnings documents will be available on the company's website, and participants can register for the webcast through a provided link. The webcast recording will be archived on the company's website following the event.",
            "Sentiment": "neutral",
            "PublishDate": 1753772955162,
            "Source": "earnings"
        },
        {
            "Title": "Sona BLW Refutes Rani Kapur's Coercion Claims, Calls Allegations 'Baseless'",
            "Summary": "Sona BLW Precision Forgings has denied allegations made by Rani Kapur, mother of late Sona Comstar chairman Sunjay Kapur, regarding coercion and unauthorized director appointments. The auto parts manufacturer clarified it is not a 'family run' business and stated that Rani Kapur has not held any direct or indirect role in the company since 2019. The company called her claims of being coerced to sign documents 'legally untenable' and confirmed that official records show she has not been a shareholder since at least 2019. Sona BLW defended the reappointment of Jeffery Overly and Priya Sachdev Kapur as compliant with rules. The company expressed concern that false narratives and personal legal agendas have harmed shareholders, describing such actions as 'reckless' and 'deeply harmful' to company interests. After receiving Rani Kapur's request to defer the AGM, the company sought legal advice and concluded it could not postpone the meeting since she is not a shareholder.",
            "Sentiment": "negative",
            "PublishDate": 1753700046188,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sona BLW Precision Forgings Clarifies Rani Kapur's Non-Involvement with Sona Comstar Since 2019",
            "Summary": "Sona BLW Precision Forgings has stated that Rani Kapur has not been involved with Sona Comstar since 2019. The company made this clarification regarding Kapur's association with the related entity.",
            "Sentiment": "neutral",
            "PublishDate": 1753698556553,
            "Source": "stock"
        },
        {
            "Title": "Sona Comstar Proceeds with AGM Despite Family Dispute Over Control",
            "Summary": "Sona BLW Precision Forgings Ltd (Sona Comstar) held its Annual General Meeting as scheduled despite a request from Rani Kapur to defer it. Rani Kapur, wife of the company's founder, had appealed for the deferment following the death of her son Sunjay Kapur on June 12, who was the company's chairman and non-executive director. She accused certain individuals of attempting to seize control of the family's legacy during their time of grief. Sona Comstar clarified that Rani Kapur has not been a shareholder since 2019, making her request legally invalid. The company is 71.98% publicly held and 28.02% owned by corporate promoter Aureus Investments Pvt Ltd. Priya Sachdev Kapur, Sunjay Kapur's wife, was appointed as Additional Non-Executive Director based on Aureus Investments' nomination. Rani Kapur claims to be the majority shareholder of the Sona Group under her husband Surinder Kapur's will and alleges she did not authorize anyone to act on her behalf.",
            "Sentiment": "negative",
            "PublishDate": 1753450487766,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sona BLW Precision Holds AGM Despite Family Member's Request for Postponement",
            "Summary": "Sona BLW Precision Forgings conducted its AGM as scheduled despite a request from Rani Kapur to postpone the meeting. Rani Kapur, mother of late industrialist Sunjay Kapur who died last month, objected to the appointment of certain directors as representatives of the Kapur family. In a letter dated July 24, she alleged that people were attempting to wrest control and usurp the family legacy during the family's mourning period. She stated that she had not given consent or officially nominated anyone to be on the board of Sona BLW Precision Forgings. Kapur also described her son's death in the UK as occurring under highly suspicious and unexplained circumstances. She requested the AGM be postponed for at least two weeks to allow her to gather necessary information, but the company proceeded with the meeting as originally scheduled.",
            "Sentiment": "negative",
            "PublishDate": 1753447438856,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sona BLW Precision Forgings Proceeds with AGM Despite Delay Request from Rani Kapur",
            "Summary": "Sona BLW Precision Forgings received an email from Rani Kapur requesting to delay the company's Annual General Meeting. The company decided the AGM could not be postponed and proceeded with the meeting as originally planned. The company also confirmed that no contracts have been signed with Rani Kapur.",
            "Sentiment": "neutral",
            "PublishDate": 1753445763851,
            "Source": "corporate_action"
        },
        {
            "Title": "Rani Kapur Seeks Deferment of Sona BLW AGM, Alleges Coercion Following Son's Death",
            "Summary": "Rani Kapur, mother of deceased businessman Sunjay Kapur and former chairperson of Sona BLW Precision Forgings Ltd., has written to the Sona Comstar board requesting postponement of the company's annual general meeting scheduled for July 25. In her letter, Kapur claims she was coerced into signing documents under duress following her son's death on June 12, 2025, and alleges attempts to usurp the family legacy. She states that as the sole beneficiary of founder Dr. Surinder Kapur's estate through his 2015 will, she is the majority shareholder of the Sona Group. Kapur denies giving consent for anyone to represent the family's interests on the company board and objects to resolutions appointing directors as family representatives. She has been denied access to her accounts and company documents, and requests the AGM be deferred by at least two weeks to allow her time to gather necessary information.",
            "Sentiment": "negative",
            "PublishDate": 1753429460711,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sona BLW Founder's Family Alleges Document Misuse and Coercion Over Family Legacy",
            "Summary": "The founder's family of Sona BLW has made allegations against the company, claiming that the company misused documents and coerced them regarding taking over the family legacy following the death of the founder's son. The family has raised concerns about the company's conduct in handling matters related to their family inheritance and business succession.",
            "Sentiment": "negative",
            "PublishDate": 1753424814135,
            "Source": "corporate_governance"
        },
        {
            "Title": "SONA BLW Signs Binding Term Sheet for Joint Venture in China",
            "Summary": "SONA BLW has signed a binding term sheet with Jinnaite Machinery to establish a joint venture in China. The agreement represents a strategic partnership between the two companies to set up operations in the Chinese market.",
            "Sentiment": "positive",
            "PublishDate": 1753008851215,
            "Source": "order&deals"
        },
        {
            "Title": "Sona BLW in Talks to Supply EV Parts to BYD",
            "Summary": "Sona BLW has clarified that it is in discussions to supply electric vehicle parts to BYD. The company is also engaging with several global and Indian clients for potential business opportunities in the EV sector.",
            "Sentiment": "positive",
            "PublishDate": 1752742410000,
            "Source": "default"
        },
        {
            "Title": "Sona BLW Precision Forging: Shares Surge on Potential BYD Partnership",
            "Summary": "Sona BLW's shares rose 7.5% following reports of advanced talks to supply EV components to Chinese manufacturer BYD. The company may set up a local manufacturing plant in China as part of a long-term collaboration. Sona BLW's Q4 revenue was 35% from EV business, with Tesla as a key client.",
            "Sentiment": "positive",
            "PublishDate": 1752734306000,
            "Source": "normal_news"
        },
        {
            "Title": "Block Trade of Sona BLW Precision Forgings Ltd. Shares on NSE",
            "Summary": "A block trade of approximately 2,055,715 shares of Sona BLW Precision Forgings Ltd. occurred on the National Stock Exchange (NSE) at a price of Rs. 459.25 per share. The total value of the transaction was Rs. 94.41 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1752724393000,
            "Source": "block_details"
        },
        {
            "Title": "Sona BLW Precision Forgings: Considers Local Rare Earth Magnet Production",
            "Summary": "Sona Comstar is considering manufacturing rare earth magnets in India, pending government incentives. The company is likely to apply for an upcoming scheme to boost local production. The decision will impact their traction motor production for electric vehicles. They await further details on incentives before finalizing investment plans.",
            "Sentiment": "neutral",
            "PublishDate": 1751285341000,
            "Source": "normal_news"
        },
        {
            "Title": "Sona Comstar Aims to Produce Rare Earth Magnets Locally",
            "Summary": "Sona Comstar, an Indian company, plans to manufacture rare earth magnets domestically to reduce reliance on imports from China, according to the company's CEO. This move is likely aimed at strengthening the local supply chain for electric vehicle components.",
            "Sentiment": "positive",
            "PublishDate": 1751275565000,
            "Source": "default"
        },
        {
            "Title": "Sona BLW Precision Forgings Ltd: Shifts Focus to East Asia for Growth",
            "Summary": "Sona Comstar is reorienting its strategy towards East Asian markets including India, China, Japan, and Korea for the next growth phase. The company plans to diversify products and explore emerging mobility technologies. However, it faces challenges from China's rare earth export restrictions, affecting 7-8% of its revenue from traction motors.",
            "Sentiment": "neutral",
            "PublishDate": 1750938685000,
            "Source": "normal_news"
        },
        {
            "Title": "Sona BLW Precision Forgings: New Leadership Appointments Following Chairman's Demise",
            "Summary": "Sona BLW Precision Forgings Ltd (Sona Comstar) has appointed Jeffrey Mark Overly as the new Chairperson and Priya Sachdev Kapur as an Additional Non-Executive Director. These appointments come after the sudden passing of former chairman Sunjay Kapur. Overly, previously an Independent Director, will serve until February 2031, subject to shareholder approval. Kapur will also chair the Corporate Social Responsibility Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1750677847000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Sona BLW Precision Forging: Chairman's Demise Prompts Leadership Transition",
            "Summary": "Sona Comstar's board to elect new chairman following Sunjay Kapur's sudden death. Company operations to continue under current MD and CEO Vivek Vikram Singh. No changes in management anticipated.",
            "Sentiment": "neutral",
            "PublishDate": 1750091561000,
            "Source": "corporate_governance"
        }
    ]
}