{
    "Symbol": "SOTL",
    "ISIN": "INE035D01020",
    "News": [
        {
            "Title": "Savita Oil Board Meeting Set for Feb 13, 2026",
            "Summary": "Savita Oil Technologies Limited has scheduled a board meeting on February 13, 2026, to consider Q3FY26 unaudited financial results. Trading window remains closed until 48 hours post-disclosure.",
            "Sentiment": "neutral",
            "PublishDate": 1770789882010,
            "Source": "co_actions_results"
        },
        {
            "Title": "Savita Oil Technologies Reports 17% Revenue Growth, Projects Sustained Double-Digit Expansion",
            "Summary": "Savita Oil Technologies reported revenue of ₹1,090 crore for Q2FY26, marking a 17% year-on-year increase. The company projects sustained double-digit growth driven by transformer oils, white oils, and EV fluids. The company is expanding its ester-based lubricants portfolio for energy storage and EV cooling applications. Savita Oil is targeting global market entry in advanced fluids while focusing on margin expansion and deepening its distribution network.",
            "Sentiment": "positive",
            "PublishDate": 1762527740907,
            "Source": "earnings"
        },
        {
            "Title": "Savita Oil Technologies Reports Strong Q2 Growth with 37% Jump in Net Profit",
            "Summary": "Savita Oil Technologies delivered robust quarterly performance with net profit rising to 436.5 million rupees from 318.1 million rupees year-over-year. Revenue increased to 10.75 billion rupees compared to 9.07 billion rupees in the same period last year. EBITDA grew significantly to 513.7 million rupees from 344 million rupees, while EBITDA margin improved to 4.78% from 3.79% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1762341233686,
            "Source": "earnings"
        },
        {
            "Title": "Savita Oil Technologies Sets September 15, 2025 as Record Date for FY 2024-25 Dividend",
            "Summary": "Savita Oil Technologies Limited has fixed September 15, 2025 as the record date for determining shareholder eligibility for dividend payment for FY 2024-25. The dividend is subject to approval at the Annual General Meeting scheduled for September 22, 2025. The company communicated this decision to BSE and NSE, where it trades under scrip code 524667 and symbol SOTL respectively.",
            "Sentiment": "neutral",
            "PublishDate": 1757409768897,
            "Source": "corporate_action"
        },
        {
            "Title": "Savita Oil Technologies Reports Strong Q1 FY26 Results with 40% Jump in Net Profit",
            "Summary": "Savita Oil Technologies delivered robust quarterly performance with revenue reaching Rs. 1,014 crore, marking a 4.2% year-on-year increase. The company's profitability showed significant improvement with EBITDA rising 31.3% to Rs. 84 crore and net profit surging 40% to Rs. 56 crore. The company operates through two main segments: Petroleum Specialty Oils contributing 71% of revenue and Lubricating Oils accounting for 28%. Key business developments include the commercialization of a synthetic ester plant and launch of SavsolEster5 automotive lubricants range. The company appointed Sidharth Malhotra as brand ambassador for its SAVSOL brand. Management outlined growth strategies focusing on expanding distribution networks, developing sustainable products, capacity expansion, and premiumization of offerings. The company expects to benefit from rising transmission investments, grid infrastructure modernization, and India's low vehicle density.",
            "Sentiment": "positive",
            "PublishDate": 1755320722368,
            "Source": "earnings"
        },
        {
            "Title": "Savita Oil Technologies Reports 40.9% Jump in Profit Before Tax with Rs. 1,013.6 Crores Total Income",
            "Summary": "Savita Oil Technologies Limited reported total income of Rs. 1,013.6 crores, marking a 4.2% year-over-year increase. The company achieved profit before tax of Rs. 72.3 crores, representing a 40.9% growth. EBITDA rose 31.3% to Rs. 84.3 crores with margins improving to 8.3% from 6.6%. The company recorded double-digit volume growth in domestic business and steady growth across Transformer Oil and Lubricant Divisions. This marks the second consecutive quarter of surpassing Rs. 1,000 crores in quarterly income. New product launches included fluids for transformers, electric vehicles, and battery energy storage systems in the Ester range. The Savsol Ester5 automotive lubricants range launched previously has gained customer traction and is growing at 6X the industry growth rate. Chairman and Managing Director Gautam N. Mehra highlighted the robust performance and noted that immersion cooling fluids for electric vehicle applications are gaining customer traction with steadily ramping volumes.",
            "Sentiment": "positive",
            "PublishDate": 1754569452409,
            "Source": "earnings"
        },
        {
            "Title": "Savita Oil Technologies Reports 39% Jump in Q1 Net Profit to 589 Million Rupees",
            "Summary": "Savita Oil Technologies reported a net profit of 589 million rupees in Q1, representing a significant increase from 423 million rupees in the same period last year. The company's EBITDA rose to 598 million rupees compared to 472 million rupees year-over-year. EBITDA margin improved to 6.05% from 4.94% in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1754557113942,
            "Source": "earnings"
        },
        {
            "Title": "Savita Oil Technologies Reports Q4 Results and Recommends Dividend",
            "Summary": "Savita Oil Technologies has announced its Q4 financial results and dividend recommendation. The company's Q4 revenue increased to 10.06 billion rupees from 9.7 billion rupees year-over-year. EBITDA rose to 482.9 million rupees from 320 million rupees, with the EBITDA margin improving to 4.80% from 3.29%. Net profit for Q4 increased to 345.3 million rupees from 327 million rupees year-over-year and 151.3 million rupees quarter-over-quarter. The company has recommended a final dividend of 4 rupees per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1747655974000,
            "Source": "result"
        },
        {
            "Title": "Savita Oil Technologies: Q3 Profit Plunges 81.47% YoY",
            "Summary": "Savita Oil Technologies reported Q3 FY25 results with profit falling 81.47% YoY to ₹12.48 crore. Revenue decreased 1.35% to ₹945.44 crore. EPS dropped to ₹1.82, down 81.33% YoY. Operating income declined 79.99% YoY.",
            "Sentiment": "negative",
            "PublishDate": 1739653194000,
            "Source": "earnings"
        },
        {
            "Title": "Savita Oil Tech Reports Significant Decline in Q3 EBITDA",
            "Summary": "Savita Oil Tech has reported a substantial decrease in its Q3 EBITDA, which fell to 219 million rupees from 855 million rupees in the same quarter last year. The company's EBITDA margin also contracted sharply, dropping to 2.32% from 8.93% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1739436040000,
            "Source": "earnings"
        },
        {
            "Title": "Savita Oil Technologies Reports Q3 Revenue",
            "Summary": "Savita Oil Technologies has reported its third quarter revenue of 9.4 billion rupees, compared to 9.6 billion rupees in the same period last year, indicating a slight year-over-year decrease.",
            "Sentiment": "neutral",
            "PublishDate": 1739436023000,
            "Source": "earnings"
        },
        {
            "Title": "Savita Oil Technologies Reports Significant Decline in Q3 Net Profit",
            "Summary": "Savita Oil Technologies has reported a net profit of 151 million rupees for the third quarter, marking a substantial decrease from 680 million rupees in the same period last year. This represents a year-over-year decline of approximately 77.8% in the company's quarterly earnings.",
            "Sentiment": "negative",
            "PublishDate": 1739436005000,
            "Source": "earnings"
        }
    ]
}