{
    "Symbol": "SOUTHWEST",
    "ISIN": "INE980Y01015",
    "News": [
        {
            "Title": "South West Pinnacle Q3FY26 Net Profit Jumps 181.5%",
            "Summary": "South West Pinnacle Exploration reported strong Q3FY26 results with net profit rising 181.5% to ₹979.09 lakhs. Revenue grew 31.8% to ₹6,266.20 lakhs driven by drilling operations.",
            "Sentiment": "positive",
            "PublishDate": 1770637341733,
            "Source": "co_actions_results"
        },
        {
            "Title": "South West Pinnacle Wins ₹30.45 Cr Coal Projects",
            "Summary": "South West Pinnacle Exploration secures two coal exploration project awards from CMPDI worth approximately ₹30.45 crores across Madhya Pradesh and Maharashtra states.",
            "Sentiment": "positive",
            "PublishDate": 1770014703368,
            "Source": "stocks"
        },
        {
            "Title": "CRISIL Revises SouthWest Pinnacle Exploration's Outlook to Positive on Strong Growth Prospects",
            "Summary": "CRISIL revised SouthWest Pinnacle Exploration Ltd's long-term bank facilities outlook to Positive from Stable while reaffirming BBB/A3 ratings on Rs 83.69 crore facilities. The revision reflects expectations of sustained operational improvement backed by robust revenue growth, healthy profitability, and a record order book of Rs 412 crore as of September 2025.",
            "Sentiment": "positive",
            "PublishDate": 1765010829676,
            "Source": "stock"
        },
        {
            "Title": "SouthWest Pinnacle Exploration Gets Accredited as Prospecting Agency for Jharkhand Coal Block",
            "Summary": "SouthWest Pinnacle Exploration Limited has been notified as an accredited prospecting agency by the Ministry of Coal to carry out exploration operations for coal and lignite, enabling the company to commence exploration and development activities for its Jogeshwar and Khas Jogeshwar coal blocks in Jharkhand. This accreditation positions the company competitively among elite peers and opens doors to lucrative contracts and revenue growth while allowing faster development of the mine with reduced approval timelines.",
            "Sentiment": "positive",
            "PublishDate": 1764555644101,
            "Source": "stock"
        },
        {
            "Title": "SouthWest Pinnacle Exploration Wins ₹11.78 Crore Bauxite Mining Contract from NALCO",
            "Summary": "SouthWest Pinnacle Exploration Limited received a Letter of Award from National Aluminium Company Limited (NALCO) for detailed exploration of bauxite mines in Orisha state, valued at approximately ₹11.78 crores including GST. The project involves survey, exploration drilling using core drill machines and geological reporting, to be completed within 24 months, marking NALCO as a new addition to the company's client portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1764055280313,
            "Source": "order&deals"
        },
        {
            "Title": "SouthWest Pinnacle Exploration Reports 128% Revenue Growth in Q2 FY26, Secures Rs 412 Crore Order Book",
            "Summary": "SouthWest Pinnacle Exploration Limited reported strong quarterly results with operating revenue of Rs 62 crores in Q2 FY26, representing a 128% year-on-year increase. EBITDA grew 326% to Rs 15 crores with a margin of 23.24%. Net profit after tax reached Rs 8.4 crores compared to Rs 40 lakhs in Q2 FY25, marking a 20-fold increase. For the first half of FY26, operating revenue was Rs 103 crores (81% growth), EBITDA at Rs 20 crores (148% growth), and net profit of Rs 11 crores (4.7 times growth). The company secured new orders worth Rs 85 crores during the quarter, including a Rs 15 crore contract from JSW Energy for coal exploration, bringing total order book to Rs 412 crores. The company commenced the second phase of CBM production under a revised Rs 153 crore contract with Reliance Industries. SouthWest Pinnacle has formed a new joint venture Al Hadeetha Mining LLC in Oman and was awarded a coal block in Jharkhand covering 266 hectares with estimated geological reserves of 84 million tonnes. Management provided growth guidance of 15-20% year-on-year for the next three to five years.",
            "Sentiment": "positive",
            "PublishDate": 1762299081306,
            "Source": "earnings"
        },
        {
            "Title": "South West Pinnacle Targets Revenue Doubling With ₹4,122 Million Order Book and Oman Joint Ventures",
            "Summary": "South West Pinnacle plans to double its revenues leveraging its ₹4,122 million order book, joint ventures in Oman, and new 3D seismic and coalbed methane projects. The company expects international expansion and diversification into aquifer mapping to help maintain its 19% EBITDA margin.",
            "Sentiment": "positive",
            "PublishDate": 1761754374006,
            "Source": "stock"
        },
        {
            "Title": "South West Pinnacle Exploration Pursues New Tenders to Boost Order Book",
            "Summary": "South West Pinnacle Exploration is engaging in several new tenders to enhance its order book, suggesting growth potential in the short to medium term. A company executive highlighted that Q3 and Q4 are the company's strongest quarters and expressed confidence in improved performance, citing a healthy order book as the basis for optimism.",
            "Sentiment": "positive",
            "PublishDate": 1761751054721,
            "Source": "stock"
        },
        {
            "Title": "South West Pinnacle Exploration Reports Strong Q2 Performance with 25x Jump in Net Profit",
            "Summary": "South West Pinnacle Exploration delivered robust quarterly results with net profit surging to 76 million rupees from 3 million rupees in the same period last year. Revenue increased to 624 million rupees compared to 473 million rupees year-over-year. EBITDA rose significantly to 145 million rupees from 34.5 million rupees, while EBITDA margin expanded to 23.26% from 12.63% in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1761736284198,
            "Source": "earnings"
        },
        {
            "Title": "South West Pinnacle Exploration Secures ₹16.93 Crore Coal Exploration Contracts",
            "Summary": "South West Pinnacle Exploration Limited has been awarded two Letters of Award for coal exploration services with a combined value of approximately ₹16.93 crores. The larger contract worth ₹15.26 crore comes from JSW Energy (Utkal) Limited for coal exploration and related services including survey and geophysical logging in Odisha. This project has a duration of 3.5 months and the company expects to realize the entire revenue during FY 2026. The second contract valued at ₹1.67 crore is from Central Mine Planning and Design Institute Ltd., a subsidiary of Coal India Ltd., for coal exploration services in Madhya Pradesh and Chhattisgarh over a 24-month period. The scope includes geophysical and sonic logging services, with a 5% performance security requirement.",
            "Sentiment": "positive",
            "PublishDate": 1760329491809,
            "Source": "order&deals"
        },
        {
            "Title": "South West Pinnacle Exploration Submits Updated Investor Presentation for FY 2025-26",
            "Summary": "South West Pinnacle Exploration Limited submitted an updated investor presentation to NSE and BSE. The company, established in 2006, is a private exploration firm specializing in mineral and unconventional energy resource exploration. Key highlights include 150+ successful project deliveries, 28+ lakh meters drilled, 18 ongoing projects, and 19+ years of experience. The company maintains a robust order book of INR 3,320 million as of June 30, 2025. Financial performance shows operating revenue of INR 1,803 million in FY25 with 18.64% EBITDA margins. Q1-FY26 revenue reached INR 402 million with 14.43% EBITDA margins. The company operates 36 advanced drill rigs and has completed projects across coal, ferrous, non-ferrous, atomic minerals, and oil & gas sectors. Notable clients include Reliance, Vedanta, Oil India, JK Cement, and Hindustan Copper. The company has international operations through joint ventures in Oman and was awarded a coal block in Jharkhand with 84 million tonnes of geological reserves.",
            "Sentiment": "positive",
            "PublishDate": 1755285415249,
            "Source": "stock"
        },
        {
            "Title": "Southwest Pinnacle Exploration Reports 36.6% Revenue Growth in Q1 FY26, Appoints New Secretarial Auditor",
            "Summary": "South West Pinnacle Exploration Limited reported quarterly results for the quarter ended June 30, 2025, with consolidated revenue from operations increasing to Rs 4,021.62 lakhs compared to Rs 2,942.93 lakhs in the same quarter last year. The company's consolidated profit after tax rose to Rs 240.32 lakhs from Rs 187.00 lakhs year-on-year. The drilling and exploration segment generated the entire revenue of Rs 4,021.62 lakhs, while the coal business segment recorded nil revenue during the quarter. The board appointed Mr. Baladeva Chitranjan as Secretarial Auditor for a five-year term, subject to shareholder approval at the upcoming 19th Annual General Meeting. The company also finalized arrangements for conducting its AGM through video conference and appointed NSDL for e-voting facilities. Basic earnings per share stood at Rs 0.81 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755008567018,
            "Source": "earnings"
        },
        {
            "Title": "South West Pinnacle Exploration Receives ₹9 Crore Order",
            "Summary": "South West Pinnacle Exploration has received an order valued at ₹9 crore. No further details about the order or its nature were provided in the given news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1751441657000,
            "Source": "default"
        },
        {
            "Title": "South West Pinnacle Exploration Reports Significant Q4 Growth",
            "Summary": "South West Pinnacle Exploration has reported strong Q4 results. The company's EBITDA doubled to 156 million rupees from 78 million rupees year-over-year. The EBITDA margin improved to 21.16% from 17.39%. Revenue increased to 738 million rupees from 450 million rupees. Net profit saw a substantial rise to 91 million rupees from 22 million rupees in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1747901719000,
            "Source": "result"
        },
        {
            "Title": "South West Pinnacle Exploration Incorporates New Subsidiary",
            "Summary": "South West Pinnacle Exploration has incorporated a wholly owned subsidiary named South West Geo Services. This move represents a significant corporate action, potentially expanding the company's operational capabilities or diversifying its business interests.",
            "Sentiment": "positive",
            "PublishDate": 1737726337000,
            "Source": "corporate_action"
        },
        {
            "Title": "South West Pinnacle Subsidiary Signs Mining Concession Agreement in Oman",
            "Summary": "A subsidiary of South West Pinnacle has entered into a concession agreement with Oman's Ministry of Energy and Minerals for the exploration and mining of Block 22B in Izki town.",
            "Sentiment": "positive",
            "PublishDate": 1737689390000,
            "Source": "corporate_action"
        },
        {
            "Title": "South West Pinnacle Signs Concession Agreement for Oman's Block 22B",
            "Summary": "South West Pinnacle has entered into a concession agreement for Block 22B in Oman. The block is reported to have high potential for additional mineral discoveries, indicating promising prospects for the company's exploration activities in the region.",
            "Sentiment": "positive",
            "PublishDate": 1737604283000,
            "Source": "corporate_action"
        },
        {
            "Title": "South West Pinnacle: Secures ₹158 Crore Contract from Reliance Industries",
            "Summary": "South West Pinnacle won a ₹158 crore contract from Reliance Industries for CBM production. The stock hit its upper circuit of ₹165.27, rising 10% on the NSE.",
            "Sentiment": "positive",
            "PublishDate": 1735706605000,
            "Source": "order&deals"
        },
        {
            "Title": "South West Pinnacle Exploration Secures 160 Crore Rupee Order",
            "Summary": "South West Pinnacle Exploration has won a new order worth 160 crore rupees. The company, which has a market capitalization of 440 crore rupees, has not provided further details about the nature or duration of the order.",
            "Sentiment": "positive",
            "PublishDate": 1735703199000,
            "Source": "order&deals"
        }
    ]
}