{
    "Symbol": "SOUTHBANK",
    "ISIN": "INE683A01023",
    "News": [
        {
            "Title": "South Indian Bank Gets RBI Nod for New Chairman",
            "Summary": "South Indian Bank receives regulatory approval from RBI for José Joseph Kattoor's appointment as Non-Executive Part-Time Chairman, marking a key leadership transition for the private sector bank.",
            "Sentiment": "positive",
            "PublishDate": 1770130257343,
            "Source": "stocks"
        },
        {
            "Title": "South Indian Bank CEO P R Seshadri to Step Down",
            "Summary": "South Indian Bank's MD & CEO P R Seshadri will not seek reappointment after his current term ends on September 30, 2026. The Board has initiated succession planning to identify a suitable replacement.",
            "Sentiment": "neutral",
            "PublishDate": 1769703574296,
            "Source": "stocks"
        },
        {
            "Title": "South Indian Bank alerts on Jan 27 nationwide strike",
            "Summary": "South Indian Bank informs exchanges about potential disruption to branch operations due to United Forum of Bank Unions' nationwide strike call on January 27, 2026, while ATMs and digital services remain operational.",
            "Sentiment": "neutral",
            "PublishDate": 1769170178962,
            "Source": "stocks"
        },
        {
            "Title": "Indian Bank Eyes 12-13% Credit Growth Target",
            "Summary": "Indian Bank management expects to exceed current credit growth guidance and sustain momentum into next year, targeting 12-13% growth while maintaining focus on asset quality improvements.",
            "Sentiment": "positive",
            "PublishDate": 1769138954827,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Bank Sets Asset Quality Targets for FY25",
            "Summary": "Indian Bank provides guidance on maintaining Gross NPA below 2% and Net NPA at 0.5%, with expectations of continued current slippage ratio trends despite potential March variations.",
            "Sentiment": "positive",
            "PublishDate": 1769138924500,
            "Source": "stocks"
        },
        {
            "Title": "Indian Bank Nears Digital Business Target Achievement",
            "Summary": "Indian Bank has achieved ₹1,98,350 crores in digital business for nine months ended Q3 FY26, representing 88.16% of its annual target of ₹2,25,000 crores, with management expressing confidence in surpassing the full-year target.",
            "Sentiment": "positive",
            "PublishDate": 1769138899332,
            "Source": "stocks"
        },
        {
            "Title": "Indian Bank Recovery On Track, Slippage Controlled",
            "Summary": "Indian Bank reports nine-month recovery of ₹5,153 crores against guidance of ₹5,500-6,500 crores, with slippage ratio at 0.69% within guidance parameters during concall update.",
            "Sentiment": "positive",
            "PublishDate": 1769138776437,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Bank Q3 Net Profit Rises 7.4% to ₹3,060 Crores",
            "Summary": "Indian Bank reported a net profit of ₹3,060 crores for Q3, marking a 7.4% year-on-year increase from ₹2,850 crores in the corresponding quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1769069305055,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian Bank Q3FY26 Results Show Strong Growth",
            "Summary": "South Indian Bank reported robust Q3FY26 performance with total income rising 8.04% YoY to ₹3,003.46 crores and net profit growing 9.49% to ₹374.32 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768550317871,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian Bank shares rise 4% on strong Q3 results",
            "Summary": "South Indian Bank shares jumped 3.75% to ₹44.05 following Q3 results showing 9.4% profit growth to ₹374 crores and improved asset quality with gross NPA declining to 2.67%.",
            "Sentiment": "positive",
            "PublishDate": 1768479360232,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian Bank Q3FY26 Net Profit Rises 9% to ₹374 Cr",
            "Summary": "South Indian Bank reported record quarterly net profit of ₹374.32 crores in Q3FY26, up 9% YoY. Gross NPA improved to 2.67% from 4.30%, while advances grew 11% to ₹96,764 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768472476226,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian Bank Q3 Results: Stock in Focus",
            "Summary": "South Indian Bank shares in focus after Q3 profit rises 9% to ₹374 crore with improved asset quality. Gross advances grew 11.27% YoY to ₹96,765 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768465000306,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian Bank Q3FY26 Net Profit Rises 9.5% YoY",
            "Summary": "South Indian Bank reported net profit of ₹37,432 lakhs for Q3FY26, up 9.5% YoY. Total income grew 8.0% to ₹3,00,346 lakhs while NPA ratios improved significantly with gross NPA at 2.67%.",
            "Sentiment": "positive",
            "PublishDate": 1768464529481,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian Bank Q3FY26 Earnings Call on Jan 16",
            "Summary": "South Indian Bank schedules investor conference call for January 16, 2026 at 4 PM IST to discuss Q3FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768222565484,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian Bank Board Meet on Jan 15 for Q3FY26 Results",
            "Summary": "The South Indian Bank has scheduled a board meeting on January 15, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window remains closed until January 17, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767620141683,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian Bank Q3FY26: Advances up 11%, deposits rise 12%",
            "Summary": "South Indian Bank reports strong Q3FY26 performance with gross advances growing 11.27% YoY to ₹96,765 crores and total deposits rising 12.17% to ₹1.18 lakh crores, while CASA ratio improves to 31.84%.",
            "Sentiment": "positive",
            "PublishDate": 1767270340479,
            "Source": "co_actions_results"
        },
        {
            "Title": "Indian Bank Q3 FY26: Total business grows 13.4%",
            "Summary": "State-owned Indian Bank reported 13.4% YoY growth in total business to ₹14.30 lakh crore in Q3 FY26. Gross advances rose 14.5% while deposits increased 12.5%, with RAM portfolio showing strong 17% growth.",
            "Sentiment": "positive",
            "PublishDate": 1767270183908,
            "Source": "co_actions_results"
        },
        {
            "Title": "Banking & Metal Stocks Get Analyst Buy Calls",
            "Summary": "Market analysts recommend buying Indian Bank, Bank of Baroda, SAIL, and JSW Steel while suggesting a sell on SBI Cards for the upcoming trading session.",
            "Sentiment": "positive",
            "PublishDate": 1767146169454,
            "Source": "stocks"
        },
        {
            "Title": "South Indian Bank Allots 1.06 Lakh Equity Shares",
            "Summary": "South Indian Bank allotted 1,06,226 equity shares under SIBESOS Scheme-2008 on December 24, 2025, raising ₹24.48 lakhs through stock option exercises across four tranches.",
            "Sentiment": "neutral",
            "PublishDate": 1766570831382,
            "Source": "co_actions_results"
        },
        {
            "Title": "South Indian Bank Allots 1.88 Lakh Equity Shares Under Employee Stock Option Scheme",
            "Summary": "South Indian Bank allotted 1,88,082 equity shares to eligible employees under its SIBESOS Scheme-2008 across three tranches with exercise prices ranging from Rs. 20 to Rs. 27.14 per share. The allotment increased the bank's issued and subscribed capital to Rs. 261.70 crores comprising 261.70 crore equity shares of Re. 1 each.",
            "Sentiment": "neutral",
            "PublishDate": 1764077926367,
            "Source": "corporate_action"
        },
        {
            "Title": "South Indian Bank Revises MCLR Rates Across All Tenors",
            "Summary": "South Indian Bank has revised its Marginal Cost of Funds Based Lending Rates (MCLR) effective November 20, 2025, with rates ranging from 8.15% for overnight MCLR to 9.65% for one-year MCLR. The rate revision affects borrowers across different loan tenors and reflects the bank's updated cost of funds structure.",
            "Sentiment": "neutral",
            "PublishDate": 1763465251788,
            "Source": "stock"
        },
        {
            "Title": "South Indian Bank Launches Women-Exclusive Premium Savings Account with Insurance and Lifestyle Benefits",
            "Summary": "South Indian Bank launched SIB HER Account, a premium savings product exclusively for women featuring auto-sweep facility, ₹1 crore air accident insurance, cancer care coverage up to ₹25 lakh, and complimentary airport lounge access. The account requires ₹50,000 monthly balance and targets deepening the bank's retail franchise by offering bundled financial services to affluent women customers including NRIs.",
            "Sentiment": "positive",
            "PublishDate": 1763371954200,
            "Source": "stock"
        },
        {
            "Title": "South Indian Bank Completes Rs 300 Crore Bond Redemption and Interest Payment",
            "Summary": "South Indian Bank has completed the maturity payment of its Non-Convertible, Redeemable, Unsecured, Basel III Compliant, Tier II Bonds on October 31, 2025. The bank redeemed 3,000 bonds with a total principal amount of Rs 300 crores and paid interest of Rs 18.03 crores. The bonds carried a coupon rate of 10.25% per annum with a face value of Rs 10 lakh each. Both the principal redemption and interest payment from March 31, 2025 to October 31, 2025 were made on the scheduled maturity date.",
            "Sentiment": "positive",
            "PublishDate": 1761903950095,
            "Source": "corporate_action"
        },
        {
            "Title": "South Indian Bank Reports 8% Net Profit Growth in Q2 FY26, NIM Hits Trough at 2.8%",
            "Summary": "South Indian Bank reported a net profit of Rs. 351 crores for Q2 FY26, marking 8% growth compared to Rs. 325 crores in Q2 FY25. Total deposits grew 10% year-on-year to Rs. 115,635 crores, while advances increased 9% to Rs. 92,286 crores. The bank's net interest margin compressed to 2.8%, which management believes represents the trough of the interest rate cycle. Asset quality improved significantly with gross NPA reducing to 2.93% from 4.40% year-on-year, and net NPA declining to 56 basis points from 1.31%. The bank maintained strong capital ratios with CAR at 17.70% and Tier-1 at 16.79%. Gold loan portfolio reached Rs. 18,845 crores with 13% year-on-year growth, while home loans and auto loans both achieved 25% growth. MSME disbursements surged 127% year-on-year, and retail loan disbursements grew 51%. Management expects NIMs to recover from current levels and aims to reduce corporate advances from 40% to one-third of the total book over the next 18 months while growing retail and MSME segments at 20%+ annually.",
            "Sentiment": "positive",
            "PublishDate": 1761141406076,
            "Source": "earnings"
        },
        {
            "Title": "South Indian Bank Targets 20%+ Credit Growth Through Retail and MSME Focus",
            "Summary": "South Indian Bank aims to sustain credit growth of over 20% by focusing on retail and MSME segments. The bank plans to leverage robust CASA (Current Account Savings Account) deposits and digital transformation initiatives to drive long-term profitability while maintaining stable asset quality.",
            "Sentiment": "positive",
            "PublishDate": 1760632351140,
            "Source": "stock"
        },
        {
            "Title": "South Indian Bank Reports Quarterly Results with Net Profit of ₹618.82 Crore",
            "Summary": "The South Indian Bank submitted unaudited financial results for the quarter and half year ended September 30, 2025. The bank reported a net profit of ₹618.82 crore for the quarter and ₹673.32 crore for the half year. Total income reached ₹5,500.97 crore for the quarter. The bank's gross NPA ratio stood at 2.93% while net NPA ratio was 0.56%. Capital adequacy ratio was reported at 18.04%. The bank exercised call option on its 9.50% Tier-II bonds worth ₹1,490 crore during the quarter, redeeming them early on September 12, 2025. The results were approved by the Board of Directors and reviewed by Joint Statutory Auditors with an unmodified opinion.",
            "Sentiment": "positive",
            "PublishDate": 1760602338588,
            "Source": "earnings"
        },
        {
            "Title": "South Indian Bank Reports 9-10% Growth in Key Business Metrics",
            "Summary": "The South Indian Bank reported business updates for the quarter ended September 30, 2025. The bank's gross advances increased by 9% year-on-year to Rs. 92,287 crore, total deposits grew by 10% to Rs. 1,15,635 crore, and CASA improved by 10% to Rs. 36,841 crore. The CASA ratio stood at 31.86%. The bank noted that it had undertaken a technical write-off of Rs. 900 crores during the quarter ended March 31, 2025, and excluding this adjustment, the year-on-year growth in gross advances would have been 10%. The data is provisional and subject to limited review by statutory auditors.",
            "Sentiment": "positive",
            "PublishDate": 1759335000905,
            "Source": "stock"
        },
        {
            "Title": "South Indian Bank Announces Maturity Details for Rs 300 Crore Tier II Bonds",
            "Summary": "The South Indian Bank has announced the maturity details for its Non-Convertible, Redeemable, Fully Paid-Up, Unsecured, Basel III Compliant, Tier II Bonds. The bonds, issued on September 30, 2015, with a face value of Rs. 10,00,000 each and a coupon rate of 10.25% per annum, will mature on October 31, 2025. The total issue size is Rs 300 crore. The record date is set for October 16, 2025. Interest will be paid up to October 30, 2025, along with the principal amount at par to eligible bondholders. The bank's liability towards bondholders will cease from the maturity date.",
            "Sentiment": "neutral",
            "PublishDate": 1758186093357,
            "Source": "corporate_action"
        },
        {
            "Title": "South Indian Bank Revises MCLR Rates Across Multiple Tenors",
            "Summary": "The South Indian Bank announced changes to its Marginal Cost of Funds Based Lending Rates (MCLR) effective August 20, 2025. The revised rates range from 8.20% for overnight MCLR to 9.70% for one-year MCLR. The new rate structure includes one-month MCLR at 8.65%, three-month MCLR at 9.60%, and six-month MCLR at 9.65%. The bank communicated these changes through official notifications to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1755524021040,
            "Source": "stock"
        },
        {
            "Title": "South Indian Bank Receives RBI Approval for Tier II Bond Call Option Exercise",
            "Summary": "The South Indian Bank Ltd has received approval from the Reserve Bank of India to exercise the call option on its Tier II Bond. The bond, issued on November 28, 2017, has a maturity date of May 28, 2028, carries a 9.50% coupon rate with half-yearly interest payments, and has an outstanding amount of Rs. 490 crore. The bank's Board of Directors is scheduled to meet on August 20, 2025, to decide on exercising this call option and related matters including record date and notice to bondholders. The call option can be exercised after a minimum period of five years post allotment, subject to RBI approval.",
            "Sentiment": "neutral",
            "PublishDate": 1755190564672,
            "Source": "corporate_action"
        },
        {
            "Title": "South Indian Bank Receives Credit Rating Upgrade to IND AA-/Stable for Basel III Tier 2 Debt",
            "Summary": "The South Indian Bank received an upgraded credit rating from India Ratings and Research for its Basel III tier 2 debt instruments worth INR 12.5 billion. The rating was revised from IND A+/Stable to IND AA-/Stable. The upgrade reflects the bank's improving profitability in FY25, supported by enhanced internal accruals and efficient capital utilization, leading to improvement in its capital base. The bank demonstrated prudent provisioning for stressed assets over FY25-1QFY26, resulting in improved provision coverage ratio and adequate capitalization. The upgrade also factors in ongoing asset quality improvement, evidenced by steady decline in gross non-performing assets and stressed assets, manageable special mention account II levels, and a calibrated approach towards corporate lending. The bank's granular retail deposit franchise and moderate loan-deposit ratio provide headroom for credit expansion. The agency also withdrew the rating for Basel III additional tier 1 perpetual bonds worth INR 5 billion as the debt was redeemed through call option exercise on January 24, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1753782675215,
            "Source": "stock"
        },
        {
            "Title": "South Indian Bank Reports 10% Net Profit Growth in Q1 FY26, Total Business Crosses Rs 2 Lakh Crores",
            "Summary": "South Indian Bank reported a net profit of Rs 322 crores for Q1 FY26, marking a 10% growth from Rs 294 crores in the same quarter last year. Operating profit increased significantly by 32% from Rs 508 crores to Rs 672 crores. Total deposits grew 9% to Rs 112,922 crores while gross advances rose 8% to Rs 89,198 crores. The bank's total business crossed the milestone of Rs 2 lakh crores, reaching Rs 2,02,119 crores with 9% growth. Asset quality improved with gross NPA reducing to 3.15% from 4.5% and net NPA declining to 0.68% from 1.44%. CASA deposits grew 9% year-on-year to Rs 36,204 crores. The bank's gold loan portfolio stands at Rs 17,446 crores with 7% year-on-year growth, while home loans grew 66% and auto loans increased 27%. Capital adequacy ratio was 19.48% with Tier 1 ratio at 18.25%. The bank generated Rs 256 crores in treasury income during the quarter, which was used to strengthen provisioning. Management expects credit growth of over 12% for the fiscal year and targets maintaining ROA around 100 basis points.",
            "Sentiment": "positive",
            "PublishDate": 1753283012684,
            "Source": "earnings"
        },
        {
            "Title": "South Indian Bank: Q1 Profit Up 10% YoY Despite NII Dip, Asset Quality Improves",
            "Summary": "South Indian Bank reported a 10% YoY increase in Q1 net profit to ₹322 crore, despite a 4% YoY decrease in NII to ₹832 crore. Asset quality improved with GNPA at 3.15% and NNPA at 0.68%, down from 3.20% and 0.92% respectively in the previous quarter.",
            "Sentiment": "positive",
            "PublishDate": 1752740430000,
            "Source": "earnings"
        },
        {
            "Title": "South Indian Bank Reports Q1 Financial Results",
            "Summary": "South Indian Bank has reported its Q1 financial results. Interest earned increased to 23.6 billion rupees from 23.14 billion rupees year-over-year. The bank's Gross Non-Performing Assets (GNPA) decreased to 3.15% from 3.20% quarter-over-quarter, while Net Non-Performing Assets (NNPA) reduced to 0.68% from 0.92% quarter-over-quarter. The bank's net profit rose to 3.22 billion rupees from 2.94 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1752738972000,
            "Source": "result"
        },
        {
            "Title": "South Indian Bank: Q1 FY26 Results Announcement and Earnings Call Scheduled",
            "Summary": "South Indian Bank will announce Q1 FY26 results on July 17, 2025. An earnings call is scheduled for July 18 at 4 p.m. The trading window for the bank's securities is closed from July 1 to July 19 for designated persons.",
            "Sentiment": "neutral",
            "PublishDate": 1752638498000,
            "Source": "corporate_action"
        },
        {
            "Title": "South Indian Bank Plans Fund Raising Through QIP and Other Methods",
            "Summary": "South Indian Bank has announced plans to raise funds by issuing equity shares through Qualified Institutional Placement (QIP) and other methods. The bank is also considering raising funds in Indian or foreign currency by issuing debt securities. These matters will be discussed on July 17.",
            "Sentiment": "positive",
            "PublishDate": 1752159895000,
            "Source": "default"
        },
        {
            "Title": "South Indian Bank: Q1 Business Update Shows Growth in Advances and Deposits",
            "Summary": "South Indian Bank reported an 8.02% YoY increase in gross advances to Rs 89,201 crore and a 9.07% YoY growth in deposits to Rs 1.13 lakh crore for Q1 FY2026. CASA rose 9.06% YoY to Rs 36,204 crore, with the CASA ratio stable at 32.06%.",
            "Sentiment": "positive",
            "PublishDate": 1751429916000,
            "Source": "earnings"
        },
        {
            "Title": "South Indian Bank Reports Growth in Advances and Deposits",
            "Summary": "South Indian Bank has reported an 8.02% year-over-year increase in gross advances as of June 30. The bank's provisional total deposits also saw growth, rising by 9.07% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1751415221000,
            "Source": "default"
        },
        {
            "Title": "South Indian Bank: Q1 Gross Advances Grow 8%, Deposits Rise 9%",
            "Summary": "South Indian Bank reported an 8.02% year-on-year increase in gross advances to Rs 89,201 crore for Q1 FY24. Deposits grew by 9.07% to Rs 1.13 lakh crore. CASA deposits increased by 9.06% to Rs 36,204 crore, maintaining a CASA ratio of 32.06%.",
            "Sentiment": "positive",
            "PublishDate": 1751380108000,
            "Source": "result"
        },
        {
            "Title": "South Indian Bank Reports Growth in Advances and Deposits",
            "Summary": "South Indian Bank has reported an 8.02% year-over-year increase in gross advances and a 9.07% year-over-year rise in provisional total deposits. The bank's performance indicates growth in both lending and deposit-taking activities.",
            "Sentiment": "positive",
            "PublishDate": 1751377452000,
            "Source": "default"
        },
        {
            "Title": "South Indian Bank: MCLR Rates Revised Effective Friday",
            "Summary": "South Indian Bank has announced revised marginal cost of fund-based lending rates (MCLR) for various tenors, effective from Friday. The overnight MCLR is set at 7.65%, one-month at 8.3%, three-month at 9.6%, six-month at 9.65%, and one-year at 9.75%.",
            "Sentiment": "neutral",
            "PublishDate": 1750255583000,
            "Source": "corporate_action"
        },
        {
            "Title": "South Indian Bank: MSME and Retail to Drive 12%+ Loan Growth in FY26",
            "Summary": "South Indian Bank targets over 12% loan growth in FY26, focusing on MSME and retail segments. MSME loans expected to grow over 20%. Net interest margins may shrink by 10-12 basis points. Asset quality improved with GNPAs at 3.2% and net NPAs at 0.92%. Bank aims to reduce cost-to-income ratio by 200-250 basis points in the current year.",
            "Sentiment": "positive",
            "PublishDate": 1747651332000,
            "Source": "earnings"
        },
        {
            "Title": "South Indian Bank: Q4 Profit Jumps 57.6%, Asset Quality Improves",
            "Summary": "South Indian Bank reported a 57.6% increase in Q4 profit to Rs 683 crore. The bank's asset quality improved with gross NPA ratio declining to 3.20%. A dividend of Rs 0.40 per equity share was announced. The stock price reached an 11-month high.",
            "Sentiment": "positive",
            "PublishDate": 1747375408000,
            "Source": "earnings"
        },
        {
            "Title": "South Indian Bank: Q4 Profit Surges 58%, Shares Hit 9-Month High",
            "Summary": "South Indian Bank's Q4 net profit rose 57.6% to Rs 683 crore. Gross NPA ratio improved to 3.20%. The bank announced a dividend of Rs 0.40 per share. Shares reached a nine-month high, rising 1.39% to Rs 27.25.",
            "Sentiment": "positive",
            "PublishDate": 1747301858000,
            "Source": "earnings"
        },
        {
            "Title": "South Indian Bank: Q4 Profit Rises 19%, Asset Quality Improves",
            "Summary": "South Indian Bank reported a 19% increase in Q4 net profit to ₹342.2 crore. Gross NPA improved to 3.2% from 4.3% in Q3. Net NPA decreased to 0.92% from 1.25%. Gross advances grew by 10% to ₹88,447 crore. Retail deposits increased by 7.44% to ₹1.05 lakh crore.",
            "Sentiment": "positive",
            "PublishDate": 1747300333000,
            "Source": "earnings"
        },
        {
            "Title": "South Indian Bank Reports Q4 Financial Results",
            "Summary": "South Indian Bank announced its Q4 financial results. Interest earned increased to 23.7 billion rupees from 22.7 billion year-over-year. The bank's Gross Non-Performing Assets (GNPA) improved to 3.20% from 4.30% quarter-over-quarter, while Net Non-Performing Assets (NNPA) decreased to 0.92% from 1.25%. The bank's standalone net profit rose to 3.4 billion rupees from 2.88 billion year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1747297272000,
            "Source": "result"
        },
        {
            "Title": "South Indian Bank: Q4 Results and FY25 Dividend Announcement Scheduled for May 15",
            "Summary": "South Indian Bank will announce Q4 and FY25 results on May 15. The board will consider dividend recommendation for FY25. An earnings call is scheduled for May 16. Trading window for designated persons is closed from April 1 to May 17.",
            "Sentiment": "neutral",
            "PublishDate": 1747195518000,
            "Source": "corporate_action"
        },
        {
            "Title": "South Indian Bank Reports Growth in Advances and Deposits",
            "Summary": "South Indian Bank has announced provisional financial figures as of March 31. The bank's gross advances have increased by 9.97% year-over-year, while total deposits have grown by 5.50% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1743639215000,
            "Source": "result"
        },
        {
            "Title": "South Indian Bank Reports Growth in Advances and Deposits",
            "Summary": "South Indian Bank has announced provisional financial figures as of March 31. The bank's gross advances have increased by 9.97% year-over-year, while total deposits have grown by 5.50% compared to the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1743595018000,
            "Source": "result"
        },
        {
            "Title": "South Indian Bank: Launches Digital Personal Loan Platform 'SIB QUICKPL'",
            "Summary": "South Indian Bank introduces SIB QUICKPL, a fully digital personal loan platform for new customers. It offers unsecured loans to salaried and self-employed individuals with strong credit profiles through a paperless process in 10 minutes. The platform integrates with the Account Aggregator framework and Income Tax portal for verification, eliminating document uploads.",
            "Sentiment": "positive",
            "PublishDate": 1740659364000,
            "Source": "normal_news"
        }
    ]
}