{
    "Symbol": "SPAL",
    "ISIN": "INE212I01016",
    "News": [
        {
            "Title": "SP Apparels schedules Q3FY26 earnings call for Feb 13",
            "Summary": "SP Apparels Limited has scheduled a conference call on February 13, 2026 at 12:00 PM IST to discuss its financial performance for the quarter ended December 31, 2025, with fund managers, analysts and investors.",
            "Sentiment": "neutral",
            "PublishDate": 1770728730823,
            "Source": "co_actions_results"
        },
        {
            "Title": "S.P. Apparels Seeks Shareholder Approval for Independent Director Appointment via Postal Ballot",
            "Summary": "S.P. Apparels Limited has issued a postal ballot notice seeking shareholder approval for the appointment of Srinivas Chidambaram as Non-Executive Independent Director for a five-year term from November 12, 2025 to November 11, 2030. The remote e-voting process runs from November 28, 2025 to December 27, 2025, with Chidambaram bringing over three decades of experience across healthcare, IT services, fintech, manufacturing and financial services sectors.",
            "Sentiment": "neutral",
            "PublishDate": 1764245018077,
            "Source": "corporate_action"
        },
        {
            "Title": "S.P. Apparels Reports Strong Q2 FY26 Performance with SPUK and Retail Divisions Turning Profitable",
            "Summary": "S.P. Apparels delivered robust quarterly results with consolidated revenue of INR 427 crores (9.2% YoY growth) and PAT of INR 34.7 crores (58.4% YoY growth), while SPUK division achieved positive EBITDA of INR 1.1 crores and retail division reported positive EBITDA of INR 53 lakhs after years of losses. The company maintains its FY27 revenue guidance of INR 2,000 crores despite U.S. tariff challenges, with strong performance across garment exports (24% growth with 18.9 million pieces), expanding Sri Lanka operations, and successful turnaround of subsidiary businesses.",
            "Sentiment": "positive",
            "PublishDate": 1763636486024,
            "Source": "earnings"
        },
        {
            "Title": "S.P. Apparels Independent Director A.S. AnandKumar Retires After Completing Tenure",
            "Summary": "S.P. Apparels Limited announced that Mr. A.S. AnandKumar (DIN: 00058292) ceased to be an Independent Director effective November 12, 2025, upon completion of his tenure. The Board acknowledged his valuable contributions and guidance during his directorship at the textile company.",
            "Sentiment": "neutral",
            "PublishDate": 1763203612042,
            "Source": "corporate_governance"
        },
        {
            "Title": "S.P. Apparels Appoints Srinivas Chidambaram as Independent Director",
            "Summary": "S.P. Apparels Limited's Board approved the appointment of Mr. Srinivas Chidambaram (DIN: 00514665) as a Non-executive Independent Director for a 5-year term starting November 12, 2025, subject to shareholder approval. The appointee brings over 35 years of corporate experience including 27 years in private equity, having been involved in investments of over $600 million across 30+ companies in various sectors.",
            "Sentiment": "positive",
            "PublishDate": 1763194930728,
            "Source": "corporate_governance"
        },
        {
            "Title": "S.P. Apparels Reports Strong Q2FY26 Results with 58% Jump in Standalone PAT",
            "Summary": "S.P. Apparels Limited delivered robust quarterly results with standalone profit after tax surging 58.3% to Rs. 347 million and total revenue growing 10.3% to Rs. 4,341.4 million on consolidated basis. The textile company's Board approved the results and announced a postal ballot process with record date set for November 21, 2025, while sales quantity exports increased to 18.9 million pieces from 15.3 million pieces.",
            "Sentiment": "positive",
            "PublishDate": 1763115594899,
            "Source": "earnings"
        },
        {
            "Title": "S.P. Apparels Appoints Srinivas Chidambaram as Independent Director",
            "Summary": "S.P. Apparels Limited's Board of Directors approved the appointment of Mr. Srinivas Chidambaram as a Non-executive Independent Director effective November 12, 2025. The appointment was made on the recommendation of the Nomination and Remuneration Committee and is subject to shareholder approval. Chidambaram brings over 35 years of corporate experience, including 27 years in private equity investing in India and Southeast Asia. He has been involved in investments exceeding $600 million across more than 30 companies in sectors including IT, Healthcare, Fintech, Financial Services, Manufacturing, and Infrastructure. The appointment is for a five-year term from November 12, 2025. Chidambaram has no existing relationships with the company's directors or key managerial personnel and is not debarred from holding directorial positions.",
            "Sentiment": "positive",
            "PublishDate": 1762946945610,
            "Source": "corporate_governance"
        },
        {
            "Title": "S.P. Apparels Invests Rs 43.5 Crore in Sri Lankan Subsidiary",
            "Summary": "S.P. Apparels Limited invested Rs 43,508,668 as equity in S.P. Apparels International Private Limited (SPAIPL), its wholly owned subsidiary based in Sri Lanka. The investment amounts to USD 490,000 and represents a 100% cash consideration transaction. SPAIPL was incorporated in Sri Lanka and is engaged in garments manufacturing business, with a turnover of 1,872,585 LKR as of March 2025. The investment is classified as a related party transaction, as Managing Director P. Sundararajan and Joint Managing Director S. Chenduran, both promoters of S.P. Apparels, also serve as directors in SPAIPL. The company stated the investment will enable expansion of business operations and provide strategic advantages through cost-effective manufacturing circumstances.",
            "Sentiment": "positive",
            "PublishDate": 1762609952350,
            "Source": "corporate_action"
        },
        {
            "Title": "S.P. Apparels Reports 63% Revenue Growth in Q1 FY26 Despite Margin Pressures",
            "Summary": "S.P. Apparels Limited, India's largest manufacturer and exporter of knitted garments for infants and children, reported strong revenue growth for Q1 FY26. Consolidated revenue increased 63.3% year-on-year to ₹4,050.7 crore, while EBITDA grew 52.8% to ₹545.6 crore. Profit after tax rose 14.5% to ₹206.6 crore. However, the company experienced margin compression with EBITDA margin declining to 13.5% from 14.4% in Q1 FY25, and PAT margin dropping to 5.1% from 7.3%. The garment exports segment drove growth with revenue up 35.8% to ₹3,729.4 crore, though its EBITDA margin fell to 14.6% from 15.6%. Export volumes increased to 18.6 million pieces from 15.8 million pieces in Q4 FY25, with net sales realization improving to ₹147.2 per piece. Capacity utilization reached 83%. The retail segment remained flat with minimal growth, while SPUK showed revenue growth of 26.3% but continued to report losses, though reduced from the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1755496278421,
            "Source": "earnings"
        },
        {
            "Title": "S.P. Apparels Reports 63% Revenue Growth in Q1 FY26 with Strong Performance Across Divisions",
            "Summary": "S.P. Apparels Limited reported consolidated revenue of Rs. 4,050.7 million for Q1 FY26, representing 63.3% year-over-year growth compared to Rs. 2,480.3 million in Q1 FY25. Consolidated EBITDA increased 52.8% to Rs. 545.6 million from Rs. 357.1 million, while profit after tax grew 14.5% to Rs. 206.6 million from Rs. 180.5 million. Earnings per share improved to Rs. 8.2 from Rs. 7.2. On standalone basis, adjusted total revenue grew 34.5% to Rs. 2,877.0 million with adjusted EBITDA rising 20.7% to Rs. 436.6 million. The garment division including Young Brand Apparel generated revenue of Rs. 3,729.4 million with EBITDA of Rs. 542.7 million at 14.6% margin. Export sales quantity increased to 18.6 million pieces from 13.8 million pieces. The board proposed a final dividend of Rs. 2 per equity share for the year ended March 31, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755169719772,
            "Source": "earnings"
        },
        {
            "Title": "S.P. Apparels Clarifies Record Date for Dividend Payment as August 25, 2025",
            "Summary": "S.P. Apparels Limited has clarified that the record date for dividend payment is August 25, 2025. The company acknowledged an inadvertent omission in their previous Board Meeting outcome disclosure dated August 6, 2025, where they failed to mention the word 'Dividend' in the context of the record date. The original disclosure included details about the Annual General Meeting date, final dividend recommendation for FY25, book closure dates, and cut-off date for shareholders' eligibility. The company has since updated the record date information in the Corporate Action section.",
            "Sentiment": "neutral",
            "PublishDate": 1754572937381,
            "Source": "corporate_action"
        },
        {
            "Title": "S.P. Apparels Board Approves Key Re-appointments and Sets AGM Date with Final Dividend Recommendation",
            "Summary": "S.P. Apparels Limited's Board of Directors approved several key appointments at their August 6, 2025 meeting. The company re-appointed Mr. Sundararajan Perumal Mudaliar as Chairman & Managing Director for a 3-year term starting November 21, 2025. Mrs. H. Lakshmi Priya and Mr. C.R. Rajagopal were re-appointed as non-executive Independent Directors for second terms of five years each, effective September 2, 2025. The Board also appointed MDS & Associates LLP as Secretarial Auditor for a five-year term beginning financial year 2025-26. The company scheduled its 20th Annual General Meeting for September 1, 2025, to be held virtually. The Board recommended a final dividend of Rs. 2.00 per share (20%) on face value of Rs. 10 each for the financial year ended March 31, 2025, to be paid within 30 days of the AGM. All appointments are subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1754465084129,
            "Source": "corporate_action"
        },
        {
            "Title": "S.P. Apparels Reports Q4 Financial Results",
            "Summary": "S.P. Apparels has released its Q4 financial results. The company's EBITDA increased to 542 million rupees from 408 million rupees year-over-year. The EBITDA margin slightly decreased to 13.6% from 13.8% year-over-year. Revenue grew to 4 billion rupees from 2.97 billion rupees in the same period last year. The consolidated net profit rose to 304 million rupees from 285 million rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1748339742000,
            "Source": "result"
        },
        {
            "Title": "S.P. Apparels Reports Improved Q3 EBITDA and Margin",
            "Summary": "S.P. Apparels has announced its Q3 financial results, showing significant improvement in both EBITDA and EBITDA margin. The company's EBITDA increased to 509 million rupees from 344 million rupees in the same quarter last year. The EBITDA margin also improved to 14.17% from 13.67% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739177683000,
            "Source": "earnings"
        },
        {
            "Title": "S.P. Apparels Reports 42% Increase in Q3 Consolidated Net Profit",
            "Summary": "S.P. Apparels, a textile and apparel company, has announced its financial results for the third quarter. The company's consolidated net profit rose to 250 million rupees, up from 176 million rupees in the same period last year, representing a significant year-over-year increase of approximately 42%.",
            "Sentiment": "positive",
            "PublishDate": 1739177632000,
            "Source": "earnings"
        },
        {
            "Title": "SP Apparels to Consider Q3 Results on February 10",
            "Summary": "SP Apparels Limited has announced that it will be considering its financial results for the third quarter on February 10. This indicates that the company is preparing to release its quarterly earnings report, which will provide insights into its financial performance for the period.",
            "Sentiment": "neutral",
            "PublishDate": 1738759594000,
            "Source": "earnings"
        },
        {
            "Title": "SP Apparels Reports Mixed Q2 Results",
            "Summary": "SP Apparels, a textile company, has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 497 million rupees from 465 million rupees in the same quarter last year. However, the EBITDA margin decreased to 12.70% from 15.90% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1731326617000,
            "Source": "result"
        },
        {
            "Title": "SP Apparels Reports Q2 Financial Results",
            "Summary": "SP Apparels announced its Q2 consolidated net profit of 219 million rupees, showing a decrease from 286 million rupees year-over-year (YoY) but an increase from 181 million rupees quarter-over-quarter (QoQ). The company's Q2 revenue increased to 3.9 billion rupees from 2.9 billion rupees YoY.",
            "Sentiment": "neutral",
            "PublishDate": 1731326534000,
            "Source": "result"
        }
    ]
}