{
    "Symbol": "SPANDANA",
    "ISIN": "INE572J01011",
    "News": [
        {
            "Title": "Spandana Sphoorty Q3FY26 Monitoring Report Filed",
            "Summary": "Spandana Sphoorty Financial submits CARE Ratings monitoring report for Q3FY26, showing complete utilization of Rs. 199.35 crore rights issue proceeds with no deviations from stated objectives.",
            "Sentiment": "neutral",
            "PublishDate": 1769522121468,
            "Source": "stocks"
        },
        {
            "Title": "Spandana Sphoorty Q3FY26 Loss Widens to ₹82.54 Cr",
            "Summary": "Spandana Sphoorty Financial reported a standalone net loss of ₹82.54 crores for Q3FY26, with technical write-offs of ₹207.59 crores during the quarter. The company appointed Ganesh KV as Chief Transformation Officer.",
            "Sentiment": "negative",
            "PublishDate": 1769512662249,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spandana Sphoorty Approves Key Leadership Changes",
            "Summary": "Spandana Sphoorty Financial shareholders approve appointment of Venkatesh Krishnan as Managing Director and CEO, along with remuneration revision for Chairperson Abanti Mitra through postal ballot.",
            "Sentiment": "positive",
            "PublishDate": 1768912009160,
            "Source": "stocks"
        },
        {
            "Title": "Spandana Sphoorty Board Meet Set for Jan 27, 2026",
            "Summary": "Spandana Sphoorty Financial has scheduled its board meeting for January 27, 2026, to review Q3FY26 unaudited financial results. Trading window remains closed until January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768824868434,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spandana Sphoorty evaluates Criss Financial merger",
            "Summary": "Spandana Sphoorty Financial's board grants in-principle approval for merger of subsidiary Criss Financial Ltd, constitutes steering committee to assess transaction terms and finalise merger scheme.",
            "Sentiment": "neutral",
            "PublishDate": 1768038839030,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spandana Sphoorty gets board nod for merger evaluation",
            "Summary": "Spandana Sphoorty Financial receives board approval to evaluate merger with subsidiary Criss Financial Limited. Company forms steering committee to assess terms and finalize proposal.",
            "Sentiment": "positive",
            "PublishDate": 1768034111213,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spandana Sphoorty Transfers ₹493.55 Cr Stressed Loans",
            "Summary": "Spandana Sphoorty Financial's Management Committee approves transfer of ₹493.55 crore stressed loan portfolio to ARC for ₹34.55 crore via Swiss Challenge Method, while raising ₹415 crore through NCDs.",
            "Sentiment": "neutral",
            "PublishDate": 1766994678655,
            "Source": "stocks"
        },
        {
            "Title": "Spandana Sphoorty Transfers Stressed Loans to ARC",
            "Summary": "Spandana Sphoorty Financial approves transfer of ₹493.55 crore stressed loan portfolio to Asset Reconstruction Company for ₹34.55 crore consideration via Swiss Challenge Method.",
            "Sentiment": "neutral",
            "PublishDate": 1766575177682,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spandana Sphoorty Approves ₹415 Cr NCD Issuance",
            "Summary": "Spandana Sphoorty Financial's management committee has approved the issuance of ₹415 crore secured non-convertible debentures through private placement to strengthen its capital base.",
            "Sentiment": "positive",
            "PublishDate": 1766494271400,
            "Source": "stocks"
        },
        {
            "Title": "Spandana Sphoorty Allots ₹415 Cr Non-Convertible Debentures",
            "Summary": "Spandana Sphoorty Financial allotted 41,500 non-convertible debentures worth ₹415 crores on private placement basis, approved by Management Committee on December 23, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1766411031305,
            "Source": "stocks"
        },
        {
            "Title": "Spandana Sphoorty Allots ₹85 Cr NCDs, Plans ₹425 Cr",
            "Summary": "Spandana Sphoorty Financial allots 8,500 NCDs worth ₹85 crore and approves additional issuance of up to ₹425 crore across three tranches through private placement on BSE.",
            "Sentiment": "positive",
            "PublishDate": 1765954248756,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spandana Sphoorty Approves ₹150 Cr NCD Issue",
            "Summary": "Spandana Sphoorty Financial approves issuance of up to 15,000 NCDs worth ₹150 crore with greenshoe option, scheduled for December 17, 2025 allotment with 24-month tenure.",
            "Sentiment": "positive",
            "PublishDate": 1765432628822,
            "Source": "stocks"
        },
        {
            "Title": "Spandana Sphoorty Appoints Venkatesh Krishnan as Managing Director & CEO for 3-Year Term",
            "Summary": "Spandana Sphoorty Financial Limited appointed Venkatesh Krishnan, a Chartered Accountant with 34 years of financial services experience, as Managing Director & CEO for three years from November 27, 2025 to November 26, 2028. Ashish Kumar Damani will cease his role as Interim CEO and continue as President & CFO, with Krishnan's appointment subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1764059627319,
            "Source": "corporate_governance"
        },
        {
            "Title": "Spandana Sphoorty Reports Full Utilization of Rs. 195.02 Crore from Rights Issue Proceeds",
            "Summary": "Spandana Sphoorty Financial Limited has fully utilized Rs. 195.02 crore from its Rs. 400 crore rights issue for business funding requirements, with CARE Ratings confirming no deviation from stated objectives for the quarter ended September 30, 2025. The microfinance company shows signs of recovery with improved collection efficiency and increased disbursement volumes, though it remains in breach of some financial covenants affecting Rs. 432 crore of outstanding borrowings.",
            "Sentiment": "neutral",
            "PublishDate": 1763096664336,
            "Source": "corporate_action"
        },
        {
            "Title": "K Venkatesh to Join Spandana Sphoorty as CEO",
            "Summary": "K Venkatesh, who heads the microfinance institution (MFI) division at HDFC Bank, is set to join Spandana Sphoorty as Chief Executive Officer. This leadership change brings banking sector experience to the microfinance company.",
            "Sentiment": "neutral",
            "PublishDate": 1762846808375,
            "Source": "corporate_governance"
        },
        {
            "Title": "Spandana Sphoorty Reports Q2 Loss of Rs 249 Crores Despite Improved Collection Efficiency",
            "Summary": "Spandana Sphoorty Financial Limited reported a net loss of Rs 249 crores for Q2 FY26, compared to previous performance metrics. The company showed operational improvements with X-bucket collection efficiency rising to 98.7% in September from 97.9% in June, though it declined slightly to 98.5% in October due to fewer working days and festive season impacts. Disbursements increased significantly to Rs 934 crores in Q2 from Rs 280 crores in Q1. The company's Assets Under Management (AUM) stood at Rs 4,088 crores at quarter-end. Gross NPA was reported at 5.62% at enterprise level and 4.97% on standalone basis. Net NPA stood at 1.17% for enterprise and 0.97% standalone. The company maintained strong liquidity with Rs 1,179 crores representing 21% of total assets. Net Interest Income for the quarter was Rs 91 crores. The company completed a rights issue raising Rs 200 crores and additional debt funding of Rs 598 crores over two months. Pre-Provision Operating Profit was negative at Rs 40 crores. The company closed or merged 101 branches during H1 FY26 as part of operational rationalization. Management expects to achieve positive PPOP in coming quarters and projects 20% AUM growth with 2.5-3% credit costs for FY27.",
            "Sentiment": "neutral",
            "PublishDate": 1762347560602,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Plans Growth Revival With ₹4,088 Cr AUM and Fresh Capital",
            "Summary": "Spandana Sphoorty is positioning for a growth rebound with assets under management of ₹4,088 crores and fresh equity infusion. The company aims to accelerate monthly disbursements to approximately ₹350 crores and improve yields by revising interest rates to 23-26%. The company plans to strengthen recovery efficiency to maintain collection rates above 99%. The growth strategy is supported by a capital adequacy ratio of 47% and a robust liquidity buffer for steady portfolio expansion.",
            "Sentiment": "positive",
            "PublishDate": 1761917829515,
            "Source": "stock"
        },
        {
            "Title": "Spandana Sphoorty Reports ₹249 Cr Net Loss Despite 233% Jump in Disbursements",
            "Summary": "Spandana Sphoorty Financial Limited reported quarterly results showing mixed performance. The company's Assets Under Management declined 18% to ₹4,088 crore from ₹4,958 crore. However, disbursements surged 233% to ₹934 crore compared to ₹280 crore in the previous quarter. The company reported a net loss of ₹249 crore, driven by elevated credit costs and higher gross slippage. Total income fell 21% to ₹239 crore, while Net Interest Income dropped 20% to ₹91 crore. Asset quality showed GNPA at 4.97% and NNPA at 0.97% on standalone basis. Collection efficiency improved with gross collection efficiency at 92.9% and net collection efficiency at 92.4%. The company maintains liquidity of ₹1,179 crore and CRAR of 47.0%. Management noted that 28% of the portfolio built under new credit norms is performing well with only 0.1% delinquency, and the company achieved ₹48 crore in recoveries during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1761915710014,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Reports Loss of ₹547 Crores in H1 FY26 Amid Portfolio Stress",
            "Summary": "Spandana Sphoorty Financial Limited reported a net loss of ₹547 crores for the half year ended September 30, 2025, compared to a loss of ₹253 crores in the previous year. The company's loan book reduced from ₹5,554 crores as of March 31, 2025, to ₹3,201 crores as of September 30, 2025. The company recognized technical write-offs of ₹948 crores during the half year due to stress in loan portfolio from prior years. Despite challenges, the company maintains a strong capital position with Tier I capital of ₹1,100 crores and a Capital to Risk-Weighted Assets Ratio of 36.48%. Interest income declined to ₹441 crores from ₹1,209 crores in the previous year. The company was non-compliant with certain loan covenants and has obtained waivers from some lenders. Management confirmed the going concern assumption remains appropriate for financial statement preparation.",
            "Sentiment": "negative",
            "PublishDate": 1761911899229,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Financial Reports Wider Q2 Loss and Sharp Revenue Decline",
            "Summary": "Spandana Sphoorty Financial reported a consolidated net loss of 2.49 billion rupees in Q2, compared to a loss of 2.16 billion rupees in the same period last year. The company's quarterly revenue dropped significantly to 2.3 billion rupees from 6.82 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761909236468,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Raises Rs 250 Crore Through Bond Sale, Falls Short of Target",
            "Summary": "Spandana Sphoorty Financial raised Rs 250 crore by selling bonds to institutional investors, which was 17% below its base issue size of Rs 300 crore. The board had approved raising up to Rs 400 crore, including a Rs 100 crore greenshoe option. The non-convertible debentures carry an 11% coupon rate payable monthly with a maturity period of 30 months and 6 days. India Ratings assigned the bonds a BBB+ rating with negative outlook, citing continued stress on asset quality and pressure on consolidated profitability due to elevated credit costs and operating expenses. The BBB+ rating indicates the company has capacity to meet financial commitments but is more susceptible to adverse situations.",
            "Sentiment": "negative",
            "PublishDate": 1761377491391,
            "Source": "stock"
        },
        {
            "Title": "Spandana Sphoorty Financial Approves ₹400 Crore NCD Issuance on Private Placement Basis",
            "Summary": "Spandana Sphoorty Financial Limited's Management Committee approved the issuance of up to 40,000 Non-Convertible Debentures with a face value of ₹1,00,000 each, totaling ₹400 crore. The issue includes a green shoe option of 10,000 additional NCDs worth ₹100 crore. The secured, senior, redeemable, transferable, listed, and rated NCDs will be issued on a private placement basis and listed on BSE. The debentures carry an interest rate of 11.00% per annum payable monthly, with a tenure of 30 months and 6 days, maturing on April 30, 2028. The NCDs are redeemable at a premium of 1.25% per annum accrued monthly, payable on maturity when the put option is not exercised. The Management Committee meeting was held on October 13, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760344213021,
            "Source": "corporate_action"
        },
        {
            "Title": "Spandana Sphoorty Financial Appoints G. Parthasarathy as New Chief Risk Officer",
            "Summary": "Spandana Sphoorty Financial Limited announced leadership changes in its risk management function. Amit Anand resigned from his position as Chief Risk Officer effective October 15, 2025, citing personal reasons. The company appointed G. Parthasarathy as the new Chief Risk Officer starting October 16, 2025, for a three-year term until October 15, 2028. The appointment was recommended by the Nomination and Remuneration Committee and Risk Management Committee. Parthasarathy brings over 26 years of experience in financial services, having previously served as Chief Risk Officer at Belstar Microfinance Limited where he managed risk, legal, internal audit, and compliance functions. He has also held senior positions at Madura Microfinance, HDFC Bank, and GE Money. Parthasarathy holds degrees in Law, MBA in Marketing, and Mathematics, and is pursuing FRM certification. He is not related to any director on the company's board.",
            "Sentiment": "neutral",
            "PublishDate": 1760182036752,
            "Source": "corporate_governance"
        },
        {
            "Title": "Spandana Sphoorty Financial to Discuss Non-Convertible Debentures Issuance",
            "Summary": "Spandana Sphoorty Financial will discuss the issuance of non-convertible debentures on October 13. The company has scheduled this discussion as part of its financing activities.",
            "Sentiment": "neutral",
            "PublishDate": 1759929103897,
            "Source": "corporate_action"
        },
        {
            "Title": "Spandana Sphoorty Faces Prolonged Recovery After CEO Exit and Fourth Consecutive Quarterly Loss",
            "Summary": "Microfinancier Spandana Sphoorty Financial is experiencing significant operational challenges following the exit of CEO Shalabh Saxena amid allegations of financial mismanagement. The company reported its fourth consecutive quarterly net loss of Rs 360 crore in the June quarter, with an annualized return on assets of negative 20.4%. Assets under management contracted sharply to Rs 4,958 crore from Rs 11,973 crore in March 2024. The cost-to-income ratio deteriorated to 142.5% from 62.1% in the previous fiscal year. Gross NPAs increased to 5.49% from 2.60% year-on-year. The company wrote off Rs 642 crore in bad loans during the first quarter and Rs 1,618 crore in FY25, with a total net loss of Rs 1,035 crore for FY25. Rating agencies CareEdge, India Ratings, and ICRA have downgraded the company's debt instruments. Despite raising Rs 200 crore through a rights issue, rating agencies expect losses to continue for at least two more quarters, with recovery hampered by high employee turnover and leadership instability.",
            "Sentiment": "negative",
            "PublishDate": 1756686955360,
            "Source": "stock"
        },
        {
            "Title": "Spandana Sphoorty Financial Reports Widened Net Loss and Revenue Decline in Q1",
            "Summary": "Spandana Sphoorty Financial reported a consolidated net loss of 3.6 billion rupees in Q1, significantly higher than the 557 million rupees loss in the same period last year. The company's revenue declined to 3 billion rupees from 7.1 billion rupees year-over-year, representing a substantial decrease in business performance.",
            "Sentiment": "negative",
            "PublishDate": 1755469639535,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Financial Reports Widened Net Loss and Revenue Decline in Q1",
            "Summary": "Spandana Sphoorty Financial reported a consolidated net loss of 3.6 billion rupees in Q1, significantly higher than the 557 million rupees loss in the same period last year. The company's revenue dropped to 3 billion rupees from 7.1 billion rupees year-over-year, representing a substantial decline in the quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755178120621,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Financial Raises Rs 400 Crore Through Oversubscribed Rights Issue",
            "Summary": "Spandana Sphoorty Financial's capital-raising committee approved the allotment of 17.3 million partly paid-up equity shares at Rs 230 per share to existing investors through a rights issue. The company raised Rs 400 crore, with the rights issue being oversubscribed though slightly below the target of 17.4 million shares. The paid-up equity share capital increased to Rs 80 crore from Rs 71.3 crore. The company now holds 71.3 million fully paid-up equity shares and 17.3 million partly paid-up equity shares. The rights issue ran from August 1 to August 11 as a partly paid structure, meaning the company received half of the Rs 400 crore fundraise initially and will collect the remaining amount from shareholders within 24 months.",
            "Sentiment": "positive",
            "PublishDate": 1755044314274,
            "Source": "corporate_action"
        },
        {
            "Title": "Spandana's Top 10 Investors Confirm Participation in ₹400-Crore Rights Issue",
            "Summary": "Spandana Sphoorty Financial's top 10 institutional investors have confirmed participation in the company's ₹400-crore rights issue opening August 1. Kedaara Capital, the promoter holding 48.13%, leads the participating investors and may remain invested beyond its scheduled September 2026 exit. The rights issue is structured with 50% payment immediate and balance over 24 months, priced at ₹230 per share against face value of ₹10. The company reported a net loss of ₹1,035 crore in FY25, with assets under management declining 43% year-on-year to ₹6,819 crore due to slower disbursals and ₹1,500 crore bad loan write-offs. Gross non-performing assets ratio stood at 4.85% at March-end, while capital to risk adjusted ratio remained at 37%. Shares closed at ₹271.85 on BSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753922408312,
            "Source": "corporate_action"
        },
        {
            "Title": "Spandana Sphoorty Launches Rs 400 Crore Rights Issue at 25% Discount",
            "Summary": "Spandana Sphoorty Financial has priced its rights issue at Rs 230 per share, representing a 25% discount to the market price of Rs 305.95. The Rs 400 crore rights issue opens on August 1 and closes on August 11, with the board having the option to extend the closing date by up to 30 days. Shareholders will receive 10 rights equity shares for every 41 shares held. If fully subscribed, the company's equity base will expand from 71 million to 89 million shares. This fundraising is part of the microfinance company's plan to raise up to Rs 750 crore in equity in FY26. The company reported a Rs 1,035 crore net loss in FY25 and its gross bad loan ratio increased to 5.63%. Principal promoter Kedaara Capital, which holds 48% stake in the company, is expected to participate in the rights issue.",
            "Sentiment": "negative",
            "PublishDate": 1752851007147,
            "Source": "corporate_action"
        },
        {
            "Title": "Spandana Sphoorty Financial Announces Rights Issue Details",
            "Summary": "Spandana Sphoorty Financial has set the price for its rights issue at 230 rupees per share. The total size of the issue is 17.4 million shares. The entitlement ratio is 10 shares for every 41 shares held by existing shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1752843038000,
            "Source": "default"
        },
        {
            "Title": "Spandana Sphoorty Financial Ltd: Board Approves ₹400 Crore Rights Issue",
            "Summary": "Spandana Sphoorty Financial Ltd's board has approved a ₹400 crore rights issue. The record date is yet to be announced. ICRA recently downgraded the company and maintained a negative outlook, citing covenant breaches on ₹1,058 crore of NCDs, with some waivers still pending.",
            "Sentiment": "neutral",
            "PublishDate": 1752577049000,
            "Source": "corporate_action"
        },
        {
            "Title": "Spandana Sphoorty Financial Approves ₹4 Billion Rights Issue",
            "Summary": "Spandana Sphoorty Financial has approved a rights issue worth ₹4 billion (400 crores). A rights issue is a type of corporate action where existing shareholders are given the opportunity to purchase new shares at a discounted price.",
            "Sentiment": "positive",
            "PublishDate": 1752576334000,
            "Source": "default"
        },
        {
            "Title": "Spandana Sphoorty Financial: Rs 750-Crore Capital Raise Plan with Kedaara Capital",
            "Summary": "Spandana Sphoorty Financial is planning a Rs 750-crore capital raise, potentially through a rights issue with equity infusion from principal shareholder Kedaara Capital. The company has formed a capital raising committee to explore this option. Spandana reported a Rs 1035 crore net loss in FY25 with a 5.63% gross bad loan ratio.",
            "Sentiment": "neutral",
            "PublishDate": 1750265433000,
            "Source": "corporate_action"
        },
        {
            "Title": "Spandana Sphoorty Financial: Shares Plummet After ICRA Downgrade",
            "Summary": "Spandana Sphoorty Financial's shares dropped 2% to ₹276.65 after ICRA downgraded the company, citing weak asset quality and profitability. Gross stage 3 loans rose to 5.6% of total assets. The company reported a net loss of 8.6% of average managed assets for FY25 and breached financial covenants on ₹1,058 crore of NCDs. The sudden exit of the MD and CEO in April adds to investor concerns.",
            "Sentiment": "negative",
            "PublishDate": 1749717698000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Spandana Sphoorty Financial Reports Q4 Net Loss of 4.1 Billion Rupees",
            "Summary": "Spandana Sphoorty Financial has reported its Q4 financial results. The company experienced a net loss of 4.1 billion rupees, compared to a loss of 1.22 billion rupees in the same quarter last year. This represents an increase in losses. Sequentially, the loss increased from 3.9 billion rupees in the previous quarter. The company's revenue for Q4 was 3.7 billion rupees, down from 6.3 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748823149000,
            "Source": "default"
        },
        {
            "Title": "Spandana Sphoorty Financial Ltd: Q4 Loss of ₹434 Crore, Revenue Drops 38%",
            "Summary": "Spandana Sphoorty Financial Ltd reported a Q4 FY25 net loss of ₹434.3 crore, compared to a profit of ₹128.6 crore in Q4 FY24. Revenue fell 38% to ₹414.8 crore. AUM declined 43% YoY to ₹6,819 crore. GNPA rose to 5.63% from 4.85% in Q3. FY25 ended with a net loss of ₹1,035 crore due to elevated credit costs.",
            "Sentiment": "negative",
            "PublishDate": 1748620725000,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Financial: Net Loss and Auditor Concerns Over Potential Fraud",
            "Summary": "Spandana Sphoorty Financial reported a Q4 FY25 consolidated net loss of Rs 434 crore. The independent auditor flagged concerns about possible misstatements due to fraud. Gross NPAs rose to 5.63%. The company faced challenges in the microfinance industry, with AUM shrinking 43% YoY to Rs 6819 crore. The CEO resigned on April 23, and RBI is reportedly examining unreported frauds and cash balance mismatches.",
            "Sentiment": "negative",
            "PublishDate": 1748620074000,
            "Source": "result"
        },
        {
            "Title": "Spandana Sphoorty Financial Reports Increased Q4 Net Loss",
            "Summary": "Spandana Sphoorty Financial has reported a net loss of 4.1 billion rupees for the fourth quarter, compared to a loss of 1.22 billion rupees in the same quarter of the previous year. This represents a significant increase in losses year-over-year. The company's quarterly loss also increased from 3.9 billion rupees in the previous quarter. Revenue for Q4 decreased to 3.7 billion rupees from 6.3 billion rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1748614485000,
            "Source": "result"
        },
        {
            "Title": "Spandana Sphoorty Financial: Proposed Changes to Articles of Association for Easier Fundraising",
            "Summary": "Spandana Sphoorty Financial plans to amend its Articles of Association to align with the Companies Act, 2013 and SEBI regulations. The changes aim to facilitate fundraising, allowing the company to issue shares for cash or services. Shareholder approval is sought through e-voting from May 13 to June 11.",
            "Sentiment": "positive",
            "PublishDate": 1747100120000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Spandana Sphoorty Financial Denies Media Report, Affirms Strong Internal Audit",
            "Summary": "Spandana Sphoorty Financial has issued a clarification regarding a media report, denying any unreported information. The company asserts that it maintains robust internal audit mechanisms and that any adverse findings related to asset quality are disclosed through normal financial reporting channels.",
            "Sentiment": "neutral",
            "PublishDate": 1745799364000,
            "Source": "default"
        },
        {
            "Title": "Spandana Sphoorty Financial Denies Media Report, Affirms Strong Audit Mechanisms",
            "Summary": "Spandana Sphoorty Financial has issued a clarification regarding a media report, denying any unreported information. The company asserts that it maintains robust internal audit mechanisms and that any adverse findings related to asset quality are disclosed through normal financial reporting channels.",
            "Sentiment": "neutral",
            "PublishDate": 1745599449000,
            "Source": "default"
        },
        {
            "Title": "Spandana Sphoorty Financial: RBI Scrutiny Leads to Abrupt Management Change",
            "Summary": "RBI reportedly found operational lapses in Spandana Sphoorty Financial during a recent inspection, including unreported frauds and cash balance mismatches. This scrutiny may be linked to the sudden resignation of MD Shalabh Saxena. The company has appointed CFO Ashish Kumar Damani as interim CEO.",
            "Sentiment": "negative",
            "PublishDate": 1745520522000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Spandana Sphoorty Financial Limited: CEO Resigns, Interim CEO Appointed",
            "Summary": "Shalabh Saxena, MD & CEO of Spandana Sphoorty Financial Limited, has resigned effective April 23, 2025. Ashish Kumar Damani, current President and CFO, has been appointed as interim CEO. Saxena will assist during the notice period for a smooth transition.",
            "Sentiment": "neutral",
            "PublishDate": 1745409627000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Spandana Sphoorty Financial: Ratings Downgraded After Q3 Results",
            "Summary": "CareEdge and ICRA downgraded Spandana Sphoorty Financial's debt instruments following poor Q3 performance. The company faced early redemption pressure, breached financial covenants, and reported significant asset quality deterioration with net losses of Rs 601 crore in the first nine months of FY25. Gross NPAs rose to 5.2% in December 2024 from 1.7% in March 2024.",
            "Sentiment": "negative",
            "PublishDate": 1738675638000,
            "Source": "result"
        },
        {
            "Title": "Spandana Sphoorty Financial Reports Q3 Net Loss and Plans Fundraising",
            "Summary": "Spandana Sphoorty Financial reported a Q3 net loss of 3.9 billion rupees, compared to a profit of 1.18 billion rupees in the same quarter last year. Revenue decreased to 5.12 billion rupees from 5.91 billion rupees year-over-year. The company's Gross Non-Performing Assets (GNPA) slightly improved to 4.85% from 4.86% quarter-on-quarter, while Net Non-Performing Assets (NNPA) decreased to 0.96% from 0.99%. The company plans to raise up to 7.50 billion rupees through Qualified Institutional Placement (QIP) and other modes.",
            "Sentiment": "negative",
            "PublishDate": 1737678318000,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Financial: Q3 Loss Widens, Breaches Covenants",
            "Summary": "Spandana Sphoorty Financial reported a Q3 FY25 net loss of Rs 440 crore, up from Rs 216 crore in Q2. The company breached financial covenants in borrowing agreements and missed the 75% qualifying assets regulatory norm. Bad loan write-offs of Rs 626 crore and provisions of Rs 666 crore contributed to the loss. The microfinance industry faces challenges including climatic disruptions and weakened borrower discipline. The company's AUM contracted 14% YoY to Rs 8,936 crore, with quarterly disbursements down 43%.",
            "Sentiment": "negative",
            "PublishDate": 1737642382000,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Financial to Raise Up to 7.50 Billion Rupees",
            "Summary": "Spandana Sphoorty Financial has announced plans to raise up to 7.50 billion rupees through a Qualified Institutional Placement (QIP) and other modes of fundraising. This move indicates the company's intention to strengthen its financial position, potentially for expansion or operational purposes.",
            "Sentiment": "positive",
            "PublishDate": 1737629559000,
            "Source": "corporate_action"
        },
        {
            "Title": "Spandana Sphoorty Financial Reports Q3 Net Loss",
            "Summary": "Spandana Sphoorty Financial reported a net loss of 3.9 billion rupees in Q3, compared to a profit of 1.18 billion rupees in the same period last year. Revenue decreased to 5.12 billion rupees from 5.91 billion rupees year-over-year. The company's Gross Non-Performing Assets (GNPA) slightly improved to 4.85% from 4.86% quarter-on-quarter, while Net Non-Performing Assets (NNPA) decreased to 0.96% from 0.99% in the same period.",
            "Sentiment": "negative",
            "PublishDate": 1737629077000,
            "Source": "earnings"
        },
        {
            "Title": "Spandana Sphoorty Financial to Consider Q3 Results",
            "Summary": "Spandana Sphoorty Financial has announced that it will consider its third quarter financial results on January 23. This indicates the company is preparing to disclose its performance for the most recent fiscal quarter to shareholders and the public.",
            "Sentiment": "neutral",
            "PublishDate": 1737384951000,
            "Source": "earnings"
        }
    ]
}