{
    "Symbol": "SPARC",
    "ISIN": "INE232I01014",
    "News": [
        {
            "Title": "SPARC Reports Q3 FY26 Loss of ₹80.57 Crores",
            "Summary": "Sun Pharma Advanced Research Company posted a net loss of ₹80.57 crores in Q3 FY26 with revenue declining to ₹8.45 crores. Company recognized exceptional costs of ₹12.36 crores related to new labour codes.",
            "Sentiment": "negative",
            "PublishDate": 1770625112758,
            "Source": "co_actions_results"
        },
        {
            "Title": "SPARC Receives FDA Priority Review Voucher for Sezaby®",
            "Summary": "Sun Pharma Advanced Research Company announces receipt of Priority Review Voucher from FDA associated with Sezaby® approval, providing strategic flexibility to accelerate pipeline development.",
            "Sentiment": "positive",
            "PublishDate": 1770087884241,
            "Source": "stocks"
        },
        {
            "Title": "SPARC Issues Corrigendum to EGM Notice for Feb 9 Meet",
            "Summary": "Sun Pharma Advanced Research Company issues corrigendum to EGM notice dated January 14, 2026, addressing NSE observations and providing additional clarity on shareholding pattern.",
            "Sentiment": "neutral",
            "PublishDate": 1769696346855,
            "Source": "stocks"
        },
        {
            "Title": "SPARC Schedules EGM for ₹600 Cr Warrant Issue",
            "Summary": "Sun Pharma Advanced Research Company announces EGM on Feb 9, 2026 to consider issuing 3.85 crore convertible warrants worth ₹599.99 crores to promoter group entity Shanghvi Finance.",
            "Sentiment": "positive",
            "PublishDate": 1768575769813,
            "Source": "co_actions_results"
        },
        {
            "Title": "SPARC Plans ₹6,000 Cr Convertible Warrants Issue",
            "Summary": "Sun Pharma Advanced Research Company announces plans to offer convertible warrants worth up to ₹6,000 crores at ₹155.80 per warrant, marking a significant capital raising initiative.",
            "Sentiment": "positive",
            "PublishDate": 1768400984033,
            "Source": "co_actions_results"
        },
        {
            "Title": "SPARC Advances Two Key Clinical Programs Ahead of Schedule",
            "Summary": "Sun Pharma Advanced Research Company reports operational milestones achieved for SCD-153 alopecia areata treatment and SBO-154 cancer ADC, with early efficacy data expected by Q4 2026. Company optimizes costs while expanding clinical pipeline.",
            "Sentiment": "positive",
            "PublishDate": 1768301515135,
            "Source": "co_actions_results"
        },
        {
            "Title": "SPARC targets $10M savings via R&D consolidation",
            "Summary": "Sun Pharma Advanced Research Company consolidates operations in Vadodara, cuts workforce by 40%, and focuses on oncology and immunology assets to achieve $10 million annual cost savings.",
            "Sentiment": "neutral",
            "PublishDate": 1767962043433,
            "Source": "stocks"
        },
        {
            "Title": "SPARC Wins U.S. Court Ruling on Priority Review Voucher for Sezaby Drug",
            "Summary": "The U.S. District Court for the District of Columbia granted summary judgment in favor of Sun Pharma Advanced Research Company (SPARC) regarding the issuance of a Priority Review Voucher associated with their drug Sezaby approval. The Court ruled that FDA's withholding of the PRV was contrary to law because no drug product containing phenobarbital sodium was previously approved as that term is used in the statute, giving FDA 60 days to appeal.",
            "Sentiment": "positive",
            "PublishDate": 1764659110886,
            "Source": "stock"
        },
        {
            "Title": "SPARC Announces Complete Response Letter Resubmission for PDP-716 NDA by Ocuvex",
            "Summary": "Sun Pharma Advanced Research Company Ltd. announced that Ocuvex Therapeutics Inc. has resubmitted a Complete Response Letter to the US FDA for PDP-716 New Drug Application, addressing facility inspection-related conditions at a third-party API manufacturing facility from July 2023. The FDA had not raised any concerns related to the efficacy or safety of PDP-716, a novel once-daily ophthalmic suspension of brimonidine tartrate 0.35% developed using SPARC's proprietary TearAct technology.",
            "Sentiment": "neutral",
            "PublishDate": 1763631130249,
            "Source": "global"
        },
        {
            "Title": "SPARC Consolidates R&D Operations from Multiple Sites to Two Baroda Locations",
            "Summary": "Sun Pharma Advanced Research Company announced consolidation of its R&D laboratories from multiple sites in Mumbai and Baroda to two sites in Baroda, integrating operations from Mahakali and Makarpura sites into Savli and Tandalja locations. The strategic initiative aims to streamline R&D operations, enhance operational efficiencies, reduce cycle times, and accelerate proof-of-concept development, with some activities to be outsourced and excess capacity streamlined by end of FY26.",
            "Sentiment": "neutral",
            "PublishDate": 1763055554968,
            "Source": "stock"
        },
        {
            "Title": "Sun Pharma Advanced Research Reports Widening Losses in Q2 FY26",
            "Summary": "Sun Pharma Advanced Research Company Limited reported a net loss of ₹76 crores for the second quarter ended September 30, 2025, compared to ₹62 crores in the previous quarter. The half-year loss increased to ₹128 crores from ₹204 crores in the same period last year. Revenue from operations declined to ₹7.9 crores in Q2 from ₹9.6 crores in Q1. Total expenses for the quarter were ₹84 crores, with employee benefits expense at ₹26 crores and clinical trial expenses at ₹8 crores. The company's loss per share stood at ₹2.34 for the quarter. The company continues to incur cash losses and maintains going concern status based on support from its promoter group entity. The company operates solely in pharmaceutical research and development segment.",
            "Sentiment": "negative",
            "PublishDate": 1762822237547,
            "Source": "earnings"
        },
        {
            "Title": "SPARC Reports Reduced Net Loss Despite Revenue Decline in Q2",
            "Summary": "SPARC reported a net loss of 760 million rupees in Q2, an improvement from the previous year's loss of 1.07 billion rupees. However, the company's revenue declined to 79 million rupees compared to 128 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1762788085487,
            "Source": "earnings"
        },
        {
            "Title": "SPARC Reports Narrower Net Loss Despite Revenue Decline in Q1",
            "Summary": "SPARC reported a net loss of 519 million rupees in Q1, an improvement from the previous year's loss of 959 million rupees. However, the company's revenue declined to 96 million rupees compared to 168 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1754296212119,
            "Source": "earnings"
        },
        {
            "Title": "Sun Pharma Advanced Research Co.: Pipeline Remains Strong Despite Psoriasis Drug Setback",
            "Summary": "SPARC confirms no financial impact or need for fresh capital expenditure following discontinuation of SCD-044 trials for psoriasis. Company states other pipeline assets will offset this setback.",
            "Sentiment": "neutral",
            "PublishDate": 1749105781000,
            "Source": "normal_news"
        },
        {
            "Title": "SPARC's Psoriasis Drug Fails Phase 2 Trials, Shares Drop 19%",
            "Summary": "SPARC (Sun Pharma Advanced Research Company) experienced a significant 19% decrease in its share price following the announcement that its psoriasis drug failed to meet its objectives in Phase 2 clinical trials.",
            "Sentiment": "negative",
            "PublishDate": 1749023963000,
            "Source": "default"
        },
        {
            "Title": "Sun Pharma Advanced Research Company: Psoriasis Drug Fails Phase 2 Trials, Shares Plummet",
            "Summary": "SPARC's investigational drug SCD-044 (Vibozilimod) failed to meet primary endpoints in Phase 2 trials for psoriasis and atopic dermatitis. Development of the drug is being discontinued. SPARC shares dropped 20% to Rs 156.50 on BSE following the news.",
            "Sentiment": "negative",
            "PublishDate": 1749019456000,
            "Source": "result"
        },
        {
            "Title": "Sun Pharma Advanced Research: Psoriasis Drug Discontinued After Failed Trials",
            "Summary": "Sun Pharma Advanced Research announced discontinuation of SCD-044 drug for psoriasis and atopic dermatitis after Phase 2 trials failed to meet primary endpoints. The company's shares fell to a nearly one-month low, dropping as much as 20% to Rs 156.14 apiece. This decision impacts the company's specialty pipeline.",
            "Sentiment": "negative",
            "PublishDate": 1749013980000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun Pharma Advanced Research to Consider Fund Raising Proposal",
            "Summary": "Sun Pharma Advanced Research Company has scheduled a board meeting on May 19 to discuss and potentially approve a proposal for raising funds.",
            "Sentiment": "neutral",
            "PublishDate": 1747049930000,
            "Source": "default"
        },
        {
            "Title": "SPARC Submits IND Application for SBO-154 to FDA",
            "Summary": "Sun Pharma Advanced Research Company (SPARC) has announced the submission of an Investigational New Drug (IND) application for SBO-154 to the U.S. Food and Drug Administration (FDA). SBO-154 is set to enter global Phase 1 clinical trials for the treatment of advanced solid tumors. This marks a significant step in SPARC's drug development pipeline and potential advancement in cancer treatment.",
            "Sentiment": "positive",
            "PublishDate": 1743421550000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun Pharma Advanced Research Company: Stock Hits 52-Week Low as Rekha Jhunjhunwala Reduces Stake",
            "Summary": "SPARC shares fell to a 52-week low of ₹128.35, declining 6.3% in Tuesday's trade. The stock has lost 19% over nine consecutive sessions, eroding ₹970 crore in market cap. Rekha Jhunjhunwala reduced her stake to 1.6% in Q3. Despite narrowing Q3 losses and increased revenue, the company has reported losses for eight consecutive years.",
            "Sentiment": "negative",
            "PublishDate": 1739876212000,
            "Source": "normal_news"
        },
        {
            "Title": "SPARC Reports Q3 Financial Results",
            "Summary": "SPARC (Sun Pharma Advanced Research Company) has reported its Q3 financial results. The company's consolidated net loss has reduced to 795 million rupees, compared to a loss of 996 million rupees in the same quarter last year. Revenue for Q3 has increased to 149 million rupees from 138 million rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739197979000,
            "Source": "earnings"
        },
        {
            "Title": "Sun Pharma Revises Guidance Upward for Royalty Income",
            "Summary": "Sun Pharmaceutical Industries has revised its guidance, indicating an expected increase in royalty income. The company projects a cumulative upside of approximately €45-50 million from royalties over the next five years.",
            "Sentiment": "positive",
            "PublishDate": 1736842980000,
            "Source": "earnings"
        },
        {
            "Title": "Sun Pharma Advanced Research Announces Partnership Update and Equity Stake in Tiller Therapeutics",
            "Summary": "Sun Pharma Advanced Research Company (SPARC) has provided an update on an asset developed during a three-year partnership with the University of California, San Francisco (UCSF). As part of this update, SPARC announced it will receive a 55% equity stake in Tiller Therapeutics.",
            "Sentiment": "positive",
            "PublishDate": 1734405749000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun Pharma Advanced Research Signs Binding LOI for Pre-Clinical Oncology Asset",
            "Summary": "Sun Pharma Advanced Research Company (SPARC) has announced the signing of a binding Letter of Intent (LOI) with the University of California, San Francisco (UCSF) and Tiller Therapeutics. The agreement is for a pre-clinical oncology asset and associated intellectual property, indicating SPARC's strategic move to expand its oncology portfolio and research capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1734405675000,
            "Source": "corporate_action"
        },
        {
            "Title": "Sun Pharma Advanced Research Reports Q2 Revenue Decline",
            "Summary": "Sun Pharma Advanced Research Company (SPARC) has reported a revenue of 128 million rupees for the second quarter, down from 211 million rupees in the same period last year. This represents a significant year-over-year decline in the company's quarterly revenue.",
            "Sentiment": "negative",
            "PublishDate": 1730712607000,
            "Source": "result"
        },
        {
            "Title": "Sun Pharma Advanced Research Reports Increased Q2 Loss",
            "Summary": "Sun Pharma Advanced Research Company (SPARC) has reported a consolidated net loss of 1.07 billion rupees for the second quarter, compared to a loss of 860 million rupees in the same period last year. This represents an increase in the company's losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730712590000,
            "Source": "result"
        }
    ]
}