{
    "Symbol": "SPCL",
    "ISIN": "INE0T7B01010",
    "News": [
        {
            "Title": "Shivalic Power Control Limited Secures 6.8 Million Rupee Order for LT Panels",
            "Summary": "Shivalic Power Control Limited has been awarded a significant order for LT (Low Tension) panels worth 6.8 million rupees. This development is considered prestigious for the company, which currently has a market capitalization of 545 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1736233310000,
            "Source": "order&deals"
        },
        {
            "Title": "Shivalic Power Control Secures 41 Million Rupee Order for LT Panels",
            "Summary": "Shivalic Power Control has been awarded an order worth 41 million rupees for LT (Low Tension) panels. This order represents a significant business opportunity for the company in the power control equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1733702930000,
            "Source": "order&deals"
        },
        {
            "Title": "Shivalic Power Control Secures 41 Million Rupee Order for LT Panels",
            "Summary": "Shivalic Power Control has been awarded an order worth 41 million rupees for Low Tension (LT) panels. This order represents a significant business opportunity for the company in the power control equipment sector.",
            "Sentiment": "positive",
            "PublishDate": 1733489138000,
            "Source": "order&deals"
        },
        {
            "Title": "Shivalic Power Control Reports 72% Revenue Growth in H1 FY25",
            "Summary": "<p>Shivalic Power Control has announced a <span class=\"positive\">significant</span> revenue <span class=\"positive\">increase</span> for the first half of fiscal year 2025. The company recorded revenue of <b>Rs 535 million</b>, representing a year-over-year <span class=\"positive\">growth</span> of <b>72%</b>.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728283306000,
            "Source": "result"
        }
    ]
}