{
    "Symbol": "SPECTRUM",
    "ISIN": "INE01EO01010",
    "News": [
        {
            "Title": "Spectrum Electrical Acquires Alric Electric for ₹1.25 Cr",
            "Summary": "Spectrum Electrical Industries board approves acquisition of 100% stake in Alric Electric Private Limited for up to ₹1.25 crore, targeting forward integration in switchgear manufacturing.",
            "Sentiment": "positive",
            "PublishDate": 1770209742992,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spectrum Electrical publishes Q3FY26 results",
            "Summary": "Spectrum Electrical Industries Limited published its unaudited standalone and consolidated financial results for Q3FY26 in newspapers as per regulatory requirements.",
            "Sentiment": "neutral",
            "PublishDate": 1769240191958,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spectrum Electrical Board Meet Set for Jan 22, 2026",
            "Summary": "Spectrum Electrical Industries has scheduled a board meeting on January 22, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768577800547,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spectrum Electrical Gets Credit Rating Upgrade",
            "Summary": "CRISIL upgrades Spectrum Electrical's long-term rating to BBB+/Stable from BBB/Positive and short-term rating to A2 from A3+. Bank facilities enhanced to ₹250 crores from ₹150 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768403779598,
            "Source": "stocks"
        },
        {
            "Title": "Spectrum Electrical Industries Seeks Shareholder Approval for Director Re-appointment via Postal Ballot",
            "Summary": "Spectrum Electrical Industries Limited has initiated a postal ballot process to seek member approval for re-appointing Mr. Kishor Dalu Dhake as Non-Executive Independent Director for a second term of five years from November 6, 2025 to November 5, 2030. The e-voting period runs from November 24, 2025 to December 23, 2025, with results to be announced by December 25, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763630763725,
            "Source": "corporate_action"
        },
        {
            "Title": "Spectrum Electrical Industries Reports Strong Q2 Growth with 35% Revenue Jump",
            "Summary": "Spectrum Electrical Industries delivered robust Q2 performance with consolidated net profit rising to 77M rupees from 72M rupees year-over-year, while revenue surged 35% to 1.18B rupees from 872M rupees. The company's EBITDA nearly doubled to 152M rupees from 82M rupees, with EBITDA margin expanding significantly to 12.93% from 9.41% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1763208162492,
            "Source": "earnings"
        },
        {
            "Title": "Spectrum Electrical Industries Reports Delay in QIP Fund Utilization Due to Construction Approvals",
            "Summary": "Spectrum Electrical Industries Limited has announced a delay in utilizing funds raised through its Qualified Institutional Placement (QIP) conducted during financial year 2023-24. The company raised Rs. 36.55 crores through the QIP, with Rs. 22.14 crores allocated for working capital requirements and Rs. 14.41 crores for general corporate purposes. As of June 30, 2025, Rs. 27.59 crores has been utilized, leaving Rs. 8.95 crores pending utilization. The delay stems from an extended approval process with the Town Planning Department for construction of a factory building with 2,64,548 square feet built-up area. Confusion at the departmental level regarding permissions for projects exceeding 2 lakh square feet led to multiple clarifications and reviews, causing an 8-10 month delay in obtaining final building plan approval. The company has now received all requisite approvals and construction work is underway. Unutilized funds are temporarily invested in fixed deposits with scheduled commercial banks.",
            "Sentiment": "neutral",
            "PublishDate": 1761931041444,
            "Source": "stock"
        },
        {
            "Title": "Spectrum Electrical Industries Appoints New Secretarial Auditor and Sets AGM Date",
            "Summary": "Spectrum Electrical Industries Limited's Board of Directors approved the appointment of Ms. Yuti Nagarkar as Secretarial Auditor for a five-year term from FY 2025-26 to 2029-30, subject to shareholder approval. The Board also approved the Directors' Report for the year ended March 31, 2025, and scheduled the 17th Annual General Meeting for September 30, 2025, at 11:30 a.m. at the company's registered office in Jalgaon, Maharashtra. Ms. Nagarkar, a Practicing Company Secretary with membership number FCS 9317, will also serve as Scrutinizer for the e-voting process. She has extensive experience in secretarial audits of listed companies and consultancy services in Company Law and FEMA, and is not related to any company director.",
            "Sentiment": "neutral",
            "PublishDate": 1757244957065,
            "Source": "corporate_action"
        },
        {
            "Title": "Spectrum Electrical Industries Publishes Q1 FY2026 Financial Results",
            "Summary": "Spectrum Electrical Industries Limited published its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The Board of Directors approved the results on August 14, 2025, following review by the Audit Committee. The results were published in Times of India and Divya Marathi newspapers and are available on the company's website. The company is listed on NSE under symbol SPECTRUM and BSE with script code 544386. The filing contains regulatory compliance information but does not include specific financial figures or management commentary.",
            "Sentiment": "neutral",
            "PublishDate": 1755408762607,
            "Source": "earnings"
        },
        {
            "Title": "Spectrum Electrical Industries Reports 15.7% Revenue Growth in Q1 FY2026",
            "Summary": "Spectrum Electrical Industries Limited reported quarterly results with revenue from operations of Rs 8,454.81 lakhs, representing a 15.7% increase compared to Rs 7,304.34 lakhs in the same quarter last year. Net profit after tax rose significantly to Rs 608.51 lakhs from Rs 222.91 lakhs in the previous year quarter. On a consolidated basis, revenue reached Rs 8,542.74 lakhs with net profit of Rs 562.83 lakhs. The company's earnings per share improved to Rs 3.90 (basic) from Rs 1.43 in the corresponding quarter. Spectrum Electrical operates in design and manufacturing of electrical, automobile, and irrigation components. The company has Rs 895.31 lakhs of unutilized funds from its February 2024 Qualified Institutional Placement, primarily allocated for capital expenditure.",
            "Sentiment": "positive",
            "PublishDate": 1755177613747,
            "Source": "earnings"
        },
        {
            "Title": "Spectrum Electrical Industries Reports Q4 Profit and Revenue Growth",
            "Summary": "Spectrum Electrical Industries has announced its Q4 financial results. The company's net profit increased to 134 million rupees, up from 59 million rupees in the same quarter of the previous year. Revenue for Q4 rose to 1.72 billion rupees, compared to 1.26 billion rupees in the year-ago period.",
            "Sentiment": "positive",
            "PublishDate": 1748677470000,
            "Source": "result"
        }
    ]
}