{
    "Symbol": "SPECIALITY",
    "ISIN": "INE247M01014",
    "News": [
        {
            "Title": "Speciality Hotels India Issues ₹20L Equity Shares",
            "Summary": "Speciality Hotels India, subsidiary of Speciality Restaurants, issued ₹20 lakh equity shares through preferential sale, reducing parent company stake to 98.28%.",
            "Sentiment": "neutral",
            "PublishDate": 1768574635063,
            "Source": "co_actions_results"
        },
        {
            "Title": "Speciality Restaurants subsidiary status changes",
            "Summary": "Speciality Hotels India Private Limited ceases to be wholly owned subsidiary of Speciality Restaurants after preferential allotment to Esensos Services reduces parent company's stake to 98.28%.",
            "Sentiment": "neutral",
            "PublishDate": 1768560068230,
            "Source": "co_actions_results"
        },
        {
            "Title": "Speciality Restaurants Grants Franchise Rights for Asia Kitchen Brand in Dubai",
            "Summary": "Speciality Restaurants Limited entered into a franchise agreement with Asia Kitchen By Mainland China LLC, granting rights to open one franchise restaurant under the Asia Kitchen by Mainland China brand in United Arab Emirates effective November 28, 2025. The franchise restaurant will be located at Deira City Centre in Dubai, expanding the company's international presence through its franchise model.",
            "Sentiment": "positive",
            "PublishDate": 1764422776276,
            "Source": "stock"
        },
        {
            "Title": "Speciality Restaurants Signs Rs 20 Crore Investment Deal for Bhubaneshwar Food Complex Development",
            "Summary": "Speciality Restaurants Limited and its wholly owned subsidiary Speciality Hotels India Private Limited entered into strategic collaboration agreements with Esensos Services and Solutions LLP for developing a food, beverages and retail complex on 0.960 acres of leasehold land in Bhubaneshwar, Orissa. The investor will invest Rs 20 crores in the subsidiary's equity share capital over the construction period, acquiring 2,38,501 equity shares at Rs 838.57 per share with board representation and affirmative voting rights.",
            "Sentiment": "positive",
            "PublishDate": 1764171046738,
            "Source": "order&deals"
        },
        {
            "Title": "Speciality Restaurants Receives Development Agreement from Coal Mines Associated Traders",
            "Summary": "Speciality Restaurants has received a signed development agreement from Coal Mines Associated Traders. The agreement represents a business development for the restaurant company, though specific terms and financial details were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1764029046658,
            "Source": "stock"
        },
        {
            "Title": "Speciality Restaurants Establishes Fully-Owned Subsidiary in Dubai for AED 100,000",
            "Summary": "Speciality Restaurants has formed a new fully-owned subsidiary, Speciality Restaurants L.L.C-FZ, in Dubai, UAE for investment purposes. The company acquired full ownership of the subsidiary for AED 100,000, marking its expansion into the UAE market.",
            "Sentiment": "positive",
            "PublishDate": 1763712608777,
            "Source": "corporate_action"
        },
        {
            "Title": "NCLT Kolkata Approves Speciality Restaurants' Scheme, Company to Proceed with ROC Implementation",
            "Summary": "NCLT Kolkata has issued final orders approving Speciality Restaurants' corporate scheme. The company will now submit the approved scheme to the Registrar of Companies for implementation.",
            "Sentiment": "positive",
            "PublishDate": 1763652253842,
            "Source": "corporate_action"
        },
        {
            "Title": "Speciality Restaurants Reports Strong Q2FY26 Performance with 41.39% Same-Store Sales Growth",
            "Summary": "Speciality Restaurants achieved 41.39% same-store sales growth in Q2FY26, marking its 17th consecutive profitable quarter with improved EBITDA margins at 7.1% and gross margins at 70.4%. The restaurant chain is focusing expansion on Oriental cuisine brands like Asia Kitchen and new Italian format Siciliana, targeting 8-10 new restaurant openings annually while maintaining cash reserves of 157.42 crores.",
            "Sentiment": "positive",
            "PublishDate": 1763650049174,
            "Source": "earnings"
        },
        {
            "Title": "Speciality Restaurants Reports 17th Consecutive Quarter of Profitable Growth in Q2FY26",
            "Summary": "Speciality Restaurants achieved its seventeenth consecutive quarter of sustained profitable growth with consolidated revenue rising to ₹11,643.80 lakhs in Q2FY26 from ₹10,437.77 lakhs in Q2FY25, while profit after tax increased to ₹446.55 lakhs from ₹284.96 lakhs. The restaurant chain operator expanded its network to 123 outlets and launched new brands Siciliana and Walters while maintaining market leadership in Pan-Asian cuisine segment.",
            "Sentiment": "positive",
            "PublishDate": 1763371838739,
            "Source": "earnings"
        },
        {
            "Title": "Speciality Restaurants Reports 89% Jump in Q2 Profit to ₹476 Crores",
            "Summary": "Speciality Restaurants Limited posted a standalone profit after tax of ₹476.45 crores for the quarter ended September 30, 2025, compared to ₹252.01 crores in the same period last year. The restaurant chain's revenue from operations grew to ₹10,975.57 crores from ₹9,794.13 crores year-on-year, with earnings per share increasing to ₹0.99 from ₹0.52.",
            "Sentiment": "positive",
            "PublishDate": 1763174617408,
            "Source": "earnings"
        },
        {
            "Title": "Speciality Restaurants Receives NCLT Approval for Demerger Scheme with Rectifications",
            "Summary": "Speciality Restaurants Limited received rectification in the NCLT order for its scheme of arrangement with Speciality Hotels India Private Limited. The NCLT Kolkata Bench sanctioned the demerger scheme involving transfer of leasehold land assets from Speciality Restaurants to Speciality Hotels India Private Limited. The scheme involves a 0.960 acre leasehold land in Chandaka, Bhubaneshwar, which was categorized as surplus/non-core assets. Key rectifications included changing the appointed date from April 1, 2022 to October 1, 2022, and clarifying that only leasehold land-related assets, debts and liabilities would be transferred. The scheme will become effective once the certified copy is filed with the Registrar of Companies. Speciality Restaurants shares are listed on BSE and NSE, while Speciality Hotels India Private Limited is unlisted.",
            "Sentiment": "positive",
            "PublishDate": 1762978782294,
            "Source": "corporate_action"
        },
        {
            "Title": "Speciality Restaurants Opens New Asia Kitchen Outlet in Chandigarh Mall",
            "Summary": "Speciality Restaurants has opened a new 'Asia Kitchen by Mainland China' outlet at Nexus Elante Mall in Chandigarh. This represents an expansion of the company's restaurant chain presence in the region.",
            "Sentiment": "positive",
            "PublishDate": 1759938654372,
            "Source": "stock"
        },
        {
            "Title": "Speciality Restaurants Board Approves Two Land Development Agreements in West Bengal and Orissa",
            "Summary": "Speciality Restaurants Limited's Board of Directors approved two land development projects during their meeting on September 16, 2025. The first project involves developing 2.03 acres of land in Durgapur, West Bengal, in partnership with Coal Mines Associated Traders Private Limited. The second project covers 0.96 acres in Bhubaneshwar, Orissa, to be developed with Speciality Hotels India Private Limited (a wholly owned subsidiary) and ESSENOS LLP as the developer. Both agreements are subject to receiving requisite approvals. The company will provide detailed disclosures to stock exchanges upon signing the final agreements.",
            "Sentiment": "positive",
            "PublishDate": 1758027573580,
            "Source": "stock"
        },
        {
            "Title": "Speciality Restaurants Receives NCLT Approval for Deal with Speciality Hotels",
            "Summary": "Speciality Restaurants has received approval from the National Company Law Tribunal (NCLT) for a deal with Speciality Hotels. The nature and financial details of the transaction were not specified.",
            "Sentiment": "positive",
            "PublishDate": 1755013856900,
            "Source": "corporate_action"
        },
        {
            "Title": "Speciality Restaurants Reports Mixed Q1 Performance with 3% Revenue Growth Despite Service Charge Impact",
            "Summary": "Speciality Restaurants Limited, which operates restaurant brands including Mainland China, Asia Kitchen, and Oh! Calcutta, reported total standalone income growth of 3.04% year-over-year in Q1 FY2026. The company improved its gross margins to 70.2% from 69.2% and EBITDA margins on operations increased from 4.5% to 6.2%. However, same-store sales growth was flat to slightly negative, impacted by the withdrawal of service charges from March 29, 2025. The company maintains a treasury of INR 163.8 crores and continues spending 5% of revenues on aggregator platforms. Management opened new locations including Siciliana by Café Mezzuna in Kolkata and a pilot Walters Burger store in Mumbai, with plans to open 7 new Asian restaurants and 2 Italian restaurants in FY2026. The delivery business contributes 24% of total revenue, while the company operates 11 cloud kitchen operations. Management expects business improvement in the September to December period and is working towards achieving 10-15% revenue growth guidance.",
            "Sentiment": "neutral",
            "PublishDate": 1754732102151,
            "Source": "earnings"
        },
        {
            "Title": "Speciality Restaurants Reports 16th Consecutive Quarter of Profitable Growth in Q1FY26",
            "Summary": "Speciality Restaurants Limited submitted its Q1FY26 investor presentation showing continued profitable operations for the 16th consecutive quarter. The company reported revenue from operations of ₹10,877.19 lakhs compared to ₹10,311.20 lakhs in Q1FY25, with profit after tax of ₹512.12 lakhs versus ₹764.37 lakhs in the previous year quarter. The restaurant chain operates 124 outlets across multiple brands including Mainland China, Asia Kitchen, Oh! Calcutta, and Sweet Bengal, with presence in 25 cities in India and international locations in London and Dubai. The company maintains market leadership in Pan-Asian/Oriental cuisine segment with diverse formats ranging from fine dining to cloud kitchens. Dine-in sales contributed 76.1% of restaurant sales while delivery sales accounted for 23.9%. The company has expansion plans with scheduled openings in Chandigarh, Mumbai, and Pune, along with brand refresh initiatives for existing outlets.",
            "Sentiment": "positive",
            "PublishDate": 1754407351930,
            "Source": "stock"
        },
        {
            "Title": "Speciality Restaurants Reports 20% Drop in Quarterly Profit Despite Revenue Growth",
            "Summary": "Speciality Restaurants Limited reported standalone profit after tax of ₹568.12 lakhs for the quarter ended June 30, 2025, compared to ₹714.68 lakhs in the same quarter last year. Revenue from operations increased to ₹10,305.77 lakhs from ₹9,713.16 lakhs year-over-year. On a consolidated basis, profit after tax was ₹512.12 lakhs versus ₹764.37 lakhs in the previous year quarter, while consolidated revenue rose to ₹10,877.19 lakhs from ₹10,311.20 lakhs. Basic earnings per share declined to ₹1.18 from ₹1.50 on standalone basis and to ₹1.06 from ₹1.55 on consolidated basis. The company operates casual dining restaurants and confectionary outlets primarily in India. Total expenses increased across both standalone and consolidated operations, with employee benefits expense, depreciation, and other expenses contributing to higher costs.",
            "Sentiment": "neutral",
            "PublishDate": 1754395100571,
            "Source": "earnings"
        },
        {
            "Title": "Speciality Restaurants Schedules Q1FY26 Results Conference Call for August 6, 2025",
            "Summary": "Speciality Restaurants Limited has scheduled a conference call on August 6, 2025, at 3:00 PM IST to present Q1FY26 results to analysts and institutional investors. The call will be represented by Chairman & Managing Director Anjan Chatterjee, Whole-time Director Avik Chatterjee, and Executive Director – Finance and CFO Rajesh Kumar Mohta. The presentation will be uploaded on the company's website and hosted at www.speciality.co.in. Multiple dial-in options are available including universal access numbers and toll-free numbers for international participants from Singapore, Hong Kong, UK, and USA. ICICI Securities is coordinating the call.",
            "Sentiment": "neutral",
            "PublishDate": 1754061522670,
            "Source": "earnings"
        },
        {
            "Title": "Speciality Restaurants Sets August 28, 2025 as Record Date for Dividend Eligibility",
            "Summary": "Speciality Restaurants Limited has fixed August 28, 2025 as the record date for determining shareholder eligibility to receive dividend for the financial year ended March 31, 2025. The dividend payment is subject to declaration at the company's 26th Annual General Meeting scheduled for September 4, 2025, which will be conducted through video-conferencing. If declared, dividend payments will be made from September 8, 2025 onwards, subject to applicable tax deductions. The same date will serve as the cut-off for remote e-voting and AGM participation rights. Payments will be made to beneficial owners holding shares in electronic form and members holding physical shares as per records at close of business on the record date.",
            "Sentiment": "neutral",
            "PublishDate": 1754031197399,
            "Source": "corporate_action"
        },
        {
            "Title": "Restaurant Brands Asia Targets 800 Outlets by FY29 with Digital Focus and Indonesia Expansion",
            "Summary": "Restaurant Brands Asia has set a target to reach 800 outlets by FY29. The company expects to achieve double-digit revenue growth through menu changes, digital initiatives, and profit improvements. The expansion strategy includes reviving operations in Indonesia through fast casual trials and store optimization.",
            "Sentiment": "positive",
            "PublishDate": 1753961228817,
            "Source": "stock"
        },
        {
            "Title": "Speciality Restaurants Q4 Results and Dividend Announcement",
            "Summary": "Speciality Restaurants reported its Q4 financial results. The company's revenue increased to 1.03 billion rupees from 962 million rupees year-over-year. EBITDA rose to 152.4 million rupees from 139 million rupees, with the EBITDA margin improving to 14.79% from 14.45%. However, consolidated net profit decreased to 23.9 million rupees from 31 million rupees year-over-year, but increased from 92.5 million rupees quarter-over-quarter. The company also recommended a dividend of 1 rupee per share.",
            "Sentiment": "neutral",
            "PublishDate": 1747069191000,
            "Source": "result"
        },
        {
            "Title": "Speciality Restaurants Acquires Brydan Foods' Restaurant and Cloud Kitchen Business",
            "Summary": "Speciality Restaurants has executed a Business Transfer Agreement (BTA) with Brydan Foods to acquire their restaurant and cloud kitchen business. The purchase consideration for this acquisition is set at 23 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739200704000,
            "Source": "corporate_action"
        },
        {
            "Title": "Speciality Restaurants Reports Q3 EBITDA and Margin",
            "Summary": "Speciality Restaurants has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 218 million rupees, compared to 220 million rupees in the same quarter of the previous year. The EBITDA margin for Q3 was 18.23%, down from 20.00% in the corresponding quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738324716000,
            "Source": "earnings"
        },
        {
            "Title": "Speciality Restaurants Reports Q3 Financial Results",
            "Summary": "Speciality Restaurants has announced its financial results for the third quarter. The company reported a net profit of 91 million rupees, which is lower compared to 135 million rupees in the same quarter last year. However, it shows an increase from 25 million rupees in the previous quarter. The company's revenue for Q3 stood at 1.2 billion rupees, up from 1.09 billion rupees in the corresponding period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738324664000,
            "Source": "earnings"
        },
        {
            "Title": "Speciality Restaurants Reports Q2 EBITDA Decline",
            "Summary": "Speciality Restaurants has reported its Q2 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) decreased to 145 million rupees from 157 million rupees year-over-year. The EBITDA margin also declined to 14.85% from 16% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1731599048000,
            "Source": "result"
        },
        {
            "Title": "Speciality Restaurants Reports Q2 Financial Results",
            "Summary": "Speciality Restaurants announced its Q2 financial results. The company reported a net profit of 25 million rupees, down from 53 million rupees year-over-year and 72 million rupees quarter-over-quarter. Revenue for Q2 was 979 million rupees, slightly up from 978 million rupees in the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731598986000,
            "Source": "result"
        }
    ]
}