{
    "Symbol": "SPENCERS",
    "ISIN": "INE020801028",
    "News": [
        {
            "Title": "Spencer's Retail seeks shareholder nod for CEO re-appointment",
            "Summary": "Spencer's Retail Limited initiates postal ballot for re-appointing Anuj Singh as CEO & Managing Director for three years from March 22, 2026, with monthly salary of Rs. 27.45 lakhs.",
            "Sentiment": "neutral",
            "PublishDate": 1770882191643,
            "Source": "stocks"
        },
        {
            "Title": "Spencer's Retail Q3FY26 Loss Widens to ₹58.35 Crores",
            "Summary": "Spencer's Retail reported consolidated net loss of ₹58.35 crores for Q3FY26, wider than ₹47.34 crores in Q3FY25. Revenue declined 2.73% YoY to ₹502.87 crores. Board approved CEO reappointment.",
            "Sentiment": "negative",
            "PublishDate": 1770392446943,
            "Source": "co_actions_results"
        },
        {
            "Title": "Spencers Retail Reports 7% QoQ Growth in Q2FY26 Despite Supply Chain Disruptions",
            "Summary": "Spencers Retail delivered INR 445 crores in Q2FY26 revenue with 7% quarter-on-quarter growth despite GST-related supply chain issues and heavy rains in West Bengal affecting September operations. The company's online platform Jiffy achieved 30% QoQ growth reaching INR 52.5 crores with positive unit economics, while offline business maintained 21% margins and launched a loyalty program attracting 40,000+ members.",
            "Sentiment": "positive",
            "PublishDate": 1763364992769,
            "Source": "earnings"
        },
        {
            "Title": "Spencers Retail Reports Mixed Q2 Performance with 7% QoQ Growth Despite Year-on-Year Decline",
            "Summary": "Spencers Retail Limited reported consolidated sales of Rs 445 crores for the quarter ended September 30, 2025, showing 7% quarter-on-quarter growth from Rs 416 crores but declining from Rs 518 crores in the same quarter last year. The company's Spencers division achieved 9% QoQ topline growth driven by online sales, which surged 53% due to higher order volumes and customer frequency. Gross margins improved to 19.6% from 19.1% in the previous quarter, compared to 15.4% in the prior year. However, EBITDA decreased to Rs 13 crores (3.4% of sales) from Rs 15 crores (4.2% of sales) in the previous quarter, primarily due to increased marketing investments and lower other income. Nature's Basket maintained flat sales at Rs 68 crores with margins at 27.6%. The company reported a consolidated loss before tax of Rs 64 crores, marginally higher than the Rs 62 crores loss in the previous quarter but improved from Rs 87 crores loss in the same quarter last year. Spencers operates 98 stores with total area of 9.17 lakh square feet, while Nature's Basket runs 33 stores.",
            "Sentiment": "neutral",
            "PublishDate": 1762781449893,
            "Source": "earnings"
        },
        {
            "Title": "Spencer's Retail Appoints Manjir Basu as New CFO, Sandeep Kumar Banka Transitions to Group Role",
            "Summary": "Spencer's Retail Limited appointed Manjir Basu as Chief Financial Officer and Key Managerial Personnel effective September 19, 2025. The appointment was approved by the Board of Directors following recommendations from the Nomination and Remuneration Committee and Audit Committee. Sandeep Kumar Banka ceased to be CFO on the same date as he transitions to a new role within the group. Basu is a Chartered Accountant with a B.Com degree from St. Xavier College Kolkata, bringing over 20 years of experience in financial management, business finance, cost control, treasury, fund raising, working capital, compliance, risk management, stakeholder management and digital transformation.",
            "Sentiment": "neutral",
            "PublishDate": 1758260496728,
            "Source": "corporate_governance"
        },
        {
            "Title": "Spencer's Retail Reports Mixed Q1FY26 Results with 1% Consolidated Growth and Margin Recovery",
            "Summary": "Spencer's Retail Limited reported 1% quarter-on-quarter consolidated revenue growth for Q1FY26. The company achieved 119 basis point improvement in EBITDA and reported INR5 crores at console level versus breakeven in Q4. PBT loss reduced to INR62 crores from INR68 crores in the previous quarter. Spencer's offline business remained flat due to supply issues and deflationary pricing on staples, but margins improved to 19.1% with EBITDA of INR15 crores versus INR10 crores in Q4. The online business (Jiffy) showed strong growth with 20% sales increase year-on-year, crossing 100,000 monthly average users (80% growth) and achieving 6,500 orders per day. Nature's Basket revenue grew sequentially to INR69 crores from INR61 crores in Q4, with margins recovering to 28.2% from 25%. The company launched a membership program in July with over 22,000 sign-ups and plans to add 8-10 new stores with capex of INR10-12 crores. Management is shifting focus from efficiency-led to top line growth-driven EBITDA improvement, targeting mid-single-digit growth for offline business and 50% growth for online operations.",
            "Sentiment": "neutral",
            "PublishDate": 1754496065177,
            "Source": "earnings"
        },
        {
            "Title": "Spencer's Retail Outlines Multi-Pronged Strategy for Profit Growth",
            "Summary": "Spencer's Retail has outlined its strategy to drive profit growth through several key initiatives. The company plans to increase online sales, implement cost-cutting measures, expand premium store locations, and deploy a new strategy for its Nature's Basket brand. These combined efforts represent the retailer's comprehensive approach to improving profitability across multiple business segments.",
            "Sentiment": "positive",
            "PublishDate": 1753888363679,
            "Source": "stock"
        },
        {
            "Title": "Spencer's Retail Reports Rs 3,116 Crore Loss in Q1, Approves Auditor Re-appointment",
            "Summary": "Spencer's Retail Limited reported a net loss of Rs 3,115.83 lakhs for the quarter ended June 30, 2025, compared to a loss of Rs 4,810.52 lakhs in the same quarter last year. Revenue from operations declined to Rs 35,107.20 lakhs from Rs 47,581.84 lakhs in the previous quarter. The company's current liabilities exceed current assets by Rs 65,676.52 lakhs. On a consolidated basis, the group reported a loss of Rs 6,161.03 lakhs for the quarter. The Board approved the re-appointment of S.R. Batliboi & Co. LLP as statutory auditors for a second term of 5 years, subject to shareholder approval. The company operates solely in organized retail and has been closing loss-making stores while focusing on margin improvement initiatives.",
            "Sentiment": "negative",
            "PublishDate": 1753867300801,
            "Source": "earnings"
        },
        {
            "Title": "Spencers Retail Reports Wider Net Loss and Revenue Decline in Q1",
            "Summary": "Spencers Retail reported a consolidated net loss of 616 million rupees in Q1, compared to a loss of 434 million rupees in the same period last year. The company's revenue fell to 4.1 billion rupees from 5.5 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1753865992549,
            "Source": "earnings"
        },
        {
            "Title": "Spencer's Retail: Q4 Loss Narrows, Revenue Declines",
            "Summary": "Spencer's Retail reported a reduced Q4 FY25 net loss of Rs 68.40 crore, down from Rs 80.69 crore year-on-year. Revenue fell to Rs 411.87 crore from Rs 546.79 crore. FY25 net loss narrowed to Rs 246.36 crore. The company closed 47 stores in Q2, impacting topline. JIFFY, their quick delivery service, is expanding to new cities.",
            "Sentiment": "neutral",
            "PublishDate": 1747316952000,
            "Source": "earnings"
        },
        {
            "Title": "Spencer's Retail Reports Q4 FY23 Financial Results",
            "Summary": "Spencer's Retail announced its Q4 financial results. The company reported a consolidated net loss of 684 million rupees, an improvement from the 807 million rupees loss in the same quarter last year. However, the loss widened compared to the previous quarter's 473 million rupees. Revenue for Q4 stood at 4.1 billion rupees, down from 5.47 billion rupees in the year-ago period.",
            "Sentiment": "negative",
            "PublishDate": 1747309432000,
            "Source": "result"
        },
        {
            "Title": "Spencers Retail Reports Slight Increase in Q3 EBITDA and Margin",
            "Summary": "Spencers Retail has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 118 million rupees, compared to 117.6 million rupees in the same quarter of the previous year, showing a marginal increase. The EBITDA margin improved to 2.28% from 1.80% year-over-year, indicating better operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1737017283000,
            "Source": "earnings"
        },
        {
            "Title": "Spencers Retail Reports Decline in Q3 Revenue",
            "Summary": "Spencers Retail, an Indian retail company, has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 5.2 billion rupees, compared to 6.54 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737017205000,
            "Source": "earnings"
        },
        {
            "Title": "Spencer's Retail Chairman Confident of Achieving Breakeven EBITDA",
            "Summary": "The Chairman of Spencer's Retail has expressed confidence in achieving breakeven business EBITDA (pre-INDAS) in the coming quarter. This optimism is based on a series of decisive actions implemented in Q2 and the encouraging results observed from these measures.",
            "Sentiment": "positive",
            "PublishDate": 1730880551000,
            "Source": "corporate_action"
        },
        {
            "Title": "Spencers Retail Reports Increased Q2 Loss",
            "Summary": "Spencers Retail, a retail company, has reported a consolidated net loss of 872 million for the second quarter, compared to a loss of 701 million in the same period last year. This represents an increase in losses year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1730879441000,
            "Source": "result"
        }
    ]
}