{
    "Symbol": "SPIC",
    "ISIN": "INE147A01011",
    "News": [
        {
            "Title": "SPIC Reports Strong Q2 Performance with 67% Profit Jump and Appoints New Director",
            "Summary": "Southern Petrochemical Industries Corporation (SPIC) reported net profit of Rs. 54.10 crores for Q2 ended September 30, 2025, up 67% from Rs. 32.27 crores in the previous year, driven by higher urea production and insurance claim receipts. The company appointed Sweta Suman, IAS, as Additional Director representing TIDCO, while urea plant operated for 92 days producing 1.92 lakh MT during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1763146166822,
            "Source": "earnings"
        },
        {
            "Title": "SPIC Reports Strong Q1 FY2026 Results with 60% EBITDA Growth; Appoints New Director",
            "Summary": "Southern Petrochemical Industries Corporation Limited reported unaudited financial results for the quarter ended 30th June 2025. Revenue from operations increased 3.5% to Rs 780.63 crores compared to Rs 754.34 crores in the same quarter last year. EBITDA grew significantly by 60.5% to Rs 110.81 crores from Rs 69.03 crores, while net profit rose 13.5% to Rs 58.27 crores from Rs 51.35 crores. EPS improved to Rs 2.86 from Rs 2.52. The urea plant operated for 91 days during the quarter, producing 1.92 lakh MT and selling 1.86 lakh MT of urea. The Board appointed Thiru. V Dakshinamoorthy, IAS as an Additional Director effective 14th August 2025. The company scheduled its 54th Annual General Meeting for 23rd September 2025 and set the record date for dividend eligibility as 16th September 2025. The Board recommended a dividend of Rs 2.00 per equity share for FY 2024-25, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1755513351809,
            "Source": "earnings"
        },
        {
            "Title": "Southern Petrochemicals Reports Mixed Q1 Results with Revenue Growth but Lower EBITDA",
            "Summary": "Southern Petrochemicals Industries Corporation reported Q1 revenue of 7.8 billion rupees, up from 7.5 billion rupees in the same quarter last year. Net profit increased to 583 million rupees from 514 million rupees year-over-year. However, EBITDA declined to 930 million rupees from 980 million rupees, while EBITDA margin compressed to 11.91% from 13% in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1755181607156,
            "Source": "earnings"
        },
        {
            "Title": "Southern Petrochemicals Industries Reports Q3 EBITDA Growth",
            "Summary": "Southern Petrochemicals Industries Corporation (SPIC) has reported its Q3 financial results. The company's EBITDA increased to 794.9 million rupees, up from 559.6 million rupees in the same quarter last year. However, the EBITDA margin decreased to 9.72% from 11.05% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1738862390000,
            "Source": "earnings"
        },
        {
            "Title": "Southern Petrochemicals Industries Reports Significant Revenue Growth in Q3",
            "Summary": "Southern Petrochemicals Industries Corporation has reported a substantial increase in its third-quarter revenue. The company's revenue for Q3 stood at 8.18 billion rupees, compared to 5.06 billion rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1738862381000,
            "Source": "earnings"
        },
        {
            "Title": "Southern Petrochemicals Industries Reports Q3 Profit Increase",
            "Summary": "Southern Petrochemicals Industries Corporation has reported a consolidated net profit of 385 million rupees for the third quarter, showing an increase from 332.8 million rupees year-over-year and 351.7 million rupees quarter-over-quarter.",
            "Sentiment": "positive",
            "PublishDate": 1738862373000,
            "Source": "earnings"
        },
        {
            "Title": "Southern Petrochemicals Reports Q2 EBITDA Decline",
            "Summary": "Southern Petrochemicals has reported a decrease in its Q2 EBITDA, which fell to 670 million rupees from 980 million rupees in the previous quarter. The company's EBITDA margin also declined, dropping to 8.82% from 13% quarter-over-quarter.",
            "Sentiment": "negative",
            "PublishDate": 1731513168000,
            "Source": "result"
        },
        {
            "Title": "Southern Petrochemicals Reports Q2 Financial Results",
            "Summary": "Southern Petrochemicals has released its Q2 financial results. The company reported a net profit of 310 million rupees, down from 514 million rupees in the previous quarter. Revenue for Q2 stood at 7.6 billion rupees, slightly up from 7.54 billion rupees in the previous quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1731513077000,
            "Source": "result"
        }
    ]
}