{
    "Symbol": "SPLIL",
    "ISIN": "INE978G01016",
    "News": [
        {
            "Title": "SPL Industries Updates CIN After Real Estate Addition",
            "Summary": "SPL Industries Limited rectified its Corporate Identification Number to L13139DL1991PLC062744 after system-driven changes occurred following addition of real estate activities to its business objects while maintaining textile as primary business.",
            "Sentiment": "neutral",
            "PublishDate": 1769172993150,
            "Source": "stocks"
        },
        {
            "Title": "SPL Industries Opens Special Window for Share Transfers",
            "Summary": "SPL Industries Limited announces a special six-month window from July 7, 2025 to January 6, 2026 for re-lodgement of physical share transfer requests that were previously rejected or returned due to deficiencies.",
            "Sentiment": "neutral",
            "PublishDate": 1767177396025,
            "Source": "stocks"
        },
        {
            "Title": "SPL Industries Acquires Land in Haryana Through Related Party Transfer",
            "Summary": "SPL Industries Limited has agreed to purchase 59 Kanal 10 Marle of land in Village Prithla, Tehsil Palwal, District Palwal, Haryana from 22 third-party sellers for business expansion. The company will reimburse Rs. 3,42,12,501 advance amount to Elkay Overseas India, a promoter group entity that originally initiated the land purchase agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1764765915328,
            "Source": "stock"
        },
        {
            "Title": "SPL Industries Limited Wins High Court Case Against Name Change Order",
            "Summary": "The Delhi High Court quashed a Regional Director's order that required SPL Industries Limited to change its company name within three months due to similarity with another company. The court found that SPL Industries had adopted the name before the other company and that the original order failed to consider all relevant facts, disposing of the writ petition in favor of SPL Industries.",
            "Sentiment": "positive",
            "PublishDate": 1764161844286,
            "Source": "corporate_governance"
        },
        {
            "Title": "SPL Industries Wins Court Battle Against Name Change Order",
            "Summary": "The Delhi High Court quashed a Regional Director's order that directed SPL Industries Limited to change its company name under Section 16(1)(a) of the Companies Act, 2013. The court's decision disposes of the matter entirely, allowing the company to retain its current name and resolving the legal challenge that began with the December 3, 2024 order.",
            "Sentiment": "positive",
            "PublishDate": 1763987891078,
            "Source": "stock"
        },
        {
            "Title": "SPL Industries Reports Net Profit of ₹91.30 Lakhs for September 2025 Quarter",
            "Summary": "SPL Industries Limited announced its unaudited financial results for the quarter and half-year ended September 30, 2025. The company reported a net profit of ₹91.30 lakhs for the quarter, compared to a net loss of ₹49.83 lakhs in the previous quarter. For the half-year period, net profit reached ₹396.75 lakhs. Total income from operations stood at ₹2,035.56 lakhs for the quarter. The company's cash and cash equivalents increased to ₹308.99 lakhs from ₹103.52 lakhs at the beginning of the year. Total assets were valued at ₹22,305.75 lakhs as of September 30, 2025. The board meeting was held on November 12, 2025, to approve these results.",
            "Sentiment": "positive",
            "PublishDate": 1762940152524,
            "Source": "earnings"
        },
        {
            "Title": "SPL Industries Legal Proceedings Adjourned to November 24, 2025",
            "Summary": "SPL Industries Limited provided an update on ongoing legal proceedings in the Delhi High Court. The court granted respondents one week to file a counter-affidavit and directed that notice be served to respondent No. 5 through the Registrar of Companies, Mumbai. The court stated that if respondent No. 5 fails to appear despite proper notice, it will be presumed they do not wish to contest the petition. The matter has been scheduled for November 24, 2025, and the interim order remains in effect until the next hearing date.",
            "Sentiment": "neutral",
            "PublishDate": 1762291395129,
            "Source": "stock"
        },
        {
            "Title": "SPL Industries Shareholders Approve Rs 100 Crore Borrowing Limit and Real Estate Business Expansion at 34th AGM",
            "Summary": "SPL Industries Limited held its 34th Annual General Meeting on September 29, 2025, where shareholders approved several key resolutions. The company maintained its borrowing limit at Rs 100 crores under Section 180(1)(c) of the Companies Act, 2013. Shareholders authorized material related party transactions until the 2026 AGM and appointed M/s. Agarwal S. & Associates as Secretarial Auditor for five consecutive years from FY 2025-26 to FY 2029-30. The firm has over 20 years of experience and has conducted audits for leading Indian companies including BSE 100 companies and Central Public Sector Enterprises. Additionally, shareholders approved investment and loan limits of Rs 250 crores under Section 186 and Rs 100 crores under Section 185 of the Companies Act. A significant business expansion was approved through an amendment to the Memorandum of Association, adding real estate as a new business vertical. The new clause allows the company to engage in comprehensive real estate activities including acquiring, developing, constructing, and managing various property types such as residential, commercial complexes, IT parks, and infrastructure facilities both in India and abroad.",
            "Sentiment": "positive",
            "PublishDate": 1759315243944,
            "Source": "corporate_action"
        },
        {
            "Title": "SPL Industries Reports Q1 FY2026 Results and Appoints New Internal Auditor",
            "Summary": "SPL Industries Limited's Board approved unaudited financial results for the first quarter ended June 30, 2025. The company reported net sales of ₹1,663.71 lakhs compared to ₹4,247.43 lakhs in the same quarter last year, representing a decline. Net profit for the quarter was ₹91.30 lakhs versus ₹258.37 lakhs in the corresponding previous quarter. Total income decreased to ₹2,035.56 lakhs from ₹4,559.56 lakhs year-over-year. The company's earnings per share stood at ₹0.31 for the quarter. Additionally, the Board appointed M/s. Vatss & Associates as Internal Auditor for FY 2025-26. The firm brings experience in statutory audit, internal audit, tax advisory, compliance review, and risk management. The company operates in garment manufacturing and trading segments.",
            "Sentiment": "negative",
            "PublishDate": 1755076939220,
            "Source": "earnings"
        }
    ]
}