{
    "Symbol": "SPLPETRO",
    "ISIN": "INE663A01033",
    "News": [
        {
            "Title": "Supreme Petrochem announces demise of Director",
            "Summary": "Supreme Petrochem Ltd announced the sad demise of Shri Bajranglal Surajimal Taparia, Non-Executive and Non-Independent Director, who passed away on January 30, 2026, leading to his cessation as Director.",
            "Sentiment": "negative",
            "PublishDate": 1769850864717,
            "Source": "stocks"
        },
        {
            "Title": "Supreme Petrochem Q3FY26 Results: Revenue Drops 10% YoY",
            "Summary": "Supreme Petrochem reported Q3FY26 operating income of Rs. 1,265 crores, down 10% YoY due to falling styrene monomer prices. ABS plant operations suspended in December due to equipment malfunction.",
            "Sentiment": "negative",
            "PublishDate": 1769589482747,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Petrochem Q3FY26 Results Show Decline",
            "Summary": "Supreme Petrochem reports Q3FY26 net profit of ₹30.15 crores, down 57.74% YoY. Revenue drops to ₹1,264.69 crores amid ABS plant operational challenges.",
            "Sentiment": "negative",
            "PublishDate": 1768918484249,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Petrochem Board Meet on Jan 20 for Q3FY26 Results",
            "Summary": "Supreme Petrochem Ltd has scheduled its board meeting for January 20, 2026, to consider and approve Q3FY26 unaudited financial results. Trading window closed from Jan 1-22, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1767940890111,
            "Source": "co_actions_results"
        },
        {
            "Title": "Supreme Petrochem Clarifies Plant Operations Status",
            "Summary": "Supreme Petrochem denies shutdown rumors at main Amdoshi plant while confirming closure of newly setup MABS plant at same location, providing operational clarity.",
            "Sentiment": "neutral",
            "PublishDate": 1766490558490,
            "Source": "stocks"
        },
        {
            "Title": "Supreme Petrochem Gets Independent ESG Rating of 60",
            "Summary": "Supreme Petrochemicals Ltd receives an unsolicited Environmental, Social and Governance (ESG) rating of 60 from CFC Finlease Private Limited based on publicly available information.",
            "Sentiment": "neutral",
            "PublishDate": 1766410805842,
            "Source": "stocks"
        },
        {
            "Title": "Supreme Petrochem Clarifies Only mABS Plant Affected",
            "Summary": "Supreme Petrochem clarifies that only its newly setup mABS plant at Amdoshi is temporarily closed due to equipment malfunction, while other operations remain fully functional.",
            "Sentiment": "neutral",
            "PublishDate": 1766405330018,
            "Source": "stocks"
        },
        {
            "Title": "Supreme Petrochemical Credit Rating Outlook Revised",
            "Summary": "India Ratings revises Supreme Petrochemical's outlook to Stable from Positive while affirming IND AA- rating on ₹19,000 million bank facilities amid delayed ABS facility ramp-up.",
            "Sentiment": "neutral",
            "PublishDate": 1765966444868,
            "Source": "stocks"
        },
        {
            "Title": "Supreme Petrochem Resumes Operations at Manali Facility",
            "Summary": "Supreme Petrochem has resumed activities at its Manali facility after a period of suspension. The resumption of operations is expected to restore production capacity and contribute to the company's manufacturing output.",
            "Sentiment": "positive",
            "PublishDate": 1765288958513,
            "Source": "stock"
        },
        {
            "Title": "Supreme Petrochem Halts Manali Plant Operations Due to Heavy Rainfall in Chennai",
            "Summary": "Supreme Petrochem has temporarily suspended operations at its Manali manufacturing plant in Chennai due to heavy rainfall in the region. The operational halt affects the company's production capabilities at this facility, though the duration of the suspension remains unspecified.",
            "Sentiment": "negative",
            "PublishDate": 1764940554086,
            "Source": "stock"
        },
        {
            "Title": "Supreme Petrochem Reports 27% Revenue Decline in Q2 FY26 Due to Lower Raw Material Prices",
            "Summary": "Supreme Petrochem Limited reported operating income of Rs. 1,100 crores for Q2 FY26, down from Rs. 1,500 crores in the previous year, primarily due to lower styrene monomer prices which fell to 850-950 range from 1,150 in the corresponding quarter last year. The company posted EBITDA of Rs. 86 crores and net profit after tax of Rs. 48 crores for the quarter. For the first half of FY26, operating income stood at Rs. 2,487 crores with EBITDA of Rs. 216 crores and net profit of Rs. 129 crores. Sales volumes were impacted by extended monsoons affecting demand for cooling devices, GST rate reduction deferrals, subdued economic activity, and US trade barriers changing global trade flows. The company's ABS plant with 70,000 metric tons capacity has commenced production in technical collaboration with Versalis. Supreme Petrochem remains debt-free with investible surplus of Rs. 522 crores and declared an interim dividend of Rs. 2.50 per equity share.",
            "Sentiment": "negative",
            "PublishDate": 1761917160128,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Petrochem Reports 47% Decline in Q2 Net Profit to ₹481.9 Million",
            "Summary": "Supreme Petrochem reported quarterly net profit of ₹481.9 million compared to ₹903.4 million in the same period last year. Revenue decreased to ₹11 billion from ₹15.04 billion year-on-year. EBITDA fell to ₹505 million from ₹1.25 billion, while EBITDA margin compressed to 4.59% from 8.32% in the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1761523739885,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Petrochem Plans Growth Through New ABS Production Line and Capacity Expansion",
            "Summary": "Supreme Petrochem is preparing for growth by establishing a new ABS production line and increasing its overall capacity. The company maintains a robust balance sheet and aims to focus on high-value products, expand exports, and achieve market dominance.",
            "Sentiment": "positive",
            "PublishDate": 1761324695223,
            "Source": "stock"
        },
        {
            "Title": "Supreme Petrochem Reports 47% Decline in Q2 Net Profit, Announces Interim Dividend",
            "Summary": "Supreme Petrochem reported a net profit of 481.9 million rupees for Q2, down from 903.4 million rupees in the same quarter last year. Revenue declined to 11 billion rupees from 15.04 billion rupees year-over-year. EBITDA dropped to 505 million rupees compared to 1.25 billion rupees previously, with EBITDA margin contracting to 4.59% from 8.32%. The company recommended an interim dividend of 2.50 rupees per share.",
            "Sentiment": "negative",
            "PublishDate": 1761309416310,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Petrochem Schedules Board Meeting for Q2/H1 Results and Interim Dividend Consideration",
            "Summary": "Supreme Petrochem Ltd has scheduled a Board of Directors meeting for October 24, 2025, at 3:30 p.m. to consider and approve the standalone and consolidated unaudited financial results for the second quarter and half year ended September 30, 2025, along with statement of assets & liabilities and cash flow statement. The board will also consider interim dividend on the paid-up equity share capital for FY 2025-2026 and fixing of record date. The company has implemented a trading window closure for insiders and covered persons from October 1 to October 26, 2025, during which trading of the company's securities is prohibited for these individuals.",
            "Sentiment": "neutral",
            "PublishDate": 1760618615318,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Petrochem Commissions New ABS Compounding Lines with 20,000 TPA Capacity",
            "Summary": "Supreme Petrochem Ltd commissioned two new ABS compounding lines at their Amdoshi facility with an installed capacity of 20,000 TPA. Production at the new lines commenced on September 25, 2025. This represents an expansion of the company's manufacturing capabilities in ABS compounding operations.",
            "Sentiment": "positive",
            "PublishDate": 1758806627564,
            "Source": "stock"
        },
        {
            "Title": "Supreme Petrochem Commissions 70,000 TPA ABS Plant in Maharashtra",
            "Summary": "Supreme Petrochem has commissioned a new ABS (Acrylonitrile Butadiene Styrene) plant with a capacity of 70,000 tonnes per annum at Amdoshi, Maharashtra. The plant has begun production operations.",
            "Sentiment": "positive",
            "PublishDate": 1758803470431,
            "Source": "stock"
        },
        {
            "Title": "Supreme Petrochem Q1 FY26 Revenue Drops 12% to Rs 1,386 Crores on Lower Styrene Prices",
            "Summary": "Supreme Petrochem reported operating income of Rs 1,386 crores for Q1 FY26, declining 12% year-on-year due to lower styrene monomer prices which fell from $1,150 to $1,000. Operating EBITDA dropped 29% to Rs 115 crores with margins at 9.36%, while net profit stood at Rs 81 crores. Sales volume of manufactured products increased marginally by 0.5% to 93,853 MT. The company faced headwinds from unseasonal rains affecting demand for cooling appliances and subdued OEM sales for air conditioners and refrigerators. Supreme Petrochem completed acquisition of Xmold Polymers during the quarter and expects commercial operations of its ABS project Phase 1 to commence in the current quarter with technical support from Versalis. The company maintains debt-free status with investable surplus exceeding Rs 700 crores and targets 13-14% revenue from exports in FY26.",
            "Sentiment": "negative",
            "PublishDate": 1753876506906,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Ltd Reopens Special Window for Physical Share Transfer Re-lodgement",
            "Summary": "Supreme Ltd has reopened a special window for re-lodgement of physical share transfer requests that were rejected or returned prior to April 1, 2019. The window will remain open from July 7, 2025 to January 6, 2026, following SEBI circular dated July 2, 2025. The company published this information in Business Standard and Pudhari newspapers on July 26, 2025. This initiative allows shareholders to resubmit transfer deeds that were previously rejected due to document deficiencies or other processing issues.",
            "Sentiment": "neutral",
            "PublishDate": 1753709872715,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Petrochem Makes Audio Recording of Earnings Conference Call Available to Investors",
            "Summary": "Supreme Petrochem held its earnings conference call with investors on July 25, 2025, at 4:00 PM IST to discuss quarterly results. The company has made the audio recording of the call accessible through a direct link and on its website at https://supremepetrochem.com. The call was conducted as previously scheduled and announced to investors on July 18, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753450904786,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Petrochem Reports Q1 FY2026 Financial Results",
            "Summary": "Supreme Petrochem Limited published its standalone and consolidated financial results for the first quarter ended June 30, 2025. The Board of Directors approved these results on July 23, 2025, and they were published in newspapers on July 25, 2025. The company reported total revenue from operations of ₹2,274 crores and net profit of ₹10.71 crores for the quarter. The results were published in Business Standard (English) and Pudhari (Marathi) newspapers in compliance with SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1753442235387,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Petrochem Targets Volume Growth and Margin Recovery Through Capacity Expansion",
            "Summary": "Supreme Petrochem is focusing on capacity-led volume growth while working toward margin recovery. The company's strategy includes expanding its EPS/SPS production lines, implementing cost efficiency measures, conducting new product trials, and building export momentum to achieve these objectives.",
            "Sentiment": "positive",
            "PublishDate": 1753282304977,
            "Source": "stock"
        },
        {
            "Title": "Supreme Petrochem Receives Approval for ABS Project Pre-Commissioning Work",
            "Summary": "Supreme Petrochem has received approval to begin pre-commissioning work on the first line of its ABS (Acrylonitrile Butadiene Styrene) project. This represents a key milestone in the company's project development as it moves toward the operational phase of its ABS manufacturing facility.",
            "Sentiment": "positive",
            "PublishDate": 1753276721205,
            "Source": "stock"
        },
        {
            "Title": "Supreme Petrochem Reports Rs 8,092 Crore Net Profit in Q1 FY2026, ABS Project Operations to Begin in Q2",
            "Summary": "Supreme Petrochem Ltd reported standalone revenue from operations of Rs 1,38,654.29 lakhs and net profit of Rs 8,092.24 lakhs for the quarter ended June 30, 2025. The company's consolidated net profit was Rs 8,205.05 lakhs for the same period. Pre-commissioning activities for the ABS project with 70,000 TPA capacity have commenced with technical support from Veratis, Italy, and commercial operations will start in the second quarter of FY2025-26. The company has acquired Xmold Polymers Private Limited as a subsidiary through a Share Purchase Agreement, with control effective from April 1, 2025. The board approved amended policies on fair disclosure of unpublished price sensitive information and criteria for determining materiality of events. The company's earnings per share stood at Rs 4.30 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753276225654,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Petrochem Q4 Results: Net Profit Down, Revenue Stable",
            "Summary": "Supreme Petrochem reported Q4 net profit of 1.07 billion rupees, down from 1.3 billion year-over-year and up from 714 million quarter-over-quarter. Q4 revenue was 15.4 billion rupees, slightly down from 15.6 billion year-over-year. EBITDA margin decreased to 9.43% from 11.24% year-over-year. The company recommended a dividend of 7.5 rupees per equity share.",
            "Sentiment": "neutral",
            "PublishDate": 1745453471000,
            "Source": "default"
        },
        {
            "Title": "Supreme Petrochem: Q4 PAT Down 18.71% YoY, Declares ₹7.5 Dividend",
            "Summary": "Supreme Petrochem reported Q4FY25 PAT of ₹106.9 crore, down 18.71% YoY but up 49.72% QoQ. FY25 revenue increased 14.66% to ₹6,023.4 crore, with net profit up 12.70% to ₹390.5 crore. The company proposed a final dividend of ₹7.50 per share, with the record date set for July 4, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1745424928000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Petrochem Reports Q4 Results and Dividend",
            "Summary": "Supreme Petrochem announced its Q4 financial results and dividend. The company recommended a dividend of 7.5 rupees per equity share. Q4 EBITDA was 1.45B rupees, down from 1.75B year-over-year, with EBITDA margin decreasing to 9.43% from 11.24%. Net profit for Q4 was 1.07B rupees, down from 1.3B year-over-year but up from 714M quarter-over-quarter. Revenue for Q4 was 15.4B rupees, slightly down from 15.6B year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1745419443000,
            "Source": "result"
        },
        {
            "Title": "Supreme Petrochem Acquires 80% Stake in Xmold Polymers",
            "Summary": "Supreme Petrochem has announced the acquisition of an 80% stake in Xmold Polymers. The company plans to acquire the remaining 20% stake within the next two years, completing a full takeover of Xmold Polymers.",
            "Sentiment": "positive",
            "PublishDate": 1744898833000,
            "Source": "default"
        },
        {
            "Title": "Supreme Petrochem to Acquire Xmold Polymers for 397.6 Million Rupees",
            "Summary": "Supreme Petrochem has announced its plan to acquire 2,171,813 equity shares of Xmold Polymers, representing 100% of the company's equity. The acquisition is valued at 397.6 million rupees. This strategic move is aimed at expanding Supreme Petrochem's presence in Southern India.",
            "Sentiment": "positive",
            "PublishDate": 1742342663000,
            "Source": "corporate_action"
        },
        {
            "Title": "Supreme Petrochem Reports Increased Q3 Net Profit and Revenue",
            "Summary": "Supreme Petrochem has announced its financial results for the third quarter. The company's net profit increased to 714 million rupees, up from 677 million rupees in the same quarter last year. However, it decreased from 903 million rupees in the previous quarter. Revenue for Q3 rose to 14 billion rupees, compared to 11.88 billion rupees in the corresponding period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737333552000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Petrochem: Q3 Profit Up 5.5%, Revenue Rises 18.3%",
            "Summary": "Supreme Petrochem reported Q3 FY25 net profit of ₹71.4 crore, up 5.5% YoY. Revenue increased 18.3% to ₹1,405.3 crore. EBITDA grew 4.6% to ₹99.3 crore. The company appointed two new directors: Akshay Rajan Raheja as non-executive director and Mona Ninad Desai as independent director.",
            "Sentiment": "positive",
            "PublishDate": 1737123833000,
            "Source": "earnings"
        },
        {
            "Title": "Supreme Petrochem: Q2 Profit Jumps 16%, Interim Dividend Declared",
            "Summary": "Supreme Petrochem reported a 15.8% YoY increase in Q2 FY25 net profit to ₹90.3 crore. Revenue rose 17.8% to ₹1,505.6 crore. EBITDA grew 18% to ₹125.3 crore. The company remains debt-free with ₹885.9 crore in cash and equivalents. H1 FY25 sales volume of manufactured products increased by 10.47%. The board recommended an interim dividend of 125% (₹2.5 per share).",
            "Sentiment": "positive",
            "PublishDate": 1729524136000,
            "Source": "result"
        },
        {
            "Title": "Supreme Petrochem: Credit Ratings Affirmed, Outlook Revised to Positive",
            "Summary": "<p>India Ratings and Research has <span class='positive'>affirmed</span> Supreme Petrochem's credit ratings while <span class='positive'>revising</span> the outlook from Stable to <span class='positive'>Positive</span>. <b>Long-term issuer rating, fund-based limits, and non-fund based limits</b> are all rated <span class='neutral'>IND AA-</span> with a <span class='positive'>Positive</span> outlook.</p>",
            "Sentiment": "positive",
            "PublishDate": 1728049200000,
            "Source": "normal_news"
        }
    ]
}