{
    "Symbol": "SPMLINFRA",
    "ISIN": "INE937A01023",
    "News": [
        {
            "Title": "SPML Infra Q3FY26 Results: Revenue Up 22% to ₹22,976 Cr",
            "Summary": "SPML Infra reported strong Q3FY26 performance with revenue rising 22% YoY to ₹22,976.11 crores and profit after tax surging 97% to ₹2,047.15 crores, driven by improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1770910436492,
            "Source": "co_actions_results"
        },
        {
            "Title": "SPML Infra Q3 & 9M FY26 Earnings Call on Feb 16",
            "Summary": "SPML Infra Limited announces Q3 & 9M FY26 earnings conference call scheduled for February 16, 2026 at 03:30 PM IST to discuss performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770274586311,
            "Source": "co_actions_results"
        },
        {
            "Title": "SPML Infra Allots 6.7 Lakh Shares to Promoter Group",
            "Summary": "SPML Infra Limited has allotted 6,70,000 equity shares at ₹215 per share to promoter group entity Niral Enterprises through warrant exercise, raising ₹144.05 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768987466672,
            "Source": "co_actions_results"
        },
        {
            "Title": "Vijay Kedia buys stake in SPML Infra via bulk deal",
            "Summary": "Ace investor Vijay Kedia acquired 14,98,107 shares of SPML Infra at ₹167 per share through bulk deal worth ₹25 crore. The infrastructure company has market cap of ₹1,373 crore.",
            "Sentiment": "positive",
            "PublishDate": 1768582721703,
            "Source": "co_actions_results"
        },
        {
            "Title": "SPML Infra Appoints Go India Advisors as IR Agency",
            "Summary": "SPML Infra Limited has appointed Go India Advisors as its Investor Relations Agency effective February 1, 2026, as disclosed under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768393858723,
            "Source": "stocks"
        },
        {
            "Title": "SPML Infra gets ₹159cr surety bond, ₹22cr award",
            "Summary": "SPML Infra secured ₹159 crore surety bond limit from IRDAI-registered insurer and ₹21.61 crore arbitration award from Chennai Metropolitan Water Supply and Sewerage Board, enhancing tender participation capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1767441782782,
            "Source": "stocks"
        },
        {
            "Title": "SPML Infra Wins ₹21.61 Crore Arbitration Award",
            "Summary": "SPML Infra Limited has successfully secured an arbitration award worth ₹21.61 crores, marking a significant legal victory for the infrastructure development company.",
            "Sentiment": "positive",
            "PublishDate": 1767435238901,
            "Source": "co_actions_results"
        },
        {
            "Title": "SPML Infra Secures ₹159 Crore Surety Bond Limit",
            "Summary": "SPML Infra has successfully obtained a surety bond limit of ₹159 crores, strengthening its financial capacity for infrastructure projects and business operations.",
            "Sentiment": "positive",
            "PublishDate": 1767435213976,
            "Source": "stocks"
        },
        {
            "Title": "SPML Infra Wins ₹21.61 Cr Arbitration Award",
            "Summary": "SPML Infra Limited secured a favorable arbitration award of ₹21.61 crores from Chennai Metropolitan Water Supply and Sewerage Board on December 31, 2025, announced under SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1767433964724,
            "Source": "stocks"
        },
        {
            "Title": "SPML Infra Allocates 11.44 Lakh Shares to NARCL",
            "Summary": "SPML Infra allocated 11.44 lakh shares to National Asset Reconstruction Company Limited (NARCL) at ₹276.00 per share as part of a loan conversion arrangement, representing a total value of ₹31.58 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1767160552165,
            "Source": "co_actions_results"
        },
        {
            "Title": "SPML Infra Secures ₹207 Crore Water Supply Contract in Rajasthan",
            "Summary": "SPML Infra has won a ₹207 crore order under the Jal Jeevan Mission to enhance water supply infrastructure in Rajasthan. This contract award strengthens the company's position in the water infrastructure sector and adds significant value to its order book.",
            "Sentiment": "positive",
            "PublishDate": 1765151657494,
            "Source": "stock"
        },
        {
            "Title": "SPML Infra Promoter Niral Enterprises Pledges 21.8% Stake to NARCL",
            "Summary": "Niral Enterprises Pvt Ltd has pledged 1,643,914 shares representing 2.18% of SPML Infra Limited to SBICAP Trustee Company on behalf of National Asset Reconstruction Company Limited as per a loan agreement. The pledge reduces Niral Enterprises' unencumbered holding in SPML Infra from 3.49% to 2.75% while maintaining total shareholding of 2,630,553 shares.",
            "Sentiment": "negative",
            "PublishDate": 1764744702518,
            "Source": "corporate_action"
        },
        {
            "Title": "SPML India Acquires Additional 21.08 Lakh Shares in SPML Infra Through Preferential Allotment",
            "Summary": "SPML India Limited acquired 21,08,637 equity shares of SPML Infra Limited through preferential allotment on November 20, 2025, increasing its shareholding from 7.91% to 8.19%. The acquisition strengthens the promoter group's stake in the target company, with SPML Infra's total equity capital expanding from 7.23 crore to 7.55 crore shares.",
            "Sentiment": "positive",
            "PublishDate": 1764574516501,
            "Source": "corporate_action"
        },
        {
            "Title": "SPML Infra Promoter Creates Pledge on Shares in Favor of SBICAP Trustee Company",
            "Summary": "Niral Enterprises Pvt Ltd, a promoter of SPML Infra Limited, has created an encumbrance/pledge over its shares in the company in favor of SBICAP Trustee Company Ltd on behalf of National Asset Reconstruction Company Ltd as the lender. The disclosure was made to stock exchanges under SEBI takeover regulations following the pledge creation.",
            "Sentiment": "neutral",
            "PublishDate": 1763701133136,
            "Source": "corporate_action"
        },
        {
            "Title": "SPML Infra Allots 32.05 Lakh Equity Shares Upon Warrant Conversion",
            "Summary": "SPML Infra Limited's Board approved allotment of 32,05,128 equity shares of Rs. 2 face value each upon conversion of warrants to Zoom Industrial Services Ltd and SPML India Ltd, a promoter group member. The warrants were converted at Rs. 118.56 per share including premium of Rs. 116.56 on preferential basis, completed in accordance with SEBI regulations.",
            "Sentiment": "positive",
            "PublishDate": 1763650121940,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra to Issue 11.44 Lakh Equity Shares to NARCL via Debt Conversion",
            "Summary": "SPML Infra Limited has called an Extraordinary General Meeting on December 10, 2025, to approve the issuance of 11,44,436 equity shares to National Asset Reconstruction Company Limited at Rs. 276 per share through debt-to-equity conversion worth Rs. 31.58 crores. The company also seeks approval for additional annual remuneration of Rs. 10 lakh to NARCL's nominee director, as part of maintaining NARCL's 12.5% shareholding requirement under their Master Restructuring Agreement.",
            "Sentiment": "neutral",
            "PublishDate": 1763451351304,
            "Source": "corporate_action"
        },
        {
            "Title": "SPML Infra Secures Rs 3,772 Cr New Water Projects, Expands into Battery Energy Storage Systems",
            "Summary": "SPML Infra Limited announced new water supply project orders worth Rs 3,772 crores from Rajasthan, Madhya Pradesh, Jharkhand and Tamil Nadu, alongside launching BESS manufacturing with exclusive 10-year technology partnership with Energy Vault. The company reported Q2FY26 revenue of Rs 198.6 crores with 10% EBITDA margins and completed Rs 346 crore preferential allotment including Rs 190 crore promoter contribution to strengthen operations and capitalize on growing water infrastructure opportunities.",
            "Sentiment": "positive",
            "PublishDate": 1763122427671,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra Reports Strong Q2 Results and Approves Preferential Share Issue to NARCL",
            "Summary": "SPML Infra Limited reported quarterly results with revenue from operations of Rs. 18,776.14 lakhs and profit after tax of Rs. 1,452.54 lakhs, while approving issuance of up to 11,44,436 equity shares to NARCL for debt conversion. The preferential issue will increase NARCL's shareholding from 13.10% to 14.46% and requires shareholder approval in a General Meeting.",
            "Sentiment": "positive",
            "PublishDate": 1763054703351,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra Secures ₹505 Crore Credit Facility for Project Acceleration",
            "Summary": "SPML Infra has secured a credit facility worth ₹505 crore. The company plans to use this funding to accelerate its projects and drive growth.",
            "Sentiment": "positive",
            "PublishDate": 1761741060184,
            "Source": "stock"
        },
        {
            "Title": "SPML Infra Seeks Shareholder Approval for Leadership Changes Through Postal Ballot",
            "Summary": "SPML Infra Limited has issued a postal ballot notice for remote e-voting on three key resolutions. The company seeks approval to appoint Abhinandan Sethi as Managing Director for five years from September 3, 2025, to September 2, 2030, with a fixed compensation of Rs. 2 crore annually plus variable pay of 1% of net profit if it exceeds the previous year. The ballot also proposes changing Subhash Chand Sethi's role from Chairman and Whole Time Director to Non-Executive Chairman and Director, and appointing Rajeev Kumar Jain as Independent Director for one year. The e-voting period runs from September 12 to October 11, 2025. Abhinandan Sethi, son of Subhash Chand Sethi, was previously the Chief Operating Officer and his status will revert to promoter category upon appointment as Managing Director.",
            "Sentiment": "neutral",
            "PublishDate": 1757593642515,
            "Source": "corporate_governance"
        },
        {
            "Title": "SPML Infra Secures ₹1,438 Crore Water Infrastructure Project in Rajasthan",
            "Summary": "SPML Infra Limited has been awarded a ₹1,438 crore project in joint venture with JWIL Infra Limited from the Public Health Engineering Department in Bharatpur, Rajasthan. SPML holds a 51% stake in the joint venture. The project is part of the Jal Jeevan Mission and aims to provide safe drinking water to more than 1.5 million residents of Dholpur and Saipau block. The scope includes construction of intake wells, raw water reservoirs, 712 kilometers of pipelines, 21 elevated service reservoirs, water treatment plants, and functional household tap connections. The project includes a 10-year operations and maintenance contract, with the EPC portion scheduled for completion in 20 months. The agreement was executed on September 6, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1757299774243,
            "Source": "order&deals"
        },
        {
            "Title": "SPML Infra Reports Mixed Q1 Results with Revenue Decline but Improved Margins; Eyes BESS Expansion",
            "Summary": "SPML Infra Limited reported quarterly results with revenue declining to Rs. 172.9 crore from Rs. 200.7 crore in the previous quarter, while EBITDA improved to Rs. 24.3 crore and PAT reached Rs. 12.2 crore. The company maintained EBITDA margins at 14% and PAT margins at 7%. Management attributed the softer performance to heavy rainfall impacting project execution. The company holds an order book worth Rs. 4,500 crore, including Rs. 2,500 crore in new orders and expects to convert Rs. 2,200 crore worth of L1 positions by October. SPML Infra is entering the Battery Energy Storage Systems market through a partnership with Energy Vault, setting up a manufacturing facility in Pune with 2.5 GW capacity planned by Q1 FY27. The company targets annual order inflows of Rs. 4,000-5,000 crore and expects BESS segment to contribute significantly from FY27, aiming for equal revenue contribution from water and power segments by 2029-30.",
            "Sentiment": "neutral",
            "PublishDate": 1756204937156,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra Wins Rs. 1,073 Crore Water Supply Contract from Indore Municipal Corporation",
            "Summary": "SPML Infra Limited has been awarded a Rs. 1,073 crore project by Indore Municipal Corporation for augmenting the city's water supply system under the AMRUT 2.0 scheme. The project includes construction of a 1,650 MLD capacity intake facility, a 400 MLD water treatment plant, clear water booster pumping stations, 22 kilometers of pipeline, and a 132/33 kv power substation. The contract also includes a 10-year operation and maintenance agreement. The EPC portion is scheduled for completion within 30 months. The project aims to provide reliable water access to Indore's over 2 million citizens. Chairman Subhash Sethi highlighted that this demonstrates the company's capability to deliver integrated water infrastructure systems.",
            "Sentiment": "positive",
            "PublishDate": 1755571531244,
            "Source": "order&deals"
        },
        {
            "Title": "SPML Infra Reschedules Q1 FY26 Earnings Call to August 20, 2025",
            "Summary": "SPML Infra Limited has rescheduled its earnings conference call to discuss financial performance for the quarter ended June 30, 2025. The call will now take place on Wednesday, August 20, 2025 at 12:30 P.M. IST. The rescheduling was done to comply with SEBI regulations requiring prior intimation of 2 working days before the call. The company had previously sent letters on August 8, 2025 and August 14, 2025 regarding the earnings conference call with investors and analysts. The call details will be made available on the company's website at https://www.spml.co.in/. Management participants include Mr. Manoj Digga (Executive Director Commercial and Chief Financial Officer), Mr. Vikas Sharma (VP Finance & Accounts), and Mr. Samir Patel (Chief of Technology & Operations, BESS).",
            "Sentiment": "neutral",
            "PublishDate": 1755356569152,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra Reports Decline in Q1 Net Profit and Revenue",
            "Summary": "SPML Infra reported a net profit of 122 million rupees for Q1, down from 130 million rupees in the same period last year. The company's revenue also declined to 1.6 billion rupees compared to 2.1 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "negative",
            "PublishDate": 1755097942685,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra Reports Q1 FY2026 Results, Appoints New Secretarial Auditors and Sets AGM Date",
            "Summary": "SPML Infra Limited's Board approved quarterly financial results for the period ended June 30, 2025. The company reported standalone revenue from operations of Rs. 15,591.25 lakhs and profit after tax of Rs. 1,215.10 lakhs. On consolidated basis, revenue from operations was Rs. 15,591.25 lakhs with profit after tax of Rs. 1,211.74 lakhs. The Board appointed M/s. MKB & Associates as Secretarial Auditors for five consecutive years from FY 2025-26 to FY 2029-30, subject to shareholder approval. The company scheduled its 44th Annual General Meeting for September 24, 2025, to be conducted through video conferencing. Other income included Rs. 350.86 lakhs profit from land and building sales and Rs. 903.69 lakhs from deferred revenue adjustments related to the Master Restructuring Agreement with NARCL. The company also granted 156,771 stock options under its Employee Stock Option Scheme 2021.",
            "Sentiment": "positive",
            "PublishDate": 1755097309091,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra Submits Q1 FY2026 Monitoring Report for Preferential Issue Fund Utilization",
            "Summary": "SPML Infra Limited submitted a monitoring agency report by ICRA Ltd for fund utilization from its preferential allotment for the quarter ended June 30, 2025. The company raised Rs 292.58 crore through preferential issue of equity shares and warrants at Rs 215 per share, revised down from the original Rs 300 crore due to under-subscription of equity shares. ICRA reported no deviation from the stated objects of the issue. The funds are allocated for margin money (Rs 121.908 crore), working capital (Rs 97.527 crore), and general corporate purposes (Rs 73.145 crore). During the quarter, Rs 71.141 crore was utilized, with Rs 27.016 crore used for working capital and Rs 4.5 crore for loan repayment to NARCL. The company has Rs 221.439 crore in unutilized proceeds, with Rs 80.977 crore in monitoring account and Rs 25 crore in fixed deposits. All objects remain on schedule with a 24-month completion timeline.",
            "Sentiment": "neutral",
            "PublishDate": 1755080229522,
            "Source": "corporate_action"
        },
        {
            "Title": "SPML Infra Schedules Q1 FY 2025-26 Earnings Call for August 14",
            "Summary": "SPML Infra Limited has scheduled an earnings conference call for analysts and institutional investors on August 14, 2025 at 3:00 PM IST to discuss the company's Q1 FY 2025-26 financial results for the quarter ended June 30, 2025. The call will be led by key management including Executive Director Commercial and CFO Manoj Digga, Chief of Technology & Operations BESS Samir Patel, and VP Finance & Accounts Vikas Sharma. Participants can join through pre-registration or dial-in numbers with operator assistance.",
            "Sentiment": "neutral",
            "PublishDate": 1754641897605,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra Secures ₹385 Crore Water Infrastructure Contract in Rajasthan",
            "Summary": "SPML Infra has been awarded a contract worth ₹385 crore for a water infrastructure project in Rajasthan. The project is part of the Jal Jeevan Mission, which aims to improve water supply infrastructure. This contract represents a significant order for the company in the water management sector.",
            "Sentiment": "positive",
            "PublishDate": 1752202102000,
            "Source": "default"
        },
        {
            "Title": "SPML Infra Secures ₹205 Crore Credit Facility",
            "Summary": "SPML Infra has received a credit facility of ₹205 Crore. This financial boost is expected to enhance the company's project execution capabilities.",
            "Sentiment": "positive",
            "PublishDate": 1751883402000,
            "Source": "default"
        },
        {
            "Title": "SPML Infra Secures Land for BESS Manufacturing Facility",
            "Summary": "SPML Infra has been allotted 99,000 square meters of land by MIDC (Maharashtra Industrial Development Corporation) in Ahmednagar. The company plans to use this land to establish a manufacturing facility for Battery Energy Storage Systems (BESS).",
            "Sentiment": "positive",
            "PublishDate": 1749437254000,
            "Source": "default"
        },
        {
            "Title": "SPML Infra Secures Order Worth 258 Crore Rupees",
            "Summary": "SPML Infra has won a new order valued at 258 crore rupees. The news brief does not provide any additional details about the nature of the order, the client, or the project timeline.",
            "Sentiment": "positive",
            "PublishDate": 1748853990000,
            "Source": "default"
        },
        {
            "Title": "SPML Infra Reports Q4 Financial Results",
            "Summary": "SPML Infra has reported its Q4 financial results. The company's net profit for the quarter was 118 million rupees, compared to 173 million rupees year-over-year and 104 million rupees quarter-over-quarter. Revenue for Q4 was 1.89 billion rupees, down from 4.63 billion rupees in the same quarter of the previous year.",
            "Sentiment": "negative",
            "PublishDate": 1748532465000,
            "Source": "result"
        },
        {
            "Title": "SPML Infra to Deploy Energy Storage Solutions with Energy Vault",
            "Summary": "SPML Infra has announced plans to deploy a minimum of 500 MWh of energy storage capacity in the next 12 months, with a long-term goal of 30-40+ GWh over the next decade. The company will utilize Energy Vault's B-VAULT technology and VAULTOS EMS software to address India's energy needs.",
            "Sentiment": "positive",
            "PublishDate": 1743651109000,
            "Source": "corporate_action"
        },
        {
            "Title": "SPML Infra Partners with Energy Vault for Grid-Scale BESS Rollout in India",
            "Summary": "SPML Infra has entered into an exclusive collaboration with Energy Vault to implement grid-scale Battery Energy Storage Systems (BESS) in India. This partnership aims to contribute to India's energy revolution by enhancing the country's power infrastructure with advanced energy storage solutions. The collaboration signifies SPML Infra's strategic move into the growing renewable energy sector and energy storage market in India.",
            "Sentiment": "positive",
            "PublishDate": 1743649158000,
            "Source": "corporate_action"
        },
        {
            "Title": "Energy Vault Holdings Inc. Secures Agreement with SPML Infra",
            "Summary": "Energy Vault Holdings Inc. has entered into an agreement with SPML Infra that is expected to positively impact revenue, gross margin, and cash in Q1 and Q2 of 2025. The deal involves delivering an initial 500 MWh capacity worth approximately $100 million within 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1743599504000,
            "Source": "order&deals"
        },
        {
            "Title": "Energy Vault and SPML Infra Sign 10-Year Agreement for Battery Energy Storage Technology",
            "Summary": "Energy Vault has entered into a 10-year licensee and royalty agreement with SPML Infra for the manufacturing and deployment of the B-VAULT battery energy storage technology platform in India. The agreement covers over 30 GWh of energy storage capacity, signaling a significant commitment to expanding energy storage solutions in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1743599497000,
            "Source": "corporate_action"
        },
        {
            "Title": "SPML Infra Enters Battery Energy Storage System Sector",
            "Summary": "SPML Infra has approved its entry into the Battery Energy Storage System (BESS) sector. This strategic move indicates the company's expansion into renewable energy technologies and energy storage solutions.",
            "Sentiment": "positive",
            "PublishDate": 1743154146000,
            "Source": "corporate_action"
        },
        {
            "Title": "SPML Infra Signs INR 617.98 Crore Agreement with Water Resource Department, Ranchi",
            "Summary": "SPML Infra Limited has entered into an agreement with the Water Resource Department in Ranchi. The contract is valued at INR 617.98 crore (approximately $74.5 million USD). This agreement likely involves water infrastructure development or management projects in the Ranchi area.",
            "Sentiment": "positive",
            "PublishDate": 1741583801000,
            "Source": "order&deals"
        },
        {
            "Title": "SPML Infra Reports Significant Profit Increase in Q3",
            "Summary": "SPML Infra has reported a substantial increase in net profit for the third quarter. The company's net profit rose to 104.1 million rupees, compared to 10 million rupees in the same quarter last year and 140 million rupees in the previous quarter. However, the company's revenue decreased to 1.85 billion rupees from 2.5 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739492189000,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra Reports Q3 Financial Results",
            "Summary": "SPML Infra announced its Q3 financial results. The company reported a net profit of 104.1 million rupees, showing a significant increase from 10 million rupees in the same quarter last year. However, revenue decreased to 1.85 billion rupees from 2.5 billion rupees year-over-year. Compared to the previous quarter, net profit increased from 140 million rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1739465272000,
            "Source": "earnings"
        },
        {
            "Title": "SPML Infra Reports Significant Q2 EBITDA Growth",
            "Summary": "SPML Infra has reported a substantial increase in its Q2 EBITDA, rising from 21 million rupees to 138 million rupees year-over-year. The company's EBITDA margin also improved significantly, increasing from 0.85% to 7.32% compared to the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1731317155000,
            "Source": "result"
        },
        {
            "Title": "SPML Infra Reports Decline in Q2 Revenue",
            "Summary": "SPML Infra, an infrastructure development company, has reported a decrease in its second quarter revenue. The company's revenue for Q2 stood at 1.88 billion rupees, down from 2.53 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1731317081000,
            "Source": "result"
        },
        {
            "Title": "SPML Infra Reports Significant Profit Increase in Q2",
            "Summary": "SPML Infra has reported a substantial increase in net profit for the second quarter. The company's net profit rose to 140 million rupees, up from 5.3 million rupees in the same period last year, marking a significant year-over-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1731317029000,
            "Source": "result"
        }
    ]
}