{
    "Symbol": "SPORTKING",
    "ISIN": "INE885H01029",
    "News": [
        {
            "Title": "Sportking India Q3 FY26 Results Show Strong Growth",
            "Summary": "Sportking India reported 33% growth in PAT to Rs. 25 crores for Q3 FY26, with revenue reaching Rs. 646 crores. EBITDA improved to Rs. 66 crores with 10% margin.",
            "Sentiment": "positive",
            "PublishDate": 1770662391095,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sportking India Board Meet Set for Feb 7, 2026",
            "Summary": "Sportking India Limited has scheduled a board meeting for February 07, 2026, to consider and approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770028166758,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sportking India Reports Mixed Q2 FY26 Results with Revenue Decline Despite Volume Growth",
            "Summary": "Sportking India achieved revenue of INR 627.4 crores in Q2 FY26 with gross profit margin expansion to 24.1%, though overall revenue declined 4% year-on-year despite 12% volume growth due to lower yarn spreads. The company maintained high capacity utilization at 96% and saw export growth of 11% to INR 334.2 crores, while progressing on its Odisha expansion project expected to break ground in 30-40 days.",
            "Sentiment": "neutral",
            "PublishDate": 1763463899309,
            "Source": "earnings"
        },
        {
            "Title": "Sportking India Reports 11% YoY Export Growth in Q2FY26, Announces ₹1,000 Crore Greenfield Expansion",
            "Summary": "Sportking India Limited reported quarterly revenue of ₹627 crores with exports contributing 53% of total revenue. The company achieved 11% year-on-year growth in export business and maintained capacity utilization levels at 95-96%. Profit after tax stood at ₹28 crores for the quarter. The company announced a greenfield expansion project worth approximately ₹1,000 crores to add 1.50 lakh spindles in Odisha, representing a 40% increase over existing capacity of 3.79 lakh spindles. The expansion is expected to be completed in 12-15 months and will be funded through term loans and internal accruals. Additionally, the company received in-principle approval for merger of Marvel Dyers and Processors Pvt Ltd and manufacturing facilities of Sobhagia Sales Pvt Ltd to enable forward integration into processed fabrics and garments.",
            "Sentiment": "positive",
            "PublishDate": 1762932518244,
            "Source": "earnings"
        },
        {
            "Title": "Sportking India Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Sportking India Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company reported revenue from operations of Rs 627.39 lakhs for the quarter compared to Rs 580.86 lakhs in the previous quarter. For the half year, revenue stood at Rs 1,213.18 lakhs versus Rs 1,285.60 lakhs in the corresponding previous period. The company recorded a profit after tax of Rs 734.82 lakhs for the quarter and Rs 2,904.48 lakhs for the half year. The Board of Directors approved these results in their meeting held on November 11, 2025. The company operates as a single segment textile business and has changed its accounting policy for raw material valuation from FIFO to weighted average basis during the current period. The results were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1762877182945,
            "Source": "earnings"
        },
        {
            "Title": "Sportking India Reports Fire Incident at Bathinda Manufacturing Unit",
            "Summary": "Sportking India Limited experienced a fire incident at its manufacturing unit located at Village Jeeda, Kotkapura Road, Bathinda. The fire occurred in the company's godown used for storing raw cotton bales, which serve as raw materials for manufacturing. The local Fire Department authorities and the company's internal team brought the fire under control using in-house firefighting systems. No human casualties or injuries were reported. The godown and stock at the affected location are adequately insured, and the company has notified the insurance company about the incident. An insurance survey is expected to be conducted. The company is currently assessing the full extent of damage caused, and no impact on production or operations is expected.",
            "Sentiment": "neutral",
            "PublishDate": 1762836118205,
            "Source": "stock"
        },
        {
            "Title": "Sportking India Reports 10.5% PAT Growth, Announces INR 1,000 Crore Expansion in Odisha",
            "Summary": "Sportking India Limited reported quarterly results with revenue from operations of INR 585.80 crores and profit after tax of INR 35.2 crores, marking a 10.5% year-on-year increase. The company achieved gross profit of INR 157.2 crores with 2.1% growth and gross margin expansion of 254 basis points to 26.8%. EBITDA stood at INR 70.5 crores with margin expansion to 12%. Export share increased to 58% from 47% in the previous year, with exports growing 18% year-on-year at INR 341 crores. The company operates at 95% capacity utilization. Management announced a significant expansion plan involving INR 1,000 crore CAPEX to add 150,000 spindles in Odisha, representing 40% capacity increase over existing 3.8 lakh spindles. The new facility is expected to generate INR 1,000-1,200 crores revenue and improve overall company EBITDA margins by 200-300 basis points. The project timeline is 12-15 months with funding through internal accruals and term loans. The company also plans to integrate apparel manufacturing and dye house operations within 6-8 months, expected to add INR 200 crores to top line. Management noted challenges from US tariff uncertainties and rising Indian cotton prices but expressed confidence in business fundamentals.",
            "Sentiment": "positive",
            "PublishDate": 1754724861637,
            "Source": "earnings"
        },
        {
            "Title": "Sportking India Sets Record Date for Rs.1 Final Dividend, Announces Book Closure Period",
            "Summary": "Sportking India Limited has set August 23, 2025 as the record date for determining shareholder eligibility for a final dividend of Rs.1 per equity share for the financial year ended March 31, 2025. The Board of Directors recommended this dividend at their meeting held on May 1, 2025, subject to shareholder approval at the Annual General Meeting. The company's Register of Members and Share Transfer Books will be closed from August 24 to August 30, 2025. The 36th Annual General Meeting is scheduled for August 30, 2025 at 10:30 A.M. at the company's registered office.",
            "Sentiment": "positive",
            "PublishDate": 1754383685607,
            "Source": "corporate_action"
        },
        {
            "Title": "Sportking India Reports 10% PAT Growth in Q1 FY26, Announces ₹1,000 Crore Expansion Plan",
            "Summary": "Sportking India Limited reported revenue of ₹586 crores in Q1 FY26, with profit after tax increasing 10% year-on-year to ₹35 crores. The company achieved a gross margin of 27% and EBITDA margin of 12%. Export business contributed 58% to total revenue, with the company maintaining capacity utilization above 95%. The board approved a greenfield expansion project worth approximately ₹1,000 crores to add 1.50 lakh spindles in Odisha, representing a 40% increase over existing capacity of 3.79 lakh spindles. The expansion is expected to be completed in 12-15 months and will be funded through term loans and internal accruals. The company also received in-principle approval for merger of Marvel Dyers and Processor Pvt Ltd and Sobhagia Sales Pvt Ltd to enable forward integration into fabrics and garments.",
            "Sentiment": "positive",
            "PublishDate": 1754300774323,
            "Source": "earnings"
        },
        {
            "Title": "Sportking India Reports 10.4% Profit Growth, Announces ₹1,000 Crore Expansion Plan",
            "Summary": "Sportking India Limited reported quarterly results with revenue from operations at ₹585.8 crores, down 7.6% year-over-year. The textile company achieved profit after tax of ₹35.2 crores, marking a 10.4% increase compared to the same period last year. PAT margin expanded to 6.0% from 5.0% previously. EBITDA stood at ₹70.5 crores with margin improving to 12.0%. Export sales contributed approximately 58% to overall revenue and grew 18% year-over-year. The company announced a greenfield expansion project to add 1.50 lakh spindles in Odisha, representing a 40% increase over existing capacity. The expansion will cost approximately ₹1,000 crores and is expected to complete in 12-15 months. Total production volume reached 20,907 MT with capacity utilization at 95%. Chairman Munish Avasthi highlighted strong export growth and margin expansion despite global uncertainties, noting the India-UK Free Trade Agreement as providing duty-free access to UK markets.",
            "Sentiment": "positive",
            "PublishDate": 1754157930753,
            "Source": "earnings"
        },
        {
            "Title": "Sportking India Revises Solar Investment Plan, Increases Stake to Rs. 14.10 Crores",
            "Summary": "Sportking India Limited has revised its investment plan for solar power supply. The company will now invest 26% amounting to Rs. 14.10 Crores in Evincea Renewable Seven Private Limited, instead of the previously announced Evincea Renewable Two Private Limited. The investment amount has increased from the earlier Rs. 12.09 Crores due to higher total project costs. The change in investment entity was made due to legal and regulatory considerations. The Special Purpose Vehicle is engaged in solar power generation and supply for Sportking's facilities in Punjab. The investment is expected to be completed by March 2026 and will be made through cash consideration. The SPV was incorporated on June 3, 2024, and the investment is required under the Electricity Act as Sportking will be a captive user of the solar power.",
            "Sentiment": "neutral",
            "PublishDate": 1754157003562,
            "Source": "stock"
        },
        {
            "Title": "Sportking India Approves Rs 1,000 Crore Greenfield Expansion and Key Board Appointments",
            "Summary": "Sportking India Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, and announced a major Greenfield expansion project in Odisha. The company plans to install 1.50 lakh spindles with an estimated investment of Rs 1,000 crores, to be funded through term loans and internal accruals. The expansion is expected to be completed in 12-15 months and will increase capacity from the existing 3.79 lakh spindles operating at above 95% utilization. The Board also approved several key appointments: Mr. Puneet Singhania as Independent Director for five years, re-appointment of Mrs. Harpreet Kang as Independent Director for a second five-year term, re-appointment of Mr. Munish Avasthi as Managing Director and CEO for three years, and appointment of Mr. Chetan Rupal as Whole-time Director for three years. Additionally, M/s Sunny Kakkar & Associates was appointed as Secretarial Auditor for five years. The company scheduled its 36th Annual General Meeting for August 30, 2025, with book closure from August 24-30, 2025, and fixed August 23, 2025 as the record date for dividend eligibility.",
            "Sentiment": "positive",
            "PublishDate": 1754141734090,
            "Source": "corporate_action"
        },
        {
            "Title": "Sportking India Reports Q1 Revenue of ₹585.80 Crores with Net Profit of ₹35.15 Crores",
            "Summary": "Sportking India Limited's Board approved quarterly financial results for the quarter ended June 30, 2025. The textile company reported revenue from operations of ₹585.80 crores compared to ₹634.05 crores in the same quarter last year. Total income including other income reached ₹597.76 crores versus ₹640.82 crores in the previous year quarter. Net profit for the quarter stood at ₹35.15 crores, up from ₹31.83 crores in the corresponding quarter last year. Basic and diluted earnings per share was ₹2.77 compared to ₹2.50 in the same quarter of the previous year. Total expenses decreased to ₹550.22 crores from ₹597.28 crores year-over-year. The company operates as a single segment textile business and has no subsidiary, associate, or joint venture companies. The Board meeting was held on August 2, 2025, and the results were reviewed by the Audit Committee.",
            "Sentiment": "neutral",
            "PublishDate": 1754139999221,
            "Source": "earnings"
        },
        {
            "Title": "Sportking India Reports Q4 FY23 Results and Dividend",
            "Summary": "Sportking India announced its Q4 financial results. Net profit increased to 361.2 million rupees, up from 229 million rupees year-over-year and 162.9 million rupees quarter-over-quarter. Revenue rose to 6.29 billion rupees from 6 billion rupees in the same quarter last year. The company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746144671000,
            "Source": "default"
        },
        {
            "Title": "Sportking India Reports Q4 Results and Declares Dividend",
            "Summary": "Sportking India has announced its Q4 financial results, showing improved performance year-over-year. The company reported a revenue of 6.29 billion rupees, up from 6 billion rupees in the previous year. EBITDA increased to 743.5 million rupees from 671 million rupees, with the EBITDA margin improving to 11.82% from 10.98%. Net profit rose significantly to 361.2 million rupees, compared to 229 million rupees in the same quarter last year. Additionally, the company has recommended a final dividend of 1 rupee per equity share.",
            "Sentiment": "positive",
            "PublishDate": 1746105495000,
            "Source": "result"
        },
        {
            "Title": "Sportking India Reports Q2 Financial Results",
            "Summary": "Sportking India has announced its Q2 financial results. The company's net profit increased to 250 million from 155 million year-over-year. Revenue also saw a rise, reaching 6.5 billion compared to 6.28 billion in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1729935550000,
            "Source": "result"
        }
    ]
}