{
    "Symbol": "SRD",
    "ISIN": "INE01NE01012",
    "News": [
        {
            "Title": "Shankar Lal Rampal Dye-Chem Approves ₹1.75 Cr Property Buy",
            "Summary": "Shankar Lal Rampal Dye-Chem Limited's board approved acquisition of immovable property worth up to ₹1.75 crore on January 12, 2026, superseding earlier approval for lower amount.",
            "Sentiment": "positive",
            "PublishDate": 1768220141777,
            "Source": "co_actions_results"
        },
        {
            "Title": "Shankar Lal Rampal Dye-Chem Reports Quarterly Results for Period Ended September 30, 2025",
            "Summary": "Shankar Lal Rampal Dye-Chem Limited's Board approved unaudited financial results for the quarter and half-year ended September 30, 2025, along with related party transaction reports and property acquisition approvals below Rs. 1 crore. The company, engaged in dyes and chemicals trading business, also noted the updated status of dividend distribution as approved in their Annual General Meeting dated September 27, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1763060229675,
            "Source": "earnings"
        },
        {
            "Title": "Shankar Lal Rampal Dye-Chem Resubmits Quarterly Results Due to Clerical Error",
            "Summary": "Shankar Lal Rampal Dye-Chem Limited is resubmitting its unaudited financial results for the quarter ended June 30, 2025, due to a clerical oversight in documentation. The initial submission was presented as an extract instead of the full financial results format. The company clarified that there is no change to the financial information or its integrity, and the resubmission is being done as a prudent measure following guidance from BSE. The original results contained complete financial information along with the Limited Review Report from statutory auditors. Company Secretary Aditi Babel signed the resubmission communication on July 29, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753777316552,
            "Source": "earnings"
        },
        {
            "Title": "Shankar Lal Rampal Dye-Chem Reports 20% Profit Growth and 23.34% Revenue Increase in Q1",
            "Summary": "Shankar Lal Rampal Dye-Chem reported quarterly results showing profit growth of 20% year-over-year and revenue growth of 23.34% year-over-year for Q1. The company demonstrated strong financial performance across both key metrics during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1753709918116,
            "Source": "earnings"
        }
    ]
}