{
    "Symbol": "SREEL",
    "ISIN": "INE099F01013",
    "News": [
        {
            "Title": "Sreeleathers Declares ₹1 Interim Dividend",
            "Summary": "Sreeleathers Limited announces interim dividend of ₹1 per equity share for FY 2025-26 with record date February 13, 2026. Company provides tax deduction guidelines for shareholders.",
            "Sentiment": "positive",
            "PublishDate": 1770636817591,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sreeleathers Board Meet Set for Feb 6 to Review Q3 Results",
            "Summary": "Sreeleathers Limited has scheduled a board meeting on February 6, 2026, to consider Q3FY26 unaudited financial results and potential interim dividend declaration for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769873488004,
            "Source": "co_actions_results"
        },
        {
            "Title": "Sreeleathers Limited Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Sreeleathers Limited's Board approved unaudited standalone financial results for the quarter and half year ended September 30, 2025, showing total income of Rs. 7,495.65 lakhs for the quarter and Rs. 12,520.29 lakhs for the half year. The company reported profit before tax of Rs. 1,550.67 lakhs for the half year period, with the results being reviewed by auditors and taken on record by the Board of Directors.",
            "Sentiment": "positive",
            "PublishDate": 1763145200712,
            "Source": "earnings"
        },
        {
            "Title": "Sreeleathers Reports Mixed Q1 Results with Revenue Growth but Profit Decline",
            "Summary": "Sreeleathers reported Q1 revenue of 498 million rupees, up from 487 million rupees in the same period last year. However, the company's profitability declined with net profit falling to 29 million rupees from 46 million rupees year-over-year. EBITDA dropped to 40 million rupees compared to 67 million rupees in the previous year, while EBITDA margin compressed to 7.97% from 13.72% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1755188562034,
            "Source": "earnings"
        },
        {
            "Title": "Sreeleathers Limited Voluntarily Delists from Calcutta Stock Exchange",
            "Summary": "Sreeleathers Limited has voluntarily delisted its equity shares from the Calcutta Stock Exchange (CSE) effective July 21, 2025. The delisting was granted by CSE through their letter dated July 18, 2025. The company will continue to remain listed on BSE Limited and the National Stock Exchange of India Limited, maintaining its presence on stock exchanges with nationwide trading terminals.",
            "Sentiment": "neutral",
            "PublishDate": 1753272598484,
            "Source": "corporate_action"
        },
        {
            "Title": "SREELEATHERS Reports Decline in Q3 EBITDA and Margin",
            "Summary": "SREELEATHERS has reported a decrease in its Q3 EBITDA, which fell to 87 million rupees from 97 million rupees year-over-year. The company's Q3 EBITDA margin also declined to 15.72% from 16.63% compared to the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1739366694000,
            "Source": "earnings"
        },
        {
            "Title": "Sreeleathers Reports Q3 Financial Results",
            "Summary": "Sreeleathers has announced its Q3 financial results. The company reported a net profit of 62 million rupees, down from 69 million rupees year-over-year and 64 million rupees quarter-over-quarter. Revenue for Q3 stood at 554 million rupees, compared to 582 million rupees in the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1739366601000,
            "Source": "earnings"
        }
    ]
}