{
    "Symbol": "SRF",
    "ISIN": "INE647A01010",
    "News": [
        {
            "Title": "SRF faces ₹38.49 cr customs duty demand from Chennai",
            "Summary": "SRF Limited receives customs duty and penalty demand of ₹38.49 crores from Commissioner of Customs, Chennai-II over alleged wrong HSN classification of imports. Company plans to contest the demand.",
            "Sentiment": "negative",
            "PublishDate": 1769086778460,
            "Source": "stocks"
        },
        {
            "Title": "SRF Q3 revenue misses estimates amid specialty woes",
            "Summary": "SRF's Q3 consolidated revenue at ₹3,713 crore missed consensus estimates of ₹3,800 crore, with specialty chemicals facing Chinese pricing pressure despite fluorochemicals showing solid performance.",
            "Sentiment": "negative",
            "PublishDate": 1768991285196,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRF Offers TDS Relief on Dividend Payments",
            "Summary": "SRF Limited provides shareholders facility to submit documents for lower or nil TDS deduction on dividend payments, with submission deadline set for January 29, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768989242331,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRF Q3FY26: Revenue up 6.3% YoY; Hold rating maintained",
            "Summary": "SRF reported consolidated revenue of ₹37.1bn in Q3FY26, up 6.3% YoY. Chemicals segment drove growth with 22% YoY rise, while Performance Films declined 3% YoY amid competitive pressures.",
            "Sentiment": "neutral",
            "PublishDate": 1768983379005,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRF shares drop 6% on Chinese competition concerns",
            "Summary": "SRF Ltd shares fell 6% after management cited persistent pressure from Chinese competitors. Major brokerages maintain negative outlook with downside targets up to 24.5%.",
            "Sentiment": "negative",
            "PublishDate": 1768977335782,
            "Source": "co_actions_results"
        },
        {
            "Title": "Morgan Stanley Sets ₹2,177 Target for SRF",
            "Summary": "Morgan Stanley maintains underweight rating on SRF with a target price of ₹2,177, indicating cautious outlook on the chemical company's stock performance.",
            "Sentiment": "negative",
            "PublishDate": 1768967202780,
            "Source": "stocks"
        },
        {
            "Title": "Nuvama Maintains Buy Rating on SRF with Revised Target",
            "Summary": "Nuvama Securities maintains its Buy recommendation on SRF but reduces the target price to ₹3,584 from the previous target of ₹3,841, indicating continued confidence in the stock despite a downward price revision.",
            "Sentiment": "positive",
            "PublishDate": 1768967176511,
            "Source": "stocks"
        },
        {
            "Title": "Jefferies Upgrades SRF to Underperform, Sets ₹2,640 Target",
            "Summary": "Jefferies has issued an underperform rating on SRF with a target price of ₹2,640, indicating a cautious outlook on the specialty chemicals manufacturer's near-term prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768967146602,
            "Source": "stocks"
        },
        {
            "Title": "Citi Cuts SRF Target Price to ₹2,575, Maintains Sell",
            "Summary": "Citi Research has maintained its 'Sell' rating on SRF while reducing the target price to ₹2,575, reflecting the brokerage's cautious outlook on the specialty chemicals company's prospects.",
            "Sentiment": "negative",
            "PublishDate": 1768967122053,
            "Source": "stocks"
        },
        {
            "Title": "SRF Re-appoints Pramod Gujarathi as Safety Director",
            "Summary": "SRF Limited's board approves re-appointment of Mr. Pramod Gopaldas Gujarathi as Director (Safety & Environment) & Occupier for 3-year term from April 2026 to March 2029, subject to shareholder approval.",
            "Sentiment": "positive",
            "PublishDate": 1768904356482,
            "Source": "stocks"
        },
        {
            "Title": "SRF Re-appoints Kartik Bharat Ram as Joint MD",
            "Summary": "SRF Limited's board re-appointed Kartik Bharat Ram as Joint Managing Director for a five-year term from June 2026 to March 2031, subject to shareholder approval at the upcoming AGM.",
            "Sentiment": "positive",
            "PublishDate": 1768904173407,
            "Source": "stocks"
        },
        {
            "Title": "SRF Limited Appoints Samir Kashyap as New CFO",
            "Summary": "SRF Limited announced the appointment of Mr. Samir Kashyap as President & Chief Financial Officer, effective January 27, 2026. Kashyap brings over 30 years of experience including CFO roles at Meta, SAP, and Genpact.",
            "Sentiment": "positive",
            "PublishDate": 1768903550045,
            "Source": "stocks"
        },
        {
            "Title": "SRF Approves ₹180 Cr Pharma Plant in Dahej",
            "Summary": "SRF Limited has approved establishment of a new pharmaceutical intermediates manufacturing plant in Dahej with an investment of ₹180 crores, marking expansion into pharma sector.",
            "Sentiment": "positive",
            "PublishDate": 1768903437554,
            "Source": "stocks"
        },
        {
            "Title": "SRF Declares 2nd Interim Dividend of ₹5 Per Share",
            "Summary": "SRF Limited announces second interim dividend at 50% (₹5.00 per share) for FY26 with record date January 27, 2026. Payment scheduled on or before February 17, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768903023389,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRF Reports 58.7% Jump in Q3 Consolidated Net Profit",
            "Summary": "SRF Limited delivered strong Q3 performance with consolidated net profit rising 58.7% year-on-year to ₹4.30 billion, surpassing analyst estimates of ₹3.81 billion.",
            "Sentiment": "positive",
            "PublishDate": 1768902421559,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRF Board Meeting Set for Jan 20 to Review Q3 Results",
            "Summary": "SRF Limited has scheduled a board meeting on January 20, 2026, to discuss Q3FY26 unaudited financial results and consider a proposal for the second interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1768310145615,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRF Ltd Sees ₹15.47 Cr NSE Block Trade at ₹3090.80",
            "Summary": "SRF Ltd witnessed a significant block trade on NSE worth ₹15.47 crores involving approximately 50,063 shares executed at ₹3090.80 per share, indicating institutional interest in the chemical company's stock.",
            "Sentiment": "neutral",
            "PublishDate": 1767775327582,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRF Faces ₹15.76 Cr CGST Demand for ITC Reversal",
            "Summary": "SRF Limited received a CGST demand of ₹15.76 crores from Dehradun authorities for Input Tax Credit reversal related to exempted supply and supplier non-compliance. Company plans to contest the demand.",
            "Sentiment": "negative",
            "PublishDate": 1767090180964,
            "Source": "stocks"
        },
        {
            "Title": "India imposes anti-dumping duties on Chinese imports",
            "Summary": "India imposed anti-dumping duties on Chinese steel products and R134A refrigerant gas, with duties up to $5,251 per tonne on refrigerant gas for five years to protect domestic manufacturers from unfair pricing.",
            "Sentiment": "neutral",
            "PublishDate": 1766732160863,
            "Source": "stocks"
        },
        {
            "Title": "SRF Wins Tax Case, Saves ₹99 Crores on Carbon Credits",
            "Summary": "SRF Limited receives favorable litigation update on Carbon Emission Reduction Certificates treatment, resulting in approximately ₹99 crores reduction in tax liability for assessment years 2011-12 and 2013-14.",
            "Sentiment": "positive",
            "PublishDate": 1765871102277,
            "Source": "stocks"
        },
        {
            "Title": "SRF Limited Grants 2.32 Lakh Employee Stock Options Under 2018 Incentive Plan",
            "Summary": "SRF Limited's Nomination and Remuneration Committee approved the grant of 2,32,810 employee stock options under Part A of the SRF Employees Stock Option Scheme, 2018, offered at a 40% discount to current market price. The options will be issued in 1:1 ratio for Rs. 10 equity shares each and can be exercised within one year of vesting, subject to payment of exercise price and applicable taxes.",
            "Sentiment": "positive",
            "PublishDate": 1764078862350,
            "Source": "corporate_action"
        },
        {
            "Title": "SRF Reports 68% Year-Over-Year Growth in CO Exports for October 2025",
            "Summary": "SRF reported a 68% year-over-year increase in CO exports for October 2025.",
            "Sentiment": "positive",
            "PublishDate": 1762834438984,
            "Source": "stock"
        },
        {
            "Title": "SRF Plans Demerger of Performance Films Business After Reaching ₹1,000-1,200 Crore EBITDA Target",
            "Summary": "SRF Ltd. will consider demerging its performance films and foils business once it achieves annual EBITDA of ₹1,000-1,200 crore, according to Chairman and Managing Director Ashish Bharat Ram. The company operates three business verticals: chemicals, performance films, and technical textiles. Technical textiles serves as the cash generator, with proceeds currently funding growth in chemicals and packaging divisions. The performance films and foils business reported EBIT of ₹356 crore for the full financial year and ₹259 crore in the first half of financial year 2025. Management emphasized the trade-off between immediate value clarity from separation versus potential higher returns through internal capital redeployment. SRF shares closed 1.5% lower at ₹2,897, though the stock has gained 31% in 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1762484142434,
            "Source": "corporate_action"
        },
        {
            "Title": "Kotak Mahindra Mutual Fund Acquires Over 5% Stake in SRF Limited",
            "Summary": "Kotak Mahindra Mutual Fund has acquired equity shares in SRF Limited, crossing the 5% threshold of the company's issued equity share capital. The acquisition was made through the mutual fund's schemes via open market purchases on October 30, 2025. Following the acquisition, Kotak Mahindra Mutual Fund's total holding in SRF Limited increased to 14,853,579 shares, representing 5.0109% of the company's equity share capital. Prior to this acquisition, the fund held 14,814,248 shares or 4.9976% of SRF's equity. The acquisition of 39,331 additional shares pushed the holding above the 5% regulatory disclosure threshold. SRF Limited has a total equity share capital of 29,64,24,825 shares of Rs. 10 each.",
            "Sentiment": "neutral",
            "PublishDate": 1762190090631,
            "Source": "corporate_action"
        },
        {
            "Title": "SRF's Chemicals Division Targets Over 20% Growth for FY26",
            "Summary": "SRF's Chemicals Division expects growth exceeding 20% for FY26. The company anticipates improved or stable pricing along with higher volumes of refrigerant gases in the second half of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1761708205217,
            "Source": "stock"
        },
        {
            "Title": "SRF Secures ECMS Approval for ₹496 Crore Investment Project in Madhya Pradesh",
            "Summary": "SRF has received approval under the ECMS (Emergency Credit Line Guarantee Scheme) for an investment of ₹496 crore in Madhya Pradesh. The project is expected to generate production worth ₹1,311 crore and create 225 new jobs in the state.",
            "Sentiment": "positive",
            "PublishDate": 1761587367279,
            "Source": "stock"
        },
        {
            "Title": "SRF CFO to Step Down; Q2 EBITDA Rises to 7.74 Billion Rupees",
            "Summary": "SRF announced that its CFO will step down. The company reported Q2 EBITDA of 7.74 billion rupees, up from 5.44 billion rupees year-over-year, though below the estimated 8.37 billion rupees. EBITDA margin improved to 21.27% from 15.7% year-over-year, slightly missing the estimated 21.7%.",
            "Sentiment": "neutral",
            "PublishDate": 1761558449004,
            "Source": "corporate_governance"
        },
        {
            "Title": "SRF Reports Q2 Revenue of 36.4B Rupees, Net Profit Reaches 3.9B Rupees",
            "Summary": "SRF reported Q2 revenue of 36.4 billion rupees compared to 34.2 billion rupees in the same period last year, falling short of the estimated 38.52 billion rupees. The company's consolidated net profit increased to 3.9 billion rupees from 2 billion rupees year-over-year, though it missed the estimated 4.54 billion rupees.",
            "Sentiment": "neutral",
            "PublishDate": 1761557804811,
            "Source": "earnings"
        },
        {
            "Title": "SRF Schedules Quarterly Results Review for October 27",
            "Summary": "SRF has announced plans to review its quarterly results on October 27. The company will be examining its financial performance for the quarter during this scheduled review.",
            "Sentiment": "neutral",
            "PublishDate": 1760685693809,
            "Source": "earnings"
        },
        {
            "Title": "SRF Limited Faces Rs. 4.20 Crore Anti-Dumping Duty and Penalty Order, Plans to Contest",
            "Summary": "SRF Limited received an order from the Commissioner of Customs, Chennai-II imposing Anti-Dumping Duty of Rs. 3.04 crores on imported Adhesive Activated High Tenacity Polyester Yarn of 900D. The total financial impact including penalties and redemption fine amounts to Rs. 4.20 crores. The company had imported the yarn with nil anti-dumping duty, classifying it under 'Yarns having denier below 1000', but the authority rejected this assessment and imposed differential duty with applicable interest and penalty. SRF's management, based on legal advice, considers the demand legally untenable and plans to contest the order in appropriate legal forums.",
            "Sentiment": "negative",
            "PublishDate": 1759303940850,
            "Source": "stock"
        },
        {
            "Title": "DGTR Initiates Anti-Dumping Investigation on Chinese Polyester and Nylon Belting Fabric Imports",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has commenced an anti-dumping probe into imports of polyester or nylon belting fabric from China. This investigation relates to SRF, which appears to be connected to this trade remedy action.",
            "Sentiment": "neutral",
            "PublishDate": 1759116114831,
            "Source": "stock"
        },
        {
            "Title": "DGTR Imposes Anti-Dumping Duty on R-134A Imports from China, Affecting SRF",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has imposed anti-dumping duties on R-134A imports from China. This trade measure affects SRF, which operates in the refrigerant chemicals sector.",
            "Sentiment": "neutral",
            "PublishDate": 1759115681424,
            "Source": "stock"
        },
        {
            "Title": "DGTR Launches Sunset Review Investigation on HFC R-32 Imports from China, Affecting SRF",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has initiated a sunset review investigation concerning HFC R-32 imports from China. This investigation affects SRF, which operates in the chemicals sector. Sunset reviews are conducted to determine whether existing anti-dumping duties should be continued, modified, or terminated.",
            "Sentiment": "neutral",
            "PublishDate": 1758770183400,
            "Source": "stock"
        },
        {
            "Title": "DGTR Launches Anti-Dumping Investigation on R-125 HFC Imports from China Affecting SRF",
            "Summary": "The Directorate General of Trade Remedies (DGTR) has initiated an investigation into anti-dumping issues concerning R-125 HFC (hydrofluorocarbon) imports from China. This investigation relates to SRF, indicating potential concerns about unfair pricing practices in the refrigerant chemical market that could impact domestic manufacturers.",
            "Sentiment": "neutral",
            "PublishDate": 1758769797826,
            "Source": "stock"
        },
        {
            "Title": "SRF Limited Signs MoU with Tata Steel Special Economic Zone for Rs 282 Crore Land Acquisition",
            "Summary": "SRF Limited has entered into a Memorandum of Understanding with Tata Steel Special Economic Zone Limited on September 12, 2025. The agreement involves acquisition of land by way of sub-lease at Gopalpur, District Ganjam in Orissa, for setting up various projects by the Chemicals Business. The transaction value is approximately Rs 282 crores excluding taxes. The MoU permits conduct of necessary due diligence and allows SRF to enter into a Sub-Lease for land with TSSEZL within a definitive time frame after fulfillment of payment obligations. The parties are not related to promoter/promoter group/group companies and the transaction does not fall within related party transactions.",
            "Sentiment": "positive",
            "PublishDate": 1757697757249,
            "Source": "order&deals"
        },
        {
            "Title": "SRF Limited Submits Transcript of Refrigerant Segment Investor Conference Call",
            "Summary": "SRF Limited submitted the transcript of an investor conference call held on August 29, 2025, which focused on updates regarding the company's Refrigerant Segment. The transcript has been made available on the company's website. The document submitted to stock exchanges BSE and NSE contains the submission details and company contact information, with a link to access the full transcript online.",
            "Sentiment": "neutral",
            "PublishDate": 1757051473150,
            "Source": "stock"
        },
        {
            "Title": "SRF Gets Relief as Export Obligation Period for QCO Products Extended to 18 Months",
            "Summary": "Chemical exporter SRF has received relief as the export obligation period for QCO products has been extended from 6 months to 18 months. This extension provides the company with additional time to meet its export commitments for these chemical products.",
            "Sentiment": "positive",
            "PublishDate": 1756798695658,
            "Source": "stock"
        },
        {
            "Title": "SRF Explains Refrigerant Gas Regulations Under Kigali Amendment",
            "Summary": "SRF conducted a call led by Prashant Yadav, President and CEO of Fluorochemicals Business, discussing regulatory aspects of refrigerant gases under the 2016 Kigali Amendment. The company has a target price of ₹3,250 compared to current market price of ₹2,897.20. Key regulatory points include: US and China have completed baseline periods with quotas in freeze years, while India is determining its baseline and developing policies. Market participants will have consumption quotas based on imports plus domestic sales, and production quotas based on production plus exports. For Article A5 countries like China and India, GWP allowance calculation includes HFC plus 65% of HCFC baseline, though US and China haven't utilized their HCFC baseline allocation. In China, quota eligibility required plants commissioned before December 2019. Indian companies establishing plants during the baseline period will receive pro-rated quota allocation, though government allocation of HCFC quota remains uncertain. No new HFC plants can be commissioned after December 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1756733076306,
            "Source": "stock"
        },
        {
            "Title": "SRF Partners With Chemours For Fluoropolymer Manufacturing, Revenue Growth Expected From FY27",
            "Summary": "SRF Ltd. has entered a strategic partnership with Chemours Co. to manufacture fluoropolymers and fluoroelastomers at its Dahej facility. Production is expected to begin within 12 months, with revenue growth anticipated from fiscal 2027. The products serve semiconductor, automotive, aerospace, and oil and gas industries. SRF will leverage its manufacturing capabilities while Chemours provides technology, with no upfront capital investment required from Chemours. The partnership will utilize SRF's existing 5 kilotonnes per annum PTFE facility, which currently operates at 50-60% capacity. PTFE accounts for 3-4% of SRF's chemicals segment revenues. Analyst ratings vary: Citi maintains 'sell' with Rs 2,725 target, UBS maintains 'sell' with Rs 2,400 target, while DAM Capital maintains 'buy' with Rs 3,521 target. SRF shares closed 0.35% higher at Rs 2,929.6, having gained 31% over the past 12 months.",
            "Sentiment": "positive",
            "PublishDate": 1755657612278,
            "Source": "stock"
        },
        {
            "Title": "SRF and Chemours Form Strategic Partnership in India Targeting 2026 Market Goals",
            "Summary": "SRF and Chemours have entered into strategic deals in India aimed at addressing market demands for key applications by 2026. The partnership involves both companies working together to meet specific market requirements in the Indian market.",
            "Sentiment": "positive",
            "PublishDate": 1755597241284,
            "Source": "order&deals"
        },
        {
            "Title": "SRF Limited Seeks Reclassification of SMK Wellness from Promoter Group to Public Category",
            "Summary": "SRF Limited has applied to BSE and NSE for reclassification of SMK Wellness Private Limited from Promoter Group to Public shareholder category. SMK Wellness currently holds no equity shares in SRF Limited, with zero shareholding percentage. The application was submitted on July 28, 2025, under regulation 31A of SEBI LODR Regulations. This reclassification affects the company's shareholding structure by moving a non-shareholding entity from promoter group status to public category.",
            "Sentiment": "neutral",
            "PublishDate": 1753710896356,
            "Source": "corporate_action"
        },
        {
            "Title": "SRF Seeks Reclassification of SMK Wellness from Promoter Group to Public Category",
            "Summary": "SRF has applied for the reclassification of SMK Wellness Pvt Ltd from promoter group status to public category. This corporate action involves changing the classification status of the entity in relation to SRF's shareholding structure.",
            "Sentiment": "neutral",
            "PublishDate": 1753710416797,
            "Source": "corporate_governance"
        },
        {
            "Title": "12 Companies Including SRF, Alembic Pharma, Punjab & Sind Bank Set Ex-Dividend Date",
            "Summary": "Twelve companies have set their ex-dividend and record dates, with the last trading session for investors to purchase shares and qualify for dividend payments. Key companies include Apar Industries distributing a final dividend of Rs 51 per share, Alembic Pharmaceuticals offering Rs 11 per share, Bosch Ltd issuing Rs 512 per share, Punjab & Sind Bank announcing Rs 0.07 per share, and SRF declaring an interim dividend of Rs 4 per share. Under India's T+1 settlement cycle, investors must purchase shares before the record date to be eligible for dividend payments, as shares bought on the record date itself will not qualify.",
            "Sentiment": "neutral",
            "PublishDate": 1753678448324,
            "Source": "corporate_action"
        },
        {
            "Title": "SRF Targets ROCE Above 25% for Chemicals Business, 200 Basis Points Lower for Packaging Films",
            "Summary": "SRF has set a target to achieve Return on Capital Employed (ROCE) margins above 25% in its chemicals business. For its packaging films segment, the company aims for ROCE margins that are 200 basis points lower than the chemicals business target. These targets were shared during a conference call update.",
            "Sentiment": "positive",
            "PublishDate": 1753414233541,
            "Source": "stock"
        },
        {
            "Title": "SRF Expects Better FY26 Performance with Stable HFC Prices and PTFE Capacity Targets",
            "Summary": "SRF expressed optimism for improved performance in FY26 and expects HFC prices to remain stable to higher throughout the fiscal year. The company maintains its original growth targets for the Chemical Division despite a strong Q1 performance. For its PTFE business, SRF aims to achieve 75-80% capacity utilization by the end of FY26.",
            "Sentiment": "positive",
            "PublishDate": 1753413855188,
            "Source": "stock"
        },
        {
            "Title": "SRF Limited Reports Strong Q1 FY26 Results with 71% Jump in Profit After Tax",
            "Summary": "SRF Limited delivered robust quarterly results with gross operating revenue rising 10.2% to ₹3,818.6 crores compared to ₹3,464.1 crores in the same quarter last year. The company's profit after tax surged 71.4% to ₹432.3 crores from ₹252.2 crores, while EBITDA grew 31.6% to ₹850.3 crores with margins expanding to 22.3% from 18.6%. The Chemicals Business was the standout performer, contributing 48.2% of total revenue at ₹1,838.9 crores (up 24.1%) and generating EBIT of ₹502.9 crores with strong margins of 27.3%. Performance Films & Foil Business revenue grew 6.1% to ₹1,418.2 crores with EBIT rising 61.6% to ₹140.2 crores. However, Technical Textiles Business faced challenges with revenue declining 11.2% to ₹466.6 crores and EBIT falling 44.4% to ₹37.6 crores due to subdued domestic demand. The company's board approved new capital expenditure projects including ₹250 crores for a new agrochemical production facility and ₹490 crores for a BOPP line and metallizer at Indore. SRF operates across 16 manufacturing facilities globally with over 9,000 employees and exports to 100+ countries.",
            "Sentiment": "positive",
            "PublishDate": 1753347132421,
            "Source": "earnings"
        },
        {
            "Title": "SRF Limited Declares Rs. 4 Interim Dividend, Approves Rs. 490 Crore BOPP Film Facility Expansion",
            "Summary": "SRF Limited's Board of Directors declared an interim dividend of 40% (Rs. 4 per share) for financial year 2025-26, with a record date of July 29, 2025, and payment by August 19, 2025. The company approved a Rs. 490 crore investment to establish a new BOPP Film manufacturing facility in Indore, MP, adding 60,000 MTPA capacity to existing 110,000 MTPA capacity, to be completed within 24 months through debt and internal accruals. SRF reported strong Q1FY26 consolidated results with revenue increasing 10% to Rs. 3,819 crore, EBIT rising 43% to Rs. 694 crore, and PAT growing 71% to Rs. 432 crore compared to the same period last year. The Chemicals Business revenue increased 24% to Rs. 1,839 crore with operating profit up 64% to Rs. 503 crore, while Performance Films & Foil Business revenue grew 6% to Rs. 1,418 crore with operating profit increasing 62% to Rs. 140 crore.",
            "Sentiment": "positive",
            "PublishDate": 1753264410493,
            "Source": "corporate_action"
        },
        {
            "Title": "SRF Board Approves ₹740 Crore Investment for Two New Manufacturing Facilities",
            "Summary": "SRF has established an agrochemicals production facility in Dahej, Gujarat with an investment of ₹250 crores. Additionally, the company's board has approved a ₹490 crore investment to set up a 60,000 MTPA BOPP film manufacturing facility in Indore, Madhya Pradesh, with completion expected in 24 months. The combined investment across both facilities totals ₹740 crores.",
            "Sentiment": "positive",
            "PublishDate": 1753263971328,
            "Source": "stock"
        },
        {
            "Title": "SRF Co Managing Director Shows Cautious Optimism for Year Ahead",
            "Summary": "SRF's Co Managing Director has expressed cautious optimism regarding the company's outlook for the remaining period of the year. The statement reflects a measured positive stance on the company's prospects going forward.",
            "Sentiment": "positive",
            "PublishDate": 1753263535822,
            "Source": "stock"
        },
        {
            "Title": "SRF Board Approves ₹4 Per Share Interim Dividend as Q1 EBITDA Jumps to ₹8.3 Billion",
            "Summary": "SRF's board has approved an interim dividend of ₹4 per share. The company reported Q1 EBITDA of ₹8.3 billion compared to ₹6.03 billion in the same period last year, slightly below the estimated ₹8.32 billion. EBITDA margin improved to 21.7% from 17.42% year-over-year, exceeding the estimated 20.3%.",
            "Sentiment": "positive",
            "PublishDate": 1753262965562,
            "Source": "corporate_action"
        }
    ]
}