{
    "Symbol": "SRGHFL",
    "ISIN": "INE559N01010",
    "News": [
        {
            "Title": "SRG Housing Finance Q3FY26 Net Profit Surges 43%",
            "Summary": "SRG Housing Finance reports strong Q3FY26 results with net profit of ₹821.05 lakhs, up 43% YoY. Total income rises 27% to ₹5,124.76 lakhs driven by higher interest income.",
            "Sentiment": "positive",
            "PublishDate": 1770373975033,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRG Housing Finance Completes NCD Interest & Principal Payment",
            "Summary": "SRG Housing Finance Limited successfully paid ₹22.30 lakh interest and redeemed ₹39.39 lakh principal on NCDs with ISIN INE559N07066, maintaining ₹248.18 crore outstanding balance.",
            "Sentiment": "neutral",
            "PublishDate": 1769168399468,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRG Housing Finance EGM Approves Director Reappointment",
            "Summary": "SRG Housing Finance Limited shareholders unanimously approved the reappointment of Mr. Sureshkumar Kanhaiyalal Porwal as Independent Director through e-voting at the Extra-Ordinary General Meeting held on January 19, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1768913412800,
            "Source": "stocks"
        },
        {
            "Title": "SRG Housing Finance allots 7,250 shares under ESOS",
            "Summary": "SRG Housing Finance Limited has allotted 7,250 equity shares to employees under its Employee Stock Option Scheme 2023, increasing paid-up capital to ₹15.70 crores from ₹15.69 crores.",
            "Sentiment": "positive",
            "PublishDate": 1768310246643,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRG Housing Finance Pays ₹45.19L Interest on NCDs Dec 29",
            "Summary": "SRG Housing Finance Limited completed monthly interest payment of ₹45.19 lakh and partial redemption of ₹75.76 lakh on secured redeemable non-convertible debentures on December 29, 2025, with regulatory compliance.",
            "Sentiment": "positive",
            "PublishDate": 1766574610749,
            "Source": "co_actions_results"
        },
        {
            "Title": "SRG Housing Finance Gets Credit Rating Reaffirmation",
            "Summary": "CARE Ratings reaffirms SRG Housing Finance's BBB rating with stable outlook for ₹500 crore long-term bank facilities, maintaining the company's creditworthiness assessment.",
            "Sentiment": "positive",
            "PublishDate": 1766471271704,
            "Source": "stocks"
        },
        {
            "Title": "SRG Housing Finance Seeks Shareholder Approval for Director Re-appointment",
            "Summary": "SRG Housing Finance Limited convenes EGM on January 19, 2026 to approve re-appointment of Mr. Suresh Kumar Kanhaiyalal Porwal as Independent Director for second five-year term from December 1, 2025 to November 30, 2030.",
            "Sentiment": "neutral",
            "PublishDate": 1766063432715,
            "Source": "stocks"
        },
        {
            "Title": "SRG Housing Finance Makes Monthly Interest and Principal Payments on Non-Convertible Debentures",
            "Summary": "SRG Housing Finance Limited paid Rs. 46,57,366 in monthly interest and Rs. 75,75,757.58 in principal redemption on its non-convertible debentures one day ahead of the November 29, 2025 due date. The payments were made early as the scheduled due date fell on a non-working day, with Rs. 477,272,727.27 remaining as outstanding amount on the debentures.",
            "Sentiment": "neutral",
            "PublishDate": 1764334319789,
            "Source": "corporate_action"
        },
        {
            "Title": "SRG Housing Finance Makes Monthly Interest and Principal Payments on Non-Convertible Debentures",
            "Summary": "SRG Housing Finance Limited paid Rs. 22,99,442.49 in interest and redeemed Rs. 39,39,393.94 in principal on its secured NCDs with ISIN INE559N07066 on November 24, 2025. The company has Rs. 25,60,60,606.06 outstanding amount remaining on the debenture issue originally worth Rs. 26 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1763976353335,
            "Source": "corporate_action"
        },
        {
            "Title": "SRG Housing Finance Reports 33% Loan Book Growth to INR 867 Crore in Q2 FY26",
            "Summary": "SRG Housing Finance achieved strong quarterly performance with loan book growing 33.21% to INR 867 crore, disbursements up 85% to INR 117 crore, and profit after tax increasing 25% to INR 8 crore. The company targets INR 970 crore AUM and INR 400 crore disbursements for FY26, while expanding operations across Karnataka, Maharashtra and Andhra Pradesh with improved credit rating to BBB+ positive.",
            "Sentiment": "positive",
            "PublishDate": 1763485235178,
            "Source": "earnings"
        },
        {
            "Title": "SRG Housing Finance Reports 83% Drop in Net Profit for Quarter Ended September 2025",
            "Summary": "SRG Housing Finance Limited reported a net profit of Rs 8.25 crores for the quarter ended September 30, 2025, compared to Rs 48.60 crores in the previous quarter, representing an 83% decline. For the half-year period, net profit decreased to Rs 15.03 crores from Rs 112.45 crores in the previous year. Total revenue from operations increased to Rs 47.81 crores from Rs 41.72 crores in the previous quarter. The company's main business involves providing loans for purchase, construction, repairs and renovation of residential properties. Basic earnings per share stood at Rs 5.26 for the quarter. The company maintained a security cover of 110% for its non-convertible debentures and has no subsidiary, associate or joint venture companies.",
            "Sentiment": "negative",
            "PublishDate": 1762940111912,
            "Source": "earnings"
        },
        {
            "Title": "SRG Housing Finance Raises INR 26 Crores Through Non-Convertible Debentures",
            "Summary": "SRG Housing Finance Limited successfully allotted 2,600 non-convertible debentures worth INR 26 crores through private placement on October 24, 2025. The debentures carry a face value of INR 1 lakh each and offer an 11.52% annual interest rate with monthly coupon payments. The securities mature on April 24, 2031, and are secured by an exclusive charge over the company's receivables portfolio with 1.1 times minimum security cover. Four investors participated in the fully subscribed offering: MUFIN Green Finance Limited, Anaaya Avinash Wadhwa, PH Financial and Investments Private Limited, and Usha Parsram Wadhwa. The debentures will be listed on BSE Limited.",
            "Sentiment": "positive",
            "PublishDate": 1761366113248,
            "Source": "corporate_action"
        },
        {
            "Title": "SRG Housing Finance Reports 26% Growth in Loan Assets, PAT Up 16% in Q1 FY26",
            "Summary": "SRG Housing Finance Limited reported strong quarterly results with Gross Loan Assets growing 26.33% to Rs 795.39 crores compared to Rs 629.60 crores in the same quarter last year. Loan disbursements surged 79.49% to Rs 80 crores from Rs 44.57 crores. Total income increased 25.66% to Rs 42.70 crores while Net Interest Income rose 19.74% to Rs 20.38 crores. Profit After Tax grew 15.70% to Rs 6.78 crores from Rs 5.86 crores. However, Net Interest Margin declined to 2.62% from 2.76%, and Return on Average Equity dropped to 2.54% from 3.57%. The company maintained strong asset quality with Gross NPA improving to 1.85% from 2.19% and Net NPA at 0.62% versus 0.67%. Capital Adequacy Ratio stood robust at 47.46%. The loan portfolio consists of 72.95% housing loans and 27.05% loans against property, with 92.08% exposure in rural markets. SRG operates through 93 branches across 6 states and 1 Union Territory.",
            "Sentiment": "positive",
            "PublishDate": 1755089025075,
            "Source": "earnings"
        },
        {
            "Title": "SRG Housing Finance Reports 15% Jump in Q1 Net Profit to 68M Rupees",
            "Summary": "SRG Housing Finance reported Q1 net profit of 68 million rupees compared to 59 million rupees in the same period last year. The company's Q1 revenue increased to 371 million rupees from 310 million rupees year-over-year, representing a 19.7% growth in revenue.",
            "Sentiment": "positive",
            "PublishDate": 1755073926028,
            "Source": "earnings"
        },
        {
            "Title": "SRG Housing Finance Approves INR 35 Crore Non-Convertible Debenture Issuance with Green Shoe Option",
            "Summary": "SRG Housing Finance Limited's Borrowing Committee approved the issuance of non-convertible debentures worth INR 35 crores with a green shoe option of INR 15 crores through private placement. The debentures will have a face value of INR 1 lakh each and will be rated, secured, listed, senior, transferable, and redeemable. The NCDs are proposed to be listed on BSE Limited and will be issued to eligible investors on a private placement basis. The obligations will be secured by an exclusive charge via deed of hypothecation over specific asset portfolio of receivables with minimum security cover of 1.1 times. The debentures received a credit rating of Acuite BBB+ with Positive outlook from Acuité Ratings & Research Limited. In case of payment delays exceeding three months, the company will pay an additional 2% coupon over the applicable rate until the default is resolved.",
            "Sentiment": "positive",
            "PublishDate": 1754645626397,
            "Source": "corporate_action"
        },
        {
            "Title": "SRG Housing Finance Approves ₹250 Crore NCD Issuance for FY 2025-26",
            "Summary": "SRG Housing Finance Limited's Board of Directors approved the issuance of secured, rated, listed, redeemable Non-Convertible Debentures up to ₹250 crore during financial year 2025-26 through private placement. The NCDs will be issued in one or more tranches and are proposed to be listed on BSE Limited and/or NSE Limited. The Board authorized designated officials to determine the structure, timing, terms and conditions of each tranche. Specific details including tenure, coupon rates, security charges, and redemption manner will be determined at the time of each issue. The board meeting was held on August 01, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754035576652,
            "Source": "corporate_action"
        },
        {
            "Title": "SRG Housing Finance Schedules Board Meeting to Consider Non-Convertible Debentures Issuance",
            "Summary": "SRG Housing Finance Limited has scheduled a board meeting for August 1, 2025, to consider issuing Non-Convertible Debentures through private placement in one or more tranches. The company has implemented a trading window closure effective July 1, 2025, which will remain in place until 48 hours after the announcement of unaudited financial results for the quarter ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1753779774534,
            "Source": "corporate_action"
        },
        {
            "Title": "SRG Housing Finance Reports Q2 FY24 Results",
            "Summary": "SRG Housing Finance has announced its financial results for the second quarter. The company's net profit increased to 66 million rupees from 53 million rupees in the same quarter last year, showing a year-over-year growth. Revenue also rose to 360 million rupees from 302 million rupees in the corresponding period.",
            "Sentiment": "positive",
            "PublishDate": 1730101604000,
            "Source": "result"
        }
    ]
}