{
    "Symbol": "SRHHYPOLTD",
    "ISIN": "INE917H01012",
    "News": [
        {
            "Title": "Sree Rayalaseema Hi-Strength Hypo Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Sree Rayalaseema Hi-Strength Hypo reported Q2 net profit of 244 million rupees, down from 259 million rupees year-over-year, while revenue increased to 1.8 billion rupees from 1.7 billion rupees. The company achieved revenue growth but experienced a decline in profitability during the quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1763052302932,
            "Source": "earnings"
        },
        {
            "Title": "Sree Rayalaseema Hi-Strength Hypo Reports Q1 FY2026 Results with 14% Revenue Growth",
            "Summary": "Sree Rayalaseema Hi-Strength Hypo Limited reported its quarterly results for the quarter ended June 30, 2025. The company's revenue from operations increased to Rs 180.26 crore compared to Rs 168.63 crore in the same quarter last year. Profit for the period rose to Rs 23.41 crore from Rs 20.49 crore year-on-year. Basic earnings per share stood at Rs 13.64 versus Rs 11.94 in the corresponding quarter. The board decided to shut down its 10 MW thermal power plant due to economic viability concerns and plans to dispose it after finding a suitable buyer. The company incurred capital expenditure for setting up a 132 KVA substation, with AP Southern Power Distribution Company commencing power supply from April 2025. Exceptional items included doubtful and unrecoverable investments written off during the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755177781710,
            "Source": "earnings"
        },
        {
            "Title": "Sree Rayalaseema Hi-Strength Hypo Announces Dividend and Q4 Results",
            "Summary": "Sree Rayalaseema Hi-Strength Hypo has declared a dividend of 3 rupees per share. The company's Q4 EBITDA decreased to 179 million rupees from 271 million rupees year-over-year. The Q4 EBITDA margin also declined to 11.17% from 16.39% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1748614117000,
            "Source": "result"
        },
        {
            "Title": "SREE RAYALASEEMA HI-STRENGTH HYPO Reports Q4 Financial Results",
            "Summary": "SREE RAYALASEEMA HI-STRENGTH HYPO has reported its Q4 financial results. The company's net profit for the quarter was 227 million rupees, compared to 210 million rupees year-over-year and 235 million rupees quarter-over-quarter. The company's revenue for Q4 was 1.6 billion rupees, compared to 1.65 billion rupees in the same quarter of the previous year.",
            "Sentiment": "neutral",
            "PublishDate": 1748614042000,
            "Source": "result"
        },
        {
            "Title": "Sree Rayalaseema Hi-strength Hypo Reports Q3 Financial Results",
            "Summary": "Sree Rayalaseema Hi-strength Hypo announced its Q3 financial results. The company reported a net profit of 235 million rupees, up from 166 million rupees in the same quarter last year. However, revenue decreased to 1.38 billion rupees from 2.1 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739751333000,
            "Source": "earnings"
        },
        {
            "Title": "Sree Rayalaseema Hi-Strength Hypo Reports Q3 EBITDA and Margin",
            "Summary": "Sree Rayalaseema Hi-Strength Hypo announced its Q3 financial results. The company reported an EBITDA of 214 million rupees, compared to 222 million rupees in the same quarter last year. Despite the slight decrease in EBITDA, the company's EBITDA margin improved significantly to 15.43% from 10.33% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1739544812000,
            "Source": "earnings"
        },
        {
            "Title": "Sree Rayalaseema Hi-Strength Hypo Reports Q3 Financial Results",
            "Summary": "Sree Rayalaseema Hi-Strength Hypo has announced its Q3 financial results. The company's net profit increased to 235 million rupees, up from 166 million rupees in the same quarter last year. However, revenue decreased to 1.38 billion rupees from 2.1 billion rupees year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739544806000,
            "Source": "earnings"
        },
        {
            "Title": "Sree Rayalaseema Hi-Strength Hypo Reports Q2 EBITDA Growth",
            "Summary": "Sree Rayalaseema Hi-Strength Hypo announced its Q2 financial results. The company's EBITDA increased to 298 million rupees, up from 262 million rupees in the same quarter last year. The EBITDA margin also improved significantly, rising to 17.50% from 11.6% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731590830000,
            "Source": "result"
        },
        {
            "Title": "Sree Rayalaseema Hi-Strength Hypo Reports Q2 Financial Results",
            "Summary": "Sree Rayalaseema Hi-Strength Hypo has announced its Q2 financial results. The company's net profit increased to 259 million rupees, up from 185 million rupees year-over-year and 205 million rupees quarter-over-quarter. However, revenue decreased to 1.7 billion rupees from 2.25 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731590768000,
            "Source": "result"
        }
    ]
}