{
    "Symbol": "SRM",
    "ISIN": "INE0R6Z01013",
    "News": [
        {
            "Title": "SRM Contractors Transfers CEO Duties to Managing Director",
            "Summary": "SRM Contractors Limited's Board of Directors decided to transfer all CEO duties and authorities to Managing Director Mr. Puneet Pal Singh to streamline operations and support expansion plans across India and abroad.",
            "Sentiment": "positive",
            "PublishDate": 1766505536858,
            "Source": "stocks"
        },
        {
            "Title": "SRM Contractors CEO Rupesh Kumar Resigns",
            "Summary": "SRM Contractors Limited announces resignation of Chief Executive Officer Rupesh Kumar due to personal reasons, effective December 22, 2025, as per regulatory filing.",
            "Sentiment": "neutral",
            "PublishDate": 1766407755911,
            "Source": "stocks"
        },
        {
            "Title": "SRM Contractors Completes India's Longest Precast Cut-and-Cover Tunnel for Defence Ministry",
            "Summary": "SRM Contractors Limited announced the inauguration of India's longest precast cut-and-cover tunnel measuring 920 metres at 12,300 feet altitude, inaugurated by Defence Minister Rajnath Singh on December 7, 2025. The tunnel, built in a sensitive border region, will enhance troop mobility, strengthen logistics, and boost India's operational readiness in high-altitude terrain.",
            "Sentiment": "positive",
            "PublishDate": 1765196805715,
            "Source": "stock"
        },
        {
            "Title": "SRM Contractors MD Puneet Pal Singh Receives ET Young Industry Leaders Award 2025",
            "Summary": "Puneet Pal Singh, Managing Director of SRM Contractors Limited, has been honored with the ET Young Industry Leaders 2025 award by Times of India Group for excellence in roads and highways development in hilly terrain. This marks the third consecutive recognition for SRM Contractors, highlighting the company's consistent delivery of critical infrastructure projects in challenging geographical conditions across India.",
            "Sentiment": "positive",
            "PublishDate": 1764590830663,
            "Source": "corporate_governance"
        },
        {
            "Title": "SRM Contractors Wins Second Consecutive ET Infra Award for Leh Tunnel Project",
            "Summary": "SRM Contractors Limited received the ET Infra Leadership Award 2025 for Excellence in Border/Remote/Hilly Region Infrastructure for delivering India's longest precast cut-and-cover tunnel at Leh, executed at 12,300 ft under extreme conditions near the Line of Actual Control. This marks the company's second consecutive ET Infra award this year, with the project featuring India's first unreinforced high-strength precast tunnel with pioneering anti-freeze concreting technology.",
            "Sentiment": "positive",
            "PublishDate": 1764419237525,
            "Source": "corporate_action"
        },
        {
            "Title": "SRM Contractors Reports Strong Q2 FY26 Results, Eyes INR 1,100-1,200 Crores Revenue Target",
            "Summary": "SRM Contractors delivered INR 192 crores revenue in Q2 FY26 with 15.49% EBITDA margin and PAT of INR 19 crores, while maintaining an order book of INR 1,552 crores as of September 2025. The infrastructure company targets consolidated revenue of INR 1,100-1,200 crores for FY26 including contributions from acquired Maccaferri Infrastructure, with plans for international expansion and diversification into HAM projects.",
            "Sentiment": "positive",
            "PublishDate": 1763384364777,
            "Source": "earnings"
        },
        {
            "Title": "SRM Contractors Reports No Deviation in IPO Fund Utilization for Q2 FY26",
            "Summary": "SRM Contractors Limited submitted its monitoring agency report for the quarter ended September 30, 2025, showing funds from its Rs. 130.20 crore IPO were utilized for capital expenditure on equipment and joint venture investments with no deviations from stated objectives. CARE Ratings Limited confirmed all fund utilization aligned with the offer document disclosures, with Rs. 32.00 crore remaining unutilized and invested in fixed deposits.",
            "Sentiment": "positive",
            "PublishDate": 1763138028754,
            "Source": "earnings"
        },
        {
            "Title": "SRM Contractors Secures ₹155 Crore Contract",
            "Summary": "SRM Contractors has won a contract worth ₹155 crore. The company has a market capitalization of ₹1,300 crore.",
            "Sentiment": "positive",
            "PublishDate": 1761817773087,
            "Source": "stock"
        },
        {
            "Title": "SRM Contractors Submits Investor Presentation Highlighting Rs 1,476 Crore Order Book and Strong Growth Outlook",
            "Summary": "SRM Contractors Limited submitted an investor presentation to stock exchanges detailing its current business position and strategic priorities. The infrastructure company, with 17+ years of expertise in roadways, tunnels, bridges, and slope stabilization, reported an order book of Rs 1,476.06 crores as of August 2025. The company achieved strong financial performance with 34.8% revenue CAGR, 51% EBITDA CAGR, and 60.7% PAT CAGR from FY21-25. For Q1FY26, SRM reported revenue of Rs 144 crores, EBITDA of Rs 22 crores, and PAT of Rs 12.8 crores with 9% PAT margin. The company has provided FY26 guidance of Rs 900 crores revenue, 20%+ EBITDA margin, and 9%+ PAT margin, expecting over Rs 1,000 crores order inflow. SRM operates across multiple segments with 60% of orderbook in roads and bridges, 29% in slope stabilization, and 11% in tunnels. The company recently acquired a 51% stake in Maccaferri Infrastructure Pvt. Ltd., which has an order book of Rs 211 crores. SRM's operations span multiple states with significant presence in Jammu & Kashmir (36% of orderbook), Uttarakhand (19%), and Gujarat (17%). The company maintains a debt-to-equity ratio of 0.09 and received a credit rating upgrade from CARE BBB+ to CARE A- for long-term bank facilities.",
            "Sentiment": "positive",
            "PublishDate": 1757590983129,
            "Source": "stock"
        },
        {
            "Title": "SRM Contractors Wins ₹174 Crore Contract",
            "Summary": "SRM Contractors has secured a contract worth ₹174 crore. The company announced this contract acquisition, though specific details about the project scope, timeline, or client were not disclosed.",
            "Sentiment": "positive",
            "PublishDate": 1755676692066,
            "Source": "stock"
        },
        {
            "Title": "SRM Contractors Reports ₹16.16 Crore Net Profit on ₹228.55 Crore Revenue for June Quarter",
            "Summary": "SRM Contractors Limited, a Jammu-based construction company listed on BSE and NSE, reported unaudited financial results for the quarter ended June 30, 2025. The company recorded total income from operations of ₹228.55 crore and net profit of ₹16.16 crore. Earnings per share stood at ₹1.34 for both basic and diluted calculations. The company trades under scrip code 544158 on BSE and SRM on NSE.",
            "Sentiment": "positive",
            "PublishDate": 1755596873602,
            "Source": "earnings"
        },
        {
            "Title": "SRM Contractors Reports No Deviations in IPO Proceeds Utilization for Q1 FY26",
            "Summary": "SRM Contractors Limited submitted its monitoring agency report for the quarter ended June 30, 2025, detailing the utilization of proceeds from its Rs. 130.20 crore Initial Public Offer. CARE Ratings Limited, serving as the monitoring agency, reported no deviations from the disclosed objects of the issue. The company utilized Rs. 3.06 crore during the quarter, primarily for purchasing construction equipment and machinery. Out of the total IPO proceeds, Rs. 91.26 crore has been utilized cumulatively, leaving Rs. 38.94 crore unutilized. The unutilized funds are deployed in fixed deposits with HDFC Bank and Yes Bank, earning returns between 4.50% to 7.50%. The company's IPO, conducted from March 26-28, 2024, was allocated across six objects including capital expenditure for equipment, debt repayment, working capital, joint venture investment, and general corporate purposes. The Audit Committee reviewed the report on August 14, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1755196620459,
            "Source": "stock"
        },
        {
            "Title": "SRM Contractors Reports 179% Jump in Quarterly Profit to ₹1,306 Lakhs",
            "Summary": "SRM Contractors Limited announced its quarterly results for the period ended June 30, 2025. The company reported a standalone profit of ₹1,305.96 lakhs, representing a significant increase from ₹467.90 lakhs in the same quarter last year. Revenue from operations rose to ₹14,309.34 lakhs compared to ₹5,421.71 lakhs in the previous year quarter. On a consolidated basis, the company posted a profit of ₹1,274.81 lakhs versus ₹476.97 lakhs in the corresponding quarter. Basic earnings per share increased to ₹5.69 from ₹2.04 year-over-year on standalone basis. The company operates in a single business segment and has subsidiaries including SP Mangal Murti Enterprises Private Limited and Loran Valley Power Projects Private Limited, along with several joint venture projects. The board meeting to approve these results was held on August 14, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1755187011890,
            "Source": "earnings"
        },
        {
            "Title": "SRM Contractors Reports Strong Q4 Financial Results",
            "Summary": "SRM Contractors has announced its Q4 financial results, showing significant year-over-year improvements. The company's EBITDA increased to 340 million rupees from 127 million rupees in the same quarter last year. The EBITDA margin improved to 14.92% from 11.79%. Revenue grew to 2.3 billion rupees from 1.1 billion rupees. Consolidated net profit rose to 241 million rupees from 62 million rupees in the previous year's quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747733369000,
            "Source": "result"
        },
        {
            "Title": "SRM Contractors Reports Significant Profit and Revenue Growth in Q3",
            "Summary": "SRM Contractors has announced its financial results for the third quarter. The company's net profit increased substantially to 142 million rupees, compared to 39 million rupees in the same period last year. Revenue also saw significant growth, reaching 1.5 billion rupees, up from 867 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1739320431000,
            "Source": "earnings"
        },
        {
            "Title": "SRM Contractors Reports Significant Q3 EBITDA Growth",
            "Summary": "SRM Contractors has announced its Q3 financial results, showing substantial year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased from 80 million rupees to 225 million rupees. Additionally, the EBITDA margin expanded from 9.23% to 14.96%, indicating enhanced operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1739282182000,
            "Source": "earnings"
        },
        {
            "Title": "SRM Contractors Reports Significant Increase in Q3 Profit and Revenue",
            "Summary": "SRM Contractors has announced its financial results for the third quarter. The company's net profit has risen to 142 million rupees, up from 39 million rupees in the same period last year. Revenue for Q3 has also shown substantial growth, reaching 1.5 billion rupees compared to 867 million rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1739282175000,
            "Source": "earnings"
        },
        {
            "Title": "SRM Contractors to Acquire Stake in Maccaferri Infrastructure",
            "Summary": "SRM Contractors has approved the acquisition of a 51% stake in Maccaferri Infrastructure Private Limited (MIPL). The company plans to invest 190 million rupees in the first tranche to acquire a 12.75% stake in MIPL.",
            "Sentiment": "positive",
            "PublishDate": 1737115806000,
            "Source": "corporate_action"
        },
        {
            "Title": "SRM Contractors Secures New Project Worth 1.06 Billion Rupees",
            "Summary": "SRM Contractors has been awarded a new project with a quoted amount of 1.06 billion rupees. This represents a significant business development for the company, potentially boosting its project portfolio and revenue stream.",
            "Sentiment": "positive",
            "PublishDate": 1734912647000,
            "Source": "order&deals"
        },
        {
            "Title": "SRM Contractors Secures New Project Worth 1.06 Billion Rupees",
            "Summary": "SRM Contractors has been awarded a new project with a quoted amount of 1.06 billion rupees. This significant contract represents a substantial business opportunity for the company and potentially indicates growth in their project portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1734701194000,
            "Source": "order&deals"
        },
        {
            "Title": "SRM Contractors to Acquire SRM Serves Foundation",
            "Summary": "SRM Contractors has announced its intention to acquire SRM Serves Foundation. This acquisition represents a significant corporate action that may impact the company's structure and operations.",
            "Sentiment": "neutral",
            "PublishDate": 1734612261000,
            "Source": "corporate_action"
        },
        {
            "Title": "SRM Contractors Reports Improved Q2 EBITDA and Margin",
            "Summary": "SRM Contractors has announced its Q2 financial results. The company's EBITDA increased to 152 million rupees, up from 142 million rupees in the same quarter last year. Additionally, the EBITDA margin improved to 15.96% from 13.16% year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1731599818000,
            "Source": "result"
        },
        {
            "Title": "SRM Contractors Reports Q2 Financial Results",
            "Summary": "SRM Contractors announced its Q2 financial results. The company's net profit increased to 89 million rupees, up from 82 million rupees year-over-year and 47 million rupees quarter-over-quarter. However, revenue decreased to 952 million rupees from 1.07 billion rupees compared to the same quarter last year.",
            "Sentiment": "neutral",
            "PublishDate": 1731599755000,
            "Source": "result"
        },
        {
            "Title": "SRM Contractors: Secures ₹45.25 Crore Mining Infrastructure Project in Odisha",
            "Summary": "SRM Contractors Limited has won a ₹45.25 crore contract from Odisha Mining Corporation Ltd for constructing a Gabion Wall at South Kaliapani Chromite Mine. The project has a 12-month completion timeline.",
            "Sentiment": "positive",
            "PublishDate": 1730109287000,
            "Source": "normal_news"
        },
        {
            "Title": "SRM Contractors Secures 45 Crore Rupee Order",
            "Summary": "SRM Contractors has won a new order valued at 45 crore rupees (approximately $5.4 million USD). This represents a significant business development for the company, potentially boosting its project portfolio and revenue.",
            "Sentiment": "positive",
            "PublishDate": 1730102098000,
            "Source": "corporate_action"
        }
    ]
}