{
    "Symbol": "SSDL",
    "ISIN": "INE0PQ101010",
    "News": [
        {
            "Title": "Saraswati Saree Depot Board Meet on Feb 14, 2026",
            "Summary": "Saraswati Saree Depot Limited has scheduled a board meeting for February 14, 2026, to approve Q3FY26 unaudited financial results for the quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1768907503332,
            "Source": "co_actions_results"
        },
        {
            "Title": "Saraswati Saree Depot Seeks Shareholder Approval to Expand into Real Estate Development Business",
            "Summary": "Saraswati Saree Depot Limited has issued a postal ballot notice seeking shareholder approval through special resolution to alter its Memorandum of Association by adding real estate development as a new business objective. The e-voting period runs from December 2, 2025 to January 1, 2026, with results to be announced by January 3, 2026, allowing the company to diversify beyond its existing saree and garment trading business.",
            "Sentiment": "positive",
            "PublishDate": 1764585973041,
            "Source": "corporate_action"
        },
        {
            "Title": "Saraswati Saree Depot Reports 26.5% Revenue Growth in Q2FY26",
            "Summary": "Saraswati Saree Depot Limited delivered strong quarterly performance with revenue growing 26.5% YoY to Rs 208.39 crore, driven by healthy demand in the Utsav segment and early festive season benefits. The company maintained its debt-free status with cash reserves of Rs 31.32 crore while expanding operations with a new 25,000 sq ft purchase office in Surat.",
            "Sentiment": "positive",
            "PublishDate": 1763390614198,
            "Source": "earnings"
        },
        {
            "Title": "Saraswati Saree Depot Confident About Achieving Revenue and ROCE Targets",
            "Summary": "Saraswati Saree Depot expressed confidence in meeting its revenue and return on capital employed (ROCE) goals by the financial year-end. The company's positive outlook indicates management's belief in achieving its financial performance targets for the current fiscal year.",
            "Sentiment": "positive",
            "PublishDate": 1763389501710,
            "Source": "earnings"
        },
        {
            "Title": "Saraswati Saree Depot Reports Strong Q2 Performance and Approves Real Estate Business Expansion",
            "Summary": "Saraswati Saree Depot Limited reported quarterly results for September 30, 2025, with revenue from operations of ₹2,083.91 million and profit of ₹105.09 million, while the Board approved alteration of the Memorandum of Association to enter real estate development business. The company's monitoring agency report confirms full utilization of IPO proceeds totaling ₹1,039.97 million for working capital requirements and general corporate purposes, with only ₹5.57 million remaining in the public issue account.",
            "Sentiment": "positive",
            "PublishDate": 1763173834442,
            "Source": "earnings"
        },
        {
            "Title": "Saraswati Saree Depot Reports 11.1% Revenue Growth in Q1 FY26, Launches First Retail Outlet",
            "Summary": "Saraswati Saree Depot Limited reported quarterly results with revenue from operations reaching ₹144.77 crore, marking 11.1% year-on-year growth. EBITDA increased 14.4% to ₹8.98 crore with margins improving to 6.20% from 6.01%. Profit After Tax grew 4.1% to ₹6.35 crore, though PAT margin contracted to 4.39% from 4.68% due to higher depreciation and interest expenses under Ind AS 116 related to operating leases. The company launched its first exclusive retail outlet in Kolhapur, Maharashtra on June 1, 2025, targeting a 20% Return on Capital Employed. Additionally, the company initiated a pilot launch into men's ethnic wear in August and launched a WhatsApp store to enhance customer engagement. The growth was driven by increased volumes and rising wallet share from existing customers in their core B2B wholesale business of traditional women's apparel.",
            "Sentiment": "positive",
            "PublishDate": 1755522456462,
            "Source": "earnings"
        },
        {
            "Title": "Saraswati Saree Depot Reports 11.1% Revenue Growth in Q1 FY26, Launches Retail Expansion",
            "Summary": "Saraswati Saree Depot Limited reported revenue from operations of Rs. 144.77 crore for Q1 FY26, marking an 11.1% year-over-year increase. EBITDA grew 14.4% to Rs. 8.98 crore with margin expansion to 6.20% from 6.01%. Profit after tax increased 4.1% to Rs. 6.35 crore, though PAT margin decreased to 4.39% from 4.65% due to higher depreciation and interest expenses. The company launched its first exclusive retail outlet in Kolhapur on June 1, 2025, and introduced a WhatsApp store for enhanced customer engagement. Strategic initiatives include a pilot launch of men's ethnic wear in August 2025 and expansion of the product catalog to over 300,000 SKUs. The company served over 13,000 unique customers in fiscal 2024 and sources from more than 9,000 weavers across India. Management emphasized focus on operational efficiency, prudent financial management, and strategic expansion while targeting a 20% return on capital employed for retail initiatives.",
            "Sentiment": "positive",
            "PublishDate": 1755357517050,
            "Source": "earnings"
        },
        {
            "Title": "SSDL Board Approves Q1 FY26 Results, AGM Date, and New Independent Director Appointment",
            "Summary": "Saraswati Saree Depot Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing revenue from operations of ₹1,447.71 million compared to ₹1,303.73 million in the same quarter last year. Net profit for the quarter was ₹63.52 million versus ₹61.00 million in the previous year quarter. The Board also approved the annual report for FY 2024-25 and scheduled the 5th Annual General Meeting for September 25, 2025, to be held through video conferencing. Additionally, the Board approved the appointment of Mrs. Pallavi Korgaonkar as an Independent Director for a three-year term starting September 9, 2025, subject to shareholder approval. The company declared an interim dividend of ₹1.515 per equity share of ₹10 each during the quarter. Basic and diluted earnings per share stood at ₹1.61 for the quarter.",
            "Sentiment": "positive",
            "PublishDate": 1755188486394,
            "Source": "earnings"
        },
        {
            "Title": "Saraswati Saree Depot: Three Promoter Group Members Withdraw Reclassification Applications",
            "Summary": "Saraswati Saree Depot Limited announced that three promoter group members - Mohinibai Ahuja, Kavita Ahuja, and Khushboo Jeswani - have withdrawn their applications for reclassification from 'Promoter Group' to 'Public' category shareholders. The original applications were submitted on July 3, 2025, but all three individuals have now retracted their requests and will maintain their current status within the company's ownership structure. All three members hold zero shares in the company.",
            "Sentiment": "neutral",
            "PublishDate": 1753447278728,
            "Source": "corporate_action"
        }
    ]
}