{
    "Symbol": "SSEGL",
    "ISIN": "INE0RFP01011",
    "News": [
        {
            "Title": "Sathlokhar Synergys E&C Global Reports Strong H1 Financial Growth",
            "Summary": "Sathlokhar Synergys E&C Global reported net profit of 280 million rupees for H1, up from 164 million rupees in the same period last year. Revenue increased to 2.5 billion rupees from 1.4 billion rupees year-over-year. EBITDA rose to 378 million rupees compared to 223 million rupees previously. However, EBITDA margin declined slightly to 15.17% from 15.70% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1762787673410,
            "Source": "earnings"
        },
        {
            "Title": "Sathlokhar Synergys Secures 418.8 Million Rupees Order from Reliance Consumer Products",
            "Summary": "Sathlokhar Synergys has received an order worth 418.8 million rupees from Reliance Consumer Products. The order represents a significant business development for Sathlokhar Synergys.",
            "Sentiment": "positive",
            "PublishDate": 1761137008845,
            "Source": "order&deals"
        },
        {
            "Title": "Sathlokhar Synergys Secures ₹338.36 Crore Contract",
            "Summary": "Sathlokhar Synergys has secured a contract worth ₹338.36 crore. The company expects this contract to double its annual revenue.",
            "Sentiment": "positive",
            "PublishDate": 1755492359291,
            "Source": "stock"
        },
        {
            "Title": "Sathlokhar Synergys E&C Global Secures ₹34 Crore Order",
            "Summary": "Sathlokhar Synergys E&C Global has received a new order valued at ₹34 crore. No further details about the nature of the order or the client were provided in the news snippet.",
            "Sentiment": "positive",
            "PublishDate": 1749008499000,
            "Source": "default"
        },
        {
            "Title": "Sathlokhar Synergys E&C Global Secures 1.37 Billion Rupee Order",
            "Summary": "Sathlokhar Synergys E&C Global has announced that it has received a new order worth 1.37 billion rupees. This significant contract represents a substantial business opportunity for the company.",
            "Sentiment": "positive",
            "PublishDate": 1746715190000,
            "Source": "default"
        },
        {
            "Title": "Sathlokhar Synergys E&C Global Limited: SME Stock Soars 250% Since IPO",
            "Summary": "Sathlokhar Synergys E&C Global Limited, listed on NSE SME platform in August 2024, has delivered a 250% return to IPO allottees in less than nine months. The company recently secured a ₹219.22 crore order from Ceylon Beverage Can Private Limited and has an order book of ₹1,124.02 crore to be executed by March 31, 2026.",
            "Sentiment": "positive",
            "PublishDate": 1744633449000,
            "Source": "order&deals"
        },
        {
            "Title": "Sathlokhar Synergys E&C Global Secures New Orders Worth 851.2 Million Rupees",
            "Summary": "Sathlokhar Synergys E&C Global has announced the receipt of new orders valued at 851.2 million rupees. This development indicates a positive business momentum for the company, potentially boosting its order book and future revenue prospects.",
            "Sentiment": "positive",
            "PublishDate": 1743407163000,
            "Source": "order&deals"
        },
        {
            "Title": "Sathlokhar Synergys E&C Global Secures Order Worth 615.2 Million Rupees",
            "Summary": "Sathlokhar Synergys E&C Global, a company with a market capitalization of 11 billion rupees, has received an order valued at up to 615.2 million rupees. The company is listed as an SME (Small and Medium Enterprise) on the stock exchange.",
            "Sentiment": "positive",
            "PublishDate": 1740131780000,
            "Source": "order&deals"
        },
        {
            "Title": "Sathlokhar Synergys Secures 48 Crore Rupee Order",
            "Summary": "Sathlokhar Synergys has won a new order worth 48 crore rupees. This addition brings the company's total order book value to 981.05 crore rupees. The company currently has a market capitalization of 960 crore rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739868487000,
            "Source": "order&deals"
        },
        {
            "Title": "Sathlokhar Synergys Secures 16 Crore Rupee Order",
            "Summary": "Sathlokhar Synergys, a company with a market capitalization of 1207 crore rupees, has won a new order worth 16 crore rupees. This development is significant for the small and medium enterprise (SME) sector.",
            "Sentiment": "positive",
            "PublishDate": 1737105347000,
            "Source": "order&deals"
        },
        {
            "Title": "Sathlokhar Synergys E&C Global Secures 54 Crore Rupee Order",
            "Summary": "Sathlokhar Synergys E&C Global has announced receiving an order valued at 54 crore rupees. This development was reported as an update for small and medium enterprises (SME).",
            "Sentiment": "positive",
            "PublishDate": 1732526710000,
            "Source": "order&deals"
        },
        {
            "Title": "Sathlokhar Synergys E&C Global Ltd Secures 58.16 Crore Rupee Order",
            "Summary": "Sathlokhar Synergys E&C Global Ltd has announced winning a new order valued at 58.16 crore rupees. This development was reported in an SME update, indicating a significant business achievement for the company.",
            "Sentiment": "positive",
            "PublishDate": 1732267282000,
            "Source": "order&deals"
        }
    ]
}