{
    "Symbol": "SSWL",
    "ISIN": "INE802C01033",
    "News": [
        {
            "Title": "Steel Strips Wheels Q3 FY26 Revenue Jumps 23% to Rs 1,321 Cr",
            "Summary": "Steel Strips Wheels reported strong Q3 FY26 performance with revenue growing 23% YoY to Rs 1,321 crores, driven by record monthly sales and robust domestic demand across aluminum wheels and commercial vehicle segments.",
            "Sentiment": "positive",
            "PublishDate": 1769758954211,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Strips Wheels Reports 16% Revenue Growth in 9M FY26",
            "Summary": "Steel Strips Wheels Limited achieved ₹3,708.20 crores revenue in 9M FY26, up 16% YoY, driven by domestic demand despite export challenges and margin pressures from raw material costs.",
            "Sentiment": "positive",
            "PublishDate": 1769089789639,
            "Source": "stocks"
        },
        {
            "Title": "Steel Strips Wheels Q3 Net Profit Drops 5% YoY",
            "Summary": "Steel Strips Wheels reported a net profit of ₹49.20 crores in Q3, down from ₹51.80 crores in the same quarter last year, marking a 5.02% year-on-year decline in profitability.",
            "Sentiment": "negative",
            "PublishDate": 1769067204287,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Strips Wheels Gets ESG Score of 68.6",
            "Summary": "Steel Strips Wheels Limited receives ESG rating of 68.6 from SES ESG Research Private Limited under SEBI Regulation 30 disclosure requirements.",
            "Sentiment": "positive",
            "PublishDate": 1768891763715,
            "Source": "stocks"
        },
        {
            "Title": "Steel Strips Wheels Q3 FY26 Results Call on Jan 23",
            "Summary": "Steel Strips Wheels Limited has scheduled an analysts/investors conference call for January 23, 2026, at 3:00 PM IST to discuss Q3 FY26 results, hosted by Anand Rathi Research.",
            "Sentiment": "neutral",
            "PublishDate": 1768462059287,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Strips Wheels Gets ₹220 Target on Europe Growth",
            "Summary": "Axis Securities sets ₹220 target for Steel Strips Wheels as Europe revenue jumps to 52% in H1FY26. Company expanding alloy wheel capacity and launching aluminium knuckles vertical.",
            "Sentiment": "positive",
            "PublishDate": 1768276309449,
            "Source": "stocks"
        },
        {
            "Title": "Steel Strips Wheels Reports 15.98% Growth in Dec 2025",
            "Summary": "Steel Strips Wheels achieved gross turnover of ₹515.87 crore in December 2025, up from ₹444.81 crore in December 2024, marking 15.98% year-over-year growth and highest monthly sales.",
            "Sentiment": "positive",
            "PublishDate": 1767245259786,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steel Strips Wheels Plans Gujarat Expansion",
            "Summary": "Steel Strips Wheels announces capacity expansion with new alloy wheels unit in Gujarat and executes lease agreement with subsidiary AACL.",
            "Sentiment": "positive",
            "PublishDate": 1766969515655,
            "Source": "stocks"
        },
        {
            "Title": "Steel Strips Wheels plans Gujarat alloy wheels facility",
            "Summary": "Steel Strips Wheels Limited enters lease agreement with subsidiary AACL for ₹45.00 lakh monthly rent to establish manufacturing units for alloy wheels and aluminum steering knuckles in Gujarat.",
            "Sentiment": "positive",
            "PublishDate": 1766755816810,
            "Source": "stocks"
        },
        {
            "Title": "Steel Strips Wheels Files Share Transfer Report",
            "Summary": "Steel Strips Wheels Limited submitted its quarterly report on physical share transfer re-lodgement requests to BSE and NSE, as mandated by SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1765521978807,
            "Source": "stocks"
        },
        {
            "Title": "Steel Strips Wheels Wins $1M US Export Orders",
            "Summary": "Steel Strips Wheels secures nearly USD 1 million in new trailer wheels export orders from US clients, with shipments scheduled for December 2025 from Chennai plant.",
            "Sentiment": "positive",
            "PublishDate": 1765514709984,
            "Source": "co_actions_results"
        },
        {
            "Title": "SSWL Reports Strong Revenue Growth in November 2025 with Net Turnover Up 17.93%",
            "Summary": "SSWL achieved gross turnover of ₹505.02 crore and net turnover of ₹438.13 crore in November 2025, representing year-over-year growth of 10.98% and 17.93% respectively. The company's revenue performance shows accelerating growth momentum, with net turnover outpacing gross turnover growth significantly.",
            "Sentiment": "positive",
            "PublishDate": 1764564778144,
            "Source": "stock"
        },
        {
            "Title": "Steel Strips Wheels Reports 13% Revenue Growth Despite Export Challenges in H1 FY26",
            "Summary": "Steel Strips Wheels Limited achieved INR 2,387 crores revenue with 13% growth in H1 FY26, though EBITDA remained flat at INR 234 crores due to 26% decline in US exports from tariff impacts. The company's alloy wheels segment emerged as a standout performer reaching 36% revenue contribution with 18 lakh units sold, while the new aluminum knuckles business generated INR 33 crores from 1.24 lakh units.",
            "Sentiment": "neutral",
            "PublishDate": 1763552074333,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Corrects CFO Appointment Details",
            "Summary": "Steel Strips Wheels Limited issued a correction to its earlier announcement regarding the appointment of Rahul Kumar as Chief Financial Officer. The company corrected a typographical error in Kumar's qualifications, clarifying that he has passed Level III of the Chartered Financial Analyst (CFA) Program rather than being described as a Chief Financial Analyst. Kumar, a qualified Chartered Accountant with over 8 years of finance experience, has been with the company since 2022 and his CFO appointment became effective from November 12, 2025. His expertise includes financial reporting, internal audit, cost optimization, and digital transformation projects.",
            "Sentiment": "neutral",
            "PublishDate": 1763027259722,
            "Source": "corporate_governance"
        },
        {
            "Title": "Steel Strips Wheels Reports Q2 Results and Appoints New CFO",
            "Summary": "Steel Strips Wheels Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The company appointed Rahul Kumar as Chief Financial Officer effective November 12, 2025. Kumar is a qualified Chartered Account with CFA Level III certification and over 8 years of experience in finance and accounts. He has been associated with the company since 2022. The Board also authorized specific personnel for determining materiality of events and making disclosures to stock exchanges. The company's results include both standalone and consolidated financial statements along with auditor's limited review reports.",
            "Sentiment": "neutral",
            "PublishDate": 1762941987059,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Strips Wheels Reports Mixed Q2 Results with Revenue Growth but Declining Profitability",
            "Summary": "Steel Strips Wheels reported quarterly revenue of 12 billion rupees, up from 10.9 billion rupees year-over-year. However, the company's profitability declined with EBITDA falling to 1.12 billion rupees from 1.2 billion rupees, while EBITDA margin compressed to 9.32% from 10.96%. Net profit also decreased to 385 million rupees compared to 502 million rupees in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1762939393734,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Reports 12% Sales Growth and Record Aluminium Sales in October 2025",
            "Summary": "Steel Strips Wheels reported a 12% year-on-year sales increase in October 2025. The company achieved record aluminium sales with a 3% year-on-year growth. Net turnover reached ₹415.90 crore compared to ₹370.05 crore in October 2024.",
            "Sentiment": "positive",
            "PublishDate": 1762147327417,
            "Source": "stock"
        },
        {
            "Title": "SSWL Reports 13.39% Growth in Monthly Earnings to Rs 410 Crore",
            "Summary": "SSWL reported monthly earnings of Rs 410 crore in September 2025, representing a 13.39% increase compared to Rs 362.12 crore earned in September 2024. The company demonstrated year-over-year growth in its monthly financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1759293816672,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels CFO Naveen Sorot Resigns Due to Personal Relocation",
            "Summary": "Steel Strips Wheels Limited announced that Naveen Sorot has resigned from his position as Chief Financial Officer and Key Managerial Personnel, effective from the close of business hours on September 12, 2025. Sorot cited personal family matters requiring his relocation to Gurgaon as the reason for his departure. Following his resignation, he will cease to be a member of the Risk Management Committee of the Board of Directors, will no longer serve as Key Managerial Personnel authorized for determining materiality of events for stock exchange disclosures, and will step down from his role as Senior Management Personnel of the company.",
            "Sentiment": "neutral",
            "PublishDate": 1757682220235,
            "Source": "corporate_governance"
        },
        {
            "Title": "Steel Strip Wheels Reports 6.3% Revenue Growth with Net Turnover of ₹385.98 Crores",
            "Summary": "Steel Strip Wheels reported net turnover of ₹385.98 crores in August 2025, compared to ₹363.10 crores in August 2024, representing a 6.3% year-over-year growth. The company demonstrated revenue expansion in its latest monthly performance.",
            "Sentiment": "positive",
            "PublishDate": 1756706896059,
            "Source": "stock"
        },
        {
            "Title": "Steel Strips Wheels Reports 15% Revenue Growth in Q1 FY26, Export Segment Surges 30%",
            "Summary": "Steel Strips Wheels Limited reported strong quarterly results with revenue growing 15% year-on-year and profit after tax increasing 8% from INR46 crores to INR50 crores. Export revenue jumped 30% from INR123 crores to INR160 crores, driven by strong performance in both steel and alloy products. The alloy wheel segment's contribution to overall revenue increased from 29% to 35%. EBITDA stood at INR125 crores with 6.1% growth, though margins declined slightly due to higher raw material prices and increased maintenance expenses. The company's aluminum knuckle segment generated INR13.2 crores revenue from 50,000 units sold. Management is implementing a derisking strategy to reduce U.S. market dependence, focusing on Europe and South America markets. The company received nominations worth INR300 crores from European OEMs for steel wheels. U.S. tariff impacts remain under evaluation, with the company's U.S. export share already reduced from 70% to 52%.",
            "Sentiment": "positive",
            "PublishDate": 1754657917579,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Secures ₹300 Crore Five-Year Order",
            "Summary": "Steel Strips Wheels has won a contract worth ₹300 crore spanning five years. The order represents a significant business development for the company.",
            "Sentiment": "positive",
            "PublishDate": 1754300788412,
            "Source": "order&deals"
        },
        {
            "Title": "SSWL Board Approves Q2 2025 Results, Director Re-appointments, and European Subsidiary Plans",
            "Summary": "Steel Strips Wheels Limited's Board approved unaudited financial results for the quarter ended June 30, 2025, showing standalone revenue from operations of Rs 1,23,393.76 lakhs and profit after tax of Rs 4,993.52 lakhs. The Board also approved re-appointments of Chairman Rajinder Kumar Garg and Executive Director Manohar Lal Jain, who retire by rotation, and Independent Director Siddharth Bansal for a second five-year term from October 1, 2025 to September 30, 2030. Additionally, the company appointed Sushil Kumar Sikka as Secretarial Auditor for five years and approved plans to incorporate a wholly-owned subsidiary in the European Union. The 39th Annual General Meeting is scheduled for September 30, 2025, with book closure from September 24-30, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754039172669,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Strips Wheels Reports 18% Revenue Growth in Q1 Results",
            "Summary": "Steel Strips Wheels reported Q1 revenue of 12 billion rupees, up from 10.2 billion rupees in the same period last year. Net profit increased to 499 million rupees from 462 million rupees year-over-year. EBITDA rose to 1.22 billion rupees compared to 1.14 billion rupees previously, though EBITDA margin declined to 10.3% from 11.12% in the prior year period.",
            "Sentiment": "positive",
            "PublishDate": 1754038743967,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Limited Reports 4.48% Growth in Net Turnover for July 2025",
            "Summary": "Steel Strips Wheels Limited achieved net turnover of Rs. 378.87 Cr in July 2025 compared to Rs. 362.64 Cr in July 2024, representing a 4.48% year-over-year growth. Gross turnover increased 4.53% to Rs. 461.08 Cr from Rs. 441.08 Cr in the previous year. The company experienced strong performance in aluminum products with 29% value growth and 19% volume growth, while the tractor segment grew 9% by value and 16% by volume. However, several segments declined including passenger car steel products which fell 19% by value and 12% by volume, trucks decreased 12% by value and 5% by volume, and exports dropped 28% by volume despite 4% value growth. The 2&3 wheeler segment showed 9% value growth but 4% volume decline. Overall volume decreased 2% despite the positive value growth.",
            "Sentiment": "positive",
            "PublishDate": 1754022048681,
            "Source": "stock"
        },
        {
            "Title": "SSWL Reports Net Turnover of ₹378.87 Crore in July 2025, Up 4.48% Year-on-Year",
            "Summary": "SSWL recorded a net turnover of ₹378.87 crore in July 2025, representing a 4.48% increase compared to ₹362.64 crore in the same period last year. The company demonstrated modest growth in its monthly revenue performance.",
            "Sentiment": "positive",
            "PublishDate": 1754021659639,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Chief Human Resource Officer Pathik Almoula Resigns Due to Personal Reasons",
            "Summary": "Steel Strips Wheels Limited announced the resignation of Pathik Almoula, Chief Human Resource Officer, effective July 31, 2025. Almoula cited extreme family conditions and strong personal reasons for his departure. He submitted his resignation with a 45-day notice period starting July 1, 2025, and committed to completing key deliverables during the transition period. The company disclosed this change in senior management personnel to stock exchanges BSE and NSE.",
            "Sentiment": "neutral",
            "PublishDate": 1753971115140,
            "Source": "corporate_governance"
        },
        {
            "Title": "Steel Strips Wheels Issues Notice for Transfer of Unclaimed Shares to IEPF Authority",
            "Summary": "Steel Strips Wheels Limited has published a notice in national and regional newspapers regarding the transfer of unclaimed equity shares to the Investor Education and Protection Fund Authority (IEPFA). The notice was published in Financial Express (English) and Desh Sewak (Punjabi) on July 31, 2025. The company informed stock exchanges BSE and NSE about this newspaper publication as per regulatory requirements under SEBI listing obligations. Shareholders are being notified about shares that may be transferred to IEPF if dividends remain unclaimed for seven consecutive years.",
            "Sentiment": "neutral",
            "PublishDate": 1753962246580,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Strip Wheels Reports Decrease in Net Turnover for June 2025",
            "Summary": "Steel Strip Wheels has reported a net turnover of ₹350.67 crores in June 2025, which is a decrease from ₹358.11 crores in June 2024.",
            "Sentiment": "negative",
            "PublishDate": 1751351338000,
            "Source": "default"
        },
        {
            "Title": "SSWL Reports Strong Revenue Growth in May 2025",
            "Summary": "SSWL has reported significant year-over-year growth in both net and gross turnover for May 2025. The company achieved a net turnover of Rs 470.35 crore, up 19.97% from Rs 342.04 crore in May 2024. Gross turnover increased by 19.36% to Rs 500.76 crore, compared to Rs 419.55 crore in the same month last year.",
            "Sentiment": "positive",
            "PublishDate": 1748839699000,
            "Source": "default"
        },
        {
            "Title": "SSWL Plans Capacity Expansion for Alloy and Steel Wheels",
            "Summary": "Steel Strips Wheels Limited (SSWL) has announced plans to expand its production capacity. The company aims to increase its alloy wheels capacity by 11 lakh wheels to reach 53 lakh wheels at its Mehsana plant in Gujarat by FY26. Additionally, SSWL plans to add 65 lakh steel wheel capacity in a phased manner by FY26. These details were shared in an investor presentation.",
            "Sentiment": "positive",
            "PublishDate": 1747373620000,
            "Source": "default"
        },
        {
            "Title": "Steel Strips Wheels Reports Q4 Results and Declares Dividend",
            "Summary": "Steel Strips Wheels announced its Q4 financial results and declared a dividend. The company's Q4 EBITDA increased to 1.34 billion rupees from 1.11 billion rupees year-over-year, with EBITDA margin improving to 10.9% from 10.4%. Q4 revenue rose to 12 billion rupees from 10.7 billion rupees in the previous year. Net profit for Q4 slightly increased to 617 million rupees from 603 million rupees year-over-year. The company also declared a dividend of 1.25 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747299908000,
            "Source": "default"
        },
        {
            "Title": "SSWL Reports 25.39% YoY Growth in Net Turnover for April 2025",
            "Summary": "Steel Strips Wheels Limited (SSWL) has reported a significant increase in its net turnover for April 2025. The company achieved a net turnover of Rs. 424.11 crore, compared to Rs. 338.22 crore in April 2024, representing a year-over-year growth of 25.39%.",
            "Sentiment": "positive",
            "PublishDate": 1746159702000,
            "Source": "default"
        },
        {
            "Title": "Steel Strips Wheels: Record Monthly Sales Drive 6% Stock Surge",
            "Summary": "Steel Strips Wheels reported its highest-ever monthly sales of ₹433.70 crore in March 2025, a 27.29% YoY increase. The company saw significant growth across segments, with Alloy wheels up 50%, Truck 32%, and Tractor 23%. The stock jumped 6% to ₹188.36 on this news, ending a four-day losing streak.",
            "Sentiment": "positive",
            "PublishDate": 1743494757000,
            "Source": "result"
        },
        {
            "Title": "Steel Strips Wheels Reports 27.29% YoY Growth in Net Turnover",
            "Summary": "Steel Strips Wheels has announced its financial performance, reporting a net turnover of Rs. 433.70 crore compared to Rs. 340.72 crore in the previous year, representing a significant year-over-year growth of 27.29%.",
            "Sentiment": "positive",
            "PublishDate": 1743488645000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Ltd: Trump Tariffs Won't Impact Company's Products",
            "Summary": "Steel Strips Wheels Ltd announced that its steel and alloy wheel rims will not be affected by the 25% tariff imposed by US President Trump on certain automobile imports. The company's shares fell 3.4% to ₹181.48 despite this news.",
            "Sentiment": "neutral",
            "PublishDate": 1743058933000,
            "Source": "normal_news"
        },
        {
            "Title": "Steel Strips Wheels Reports 18.88% YoY Growth in February Net Turnover",
            "Summary": "Steel Strips Wheels Limited (SSWL) has reported a net turnover of Rs. 407.74 crore for February 2025, compared to Rs. 343 crore in February 2024. This represents a year-over-year growth of 18.88%.",
            "Sentiment": "positive",
            "PublishDate": 1740974377000,
            "Source": "result"
        },
        {
            "Title": "SSWL Reports Record Monthly Net Turnover in January 2025",
            "Summary": "Steel Strips Wheels Limited (SSWL) achieved its highest ever monthly net turnover of Rs. 409.16 crore in January 2025, compared to Rs. 380.47 crore in January 2024. This represents a year-over-year growth of 7.54%.",
            "Sentiment": "positive",
            "PublishDate": 1738384082000,
            "Source": "result"
        },
        {
            "Title": "Steel Strips Wheels Anticipates Strong Q4 Exports",
            "Summary": "Steel Strips Wheels expects Q4 to be their strongest quarter for exports due to transformations in the U.S. market. The company anticipates export orders of approximately Rs 150-160 crore in the next three months, with an order book close to Rs 175-180 crore.",
            "Sentiment": "positive",
            "PublishDate": 1737430107000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Projects Export Revenue Growth for FY '25",
            "Summary": "Steel Strips Wheels expects its export revenue to reach between Rs 550 crore and Rs 600 crore for the current financial year. The company has already achieved export revenue of Rs 404 crore in the first nine months of FY '25. Management anticipates an increase in export revenue in the upcoming quarter, attributing this to improving geopolitical conditions.",
            "Sentiment": "positive",
            "PublishDate": 1737429960000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels: Q3 Profit Drops 19.69% YoY Amid Revenue Decline",
            "Summary": "Steel Strips Wheels reported Q3 FY25 results with profit falling 19.69% YoY to ₹47.71 crore. Revenue decreased 3.21% YoY to ₹1074.68 crore. Operating income down 4.01% YoY. EPS at ₹3.04, down 19.79% YoY. Analysts maintain Strong Buy recommendation.",
            "Sentiment": "negative",
            "PublishDate": 1737178622000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Reports Q3 EBITDA and Margin Growth",
            "Summary": "Steel Strips Wheels has announced its Q3 financial results. The company's EBITDA increased slightly to 1.18 billion rupees from 1.17 billion rupees year-over-year. The EBITDA margin also improved, rising to 11.01% from 10.5% in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1737103265000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Reports Q3 Revenue Decline",
            "Summary": "Steel Strips Wheels has reported a decrease in its third-quarter revenue. The company's revenue for Q3 stood at 10.7 billion rupees, down from 11.1 billion rupees in the same period last year, representing a year-over-year decline.",
            "Sentiment": "negative",
            "PublishDate": 1737103235000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Reports Q3 Net Profit of 518 Million Rupees",
            "Summary": "Steel Strips Wheels has announced its financial results for the third quarter. The company reported a net profit of 518 million rupees, which is lower compared to the 595 million rupees reported in the same quarter of the previous year. This represents a year-over-year decline in net profit.",
            "Sentiment": "neutral",
            "PublishDate": 1737103193000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Reports 9.81% Growth in Net Turnover",
            "Summary": "Steel Strips Wheels has announced its financial performance, reporting a net turnover of Rs 364.74 crores compared to Rs 332.15 crores in the previous year, representing a year-over-year growth of 9.81%.",
            "Sentiment": "positive",
            "PublishDate": 1735714798000,
            "Source": "earnings"
        },
        {
            "Title": "Steel Strips Wheels Secures €15 Million Order",
            "Summary": "Steel Strips Wheels has won an order worth 15 million euros (approximately Rs 132 crore). This significant order represents a substantial business opportunity for the company and could potentially boost its revenue and market position.",
            "Sentiment": "positive",
            "PublishDate": 1734678060000,
            "Source": "order&deals"
        },
        {
            "Title": "Steel Strips Wheels Reports Strong Sales Growth in Tractor and Alloy Wheel Segments",
            "Summary": "Steel Strips Wheels Limited (SSWL) has reported significant year-over-year sales growth in two key segments. The company's monthly sales in the tractor segment increased by 33% in volume compared to the same period last year. Additionally, SSWL's monthly sales in the alloy wheels segment grew by 9% in volume year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1733114065000,
            "Source": "result"
        },
        {
            "Title": "Steel Strips Wheels Expects Margin Improvement from Export Business",
            "Summary": "Steel Strips Wheels anticipates an increase in profit margins as they shift towards producing heavier wheels. The company's export business is expected to contribute significantly to this margin improvement, with projections ranging from 5% to 15% in margin share.",
            "Sentiment": "positive",
            "PublishDate": 1730776099000,
            "Source": "normal_news"
        },
        {
            "Title": "Steel Strips Wheels Projects Significant Growth and Margin Improvement",
            "Summary": "Steel Strips Wheels anticipates 50% growth in the current financial year due to a backlog of orders. The company also expects another 50% growth in exports next year, which they claim is '100% guaranteed'. Additionally, they are targeting an improvement in operating margins of 15-50 basis points at scale in the next financial year.",
            "Sentiment": "positive",
            "PublishDate": 1730776013000,
            "Source": "corporate_action"
        },
        {
            "Title": "Steel Strips Wheels Forecasts Sales and Reduces Capital Expenditure",
            "Summary": "Steel Strips Wheels anticipates selling approximately 4.8 million units, with domestic demand accounting for 3.6-4 million units and exports for 0.5 million units. The company has lowered its capital expenditure forecast for the year to less than ₹200 crore, down from the initial guidance of ₹225 crore.",
            "Sentiment": "neutral",
            "PublishDate": 1730775883000,
            "Source": "corporate_action"
        }
    ]
}