{
    "Symbol": "STALLION",
    "ISIN": "INE0RYC01010",
    "News": [
        {
            "Title": "Stallion India Fluorochemicals signs ₹200 crore MoU",
            "Summary": "Stallion India Fluorochemicals Limited signed MoU with Rajasthan Government to establish HFO manufacturing plant at Bhilwara with ₹200 crore investment, production to start in 2027.",
            "Sentiment": "positive",
            "PublishDate": 1770463862968,
            "Source": "stocks"
        },
        {
            "Title": "Stallion India Fluorochemicals Rights Issue",
            "Summary": "Stallion India Fluorochemicals announces rights issue of up to 3.64 billion rupees at 99 rupees per share to raise capital for business expansion.",
            "Sentiment": "neutral",
            "PublishDate": 1770298215823,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stallion India Fluorochemicals Shares Q1FY26 Call",
            "Summary": "Stallion India Fluorochemicals Limited makes available audio recording of earnings conference call held on February 3, 2026 to discuss Q1FY26 unaudited financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770201830323,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stallion India Fluorochemicals Partners with Dubai Firm",
            "Summary": "Stallion India Fluorochemicals Limited enters strategic partnership with Sharjah Oxygen Company, Dubai for liquid helium sourcing from Qatar to strengthen high-value industrial gases portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1769770296700,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stallion India Fluorochemicals Q3 FY26 Earnings Call",
            "Summary": "Stallion India Fluorochemicals Limited announces earnings conference call scheduled for February 3, 2026 at 4:00 PM IST to discuss Q3 & 9M FY26 financial results under SEBI Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1769701869620,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stallion India Fluorochemicals Q3 Net Profit Up 13%",
            "Summary": "Stallion India Fluorochemicals reported Q3 standalone net profit of ₹111 million compared to ₹98 million in the same quarter last year, marking a 13.27% year-on-year growth.",
            "Sentiment": "positive",
            "PublishDate": 1769671219444,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stallion India Fluorochemicals Partners with SYS ADVANCE",
            "Summary": "Stallion India Fluorochemicals Limited signs MoU with Portugal-based SYS ADVANCE for technology tie-up in Helium Recovery & Liquefaction Systems, targeting space and defense applications with ISRO collaboration.",
            "Sentiment": "positive",
            "PublishDate": 1769604158185,
            "Source": "stocks"
        },
        {
            "Title": "Stallion India Board Meet Set for Jan 29 Q3 Results",
            "Summary": "Stallion India Fluorochemicals has scheduled a board meeting on January 29, 2026, to consider and approve Q3FY26 unaudited financial results for quarter and nine months ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1769439296596,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stallion India Fluorochemicals Approves ₹364 Cr Rights Issue",
            "Summary": "Stallion India Fluorochemicals board approves rights issue of equity shares worth up to ₹364 crores at face value of ₹10 each. Company forms Rights Issue Committee to oversee the process and finalize terms.",
            "Sentiment": "positive",
            "PublishDate": 1769158169430,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stallion India Gets New Industrial Plot from RIICO",
            "Summary": "Stallion India Fluorochemicals receives allotment of 28,650 sq meter industrial plot in Rajasthan's Ukhaliya area to support expansion of R-32 manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1768833292735,
            "Source": "stocks"
        },
        {
            "Title": "Stallion India Fluorochemicals Board Meet on Jan 21",
            "Summary": "Stallion India Fluorochemicals has scheduled a board meeting for January 21, 2026, to consider fund raising proposals through equity shares or other securities via appropriate modes including rights issue.",
            "Sentiment": "neutral",
            "PublishDate": 1768793975490,
            "Source": "stocks"
        },
        {
            "Title": "Stallion India Gets Green Nod for R32 Plant",
            "Summary": "Stallion India Fluorochemicals receives environmental clearance for 10,000 MT R32 manufacturing facility in Bhilwara, Rajasthan, with 46,460 MT annual hydrochloric acid by-product generation.",
            "Sentiment": "positive",
            "PublishDate": 1767001919906,
            "Source": "stocks"
        },
        {
            "Title": "Stallion India Fluorochemicals Reaffirms FY26 Revenue Growth Guidance",
            "Summary": "Stallion India Fluorochemicals has reaffirmed its revenue growth guidance of 30-35% for FY26. The reaffirmation signals the company's confidence in its business outlook and provides clarity to investors and stakeholders about expected financial performance.",
            "Sentiment": "positive",
            "PublishDate": 1764028930290,
            "Source": "stock"
        },
        {
            "Title": "Stallion India Fluorochemicals Reports Material Deviation in IPO Fund Utilization",
            "Summary": "Stallion India Fluorochemicals exceeded its IPO issue expenses by Rs. 3.99 crore, spending Rs. 15.98 crore against the prospectus allocation of Rs. 11.99 crore for the quarter ended September 30, 2025. CARE Ratings Limited, the monitoring agency, reported a 25-50% range of deviation and noted discrepancies in data submission by the company regarding fund utilization from its Rs. 160.73 crore IPO.",
            "Sentiment": "negative",
            "PublishDate": 1763174169925,
            "Source": "corporate_action"
        },
        {
            "Title": "Stallion India Stock Shows Recovery Signs After 500% Rally Followed by Sharp Correction",
            "Summary": "Stallion India Fluorochemicals experienced extreme volatility with its stock surging over 500% between mid-May and mid-October, followed by a sharp decline that included ten consecutive lower circuits, wiping out nearly half its value. The stock showed recovery signs with a 5% rise on Tuesday. The Mumbai-based company operates in fluorochemicals, selling refrigerant and industrial gases through four facilities across Maharashtra, Rajasthan, and Haryana. Revenue grew from Rs 186 crore in FY22 to Rs 379 crore in FY25, with profit after tax more than doubling to Rs 32.3 crore. The company holds approximately 10% market share in India's fluorochemicals segment and targets 30-35% CAGR over the next three years. The global fluorochemicals market is expected to grow at over 10% annually from 2024 to 2028, reaching $16 billion. Technical analysis shows the stock remains weak below key moving averages, with immediate support at Rs 190 and resistance at Rs 260.",
            "Sentiment": "neutral",
            "PublishDate": 1762923292111,
            "Source": "stock"
        },
        {
            "Title": "Stallion India Fluorochemicals Co-Promoter Sells Shares to Fund R-32 Production Facility",
            "Summary": "A co-promoter of Stallion India Fluorochemicals has sold a portion of their shareholding to raise funds. The proceeds from the share sale will be used to support the company's R-32 production facility located in Bhilwara.",
            "Sentiment": "neutral",
            "PublishDate": 1762179702246,
            "Source": "stock"
        },
        {
            "Title": "Stallion India Fluorochemicals Invests ₹200 Crores in New R-32 Production Plant",
            "Summary": "Stallion India Fluorochemicals has commenced construction of an R-32 production plant in Bhilwara, Rajasthan. The company is investing ₹200 crores in the project, which is scheduled for completion by July 2026. The plant is expected to generate revenue of ₹500 crores.",
            "Sentiment": "positive",
            "PublishDate": 1761286640952,
            "Source": "stock"
        },
        {
            "Title": "Stallion India Fluorochemicals Shares Audio Recording Link for Q2 and H1 FY 2025-26 Earnings Call",
            "Summary": "Stallion India Fluorochemicals Limited has provided stock exchanges NSE and BSE with a Google Drive link containing the audio recording of their earnings call for the quarter and half year ended September 30, 2025. The company, trading under NSE symbol STALLION and BSE scrip code 544342, submitted this recording through Company Secretary & Compliance Officer Govind Rao on October 16, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1760623958586,
            "Source": "earnings"
        },
        {
            "Title": "Stallion India Fluorochemicals Reports Strong Growth with 56% Revenue Jump in Q2",
            "Summary": "Stallion India Fluorochemicals Limited reported total revenue of INR 10,575.75 lakhs in Q2, representing a 56% year-over-year increase from INR 6,797.99 lakhs. The company's PAT surged to INR 1,141.67 lakhs compared to INR 85.12 lakhs in the previous year quarter. For the half-year period, revenue grew 53% to INR 21,630.31 lakhs while PAT increased 135% to INR 2,178.00 lakhs. The company operates four facilities across Maharashtra, Rajasthan, and Haryana, specializing in refrigerant and industrial gases. Stallion is expanding with two new facilities, including a 7,200 MT capacity plant in Andhra Pradesh and a 1,200 MT semiconductor gas facility in Khalapur. The company targets 30-35% CAGR growth over the next three years and expects strategic initiatives to improve profit margins by 3-4%. Share price stood at INR 306.05 with market capitalization of INR 2,42,933.59 lakhs.",
            "Sentiment": "positive",
            "PublishDate": 1760598230404,
            "Source": "earnings"
        },
        {
            "Title": "Stallion India Fluorochemicals Reports Strong Growth with 53% Revenue Jump in H1 FY25-26",
            "Summary": "Stallion India Fluorochemicals Limited reported significant financial growth with total revenue increasing 53% to Rs 21,630.31 lakhs in H1 FY25-26 compared to Rs 14,153.16 lakhs in the previous year. EBITDA doubled to Rs 3,013.71 lakhs from Rs 1,510.52 lakhs, while PAT surged 135% to Rs 2,178 lakhs. The company operates four facilities across Maharashtra, Rajasthan, and Haryana, specializing in refrigerant and industrial gases. Management announced plans for backward integration and expansion into semiconductor gases, projecting 30-35% CAGR growth over the next three years. The company is establishing new facilities in Mambattu, Andhra Pradesh with 7,200 MT capacity and developing specialty gas capabilities at Khalapur with 1,200 MT liquid helium processing capacity. Stallion holds approximately 10% market share in India's fluorochemicals sector and serves over 200 customers across 15+ industries including automotive, pharmaceuticals, and semiconductors.",
            "Sentiment": "positive",
            "PublishDate": 1760436509280,
            "Source": "earnings"
        },
        {
            "Title": "Stallion India Fluorochemicals Reports Strong Q2 Growth with Revenue Up 57% and Net Profit Surging to 114M Rupees",
            "Summary": "Stallion India Fluorochemicals delivered robust quarterly results with revenue increasing to 1.06 billion rupees from 676 million rupees year-over-year. Net profit surged significantly to 114 million rupees compared to 8.5 million rupees in the same period last year. EBITDA jumped to 156 million rupees from 19 million rupees year-over-year, while EBITDA margin expanded substantially to 14.75% from 2.88% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1760341618309,
            "Source": "earnings"
        },
        {
            "Title": "Stallion India Fluorochemicals Approves Unaudited Financial Results for Quarter and Half Year Ended September 30, 2025",
            "Summary": "Stallion India Fluorochemicals Limited's Board of Directors approved the company's unaudited financial results for the quarter and half year ended September 30, 2025, during a meeting held on October 13, 2025. The board meeting commenced at 11:00 AM and concluded at 1:05 PM. The company also received a Limited Review Report from its statutory auditors, Mittal & Associates Chartered Accountants. The auditors confirmed that nothing came to their attention suggesting the financial statements contain material misstatements or fail to comply with regulatory disclosure requirements under SEBI Listing Regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1760341592373,
            "Source": "earnings"
        },
        {
            "Title": "Stallion India Fluorochemicals Receives Land Allotment Approval in Bhilwara for Manufacturing Plant",
            "Summary": "Stallion India Fluorochemicals has received approval for land allotment in Bhilwara to establish a new manufacturing plant. This development represents an expansion of the company's manufacturing capabilities in the fluorochemicals sector.",
            "Sentiment": "positive",
            "PublishDate": 1756447093211,
            "Source": "stock"
        },
        {
            "Title": "Stallion India Fluorochemicals Reports 50% Revenue Growth, Announces INR 200 Crore R-32 Manufacturing Plant",
            "Summary": "Stallion India Fluorochemicals delivered strong quarterly results with total revenues of INR 110.55 crore, representing a 50.30% year-over-year increase. EBITDA stood at INR 14.37 crore, up 12.73% year-over-year, while PAT reached INR 10.36 crore, showing 21.47% improvement. The company signed a Memorandum of Understanding with the Government of Rajasthan to establish an R-32 refrigerant gas manufacturing plant in Bhilwara with an investment exceeding INR 200 crore. The facility will also produce advanced refrigerant blends including 410A, 404A, 454B, and 513A, with production expected to begin by mid-2026. The company continues advancing work on its Mambattu facility in Andhra Pradesh for HFO and specialty gas production, and expanding semiconductor and liquid helium capabilities at Khalapur. Management maintains its target of 30-35% growth over the next three years while enhancing profitability. The company expects manufacturing operations to achieve PAT margins of 24% compared to current margins of approximately 10%. Both Khalapur and Mambattu facilities are expected to become operational by November.",
            "Sentiment": "positive",
            "PublishDate": 1755184844943,
            "Source": "earnings"
        },
        {
            "Title": "Stallion India Fluorochemicals Publishes Q1 FY2026 Financial Results in Newspapers",
            "Summary": "Stallion India Fluorochemicals Limited published its unaudited financial results for the quarter ended June 30, 2025 in Mumbai newspapers (Free Press Journal and Navshakti) on August 10, 2025. The results were approved by the Board of Directors on August 8, 2025. The company informed stock exchanges NSE and BSE about the newspaper publication as required under SEBI listing regulations. Additionally, BDH Industries Limited reported quarterly results showing total income of Rs 1916.98 lakhs, net profit after tax of Rs 182.66 lakhs, and earnings per share of Rs 3.17 for the quarter ended June 30, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1754986462143,
            "Source": "earnings"
        },
        {
            "Title": "Stallion India Fluorochem Plans ₹1.20 Billion R-32 Gas Manufacturing Facility",
            "Summary": "Stallion India Fluorochem has announced plans to build a manufacturing facility for R-32 gas with a total investment of ₹1.20 billion. The company is expanding into R-32 gas production, which is commonly used as a refrigerant in air conditioning systems.",
            "Sentiment": "positive",
            "PublishDate": 1754925294147,
            "Source": "stock"
        },
        {
            "Title": "Stallion India Fluorochemicals Reports 50% Revenue Growth in Q1 FY25-26",
            "Summary": "Stallion India Fluorochemicals Limited reported strong quarterly results with total revenue increasing 50.30% year-on-year to ₹11,054.55 lakhs from ₹7,355.17 lakhs. EBITDA grew 12.73% to ₹1,436.94 lakhs, while PAT increased 21.47% to ₹1,036.32 lakhs. Managing Director Shazad Sheriar Rustomji noted that border conflict in April and early monsoons in May had a dampening effect on performance, but results align with the company's growth trajectory. The company operates as a forward integrated player in refrigeration and industrial gases, focusing on processing, blending, and distributing specialized gases across multiple sectors. Management expressed confidence in meeting FY25-26 growth targets, noting that Q1 and Q2 are typically seasonally weaker quarters compared to Q3 and Q4.",
            "Sentiment": "positive",
            "PublishDate": 1754649804509,
            "Source": "earnings"
        },
        {
            "Title": "Stallion India Fluorochemicals Reports Mixed Q1 Results with Revenue Decline",
            "Summary": "Stallion India Fluorochemicals reported Q1 net profit of 103 million rupees compared to 132 million rupees in the previous year, representing a decline. Revenue for the quarter stood at 1.10 billion rupees, down from 1.51 billion rupees year-over-year. EBITDA increased to 143 million rupees from 127 million rupees, though EBITDA margin compressed to 12.94% from 16.88% in the same period last year.",
            "Sentiment": "negative",
            "PublishDate": 1754647372954,
            "Source": "earnings"
        },
        {
            "Title": "Stallion India Fluorochem States No Impact from Recent U.S. Tariff Changes",
            "Summary": "Stallion India Fluorochem has stated that recent U.S. tariff changes will not affect the company's operations or business.",
            "Sentiment": "positive",
            "PublishDate": 1754577979603,
            "Source": "stock"
        },
        {
            "Title": "Stallion India Fluorochemicals Ltd: Stock Surges 33% on Market Debut",
            "Summary": "Stallion India Fluorochemicals Ltd stock hit the upper circuit after listing at a 33% premium to its IPO price. Shares traded at ₹126 on NSE and ₹125.99 on BSE, compared to the listing price of ₹120 and IPO price of ₹90. The IPO was oversubscribed 188.38 times.",
            "Sentiment": "positive",
            "PublishDate": 1737610390000,
            "Source": "stock_market_debut"
        },
        {
            "Title": "Stallion India Fluorochemicals: Strong IPO Debut with 33% Premium",
            "Summary": "Stallion India Fluorochemicals shares listed at ₹120 on NSE and BSE, a 33% premium over the IPO price of ₹90. The ₹200 crore IPO received strong investor response, with NII category oversubscribed 422 times. The company plans to use proceeds for working capital and facility expansion.",
            "Sentiment": "positive",
            "PublishDate": 1737606518000,
            "Source": "corporate_action"
        },
        {
            "Title": "Stallion India Fluorochemicals Ltd: Shares List at 33% Premium on Market Debut",
            "Summary": "Stallion India Fluorochemicals Ltd shares listed on NSE and BSE at Rs 120, a 33.33% premium over the IPO price of Rs 90. The IPO was oversubscribed 188.38 times, with strong demand across investor categories. Proceeds will fund working capital and plant expansion.",
            "Sentiment": "positive",
            "PublishDate": 1737606148000,
            "Source": "normal_news"
        }
    ]
}