{
    "Symbol": "STANLEY",
    "ISIN": "INE01A001028",
    "News": [
        {
            "Title": "Stanley Lifestyles Reports IPO Fund Utilization",
            "Summary": "Stanley Lifestyles filed Q3 FY26 IPO proceeds statement showing no deviation in fund usage. Net proceeds increased to INR 183.937 crore from original INR 181.085 crore due to lower issue expenses.",
            "Sentiment": "neutral",
            "PublishDate": 1770908040414,
            "Source": "stocks"
        },
        {
            "Title": "Stanley Lifestyles Q3FY26 Earnings Call on Feb 13",
            "Summary": "Stanley Lifestyles schedules earnings call for February 13, 2026, at 5:00 PM IST to discuss Q3FY26 financial results for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1770619996465,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stanley Lifestyles Executes License Agreement",
            "Summary": "Stanley Lifestyles Limited executed a license agreement with Hilker Far East Limited and Stanley Retail Limited on December 22, 2025, granting exclusive manufacturing and distribution rights for Hilker products.",
            "Sentiment": "positive",
            "PublishDate": 1766413305759,
            "Source": "co_actions_results"
        },
        {
            "Title": "Stanley Lifestyles Appoints New Joint MD",
            "Summary": "Stanley Lifestyles appointed Venkataramana Seshagirirao Gorti as Joint Managing Director for five years, bringing 34+ years of global leadership experience to drive strategic growth.",
            "Sentiment": "positive",
            "PublishDate": 1765868518512,
            "Source": "stocks"
        },
        {
            "Title": "Stanley Lifestyles Appoints Abhijeet Sonar as CEO of Stanley Retail Limited",
            "Summary": "Stanley Lifestyles Ltd has appointed Abhijeet Sonar as the new CEO of its retail subsidiary, Stanley Retail Limited. Sonar brings 27 years of experience in luxury brands and growth strategies to his new leadership role.",
            "Sentiment": "positive",
            "PublishDate": 1764932653953,
            "Source": "corporate_governance"
        },
        {
            "Title": "Stanley Lifestyles Reports 550 bps EBITDA Margin Expansion in Q2FY26 Earnings Call",
            "Summary": "Stanley Lifestyles achieved 23.5% EBITDA margins in Q2FY26, up 550 basis points year-on-year, driven by leather localization and operational efficiencies despite 2.3% revenue growth to INR 1,054 million. The luxury furniture company expanded to 73 stores with 9 new additions in H1, entered Sri Lanka market, and maintained its INR 1,000 crore revenue target within 3-4 years while diversifying into perfumes and lifestyle products.",
            "Sentiment": "positive",
            "PublishDate": 1763380194730,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Reports No Deviation in IPO Fund Utilization for Quarter Ended September 2025",
            "Summary": "Stanley Lifestyles Limited filed its quarterly statement showing no deviation in the use of IPO proceeds for the quarter ended September 30, 2025. The company raised INR 181.085 crore through its IPO on June 28, 2024, with net proceeds increasing to INR 183.937 crore due to lower actual issue-related expenses by INR 2.852 crore. The funds are allocated across three main objectives: INR 90.127 crore for opening new stores by subsidiaries, INR 39.990 crore for anchor stores, INR 10.040 crore for renovating existing stores, INR 6.659 crore for capital expenditure on machinery and equipment, and INR 37.121 crore for general corporate purposes. The company has utilized INR 62.000 crore for new stores, INR 6.659 crore for machinery purchases, and INR 33.216 crore for general corporate purposes. ICRA Limited serves as the monitoring agency for fund utilization.",
            "Sentiment": "neutral",
            "PublishDate": 1762903900872,
            "Source": "corporate_action"
        },
        {
            "Title": "Stanley Lifestyles Reports 45.3% PAT Growth in H1 FY26 with Strong Margin Expansion",
            "Summary": "Stanley Lifestyles Limited announced its financial results for the quarter and half-year ended September 30, 2025. For H1 FY26, revenue from operations reached ₹2,141 million, registering 5.1% YoY growth driven by retail business expansion. EBITDA margins improved by 320 basis points to 22.1% from 18.9% in H1 FY25, while PAT grew 45.3% to ₹138 million compared to ₹95 million in H1 FY25. The company expanded its retail presence by adding 7 COCO and 2 FOFO stores during H1 FY26, with retail business contributing nearly 70% of total revenue. Stanley entered international markets through an exclusive Distribution and License Agreement with Singer (Sri Lanka) PLC, planning to open eight stores over three years in Sri Lanka. The company launched Stanley Boutique Homes as a sub-brand offering complete luxury home solutions, with its first store inaugurated in Kanakapura road, Bengaluru. Stanley is also diversifying into Premium Perfumes as a new lifestyle category. For Q2 FY26 specifically, revenue was ₹1,054 million with 2.3% YoY growth, EBITDA margins improved by 550 basis points to 23.5%, and PAT grew 5.3% to ₹60 million. The company operates 68 retail outlets across major Indian cities and has two manufacturing facilities in Bengaluru spanning over 300,000 square feet.",
            "Sentiment": "positive",
            "PublishDate": 1762881122856,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Reports Quarterly Results and Approves Slump Sale Agreement",
            "Summary": "Stanley Lifestyles Limited announced its unaudited financial results for the quarter and half year ended September 30, 2025. The Board of Directors approved both standalone and consolidated financial results based on the Audit Committee's recommendation. Additionally, the Board granted in-principle approval for entering into a Slump Sale Agreement with wholly owned subsidiaries of Stanley Retail Limited, namely Sana Lifestyles Limited, Shrasta Decor Private Limited, and Staras Seating Private Limited. The company operates in the business of manufacturing and trading of furniture and leather products. The Board meeting was held on November 11, 2025, commencing at 12:45 PM and concluding at 2:30 PM.",
            "Sentiment": "neutral",
            "PublishDate": 1762861829505,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Reports Strong Q2 Performance with EBITDA Rising to 248M Rupees",
            "Summary": "Stanley Lifestyles reported quarterly EBITDA of 248 million rupees compared to 185 million rupees in the same period last year. The company's EBITDA margin improved to 23.53% from 17.96% year-over-year, indicating enhanced profitability and operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1762853069823,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Reports Mixed Q2 Results with Revenue Growth and Profit Decline",
            "Summary": "Stanley Lifestyles reported Q2 consolidated net profit of 56 million rupees, down from 62 million rupees in the same period last year. The company's Q2 revenue increased to 1.05 billion rupees compared to 1.03 billion rupees year-over-year, showing revenue growth despite the decline in profitability.",
            "Sentiment": "neutral",
            "PublishDate": 1762852523251,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Schedules Earnings Call for Quarter Ended September 30, 2025",
            "Summary": "Stanley Lifestyles Limited has announced an earnings call scheduled for Wednesday, November 12, 2025, at 5:30 PM IST to discuss financial results for the quarter and half year ended September 30, 2025. The call will be hosted by Managing Director Sunil Suresh, Whole-Time Director Shubha Sunil, and Group Chief Financial Officer JK Sharath. Emkay Global Financial Services Ltd is organizing the conference call with multiple dial-in numbers provided for domestic and international participants across various countries including the US, UK, Australia, Germany, and others.",
            "Sentiment": "neutral",
            "PublishDate": 1762535979130,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyle Partners with Singer (Sri Lanka) PLC for Exclusive Distribution Deal",
            "Summary": "Stanley Lifestyle has entered into an exclusive agreement with Singer (Sri Lanka) PLC to market and distribute Stanley Lifestyle products under the 'Sofas & More' brand in Sri Lanka. The partnership will enable Singer to serve as the exclusive distributor for Stanley's furniture products in the Sri Lankan market.",
            "Sentiment": "positive",
            "PublishDate": 1759153038082,
            "Source": "order&deals"
        },
        {
            "Title": "FSSAI Launches Special Licensing Portal for Ayurveda Food Products; U.S. Implements 30% Tariff on Upholstered Furniture",
            "Summary": "The Food Safety and Standards Authority of India (FSSAI) has opened a special licensing portal specifically for Ayurveda food products, which affects companies like Dabur, Patanjali, and Emami. Separately, the United States has imposed a 30% tariff on upholstered furniture imports, impacting Stanley Lifestyles.",
            "Sentiment": "neutral",
            "PublishDate": 1758857459677,
            "Source": "sectoral"
        },
        {
            "Title": "Stanley Lifestyles Reduces Product Prices Across Stanley Boutique Format",
            "Summary": "Stanley Lifestyles Limited announced a revision in product prices across its 'Stanley Boutique' retail format, effective September 23, 2025. The company has implemented a price decrease in anticipation of the upcoming festive season.",
            "Sentiment": "positive",
            "PublishDate": 1758610618284,
            "Source": "stock"
        },
        {
            "Title": "Stanley Lifestyles Reduces Product Prices Across 'Sofas & More' Retail Format",
            "Summary": "Stanley Lifestyles Limited announced a revision in product prices across its 'Sofas & More' retail format, effective from September 12, 2025. The company has decided to decrease prices due to the upcoming festive season. The announcement was made through a regulatory disclosure signed by Managing Director Sunil Suresh.",
            "Sentiment": "positive",
            "PublishDate": 1757600610820,
            "Source": "stock"
        },
        {
            "Title": "Stanley Lifestyles Subsidiary Faces ₹11.2 Lakh Penalties for Regulatory Violations",
            "Summary": "Stanley Lifestyles Limited disclosed that its wholly owned subsidiary Stanley OEM Sofas Limited has been penalized by the Regional Director South East Region, Ministry of Corporate Affairs, Hyderabad. The subsidiary received two separate penalties totaling ₹11.2 lakh for regulatory violations. The first penalty of ₹10 lakh was imposed under Section 188 of the Companies Act for entering into related party transactions without requisite Board/Shareholder approval, with directors Mrs. Shubha Sunil and Mr. Sunil Suresh each fined ₹5 lakh. The second penalty of ₹1.2 lakh was levied under Section 405 for failure to disclose MSME dues in financial statements for FY 2019-20 and 2020-21, with the subsidiary fined ₹40,000 and both directors fined ₹40,000 each. Former director Mr. Ananthakrishnan Viswanath had penalties set aside in both cases as he was not involved in day-to-day management. The company stated there is no material impact on its financial or operational activities beyond the imposed penalties.",
            "Sentiment": "negative",
            "PublishDate": 1757336888496,
            "Source": "corporate_governance"
        },
        {
            "Title": "Stanley Lifestyles Appoints New Secretarial Auditor, Approves Board Report and AGM Notice",
            "Summary": "Stanley Lifestyles Limited's Board of Directors held a meeting on August 28, 2025, approving several key items. The company approved its Board's Report and Business Responsibility and Sustainability Report for the financial year ended March 31, 2025. The Board appointed Mr. Vijaykrishna K T as Secretarial Auditor for a five-year term from FY 2025-26 to FY 2029-30, subject to shareholder approval. Mr. Vijaykrishna has 38 years of experience in corporate laws, IPOs, mergers & acquisitions, and corporate restructuring. The Board also approved the notice for the 18th Annual General Meeting scheduled for September 26, 2025, to be conducted through video conferencing.",
            "Sentiment": "neutral",
            "PublishDate": 1756367410198,
            "Source": "corporate_action"
        },
        {
            "Title": "Stanley Lifestyles Reports 7.9% Revenue Growth to Rs 1,087 Million in Q1 FY26",
            "Summary": "Stanley Lifestyles Limited reported revenue from operations of Rs 1,087 million for the quarter ended June 30, 2025, representing a 7.9% increase over Q1 FY25. The retail business contributed Rs 640 million, up 25.2% year-on-year, led by Stanley Level Next growing 20% and Sofas & More growing 50.7%. The company operates 68 stores comprising 43 COCO stores and 25 FOFO stores, with COCO stores accounting for 60% of revenue. Gross profit increased 16.6% to Rs 624 million with margins expanding 428 basis points to 57.4%. EBITDA grew 11.9% to Rs 225 million with a margin of 2.7%. PAT increased more than 2x to Rs 78 million with a margin of 7.2%. The company added two new Sofas & More stores in Surat and Mangalore during the quarter. Stanley Retail Limited acquired complete ownership of Shrasta Decor Private Limited to strengthen presence in Hyderabad. The company plans to open 15 new stores in FY26 and appointed J.K. Sharath as Group CFO. Management noted that global trade developments and US tariff policies have created cautious consumer sentiment, though their product portfolio is not directly exposed to categories impacted by US tariffs.",
            "Sentiment": "positive",
            "PublishDate": 1755525007384,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Receives Show Cause Notices Over Related Party Transaction Violations at Subsidiary",
            "Summary": "Stanley Lifestyles Limited disclosed receiving Show Cause Notices from the Registrar of Companies Bangalore against directors and an ex-director of its step-down subsidiary, Sana Lifestyles Limited. The notices allege violations of Sections 188 and 184 of the Companies Act, 2013 regarding substantial related party transactions during FY 2019-20 and FY 2020-21. The violations involve transactions undertaken without proper Board approvals and inadequate disclosure in AOC-2. The authority has directed submission of domestic transfer pricing audit reports and proof of arm's length basis. Expected financial implications include potential penalties of ₹5,00,000 each for Mrs. Shubha Sunil, Mr. Sunil Suresh, and Mr. Aboothahir Khan Saleem. No penalty has been imposed at this stage, and the subsidiary is evaluating appropriate representations.",
            "Sentiment": "negative",
            "PublishDate": 1755501715456,
            "Source": "corporate_governance"
        },
        {
            "Title": "Stanley Lifestyles Plans Aggressive FY26 Expansion with 15 New Stores",
            "Summary": "Stanley Lifestyles has outlined an aggressive expansion strategy for FY26, targeting the addition of 15 new stores. The company plans to strengthen its COCO (Company Owned Company Operated) model and push into the Hyderabad market. The expansion strategy includes leveraging integrated manufacturing efficiencies to drive margins and achieve double-digit profit growth despite facing macro headwinds.",
            "Sentiment": "positive",
            "PublishDate": 1755101303814,
            "Source": "stock"
        },
        {
            "Title": "Stanley Lifestyles Reports No Deviations in IPO Fund Utilization for Quarter Ended June 2025",
            "Summary": "Stanley Lifestyles Limited confirmed no deviations or variations in the utilization of net proceeds from their Initial Public Offering for the quarter ended June 30, 2025. The company raised Rs. 200 crore through the IPO, which was conducted from June 21-25, 2024. Out of the total proceeds, Rs. 71.901 crore has been utilized by the end of the quarter, leaving Rs. 128.099 crore unutilized. The funds are being deployed for investment in subsidiaries for opening new stores (Rs. 90.127 crore allocated), anchor stores (Rs. 39.990 crore), store renovations (Rs. 10.040 crore), capital expenditure for machinery (Rs. 6.659 crore - fully utilized), and general corporate purposes (Rs. 34.269 crore). The unutilized proceeds totaling Rs. 133.32 crore are invested in fixed deposits with IndusInd Bank at 7.70-7.75% interest rates. ICRA Limited, the monitoring agency, confirmed the utilization is in line with the stated objectives. The company expects to utilize remaining funds for new stores and renovations by Q2 FY 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1755083944035,
            "Source": "stock"
        },
        {
            "Title": "Stanley Lifestyles Reports 7.9% Revenue Growth in Q1 FY26, PAT Doubles to Rs 78 Million",
            "Summary": "Stanley Lifestyles announced quarterly results with revenue from operations reaching Rs 1,087 million, representing a 7.9% year-over-year increase. The company's profit after tax more than doubled to Rs 78 million compared to Rs 38 million in the previous year quarter, with PAT margin expanding to 7.2%. Gross profit grew 16.6% to Rs 624 million, with margins improving by 428 basis points to 57.4%. EBITDA increased 11.9% to Rs 225 million with a margin of 20.7%. The retail business contributed Rs 640 million, up 25.2% year-over-year, driven by Stanley Level Next growing 20.0% and Sofas & More growing 50.7%. The company operates 68 stores comprising 43 company-owned and 25 franchise stores, with two new Sofas & More stores opened in Surat and Mangalore during the quarter. Stanley Retail Limited acquired complete ownership of Shrasta Decor Private Limited to strengthen presence in Hyderabad. The company appointed J K Sharath as Group CFO and shipped its first export order to Germany. Management noted challenges from global trade developments, US tariff policies affecting market sentiment, property handover delays, and IT sector layoffs impacting certain urban markets, while remaining on track to open 15 new stores in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1755081454486,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Announces Key Leadership Changes and Q2 2025 Financial Results",
            "Summary": "Stanley Lifestyles Limited announced multiple leadership appointments and departures. Mr. Rasmi Ranjan Naik was appointed as Company Secretary and Compliance Officer, bringing 25 years of experience in corporate governance and legal compliance. Mr. Pradeep Kumar Mishra resigned from his position as Chief Financial Officer, with his resignation taking immediate effect. Mr. J K Sharath was appointed as the new Chief Financial Officer and designated as Group CFO of Stanley Group, contributing over 24 years of financial leadership experience across audit, strategy, and stakeholder management. The company also approved its unaudited standalone and consolidated financial results for the quarter ended June 30, 2025. The Risk Management Committee was reconstituted with three members including the new CFO. The auditors expressed an unmodified opinion on the quarterly financial results, which were reviewed by the Audit Committee and approved by the Board of Directors.",
            "Sentiment": "neutral",
            "PublishDate": 1755076909444,
            "Source": "corporate_governance"
        },
        {
            "Title": "Stanley Lifestyles Reports 66% Jump in Q1 Net Profit to 58M Rupees",
            "Summary": "Stanley Lifestyles posted a net profit of 58 million rupees in Q1, representing a significant increase from 35 million rupees in the same period last year. The company's revenue grew to 506 million rupees compared to 495 million rupees year-over-year, marking modest top-line growth alongside strong bottom-line performance.",
            "Sentiment": "positive",
            "PublishDate": 1755076435679,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Receives Show Cause Notices for Subsidiary Directors; Makes ₹15 Crore Store Investment",
            "Summary": "Stanley Lifestyles Limited received two Show Cause Notices from the Registrar of Companies Bangalore against directors of its step-down subsidiary Sana Lifestyles Limited. The first notice alleges non-compliance with related party transaction regulations during FY 2018-19, while the second relates to violations during FY 2021-22. Both cases involve transactions undertaken without proper board approvals and inadequate disclosures. Four directors face potential penalties of ₹5 lakh each: Mrs. Shubha Sunil, Mr. Sunil Suresh, Mr. Aboothahir Khan Saleem, and Mrs. Sonakshi Sunil. No penalties have been imposed yet, and the subsidiary is evaluating appropriate responses. Separately, Stanley Retail Limited, a subsidiary of Stanley Lifestyles, made a payment of ₹15 crore towards an upcoming store in Hyderabad.",
            "Sentiment": "negative",
            "PublishDate": 1755015523809,
            "Source": "corporate_governance"
        },
        {
            "Title": "Stanley Lifestyles to Increase Product Prices by 4%-6%",
            "Summary": "Stanley Lifestyles has announced plans to raise the prices of its products by 4% to 6% starting July 1. The company cites increasing input costs as the reason for this price adjustment.",
            "Sentiment": "neutral",
            "PublishDate": 1751290677000,
            "Source": "default"
        },
        {
            "Title": "Stanley Lifestyles Reports Q4 Financial Results",
            "Summary": "Stanley Lifestyles has released its Q4 financial results. The company reported a revenue of 1.13 billion rupees, down from 1.19 billion rupees in the same quarter last year. EBITDA for Q4 was 227 million rupees, compared to 271 million rupees year-over-year. The EBITDA margin decreased to 20.12% from 22.73% in the previous year. Consolidated net profit for Q4 was 105 million rupees, slightly up from 102 million rupees year-over-year, and an increase from 86 million rupees quarter-over-quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1748276490000,
            "Source": "result"
        },
        {
            "Title": "Stanley Lifestyles Reports Slight Decline in Q3 EBITDA and Margin",
            "Summary": "Stanley Lifestyles has reported its Q3 financial results. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) for the quarter was 205 million rupees, compared to 206 million rupees in the same quarter last year. The EBITDA margin decreased slightly to 18.7% from 19.2% year-over-year.",
            "Sentiment": "neutral",
            "PublishDate": 1739379102000,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Reports Q3 Revenue Growth",
            "Summary": "Stanley Lifestyles has reported a revenue of 1.1 billion rupees for the third quarter, showing an increase from 1.07 billion rupees in the same period last year.",
            "Sentiment": "positive",
            "PublishDate": 1739379094000,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Reports Increased Q3 Consolidated Net Profit",
            "Summary": "Stanley Lifestyles has announced its Q3 consolidated net profit, which stands at 86 million rupees. This represents a year-over-year increase from 69 million rupees and a quarter-over-quarter increase from 62 million rupees.",
            "Sentiment": "positive",
            "PublishDate": 1739379087000,
            "Source": "earnings"
        },
        {
            "Title": "Stanley Lifestyles Invests 479.7 Million Rupees in Stanley Retail Through Rights Issue",
            "Summary": "Stanley Lifestyles has made an additional investment of 479.7 million rupees in its subsidiary, Stanley Retail, through a rights issue. This move indicates the company's commitment to strengthening its retail operations and potentially expanding its market presence.",
            "Sentiment": "positive",
            "PublishDate": 1732282888000,
            "Source": "corporate_action"
        },
        {
            "Title": "Stanley Lifestyles: Mukul Agrawal Acquires 1.58% Stake in Q2",
            "Summary": "Ace investor Mukul Agrawal purchased 9,00,000 shares (1.58% stake) in Stanley Lifestyles during Q2 FY2024. The company's stock has gained over 30% since its IPO in June 2023, currently trading around ₹485.90.",
            "Sentiment": "positive",
            "PublishDate": 1729661884000,
            "Source": "normal_news"
        }
    ]
}