{
    "Symbol": "STARCEMENT",
    "ISIN": "INE460H01021",
    "News": [
        {
            "Title": "Star Cement Declares Rs 1 Per Share Dividend",
            "Summary": "Star Cement has announced a dividend payment of Rs 1 per share to its shareholders, reflecting the company's commitment to returning value to investors through regular dividend distributions.",
            "Sentiment": "positive",
            "PublishDate": 1770368128260,
            "Source": "co_actions_results"
        },
        {
            "Title": "Star Cement Q3 Net Profit Surges 723% to ₹749M",
            "Summary": "Star Cement reported consolidated net profit of ₹749 million in Q3, marking a significant increase from ₹91 million in the same quarter last year, representing strong operational performance.",
            "Sentiment": "positive",
            "PublishDate": 1770368066915,
            "Source": "co_actions_results"
        },
        {
            "Title": "Star Cement Board Meet on Feb 6 for Q3FY26 Results",
            "Summary": "Star Cement Limited has scheduled a board meeting on February 06, 2026, to consider Q3FY26 unaudited financial results and potential 2nd interim dividend for FY2025-26.",
            "Sentiment": "neutral",
            "PublishDate": 1769589251093,
            "Source": "co_actions_results"
        },
        {
            "Title": "Star Cement Expects Strong Demand Growth in Q3 and Beyond",
            "Summary": "Star Cement anticipates high demand growth for the third quarter and subsequent periods. The company's outlook suggests positive business expectations for its cement operations in the coming quarters.",
            "Sentiment": "positive",
            "PublishDate": 1763556310552,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement Shareholders Approve Fund Raising Through Securities Issuance via Postal Ballot",
            "Summary": "Star Cement Limited's shareholders approved a special resolution for raising funds through issuance of securities via postal ballot conducted through remote e-voting from October 19 to November 17, 2025. The resolution received overwhelming support with 99.89% of valid votes cast in favor, with 380 members representing 332,273,828 equity shares participating in the voting process.",
            "Sentiment": "positive",
            "PublishDate": 1763467027280,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement Reports Strong Q2 FY26 Results with 26% Revenue Growth and Plans Bihar Expansion",
            "Summary": "Star Cement Limited reported quarterly results for the period ended September 30, 2025. Revenue increased to Rs. 811 crores from Rs. 642 crores in the same quarter last year. EBITDA rose significantly to Rs. 194 crores compared to Rs. 97 crores previously. Profit after tax jumped to Rs. 71 crores from Rs. 6 crores in the prior year quarter. Cement sales volume grew to 10.73 lakh tons from 9.62 lakh tons, while clinker sales increased to 1.01 lakh tons from 0.15 lakh tons. The company plans to commission its Silchar project within three months and is considering a 2 million ton grinding unit in Bihar's Begusarai, taking advantage of the state's 300% SGST benefit policy. Star Cement also announced plans for a 4 million ton capacity plant in Rajasthan's Nimbol area and has acquired land and mining permissions for future expansion in Umrangso, Assam. The company booked Rs. 56 crores in incentives during the quarter and expects fuel costs to remain stable at Rs. 1.25 per kcal for the next five months due to existing coal stock.",
            "Sentiment": "positive",
            "PublishDate": 1762512137973,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement Provides Multi-Year Business Guidance Including Volume and Revenue Targets",
            "Summary": "Star Cement shared its business guidance across multiple fiscal years. For FY26, the company expects incentives of ₹180-190 crores, volume of 5.4-5.5 million tons, and EBITDA of ₹1,500-1,550 per ton with potential to exceed this range. The company projects 12% volume growth for FY27 and anticipates ₹80-90 crores in revenue from new products including AAC blocks, construction chemicals, and RMC. Star Cement targets expanding its capacity to 18-20 million tons by FY29-30.",
            "Sentiment": "positive",
            "PublishDate": 1762486866152,
            "Source": "stock"
        },
        {
            "Title": "Star Cement Reports Q2 Results, Board Approves Fundraising Plan Up to ₹1,500 Crore",
            "Summary": "Star Cement Limited's Board approved unaudited standalone and consolidated financial results for the second quarter and half year ended September 30, 2025. The company's consolidated revenue from operations was ₹728.32 crore for Q2 compared to ₹591.59 crore in the previous year quarter. Net profit after tax stood at ₹30.50 crore for Q2 versus ₹22.29 crore in the corresponding period last year. For the half year, consolidated revenue reached ₹1,399.81 crore against ₹1,172.20 crore in the previous year. The Board had earlier decided on October 14, 2025 to raise funds up to ₹1,500 crore through various modes including private placement, preferential issue, rights issue, or qualified institutional placement. Shareholder approval is being sought through postal ballot with e-voting that commenced on October 19, 2025 and will end on November 17, 2025. The company operates primarily in cement manufacturing and sales of cement-related products.",
            "Sentiment": "positive",
            "PublishDate": 1762249832039,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement Reports Strong Q2 Performance with Net Profit Surging to 720M Rupees",
            "Summary": "Star Cement delivered robust quarterly results with consolidated net profit jumping to 720 million rupees from 57 million rupees year-over-year. Revenue increased to 8 billion rupees compared to 6.4 billion rupees in the same period last year. The company's EBITDA rose significantly to 1.9 billion rupees from 955 million rupees year-over-year, while EBITDA margin expanded to 23.45% from 14.9% in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1762247335970,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement Announces Postal Ballot for ₹1,500 Crore Fund Raising Through Securities Issuance",
            "Summary": "Star Cement Limited has announced a postal ballot through remote e-voting for shareholders to approve raising funds up to ₹1,500 crores through issuance of various securities including equity shares, convertible instruments, debentures, and depository receipts. The e-voting period runs from October 19, 2025 to November 17, 2025, with results to be declared by November 19, 2025. The Board approved this fund raising proposal at its meeting on October 14, 2025. The funds will be utilized for organic and inorganic growth opportunities, subsidiary investments, debt repayment, working capital requirements, capital expenditure, and general corporate purposes. The securities can be issued through multiple methods including public offerings, private placements, rights offerings, or qualified institutional placements (QIP). National Securities Depository Limited (NSDL) will facilitate the e-voting process, and MKB & Associates has been appointed as scrutinizer for the postal ballot process.",
            "Sentiment": "neutral",
            "PublishDate": 1760704816694,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement Board Approves Fund Raising of Up to ₹1,500 Crore Through Multiple Options",
            "Summary": "Star Cement Limited's Board of Directors approved raising funds up to ₹1,500 crore through various methods including private placement, preferential issue, rights issue, or qualified institutions placement. The board authorized a Fund Raising Committee to handle all matters related to the proposed fund raise. The company will seek shareholder approval through a postal ballot process, with the notice to be submitted to stock exchanges. The board meeting was held on October 14, 2025, lasting from 2:30 PM to 3:35 PM.",
            "Sentiment": "positive",
            "PublishDate": 1760437965884,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement Schedules Meeting to Discuss Fundraising Plans",
            "Summary": "Star Cement has scheduled a meeting on October 14, 2025, to discuss fundraising plans.",
            "Sentiment": "neutral",
            "PublishDate": 1760006290973,
            "Source": "stock"
        },
        {
            "Title": "Star Cement Promoter Group Increases Stake to 21.38% Through Market Purchases",
            "Summary": "The promoter group of Star Cement Limited, led by Mahabir Prasad Agarwal and 18 other persons acting in concert, increased their collective shareholding from 20.687% to 21.378%. The group acquired 27,91,191 shares (0.691% stake) through open market purchases and inter-se transfers between April 1, 2023, and September 25, 2025. The total shareholding now stands at 8,64,05,345 shares out of Star Cement's total equity capital of 404,180,417 shares. Key entities in the group include Narantak Dealcomm Ltd, Subham Capital Pvt Ltd, various family trusts, and individual family members of the Agarwal family.",
            "Sentiment": "neutral",
            "PublishDate": 1758969735632,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement Re-appoints Three Independent Directors and Names New Secretarial Auditor",
            "Summary": "Star Cement Limited shareholders approved key appointments at the company's 24th Annual General Meeting held on September 23, 2025. The company re-appointed three Independent Directors for five-year terms: Mr. Vivek Chawla (April 1, 2026 to March 31, 2031), Mr. Jagdish Chandra Toshniwal (April 1, 2026 to March 31, 2031), and Mr. Ramit Budhraja (May 1, 2026 to April 30, 2031). Additionally, M/s. MKB & Associates was appointed as Secretarial Auditors for a five-year term from financial year 2025-26 to 2029-30.",
            "Sentiment": "neutral",
            "PublishDate": 1758625314233,
            "Source": "corporate_governance"
        },
        {
            "Title": "Star Cement Ordered to Pay ₹10.62 Lakh Damages for EPF Non-Compliance",
            "Summary": "Star Cement Limited received an order from the Regional Provident Fund Commissioner – II, Shillong on August 26, 2025, directing the company to pay damages of ₹10,62,847 under Section 14B of the EPF & MP Act. The penalty relates to compliance issues with the Employees' Provident Fund and Miscellaneous Provisions Act. The company has stated that there is no financial impact on its operations or other activities from this penalty amount.",
            "Sentiment": "negative",
            "PublishDate": 1756216204421,
            "Source": "stock"
        },
        {
            "Title": "Star Cement North East Wins Preferred Bidder Status for Limestone Block",
            "Summary": "Star Cement North East has been declared the preferred bidder for a limestone block. The designation positions the company to potentially secure the limestone mining rights, which would support its cement manufacturing operations by providing access to key raw materials.",
            "Sentiment": "positive",
            "PublishDate": 1756080678377,
            "Source": "stock"
        },
        {
            "Title": "Star Cement Subsidiary Wins Bid for 271 Million Tonne Limestone Block in Rajasthan",
            "Summary": "Star Cement North East Limited has been declared the preferred bidder for the Parewar limestone block in Jaisalmer, Rajasthan, following government e-auctions. The 960-hectare block contains an estimated 271.38 million tonnes of limestone resources. The mining lease will enhance Star Cement's long-term raw material security once clearances and agreements are completed. Star Cement reported ₹2,910 crore turnover in financial year 2024, operates with 7.7 MTPA grinding capacity and 6.1 MTPA clinker capacity, and holds 26.5% market share in the northeastern region. The company has planned ₹380 crore capex for the second half of the current financial year and two upcoming units in Assam. Star Cement shares closed at ₹279.95, declining 4.40% on the BSE.",
            "Sentiment": "positive",
            "PublishDate": 1755879535901,
            "Source": "stock"
        },
        {
            "Title": "Star Cement North East Selected as Preferred Bidder for Limestone Block",
            "Summary": "Star Cement North East has been chosen as the preferred bidder for a limestone block. This selection positions the company to potentially secure access to limestone resources, which are essential raw materials for cement manufacturing operations.",
            "Sentiment": "positive",
            "PublishDate": 1755873112842,
            "Source": "stock"
        },
        {
            "Title": "Star Cement Reports Strong Q1 Performance with Revenue Up 15% and Plans Major Capacity Expansion",
            "Summary": "Star Cement Limited reported significant financial improvements in Q1 FY2026, with revenue rising to Rs. 847 crores from Rs. 736 crores year-over-year. EBITDA nearly doubled to Rs. 230 crores from Rs. 118 crores, while profit after tax increased to Rs. 98 crores from Rs. 31 crores. EBITDA per ton improved substantially to Rs. 1,774 from Rs. 1,018. The company increased cement sales to 12.22 lakh tons and clinker production to 8.90 lakh tons. Star Cement maintains a 27-28% market share in the Northeast region, which represents 73% of its sales. The company has aggressive expansion plans including a 2 million ton capacity in Silchar expected by January/February 2026, another 2 million tons in Jorhat by 2027, and a major 3 million ton clinker plant with 4 million ton grinding unit in Rajasthan requiring Rs. 2,400-2,500 crores investment. The company also commissioned an AAC block plant and is pursuing green energy initiatives including 40 megawatts of solar power. Management expects Rs. 230-250 crores in incentives for FY2026 and projects the Northeast market to grow at 10% CAGR over the next 3-4 years.",
            "Sentiment": "positive",
            "PublishDate": 1755596842495,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement Reports 94% EBITDA Growth in Q1 FY26 with Strong Volume Expansion",
            "Summary": "Star Cement Limited reported strong quarterly results with sales volume growing 6% year-over-year to 12.22 lakh tons. Revenue increased 21% to INR 912 crores while EBITDA surged 94% to INR 230 crores, achieving an industry-leading EBITDA per ton of INR 1,774. The company's profit after tax jumped 182% to INR 98 crores. Key operational highlights include AAC block commercial production starting from June 2nd, clinker sales of 74,000 tons, and highest ever first quarter non-trade sales. The company commissioned a 24 TPH AFR system for its new clinker unit and achieved 18.5% thermal substitution rate. Star Cement expects state subsidy disbursement of INR 150 crores in the second quarter and anticipates production from its Silchar project during the peak fourth quarter period. The company maintains strong market presence with 27% market share in North-East India and plans to expand cement capacity to 12 MTPA by FY27.",
            "Sentiment": "positive",
            "PublishDate": 1755183899053,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement Reports Q1 FY2026 Results and Declares 100% Interim Dividend",
            "Summary": "Star Cement Limited announced its unaudited financial results for Q1 FY2026 ended June 30, 2025. On a standalone basis, the company reported revenue from operations of Rs 54,473.50 lakhs compared to Rs 47,174.58 lakhs in the same quarter last year. Net profit after tax stood at Rs 2,418.95 lakhs versus a loss of Rs 1,313.28 lakhs in Q1 FY2025. On a consolidated basis, revenue from operations reached Rs 91,199.25 lakhs compared to Rs 75,100.57 lakhs in the previous year quarter, with net profit of Rs 9,816.46 lakhs against Rs 3,098.92 lakhs last year. The Board declared an interim dividend of 100% (Re. 1 per share) for FY 2025-26, with August 14, 2025 set as the record date. The dividend will be paid within 30 days. Additionally, Star Smart Building Solutions Limited commenced production of Autoclaved Aerated Concrete Block and Construction chemicals at Guwahati on June 2, 2025.",
            "Sentiment": "positive",
            "PublishDate": 1754640339904,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement Reports Strong Q1 Performance with Net Profit Surging to 985M Rupees",
            "Summary": "Star Cement delivered robust quarterly results with consolidated net profit reaching 985 million rupees compared to 310 million rupees in the same period last year. The company's EBITDA grew significantly to 2.28 billion rupees from 1.16 billion rupees year-over-year, while EBITDA margin expanded to 25.02% from 15.44%. Revenue increased to 9.1 billion rupees versus 7.5 billion rupees in the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1754639815475,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement's Chief Mineral Resources Officer Resigns",
            "Summary": "Star Cement has announced that its Chief Mineral Resources Officer has resigned from the company. The resignation is effective from July 2 and was cited as being for personal reasons.",
            "Sentiment": "neutral",
            "PublishDate": 1751547705000,
            "Source": "default"
        },
        {
            "Title": "Star Cement Begins Commercial Production of AAC Blocks in Assam",
            "Summary": "Star Cement has announced the successful commencement of commercial production of AAC (Autoclaved Aerated Concrete) blocks at its manufacturing unit located in Chamata Pathar, Sonapur, Assam.",
            "Sentiment": "positive",
            "PublishDate": 1748868605000,
            "Source": "default"
        },
        {
            "Title": "Star Cement: Q4 Profit and EBITDA Surge Over 40% YoY",
            "Summary": "Star Cement reported a 40.5% YoY increase in Q4 consolidated net profit to ₹123.2 crore. Revenue grew 15.2% to ₹1,052 crore. EBITDA jumped 46.1% to ₹262.6 crore, with margin expanding to 25% from 19.7% last year.",
            "Sentiment": "positive",
            "PublishDate": 1747824085000,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement Reports Q4 Financial Results",
            "Summary": "Star Cement has announced its Q4 financial results. The company's EBITDA increased to 2.6 billion rupees from 1.8 billion rupees year-over-year. The EBITDA margin improved to 24.97% from 19.67% in the same period last year. Revenue grew to 10.5 billion rupees from 9.14 billion rupees year-over-year. The consolidated net profit rose to 1.23 billion rupees from 877 million rupees in the previous year's corresponding quarter.",
            "Sentiment": "positive",
            "PublishDate": 1747821305000,
            "Source": "result"
        },
        {
            "Title": "Star Cement Meghalaya: Preferred Bidder for Assam Limestone Block",
            "Summary": "Star Cement Meghalaya Ltd, a subsidiary of Star Cement Ltd, has been declared the preferred bidder for the Composite License of the Boro Hundong limestone block in Assam. The block, located in Dima Hasao district, spans 400 hectares with an estimated limestone resource of 146.75 million tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1742229112000,
            "Source": "order&deals"
        },
        {
            "Title": "Star Cement Subsidiary Wins Bid for Limestone Block",
            "Summary": "A subsidiary of Star Cement has been declared the preferred bidder for the Boro Hundong Limestone Block. This development suggests potential expansion of the company's raw material resources for cement production.",
            "Sentiment": "positive",
            "PublishDate": 1742214421000,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement Declared Preferred Bidder for Limestone Block in Assam",
            "Summary": "Star Cement has been declared the preferred bidder for a limestone block in Assam. The company reports that the limestone block contains a substantial resource of 192.36 million tonnes.",
            "Sentiment": "positive",
            "PublishDate": 1741092994000,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement: Q3 Profit Plummets 87.68% Despite Revenue Growth",
            "Summary": "Star Cement reported Q3 FY25 results with revenue up 10.34% YoY to ₹718.76 crore, but profit fell 87.68% to ₹9.06 crore. EPS decreased to ₹0.22. Operating income down 86.73% YoY. Analysts maintain overall 'Buy' recommendation.",
            "Sentiment": "negative",
            "PublishDate": 1738303676000,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement Reports Decline in Q3 EBITDA and Margin",
            "Summary": "Star Cement has reported a decrease in its third-quarter financial performance. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) fell to 1.04 billion rupees from 1.5 billion rupees in the same quarter of the previous year. Additionally, the EBITDA margin decreased to 14.50% from 22.84% year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1738227238000,
            "Source": "earnings"
        },
        {
            "Title": "Star Cement Vice Chairman and Managing Director Resigns Amid Allegations",
            "Summary": "Rajendra Chamaria has resigned from his positions as Vice Chairman and Managing Director of Star Cement. His resignation comes in response to what he claims are false allegations made against him.",
            "Sentiment": "negative",
            "PublishDate": 1738069233000,
            "Source": "corporate_governance"
        },
        {
            "Title": "UltraTech Cement Invests ₹851 Crore for 8.69% Stake in Star Cement",
            "Summary": "UltraTech Cement has approved an investment of ₹851 crore to acquire an 8.69% stake in Star Cement. This strategic move represents a significant corporate action in the cement industry, potentially strengthening UltraTech's market position and expanding its portfolio.",
            "Sentiment": "positive",
            "PublishDate": 1735271118000,
            "Source": "corporate_action"
        },
        {
            "Title": "UltraTech Cement Approves Investment in Star Cement",
            "Summary": "UltraTech Cement has approved an investment in Star Cement, agreeing to purchase 37 million shares at a price of 235 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1735271023000,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement Denies News Related to Adani",
            "Summary": "Star Cement has issued a clarification regarding a previous news item, explicitly denying any news or association with Adani. The company has taken steps to address and correct the information circulating in the market.",
            "Sentiment": "neutral",
            "PublishDate": 1733303536000,
            "Source": "corporate_governance"
        },
        {
            "Title": "Adani Group to Evaluate Star Cement for Expansion in Eastern India",
            "Summary": "The Adani Group is reportedly considering Star Cement for potential expansion opportunities in the eastern region of India. This news suggests a possible strategic move by Adani to strengthen its presence in the cement industry and expand its operations in the eastern market.",
            "Sentiment": "positive",
            "PublishDate": 1733293210000,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement to Install New WHRS and AFR Processing Unit",
            "Summary": "Star Cement has announced plans to install a 12 MW Waste Heat Recovery System (WHRS) and Alternative Fuel and Raw Material (AFR) processing unit. This installation is scheduled for Q3 FY25 and is part of the company's newly commissioned clinker line. The primary goal of this addition is to further reduce power costs for the company.",
            "Sentiment": "positive",
            "PublishDate": 1731554650000,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement Announces ₹1,580 Crore Expansion Plan",
            "Summary": "Star Cement has revealed plans to expand its production capacity by establishing new grinding units in Assam and an AAC block plant. The company has allocated a total capital expenditure of ₹1,200 crore for these projects, with an additional ₹380 crore planned for the second half of fiscal year 2025.",
            "Sentiment": "positive",
            "PublishDate": 1731554642000,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Cement Reports Q2 EBITDA and Margin Decline",
            "Summary": "Star Cement's Q2 EBITDA decreased to 955 million rupees from 985 million rupees year-over-year. The company's EBITDA margin also declined to 14.90% from 16.84% compared to the same quarter last year.",
            "Sentiment": "negative",
            "PublishDate": 1731056502000,
            "Source": "result"
        },
        {
            "Title": "Star Cement Reports Q2 Revenue Increase",
            "Summary": "Star Cement has announced its second quarter revenue for the current fiscal year. The company reported revenue of 6.4 billion rupees, which represents an increase from 5.9 billion rupees in the same quarter of the previous year.",
            "Sentiment": "positive",
            "PublishDate": 1731056451000,
            "Source": "result"
        },
        {
            "Title": "Star Cement Reports Significant Drop in Q2 Net Profit",
            "Summary": "Star Cement's consolidated net profit for the second quarter has fallen to 57 million rupees from 407 million rupees in the same period last year, representing a substantial year-over-year decrease.",
            "Sentiment": "negative",
            "PublishDate": 1731056423000,
            "Source": "result"
        }
    ]
}