{
    "Symbol": "STARHEALTH",
    "ISIN": "INE575P01011",
    "News": [
        {
            "Title": "Star Health schedules investor meet on Feb 4",
            "Summary": "Star Health and Allied Insurance Company Limited has scheduled an analyst/institutional investor meeting with ICICI Prudential AMC on February 04, 2026 in Mumbai at 1:30 PM under Regulation 30.",
            "Sentiment": "neutral",
            "PublishDate": 1770145631796,
            "Source": "stocks"
        },
        {
            "Title": "ICICI Prudential MF cuts Star Health stake by 2.09%",
            "Summary": "ICICI Prudential Mutual Fund sold 1,22,29,062 shares of Star Health and Allied Insurance Company, reducing its shareholding from 5.20% to 3.11% under SEBI disclosure regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769836845579,
            "Source": "co_actions_results"
        },
        {
            "Title": "Star Health Seeks Reclassification of Promoter Entities",
            "Summary": "Star Health and Allied Insurance Company Limited has submitted application to BSE and NSE for reclassification of two promoter group entities - Ebono Private Limited and GS E-commerce Private Limited - to public category under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1769796874045,
            "Source": "stocks"
        },
        {
            "Title": "Star Health Updates Joint Auditor Name Change",
            "Summary": "Star Health and Allied Insurance announces name change of joint statutory auditor M S K A & Associates to M S K A & Associates LLP following conversion to Limited Liability Partnership effective January 13, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1769616273960,
            "Source": "stocks"
        },
        {
            "Title": "Star Health Q3FY26: 414% YoY profit surge to ₹449 Cr",
            "Summary": "Star Health and Allied Insurance reports exceptional Q3FY26 performance with 414% YoY profit growth to ₹449 crores, driven by 23% premium growth and improved combined ratio of 98.9%.",
            "Sentiment": "positive",
            "PublishDate": 1769610022332,
            "Source": "co_actions_results"
        },
        {
            "Title": "Rekha Jhunjhunwala boosts Star Health stake to 15.57%",
            "Summary": "Ace investor Rekha Jhunjhunwala significantly increased her promoter stake in Star Health and Allied Insurance Company by 1,253 basis points to 15.57% during the December quarter, amid continued stock underperformance.",
            "Sentiment": "neutral",
            "PublishDate": 1768989809082,
            "Source": "stocks"
        },
        {
            "Title": "Star Health Gets Reclassification Request from 2 Entities",
            "Summary": "Star Health and Allied Insurance receives formal requests from Ebono Private Limited and GS E-commerce Private Limited to reclassify from promoter group to public category under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768819254741,
            "Source": "stocks"
        },
        {
            "Title": "Star Health Insurance Premium Jumps 24% in December",
            "Summary": "Star Health and Allied Insurance Company reported a significant 24% year-over-year increase in insurance premium collections for December, indicating strong business growth momentum.",
            "Sentiment": "positive",
            "PublishDate": 1767777341348,
            "Source": "stocks"
        },
        {
            "Title": "Star Health Earnings Call Set for Jan 29 to Discuss Q3 Results",
            "Summary": "Star Health and Allied Insurance Company has scheduled its Q3 & 9M FY2026 earnings call for January 29, 2026, at 08:30 AM IST to discuss performance for quarter ended December 31, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1767009965977,
            "Source": "co_actions_results"
        },
        {
            "Title": "Star Health faces ₹75.28 cr GST penalty from UP",
            "Summary": "Star Health and Allied Insurance receives GST penalty order of ₹75.28 crores from Uttar Pradesh authorities for excess ITC claims during April 2021-March 2022. Company plans to file appeal.",
            "Sentiment": "negative",
            "PublishDate": 1766832837606,
            "Source": "stocks"
        },
        {
            "Title": "Star Health Postal Ballot Results Announced",
            "Summary": "Star Health and Allied Insurance Company announces postal ballot results with 99.99% approval for independent director remuneration resolution through e-voting process.",
            "Sentiment": "positive",
            "PublishDate": 1766397413913,
            "Source": "stocks"
        },
        {
            "Title": "Star Health Faces ₹53.26L GST Penalty from Tamil Nadu",
            "Summary": "Star Health and Allied Insurance receives GST penalty order for excess Input Tax Credit claims during April 2021-March 2022. Company plans to file appeal based on legal counsel advice.",
            "Sentiment": "negative",
            "PublishDate": 1766044233582,
            "Source": "stocks"
        },
        {
            "Title": "Star Health Receives Rs 10.7 Lakh GST Penalty for Excess ITC Claims",
            "Summary": "Star Health and Allied Insurance Company received a GST penalty of Rs 10,70,722 from Kolkata-South GST authorities for excess Input Tax Credit availed during April 2019 to March 2020. The company plans to file an appeal and believes it has a strong case on merits with no material impact expected on financial or operational activities.",
            "Sentiment": "negative",
            "PublishDate": 1765275882094,
            "Source": "stock"
        },
        {
            "Title": "Star Health Block Trade Worth Rs. 85.37 Crores Executed on NSE",
            "Summary": "Star Health and Allied Insurance Company executed a block trade on NSE involving 1,800,766 shares at Rs. 474.10 per share, totaling Rs. 85.37 crores. The transaction represents a significant equity movement for the insurance company through institutional trading.",
            "Sentiment": "neutral",
            "PublishDate": 1764741700262,
            "Source": "order&deals"
        },
        {
            "Title": "WestBridge Capital Increases Star Health Stake by $12 Million",
            "Summary": "WestBridge Capital purchased shares worth $12 million in Star Health and Allied Insurance in the first half of the financial year, rebuilding its position after partially exiting during the company's 2021 IPO. The private equity firm, which manages over $8 billion in India-focused assets, originally backed Star Health more than a decade ago. WestBridge is also preparing to launch a new general insurance venture called Kiwi with Neelesh Garg. The Insurance Regulatory and Development Authority of India approved Kiwi's R1 application in July 2025, marking the first step in the licensing process for new general insurers. WestBridge disclosed its Star Health investment to the regulator during Kiwi's licensing process and addressed all regulatory queries.",
            "Sentiment": "positive",
            "PublishDate": 1762822765299,
            "Source": "stock"
        },
        {
            "Title": "Niva Bupa Health Insurance Targets Double-Digit Market Share with 22.9% Premium Growth",
            "Summary": "Niva Bupa Health Insurance reported 22.9% year-over-year premium growth. The company aims to achieve sustained premium growth through digital distribution channels, the launch of Reassure 3.0, and increased retail penetration. Niva Bupa seeks to capture double-digit market share while maintaining consistent underwriting profitability.",
            "Sentiment": "positive",
            "PublishDate": 1762181775992,
            "Source": "stock"
        },
        {
            "Title": "Star Health Reports 21% Profit Growth Despite Challenges in Q2 FY2026",
            "Summary": "Star Health and Allied Insurance Company reported a 21% year-on-year increase in profit after tax to Rs. 518 crore for H1 FY2026. The company achieved gross written premium of Rs. 8,809 crore, representing 12% growth, with retail health GWP rising 17% to Rs. 8,332 crore. Net incurred claim ratio improved to 70.6% from 70.9% in the previous year, with Q2 showing significant improvement at 71.8% versus 73.7% last year. The company maintained strong renewal persistency of 98% on value in retail health business. Star Health successfully exited unprofitable group employer-employee portfolios and repriced high-claims Banca Group books. The expense ratio improved to 29.7% from 31.1% in H1 FY2025. Digital channel emerged as the fastest growing segment with 47% fresh premium growth, contributing 20% of overall fresh business. The company benefited from GST exemption on retail health indemnity policies, reporting 50% growth in fresh business in October. Investment yield stood at 8.3% for H1 FY2026. Combined ratio on IFRS basis was 100.3%, representing a 170 basis points decrease over the previous year. The company maintained its retail health market share at 32% and added over 30,000 new agents in the first half.",
            "Sentiment": "positive",
            "PublishDate": 1762174297251,
            "Source": "earnings"
        },
        {
            "Title": "Star Health Sets Ambitious Growth Targets with 10%+ Premium CAGR and Digital Transformation Strategy",
            "Summary": "Star Health has outlined strategic targets focusing on retail penetration, digital-first distribution, and operational efficiency improvements. The company aims to achieve over 10% premium compound annual growth rate, enhanced solvency ratios, and market-leading claims automation capabilities. These initiatives are designed to boost profitability over the FY26-28 period through improved distribution channels and automated processes.",
            "Sentiment": "positive",
            "PublishDate": 1761667360328,
            "Source": "stock"
        },
        {
            "Title": "Star Health Reports 21% Profit Growth to ₹518 Crores in H1FY26",
            "Summary": "Star Health and Allied Insurance Company reported a Profit After Tax of ₹518 crores for the half year ended September 30, 2025, marking a 21% year-on-year growth under IFRS. The company achieved a Gross Written Premium of ₹8,809 crores on N basis, representing 12% year-on-year growth. Retail GWP increased 17% to ₹8,332 crores, driven by 24% growth in fresh retail premiums and 98% renewal persistency in retail health. The company maintains a 32% market share in India's retail health insurance segment. The expense ratio improved to 29.7% from 31.1% in the previous year, while the Net Incurred Claims Ratio stood at 70.6%, a 30 basis points decrease from the same period last year. The combined ratio improved to 100.3% from 102.1% in the previous year, and the solvency ratio remained at 2.15x. The company's flagship product Super Star surpassed the ₹1,250 crore premium milestone within its first year. Star Health's claims NPS improved from 52 to 61, and overall company NPS increased from 59 to 61.",
            "Sentiment": "positive",
            "PublishDate": 1761661519088,
            "Source": "earnings"
        },
        {
            "Title": "Star Health Reports 50% Drop in Q2 Net Profit Despite Revenue Growth",
            "Summary": "Star Health and Allied Insurance Co reported a net profit of 549 million rupees for Q2, down from 1.1 billion rupees in the same quarter last year. The company's revenue increased to 40.8 billion rupees compared to 37 billion rupees year-over-year.",
            "Sentiment": "negative",
            "PublishDate": 1761656271355,
            "Source": "earnings"
        },
        {
            "Title": "Star Health Reports Premium Growth of 3.4% to ₹15.19 Billion in September",
            "Summary": "Star Health achieved premium collections of ₹15.19 billion in September, representing a 3.4% increase compared to the same period in the previous year. The growth indicates steady business expansion for the health insurance company.",
            "Sentiment": "positive",
            "PublishDate": 1759829709565,
            "Source": "stock"
        },
        {
            "Title": "AHPI and Star Health Resume Cashless Services at Member Hospitals from October 10",
            "Summary": "The Association of Healthcare Providers of India (AHPI) and Star Health and Allied Insurance announced the resumption of cashless services at AHPI member hospitals starting October 10. This follows discussions to address ongoing concerns after AHPI had advised stopping cashless services from September 22. The organizations agreed to resolve outstanding matters including tariff revisions by October 31. AHPI will support forming an industry-level group to collaborate with insurers on patient-benefiting agreements. AHPI represents over 15,000 hospitals while Star Health operates a network of over 11,300 hospitals. Star Health reported gross written premium of ₹17,553 crore with net worth of ₹8,668 crore in FY25.",
            "Sentiment": "positive",
            "PublishDate": 1758513034249,
            "Source": "stock"
        },
        {
            "Title": "Star Health Settles ₹2,800 Crore Claims in Karnataka, Commands 31% Market Share",
            "Summary": "Star Health And Allied Insurance has settled claims exceeding ₹2,800 crore in Karnataka over the past five years. The company closed 4.8 lakh claims during this period and holds a 31% market share in the state.",
            "Sentiment": "positive",
            "PublishDate": 1758173243051,
            "Source": "stock"
        },
        {
            "Title": "Star Health Shares Worth Rs. 299.59 Crores Traded in NSE Block Deal",
            "Summary": "Star Health and Allied Insurance Company executed a block trade on NSE involving approximately 6,784,897 shares at Rs. 441.55 per share, with a total transaction value of Rs. 299.59 crores.",
            "Sentiment": "neutral",
            "PublishDate": 1758002280932,
            "Source": "order&deals"
        },
        {
            "Title": "AHPI Demands Star Health Restore Cashless Services at Member Hospitals",
            "Summary": "The Association of Healthcare Providers of India (AHPI) has called on Star Health and Allied Insurance to immediately restore cashless services at member hospitals, citing patient distress caused by service suspensions. Major hospital chains affected include Care Hospitals, Manipal Hospitals, Max Hospitals, Metro Hospital, Medanta Hospital, Rajiv Gandhi Cancer Hospital, Sarvodaya Hospital, and Yatharth Hospitals. AHPI also reported delays in empanelment of new hospitals including Care Health City Vizag, Fortis Hospital Manesar, and Jupiter Hospital Indore. The association stated these actions force families to shift to reimbursement claims and restrict patient choice. AHPI leadership emphasized that patients purchase health insurance expecting cashless treatment at quality hospitals, calling it unjust for insurers to withhold facilities after collecting premiums. The association clarified its response was to Star Health's actions, not a unilateral move as suggested by the General Insurance Council.",
            "Sentiment": "negative",
            "PublishDate": 1757937840168,
            "Source": "stock"
        },
        {
            "Title": "GIC Supports Star Health Against AHPI's Threat to Suspend Cashless Services",
            "Summary": "The General Insurance Council backed Star Health and Allied Insurance against the Association of Healthcare Providers (India)'s threat to suspend cashless services for Star Health policyholders starting September 22. AHPI, representing over 15,000 healthcare facilities, cited concerns including delayed or denied claims, absence of tariff revisions amid rising healthcare costs, and pressure on hospitals to lower tariffs. The Insurance Ombudsman Annual Report 2023-24 recorded more than 13,300 complaints against Star Health, with over 10,000 related to claim disputes. GIC condemned AHPI's unilateral approach and stated that tariff negotiations should never compromise patient care. The council had scheduled a meeting with AHPI on September 2, but AHPI postponed it indefinitely. Star Health responded that it had not received reports of cashless service suspension from network partners and criticized AHPI for issuing threats without clarity. The insurer committed to ensuring customers receive claim payments before hospital admissions if disruptions occur.",
            "Sentiment": "negative",
            "PublishDate": 1757848531115,
            "Source": "stock"
        },
        {
            "Title": "AHPI Threatens to Suspend Cashless Services for Star Health Policyholders Over Claim Disputes",
            "Summary": "The Association of Healthcare Providers–India (AHPI), representing over 15,000 hospitals, warned it may suspend cashless services for Star Health Insurance policyholders from September 22, 2025, unless key concerns are resolved. AHPI cited issues including lack of tariff revisions aligned with rising healthcare costs, pressure to reduce existing tariffs, deductions from approved claims, claim rejections after final approval, and sudden withdrawal of cashless services. The association referenced the Insurance Ombudsman Annual Report 2023–24, which recorded over 13,300 complaints against Star Health, with more than 10,000 related to claim rejections. If suspended, hospitals would continue treating Star Health policyholders on self-pay basis, allowing patients to seek reimbursement later. AHPI Director General Girdhar Gyani stated the association remains open to discussions for a positive resolution.",
            "Sentiment": "negative",
            "PublishDate": 1757679438884,
            "Source": "stock"
        },
        {
            "Title": "Star Health Launches 'Know Your Policy' Feature to Simplify Health Insurance Coverage",
            "Summary": "Star Health and Allied Insurance Company Limited introduced 'Know Your Policy', a new in-app feature designed to make health insurance coverage easier to understand for customers. The module, accessible through the Star Health customer app, provides a concise summary of policy inclusions, exclusions, and waiting periods. Since launch, 300,000 customers have used the feature. The tool is divided into two sections: 'What's Included' covering key benefits like hospitalization and emergency care, and 'What's Not Included' highlighting common exclusions and waiting periods. Star Health has seen a reduction in customer calls following the feature's introduction. The company's app has crossed 11 million downloads with over 1.2 million monthly active users, and 63% of renewals are now processed automatically. Over 75% of new business comes through digital channels. The app maintains ratings of 4.6 on the App Store and 4.4 on Google Play.",
            "Sentiment": "positive",
            "PublishDate": 1757591093422,
            "Source": "stock"
        },
        {
            "Title": "Star Health Considers General Insurance Products to Address ITC Losses",
            "Summary": "Star Health is exploring the possibility of offering general insurance products as a strategy to mitigate Input Tax Credit (ITC) losses. This consideration comes ahead of the company's plans to obtain a composite license.",
            "Sentiment": "neutral",
            "PublishDate": 1757489979139,
            "Source": "stock"
        },
        {
            "Title": "Star Health Reports 6% Monthly Premium Decline in August",
            "Summary": "Star Health experienced a 6% decrease in premiums during August compared to the previous month. The insurance company saw reduced premium collections on a month-over-month basis.",
            "Sentiment": "negative",
            "PublishDate": 1757323645172,
            "Source": "stock"
        },
        {
            "Title": "Star Health Reports Quarterly Results for March 2025 with Cybersecurity Incident Disclosure",
            "Summary": "Star Health and Allied Insurance Company Limited submitted its integrated financial filing for the quarter and year ended March 31, 2025. The company allotted 1,07,122 equity shares during the quarter and 25,03,078 shares for the year under its ESOP scheme. Star Health disclosed a cybersecurity incident from August 2024 involving unauthorized data access, for which IRDAI issued a show cause notice in February 2025 regarding non-compliance with cyber security guidelines. The company faces multiple GST-related disputes totaling over Rs. 6,500 lakhs across various orders and notices. Star Health revised its premium recognition policy effective October 2024, recognizing Gross Written Premium on a 1/n basis for long-term products, resulting in reduced premium figures but no material impact on profit and loss. The company's solvency ratio was affected by methodology changes in calculating admissible assets but was later adjusted following IRDAI clarifications.",
            "Sentiment": "negative",
            "PublishDate": 1757147023186,
            "Source": "earnings"
        },
        {
            "Title": "IRDAI Links Health Insurance Premium Increases to Medical Inflation",
            "Summary": "The Insurance Regulatory and Development Authority of India (IRDAI) has indicated that health insurance premium increases may be connected to medical inflation. This statement relates to Star Health, suggesting regulatory acknowledgment of the relationship between rising healthcare costs and insurance pricing adjustments.",
            "Sentiment": "neutral",
            "PublishDate": 1755845421461,
            "Source": "stock"
        },
        {
            "Title": "Star Health Settles Claims Worth Over ₹11,500 Crore",
            "Summary": "Star Health has settled insurance claims exceeding ₹11,500 crore. The settlement represents a significant claims payout by the insurance company.",
            "Sentiment": "neutral",
            "PublishDate": 1755752303006,
            "Source": "stock"
        },
        {
            "Title": "Whistleblower Alleges Conflict of Interest Involving Westbridge Capital in Star Health Case",
            "Summary": "A whistleblower complaint has been filed alleging a conflict of interest connected to Westbridge Capital in a case involving Star Health & Allied Insurance Company.",
            "Sentiment": "negative",
            "PublishDate": 1754986720969,
            "Source": "corporate_governance"
        },
        {
            "Title": "Star Health Insurance Launches Emergency Support Measures for Uttarkashi Flash Flood Victims",
            "Summary": "Star Health and Allied Insurance has activated emergency response measures to support residents and policyholders affected by flash floods in Uttarkashi, Uttarakhand. The floods, triggered by heavy rains and cloudbursts, caused widespread damage in Tharali village and the Harsil region after the Khir Ganga and surrounding rivers surged. The company's support initiatives include 24x7 emergency helplines, local help desks in Uttarkashi and nearby districts with designated nodal officers, free telehealth services through their mobile app, fast-tracked claim processing for flood-related illnesses and hospitalizations, and health awareness campaigns. COO Amitabh Jain emphasized the company's commitment to providing timely healthcare assistance and swift claim resolution beyond just policy coverage. Star Health has assured that all flood-related health claims, including waterborne and vector-borne diseases, will be processed with urgency. The company operates with 914 offices, over 11,300 network hospitals, and reported gross written premium of Rs. 17,553 crores with net worth of Rs. 8,668 crores.",
            "Sentiment": "positive",
            "PublishDate": 1754555193309,
            "Source": "stock"
        },
        {
            "Title": "Star Health Reports 44% Jump in IFRS PAT to Rs 438 Crores in Q1 FY2026",
            "Summary": "Star Health and Allied Insurance Company reported a 44% year-on-year increase in IFRS PAT to Rs 438 crores for Q1 FY2026. The company achieved gross written premium of Rs 3,936 crores, marking 13% growth. Retail health GWP grew 18% to Rs 3,667 crores, driven by 25% growth in fresh retail premiums and 98% renewal persistency. The company maintained 31% market share in retail health, with retail contributing 94% of overall portfolio. Net incurred claim ratio stood at 69.5% while combined ratio was 99.6%. Investment income increased to Rs 586 crores from Rs 388 crores, including Rs 292 crores in mark-to-market gains. The agency channel contributed 82% of overall GWP with 16% growth, while digital business grew 73% and now represents 20% of new business. The company added 14,000 new agents, taking total agency base to 7.89 lakh. IFRS expense ratio improved by 100 basis points to 30.1%. Return on equity for the quarter was 4.9% versus 3.8% in the previous year. The company appointed Rajeev Kher as new Board Chairperson and elevated Amitabh Jain and Himanshu Walia as Executive Directors.",
            "Sentiment": "positive",
            "PublishDate": 1754397132801,
            "Source": "earnings"
        },
        {
            "Title": "Star Health Seeks Shareholder Approval for Executive Remuneration and Board Appointments via Postal Ballot",
            "Summary": "Star Health and Allied Insurance Company has issued a postal ballot notice seeking shareholder approval for five key business matters. The company is requesting approval for Rs. 30 lakh annual remuneration for Non-Executive Independent Director and Chairperson Rajeev Kher. For MD & CEO Anand Roy, the company seeks approval for FY 2025-26 remuneration comprising Rs. 6.59 crore fixed pay and variable pay up to 100% of fixed pay (Rs. 3.30 crore in cash and equivalent ESOPs). The ballot also covers appointments of Himanshu Walia (Chief Marketing Officer) and Amitabh Jain (Chief Operating Officer) as Whole-time Directors with annual packages of Rs. 3.33 crore and Rs. 3.71 crore respectively, including similar variable pay structures. Additionally, shareholders will note a statement regarding employee stock option scheme accounting methods. E-voting is scheduled from August 2-31, 2025, with results to be announced by September 1, 2025. All appointments and remuneration proposals are subject to IRDAI approval.",
            "Sentiment": "neutral",
            "PublishDate": 1753948039254,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Health Targets 15-16% ROE by FY28, Reports 44% Profit Growth in Q1",
            "Summary": "Star Health and Allied Insurance Company aims to maintain a return on equity of 15-16% or higher by FY28. CFO Nilesh Kambli stated the company is focused on sustainable profitability and controlling expense ratios to improve operating profitability. The company has maintained a 33% annual market share driven by its agency network and digital platform. Star Health reported quarterly results showing ROE of 4.9%, up from 3.8% in the previous year. Profit after tax increased 44% to Rs 438 crore compared to Rs 304 crore. The company achieved Gross Written Premium of Rs 3,936 crore, marking 13% year-on-year growth from Rs 3,476 crore. Kambli noted that portability accounts for only 10% of new business and emphasized the company's leadership in tier 2 and tier 3 cities. Shares closed 4.55% higher at Rs 446.15.",
            "Sentiment": "positive",
            "PublishDate": 1753926597475,
            "Source": "stock"
        },
        {
            "Title": "Star Health Targets Retail Leadership Through Technology and Digital Expansion",
            "Summary": "Star Health is pursuing retail market leadership through a multi-pronged strategy focused on technology-driven claims processing, expansion of digital channels, and development of a diverse premium product portfolio. The company expects to maintain a steady combined ratio while enhancing its bancassurance network to drive profitable growth.",
            "Sentiment": "positive",
            "PublishDate": 1753804687765,
            "Source": "stock"
        },
        {
            "Title": "Star Health Reports Q1 FY2026 Results with 44% Jump in Profit and Strong Premium Growth",
            "Summary": "Star Health and Allied Insurance Company announced its quarterly results for the period ended June 30, 2025. The company reported a profit after tax of ₹438 crore compared to ₹304 crore in the same quarter last year. Gross Written Premium increased to ₹3,936 crore from ₹3,476 crore year-on-year. The company's lives covered expanded to 60 lakh from 52 lakh previously. Investment income rose significantly to ₹586 crore from ₹388 crore in the prior year quarter. The combined ratio under IND AS improved to 99.6% from 99.2%, while the expense ratio decreased to 30.1% from 31.1%. Star Health maintained its leadership position in the retail health insurance segment with a 31% market share. The company's agency network grew to 789,000 agents, and digital premium collection reached 70% of total collections. Customer satisfaction metrics showed improvement with Net Promoter Score at 53 and grievances reduced to 19 per 10,000 policies.",
            "Sentiment": "positive",
            "PublishDate": 1753804294291,
            "Source": "earnings"
        },
        {
            "Title": "Star Health Reports 18.7% Decline in Q1 Net Profit Despite Revenue Growth",
            "Summary": "Star Health and Allied Insurance Company reported net profit of 2.6 billion rupees in Q1, down from 3.2 billion rupees in the same period last year, representing an 18.7% year-over-year decline. However, the company's revenue increased to 39.3 billion rupees compared to 35.2 billion rupees in the previous year, showing 11.6% growth.",
            "Sentiment": "neutral",
            "PublishDate": 1753794745192,
            "Source": "earnings"
        },
        {
            "Title": "IRDAI Imposes ₹3.39 Crore Penalty on Star Health for Cyber Security Violations",
            "Summary": "The Insurance Regulatory and Development Authority of India imposed a ₹3.39 crore penalty on Star Health and Allied Insurance for multiple breaches of its Information & Cyber Security Guidelines, 2023. The regulator also issued a warning to the company. Star Health operates through 913 offices, over 14,000 network hospitals, more than 7,75,000 licensed agents, and employs about 17,000 people. In fiscal 2024-25, the insurer reported gross written premium of ₹17,553 crore and a net worth of ₹8,668 crore.",
            "Sentiment": "negative",
            "PublishDate": 1753543342429,
            "Source": "stock"
        },
        {
            "Title": "SBI Small Cap Fund Acquires 3.41% Stake in Star Health And Allied Insurance",
            "Summary": "SBI Small Cap Fund has acquired a 3.41% stake in Star Health And Allied Insurance Co during Q1. This represents a new investment by the mutual fund scheme in the insurance company.",
            "Sentiment": "positive",
            "PublishDate": 1752851596726,
            "Source": "stock"
        },
        {
            "Title": "Star Health and Allied Insurance to Review Q1 Results on July 29",
            "Summary": "Star Health And Allied Insurance Co. has announced that it will review its first quarter (Q1) results on July 29. The company has scheduled this review to assess its financial performance for the latest quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1751887406000,
            "Source": "default"
        },
        {
            "Title": "Star Health and Allied Insurance: SBI Mutual Fund Acquires 2.72% Stake",
            "Summary": "SBI Mutual Fund bought 1.6 crore shares of Star Health and Allied Insurance Company Ltd. for ₹672 crore, acquiring a 2.72% stake. The purchase was made at ₹420 per share, which is more than 50% below the company's IPO price of ₹900.",
            "Sentiment": "neutral",
            "PublishDate": 1750895363000,
            "Source": "block_deals"
        },
        {
            "Title": "Star Health Insurance Partners with Medi Assist for AI-Powered Claims Processing",
            "Summary": "Star Health Insurance has formed a partnership with Medi Assist to enhance their claims processing system using AI and digital technology. This collaboration aims to revolutionize the claims experience for customers by leveraging advanced technologies.",
            "Sentiment": "positive",
            "PublishDate": 1750827125000,
            "Source": "default"
        },
        {
            "Title": "Star Health and Allied Insurance Company Ltd. Block Trade",
            "Summary": "A block trade of approximately 16,706,709 shares of Star Health and Allied Insurance Company Ltd. occurred on the NSE. The total value of the trade was Rs. 703.85 crores, with shares priced at Rs. 421.30 each.",
            "Sentiment": "neutral",
            "PublishDate": 1750826978000,
            "Source": "block_details"
        },
        {
            "Title": "Star Health Insurance: AI-Powered Digital Claims Platform Launch",
            "Summary": "Star Health and Allied Insurance partners with Medi Assist to implement MAtrix, an AI-powered digital claims platform. The collaboration aims to streamline claims settlement, enhance customer engagement, and improve operational efficiency. The platform will use AI for fraud detection and process automation.",
            "Sentiment": "positive",
            "PublishDate": 1750792357000,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Health Insurance: Launches Star Flexi Variants Under Super Star Plan",
            "Summary": "Star Health and Allied Insurance introduces Star Flexi, offering three variants (Essential, Preferred, Secure) under its Super Star health plan. The new variants cater to different customer segments, providing flexible coverage options starting from ₹5 lakh. Super Star plan has sold over 1.6 lakh policies, generating ₹580 crore revenue in seven months.",
            "Sentiment": "positive",
            "PublishDate": 1747713831000,
            "Source": "corporate_action"
        },
        {
            "Title": "Star Health Insurance: Hacker Claims Sending Death Threats to Top Executives",
            "Summary": "The hacker responsible for a 2024 data breach at Star Health and Allied Insurance has reportedly sent death threats and bullet cartridges to CEO Anand Roy and CFO Nilesh Kambli. The threats are allegedly linked to denied insurance claims. Tamil Nadu police are investigating, and a suspect from Telangana has been arrested for couriering the threat packages.",
            "Sentiment": "negative",
            "PublishDate": 1746786081000,
            "Source": "corporate_governance"
        }
    ]
}