{
    "Symbol": "STARTECK",
    "ISIN": "INE992I01013",
    "News": [
        {
            "Title": "Starteck Finance Q3FY26 Net Profit Surges 106%",
            "Summary": "Starteck Finance Limited reported consolidated net profit of ₹747.71 lakh for Q3FY26, up 106% YoY. Total income rose 65% to ₹1,566.19 lakh driven by higher interest income and other income.",
            "Sentiment": "positive",
            "PublishDate": 1770301753212,
            "Source": "co_actions_results"
        },
        {
            "Title": "Samagra Wealthmax acquires 0.20% stake in Starteck",
            "Summary": "Samagra Wealthmax Private Limited acquired 20,196 equity shares (0.20%) in Starteck Finance through open market transactions between December 1-10, 2025, increasing its total holding to 73.29%.",
            "Sentiment": "neutral",
            "PublishDate": 1765520735850,
            "Source": "co_actions_results"
        },
        {
            "Title": "Starteck Finance Reports Quarterly Financial Results for Period Ended September 30, 2025",
            "Summary": "Starteck Finance Limited's Board of Directors approved unaudited financial results for the quarter and half-year ended September 30, 2025. The company operates primarily in lending business and reported consolidated total assets of Rs. 57,668.33 lakhs as of September 30, 2025, compared to Rs. 51,504.19 lakhs as of March 31, 2025. Borrowings increased to Rs. 27,488.09 lakhs from Rs. 22,691.68 lakhs in the previous period. The company's loan portfolio grew to Rs. 21,124.30 lakhs from Rs. 19,526.45 lakhs. Investments rose significantly to Rs. 24,305.97 lakhs from Rs. 19,595.59 lakhs. The results include consolidated figures from subsidiaries Chitta Finlease Private Limited and Bhuwalka Steel Industries Limited. The financial statements were reviewed by MKPS & Associates LLP as auditors.",
            "Sentiment": "neutral",
            "PublishDate": 1762909935461,
            "Source": "earnings"
        },
        {
            "Title": "Starteck Finance Reports 107% Jump in Quarterly Net Profit to ₹354 Lakhs",
            "Summary": "Starteck Finance Limited reported consolidated net profit of ₹354.36 lakhs for the quarter ended June 30, 2025, marking a 107% increase from ₹170.82 lakhs in the same quarter last year. Total income rose to ₹1,022.49 lakhs from ₹727.57 lakhs year-on-year. Interest income grew to ₹737.54 lakhs compared to ₹661.17 lakhs in the previous year quarter. The company's earnings per share increased to ₹3.58 from ₹1.72 in the corresponding quarter of the previous year. Total comprehensive income surged to ₹1,454.45 lakhs from ₹208.53 lakhs, driven by fair value gains on investments held through other comprehensive income of ₹1,491.76 lakhs. The board meeting was held on August 5, 2025, to approve these unaudited financial results.",
            "Sentiment": "positive",
            "PublishDate": 1754402451120,
            "Source": "earnings"
        }
    ]
}