{
    "Symbol": "STAR",
    "ISIN": "INE939A01011",
    "News": [
        {
            "Title": "Strides Gets USFDA Closure for NY Facility Inspection",
            "Summary": "Strides Pharma Inc receives USFDA closure report (EIR) for Chestnut Ridge facility with VAI classification. Inspection covered nasal sprays domain and drug-device combinations.",
            "Sentiment": "positive",
            "PublishDate": 1770262014607,
            "Source": "stocks"
        },
        {
            "Title": "Strides Pharma Q3 Net Profit Surges 127% YoY",
            "Summary": "Strides Pharma Science reports consolidated net profit of ₹2 billion in Q3, marking a significant 127% increase from ₹880 million in the same quarter last year.",
            "Sentiment": "positive",
            "PublishDate": 1769758198769,
            "Source": "co_actions_results"
        },
        {
            "Title": "Strides Pharma Gets FDA Form 483 with 4 Observations",
            "Summary": "Strides Pharma Science completes US-FDA inspection at its USA facility. FDA issues Form 483 with four procedural observations following the regulatory review.",
            "Sentiment": "neutral",
            "PublishDate": 1766714580539,
            "Source": "stocks"
        },
        {
            "Title": "Strides Pharma Gets 4 FDA Observations, Q2 Profit Jumps 82%",
            "Summary": "Strides Pharma Science received 4 procedural FDA observations at NY facility with no supply impact expected. Q2 net profit surged 82% to ₹131.50 crore with revenue up 4.6% to ₹1,221 crore.",
            "Sentiment": "positive",
            "PublishDate": 1766581636160,
            "Source": "stocks"
        },
        {
            "Title": "Strides Pharma Science Announces Group CHRO Exit and New Executive VP-HR Appointment",
            "Summary": "Strides Pharma Science announced that Group CHRO Ms. Surabhi Loshali has resigned to pursue personal and professional aspirations, with her last working day on January 2, 2026, after over 5 years with the company. The company has appointed Ms. Nandini Matiyani as Executive Vice President-Human Resources effective December 1, 2025, bringing over 20 years of HR leadership experience across multinational enterprises.",
            "Sentiment": "neutral",
            "PublishDate": 1764743128747,
            "Source": "corporate_governance"
        },
        {
            "Title": "Strides Pharma Reports Strong Q2 FY26 Results with 25% EBITDA Growth and Record Operational PAT",
            "Summary": "Strides Pharma Science Limited delivered robust quarterly results with revenue growing 4.6% year-on-year, gross margins expanding 14.6%, and EBITDA surging 25.4%. The company achieved its highest ever quarterly operational PAT of INR 140 crores, representing 84% growth. For the half-year, revenue increased 5.5% with EBITDA growing 20%. The US market generated $73 million in revenue with 2% growth despite intense competition, while other regulated markets showed strong 16% year-on-year growth. The company launched 3 products in the US and maintains top-three rankings in 37 products contributing 75% of US revenue. Gross margins improved to 57.8% for the quarter and 59% for the half-year. Net debt reduced by INR 73 crores to INR 1,449 crores, improving the EBITDA to net debt ratio to 1.65x from 1.9x. The company continues to target $400 million in US revenue by FY28 and expects other regulated markets plus growth markets to mirror US performance within 2-3 years. Management emphasized focus on profitability over revenue growth, maintaining disciplined capital allocation and service level excellence.",
            "Sentiment": "positive",
            "PublishDate": 1762337953843,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Science Reports Strong Q2 Performance with 81% Jump in Net Profit",
            "Summary": "Strides Pharma Science delivered robust quarterly results with consolidated net profit surging to 1.3 billion rupees from 718 million rupees year-over-year. The pharmaceutical company's revenue grew to 12.2 billion rupees compared to 12 billion rupees in the same period last year. EBITDA increased significantly to 2.32 billion rupees from 1.85 billion rupees, while EBITDA margin expanded to 18.97% from 15.82% year-over-year, indicating improved operational efficiency and profitability.",
            "Sentiment": "positive",
            "PublishDate": 1761896199934,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Science Partners With Incepta To Launch WHO-Prequalified Contraceptive In Africa",
            "Summary": "Strides Pharma Science has partnered with Incepta to enhance women's health access through WHO-prequalified contraceptive solutions. The company is launching Medogen SubQ in Africa as part of its focus on providing affordable and quality reproductive health solutions.",
            "Sentiment": "positive",
            "PublishDate": 1760694677952,
            "Source": "stock"
        },
        {
            "Title": "Strides Pharma Science Partners with Kenox to Expand Nasal Spray Portfolio in U.S. Market",
            "Summary": "Strides Pharma Science has entered into a collaboration with Kenox to expand its nasal spray product range for the U.S. market. The partnership aims to grow the company's presence in the nasal spray segment within the American pharmaceutical market.",
            "Sentiment": "positive",
            "PublishDate": 1757337113660,
            "Source": "stock"
        },
        {
            "Title": "Strides Pharma Science Deregisters Non-Operating South African Subsidiary",
            "Summary": "Strides Pharma Science Limited voluntarily deregistered its non-operating step-down subsidiary, Apollo Life Sciences Holdings (Pty) Ltd, in South Africa on August 22, 2025. The deregistration is part of the company's efforts to streamline group entities and eliminate non-operating companies. Apollo South Africa had negligible financial contribution with revenue from operations of Rs. 0.22 million and negative net worth of Rs. 0.02 million for the financial year ended March 31, 2025. The company received communication about the deregistration from its local consultant on August 25, 2025, which explains the delay in intimation to the stock exchanges.",
            "Sentiment": "neutral",
            "PublishDate": 1756123904729,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Reports Strong Q1 FY26 Results with 19.5% EBITDA Margin and 81% EPS Growth",
            "Summary": "Strides Pharma Science delivered robust quarterly results with revenue of INR 1,120 crores and gross margins expanding 300 basis points to touch 60%. EBITDA margin reached 19.5% with operational EPS of INR 12.4, representing 81% year-on-year growth. The US business grew 7% annually, maintaining its $400 million revenue target by 2028, while other regulated markets expanded 9.2%. The company discontinued four products that didn't meet margin thresholds and received one product approval during the quarter. Operating PAT hit a record INR 114 crores with 52% EBITDA to PAT conversion. Net debt reduced to INR 1,496 crores with free cash generation of INR 26 crores. Management highlighted strong operating leverage and emphasized their beyond-generics strategy including nasal sprays and controlled substances, with the first nasal spray filing completed and patch products expected by year-end.",
            "Sentiment": "positive",
            "PublishDate": 1754315704438,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Hits Fresh 52-Week High, Experts Target Rs 975-1,030",
            "Summary": "Strides Pharma Science Ltd broke out of a one-month consolidation range in July 2025, reaching a fresh 52-week high of Rs 971 on July 29, 2025. The stock's chart pattern indicates continued momentum potential. Experts suggest short-term traders consider buying the stock with targets of Rs 975-1,030 over the next 1-2 months, though the stock faced marginal resistance after hitting the high.",
            "Sentiment": "positive",
            "PublishDate": 1754048641444,
            "Source": "stock"
        },
        {
            "Title": "Strides Pharma Forecasts Quarterly Operating Costs of ₹460-470 Crores, Plans Debt Elimination in 3-4 Years",
            "Summary": "Strides Pharma has provided guidance on its financial outlook during a conference call. The company expects operating costs to remain around ₹460-470 crores each quarter. The pharmaceutical company forecasts its tax rate to be between 17-20% for the year. Additionally, Strides Pharma has outlined plans to eliminate its debt within a 3-4 year timeframe.",
            "Sentiment": "positive",
            "PublishDate": 1753846770737,
            "Source": "stock"
        },
        {
            "Title": "Strides Pharma Maintains U.S. Revenue Target of $300-400 Million by 2028",
            "Summary": "Strides Pharma has reaffirmed its long-term U.S. revenue target of $300-400 million by 2028. The pharmaceutical company also expects to achieve gross margins in the range of 58-60%.",
            "Sentiment": "positive",
            "PublishDate": 1753846343710,
            "Source": "stock"
        },
        {
            "Title": "Strides Pharma Science Makes Earnings Call Audio Recording Available on Company Website",
            "Summary": "Strides Pharma Science Limited has made the audio recording of their earnings call available on their company website. The earnings call was held on July 29, 2025, at 16:30 Hrs IST to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The audio recording can be accessed through a specific link provided on the company's website. The notification was signed by Manjula R, Company Secretary & Compliance Officer.",
            "Sentiment": "neutral",
            "PublishDate": 1753803192927,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Reports 7% US Sales Growth and Margin Expansion in June Quarter",
            "Summary": "Strides Pharma reported quarterly results showing US sales growth of 7% to $70 million compared to the same quarter last year. Revenue in rupee terms increased 6.2% year-on-year to ₹1,119.7 crore. EBITDA rose 10% to ₹78 crore with margins expanding 25 basis points to 7%. Gross margins improved significantly by 300 basis points to 60.3%. The company recorded an exceptional loss of ₹8.4 crore versus an exceptional gain of ₹98.4 crore in the previous year, while also reporting a one-time gain of ₹3,188 crore. MD & Group CEO Badree Komandur highlighted cost management and execution as key drivers, stating the company will enhance R&D efforts for long-term growth. Shares traded 3.2% higher at ₹952 following the results announcement.",
            "Sentiment": "positive",
            "PublishDate": 1753774192210,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Science Reports Mixed Q1 Results with Higher EBITDA but Lower Net Profit",
            "Summary": "Strides Pharma Science reported Q1 EBITDA of 2.18 billion rupees compared to 1.9 billion rupees in the same period last year. The company's EBITDA margin improved to 19.48% from 18.02% year-over-year. However, consolidated net profit declined to 1 billion rupees from 1.6 billion rupees in the previous year's corresponding quarter.",
            "Sentiment": "neutral",
            "PublishDate": 1753773039055,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Changes Auditor for UK Subsidiary Due to Audit Firm Restructuring",
            "Summary": "Strides Pharma Science Limited announced a change in statutory auditors for its UK-based material subsidiary, Strides Arcolab International Limited. The transition from MacIntyre Hudson LLP to MHA Audit Services LLP is due to internal restructuring within the audit firm. MacIntyre Hudson separated their audit practice from non-audit services and transitioned audit appointments to their new dedicated audit entity. The change became effective from April 8, 2025. MacIntyre Hudson had served as statutory auditor since January 24, 2007, with their latest audit report for the financial year ended March 31, 2024 issued on November 28, 2024. The announcement was delayed as the UK subsidiary sought clarifications from the audit firm, which were received on July 25, 2025. MHA Audit Services LLP is a national firm of statutory auditors registered in England and Wales, regulated by the Institute of Chartered Accountants in England and Wales.",
            "Sentiment": "neutral",
            "PublishDate": 1753716881983,
            "Source": "corporate_governance"
        },
        {
            "Title": "Strides Pharma Science Schedules Earnings Call for July 29 to Discuss Quarterly Results",
            "Summary": "Strides Pharma Science Limited has scheduled an earnings call with analysts and investors on July 29, 2025, at 16:30 hrs IST to discuss the company's unaudited financial results for the quarter ended June 30, 2025. The earnings call details will be available on the company's website at www.strides.com. The announcement was signed by Company Secretary & Compliance Officer Manjula Ramamurthy.",
            "Sentiment": "neutral",
            "PublishDate": 1753279269715,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Science Schedules Board Meeting for July 29 to Approve Quarterly Results",
            "Summary": "Strides Pharma Science Limited has scheduled a Board of Directors meeting for July 29, 2025, to review and approve the unaudited financial results for the quarter ending June 30, 2025. The company has also closed its trading window for designated persons from July 1, 2025, until 48 hours after the financial results are declared.",
            "Sentiment": "neutral",
            "PublishDate": 1753278826842,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Science Sells Dormant Subsidiary in Cyprus",
            "Summary": "Strides Pharma Science has announced the sale of its dormant step-down subsidiary, Strides CIS Limited, which is located in Cyprus. No further details about the sale or the reasons behind it were provided in the given news snippet.",
            "Sentiment": "neutral",
            "PublishDate": 1750083566000,
            "Source": "default"
        },
        {
            "Title": "Strides Pharma Science: Confident in US Growth, Maintains $400 Million FY28 Sales Target",
            "Summary": "Strides Pharma Science expects continued growth in FY26, targeting $400 million in US sales by FY27-28. The company plans to leverage its 260 ANDAs, with only 70 commercialized so far. Strides is also shifting towards complex products and specialty offerings. The company reduced its debt-to-EBITDA ratio to under 1.9 times and aims for 20% margins in FY26.",
            "Sentiment": "positive",
            "PublishDate": 1747998170000,
            "Source": "normal_news"
        },
        {
            "Title": "Strides Pharma Science Ltd: Q4 Profit Soars, Outperforms Guidance",
            "Summary": "Strides Pharma Science Ltd reported a Q4 net profit of ₹85.6 crore, up from ₹10.4 crore YoY. Revenue increased 14% YoY to ₹1,190 crore. US business grew 23.2% YoY to $77 million. EBITDA rose 6.5% to ₹217 crore. FY25 revenue grew 17.2%, surpassing 12-15% guidance. Board recommends ₹4 per share dividend.",
            "Sentiment": "positive",
            "PublishDate": 1747903259000,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Science Reports Q4 Results and Business Outlook",
            "Summary": "Strides Pharma Science reported its latest quarterly results. The company's US business recorded $291 million in revenue, representing 21.8% year-over-year growth and exceeding expectations. Q4 EBITDA was 2.17 billion rupees compared to 2.04 billion rupees in the same quarter last year. The Q4 EBITDA margin was 18.30%, down from 19.58% year-over-year. The company stated that growth markets will have inconsistent quarters until the business stabilizes in the next two years.",
            "Sentiment": "neutral",
            "PublishDate": 1747901536000,
            "Source": "default"
        },
        {
            "Title": "Strides Pharma Science Reports Q4 Results and Dividend Declaration",
            "Summary": "Strides Pharma Science announced its quarterly results. The company's revenue increased to 11.9 billion rupees from 10.8 billion rupees year-over-year. The consolidated net profit rose to 822 million rupees from 181 million rupees in the same period last year. Additionally, the company declared a dividend of 4 rupees per share.",
            "Sentiment": "positive",
            "PublishDate": 1747901214000,
            "Source": "result"
        },
        {
            "Title": "Strides Pharma Receives FDA Approval for Celecoxib Capsules",
            "Summary": "Strides Pharma has strengthened its anti-inflammatory portfolio with the US Food and Drug Administration (USFDA) approval for Celecoxib Capsules. The US market for this product has reported sales of $116 million.",
            "Sentiment": "positive",
            "PublishDate": 1746005753000,
            "Source": "default"
        },
        {
            "Title": "Strides Pharma Acquires ANDAs from Nostrum Laboratories",
            "Summary": "Strides Pharma Science has acquired identified Abbreviated New Drug Applications (ANDAs) from Nostrum Laboratories, Inc., USA for a total consideration of $2.075 million. This acquisition is likely aimed at expanding Strides' product portfolio in the US market.",
            "Sentiment": "positive",
            "PublishDate": 1745932148000,
            "Source": "default"
        },
        {
            "Title": "Strides Pharma Recalls 4.4 Lakh Cartons of Testosterone Gel in US Market",
            "Summary": "Strides Pharma, Inc. is conducting a recall of over 4.4 lakh cartons of Testosterone Gel in the United States market. The recall is due to the presence of a foreign substance in the product. This action is being taken to ensure patient safety and maintain product quality standards.",
            "Sentiment": "negative",
            "PublishDate": 1743984493000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma: Recalls 4.4 Lakh Cartons of Testosterone Gel in US",
            "Summary": "Strides Pharma, Inc is recalling over 440,000 cartons of Testosterone Gel in the US market due to the presence of benzene. The recall includes 195,952 cartons of 1% Testosterone Gel, 2.5 grams, and 244,412 cartons of 1% Testosterone Gel, 5 grams. The Class II recall was initiated on March 5.",
            "Sentiment": "negative",
            "PublishDate": 1743765513000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Science Proposes De-Merger of Arco Lab Business",
            "Summary": "Strides Pharma Science has announced a proposal to de-merge an identified business segment of Arco Lab. This corporate action suggests a strategic restructuring of the company's operations, potentially aimed at optimizing business focus or unlocking value for shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1742365154000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Science Unit to Acquire Amexel Pte. Ltd. for Southeast Asian Expansion",
            "Summary": "A subsidiary of Strides Pharma Science has proposed to acquire a 100% stake in Amexel Pte. Ltd. This move is part of a strategy to create a business platform in Southeast Asia, indicating the company's intentions to expand its presence in the region.",
            "Sentiment": "positive",
            "PublishDate": 1742170247000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Science Subsidiary to Acquire Amexel and Expand in Southeast Asia",
            "Summary": "A subsidiary of Strides Pharma Science has proposed to acquire a 100% stake in Amexel Pte. Ltd. This move is part of a strategy to create a business platform in Southeast Asia, potentially expanding the company's presence in the region.",
            "Sentiment": "positive",
            "PublishDate": 1741958189000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Aims for Debt Reduction and Revenue Growth",
            "Summary": "Strides Pharma has set financial targets for debt reduction and revenue growth. The company expects to achieve a debt-to-EBITDA ratio of under 2 and is on track to meet this goal. Additionally, Strides Pharma anticipates a year-on-year revenue growth of 12% to 15%, having already achieved 17.3% growth.",
            "Sentiment": "positive",
            "PublishDate": 1738294113000,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Science Reports Strong US Business Growth",
            "Summary": "Strides Pharma Science's US business has shown significant growth, with revenue reaching $214 million, representing a 21.3% year-over-year increase. The company is on track to achieve its post-demerger fiscal year 2025 outlook of $275-$290 million for the US market.",
            "Sentiment": "positive",
            "PublishDate": 1738223953000,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Science Reports Q3 EBITDA and Margin Results",
            "Summary": "Strides Pharma Science has reported its Q3 financial results. The company's EBITDA increased to 2.1 billion rupees from 1.94 billion rupees year-over-year. However, the EBITDA margin slightly decreased to 18.23% from 18.68% compared to the same period last year.",
            "Sentiment": "neutral",
            "PublishDate": 1738223681000,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma Science Reports Significant Profit Growth in Q3",
            "Summary": "Strides Pharma Science has announced its Q3 financial results, showing a substantial increase in consolidated net profit. The company reported a net profit of 880 million rupees, up from 497 million rupees in the same period last year. Revenue also saw growth, rising to 11.54 billion rupees from 10.4 billion rupees year-over-year.",
            "Sentiment": "positive",
            "PublishDate": 1738223649000,
            "Source": "earnings"
        },
        {
            "Title": "Strides Pharma to Consider Q3 Results",
            "Summary": "Strides Pharma has announced that it will consider its third quarter financial results on January 30.",
            "Sentiment": "neutral",
            "PublishDate": 1737726254000,
            "Source": "result"
        },
        {
            "Title": "OneSource Ltd: Strides Pharma Subsidiary Debuts on Stock Exchanges at 6.9% Premium",
            "Summary": "OneSource Ltd, a subsidiary of Strides Pharma Science Ltd, listed on BSE and NSE at Rs 1,800 per share, a 6.9% premium over its pre-open discovery price. The company, a CDMO and soft gelatin business, was spun off from Strides Pharma following NCLT approval in November 2024.",
            "Sentiment": "positive",
            "PublishDate": 1737694346000,
            "Source": "corporate_action"
        },
        {
            "Title": "One Source Receives Final Listing Approval on NSE and BSE",
            "Summary": "One Source, a subsidiary of Strides Pharma Science, has received final listing and trading approval for its equity shares from both the National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) on January 22. This approval marks a significant milestone for the company, allowing its shares to be publicly traded on India's two major stock exchanges.",
            "Sentiment": "positive",
            "PublishDate": 1737610616000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Receives FDA Approval for New OTC Pain Relief Medication",
            "Summary": "Strides Pharma has obtained approval from the U.S. Food and Drug Administration (FDA) for Acetaminophen and Ibuprofen tablets in a 125 mg / 250 mg combination. This approval expands the company's existing over-the-counter (OTC) product portfolio, potentially strengthening its position in the pain relief medication market.",
            "Sentiment": "positive",
            "PublishDate": 1737364951000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Completes Share Allotment Under Scheme of Arrangement",
            "Summary": "Strides Pharma has completed the allotment of equity shares to its shareholders as part of a scheme of arrangement. Under this scheme, Onesource has allotted one equity share of Re. 1 each for every two equity shares of Rs. 10 held by Strides' shareholders.",
            "Sentiment": "neutral",
            "PublishDate": 1733928067000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Science Ltd Raises $95 Million Through OneSource",
            "Summary": "Strides Pharma Science Ltd has successfully completed a fund-raising initiative, securing $95 million through OneSource. This significant financial development indicates a strategic move by the pharmaceutical company to bolster its resources, potentially for expansion, research and development, or other corporate objectives.",
            "Sentiment": "positive",
            "PublishDate": 1732523472000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Science Receives NCLT Approval for OneSource Creation",
            "Summary": "Strides Pharma Science has announced that it has received approval from the National Company Law Tribunal (NCLT) for the creation of OneSource. Following this approval, OneSource will proceed with listing its shares on the stock exchange.",
            "Sentiment": "positive",
            "PublishDate": 1732015644000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Science Subsidiary Acquires Full Ownership of Swiss Unit",
            "Summary": "Strides Pharma Science's subsidiary, SPG, has acquired the remaining stake in Strides Switzerland for 1.01 million Swiss Francs (CHF). This move suggests a strategic consolidation of the company's international operations.",
            "Sentiment": "neutral",
            "PublishDate": 1729857868000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma: Maintains $400M US Revenue Target",
            "Summary": "Strides Pharma reaffirms its guidance of $400 million in US revenue for the next couple of years.",
            "Sentiment": "neutral",
            "PublishDate": 1729855429000,
            "Source": "normal_news"
        },
        {
            "Title": "Strides Pharma Prepares for SEMA Launch with Promising Outlook",
            "Summary": "Strides Pharma is gearing up to launch SEMA, with customer capacity bookings starting as early as August next year. The company has outlined a three to five-year product commercialization timeframe, during which they anticipate significant R&D income.",
            "Sentiment": "positive",
            "PublishDate": 1729827814000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Aims for Significant EBITDA Growth",
            "Summary": "Strides Pharma has announced its focus on margin expansion during a recent conference call. The company has set an ambitious goal to achieve an EBITDA of USD 350 million to USD 400 million within the next three to four years.",
            "Sentiment": "positive",
            "PublishDate": 1729827762000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Targets Significant Revenue Growth",
            "Summary": "Strides Pharma has announced ambitious revenue targets during a recent conference call. The company expects to achieve an annualized exit run rate of $80 million in its current business. Looking ahead, Strides Pharma is projecting revenues of $300 million to $400 million over the next three to four years.",
            "Sentiment": "positive",
            "PublishDate": 1729827610000,
            "Source": "corporate_action"
        },
        {
            "Title": "Strides Pharma Science Reports Strong Q2FY25 US Revenue Growth",
            "Summary": "Strides Pharma Science has announced record-breaking US revenues of $75 million for the second quarter of fiscal year 2025. This represents a significant year-over-year growth of 26.2%, marking a historic high for the company's US market performance.",
            "Sentiment": "positive",
            "PublishDate": 1729756393000,
            "Source": "result"
        },
        {
            "Title": "Strides Pharma Science Reports Strong Q2 Performance",
            "Summary": "Strides Pharma Science has announced its Q2 financial results, showing significant year-over-year improvements. The company's EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) increased to 2.35 billion rupees from 1.53 billion rupees in the same quarter last year. Additionally, the EBITDA margin expanded to 19.62% from 15.33% year-over-year, indicating improved operational efficiency.",
            "Sentiment": "positive",
            "PublishDate": 1729756373000,
            "Source": "result"
        }
    ]
}