{
    "Symbol": "STCINDIA",
    "ISIN": "INE655A01013",
    "News": [
        {
            "Title": "STC Reports Rs 63,561.52 Lacs Profit for Nine Months",
            "Summary": "State Trading Corporation of India posts significant profit of Rs 63,561.52 lacs for nine months ended December 31, 2025, driven by one-time settlement with lenders and exceptional items totaling Rs 60,621.16 lacs.",
            "Sentiment": "positive",
            "PublishDate": 1770820993566,
            "Source": "co_actions_results"
        },
        {
            "Title": "STC India Appoints New Government Nominee Director",
            "Summary": "State Trading Corporation of India Limited announces appointment of Shri Asit Gopal as Government Nominee Director on the Board with immediate effect under SEBI regulations.",
            "Sentiment": "neutral",
            "PublishDate": 1768906723132,
            "Source": "stocks"
        },
        {
            "Title": "STC Appoints AKM Kashyap as Government Nominee Director",
            "Summary": "State Trading Corporation of India appoints Shri AKM Kashyap, Deputy Director General (QA) from Department of Commerce, as Additional Director with immediate effect from December 15, 2025.",
            "Sentiment": "neutral",
            "PublishDate": 1766556154766,
            "Source": "stocks"
        },
        {
            "Title": "STC India Fined ₹3.54L for Q2FY26 Results Delay",
            "Summary": "State Trading Corporation of India receives regulatory fines totaling ₹3.54 lakh from BSE and NSE for non-compliance with quarterly financial results submission requirements for Q2FY26.",
            "Sentiment": "negative",
            "PublishDate": 1765956892218,
            "Source": "stocks"
        },
        {
            "Title": "STC India Fined ₹12.06 Lakh by NSE for Board Composition Non-Compliance",
            "Summary": "The State Trading Corporation of India received a fine of ₹12,05,960 from NSE for failing to maintain the required number of Independent Directors on its Board during the quarter ended September 30, 2025. The penalty was imposed for non-compliance with multiple SEBI LODR regulations related to board composition and governance requirements.",
            "Sentiment": "negative",
            "PublishDate": 1764348144055,
            "Source": "corporate_governance"
        },
        {
            "Title": "State Trading Corporation of India Appoints New Government Nominee Director",
            "Summary": "The State Trading Corporation of India Limited has announced the appointment of Shri AKM Kashyap, Deputy Director General (QA) from the Department of Commerce, Ministry of Commerce and Industry, as Government Nominee Director on its Board with immediate effect. The appointment follows an order from the Department of Commerce dated November 25, 2025, and will be effective after completion of requisite formalities.",
            "Sentiment": "neutral",
            "PublishDate": 1764136469841,
            "Source": "corporate_governance"
        },
        {
            "Title": "STC Limited Delays Financial Results Submission Due to Subsidiary Issues",
            "Summary": "The State Trading Corporation of India Limited announced a delay in submitting its financial results for the quarter ended June 30, 2025. The delay is attributed to non-receipt of financial results from its subsidiary company, STCL Limited. The company stated that the date for the Board Meeting to consider the quarterly financial results will be communicated in due course. The announcement was made by Company Secretary & Compliance Officer Vipin Tripathi on August 13, 2025.",
            "Sentiment": "negative",
            "PublishDate": 1755078358823,
            "Source": "stock"
        },
        {
            "Title": "State Trading Corp of India Reports Q4 Net Profit of 35M Rupees",
            "Summary": "State Trading Corporation of India has reported a net profit of 35 million rupees for the fourth quarter, compared to 145 million rupees in the same quarter of the previous year. This represents a year-over-year decrease in profit.",
            "Sentiment": "negative",
            "PublishDate": 1749807740000,
            "Source": "result"
        }
    ]
}