{
    "Symbol": "STEELCAS",
    "ISIN": "INE124E01038",
    "News": [
        {
            "Title": "Steelcast Q3 FY26 Results: Revenue at ₹9,740 Lakhs",
            "Summary": "Steelcast Limited reported Q3 FY26 net sales of ₹9,740.12 lakhs and net profit of ₹2,058.58 lakhs. Board declared third interim dividend of ₹0.45 per share.",
            "Sentiment": "positive",
            "PublishDate": 1769773000494,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steelcast Board Meet on Jan 30 for Q3 Results",
            "Summary": "Steelcast Limited has scheduled its 293rd board meeting for January 30, 2026, to consider Q3FY26 unaudited financial results and declare third interim dividend with record date February 6, 2026.",
            "Sentiment": "neutral",
            "PublishDate": 1768965980387,
            "Source": "co_actions_results"
        },
        {
            "Title": "Steelcast Limited Reports 42% Revenue Growth in Q2FY26 Despite US Tariff Challenges",
            "Summary": "Steelcast Limited reported strong quarterly results with revenue from operations growing 42% to ₹106.7 crore in Q2FY26 compared to ₹75.4 crore in Q2FY25. EBITDA increased 62% to ₹34.2 crore with margins expanding to 32.0% from 28.0%. PAT grew 75% to ₹23.2 crore with margins improving to 21.8%. The company expects softer Q3 performance due to geopolitical uncertainties and US tariff disruptions affecting export markets. Management revised FY26 growth guidance from 18-20% to double-digit growth around 12% due to tariff-related challenges. US sales contribute 30% of total revenue. The company maintains cost advantages of 5-13% over Chinese competitors across key product categories. Domestic sales contributed 36% while exports accounted for 64% of revenue. Management projects 20% CAGR growth over the next three years and expects to reach ₹1,000 crore revenue by FY29. Current order book stands at ₹108 crore with capacity utilization at 48%.",
            "Sentiment": "positive",
            "PublishDate": 1762454365751,
            "Source": "earnings"
        },
        {
            "Title": "Steelcast Reports 74% Jump in Q2 Net Profit to 232.1 Million Rupees",
            "Summary": "Steelcast reported strong quarterly results with net profit rising to 232.1 million rupees from 133 million rupees year-on-year. Revenue increased to 1.07 billion rupees compared to 754 million rupees in the same period last year. EBITDA grew to 302.1 million rupees from 190.2 million rupees, while EBITDA margin improved to 28.33% from 25.25% year-on-year.",
            "Sentiment": "positive",
            "PublishDate": 1762129235715,
            "Source": "earnings"
        },
        {
            "Title": "Steelcast Targets Revenue Growth Through Product Diversification and Export Expansion",
            "Summary": "Steelcast is pursuing consistent revenue and margin growth through a multi-pronged strategy involving product diversification, capacity utilization, and export expansion. The company is capitalizing on rising global demand from mining, defense, and rail OEMs. Key initiatives include expanding its customer base, optimizing production costs, and enhancing automation to strengthen profitability and competitiveness.",
            "Sentiment": "positive",
            "PublishDate": 1761918274829,
            "Source": "stock"
        },
        {
            "Title": "Steelcast Limited Reports Strong Q2FY26 Results with 42% Revenue Growth",
            "Summary": "Steelcast Limited reported revenue of Rs 106.7 crore in Q2FY26, marking a 42% increase from Rs 75.4 crore in Q2FY25. EBITDA rose 62% to Rs 34.2 crore, while PAT surged 75% to Rs 23.2 crore. For H1FY26, revenue reached Rs 213.3 crore (40% growth), EBITDA was Rs 64.2 crore (53% growth), and PAT stood at Rs 43.1 crore (64% growth). The company attributed the improved performance to surge in export market demand and enhanced operational efficiency. Export sales comprised 59% of H1FY26 revenue compared to 53% in H1FY25. The company plans to commission a 2.4MW hybrid power plant by June 30, 2026, expected to generate annual savings of Rs 3.5-4 crore. Steelcast operates with 65 years of manufacturing experience, serves 9 sectors, and maintains 80% captive power supply with a 29,000 TPA capacity.",
            "Sentiment": "positive",
            "PublishDate": 1761915733955,
            "Source": "earnings"
        },
        {
            "Title": "Steelcast Reports Strong Q2 Performance with 74% Jump in Net Profit",
            "Summary": "Steelcast reported quarterly net profit of 232.1 million rupees compared to 133 million rupees in the same period last year. Revenue increased to 1.07 billion rupees from 754 million rupees year-over-year. EBITDA rose to 302.1 million rupees from 190.2 million rupees, while EBITDA margin improved to 28.33% from 25.25%.",
            "Sentiment": "positive",
            "PublishDate": 1761907994321,
            "Source": "earnings"
        },
        {
            "Title": "Steelcast Limited Schedules Analyst Call to Discuss Q2FY26 Financial Results",
            "Summary": "Steelcast Limited has scheduled an analyst and institutional investor call for October 31, 2025, at 6:00 PM IST to discuss the company's unaudited financial results for the quarter and half year ended September 30, 2025. The call will be attended by key management including Chairman & Managing Director Chetan Tamboli, Whole Time Director Rushil Tamboli, Executive Director & CFO Subhash Sharma, and Company Secretary Umesh Bhatt. The company will also submit an analyst presentation to stock exchanges and host it on their website. Steelcast Limited manufactures steel and alloy steel castings for various industry sectors including earth moving, mining, steel plants, cement, power, and general engineering.",
            "Sentiment": "neutral",
            "PublishDate": 1761654347311,
            "Source": "earnings"
        }
    ]
}